{
  "fuentes": [
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "admin@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "docgirls@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "execdirector@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "jniehoff@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "mwaite@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "office@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "pratty@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "rsniegoski@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "soccer@beachfc.com"
    },
    {
      "url": "https://www.devlinsonline.com.au/pages/contact-us",
      "email": "admin@devlinsonline.com.au"
    },
    {
      "url": "https://www.neptune.com/pages/contact",
      "email": "bookings@neptune.com"
    },
    {
      "url": "https://www.neptune.com/pages/contact",
      "email": "contractservices@neptune.com"
    },
    {
      "url": "https://www.neptune.com/pages/contact",
      "email": "customerexperience@neptune.com"
    },
    {
      "url": "https://www.neptune.com/pages/contact",
      "email": "info@neptune.com"
    },
    {
      "url": "https://www.neptune.com/pages/contact",
      "email": "pr@neptune.com"
    },
    {
      "url": "https://www.neptune.com/pages/contact",
      "email": "tradeservices@neptune.com"
    },
    {
      "url": "https://cigarinc.com/pages/about-us",
      "email": "info@cigarinc.com"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "email": "ckilday@destinationnmb.com"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "email": "clynam@destinationnmb.com"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "email": "egraham@destinationnmb.com"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "email": "eking@destinationnmb.com"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "email": "info@northmyrtlebeachchamber.com"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "email": "lwallace@destinationnmb.com"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "email": "pedge@destinationnmb.com"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "email": "whubert@destinationnmb.com"
    },
    {
      "url": "https://neptunewinesliquors.com/ContactUs.asp",
      "email": "rah@neptunewinesliquors.com"
    }
  ],
  "mails": [
    "admin@beachfc.com",
    "admin@devlinsonline.com.au",
    "bookings@neptune.com",
    "ckilday@destinationnmb.com",
    "clynam@destinationnmb.com",
    "contractservices@neptune.com",
    "customerexperience@neptune.com",
    "docgirls@beachfc.com",
    "egraham@destinationnmb.com",
    "eking@destinationnmb.com",
    "execdirector@beachfc.com",
    "info@cigarinc.com",
    "info@neptune.com",
    "info@northmyrtlebeachchamber.com",
    "jniehoff@beachfc.com",
    "lwallace@destinationnmb.com",
    "mwaite@beachfc.com",
    "office@beachfc.com",
    "pedge@destinationnmb.com",
    "pr@neptune.com",
    "pratty@beachfc.com",
    "rah@neptunewinesliquors.com",
    "rsniegoski@beachfc.com",
    "soccer@beachfc.com",
    "tradeservices@neptune.com",
    "whubert@destinationnmb.com"
  ],
  "nombre_sitio": "neptunedelraybeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "text": "Beach FC | Beach FC Staff Christine Crews Administrator EMAIL Tammy Renshaw Administrator EMAIL Karl Greaves ECNL Girls Director EMAIL Jason Niehoff Director, Advanced & Recreation EMAIL Wayne Pratt ECRL & NPL Director of Player Development Travel Boys U9-U14 EMAIL Ryan Sniegoski ECNL Boys Director Travel Boys U15-U19 EMAIL Mark Waite Director Soccer & Futsal EMAIL Steve Danbusky Executive Director Email Dennis Blackmore Tournament Director Columbus Day, Spring Classic EMAIL Proud Members Of Address Beach FC 3052 Buckner Blvd Virginia Beach, Virginia 23453 Phone: 757-689-3352 Contact Us Phone/Email Phone: 757-689-3352 Contact Us © Beach FC. All rights reserved. © Demosphere International, Inc. All rights reserved."
    },
    {
      "url": "https://www.devlinsonline.com.au/pages/contact-us",
      "text": "Contact Us | Devlins – Devlin's You must be over 18 to shop here. Devlin's Online is used to buy cigars online. To enter this site you must be over 18. Confirm your date of birth below to enter. Enter or Exit Gifts Cufflinks Pens Ties Scarves Shaving Equipment Whiskey Decanter Set Gift Selector Wine Glasses Red Wine White Wine Stemless Shiraz Glasses Sauvignon Blanc Glasses Hand Made Sommelier Series Decanters Every Day Glasses All Wine Glasses Gift Sets Bar Glasses Tumblers Decanters Spirits Glasses Beer Glasses All Bar Glasses Single Malt Whiskey Glass Gift Sets Cigar Accessories Cutters Lighters Leather Carry Cases Travel Humidors All Cigar Accessories Gift Sets CIGARS NICARAGUA CUBAN MIXED PACKS DOMINICANS Wallets Leather Wallets Slim Wallets Card Only Wallets Notes & Card Wallets RFID Blocking Wallets Passport Wallets All Wallets Humidification Humidors Humidification Liquid Hygrometers Humidifiers Boveda Packs Xikar Humidification Pens Rollerball Fountain Pens Ball Point Refills & Ink Leather Journals All Pens Gift Sets Brands Bellroy Lamy Montegrappa Peterson Prometheus Riedel ST Dupont Xikar Join the Fine Life Society Charitable Giving The Devlin's Story Looking for Cigars? Log In Create Account 1300 388 830 Contact Us 0 20,000+ Customers since 1997 Search Free Shipping for orders over $100 Email Tracking on all orders Free Gift Wrapping on all orders Currency: AUD AUD USD EUR GBP Create Account Log In Cart ( 0 ) Gifts Cufflinks Pens Ties Scarves Shaving Equipment Whiskey Decanter Set Gift Selector Wine Glasses Red Wine White Wine Stemless Shiraz Glasses Sauvignon Blanc Glasses Hand Made Sommelier Series Decanters Every Day Glasses All Wine Glasses Gift Sets Bar Glasses Tumblers Decanters Spirits Glasses Beer Glasses All Bar Glasses Single Malt Whiskey Glass Gift Sets Cigar Accessories Cutters Lighters Leather Carry Cases Travel Humidors All Cigar Accessories Gift Sets CIGARS NICARAGUA CUBAN MIXED PACKS DOMINICANS Wallets Leather Wallets Slim Wallets Card Only Wallets Notes & Card Wallets RFID Blocking Wallets Passport Wallets All Wallets Humidification Humidors Humidification Liquid Hygrometers Humidifiers Boveda Packs Xikar Humidification Pens Rollerball Fountain Pens Ball Point Refills & Ink Leather Journals All Pens Gift Sets Brands Bellroy Lamy Montegrappa Peterson Prometheus Riedel ST Dupont Xikar Join the Fine Life Society Please fill out this form below to contact us via email... First Name * Mobile Number * Email * How Can We Help? * Send My Enquiry Need to contact us about an order? Got a question about a product? Our team are here to help. You can reach us on 1300 3888 30 Monday – Saturday 10am – 8pm, Sunday Midday – 5pm or via email to admin@devlinsonline.com.au . If your question is regarding an order you’ve placed you can also reply to any of the confirmation emails and someone will get back to you asap. EXPLORE THE RANGE 1300 3888 30 Our Address 411 Hay St. Subiaco, WA, 6008 (Monday - Saturday 10am-8pm & Sunday 12pm - 5pm) JOIN THE FINE LIFE SOCIETY Receive special offers and curated content straight to your inbox twice a week, on Tuesdays and Thursdays Subscribe Now INSTAGRAM Hash #Finelifesociety to be featured Devlin's are pleased to be a member of the International Premium Cigar and Pipe Retailers Association \n(the IPCPR) The International Premium Cigar & Pipe Retailers Association represents Cigar and Pipe retailers who maintain a physical location. As the oldest, largest and most active trade association representing and assisting retail tobacconists represents members throughout the world. Our Happy Customers JOIN THE FINE LIFE SOCIETY Receive special offers and curated content straight to your inbox twice a week, on Tuesdays and Thursdays Subscribe Now INSTAGRAM Hash #Finelifesociety to be featured Devlin's are pleased to be a member of the International Premium Cigar and Pipe Retailers Association \n(the IPCPR) The International Premium Cigar & Pipe Retailers Association represents Cigar and Pipe retailers who maintain a physical location. As the oldest, largest and most active trade association representing and assisting retail tobacconists represents members throughout the world. Gifts Wine Glasses Bar Glasses Cigar Accessories CIGARS Wallets Humidification Pens Brands Join the Fine Life Society Charitable Giving The Devlin's Story Log In Create Account 1300 388 830 Contact Us 411 Hay St Subiaco, WA, 6008 (Monday - Saturday 10am-8pm Sunday 12pm - 5pm) 1300 388 830 facebook.com/devlinsonline Instagram @devlinsonline © 2025 Devlin's Online | Refund Policy | Terms & Conditions | Privacy Policy × Sample Product Add to cart × How Can We Help? First Name * Mobile Number Email * How Can We Help? * Send My Enquiry × Enter your keyword Search"
    },
    {
      "url": "https://www.neptune.com/pages/contact",
      "text": "Contact\n– Neptune Our new autumn collection is here | Explore the designs Save £250 for every £2,500 you spend on upholstery Delivered in time for Christmas | Purchase made-to-order upholstery by 21st September Trustpilot Shop New Furniture Dining Tables Chairs & benches Bar stools Dressers Sideboards Living Sofas Armchairs Footstools Coffee tables Side tables Console tables Freestanding kitchen furniture Kitchen islands Larder cupboards Prep stations Kitchen dressers Storage furniture Bookcases & shelving Desks & workstations Media cabinets Dressers Bedroom Beds & headboards Bedside tables Dressing tables Chests of drawers Wardrobes Mattresses Garden Garden dining sets Garden sofas & sets Garden seating Garden tables Parasols & bases Outdoor living Bathroom Cabinetry Taps & accessories Archive Garden furniture Furniture Sofas & upholstered furniture . Ready to deliver furniture Save £250 for every £2,500 you spend on upholstery Accessories Tabletop Tableware Glassware & barware Place settings Table linen Serveware Kitchen accessories Storage Baskets Trays, boxes & jars Coat racks Home accessories Ornaments Photo frames Pots & planters Vases & jugs Faux flowers Candles & fragrance Candles Candle holders Diffusers Bath & body Wall hangings Mirrors & clocks Wall art Lighting Table lamps Floor lamps Lampshades Fitted lighting Decorative lighting Textiles Scatter cushions Throws Rugs & runners Table linen Bed linen Outdoor cushions Fabric by the metre Archive Home decor Tabletop Lighting Textiles Candles & fragrance . Gift cards Three beautiful kitchens, endless possibilities | Book a free design appointment today Finishes & fixtures Fitted lighting Pendants & ceiling lights Wall lights Outdoor lights Light bulbs Paint Interior paint Timber treatments Paint samples Fabric Fabric samples Fabric by the metre Cushions & covers Outdoor cushions Surfaces Flooring Wall coverings Floor tiles Wall tiles Hardware Handles & hardware Bathroom taps & accessories Cabinet organisers Three beautiful kitchens, endless possibilities | Book a free design appointment today Kitchen Cabinetry Neptune kitchens - Suffolk - Henley - Chichester Laundry cabinets FreeStanding Islands Larders Prep stations Dressers Kitchen details Kitchen accessories Worktops Appliances Handles & hardware Wallcoverings & tiles Sinks & taps Cabinet organisers Design service How it works Kitchen cost estimator Free design consultation Inspiration Case studies Kitchen philosophy Three beautiful kitchens, endless possibilities | Book a free design appointment today Why Neptune? About us Why Neptune? Our history Lifetime guarantee Sustainability Neptune kitchens Inspiration Case studies Stories magazine Three beautiful kitchens, endless possibilities | Book a free design appointment today Stores Stores Find your nearest store About our stores In-store design services Kitchen design Design schemes Interior design Curtains & blinds Free design consultation Trade enquiries Three beautiful kitchens, endless possibilities | Book a free design appointment today Inspiration Shop New Furniture Accessories Finishes & fixtures Kitchen Why Neptune? Stores Inspiration Search Clear 0 Search Clear Shop New Furniture Accessories Finishes & fixtures Kitchen Why Neptune? Stores Inspiration Basket Recently Viewed - You are unable to amend, cancel or return made to order and painted to order designs. Read our full terms and conditions for more information. Subtotal $-.-- Shipping calculated at checkout. View full basket Checkout To donate to Stump Up For Trees, view full basket. Search Currency Currency France (EUR €) Germany (EUR €) Guernsey (GBP £) Ireland (EUR €) Isle of Man (GBP £) Jersey (GBP £) United Kingdom (GBP £) New Furniture Furniture Dining Dining Tables Chairs & benches Bar stools Dressers Sideboards View all dining furniture Living Living Sofas Armchairs Footstools Coffee tables Side tables Console tables View all living room furniture Freestanding kitchen furniture Freestanding kitchen furniture Kitchen islands Larder cupboards Prep stations Kitchen dressers View all freestanding kitchen furniture Storage furniture Storage furniture Bookcases & shelving Desks & workstations Media cabinets Dressers View all storage furniture Bedroom Bedroom Beds & headboards Bedside tables Dressing tables Chests of drawers Wardrobes Mattresses View all bedroom furniture Garden Garden Garden dining sets Garden sofas & sets Garden seating Garden tables Parasols & bases Outdoor living View all garden Bathroom Bathroom Cabinetry Taps & accessories View all bathroom furniture Ready to deliver Ready to deliver Furniture Archive Archive Archived garden furniture Archived furniture Sofas & upholstered furniture View all archive View all furniture Accessories Accessories Tabletop Tabletop Tableware Glassware & barware Place settings Table linen Serveware Kitchen accessories View all tabletop Storage Storage Baskets Trays, boxes & jars Coat Racks View all storage Home accessories Home accessories Ornaments Photo frames Pots & planters Vases & jugs Faux flowers View all home accessories Candles & fragrance Candles & fragrance Candles Candle holders Diffusers Bath & body View all candles & fragrance Wall hangings Wall hangings Mirrors & clocks Wall art View all wall hangings Lighting Lighting Table lamps Floor lamps Lampshades Fitted lighting Decorative lighting View all lighting Textiles Textiles Scatter cushions Throws Rugs & runners Table linen Bed linen Cushions & covers Outdoor cushions Fabric by the metre View all textiles Gifting Gifting Gifts under £50 Gifts under £100 Extra-special gifts Gift cards Archive Archive Archived home decor Archived tabletop Archived lighting Archived textiles Archived candles & fragrance View all archive View all accessories Finishes & fixtures Finishes & fixtures Fitted lighting Fitted lighting Pendant & ceiling lights Wall lights Outdoor lights Light bulbs View all fitted lighting Paint Paint Interior paint Timber treatments Paint samples View all paint Surfaces Surfaces Flooring Wall coverings Floor tiles Wall tiles View all surfaces Hardware Hardware Handles & hardware Bathroom taps & accessories Cabinet organisers Sinks & taps View all hardware View all finishes & fixtures Kitchen Kitchen Cabinetry Cabinetry Neptune kitchens - Suffolk - Henley - Chichester Laundry cabinets Freestanding Freestanding Islands Larders Prep stations Dressers View all freestanding kitchen furniture Kitchen details Kitchen details Kitchen accessories Worktops Appliances Handles & hardware Wallcoverings & tiles Sinks & taps Cabinet organisers Design service Design service How it works Kitchen cost estimator Free design consultation Inspiration Inspiration Case studies Kitchen Philosophy Stores Stores Find your nearest store In-store design services In-store design services Kitchen design Design schemes Interior design Curtains & blinds Free design consultation Trade enquiries Inspiration Why Neptune? Why Neptune? About us About us Why Neptune? Our history Lifetime guarantee Sustainability Neptune kitchens Inspiration Inspiration Case studies Stories magazine Thoughtful design, built to last a lifetime. Contact us Login / Register Get in touch Your local Neptune store should be your main point of contact, either in person, over the phone, or by email. Find your nearest store here . Alternatively, fill out our contact form below and we'll get back to you as soon as possible. You can also phone or email our customer experience team directly using the details below. Check the status of an existing order and find its delivery tracking information here . Support Office Neptune (Europe) Ltd Blagrove, Swindon, Wiltshire, SN5 8YG, United Kingdom Customer Experience 01793 934 011 Monday to Friday (8am-6pm), Saturday (9am-5:30pm), Sunday (10am-4pm) customerexperience@neptune.com Support Office Reception 01793 427 300 Monday to Friday (8:30am-5pm) info@neptune.com Home Delivery Bookings Team 01793 934 004 Monday to Friday (8am-6pm) bookings@neptune.com Trade & Contract Enquiries 01793 427 319 Trade: tradeservices@neptune.com Contract: contractservices@neptune.com Monday to Friday: 9am to 5pm Saturday:  Closed Sunday: Closed Media Enquires For general press enquiries, press releases, image requests and product loans, please contact our PR & Partnerships team. pr@neptune.com Why Neptune Our philosophy History Our stores Lifetime guarantee Sustainability Gender pay Modern slavery Your Order Delivery & returns Track your order Care guides Gift cards Trade The Outlet Inspiration Stories Case studies Guides Brochures Fabric samples Paint samples The Wedding Shop Stay in touch Contact us Find a store Book a design service Login Kitchen cost calculator Careers Newsletter For expert insights, inspiring customer stories and the latest product launches. Email address Subscribe Currency United Kingdom (GBP £) France (EUR €) Germany (EUR €) Ireland (EUR €) United Kingdom (GBP £) Terms & conditions Cookie policy Privacy policy © All Rights Reserved 2025 · Neptune Europe Ltd Availability"
    },
    {
      "url": "https://cigarinc.com/pages/about-us",
      "text": "About Cigar Inc. | Your Source for Premium Cigars & Luxury Accessories Skip to content Enjoy Free Shipping on Orders of Cigars Over $75.   Questions? Call us at 818-719-9885 icon-X Close menu Cigars All Cigars Best Selling Cigars Cigar Inc. New Arrival Top 25 Cigars by Cigar Aficionado Cigar Companies Cigar Finder Cigar Accessories All Cigar Accessories Humidors All Humidors Electronic Humidors Desktop Humidors Travel Cases & Tubes Humidor Accessories Shop by Brand Raching Humidors Afidano Humidors El-Septimo Humidors Lighters Cutters Travel Cases & Tubes Punches Ashtrays Sets Lifestyle Shop by Brand Maccarrone Brizard and Co. El-Septimo Special Deals Blog Cigar Inc. Podcast Who We Are About Us Contact Log in instagram Instagram Facebook YouTube X Cart icon-X Close cart Subtotal $0.00 Shipping, taxes, and discount codes calculated at checkout. Check out Your cart is currently empty. Cigars All Cigars Best Selling Cigars Cigar Inc. New Arrival Top 25 Cigars by Cigar Aficionado Cigar Companies Cigar Finder Cigar Accessories All Cigar Accessories Humidors All Humidors Electronic Humidors Desktop Humidors Travel Cases & Tubes Humidor Accessories Shop by Brand Raching Humidors Afidano Humidors El-Septimo Humidors Lighters Cutters Travel Cases & Tubes Punches Ashtrays Sets Lifestyle Shop by Brand Maccarrone Brizard and Co. El-Septimo Special Deals Blog Cigar Inc. Podcast Who We Are About Us Contact account Log in icon-search Search icon-hamburger Site navigation icon-bag-minimal Cart Search Search Cigar Inc. Premium Cigars and Luxury Accessories Watch About Us Welcome to Cigar Inc. — Where Luxury Meets Legacy At Cigar Inc., we are proud to be a premier distributor of premium cigars and high-end cigar accessories , serving discerning enthusiasts across the globe. Headquartered in Los Angeles, we offer both a luxurious retail experience and a seamless online store tailored to the needs of aficionados who demand the best. We curate only the finest cigars from prestigious brands, featuring rare blends, limited editions, and collector-grade releases. Our exclusive accessories include handcrafted humidors , precision cutters, and luxury lighters—each designed to elevate your smoking experience. Cigar Inc. is also a U.S. distributor of select collections in collaboration with iconic names like El Septimo, Brizard & Co., and Lucky Cigar . With deep industry relationships and trusted partnerships, we bring exceptional craftsmanship and exclusivity directly to your humidor. Whether you're purchasing for your private collection, preparing for a special event, or gifting a true connoisseur, Cigar Inc. delivers a standard of quality worthy of the moment. Visit our Los Angeles showroom or shop online at www.cigarinc.com . Experience the world of premium cigars—crafted for those who expect nothing less than luxury. Contact Us Mon-Fri, 9:30 am. - 5:30 pm: 📞 Tel: 1 818-719-9885 📠 Fax: 1 818-719-9886 📧 Email: Info@Cigarinc.com Contact Us Contact Us Mon-Fri, 9:30 am. - 5:30 pm: 📞 Tel: 1 818-719-9885 📠 Fax: 1 818-719-9886 📧 Email: Info@Cigarinc.com Footer Footer Search Refund Policy & Privacy Policy Terms of Service Sign up and save Sign up and save Subscribe to get special offers, free giveaways, and once-in-a-lifetime deals. Enter your email Subscribe icon-email Subscribe instagram Instagram Facebook YouTube X icon-X \"Close (esc)\" icon-chevron-left icon-X icon-chevron icon-X About Cigar Inc. | Your Source for Premium Cigars & Luxury Accessories"
    },
    {
      "url": "https://www.explorenorthmyrtlebeach.com/chamber/about/bod-team/",
      "text": "Destination North Myrtle Beach - Board of Directors and Staff Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. Skip navigation Skip to main content Business Directory Visitor Info Contact Us Partner Portal Chamber About Board of Directors & Team Strategic Plan Ambassadors Get Involved Chamber Events Committees Programs B.I.G. Series for Leaders Destination Master Plan NMB Chamber Foundation Foundation Board Community Grants State of Series Signature Events Annual Awards Soiree Chair's Lunch Marketing Outlook Summit Partner Benefits Business Directory Affinity Programs Office Depot BlueCross BlueShield Sports Pass Community North Myrtle Beach History Publications Visitors Guide NMB Map NMB Community Resources Guide Community Events Visitor Calendar NMB Christmas Parade Application Join Now Partner Application About Back Get Involved Back Partner Benefits Back Community Back Join Now Back Chamber About Board of Directors & Team Strategic Plan Ambassadors Get Involved Chamber Events Committees Programs B.I.G. Series for Leaders Destination Master Plan NMB Chamber Foundation Foundation Board Community Grants State of Series Signature Events Annual Awards Soiree Chair's Lunch Marketing Outlook Summit Partner Benefits Business Directory Affinity Programs Office Depot BlueCross BlueShield Sports Pass Community North Myrtle Beach History Publications Visitors Guide NMB Map NMB Community Resources Guide Community Events Visitor Calendar NMB Christmas Parade Application Join Now Partner Application About Back Get Involved Back Partner Benefits Back Community Back Join Now Back Business Directory Visitor Info Contact Us Partner Portal Leadership & Team At Destination North Myrtle Beach, strong leadership is at the core of our success. Our organization is guided by a dedicated Board of Directors, made up of local business leaders who are deeply invested in the growth and vitality of our community. Our Board members are elected by our investor/partners through an annual nominations and elections process held each fall. Each Director serves a three-year term beginning in January, with the opportunity to serve up to two consecutive terms. Board members bring valuable perspectives from across industries, helping shape policies and initiatives that support economic growth, community well-being, and sustainable development. For those interested in becoming a member of the Board of Directors, the Duties and Responsibilities and the Conflict of Interest Policy are available for review. Interested in serving on the board? We welcome committed business leaders who share our vision for a stronger, more connected North Myrtle Beach. The Executive Committee is comprised of the officers and committee chairs. 2025 Board of Directors Executive Committee Ben Clyburn Board Chair Condo-World Whitney Prince Vice Chair & Sustainability Committee Chair Boardwalk Billy's Denise Ambuhl Treasurer HTC Gretchen Floyd Immediate Past Chair The Citizens Bank Cheryl Y. Kilday, CDME Secretary, President & CEO Destination North Myrtle Beach Eric Rivenbark Economic Development Committee Chair Coastal Carolina University Morgan Jackson Destination Marketing Committee Chair Duplin Winery Andy Thomas Public Policy & Advocacy Committee Chair Thomas Beach Vacations Corey Richardson Business Development Committee Chair RE/MAX Southern Shores Ex-Officio Board Members Mark Lane NMB Chamber Foundation Board, Board Chair Sand Dollar Media Brandon Cox Destination Master Plan & Momentum Chair Elliott Beach Rentals Board Members Adam Gullidge Alabama Theatre AJ Gohil East Coast Golf Management Beverly Race Greg Norman Australian Grille Cary McLeod Seaside Vacations Jim Eggen Avista Resort Holly Formanek Hampton Inn Harbourgate Jim Hanley Thoroughbreds Chophouse Kelly G. Hughes McLeod Health Kim Kelley Barefoot Landing Matt Gibbons City of North Myrtle Beach - Parks & Recreation Monroe Baldwin Myrtle Beach Tours Tina Hunter The Humane Society of North Myrtle Beach Weston Parker Myrtle Beach Vacation Rentals.com Destination NMB Program Team Cheryl Y. Kilday, CDME President & CEO Email: ckilday@destinationnmb.com Phone: (843) 361-3039 Cheryl Y. Kilday, CDME is a seasoned expert in destination marketing and management, and has dedicated much of her career to membership-based organizations focused on economic and community development.  \r\n\r\nIn addition to her role with Destination North Myrtle Beach, Cheryl oversees the NMB Chamber Foundation, which awards community grants to local nonprofits supporting people in need. \r\n\r\nCheryl serves on the Waccamaw Advisory Board through the South Carolina Department of Employment and Workforce, and sits on the board of the Myrtle Beach Regional Economic Development Corporation. Cheryl actively participates in leadership roles, community engagement, and advocacy through input sessions, boards, and committees and is a graduate of the McLeod Health Foundation Fellows program.  \r\n\r\nHer commitment to the community extends to volunteer work, such as serving on the North Myrtle Beach Sea Turtle Patrol. Cheryl has also led initiatives like the North Myrtle Beach Reusable Campaign and the COVID Recovery Task Force, contributing to regional recovery efforts and sustainability.  \r\n\r\nBefore joining Destination North Myrtle Beach, Cheryl held similar leadership positions with organizations in Oregon, Virginia, and Washington State. She is a Certified Destination Management Executive (CDME) and has led three organizations to earn Destination Management Accreditation, with North Myrtle Beach receiving the designation \"with distinction.\" The organization has also maintained its 5-Star accreditation from the U.S. Chamber of Commerce.  \r\n\r\nHighlights of Cheryl’s career include helping pass legislation to establish a public-private partnership for state tourism marketing in Washington State and serving on the board that created The Journey Through Hallowed Ground National Heritage Area. Cheryl also earned an Emmy Award for a series of history videos—a groundbreaking approach to travel promotion at the time. Currently, she is passionate about advancing the Destination Master Plan in North Myrtle Beach.  \r\n\r\nCheryl is a former board member of Destinations International and a trustee for the Destinations International Travel Foundation, where she continues to serve on committees. She has also contributed her expertise to numerous state and local boards and committees dedicated to community and tourism development. Leslie A. Wallace Advocacy & Business Development Director Email: lwallace@destinationnmb.com Phone: 843-361-3042 Leslie Wallace joined Destination North Myrtle Beach as the Advocacy and Business Development Director, bringing with her more than 20 years of dedicated public service and community engagement. With extensive experience in political campaigns at the local, state, and federal levels, as well as in public interest initiatives, Leslie has built a career on fostering collaboration and driving results.\r\n\r\nIn her previous role with county government, she worked closely with local businesses to advance economic development, strengthen community partnerships, and advocate for policies that support growth and prosperity.\r\n\r\nPassionate about connecting people, ideas, and opportunities, Leslie is committed to championing the interests of North Myrtle Beach’s business community while enhancing its reputation as a premier coastal destination. Outside of work, she enjoys spending time at the beach, perfecting her golf game, and diving into a good book. Her blend of professional expertise and personal appreciation for the coastal lifestyle make her a valuable advocate for the region’s continued success. Erin Graham Marketing Director Email: egraham@destinationnmb.com Phone: (843) 361-3046 Wimberly Hubert Office Administrator Email: whubert@DestinationNMB.com Phone: (843) 361-3045 Elena King Burns Business Development Manager Email: eking@destinationnmb.com Phone: (843) 361-3047 Pierce Edge Digital Communications & CRM Manager Email: pedge@destinationnmb.com Phone: 843-361-3044 Charlene Lynam Visitor Services Coordinator Email: clynam@destinationnmb.com Phone: (843) 281-2662 Subscribe to our Newsletter Stay up-to-date on the latest events, best things to do, and tastiest bites to eat, simply by signing up for our E-Newsletter. Sign Up Order A Community Resource Guide Get the inside scoop on local happenings, events, and more important info with our FREE North Myrtle Beach Community Resource Guide. Order Your Guide Visitor Information Center: 1521 Hwy 17 in North Myrtle Beach Monday - Friday: 10:00 am - 4:00 pm 843) 281-2662 info@northmyrtlebeachchamber.com About Us Contact Media Partners Privacy Policy Sitemap Premier Sponsors © 2025 \tDestination North Myrtle Beach. All Rights Reserved. Accessibility Statement Privacy Policy Cookie Policy Sitemap"
    },
    {
      "url": "https://neptunewinesliquors.com/ContactUs.asp",
      "text": "Neptune Wines and Liquors - Contact Us Skip to main content Toggle navigation HOME WEDDING PACKAGES About Us Terms Contact Us FAQ Barcode Scanner × Scan the barcode.. Barcode successfully scanned! If the barcode can not be scanned, you can enter it manually Show Product Close Barcode Scanner For optimal performance, you must enable the Camera on your device for this website. If you are using an iOS device , you must use the Safari browser. Ok contact First Name E-mail Type your message here... WHERE TO FIND US CONTACT US 8006 Long Beach Blvd, Harvey Cedars, NJ 08008 RAH@NeptuneWinesLiquors.com 609-494-2900 Barcode Scanner × Dear customer, the product you have scanned is not in our store . We are going to redirected you to our contact page where you can make a special order. Ok Neptune Wines and Liquors 8006 Long Beach Blvd  *  Harvey Cedars, NJ 08008 (609) 494-2900  * NeptuneWinesLiquors.com Sun: 10am-6pm    *    Mon. -  Thur: 10am-8pm    *    Fri. - Sat: 10am-9pm Privacy Policy"
    }
  ]
}