{
  "fuentes": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.visitgainesville.com/venue/jimmy-durden-park/",
      "email": "info@visitgainesville.com"
    },
    {
      "url": "https://pattersonpark.com/contactus",
      "email": "friends@pattersonpark.com"
    },
    {
      "url": "https://jimmysfarm.com/about-us/",
      "email": "stuart@beachhutstudio.com"
    }
  ],
  "mails": [
    "friends@pattersonpark.com",
    "info@visitgainesville.com",
    "sales@finewineliquors.com",
    "stuart@beachhutstudio.com"
  ],
  "nombre_sitio": "newberryfl.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.visitgainesville.com/venue/jimmy-durden-park/",
      "text": "Jimmy Durden Park - Visit Gainesville Cookie Settings Close About cookies Essential Analytics Targeting Social media About cookies This control panel describes what kinds of cookies are present on this website and allows you to enable or disable different types of cookies. Cookies are small pieces of text saved by websites to your computer. Cookies are how your computer remembers things you’ve already done on the internet and are an important part of making modern websites work properly. Because cookies may contain information about your browsing habits, some people prefer to turn them off entirely. However, turning off cookies can prevent websites from working the way you expect. Essential cookies These cookies are critical to the functioning of this website and cannot be disabled through this control panel. They don’t contain any information about your identity. They can be disabled through your browser, but doing so could cause some parts of this website to stop working. WordPress wordpress_, wp- Always enabled Analytics cookies These cookies collect information on visitors to our website to help us understand how well our website is working and how to improve it. No vendors are present in this group. Targeting cookies These cookies collect information on your browsing habits to help our advertising partners show you more relevant ads. No vendors are present in this group. Social media cookies These cookies help social media sites understand your likes and dislikes so they can show you more relevant content. They also make it easier to share contents from other websites such as ours to your social media profiles. No vendors are present in this group. Communities University of Florida Blog Meetings & Industry Sports Things To Do Outdoor Recreation Eat & Drink Stay Events MENU SEARCH Things To Do LIVE MUSIC & PERFORMING ARTS FAMILY-FRIENDLY ATTRACTIONS MUSEUMS, GALLERIES & ART WALKS TOURS SHOPPING HISTORY & HERITAGE ITINERARIES ALL ARE WELCOME Outdoor Recreation FRESHWATER SPRINGS PARKS & PLACES HIKING PADDLING TRAILS PICKLEBALL BIRDING HOT SPOTS BIKING GOLF FISHING Eat & Drink RESTAURANTS BREWERIES & WINERIES HOMEGROWN IN ALACHUA COUNTY Stay BED & BREAKFAST Hotels & Lodging RV PARKS & CAMPING VACATION RENTALS Events WHAT’S GOOD.® GUIDE All Events Communities University of Florida Blog Meetings & Industry Sports Loading view. There were no results found. There were no results found. Jimmy Durden Park Events Venues Jimmy Durden Park 26333 SW 4th Ave Newberry , FL 32669 United States Get Directions https://www.newberryfl.gov/parksrec/page/jimmy-durden-park Events at this venue Today Upcoming Upcoming Select date. Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Alachua County Visitors & Convention Bureau 33 N Main St, Gainesville, FL 32601 Toll free: (866) 778-5002 Local: (352) 374-5260 info@visitgainesville.com Facebook Instagram Twitter YouTube LinkedIn #WhyILoveGNV • @visitgainesville About Us Contact Us Press Coverage Routes to Roots Carbon Offset Project Partner and Business Resources Apply for a Grant Submit an Event Submit An RFP Tourism Economic Impacts Media Resources Travel Writers, Bloggers and Photographers Filming in Gainesville Alachua County Community and Travel Resources Emergency Preparedness Accessibility Legal Disclaimers, Public Records & Accessibility Privacy Policy Google Translate Disclaimer © 2025 Visit Gainesville Alachua County, FL"
    },
    {
      "url": "https://pattersonpark.com/contactus",
      "text": "Contact Us — Friends of Patterson Park About Us Our Mission Friends' Staff Board of Directors Job Opportunities Cedar House Vendor Interest Form Privacy Policy Get Involved Donate Volunteer Capital Campaign Commemorative Tree Program Park Patrons Corporate Friends Vehicle Donations Gifts of Stock & Planned Gifts E-Newsletter Contact Us Observatory Docent Page News & Events Park Calendar Park News Programming Concert Series Mueveton + BabyFest Patterson Park BrewFest Winter Lights Día del Niño Wine at Sunset Ongoing Events About Patterson Park Park Landmarks Park FAQ History & Nature Tree Walk Donate Store About Us Our Mission Friends' Staff Board of Directors Job Opportunities Cedar House Vendor Interest Form Privacy Policy Get Involved Donate Volunteer Capital Campaign Commemorative Tree Program Park Patrons Corporate Friends Vehicle Donations Gifts of Stock & Planned Gifts E-Newsletter Contact Us Observatory Docent Page News & Events Park Calendar Park News Programming Concert Series Mueveton + BabyFest Patterson Park BrewFest Winter Lights Día del Niño Wine at Sunset Ongoing Events About Patterson Park Park Landmarks Park FAQ History & Nature Tree Walk Donate Store Contact Us Our Office 27 South Patterson Park Ave Baltimore, MD 21231 410-276-3676 Contact Us Interested in getting involved, or just learning more about park or what the Friends do? We'd love to hear from you! Name * First Name Last Name Email Address * Subject * Message * Thanks for your email! Top ABOUT US GET INVOLVED PARK NEWS LEARN MORE Our Mission Park Landmarks The Friends Donate Ongoing Events Contact Us Newsletter Park Calendar Park Journal Park FAQs History & Nature"
    },
    {
      "url": "https://jimmysfarm.com/about-us/",
      "text": "About us. Jimmy's Farm & WIldlife Park. Jimmy Doherty Skip to content Go to... Farm & Wildlife Park Farm, Animals, Adventure Tickets The Lost Lands of the Tundra Animal Experiences Plan your visit Food & Drink The Barn Restaurant & Coffee House All your Food & Drink options Animals Sponsor an Animal Shops JFWP Christmas Guide Education Education Programme Home Education Activites Birthday Parties Jimmy Doherty Farmer, TV presenter Farming Conservation TV Projects Jimmy’s Podcast JFWP Team Tales from Jimmy’s Farm Go to... Weddings & Corporate Ceremonies & Receptions Weddings Ceremonies & Receptions Wedding Gallery Wedding Accommodation Wedding Brochure Wedding Enquiries Corporate Events Exhibiting Cars There’s more Events, Jobs… Events Coach Parties News & Blog Tales from Jimmy’s Farm Vouchers Careers Toggle Navigation Home Farm & Wildlife Park Tickets The Lost Lands of the Tundra Animal Experiences Plan your visit Food & Drink The Barn Restaurant & Coffee House All your Food & Drink options Animals Sponsor an Animal Shops JFWP Christmas Guide Education Education Programme Home Education Activites Birthday parties Jimmy Doherty Farming, Conservation, TV Projects Jimmy’s Podcast JFWP Team Tales from Jimmy’s Farm Weddings & Corporate Weddings Ceremonies & Receptions Wedding gallery Wedding Accommodation Wedding brochure Wedding enquiries Corporate Events: Team Building & Family Days There’s More Events Coach Parties News & Blog Tickets & Vouchers Careers About Us [email protected] 2025-07-10T13:29:00+01:00 About us Introduction by Jimmy As a zoology graduate and studying for a PHD in entomology (insects), I always had a passion for wildlife and traditional, British farming. I worked at Mole Hall Wildlife Park throughout my teens and gained a vast knowledge of the natural world and its inhabitants. Michaela and I first set eyes on Pannington Hall farm in 2002. At just 24 years of age we dreamt of a full restoration, returning the totally derelict farm back to a fully working, thriving livestock farm. Our vision was to only use traditional, free-range farming methods with 100% traceability, rearing rare and domestic breeds from the UK. We focused initially on the Essex pig with a bloodline so rare it was classed as extinct! In 2003, The Essex Pig Company was born. Creating a small onsite butchery and farm shop, Michaela and I began turning our forest-fledged, free-range pork into premium, rare-breed sausages and bacon. At that time I was also invited to take part in a BBC documentary that followed our escapades and endeavours (‘Jimmy’s Farm’) and soon the farm became a destination for tourists and locals alike. Since then, it’s developed beyond our wildest dreams! Jimmy’s Farm is now home to a wildlife park, restaurant, wedding venue, vegetable and flower gardens, farm shop and wonderful retail concessions. ‘Sharing the Good Life’ encapsulates our belief that the natural world should be accessible and available to all and we hope that you will join us in creating your own wild, imaginative and incredible adventure. From humble beginnings… Jimmy x Tickets Events Membership Reservations Meet the Team Jimmy Doherty, CEO Michaela Doherty, Managing Director Stevie Sheppard , Park Director The Executive Team Sophie Ryder , Head of Animal Operations Gemma Marriage , Head of Land and Native Conservation Kirsty Dupée , Head of Commercial Operations Sharon Scott, Head of Finance Lauren Dodman , Head of Visitor Experience Gary Hamblion, Head of Maintenance Behind everything we do is an exceptional team. None of our success would be possible without the passion, dedication and expertise of the incredible staff who bring our mission to life every single day. Whether caring for animals, welcoming guests, growing produce, or supporting operations behind the scenes, Team Jimmys is the heart and soul of everything we do. For press enquiries please email [email protected] Jimmy’s Farm & Wildlife Park News Hope Announcement Gallery Hope Announcement We are deeply saddened to announce the loss of Hope, our much-loved polar bear, who passed away following a vital dental procedure. Our Bear Rescue Story Hits the Screen! Gallery Our Bear Rescue Story Hits the Screen! We’re beyond thrilled to share that our incredible bear rescue journey is now being told on national television! A New Entrance with Purpose Gallery A New Entrance with Purpose We have recently installed a newly landscaped entrance to our park, which embodies our future role in UK conservation. Brown Bears Wake Up in Time for Easter Fun Gallery Brown Bears Wake Up in Time for Easter Fun Beloved brown bears, Diego and Brunhilda, have emerged from their winter torpor. Refreshed, curious and ready to greet visitors once again! Tickets Events Membership Reservations Jimmy’s Farm & Wildlife Park Pannington Hall Lane Ipswich Suffolk. IP9 2AR 01473 604 206 Contact us About your visit TICKETS Tickets Annual Membership Animal Experiences Education – schools & groups Events YOUR VISIT About your visit FAQs Getting here Opening times Facilities & Access Shops/Stores Sponsor an Animal ATTRACTIONS The Lost Lands of the Tundra Woodland Adventure Butterfly House Tropical House Play Areas and Bouncy Pillow Fishing with Dolly QUICK LINKS Jimmy Doherty Jimmy’s Podcast Tales from Jimmy’s Farm Restaurant Weddings Birthday Parties News & Blog ANIMALS Polar Bears / Arctic Wolves / Arctic Foxes / Reindeer Mammals Reptiles Birds Butterflies Rare Breeds Bugs and Fish Animal Adoptions MORE About us Christmas Party Nights Christmas Gifts Guide Corporate Events Team Building Days Exhibiting Cars Careers/Jobs Space For The Wild Crafted Conservation Norfolk & Suffolk Days Out Jimmy’s Farm, Pannington Hall Lane, Ipswich, Suffolk IP9 2AR. Phone: 01473 604206 Contact us | Privacy | Cookies | Website terms of use | Terms & Conditions © 2017 The Essex Pig Company Ltd | All Rights Reserved | Website: BHS Digital . Close Sliding Bar Area Tickets Events Membership Reservations Page load link We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok Privacy policy Go to Top"
    }
  ]
}