{
  "fuentes": [
    {
      "url": "https://www.nineteen61.com/contact",
      "email": "events@nineteen61.com"
    },
    {
      "url": "https://www.nineteen61.com/contact",
      "email": "info@nineteen61.com"
    },
    {
      "url": "https://www.nineteen61.com/",
      "email": "info@nineteen61.com"
    },
    {
      "url": "https://www.nineteen61.com/bar-vasco",
      "email": "events@nineteen61.com"
    },
    {
      "url": "https://www.lkldnow.com/a-look-inside-nineteen61s-new-downtown-home/",
      "email": "newstips@lkldnow.com"
    },
    {
      "url": "https://www.nineteen61.com/banquet61",
      "email": "events@nineteen61.com"
    },
    {
      "url": "https://www.nineteen61.com/event-catering",
      "email": "events@nineteen61.com"
    },
    {
      "url": "https://www.lkldnow.com/nineteen61s-new-rooftop-bar-set-to-open-june-1/",
      "email": "kimberly@lkldnow.com"
    },
    {
      "url": "https://www.lkldnow.com/nineteen61s-new-rooftop-bar-set-to-open-june-1/",
      "email": "newstips@lkldnow.com"
    },
    {
      "url": "https://www.nineteen61.com/nineteen61",
      "email": "info@nineteen61.com"
    }
  ],
  "mails": [
    "events@nineteen61.com",
    "info@nineteen61.com",
    "kimberly@lkldnow.com",
    "newstips@lkldnow.com"
  ],
  "nombre_sitio": "nineteen61.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.nineteen61.com/contact",
      "text": "Contact 1 — Nineteen61 0 Skip to Content ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT Folder: SPACES Back BAR VASCO BANQUET61 NINETEEN61 MENUS Folder: SERVICES Back CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Contact us. Nineteen61 info@nineteen61.com (863) 688-1961 Vasco61 events@nineteen61.com (863) 688-1961 Banquet61 events@nineteen61.com (863) 400-6161 Cantina Catering events@nineteen61.com (863) 373-1961 215 E. Main St.\nLakeland, FL 33801 Name * First Name Last Name Email * Message * Thank you! Nineteen61"
    },
    {
      "url": "https://www.nineteen61.com/",
      "text": "Nineteen61 0 Skip to Content ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT Folder: SPACES Back BAR VASCO BANQUET61 NINETEEN61 MENUS Folder: SERVICES Back CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation ROOFTOP RESTAURANT EVENTS We Appreciate Your Feedback. Thank you for visiting us. We sincerely hope you had an incredible experience. We’d love to hear from you. Contact Us Contact Us Name * First Name Last Name Space Rooftop Restaurant Event Date Visited MM DD YYYY Time Visited Hour Minute Second AM PM Any comments, questions, or feedback? Thank you! 215 E. MAIN ST. LAKELAND, FL 33801 863-688-1961 | INFO@NINETEEN61.COM MON – WED Lunch 11:00 am – 3:00 pm Dinner 5:00 pm – 9:00 pm THURS – SAT Lunch 11:00 am – 3:00 pm Dinner 5:00 pm -10:00 pm SUN Brunch 10:00am – 2:30pm Dinner 4:00pm -8:00pm HAPPY HOUR MON – THUR 3:00 pm – 5:00 pm FRI – SAT 3:00 pm – 5:00 pm SUNDAY 2:30 pm – 3:30 pm (DRINKS ONLY)"
    },
    {
      "url": "https://www.nineteen61.com/bar-vasco",
      "text": "Vasco61 — Nineteen61 0 Skip to Content ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT Folder: SPACES Back BAR VASCO BANQUET61 NINETEEN61 MENUS Folder: SERVICES Back CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation ABOUT We're dedicated to ensuring you relish our beverages, savor our delectable tapas, and soak in the inviting atmosphere of our bar. Embodying the philosophy that great cocktails are worth the wait, each one is crafted with precision using only the freshest ingredients for an unparalleled experience. Our carefully curated wine list and spirit offerings stand as a testament to our pride and commitment to excellence. Vasco 61 is a 21 and over space EMERSON BAMACA Beverage Director / Partner KERRI COLLINS Banquet Director MENU Main Menu Happy Hour Dress Guidelines To help us maintain a welcoming and professional environment, we kindly ask that guests follow our dress guidelines. Please avoid wearing flip-flops, athletic wear, sweatshirts, sweatpants, leggings, or joggers. Men’s shirts should have sleeves, and we ask that excessively revealing clothing—such as sports bras or bra-style tops—not be worn. We also do not permit clothing with offensive language or imagery. Thank you for understanding and we look forward to serving you soon! LARGE GROUPS Want to reserve a small party booth for groups of 10 - 18, or reserve the entire space? Please contact Kerri Collins at (863)400-6161 . SIXTY-ONE SOCIETY Nineteen61, we position ourselves as a benchmark for Lakeland dining. A new standard that shows what is possible—what Lakeland diners should expect from their restaurants. Despite of it all, including of our humbling success, it has never been about monetary success. It is not about recognition or press. Instead, it is about the food, the freedom, and sharing these bounties with a community we love. SIGN UP FOR OUR MONTHLY NEWSLETTER Email Address Sign Up Thank you! Become a member, learn about our featured cocktails, and receive an early invite to our monthly chefs’ dinners with wine and wine pairings. 215 E. MAIN ST. LAKELAND, FL 33801 863-688-1961 | EVENTS@NINETEEN61.COM Hours MON – WED 4:00 pm – 12:00 am Happy Hour 4-7 pm THUR - FRIDAY 4:00 pm – 1:00 am Happy Hour 4-7 pm SATURDAY 12:00 pm – 1:00 am Happy Hour 12-7 pm Brunch & Mimosa Specials SUNDAY 12:00 pm – 10:00 pm Happy Hour 12-7 pm Brunch & Mimosa Specials"
    },
    {
      "url": "https://www.lkldnow.com/a-look-inside-nineteen61s-new-downtown-home/",
      "text": "A Look Inside Nineteen61's New Downtown Home - LkldNow Support local news for Lakeland! We believe everyone should be able to be informed about the place they live so we don't charge to read LkldNow. Instead of paywalls or subscription fees, we rely on contributions from readers like you to fund our journalism. Give Monthly, One-time or Once a Year. One-time Monthly Annually Small $ 50 once $ 10 per month $ 250 per year Select Medium ♥️ $ 100 once $ 15 per month $ 500 per year Select Large $ 500 once $ 30 per month $ 1,000 per year Select Stay in the know Get the scoop on what’s happening in Lakeland. Sign up to our weekly newsletter to get all your local news in one email! Sign up Stay up-to-date with latest news in Lakeland.  Sign up now! Register today to manage your LkldNow newsletters and contributions in one place. No paywalls, no hassles, just local news you can use. Weekly, our premium newsletter Our premier newsletter comes out on Thursdays. Review the week's news and preview weekend events. Instant news alerts Be among the first to know. Get notified by email as soon as we publish a new article. Sign in with Google Or Sign up Sign in to an existing account LkldNow's privacy policy Thank you for being a LkldNow reader! An account was already registered with this email. Please check your inbox for an authentication link. Get your news straight from the source! Sign up LkldNow is your only truly local, independent news. No paywall. No subscription fees. No opinions. Just Local News. Sign up for our weekly newsletter. Close DONATE NEWSLETTERS Sign In Search for: Search NEWS Open dropdown menu HOME A & E Business City Hall COVID-19 Downtown Dining Health Insight Polk Neighborhoods People Politics Open dropdown menu Voter Guide Public Safety Recreation Schools Sports Transportation COMMUNITY Open dropdown menu Newcomers’ Guide Community Forums Find a locally owned restaurant near you Info Maps Weather EVENTS Open dropdown menu Candid Conversations 2025 All Events Music Calendar Add an event OBITUARIES Open dropdown menu Obituaries Submit an Obituary ABOUT Open dropdown menu Newsletters Add LkldNow to Your Phone About Us Staff and Board Members Policies Open dropdown menu Conflict of Interest Policy Editorial Independence Policy Donor, Sponsorship, Advertising Policy Privacy Policy Terms of Service SUPPORT US Open dropdown menu Donate Sponsorships Our Donors Facebook Page Instagram Threads YouTube TikTok Bluesky RSS Close Skip to content Facebook Page Instagram Threads YouTube TikTok Bluesky RSS LkldNow Independent, community-driven news about Lakeland, Fla. DONATE NEWSLETTERS Sign In Open Search Search for: Search ♡ DONATE Menu Sign In NEWS Open dropdown menu HOME A & E Business City Hall COVID-19 Downtown Dining Health Insight Polk Neighborhoods People Politics Open dropdown menu Voter Guide Public Safety Recreation Schools Sports Transportation COMMUNITY Open dropdown menu Newcomers’ Guide Community Forums Find a locally owned restaurant near you Info Maps Weather EVENTS Open dropdown menu Candid Conversations 2025 All Events Music Calendar Add an event OBITUARIES Open dropdown menu Obituaries Submit an Obituary ABOUT Open dropdown menu Newsletters Add LkldNow to Your Phone About Us Staff and Board Members Policies Open dropdown menu Conflict of Interest Policy Editorial Independence Policy Donor, Sponsorship, Advertising Policy Privacy Policy Terms of Service SUPPORT US Open dropdown menu Donate Sponsorships Our Donors Posted in Business A Look Inside Nineteen61’s New Downtown Home by Barry Friedman July 15, 2019 Updated August 9, 2022 Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Nextdoor (Opens in new window) Nextdoor Click to share on Bluesky (Opens in new window) Bluesky Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print What: Grand opening of Nineteen61 , a Latin fusion restaurant that has moved from Dixieland to downtown. Where: 215 E. Main St., the circa-2005 building that was renovated three years ago to house the Posto 9 Brazilian gastropub. Keep up with what’s happening in Lakeland with only one email a week. Sign up When: Today, after several days of soft openings last week. Who: General manager, Lindsey Crowley; executive chef, Marcos Fernandez; sous chefs: Blake Jones and Patrick Mc’Andrew; bar manager, Emerson Bamaca Select any photo for a larger view: Photos by David Dickey Jr. Interior design: Monica Loret de Mola and Gretchen Aguayo Seating: 152, compared with 47 at the Dixieland location Menus: Lunch ($9-$24) | Dinner (Entrees: $19-$65) | Tapas (In the bar after 3: $6-$19) Support independent local news for Lakeland Keep LkldNow freely accessible. We rely on contributions from readers like you to fund our journalism. Give one-time or make it monthly and cancel anytime! One-time Monthly One-time $10 $20 $90 Other Donation amount $ Monthly $10 $15 $30 Other Donation amount\t\t\t\t\t\t\t\t\t\t\t\tper month $ Thanks for supporting LkldNow! Contribute Now Something new: Wood-burning grill Building ownership: The three-story structure was purchased in May for $1.72 million by Lakeland Main LLC , a company whose principals include Marcobay Construction executives Howard Bayless, Austin T. Jones and Shawn W. Jones. Hours: Monday-Thursday – 11:30 a.m. to 3 p.m.; 5 p.m. to 9 p.m. Friday-Saturday – 11:30 a.m. to 3 p.m.; 5 p.m. to 10 p.m. Sunday – 11:30 a.m. to 8 p.m. Lounge – 3 p.m. to close; happy hour 4-6 p.m. Online reservations: Open Table Phone: 863-688-1961 [Donatebox] SEND CORRECTIONS , questions, feedback or news tips: newstips@lkldnow.com latest news Crime / Justice Former Director of TLC PetSnip Charged With Fraud by Cindy Glover September 9, 2025 September 9, 2025 Schools ‘We’re Going to Embrace Change’: Lakeland Responds to High School Rezoning by Cindy Glover September 8, 2025 September 9, 2025 A & E ‘Legacy Lane’ Portrait Exhibit Honors Cancer Survivors at Watson Clinic by Anna Toms September 5, 2025 September 5, 2025 Insight Polk Opening Doors: CareerSource Polk Connects Residents with Jobs, Training and Support by Kayla Borg September 4, 2025 Environment Commissioners Approve $2.3M to Clean Up Lakes Morton, Mirror and Hollingsworth by Cindy Glover September 4, 2025 September 4, 2025 LOAD MORE ARTICLES Something went wrong. Please refresh the page and/or try again. Tagged: lkldnow Barry Friedman barry@lkldnow.com Barry Friedman founded Lkldnow.com in 2015 as the culmination of a career in print and digital journalism. Since 1982, he has used the tools of reporting, editing and content curation to help people in Lakeland understand their community better. More by Barry Friedman Leave a comment Your thoughts on this? (Comments are moderated; first and last name are required.) Cancel reply Facebook Page Instagram Threads YouTube TikTok Bluesky RSS mail@lkldnow.com 863-576-7079 122 E. Main St., #234 Lakeland FL 33801 (mailing address only) OUR MISSION Empower Lakeland residents to become more engaged with their community through quality, independent news and information. Support Nonprofit Community News Always Free, Community Supported DONATE GET OUR NEWSLETTERS Facebook Instagram Threads YouTube TikTok Bluesky RSS Feed About Us Staff & Board Conflict of Interest Editorial Independence Privacy Policy Terms of Service MEMBER LION Publishers Institute for Nonprofit News LkldNow is a project of Linking Community Now, a 501(c)(3) nonprofit organization | Tax ID: 47-4796952 | All donations are tax-deductible © 2025 Linking Community Now Inc Powered by Newspack Sign in Close Sign in with Google Or Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to , or clicking the magic link in the email. Continue Resend code Email me a one-time code instead Forgot password Create an account Sign in to an existing account Go back Continue Set a password (optional) LkldNow's privacy policy . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Sign up for newsletters Close Get the best of LkldNow directly in your email inbox. Sending to: Weekly, our premium newsletter Our premier newsletter comes out on Thursdays. Review the week's news and preview weekend events. Instant news alerts Be among the first to know. Get notified by email as soon as we publish a new article. Continue Loading Comments... Write a Comment... Email (Required) Name (Required) Website Complete your transaction Close"
    },
    {
      "url": "https://www.nineteen61.com/banquet61",
      "text": "Banquet61 — Nineteen61 0 Skip to Content ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT Folder: SPACES Back BAR VASCO BANQUET61 NINETEEN61 MENUS Folder: SERVICES Back CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation CREATING MEMORABLE MOMENTS We are not your average event space. We provide memorable experiences with fine food, drink and hospitality for all of life’s events – from parties to cooking classes! Our banquet rooms can accommodate up 150 guests in total comfort. Smaller rooms are available, rent out just one room for as few as 10 without compromising quality. Our unique layout opens into one big space. Using 75″ TV screens as dividers between tables, you have an ideal space for events. A resident chef will prepare fresh dishes made especially for each event while off-site catering is also available upon request at competitive prices. Your special event deserves nothing less than excellence so let us help make sure everything goes smoothly! CREATING MEMORABLE MOMENTS KERRI COLLINS Banquet Director CORPORATE EVENTS We offer the best food and service around, so you can focus on what’s important – talking business! Our chefs are experts in their field; they’ll cook for any occasion from parties to meetings and everything else that comes along during workday lunches. SPECIAL EVENTS Whether you’re looking to celebrate your special day in the most intimate way possible with only close family and friends or want an epic celebration that will be talked about for years, we have a venue just right! LOCAL EVENTS Banquet61  is the ultimate destination for your next event. From on-site catering, bar services, and AV systems with fully wired sound we have everything you need! Centrally located in Downtown Lakeland FL. Cantina Style With a diverse selection of mouthwatering dishes, you can count on Banquet61 to make your event memorable and convenient. For a quick pickup of cantina meals call or order here. Drop off catering requires 48 hour notice please contact our team below for 48 drop off options. Contact Us: 863-373-1961 Click here to order Request Info Name First Name Last Name Email Phone (###) ### #### Type of Event CHEFS TABLE CORPORATE EVENT SPECIAL OCCASION WEDDING Number of People Date MM DD YYYY Thank you! 215 E. MAIN ST. LAKELAND, FL 33801 Kerri Collins | 863-400-6161 | EVENTS@NINETEEN61.COM Cantina Catering | 863-373- 1961 | EVENTS@NINETEEN61.COM"
    },
    {
      "url": "https://www.nineteen61.com/event-catering",
      "text": "Banquet61 — Nineteen61 0 Skip to Content ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT Folder: SPACES Back BAR VASCO BANQUET61 NINETEEN61 MENUS Folder: SERVICES Back CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation EVENT CATERING SERVICES Welcome to Events at Nineteen61, where we deliver exceptional culinary experiences tailored to your event's unique style. Whether you need onsite catering with live-action stations or offsite catering at a venue of your choice, we have the expertise to make your event unforgettable. We specialize in Cuban, Italian, and American cuisine, offering a variety of delectable dishes to suit all tastes. Our services also include in-house bakery made dessert items and custom floral and décor services, ensuring your celebration is flawless from start to finish. CREATING MEMORABLE MOMENTS Our expert planning team ensures a seamless event experience from concept to completion. • Themed Décor: Tablescapes, Floral Arrangements, and Centerpieces • Event Coordination: Timelines, Vendor Management, and Logistics Onsite Catering • Perfect for corporate events, weddings, and private parties at our exclusive venues, featuring seated dining up to 90 guests. • Cocktail and Tapas service for 100 or more guests. • Live chef stations, buffet setups, and plated meals available. Offsite Catering • We bring the feast to your location—whether it's a poolside wedding, corporate office, or family reunion. • Full-service staff to set up, serve, and clean up. Cuban Cuisine Experience the vibrant flavors of Cuba with a menu full of soulful, slow-cooked dishes. Sample Menu Items: • Appetizers: House made tapas including Tostones with Aji Panca marinated pork, Croquetas with Serrano ham and bechamel, Empanadas featuring sweet and savory seasoned beef with olives & raisins, Rocoto sauce • Entrées: Ropa Vieja (Shredded Beef Stew), Lechón Asado (Cuban Roast Pork), Whole Pig Roast, Paella and so much more • Sides: Black Beans & Jasmine Rice, Yuca con Mojo • Desserts: Guava Cheesecake, Tres Leches Cake, Specialty Tarts and more ITALIAN Cuisine Savor the comfort of authentic Italian food made with love and tradition. Sample Menu Items: • Appetizers: Caprese Salad Skewers, Bruschetta al Pomodoro • Entrées: Chicken Marsala, Rigatoni61, Pasta Primavera, Eggplant Parmesan • Sides: Garlic Bread Sticks, Caesar Salad • Desserts: Tiramisu, Cannoli AMERICAN Cuisine Classic American favorites, reimagined with fresh ingredients and creative flair. Sample Menu Items: • Appetizers: Mini Pork Sliders, BBQ Chicken Wings, Deviled Eggs • Entrées: Shrimp and Grits, Grilled and Sliced Steak, Southern Fried Chicken • Sides: Mac & Cheese, Coleslaw, Cornbread • Desserts: Apple Pie, Cheesecake, Brownies Request Info Whether it’s an intimate gathering or a grand celebration, we are committed to delivering an unforgettable event. Contact us today to discuss your vision and let us create an extraordinary experience for you and your guests! Name First Name Last Name Email Phone (###) ### #### Catering Options ONSITE OFFSITE Type of Cuisine Cuban Italian American Date MM DD YYYY Thank you! 215 E. MAIN ST. LAKELAND, FL 33801 Kerri Collins | 863-400-6161 | EVENTS@NINETEEN61.COM Events Catering | 863-373- 1961 | EVENTS@NINETEEN61.COM"
    },
    {
      "url": "https://www.lkldnow.com/nineteen61s-new-rooftop-bar-set-to-open-june-1/",
      "text": "Nineteen61's New Rooftop Bar Set to Open June 1 - LkldNow Support local news for Lakeland! We believe everyone should be able to be informed about the place they live so we don't charge to read LkldNow. Instead of paywalls or subscription fees, we rely on contributions from readers like you to fund our journalism. Give Monthly, One-time or Once a Year. One-time Monthly Annually Small $ 50 once $ 10 per month $ 250 per year Select Medium ♥️ $ 100 once $ 15 per month $ 500 per year Select Large $ 500 once $ 30 per month $ 1,000 per year Select Stay in the know Get the scoop on what’s happening in Lakeland. Sign up to our weekly newsletter to get all your local news in one email! Sign up Stay up-to-date with latest news in Lakeland.  Sign up now! Register today to manage your LkldNow newsletters and contributions in one place. No paywalls, no hassles, just local news you can use. Weekly, our premium newsletter Our premier newsletter comes out on Thursdays. Review the week's news and preview weekend events. Instant news alerts Be among the first to know. Get notified by email as soon as we publish a new article. Sign in with Google Or Sign up Sign in to an existing account LkldNow's privacy policy Thank you for being a LkldNow reader! An account was already registered with this email. Please check your inbox for an authentication link. Get your news straight from the source! Sign up LkldNow is your only truly local, independent news. No paywall. No subscription fees. No opinions. Just Local News. Sign up for our weekly newsletter. Close DONATE NEWSLETTERS Sign In Search for: Search NEWS Open dropdown menu HOME A & E Business City Hall COVID-19 Downtown Dining Health Insight Polk Neighborhoods People Politics Open dropdown menu Voter Guide Public Safety Recreation Schools Sports Transportation COMMUNITY Open dropdown menu Newcomers’ Guide Community Forums Find a locally owned restaurant near you Info Maps Weather EVENTS Open dropdown menu Candid Conversations 2025 All Events Music Calendar Add an event OBITUARIES Open dropdown menu Obituaries Submit an Obituary ABOUT Open dropdown menu Newsletters Add LkldNow to Your Phone About Us Staff and Board Members Policies Open dropdown menu Conflict of Interest Policy Editorial Independence Policy Donor, Sponsorship, Advertising Policy Privacy Policy Terms of Service SUPPORT US Open dropdown menu Donate Sponsorships Our Donors Facebook Page Instagram Threads YouTube TikTok Bluesky RSS Close Skip to content Facebook Page Instagram Threads YouTube TikTok Bluesky RSS LkldNow Independent, community-driven news about Lakeland, Fla. DONATE NEWSLETTERS Sign In Open Search Search for: Search ♡ DONATE Menu Sign In NEWS Open dropdown menu HOME A & E Business City Hall COVID-19 Downtown Dining Health Insight Polk Neighborhoods People Politics Open dropdown menu Voter Guide Public Safety Recreation Schools Sports Transportation COMMUNITY Open dropdown menu Newcomers’ Guide Community Forums Find a locally owned restaurant near you Info Maps Weather EVENTS Open dropdown menu Candid Conversations 2025 All Events Music Calendar Add an event OBITUARIES Open dropdown menu Obituaries Submit an Obituary ABOUT Open dropdown menu Newsletters Add LkldNow to Your Phone About Us Staff and Board Members Policies Open dropdown menu Conflict of Interest Policy Editorial Independence Policy Donor, Sponsorship, Advertising Policy Privacy Policy Terms of Service SUPPORT US Open dropdown menu Donate Sponsorships Our Donors Posted in Business Nineteen61’s New Rooftop Bar Set to Open June 1 Bar Vasco’s indoor/outdoor space will offer tapas and hand-crafted cocktails. by Kimberly C. Moore May 23, 2024 May 23, 2024 Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Nextdoor (Opens in new window) Nextdoor Click to share on Bluesky (Opens in new window) Bluesky Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print Bar Vasco co-owners Marcos Fernandez and Emerson Bamaca as they gear up for the rooftop bar's opening, set for June 1. | Kimberly C. Moore, LlkldNow One of Lakeland’s most eagerly anticipated dining and drinking spaces is set to open on June 1. Nineteen61 owner Marcos Fernandez gave LkldNow a sneak peek at the building’s new rooftop establishment, Bar Vasco, with commanding views of downtown and Munn Park. Keep up with what’s happening in Lakeland with only one email a week. Sign up What’s new: Bar Vasco is a Latin-flavored tapas, pintxos and craft cocktail lounge with a menu, kitchen and bar separate from its award-winning downstairs sister, Nineteen61 . Construction work on the space was almost complete on Tuesday. Fernandez completely remodeled the rooftop eatery and bar. What had been a hard-hat zone in February is now a tropical oasis. The concept: Bar Vasco is Lakeland’s second rooftop bar, joining Bonnet Springs Park. Patrons can choose between air-conditioned indoor or fan-cooled patio seating, with tropical foliage throughout. Garage-style doors can also be opened during cooler months for a full open-air experience. Fernandez said he and business partner Emerson Bamaca, Nineteen61’s beverage director, traveled the world to find unique food and cocktail options for customers. “We’re gonna work on keeping the prices affordable so Lakeland, all of Lakeland, can come and enjoy,” Fernandez said. “None of the foods from downstairs is gonna be up here, so the quality will be there, the same quality, the same consistency.” On the menu: Bar Vasco will offer both tapas, which are small hot or cold Latin dishes, and pintxos, food on a stick served on bread. Prices will range from $6 to $18 for food items, with fresh oysters the most expensive item. Drinks from Bamaca’s extensively researched and tested cocktail book will run $14 to $25. The priciest cocktail is the Luxury Old Fashioned, using Blanton’s Kentucky Bourbon from a single barrel Fernandez and Bamaca bought for Bar Vasco. Support independent local news for Lakeland Keep LkldNow freely accessible. We rely on contributions from readers like you to fund our journalism. Give one-time or make it monthly and cancel anytime! One-time Monthly One-time $10 $20 $90 Other Donation amount $ Monthly $10 $15 $30 Other Donation amount\t\t\t\t\t\t\t\t\t\t\t\tper month $ Thanks for supporting LkldNow! Contribute Now Hours: Bar Vasco will be open seven days a week and will offer evening hours when it opens June 1. It will also be available to rent for parties and events. The back story: Nineteen61 opened its current location in July 2019 , with a Tampa Tribune food critic once saying the chef’s Cuban-inspired offerings left them “starry-eyed.” The name: Vasco is a term for a boy from the Basque region of Spain. Their concept is a young man, traveling the world, eating and drinking. Before and after pictures of Bar Vasco’s interior under construction in February and then completed in May 2024. | Kimberly C. Moore, LkldNow Before and after pictures of Bar Vasco, with bartenders perfecting the drink menu. | Kimberly C. Moore Before and after pictures of Bar Vasco’s rooftop patio under construction in February and then completed in May 2024. | Kimberly C. Moore, LkldNow Before and after photos of Bar Vasco’s outdoor patio area in February and then May 2024. | Kimberly C. Moore, LkldNow The view from inside Bar Vasco. | Kimberly C. Moore, LkldNow Bar Vasco staff took a lunch break on Tuesday, May 21. | Kimberly C. Moore, LkldNow The scenic view of downtown Lakeland in February 2024 from the rooftop patio of Bar Vasco. | Kimberly C. Moore, LkldNow Nineteen61 and rooftop Bar Vasco owner Marcos Fernandez in February 2024. | Kimberly C. Moore, LkldNow Nineteen61 owners are gearing up for the June 1 grand opening of the rooftop Bar Vasco. | Kimberly C. Moore, LkldNow RELATED Downtown’s Nineteen61 Is Adding an Enclosed Rooftop Bar January 4, 2024 January 4, 2024 A Look Inside Nineteen61’s New Downtown Home July 15, 2019 August 9, 2022 SEND CORRECTIONS , questions, feedback or news tips: newstips@lkldnow.com latest news Crime / Justice Former Director of TLC PetSnip Charged With Fraud by Cindy Glover September 9, 2025 September 9, 2025 Schools ‘We’re Going to Embrace Change’: Lakeland Responds to High School Rezoning by Cindy Glover September 8, 2025 September 9, 2025 A & E ‘Legacy Lane’ Portrait Exhibit Honors Cancer Survivors at Watson Clinic by Anna Toms September 5, 2025 September 5, 2025 Insight Polk Opening Doors: CareerSource Polk Connects Residents with Jobs, Training and Support by Kayla Borg September 4, 2025 Environment Commissioners Approve $2.3M to Clean Up Lakes Morton, Mirror and Hollingsworth by Cindy Glover September 4, 2025 September 4, 2025 LOAD MORE ARTICLES Something went wrong. Please refresh the page and/or try again. Tagged: downtown Kimberly C. Moore kimberly@lkldnow.com Kimberly C. Moore, who grew up in Lakeland, has been a print, broadcast and multimedia journalist for more than 30 years. Before coming to LkldNow in the spring of 2022, she was a reporter for four years with The Ledger, first covering Lakeland City Hall and then Polk County schools. She is the author of  “Star Crossed: The Story of Astronaut Lisa Nowak,\" published by University Press of Florida. Reach her at kimberly@lkldnow.com or 863-272-9250. More by Kimberly C. Moore Leave a comment Your thoughts on this? (Comments are moderated; first and last name are required.) Cancel reply Facebook Page Instagram Threads YouTube TikTok Bluesky RSS mail@lkldnow.com 863-576-7079 122 E. Main St., #234 Lakeland FL 33801 (mailing address only) OUR MISSION Empower Lakeland residents to become more engaged with their community through quality, independent news and information. Support Nonprofit Community News Always Free, Community Supported DONATE GET OUR NEWSLETTERS Facebook Instagram Threads YouTube TikTok Bluesky RSS Feed About Us Staff & Board Conflict of Interest Editorial Independence Privacy Policy Terms of Service MEMBER LION Publishers Institute for Nonprofit News LkldNow is a project of Linking Community Now, a 501(c)(3) nonprofit organization | Tax ID: 47-4796952 | All donations are tax-deductible © 2025 Linking Community Now Inc Powered by Newspack Sign in Close Sign in with Google Or Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to , or clicking the magic link in the email. Continue Resend code Email me a one-time code instead Forgot password Create an account Sign in to an existing account Go back Continue Set a password (optional) LkldNow's privacy policy . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Sign up for newsletters Close Get the best of LkldNow directly in your email inbox. Sending to: Weekly, our premium newsletter Our premier newsletter comes out on Thursdays. Review the week's news and preview weekend events. Instant news alerts Be among the first to know. Get notified by email as soon as we publish a new article. Continue Loading Comments... Write a Comment... Email (Required) Name (Required) Website Complete your transaction Close"
    },
    {
      "url": "https://www.nineteen61.com/nineteen61",
      "text": "NINETEEN61: Lakeland's Premier Fine Dining — Nineteen61 0 Skip to Content ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT SPACES BAR VASCO BANQUET61 NINETEEN61 MENUS SERVICES CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation Open Menu Close Menu ORDER ONLINE ABOUT Folder: SPACES Back BAR VASCO BANQUET61 NINETEEN61 MENUS Folder: SERVICES Back CATERING RESERVATIONS CANTINA ORDERING EVENT CATERING GIFT CARDS SIXTY-ONE SOCIETY CONTACT Make a Reservation A CULINARY DELIGHT Make a Reservation ABOUT Nineteen61, we position ourselves as a benchmark for Lakeland dining. A new standard that shows what is possible — what Lakeland diners should expect from their restaurants. Despite of it all, including of our humbling success, it has never been about monetary success. It is not about recognition or press. Instead, it is about the food, the freedom, and sharing these bounties with a community we love. With the understanding of quality and the value of creating an in depth memorable experience beyond a crafted dish, the wine poured in your glass, and linens on your table — we believe it requires more than just that. EMERSON BAMACA Beverage Director / Partner MARCOS FERNANDEZ Executive Chef / Owner MENU’S Brunch Menu Lunch Menu Dinner Menu RESERVATIONS For reservations, call (863)688-1961 . For small groups looking to book a private room, please contact Kerri Collins at (863)400-6161 . Make a reservation SIXTY-ONE SOCIETY Nineteen61, we position ourselves as a benchmark for Lakeland dining. A new standard that shows what is possible—what Lakeland diners should expect from their restaurants. Despite of it all, including of our humbling success, it has never been about monetary success. It is not about recognition or press. Instead, it is about the food, the freedom, and sharing these bounties with a community we love. SIGN UP FOR OUR MONTHLY NEWSLETTER Email Address Sign Up Thank you! Become a member, learn about our featured cocktails, and receive an early invite to our monthly chefs’ dinners with wine and wine pairings. 215 E. MAIN ST. LAKELAND, FL 33801 863- 688 -1961 | INFO@NINETEEN61.COM MON – WED Lunch 11:00 am – 3:00 pm Dinner 5:00 pm – 9:00 pm THURS – SAT Lunch 11:00 am – 3:00 pm Dinner 5:00 pm -10:00 pm SUN Brunch 10:00am – 2:30pm Dinner 4:00pm -9:00pm HAPPY HOUR MON – THUR 3:00 pm – 5:00 pm FRI – SAT 3:00 pm – 5:00 pm SUNDAY 2:30 pm – 3:30 pm (DRINKS ONLY)"
    }
  ]
}