{
  "fuentes": [
    {
      "url": "https://campermate.com/en/location/australia/qld/gold-coast/paid-campground/nobby-beach-holiday-village/8a3aef17-386e-499b-a178-bebe8f108b49",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/specials/",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/contact",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/gallery",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/groups",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/stay/",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/facilities",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/travellers-choice/",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/stay/villas/",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/specials/gday-rewards/",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://www.gclr3.com.au/goldlinq/gclr3/support-local-business/business-registry-list",
      "email": "privacy.officer@jhg.com.au"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/guest-information",
      "email": "info@nobbybeachholidayvillage.com.au"
    },
    {
      "url": "https://www.booking.com/hotel/au/nobby-beach-holiday-village.en-gb.html",
      "email": "gb@3x.png"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/reviews/",
      "email": "info@nobbybeachholidayvillage.com.au"
    }
  ],
  "mails": [
    "gb@3x.png",
    "info@nobbybeachholidayvillage.com.au",
    "privacy.officer@jhg.com.au"
  ],
  "nombre_sitio": "nobbybeachholidayvillage.com.au",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://campermate.com/en/location/australia/qld/gold-coast/paid-campground/nobby-beach-holiday-village/8a3aef17-386e-499b-a178-bebe8f108b49",
      "text": "Nobby Beach Holiday Village, Gold Coast, Queensland, Australia | CamperMate - Australia & New Zealand Theme English Theme English Find camping Create profile Build itineraries Book activities Hire motorhomes View lists View blog View deals Search Nobby Beach Holiday Village Paid Campground Gold Coast , Queensland Australia 24 8 22 views today Paid Campground Non self-contained vehicles Hot Shower Kitchen Dump Station Laundry Wifi Allows Same Day Bookings Powered Sites Unpowered Sites Nobby Beach Holiday Village Paid Campground Gold Coast , Queensland Australia 24 8 Loading... 22 views today Paid Campground Non self-contained vehicles Hot Shower Kitchen Dump Station Laundry Wifi Allows Same Day Bookings Powered Sites Unpowered Sites Bookings powered by CamperMate Nobby Beach Holiday Village - From $62 Make a booking Why book with us? Aussie & Kiwi Trip Support: Call or email our local team. Road Trip Masters: Years of experience to guide you. Connected Adventures: Our network includes 1000s of partners. Book with Confidence: Trusted BookIt & BookEasy partner. Secure Travels: Your booking is secure with us. About Discover the Gold Coast's Gem: Nobby Beach Holiday Village! Centrally located for easy access to all Gold Coast attractions, our affordable Holiday Park is your gateway to a memorable Queensland holiday. Immerse yourself in the vibrant Nobby Beach atmosphere with cafes, restaurants, bars, and boutiques just steps away. Stroll to Nobby or Miami Beach for sun-kissed adventures or hop on a convenient bus from our doorstep to Theme Parks, Surfers Paradise, shopping havens, or the lush Hinterland. Your dream vacation awaits in our modern, comfortable haven, offering all the comforts of home and beyond with a range of accommodations and powered sites to suit all sizes and budgets. Loading... Loading... Contact Address 2200 Gold Coast Highway, Miami QLD 4220 Phone number +61755727533 Email info@nobbybeachholidayvillage.com.au Opening hours Mon-Sat: 8am-6pm\nSun: 9am-5pm\nPubic Holidays: 9am-5pm\nClosed Christmas Day Map Loading... Bookings powered by CamperMate Nobby Beach Holiday Village - From $62 Make a booking Why book with us? Aussie & Kiwi Trip Support: Call or email our local team. Road Trip Masters: Years of experience to guide you. Connected Adventures: Our network includes 1000s of partners. Book with Confidence: Trusted BookIt & BookEasy partner. Secure Travels: Your booking is secure with us. Loading... Make a booking View in app Explore Find camping Create profile Build itineraries Book activities Hire motorhomes View lists View blog View deals Hire with Motorhome Republic Hire with Camplify Apollo Motorhome Hire Australia Maui Motorhome Hire New Zealand Car & SUV Rentals CamperMate Car and Motorhome Hire CamperMate Consent Preferences Download the CamperMate app Contact us Partner with CamperMate Business Login List your AU Business List your NZ Business Download the CamperMate app Holiday Park Partners Tourism Partners © TripTech 2025 Trustpilot Show more photos ( 7 ) Review Summary 24 Positive Negative 8 Get directions Privacy Policy Cookie Policy About Us App Privacy Policy Terms and Conditions Reviews 10 Reviews Add review 🌍 Anonymous Jun 25, 2025 Positive Good location and facilities were in decent condition. \nGirl on reception is friendly and helpful.\n\nSite is on the more expensive side for what it is and you’d have more room in a Bunnings parking space 🌍 Anonymous Apr 25, 2025 Positive Nice camping. The sites are a bit small but it was enough for our tent. Camping welcoming and toilets and shower clean. 🌍 Anonymous Mar 5, 2025 Negative No place for young people, lots of children and not really ‘warm’. Gives the same vibe as the area of the gold cost. Really no place for nature lovers!  Btw gold coast overrated!! 🌍 Anonymous Nov 22, 2024 Negative It fit's to gold coast...expensive and a construction zone. Toilets are nasty and the sites are quiet narrow to each other. Wifi was good tho 🇺🇸 Pauric Oct 23, 2024 Positive Stayed here at the start of our trip. Site is small, but it doesn't feel cramped or claustrophobic. The facilities were excellent with hot clean showers, clean toilets, and clean cooking and washing area. There's a laundry room too but we didn't use that. The beach is a short walk away, as well as plenty of restaurants and shops. Definitely worth the price we paid! 🌍 Anonymous Jan 22, 2024 Negative We stayed at Nobby Beach Holiday Village for 3 nights. Unfortunately the WiFi didn't work for the whole three days. Sanitary facilities were very dirty and the staff at reception were not friendly or helpful. 🌍 Anonymous Oct 19, 2023 Positive Probably the best camping we’ve ever been in. Quiet, clean and tidy spot. Amazing location between lighthouse and shopping/restaurants area.\n100% recommended! 🇩🇪 Anonymous May 3, 2023 Positive Nice place with clean sanitary facilities. Great pool area with a fantastic slide. Had a lot of fun and loved being close to the beach and other places on the Gold Coast. “ G'day,\n\nThank you for choosing Nobby Beach Holiday Village for your recent stay, and for taking the time to share your wonderful feedback with us. We're thrilled to hear that you had a fantastic time and that you enjoyed the various amenities and the convenience of our location.\n\nWe take great pride in maintaining clean and sanitary facilities to ensure the comfort and well-being of our guests, and we're glad that you found them to your satisfaction.\n\nIt's wonderful to know that you had a lot of fun at our pool area and enjoyed the fantastic slide. Providing a fun and enjoyable experience is what we aim for, and we're delighted that we could make your stay memorable.\n\nBeing located close to the beach and other places on the Gold Coast is one of the highlights of our village, and we're glad that you appreciated the convenience of exploring the area.\n\nThank you for your kind words and your positive review. It was a pleasure having you as our guest, and we look forward to welcoming you back to Nobby Beach Holiday Village for more fun-filled moments and unforgettable experiences in the future.\n\nViel Spaß beim Reisen!\n\nKind regards,\nThe Team at Nobby Beach Holiday Village ” 🇳🇿 Anonymous Feb 24, 2020 Neutral Be aware of get late with out booking.... The manager is not very friendly. “ We apologise for the inconvenience, you will be happy to know that we have new Park Managers who put customers first. You can read the change in reviews yourself on numerous 3rd party websites, such as Google & Facebook. ” 🇦🇺 Anonymous Nov 17, 2019 Negative Stay in a cabin near the permanents area.  The permanent area look like tip  \nThe cabin was very small and costly  for what it was. If you come from instate with kids don't bring a trailer with you it wont fit in your parking spot. We had to park our car in the street and it was damaged. So having to pay for small accommodation and then pay for a car repair. “ Thank you for taking the time to leave a review on your stay. We are sorry to hear you did not enjoy your stay. Due to space issues in the park, we only have room for one vehicle per cabin and site. We would love to welcome you back to experience the true Nobby Beach experience. Kind regards, Management & the team at Nobby Beach Holiday Village ” Nearby Instant Book 24 views today NRMA Treasure Island Holiday Resort Paid Campground Gold Coast From $65 View Instant Book 5 views today BIG4 Gold Coast Holiday Park Paid Campground Gold Coast From $45 View Instant Book Southern Cross Gold Coast Tours Scenic Spots Gold Coast From $119 View Instant Book Gold Coast Dolphin Kayaking and Snorkeling Tour Tourist Attractions Gold Coast View Instant Book AquaDuck Tourist Attractions Gold Coast From $40 View Instant Book Draculas Cabaret Dinner and Show Tourist Attractions Gold Coast From $115 View Instant Book Sea World Tourist Attractions Gold Coast From $89 View Instant Book Currumbin Wildlife Sanctuary Tourist Attractions Gold Coast From $64.95 View Instant Book Australian Outback Spectacular Heartland Dinner & Show Tourist Attractions Gold Coast From $79.99 View Instant Book Gold Coast Scenic Cruise Water Activities Gold Coast From $119 View Instant Book Whale Watching Cruise from Surfers Paradise Water Activities Gold Coast From $79 View 6 views today Coomera Holiday Village Paid Campground Gold Coast From $45 View Related Instant Book 24 views today NRMA Treasure Island Holiday Resort Paid Campground Gold Coast From $65 View Instant Book 5 views today BIG4 Gold Coast Holiday Park Paid Campground Gold Coast From $45 View Instant Book Gold Coast Dolphin Kayaking and Snorkeling Tour Tourist Attractions Gold Coast View Instant Book Draculas Cabaret Dinner and Show Tourist Attractions Gold Coast From $115 View Instant Book Currumbin Wildlife Sanctuary Tourist Attractions Gold Coast From $64.95 View Instant Book Gold Coast Scenic Cruise Water Activities Gold Coast From $119 View Instant Book Australian Outback Spectacular Heartland Dinner & Show Tourist Attractions Gold Coast From $79.99 View 14 views today Burleigh Beach Tourist Park Paid Campground Gold Coast View Instant Book Natural Bridge Glowworm Circuit Walking & Hiking Gold Coast View 15 views today River Gardens Caravan Park Paid Campground Gold Coast Powered sites only, start at $40 View"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/specials/",
      "text": "Specials Archive - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Specials HOME » SPECIALS Specials Stay & Play For Less Discover unbeatable deals from Nobby Beach Holiday Village! Dive into exclusive packages that won’t break the bank. Book early to avoid missing out on the perfect getaway. Please note that with all promotions our team has a set allocation of accommodation options. Flash Sale Expires 21 Sept 2025 Your Gold Coast escape is on with our Flash Sale! The moment you've been waiting for is here! Nobby Beach Holiday Village is having a Flash Sale, and it's your chance... read more Currumbin Sanctuary Family Explorer Expires 11 Dec 2025 Your Wild Family Getaway Starts Here – 15% Off + Kids Free and a Family Pass to Currumbin Wildlife Sanctuary! Stay, save, and explore the Gold Coast with this... read more Early Bird Sale Expires 30 Sept 2025 Early Bird Sale – Save 25% on Your Gold Coast Escape! Book your getaway 6+ months in advance and enjoy 25% off stays of 2 nights or more in Villas, Houses, Garden... read more Stay 7, Pay 6* Expires 30 Sept 2025 Stay 7, Pay 6 on Garden & Standard Powered Sites! Get ready for an unforgettable stay at Nobby Beach Holiday Village as we unveil our brand-new Garden Powered... read more G’day Rewards Discount Expires: 31 Dec 2025 We LOVE REWARDING our G'day Parks Members! We are proud to be a member of G'day Parks and just for being a G'day Parks Member with G'day Rewards you will receive: 10%... read more Got Questions? We’ve Got Answers! If you have any enquiries regarding your booking please contact our reservations team on 07 5572 7533 or via email at *protected email* . Our friendly team is ready to ensure your experience with us is nothing short of amazing. Be In The Know – Subscribe to Our E-Newsletter! Be the first to know about hot deals! Subscribe to our e-newsletter for exclusive updates and insider tips. Your adventure begins with Nobby Beach Holiday Village – where affordable luxury meets endless fun! Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/contact",
      "text": "Contact Us - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Contact Us HOME » CONTACT CHECK AVAILABILITY: Check in/out Guests Adults Children Infants Contact Form Fill out the form below with your enquiry, and our team will respond to you as soon as possible. Name Phone Email Address Message SEND MESSAGE Get In Touch We’d love to hear from you! If you have a specific enquiry or would like to find out more about our village, please complete our online form or reach out to us using one of the below methods.  +617 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 Follow Follow Follow Follow Follow Follow Reception Hours $ Monday - Saturday 8:00am – 6:00pm $ Sunday & Public Holidays 9:00am – 5:00pm $ Christmas Day CLOSED Nobby Beach Holiday Village 1 Hillcrest Parade, Miami QLD 4220 How To Get Here We look forward to welcoming you... Our entrance has changed All guests are to use our entrance at 2200 Gold Coast Highway, Miami, QLD 4220 . Once checked in, use the gate at 1 Hillcrest Parade, Miami , for exiting and re-entry. IMPORTANT: Some GPS apps are still playing tricks on us and sending guests to our old entrance instead of our shiny new home (see image below). If your map tries to sneak you up the hill or to Hillcrest Parade, please ignore it and cruise down to the Gold Coast Highway. You’ll find us right there with a big Nobby Beach Holiday Village welcome! Arriving By Car Southbound on the Gold Coast Highway: Head south on the Gold Coast Highway. As you approach Mermaid Beach, move into the right lane and turn right on Markeri Street (opposite Mermaid Plaza).  Take the first right onto Sunshine Blvd/Pacific Ave, follow the road until the end and turn left onto the Gold Coast Highway. The park entrance is on the left after Kedron Ave. Northbound on the Gold Coast Highway from Gold Coast Airport: Follow Terminal Drive to the Gold Coast Highway. Turn left onto the Gold Coast Highway and travel north for 15km until you reach Miami. Turn left at 2200 Gold Coast Highway, Miami (after Kedron Ave). Driving from Coolangatta 15 kilometres (approx. 20 minutes). Southbound on the M1 from Brisbane: Take Exit 85, for Varsity Lakes and continue along Reedy Creek Rd until you reach the Gold Coast Highway, turn left and travel north to Miami. Turn left at 2200 Gold Coast Highway, Miami (after Kedron Ave). Driving from Brisbane: 85 kilometres (approx. 1 hour) Northbound on the M1 from New South Wales: Take Exit 87 and continue along Bermuda St until you turn right at Reedy Creek Road. Continue on Reedy Creek Road until you reach the Gold Coast Highway, turn left and travel north to Miami. Turn left at 2200 Gold Coast Highway, Miami (after Kedron Ave) for check-in. Driving from Sydney: 840 kilometres (approx 9 hours) Arriving By Public Transport Use the Translink Journey Planner to find the best public transport options, including times and fares. If using local buses: Look for Surfside Bus 700 or 777 Get off at Nobby Beach Shops Walk south 190m along the Gold Coast Highway. Our entrance is located on the right. This bus runs with regular stops from Wharf St, Tweed Heads to Broadbeach South Station. Total walking distance from the bus stop = 190m VISIT TRANSLINK WEBSITE Arriving By Light Rail COMING SOON! Check back here for directions in 2026. Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/gallery",
      "text": "Gallery - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Gallery HOME » PARK INFO » GALLERY CHECK AVAILABILITY: Check in/out Guests Adults Children Infants 1 How To Get Here  Park Map p Guest Information  Guest Directory  Facilities t FAQs  Gallery l Blog v Reviews  Gift Vouchers  G'Day Rewards  Park Maintenance  Long Term Rentals i Terms & Conditions Gallery Photos and videos Discover the perfect accommodation for your next getaway at Nobby Beach Holiday Village! From cozy houses to spacious villas, quaint studios, and convenient powered sites for campers and caravaners, we have something to suit every type of traveller. Explore our gallery to glimpse our fantastic holiday options, including our houses, villas, studios, and powered camp and caravan sites on the stunning Gold Coast. Stay in the loop with all the latest news, upcoming events, and local attractions near our park by following us on Facebook and Instagram Your dream vacation starts here at Nobby Beach Holiday Village! Nobby Beach Holiday Village Park Map Still not convinced? Take a look around the village... VIEW PARK MAP Reviews Here's what others say...  ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 × ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 × ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 × ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and ... Anneke M | GOOGLE REVIEW | 30/01/24 ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and had such a great time there. The staff at check-in was so nice and helpful with loads of tips to do in the area plus they had a great selection of entertainment happening for the kids. We'll definitely be back! Anneke M | GOOGLE REVIEW | 30/01/24 × ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 × READ MORE REVIEWS Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/groups",
      "text": "Group Accommodation - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Group Accommodation HOME » STAY » GROUP ACCOMMODATION CHECK AVAILABILITY: Check in/out Guests Adults Children Infants Houses $ Garden Penthouses $ Garden House 4-Bedroom $ Garden House 3-Bedroom Villas & Cabins $ Poolside Penthouses $ Deluxe Poolside Villas $ Deluxe Tropical Villas $ Deluxe Seabreeze Villas Studios $ Standard Studios $ Garden Studios $ Basic Studios Powered Sites $ Premium Powered Sites $ Garden Premium Powered Sites $ Standard Powered Sites $ Garden Powered Sites $ Grass Powered Sites Group Accommodation Couples Families Caravan Clubs Group Accommodation Discover Group Accommodation at Nobby Beach Holiday Village The Gold Coast’s most affordable destination for groups requiring up to 40 rooms! Nobby Beach Holiday Village is a popular choice with sports, family, school, recreational, business, and leisure groups. We take pride in providing budget-friendly, affordable, and upmarket group accommodation options in a safe, comfortable, and relaxed holiday park environment. Groups staying at Nobby Beach can take full advantage of our holiday park facilities, including two heated pools, a mega water slide, playgrounds, a camp kitchen, The Hub, and enjoy our central Gold Coast location. Budget to Luxury Group Accommodation: Choose from a range of self-catering holiday accommodations, each with cooking facilities and sleeping capacity for 1 to 12 group members. Nobby Beach can generally accommodate groups of up to 40 cabins and 40 powered sites. Most groups opt for the 4-bedroom Garden Penthouses and 2-bedroom Deluxe Villas. Why Choose Nobby Beach Holiday Village for Your Group Event: Centrally located on the Gold Coast for easy access to attractions. Diverse accommodation options, from cozy studios to spacious villas and 4-bedroom houses. Versatile facilities including The Hub and Camp Kitchen. A dedicated Group Coordinator to assist from planning to checkout. Recreation options like swimming pools, playgrounds, games room, and outdoor BBQs. Explore Our Group Accommodation Options and Contact Us Today to Secure Your Reservation! CHECK AVAILABILITY SPORTING GROUPS GROUP ACCOMMODATION Sporting Groups Nobby Beach Holiday Village is a sought-after choice for sporting group accommodation on the Gold Coast. Many sporting teams, clubs and other sports groups choose Nobby Beach each year for their base during both small and major sports events, including surf lifesaving carnivals, surfing, cheerleading, and QLD Masters, our facilities cater to the needs of various sports teams, clubs, and groups. Whether it’s sporting competitions, tournaments, fitness training, or team building, our central location makes us the perfect home base. Nearby sporting grounds and events include the Pizzey Park Precinct , hosting a variety of sports clubs and activities. Experience an affordable winning stay for your sports teams! From comfortable accommodations to facilities like The Hub for team meetings and the Camp Kitchen for group BBQs, we cater to the unique needs of all sporting groups. Pan Pacific Masters Accommodation: As Asia-Pacific’s biggest annual masters’ games, the Pan Pacific Masters (6-15 November 2026) attracts athletes from various sports. Nobby Beach Holiday Village is proud to host teams participating in Softball, Volleyball, Tennis, Rugby League, Golf, Netball, and more. Accommodation for this 10-day sporting event fills up quickly, so secure your spot early for clean, modern, and affordable lodging. Gold Coast Sporting Event Venues: Our central location makes us the perfect home base for your next tournament or competition on the Gold Coast, located within a short stroll of the Pizzey Park Precinct and a 10 to 15-minute drive to major Gold Coast sporting facilities, such as CBUS Super Stadium , Carrara Sports and Leisure Centre, Gold Coast Turf Club, and more. Nobby Beach provides a central location for sporting group accommodation. The Village is located within a short stroll of the Pizzey Park Precinct and a 10-to-15-minute drive of many of the major Gold Coast sporting facilities. SPORTS EVENTS DISTANCE TO SPORTING VENUES: Pizzey Park Precinct, Miami (300m) Gold Coast Gymnastics Club, Miami (550m) Nobby Beach (800m) Miami Aquatic Centre (1km) Burleigh Bears Junior Rugby League, Miami (1km) Miami Beach Surf Life Saving Club (1.5km) Burleigh Golf Club, Miami (1.3km) Bond Pirates Rugby Union, Miami (1.9km) Gold Coast Seniors Tennis Club, Miami (2km) Burleigh Bulldogs Soccer Club, Miami (2km) Mermaid Beach Bowls Club (2km) Gold Coast Athletics Club, Miami (2.4km) Gold Coast Albert Junior Tennis Club, Miami (3km) Bond University, Robina (3.7km) Kurrawa Surf Lifesaving Club, Broadbeach (4km) Palmer Colonial Golf Course, Robina (6.6km) NRL Titans CBUS Super Stadium, Robina (7km) Surfers Paradise Rugby Union Club (7km) Gold Coast Turf Club, Bundall (10km) Firth Park, Mudgeeraba (10.5km) Gold Coast Sports and Leisure Centre, Carrara (12.5km) AFL Gold Coast Suns, People First Stadium, Carrara (12.2km) Royal Pines Golf Course, Ashmore (12.6km) Southport Broadwater Parklands, Southport (12km) CARAVAN CLUBS Caravan Clubs Create lasting memories with your friends at Nobby Beach. At Nobby Beach Holiday Village, we warmly welcome caravan clubs and offer tailored packages to ensure a memorable group experience. Our holiday park is an ideal destination for caravan clubs seeking comfort, convenience, and camaraderie. Why Choose Us for Your Caravan Club? Spacious Powered Sites : Our 74 powered sites are designed to accommodate caravans of various sizes, providing ample space for your club’s needs. Modern Amenities : Enjoy access to two amenities blocks equipped with showers, toilets, and laundry facilities, ensuring a convenient and pleasant stay. Prime Location : Situated in the heart of the Gold Coast, we’re close to popular attractions, pristine beaches, and a variety of dining options across the road, walking distance to Burleigh Bombers Sports Club and Nobby Beach Surf Life Saving Club making it easy for your club to explore and enjoy the area. Family-Friendly Environment: Our park features onsite activities during long weekend and school holidays and is close to family attractions, ensuring members of all ages have a delightful stay. Booking Information To ensure your caravan club’s reservation is seamless, we recommend booking in advance, especially during peak seasons. Our friendly reservations team is ready to assist with your group’s specific needs and can provide information on payment plans for bookings made well in advance. We look forward to hosting your caravan club at Nobby Beach Holiday Village, where comfort, convenience, and community come together on the beautiful Gold Coast. SCHOOL GROUPS School Groups Nobby Beach Holiday Village is your home for educational and sporting escapes. Our dedicated Group Coordinators can assist your school with Gold Coast accommodation needs. The proximity to educational attractions, theme parks, and outdoor activities makes us an ideal choice for school groups seeking a combination of fun and learning. The security and openness of our village provides a secure and enriching environment for your students. Our well- maintained premises and vigilant staff create a safe haven, allowing students to focus on their educational pursuits while enjoying the amenities and recreational opportunities we offer. Our affordable, self-contained holiday cabin accommodation ensures comfort and convenience for both students and accompanying staff. Affordable Gold Coast School Group Accommodation Nobby Beach Holiday Village provides the ideal location for school group accommodation on the Gold Coast. If your primary school, high school or university group is visiting the Gold Coast for an educational or study tour, sporting event, music or cultural performance, field trip or other special event, Nobby Beach is a great choice for your group’s accommodation due to its affordable school group packages and central location. Central Location: Situated in close proximity to educational attractions, theme parks, and a plethora of outdoor activities, Nobby Beach Holiday Village stands as an ideal hub for school groups seeking a harmonious blend of fun and learning. Our strategic location enhances the educational experience for your students. Affordable Accommodation Packages: Nobby Beach Holiday Village is the preferred choice for school groups visiting the Gold Coast for various occasions, including school camps, educational excursions, inter-school sports, music competitions, and state or national competitions. Our affordable, self-contained holiday cabin accommodation ensures comfort and convenience for both students and accompanying staff. Choose Nobby Beach Holiday Village for an immersive educational experience in a secure and vibrant setting. Our affordable school group packages and central location ensure a memorable stay for your students. FAMILY ACCOMMODATION Family Groups / Reunions Create lasting memories with your loved ones at Nobby Beach. Our range of self-contained villas and houses provides a comfortable setting for family reunions. The welcoming atmosphere and recreational facilities ensure an unforgettable time for family members of all ages. Book our Poolside Penthouses with interconnecting balconies or take over our popular cul-de-sac with options from Studios to 2-bedroom Deluxe Villas. CORPORATE EVENTS Corporate/ Business Elevate your business events with our versatile facilities and tailored accommodation options. The Hub can be booked for meetings and team-building activities, ensuring a productive atmosphere. Enjoy the convenience of a central Gold Coast location for your next corporate event. Working in the area, contact our friendly team and ask us about long term and reoccurring stays. Bookings Made Easy Secure your booking effortlessly 1. Call our friendly reservations team to assist with group arrangements and discuss payment plans for bookings made well in advance. 2. Complete the Groups Enquiry form. 3. DIY – Confirm your booking online via our website , selecting from our range of accommodation options. Tips for Easy Online Booking: Browse our accommodation options before starting the booking process. Double-check sleeping capacities and ensure guests are willing to share beds if taking the master room. Larger options like Garden Houses and Garden Penthouses are cost-effective, accommodating 8-12 guests. For online bookings exceeding 12 people, book multiple properties, grouping them under a primary guest for convenience. Always double-check your dates for accuracy. Opt for our third-party booking insurance for added peace of mind. CHECK AVAILABILITY & BOOK ONLINE Want To Know More? Download our Groups Brochure Download our Groups Fact Sheet Complete the Group Enquiry Form Download our Group Terms & Conditions Call 07 5572 7533 to discuss your specific requirements. We look forward to hosting your group booking on the Gold Coast soon! Note: We offer payment plans for group bookings made over 3 months in advance, with a 50% deposit required on the day of booking and the balance due 30 days prior to arrival. Group Enquiry Complete the form below with details about your upcoming trip, and let our friendly team help find you the perfect accommodation package for your group. Name Business / Organisation / Group Type Phone Email Address Arrival / Departure Dates Total guests (approx) Please tell us about your trip, any special requests, etc SEND ENQUIRY Reviews Here's what others say...  ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 × ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 × ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 × ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and ... Anneke M | GOOGLE REVIEW | 30/01/24 ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and had such a great time there. The staff at check-in was so nice and helpful with loads of tips to do in the area plus they had a great selection of entertainment happening for the kids. We'll definitely be back! Anneke M | GOOGLE REVIEW | 30/01/24 × ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 × READ MORE REVIEWS Nobby Beach Holiday Village Park Map Still not convinced? Take a look around the village... VIEW PARK MAP Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/stay/",
      "text": "Gold Coast Holiday Park Accommodation - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Stay HOME » STAY CHECK AVAILABILITY: Check in/out Guests Adults Children Infants Houses $ Garden Penthouses $ Garden House 4-Bedroom $ Garden House 3-Bedroom Villas & Cabins $ Poolside Penthouses $ Deluxe Poolside Villas $ Deluxe Tropical Villas $ Deluxe Seabreeze Villas Studios $ Standard Studios $ Garden Studios $ Basic Studios Powered Sites $ Premium Powered Sites $ Garden Premium Powered Sites $ Standard Powered Sites $ Garden Powered Sites $ Grass Powered Sites Group Accommodation Couples Families Caravan Clubs Accommodation A Gold Coast holiday park to suit every budget… Nobby Beach Holiday Park on the Gold Coast has accommodation packages to suit every traveller, holiday maker and budget. From affordable cabins , houses and villas to grass camp and caravan sites . Enjoy this Gold Coast Holiday Park and socialise with friends on the private deck of our self-contained Deluxe Villas, relax with family in our three or four bedroom Garden Houses or relax poolside in a sunlounge and watch the kids (big and small) enjoy the waterslide and heated pool while the little ones splash in the kiddies pool and play on the junior and ninja playground. CHECK AVAILABILITY VILLAS HOUSES STUDIOS POWERED SITES GROUP ACCOMMODATION Reviews Here's what others say...  ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 × ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 × ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 × ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and ... Anneke M | GOOGLE REVIEW | 30/01/24 ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and had such a great time there. The staff at check-in was so nice and helpful with loads of tips to do in the area plus they had a great selection of entertainment happening for the kids. We'll definitely be back! Anneke M | GOOGLE REVIEW | 30/01/24 × ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 × READ MORE REVIEWS Nobby Beach Holiday Village Park Map Still not convinced? Take a look around the village... VIEW PARK MAP Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/facilities",
      "text": "Facilities - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Facilities HOME » FACILITIES CHECK AVAILABILITY: Check in/out Guests Adults Children Infants There’s something for everyone at Nobby Beach Holiday Village! After an action packed day in the theme parks, exploring the rainforests or on the green, you’ll be able to relax and unwind in comfort with all the facilities we offer at Nobby Beach Holiday Village. Regularly serviced and maintained to the highest standard, our facilities are clean, modern and safe. Whether you’re happy to relax around the village or feel like venturing out, everything you need is within close reach here at Nobby Beach Holiday Village. Water Slide Slip down our 35m MEGA waterslide. Operating from 9am – 5pm Monday to Saturday and 9pm until 4pm on Sundays and public holidays. BBQ & Camp Kitchen Hang out in our entertainment area and state of the art camp kitchen with stone bench tops, gas cookers, BBQ’s, instant hot water boiler, glass fridge and seating for 30. Ninja Playground Take on our ninja challenge and become Nobby’s next Ninja Warrior! Swing between 3 sets of monkey bars, climb up 2 sets of cargo nets, be a monkey on the trapeze and jungle ropes, challenge your mate on the delta rings, flip around on the dip and horizontal bars and slide down the fireman poles. Junior Playground With the addition of new shade sails, the younger kids can play on the outdoor junior playground while protected from the sun. Includes, a dual slide, monkey bars, tunnel, fireman’s pole and naught and crosses game. Swimming Pools Enjoy swimming in our 2 outdoor pools, heated to a perfect 28 degrees for year round fun! Whether you’re a water baby, or more of a “sun-lounger” you won’t be disappointed. With a toddlers pool separate to the main pool, you’ll be able to let the little ones paddle to their hearts content! Open 8am to sunset. The Hub / Games Room The Hub – a multi-purpose room that transforms from a games and bookable meeting room to a Kids Club in the holidays. The Hub includes an extra-large flat screen TV (perfect for movie nights), lounges, arcade games and all the extras that you have come to love and know in a holiday park, including books, board games, tables and chairs and an oven. Free Wi-Fi Free public WiFi is available for all park guests in hotspots around the park, i.e. the Kiosk, Camp Kitchen and The Hub (up to 7000MB per booking). Baby Facilities Our modern family room includes a change table, shower, baby bath, sink with vanity and toilet. On-Site Mini Mart Our mini-mart has a variety of food, drinks and holiday essentials plus a large range of tourism brochures. Open Monday – Saturday from 8am – 6pm, and from 9am – 5pm on Sunday and Public Holidays. Gated Complex Relax and let the kids play within the safety of our secure park. All guests receive a unique access code for entry and exit. Board Games & DVD Hire Sure… you might have brought your iPad, but there’s nothing like a board game to bring out the nostalgic laughs. After a massive day in the sun, enjoy an evening of good old fashioned family fun! Grab some free board games from reception, DVDs are available for free too! You’ll find Monopoly, Cluedo, Chess and more! Modern Amenities Our modern Men’s and Ladies amenities include a number of showers with change room facilities, basins and hand driers. Laundry Facilities Doing the laundry while on holidays is not a must, however our laundry facilities with secure entry and coin operated dryers and washing machines, will satisfy the most astute washer. If you forget to pack your own laundry powder, our onsite mini-mart will help you out. Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/",
      "text": "Gold Coast's Best Holiday Park - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Experience the Gold Coast’s Best Family Holiday Park Welcome to your new favourite family holiday destination Your gateway to a Gold Coast adventure! Centrally located in the heart of the Gold Coast, our Caravan Park offers affordable accommodation . Hop on a bus from our doorstep to reach theme parks , Surfers Paradise, shopping centres and the hinterland. Begin your coastal paradise journey today! Proud member of G’day Parks Enjoy exclusive benefits with us! G’day Rewards members receive 10% off stays (up to $50)*. Not a member yet? Contact Nobby Beach Holiday Village to join and start enjoying the perks! Create unbeatable family memories Make Nobby Beach Holiday Village your choice for a memorable Gold Coast family getaway . BOOK TODAY Families COUPLES GROUPS Looking for a hot deal? VIEW SPECIAL OFFERS Accommodation Sites, Studios, Villas and Houses… Affordable family-friendly accommodation on the Gold Coast Whether you’re holidaying with the family or getting away with a group of friends, we cater to travellers and holidaymakers who appreciate comfort, cleanliness and excellent value for money. Nobby Beach Holiday Village offers a full range of accommodation and powered caravan and tent sites to suit couples , families , groups or independent travellers looking for a friendly home away from home. VIEW ACCOMMODATION Powered Sites Studios Villas Houses Facilities Endless adventure awaits… Award-winning leisure and adventure destination We’ve got your ticket to boundless possibilities and cherished memories. Our village is your playground for non-stop fun. Dive into our fabulous facilities, including inviting swimming pools, an exhilarating water slide, epic playgrounds, and an array of games for endless enjoyment. School holidays and special weekends are when Nobby Beach Holiday Village comes alive, with an extensive entertainment program that will keep everyone entertained. Your holiday adventure begins here – where possibilities are limitless! VIEW FACILITIES Nobby Beach Holiday Village Waterslide Water Slide & Pool GAMES ROOM Nobby Beach Holiday Village Playground PLAYGROUNDS Nobby Beach Holiday Village Camp Kitchen CAMP KITCHEN Explore our park PARK MAP Things To Do On the Gold Coast… Beyond our doorstep you’ll find the country’s top theme parks, fantastic shopping, exquisite cuisine, pristine beaches and opportunities to connect with nature. There’s something to captivate everyone! Be sure to pre-book your tours & attractions so you don’t miss out. Nobby Beach is a culinary paradise with a wide array of dining options just around the corner. Explore the Nobby Beach dining precinct right across the road, where you’ll find alfresco cafe’s, bars boutiques and top-notch restaurants. Whether you’re seeking fun or relaxation, it’s all nearby! SEE THINGS TO DO THEME PARKS BEACHES ENTERTAINMENT MARKETS SHOPPING NATURE Reviews Here's what others say...  ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 × ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 × ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 × ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and ... Anneke M | GOOGLE REVIEW | 30/01/24 ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and had such a great time there. The staff at check-in was so nice and helpful with loads of tips to do in the area plus they had a great selection of entertainment happening for the kids. We'll definitely be back! Anneke M | GOOGLE REVIEW | 30/01/24 × ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 × READ MORE REVIEWS Blog Latest News… Gold Coast Events – August & September! Aug 20, 2025 Hey there, holidaymakers! Guess what? The Gold Coast is absolutely buzzing with exciting events this August and September, and if you're staying with us at Nobby Beach Holiday Village,... read more Nobby Beach entrance returns to Gold Coast Highway Aug 6, 2025 NEW ENTRANCE FAQ We’re thrilled to share the latest updates about the changes to our entrance and reception systems designed to bring you a safer, more efficient check-in experience. 🚪... read more The Ultimate Guide to Easter School Holidays on the Gold Coast Mar 13, 2025 Easter school holidays are the perfect time for a family getaway, and there’s no better place to celebrate Easter Events & activities than on the Gold Coast! With stunning beaches,... read more READ MORE ARTICLES Awards Multi Award-Winning Holiday Park BOQE-2025-Stamp CCWK Best Holiday Park Awards Logo_WHITE tripadvisor-2024 BOQE2024 Booking-Award-2024 CCWK-Award-2023 CCWK2022 CCWK2021 Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/travellers-choice/",
      "text": "2024 Traveller's Choice Award Winner - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now 2024 Traveller’s Choice Award Winner May 13, 2024 We are thrilled to announce that Nobby Beach Holiday Village has once again secured a place among the elite by clinching the highly coveted 2024 Traveller’s Choice Award! This prestigious accolade stands as a testament to our enduring dedication to excellence in hospitality and guest satisfaction. It marks the sixth consecutive year that Nobby Beach Holiday Village has been recognised for its commitment to delivering exceptional experiences to our valued guests. We are deeply grateful for the unwavering support and invaluable feedback from our guests, which have been instrumental in our continued success. Your trust in us motivates us to continually raise the bar and strive for perfection in every aspect of your stay. At Nobby Beach Holiday Village, we take immense pride in curating unforgettable memories for families, couples, and friends alike. From our cozy accommodations to our extensive array of amenities and activities, we are committed to exceeding your expectations and ensuring that every moment spent with us is truly remarkable. This remarkable achievement would not have been possible without the dedication and hard work of our exceptional staff. Their passion for delivering unparalleled service and genuine care for our guests have been the cornerstone of our success. To all our esteemed guests, we extend our sincerest gratitude for choosing Nobby Beach Holiday Village as your preferred destination. Your glowing reviews and constructive feedback inspire us to continually enhance our offerings and tailor our services to meet your evolving needs. Join us at Nobby Beach Holiday Village and experience firsthand why we have been honored with the 2024 Traveller’s Choice Award. Whether you’re seeking relaxation, adventure, or quality time with loved ones, we invite you to embark on an unforgettable journey with us. Book your stay today and discover why we are a Trip Advisor’s Excellence Award winner for 2024! Enjoy this article? Share it with your mates here: Search This Site Search SHOWING RESULTS FOR: {phrase} Displaying {results_count} results of {results_count_total} LOADING MORE... Trending Articles Best Caravan Park Near Broadbeach The Top 10 restaurants in Nobby Beach, Gold Coast The Best of Nobby Beach Dining Win a Gold Coast family holiday prize package Gold Coast Group Accommodation Tags award winning | Award Winning Holiday Park | Excellence Award Winner | Trip Advisor | Trip Advisor Award | TripAdvisor2024 ← Indulge in Luxury: The Oxley's Arrival Transforms Nobby Beach! Whale Watching on the Gold Coast → You might also like… Dec 23 2024 Queensland’s Best Holiday Park Nobby Beach Holiday Village Secures 2nd Place as Queensland's Best Family Holiday Park in the Caravan & Camping with Kids Awards 2024! We are thrilled to announce... Dec 28 2023 Queensland’s Best Holiday Park Nobby Beach Holiday Village Clinches 3rd Spot in Caravan & Camping with Kids Awards 2023! We are thrilled to share that Nobby Beach Holiday Village has once again... Aug 03 2023 Finalist in Jayco’s Favourite Family Destination Discover the Best Family Destination - Nobby Beach Holiday Village! ** VOTING HAS NOW CLOSED ** We are beyond excited to announce that Nobby Beach Holiday Village is a... Jun 07 2023 2023 Traveller’s Choice Award Winner We are overjoyed to share the exciting news that Nobby Beach Holiday Village has once again been honored with the esteemed Trip Advisor Excellence Award for 2023! This... Dec 28 2022 Queensland’s Best Holiday Park Nobby Beach Holiday Village awarded 3rd Best Holiday Park in Caravan and Camping with Kids Awards for 2022   The team at Nobby Beach Holiday Village are proud to... Aug 18 2022 Nobby Beach recognised as a Best of Queensland Experience Nobby Beach Holiday Village has been recognised by Tourism and Events Queensland as a \"Best of Queensland Experience for 2022.\" This recognition places us as one of the... Jun 01 2022 2022 Traveler’s Choice Award Winner Nobby Beach Holiday Village: An Award-Winning Holiday Park on the Gold Coast We are thrilled to announce that Nobby Beach Holiday Village has once again been recognised... Feb 03 2022 Voted as one of Queensland’s Best Holiday Villages Nobby Beach Holiday Village awarded 3rd Best Holiday Park in Caravan and Camping with Kids Awards Nobby Beach Holiday Village are delighted to announce that we were... May 13 2021 Best Holiday Park – 3rd Year Running! Nobby Beach Holiday Village are delighted to have received Tripadvisor's Traveler's Choice Award for 3 years running 2019, 2020 & 2021.  Being recognised as one of... Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/stay/villas/",
      "text": "Villas - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Villas HOME » STAY » VILLAS CHECK AVAILABILITY: Check in/out Guests Adults Children Infants Houses $ Garden Penthouses $ Garden House 4-Bedroom $ Garden House 3-Bedroom Villas & Cabins $ Poolside Penthouses $ Deluxe Poolside Villas $ Deluxe Tropical Villas $ Deluxe Seabreeze Villas Studios $ Standard Studios $ Garden Studios $ Basic Studios Powered Sites $ Premium Powered Sites $ Garden Premium Powered Sites $ Standard Powered Sites $ Garden Powered Sites $ Grass Powered Sites Group Accommodation Couples Families Caravan Clubs Cabins & Villas Affordable Gold Coast accommodation villas At Nobby Beach Holiday Village, we offer a wide range of clean, modern, and affordable Gold Coast Villas and Cabins, perfect for couples and families seeking a great holiday experience with all the comforts of home. Centrally located on the Gold Coast, our Holiday Park features modern facilities for the entire family to enjoy, including two heated pools, a mega waterslide, an undercover playground, a state-of-the-art Camp Kitchen, a modern amenities building, an on-site mini-mart, and a chill-out room. If you’re unsure which of our Villas or Cabins would best suit your stay, contact our friendly team, and they will happily assist you with your booking. Stay up to date with unique local activities and last-minute specials on our Facebook and Instagram pages. CHECK AVAILABILITY Poolside Penthouses 2 BED 1.5 BATH Sleeps 6 Discover the allure of our 2-storey Poolside Penthouses, seamlessly blending home-like comforts with captivating pool views. Our innovative lockable fencing system ensures both privacy and group-friendly mingling. VIEW DETAILS BOOK NOW Deluxe Poolside Villas 2 BED 1 BATH Sleeps 6 Poolside accommodation at its best! Our brand new Deluxe Poolside Villas, perfect for a family holiday or a group of friends wanting to relax and unwind with all the comforts of home. VIEW DETAILS BOOK NOW Deluxe Tropical Villas 2 BED 1 BATH Sleeps 6 Our modern 2-bedroom Deluxe Tropical Villas are the perfect Gold Coast accommodation for families, combining resort-style accommodation with contemporary living. VIEW DETAILS BOOK NOW Deluxe Seabreeze Villas 2 BED 1 BATH Sleeps 6 Our modern 2-bedroom Deluxe Seabreeze Villas combine resort-style accommodation with contemporary living and are perfect to help make your holiday experience as enjoyable and comfortable as possible. VIEW DETAILS BOOK NOW Reviews Here's what others say...  ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 × ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 × ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 × ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and ... Anneke M | GOOGLE REVIEW | 30/01/24 ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and had such a great time there. The staff at check-in was so nice and helpful with loads of tips to do in the area plus they had a great selection of entertainment happening for the kids. We'll definitely be back! Anneke M | GOOGLE REVIEW | 30/01/24 × ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 × READ MORE REVIEWS Nobby Beach Holiday Village Park Map Still not convinced? Take a look around the village... VIEW PARK MAP Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/specials/gday-rewards/",
      "text": "G'day Rewards Discount - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Specials HOME » SPECIALS » G’day Rewards Discount CHECK AVAILABILITY: Check in/out Guests Adults Children Infants BOOK NOW BACK TO SPECIALS G’day Rewards Discount | Expires: 31 Dec 2025 We LOVE REWARDING our G’day Parks Members! We are proud to be a member of G’day Parks and just for being a G’day Parks Member with G’day Rewards you will receive: 10% OFF on all*: Studios, Villas and Houses Powered Sites SAVING you up to $50 per stay FREE Wi-Fi FREE parking (one vehicle per booking) If you’re not a G’day Rewards Member, simply add a G’day Rewards membership when booking your accommodation online with us or please contact us at Nobby Beach Holiday Village to purchase your membership! Like us on Facebook and Instagram and subscribe to our monthly e-newsletter to receive exclusive specials. *Subject to availability and cannot be used in conjunction with any other offer. Stay 7, Pay 6* → You might also like… Flash Sale Read More Currumbin Sanctuary Family Explorer Read More Early Bird Sale Read More Stay 7, Pay 6* Read More Reviews Here's what others say...  ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 × ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 × ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 × ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and ... Anneke M | GOOGLE REVIEW | 30/01/24 ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and had such a great time there. The staff at check-in was so nice and helpful with loads of tips to do in the area plus they had a great selection of entertainment happening for the kids. We'll definitely be back! Anneke M | GOOGLE REVIEW | 30/01/24 × ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 × READ MORE REVIEWS Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://www.gclr3.com.au/goldlinq/gclr3/support-local-business/business-registry-list",
      "text": "Business registry list | GoldlinQ Javascript required: This interactive experience requires javascript for optimal performance. Please enable javascript if disabled, or reload the page. Insecure browser/WebGL disabled: There are security and user experience issues with your current browser. A secure modern browser with WebGL enabled is required to display interactive maps and other features. Gold Coast Light Rail Stage 3 Broadbeach to Burleigh Heads Home About Project overview Infrastructure Sustainability Rating Project design Construction Current works Construction archive Constructing GCLR3 Managing construction impacts Constructing Burleigh Constructing Nobby Beach Constructing Lower Gold Coast Highway Businesses Information for businesses Community Love Your Local Trader Directory Community Fund Events Community engagement Science Tram Learning Hub More information Document library Suppliers and employment News and media Contact us Register for updates Business registry list View on the map Filter businesses by category Hotels and accommodation Food and restaurants Retail and shopping Services Other Register for updates Contact us Accessibility Connect with us on Instagram @lightrailstage3 Home Jobs Privacy policy Document library Other languages News Interactive map Contact Translink © 2025 GoldlinQ Privacy policy Powered by لغة 语言 Ngôn ngữ Share this Thank you for using the light rail project web portal. GoldlinQ invites you to share this information with your friends, family and colleagues via social media or email. Share this via email Share this on Facebook Share this on Twitter Share this on LinkedIn Traffic Alert AUGUST 2023: TRAFFIC ALERT GOLD COAST HIGHWAY, MERMAID BEACH TO BROADBEACH Motorists are advised that parts of the northbound carriageway on the Gold Coast Highway between Markeri Street and Cronulla Avenue, Mermaid Beach, will continue to be reduced to one lane. Lane closures will continue throughout August and September 2023. More information Gold Coast Light Stage 3 website Gold Coast Light Rail | Department of Transport and Main Roads website Season's Greetings The GCLR3 project will shut down for two weeks during the summer holiday season. Construction wraps up on Friday 23 December 2022 and resumes on Monday 9 January 2023. On behalf of the team, we’d like to wish you a safe, happy festive season. If you need to get in touch over this time, you can reach us at 1800 312 600. Broadbeach South station Mermaid Beach station Mermaid Beach South station Christine Avenue station Miami North station Miami station Nobby Beach station Burleigh Heads station Second Avenue station Business directory registration Disclaimer & Privacy Policy Disclaimer The information on this site is intended for general reference only. All content is the property of the John Holland Group and should not be reproduced, copied or tampered with. The John Holland logo is a company trademark, as such it should not be downloaded or copied. Although we check and attempt to maintain the accuracy of information presented in this website the general nature of the information and the variability of the subject matter means that information is not complete. The passage of time, may on occasions lead to information becoming outdated. Accordingly, no warranty is given as to the completeness or accuracy of the information presented and we ask that you acknowledge this situation and accept the above conditions. Privacy The John Holland Group of companies is committed to protecting the privacy of individuals. The protection of personal information in the private sector is required by the Privacy Act 1988 as amended by the Privacy Amendment (Private Sector) Act 2000 (\"Act\"). All employees and officers of John Holland are expected to comply with the Act and John Holland's policies and procedures concerning the protection of personal information. These policies and procedures apply to all our web pages at www.johnholland.com.au including project specific websites, (\"the Site\"). They explain our practices with regards to collection and processing of any personal information (i.e. information from which an individual's identity is apparent or can be reasonably ascertained) and that may be collected as a result of your use of the Site. Our policies and procedures are based on the following principles: privacy of personal information is of paramount importance to John Holland; your personal information will not be shared, other than in accordance with law and our policies and procedures or without your permission where required in accordance with the Act; and we will only use your personal information for the purpose for which it was provided. What information do we collect? This Site allows you to contact John Holland and companies associated with John Holland by submitting webforms and sending e-mails, for the purposes of: subscribing or unsubscribing to newsletters, media releases or other communications; requesting information about John Holland, handling enquiries, process complaints, provide updates on John Holland projects including campaigns and competitions; or making other enquiries. By sending emails, you will be providing us with certain personal information, which may include your name, e-mail address and any other details you include in your e-mail and webforms. This information is collected by us for the purpose of dealing with your request. We may not be able to deal with your request without this information. We do not collect any other personal information via the Site. John Holland uses cookies and other digital identifiers that fall into the following categories: Site performance indicators: these give us information on how our websites are used, so that we can make the necessary improvements or amendments to make your experience a better one. Community Analytics Cookies: these give us the statistics to understand how many people are on our website, which areas are popular and which areas we need to work on. You can always disable the use of cookies by changing the security settings of your browser. However, this may affect how some items are displayed on our website. John Holland may collect, use and/or share your location data so as to provide you with location-based services. Please be aware that your location data may only be tracked through an opt-in process which most browsers and devices will notify you of. No specific location data will be collected without your authorisation being provided. What do we use personal information for? Any personal details that you provide as a result of accessing the Site, submitting webforms, or sending e-mails will be used for the purpose of dealing with your request or enquiry and providing updates on John Holland projects including campaigns and competitions. This may involve disclosing your personal information to other companies within the John Holland group of companies, or to service providers who assist us in operating our business. These organisations are required by John Holland to comply with our privacy related policies and procedures. If your request involves subscription to newsletters or other material or requires us to send you communications, your details will be provided to our Corporate Affairs Department. Your details and information about the communications you wish to receive will be held in a Database and used for the purpose of administering your request. The Corporate Affairs Department may use your e-mail details to contact you from time to time to provide you with information about John Holland. With regard to all other enquiries, your details will only be accessible and used by personnel dealing directly with your request. We do not use or disclose any personal details that you provide to us for the purposes of direct marketing. Disclosing Personal Information As noted above, we may share personal information with related companies or with contractors performing services for John Holland which are required by John Holland to comply with this policy. John Holland will only make such disclosures to achieve the purpose for which the information was provided. Otherwise, John Holland's policy is not to disclose any personal information to any unrelated third party, except with consent or where we are required by law to do so. Retention and Disposal of Information John Holland will only keep personal information it needs for the purpose for which it was collected. John Holland will dispose of such information when it has no further need to use it or it is required by law to do so. Email Security In line with our policy on email security, any emails that you send will be automatically scanned, which could result in certain attachments and styles of message being automatically blocked and forwarded to our IT administrators in order to authorise the content. This is done purely for IT security purposes and our IT administrators will not access the contents of your e-mails once this process is complete. Security of Information You should be aware that the Internet is not a secure environment. However, John Holland uses all reasonable efforts to ensure that any personal information collected is held securely. Accessing and Updating Personal Information Please let us know if your details change and we will make every effort to keep any personal information held up to date and accurate. You can access your personal information and notify us of any change, modification or correction, by contacting the individual to whom the information was first provided. Complaints and Further Information If you have a complaint or require further information about how John Holland handles personal information or any privacy issues please contact our Privacy Officer. For more information about Community Analytics, please see their privacy policy. paqId"
    },
    {
      "url": "https://www.nobbybeachholidayvillage.com.au/guest-information",
      "text": "Guest Information - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Guest Information HOME » PARK INFO » GUEST INFORMATION CHECK AVAILABILITY: Check in/out Guests Adults Children Infants 1 How To Get Here  Park Map p Guest Information  Guest Directory  Facilities t FAQs  Gallery l Blog v Reviews  Gift Vouchers  G'Day Rewards  Park Maintenance  Long Term Rentals i Terms & Conditions Guest Information Everything you need to know about staying with us Welcome to your comprehensive guide to Nobby Beach Holiday Village guest information. Here, you’ll find all the essential details to ensure a comfortable and enjoyable stay at our award-winning holiday park on the Gold Coast. Amenities At Nobby Beach Holiday Village, we provide modern and convenient Gold Coast holiday park amenities designed to make your stay as comfortable as possible. Our park features two well-maintained amenities blocks available 24 hours a day exclusively for our guests. One is centrally located near the Basic Studios, while the other is positioned on the eastern side of the park for easy access. Each amenities block includes clean and spacious men’s and ladies’ toilets and showers, plus one family-friendly bathroom complete with a baby bath and change table—perfect for guests travelling with little ones is located in the camp kitchen closest to the pool. Whether you’re camping or staying in a studio, you’ll enjoy easy access to all the facilities you need during your stay. BBQ & Camp Kitchen The state of the art camp kitchen is equipped with stone bench tops, 6 burner cook top, 3 BBQ’s, instant hot water boiler, glass fridge, toasters and microwaves. Seats 30. Please keep this area clean and tidy for the next guest. Vehicles The speed limit for all vehicles including cars, bikes, skateboards, scooters and motorbikes is 5km. Only one vehicle is allowed per site and must be parked in your allocated car park. Given our limited parking, all other vehicles must be parked outside of the Holiday Villlage boundary. For everyone’s safety, skateboards, rollerblades, bikes and etc are not permitted to be used after dark. Check In & Check Out Accommodation: Check-in is 2.00pm – Check-out is 10.00am Caravan and Camp Sites: Check-in is 11.00am – Check-out is 10.00am Upon arrival, please check in at reception. If you encounter any issues with your accommodation, inform reception within one hour of check-in so we can promptly address them. To avoid additional cleaning fees, ensure BBQs, utensils, and crockery are cleaned and stored appropriately. Accommodation If there are any problems with your accommodation, please inform reception within 1 hour of check-in. We will do whatever we can to reasonably rectify the situation, If applicable, please ensure your BBQ, used utensils and crockery are cleaned and put away. A cleaning fee may apply. Pool Area, Playground & Waterslide The pool area is open from 8:00am – 8:00pm. The waterslide is operational between 8:00am and 5:00pm and until 4:00pm on Sundays and public holidays. We ask that you abide by all pool, playground and waterslide rules for the safety of all guests. Wristbands must be worn in the pool area at all times. The pool area is unsupervised, children under 15 require parent/guardian supervision when in the pool area. For a full list of rules, download our Park Map under Park Info. Quiet Time Everyone is here for a good time, and a good time means something different to everyone, so we ask that noise is kept to a minimum at all times. Young and old enjoy a sleep in after an exhausting day of entertainment or just lazing by the pool so please observe ‘quiet time’ from 10pm to 7am. Visitors Visitors are welcome whilst you are present on site. You are responsible for your guest’s behavior at all times. All visitors to the park who want to use the park’s facilities (eg. pool, showers, etc) or stay overnight must first be registered with the office and any fees paid for. All guest’s vehicles must be parked outside the Holiday Village boundary and not in the reception or visitors car park. Smoking Smoking is not permitted in any of our accommodation or in any of the buildings, common areas, the pool area, BBQ or entertainment areas or where there is play equipment. If you smoke in accommodation there is a cleaning fee of $175. Rubbish To keep the park clean and tidy for everyone please use the appropriate rubbish containers placed throughout the park, which are marked on your park map. Pets Sorry, pets are not allowed in the park. We appreciate your understanding and cooperation. Not Allowed Please be kind, courteous and considerate to others. Unlawful or excessive/aggressive acts will not be tolerated. Violence, vandalism, theft, use of illegal drugs, abusive behavior, bad language or intimidating behavior of other park facilities, park equipment, tenants or their belongings, park holiday guests or visitors, park management or employees will not be tolerated. All of these acts are considered unlawful in the opinion of management. For the benefit of all tenants, guests, employees and contractors on site, any unlawful act will not be tolerated by park management and you may be asked to remove yourself from the Holiday Park. Additional Resources Park Map: Download Here Guest Directory: View Online Frequently Asked Questions: Read FAQs Nobby Beach Holiday Village Park Map Still not convinced? Take a look around the village... VIEW PARK MAP Reviews Here's what others say...  ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 ★ ★ ★ ★ ★ This was the best and most relaxing holiday we had had with our kids in yesrs! the kids were always busy meeting new friends at the park and the obstical course and pool and we got to sit back and watch them... sometimes from our aparatment wchich was super close... Love the shops and its ony 10 min walk to the beach... will definatley be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B | GUEST FEEDBACK SURVEY | 25/07/24 × ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 ★ ★ ★ ★ ★ Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K | GUEST FEEDBACK SURVEY | 5/06/24 × ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 ★ ★ ★ ★ ★ Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B | BOOKING.COM | 1/03/24 × ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and ... Anneke M | GOOGLE REVIEW | 30/01/24 ★ ★ ★ ★ ★ Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ's and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and had such a great time there. The staff at check-in was so nice and helpful with loads of tips to do in the area plus they had a great selection of entertainment happening for the kids. We'll definitely be back! Anneke M | GOOGLE REVIEW | 30/01/24 × ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 ★ ★ ★ ★ ★ Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M | AGODA REVIEW | 06/02/24 × READ MORE REVIEWS Awards Multi Award-Winning Holiday Park BOQE-2025-Stamp CCWK Best Holiday Park Awards Logo_WHITE tripadvisor-2024 BOQE2024 Booking-Award-2024 CCWK-Award-2023 CCWK2022 CCWK2021 Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    },
    {
      "url": "https://www.booking.com/hotel/au/nobby-beach-holiday-village.en-gb.html",
      "text": "Nobby Beach Holiday Village, Gold Coast (updated prices 2025) Skip to main content ARS List your property Register Sign in Stays Flights Car rental Attractions Airport taxis More Check-in date — Check-out date 2 adults · 0 children · 1 room Search Home Hotels All holiday parks Australia Queensland Gold Coast Nobby Beach Holiday Village (Holiday park) (Australia) deals Overview Info & prices Facilities House rules Guest reviews (1,060) More Reserve We Price Match Beach Nobby Beach Holiday Village Nobby Beach Holiday Village 2200 Gold Coast Highway, Mermaid Waters, 2200 Gold Coast, Australia After booking, all of the property’s details, including telephone and address, are provided in your booking confirmation and your account. – Great location - show map +123 photos Scored 8 8.0 Rated very good Very good 1,060 reviews Facilities 8.2 Cleanliness 8.1 Comfort 8.2 Value for money 8.1 Location 8.5 Total 8.0 Free WiFi 6.8 9.0 9.0 Top-rated beach nearby Top-rated beach nearby You might be eligible for a Genius discount at Nobby Beach Holiday Village. To check if a Genius discount is available for your selected dates sign in . Genius discounts at this property are subject to book dates, stay dates and other available deals. About this property Just 500 metres from the beach, Nobby Beach Holiday Village offers self-contained air-conditioned accommodation in the heart of the Gold Coast. The swimming pool has a waterslide and wading pool.\n\nNobby Beach Holiday Village Gold Coast is just a 10-minute drive from Surfers Paradise and 20 minutes’ drive from Gold Coast Airport. Jupiter’s Casino and Pacific Fair Shopping Centre are 3 km away.\n\nFacilities include a BBQ area, convenience store, internet kiosk and self-service laundry facilities. Guests have access to a children’s playground, board games, DVD rentals and bicycle hire.\n\nEach villa, cabin and holiday unit includes a DVD player, flat-screen TV and a seating area. All have a kitchenette with refrigerator, toaster, microwave and tea/coffee making facilities. Couples particularly like the location — they rated it 8.6 for a two-person trip. Distance in property description is calculated using © OpenStreetMap Most popular facilities 3 swimming pools Free parking Free WiFi Family rooms Non-smoking rooms BBQ facilities Laundry Kids' club Terrace Property highlights Top location: Highly rated by recent guests (8.5) Free private parking available on-site Reserve Save the property Sign in, save money To see if you can save 10% or more at this property, sign in Sign in Create an account Availability We Price Match Select dates to see this property's availability and prices Check-in date — Check-out date 2 adults · 0 children · 1 room Search Room type Number of guests Standard Studio 1 bunk bed and 1 large double bed × 4 + Show prices Basic Studio with Shared External Bathroom (4 Guests) 1 double bed and 1 bunk bed × 4 + Show prices Deluxe Tropical Two-Bedroom Villa Bedroom 1 1 large double bed Bedroom 2 2 bunk beds × 6 + × 4 Show prices Deluxe Poolside Two-Bedroom Villa Bedroom 1 1 large double bed Bedroom 2 2 bunk beds × 6 + × 4 Show prices Three-Bedroom Garden House Bedroom 1 1 large double bed Bedroom 2 1 large double bed Bedroom 3 2 bunk beds × 8 + × 4 Show prices Two-Bedroom Poolside Penthouse Bedroom 1 1 large double bed Bedroom 2 2 bunk beds × 6 + × 4 Show prices Four-Bedroom Garden Penthouse Bedroom 1 2 large double beds Bedroom 2 2 large double beds Bedroom 3 1 bunk bed Bedroom 4 1 bunk bed × 12 + × 4 Show prices Standard Powered Site with Shared Bathroom - Bring Your Own Caravan or Tent × 6 Show prices Premium Powered Site with Shared Bathroom - Bring Your Own Caravan or Tent × 6 Show prices Studio with Garden View 1 double bed + Show prices Garden Powered Sites with Shared Bathroom – Bring Your Own Caravan or Tent × 6 Show prices Garden Premium Powered Sites with Shared Bathroom - Bring Your Own Caravan or Tent × 6 Show prices Grass Powered Site with Shared Bathroom - Bring Your Own Caravan or Tent × 6 Show prices Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Something went wrong. Please try again later. Guest reviews Scored 8 8.0 Rated very good Very good · 1,060 reviews Read all reviews Categories: Staff 8.9 Facilities 8.2 Cleanliness 8.1 Comfort 8.2 Value for money 8.1 Location 8.5 Free WiFi 6.8 Low score for Gold Coast Select topics to read reviews: Pool Location Kids Clean Room Guests who stayed here loved K Katrina Australia “ Stayed in one of the cabins, love that it has the verandah with a BBQ and all the amenities needed. ” Read more Two Australia “ Location. availability of entrance/exit to avoid roadworks on Gold Coast Highway. ” Read more Natalia Australia “ Villa accommodation, cleanliness, water slide and ninja playground, close proximity to local cafes,restaurants, and access to the beach ” Read more V Vickie Australia “ It was right where I had an appointment. \nStaff were the best. Easy to get in n out. ” Read more E Elizabeth Australia “ The pool area is fantastic for families and was very clean. Our villa was superb and was quiet despite the roadworks on the highway. We didn’t hear a thing at all. We will definitely be back as the location is so central to everything. ” Read more Nathan New Zealand “ Super friendly staff, always pleasant and prepared to help, very clean, warm and comfortable. Excellent facilities ” Read more Lgm Australia “ Everything was exceptional. The location was amazing, a short walk to beach, shops and public transport ” Read more Karen Australia “ Proximity to function w were attending.  Cabin was clean, larger than I expected from photos on booking. ” Read more M Marrianne Australia “ The kids club was awesome!! Facilities for the kids were awesome! ” Read more Jessica Australia “ Clean facilities; Secure/gated; ease of access; good location; efficient check-in/out; beautiful staff; well-maintained grounds. ” Read more Read all reviews Managed by Nobby Beach Holiday Village, Gold Coast Company review score: 8.9 Based on 1,042 reviews from 1 property 1 managed property Company information The friendly team at Nobby Beach Holiday Village are dedicated to providing a consistently exceptional holiday experience for all guests. They're experts in the local area and can assist with any queries a guest may have. \n\nThe park offers a tranquil outset with well-maintained gardens and grounds. Take advantage of the coin-operated laundry, clean and modern amenities, and great facilities including two year-round heated pools, a 35m mega waterslide, a modern camp kitchen, a games room, and children's playgrounds. Property information Whether you’re holidaying with the family, your partner, a group of friends, or getting away for a solo trip, Nobby Beach Holiday Village caters to all travellers and holidaymakers who appreciate comfort, cleanliness, and excellent value for money.\n\nWith a full range of accommodation options and spacious grass sites for campers and caravans, there’s something to suit every group size and budget. Enjoy all the comforts of home in our modern, fully self-contained villas, cabins, and houses, or take advantage of great rates on our studio apartments. \n\nThe park is located in the heart of the Gold Coast in a safe and secure gated complex and boasts modern facilities such as a modern camp kitchen and BBQ area. Make a splash in the two year-round heated pools and 35m mega waterslide or watch the kids enjoy the children's playground.  \n\nWith so many amazing attractions to explore on the Gold Coast, you’ll enjoy having everything at your doorstep including public transport to take you to theme parks, great dining options, patrolled beaches, local food markets featuring global street food & live music, convenience stores, boutique shops and more.  Secure your booking today. Neighbourhood information Nobby Beach Holiday Village is centrally located in the heart of the Gold Coast, located 5 minutes south of bustling Broadbeach. Enjoy a short 5-minute stroll to the sparkling patrolled beaches, local markets and beachfront bike paths or cross the road from our front door to explore the Nobby Beach Shopping & Dining precinct, which is dotted with alfresco cafes, casual and fine dining restaurants, boutique shops, bars, a post office, chemist and bottle shop. Take advantage of public transport right out the front of the village that can take you to all the attractions including theme parks, Pacific Fair Shopping centre and more. You really have everything you need right on your doorstep. \n\nThe park is in a safe and secure gated complex and boasts modern facilities such as a state of the art camp kitchen and BBQ area. Make a splash in the two year-round heated pools and 35m mega waterslide or relax in the spacious, comfortable accommodation options. With fully-self contained accommodation options or the option to stay in a simpler room, Nobby Beach Holiday Village has something to suit every holidaymaker's budget. Language spoken English Property surroundings House rules Nobby Beach Holiday Village takes special requests - add in the next step! Check-in From 14:00 to 18:00 Guests are required to show a photo identification and credit card upon check-in Check-out Until 10:00 Cancellation/ prepayment Cancellation and prepayment policies vary according to accommodation type. Please enter the dates of your stay and check the conditions of your required option. Refundable damage deposit A damage deposit of AUD 100 is required on arrival. That's about $ 94,059. This will be collected by credit card. You should be reimbursed within 7 days of check-out. Your deposit will be refunded in full via credit card, subject to an inspection of the property. Children and beds Child policies Children of any age are welcome. Children 15 years and above will be charged as adults at this property. To see correct prices and occupancy information, please add the number of children in your group and their ages to your search. Cot and extra bed policies 0 - 1 year Cot upon request AUD 10 per child, per night Prices for cots are not included in the total price, and will have to be paid for separately during your stay. The number of cots allowed is dependent on the option you choose. Please check your selected option for more information. There are no extra beds available at this property. All cots are subject to availability. No age restriction There is no age requirement for check-in Pets Pets are not allowed. Cards accepted at this property Cash is not accepted Smoking Smoking is not allowed. The fine print Need-to-know information for guests at this property Please note that the total price of the reservation will be charged upon booking. If you expect to arrive after 17:00, please let the property know in advance, using the contact details found on the booking confirmation. Guests are required to show a photo identification and credit card upon check-in. Please note that all Special Requests are subject to availability and additional charges may apply. In response to Coronavirus (COVID-19), additional safety and sanitation measures are in effect at this property. Due to Coronavirus (COVID-19), this property is taking steps to help protect the safety of guests and staff. Certain services and amenities may be reduced or unavailable as a result. Due to Coronavirus (COVID-19), this property has reduced reception and service operating hours. In accordance with government guidelines to minimise transmission of the Coronavirus (COVID-19), this property may request additional documentation from guests to validate identity, travel itinerary and other relevant information, during dates where such guidelines exist. A damage deposit of AUD 100 is required on arrival. This will be collected by credit card. You should be reimbursed within 7 days of check-out. Your deposit will be refunded in full via credit card, subject to an inspection of the property. Show more Show more The best of Gold Coast Click here to see more hotels and accommodation near popular landmarks in Gold Coast Cities Gold Coast Tweed Heads Kingscliff Mount Tamborine Murwillumbah Airports Brisbane Airport Gold Coast Airport Landmarks Dreamworld Warner Bros. Movie World Robina Town Centre Cbus Super Stadium Southport Broadwater Parklands Kirra Beach Helensvale Train Station The Arts Centre Gold Coast Gold Coast Turf Club Mount Warning National Park Wet'n'Wild Water World Queen Elizabeth Park Gold Coast Sports and Leisure Centre Gold Coast Aquatic Centre Dracula's Cabaret Restaurant Gold Coast Griffith University Gold Coast Campus Harbour Town Gold Coast Gold Coast University Hospital Australian Outback Spectacular Pacific Fair Shopping Centre Miami Marketta Broadbeach North Tram Station Nerang National Park Carrara Indoor Stadium Sports Super Centre Countries Regions Cities Districts Airports Hotels Places of interest Holiday Homes Apartments Resorts Villas Hostels B&Bs Guest Houses Unique places to stay Reviews Discover monthly stays Support Coronavirus (COVID-19) FAQs Manage your trips Contact Customer Service Safety resource centre Discover Genius loyalty programme Seasonal and holiday deals Travel articles Booking.com for Business Traveller Review Awards Car hire Flight finder Restaurant reservations Booking.com for Travel Agents Terms and settings Privacy & cookies Terms of Service Accessibility Statement Partner dispute Modern Slavery Statement Human Rights Statement Partners Extranet login Partner help List your property Become an affiliate About About Booking.com How we work Sustainability Press centre Careers Investor relations Corporate contact ARS Booking.com is part of Booking Holdings Inc., the world leader in online travel and related services. Copyright © 1996–2025 Booking.com™. All rights reserved. Start of dialog content Verified reviews from real guests. We have more than 70 million property reviews, and they're all from real, verified guests . How does it work? 1 It starts with a booking It starts with a booking The only way to leave a review is to first make a booking. That's how we know our reviews come from real guests who have stayed at the property. 2 Followed by a trip Followed by a trip When guests stay at the property they check out how quiet the room is, how friendly the staff are and more. 3 And finally, a review And finally, a review After their trip, guests tell us about their stay. We check for naughty words and verify the authenticity of all guest reviews before adding them to our site. If you booked through us and want to leave a review, please sign in first. Sign in and leave a review End of dialog content Check-in date Check-out date « » Mo Tu We Th Fr Sa Su Close calendar"
    },
    {
      "url": "https://nobbybeachholidayvillage.com.au/reviews/",
      "text": "Reviews - Nobby Beach Holiday Village NOTICE: Upcoming Pool Area closure, click for details. Follow Follow Follow Follow Follow Follow +61 7 5572 7533 Home Stay Play Things To Do Park Info Specials Contact Book Now Home Stay Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Basic Studios Powered Sites Premium Powered Sites Standard Powered Sites Grass Powered Sites Group Accommodation Accommodation For Couples Accommodation for Families Play Park Activities Our Facilities Gold Coast Events Local Attractions Things To Do Theme Parks Dreamworld Movie World Wet n Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Mermaid Beach Miami Beach Burleigh Heads Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Gold Coast Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium – AFL Suns CBUS Super Stadium – NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Nobby Beach North Burleigh Heads Shopping Grocery Stores Pacific Fair Shopping Centre Harbour Town Marina Mirage Markets Miami Marketta Burleigh Farmers Markets Carrara Markets Surfers Paradise Night Markets HOTA Farmers & Artisan Markets Gold Coast Art & Craft Markets Park Info Getting Here Park Map Facilities Gallery Guest Information Guest Directory Blog Reviews Frequently Asked Questions Gift Vouchers Park Maintenance Long Term Rentals Terms and Conditions Specials Contact Us Book Now Reviews HOME » PARK INFO » REVIEWS 1 How To Get Here  Park Map p Guest Information  Guest Directory  Facilities t FAQs  Gallery l Blog v Reviews  Gift Vouchers  G'Day Rewards  Park Maintenance  Long Term Rentals i Terms & Conditions Guest Reviews Hear what others say… Whether we exceeded your expectations or have something to improve, we want to hear it first from you. LEAVE US A REVIEW Such a hidden gem! ‘Such a hidden gem! We were attending a concert at the Miami Marketta and Nobby Beach Holiday Village was a short walk down the road. Such a good place. Staff were friendly and so kind and the villa we got was bigger than expected. Definitely will come back for a longer stay in the future. 5/5 Check-in: Clear instructions, Easy to find. Felt right at home, Cleanliness 5/5: Spotless furniture & linen. Free of clutter. Squeaky-clean bathroom. Pristine kitchen. Accuracy 5/5: Looked like the photos. Matched the description. Had listed amenities & services. Communication. 5/5: Always responsive. Local recommendations. Proactive. Helpful instructions. Location 5/5: Peaceful. Beautiful surroundings. Private. Great restaurants Ofa Jr 5/5 |  FEB 2025 Holiday It was amazing and so much for kids to do in this beautiful place! Staff were amazing and it was just a feel good place. Bianca 10/10 |  JAN 2025 Amazing! We had a lovely , relaxing holiday prior to Christmas with the family. We were able to secure a pool side villa/room. This was incredibly comfortable, two-story; living room, kitchen, powder room downstairs, x2 bedrooms and bathroom upstairs. Very modern, very comfortable, has all you need (see my photos). The bunk room sleeps up to 4. The staff were so friendly and very accommodating /helpful. So close to the shops, restaurants, public transport and beach! It has a few play grounds and a kids play room. Inside the park you feel like you’re at a resort, it’s also very family friendly, safe and secure. Highly recommend! Rooms: 5/5 Service: 5/5 Location: 5/5 Hotel highlights: Luxury Christine ★★★★★ |  Dec 2024 Always feel safe and well looked after. Having Room 17 when I am on my own helps with the safe feeling aspect. The staff are always helpful and interested in your needs and or/requests. A very pleasant experience. Look forward to returning in the future. Erica A 10/10 |  Nov 2024 Absolutely awesome, daughter loved the slide and pool! Absolutely awesome place to stay great facilities loved the Weber on the verandah so we didn’t have to leave the unit to cook on the bbq! Jordan H 10/10  |  Sept 2024 We have been staying at Nobby’s now for many years, we have watched it grow into a beautiful resort, to suit all travellers. We stayed recently with 4 year old grandson and we all had a ball. Music, face painting and a visit from the lovely Emma with her fish and chips van in Wednesdays. Thanks to the nice staff. See you again soon Julie Julie M ★★★★★ |  Oct 2024 Great park, staff are amazing Especially management, during our stay that had extra things on, live music, Facepainting, food trucks etc. Keep up the great work team. Service: 5/5 Amy W ★★★★★ |  July 2024 Amazing location with friendly and active staff. Close to a lot of places will definitely be staying again. Highly impressed with cleanliness and how safe and secure the park was. Pipiwharauroa (Marie) T 10/10 |  June 2024 Nobbys has it all This is a well-equipped holiday village. Conveniently located to the beach, shops and restaurants on the Gold Coast. It caters for all types of stays from tent campers to Cabin stays. Fantastic BBQ area, camp kitchen, pool, waterslide, laundry, everything you could possibly need for a fun and comfortable stay. The staff were all helpful, happy and friendly, from the cleaning staff, management team and the grounds workers. Donna P 10/10 |  May 2024 Great little caravan park. The Easter holiday activities were absolutely fantastic so thank you to all involved in organising those! Jodie-Lee M 9/10 |  Apr 2024 Friendly welcoming staff! Great facilities and very good room. Great value for money for a holiday park. Chelsea B 10/10  |  Mar 2024 We will be back!! Such a great spot for families and kids. Our children loved it, great swimming pool, kids play area, safe. Room was great and just what we needed, next time we will look at booking a villa 🙂 Vicky M 8/10  |  Feb 2024 We had a great time. The accommodation was good and in a good location, the activities were fun and the waterslide was probably the highlight of my girls stay. Kelly L 10/10  |  JAN 2024 Short stay The faculties were amazing my 5 year old had an absolute blast! We had the best two days to end our living in Queensland as we moved to nsw. What the team did for my son and I made our final days in Queensland beyond anything I could imagine. We will be back for school holidays. Anna 10/10  |  JAN 2024 We had a really nice holiday at Nobby’s When we arrived we were informed when checking in that we had been upgraded to a Villa that was a great surprise and we reapply appreciated that. We were just near the pool in Unit 2 sitting on the Patio reading and doing our puzzles, we loved listening to the kids laughing and having a great time with their friends, reminded us of our own kids when they were little. We strolled down and listened to the live Music which was great, also enjoyed a swim or two. Thanks for your hospitality and how clean the park was, and how all the kids obeyed the signs. Thanks for a great holiday just what we needed. Cheers Julie & Bill McMahon. Julie & B M 10/10  |  DEC 2023 Best place for kids, will always come back Very clean and accessible. Staff is friendly and very accommodating. Will definitely come back. Seree O 10/10  |  DEC 2023 Girls loved the slide and pool, a short walk to the beach and lots to do at the park. The ninja playground was a huge hit! A great place for a family holiday. Julie B ★★★★★  |  Nov 2024 Clean and neat cabins/villas. Great swimming pool with a waterslide, I’ve experienced many parks and generally Nobby is a very nice park,clean ammenities, pool etc. Staff are always friendly in my experience and are visibly always working to make all the areas presentable and comfortable for guests. Jason P 10/10  |  OCT 2023 My family of 4 stayed one of the sea breeze villas for 7 days. We loved it. Villa was clean. Split system in loungeroom and also the bedroom. All the appliances looked brand new and they even leave windows open to air the rooms out once the villas are unoccupied. Kids loved the pool and the slide and the area we stayed in had a grass area for the kids to play around on. The reviews you see will be from people who stayed in the cheaper rooms don’t let this scare you away. It was a nice place overall and we will come back again. Taylor F ★★★★★  |  OCT 2023 Perfect accommodation and location. We will be back It was very tidy. Perfect for a family. Main bed was extremely comfortable and for the first time ever I enjoyed the pillows. Right next to the pool and even with the kids yelling in the pool it was not noisy. We will be back. Colleen W 10/10  |  AUG 2023 Was fun, nice activities for kids, happy with the room setup, heated pool. Close to beach and markets and easy public transport to other places. The kids had a blast. Amanda D 10/10  |  JUL 2023 Best Accommodation on The Gold Coast Always fantastic. Would not go anywhere else. Staff, park facilities and accommodation terrific. Check in and out seamless. Beautiful pool and cooking facilities. Staff go out of their way to make sure your stay is memorable. elwinabet ★★★★★  |  JAN 2025 Holiday · Family Has to be one of the cleanest parks I’ve ever stayed at even the toilet blocks were spotless. 10 out of 10 Rooms: 5/5 Service: 5/5 Location: 5/5 Hotel highlights: Child-friendly, Great value Joshua S ★★★★★  |  Dec 2024 Great Place to stay! We live in brissy and just needed to get away for a few days with the kids- the villas are perfect, felt like ā home away from home- great for families IMO- theres no concern or worry about having kids like there is at a hotel. Vending machines available, pools and slide are great fun if you dont feel like heading out. Its away from the business of the GC but also super close. we will be back for sure! Kassidy 10/10  |  Nov 2024 We always feel so welcome at Nobbys, our favourite Gold Coast holiday place for many years now. Loved the buzz at Saturday nights entertainment. We were also lucky enough to get an upgraded unit. Thanks Nobby Julia M 10/10  |  Sept 2024 Great family stay… Positive: All amenities were clean and close to our studio as we had our grandchildren with us. Pool and playground areas were well presented and clean also. All staff from front of house to cleaners were friendly and helpful. Access in and out of the grounds was easy to navigate and we’ll sign posted. Negative: Nothing, we enjoyed every aspect of our stay!!!. Rina B 10/10  |  Aug 2024 Tremendous staff all round very accommodating Camp kitchen entertainment was great We thank you this is one of the best run parks weve stayed in. Sandy & Phil C 10/10  |  July 2024 Our family travelled interstate and from overseas and booked 8 rooms for our families and children nearby the venue we were celebrating my 60th birthday held on the 1 June. Everything was suited for our stay family friendly and beautifully set up with amenities and swimming pool and playground area Bbq area Beautiful smiling and helpful staff 👌 Met all our needs and thank you and staff for your amazing space and service 👍 Will definitely recommend this space to others 😀 Naomi K 10/10  |  June 2024 Very nice place! Check-in: Clear instructions, Easy to find, Easy to get inside, Flexible check-in, Felt right at home. Cleanliness: Free of clutter, Squeaky-clean bathroom, Pristine kitchen. Accuracy: Looked like the photos, Matched the description, Had listed amenities & services. Communication: Always responsive, Helpful instructions, Friendly. Location: Private, Walkable. Value. Sophia C 5/5  |  May 2024 Too much fun for your little one Perfect holiday in the perfect location. Staff were friendly & kids could play at the water park all day. Definitely be back 10/10 Jay W 10/10  |  Apr 2024 We came here for my daughter’s 10th birthday and the staff were absolutely amazing and delivered a gift to our room for my girls birthday. It made it so special for her. Staying in the poolside penthouse the kids can swim and we can watch them from the deck. Erin P ★★★★★  |  Feb 2024 We will definitely stay again, my family had a wonderful time! There was everything we needed here for a few nights get away. The slide and pool were fantastic, as was the Villa we stayed in- nice and clean, comfortable and spacious Clare M 10/10  |  JAN 2024 A perfect family holiday Great park atmosphere, with everything we needed – a pool, kiosk, food trucks/activities, easy access to the beach and public transport. Highly recommend. Cailtin N 10/10  |  JAN 2024 It was a wonderful venue and we’d gladly stay there again Beautifully kept caravan sites, clean toilets and the shower pressure was amazing. There was plenty for the kids to do and activities on several nights. We partook in Disco Night, Christmas Ornament Painting and the live music and fish and chips on the last night of our stay. Loved being there thank you. Sean R 10/10  |  DEC 2023 Amazing stay, I’ve found my new go to place Very spacious, lovely cold air conditioner, we had theme park tickets but kids preferred to go down the amazing water slide. The amenities were less than one minute from our cabin. Just wonderful. Nothing not to like. Gail S 10/10  |  DEC 2023 Rented a basic studio and it was amazing I was really impressed by it and staff where Also very helpful and polite I will definitely be staying there again when I’m in the area and I plan on bringing my kids and niece’s and nephews as they will love the pool and water slide definitely a great spot for a family vacation and it was also a fair price for its location. Daniel S ★★★★★  |  Nov 2024 Great stay, great staff! The staff was superb and they upgraded us for free, they recommended places and offered help. The lady at the shop also spread her good mood and it was a pleasure popping by. Thank you and hope to enjoy another stay there again! Yaelle R 10/10  |  OCT 2023 Perfect spot to relax Great Park, very clean well kept amenities, perfect geographically situated, with mostly friendly staff that would go out of their way for you. Close to a great variety of cafes, shops and beach. Pool and water slide also great fun. Playground for kids was also great, with a special Ninja area for older kids as well as a hub/lounge area, camp kitchen etc JennyL30 ★★★★★  |  SEP 2023 Excellent! Couldn’t have asked for a better spot to stay. Having a big school group, the villas suited us to a tee. They were clean, tidy and had no issues. Again thank you! Monaro High School 10/10  |  AUG 2023 The best, we will definitely be returning. Rooms perfect for family’s. You have everything you need in walking distance. And plenty to see. Great staff and I felt my kids were safe around the park. Close to shops beach, cafes and anything really. What you need is all within a 5min walk. Kid-friendly, Great value. Janelle M ★★★★★  |  JUN 2023 Better than any caravan park we’ve stayed in in South Australia! The staff were very helpful. The cabin was very clean and the pool and slide was a huge savior in the heat! Kelly W 10/10  |  Jan 2025 Camping at NBHV My family camped and our experience was excellent. There was plenty of activities for the kids of all ages and the activities the village put on for the kids in the lead up to Christmas was wonderful. The whole atmosphere was comfortable and relaxing, the staff were responsive, helpful and friendly. Will definitely be staying here again in future. Pool opening times could have been earlier. Bridgette G 10/10  |  Dec 2024 Holiday · Family Our stay was exceptional! Every Staff Member & Management we encountered were friendly, hospitable and welcoming! Cannot fault them! Facilities were very well maintained! We were lucky enough to spend the V8 supercars weekend here, which during this time Halloween activities were on! Kids were thrilled! DJ, Face Painting & Trick or Treating, what a fantastic idea! We will most certainly be back 🙂 Rooms: 5/5 Service: 5/5 Location: 5/5 Hotel highlights: Child-friendly, Great value Bec C ★★★★★  |  Oct 2024 AMAZING… This was the best and most relaxing holiday we had had with our kids in years! the kids were always busy meeting new friends at the park and the obstacle course and pool and we got to sit back and watch them… sometimes from our apartment which was super close… Love the shops and it’s only 10-minute walk to the beach… will definitely be planning another holiday soon! Big shout out to the receptionist Tracey who was super lovely and the Manager who was always around if we needed anything.. AMAZING PLACE to stay!! Celine B 10/10  |  July 2024 First timers at NBV and most certainly not our last. We absolutely loved it. The deluxe villa, the staff, the atmosphere, the activities for the kids were A+ and we had a blast!! Thanks so much! Muia L 10/10  |  July 2024 The accommodation is very central. There are buses right outside the front door and there are smaller shops. The beach is also very close. The booked room was very, very clean, there was nothing missing in the furnishings and we had a great time! Everything was great. Frauke H 10/10  |  June 2024 Clean, our kids love it. good price for the weekend Is good and nice very clean and have play ground and ninja play ground so many activities to do and have a big swimming pool wish to stay longer but have to head off back to work. Chaichana S 10/10  |  May 2024 Vacation We absolutely loved everything about our stay here. The staff were very friendly. We loved the size of the park, the location but most of all the pool, slide and live music and free face painting. It was definitely worth every cent and we will be coming back! Thank you for helping us create some beautiful family memories ❤️ Service: 5/5 Location: 5/5 MJ K ★★★★★  |  Apr 2024 Great caravan park very clean and well kept. Concrete slabs on caravan sites (not sure if all sites but most) nice looking vabins (didn’t go inside any). Camp kitchen is large open lots of tables, no communal pots n pans so byo. Large pool with massive waterslide. Kids playground just near pool and camp kitched. And also a ‘Ninja play park” for older kids “The Hub” with tables and chairs and games room. Overall has everything covered. Shane W ★★★★★  |  Mar 2024 Our family of 4 stayed in a Basic Studio Apartment with shared bathroom over the Australia Day long weekend and it was so nice. The unit has all you need for a short stay and had aircon and the camp kitchen is just across from the units with BBQ’s and more seating. Bathrooms are also just opposite the units and was neat and clean. The pool and waterslide is great and my bigger kids loved the monkey bar playground. The location is great, lots of restaurants close by and beach also close, we walked to Miami Marketta on Saturday night and had such a great time there. The staff at check-in was so nice and helpful with loads of tips to do in the area plus they had a great selection of entertainment happening for the kids. We’ll definitely be back! Anneke M ★★★★★  |  JAN 2024 This was our 4th time staying here It is a fantastic place to stay. We always recommend it to our friends if they are looking for a place to stay on the Gold Coast. Craig C 10/10  |  JAN 2024 Very happy with everything Awesome surprise that there was activities on for the kids. Staff were amazing. Kirstie G 10/10  |  JAN 2024 Great location and awesome option for school groups Clean cabins and accomodating staff. Kids really enjoyed their stay. Chris F 10/10  |  DEC 2023 Excellent value for money Clean and neat cabins/villas. Great swimming pool with a waterslide, playground areas, etc. Lots of places to eat close by. The staff is helpful. Overall, 10 out of 10. Patrick G 10/10  |  NOV 2023 Great holiday stay The location is walking distance to the beach, cafes, and restaurants. Very convenient and kids enjoyed all the facilities and extra Halloween activities that were on for the kids. It catered well to our family. Amanda S 10/10  |  OCT 2023 Really great management of property Kind, helpful and welcoming fro start to finish. Close to beach, chemist and food. The facilities and pool / waterslide were utilised well and kept tidy. Thanks for a lovely stay. Highly recommended. Andrew E 10/10  |  OCT 2023 A perfect little weekend away! We have been twice now. Both times have had 7 cabins booked- they were so accommodating. Ice cream eating challenge on the Saturday pool side was a laugh. Enjoy your next stay at nobbys beach holiday village. Adriana D ★★★★★  |  SEP 2023 The place is awesome and staff are really great. The atmosphere inside and the guests are really cool, very homely environment. Would like to stay there again in the future. Ronald J 10/10  |  JUL 2023 Perfect first holiday with my 2 babies! Everything was very close to the location. inside the holiday village had playgrounds for the children, pool with slide, a little shop. And only 300m away were the Miami Markets which were open Wednesday/Friday/ Saturday with live music, kid friendly and the best food! also another 300m was the beach, shops, chemist. perfect location, we had the best time! Eleni S 10/10  |  AUG 2023 Awards Multi Award-Winning Holiday Park BOQE-2025-Stamp CCWK Best Holiday Park Awards Logo_WHITE tripadvisor-2024 BOQE2024 Booking-Award-2024 CCWK-Award-2023 CCWK2022 CCWK2021 Join our mailing list Book your next trip with us!  07 5572 7533  *protected email*  2200 Gold Coast Highway, Miami QLD 4220 QUICK Links Home Stay Play Things To Do Tour & Activity Bookings Park Info Specials Contact BOOK NOW GUEST INFO Gift Vouchers Facilities Park Map Guest Info Groups Gallery FAQ Reviews Blog © Nobby Beach Holiday Village. All Rights Reserved. Theme Parks Dreamworld Movie World Wet 'n' Wild Sea World Currumbin Wildlife Sanctuary WhiteWater World Paradise Country Beaches Nobby Beach Miami Beach Burleigh Heads North Burleigh Heads Mermaid Beach Nature & Parks Gold Coast Hinterland Pizzey Park Botanical Gardens Burleigh Headland Walk Dining Nearby Nobby Beach Precinct Miami Marketta Broadbeach Precinct Tours & Attractions Doodlebugs Play Centre The Star Casino Australian Outback Spectacular Putt Putt Mermaid Beach People First Stadium - AFL Suns CBUS Super Stadium - NRL Titans ArtVo Gold Coast Aquaduck Gold Coast Infinity Gold Coast Level Up Arcade Surfers Paradise Golf Club Shopping Grocery Stores Pacific Fair Shopping Centre Robina Town Centre Harbour Town Oasis Shopping Centre Marina Mirage Markets Miami Marketta Burleigh Farmers Market Carrara Markets Surfers Paradise Night Markets HOTA Farmers Artisan Markets Gold Coast Art & Craft Markets Houses Garden Penthouses Garden House 4-Bedroom Garden House 3-Bedroom Villas Poolside Penthouses Deluxe Poolside Villas Deluxe Tropical Villas Deluxe Seabreeze Villas Studios Standard Studios Garden Studios Basic Studios Powered Sites Premium Powered Sites Garden Premium Powered Sites Standard Powered Sites Garden Powered Sites Grass Powered Sites Group Accommodation Accommodation for Couples Accommodation for Families Caravan Clubs Play With Us Park Activities Our Facilities Play On The GC Local Events Local Attractions Before You Arrive How To Get Here Park Map Guest Information Guest Directory FAQs Terms & Conditions About Us Facilities Gallery Blog Reviews Gift Vouchers Park Maintenance Long Term Rentals Terms & Conditions | Privacy Policy | Cancellation Policy | Sitemap BOOK NOW"
    }
  ]
}