{
  "fuentes": [
    {
      "url": "https://www.mhkbeer.com/about-us",
      "email": "info@mhkbeer.com"
    },
    {
      "url": "https://floridacraftdistributors.com/brands/nobo/",
      "email": "admin@flcraft.com"
    }
  ],
  "mails": [
    "admin@flcraft.com",
    "info@mhkbeer.com"
  ],
  "nombre_sitio": "nobobrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mhkbeer.com/about-us",
      "text": "About Us - Manhattan Brewing Company Skip to main content We use cookies to improve site performance and your experience. View our privacy policy for more information OK Go Home About Us Beers MBC Lounge MBC Catering The Brew Deck Join Our Team Shop Wing Wars Contact Us Our Story About Us We're ready to share our beers with Manhattan. With nearly 20 years of collective experience in the craft beer industry, we're focused on brewing and serving high-quality craft beers in a family-friendly atmosphere in the heart of downtown Manhattan. This town is our home, and we want to bring the best possible beer experience and education to the wonderful people of Manhattan. We want to create a place for everyone to come out and have a good time with friends and cultivate a craft beer culture Manhattan can be proud of. Our Team The best and brightest Co-Owners Portraits by Killian Millner Adam Krebsbach Brewer A native of Norton, Kansas, who moved to Manhattan in 2006, Adam's unrelenting creative energy has resulted in a tasty variety of imaginative beers. A tinkerer at heart, Adam is the yin to Garrett's yang; for every traditional style brewed by Garrett, you'll find Adam experimenting with an array of unique ingredients into his beers to challenge and delight beer fans. Adam loves drinking American pale ales, robust porters and Belgian tripels. Garrett Paulman Brewer A professionally trained brewer from the renowned Siebel Institute of Technology in Chicago, Garrett also brings experience in facility management and quality control. Garrett started brewing in 2011 before making the leap to attend Siebel and \"turn pro\" in 2012. You will find Garrett drinking anything hoppy while laughing with friends, family and strangers at the bar. Although he's a Nebraska native, Garrett, his wife and two children are K-State fans in training. Jake Voegeli Sales & Marketing A former K-State football player from Wichita, Kansas, who bleeds purple with his wife and daughter, Jake's journey into craft beer began in college after committing himself to trying a new six pack each week. Jake loves to challenge his palate with hoppy IPAs, sours and barrel-aged stouts, but also loves a well-crafted, delicate pilsner or a traditional English brown ale. An experienced salesman and marketer both in the craft beer and spirits industries, you'll mostly see Jake up front slinging beers or chatting with guests about beer, K-State football, his favorite Ryan Bingham album or his daughter Chloe. Keep up to date with Manhattan Brewing Company on twitter Follow Manhattan Brewing Company on facebook See what's going on at Manhattan Brewing Company on instagram Manhattan Brewing Company,\n\t\t\t\t\t406 Poyntz Ave, Manhattan, KS  66502 785-775-0406 Powered By Merlin® | Privacy Policy | Terms of Use Scroll to top of page"
    },
    {
      "url": "https://floridacraftdistributors.com/brands/nobo/",
      "text": "NOBO • Florida Craft Skip to content Facebook Instagram Linkedin Home Brand Portfolio History News Pay Online × Home Brand Portfolio History News Pay Online Contact Facebook Instagram Linkedin Home Brand Portfolio History News Pay Online × Home Brand Portfolio History News Pay Online Contact NOBO Founded by brothers Tim and Steve Dornblaser in 2015 as a a neighborhood brewery north of Boynton Beach, Florida, NOBO (No Boundaries) Brewing Company developed a loyal fanbase by showcasing their beers at local festivals and charity event. Their beers are classic American styles with some twists. They believe in supporting their community and other local businesses by using local fresh products. NOBO’s brewery unique five-barrel system consists of 5BBL brewhouse with 5-5BBL jacketed fermenters and 2-15BBL  fermenters. Old School Heffe Jalapeño Honey Blonde 2901 IPA French Vanilla Coffee Pot Porter Back To Brands Visit Website Gallery Contact 1405 N. Congress Ave., Suite 12 Delray Beach, Fl 33445 admin@flcraft.com (561) 801-7355 Social Facebook Instagram Linkedin Outreach Product Application © 2021 Florida Craft Distributors Privacy Policy Contact (561) 801-7355 admin@flcraft.com Name Email Company Message Send"
    }
  ]
}