{
  "fuentes": [
    {
      "url": "https://www.northportsymphony.com/maestro",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://www.northportsymphony.com/",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://www.northportsymphony.org/about/",
      "email": "logo-white@2x-300x103.png"
    },
    {
      "url": "https://www.northportsymphony.org/about/",
      "email": "logo-white@2x.png"
    },
    {
      "url": "https://www.northportsymphony.com/gala",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://www.northportareachamber.com/list/member/north-port-symphony-inc-3334",
      "email": "info@northportareachamber.com"
    },
    {
      "url": "https://www.newportsymphony.org/about-us/nso-board-staff.html",
      "email": "execdir@newportsymphony.org"
    },
    {
      "url": "https://www.newportsymphony.org/about-us/nso-board-staff.html",
      "email": "info@newportsymphony.org"
    },
    {
      "url": "https://www.newportsymphony.org/about-us/nso-board-staff.html",
      "email": "youth@newportsymphony.org"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://nppaa.net/symphony_info.html",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://www.northportsymphony.com/musicians",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    },
    {
      "url": "https://www.northportsymphony.com/join",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://www.northportsymphony.com/about",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://ncsymphony.org/contact-us/",
      "email": "ejensen@ncsymphony.org"
    },
    {
      "url": "https://www.northportareachamber.com/members/member/north-port-symphony-inc-3334",
      "email": "info@northportareachamber.com"
    },
    {
      "url": "https://northportsymphony.com/scholarship",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://ncsymphony.org/about-us/",
      "email": "carlos-miguel-prieto@2x.png"
    },
    {
      "url": "https://ncsymphony.org/about-us/",
      "email": "our-story@2x.png"
    },
    {
      "url": "https://ncsymphony.org/about-us/",
      "email": "press-room@2x-min.png"
    },
    {
      "url": "https://ncsymphony.org/about-us/",
      "email": "ejensen@ncsymphony.org"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://ncsymphony.org/about-us/our-people/staff/",
      "email": "ejensen@ncsymphony.org"
    },
    {
      "url": "https://www.northportsymphony.com/boardandstaff",
      "email": "info@northportsymphony.com"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "akriewall@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "cfointerim@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "cjimenez@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "ctaliaferro@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "dgraziano@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "dmoore@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "echarlemagne@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "ganderson@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "gliuanderson@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "gmulchandani@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "haberin@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "jborowski@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "jescueta@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "jgoodale@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "jtan@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "kduda@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "korlando@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "kpruner@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "labrams@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "nsrinivas@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "pchamberlain@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "personnelmanager@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "pleininger@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "rbonassisa@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "rbradshaw@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "rpachucki@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "smcdonald@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "sswearengin@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "szambrano@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "tabedrabbo@njsymphony.org"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "email": "tnguyen@njsymphony.org"
    },
    {
      "url": "https://www.northstatesymphony.org/contactus/",
      "email": "boxoffice@cascadetheatre.org"
    },
    {
      "url": "https://www.northstatesymphony.org/contactus/",
      "email": "symphony@csuchico.edu"
    }
  ],
  "mails": [
    "akriewall@njsymphony.org",
    "boxoffice@cascadetheatre.org",
    "carlos-miguel-prieto@2x.png",
    "cfointerim@njsymphony.org",
    "cjimenez@njsymphony.org",
    "ctaliaferro@njsymphony.org",
    "dgraziano@njsymphony.org",
    "dmoore@njsymphony.org",
    "echarlemagne@njsymphony.org",
    "ejensen@ncsymphony.org",
    "execdir@newportsymphony.org",
    "ganderson@njsymphony.org",
    "gliuanderson@njsymphony.org",
    "gmulchandani@njsymphony.org",
    "haberin@njsymphony.org",
    "info@inzmo.com",
    "info@newportsymphony.org",
    "info@northportareachamber.com",
    "info@northportsymphony.com",
    "info@scibpaints.com",
    "jborowski@njsymphony.org",
    "jescueta@njsymphony.org",
    "jgoodale@njsymphony.org",
    "jtan@njsymphony.org",
    "kduda@njsymphony.org",
    "korlando@njsymphony.org",
    "kpruner@njsymphony.org",
    "labrams@njsymphony.org",
    "logo-white@2x-300x103.png",
    "logo-white@2x.png",
    "nsrinivas@njsymphony.org",
    "our-story@2x.png",
    "pchamberlain@njsymphony.org",
    "personnelmanager@njsymphony.org",
    "pleininger@njsymphony.org",
    "press-room@2x-min.png",
    "rbonassisa@njsymphony.org",
    "rbradshaw@njsymphony.org",
    "rpachucki@njsymphony.org",
    "smcdonald@njsymphony.org",
    "sswearengin@njsymphony.org",
    "symphony@csuchico.edu",
    "szambrano@njsymphony.org",
    "tabedrabbo@njsymphony.org",
    "tnguyen@njsymphony.org",
    "tstuder@astrosecuritymonitoring.com",
    "youth@newportsymphony.org"
  ],
  "nombre_sitio": "northportsymphony.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.northportsymphony.com/maestro",
      "text": "Meet the Maestro | North Port Symphony top of page Sharing the Joy of Music Home About Musicians Meet the Maestro Board and Staff Support Donate Concerts Seat Prices Education Join the Symphony Contact More Use tab to navigate through the menu items. Our Maestro - Robert Romanski A native of Sarasota, Robert Romanski is a graduate of the University of South Florida with Bachelor’s degrees in both applied music and music education, as well as a Master’s degree in conducting. He has also completed ninety Doctoral Credit Hours toward a PhD in Music Education, also at the University of South Florida. The MVP of Conductors - Romanski is hailed by critics as being the “MVP” of Conductors, able to execute Symphonic Literature, Opera, Ballet, Oratorio, Pops, Band AND Choral Repertoire, with expertise and aplomb. Mr. Romanski currently holds the titles of Artistic Director and Principal Conductor of the North Port Symphony, and the Mostly Pops Orchestra of Tampa, Director of Music Ministries at Christ Church, Longboat Key, Co-Artistic Director (and Co-Founder) of the Brandon Choral Society, Music Director and Principal Conductor of the Tampa Bay Opera, and serves as Adjunct Professor of Music at the University of South Florida, Barry University, Eckerd College and Hillsborough Community College. Previous Accomplishments - He has previously served as Artistic Director for the Pinellas Youth Symphony, Director of Choral Activities at Hillsborough Community College, Director of Music Ministries for Ruskin United Methodist Church and First Presbyterian Church of Brandon, Artistic Director of the Sarasota Choral Society, Music Director of the Tampa Ballet, Adjunct Professor of Music at St. Leo University, and Professor of Trumpet at the University of Tampa, Florida Southern College, St. Petersburg College, and the Pinellas County Center For The Arts (PCCA). Robert recently was privileged to have been the Guest Conductor for a special Christmas concert with the world acclaimed Celtic-style women’s group, “Cherish The Ladies,” performing with the Florida Orchestra. Other recent highlights include touring with the Boston Pops Orchestra, serving as the Assistant Conductor for Maestro Keith Lockhart (the Pops’ Florida tour included 10 concerts in 10 days), conducting the orchestral track for a performance of “O Holy Night” for Yanni (seen and heard on Christmas Day, during the ABC Disney Christmas Parade), conducting the soundtrack music for a national Walt Disney World Commercial (the “Balloon Campaign – Celebrate You”), conducting Mozart, Motown and More, with the Florida Orchestra, a Florida Orchestra Super Pops Series, featuring Tito Puente, Jr., directing for acclaimed tenor, Daniel Rodriguez (the “singing policeman”), with the Florida Orchestra, and working on Grammy Winning Recording Artist Jon Secada’s latest CD Release – “Same Dream” In addition to receiving Liner Credit for conducting three of the tracks, Mr. Romanski can be seen in the Enhanced CD video conducting and producing the project), conducting for Frank Wildhorn and Rob Evans (Jekyll & Hyde), serving as Music Director for a State of Florida Hurricane Benefit featuring Patrick Wilson (Raoul, “Phantom of the Opera” Movie), and conducting for Craig Shulman and Kim Crosby, in a Phantom, Les Miz, and Jekyll & Hyde Tribute Concert. He has also been seen conducting the Imaginary Frontier Symphony in Orlando, with President George H. W. Bush as the guest speaker, conducting for James Taylor with the Southwest Florida Symphony, and conducting for Doc Severinsen with the Florida Orchestra. In 2004, his schedule included serving as an International Choral Clinician, taking a Festival Choir on tour to Vienna, Budapest and Prague. On Broadway, Mr. Romanski conducted on the project, Baz Luhrman’s “La Boheme,” and also served as conductor for the Florida leg of the touring production of “Fosse.” Mr. Romanski has conducted orchestras throughout the Southeast, with a variety of guest performers, such as Diane Schurr, Ann Reinking, Larry Elgart, Mickey Gilley, Linda Eder, Roberta Flack, Hulk Hogan, George Steinbrenner and Elvis Wade. He has also performed on stage with hundreds of artists and entertainers, including Henry Mancini, Ella Fitzgerald, Marvin Hamlisch, Liberace, Yanni, Skitch Henderson, Robert Goulet, Donald O’Connor, Carol Channing, Victor Borge, Andy Williams, Joel Grey, Rosemary Clooney, Roberta Peters, Dinah Shore, Burt Bacharach, Peter Allen, the Temptations, and the Four Tops. In addition, he has helped to produce tours for Josh Groban, Peter Cetera, Rod Stewart, Sarah Brightman, Mannheim Steamroller, Il Divo, Dennis DeYoung (STYX), the Moody Blues, Diana Ross and the Irish Tenors. He has also served as the Musical Contractor of the Opera Tampa Orchestra, hiring and managing orchestras for the produced operas at the Tampa Bay Performing Arts Center, working under acclaimed Maestro Anton Coppolla. Partnerships In-Kind Sponsors: Media Sponsor: Mailing Address: ​ North Port Symphony PO Box 7859 North Port, FL 34290 ​ info@northportsymphony.com bottom of page"
    },
    {
      "url": "https://www.northportsymphony.com/",
      "text": "Community Orchestra In Southwest Florida | North Port Symphony | North Port top of page Sharing the Joy of Music Home About Musicians Meet the Maestro Board and Staff Support Donate Concerts Seat Prices Education Join the Symphony Contact More Use tab to navigate through the menu items. Click Here for Seat Prices Sharing the Joy of Music The North Port Symphony was founded in 1983 by a handful of local residents who were interested in playing music for their own enjoyment as well as for the community. St. Paul’s Presbyterian Church served as the Symphony’s home until November of 2001 when we moved to our current home in the Music Suite adjacent to the Performing Arts Center on the North Port High School Campus. The Symphony is comprised of amateur and professional musicians, as well as advanced students. Programs include classical, contemporary and popular music. Our concert season runs November through March. Mission Statement The mission of the North Port Symphony is to share the joy of music. Vision Statement To be the most welcoming community orchestra in southwest Florida and to cultivate a sense of belonging between our patrons, musicians, students, and community. Subscribe Sign up to our newsletter and stay up to date Email By submitting your information, you are granting us permission to email you. You may unsubscribe at any time. Subscribe Thanks for subscribing! Partnerships In-Kind Sponsors: Media Sponsor: Mailing Address: ​ North Port Symphony PO Box 7859 North Port, FL 34290 ​ info@northportsymphony.com bottom of page"
    },
    {
      "url": "https://www.northportsymphony.org/about/",
      "text": "About - Northport Symphony Orchestra Skip to content About Eric Mahl Performances & Events News Support Contact About Eric Mahl Performances & Events News Support Contact DONATE About Us​ Who is the Northport Symphony Orchestra?  Educators, executives, entrepreneurs, physicians, attorneys, students and other community members who find common purpose and passion in creating great music.  Under the inspiring direction of maestro Eric Mahl, the NSO continues to expand its orchestral repertoire to showcase new works, resulting in a diverse musical experience for players and audiences alike. Founded in 2007 as the Northport Community Orchestra by conductor emeritus Richard Hyman, the NSO has enjoyed the support of generous partners including the Northport-East Northport School District, the Northport Chorale, and the Northport Community Band.  The ensemble officially became the NSO in 2009. Rehearsals occur on Wednesday evenings in the Northport area. ERIC MAHL Music Director and Conductor Eric Mahl received his Bachelor’s in Music Education from Ithaca College and studied at Université de Montréal and the State University of New York at Fredonia, where he received a Master’s degree. He has studied with some of the foremost conducting pedagogues in the United States, including Marin Alsop, James Ross, Harold Farberman, Neil Varon, Marc Gibson, Larry Rachleff, Don Schleicher, Jean-Francois Rivest, Paolo Bellomia, and Joseph Gifford. When not on the podium, his passions extend to fitness, tennis, and spending time in nature. Read Full Bio WHY NSO? Northport Symphony Orchestra enriches our community through the transformative power of music, by creating a harmonious connection through education and unparalleled musical experiences. Customized Education: Tailored programs for all ages deepen music appreciation and understanding. Immersive Performances: Unforgettable concerts transport audiences, fostering emotional connection. Community Collaboration: Partnerships and events unite diverse groups, harnessing music's transformative impact. THE ORCHESTRA THE BOARD OF DIRECTORS OFFICERS President: Katerina Grein Katerina Grein is the current president of the Northport Symphony Orchestra, having served previously as Vice President and as Member-at-Large on the NSO Board.  She is principal violist of the NSO and is an avid performer in ensembles across Long Island. Katerina has performed with the NSO for 3 years and has served on the board for 2 years. Ms. Grein is currently the 7th Grade Orchestra Director at Commack Middle School and also serves on the Board for the Long Island String Festival Association (LISFA) as Suffolk County’s 6th Grade Orchestra Chairperson. Katerina earned her bachelor’s and master’s degrees in music education from SUNY Fredonia and is currently a candidate in Stony Brook University’s educational leadership program. Vice President: Kathyrnne Yland Kathrynne F Yland, MD is principal clarinetist of the NSO and former vice president of the orchestra, having been a member since 2014. Dr. Yland practices general pediatrics at Mount Sinai Doctors of Long Island in Greenlawn NY. She is a member of the medical staff at Huntington Hospital and is Assistant Professor of Pediatrics at the Zucker School of Medicine. Dr. Yland was graduated from Mount Holyoke College (B.S.) and the School of Medicine at SUNY Stony Brook (M.D.). She resides in Northport, NY. Treasurer: Joseph Rabinowitz Joseph Rabinowitz serves as a non-orchestra member of the NSO Board of Directors and as NSO treasurer since 2023.  He is a certified public accountant with his own successful firm for more than 30 years. Mr. Rabinowitz resides in Huntington, NY. Secretary: Michael Kitakis Michael Kitakis serves as NSO Secretary. He has been a member of the Northport Symphony Orchestra since 2022 and is a member of the cello section. Michael is the administrator at the Spirit of Huntington Art Center. where he is active in assisting local members of the developmentally disabled community to find passion and creativity in the arts. He received his B.A. in Classical Performance from the State University of New York at New Paltz. AT LARGE: Keith Itzler Keith Itzler is a Member-at-Large on the NSO Board.  He is principal bassoonist of the NSO and performs with several community musical groups including also the Huntington Community Band and Suffolk YJCC Wind Ensemble. Keith has been a member of the orchestra for nine years and a Board member for the last three.  A life-long Long Islander and amateur musician, he currently resides in Dix Hills in Huntington. Keith is a Professional Engineer and a Senior Manager in a national engineering firm delivering infrastructure and building projects throughout the New York metropolitan region, including Long Island. He holds Civil Engineering degrees from SUNY @ Buffalo (BS) and Columbia University (MS). Ellen Ryan Ellen Ryan is a Member at Large of the Board of Directors of Northport Symphony Orchestra since 2022 and a member of the NSO trumpet section since 2016, performs with multiple ensembles, including Massapequa Philharmonic Orchestra, South Shore Symphony, Huntington Community Band, and Sound Brass Quintet. She is Senior Manager, Standards Publications, with the Society of Motion Picture and Television Engineers (SMPTE), and is active with the Project Management Institute New York City Chapter and various Yale alumni groups. She received her B.A. in Music from Yale University and M.A. in Communication Arts from New York Institute of Technology. She currently resides in Suffolk County. Michael Rabinowitz A resident of Suffolk County, Michael has been a member of the Northport Symphony Orchestra since 2008.  An active percussionist and educator, Michael teaches privately around Long Island while also pursuing his BM in Music Education from Five Towns College.  As an advocate and supporter of Community music, and in addition to his involvement with the NSO as player and board member, he has performed with other Long Island based groups, such as the North-Shore Symphony Orchestra, and the Huntington Community Band.  Michael looks forward to another season with the Northport Symphony Orchestra and would like to thank all the patrons who come out for our concerts and show us your support. Michael Grosso Michael B Grosso, MD is former Chief Medical Officer at Huntington Hospital/Northwell Health, spending 23 years in that role. He continues to serve as Chairman, Department of Pediatrics at Huntington Hospital, and is Assistant Professor of Pediatrics at the Zucker School of Medicine.  A graduate of Georgetown University (B.S.) and the Cornell University Medical College (M.D.), he resides in Northport, NY. He is a non-orchestra member of the NSO Board. THE ORCHESTRA Violin 1 Hiroko Nakahara, Concertmaster (Sponsored by Anonymous) Stephanie Branta Nicole Chang Donna Geiger Theresa McGiff Antonis Panayotatos Tracy Souhrada Violin 2 Emily Chavez Bonnie Foti Heather Hannum Margaret Janke Abigail Keefe* Ellen Richardson Viola Michael Dunnell Katerina Grein* Dare Ryan Cello Julia Binger Arianna Braccino* Richard Gotlib Jake Kent Michael Kitakis Jack Knight Bass Gabriel Sherman (Sponsored by Paul & Kristine Littrell) Flute Naomi Gage Deborah Sherman Edna Susman* Piccolo Deborah Sherman Oboe Witold Koziel* Gary Meyer Clarinet Alexis Lundy Kathrynne Yland* Bassoon Kim Monroe Keith Itzler* French Horn Lynn Adler (Sponsored by Elaine Adler) Melaina Badalian* Torrey D’Angelo Brian Goldman Trumpet Ellen Ryan John Zalewski* Trombone Terry Nigreli Michael Richardson* (Sponsored by Anonymous) Tuba Beth Lodal Timpani Michael Rabinowitz* Harp Susan Mann* Contact Us GALLERY OUR MISSION: Northport Symphony Orchestra enriches our community through the transformative power of music, by creating a harmonious connection through education and unparalleled musical experiences. Facebook-f Instagram Twitter Linkedin PO Box 602 East Northport, NY 11731 [email protected] About Eric Mahl Performances & Events News Support Contact About Eric Mahl Performances & Events News Support Contact © 2025 All Rights Reserved."
    },
    {
      "url": "https://www.northportsymphony.com/gala",
      "text": "Gala | North Port Symphony top of page Sharing the Joy of Music Home About Musicians Meet the Maestro Board and Staff Support Donate Concerts Seat Prices Education Join the Symphony Contact More Use tab to navigate through the menu items. N O RTH P ORT S YMPHONY 40th Anniversary A Ruby Gala March 2, 2024 5:30 PM Heron Creek Golf & Country Club - North Port, Florida Formal Attire, Black Tie Optional Complimentary Valet Service $125.00 Per Person Available now! Mission Live Auction Items Silent Auction Items Entertainment Reservations Sharing the Joy of Music Our Mission is to Share the Joy of Music. Our 40th Anniversary Gala is dedicated to our mission. Not only will we celebrate 40 years of music in North Port, but we will also develop the North Port Symphony's Education and Community Outreach endeavors. ​ The North Port Symphony's long-term goals include: Developing a financially accessible Strings Summer Camp for 4th, 5th, and 6th grade students in North Port. Developing an after-school program for elementary-aged North Port students to learn string instruments. Producing performances within the North Port community at City Hall, Wellen Park, etc. Live Auction Items Artistic Symphony Quilt Executed in red, black, greens and metallic golds.  Musical instruments and elements are individually embroidered, pieced, and quilted in a pattern of musical notes.  It is handmade by Judy Whittaker, Past President of the Peace River Quilters’ Guild. Measures 48” x 64”. Donor: Judy Whittaker Value: $1200 Custom 11x14 Tiffany Portrait Reminiscent of art during the 17th century, Rob Hurth Photography creates the same vitality and beauty of classical artistry.  Includes a pre-photography consultation, an in-studio photography session with the artist and a beautiful hand-crafted Tiffany portrait, mounted to canvas and coated with a luster lacquer. Donor: Rob Hurth Photography Value:  $1000 Custom Made Trombone Floor Lamp Created for the North Port Symphony by North Port craftsman, Pat. Beffel, jr. Gleaming brass trombone with carefully selected additional brass elements. Glass table on top of the bell will hold your beverage. Peacock granite base has flecks of gold to complement the instrument. Mississippi-made lamp shade finishes the ensemble. Light bulb included. Donors: Pat. Beffel, jr., Beffel Lighting; Acer Granite; Antique Mercantile Exchange; Dave Jonas;  Charlotte County Glass;  Midwest Lamp Parts Value:  $1400 \"A Certain Smile\" is one of Kitt Moran’s fun- loving wine ladies.  She reminds us to pause our busy schedules and enjoy our lives. Oil on canvas created by award-winning Artist Kitt Moran. 24” x 36”, framed to 25 ¼” x 37 ½”. Donor:  Kitt Moran Value:  $1900 Donor:  Ella Arnow Value:  $3650 MEXIC O! Grand Luxxe  Riviera Maya or Grand Luxxe Nuevo Vallarta Enjoy true luxury for a week in a 2 bedroom 2 ½ bath spa suite in Riviera Maya or in Nuevo Vallarta between April 1, 2024 and April 30, 2025 excepting Christmas and Easter weeks.  Golf, Tennis, Massages, Gym and Spa.  Resorts are not all-inclusive.  For more information visit the following websites: https://www.vidanta.com/en/web/riviera-maya/grand-luxxe https://www.vidanta.com/web/nuevo-vallarta/grand-luxxe ​ A Marvelous Meal with Maestro for four guests.  Enjoy an evening of entertaining stories, good food and great fun with Maestro and his lovely wife at their home in Riverview. An accomplished chef, Maestro is doing the cooking.  Choose either his world-famous Spaghetti in Meat Sauce or his equally famous Polish Golabki. Donors:  Maestro Robert Romanski & Michele de Lucca-Lowrey Value:  Priceless Silent Auction Items Spiritual Protection Silver is believed to have the power to purify and cleanse negative energy.  Solid and heavy, this Native American Sterling bracelet features a traditional rope design. Donor:  Anonymous Value:  $125 Feminine & Delicate Luminescent cultured pearls are encased in sterling silver with white sapphire accents. Pierced earrings and pendant on a delicate 18” sterling chain.  A gift for yourself or for someone else? Donor: Kay Jewelers Value:  $230 Blossoms Necklace & Earrings Set All of Bone Boutique’s pieces are made from sustainable animal bone, making them an ethical and stylish choice for your jewelry collection.  This blossoms necklace and earrings set is made from the scale bones of the Florida long nose garfish.  Sure to invite comment! Donor: Bone Boutique Value:  $80 Happy Place ! Nau-T-Girls love wind in their hair, sandy toes & salty kisses.  Designed by Pam Duke, Nau-T-Girl features nautical themed jewelry and gifts.    The wave ring and necklace in sterling with blue zircon represent the Nau-T-Girl’s happy place – out on the waves and enjoying the sun. Donor:  Nau-T-Girl Value:  $265 Saltwater Jewelry Designs are themed from the ocean and all the life below.  Custom designed and crafted solid silver necklace includes a turquoise cabochon. Hand-produced by Allen Moen, custom designs in silver for family & friends. Pendant is 2 ½” long on 20” silver chain. Donor:  Catalyst Group ECR – Executive Coaching and           Roundtables Value:  $275 Classic Creations in diamonds & gold Celebrating over 40 years of serving our community, the Duke family believes in giving back to the community in which they live.  Go shopping with these two $100 gift cards.  Browse their extensive array of fine jewelry, watches, coins, clocks and collectibles.  Maybe put it toward a custom jewelry design or an appraisal?  The possibilities are limitless! Donor:  Classic Creations in diamonds & gold Value:  $200 Painting with a Twist for two. Give your evening a twist.  Make it a date night or  fun-filled night with a friend.  Choose from a multitude of fun and easy classes.  BYOB and finger foods if you’d like.  Sip, socialize. Create!  Use by May 1, 2024. Donor:  Painting with a Twist Value:  $78 Four on the Floor! Cruise the avenue with your driver in this 1961 Chevy Corvette.  Feel the power of the 240 hp  engine with double 4 barrel carburetors when you hit the highway to your surprise destination.  Plan at least an hour for the ride. Donor:  Lee & Mary Ellen Snell Value:  $150 FRONT Seat Ride in a North Port patrol vehicle.  Enjoy your ride and take part in a half-day look behind the scenes.  Includes a K9 demo, drone unit flight, station tour and more! Donor:  North Port Police Department Value:  $200 Easy Traveling with\nTravelpro® Travel easily with the MaxLite Air hard side travel set.  Lightweight spinner wheels make it a breeze to push through the airport. Donor:  Travelpro® Value:  $520 Think YOU can Escape? Think outside the box, crack the codes and solve the puzzles.   The possibilities are endless!  Two tickets valid in North Port, Sarasota and Punta Gorda. Donor:  Escape Rooms Unlocked – North Port Value: $70 Sparkling Windows, Fresh Drive & Walk Didn’t you just wash them?  And then the storm came through and they’re dirty.  Again.  Let someone else take care of cleaning them this time.  Up to ten windows, inside and out including screens and tracks.  PLUS your driveway and front sidewalk will be power-washed to give you that new concrete look.  For residences within a 30 mile radius of North Port. Must be used by March 1, 2025. Donor: Brightview Window Cleaning Value:  $300 Entertainment Dance the night away with the Saint Tone Band! A Dynamic High Energy Party Dance Band! Their captivating performances will have you singing and dancing along with a perfect mix of your All-Time Favorite Covers and Captivating Originals in the genres of Pop, Rock, and Country from the 1960's to Todays Hits. Cocktail Hour Cocktail hour will include live entertainment by North Port Symphony Principal Flutist Michael Alegria and Principal Pianist Jesse Holmgren. Partnerships In-Kind Sponsors: Media Sponsor: Mailing Address: ​ North Port Symphony PO Box 7859 North Port, FL 34290 ​ info@northportsymphony.com bottom of page"
    },
    {
      "url": "https://www.northportareachamber.com/list/member/north-port-symphony-inc-3334",
      "text": "North Port Symphony, Inc. | Entertainment - North Port Area Chamber of Commerce, FL Go Pages Members Categories Quicklinks Events Member Login Contact Us Toggle navigation Go Pages Members Categories Quicklinks Events Member Login Contact Us Home About About the Chamber Board of Directors Committees Staff Contact Us Members Interested in Joining? Join Now Member Benefits Training & Tutorials Business of the Year Business Advocate of the Year Member Directory Member Login Directory CHAMBER CHAMPIONS Diamond Program Leadership Young Professionals NP3 Community Tourism About North Port 2025 Community Guide Communicator Newsletter Job Postings Hot Deals News Releases Calendars Events List Chamber Calendar Community Calendar North Port Symphony, Inc. Categories Entertainment 6400 W Price Blvd North Port FL 34291 (941) 586-3594 Visit our website Hours: Saturday mornings, Oct to Mar, 9am to 12pm Driving Directions: From I-75 take Exit 182 on Sumter blvd going south toward Price Blvd. Turn right on Price Blvd. Turn right into North Port High School. About Us Community Symphony Orchestra serving Southwest Florida Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Upcoming Events It's YOUR business and we want to be YOUR Chamber! North Port Area Chamber of Commerce 14140 Tamiami Trail, North Port, FL 34287 941. 564.3040 info@northportareachamber.com © Copyright 2025 North Port Area Chamber of Commerce. All Rights Reserved. Site provided by GrowthZone - powered by ChamberMaster software."
    },
    {
      "url": "https://www.newportsymphony.org/about-us/nso-board-staff.html",
      "text": "Newport Symphony Orchestra | Board & Staff Skip to main content Donate Events 2025-2026 Season Listening for Beethoven Gandelsman Returns! Christmas at the Coast The Brilliance of Rachel Barton Pine Listening for Shakespeare Chamber Music on the Bayfront Newport Youth Symphony of the Oregon Coast Event Calendar Education Overview Private Music Teachers Youth Program Payment Portal Youth Program Interest Form News • Watch • Listen News Watch • Listen Newport Symphony and Oregon Coast Aquarium Get Together NSO to Go • Musician Videos More NSO To Go: Musician Videos The Newport Symphony is for Everyone About Us Adam Flatt, Music Director NSO Musicians NSO Board & Staff NSO Overview & History David Ogden Stiers How To Help Host a Musician Get Connected Donate Auditions Join Our Email List Contact Us Careers with Newport Symphony Orchestra Job Openings at Newport Symphony Orchestra Events 2025-2026 Season Listening for Beethoven Gandelsman Returns! Christmas at the Coast The Brilliance of Rachel Barton Pine Listening for Shakespeare Chamber Music on the Bayfront Newport Youth Symphony of the Oregon Coast Event Calendar Education Overview Private Music Teachers Youth Program Payment Portal Youth Program Interest Form News • Watch • Listen News Watch • Listen Newport Symphony and Oregon Coast Aquarium Get Together NSO to Go • Musician Videos More NSO To Go: Musician Videos The Newport Symphony is for Everyone About Us Adam Flatt, Music Director NSO Musicians NSO Board & Staff NSO Overview & History David Ogden Stiers How To Help Host a Musician Get Connected Donate Auditions Join Our Email List Contact Us Careers with Newport Symphony Orchestra Job Openings at Newport Symphony Orchestra Donate About Us NSO Board & Staff Adam Flatt, Music Director NSO Musicians NSO Board & Staff NSO Overview & History David Ogden Stiers How To Help Host a Musician Get Connected Donate Auditions Join Our Email List Contact Us Careers with Newport Symphony Orchestra Job Openings at Newport Symphony Orchestra NSO Board of Directors Ken Combs, Acting President – musician, retired university administrator Vacant, Vice President Susan Elizabeth Reese Painter, Treasurer – criminal defense lawyer and freelance writer Bill Hite, Secretary – retired contractor Christine Bonney - Senior Software Engineer Nancy Steinberg - Director of Communications and Marketing, College of Earth, Ocean, and Atmospheric Sciences, Oregon State University. Brian Haggerty – lawyer, Newport Law ; firefighter and emergency medical technician, Newport Fire Department Kris Klavik – musicians' representative, Newport Symphony Orchestra musician personnel manager W. W. \"Clyde\" Reid – retired editor Camille Shieff – business owner Gavin Shumate – doctor; priest, St. John's Episcopal Church Joseph Swafford – retired business owner Marcia Buckley - Judge of the Oregon 17th Judicial District Circuit Courts, Divorce attorney Kate Sinkins- Immigration attorney * * Staff Management Dan Howard – Executive Director Charmaine Leclair – Office Manager/Bookkeeper Kris Klavik – Personnel Manager Shauna Keyes – Personnel Manager (strings) Alistair Kok – Librarian Leatrice Lily – Housing Coordinator LeeAnn McKenna - Youth Programs Coordinator The NSO Thanks Our Generous Sponsors Rogue 2024 Lincoln County Cultural Coalition Oregon Coast Council for the Arts Mo's Seafood and Chowder PO Box 1617 Newport, OR 97365 Phone 458.868.9155 Email NSO About Us Career Opportunities with the NSO Events Education Facebook Watch•Listen•News Donate Now © 2025 The Newport Symphony Orchestra at the Ocean Instagram Privacy Policy Privacy Policy What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your email address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys.\nIf you choose to correspond with us through email, we may retain the content of your email messages together with your email address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information Similar to other websites, our site may utilize a standard technology called \"cookies\" (see explanation below, \"What Are Cookies?\") and web server logs to collect information about how our website is used. Information gathered through cookies and server logs may include the date and time of visits, the pages viewed, time spent at our website, and the sites visited just before and just after ours. This information is collected on an aggregate basis. None of this information is associated with you as an individual. How Do We Use the Information That You Provide to Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are a feature of web browser software that allows web servers to recognize the computer used to access a website. Cookies are small pieces of data that are stored by a user's web browser on the user's hard drive. Cookies can remember what information a user accesses on one web page to simplify subsequent interactions with that website by the same user or to use the information to streamline the user's transactions on related web pages. This makes it easier for a user to move from web page to web page and to complete commercial transactions over the Internet. Cookies should make your online experience easier and more personalized. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users.\nCookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We do not use these technologies to capture your individual email address or any personally identifying information about you. Notice of New Services and Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an email request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website.\nOther email that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured email. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction.\nEvaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information.\nEmployee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access and Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using the contact form provided to you within the site structure of our website. Do We Disclose Information to Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information to our affiliates or reputable third parties, but this information will not include personally identifying data, except as otherwise provided in this privacy policy. What About Legally Compelled Disclosure of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission to Use of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. Powered by Firespring"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://nppaa.net/symphony_info.html",
      "text": "North Port Performing Arts Association Home Presidents Message About NPPAA Symphony Symphony Info. Symphony Schedule & Tickets Music Director Presidents Message Concert Band Concert Band Info. Concert Band Schedule & Tickets Music Director Presidents Message Chorale Chorale Info. Chorale Schedule & Tickets Director Presidents Message General Info. The PAC Box Office The North Port Symphony The North Port Symphony was founded in 1983 by a handful of local residents who were interested in playing music for their own pleasure as well as for the community. St. Paulâs Presbyterian Church served as the Symphonyâs home until November of 2001 when we moved to our current home in the Music Suite adjacent to the Performing Arts Center on the North Port High School Campus. The Symphony is composed of amateur and professional musicians. Programs include classical, contemporary and popular music. The goal of North Port Symphony is to promote charitable and educational activities in North Port, Florida. The North Port Symphony is happy to celebrate our 36th year with our audience and friends and look forward to a wonderful 2021-2022 season. We hope you enjoy our performances featuring talented artists along with great music of all kinds in our six-concert series. Participate North Port Symphony is a non-profit organization composed of volunteer and professional musicians. Your support enables us to continue to provide quality concerts for the community and encourage the love of music through our education programs. You may wish to give a personal gift of cash or join the growing list of businesses who have graciously contributed. All donations are tax deductible and receive acknowledgement in all of our promotional materials. Volunteers are critical to the symphony for everything from making coffee and setting up stage to fund raising and marketing. Please contact us to join the symphony or volunteer to help. Address The North Port Symphony 6400 W. Price Blvd. North Port, FL 34286 Telephone Box Office: 941-426-8479 Toll Free: 866-406-7722 Maestro Robert Romanski Artistic Director and Principal Conductor Symphony Information: info@northportsymphony.com Symphony Officers President: Tim Swanson Vice President: Kathleen Karpathy Treasurer: Ginger Miranda Secretary: Piilani Edwards Executive Director: Michael Alegria Music Director: Robert Romanski Trustees Deb Elwood Lori Getty Chris Owens Lois Weeks Laurie Brenenstuhl Click here to visit the North Port Symphony website © 2024 North Port Performing Arts Association"
    },
    {
      "url": "https://www.northportsymphony.com/musicians",
      "text": "Musicians | North Port Symphony top of page Sharing the Joy of Music Home About Musicians Meet the Maestro Board and Staff Support Donate Concerts Seat Prices Education Join the Symphony Contact More Use tab to navigate through the menu items. Violin Karen Tuttle Concertmaster Shannon Underwood Assistant Concertmaster Julie Metcalf Piilani Ewards Peter Russo Tim Fawcett Sarah Lind Lois Weeks Dana Killam Principal Second Nadina Prince Bobbi Rumpf Sue Flora Ralph Liebstein Monica Lagosky Heffner Nicole Beckel Zane Wood Lauree Duncan Mary Hall Carol Sandborn Viola Kathy Johnson Principal Viola David O'Fallon Aimee Schneider Maya Lamberto North Port High School Student Mason Payne North Port High School Student José Noyola North Port High School Student Sandra Corbett Jan Faber Cello Lorraine Wallace Principal Cello Greg Brozenec Tim Swanson Bev MacMahon LeeAnn Deak Jody Aldrich ​ Jash Singh Double Bass Zachary Rogers Principal Bass Jean Smith Joseph Kennedy North Port High School Student Brianna Russell North Port High School Student Al Ball Zaveah Tulloch Flute Michael Alegria Principal Flute Michael Berndt Oboe John Robison Principal Oboe Sarah Biser Clarinet Robert Felman Principal Clarinet Aiden Fawcett Les Kraus Bass Clarinet Bassoon Leo Kenen Principal Bassoon Mary Ellen Snell Sebastian Rondon North Port High School Student Horn Troy Messner Principal Horn Marina Pope Max Bygrave Ken Kaye Trumpet Shawn Marren Principal Trumpet Allison Deal Mikey Moore Charlotte High School Student Trombone Jim Pack Principal Trombone Clyde Bachand Bass Trombone Tuba Chris Owens Principal Tuba Percussion Ken Trapp Principal Percussion Kathleen Karpathy Piano Jesse Holmgren Principal Piano Lana Anderson sub piano / english horn Harp Lois Weeks Principal Harp Partnerships In-Kind Sponsors: Media Sponsor: Mailing Address: ​ North Port Symphony PO Box 7859 North Port, FL 34290 ​ info@northportsymphony.com bottom of page"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    },
    {
      "url": "https://www.northportsymphony.com/join",
      "text": "Join the Symphony | North Port Symphony top of page Sharing the Joy of Music Home About Musicians Meet the Maestro Board and Staff Support Donate Concerts Seat Prices Education Join the Symphony Contact More Use tab to navigate through the menu items. Join The North Port Symphony The North Port Symphony is comprised of amateur and professional musicians as well as advanced students. Rehearsals are Saturday mornings from 9:30 a.m. to 12:00 p.m. at the North Port Performing Arts Music Suite at North Port High School. Our season runs October through March. If you are interested in performing with the North Port Symphony, contact us below: ​ First Name Last Name Email Instrument Message Send Thanks for submitting! Partnerships In-Kind Sponsors: Media Sponsor: Mailing Address: ​ North Port Symphony PO Box 7859 North Port, FL 34290 ​ info@northportsymphony.com bottom of page"
    },
    {
      "url": "https://www.northportsymphony.com/about",
      "text": "About | North Port Symphony top of page Sharing the Joy of Music Home About Musicians Meet the Maestro Board and Staff Support Donate Concerts Seat Prices Education Join the Symphony Contact More Use tab to navigate through the menu items. Celebrating Our History On January 21, 1984, the North Port Orchestra, as it was called then, held its inaugural performance at St. Paul’s Presbyterian Church on Sumter Avenue in North Port.  ​The group was formed by 15 local residents, who were interested in playing music not only for themselves but for the community.  After almost one year of recruiting retired professional and amateur musicians from the area, the first concert was held.\n\nIn the late ‘80’s, several string players from the Orchestra, in conjunction with the newly opened Glenallen Elementary School, developed after-school string programs.  The instruction was from members of the North Port Orchestra.  At this time there were no instrumental programs offered by the school.\n\n​As interest grew, a Youth Orchestra was formed in the mid ‘90’s and it performed in tandem on numerous occasions with the North Port Orchestra.  The Youth Orchestra was 45-members strong, including violin, cello, flute, trumpet, and clarinet.\n\n​​Through the years, the North Port Orchestra has celebrated many anniversaries.  The 10th anniversary in 1993-94, included, in music performed at the very first concert, conducted by Jim Richardson; 20 years was celebrated, under the direction of Theodore Dollarhide, and 30 years in 2013-14. Other Orchestra conductors included Arthur Thiel and Sasha von Dassow.\n\n​At the October 2000 Board of Trustees Meeting, the Board President, Ruth McArdle announced that the North Port Orchestra had received a $57,205.00 grant from the Venice Foundation. Even though the Performing Arts Center and Music studio were still under construction, the funds were earmarked for instrument storage, chairs, risers, and other equipment to fully equip the new music studio.\n\n​In 2011, the Orchestra was renamed the North Port Symphony. The acclaimed Robert Romanski joined the Symphony in 2012, as Principal Conductor and Artistic Director, where the symphony has flourished under his direction.  The Symphony continues to perform five concerts annually, November to March, as it has since 1984.\n\n​The Symphony is composed of talented amateur, professional and student musicians who volunteer their time and talents to share in the joy of music with the community.\n\nOur Vision Statement is to be “the most welcoming community orchestra in southwest Florida, and to cultivate a sense of belonging between our patrons, musicians, students and community.” Our Musicians Board & Staff The Maestro Partnerships In-Kind Sponsors: Media Sponsor: Mailing Address: ​ North Port Symphony PO Box 7859 North Port, FL 34290 ​ info@northportsymphony.com bottom of page"
    },
    {
      "url": "https://ncsymphony.org/contact-us/",
      "text": "Contact Us - North Carolina Symphony Close North Carolina Symphony Item #3 Close Item #3 Open Item #3 Search ATTEND Menu Concert Calendar Subscriptions & Packages Buy Tickets Season Brochure Group Tickets Special Offers Mobile Entry FAQ Box Office Information My Account DISCOVER Menu Plan Your Visit Raleigh Cary Chapel Hill Wilmington New Bern Pinehurst SUPPORT Menu Support Your Symphony Individual Support Corporate Giving Foundation Giving Endowment Giving Planned Giving Special Events Become a Volunteer Donate Now EDUCATION Menu Education Programs Education Concerts (grades 3-5) Elementary School Programs Middle, High School & College Educator Programs Music Discovery Musical Meditations YOUR SYMPHONY Menu About Us Our Story Our People Carlos Miguel Prieto Press Room Employment Attend Concert Calendar Subscriptions & Packages Buy Tickets Season Brochure Group Tickets Special Offers Mobile Entry FAQ Box Office Information My Account Discover Plan Your Visit Raleigh Cary Chapel Hill Wilmington New Bern Pinehurst Support Ways to Give Individual Support Foundation Giving Endowment Giving Planned Giving Volunteer your Time Donate Education Education Programs Education Concerts (grades 3-5) Elementary School Programs Middle School, High School & College Programs Educator Programs Music Discovery Musical Meditations Your Symphony About Us Our Story Our People Carlos Miguel Prieto Press Room Employment Search Contact Us Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Email Message Subject Your Name * Email * Subject Your Message Send The North Carolina Symphony welcomes all comments, questions, and concerns. In addition to the form above, you may call us at 919.733.2750 or write us at: North Carolina Symphony 3700 Glenwood Avenue, Suite 130 Raleigh, NC 27612 NORTH CAROLINA SYMPHONY State Headquarters & Box Office 3700 Glenwood Avenue, Ste. 130, Raleigh, NC 27612 919.733.2750 | 877.627.6724 (Toll-Free) View accessibility services here CONNECT WITH US Sign up for NCS emails to be the first to know about concerts and events, receive special discounts, and access exclusive photos and videos. Sign Up The North Carolina Symphony gratefully acknowledges financial support from Wake County, the City of Raleigh, and the State of North Carolina. Copyright © 2000-2025 North Carolina Symphony   | Privacy Policy English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Norsk Türkçe Bahasa Indonesia Português (Brasil) 日本語 한국어 简体中文 العربية Русский हिन्दी Українська Srpski Accessibility  Adjustments Powered by OneTap Hide Toolbar Back How long do you want to hide the accessibility toolbar? Hide Toolbar Duration Only for this session 24 hours A Week Not Now Hide Toolbar Bigger Text Cursor Letter Spacing Readable Font Align Text Line Height Colors Grayscale Brightness Invert Colors Orientation Highlight Links Stop Animations Hide Images Reading Mask Reading Line Highlight Al Reset Settings Version 2.5.0 Request Group Tickets Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Reserve your group's seats today! Fill out the form with your group details, information, and preferred performances.  For more information, email Ellie Jensen at ejensen@ncsymphony.org or call 919.789.5458. Name * First Last Phone please Phone Name Email * Group Type * Alumni Association Business or Corporation Choral Education Individual Organization (e.g, Library or Foundation) Religious Tour & Travel Other If Other, please specify Group Name * Concert Location * Raleigh Chapel Hill Wilmington New Bern Moore County Other Please specify location and/or concert Desired Concert Select a concert Video Games Live | SAT, SEP 13 at 7:30PM Dvořák: New World Symphony  | FRI, SEP 19 at 8PM Dvořák: New World Symphony  | SAT, SEP 20 at 8PM Dvořák: New World Symphony  | FRI, SEP 26 at NOON The Music of John Williams | FRI, OCT 03 at 8PM The Music of John Williams | SAT, OCT 04 at 8PM All Beethoven | FRI, OCT 10 at 8PM All Beethoven | SAT, OCT 11 at 8PM Copland Symphony No. 3 | FRI, OCT 17 at 8PM Copland Symphony No. 3 | SAT, OCT 18 at 8PM Halloween Spooktacular | SAT, OCT 25 at 1PM Halloween Spooktacular | SAT, OCT 25 at 4PM Rachmaninoff Symphony No. 2 | FRI, OCT 31 at 8PM Rachmaninoff Symphony No. 2 | SAT, NOV 1 at 8PM Rick Steves’ Europe: A Symphonic Journey | THU, NOV 6 at 7:30PM Rick Steves’ Europe: A Symphonic Journey | FRI, NOV 7 at 7:30PM Beethoven “Eroica” Symphony | FRI, NOV 14 at 8PM Beethoven “Eroica” Symphony | SAT, NOV 15 at 8PM Friday Favorites: Beethoven “Eroica” Symphony | FRI, NOV 14 at NOON Dolly Parton’s Threads: My Songs in Symphony | FRI, NOV 21 at 7:30PM Dolly Parton’s Threads: My Songs in Symphony | SAT, NOV 22 at 3PM Cirque Holiday Pops | WED, NOV 26 at 4PM Cirque Holiday Pops | FRI, NOV 28 at 3PM Cirque Holiday Pops | FRI, NOV 28 at 7:30PM Cirque Holiday Pops | SAT, NOV 29 at 3PM Cirque Holiday Pops | SAT, NOV 29 at 7:30PM Holiday Pops | FRI, DEC 12 at NOON Holiday Pops | FRI, DEC 12 at 8PM Holiday Pops | SAT, DEC 13 at 3PM Holiday Pops | SAT, DEC 13 at 8PM Handel's Messiah | FRI, DEC 5 at 8PM Handel's Messiah | SAT, DEC 6 at 3PM A Candlelight Christmas | FRI, DEC 19 at 7:30PM A Candlelight Christmas | SAT, DEC 20 at 3PM A Candlelight Christmas | SUN, DEC 21 at 3PM A Candlelight Christmas | TUE, DEC 23 at 3PM A Candlelight Christmas | TUE, DEC 23 at 7:30PM The Music of Harry Potter | SAT, JAN 3 at 1PM The Music of Harry Potter | SAT, JAN 3 at 4PM Carmina Burana | FRI, JAN 9 at 8PM Carmina Burana | SAT, JAN 10 at 8PM Revolution: The Music of the Beatles | FRI, JAN 16 at 8PM Revolution: The Music of the Beatles | SAT, JAN 17 at 3PM Revolution: The Music of the Beatles | SAT, JAN 17 at 8PM All Mozart | FRI, JAN 23 at 8PM All Mozart | SAT, JAN 24 at 8PM Friday Favorites: Gershwin & More | FRI, FEB 6 at NOON Gershwin & Bernstein | FRI, FEB 6 at 8PM Gershwin & Bernstein | SAT, FEB 7 at 8PM Bravo Broadway | FRI, FEB 13 at 8PM Bravo Broadway | SAT, FEB 14 at 3PM Bravo Broadway | SAT, FEB 14 at 8PM Tchaikovsky 1812 & Violin Concerto | FRI, FEB 20 at 8PM Tchaikovsky 1812 & Violin Concerto | SAT, FEB 21 at 8PM Chopin Piano Concerto No. 1 | FRI, MAR 6 at 8PM Chopin Piano Concerto No. 1 | SAT, MAR 7 at 8PM Hollywood Hits | FRI, MAR 13 at 8PM Hollywood Hits | SAT, MAR 14 at 8PM Friday Favorites: Beethoven “Emperor” Concerto | FRI, MAR 20 at NOON Beethoven “Emperor” Concerto | FRI, MAR 20 at 8PM Beethoven “Emperor” Concerto | SAT, MAR 21 at 8PM Star Wars & More! | SAT, MAR 28 at 1PM Star Wars & More! | SAT, MAR 28 at 4PM Mozart “Great” Mass | FRI, APR 10 at 8PM Mozart “Great” Mass | SAT, APR 11 at 8PM Pictures at an Exhibition | FRI, APR 24 at 8PM Pictures at an Exhibition | SAT, APR 25 at 8PM Jurassic Park in Concert | FRI, MAY 1 at 8PM Jurassic Park in Concert | SAT, MAY 2 at 8PM Jurassic Park in Concert | SUN, MAY 3 at 3PM Friday Favorites: Appalachian Spring | FRI, MAY 8 at NOON Appalachian Spring | FRI, MAY 8 at 8PM Appalachian Spring | SAT, MAY 9 at 8PM ICON: The Voices That Changed Music | SAT, MAY 16 at 8PM Desired Concert Select a concert Dvořák: New World Symphony | THU, SEP 25 at 7:30PM Holiday Pops | WED, DEC 10 at 7:30PM A Little Night Music |  THU, JAN 29 at 7:30PM Classical Favorites | THU, APR 23, 7:30PM Desired Concert Select a concert Rhapsody in Blue | SUN, SEP 7 at 3PM Dvořák: New World Symphony  | SUN, SEP 28 at 3PM Beethoven “Eroica” Symphony | THU, NOV 13 at 7:30PM Handel's Messiah | SUN, DEC 7 at 3PM All Mozart | SUN, JAN 25 at 3PM A Little Night Music | SUN, FEB 1 at 3PM Chopin Piano Concerto No. 1 | THU, MAR 5 at 7:30PM Desired Concert Select a concert All Beethoven | THU, OCT 09 at 7:30PM Holiday Pops | THU, DEC 11 at 3PM Holiday Pops | THU, DEC 11 at 7:30PM All Mozart | THU, JAN 22 at 7:30PM Beethoven “Emperor” Concerto | SUN, MAR 22 at 3PM Desired Concert Select a concert Rachmaninoff Symphony No. 2 | THU, OCT 30 at 7:30PM Holiday Pops | TUE, DEC 02 at 4PM Holiday Pops | TUE, DEC 02 at 7:30PM From Classical to Broadway | TUE, APR 7 at 7:30PM Ticket Quantity Preferred Seating Location Orchestra Rear Orchestra Lower Balcony Accessible Seating? Yes No Special Requests/Comments *Please note that there is no payment due at this time. You will be contacted within 48 hours to confirm your reservation. Submit × Search for: Search ×"
    },
    {
      "url": "https://www.northportareachamber.com/members/member/north-port-symphony-inc-3334",
      "text": "North Port Symphony, Inc. | Entertainment - North Port Area Chamber of Commerce, FL Go Pages Members Categories Quicklinks Events Member Login Contact Us Toggle navigation Go Pages Members Categories Quicklinks Events Member Login Contact Us Home About About the Chamber Board of Directors Committees Staff Contact Us Members Interested in Joining? Join Now Member Benefits Training & Tutorials Business of the Year Business Advocate of the Year Member Directory Member Login Directory CHAMBER CHAMPIONS Diamond Program Leadership Young Professionals NP3 Community Tourism About North Port 2025 Community Guide Communicator Newsletter Job Postings Hot Deals News Releases Calendars Events List Chamber Calendar Community Calendar North Port Symphony, Inc. Categories Entertainment 6400 W Price Blvd North Port FL 34291 (941) 586-3594 Visit our website Hours: Saturday mornings, Oct to Mar, 9am to 12pm Driving Directions: From I-75 take Exit 182 on Sumter blvd going south toward Price Blvd. Turn right on Price Blvd. Turn right into North Port High School. About Us Community Symphony Orchestra serving Southwest Florida Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Upcoming Events It's YOUR business and we want to be YOUR Chamber! North Port Area Chamber of Commerce 14140 Tamiami Trail, North Port, FL 34287 941. 564.3040 info@northportareachamber.com © Copyright 2025 North Port Area Chamber of Commerce. All Rights Reserved. Site provided by GrowthZone - powered by ChamberMaster software."
    },
    {
      "url": "https://northportsymphony.com/scholarship",
      "text": "Education | North Port Symphony top of page Sharing the Joy of Music Home About Musicians Meet the Maestro Board and Staff Support Donate Concerts Seat Prices Education Join the Symphony Contact More Use tab to navigate through the menu items. North Port Symphony Scholarships 2024 Scholarship Winners Jose Noyola North Port High School Aiden Fawcett Howard W. Blake High School Maya Lamberto North Port High School Mikey Moore Charlotte High School Brianna Russell North Port High School Sophia Singh North Port High School Partnerships In-Kind Sponsors: Media Sponsor: Mailing Address: ​ North Port Symphony PO Box 7859 North Port, FL 34290 ​ info@northportsymphony.com bottom of page"
    },
    {
      "url": "https://ncsymphony.org/about-us/",
      "text": "About Us - North Carolina Symphony Close North Carolina Symphony Item #3 Close Item #3 Open Item #3 Search ATTEND Menu Concert Calendar Subscriptions & Packages Buy Tickets Season Brochure Group Tickets Special Offers Mobile Entry FAQ Box Office Information My Account DISCOVER Menu Plan Your Visit Raleigh Cary Chapel Hill Wilmington New Bern Pinehurst SUPPORT Menu Support Your Symphony Individual Support Corporate Giving Foundation Giving Endowment Giving Planned Giving Special Events Become a Volunteer Donate Now EDUCATION Menu Education Programs Education Concerts (grades 3-5) Elementary School Programs Middle, High School & College Educator Programs Music Discovery Musical Meditations YOUR SYMPHONY Menu About Us Our Story Our People Carlos Miguel Prieto Press Room Employment Attend Concert Calendar Subscriptions & Packages Buy Tickets Season Brochure Group Tickets Special Offers Mobile Entry FAQ Box Office Information My Account Discover Plan Your Visit Raleigh Cary Chapel Hill Wilmington New Bern Pinehurst Support Ways to Give Individual Support Foundation Giving Endowment Giving Planned Giving Volunteer your Time Donate Education Education Programs Education Concerts (grades 3-5) Elementary School Programs Middle School, High School & College Programs Educator Programs Music Discovery Musical Meditations Your Symphony About Us Our Story Our People Carlos Miguel Prieto Press Room Employment Search About the North Carolina Symphony SCROLL Our Story Our People Carlos Miguel Prieto Press Room About the North Carolina Symphony Our Story Our People Carlos Miguel Prieto Press Room NORTH CAROLINA SYMPHONY State Headquarters & Box Office 3700 Glenwood Avenue, Ste. 130, Raleigh, NC 27612 919.733.2750 | 877.627.6724 (Toll-Free) View accessibility services here CONNECT WITH US Sign up for NCS emails to be the first to know about concerts and events, receive special discounts, and access exclusive photos and videos. Sign Up The North Carolina Symphony gratefully acknowledges financial support from Wake County, the City of Raleigh, and the State of North Carolina. Copyright © 2000-2025 North Carolina Symphony   | Privacy Policy English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Norsk Türkçe Bahasa Indonesia Português (Brasil) 日本語 한국어 简体中文 العربية Русский हिन्दी Українська Srpski Accessibility  Adjustments Powered by OneTap Hide Toolbar Back How long do you want to hide the accessibility toolbar? Hide Toolbar Duration Only for this session 24 hours A Week Not Now Hide Toolbar Bigger Text Cursor Letter Spacing Readable Font Align Text Line Height Colors Grayscale Brightness Invert Colors Orientation Highlight Links Stop Animations Hide Images Reading Mask Reading Line Highlight Al Reset Settings Version 2.5.0 Request Group Tickets Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Reserve your group's seats today! Fill out the form with your group details, information, and preferred performances.  For more information, email Ellie Jensen at ejensen@ncsymphony.org or call 919.789.5458. Please Other, Desired Name * First Last Phone Email * Group Type * Alumni Association Business or Corporation Choral Education Individual Organization (e.g, Library or Foundation) Religious Tour & Travel Other If Other, please specify Group Name * Concert Location * Raleigh Chapel Hill Wilmington New Bern Moore County Other Please specify location and/or concert Desired Concert Select a concert Video Games Live | SAT, SEP 13 at 7:30PM Dvořák: New World Symphony  | FRI, SEP 19 at 8PM Dvořák: New World Symphony  | SAT, SEP 20 at 8PM Dvořák: New World Symphony  | FRI, SEP 26 at NOON The Music of John Williams | FRI, OCT 03 at 8PM The Music of John Williams | SAT, OCT 04 at 8PM All Beethoven | FRI, OCT 10 at 8PM All Beethoven | SAT, OCT 11 at 8PM Copland Symphony No. 3 | FRI, OCT 17 at 8PM Copland Symphony No. 3 | SAT, OCT 18 at 8PM Halloween Spooktacular | SAT, OCT 25 at 1PM Halloween Spooktacular | SAT, OCT 25 at 4PM Rachmaninoff Symphony No. 2 | FRI, OCT 31 at 8PM Rachmaninoff Symphony No. 2 | SAT, NOV 1 at 8PM Rick Steves’ Europe: A Symphonic Journey | THU, NOV 6 at 7:30PM Rick Steves’ Europe: A Symphonic Journey | FRI, NOV 7 at 7:30PM Beethoven “Eroica” Symphony | FRI, NOV 14 at 8PM Beethoven “Eroica” Symphony | SAT, NOV 15 at 8PM Friday Favorites: Beethoven “Eroica” Symphony | FRI, NOV 14 at NOON Dolly Parton’s Threads: My Songs in Symphony | FRI, NOV 21 at 7:30PM Dolly Parton’s Threads: My Songs in Symphony | SAT, NOV 22 at 3PM Cirque Holiday Pops | WED, NOV 26 at 4PM Cirque Holiday Pops | FRI, NOV 28 at 3PM Cirque Holiday Pops | FRI, NOV 28 at 7:30PM Cirque Holiday Pops | SAT, NOV 29 at 3PM Cirque Holiday Pops | SAT, NOV 29 at 7:30PM Holiday Pops | FRI, DEC 12 at NOON Holiday Pops | FRI, DEC 12 at 8PM Holiday Pops | SAT, DEC 13 at 3PM Holiday Pops | SAT, DEC 13 at 8PM Handel's Messiah | FRI, DEC 5 at 8PM Handel's Messiah | SAT, DEC 6 at 3PM A Candlelight Christmas | FRI, DEC 19 at 7:30PM A Candlelight Christmas | SAT, DEC 20 at 3PM A Candlelight Christmas | SUN, DEC 21 at 3PM A Candlelight Christmas | TUE, DEC 23 at 3PM A Candlelight Christmas | TUE, DEC 23 at 7:30PM The Music of Harry Potter | SAT, JAN 3 at 1PM The Music of Harry Potter | SAT, JAN 3 at 4PM Carmina Burana | FRI, JAN 9 at 8PM Carmina Burana | SAT, JAN 10 at 8PM Revolution: The Music of the Beatles | FRI, JAN 16 at 8PM Revolution: The Music of the Beatles | SAT, JAN 17 at 3PM Revolution: The Music of the Beatles | SAT, JAN 17 at 8PM All Mozart | FRI, JAN 23 at 8PM All Mozart | SAT, JAN 24 at 8PM Friday Favorites: Gershwin & More | FRI, FEB 6 at NOON Gershwin & Bernstein | FRI, FEB 6 at 8PM Gershwin & Bernstein | SAT, FEB 7 at 8PM Bravo Broadway | FRI, FEB 13 at 8PM Bravo Broadway | SAT, FEB 14 at 3PM Bravo Broadway | SAT, FEB 14 at 8PM Tchaikovsky 1812 & Violin Concerto | FRI, FEB 20 at 8PM Tchaikovsky 1812 & Violin Concerto | SAT, FEB 21 at 8PM Chopin Piano Concerto No. 1 | FRI, MAR 6 at 8PM Chopin Piano Concerto No. 1 | SAT, MAR 7 at 8PM Hollywood Hits | FRI, MAR 13 at 8PM Hollywood Hits | SAT, MAR 14 at 8PM Friday Favorites: Beethoven “Emperor” Concerto | FRI, MAR 20 at NOON Beethoven “Emperor” Concerto | FRI, MAR 20 at 8PM Beethoven “Emperor” Concerto | SAT, MAR 21 at 8PM Star Wars & More! | SAT, MAR 28 at 1PM Star Wars & More! | SAT, MAR 28 at 4PM Mozart “Great” Mass | FRI, APR 10 at 8PM Mozart “Great” Mass | SAT, APR 11 at 8PM Pictures at an Exhibition | FRI, APR 24 at 8PM Pictures at an Exhibition | SAT, APR 25 at 8PM Jurassic Park in Concert | FRI, MAY 1 at 8PM Jurassic Park in Concert | SAT, MAY 2 at 8PM Jurassic Park in Concert | SUN, MAY 3 at 3PM Friday Favorites: Appalachian Spring | FRI, MAY 8 at NOON Appalachian Spring | FRI, MAY 8 at 8PM Appalachian Spring | SAT, MAY 9 at 8PM ICON: The Voices That Changed Music | SAT, MAY 16 at 8PM Desired Concert Select a concert Dvořák: New World Symphony | THU, SEP 25 at 7:30PM Holiday Pops | WED, DEC 10 at 7:30PM A Little Night Music |  THU, JAN 29 at 7:30PM Classical Favorites | THU, APR 23, 7:30PM Desired Concert Select a concert Rhapsody in Blue | SUN, SEP 7 at 3PM Dvořák: New World Symphony  | SUN, SEP 28 at 3PM Beethoven “Eroica” Symphony | THU, NOV 13 at 7:30PM Handel's Messiah | SUN, DEC 7 at 3PM All Mozart | SUN, JAN 25 at 3PM A Little Night Music | SUN, FEB 1 at 3PM Chopin Piano Concerto No. 1 | THU, MAR 5 at 7:30PM Desired Concert Select a concert All Beethoven | THU, OCT 09 at 7:30PM Holiday Pops | THU, DEC 11 at 3PM Holiday Pops | THU, DEC 11 at 7:30PM All Mozart | THU, JAN 22 at 7:30PM Beethoven “Emperor” Concerto | SUN, MAR 22 at 3PM Desired Concert Select a concert Rachmaninoff Symphony No. 2 | THU, OCT 30 at 7:30PM Holiday Pops | TUE, DEC 02 at 4PM Holiday Pops | TUE, DEC 02 at 7:30PM From Classical to Broadway | TUE, APR 7 at 7:30PM Ticket Quantity Preferred Seating Location Orchestra Rear Orchestra Lower Balcony Accessible Seating? Yes No Special Requests/Comments *Please note that there is no payment due at this time. You will be contacted within 48 hours to confirm your reservation. Submit × Search for: Search ×"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://ncsymphony.org/about-us/our-people/staff/",
      "text": "Staff - North Carolina Symphony Close North Carolina Symphony Item #3 Close Item #3 Open Item #3 Search ATTEND Menu Concert Calendar Subscriptions & Packages Buy Tickets Season Brochure Group Tickets Special Offers Mobile Entry FAQ Box Office Information My Account DISCOVER Menu Plan Your Visit Raleigh Cary Chapel Hill Wilmington New Bern Pinehurst SUPPORT Menu Support Your Symphony Individual Support Corporate Giving Foundation Giving Endowment Giving Planned Giving Special Events Become a Volunteer Donate Now EDUCATION Menu Education Programs Education Concerts (grades 3-5) Elementary School Programs Middle, High School & College Educator Programs Music Discovery Musical Meditations YOUR SYMPHONY Menu About Us Our Story Our People Carlos Miguel Prieto Press Room Employment Attend Concert Calendar Subscriptions & Packages Buy Tickets Season Brochure Group Tickets Special Offers Mobile Entry FAQ Box Office Information My Account Discover Plan Your Visit Raleigh Cary Chapel Hill Wilmington New Bern Pinehurst Support Ways to Give Individual Support Foundation Giving Endowment Giving Planned Giving Volunteer your Time Donate Education Education Programs Education Concerts (grades 3-5) Elementary School Programs Middle School, High School & College Programs Educator Programs Music Discovery Musical Meditations Your Symphony About Us Our Story Our People Carlos Miguel Prieto Press Room Employment Search Sandi M.A. Macdonald President & CEO About Us Our People Staff PRESIDENT’S OFFICE Sandi M.A. Macdonald – President & CEO Stephen Thompson – Executive Assistant to the President & CEO Artistic Operations Donald Tippett – Vice President of Orchestra Operations Samantha Gallup – Operations Manager Maggie Hemedinger – Education & Community Engagement Manager Hsing-I Ho – Director of Orchestra Personnel Zumanah Kamal – Education Coordinator Chris Moore – Stage Manager José Muñiz – Artistic Coordinator Bo Osborne – Production Manager Mary Shannon – Orchestra Personnel Coordinator Jason Spencer – Assistant Vice President of Education & Community Engagement Taylor Troyer – Assistant Orchestra Librarian Stephanie Wilson – Principal Orchestra Librarian (The Mary Colvert and Banks C. Talley Chair) Finance & Administration Robert Schiller – Senior Vice President for Finance and Administration & CFO Carol Brown – Accounting & Payroll Manager Tiffany Debnam – Database & Fulfillment Manager Tiffany Haddock – Director of Human Resources & Business Systems Stan Williams – Public Affairs Contractor Jan Zimmermann – Assistant Vice President of Finance Marketing & Audience Development Linda Charlton – Vice President for Marketing & Audience Development Riley Adams – Box Office Associate Jennifer Blackman – Graphic Designer Ashley Blankenship – Senior Director of Marketing & Sales Rebecca Doel – Digital Sales & Engagement Manager Andrew Gouck – Assistant Box Office Manager Richard Hess – Communications Project Manager Paola Hickok – Box Office Associate Ellie Jensen – Group Sales Manager Maggie Pate – Director of Communications Emma Wall – Assistant Vice President of Marketing & Sales Maya Waller – Box Office Associate Philanthropy Lisa Ransom – Vice President of Philanthropy Riley Bennett – Foundations & Grants Manager Rebecca Gunn – Assistant Vice President of Philanthropy Kaitlyn Lincoln – Donor Relations Coordinator Olivia Pedigo – Annual Giving Manager Jill Viehweg – Senior Director of Corporate & Foundation Giving Emily Wilbourne – Director of Leadership Giving NORTH CAROLINA SYMPHONY State Headquarters & Box Office 3700 Glenwood Avenue, Ste. 130, Raleigh, NC 27612 919.733.2750 | 877.627.6724 (Toll-Free) View accessibility services here CONNECT WITH US Sign up for NCS emails to be the first to know about concerts and events, receive special discounts, and access exclusive photos and videos. Sign Up The North Carolina Symphony gratefully acknowledges financial support from Wake County, the City of Raleigh, and the State of North Carolina. Copyright © 2000-2025 North Carolina Symphony   | Privacy Policy English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Norsk Türkçe Bahasa Indonesia Português (Brasil) 日本語 한국어 简体中文 العربية Русский हिन्दी Українська Srpski Accessibility  Adjustments Powered by OneTap Hide Toolbar Back How long do you want to hide the accessibility toolbar? Hide Toolbar Duration Only for this session 24 hours A Week Not Now Hide Toolbar Bigger Text Cursor Letter Spacing Readable Font Align Text Line Height Colors Grayscale Brightness Invert Colors Orientation Highlight Links Stop Animations Hide Images Reading Mask Reading Line Highlight Al Reset Settings Version 2.5.0 Request Group Tickets Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Reserve your group's seats today! Fill out the form with your group details, information, and preferred performances.  For more information, email Ellie Jensen at ejensen@ncsymphony.org or call 919.789.5458. Name * First Last Phone Email * Group Type * Alumni Association Business or Corporation Choral Education Individual Organization (e.g, Library or Foundation) Religious Tour & Travel Other If Other, please specify Group Name * location Concert Group Concert Location * Raleigh Chapel Hill Wilmington New Bern Moore County Other Please specify location and/or concert Desired Concert Select a concert Video Games Live | SAT, SEP 13 at 7:30PM Dvořák: New World Symphony  | FRI, SEP 19 at 8PM Dvořák: New World Symphony  | SAT, SEP 20 at 8PM Dvořák: New World Symphony  | FRI, SEP 26 at NOON The Music of John Williams | FRI, OCT 03 at 8PM The Music of John Williams | SAT, OCT 04 at 8PM All Beethoven | FRI, OCT 10 at 8PM All Beethoven | SAT, OCT 11 at 8PM Copland Symphony No. 3 | FRI, OCT 17 at 8PM Copland Symphony No. 3 | SAT, OCT 18 at 8PM Halloween Spooktacular | SAT, OCT 25 at 1PM Halloween Spooktacular | SAT, OCT 25 at 4PM Rachmaninoff Symphony No. 2 | FRI, OCT 31 at 8PM Rachmaninoff Symphony No. 2 | SAT, NOV 1 at 8PM Rick Steves’ Europe: A Symphonic Journey | THU, NOV 6 at 7:30PM Rick Steves’ Europe: A Symphonic Journey | FRI, NOV 7 at 7:30PM Beethoven “Eroica” Symphony | FRI, NOV 14 at 8PM Beethoven “Eroica” Symphony | SAT, NOV 15 at 8PM Friday Favorites: Beethoven “Eroica” Symphony | FRI, NOV 14 at NOON Dolly Parton’s Threads: My Songs in Symphony | FRI, NOV 21 at 7:30PM Dolly Parton’s Threads: My Songs in Symphony | SAT, NOV 22 at 3PM Cirque Holiday Pops | WED, NOV 26 at 4PM Cirque Holiday Pops | FRI, NOV 28 at 3PM Cirque Holiday Pops | FRI, NOV 28 at 7:30PM Cirque Holiday Pops | SAT, NOV 29 at 3PM Cirque Holiday Pops | SAT, NOV 29 at 7:30PM Holiday Pops | FRI, DEC 12 at NOON Holiday Pops | FRI, DEC 12 at 8PM Holiday Pops | SAT, DEC 13 at 3PM Holiday Pops | SAT, DEC 13 at 8PM Handel's Messiah | FRI, DEC 5 at 8PM Handel's Messiah | SAT, DEC 6 at 3PM A Candlelight Christmas | FRI, DEC 19 at 7:30PM A Candlelight Christmas | SAT, DEC 20 at 3PM A Candlelight Christmas | SUN, DEC 21 at 3PM A Candlelight Christmas | TUE, DEC 23 at 3PM A Candlelight Christmas | TUE, DEC 23 at 7:30PM The Music of Harry Potter | SAT, JAN 3 at 1PM The Music of Harry Potter | SAT, JAN 3 at 4PM Carmina Burana | FRI, JAN 9 at 8PM Carmina Burana | SAT, JAN 10 at 8PM Revolution: The Music of the Beatles | FRI, JAN 16 at 8PM Revolution: The Music of the Beatles | SAT, JAN 17 at 3PM Revolution: The Music of the Beatles | SAT, JAN 17 at 8PM All Mozart | FRI, JAN 23 at 8PM All Mozart | SAT, JAN 24 at 8PM Friday Favorites: Gershwin & More | FRI, FEB 6 at NOON Gershwin & Bernstein | FRI, FEB 6 at 8PM Gershwin & Bernstein | SAT, FEB 7 at 8PM Bravo Broadway | FRI, FEB 13 at 8PM Bravo Broadway | SAT, FEB 14 at 3PM Bravo Broadway | SAT, FEB 14 at 8PM Tchaikovsky 1812 & Violin Concerto | FRI, FEB 20 at 8PM Tchaikovsky 1812 & Violin Concerto | SAT, FEB 21 at 8PM Chopin Piano Concerto No. 1 | FRI, MAR 6 at 8PM Chopin Piano Concerto No. 1 | SAT, MAR 7 at 8PM Hollywood Hits | FRI, MAR 13 at 8PM Hollywood Hits | SAT, MAR 14 at 8PM Friday Favorites: Beethoven “Emperor” Concerto | FRI, MAR 20 at NOON Beethoven “Emperor” Concerto | FRI, MAR 20 at 8PM Beethoven “Emperor” Concerto | SAT, MAR 21 at 8PM Star Wars & More! | SAT, MAR 28 at 1PM Star Wars & More! | SAT, MAR 28 at 4PM Mozart “Great” Mass | FRI, APR 10 at 8PM Mozart “Great” Mass | SAT, APR 11 at 8PM Pictures at an Exhibition | FRI, APR 24 at 8PM Pictures at an Exhibition | SAT, APR 25 at 8PM Jurassic Park in Concert | FRI, MAY 1 at 8PM Jurassic Park in Concert | SAT, MAY 2 at 8PM Jurassic Park in Concert | SUN, MAY 3 at 3PM Friday Favorites: Appalachian Spring | FRI, MAY 8 at NOON Appalachian Spring | FRI, MAY 8 at 8PM Appalachian Spring | SAT, MAY 9 at 8PM ICON: The Voices That Changed Music | SAT, MAY 16 at 8PM Desired Concert Select a concert Dvořák: New World Symphony | THU, SEP 25 at 7:30PM Holiday Pops | WED, DEC 10 at 7:30PM A Little Night Music |  THU, JAN 29 at 7:30PM Classical Favorites | THU, APR 23, 7:30PM Desired Concert Select a concert Rhapsody in Blue | SUN, SEP 7 at 3PM Dvořák: New World Symphony  | SUN, SEP 28 at 3PM Beethoven “Eroica” Symphony | THU, NOV 13 at 7:30PM Handel's Messiah | SUN, DEC 7 at 3PM All Mozart | SUN, JAN 25 at 3PM A Little Night Music | SUN, FEB 1 at 3PM Chopin Piano Concerto No. 1 | THU, MAR 5 at 7:30PM Desired Concert Select a concert All Beethoven | THU, OCT 09 at 7:30PM Holiday Pops | THU, DEC 11 at 3PM Holiday Pops | THU, DEC 11 at 7:30PM All Mozart | THU, JAN 22 at 7:30PM Beethoven “Emperor” Concerto | SUN, MAR 22 at 3PM Desired Concert Select a concert Rachmaninoff Symphony No. 2 | THU, OCT 30 at 7:30PM Holiday Pops | TUE, DEC 02 at 4PM Holiday Pops | TUE, DEC 02 at 7:30PM From Classical to Broadway | TUE, APR 7 at 7:30PM Ticket Quantity Preferred Seating Location Orchestra Rear Orchestra Lower Balcony Accessible Seating? Yes No Special Requests/Comments *Please note that there is no payment due at this time. You will be contacted within 48 hours to confirm your reservation. Submit × Search for: Search ×"
    },
    {
      "url": "https://www.northportsymphony.com/boardandstaff",
      "text": "Board and Staff | North Port Symphony top of page Sharing the Joy of Music Home About Musicians Meet the Maestro Board and Staff Support Donate Concerts Seat Prices Education Join the Symphony Contact More Use tab to navigate through the menu items. 2024-2025 Board & Staff Board of Trustees Kathleen Karpathy President Chris Owens Vice President Piilani Edwards Secretary Ken Trapp Treasurer Allison Deal Trustee Kathy Johnson Trustee Shawn Marren Trustee Karen Tuttle Trustee Aimee Schneider Trustee Lois Weeks Trustee Staff Jesse Holmgren Librarian & Personnel Director Jim Pack Equipment Manager Troy Messner Business Manager Partnerships In-Kind Sponsors: Media Sponsor: Mailing Address: ​ North Port Symphony PO Box 7859 North Port, FL 34290 ​ info@northportsymphony.com bottom of page"
    },
    {
      "url": "https://www.njsymphony.org/about/administrative-staff",
      "text": "Administrative Staff | New Jersey Symphony [Skip to Content] Translate Email Sign-Up Search Search Accessibility Tickets About Contact Donate My Account Concerts & Events Concert Listing All Upcoming Concerts & Events Symphony at the Shore Relaxed Performances Season Tickets Subscriptions Renew Online Today Compose Your Own Series Subscriber Benefits Patron Services My Account Contact Us Digital Wallet Ticket Exchanges Gift Certificates Frequently Asked Questions Discount Tickets Discount Ticket Opportunities Group Tickets Next Gen Greater Newark Neighbors Special Events Fundraisers Travel Community Programs Community Partners Bring Symphony Musicians to You Neighborhood Concerts Visit Visit Information Frequently Asked Questions First Timers’ Guide Accessibility Bus Transportation Venues NJPAC in Newark Morristown New Brunswick Princeton Red Bank Symphony Center in Jersey City Accessibility Watch & Listen Virtual Performances On Demand Virtual Special Concerts Couch Concerts Broadcast & Chat Ask a Musician Concert Films On Demand Video Features Listen Musicians Musical Leadership Xian Zhang Joshua Bell Gregory D. McDaniel Eric Wyrick Diego García Terrence Thornhill Allison Loggins-Hull Musicians Audition Information Artist Initiatives Colton Fellowships Edward T. Cone Composition Institute Bring Symphony Musicians to You Listen About New Jersey Symphony History Behind the Scenes Newsroom In the News Press Releases Press Materials Board of Trustees Administrative Staff Careers Contact Us Education & Community Explore Concerts for Young People El Sistema New Jersey Alliance NJ Symphony Youth Orchestra New Jersey Symphony Youth Orchestra Artistic Leadership Our Voices Community Programs Community Partners Bring Symphony Musicians to You Neighborhood Concerts Support Personal Giving Symphony Friends The Amadeus Circle Planned Giving Donor-Advised Fund Giving Donor Events Make a Gift Your Impact 2023–24 Season Donors Corporate and Foundation Partnerships Fundraisers 2025 Opening Night Celebration Development Staff Directory Tickets Contact Donate My Account View Past Events Home | About | Administrative Staff Administrative Staff Office Hours Monday–Friday from 9 am–5 pm, except on holidays as noted below. *On Fridays between the second weekend in June and Labor Day, the office closes at 1 pm. Holiday Office Closures New Year’s Day; Martin Luther King, Jr., Day; Presidents Day; Memorial Day; Juneteenth; Independence Day; Labor Day; Columbus Day; Thanksgiving Day; and Christmas Day. Administrative Staff Listing Administrative & Financial Services Terry D. Loftis President & CEO The Ruth C. and A. Michael Lipper President & CEO Chair Steven Hill Interim Chief Financial Officer 973.735.1741 cfointerim@njsymphony.org Karen Duda Accounts Payable Coordinator & Office Manager 973.735.1710 kduda@njsymphony.org Philip Leininger Chief of Staff & Board Liaison 973.735.1705 pleininger@njsymphony.org David Moore Controller 973.735.1709 dmoore@njsymphony.org Kevin Pruner Tessitura Database Manager 973.735.1731 kpruner@njsymphony.org Artistic Operations Patrick Chamberlain Interim Vice President of Artistic Planning pchamberlain@njsymphony.org Kristin Orlando Vice President of Operations 973.735.1739 korlando@njsymphony.org Adria Benjamin Orchestra Personnel Manager personnelmanager@njsymphony.org Robert Bradshaw Director of Orchestral Operations 973.735.1707 rbradshaw@njsymphony.org Ryan Brickle Stage Technician Gary Edison Stage Technician Tracy Nguyen Principal Librarian 973.735.1743 tnguyen@njsymphony.org Sydney Swearengin Artistic Coordinator 973.735.1735 sswearengin@njsymphony.org Santa-Li Zambrano Operations Manager 973.735.1733 szambrano@njsymphony.org Development Renee Pachucki Interim Vice President of Development 973.735.1722 rpachucki@njsymphony.org Hannah Aberin Development Manager 973.735.1723 haberin@njsymphony.org Jesse Goodale Manager of Special Events 973.735.1729 jgoodale@njsymphony.org Caelan Jimenez Development Support Specialist 973.735.1746 cjimenez@njsymphony.org Education & Community Engagement Susan Shiff Interim Vice President of Education & Community Engagement The Marjorie Bunnell Charitable Fund Vice President of ECE Chair Joanna Borowski Director of Education 973.735.1734 jborowski@njsymphony.org Ann Kriewall Director of Operations & Community Programs 973.735.1737 akriewall@njsymphony.org Sam McDonald Education Manager 973.735.1736 smcdonald@njsymphony.org Gretta Mulchandani Operations & Community Programs Manager 845.545.5817 gmulchandani@njsymphony.org Nisha Srinivas Community Liaison 862.401.4515 nsrinivas@njsymphony.org Marketing, External Affairs & Patron Services Geoffrey Anderson Vice President of Marketing & External Affairs 973.735.1713 ganderson@njsymphony.org Todd Abedrabbo Marketing Production Specialist 973.735.1714 tabedrabbo@njsymphony.org Lauren Abrams Marketing Manager 973.735.1726 labrams@njsymphony.org Grace Liu Anderson Director of Marketing 973.735.1719 gliuanderson@njsymphony.org Raquel Bonassisa Creative Director 973.735.1716 rbonassisa@njsymphony.org Enide Charlemagne Single Ticket Lead 973.735.0965 echarlemagne@njsymphony.org Julia Escueta-Acosta Director of Patron Services 973.735.0966 jescueta@njsymphony.org Dan Graziano Digital Media Content Manager 973.735.1712 dgraziano@njsymphony.org Carissa Taliaferro Patron Services Representative 973.735.0968 ctaliaferro@njsymphony.org Joy Tan Patron Services Representative 973.735.0967 jtan@njsymphony.org Patron Services Representatives: Julia Escueta-Acosta, Director of Patron Services Enide Charlemagne, Single Ticket Lead Carissa Taliaferro, Patron Services Representative Joy Tan, Patron Services Representative Call 1.800.ALLEGRO (255.3476) to reach a Patron Services representative. Concerts & Events Concert Listing Season Tickets Patron Services Discount Tickets Special Events Community Programs Visit Visit Information Venues Accessibility Watch & Listen Virtual Performances On Demand Concert Films On Demand Video Features Listen Musicians Musical Leadership Musicians Audition Information Artist Initiatives Bring Symphony Musicians to You Listen About New Jersey Symphony History Behind the Scenes Newsroom Board of Trustees Administrative Staff Careers Contact Us Education & Community Explore Concerts for Young People El Sistema New Jersey Alliance NJ Symphony Youth Orchestra Community Programs Support Personal Giving Make a Gift Your Impact Corporate and Foundation Partnerships Fundraisers Development Staff Directory Made possible by funds from the New Jersey State Council on the Arts, a partner agency of the National Endowment for the Arts. Office: 973.624.3713 Box Office: 1.800.ALLEGRO (255.3476) Email Sign-Up Venues New Jersey Performing Arts Center in Newark State Theatre New Jersey in New Brunswick Richardson Auditorium in Princeton Mayo Performing Arts Center in Morristown Count Basie Center for the Arts in Red Bank Symphony Center in Jersey City Made possible by funds from the New Jersey State Council on the Arts, a partner agency of the National Endowment for the Arts. © 2025\t\t\tNew Jersey Symphony. | Sitemap | Terms Of Use | Conditions Of Sale | Privacy Policy | Accessibility a carbon house experience The New Jersey Symphony Orchestra is a registered 501(c)(3) organization. Tax ID#22-1559422."
    },
    {
      "url": "https://www.northstatesymphony.org/contactus/",
      "text": "Contact Us - North State Symphony Donate Buy Tickets Events & Performances Concert Season Mendelssohn’s Scottish Frankenstein Billy The Kid Brilliant Bartók Subscribe and Save Plan Your Visit Events Support the Symphony Impact Donate Chico Guild & Redding League Community & Education Young Artist Auditions About Meet the Director Meet the Musicians Board & Regents Staff Opportunities Contact Us Contact Us Get in Touch We’d love to hear from you! Whether you have questions, feedback, or need assistance, our team is here to help. Additional contact information is below. Donations for the North State Symphony may be mailed to: Gift Processing – 0999 California State University, Chico 400 W. 1st St. Chico, CA 95928 General North State Symphony contact info: North State Symphony 400 W. 1st St. Chico, CA 95929-0116 Phone Number: (530) 898-5208 Email: symphony@csuchico.edu North State Symphony Box Offices Chico University Box Office 400 W. 1st St. Chico, CA 95929-0120 Phone Number: (530) 898-6333 Email: ubocustomersupport@csuchico.edu Physical location: Corner of W. 3rd & Chestnut St. Redding Cascade Theatre Box Office 1733 Market St. Redding, CA 96001 Phone Number: 530-243-8877 Email Address: boxoffice@cascadetheatre.org Connect with Us First Name Last Name Email Address * Phone Number Reason for Inquiry * General Inquiry Donation Inquiry North State Symphony Box Offices Inquiry Redding Cascade Theatre Box Office Inquiry Additional Comments 0 / 180 Submit Donate Invest in the future of classical music. Make a Donation Season Tickets Experience timeless music. Get your Ticket Address North State Symphony 400 W. 1st St. Chico, CA 95929-0116 Phone (530) 898-5917 Subscribe for Updates Events & Performances: Concert Season Buy Season Tickets Plan Your Visit Support the Symphony: Impact Donate Chico Guild & Redding League Community & Education: Young Artist Auditions About Us: Meet the Musicians Board & Regents Staff Opportunities Contact Us Address North State Symphony 400 W. 1st St. Chico, CA 95929-0116 Phone (530) 898-5917 Honoring the Mechoopda People Terms & Conditions © 2025 North State Symphony Website by ironpaper.com"
    }
  ]
}