{
  "fuentes": [
    {
      "url": "https://novecento.com/our-team/",
      "email": "info@novecento.com"
    },
    {
      "url": "https://novecento.com/terms-of-use/",
      "email": "contact@novecento.com"
    },
    {
      "url": "https://novecento.com/terms-of-use/",
      "email": "contact@suviche.com"
    },
    {
      "url": "https://novecento.com/terms-of-use/",
      "email": "info@novecento.com"
    },
    {
      "url": "https://novecento.com/",
      "email": "cividini@novecento.com"
    },
    {
      "url": "https://novecento.com/",
      "email": "info@novecento.com"
    },
    {
      "url": "https://shop.milanogrp.com/pages/contact",
      "email": "info@milanogrp.com"
    },
    {
      "url": "https://shop.milanogrp.com/pages/contact",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://shop.milanogrp.com/pages/contact",
      "email": "milano-grp-fnf-logo_150x@2x.png"
    },
    {
      "url": "https://shop.milanogrp.com/pages/contact",
      "email": "milano-grp-fnf-logo_95x@2x.png"
    },
    {
      "url": "https://shop.milanogrp.com/pages/contact",
      "email": "sales@milanoadv.ae"
    },
    {
      "url": "https://novecento.com/locations/delray-beach/",
      "email": "info@novecento.com"
    },
    {
      "url": "https://novecento.com/locations/key-biscayne/",
      "email": "info@novecento.com"
    },
    {
      "url": "https://novecento.com/privacy-policy/",
      "email": "info@novecento.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "hr@team.spruko.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "legaldept@team.spruko.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "sales@team.spruko.com"
    },
    {
      "url": "https://novecento.com/locations/doral/",
      "email": "info@novecento.com"
    },
    {
      "url": "https://novecento.com/contact-us/",
      "email": "info@novecento.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://novecento.com/about-us/",
      "email": "info@novecento.com"
    }
  ],
  "mails": [
    "cividini@novecento.com",
    "contact@novecento.com",
    "contact@suviche.com",
    "hr@team.spruko.com",
    "info@milanogrp.com",
    "info@novecento.com",
    "info@scibpaints.com",
    "info@stagheaddesigns.com",
    "legaldept@team.spruko.com",
    "milano-grp-fnf-logo_150x@2x.png",
    "milano-grp-fnf-logo_95x@2x.png",
    "sales@milanoadv.ae",
    "sales@team.spruko.com"
  ],
  "nombre_sitio": "novecento.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://novecento.com/our-team/",
      "text": "Our Team – Novecento Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne OUR TEAM OUR GUIDING PRINCIPLES Initiative Initiative means we take action without direction from above to improve our knowledge and come up with solutions to problems. With each team member taking initiative, the leverage is immense. Innovation Innovation means looking at new ways of doing the same thing. It also means knowing which areas are appropriate for innovation, having the courage to change, and tolerating failures. Continuous Improvement Continuous improvement is how we get better. We continually seek ways to learn from processes and improve them and ourselves. The chain of command has the obligation to develop and institute mechanisms to achieve continuous improvement. Commitment Commitment means we are present when we come to work. We give it our best. We choose to be here. Empowerment We encourage those below us to take action and support them if they make mistakes. We employ stewardship delegation, explain what we want accomplished and allow flexibility in how it is accomplished. Openness We exercise participative openness: freedom to speak one’s mind. We challenge our own thinking and we think out loud. Timelessness Timeliness means we do things on time: start work on time, qualify on time, and are ready for busy hours on time. Working to accomplish processes quickly and efficiently results in a more effectively organization. Intimate Technical Knowledge Intimate technical knowledge means that each of us is responsible for learning our areas of responsibility. We make decisions based on technical reasons, not hope. WATCH AND EXPLORE NOVECENTO CAREERS Play Video OUR TEAM MEMBERS General Manager Brian Henderson Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium, totam rem aperiam, eaque ipsa quae ab illo invent. Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium, totam rem aperiam, eaque ipsa quae ab illo invent. Operations Manager Ricardo Rodriguez Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium, totam rem aperiam, eaque ipsa quae ab illo invent. Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium, totam rem aperiam, eaque ipsa quae ab illo invent. Logistics Chief Officer Brandon Johnson Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium, totam rem aperiam, eaque ipsa quae ab illo invent. Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium, totam rem aperiam, eaque ipsa quae ab illo invent. Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    },
    {
      "url": "https://novecento.com/terms-of-use/",
      "text": "Terms Of Use – Novecento Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne NOVECENTO TERMS OF USE LAST UPDATED: June 19, 2020 These Terms of Use (“Terms”) govern your access to, and use of, the websites (each, a “Site” or “Website”), mobile applications, the mobile text program, third party messaging platforms, and online services or programs (collectively, the “Services”) operated by or on behalf of the Novecento group of companies (“Novecento”) and on which these Terms appear. These Terms are a legal and binding agreement between you and Novecento. Your use of the Services indicates your acceptance of these terms. Do not use the Services if you do not agree to be bound by these Terms. Novecento strives to ensure that the information contained on the Services is accurate and reliable. However, Novecento and the Services are not infallible and errors may sometimes occur. Therefore, to the fullest extent permissible pursuant to the applicable law, Novecento makes no representations about the reliability of the features of the Services, the Novecento Content (defined below), Submitted Content (defined below), or any other Service feature. You acknowledge that any reliance on such material and/or systems will be at your own risk. Novecento is not responsible for the information, data, text, or other materials that may appear in Submitted Content or may otherwise be submitted by users. Opinions expressed in Submitted Content do not necessarily reflect the opinions of Novecento, and Novecento does not endorse, and has no control over, Submitted Content. Submitted Content is not necessarily reviewed by Novecento prior to posting and Novecento makes no warranties, express or implied, as to the Submitted Content or to the accuracy and reliability of the Submitted Content. Novecento makes no representations regarding the amount of time that any Novecento Content or Submitted Content will be preserved. The Services are provided on an “as is, as available” basis without any representation or warranty, express or implied, of any kind. To the fullest extent permitted by law, Novecento hereby disclaims all warranties of any kind or nature, including, but not limited to, the implied warranties of merchantability, accuracy, non-infringement, and fitness for any particular purpose. Novecento disclaims any and all liability for the acts, omissions, and conduct of any third-party service providers, partners, sponsors, licensors, licensees, and the like (“Providers”) in connection with or related to your use of the Services and materials, programs, and features made available therein. In no event shall Novecento or any of Novecento’s Providers be liable to any person for damages of any kind under any legal theory, including, but not limited to, any direct, indirect, special, consequential, punitive, or other damages (lost profits, business interruption, or loss of information, programs, or data) resulting from your use or inability to use the Services, even if Novecento has been advised of the possibility of such damages. Because some states do not permit the exclusion or limitation of certain damages, in such jurisdictions, liability is limited to the fullest extent permitted by such state law. USER-SUBMITTED CONTENT Certain areas of the Services enable you to submit remarks, ideas, images, photos, suggestions, graphics, and/or other materials and content (“Submitted Content”). You acknowledge that you are responsible for whatever material you submit, and you, not Novecento, have full responsibility for the message, including its legality, reliability, appropriateness, originality, and copyright. By posting, displaying, publishing, or otherwise submitting Submitted Content on or through the Services, you understand and acknowledge that any materials, ideas, or other communications you transmit will not be treated as confidential or proprietary. Furthermore, such Submitted Content will forever be the property of Novecento and Novecento is entitled to use the Submitted Content for any commercial or other purpose whatsoever without compensation to you. ONLINE PURCHASES To purchase food products, merchandise, or other items through the Services, you must provide valid payment card and billing information. Such information will be collected by Novecento. Your information will be collected and used in accordance with Novecento’s Privacy Policy. When you purchase items through the Services, prices will be made clear during the order process. You agree to pay the price that is stated at the time of your order, as well as any applicable taxes. You also agree to have your payment card billed for the total amount displayed at check out. By purchasing items through the Services, you represent and warrant to Novecento that you are capable of entering into a contract under the applicable law. WEBSITE ACCESS Novecento hereby grants you permission to use the Services as set forth in these Terms, provided that: (i) your use of the Services as permitted is solely for your personal, noncommercial use; (ii) you will not copy or distribute any part of the Services in any medium without Novecento’s prior written authorization; (iii) you will not alter or modify any part of the Services other than as may be reasonably necessary to use the Services for their intended purpose; and (iv) you will otherwise comply with these Terms. In order to access some features of the Services, you will have to create an account. You may never use another’s account without permission. When creating your account, you must provide accurate and complete information. You are solely responsible for the activity that occurs on your account, and you must keep your account password secure. Although Novecento will not be liable for your losses caused by any unauthorized use of your account, you may be liable for the losses of Novecento or others due to such unauthorized use. HYPERLINKS The Services may link to sites not maintained by or related to Novecento. Hypertext links are provided as a service to users and are not necessarily sponsored by or affiliated with the Services or Novecento. Novecento has not necessarily reviewed the sites hyperlinked to or from the Services and is not responsible for the content of any other site. These links are to be accessed at the user’s own risk. Novecento makes no representations or warranties about the content, completeness, or accuracy of these links or the sites hyperlinked to or from the Services. Furthermore, Novecento does not implicitly endorse third-party sites hyperlinked to or from this Website. THE APPS By installing our Apps (either from Apple store, Google play or browsers) , entering to, connecting to, accessing, or using the App and/or Site, You acknowledge that You have read and understood the following terms of use including the terms of the Privacy Policy available at [Privacy Policy] (the “Privacy Policy”) (collectively, the “Terms”) and You agree to be bound by them and to comply with all applicable laws and regulations regarding Your use of the App and/or Site and You acknowledge that these terms constitute a binding and enforceable legal contract between Novecento and You. IF YOU DO NOT AGREE TO THESE TERMS, PLEASE DO NOT INSTALL THE APP, ENTER TO, CONNECT TO, ACCESS, OR USE THE APP AND/OR SITE IN ANY MANNER AND PROMPTLY ERASE THE APP AND ANY PART THEREOF, FROM YOUR MOBILE PHONE AND DO NOT USE IT IN ANY MANNER WHATSOEVER. The App provides online ordering and loyalty services. By using our Apps you can order food, receive a variety of discounts and special offerings, and pay using credit card. Using credit cards for purchasing via our apps or websites through online payment gateway. Use the App and Site is entirely free of charge. You do not have to register in order to use the App, visit the Site or purchase. However, upon downloading/registration our Apps (include website) you might be asked to provide a phone number before you may activate the App. We will then send You an SMS text (to the phone number you provided us with) with a login number which You will be required to enter in the first-time registration to opt in your account. Users may visit the Site and use our Apps anonymously, without opt-in, and order online. Our platform will still keep the order information for accounting and financial reasons. However, if a User wishes to receive special offerings and gifts tailored just for him (for example, free gift on Your birthday or other special offerings), and, if a user would like to save his credit card information, then such User will have to opt-in to the platform and might share with us certain personal information (such as, date of birth, etc.) during opt-in process and registration. Additional information on the above mentioned matters is available in our Privacy Policy. MINORS To enjoy the App, You must be over the age of thirteen (13). We reserve the right to request proof of age at any stage so that we can verify that minors under the age of thirteen (13) are not using the App. In the event that it comes to our knowledge that a person under the age of thirteen (13) is using our Apps, we will prohibit and block such User from accessing the App and will make all efforts to promptly delete any Personal Information (as such term is defined in our Privacy Policy at [Privacy Policy]) with regard to such User. TEXT MESSAGING NOTICE If you choose to participate in any Novecento promotion that may involve the use of text messaging (either sending or receiving), Novecento will not charge you for the text messaging; however, standard text messaging rates will apply to each text message sent or received as provided in your wireless rate plan (contact your carrier for pricing plans and details). MOBILE TERMS & CONDITIONS MOBILE ALERTS You must be 13 years of age or older to participate in the Novecento mobile text program. By participating in the Novecento mobile text program and signing up for mobile offers and text updates, you consent to receive future recurring automated marketing text messages to the mobile number provided from or on behalf of Novecento. You also acknowledge that your agreement to receive these messages isn’t required as a condition of purchase. If you subscribed to Novecento mobile text program you may receive a text message from the following numbers. These number can be updated from time to time. (313) 769-3684 (231) 879-5048 (857) 214-2738 (586) 649-3776 (682) 587-2275 (231) 383-7236 (786) 567-3750 (213) 319-2797 (917) 540-2443 (231) 774-2123 (737) 210-4409 (231) 468-6179 (202) 301-4218 (520) 447-3054 (504) 595-1551 (520) 457-6744 Message and data rates may apply. All charges are billed by and payable to your mobile service provider. If you would like to be removed from the Novecento mobile text program, you must text STOP to the number from where you received the text message. This is the exclusive method for opting out. Novecento reserves the right to remove subscribers from our messaging database at our discretion. For more information you can contact us at contact@Novecento.com . In the event that you change or deactivate your mobile number it is your responsibility to notify Novecento here to have your number removed. Novecento will not be liable for any delays in the receipt of any SMS messages or undelivered messages. T-Mobile policies require that we specify that T-Mobile, also, will not be liable for any delays in the receipt of any SMS messages or undelivered messages. Data obtained from you in connection with this SMS service may include your cell phone number, your carrier’s name, the date, time and content of your messages and other information you provide to us as part of this service. We may use this information to contact you and to provide the services you request from us. AMENDEMENTS TO THE TERMS Novecento reserves the right at any time to update, change, modify, or revise these Terms and Conditions. Any changes will become effective upon posting the changes, modifications or revisions to the Online Services, along with the date on which it was most recently updated as indicated by the “Last Updated” section at the end of these Terms and Conditions. Your continued access to or use of the Online Services after any such changes indicates your acceptance of the Terms and Conditions as modified. It is your responsibility to review the Terms and Conditions regularly for updates. VIOLATION OF THESE TERMS AND REMEDIES You agree that Novecento may, in its sole discretion and without prior notice, block and/or terminate your access to the Services if Novecento determines that you have violated these Terms or other agreements or guidelines that may be associated therewith. You also agree that any violation, or threatened violation, by you of these Terms constitutes an unlawful and unfair business practice, and will cause irreparable and unquantifiable harm to Novecento. You also agree that monetary damages would be inadequate for such harm and consent to Novecento’s obtaining any injunctive or equitable relief that Novecento deems necessary or appropriate. These remedies are in addition to any other remedies that Novecento may have at law or in equity. If Novecento takes legal action against you as a result of your violation of these Terms, Novecento will be entitled to recover from you, and you agree to pay, all reasonable attorneys’ fees and costs of such action, in addition to any other relief granted to Novecento. You agree that Novecento will not be liable to you or to any third party for termination of your access to the Services, mobile app, programs, and/or services as a result of any violation of these Terms. GOVERNING LAW AND JURISDICTION These Terms are governed by United States law and are subject to all applicable federal, state, and local laws and regulations. All issues and questions concerning the construction, validity, interpretation, and enforceability of these Terms, or the rights and obligations of you or Novecento in connection with your use of the Services or your Submitted Content, shall be governed by, and construed in accordance with, the laws of the State of Florida, without giving effect to the conflict of laws rules thereof. DISPUTE RESOLUTION, ARBITRATION CLAUSE AND CLASS ACTION WAIVER You agree that any claim or dispute at law or equity that has arisen or may arise relating in any way to or arising out of these Terms will be resolved in accordance with the provisions set forth in this Dispute Resolution section. PLEASE READ THIS SECTION CAREFULLY. IT AFFECTS YOUR RIGHTS AND WILL HAVE A SUBSTANTIAL IMPACT ON HOW CLAIMS YOU AND WE HAVE AGAINST EACH OTHER ARE RESOLVED. You agree that whenever you have a disagreement with Novecento arising out of, connected to, or in any way related to these Terms, you will send a written notice to Novecento (“Demand”). You agree that the requirements of this Dispute Resolution section will apply even to disagreements that may have arisen before you accepted these Terms. You must send the Demand to the following address (the “Notice Address”): Legal Department, 900 Restaurants LLC, 2175 Nw 24 th Av, Miami, FL 33142. You agree that you will not take any legal action, including filing a lawsuit or demanding arbitration, until 20 business days after you send a Demand. If the disagreement stated in the Demand is not resolved to your satisfaction within 10 business days after it is received, and you intend on taking legal action, you agree that you will file a demand for arbitration with the American Arbitration Association (the “Arbitrator”). This arbitration provision limits the ability of you and Novecento to litigate claims in court and you and Novecento each agree to waive your respective rights to a jury trial or a state or federal judge. There is no judge or jury in arbitration, and court review of an arbitration award is limited. However, an arbitrator can award on an individual basis the same damages and relief as a court (including injunctive and declaratory relief or statutory damages), and must follow these Terms as a court would. You agree that you will not file any lawsuit against Novecento in any state or federal court. You agree that if you do sue in state or federal court, and Novecento brings a successful motion to compel arbitration, you must pay all fees and costs incurred by Novecento in court, including reasonable attorney’s fees. For any such filing of a demand for arbitration, you must effect proper service under the rules of the Arbitrator and notice to the Notice Address may not be sufficient. If, for any reason, the American Arbitration Association is unable to conduct the arbitration, you may file your case with any national arbitration company. The Arbitrator shall apply the AAA Consumer-Related Disputes Supplementary Procedure effective September 15, 2005 (as may be amended) and as modified by the agreement to arbitrate in this Dispute Resolution section. You agree that the Arbitrator will have sole and exclusive jurisdiction over any dispute you have with Novecento. The Federal Arbitration Act allows for the enforcement of arbitration agreements and governs the interpretation and enforcement of the agreement to arbitrate. You agree that you will not file a class action or collective action against Novecento, and that you will not participate in a class action or collective action against them. You agree that you will not join your claims to those of any other person. Notwithstanding any other provision in these Terms, if this class action waiver is invalidated, then the agreement to arbitrate is null and void, as though it were never entered into, and any arbitration dispute at that time will be dismissed without prejudice and may be refiled in a court. Under no circumstances do you or Novecento agree to class or collective procedures in arbitration or the joinder of claims in arbitration. Novecento agrees that we will submit all disputes with you to arbitration before the Arbitrator. MISCELLANEOUS These Terms constitute the entire agreement between you and Novecento and govern your use of the Services and supersede all prior or contemporaneous communications and proposals whether electronic, oral or written, between you and Novecento with respect to the Services. Both you and Novecento acknowledge and agree that no partnership is formed and neither you nor Novecento has the power or the authority to obligate or bind the other. The failure of Novecento to exercise or enforce any right or provision of these Terms shall not constitute a waiver of such right or provision. If any provision of these Terms is found by a court of competent jurisdiction to be invalid or unenforceable, the parties nevertheless agree that the court should endeavor to give effect to the parties’ original intentions as reflected in the provision, and the other provisions of the Terms shall remain in full force and effect. The failure of Novecento to comply with these Terms because of an act of God, war, fire, riot, pandemic, terrorism, earthquake, actions of federal, state, or local governmental authorities, or for any other reason beyond the reasonable control of Novecento shall not be deemed a breach of this agreement. If Novecento fails to act with respect to your breach or anyone else’s breach on any occasion, Novecento is not waiving its right to act with respect to future or similar breaches. The headings in these Terms are for your convenience and reference. These headings do not limit or affect this agreement. If any provision of these Terms shall be unlawful, void, or for any reason unenforceable, then that provision shall be deemed severable from these Terms and shall not affect the validity and enforceability of any remaining provisions. BINDING AGREEMENT These Terms constitute a binding agreement between you and Novecento, and are accepted by you upon your use of the Services. This agreement constitutes the entire agreement between you and Novecento regarding the use of the Services and the features therein and supersedes and replaces any prior agreements between you and Novecento regarding the use of the Services. By using the Services, you represent that you are capable of entering into a binding agreement, and that you agree to be bound by these Terms. Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    },
    {
      "url": "https://novecento.com/",
      "text": "Novecento – Novecento Restaurant Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne 1 1 KIDS EAT FREE AUGUST 1ST - SEPTEMBER 30TH with purchase of any Miami Spice menu This August & September is for the little ones. With every Miami Spice menu purchased, your little ones dine on us - lunch, brunch, or dinner.\r\n\r\n*Available at all locations BOOK YOUR TABLE SPICE UP YOUR SUMMER WITH MIAMI SPICE AUGUST 1ST - September 30th Lunch $35, BRUNCH $35, DINNER $45. Menu available at all locations. Dishes and supplement add ons may vary by location. Lunch $35 price includes sales tax and 18% service charge. Brunch add on bottomless+$20. Dinner supplement. BOOK YOUR TABLE Fútbol season is here… y el cuerpo lo sabe FREE ROUND ON US. SELECT GAME COCKTAIL AVAILABLE* While supplies last Join us for the ultimate Watch Party at Novecento. RESERVE YOUR TABLE NOVECENTO DELRAY NOW OPEN TAKING OVER THE ICONIC FALCON HOUSE RESERVE YOUR TABLE BRUNCH SATURDAY & SUNDAY 11:00AM - 4:00PM Available at our Aventura, Brickell and Doral locations. BOOK YOUR TABLE HAPPY HOUR EVERYDAY 3:00PM - 7:00PM Novecento Delray location only\r\nThe Summer Social Golden Hour, Twice A Day\r\nThis Summer Novecento is serving up Happy Hour\r\n\r\nWeekdays from Open-6pm & From 8pm- Close\r\nFriday & Saturdays from Open -6pm & from 9pm to close RESERVE YOUR TABLE 1 1 RESERVATIONS AVENTURA BRICKELL DELRAY DORAL KEY BISCAYNE PRIVATE DINING DAILY SPECIALS AVENTURA BRICKELL DELRAY DORAL KEY BISCAYNE 900novecento TANGO & WINE 🍷 Wine night just got better. Ever HAPPY HOUR | Golden hours deserve golden company. Novecento carries the rhythm of the day, all day. From Brickell to Delray, your Miami Spice & Delray FUTBOLLL ⚽️ The #FIFAqualifiers are here, and Happy Labor Day 🥂 We’re making your long week KIDS EAT FREE ❤️ You asked, we listened. Septe Happy International Bacon Day! 🥞🥓 We’re se Load more Follow on Instagram Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    },
    {
      "url": "https://shop.milanogrp.com/pages/contact",
      "text": "Contact Us | Get in Touch with Milano Group Skip to content close Free Shipping on orders of 5 pieces and above! START YOUR OWN CLOTHING BRAND close +971 50 506 2069 sales@milanoadv.ae Location BLANK PRINTED FABRICS SPORTS BULK ORDERS CLEARANCE SALE BLOG 0 / Dhs. 0.00 CONTACT US DROP US A LINE Your Name (required) Your Email (required) Your Phone Number Your Message CONTACT INFORMATION We love to hear from you on our customer service, merchandise or any topics you want to share with us. Your comments and suggestions will be appreciated. Please complete the form below. 17th Street, Warehouse no. 5, Industrial Area 13, Sharjah, UAE +971 6 577 9495 / 1900-1570-230 info@milanogrp.com Mon - Fri 08:30 - 18:30 Sat 09:00 - 14:00 Get in touch 17th Street, Warehouse no. 5, Industrial Area 13, Sharjah, UAE sales@milanoadv.ae +971 50 506 2069 Useful links Useful links About Us Contact Us Start Your Own Clothing Brand Policies Policies Shipping Policy Return Policy Privacy Policy Newsletter Signup Newsletter Signup Subscribe to our newsletter and get 10% off your first purchase Subscribe Thanks for subscribing Copyright © 2025 Milano group. all rights reserved. Designed by Haque Tech Choosing a selection results in a full page refresh. Shop 0 Cart Account AE United Arab Emirates Sep 10, 2025 23:22 Product Tag : Product Collection : ×"
    },
    {
      "url": "https://novecento.com/locations/delray-beach/",
      "text": "Delray Beach – Novecento Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne RESERVE NOW DELRAY OVERVIEW DAILY SPECIALS PRIVATE DINING A brand-new Novecento will be located in iconic Falcon House in downtown Delray Beach, its first location in Palm Beach county. Since the restaurant is a historic site, it received minor renovations and will feature indoor seating (48 seats), outdoor seating (78 seats) under a temperature-controlled wrap- around patio, and bars both inside and outside. The décor features custom-finished oak and Novecento’s trademark red accents. (561) 4506101 Hours Monday & Tuesday: 4pm to 10pm Wednesday & Thursday: 12pm to 10pm Friday : 12:00pm to 11pm Saturday : 12pm to 11pm Sunday: 12pm to 9pm Weekend Brunch: Saturday – Sunday: 12pm – 4pm Happy Hour: The summer social golden hour, twice a day This summer Novecento is serving happy hour Weekdays from Open- 6pm & from 8pm- close Fridays and Saturdays from Open-6pm & from 9pm to close Falcon House Building, 116 NE 6th Avenue, Delray Beach FL 33483, Palm Beach Cross Street NE 6th Ave and NE 1st St Parking Details Parking Information Daytime Parking Free Self-Parking: Limited spots (8-9) available in the lot behind the restaurant during all daytime hours. Free Street Parking: Available on 6th Avenue directly in front of the restaurant, as well as on 1st Street (both east and west of 6th Avenue). Additional free parking is available in the large lot at the east end of 1st Street near the intracoastal waterway and in the adjacent park. Paid Parking: A garage is located one block away. For northbound drivers on 6th Avenue (US 1), turn right onto NE 1st Street, then right again at NE 7th Avenue—the garage entrance is on the right. Southbound drivers on 5th Avenue (US 1) should turn left onto 1st Street, continue east, then turn right on 7th Avenue—the garage entrance is a short distance ahead. Evening Parking Self-Parking: Limited spots are available behind the restaurant and in the Robes Law Firm parking lot after 6 PM, seven days a week. Free Street Parking: Available on 6th Avenue, 1st Street (east and west of 6th Avenue), and in the large lot at the east end of 1st Street near the intracoastal waterway and park. Paid Parking: The garage one block away follows the same directions as listed above. Entertainment Tango Shows on select nights Catering MORE INFO PRIVATE DINING Plan Your Next Event Make every party more memorable than the last with our private event spaces. Whether celebrating a corporate function, a family milestone, a holiday gathering, rehearsal dinner or graduation, our private dining rooms offer the perfect space to eat, drink and be merry. Let us do the work! Our team will work with you before, during and after, to ensure that every detail is done and that your event is unforgettable. MORE INFO MENU HAPPY HOUR LUNCH BRUNCH DINNER TIEMPO EXTRA KIDS HAPPY HOUR FOOD EVERYDAY 3PM-7PM *Hours may vary per location. Delray location weekdays from Open-6pm & From 8pm- Close Friday & Saturdays from Open - 6pm & from 9pm to close SHRIMP COCKTAIL 10 Cocktail sauce, lemon zest* PAPAS ARGENTINAS 9 Rustic potatoes, crispy egg, demi-glace* TEQUEÑOS 9 Fried pastry-wrapped queso blanco, herb aioli MILANESA SLIDERS 12 All-natural crispy chicken, French baguette, tomato, tartar sauce CHORIPAN 12 Argentinian sausage, French baguette, chimichurri, herb aioli CAMARONES AL AJILLO 12 Fresh shrimp, paprika butter, garlic oil HAND MADE EMPANADAS 5 Chicken or spinach & cheese Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. HAPPY HOUR DRINKS EVERYDAY 3PM-7PM *Classic cocktails pricing during happy hour + $3. RUM Enjoy in your favorite way, or as a Mojito, Daquiri, or Dark & Stormy* Siesta Key 11 Brugal1888 12 Diplomatico Mantuano 13 Santa Teresa 1796 14 GIN Place a custom order, or relax with a refreshing G&T, a French 75, or Tart Gimlet* New Amsterdam 11 Martin Miller’s 12 Beefeater 12 Hendricks 14 VODKA Made to your taste, or try a Lemon Drop, a Porn Star Martini, or a Mule* Stoli 12 Tito´s Handmade Vodka 12 Ketel One 13 Grey Goose 13 Stoli Elit 16 WHISKEY, BOURBON & RYE Benchmark, Bourbon 11 Jack Daniels, Tennessee Whiskey 13 Redemption, Rye 12 Maker’s Mark, Bourbon 14 Buffalo Trace, Bourbon 13 Bulleit, Rye 13 Crown Royal, Canadian Whiskey 13 Jameson, Irish Whiskey 14 SCOTCH As you like it, or crafted as a Rob Roy, Blood and Sand, or Simple Whiskey Highball.* Dewars White Label 13 Monkey Shoulder 14 Buchanan’s 12yr 16 Johnnie Walker Black 16 TEQUILA & MEZCAL Sip away, or enjoy as a Classic or Smokey Margarita, or Paloma* Camarena Reposado 12 Herradura Silver 13 400 Conejos Mezcal 15 Herradura Reposado 14 Rompe Corazon Mezcal 16 Casamigos Blanco 16 WINE BY THE GLASS Novecento Malbec 10 Trumpeter, Pinot Noir 12 Vint by Robert Mondavi, Cabernet Sauvignon 12 Balbo, Rose de Malbec 10 Flor del Inca, Chardonnay 10 13 Celsius, Sauvignon Blanc 13 BIRRAS Novecento Lager 7 Stella Artois 7 BUBBLES Novecento Brut 11 Cinzano Prosecco 12 CLASSICALY,RARE, NEVER MEDIUM, ALLWAYS WELL DONE LUNCH MENU PRIMER TIEMPO - Apeteizers COLD BURRATA 17 Fresh burrata, heirloom cherry tomatoes, pesto WAGYU CARPACCIO 22 Wagyu beef, grana Padano, smoked eggplant aioli, capers* SALMON CRUDO 18 Salmon, citrus vinaigrette, capers, avocado HOT SOUP OF THE DAY 9 ARGENTINIAN SPECIALTIES Chorizo 7\r\nMorcilla 7\r\nMolleja 8 HANDMADE EMPANADAS 13 Choice of two:\r\nSteak\r\nChicken\r\nSpinach & Cheese CAMARONES AL AJILLO 16 Sauteed shrimp, paprika butter, garlic oil PULPO A LA BRASA 21 Char-grilled octopus, smoked eggplant aioli PROVOLETA 18 Grilled thick-cut provolone cheese, tomatoes, oregano ENSALADAS - Salads NOVECENTO SALAD 28 USDA prime hanger steak, mixed greens, cherry tomatoes, avocado, crispy French fries, Dijon vinaigrette, demi-glace* SHRIMP WEDGE 22 Shrimp, iceberg lettuce, cherry tomatoes, red onion, bacon, blue cheese dressing GRILLED CHICKEN CAESAR 20 All-natural chicken breast, grilled romaine lettuce, croutons, Caesar dressing* SÁNGUCHES - Sandwiches Served with crispy fries or salad HAMBURGUESA CLÁSICA 18 Snake River Farms American wagyu, mozzarella, tomato, lettuce, herb aioli, brioche bun* HAMBURGUESA NOVECENTO 22 Snake River Farms American wagyu, mozzarella, ham, crispy bacon, tomato, lettuce, herb aioli, fried egg, brioche bun STEAK SANDWICH 24 USDA prime hanger, French baguette, chimichurri aioli, maldon salt MILANGA SANDWICH 16 All-natural crispy chicken breast, brioche bun, tomato, pickles, tartar sauce SEGUNDO TIEMPO - Entrees MAIN SALMON 29 Pistachio-crusted salmon, quinoa, heirloom cherry tomatoes, wilted spinach, pesto* BRANZINO 34 Pan-seared sea bass, roasted vegetables, lemon-caper sauce MILANGAS TENDERLOIN 24 ALL-NATURAL CHICKEN 22 Add to your milanga: A Caballo Fried egg 2\r\nSuiza Swiss cheese 2\r\nNapolitana Ham, mozzarella & tomato sauce 3 Our milangas are served with your choice of rice, salad, mashed potato, or French fries PASTAS POMODORO NOVECENTO 20 Spaghetti, tomato sauce, burrata cheese, basil GNOCCHI GRATINADO 23 Ricotta gnocchi, Parmesan sauce, au gratin\r\nAdd shrimp · 10 BOLOGNESE 24 Tagliatelle, house-made short rib ragu, shallot cream PESTO 22 Cavatelli, pistachio pesto, grana Padano PARMESANO 21 Spaghetti, Parmesan cream, all-natural chicken Substitute gluten-free pasta · 2 PARRILLA - Grill PICAÑA 27 Top sirloin* ENTRAÑA 34 Skirt steak* HANGER 32 USDA prime hanger steak * POLLO 25 All-natural half chicken deboned LOMO 39 Filet mignon * BIFE DE CHORIZO 38 38 NY strip * SAUCES 4 Peppercorn\r\nBearnaise\r\nCocoa Malbec reduction\r\nDemi-glace Our parilla options are served with your choice of rice, salad, mashed potato, or French fries PROVISIONES -Sides matter Jasmine rice Mashed potato Side salad French fries 5 Roasted potatoes Roasted vegetables Truffle fries provencal Charred asparagus 7 Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. CLASSICALY,RARE, NEVER MEDIUM, ALLWAYS WELL DONE BRUNCH MENU Saturday & Sunday 11am - 4pm DESAYUNO - Breakfast EGGS ANY STYLE 14 Farm-fresh whole eggs, bacon, roasted potatoes, farm-style bread* CHORIZO SCRAMBLE 16 Argentinian chorizo, fresh scrambled eggs, tomatoes, sliced avocado, farm-style bread* STEAK & EGGS 22 Filet mignon bites, shallot cream, fresh scrambled eggs, tomatoes, farm-style bread* AVOCADO TOAST 16 Avocado mash, poached eggs, farm-style bread* NOVECENTO BENEDICT 24 Poached eggs, hollandaise, English muffin, USDA Prime hanger, roasted potatoes* SALMON BENEDICT 19 Poached eggs, hollandaise, English muffin, smoked Scottish salmon, roasted potatoes* BACON PANCAKES 17 Buttermilk pancakes, bacon-infused maple syrup, candied bacon FRENCH TOAST ARGENTINO 18 Brioche bread, condensed milk, dulce de leche sauce, whipped cream* NY STRIP & EGGS 42 Argentinian NY strip, fried eggs, roasted potatoes, chimichurri* PRIMER TIEMPO - Apeteizers COLD BURRATA 17 Fresh burrata, heirloom cherry tomatoes, pesto WAGYU CARPACCIO 22 Wagyu beef, grana Padano, smoked eggplant aioli, capers* SALMON CRUDO 18 Salmon, citrus vinaigrette, capers, avocado HOT SOUP OF THE DAY 9 ARGENTINIAN SPECIALTIES Chorizo 7\r\nMorcilla 7\r\nMolleja 8 HANDMADE EMPANADAS 13 Choice of two:\r\nSteak\r\nChicken\r\nSpinach & Cheese CAMARONES AL AJILLO 16 Sauteed shrimp, paprika butter, garlic oil PULPO A LA BRASA 21 Char-grilled octopus, smoked eggplant aioli PROVOLETA 18 Grilled thick-cut provolone cheese, tomatoes, oregano ENSALADAS - Salads NOVECENTO SALAD 28 USDA prime hanger steak, mixed greens, cherry tomatoes, avocado, crispy French fries, Dijon vinaigrette, demi-glace* SHRIMP WEDGE 22 Shrimp, iceberg lettuce, cherry tomatoes, red onion, bacon, blue cheese dressing GRILLED CHICKEN CAESAR 20 All-natural chicken breast, grilled romaine lettuce, croutons, Caesar dressing* SÁNGUCHES - Sandwiches Served with crispy fries or salad HAMBURGUESA CLÁSICA 18 Snake River Farms American wagyu, mozzarella, tomato, lettuce, herb aioli, brioche bun* HAMBURGUESA NOVECENTO 22 Snake River Farms American wagyu, mozzarella, ham, crispy bacon, tomato, lettuce, herb aioli, fried egg, brioche bun STEAK SANDWICH 24 USDA prime hanger, French baguette, chimichurri aioli, maldon salt MILANGA SANDWICH 16 All-natural crispy chicken breast, brioche bun, tomato, pickles, tartar sauce SEGUNDO TIEMPO - Entrees MAIN SALMON 29 Pistachio-crusted salmon, quinoa, heirloom cherry tomatoes, wilted spinach, pesto* BRANZINO 34 Pan-seared sea bass, roasted vegetables, lemon-caper sauce MILANGAS TENDERLOIN 24 ALL-NATURAL CHICKEN 22 Add to your milanga: A Caballo Fried egg 2\r\nSuiza Swiss cheese 2\r\nNapolitana Ham, mozzarella & tomato sauce 3 Our milangas are served with your choice of rice, salad, mashed potato, or French fries PASTAS POMODORO NOVECENTO 20 Spaghetti, tomato sauce, burrata cheese, basil GNOCCHI GRATINADO 23 Ricotta gnocchi, Parmesan sauce, au gratin\r\nAdd shrimp · 10 BOLOGNESE 24 Tagliatelle, house-made short rib ragu, shallot cream PESTO 22 Cavatelli, pistachio pesto, grana Padano PARMESANO 21 Spaghetti, Parmesan cream, all-natural chicken Substitute gluten-free pasta · 2 PARRILLA - Grill PICAÑA 27 Top sirloin* ENTRAÑA 34 Skirt steak* HANGER 32 USDA prime hanger steak * POLLO 25 All-natural half chicken deboned LOMO 39 Filet mignon * BIFE DE CHORIZO 38 38 NY strip * SAUCES 4 Peppercorn\r\nBearnaise\r\nCocoa Malbec reduction\r\nDemi-glace Our parilla options are served with your choice of rice, salad, mashed potato, or French fries PROVISIONES -Sides matter Jasmine rice Mashed potato Side salad French fries 5 Roasted potatoes Roasted vegetables Truffle fries provencal Charred asparagus 7 Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. CLASSICALY,RARE, NEVER MEDIUM, ALLWAYS WELL DONE DINNER MENU PRIMER TIEMPO - Apeteizers STARTERS SOUP OF THE DAY 9 ARGENTINIAN SPECIALTIES Chorizo 7\r\nMorcilla 7\r\nMolleja 8 HANDMADE EMPANADAS 13 Choice of two:\r\nSteak\r\nChicken\r\nSpinach & Cheese CAMARONES AL AJILLO 16 Sauteed shrimp, paprika butter, garlic oil BURRATA 17 Fresh burrata, heirloom cherry tomatoes, pesto PULPO A LA BRASA 21 Char-grilled octopus, smoked eggplant aioli PROVOLETA 18 Grilled thick-cut provolone cheese, tomatoes, oregano RAW BAR SHRIMP COCKTAIL 22 Cocktail sauce, lemon zest* SALMON CRUDO 18 Salmon, citrus vinaigrette, capers, avocado WAGYU CARPACCIO 22 Wagyu beef, grana Padano, smoked eggplant aioli, capers* TUNA AGUACHILE 19 Yellowfin tuna, charred serrano, & cucumber sauce* ENSALADAS - Salads NOVECENTO SALAD 28 USDA prime hanger steak, mixed greens, cherry tomatoes, avocado, crispy French fries, Dijon vinaigrette, demi-glace* WEDGE 14 Iceberg lettuce, cherry tomatoes, red onion, bacon, blue cheese dressing GRILLED CAESAR 16 Grilled romaine lettuce, croutons, Caesar dressing* SÁNGUCHES - Sandwiches Served with crispy fries or salad HAMBURGUESA NOVECENTO 22 Snake River Farms American wagyu, mozzarella, ham, crispy bacon, tomato, lettuce, herb aioli, fried egg, brioche bun STEAK SANDWICH 24 USDA prime hanger, French baguette, chimichurri aioli, maldon salt SEGUNDO TIEMPO - Entrees MAINS RISOTTO DE CARNE 28 Filet mignon, demi glace, arborio rice, grana Padano* SALMON 29 Pistachio-crusted salmon, quinoa, heirloom cherry tomatoes, wilted spinach, pesto* BRANZINO 34 Pan-seared sea bass, roasted vegetables, lemon-caper sauce MILANGAS - Crispy Milanese TENDERLOIN 24 ALL-NATURAL CHICKEN 22 Add to your milanga: A Caballo Fried egg 2\r\nSuiza Swiss cheese 2\r\nNapolitana Ham, mozzarella & tomato sauce 3 Our milangas are served with your choice of rice, salad, mashed potato, or French fries PASTAS - Homemade GNOCCHI GRATINADO 23 Ricotta gnocchi, Parmesan sauce, au gratin\r\nAdd shrimp · 10 BOLOGNESE 24 Tagliatelle, house-made short rib ragu, shallot cream PESTO 22 Cavatelli, pistachio pesto, grana Padano Substitute gluten-free pasta · 2 PARRILLA - Grill HANGER 32 USDA prime hanger steak * ENTRAÑA 34 Skirt steak* WAYGU DENVER 54 SRF wagyu denver steak* POLLO 24 All-natural half chicken deboned Direct from Argentina OJO DE BIFE 48 Ribeye * BIFE DE CHORIZO 38 38 NY strip * LOMO 39 Filet mignon * Para compartir - To share PARRILLADA 79 (1-3 people)\r\nUSDA Prime hanger, picaña, chicken, chorizo, mollejas, served with four house sides* SAUCES 4 Peppercorn\r\nBearnaise\r\nCocoa Malbec reduction\r\nDemi-glace Our parilla options are served with your choice of rice, salad, mashed potato, or French fries PROVISIONES -Sides matter Jasmine rice Mashed potato Side salad French fries 5 Roasted potatoes Roasted vegetables Truffle fries provencal Charred asparagus 7 Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. TIEMPO EXTRA DESSERT PANQUEQUES NOVECENTO 12 Handmade caramelized dulce de leche crepes, vanilla ice cream CREME BRULEE DE DULCE DE LECHE 12 Dulce de leche custard TODO CHOCOLATE 12 Warm chocolate truffle cake, whipped cream, chocolate ice cream TIRAMISU 13 Mascarpone mousse, cacao, lady fingers, espresso FLAN 11 Creme-caramel, whipped cream, dulce de leche DESSERT COCKTAILS CARAJILLO 14 Creamy, layered, perfect finish\r\nLicor 43, Oreo, fresh-brewed espresso ESPRESSO MARTINI 15 Classic, foamy, delightful\r\nKetel One Vodka, Kahlua, fresh-brewed espresso Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. PARA LOS PIBES - Kid`s Menu - STEAK - 14 Top sirloin choice of: french fries, rice, or mashed potato MILANGA - 13 All-natural chicken milanese choice of: French fries, rice, or mashed potatoes SALMON - 13 Fresh salmon choice of: french fries, rice, or mashed potato PASTA - 11 Choice of Pasta Spaghetti, Gnocchi, Cavatelli Choice of Sauce Parmesan, Pesto, Tomato, Pink DESSERT COPA DE HELADO - 4 Ask your server PANQUEQUE NOVECENTO - 7 Handmade caramelized dulce de leche crepe, vanilla ice cream Kids menu available for children under 12. Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination.s-contamination. Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    },
    {
      "url": "https://novecento.com/locations/key-biscayne/",
      "text": "Key Biscayne – Novecento Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne RESERVE NOW KEY BISCAYNE OVERVIEW ABOUT US DAILY SPECIALS CATERING MENU NOW OPEN! ONLY A FEW STEPS AWAY 260 CRANDON BLVD UNIT 30. Deep in the heart of the island, Novecento is the neighborhood hot spot. (305) 362-0900 (305) 365-4703 Hours Lunch and Dinner: Sunday – Thursday: 12 pm – 11 pm Friday – Saturday: 12 pm – 12 am Happy Hour: Monday – Friday: 3pm – 7pm Tuesday:  50% off Bottles of Wine Thursday: Happy Hour All Night 260 Crandon Blvd, Key Biscayne, FL 33149 Cross Street Sunrise Drive Parking Details Self parking – parking lot Entertainment Coming soon Catering MORE INFO ABOUT US Novecento in Key Biscayne Novecento is a luxurious restaurant, located in the heart of one of the trendiest gastronomic areas of Key Biscayne, Miami. The restaurant group has more than 25 years of experience and landmark locations in Miami, México DF, Buenos Aires and Córdoba (Argentina) and Punta del Este (Uruguay). Chosen by thousands of celebrities and tourists from all over the world, Novecento is a must on the trip of any sybarite who enjoys a unique culinary experience: distinguished dishes with an Argentine print, seasonal and excellent quality products, and a team that gives life to this meeting place. Here you will find a fascinating combination of glamour and the warm welcome of the caribbean sun, with the joy and generosity that in Argentina people receive their guests at home. In a few words, the perfect combination to enjoy a very Novecento moment. CATERING FROM OUR CUISINE To your party. Whether celebrating a corporate function, a family milestone, a holiday gathering, rehearsal dinner or graduation, our team will work with you before, during and after, to ensure that every detail is done and that your event is unforgettable. Restaurant Events We offer an excellent Novecento-style experience, with a 3-course menu of your choice, an exclusive wine proposal and table service. If your idea is to celebrate in a more cool and relaxed atmosphere, 900 is the perfect place to dance while having a drink at the bar and grab a bite. MORE INFO Outside Catering If you were thinking about organizing something at home or in a hall, you can’t miss our CATERING proposals: our premium barbecue, with our Argentinean imprint, is all you need to become the best host. High quality meat and cuts, ready to be served at your table. We also have the best brunch service: if you don’t consider yourself a brunch fan, it’s because you haven’t tried our delicious homemade croissants with ham and cheese, accompanied by succulent sandwiches, cheese tables and, of course, mimosas. MORE INFO Please fill out the form Your name Your email Your phone number Date Number of people Your message (optional) MENU MAIN MENU BAR Y BODEGA CLASSICALLY RARE, NEVER MEDIUM, ALWAYS WELL DONE PRIMER TIEMPO - Starter CEVICHE CON TOSTONES - 18 Fish marinated in lime juice, avocado, jalapeño peppers, green plantains* CROQUETAS DE QUESO MANCHEGO Y JAMON SERRANO - 18 House made croquettes with creamy Manchego & Serrano ham, fig jam BURRATA ARTESANAL - 19 Artisanal burrata, Italian mortadella, pomegranate, pistachio, black olive powder PROVOLETA - 16 Caramelized balsamic onion, fresh oregano MATRIMONIO - 14 Duo of Argentine chorizo and blood sausage with chimichurri and criolla sauce MOLLEJAS DE TERNERA - 24 Pan-seared veal sweetbreads, crispy potatoes, pickled onion, criolla sauce CARPACCIO DE RIB EYE - 21 Vinaigrette with soy sauce, curry cream, avocado, toasted peanuts, micro arugula, cilantro, cherry tomato, cucumber, sliced carrot TUNA TARTARE - 22 Fresh tuna dice, avocado, citrus soy sauce, crispy shallots COLIFLOR AL HORNO, HUMUS DE REMOLACHA - 22 Oven-roasted Cauliflower, beet hummus, pine nuts, cilantro ENSALADAS - Salads ENSALADA NOVECENTO - 29 Grilled steak”, French fries, baby mixed greens, cherry tomatoes, avocado, Dijon vinaigrette Win chicken .24 ENSALADA DE LA CASA - 12 Organic mix green, arugula, avocado, tomato, radish, shaved Parmesan ENSALADA DE PULPO - 28 Grilled octopus, roasted red pepper, chimichurri, black olive cream, confit potatoes BOSTON CAESAR SALAD - 15 Boston lettuce, shaved Parmesan, croutons, homemade Caesar dressing EMPANADAS Homemade Hand-cut beef, Chicken, Spinach & cheese or Ham & cheese order o two - 12 order of four - 23 SÁNGUCHES - Sandwiches Served with crispy fries or salad HAMBURGUESA NOVECENTO - 21 Grilled hamburger, Mozzarella, ham, bacon, butter lettuce, tomato, fried egg, green olive-mayonnaise, brioche bun SANWICH DE MILANESA NOVECENTO - 19 Breaded beef of chicken, lettuce, tomato, ham and cheese CHORIPAN - 18 French baguette, Grilled argentinian chorizo, Salsa criolla, lettuce & tomato. All sandwiches are served with French fries MILANGA NOVECENTO Argentinian Classic Breaded & Thin Sliced with Your Choice of French Fries. Mixed salad or Mashed Potatoes Your choice of: BEEF - 28 CHICHEN - 25 A Caballo (fried egg) - 3 Suiza (swiss cheese) - 3 Napolitana (Han, mozzarella & tomato sauce) -4 PARRILLA - Grill POLLO AL GRILL - 25 Hall-natural Half boneless chicken ENTRAÑA - 36 9 oz. grilled skirt steak (*) with your choice of one side COSTILLAS DE CORDERO - 46 New Zealand rack of lamb, Confit potatoes, mint yogurt sauce PICADA CRIOLLA - 34 Tasting platter of grilled steak (*), chicken, chorizo, beef and chicken empanadas with chimichurri sauce LOMO - 39 8 oz. grilled beef tenderloin (*), Malbec demi-glace, with your choice of one side OJO DE BIFE - 42 16 oz. grilled rib eye steak (*) with your choice of one side PROVISIONES - Sides matter . Jasmine rice . French fries  - 8 . Mix Greens . Mashed potato . Sweet potato purée . Portobello mushrooms with goat cheese . Truffle potatoes . Grilled Asparagus - 10 SEGUNDO TIEMPO - Mains BRANZINO - 36 Mediterranean sea bass, oven-roasted cauliflower, beet hummus, pine nuts, cilantro SALMÓN ROSADO - 32 Fresh salmon, confit tomato tartare, and green bean salad PASTA FRESCA CASERA Ask for gluten free pasta TALLARIN CON RAGU DE LOMO - 32 Homemade tallarin, filet mignon stew in pomodoro sauce RAVIOLES NOVECENTO - 22 Ham and cheese stuffed pasta, creamy pink & basil sauce GNOCCHI GRATINADO - 24 Fresh ricotta gnocchi, four cheese cream sauce, au gratin. CANELONES ARGENTINOS - 23 Argentinian cannelloni stiffed with fresh spinach, ricotta cheese, chicken breast, tomato sauce and gratin cheese PASTA SECA SPAGHETTI CON BURRATA - 22 Dry spaghetti, plum tomato sauce, fresh local burrata, diced tomatoes, basil oil PENNE PESTO GLUTEN FREE - 21 Gluten-free penne, arugula pesto cream, toasted pine nuts Any pasto with shrimp odd 8 or win chicken 4oz. add 6 20% gratuity Will be added to parties of 6 or more (*) Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food bome illness, especially if you suffer from medical conditions. Please notify us any food allergies (**) Caesar dressing contains raw eggs. TIEMPO EXTRA - Dessert VOLCAN DE DULCE DE LECHE - 12 Warm dulce de leche truffle, whipped cream. Choice of Dulce de leche or Banana Split ice cream. PANQUEQUES CON DULCE DE LECHE - 10 Warm crepes, dulce de leche, whipped cream. CREME BRULEE- 9 Chilled custard with a caramelized sugar top. Ask for chef’s daily special. Add extra Scoop· 3.50 TODO CHOCOLATE - 12 Warm chocolate truffle, Belgium chocolate ganache. Chocolate ice cream. PANQUEQUES CON DULCE DE LECHE Y HELADO - 13 Warm crepes, dulce de leche, vanilla ice cream, whipped cream. SINFONÍA NOVECENTO - 25 Tasting dessert. Panqueque with vanilla ice cream, Todo Chocolate with chocolate ice cream, Flan mixto. FLAN MIXTO - 8 Crème caramel, dulce de leche, whipped cream. COPA DE HELADO - 9 Your choice of two flavors Dark chocolate, vanilla, strawberry, lemon, dulce de leche, banana split. Add extra Scoop· 3.50 BODEGA & BAR Taste 0.5z Sample 3oz Glass 60z Bottle LO MEJOR DEL MUNDO (for us) - wines from Argentina MALBEC Altos Las Hormigas 38 Novecento by Dante Robino 11 42 Catena Vista Flores 47 Rutini Encuentro 13 49 Terrazas Reserva 50 Zuccardi Q 56 Obra Prima, Gran Reserva Familia Cassone 79 Altos Las Hormigas, Reserva Mendoza 84 CARO, bu Catena & Barons de Rothschild 139 Yacochuya, by Michelle Rolland 172 RED BLENDS Clos de los Siete by Michel Rolland 49 Cocodrilo, Vina Cabos by Paul Hobbs 79 Lote Negro Norton, Malbec, Cab Franc 108 Rutini Encuentro Barrel Blend, Malbec. Cab Sauv 147 RED VARIETALS Novecento, Cabernet Sauvignon 11 38 Trumpefer, Merloy by Rutini Mendoza 12 44 Skyside Pinot Noir, California 48 Kaiken Ultra, Gabernet Sauvignon 57 El Enemigo, Bonarda 69 Catena Alta, Cabernet Sauvignon 124 WHITES & ROSE Santa Marina, Pinot Grigio 10 32 Tilia, Torrontes Cafayate, Salta 34 Balbo, Sauvignon Blanc, Mendoza 10 36 Blabo, Malbec Rose 10 36 Cantos No Luar, Albarino Rias Baixas 10 39 Ca' Montini. Pinot Grigio, Trentino, Italy 38 Terrazas Reserva, Chardonnay 42 Rose, Minuty, Cotes de Provence 48 Jacquest Dumont, Sauvignon Blan, France 52 Argyle Nuthouse, Chardonnay, Oregon, USA 85 EL RESTO - Wines from around the world CHAMPAGNE AND SPARKLING Novecento, Dante Robino, Mendoza, Argentina 10 32 Voga Prosecco, Doc, Italy 39 Chandon Brut Classic, California. USA 54 Pommery, Brut Royal,France 98 Veuve Clicquot Bruf, Champagne, France 138 Dom Perignon, France 356 REDS FROM THE WORLD Skyside Pinot Noir, California 14 48 LAN, Rioja Crianza, Tempranillo & Mazuelo, Spain 49 Tayu, Pinot Nolr, Chlle 55 Tenuta DiMontl, Chianti Tuscany, Italy 58 Tenshen, Cabernef Sauvlgnon. California 62 Deheza De Los Canonigos, Reserca solideo, Spain 88 DeMaria Barolo, Piedmont, Italy 99 HOUSE SPIRITS Spirits 14 Dewaes White Bullett 95 Rye Captain Morgan White Rum Ketel One Vodka Gordon's Gin Astral Blanco Tequila Union Mezcal Cachaca Leblon Fernet Branca Aperol BEER DRAFT Peroni Stella Artois 16oz  7.5 Mahou Modelo BOTTLE 6 Quilmes Bud Light Guiness IPA Lagunitas Amstel Ligth Corona Heineken COCKTAILS POMEGRANATE GIN & TONIC .16 Gordon's gin, pomegranate, thyme, fever tree tonic PASSION FRUIT PISCO SOUER .16 Lemon, egg white, pisco, passion fruit juice, bitters GUAVA MARGARITA .16 Astral Blanco Tequila, lime, agave, guava juice PASSION FRUIT MARGARITA Astral Blanco Tequila, lime, blue agave, Passion fruit juice MEXICAN OLD FASHIONED - 16 Union Mezcal, Simple Syrup, Bitters PALOMA - 16 Astral Blanco Tequila, lemon juice, pink grapefruit juice CHOCOLATE MARTINI - 16 Ketel One Vodka, Chocolate Baileys ESPRESSO MARTINI - 16 Mate infused vodka, Mr Black coffee liquor, espresso shot COCONUT MOJITO - 16 Captain Morgan Coconut rum, fresh mint, lime juice MATE MULE - 16 Mate infused vodka, lime, ginder beer, rosemary BOURBON SPRITZ - 16 Bullet 95 Rye Whiskey, Aperol Sparkling wine ST GERMAIN SPRITZ - 16 St. Germain, Splash club Soda, Sparkling wine, mint HAPPY HOUR |MON FRI FROM 3 TO 7PM| THURDAYS ALL NIGHT Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    },
    {
      "url": "https://novecento.com/privacy-policy/",
      "text": "Privacy Policy – Novecento Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne NOVECENTO PRIVACY POLICY LAST UPDATED: June 19, 2024 This Privacy Policy describes how SuViche Hospitality Group, LLC. and its subsidiaries and affiliates in North America (“Novecento”, “SuViche”, “we”, “our”, “us”) may collect, use, and disclose personal information of visitors who access or interact with our mobile application (“App”) or our websites that link to this Privacy Policy, as well as other personal information about our customers. The App, those websites, our restaurants, and our related service offerings are referred to in this Privacy Policy as our “Services.” By using our Services or otherwise providing personal information to us, you consent to the collection, use, disclosure and other handling of personal information as described in this Privacy Policy. COLLECTION OF INFORMATION INFORMATION YOU PROVIDE When you visit or interact with the Services, Novecento may obtain certain personal information from you, such as: Names, addresses, contact numbers, and email addresses; Date of birth and gender; Records of your orders and other transactions with us; Credit/debit card number(s) and account information, including associated billing address(es) and expiration date(s); Information provided via surveys, focus groups, and/or other marketing research efforts; Employer and/or other company affiliations (e.g., employer names, titles, work addresses, and other contact information); Job application information (e.g., resume, employment and educational history, references); Precise location; Other information described in the Information Collected Automatically section below (some of which is personal information). We may also create inferences from this information or from other personal information we hold. If you submit someone else’s personal information to us (e.g., someone else’s contact information), you represent that you are authorized to provide this information to us. INFORMATION COLLECTED AUTOMATICALLY We may collect certain information about you automatically when you visit or use our online Services. This information may include your IP address, device identifier, browser characteristics, operating system details, language preference, referring URLs, length of visits, and pages viewed. We automatically collect this information using various tools and technologies such as cookies and web server logs. A cookie is a piece of data that a website can send to your browser, which may then be stored on your computer, sometimes with a tag that identifies your computer. Many web browsers are set to accept cookies by default, but you may be able to set your browser to notify you before you receive a cookie, or to remove or reject cookies. Please note that disabling cookies may affect the availability and functionality of our online Services and other websites. To find out more about how third-party analytics services manage the privacy of information in conjunction with delivering ads online, and how to opt-out of information collection or certain uses by these networks generally, including some companies mentioned above, please visit: http://www.youradchoices.com , http://www.networkadvertising.org , or https://www.networkadvertising.org/mobile-choice . Please note that we are not responsible for the opt out process of third parties. Depending on your personal device and App permission settings, when using the App, we may collect or have access to your: Precise geolocation. When enabled, this may allow the App to collect real-time information about the location of your device (GPS and network-based) to provide requested location services, ensure your orders are placed at the correct location, and to serve you relevant offers or promotions. Camera. When enabled, this may allow the App to access the camera to scan and input payment method details. Wi-Fi connection information. When enabled, this may allow the App to view Wi-Fi connections. Other. The App will send and receive data to and from the Internet, and may view network connections, have full network access, control vibration of your device, or prevent your device from sleeping. You may be able to enable or disable location tracking by the App by adjusting the permissions in your account or device settings. Be aware that if GPS precise location services are disabled, other means of establishing or estimating location (e.g., connecting to or proximity to Wi-Fi, Bluetooth, beacons, or our networks) may persist. Enabling location tracking may allow the App to track your location in the background, which can decrease battery life. We will store personal information we obtain for no longer than is necessary to achieve the purposes for which the information was collected, or as otherwise required or permitted under applicable law. Information Collected From Third Parties Third-party service providers may share with us your personal information that you submit to them. For example, if you apply for a job using the career portal, order food or catering, order gift cards, make a purchase for merchandise, make a payment through the Services, or provide feedback on your experiences, you may submit personal information to one or more third parties that may share your information with us. Additionally, for certain features of the online Services, you may log in through your third-party social media account or share content from the online Services through third-party social media platforms. We may combine information that we have about you with information we obtain from third parties. When you submit information to a third party, you are subject to that third party’s terms of use and privacy policies, for which we are not responsible. USE OF INFORMATION We may use personal information we obtain about you to: facilitate and personalize your user experience and improve the Services; conduct statistical analysis of the content, layout, and features of the Services for our marketing purposes; communicate with you regarding our restaurants and other Services; respond to your requests or inquiries; register you for accounts on the Services; register you for our email and postal mailing lists or for promotions or offers conducted in connection with the Services; process payment information for online food orders or online purchases through our merchandise or gift card store; respond to job inquiries and job applications submitted by you; process your fundraiser applications; send marketing information to you, such as promotional offers or information about new product offerings, programs, or restaurant openings; provide location services; prevent, investigate, identify, stop, or take any other action with regard to suspected or actual fraudulent or illegal activity, or any activity that violates our policies; or for any other purpose, with your consent where appropriate. SHARING OF INFORMATION We may share your personal information with our third-party service providers for a variety of reasons, such as fulfilling orders, assisting with promotions, performing website analytics, delivering relevant marketing messages and advertisements, providing technical services, and otherwise carrying out any of the uses and disclosures described in this Privacy Policy. We generally require our service providers to provide at least the same or equal protection of user data as stated in this Privacy Policy. Some of the third-party service providers (for example, those mentioned in the “ Information Collected Automatically ” section above) may view, edit, or set their own tracking technologies/cookies. We may also publicly post on our online Services certain user-generated content you submit to us. In the event of a business transaction, such as if we sell or transfer all or a portion of our business or assets (e.g., further to a merger, reorganization, liquidation, or any other business transaction, including negotiations of such transactions), we reserve the right to disclose any information we obtain through the Services. You acknowledge that such transfers may occur and are permitted by this Privacy Policy.  To the extent legally permitted, the acquiring party may use the information pursuant to their own privacy policy instead of this one. We may also disclose personal information when required by subpoena, search warrant, or other legal processes, or in response to activities that are unlawful or a violation of Novecento’s rules for use of the Services, or to protect and defend the rights or property of Novecento or others. CHILDREN’S PRIVACY The online Services are not intended for, and are not intentionally targeted to, children under 13, and we do not knowingly request or collect personal information from any person under 13 years of age through the Services. If we learn that the online Services have received personal information directly from a child who is under the age of 13, we will delete the information in accordance with applicable law. MODIFICATION OR DELETING PERSONAL INFORMATION If for any reason you wish to modify or delete your Personal Information you can send us an email to: info@novecento.com and we will make reasonable efforts to modify or delete any such Personal Information pursuant to any applicable privacy laws. If you no longer wish to provide us information through the App, you may uninstall the App from your device. We use cookies to provide you a customized experience both within our website and through our various advertising materials. If you would like to delete cookies or change the settings on your web browser to delete or refuse cookies, please visit the Help pages of your web browser: Google Chrome: https://support.google.com/chrome/answer/95647 Mozilla Firefox: https://support.mozilla.org/en-US/kb/enable-and-disable-cookies-website-preferences Internet Explorer: https://support.microsoft.com/en-us/help/17442/windows-internet-explorer-delete-manage-cookies Safari: https://support.apple.com/en-ph/guide/safari/manage-cookies-and-website-data-sfri11471/mac Please keep in mind that if you delete cookies or refuse to accept them, you might not be able to use all of the features on our website, you may not be able to store your preferences, and some of our pages may not display properly. SECURITY We use various security measures as part of an effort to protect your personal information from loss, theft, misuse, unauthorized access, disclosure, alteration, and destruction. Nevertheless, transmission and storage are not completely secure (whether online or offline) and we cannot guarantee the security of your information. INTERNATIONAL DATA TRANSFER Your personal information may be stored and processed in any country where we, our service providers, or any of the other recipients described in the “Sharing of Information” section above have facilities. By using our Services or otherwise providing personal information to us, you consent to the transfer of your personal information to all of those locations, including those outside your country of residence, where privacy rules are different.  Personal information is typically subject to the laws of the country in which it is held, and sometimes also the laws of other countries that have a connection to its processing, such as the source country.  For this reason, your personal information may be subject to disclosure to the governments, courts or law enforcement or regulatory agencies of any of the countries described above, pursuant to the laws of such countries.  However, this Privacy Policy will continue to apply to personal information collected under this Privacy Policy when it is held by any member of the Novecento corporate family or by any third-party processor that has been engaged by any Novecento entity, regardless of location. LINKS TO OTHER WEBSITES AND SERVICES The Services may offer links to websites and other services that are not maintained by Novecento. By visiting one of these linked websites or services, you are subject to their privacy and other policies. We are not responsible for, or able to monitor or control, the policies and practices of other companies. CHANGES TO NOVECENTO’S PRIVACY POLICY From time to time, Novecento may change this Privacy Policy. Changes will be indicated by the “Last Updated” date at the top of this page. CONTACT US For questions or complaints about this Privacy Policy or our handling of personal information, you may contact our Privacy Team at info@novecento.com or via postal mail at: Attn: Privacy Officer SuViche Hospitality Group, LLC 2175 NW 24 th Av Miami, FL 33142 Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "text": "Contact Us - Spruko Technologies | Get in Touch with Us Today sales@team.spruko.com +91 888-613-3855 | +91 888-613-3955 Home IT Services Business Consulting Company About Us Careers Why Choose Us? Events Technology Web Technologies PHP Laravel Codeigniter Combined Shape Cake PHP Node.js Frontend Technologies React JS Angular JS Next JS JavaScript Typescript Vue JS Nuxt JS Svelte Backend Technologies Node.js PHP ASP.NET Microsoft Technologies ASP.NET Core & MVC Blazor Frameworks Bootstrap Tailwind Django Laravel Flask Symfony Ready to take your business to the next level? Contact us today and let's build the future together. Contact Us Products Web Applications Innovative software solutions to boost productivity and streamline your operations. Dashboard Templates Customizable templates for quick, professional designs and creative projects. Explore our successful projects Showcasing our successful projects and client solutions. View Portfolio Introducing LivaChat LivaChat, our latest live chat solution for seamless communication. View Details Hosting Shared Hosting Linux Shared Hosting WordPress Hosting Windows Shared Hosting Hosting Servers Linux KVM VPS Dedicated Servers Windows Dedicated Servers Reseller Hosting Linux Reseller Hosting Windows Reseller Hosting Cloud Hosting Cloud Hosting Security SSL Certificates SiteLock Malware Detector Domain Register a Domain Hosting Starter Combo Choose your bundle & be on your way View Combo Offers Email & Productivity : Business Email Google Workspace Enterprise Email Titan Business Email Grow your business with our private-labeled services Join Reseller Program Services Development Web Development Custom Software Development SaaS Product Development API Development and Integration Custom CRM Development Custom E-commerce Development Educational Technology (EdTech) Development Healthcare Software Development AI Integration Services Chatbot Services Whatâs App Business API Services Digital Marketing Social Media marketing Content Marketing on Social platforms Meta Ads/ Paid Marketing Search Engine optimization Generative content optimization Google Analytics Search and Display Ads Performance Marketing Remarketing & Retargeting Ads Branding Brand Nomenclature Logo design and Brand story Brand Guidelines Collateral designs and Branding Brand Identity designs Iconography and Visual identity Other Services Technology Consulting UI/UX Design UI/UX Consulting Technical Support Installation Services Hosting Services Domain Registration Contact Us Request Quote Contact Us Get in Touch Seeking innovative solutions, exciting opportunities, or a trusted digital partner? You've found the right place. Reach out to us, and our dedicated team will address all your inquiries. To kickstart the conversation, simply share your details with us, and weâll respond promptly to help you explore. Pre-Sales Expert advice before you buy sales@team.spruko.com Support Mon-Fri from 10am to 5pm. https://support.spruko.com Careers Mon-Fri from 10am to 5pm. hr@team.spruko.com Legal Business protection and compliance. legaldept@team.spruko.com Sales Contact Quick help, just a call away. +91 888â613â3855 , +91 888â613â3955 Contact Lets get in touch You can reach us anytime via https://support.spruko.com First Name Last Name Email Phone Number Country Message You agree to our terms and conditions. Get Started 7+ Years Field Experience 200+ Projects Done Around World 24/7 Customer support +20K Happy customers 1 Day Response Time Visit our office SPRUKO TECHNOLOGIES PRIVATE LIMITED\n                                Hyderabad Corporate Office : H.NO.1, LIG 215, 8-67/83, near Tulasi Hospitals Ecil, APIIC Colony, Kushaiguda,Telangana, Hyderabad â 500062. India. Support: Email: support@team.spruko.com Mobile : +91 888-613-3855 Mobile : +91 888-613-3955 Phone: 040 2712 2233 Pre Sales: Email: sales@team.spruko.com Mobile : +91 888-613-3855 Mobile : +91 888-613-3955 Phone: 040 2712 2233 We offer the expertise and strategic guidance to drive your business forward and achieve sustained growth. Get Started Embark on your next big success Our Team is ready to provide tailored strategies to accelerate your business growth. Get an appointment now 1 Day Response Time 100% Client Satisfaction 7+ Years Field Experience Services Development Digital Marketing Branding Hosting Company About Us Why Choose Us? Careers Events Products Uhelp LivaChat Primo Slider SPK Editor Legal Licenses License Faq's Terms & Conditions Privacy Policy Phone +91 888-613-3855 +91 888-613-3955 Mail support@team.spruko.com sales@team.spruko.com © 2024 All rights reserved by Spruko Technologies Private Limited"
    },
    {
      "url": "https://novecento.com/locations/doral/",
      "text": "Doral – Novecento Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne RESERVE NOW DORAL OVERVIEW DAILY SPECIALS PRIVATE DINING A brand-new beautiful venue awash in rustic charm, Novecento at CityPlace Doral features copper accents and natural wood finishes. An open wine cellar located on the second floor while the interior space offers diners old-world charm in an airy and bustling space. The restaurant features ample indoor and outdoor seating. TAKE TOUR (786) 871-4935 Hours Lunch and Dinner: Monday – Thursday: 11am – 11pm Friday: 11am – 12am Saturday: 11am- 12am Sunday: 11am – 10pm Weekend Brunch: Saturday-Sunday: 11am-4pm Happy Hour: Monday – Sunday: 3pm – 7pm CityPlace Doral, 3450 NW 83 Avenue, Suite 137 Cross Street NW 36th Street Parking Details Free Parking at CityPlace Doral. Enjoy free parking for the first 2 hours all day Monday–Thursday and Friday before 6PM. Staying longer or visiting on the weekend? Paid parking starts at $7. Entertainment Tango shows on select nights Catering MORE INFO PRIVATE DINING Plan Your Next Event Make every party more memorable than the last with our private event spaces. Whether celebrating a corporate function, a family milestone, a holiday gathering, rehearsal dinner or graduation, our private dining rooms offer the perfect space to eat, drink and be merry. Let us do the work! Our team will work with you before, during and after, to ensure that every detail is done and that your event is unforgettable. MORE INFO MENU HAPPY HOUR MAIN MENU BAR Y BODEGA BRUNCH KIDS TIEMPO EXTRA MEDIO TIEMPO HAPPY HOUR DRINKS EVERYDAY 3PM-7PM *Classic cocktails pricing during happy hour + $3. RUM Enjoy in your favorite way, or as a Mojito, Daquiri, or Dark & Stormy* Siesta Key 11 Brugal1888 12 Diplomatico Mantuano 13 Santa Teresa 1796 14 GIN Place a custom order, or relax with a refreshing G&T, a French 75, or Tart Gimlet* New Amsterdam 11 Waterloo #9 12 Beefeater 12 Hendricks 14 VODKA Made to your taste, or try a Lemon Drop, a Porn Star Martini, or a Mule* Stoli 12 Tito’s Handmade Vodka 12 Ketel One 13 Grey Goose 13 Stoli Elit 16 WHISKEY, BOURBON & RYE Benchmark, Bourbon 11 Jack Daniels, Tennessee Whiskey 13 Redemption, Rye 12 Maker’s Mark, Bourbon 14 Buffalo Trace, Bourbon 13 Bulleit, Rye 13 Crown Royal, Canadian Whiskey 13 Jameson, Irish Whiskey 14 SCOTCH As you like it, or crafted as a Rob Roy, Blood and Sand, or Simple Whiskey Highball.* Dewars White Label 13 Monkey Shoulder 14 Old Parr 14 Buchanan’s 12yr 16 Johnnie Walker Black 16 TEQUILA & MEZCAL Sip away, or enjoy as a Classic or Smokey Margarita, or Paloma* Camarena Reposado 12 Herradura Silver 12 400 Conejos Mezcal 15 Herradura Reposado 14 Rompe Corazon Mezcal 16 Casamigos Blanco 16 WINE BY THE GLASS Novecento Malbec 10 Trumpeter, Pinot Noir 12 Cartlidge & Browne, Cabernet Sauvignon 12 Balbo, Rose de Malbec 10 Flor del Inca, Chardonnay 10 Brancott, Sauvignon Blanc 11 BIRRAS Heineken 7 Mahou 7 BUBBLES Novecento Brut 11 Prose Prosecco 11 HAPPY HOUR EVERYDAY 3PM-7PM FOOD MEJILLONES 11 Mussels, garlic oil, spicy pomodoro PAPAS ARGENTINAS 9 Crispy egg, demi-glace TEQUEÑOS 12 Queso blanco, herb aioli MILANESA SLIDERS 14 All-natural chicken, French baguette, tartar sauce, tomatoes CHORIPAN 12 Argentinian sausage, French baguette, salsa criolla, herb aioli CRUDO DE SALMON 14 Salmon, citrus vinaigrette, capers, avocado CAMARONES AL AJILLO 14 Fresh shrimp, paprika butter, garlic oil Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. CLASSICALLY RARE, NEVER MEDIUM, ALWAYS WELL DONE PRIMER TIEMPO - Starter SOUP OF THE DAY - 8 MEJILLONES - 20 Mussels, garlic and white wine reduction CEVICHE - 17 Wild-caught mahi mahi, leche de tigre, avocado, smashed green plantains* BURRATA - 16 Burrata cheese, tomatoes, basil - Add prosciutto . 7 CALAMARES - 16 Crispy calamari rings, homemade tartar sauce and marinara PULPO A LA BRASA - 21 Char-grilled octopus, chimi whipped potatoes, smoked paprika* CARPACCIO - 19 Herb crusted filet mignon, citrus vinaigrette, olive oil, parmesan, capers, smoked eggplant aioli* TARTAR DE SALMON - 17 Salmon, avocado, herb aioli, red onions* PROVOLETA - 18 Grilled thick-cut provolone cheese, tomatoes, oregano - Add prosciutto - 7, chorizo - 5 EMPANADAS Handmade Chicken . 5.5 Steak . 6 Ham & Cheese . 5.5 Spinach & Cheese . 5.5 Del dia . 5.5 ENSALADAS - Salads ENSALADA NOVECENTO - 28 Steak, mixed greens, tomatoes, avocado, crispy French fries, dijon vinaigrette, demi glace* GORGONZOLA Y PERAS - 15 Mixed greens, char-grilled pears, candied walnuts, gorgonzola cheese, house-made vinaigrette KALE CAESAR - 14 Kale and romaine mix, homemade Caesar dressing, croutons, parmesan cheese * KALE SALAD - 15 Crispy kale, tomatoes, quinoa, avocado, red onions, chickpeas, feta cheese, cucumber, Kalamata olives, mango vinaigrette Add to any Salad All Natural Chicken· 8 / Salmon*· 9 / Shrimp*· 10 PARA PICAR - Bites to share CHORIZO 6 MOLLEJAS 8 MORCILLA 6 PICADA CRIOLLA - 32 All-natural chicken, chorizo, vacío and a choice of two empanadas* Add Mollejas (sweetbreads) . 4 Add Morcilla (blood sausage) . 4 SÁNGUCHES - Sandwiches Served with crispy fries or salad HAMBURGUESA NOVECENTO - 21 Snake River Farm American Wagyu, mozzarella, ham, crispy bacon, tomato, lettuce, herb aioli, fried egg, brioche bun* LOMITO - 22 Thinly-sliced filet mignon, mozzarella, ham, crispy bacon, lettuce, tomato, mayonnaise, French baguette* HAMBURGUESA CLASICA - 18 Snake River Farm American Wagyu, mozzarella, tomato, lettuce, herb aioli, brioche bun* CHORIPAN - 15 Argentinian sausage, herb aioli, salsa criolla, French baguette SEGUNDO TIEMPO - Mains SALMON - 29 Salmon, homemade mango mojo, with your choice of one house side* RISOTTO DE CARNE - 28 Filet mignon, demi glace, arborio rice, parmesan RISOTTO DE MARISCOS - 29 Shrimp, calamari, octopus, paprika, arborio rice, parmesan PASTAS - Homemade Substitute gluten free pasta or zucchini noodles + 2 POMODORO NOVECENTO - 20 Spaghetti, tomato sauce, burrata cheese, basil GNOCCHI GRATINADO - 22 Ricotta gnocchi, Parmesan sauce, au gratin - Add shrimp - 10 FUNGHI -  24 Mushroom and ricotta ravioli, creamy truffle sauce PARMESANO - 20 Spaghetti, parmesan cream, all natural chickenSpaghetti, parmesan cream, all natural chicken BOLOGNESE - 22 Tagliatelle, housemade short rib ragù ROSSO - 19 Fusilli, pink sauce, smoked bacon, oregano PUTTANESCA DE MARISCOS - 29 Spaghetti, shrimp, calamari, octopus, pomodoro, capers, olives, crush red pepper MILANGAS Choose pan-seared or traditional RIBEYE - 26 TENDERLOIN - 23 ALL-NATURAL CHICKEN - 21 A Caballo (fried egg) . 2 Suiza (swiss cheese) . 2 Napolitana (ham, mozzarella & tomato sauce) .3 DRY AGED SIGNATURE USDA Prime 16oz NY Strip From Greater Omaha Packers - Nebraska Aged in-house 69 **Available only in Brickell. PARRILLA - Grill LOMO - 38 Argentinean filet mignon* BIFE DE CHORIZO - 36 Argentinean NY strip* ENTRAÑA - 34 Skirt steak* OJO DE BIFE - 46 Argentinean Ribeye* VACIO - 29 Flap steak* PICAÑA - 27 Top Sirloin* BRANZINO - 34 Mediterranean sea bass POLLO - 23 All natural chicken PARA COMPARTIR - to share PARRILLADA - 74 (3-4 people) Picana, vacio, pollo, chorizo, mollejas, served with four house sides PARRILLADA NOVECENTO - 98 (3-4 people) Entrana, bife de chorizo, pollo, chorizo, mollejas, served with four house sides Our Parrilla and Milangas are served with your choice of Rice, Salad, French Fries, Mashed Potatoes, Burnt Tomato, or Potato Salad PROVISIONES -Sides matter Jasmine rice Burnt tomatoes Potato Salad Mashed potato Salad French Fries 5 Roasted sweet potatoes Sautéed vegetables Charred Asparagus Sautéed spinach Truffle fries Zingy potatoes 7 Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. BODEGA & BAR Glass Glass and a half Bottle LO MEJOR DEL MUNDO  F or us ... W ines from Argentina MALBEC Catena Vista Flores, Valle de Uco, Mendoza 41 Terrazas Reserva, Valle de Uco, Mendoza 43 Rutini Encuentro Barrel Select, Tupungato, Mendoza 11 16 44 Zuccardi Q, Valle de Uco, Mendoza 49 El Enemigo, Valle de Uco, Mendoza 19 28 77 San Pedro de Yacochuya, Cafayate, Salta 16 23 59 Luigi Bosca De Sangre, Valle de Uco, Mendoza 78 Jose Zuccardi, Valle de Uco, Mendoza 109 Catena Alta, Lujan de Cuyo, Mendoza 29 44 119 Yacochuya, Cafayate, Salta 139 * Val de Flores by Michel Rolland, Valle de Uco, Mendoza 159 RED BLENDS Rutini , Cab Sauvignon, Malbec 11 16 42 Mosquita Muerta Sapo de Otro Pozo, Malbec, Syrah, Cab Franc 74 Cocodrilo Viña Cobos, Cab Sauv, Malbec, Petit Verdot, Merlot 79 Achaval Ferrer Quimera, Malbec, Merlot,Cab Franc, Cab Sauv 93 Bodega del Fin del Mundo Special Blend, Cab Sauv, Malbec, Merlot 99 * Nicolas Zapata, Cabernet Sauvignon, Malbec 224 RED VARIETALS Malma Reserva, Merlot, Patagonia 49 Malma Reserva, Pinot Noir, Patagonia 14 20 55 Catena Agrelo, Cabernet Sauvignon, Mendoza 56 Domaine Nico Grand Mere, Pinot Noir, Mendoza 74 El Enemigo, Cabernet Franc, Mendoza 18 26 76 WHITES & ROSE Balbo, Rose de Malbec, Mendoza 10 14 39 Zuccardi A, Torrontes, Salta 40 Rutini Encuentro Barrel Select, Chardonnay, Mendoza 11 16 42 Nicolas Catena, La Marchigiana, Chardonnay, Mendoza 87 Otronia 45 Rugientes, La Marchigiana, Chardonnay, Mendoza 99 EL RESTO - Wines from around the world REDS B.R. Cohn, Cabernet Sauvignon, North Coast, USA 14 20 53 Baron de Ley Reserva, Rioja, Spain 15 22 55 Castello del Trebbio, De'Pazzi, Super Tuscan, Italy 15 22 56 La Crema, Pinot Noir, Sonoma Coast, USA 65 Markham, Merlot, Napa Valley, USA 67 Marques de Murrieta Reserva, Rioja, Spain 69 Emilio Moro, Ribera del Duero, Spain 74 Schooner Voyage 12 by Caymus, Malbec, Napa Valley, USA 19 28 74 Textbook, Cabernet Sauvignon, Napa Valley, USA 84 The Prisoner, Red Blend, Napa Valley, USA 96 Campogiovanni, Brunello di Montalcino, Tuscany, Italy 139 Tommasi, Amarone, Veneto, Italy 149 Caymus, Cabernet Sauvignon, Napa Valley, USA * 199 Vega Sicilia Valbuena 5, Ribera del Duero, Spain * 310 Opus One, Red Blend, Napa Valley, USA * 650 WHITES Brancott Estate, Sauvignon Blanc, New Zealand 11 16 40 Beati, Pinot Grigio, Trentino, Italy 11 16 42 Cantos No Luar, Albariño, Galicia, Spain 44 The Beach Rose by Whispering Angel, Provence, France 45 Sonoma-Cutrer, Chardonnay, Russian River, USA 15 22 57 Rombauer, Chardonnay, Napa Valley, USA 109 CHAMPAGNE AND SPARKLING Novecento Brut, Mendoza, Argentina 11 40 Parolvini Prosecco, Veneto, Italy 11 42 Charles Lafitte Rose Sparkling, France 49 Chandon Brut, California, USA 66 Veuve Clicquot Brut, Champagne, France 135 * Wines are not eligible for 50% Off Wine Tuesdays COCTELES - Cocktails MATE MULE .14 Tito's Handmade Vodka, Fever Tree ginger beer, lime MATADOR .15 Monkey Shoulder Scotch Whisky, honey, lime, basil, strawberry MESZI .16 400 Conejos mezcal, Aperol, pineapple, lime, sage LYCHEE GIN & TONIC .15 Waterloo #9 Gin, J.F Haden’s Lychee Liqueur Fever Tree Mediterranean Tonic, floral KEY LIME CARNIVAL · 16 Leblon Cachaca, JF Haden's Key Lime Pie, lime, graham cracker APASIONADO .16 Camarena reposado tequila, passion fruit, lime, bell pepper MENDOZA SOUR .14 Pisco 1615, grapefruit, malbec, lime, aquafaba ZERO PROOF - Cocktails FIESTA DE ORO · 15 Ritual tequila alternative, lime, bell pepper, agave MANHATTAN MIRAGE · 16 Lyre's dark cane spirit, Martini & Rossi vibrante, aromatic bitters BIRRA - Beer (Not avalaible at Aventura) DRAFT Heineken - 7 Mahou - 7 Michelob Ultra - 7 Wynwood Brewing - La Rubia - 8 Veza Sur - Mala Yerba IPA - 8 Cigar City - Maduro - 8 BOTTLE/CAN .7 Novecento Lager Quilmes Peroni Stella Artois Corana Light Heineken 0.0. BRUNCH LIBATIONS BLOODY MARY .13 Vodka, Fever Tree Bloody Mary, lime ESPRESSO MARTINI .16 Ketel One vodka, kahlua, fresh-brewed espresso APEROL SPRITZ .13 Aperol, Prose Prosecco, club soda MIMOSA .12 Sparkling wine, fresh squeezed orange juice SANGRIAS - 12 Red White Sparkling BRUNCH - (Weekend Brunch Only) BOTTOMLESS - 25 Bloody Mary Prose Prosecco Sangria Mimosa BRUNCH MENU Available Saturdays and Sundays from 11am-4pm DESAYUNO - Breakfast EGGS ANY SLTYLE 14 Farm fresh whole eggs, bacon, roasted potatoes, farm-style bread HEARTWISE OMELETTE 15 Farm fresFresh egg whites, asparagus, onions, mushrooms CHORIZO SCRAMBLE 16 Farm fresArgentinian chorizo, fresh scrambled eggs, tomatoes, sliced avocado, farm-style bread* STEAK & EGGS 22 Filet mignon bites, shallot cream, fresh scrambled eggs, tomatoes, farm-style bread* NY STRIP & EGGS 39 Argentinean NY strip, fried eggs, roasted potatoes, chimichurri* NOVECENTO BENEDICT 23 Poached eggs, hollandaise, English muffin, steak, roasted potatoes SALMON BENEDICT 18 Poached eggs, hollandaise, English muffin, smoked Scottish salmon, roasted potatoes BACON PANCAKES 17 Buttermilk pancakes, bacon-infused maple syrup, candied bacon FRENCH TOAST ARGENTINO 16 Brioche bread, condensed milk, dulce de leche sauce, whipped cream AVOCADO TOAST 16 Avocado mash, poached eggs, farm-style bread SALMON TOAST 18 Smoked Scottish salmon, capers, smoked eggplant aioli, poached eggs, farm-style bread EMPANADAS HANDMADE Steak . 6\r\nChicken . 5.5\r\nSpinach & Cheese . 5.5\r\nHam & Cheese . 5.5\r\nDel día . 5.5 PRIMER TIEMPO - Starters BURRATA 16 Burrata cheese, tomatoes, basil. Add prosciutto · 7 PULPO A LA BRASA 21 Char-grilled octopus, chimichurri whipped potatoes, smoked paprika* TARTAR DE SALMON 17 Salmon, avocado, herb aioli, red onions* PROVOLETA 18 Grilled thick-cut provolone cheese, tomatoes, oregano.\r\nAdd Prosciutto · 7 Chorizo · 5 ENSALADAS - Salads ENSALADA NOVECENTO 28 Steak, mixed greens, tomatoes, avocado, crispy French fries, dijon vinaigrette, demi glace* KALE SALAD 15 Crispy kale, tomatoes, quinoa, avocado, red onions, feta cheese, cucumber, Kalamata olives, mango vinaigrette Add to any Salad Chicken 8\r\nSalmon 9\r\nShrimp 10 SÁNGUCHES - Sandwiches Served with crispy fries or salad HAMBURGUESA NOVECENTO 21 Snake River Farm American Wagyu, mozzarella, ham, crispy bacon, tomato, lettuce, herb aioli, fried egg, brioche bun* CHORIPAN 15 Argetinian sausage, herb aioli, salsa criolla, French baguette* HAMBURGUESA CLÁSICA 18 Snake River Farm American Wagyu, mozzarella, tomato, lettuce, herb aioli, brioche bun* LOMITO 22 Thinly-sliced filet mignon, mozzarella, ham, crispy bacon, lettuce, tomato, mayonnaise, French baguette* SEGUNDO TIEMPO - Second Course SALMON 29 Salmon, homemade mango mojo, with your choice of one house side* PASTAS - Homemade | Substitute gluten free pasta +2 POMODORO NOVECENTO 20 Spaghetti, tomato sauce, burrata cheese, basil GNOCCHI GRATINADO 22 Ricotta gnocchi, parmesan sauce, au gratin – Add shrimp* · 10 PARRILLA - Grill ENTRAÑA 34 Skirt steak* PICAÑA 27 Top Sirloin* VACÍO 29 Flap steak* POLLO 25 All natural chicken BRANZINO 34 European sea bass* IMPORTED FROM ARGENTINA LOMO 39 Filet Mignon* BIFE DE CHORIZO 36 NY Strip* OJO DE BIFE 46 Ribeye SEASONAL STEAK Unique seasonal selection MILANGAS Chooe pan-seared or traditional RIBEYE 26 TENDERLOIN 24 ALL NATURAL CHICKEN 22 A Caballo (fried egg) 2 Suiza (swiss cheese) 2 Napolitana (ham, mozzarella & tomato sauce) 3 PARA COMPARTIR - To share Parrillada 74 Picaña, vacio, pollo, chorizo, mollejas, served with four house sides (2-3 person) Parrillada Novecento 98 Entraña, bife de chorizo, pollo, chorizo, mollejas, served with four house sides* (2-3 person) Our Pairilla, Milangas and Para Compartir are served with your choice of rice, salad, French fries, mashed potatoes, burnt tomato or potato salad PROVISIONES -Sides matter Jasmine rice Burnt tomatoes Potato Salad Mashed potato Salad French Fries 5 Roasted sweet potatoes Sautéed vegetables Charred asparagus Sautéed spinach Truffle fries Zingy potatoes 7 Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. PARA LOS PIBES - Kid`s Menu - KIDS STEAK - 13 French fries or mashed potatoes MILANGA - 13 All-natural chicken or tenderloin French fries or mashed potatoes KIDS PASTA - 9 Choice of Pasta Spagehtti, gnocchi, or gluten-free pasta Choise of Sauce Parmesan, tomato or pink DESSERT COPA DE HELADO - 4 Your choise of ice cream Chocolate, vanilla, banana split, delce de leche or lemon Kids menu available for children under 12 Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. TIEMPO EXTRA DESSERT CREME BRULEE DE DULCE DE LECHE 12 Dulce de leche custard TODO CHOCOLATE 12 Warm chocolate truffle cake, whipped cream, chocolate ice cream FLAN 11 Creme-caramel, whipped cream, dulce de leche PANQUEQUES NOVECENTO 12 Handmade caramelized dulce de leche crepes, vanilla ice cream TIRAMISU 13 Mascarpone mousse, cacao, lady fingers, espresso COPA DE HELADO 8 Your choice of two flavors\r\nChocolate, vanilla, dulce de leche, banana split, or lemon sorbet\r\nAdd extra scoop · 3 SINFONIA NOVECENTO 25 Tasting dessert\r\nPanqueque with vanilla ice cream, todo chocolate, flan DESSERT COCKTAILS CARAJILLO 14 Creamy, layered, perfect finish\r\nLicor 43, Oreo, fresh-brewed espresso ESPRESSO MARTINI 16 Classic, foamy, delightful\r\nKetel One Vodka, Kahlua, fresh-brewed espresso COFFEE & TEA ESPRESSO 3,50 CORTADITO 3,75 MACCHIATO 3,75 CAPPUCCINO 4,50 AMERICAN COFFEE 3,50 LATTE 4,50 SELECTION HOT TEA 3,50 DESSERT WINES Las Perdices Late Harvest, Viognier, Argentina 8 Tasting dessert\r\nPanqueque with vanilla ice cream, todo chocolate, flan Dona Antonia Reserva Tawny, Porto, Portugal 11 Tasting dessert\r\nPanqueque with vanilla ice cream, todo chocolate, flan CORDIALS Bailey’s 12 Limoncello 11 Tequila 1942 35 Frangelico 12 St. Germain 16 Licor 43 12 Sambuca Romana 12 Hennessy VS 18 Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. MEDIO TIEMPO | LUNCH $27 Monday - Friday | 11 am - 3 pm *Available at select locations APPETIZER (choose one) EMPANADA Chicken or Spinach & Cheese SALMON TIRADITO Fresh Salmon, Passion Fruit Glaze, Crispy Leek, Cilantro STRAWBERRY FETA SIDE SALAD Mixed Greens, Strawberry, Citrus Vinaigrette, Feta, Mint ENTREE (choose one) SHRIMP ASPARAGUS PASTA Shrimp, Asparagus, Lemon Beurre Blanc, Spaghetti CHICKEN CAESAR MILANESA Pounded Breaded Milanese, Romaine, Homemade Caesar Dressing RIBEYE JR. 7 oz Ribeye, Veggies, Mashed Potatoes SALMON BURGER Tartar sauce, Mint, Cucumber, Tomato, Brioche Bun, French Fries DESSERT (choose one) CHOCOTORTA Chocolate Cookies, Dulce De Leche Mousse, Whipped Cream Or CAFECITO Please note an 18% service charge is applied on all bills to ensure fair wages and benefits for all team members all year long. Additional gratuity is at the discretion of each guest. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Please notify our team of any food allergies, we are unable to guarantee against all possible cross-contamination. Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    },
    {
      "url": "https://novecento.com/contact-us/",
      "text": "Contact Us – Novecento Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne CONTACT US DROP A LINE. GIVE US A BUZZ. HIT US UP. No matter how you say it, we want to hear from you! Your feedback helps to keep us on our toes and makes sure that we constantly find ways to improve. Questions, comments, concerns – leave them here we want to hear all about the good the bad and the ugly. Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://novecento.com/about-us/",
      "text": "About Us – Novecento Skip to main content Hit enter to search or ESC to close Close Search Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne ABOUT US OUR RESTAURANT There’s power in numbers. Novecento (900) is the sum of all our parts. It’s a symbol. An experience. A gathering space – meant to bring people together in a setting that is classically rare, never medium and always well done. Novecento can feel like a Sunday dinner at home with the family yet thrives as a business lunch option with colleagues, a laissez faire night out with your partner, or a Fútbol match with the fellas. OUR STORY Our love for our guests and our food knows no limits. Our roots run deep. Quickly becoming a local icon after first opening our doors in 1991 in SoHo, NY, we went international — opening locations in the trendy Cañitas, Argentina; a summer seasonal restaurant in Punta Del Este, Uruguay; and a local favorite in Cordoba, Argentina. That success drove the opening of locations in key areas of South Florida. We’ve stayed true to the core elements that have made us a fan favorite for almost three decades. Every day, we take care of our team members, our guests and our community. When it comes to food, we believe that fresh and made-from-scratch is the only way. Our guests are our neighbors, friends and family and we can’t wait to welcome you back to our home! OUR GUIDING PRINCIPLES Initiative Initiative means we take action without direction from above to improve our knowledge and come up with solutions to problems. With each team member taking initiative, the leverage is immense. Innovation Innovation means looking at new ways of doing the same thing. It also means knowing which areas are appropriate for innovation, having the courage to change, and tolerating failures. Continuous Improvement Continuous improvement is how we get better. We continually seek ways to learn from processes and improve them and ourselves. The chain of command has the obligation to develop and institute mechanisms to achieve continuous improvement. Empowerment We encourage team members to take action and we support them if they make mistakes. We employ stewardship delegation, explain what we want accomplished and allow flexibility in how it is accomplished. Openness We exercise participative openness: freedom to speak one’s mind. We challenge our own thinking and we think out loud. Timeliness Timeliness means we do things on time: start work on time, qualify on time, and are ready for busy hours on time. Working to accomplish processes quickly and efficiently results in a more effectively organization. Intimate Technical Knowledge Intimate technical knowledge means that each of us is responsible for learning our areas of responsibility. We make decisions based on technical reasons, not hope. Commitment Commitment means we are present when we come to work. We give it our best. We choose to be here. Integrity Integrity is a higher value than loyalty. Or better put, integrity is the highest form of loyalty. Integrity means being integrated or centered on principles not on people, organizations, or even family. Subscribe and never miss a chance to meat: Select a location near you Aventura Brickell Delray Beach Doral Key Biscayne To receive information on special promotions & newsletter from Novecento. You can unsubscribe at any time. Copyright 2020 Novecento. All Rights Reserved. Terms of Use Privacy Policy ABOUT US WINES BLOG PRESS SISTER BRANDS PANAMERICANO BAR SUVICHE ACCESSIBILITY WEB ACCESSIBILITY STATEMENT ACCESSIBLE WEBSITE VERSION FEEDBACK Close Menu MENU Aventura Brickell Delray Beach Doral Key Biscayne LOCATIONS Aventura Brickell Delray Beach Doral Key Biscayne CATERING PRIVATE DINING HAPPENINGS CAREERS RESERVATIONS Aventura Brickell Delray Beach Doral Key Biscayne Panamericano Bar ORDER ONLINE Aventura Brickell Delray Beach Doral Key Biscayne"
    }
  ]
}