{
  "fuentes": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "email": "enquiries@displaysuk.co.uk"
    },
    {
      "url": "https://staffboard.com/",
      "email": "contact@staffboard.de"
    },
    {
      "url": "https://rooftopfilms.com/meet-the-staff-and-board/",
      "email": "info@rooftopfilms.com"
    },
    {
      "url": "https://rooftopfilms.com/meet-the-staff-and-board/",
      "email": "rentals@rooftopfilms.com"
    },
    {
      "url": "https://thevendry.com/venue/282679/nube-rooftop-fort-lauderdale-fl",
      "email": "events@therestaurantpeople.com"
    },
    {
      "url": "https://www.nuvole22.com/about",
      "email": "gm@nuvole22.com"
    },
    {
      "url": "https://www.therooftopguide.com/rooftop-bars-in-fort-lauderdale/nube-rooftop.html",
      "email": "info@nuberooftop.com"
    },
    {
      "url": "https://www.rooftopgroup.org/about/about-us/leadership",
      "email": "hr.general@rooftopgroup.org"
    },
    {
      "url": "https://rooftopapp.com/contact",
      "email": "connect@rooftopapp.com"
    }
  ],
  "mails": [
    "connect@rooftopapp.com",
    "contact@staffboard.de",
    "enquiries@displaysuk.co.uk",
    "events@therestaurantpeople.com",
    "gm@nuvole22.com",
    "hr.general@rooftopgroup.org",
    "info@nuberooftop.com",
    "info@rooftopfilms.com",
    "rentals@rooftopfilms.com"
  ],
  "nombre_sitio": "nuberooftop.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "text": "Staff Photo Boards For Schools & Business This site is best viewed with javascript enabled. For help enabling javascript please click here . search close Search Quote ( 0 ) Checkout 0 item s £ 0.00 Home Products Exhibition Stands Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays See all Outdoor Displays Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers See all Display Cases Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases See all Exhibition & Display Boards for Hire or Rent Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire See all Leaflet, Brochure, Menu & Card Holders Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders See all Banner Stands Pull Up Roller Banners Double Sided Pull Up Banner Stands Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays See all Counters & Plinths Portable Counters & Workstations Promotion / Demonstration Counters Lectern Test Category Pedestals See all Noticeboards & Whiteboards Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards See all Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Lightboxes Dibond Signs See all Display Boards Folding Display Boards Folding Screen Room Dividers Panel and Pole Display Boards Display Board Accessories See all Specialist Displays Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture See all Perspex Cut To Size Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size See all About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Quote ( 0 ) 50,000+ products in stock 1,000 stock product lines with over 50,000 products in stock Custom made displays Rapid delivery on custom made Perspex acrylic displays Next day delivery Next day delivery on many products if ordered by mid day UK Manufacturer Many of our products are made in our own UK factory Cutting edge technology Experts in printed acrylic panels - any size, any shape menu close Products Exhibition Stands Back All Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays Extra Wide & Linked Banner Stands Outdoor Displays Back All Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers Outdoor Display Counters Outdoor Custom Printed Chairs Display Cases Back All Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Glass Display Cases Bespoke Acrylic Display Cases Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases Exhibition & Display Boards for Hire or Rent Back All Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire Exhibition Counters for Hire Banner Stands for Hire Leaflet, Brochure, Menu & Card Holders Back All Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders Rotating Brochure Holders Greeting Card Displays Business Card Holders Banner Stands Back All Pull Up Roller Banners Double Sided Pull Up Banner Stands Replaceable Cassette Roller Banners Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays Banner Stand Accessories Tension Banner Stands Counters & Plinths Back All Portable Counters & Workstations Promotion / Demonstration Counters Lectern Media Cabinets Test Test category for acrylic pedestals Test Category Pedestals Noticeboards & Whiteboards Back All Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards Freestanding / Mobile Noticeboards Whiteboards Glass Noticeboards Flipcharts & Easles Outdoor Noticeboards Acrylic Noticeboards Pinnable Noticeboards Write On Glassboards Signage & Perspex Frames Back All Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Staff Photo Boards Lightboxes Dibond Signs Printed Foamex Signs Site Safety Signs Snap Frames Sign Fittings & Accessories Hoarding Panels Acrylic Awards and Trophies Acrylic Noticeboards Printed Correx Signs Retail & Point Of Sale Printed Plywood and Wood Display Boards Back All Folding Display Boards Folding Screen Room Dividers Aluminium & Graphic Folding Display Boards Panel and Pole Display Boards Office Screens Display Board Accessories Specialist Displays Back All Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture Educational Furniture & Displays Social Distancing Screens Printed Outdoor Garden Art Garden Mirrors, Outdoor Mirrors & Illusion Mirrors Acrylic Photo Prints Shed, Playhouse, Greenhouse Windows Eco Lawn Edging From Recycled Plastic Decorative Garden Wall Panels Garden Structures, Gazebos, Arbours & Swings Garden Ornaments & Planters Acrylic Photo Prints Perspex Acrylic Splashbacks Perspex Cut To Size Back All Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size Perspex Acrylic Grey 9981 Cut To Size Perspex Acrylic Yellow 260 Cut To Size Perspex Acrylic Red 4415 Cut To Size Perspex Acrylic Orange 363 Cut To Size Perspex Acrylic Red 431 Cut To Size Perspex Acrylic Red 433 Cut To Size Perspex Acrylic Violet 886 Cut To Size Perspex Acrylic Green 6T81 Cut To Size Perspex Acrylic Green 650 Cut To Size Perspex Acrylic Blue 727 Cut To Size Perspex Acrylic Blue 750 Cut To Size Perspex Acrylic Blue 744 Cut To Size Perspex Acrylic Clear Frost S2 000 Perspex Acrylic Glass Look 6T21 Cut To Size Perspex Acrylic Silver Mirror Perspex Acrylic Blue Mirror 2069 Perspex Acrylic Purple Mirror 102 About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Home Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Staff Photo Boards For Schools & Business Staff Photo Boards For Schools & Business £ 36.30 ex. VAT £ inc.VAT Options Colour: Black Back Panel White Back Panel Clear Back Panel Clear Frost Back Panel Coloured Back Panel 2: 2: Qty Add to basket Get a quote Staff Photo Notice Boards - Perspex Acrylic Staff photo notice boards, or \"Meet The Team\" boards are a perfect way of letting people know who's who in a school, NHS Wards, general office and commercial workplace, recreation centres, reception areas, etc. Each clear pocket allows a small photo of a relevent member of staff. Options available include: choice of back acrylic colour, the number of photo pockets. We also offer a secure, tamper proof version, please click here for further details. NEW! We can now offer staff boards with your name and logo printed directlty to the top of the display - call for details. Features and Benefits: Please double click on the above images of our acrylic staff photo boards to zoom into a more detailed view Staff photo boards provide a professioal looking wall mounted display panel for quick reference of staff / team members Choice of black, white, clear or clear frost 5mm thick acrylic back panel with polished edges. Corners are rounded with no sharp edges Clear acrylic photo pockets allow staff photos to be changed quickly and easily Supplied with 4 polished sign fittings to give that floating effect off a wall Each photo pocket size is 75mm high x 50mm wide Header panel pocket is 260mm wide x 50mm high Please see the table below for our standard sized staff photo boards. We also manufacture custom sized boards if you require different sized pockets or different quantities of pockets - please call us on 01202 480104 for further details. Staff photo board prices are detailed in the drop down menu at the top of the page. Manufactured to order in our factory in Christchurch, Dorset, UK. Please allow 5 working days for delivery Please see our stand off fittings instructions by clicking here Looking for a a more secure staff photo board which can't be tampered with? Check out our Secure Staff Photo Boards ! Looking for a staff photo board with a different coloured back panel? We have a range of colours available other than our standard colours listed! Please contact us for a quote. Looking for a staff photo board with bespoke printing and branding to suit your business? With state of the art printers, we are able to fully print or brand these staff boards with your logos and messages! If this is something you are interested in, contact us for a quote! Code Photo Pockets Frame Size Width x Height (mm) SB10 10 430mm x 325mm SB20 20 430mm x 515mm SB30 30 500mm x 610mm SB40 40 640mm x 610mm SB50 50 780mm x 610mm SB60 60 780mm x 705mm SB65 65 800mm x 740mm SB70 70 780mm x 800mm SB80 80 780mm x 895mm SB100 100 780mm x 1085mm SB120 120 920mm x 1085mm SB140 140 1060mm x 1085mm SB160 160 1200mm x 1090mm Displays UK provide daily deliveries to most towns and cities in the UK including: Christchurch, Poole, Bournemouth, Swanage, Dorchester, Ferndown, Shaftesbury Sherborne Sturminster Newton Swanage Weymouth Ringwood New Forest Fordingbridge Salisbury Thank you for visiting our website Product Code: 64674569876345 Specification Code 64674569876345 Style Staff Photo Board Location Wall Mounted Weight 10.000 Kg Secured by sagePay Pay with PayPal Pay with Mastercard Pay with Visa × Items Quick basket Newsletter Signup Submit Exhibition Stands Outdoor Displays Display Cases Exhibition & Display Boards for Hire or Rent Leaflet, Brochure, Menu & Card Holders Banner Stands Counters & Plinths Noticeboards & Whiteboards Signage & Perspex Frames Display Boards Specialist Displays Perspex Cut To Size Displays (UK) Limited Displays UK are located in Christchurch, on the Hampshire / Dorset border. We are a proper 'bricks and mortar' manufacturing business not just another internet retailer. Read more… Head Office Units 16-18, 12 Airfield Road, Off Airfield Way, Christchurch, Dorset, BH23 3TG Tel: 01202 480104 Email: [email protected] Connect with us DISQ Display Innovation Service Quality Displays (UK) Limited registered in England and Wales with company number 8896740 and registered address Bank Court, Manor Road, Verwood, Dorset, BH31 6DY. VAT number GB980855382 © Displays (UK) Limited 2025 / Website by Adido / Terms & Conditions / Privacy / Sitemap"
    },
    {
      "url": "https://staffboard.com/",
      "text": "staffboard HR Software [has_children] [de] Dashboard [child] [de] HR-Exzellenz-Dashboard Recruiting (ATS) [child] [de] Gestalten Sie bewusst die Zukunft Ihrer Organisation! Digitale Personalakte [child] [de] Mit der digitalen Personalakte haben Sie die Daten Ihrer Mitarbeiter immer im Blick Abwesenheitsmanagement [child] [de] Organisieren Sie übersichtlich & schnell Ihre Abwesenheiten Feedback & Performance [child] [de] Fördern Sie aktiv die persönliche Entwicklung Ihrer Mitarbeiter durch konstruktives Feedback Learning [child] [de] Planen Sie die Weiterentwicklung Ihrer Mitarbeiter Zeiterfassung [child] [de] Optimieren Sie die HR-Zeiterfassung Lohnabrechnung [child] [de] Mit dem Modul für Lohn & Gehalt erhalten Sie eine guten Überblick für die nächste Lohnabrechnung. Organigramm [child] [de] Visualisieren die Hierarchie und Struktur Ihres Teams Preise [de] Reports [child] [de] Gewinnen Sie wertvolle Einblicke in Ihre Belegschaft mit anpassbaren Berichten, Echtzeitanalysen und Datenvisualisierungstools. HR Insights [de] Unternehmen [has_children] [de] Unternehmen [child] [de] Kooperationspartner [child] [de] Karriere [child] [de] FAQ [child] [de] Kontakt [de] Login [de] HR Software [has_children] [en] Dashboard [child] [en] HR Excellence Dashboard Recruiting (ATS) [child] [en] Consciously shape the future of your organization! Digital Personnel File [child] [en] With the digital personnel file, you always have an overview of your employees' data Absences [child] [en] Organize your absences clearly and quickly Feedback & Performance [child] [en] Actively promote the personal development of your employees through constructive feedback Learning [child] [en] Plan the development of your employees Time Tracking [child] [en] Streamline HR Time Tracking Payroll [child] [en] The module for wages and salaries gives you a good overview for the next payroll. Orgchart [child] [en] Visualize your team's hierarchy and structure Pricing [en] Reports [child] [en] Gain valuable insights into your workforce with customizable reports, real-time analytics, and data visualization tools. HR Insights [en] Company [has_children] [en] About Us [child] [en] Partners [child] [en] Career [child] [en] FAQ [child] [en] Contact [en] Login [en] DE EN ONLINE DEMO BUCHEN Die HR Software für Unternehmensgestalter Ihr Copilot im HR Team Mit staffboard gestalten Sie Ihr Personalwesen nach den Bedürfnissen Ihrer Organisation. Sie schaffen mehr Zeit und Transparenz für Ihr Team, in einer modernen HR Software. JETZT KOSTENLOS TESTEN Good Bye, Papier Chaos! Herzlich Willkommen, Digitale Personalakte! Mit Hilfe der digitalen Mitarbeiterverwaltung können Sie alle Informationen über Ihre Mitarbeiter übersichtlich an einem Ort abspeichern. Suchen Sie mühsam nach Arbeitsverträgen, Attesten oder sonstigen Mitarbeiterdokumenten und verlieren dadurch wertvolle Zeit? Mit unserer Digitalen Personalakte finden Sie alles auf einen Blick im Mitarbeiterprofil. Dank des Employee Self Service (ESS) können zahlreiche Daten eigenständig von den Mitarbeitern gepflegt werden. So sparen Sie Zeit, Geld und natürlich Nerven für andere wichtige Themen. Bewerbermanagement leicht gemacht Mit unserem übersichtlichen Recruiting Modul verlieren Sie nie mehr einen Bewerber aus den Augen. Durch intuitives Drag & Drop können Sie ihre Bewerber schnell durch die Phasen Ihres individuellen Bewerbungsprozesses leiten. Eingangsbestätigungen werden automatisiert versendet und personalisierte Terminvereinbarungen oder Absagen sind mit einem Klick möglich. Viele Funktionen wie das Abgeben von Bewertungen für Bewerber, schreiben von Kommentaren und die Einbindung weiterer Teammitglieder sind problemlos möglich. STAFFBOARD 30 TAGE KOSTENLOS TESTEN! JETZT ANMELDEN Eine kleine Auswahl unserer treuen Kunden. \"Wir sind an dem Punkt, an dem wir ohne dieses Tool schlicht nicht arbeiten könnten.\" Jakob Schoroth (Reparando GmbH) Managing Director ✔️ staffboard wurde in Deutschland gegründet und hat seinen Hauptsitz in München. ✔️ Die Daten werden ausschließlich in Deutschland verarbeitet und verschlüsselt gespeichert. ✔️ Regelmäßige Updates und Backups sorgen für größtmögliche Sicherheit. Zudem liegen ISO-Zertifizierungen der Hosting Provider vor. ✔️ Die staffboard HR Software und die Daten werden in Rechenzentren in Deutschland gehostet. ✔️ Unternehmen mit dem Siegel hinterlegen beim BITMi e.V. den Standard ihrer Maßnahmen bzgl. Datenschutz. ✔️ Für den Vertrag mit den Hosting Provider gilt ausschließlich deutsches Recht, insbesondere das deutsche Datenschutzrecht, das BGB und das HGB. ✔️ Wir unterliegen der Kontrolle eines externen und unabhängigen Datenschutzbeauftragten. ✔️ Eine AV-Vereinbarung mit jedem Kunden gewährleistet Datenschutz und Datensicherheit. ✔️ Unsere Mitarbeiter sind im Umgang mit sensiblen, personenbezogenen Daten geschult und erhalten regelmäßige Unterweisungen. ✔️ 100% Service: Bei Fragen zum Produkt finden Sie stets einen deutschsprachigen Ansprechpartner. ✔️ 100% Qualität: Die in Deutschland designte staffboard HR Software wird auch in Deutschland getestet. ✔️ 100% Zukunft: Die staffboard HR Software ist investitionssicher und wird kontinuierlich weiterentwickelt und aktualisiert. Melden Sie sich für unseren Newsletter an, um regelmäßig über neue Funktionen und Produkt Updates informiert zu werden. Registrien Email sent! Check your inbox to complete your signup. Digitalisieren Sie Ihre HR Prozesse Unsere staffboard HR Software automatisiert und vereinfacht alle wesentlichen Personalprozesse. Dashboard Recruiting (ATS) Digitale Personalakte Abwesenheitsmanagement Feedback & Performance Learning Zeiterfassung Lohnabrechnung Organigramm Reports Kostenlos & unverbindlich Tage testen * Ich akzeptiere die Datenschutzbestimmungen und die AGB . Jetzt anmelden Benutzerfreundlich Unser intuitives Design ermöglicht eine steile Lernkurve ohne große Einarbeitung. Flexibel Jedes Unternehmen ist anders – und das wissen wir. Darum lässt sich staffboard an Ihre Anforderungen anpassen. Online Greifen Sie von überall mit einer verschlüsselten Verbindung auf staffboard zu. SUPPORT Allgemeine Fragen zum Produkt? 089 - 1250 1458 contact@staffboard.de Für technischen Support innerhalb der Software steht Ihnen ein Ticketsystem zur Verfügung. UNTERSTÜTZER & PARTNER Karriere [de] Impressum [de] Datenschutz [de] AGB [de] Career [en] Imprint [en] Privacy Policy [en] Terms & Conditions [en] 2025 © staffboard | Ihr Copilot im HR Team"
    },
    {
      "url": "https://rooftopfilms.com/meet-the-staff-and-board/",
      "text": "Staff and Board – Rooftop Films Our Impact Support Us Donate / Memberships 2025 Sponsorships Rooftop Merch A/V Rentals For Filmmakers Submit a Film for 2025 The Rooftop Filmmakers Fund About Jobs & Volunteer Opportunities Press Meet The Team Schedule Follow Instagram X/Twitter Facebook Newsletter Staff and Board STAFF Kate Gellene, Head of Operations Kate (she/her) joined the Rooftop Films team as an intern in the fall of 2011 and wore many hats before heading the operations department in 2014—including event management, fundraising & membership, and social media. Born and raised in New Jersey, Kate studied Cinema Studies with a minor in French at NYU’s Tisch School of the Arts. During the summer, Kate can (occasionally) be found making your drink at the after-party. Or at the beach. Saidah Russell, Head of Programming Saidah (she/her) joined the Rooftop Films team in 2022 and previously worked full time in film exhibition at an arthouse theater in Westchester, NY. She has experience working on screening committees for several festivals, including the Sundance Film Festival, Hamptons International Film Festival, and Indie Memphis Film Festival. She is the Director of Programming for the TIDE Film Festival, an emerging Brooklyn-based festival dedicated to showcasing work by filmmakers of color. Kristen Kelley Rand, Head of Marketing and Communications Originally from just north of Boston, Kristen (she/her) is an actress and writer who earned her bachelor’s at New York University’s Gallatin School, where—pursuing as well-rounded an arts education possible—she designed her own interdisciplinary program marrying the studies of performance, production, and marcom. She came to Rooftop following tenure at Universal Pictures, W Magazine, and inside the halls of the McKittrick Hotel with Punchdrunk’s Sleep No More . She credits her maternal gram (and Julia Roberts) with helping shape her into the rom-com savant she is today, and firmly believes you should eliminate the term “guilty pleasure” from your vocabulary if you haven’t already. Langston Sanchez, Head of Technical Operations Langston (he/him) is a media technician and event producer who strives to combine a DIY ethos with seamless production to create high-quality, accessible events in his native New York City. After graduating from Hampshire College with a B.A. in Film and Video Art, Langston’s work has spanned both production and media education, with experience at institutions such as the Cooper Union, Apollo Theater, DOC NYC, Maysles Documentary Center, and the Sundance Film Festival. When not working alongside his team, Langston attempts to strike a balance between chronically online and blissfully unaware. Isabella Jackson, Programmer Isabella (she/her) is a writer and dancer from a tiny town in Pennsylvania. She came to New York to study Dance and Film at The New School, and went on to get her MFA in Screenwriting from Brooklyn College. She’s passionate about independent filmmaking, having worked in and around the industry since 2014 with IFP, The Hamptons International Film Festival, Montclair Film Festival, NewFest, and DOCNYC. Outside of festivals, she works in TV as a Writer’s Assistant and Script Coordinator. In the world, you can find her listening to disco, writing strange stories, or watching a campy horror flick. Hilina Kidane, Programmer Hilina (she/her) began with Rooftop Films as Volunteer Coordinator before joining the programming team. She’s worked across a number of film festivals and is currently full-time at the New York International Children’s Film Festival, where she supports youth-enrichment programs. Darby Puckett, Programmer Darby (she/her) is an actress and filmmaker from Virginia Beach, VA. She started at Rooftop as an intern, and that’s when the addiction to watching short films began. Aside from film watching, she’s usually training for a random half marathon, memorizing lines, or dream-casting Broadway musicals. Mariales Diaz, Programming Assistant Mariales Diaz (they/them) is a gender-expansive Dominican writer, director, producer, and programmer living in New York. Their storytelling explores experiences that exist at the intersection of survival and love. Diaz has worked on the production and post-archival teams at companies such as Pilgrim Media Group, Religion of Sports, HBO Max, and Proximity Media. They are a graduate of the SUNY Purchase Film Conservatory and a 2024 Sundance Institute Trans Possibilities Fellow. They also have participated in fellowships and artist programs such as Film at Lincoln Center’s Artist Academy, Sundance Ignite, Creative Culture at The Jacob Burns Film Center, and NeXt Doc. C. “Meaks” Meaker, Venue Manager Meaks (they/them) is a writer whose work often explores queerness, monstrosity, and the end of the world. Their plays have been performed and developed across the United States, including the Kennedy Center, Seattle Repertory Theatre, San Francisco Playhouse, Annex Theatre in Seattle, and About Face in Chicago. They are a Stranger Award Genius Nominee and Gregory Award Outstanding New Play Nominee. They are a former Jerome Fellow at the Playwrights’ Center, an alumna of Seattle Repertory Theatre’s Writers Group, and former Walter E. Dakin Fellow at Sewanee Writers’ Conference. Their essay “S(wallow)” won the Editor’s Prize at Porter House Review and they were a Creative Nonfiction Fellow at Lambda Literary. They received an MFA in Playwriting from University of Iowa’s Playwrights Workshop. When they’re not managing venues for Rooftop, they teach writing at City College of New York. Madeline Chandler, Volunteer and Local Partnerships Coordinator Madeline (she/her) does not stop talking about being from Pittsburgh, doing her undergrad at Penn State, and doing her post-grad degrees at the University of Glasgow in Scotland. If you ever want to talk about coffee, hippos or other round animals, ice breakers, or why teen movies are misunderstood, Madeline’s your girl! Tess Meersman, Festival Assistant Tess (she/her) is a filmmaker and artist who began working for Rooftop Films in 2024 after graduating from Emerson College with a degree in Film Production and double minor in Gender & Sexuality Studies and Literature. Her work has been featured in the GRRL HAUS Cinema screening series, Revolutions per Minute festival, Huret & Spector Gallery, Karen Aqua Gallery, and the Gravitational Lensing film series. When not at work, you can find her rewatching The X Files or making a collage with her beautiful cat, Hitch. BOARD OF DIRECTORS Mark Elijah Rosenberg, Chair Filmmaker, Founder and Former Artistic Director of Rooftop Films Sara Christoph, Vice Chair Business Development Manager, Morgan Stanley Ryan Smith, Treasurer Managing Director, Piper Sandler Camille Bernier-Green Head of Development, A Touch More Jamie Dennison Hayden Goldblatt Jess Jacobs Kay-B Entertainment Journalist/Critic/Producer/Host Adam Kersh Co-Founder, Fusion Management Eric Kohn Evan List Vice President & Client Advisor, Bernstein Global Wealth Management Rachel Meierovich Molly Thompson Join Our Newsletter Get early access to screenings & more Rooftop Films 232 3rd St. Suite E-106 Brooklyn, NY 11215 info@rooftopfilms.com 718-417-7362 A/V Equipment Rentals rentals@rooftopfilms.com 347-725-3874 Start Your Rental Request Follow Rooftop Films Instagram @rooftopfilms X/Twitter @rooftopfilms Facebook @rooftopfilmsinc Newsletter © 2025 Rooftop Films Term of Use Privacy We use cookies to improve your experience. By continuing to use our site, you accept our use of cookies. OK"
    },
    {
      "url": "https://thevendry.com/venue/282679/nube-rooftop-fort-lauderdale-fl",
      "text": "Nubé Rooftop - Cocktail Bar Restaurant in Fort Lauderdale, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels Nubé Rooftop Restaurant 505 N Fort Lauderdale Beach Blvd, Fort Lauderdale, FL 33304, USA Nubé Rooftop 505 N Fort Lauderdale Beach Blvd, Fort Lauderdale, FL 33304, USA Visit Website View Phone Number Instagram Cuisine Type Cocktail Bar # of Spaces 1 Capacity Max Seated: 240 Where the sky's embrace meets ocean's gaze, atop the 26th floor of Hilton Fort Lauderdale Beach Resort, Nubé offers panoramic views and an innovative menu inspired by its surroundings. The atmosphere seamlessly blends lounge vibes with elevated dining, creating a unique 'lounge-aurant' experience. Our rooftop provides both indoor and outdoor seating options, featuring a wraparound glass balcony and walls that vanish into the breathtaking ocean views.\n\nAs sunset hues fade to starry nights, sit seaside on the sky terrace, enjoy an intimate setting at the Solstice Bar and Lounge, and embrace the sky-high energy at the Lunar Bar, where the outside melds seamlessly with the inside. Our whimsical menu of crafted cocktails reflects a coastal flair, accompanied by chef-curated shareable plates that embody a blend of luxury and approachability, offering a Contemporary American & South Florida Coastal dining experience. Show more Show more Visit Website View Phone Number Instagram 505 North Fort Lauderdale Beach Boulevard, Fort Lauderdale, FL Show on the map Spaces Full Buyout of Nubé Rooftop Max Seated: 240 Full Buyout of Nubé Rooftop Max Seated: 240 Press Wanderlog The 23 Best Rooftop Bars In Fort Lauderdale Oct 21, 2024 WSVN Hilton’s Nubé Rooftop on Fort Lauderdale Beach provides breathtaking views, signature cocktails and bites Apr 27, 2024 Miami New Times Oceanfront Rooftop Bar Nubé Opens on Fort Lauderdale Beach Apr 16, 2024 Sun Sentinel New rooftop bars offer spectacular vistas, swanky vibes & strong cocktails Apr 12, 2024 Wanderlog The 23 Best Rooftop Bars In Fort Lauderdale Oct 21, 2024 WSVN Hilton’s Nubé Rooftop on Fort Lauderdale Beach provides breathtaking views, signature cocktails and bites Apr 27, 2024 Miami New Times Oceanfront Rooftop Bar Nubé Opens on Fort Lauderdale Beach Apr 16, 2024 Sun Sentinel New rooftop bars offer spectacular vistas, swanky vibes & strong cocktails Apr 12, 2024 The Business Journals 10 Openings: Peruvian restaurant launches, plus rooftop hotspot and more - South Florida Business Journal Mar 28, 2024 Show more Do you work for Nubé Rooftop ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Fort Lauderdale for Your Event Fort Lauderdale Restaurants Fort Lauderdale Hotels Fort Lauderdale Performance Spaces Fort Lauderdale Boats / Yachts Fort Lauderdale Stadiums Fort Lauderdale Event Spaces Fort Lauderdale Museums / Galleries Fort Lauderdale Bars / Clubs Fort Lauderdale Breweries / Distilleries Fort Lauderdale Private Clubs Fort Lauderdale Convention Centers Fort Lauderdale Coworking Spaces Fort Lauderdale Golf Courses Fort Lauderdale Cultural Centers Fort Lauderdale Restaurants Fort Lauderdale Hotels Fort Lauderdale Performance Spaces Fort Lauderdale Boats / Yachts Fort Lauderdale Stadiums Fort Lauderdale Event Spaces Fort Lauderdale Museums / Galleries Fort Lauderdale Bars / Clubs Fort Lauderdale Breweries / Distilleries Fort Lauderdale Private Clubs Fort Lauderdale Convention Centers Fort Lauderdale Coworking Spaces Fort Lauderdale Golf Courses Fort Lauderdale Cultural Centers"
    },
    {
      "url": "https://www.nuvole22.com/about",
      "text": "About Us — Nuvole TwentyTwo Rooftop Home Menu Cocktails Spirits Private Events Weddings & Proposals Let's Connect Home Menu Cocktails Spirits Private Events Weddings & Proposals Let's Connect Home Menu Cocktails Spirits Private Events Weddings & Proposals Let's Connect Home Menu Cocktails Spirits Private Events Weddings & Proposals Let's Connect Get Your Head in the Clouds 22 STORIES INTO THE SKYLINE, YOU’LL FIND CHARLOTTE’S HIGHEST INDOOR-OUTDOOR ROOFTOP LOUNGE OFFERING CRAFT COCKTAILS, SMALL PLATES & PANORAMIC VIEWS OF THE QUEEN CITY. HOURS OF OPERATION We are currently closed for renovations. RESERVATIONS Walk-ins are welcome! Out of respect for other guests, balloons, decorations, professional photography equipment, and lighting rigs are prohibited. Ages 21+ only. Nuvole Rooftop TwentyTwo 220 E. Trade Street, Suite 2200, Charlotte, NC, 28202, USA gm@nuvole22.com Hours NUVOLE ROOFTOP TWENTYTWO 220 E. Trade Street, Suite 2200 Charlotte, NC 28202 HOURS OF OPEATION Monday — Thursday 5pm — 11pm Friday & Saturday 5pm — 1am Sunday Closed"
    },
    {
      "url": "https://www.therooftopguide.com/rooftop-bars-in-fort-lauderdale/nube-rooftop.html",
      "text": "NubÃ© Rooftop - Rooftop bar in Fort Lauderdale | The Rooftop Guide Rooftop Bars Europe North America Central America & Caribbean South America Asia Middle East Oceania Africa Rooftop Pools Inspiration Sign up North America Rooftop bars in Fort Lauderdale Fort Lauderdale rooftop bar NubÃ© Rooftop $ $ $ $ $ 26th floor Central Beach Images belong to the bar Last updated: April 19, 2024 NubÃ© Rooftop Rooftop Bar in Fort Lauderdale Panoramic over ocean & skyline Contemporary American Year round No Overview A unique and elevated 'lounge-aurant' experience, featuring panoramic views and an innovative menu. Floating on top of Hilton Fort Lauderdale Beach Resort in Central Beach, NubÃ© is the only oceanfront rooftop in Fort Lauderdale. 26 floor above it all, where the sky meets the ocean, the stylish and modern rooftop seamlessly melds indoor and outdoor seating options, featuring a wraparound glass balcony and walls that vanish into breathtaking views over the ocean and skyline. Inspired by its surroundings, the NubÃ© menu features a whimsical selection of crafted cocktails that reflects a coastal flair, as well as a fine array of wines, accompanied by chef-curated shareable plates that embody a blend of luxury and approachability, offering a Contemporary American & South Florida Coastal dining experience. Blending lounge vibes with elevated dining to create a unique 'lounge-aurant' experience, you can visit for intimate bites and drinks on the sky terrace and watch as sunset hues fade to starry nights, or embrace the sky-high energy inside. Watch Location & Map 505 N Fort Lauderdale Beach Blvd 26th floor, Fort Lauderdale, FL 33304 Contact +1 954-525-6823 info@nuberooftop.com Visit website Facebook Instagram Opening Hours Monday: Closed Tuesday: Closed Wednesday: 16.00 - 00.00 Thursday: 16.00 - 00.00 Friday: 16.00 - 02.00 Saturday: 16.00 - 02.00 Sunday: 16.00 - 00.00 FAQ What is the NubÃ© Rooftop dress code? The NubÃ© Rooftop dress code is smart casual. What food does NubÃ© Rooftop serve? NubÃ© Rooftop serves chef-curated shareable plates that embody a blend of luxury and approachability, offering a Contemporary American & South Florida Coastal dining experience. Rating By: Rikard Fredricson Rikard has spent the last 10 years exploring, enjoying, researching and working with rooftop venues. During these years he has visited more than 700 rooftops across the globe. The experience he has gained is used to create helpful, in-depth and accessible content, and to share his knowledge and rooftop expertise with fellow rooftop-lovers. Hot Read Elevated swims Dive into the best rooftop pools around the globe Dazzling heights Head sky-high and explore the tallest rooftop bars in the world Explore Browse all the cities & articles at The Rooftop Guide Follow The Rooftop Guide More rooftop bars in Fort Lauderdale Rooftop @1WLO Elevated above Fort Lauderdaleâs renowned Las Olas Boulevard and the New River, the Rooftop @1WLO brings a large slice of cosmopolitan vibes to the heart of downtown. Dressed as a garden in the sky, the spacious and trendy rooftop... Sparrow Perched on top of The Dalmar Hotel in downtown Fort Lauderdale, Sparrow is a chic and trendy rooftop cocktail lounge offering retro vibes and urban views. Half inside and half outside, at the colorful and coastal outdoor... The Easton Rooftop Pool & Lounge A new addition to the FTL rooftop scene, offering the best of elevated poolside vibes. Found on top of the Courtyard by Marriott in downtown, the spacious rooftop comes with both a lovely pool deck... View All You may also like Article 10 best rooftop bars for a beautiful sunset Article 7 proven tips for the ultimate rooftop experience Article Swim at the best rooftop pools in the world Article 9 amazing hotels with rooftop bar Complete guide 56 best rooftop bars New York Complete guide 23 best rooftop bars Miami Complete guide 8 best rooftop bars Orlando Complete guide 29 best rooftop bars Los Angeles Collaboration Timeless watches for timeless views Everything is better with a nice view! Explore Top 10 Popular cities Book your hotel Features Swedish version Follow Facebook Instagram YouTube TikTok Pinterest Snapchat X LinkedIn Threads Newsletter Business About us Collaborate with us Contact us Collaborations Legal Privacy Policy © Copyright 2015-2025 | by therooftopguide.com | All Rights Reserved."
    },
    {
      "url": "https://www.rooftopgroup.org/about/about-us/leadership",
      "text": "Leadership | Rooftop Housing Group Resident access Contact us Rooftop logo click to go home Manage your home MyRooftop With the Rooftop Portal and the MyRooftop App, you can see your rent balance, make payments, contact the Neighbourhood Team, and more! Access the portal Portal guidance Your Home Access the MyRooftop portal MyRooftop portal guidance Keeping you safe Request a repair Emergency repairs Alterations and improvements Aids and adaptations Planned works Report or Request Your Safety Damp, mould and condensation Gas and carbon monoxide Legionella Asbestos Fire safety Your Tenancy Moving in Moving out Your rent Leaseholders Service charges Tenancy fraud Insurance Garages Your Community Customer handbook Customer service standards Your Neighbourhood Housing Officers Anti-social behaviour Estate services Find a home About our homes We are proud to have 7,000 homes in South Worcestershire and North Gloucestershire making some vibrant communities. Find a home Building great homes Buying a home Search available properties Shared ownership guidance View our previous developments Building great homes Renting a home Search available properties Apply for a property Mutual exchange More housing and support Key worker accommodation Retirement and housing with care Gypsy and Traveller accommodation Homes for Veterans Advice and support MyRooftop With the Rooftop Portal and the MyRooftop App, you can see your rent balance, make payments, contact the Neighbourhood Team, and more! Access the portal Portal guidance Money Money advice Budget and benefits calculator Employment Job advice Recent case studies Home and life Domestic abuse Shared Ownership Complaints guide Make a complaint Anti-social behaviour MyRooftop Portal Access MyRooftop portal MyRooftop portal guidance About Us Who we are Rooftop is a local housing association which exists to meet housing need in the communities of South Worcestershire and North Gloucestershire. We are driven by our values, and close to our customer. Read more About us Our purpose and values Delivering value for money Meet the Executive Team Governance and the board Within our communities Customer engagement Community Fund Customer Scrutiny Panel Reports and policies Reports Policies Strategies Latest board minutes Access to information Complaints guide Make a complaint Anti-slavery and human trafficking statement Privacy statement Great place to work Contact the HR team If you're interested in working for Rooftop or supporting our work by becoming a volunteer, we'd love to hear from you. Get in touch A great place to work Rewards and benefits Equality, Diversity and Inclusion Contact the HR team Join our team Browse current vacancies Make a difference Volunteer with us News Leadership We provide good quality homes and reliable landlord services. Our Business Housing associations (also called Registered Providers) are governed by their ârulesâ which define our not-for-profit objectives, shareholding membership and constitute the Board as our governing body. Board members have a wide range of skills and experience reflecting the services we provide, our customers and the size and financial complexity and strength of the business. Each association has a Board but the members combine their functions through a single governance meeting that is held six times during the year. In addition, the board members attend regular seminars, business planning and formal events. The Boards are committed to high standards of corporate governance and have adopted the National Housing Federationâs âCode of Governance' and good practice guidance. Meet the executive team Boris Worrall Group Chief Executive Read more Boris Worrall Group Chief Executive Boris is Group Chief Executive of Rooftop Housing, which provides almost 7,000 affordable homes in Worcestershire and Gloucestershire. Boris has been involved in housing for 15 years and is a regular blogger on policy, politics and business transformation. He began his career as a journalist before working for the Home Office. Boris is responsible for: Building strong working relationships with internal and external stakeholders to ensure the delivery of the highest possible standard of service to our tenants and other customers. Maintaining high standards of probity and develop an open and honest culture in line with the Groupâs Values, codes of governance, Colleague Code of Conduct and Probity Policy. Leading a strong, distinctive performance culture and commitment to service excellence with a focus on enhancing customer experience through the âmaking a differenceâ ways of working. Fostering an environment where the views of residents are integral to service development and where best practice is routinely identified, shared and implemented. Ensuring strong relationships with resident groups, representatives, and advocates to provide assurance that the community ethos of the organisation is championed. Ensuring that value for money is demonstrated in all aspects of service delivery and provide information to the Board to enable them to monitor this. Representing Rooftop as required, acting as an ambassador to enhance recognition as the pre-eminent provider of excellent housing and related services across the region. In conjunction with the Chair, ensure the governance of the organisation is effective and members are developed and supported to fulfil their roles. Provide appropriate and timely information and develop an open and transparent dialogue. Ensure an appropriate control and assurance framework is in place to meet statutory, regulatory and financial requirements in order to manage risks to Rooftop. In his spare time Boris enjoys surfing, yoga and keeping chickens. LinkedIn Twitter linked Mark McEgan Executive Director - Operations Read more Mark McEgan Executive Director - Operations Mark joined Rooftop in 2024 and is passionate about making sure we provide the best services we possibly can for our customers. Â He has worked in social housing for over 25 years and has a track record of transforming housing services in the north and south of England. Mark is a fellow of the Chartered Institute of Housing and has an MBA from Durham University with particular interests in change management and organisational development. He has worked in Local Government, Arms-Length Management Organisation and housing association settings. Mark is responsible for: Developing the strategic priorities and annual business plans for housing management, responsive repairs, income collection, lettings, and supported housing including preparation and control of departmental budgets. All operational elements of neighbourhood management, facilities, day to day responsive repairs and maintenance services working effectively with our Cost Sharing Group partner. Planning and delivering cost effective housing management and support services both to tenants and community customers, delivering a comprehensive range of services to meet needs. Devising, recommending, and implementing an effective and efficient responsive repairs service, that supports high level customer satisfaction meets customer needs and budgetary requirements. Delivering effective, efficient, and timely Voids properties in a reasonable condition so that they are ready to let and meet customer expectations. Corporate responsibility for the resolution, reporting and oversight of complaints management and compliance with the Housing Ombudsmanâs compliant handling code. Â Acting as the âresponsible personâ who will ensure that we are complying with the Consumer Standards. Â Ensuring effective Customer Scrutiny and engagement/influence in service scrutiny and continual improvement. Ensuring the delivery of rent and service charges in line with Statutory and Regulatory requirements and Rooftopâs policy. Ensuring the provision of advice, support, and signposting to support customers and protect Rooftopâs income from rent and service charges. Away from work, Mark likes to spend time with his wife and children, enjoys travelling and running. â â LinkedIn Twitter linked Rebecca Pitt Executive Director - Investment Read more Rebecca Pitt Executive Director - Investment Rebecca is responsible for: Developing the strategic priorities and annual business plans for development, regeneration, land, planned investment, health and safety, homeownership, sales and marketing and environmental sustainability including preparation and control of departmental budgets. Ensuring that all activities within the Directorate comply with the standards expected of the Regulator of Social Housing and Homes England. Leading on Strategic Asset Management for the Group, responsible for asset investment and divestment, including disposals. Leading on the development, implementation, and monitoring of Rooftopâs Environmental Sustainability Strategy, including responsibility for securing grant funding and ensuring all homes are Band C by 2030. All operational elements of Landlord Health & Safety compliance and the provision of reporting and assurance to the Executive Team and Board. Acting as the Accountable Person,Â for the Building Safety Bill, for each higher [1] risk building to produce and working with the Operations Directorate to develop and implement a resident engagement strategy to promote the participation of tenants and leaseholders in decisions that are made about building safety risks in their building. Corporate responsibility for the monitoring, reporting and oversight of all Health and Housing Safety Rating System (HHSRS)issues, including support and challenge to ensure compliance is achieved. â LinkedIn Twitter linked Sam Morgan Executive Director - Resources Read more Sam Morgan Executive Director - Resources Sam joined Rooftop in 2017, having worked at a senior level in Finance for over 10 years, and is a member of the Chartered Institute of Public Finance and Accountancy (CIPFA). Sam has responsibility for Finance, Human Resources, Governance, Risk and Assurance, Communications, ICT and Performance. This includes developing a Housing Management System to improve access to our services for customers, and a new Finance System to help modernise the business. Sam is responsible for all funding which enables us to deliver our exciting development programme and new homes. She also works to deliver our Target Operating Model with a particular focus on finding ways to work more efficiently and how to simplify the business. Sam is responsible for: Developing and implementing a treasury management strategy based on the 40-year financial business plan, which is agreed with the Board and the Executive Team, and which directs the Groupâs resources in a cost effective and efficient manner and incorporates the setting and monitoring of annual budgets and performance targets. Managing negotiations and relationships with the Groupâs funders and seeking to negotiate funding on the most competitive and flexible terms commensurate with risk. Liaising with statutory and internal or other auditors to ensure that an effective and independent audit of the Groupâs activities is carried out to give the boards and audit and risk committee assurance on the effectiveness of internal controls. Developing and implementing a Value for Money strategy to deliver the Groupâs objectives as efficiently and effectively as possible. Ensuring that all statutory and financial regulatory documents are filed on time. Ensuring that there is effective management and maintenance of all performance reporting including KPI reporting, sector scorecard, benchmarking, and other requested items. Developing, monitoring, and maintaining a risk management framework and policy, which embraces best practice, to assist Rooftop in integrating risk management into all significant activities and functions across the organisation. Developing and implementing an ICT and Digital strategy for the Group and ensuring that appropriate ICT systems and services are in place to enable the Group to operate efficiently. Developing and implementing a Data strategy to maximise the use of data based on best practice and remain fully compliant with all data regulation. Developing, implementing and maintaining the People Strategy, that engages and develops individuals and teams, facilitating and enabling high performance and high engagement. Developing and delivering a comprehensive Communications (including marketing) Strategy, maximising the use of digitalisation. In her spare time, Sam enjoys reading and walking with her two dogs. LinkedIn Twitter linked What Rooftop means to me \"Rooftop doesn't just provide housing for the elderly, it is also a community of kind, empathetic and generous people who truly care about the wellbeing of others.\" Juita Rooftop Support Worker By clicking âAcceptâ, you agree to the storing of cookies on your device to enhance site navigation, analyse site usage, and assist in our marketing efforts. View our Cookie Policy for more information. View Preferences to choose specific cookie groups. Deny Accept Privacy Preferences Essential cookies Required Marketing cookies Essential Personalization cookies Essential Analytics cookies Essential Reject all cookies Allow all cookies Save preferences MyRooftopPortal Contact us Send us feedback Find a home Work for us News Subscribe to our newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. By subscribing you agree to with our Privacy Policy and provide consent to receive updates from our company. Â© 2022 Rooftop Housing Group. All right reserved. Crafted by Lines Privacy Statement Terms and Conditions Access to Information Cookies Policy Accessibility Statement Facebook Instagram Twitter LinkedIn Youtube"
    },
    {
      "url": "https://rooftopapp.com/contact",
      "text": "Contact Us | Rooftop Artworks Courses Shop Artists Art Wiki Activities Blog B2B Corporates Educational Institutes Governments Museums & Art Galleries 0 Your Cart Close Loading... Contact Us Home Contact Us Email Here connect@rooftopapp.com Address Mumbai : Building No 28, 3rd Floor, Raj Bahadur Mansion, Mumbai Samachar Marg, opp. Allahabad Bank, Kala Ghoda, Fort, Mumbai, Maharashtra 400023 Jaipur : N-98, Basement Office, Opp N-71 Rooms, opp. WTP Mall, Adinath Nagar, Jaipur, Rajasthan 302018 Call Here +91 982 843 0980 Get in touch Mumbai : Building No 28, 3rd Floor, Raj Bahadur Mansion, Mumbai Samachar Marg, opp. Allahabad Bank, Kala Ghoda, Fort, Mumbai, Maharashtra 400023 Jaipur : N-98, Basement Office, Opp N-71 Rooms, opp. WTP Mall, Adinath Nagar, Jaipur, Rajasthan 302018 +919828430980 connect@rooftopapp.com Support FAQ's Privacy Policy Terms & Conditions Cancellation Policy Useful Link About Contact Team Rooftop for Corporates The Circle Archive Sitemap Made with ❤️ at Rooftop Chat with us!"
    }
  ]
}