{
  "fuentes": [
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "dave.paul@skagit.edu"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "river.powers@edwardjones.com"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "tmendiola@regency-pacific.com"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "brittney.shigley@heritagebank.com"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "director@oakharbormainstreet.com"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "info@oakharborchamber.com"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "jeff@skinnerlaw.net"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "jjjensen@soundsportsnet.com"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "maguilar@oakharbor.org"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "marcia.fakkema@heritagebanknw.com"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "marketing@whidbeytechsolutions.com"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "michael.welding@navy.mil"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "reception@ohsd.net"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "rmueller@servmart.org"
    },
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "email": "robert_sanders89@yahoo.com"
    },
    {
      "url": "https://business.oakharborchamber.com/contact/",
      "email": "info@oakharborchamber.com"
    },
    {
      "url": "https://www.grandharborproperties.com/",
      "email": "info@alexmacwilliam.com"
    },
    {
      "url": "https://www.oakharborchamber.com/",
      "email": "info@oakharborchamber.com"
    },
    {
      "url": "https://oakharborverobeach.com/resales/",
      "email": "oakharbor@sorensenrealestate.com"
    },
    {
      "url": "https://oakharborverobeach.com/resales/",
      "email": "kjones@oakharborfl.com"
    },
    {
      "url": "https://oakharborverobeach.com/",
      "email": "oakharbor@sorensenrealestate.com"
    },
    {
      "url": "https://oakharborverobeach.com/",
      "email": "kjones@oakharborfl.com"
    },
    {
      "url": "https://oakharborverobeach.com/gallery/",
      "email": "oakharbor@sorensenrealestate.com"
    },
    {
      "url": "https://oakharborverobeach.com/gallery/",
      "email": "kjones@oakharborfl.com"
    },
    {
      "url": "https://www.grandharborproperties.com/oak-harbor/",
      "email": "info@alexmacwilliam.com"
    },
    {
      "url": "https://oak-harbor-freight-lines.pissedconsumer.com/customer-service.html",
      "email": "custsvc@oakh.com"
    },
    {
      "url": "https://clearharboram.com/who-we-are/meet-the-team",
      "email": "icon-20@2x.png"
    },
    {
      "url": "https://clearharboram.com/who-we-are/meet-the-team",
      "email": "info@clearharboram.com"
    },
    {
      "url": "https://oakharborcapital.com/team/",
      "email": "info@oakharborcapital.com"
    },
    {
      "url": "https://www.oakharborchamber.com/about-us/",
      "email": "info@oakharborchamber.com"
    },
    {
      "url": "https://welcomehomeoakharbor.com/about-us/",
      "email": "info@welcomehomeoakharbor.com"
    },
    {
      "url": "https://oakharborverobeach.com/home-health-services/",
      "email": "oakharbor@sorensenrealestate.com"
    },
    {
      "url": "https://oakharborverobeach.com/home-health-services/",
      "email": "kjones@oakharborfl.com"
    }
  ],
  "mails": [
    "brittney.shigley@heritagebank.com",
    "custsvc@oakh.com",
    "dave.paul@skagit.edu",
    "director@oakharbormainstreet.com",
    "icon-20@2x.png",
    "info@alexmacwilliam.com",
    "info@clearharboram.com",
    "info@oakharborcapital.com",
    "info@oakharborchamber.com",
    "info@welcomehomeoakharbor.com",
    "jeff@skinnerlaw.net",
    "jjjensen@soundsportsnet.com",
    "kjones@oakharborfl.com",
    "maguilar@oakharbor.org",
    "marcia.fakkema@heritagebanknw.com",
    "marketing@whidbeytechsolutions.com",
    "michael.welding@navy.mil",
    "oakharbor@sorensenrealestate.com",
    "reception@ohsd.net",
    "river.powers@edwardjones.com",
    "rmueller@servmart.org",
    "robert_sanders89@yahoo.com",
    "tmendiola@regency-pacific.com"
  ],
  "nombre_sitio": "oakharborverobeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.oakharborchamber.com/board-of-directors/",
      "text": "Board of Directors - Oak Harbor Chamber of Commerce Skip to content Menu HOME RELOCATING Moving to Whidbey Island Retiring on Whidbey Island MILITARY SUPPORT Oak Harbor Military Affairs Committee Military Relocation EVENTS Calendar 2025 Monthly Luncheons Business Community After Hours Whidbey Island Culture Fest Independence Day Celebration Whidbey Wags 5th Annual Collaborative Golf Tournament Military Appreciation Picnic 2025 Awards Banquet New Yearâs Eve Fireworks VISIT WHIDBEY ISLAND Discover Oak Harbor Visitor Information Center Vacation on Whidbey Where To Go, What To Do Filming and Photography in Island County CHAMBER MEMBERS Member Login Join the Chamber Today Business Directory Become a Chamber Ambassador Volunteer ABOUT US Contact Us About Us Oak Harbor Chamber of Commerce Staff Board of Directors Job Postings Board of Directors EXECUTIVE BOARD PRESIDENT Selene Muldowney-Stratton Island Transit Phone: (360) 678 - 7771 Email: selenemuldowney@gmail.com VICE PRESIDENT Marcia Fakkema Whidbey Island Bank Phone: (360) 240 - 5144 Email: marcia.fakkema@heritagebanknw.com Treasurer Brittney Shigley Whidbey Island Bank Phone: (360) 679 - 0108 Email: brittney.shigley@heritagebank.com Secretary Teri Mendiola Regency on Whidbey Phone: (360) 279 - 0933 Email: TMendiola@regency-pacific.com Skip Grehan U.S Navy Phone: (360) 257 - 0372 Email: skip.grehan.bod@gmail.com Joshua Blackmer Whidbey Tech Solutions Phone: (360) 639 - 8715 Email: marketing@whidbeytechsolutions.com Robert Sanders Boyâs and Girlâs Club of Oak Harbor Phone: (360) 632 - 8722 Email: robert_sanders89@yahoo.com Jon JJ Jensen Sound Sports Net Phone: (206) 856 - 5060 Email: jjjensen@soundsportsnet.com Rich Mueller SERVMART Phone: (360) 240 - 8649 Email: Â rmueller@servmart.org River Powers Edward Jones; Whidbey Royalty Phone: (360) 929 - 2097 Email: River.powers@edwardjones.com James P. Marrow Non-Voting Board Member Phone: (206) 465 - 4634 Email: james.marrow737@gmail.com Community Liaisons Sarah Foy Oak Harbor School District Phone: (360) 279 - 5008 Email: reception@ohsd.net Mike Welding, Ex Officio NASWI, Public Affairs Phone: (360) 257 - 2962 Email: michael.welding@navy.mil Magi Aguilar Communications Officer Phone: (360) 279 - 4501 Email: maguilar@oakharbor.org Cheryl Grehan Oak Harbor Main Street Association ED Phone: (360) 279 - 8995 Email: director@oakharbormainstreet.com Jeff Waller Law Offices of Waller & Waller Phone: (360) 679 - 1240 Email: jeff@skinnerlaw.net Dave Paul Skagit Valley College, Whidbey Island Phone: Email: Dave.paul@skagit.edu © 2025 Oak Harbor Chamber of Commerce | Site by GrowthZone Contact Us phone 360-675-3755 location 32630 SR 20, Oak Harbor, WA 98277 email Email US Members Member Login Member Directory Application to Join Jobs Hours Mon - Fri 9am - 5pm CONNECT Facebook Instagram © 2025 Oak Harbor Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://business.oakharborchamber.com/contact/",
      "text": "Contact Us Skip to content Menu HOME RELOCATING Moving to Whidbey Island Retiring on Whidbey Island MILITARY SUPPORT Oak Harbor Military Affairs Committee Military Relocation EVENTS Calendar 2025 Monthly Luncheons Business Community After Hours Whidbey Island Culture Fest Independence Day Celebration Whidbey Wags 5th Annual Collaborative Golf Tournament Military Appreciation Picnic 2025 Awards Banquet New Year’s Eve Fireworks VISIT WHIDBEY ISLAND Discover Oak Harbor Visitor Information Center Vacation on Whidbey Where To Go, What To Do Filming and Photography in Island County CHAMBER MEMBERS Member Login Join the Chamber Today Business Directory Become a Chamber Ambassador Volunteer ABOUT US Contact Us About Us Oak Harbor Chamber of Commerce Staff Board of Directors Job Postings Contact Us Send us your questions or comments using the form below. We will respond promptly to your inquiry. Contact Information * Required field Name * Looks good! Please add your name. Organization Mailing Address * Looks good! Please add your mailing address. Mailing Address line 2 City * Looks good! Please add your City State * Looks good! Please add your State Postal Code * Looks good! Please add your Postal Code Country * Choose... Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Bulgaria Cambodia Cameroon Canada Caribbean Chile China Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czechia Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Ghana Greece Greenland Guatemala Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Laos Latin America Latvia Liechtenstein Lithuania Luxembourg Macao SAR Macedonia, FYRO Malaysia Maldives Mali Malta Mexico Moldova Monaco Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa South Sudan Spain Sri Lanka Sweden Switzerland Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Türkiye Turkmenistan Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Venezuela Vietnam World Yemen Looks good! Please add your country. Phone * Looks good! Please add your phone number. Email * Looks good! Please add a valid email. Leave Blank Contact Preference * Choose... Phone Email Mail Looks good! Please select a contact preference. Comments/Questions Release this information The Oak Harbor Chamber of Commerce will not sell your contact or email information. In order to serve your request, our office shares information with chamber member businesses who can provide you with additional information. Please indicate below if we may share your request for information: Yes, you may release this information. No, please do not release this information. Captcha Validation Please complete the Captcha Submit form Oak Harbor Chamber of Commerce 32630 State Route 20 Oak Harbor , WA 98277 (360) 675-3755 Fax: (360) 679-1624 info@oakharborchamber.com © 2025 Oak Harbor Chamber of Commerce | Site by GrowthZone Contact Us phone 360-675-3755 location 32630 SR 20, Oak Harbor, WA 98277 email Email US Members Member Login Member Directory Application to Join Jobs Hours Mon - Fri 9am - 5pm CONNECT Facebook Instagram © 2025 Oak Harbor Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.grandharborproperties.com/",
      "text": "Home, Grand Harbor, Oak Harbor, Vero Beach, FL Real Estate - Alex MacWilliam, Inc., Realtor Menu https://www.youtube.com/c/AlexMacWilliamIncVeroBeach/videos Follow us on Instagram Follow Us On Facebok Email Us Call Us Email Us Translate this page Afrikaans Albanian Amharic Arabic Armenian Azeerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Burmese Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scots Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sundanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Email Us Translate this page Afrikaans Albanian Amharic Arabic Armenian Azeerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Burmese Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scots Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sundanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu 772-231-6509 Facebook YouTube Instagram Home Available Properties Grand Harbor/Oak Harbor Under $500K Grand Harbor/Oak Harbor $501K-$1Million Grand Harbor/Oak Harbor Over $1 Million Grand Harbor Marina Amenities Neighborhood Map Oak Harbor Neighborhood Map ABOUT AMAC NEIGHBORHOOD EXPERTS Contact Us Menu 772-231-6509 Facebook YouTube Instagram Grand Harbor Real Estate in Vero Beach SEARCH NOW Welcome to Grand Harbor Located on the western banks of the Indian River/Intracoastal Waterway, Grand Harbor is a Certified Audubon Community International Sanctuary and Vero's only mainland community that offers a full amenity package and a \"Grand Lifestyle.\" Five-star amenities are extensive including two Joe Lee and Pete Dye championship golf courses, a 32,000 square foot grandiose Mediterranean clubhouse with four diverse venues for dinning, 161-slip protected deep water marine, tennis center with 10 Har-Tru courts, 2 stadium courts, pickle ball courts, 3 bocce ball courts, a modern fitness center, and a jam-packed social calendar. Also just a 10-minute drive from Grand Harbor neighborhoods is the private, staffed, oceanfront Beach Club with amenities that include an oceanfront swimming pool, beach cabanas, and oceanfront dining. Grand Harbor offers many monthly social events which include theme parties, dinner shows, golf invitational, tennis exhibitions, and all kinds of special interest clubs. Plus volunteerism via our \"Community Outreach\" is a common thread weaving through the heart of the community, The real estate choices are just as numerous with 1-, 2-, 3-, or 4- bedroom single family homes, estate homes, condominiums, duplexes, or villas in every style, size and price range located on the golf course, on the water, at the marina, or along the Indian River. UNDER $500K $501K - $1 MILL OVER $1 MILLION UNDER $500,000 UNDER $500,000 $501,000 - $1,000,000 $501,000 - $1,000,000 OVER $1,000,000 Over $1,000,000 For more information on our partners click on the logos below: For more information on our partners click on the logos below: AMAC Alex MacWilliam Real Estate 2901 Ocean Drive Vero Beach, FL 32963 Phone: (772) 231-6509 Fax: (772) 234-8126 E-mail: info@alexmacwilliam.com © 2024  AMAC Alex MacWilliam Real Estate Privacy Policy License# CQ224137 Equal Housing Opportunity. This material is based on information which we consider reliable, but because it has been supplied by third parties, we cannot represent that it is accurate or complete and should not be relied on as such. This offering is subject to errors, omissions, change of price or withdrawal without notice. Grand Harbor is a registered service mark of GHA Grand Harbor, LTD., and GHA Development, Inc. a Florida Corporation. Search Close"
    },
    {
      "url": "https://www.oakharborchamber.com/",
      "text": "Home Page - Oak Harbor Chamber of Commerce Skip to content Menu HOME RELOCATING Moving to Whidbey Island Retiring on Whidbey Island MILITARY SUPPORT Oak Harbor Military Affairs Committee Military Relocation EVENTS Calendar 2025 Monthly Luncheons Business Community After Hours Whidbey Island Culture Fest Independence Day Celebration Whidbey Wags 5th Annual Collaborative Golf Tournament Military Appreciation Picnic 2025 Awards Banquet New Year’s Eve Fireworks VISIT WHIDBEY ISLAND Discover Oak Harbor Visitor Information Center Vacation on Whidbey Where To Go, What To Do Filming and Photography in Island County CHAMBER MEMBERS Member Login Join the Chamber Today Business Directory Become a Chamber Ambassador Volunteer ABOUT US Contact Us About Us Oak Harbor Chamber of Commerce Staff Board of Directors Job Postings Popular Links SEPTEMBER LUNCHEON 2025 CHAMBER BANQUET MORE EVENTS Our Mission Founded in 1946 as a nonprofit, the Greater Oak Harbor Chamber of Commerce has long been dedicated to supporting both community and business growth. Throughout the years, it has focused on promoting civic engagement and creating opportunities for Oak Harbor residents to come together in celebration and advocacy. Today, this legacy of service continues, fueled by the passion and commitment of the Chamber’s Board, Staff, Ambassadors, and Volunteers. Together, they work tirelessly to strengthen the community, ensuring Oak Harbor remains a vibrant, connected, and welcoming place for everyone. Become a Chamber Member 464 Members 13.7K Facebook Followers 1.5k Instagram Followers 1.4k E-News Subscribers (360) 679 - 4003 www.seatacshuttle.com (360) 679 - 4003 www.seatacshuttle.com (360) 679 - 4003 www.seatacshuttle.com PHONE:  (360) 679 - 4003   |  WEB: www.seatacshuttle.com Explore our calendar to discover exciting events and happenings in our community! Event Calendar Thank you to our gold and platinum sponsors Cascade Custom Homes & Design, Inc. Diamond Rentals Regency on Whidbey Sound Sports Net The Boeing Company Three Men and A Mower, LLC Whidbey Coffee Whidbey SeaTac Shuttle & Charter EcoView Windows & Doors KBRC & KAPS UELLC (Ulrich Enterprises, LLC) Legacy Plumbing Next Previous © 2025 Oak Harbor Chamber of Commerce | Site by GrowthZone Contact Us phone 360-675-3755 location 32630 SR 20, Oak Harbor, WA 98277 email Email US Members Member Login Member Directory Application to Join Jobs Hours Mon - Fri 9am - 5pm CONNECT Facebook Instagram © 2025 Oak Harbor Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://oakharborverobeach.com/resales/",
      "text": "Resales - Oak Harbor Skip to content Home The Club About Gallery Lifestyle and Activities Extensive Sports and Social Activities Dining Wellness Home Health Services Membership Real Estate Resales Contact Us Home The Club About Gallery Lifestyle and Activities Extensive Sports and Social Activities Dining Wellness Home Health Services Membership Real Estate Resales Contact Us Oak Harbor: Listings Get new listing alerts delivered to your inbox. Sign Up for Listing Alerts Sign Up for Listing Reports × Close Oak Harbor Grand Harbor Grand Harbor - The Falls Oak Harbor Sea Oaks Market Report Open Homes Listings For Sale Recently Sold 19 Results Refine Search Min. Price $ Max. Price $ Beds Any 1+ 2+ 3+ 4+ 5+ Baths Any 1+ 2+ 3+ 4+ 5+ Update Sort Price (High to Low) Price (Low to High) Status City Listing Date Type / Price Descending Listing Number Open Home Date Asc $825,000 1250 Saint Georges Lane Vero Beach, FL 32967 3 Beds 2 Baths 1,980 SqFt (36) 1250 Saint Georges Lane, Vero Beach, FL 32967 × Close #279584 | House $675,000 1450 Saint Catherines Circle Vero Beach, FL 32967 3 Beds 2 Baths 1,643 SqFt (36) 1450 Saint Catherines Circle, Vero Beach, FL 32967 × Close #282337 | House $450,000 (Active Under Contract) 1520 Oak Harbor Boulevard #202 Vero Beach, FL 32967 3 Beds 2 | 1 Baths 1,830 SqFt (36) 1520 Oak Harbor Boulevard #202, Vero Beach, FL 32967 × Close Virtual Tour #275833 | Condo $325,000 4775 S Harbor Drive #202 Vero Beach, FL 32967 2 Beds 2 Baths 1,400 SqFt (36) 4775 S Harbor Drive #202, Vero Beach, FL 32967 × Close Virtual Tour #281344 | Condo $1,850,000 720 Saint Annes Lane Vero Beach, FL 32967 3 Beds 3 Baths 2,862 SqFt (36) 720 Saint Annes Lane, Vero Beach, FL 32967 × Close #273974 | House $1,525,000 760 Saint Annes Lane Vero Beach, FL 32967 3 Beds 3 Baths 2,635 SqFt (33) 760 Saint Annes Lane, Vero Beach, FL 32967 × Close #282384 | House $1,350,000 980 Saint James Lane Vero Beach, FL 32967 3 Beds 3 Baths 2,615 SqFt (31) 980 Saint James Lane, Vero Beach, FL 32967 × Close Virtual Tour #280191 | House $1,150,000 (Active Under Contract) 900 Saint Annes Lane Vero Beach, FL 32967 4 Beds 3 Baths 2,628 SqFt (36) 900 Saint Annes Lane, Vero Beach, FL 32967 × Close #277713 | House $1,000,000 1020 Saint James Lane Vero Beach, FL 32967 3 Beds 3 Baths 2,868 SqFt (36) 1020 Saint James Lane, Vero Beach, FL 32967 × Close #274845 | House $899,000 1340 Saint Catherines Circle Vero Beach, FL 32967 3 Beds 2 Baths 1,980 SqFt (33) 1340 Saint Catherines Circle, Vero Beach, FL 32967 × Close #282091 | House $770,000 1275 Saint Georges Lane Vero Beach, FL 32967 2 Beds 2 Baths 1,627 SqFt (36) 1275 Saint Georges Lane, Vero Beach, FL 32967 × Close Virtual Tour #281459 | House $750,000 4692 Saint Elizabeths Terrace Vero Beach, FL 32967 2 Beds 2 Baths 1,982 SqFt (36) 4692 Saint Elizabeths Terrace, Vero Beach, FL 32967 × Close #279883 | House $725,000 1365 St Catherines Circle Vero Beach, FL 32967 2 Beds 2 | 1 Baths 2,099 SqFt (36) 1365 St Catherines Circle, Vero Beach, FL 32967 × Close #282087 | House $720,000 1255 Saint Georges Lane Vero Beach, FL 32967 2 Beds 2 Baths 1,977 SqFt (32) 1255 Saint Georges Lane, Vero Beach, FL 32967 × Close #279921 | House $624,900 1120 Saint Georges Lane Vero Beach, FL 32967 2 Beds 2 Baths 1,889 SqFt (36) 1120 Saint Georges Lane, Vero Beach, FL 32967 × Close #282099 | House $530,000 1510 Oak Harbor Boulevard #303 Vero Beach, FL 32967 3 Beds 2 Baths 1,582 SqFt (35) 1510 Oak Harbor Boulevard #303, Vero Beach, FL 32967 × Close #279206 | Condo $500,000 1510 Oak Harbor Boulevard #201 Vero Beach, FL 32967 3 Beds 2 | 1 Baths 2,000 SqFt (26) 1510 Oak Harbor Boulevard #201, Vero Beach, FL 32967 × Close #277828 | Condo $425,000 1510 Oak Harbor Boulevard #103 Vero Beach, FL 32967 3 Beds 2 Baths 1,582 SqFt (25) 1510 Oak Harbor Boulevard #103, Vero Beach, FL 32967 × Close Virtual Tour #279222 | Condo $335,000 1510 Oak Harbor Boulevard #202 Vero Beach, FL 32967 2 Beds 2 Baths 1,400 SqFt (26) 1510 Oak Harbor Boulevard #202, Vero Beach, FL 32967 × Close #279178 | Condo « 1 of 1 » © 2024 REALTORS® Association of Indian River County. All rights reserved. IDX information is provided exclusively for consumers' personal, non-commercial use and may not be used for any purpose other than to identify prospective properties consumers may be interested in purchasing. Data is deemed reliable but is not guaranteed accurate by the MLS. Indian River data last updated at November 5, 2024 2:19 PM ET 4755 S. Harbor Drive Vero Beach, FL 32967 For Club Membership Information kjones@oakharborfl.com 772.562.3808 For Real Estate Information Oakharbor@sorensenrealestate.com 772.907.6014 Oakharbor@sorensenrealestate.com 772.907.6014 © 2024 | OAK HARBOR - SALES CENTER - VERO BEACH"
    },
    {
      "url": "https://oakharborverobeach.com/",
      "text": "Home - Oak Harbor Skip to content Home The Club About Gallery Lifestyle and Activities Extensive Sports and Social Activities Dining Wellness Home Health Services Membership Real Estate Resales Contact Us Home The Club About Gallery Lifestyle and Activities Extensive Sports and Social Activities Dining Wellness Home Health Services Membership Real Estate Resales Contact Us You Deserve A Carefree Life Oak Harbor is a gated community of luxury single family homes, villas, cottages and condominiums.  Located on the Indian River, near Vero Beach’s art and cultural district as well as the area’s medical corridor centered on Cleveland Clinic Indian River Hospital.  Residents at Oak Harbor enjoy luxurious green landscapes and interesting waterways.  Centered in the community is the Oak Harbor Club, a premiere country club for residents wanting to enjoy an active lifestyle of sporting amenities, as well as social clubs and events.  Amenities are available through membership in the Oak Harbor Club. The Oak Harbor Club- Enjoy the Best! The Oak Harbor Club is a premier lifestyle country club specifically designed for the active lifestyle of members over  55.  The Club sits at the center of the Oak Harbor community and offers a number of sporting activities as well as a full range of social activities.  The Club’s 9 hole Joe Lee designed golf course offers members the ability for leisure play as well as competitive events, including Men’s Day, Ladies Day and our very popular Saturday Scramble.  The Club also offers leisure and club match croquet on a beautifully groomed croquet lawn.  For those wanting racquet sports, the Club offers tennis on a clay court and pickleball on a grass court.  The Club also has an active bocce league. The intimate size of the Oak Harbor Club is one of its most distinctive qualities.  By keeping membership exclusive, the Club ensures that members can easily confirm a dinner reservation or enjoy a round of golf without needing a tee time.  The Club’s smaller size encourages frequent and meaningful social connections, making Oak Harbor more than just a place to stay active–it’s a community where friendships thrive. Lifestyle & Activities Extensive Sports and Social Activities The Oak Harbor Club offers a complete array of activities for active Members and their guests. The Club’s 9 hole Joe Lee designed golf course offers members the ability for leisure play as well as competitive events, including Men’s Day, Ladies Day and our very popular Saturday Scramble.  Golf clinics and lessons are available from the Club’s Class “A” PGA professional. The Club’s croquet program offers individual play as well as round-robin events and interclub match play.  And they have their ever popular Wine N Wickets events. The Club offers racquet sports of tennis on a clay court, as well as the very popular pickleball which we play on a well-maintained grass court.  The Club’s racquet sports are available for casual or competitive play.  Lesson are available on site. There is weekly bocce drop in play as well as a bocce league during the winter season. The Health and Wellness Center has a fitness center with classes in yoga, Qi Gong, Aquacise, Stretch & Tone as well as chair exercise classes.  There is a pool and Jacuzzi available from dawn to dusk as well as a fitness center with a full range of equipment and weights. In the Clubhouse, you will find Monday Movie Matinee, Tuesday Trivia, Thursday Dinner with John Ryan at the piano, Friday Bingo and Dinner, as well as Lounge Happy Hour events.  Also available are Contract Bridge and Mah Jongg.  Special events are scheduled throughout the year. Lifestyle - \nLiving the Good Life The Oak Harbor Club offers a plethora of activities including contract bridge, Mah Jongg and Book Club.  Tech Savy classes and movie events are offered on a weekly basis.  Members have the ability to structure their days to their liking.  The days can include sports activities or individual fitness time. Our extensive library has the latest periodicals and books for our Members’ enjoyment. Meeting up with other members at the Clubhouse Lounge for a cocktail before dinner or for a night of Trivia are Member favorites. It is said that the only time you retire at Oak Harbor is when you retire to your bed at night. The 42,000 square foot clubhouse transports its members to elegant dining and social events.  The Clubhouse hosts both casual and more formal dining for our Members’ enjoyment.  It also houses the Club’s fitness center, pool and Jacuzzi.  Meeting rooms are available for many social amenities, including bridge and Mah Jongg. Also located inside the Club’s massive Clubhouse is the Oak Harbor Fitness Center outfitted with state-of-the-art equipment for group and individual training. The Clubhouse is also where you will find Oak Harbor Home Health.  For members who desire additional assistance with their daily health challenges, Oak Harbor Home Health is here to provide Members with a full array of services that allow our Members to remain in their homes while receiving care. From the 9 hole, Joe Lee designed golf course, croquet, impressive Galas, and the exquisite cuisine, this is a way of life like no other. Our nationally recognized Wellness Program recently expanded to include concierge-like services from our in-house health services team. Oak Harbor Club offers three membership choices to fit the individual needs of our members. For Your Dining Pleasure The Club’s impressive 42,000 square foot Clubhouse offers choices for your dining pleasure.  The formal dining room offers creative chef-prepared menus.  Or for a less formal evening, Members enjoy the Sunroom which offers a selection of lighter fare.  The Club also has a private dining room where Members can arrange for smaller gatherings for family or special dinners with friends. Health & Wellness Geared To Your Specific Needs The focus of the Club’s Wellness Program is to enhance the overall quality of daily life for our members by gently supervising Members to achieve their optimal level of physical fitness.  The Club’s philosophy is a gradual, yet continuous dedication to increasing your levels of stability, coordination, flexibility and muscular strength. The Club’s unique Health and Wellness Center is staffed by an on-site nursing staff who assists and advises Members with various medical matters including designing the proper home health care program when needed.  The care provided through the Oak Harbor Home Health allows Members’ families to know that their family member is receiving the best care in their own home. Members needing a more concentrated level of care can make arrangements through the Club’s Health and Wellness Center to enter Somerset House for short or long-term rehabilitation or for continuing assisted living. The facilities and services offered through the Club’s Health and Wellness Center provide a point of difference at Oak Harbor Club.  This amenity is one of the ways that the Oak Harbor Club keeps its Members’ needs as a central focus of the Club. Services Companion care Collect newspapers/mail Personal shopping Local doctor appointments Nurse visits (RN/LPN) In home care by a Home Health Aide (“HHA”) or a Certified Nurses Assistant (“CNA”) Medication management Blood pressure and vitals readings on a periodic basis (daily, weekly, or monthly) Respite care Hospital and rehab stay companion Memberships At Oak Harbor Club our memberships are designed to allow the member to select the amenities that most appeal to their desires.  Three different membership plans are available:  Country Club, Associate, and House.  The selection runs from unlimited golf to enjoying the social aspects of the Club.  All of the memberships provide for full use of the gorgeous Clubhouse and its dining facilities as well as the Club fitness, health and social programs. All Memberships provide for participation in the Oak Harbor Home Health as well as entrance to Somerset House on a priority basis, if needed. A personal meeting with the Membership Director will provide you with a private tour of the Club and allow you to review the three membership levels so that you can design a program that best meets your lifestyle and individual needs. Real Estate Our exceptional collection of homes blends timeless architectural style with uncompromising luxury and convenience. Oak Harbor’s superb lifestyle choices include elegant cottages, gracious condominiums, and grand villas offering scenic views of lakes, the golf course, and serene wildlife estuaries. Listings Contact Us Enter Name Enter Email Enter Phone Number Message Send 4755 S. Harbor Drive Vero Beach, FL 32967 For Club Membership Information kjones@oakharborfl.com 772.562.3808 For Real Estate Information Oakharbor@sorensenrealestate.com 772.907.6014 Oakharbor@sorensenrealestate.com 772.907.6014 © 2024 | OAK HARBOR - SALES CENTER - VERO BEACH"
    },
    {
      "url": "https://oakharborverobeach.com/gallery/",
      "text": "Gallery - Oak Harbor Skip to content Home The Club About Gallery Lifestyle and Activities Extensive Sports and Social Activities Dining Wellness Home Health Services Membership Real Estate Resales Contact Us Home The Club About Gallery Lifestyle and Activities Extensive Sports and Social Activities Dining Wellness Home Health Services Membership Real Estate Resales Contact Us Our Gallery 4755 S. Harbor Drive Vero Beach, FL 32967 For Club Membership Information kjones@oakharborfl.com 772.562.3808 For Real Estate Information Oakharbor@sorensenrealestate.com 772.907.6014 Oakharbor@sorensenrealestate.com 772.907.6014 © 2024 | OAK HARBOR - SALES CENTER - VERO BEACH"
    },
    {
      "url": "https://www.grandharborproperties.com/oak-harbor/",
      "text": "Oak Harbor, Vero Beach, FL Real Estate - Alex MacWilliam, Inc., Realtor Menu https://www.youtube.com/c/AlexMacWilliamIncVeroBeach/videos Follow us on Instagram Follow Us On Facebok Email Us Call Us Email Us Translate this page Afrikaans Albanian Amharic Arabic Armenian Azeerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Burmese Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scots Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sundanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Email Us Translate this page Afrikaans Albanian Amharic Arabic Armenian Azeerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Burmese Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scots Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sundanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu 772-231-6509 Facebook YouTube Instagram Home Available Properties Grand Harbor/Oak Harbor Under $500K Grand Harbor/Oak Harbor $501K-$1Million Grand Harbor/Oak Harbor Over $1 Million Grand Harbor Marina Amenities Neighborhood Map Oak Harbor Neighborhood Map ABOUT AMAC NEIGHBORHOOD EXPERTS Contact Us Menu 772-231-6509 Facebook YouTube Instagram About Oak Harbor Oak Harbor is Vero Beach’s premier adult community nestled in its own tropical paradise near the Intracoastal on Vero’s mainland. Thoughtful in every detail, the community offers superb lifestyle choices, outstanding amenities, intellectually stimulating and culturally rich activities, and unparalleled service in a carefree, no-maintenance lifestyle. Reserved exclusively for Members, no tee time is required on the Joe Lee-designed 9-hole executive course with its far-reaching fairways and lush rolling hills.  An alternative to golf might be croquet on the beautiful regulation size court.  Prefer tennis?  Along with regular courts there are also grass Pickleball courts in addition to Bocce ball courts. The 42,000 square foot clubhouse provides varied dining options from casual to black-tie. The 5-star, award winning chef prepared meals are served in the formal dining room, the bright informal sunroom, elegant private dining room, or the lovely lounge, every dining mood is accommodated.  Oak Harbor also hosts a wide variety of events through the year including dinner parties, holiday events, dancing, galas, performance acts and shows.  The clubhouse affords residents a quiet, cozy cherry paneled library, an activity room, card room, a well-equipped fitness area with locker rooms, sauna, and individual fitness training, and a swimming pool for leisure or Aquatics.  Additionally, an on-site hairdresser and manicurist is available to pamper residents. Nearby the clubhouse, Somerset House is an assisted living facility exclusively for Oak Harbor members. Residents needing short or long-term rehabilitation or care benefit from the at-home atmosphere and comforts offered in its 30 private rooms. Somerset has a well-trained nursing staff 24-hours a day with a senior registered nurse always on call during the late evening hours. Learn about Somerset House services and personal Home Health Services below. The “Carefree Lifestyle” provided at Oak Harbor includes chauffeur-driven transportation, daily housekeeping, home maintenance, and an in-depth, full-time concierge that handles a range of business services, along with letter and package send-off. Oak Harbor offers superb residence choices from 1-4 bedroom cottages, condos, or luxury villas with views of lakes, golf courses, or serene wildlife estuaries. Somerset House link: https://somersethouseverobeach.com/ Home Health Services link: http://www.oakharborverobeach.com/home-health.html Oak Harbor website link: http://www.oakharborverobeach.com/#home For more information on our partners click on the logos below: For more information on our partners click on the logos below: AMAC Alex MacWilliam Real Estate 2901 Ocean Drive Vero Beach, FL 32963 Phone: (772) 231-6509 Fax: (772) 234-8126 E-mail: info@alexmacwilliam.com © 2024  AMAC Alex MacWilliam Real Estate Privacy Policy License# CQ224137 Equal Housing Opportunity. This material is based on information which we consider reliable, but because it has been supplied by third parties, we cannot represent that it is accurate or complete and should not be relied on as such. This offering is subject to errors, omissions, change of price or withdrawal without notice. Grand Harbor is a registered service mark of GHA Grand Harbor, LTD., and GHA Development, Inc. a Florida Corporation. Search Close"
    },
    {
      "url": "https://oak-harbor-freight-lines.pissedconsumer.com/customer-service.html",
      "text": "Oak Harbor Freight Lines Customer Service Phone Number (800) 285-6254, Email, Help Center Skip to content PissedConsumer Reviews Categories All Categories Media Auctions and Marketplaces E-commerce Food Delivery Footwear and Clothing Gambling and Lotto Transportation and Logistics Companies All Companies Amazon Meesho Temu Google YouTube TV KukuFM Blinkit Write review For Business Login Transportation and Logistics Oak Harbor Freight Lines 17 Customer Service Updated on 11/21/2024 Contact Oak Harbor Freight Lines Customer Service Reviews 0 Contacts Q&A Advertisements Oak Harbor Freight Lines Phone Numbers and Emails Toll-Free Number: (800) 285-6254 Call customer service Customer Service: (800) 858-8815 Oak Harbor Freight Lines Email: Customer Service Send Message Is this your business? Advertisements Oak Harbor Freight Lines Customer Service Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. More commonly used way of contact is by phone . Source Distribution 71% phone 29% email The best phone number to call Oak Harbor Freight Lines is 8002856254 . 57% of consumers used this number to address their issues and concerns. The longest wait times are on Wednesday , while the shortest are on Friday and Thursday . People call Oak Harbor Freight Lines mainly because of employment, request for information, shipping and delivery . View full overview › Oak Harbor Freight Lines Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. More commonly used way of contact is by phone . Source Distribution 71% phone 29% email The best phone number to call Oak Harbor Freight Lines is 8002856254 . 57% of consumers used this number to address their issues and concerns. The longest wait times are on Wednesday , while the shortest are on Friday and Thursday . People call Oak Harbor Freight Lines mainly because of employment, request for information, shipping and delivery . 20% of the consumers who called the company’s customer support stated that their issues were resolved. The best email to contact Oak Harbor Freight Lines is custsvc@oakh.com . Close How to Contact Oak Harbor Freight Lines Customer Service? Most Popular Number: (800) 285-6254 Total calls: 17 Issue resolved: 1 Last call: May 8, 2024 Winnie Murugi PissedConsumer Reporter What Is The Oak Harbor Freight Lines Customer Service Phone Number? As a leading provider of transportation and logistics services, Oak Harbor Freight Lines values the importance of maintaining effective communication channels with its customers. In order to facilitate seamless and efficient communication, the company has established a dedicated Oak Harbor Lines customer service phone number that can be accessed by customers from across the country. The primary Oak Harbor Lines phone number to call is 8002856254. 57% of consumers used this number to address their issues and concerns. The longest wait times are on Wednesday, while the shortest are on Friday and Thursday. What Is The Oak Harbor Freight Lines Email Address? People email Oak Harbor Freight Lines mainly because of employment, requests for information, shipping and delivery. The best email to contact Oak Harbor Freight Lines is custsvc@oakh.com. Alternatively, you can message their Help Center online via their social media pages. They usually respond to direct messages within several business hours. To assist their reps with properly responding to your experience, please ensure that you include as much information as you can. What Is The Oak Harbor Freight Lines Headquarters Address? The Oak Harbor Freight Lines headquarters are located at Oak Harbor Freight Lines, Inc. 1339 West Valley Hwy North, PO Box 1469, Auburn, WA 98071-1469. This is their head office – here you will find: Underwriting; Marketing; Finance; IT; Accounts; Customer Relations; HR; Legal; Compliance and corporate communications. It's the main hub for all administrative and corporate functions of the company. If you need to get in touch with Oak Harbor Freight Lines or want to visit their headquarters, this is the address to use. Contact Information Oak Harbor Freight Lines Website: www.oakh.com Oak Harbor Freight Lines Help Center: Visit contact page Corporate Office Address: Oak Harbor Freight Lines PO Box 1469, 1339 W Valley Hwy N Auburn, Washington 98001 United States Help in Social Networks: Facebook Twitter Linkedin Fax: (253) 931-5137 Oak Harbor Freight Lines Rating Based on 9 Reviews Rating details 1.2 more details Customer service Diversity of Products or Services Website Product or Service Quality Rating Details Customer service Diversity of Products or Services Website Product or Service Quality Exchange, Refund and Cancellation Policy Warranty Reliability Turnaround Time Insurance Quality Tracking Tool Price Affordability Value for money Close All 17 Oak Harbor Freight Lines reviews Rating stats Rating trend Summary of Oak Harbor Freight Lines Customer Service Calls 30 TOTAL CALLS 00:00 AVG CALL DURATION 20% ISSUES RESOLVED Top Reasons of Customers Calls Consumers Call the Most From Why Do People Call Oak Harbor Freight Lines? Shipping and Delivery Question: 1Y ago “Tracking” 1Y ago “Shipping” 2Y ago “Shipment” Employment Question: 1Y ago “Employment” 1Y ago “Truck driving job” Request for Information Question: 2Y ago “Request charge acount” 3Y ago “Checking on delivery status” Website/ Application Question: 3Y ago “Clarify application infomation” Return/ Replace Question: 3Y ago “Change of address” Other Question: 1Y ago “Pick up” 2Y ago “Freight not picked up” 3Y ago “Trackinh” About Summary Oak Harbor Freight Lines specializes at questions connected with freight, shipment and delivery. The company can help you to calculate the rate and quotes for your goods collecting all detail about quantity, prices and terms of delivery. The company guarantees excellent delivery service and has wide chain of developed logistics which serves for clients. The company is private owned and pays much efforts and attention to shipment details which could make the process of cooperation with clients easy and profitable. Oak harbor Freight Lines has a few non-delivery days when there are national holiday celebrations at the United States. You can use an option of completing the on-line bill of loading and density calculator on the web site of the company. Oak Harbor Freight Lines is ranked 351 out of 1515 in Transportation and Logistics category Compare Oak Harbor Freight Lines Customer Service To Companies are selected automatically by the algorithm. A company's rating is calculated using a mathematical algorithm that evaluates the information in your profile. The algorithm parameters are: user's rating, number of resolved issues, number of company's responses etc. The algorithm is subject to change in future. Southeastern Freight Lines Customer Service 2.1 out of 5 Intelcom Customer Service 1.4 out of 5 UniUni Customer Service 1.2 out of 5 Write a review Do you have something to say about Oak Harbor Freight Lines? What happened? What can we help you with? Submit review Don't show this popup Call Company Send Message Oak Harbor Freight Lines Reviews Contacts Q&A Write a review About About PissedConsumer Press Page Blog FAQ for Consumers FAQ for Companies Careers Contact PissedConsumer Browse Companies Reviews Categories State Attorneys General Contacts Services Business Solutions List your Business Tips For Consumers Tips For Companies PissedConsumer Club Advertise with us Legal Privacy Policy Terms Of Use Legal Information Dispute Resolution (LVP Program) facebook youtube linkedin twitter tiktok PissedConsumer            © 2025 All\n            Rights Reserved Are you sure you want to leave Oak Harbor Freight Lines contact page? Contact Oak Harbor Freight Lines Contact PissedConsumer Terms of Service I agree to TOS Cancel"
    },
    {
      "url": "https://clearharboram.com/who-we-are/meet-the-team",
      "text": "Meet the Team — Clear Harbor Asset Management facebook twitter instagram linkedin google youtube vimeo tumblr yelp rss email podcast phone blog search brokercheck brokercheck Play Pause Who We Are Our Services Insights Client Access Contact Who We Are About Us Meet the Team Letter From Our CEO Our Services Wealth Management Investment Management Values-Based Portfolio Construction Insights Clear Harbor in the News Market Outlook Flash News and Updates Client Access Contact Your Partners in Wealth Management Schedule Time to Meet With Us About Us Meet the Team Letter From Our CEO Get to Know Us Read Bio Aaron J. Kennon Co-Founder & Chief Executive Officer Close Aaron J. Kennon Co-Founder & Chief Executive Officer Aaron serves as Chief Executive Officer of Clear Harbor Asset Management and is a member of the firm's Investment Committee. He has spent the last twenty-seven years focused on domestic and international capital markets across trading, asset management, and wealth planning. Prior to co-founding Clear Harbor, Aaron managed multi-asset class portfolios for institutions and high-net-worth individuals at Ingalls & Snyder LLC. Before joining Ingalls, Aaron worked at the Royal Bank of Canada, where he was responsible for expanding the firm’s presence in dollar-denominated institutional fixed income trading. During his tenure at RBC, Aaron worked and lived in both London and New York. Prior to joining the Royal Bank of Canada, Aaron worked at Citigroup Inc. for 9 years, where he focused on fixed income capital markets, with a particular emphasis on trading and originating high-grade fixed income securities. While working for Citigroup, Aaron worked and lived in Manhattan, Tokyo and Hong Kong. A graduate of Yale University, Aaron currently serves on the board of the Atlantic Salmon Federation (U.S.) and is also a member of the organization's Investment and Finance Committees. Read Bio Ian A. Armstrong, CAIA© Co-Founder & Chief Operating Officer Close Ian A. Armstrong, CAIA© Co-Founder & Chief Operating Officer Ian serves as Chief Operating Officer of Clear Harbor Asset Management and is a member of the firm's Investment Committee. Prior to co-founding Clear Harbor, Ian was employed as an Associate at Ingalls & Snyder LLC. At Ingalls, Ian served as an Analyst and Trader for one of the firm’s multi-strategy hedge funds. His responsibilities at the fund encompassed a broad range of strategies, including special situation equities, capital structure arbitrage and high yield and distressed debt. Ian was also responsible for monitoring and hedging the fund’s aggregate risk exposures. In addition to his role with the fund, Ian also managed individual accounts for personal clients. Prior to joining Ingalls & Snyder, Ian was employed as Investment Operations Manager for Cruice Investment Advisors Ltd, a boutique investment firm in Westport, CT. At Cruice, Ian was responsible for a wide range of the firm’s investment operations, including trading, client reporting, research distribution and technology management. Earning a bachelor’s degree in economics from Indiana University, Ian combines his experience and education to provide unmatched service to his clients. Read Bio D. Roger B. Liddell Vice-Chairman & Investment Manager Close D. Roger B. Liddell Vice-Chairman & Investment Manager Roger serves as Vice Chairman of Clear Harbor Asset Management and is an Investment Manager and a member of the firm’s Investment Committee. Prior to joining Clear Harbor, Roger was a Partner, Senior Director and Managing Director for 22 years at Ingalls & Snyder, LLC. His areas of specialization include energy renewable electricity, utilities and special situations. Within the energy sector, he concentrates on demand-side versus supply-side opportunities as well as providers of energy-efficient equipment and energy management services. He offers perspective on electric rate structures, price signals and efficiency programs. Roger has been active with major environmental organizations such as Natural Resources Defense Council since the mid-1970s in efforts to establish policies supportive of rational energy markets. In this pro bono activity, he encourages regulators and companies to re-direct capital expenditures toward efficiency investments in lieu of additional capacity. He is a member of the Sharon (CT) Energy and Environment Commission and Stewardship Committee Chairman and Board Member of the Sharon Land trust. Roger is a graduate of Princeton University (A.B. English Literature) and following his service as a U.S. Navy  Officer, he went on to earn his master’s degree in finance and security analysis from Columbia University. Read Bio Tim Schantz Vice-Chairman Close Tim Schantz Vice-Chairman Tim Schantz serves as Vice Chairman of Clear Harbor Asset Management and his career in finance and wealth management spans more than 35 years. Tim served as president of ING Capital and later as president of the combined ING Furman Selz Asset Management. He also worked as head of ING's corporate and structured finance business in the Americas, and Deutsche Bank's structured finance activities within private wealth management in the U.S. before joining Genworth as head of alternative investing. Tim has also served as a strategy consultant for Greenwich Associates. Tim has extensive experience in the not-for-profit sector as well, having served as a board member for a number of entities in addition to his executive roles. Prior to joining Clear Harbor's board, Tim led the Mountbatten Institute in North America and more recently the Protestant Episcopal Cathedral Foundation in Washington, D.C. as its Executive Vice President and Chief Operating Officer. Tim has served as a member of the Compensation and Governance Committees for the Board of Questex Media and has been a Director and Chairman of the Nominating and Governance Committee for MortgageIT, a NYSE listed company, prior to its acquisition by Deutsche Bank. Tim is currently a member of the executive leadership team at History Factory in Washington where he serves as Chief Administrative Officer and Managing Director of Archives and Content Solutions.  Additionally, he serves as Chairman of the Investment Committee and as a Councilor for the Historical Society of Pennsylvania and also serves on the Advisory Board of the Smithsonian Libraries, acting as Chairman of the Education Committee and as a member of the Executive Committee. Tim studied history at Brown University and currently resides in Washington, D.C. with his wife. Read Bio Henrik Brun Managing Director Close Henrik Brun Managing Director Henrik serves as a Managing Director at Clear Harbor Asset Management specializing in providing financial strategy advice to his clients - both individuals and not-for-profits - in the areas of asset allocation, asset and liability management, in-depth personal balance sheets, as well as college and retirement planning. Henrik has extensive experience designing portfolios that include ESG, Carbon-reduction strategies, Innovation, and public/private funds. He brings more than two decades of multi-jurisdictional knowledge drawing from his experience with clients in the US, Europe, and Asia. Prior to joining Clear Harbor, Henrik was at Stonehurst Management for 18 years and prior to that at UBS Financial Services. Henrik holds an MBA from NYU Stern School of Business and a Bachelor of Arts from Brown University. Henrik serves on the Investment Committee for the NY Institute for Special Education overseeing a $250 million endowment and a $20 million Defined Benefit plan. Henrik’s pro bono interests include moving cancer research forward by doing Cycle For Survival and founding ProjectLIV with his family to connect leading labs with Memorial Sloan Kettering’s cBioPortal (the largest cancer genomic resource in the world). Henrik lives in Manhattan with his two sons. Read Bio Scott Bogan Portfolio Manager Close Scott Bogan Portfolio Manager Scott brings 25 years of financial advisory experience, specializing in investment management, portfolio construction, and asset allocation. His expertise includes relative valuation analysis, risk management for concentrated stock positions, and comprehensive financial planning. Scott has worked extensively with corporate executives and other high-net-worth individuals, providing tailored financial solutions that align with their long-term goals. Before joining Clear Harbor, he held investment advisory roles at both GYL Financial Synergies and Morgan Stanley. He was also affiliated with Mass Mutual and Northwestern Mutual, where he provided holistic financial planning. Earlier in his career, he worked in brand management at General Foods/Kraft. Scott holds a B.A. from Middlebury College, cum laude, where he majored in Political Science with an additional concentration in French Language and Civilization. He also studied at l’Institut d’Études Politiques in Paris, France. Beyond his professional endeavors, Scott is an avid skier and former racer. He actively volunteers with the Alumni Association for Burke Mountain Academy in Vermont, staying engaged with downhill racing and mentoring student-athletes. He also serves as a trustee of the Wilton (CT) Land Conservation Trust, contributing to its Land Stewardship Committee. Scott and his family are dedicated supporters of the community YMCA and enjoy kayaking, hiking, skiing, traveling, and attending concerts of all genres. Read Bio Jacques Cattier Portfolio Manager Close Jacques Cattier Portfolio Manager Jacques serves as a Portfolio Manager at Clear Harbor Asset Management.  Prior to joining Clear Harbor, Jacques was employed for 25 years as a Portfolio Manager at Security Asset Management (now a division of Clear Harbor) where he was responsible for the investment selection and portfolio management of the firm’s “Emerging Blue Chip” equity strategy. Jacques is a periodic contributor to the financial website TheStreet.com.  Earning a bachelor’s degree in economics from Trinity College, Jacques’ career long focus has been to partner with individuals, families and institutions to craft portfolios built of high-quality investments with long term compounding return potential. Jacques lives in Manhattan with his wife and two children. Read Bio Robert C. Dalldorf Portfolio Manager Close Robert C. Dalldorf Portfolio Manager Bob serves as a Portfolio Manager at Clear Harbor Asset Management.  Prior to joining Clear Harbor, Bob was employed by Falcon Capital Management, Inc., an independent registered investment advisor, as both President and CCO.  In that role he built out the firm’s equity and fixed income strategies, developed business, and managed both portfolios and relationships.  As Chief Compliance Officer he guided the firm through the current regulatory environment. Prior to 1994 Bob worked at New England Securities and Astor Securities.  He has been actively employed in financial services since 1981.  Bob received a degree in Mathematics from the University of Vermont in 1972 and a master’s degree from the Pennsylvania State University in 1974.  Bob is active in racquet sports, golf and skiing and lives in Wilton, CT with his wife Nancy. Read Bio James D. Taliaferro Portfolio Manager Close Jim serves as Portfolio Manager at Clear Harbor Asset Management. Prior to joining Clear Harbor, the majority of Jim’s career was spent with Kidder Peabody Incorporation, where he principally served as President, Chief Investment Officer, and Chief Executive Officer of Webster Management Corporation, the wholly-owned investment subsidiary of Kidder. In 1990 Jim founded Security Asset Management (now a division of Clear Harbor) where he served as CEO and Portfolio Manager. Jim has over fifty years of investment experience. His career began in 1969 in retail and institutional sales with Dominick & Dominick and Edwards & Hanly, where he was a registered representative until 1972. He then joined White, Weld & Co. where he became a Vice President and Senior Portfolio Manager for individual and institutional accounts. In 1978 he joined Webster Management where over the course of twelve years, he held several key positions including Senior Portfolio Manager and member of the Investment Policy Committee, Director of Marketing, Head of the Individual and Institutional Account Divisions, and finally, from 1985 through 1990, he was president, chief executive and Chief Investment Officer of the firm, as well as Chairman of the Board of the Kidder, Peabody family of mutual funds. Jim attended Parsons College and served in the U.S. Army in Vietnam. Read Bio Kirstin Mobyed Director Close Kirstin Mobyed Director Kirstin Mobyed serves as a Director at Clear Harbor Asset Management focused on developing comprehensive wealth management solutions for individuals, families as well as foundations and endowments. Kirstin leverages over 28 years of experience in the investment and financial services industries to deliver the firm’s portfolio of wealth management services and to help Clear Harbor clients achieve the goals and objectives most important to them. Prior to joining Clear Harbor, Kirstin was an Executive Director at Morgan Stanley. During her 27 years at Morgan Stanley and its predecessor firm (Legg Mason, Citigroup, Salomon Smith Barney), Kirstin served as an analyst, a portfolio manager and a client relationship manager. As an Investment Officer and Senior Portfolio Manager with Morgan Stanley’s Custom Solutions – Outsourced CIO Group, Kirstin was responsible for creating multi-asset class portfolios and unbiased, best-in-class wealth management solutions for individuals and institutional clients of the firm. With an emphasis on maintaining the highest standards of integrity and expertise, Kirstin is a trusted fiduciary passionate about providing objective, innovative, and client-centric solutions in clear terms so Clear Harbor clients understand their financial plan and feel empowered to take control of their lives. Ms Mobyed is an active member of the Girl Scouts and the Wilton Youth Council, an organization focused on positive youth development. Kirstin is a graduate of Providence College. Read Bio Matthew W. Sexton, CFP®, CIMA®, ChSNM Director Close Matthew W. Sexton, CFP®, CIMA®, ChSNC TM Director -Investment Planning/Wealth Strategy Matthew joined Clear Harbor in 2016 and brings over 20 years of financial services experience to the firm. Matthew is responsible for working collaboratively with individuals, business owners and institutions where he provides comprehensive investment and financial planning strategies.  Matthew deploys a goals and values-based approach to wealth strategy and portfolio construction. He also specializes in advising families with special needs, helping them navigate financial planning for the unique lifelong needs of a family member with a disability. Prior to joining Clear Harbor he was a Managing Director with Stifel Financial’s Distressed Desk specializing in special situations and reorg equities. He spent time at Wells Fargo Advisors private client group, managing and constructing client portfolios and assisting individuals and families with their comprehensive wealth management needs. Matthew also spent 15 years at Knight Trading Group as an institutional equity trader. Matthew has an MBA from Columbia Business School, a Master of Science in Financial Planning from Bentley University and a Bachelor of Science in Business Management from Providence College.  He is a member of NAPFA®, the National Association of Personal Financial Advisors, the country’s top professional association of fee-only financial advisors and the XY Planning Network, the leading organization of fee-only practitioners focused on working with Generation X and Generation Y clients.   He is Certified Financial Planner™ practitioner and a Certified Investment Management Analyst® professional.  He is a member of the Investments & Wealth Institute®.   He is also currently a Chartered Special Need Consultant ® (ChSNC®), a designation administered by the American College of Financial Services. Matthew’s nonprofit board involvement includes KEEN NYC, an organization that empowers youth with disabilities by providing free, non-competitive one-to-one programs of exercise, fitness and fun; Order of Malta American Association; and Equestrian of the Holy Sepulchre of Jerusalem, Eastern Lieutenancy. Read Bio Catherine S. Woolston Director Close Catherine S. Woolston Director Catherine serves as Director - Investments at Clear Harbor Asset Management. Prior to joining Clear Harbor, she was an Associate at Ingalls & Snyder, LLC for almost 20 years. Before joining Ingalls, Catherine worked at Prudential Bache and R.C. Stamm & Co. She is a graduate of Pace University with a bachelor’s degree in business and finance. Read Bio Joseph M. Rizzo Investment Manager Close Joseph M. Rizzo Investment Manager Joe is Managing Partner and Portfolio Manager of Spectrum Value Partners, LP, a long/short equity fund to which Clear Harbor is the investment adviser. Joe also manages a select number of investment accounts for non-profit organizations, family entities and high-net-worth individuals. Joe joined Clear Harbor Asset Management in March 2010 and is a member of the firm’s Investment Committee. With over 30 years of experience in the investment management industry Joe has worked as an analyst, portfolio manager, technologist, venture capitalist, risk arbitrageur and special situations investor. Joe was previously employed by Ingalls & Snyder LLC, where he was a Portfolio Manager for individual and institutional clients, including serving as general partner and founder of I&S Technology Partners LP, an investment fund focused on the technology sector. Prior to joining Ingalls & Snyder, Joe served as Chief Operating Officer at SynData Technologies Inc., a security software company. Before joining SynData, Joe spent six years as an analyst for JWS Partners, a special situations and arbitrage hedge fund, and Ingalls & Snyder LLC. Joe began his professional career spending six years developing and implementing complex transaction and risk management software systems at a major New York City bank and at Morgan Stanley & Co. Mr. Rizzo graduated Summa Cum Laude from Rutgers University, holds a master’s degree in business administration from New York University and is a member of Phi Beta Kappa. Read Bio Michael H. Scholten, CFA® Investment Manager Close Michael H. Scholten, CFA® Investment Manager Mike joined Clear Harbor Asset Management as an Investment Manager in February 2010 and manages investment accounts for non-profit organizations, family entities and high-net-worth individuals.. Mike has over 21 years of experience managing portfolios for major investment institutions. He was previously employed by Ingalls & Snyder LLC, where he served as a Portfolio Manager. At Ingalls, Mike managed multi-asset class portfolios for individual and institutional clients. Prior to joining Ingalls, Mike was a Senior Portfolio Manager for Gryphon Partners, a multi-strategy hedge fund based in Dallas, Texas. At Gryphon, Mike managed the fund’s Deep Value and Capital Structure Arbitrage strategies, with a focus on the securities of distressed and bankrupt companies. Before joining Gryphon, Mike worked as a Senior Portfolio Manager and Debt Trader at Deerfield Capital Management, American General Investment Management and First Chicago Capital Markets. Mike graduated magna cum laude from Colgate University with a bachelor’s degree in economics and completed his MBA with a concentration in Finance at Duke University’s Fuqua School of Business. He is a member of Phi Beta Kappa and holds the CFA® designation. Read Bio Steven Shaw Investment Manager Close Steven Shaw Investment Manager Steven joined Clear Harbor in November 2014 as an Investment Manager and a member of the firm’s Investment Committee. Prior to joining Clear Harbor, Steven served as Managing Member and Chief Investment Officer of Little Oak Asset Management, LLC. Before working with Little Oak, Steven spent five years as the General Partner and Portfolio Manager of the Newgrange Strategic Value Fund, a value based long-short hedge fund focused on investing in mispriced securities across the capital structure. Prior to launching Newgrange, Steven was a Managing Director at Credit Suisse First Boston (\"CSFB\") responsible for co-heading the firm’s trading and distribution franchise. His responsibilities included the trading, risk management and distribution of cash corporate bonds, high yield and investment grade credit default swaps (CDS), and structured credit. While at CSFB, Steven focused on hedge fund and total return coverage where he was one of the firm's largest credit producers. Before joining CSFB, Steven was a Managing Director at Donaldson Lufkin & Jenrette (which subsequently merged with CSFB), Kidder Peabody and Drexel Burnham. Prior to Wall Street, he worked for 5 years as a Certified Public Accountant with audit/consulting experience at Ernst & Young. As a graduate from the Wharton School at the University of Pennsylvania, Steven combines his experience and education to serve his clients. Read Bio Jeb Armstrong Vice President Close Jeb Armstrong Vice President - Wealth Management Jeb serves as Vice President - Wealth Management at Clear Harbor Asset Management. Before joining Clear Harbor, Jeb served as Director of Capital Markets of Tecogen Inc, a clean energy technology company. He was responsible for the company’s investor relations effort and worked with other members of the management team on strategic capital formation initiatives. Prior to his experience at Tecogen, he spent over 12 years as a senior equity research analyst focused on the domestic oil and gas industry. He was head of energy research at the Marwood Group and previously the senior equity research analyst at CLSA, then a subsidiary of Credit Agricole, where he led coverage of North American oil and gas producers. Among his accomplishments at CLSA, Jeb published a series of reports considered to be among the most prescient at outlining the potential for shale gas and oil to emerge as economically viable sources of energy outside of North America. Before CLSA, he served as the research analyst of the global energy industry at Argus Research, a leading independent equity research firm. Jeb serves on the Board of Trustees of the New Canaan Nature Center and previously served on the Board of the Brooklyn Botanic Garden. He is a graduate of Haverford College and NYU Stern School of Business. Read Bio Alexander W. M. Russell Vice President Close Alexander W. M. Russell Vice President Alex serves as Vice President at Clear Harbor Asset Management, focusing on development and client relationships. Alex joined Clear Harbor with a background in education and school leadership and a passion for financial markets. He most recently served as the Associate Director of Enrollment at Greens Farms Academy in Westport, CT. Prior to GFA, Alex joined Riverdale Country School as the Assistant Director of Middle and Upper School Admission after spending close to a decade as a teacher at St. Bernard’s School in New York City. At Clear Harbor, Alex will continue to focus his efforts on building partnerships with families in close collaboration with the Clear Harbor investment and advisory team. A graduate of Ohio Wesleyan University and Bank Street College of Education, Alex resides in Old Greenwich with his wife and two daughters and is an avid golf, tennis and paddle player. Read Bio Alexander M. Blanton Senior Analyst Close Alexander M. Blanton Senior Analyst Alex joined Clear Harbor Asset Management in January 2011 as a Senior Analyst. Prior to joining Clear Harbor, Alex spent 44 years covering industrial and manufacturing companies for four different investment banking firms. Alex is a specialist in Lean manufacturing, is a member of the Lean Enterprise Institute and for more than two decades has used a company's progress in applying Lean practices as an important variable in evaluating a company's investment worth. At Ingalls & Snyder LLC, which he joined in 1991, and where he was a Senior Vice President, Alex followed machinery and electronics manufacturing services (EMS) companies. While there, Alex was named by The Financial Times/StarMine Awards as one of the Top Ten Stock Pickers of 2009 among all U.S. brokerage house analysts in all industries and by Forbes Magazine as the Number One Stock Picker in the Machinery industry for 2005. Before that, he was often ranked among the Best on the Street in the Machinery industry by The Wall Street Journal. Prior to joining Ingalls & Snyder, Alex spent 18 years as Merrill Lynch's Senior Machinery Analyst, where he headed a 4-person team covering some 50 capital goods companies and where he was consistently named to Institutional Investor Magazine's All-America Research Team. He was top-ranked in Machinery in their annual poll of institutional investors for several years. Before that, Alex followed industrial companies for Cogan, Berlind, Weill & Levitt and for Kidder, Peabody & Co. He joined Kidder in 1967, after three years as a Consultant for a large general management consulting firm. Alex received a bachelor’s degree in electrical engineering from The University of Washington in 1959, and is a member of Tau Beta Pi, the national engineering scholastic honorary. After three year's service as First U.S. Army's Special Weapons Officer at First Army Headquarters on Governors Island, NYC, he earned an MBA from The Harvard Business School in 1964. Read Bio Annika Kennon Vice President Close Annika Kennon Vice President Annika Kennon serves as Vice President Client Relations for Clear Harbor Asset Management. Her background is in Project Management, Software implementation and Supply Chain Management. She spent many years as a principal consultant/consultant at PriceWaterhouseCoopers in their Supply Chain Management group within the Consumer and Industrial Products division. At Clear Harbor, Annika focuses her efforts on maintaining a superior client experience through the use of industry-leading technologies and processes. She holds a master’s degree in mechanical engineering from Chalmers University of Technology in Gothenburg, Sweden and is passionate about the work she provides to her clients. Read Bio Susan O'Shaughnessy Client Service Representative Close Susan O'Shaughnessy Client Service Representative Sue joined Clear Harbor in September 2021 as a Client Service Representative.  She brings 20 years of experience as an Executive Assistant and Client Liaison with Security Asset Management. Previously, Sue worked as an Executive Assistant with PaineWebber. Sue graduated with a BBA from Whitehall College and worked with Cigna Worldwide before moving to the US in 1993.  Sue obtained her NY Insurance License while with Aon (previously Minet). Sue is an active member of the Irish community in New York, participating in cultural and sports events, as well as fundraising for various Irish charities. Read Bio Linda Ricca Client Service Representative Close Linda Ricca Client Service Representative Linda serves as Client Service Representative and Operations Assistant at Clear Harbor Asset Management. Prior to joining the firm Linda spent 23 years with Falcon Capital Management, Inc. where she served in the same capacity.  Linda brings years of experience in the wealth management industry building client relationships, maintaining client confidentiality and upholding ethical standards of the industry. Linda began her career in the financial services industry as a Registered Sales Assistant with PaineWebber, enjoys golf, a good book and entertaining. Read Bio Gail Wofford Client Service Representative Close Gail Wofford Administrative Assistant Gail joined Clear Harbor in April 2011 as an Administrative Assistant. Prior to Clear Harbor, Gail spent 20 years at Ingalls & Snyder as a Registered Representative, working in the research department with the two sell-side analysts. Before joining Ingalls, Gail was a private secretary, personal assistant for private individuals. Previously she was an account executive for Letitia Baldrige Enterprises, Pearl Private Treasures and an administrative assistant at Burson-Marsteller. Gail received her master’s degree in theatre arts from Texas Tech University in 1971 and her bachelor’s degree in art history from Converse College in 1969. Gail also co-founded The New York Gilbert & Sullivan Players, a professional repertory company and is a costume designer with NYGASP. Read Bio Ryan Nolan Associate Close Ryan Nolan Associate Ryan joined Clear Harbor Asset Management after moving from Dublin, Ireland to Fairfield County. Ryan has several years’ experience in in the wealth management industry, including client relationship management, operations, administrative support and compliance across various sectors. Before joining Clear Harbor, Ryan worked as a Senior Client Service Executive with J&E Davy, Ireland's leading financial services firm specializing in wealth management. Ryan graduated with a BA (Honors) Degree in Business from the National College of Ireland. Outside of work Ryan is an avid golfer and passionate Irish and Leinster rugby fan. Read Bio H. Christian Thalheim Analyst Close H. Christian Thalheim Analyst Christian Thalheim serves as an Analyst for Clear Harbor Asset Management and Spectrum Value Partners LP. He has experience in trading, operations, risk analysis, and investment research. At Clear Harbor, Christian focuses on reviewing client portfolios, systematizing processes, managing risk, and analyzing investment opportunities. He holds a bachelor’s degree in finance from the University of Connecticut. Read Bio Giorgia Turri Associate Close Giorgia Turri Associate Giorgia Turri is an Associate at Spectrum Value Partners, a long/short equity fund to which Clear Harbor is the investment adviser. She specializes in business development, marketing, financial analysis, and investor relations leveraging her expertise, education, and strategic client engagement. Prior to joining Spectrum Value Partners, Giorgia worked at AIEM Group, a renewable energy company in Italy that was later acquired by Impax Asset Management. She gained extensive experience in negotiating and closing large-scale photovoltaic projects, conducting due diligence, and crafting business plans to support investment strategies. Earlier in her career, she developed expertise in business development, marketing, and sales at Amazon Web Services (AWS), where she designed and implemented an EMEA-wide social selling strategy, and at EssilorLuxottica, where she supported cross-border sales initiatives between the U.S. and European markets. Giorgia holds a Master of Science in Sustainability Management from Columbia University, where she focused on sustainable finance and renewable energy investments. She also earned a Master of Science in Management from ESCP Business School, specializing in finance and strategy, and a Bachelor of Science in International Economics and Management from Bocconi University. Having lived in seven countries, Giorgia is fluent in multiple languages and adept at navigating diverse cultural and financial landscapes. Her global perspective enables her to build strong relationships with investors and stakeholders across international markets. Outside of work, she is an avid skier, white-water kayaker, and rock climber. Clear Harbor Asset Management One Stamford Plaza 263 Tresser Boulevard, 15th Floor Stamford, CT 06901 Phone: (212) 867-7310 Email: info@clearharboram.com Stay Informed With Our Newsletter Connect With Us © 2019 Clear Harbor Asset Management, LLC. All Right Reserved Disclosure | Privacy Policy | Form CRS Powered by Twenty Over Ten"
    },
    {
      "url": "https://oakharborcapital.com/team/",
      "text": "Management Team Oak Harbor Capital Attractive Risk-Adjusted Returns About Oak Harbor Capital Investment Philosophy Competitive Advantages Management Team Current Opportunities Contact Us Investor Portal Investor Blossom Login Secure Blossom Login Blossom Access Information Management Team Oak Harbor Capital’s management team includes three Managers (William S. Weinstein, Michael Basile, and Peter J. Fitzpatrick). The team has an outstanding track record and a long history of certain of its members working together, both at Oak Harbor and earlier at a predecessor firm founded by the Principal, B-Line, LLC (âB-Lineâ). William S. Weinstein is the President and CEO of Oak Harbor Capital. Mr. Weinstein has practiced in the bankruptcy and creditor rights arena for 35 years. He is the Founder and Chief Executive Officer of Oak Harbor Capital and the Co-Founder and a member of the Legal Services Provider. Mr. Weinstein started the Legal Services Provider in 1985 and it is now among the largest law firms focusing on creditor rights and bankruptcy in the United States. In 1997, he founded B-Line, one of the largest companies in the United States to purchase and service consumer finance related bankruptcy receivables. Under Mr. Weinsteinâs direction, B-Line deployed many hundreds of millions of dollars to acquire receivables that totaled over $46 billion in face value of debt. Between BâLine and the Legal Services Provider, approximately 40 million separate distressed debt accounts were purchased or serviced from 1997 to 2006. BâLine was sold in September 2006. Following the sale of B-Line, Mr. Weinstein launched Oak Harbor Capital, LLC and this investment management firm has become one of the largest buyers of distressed consumer debt in the United States. Mr. Weinstein has been an industry leader in developing predictive modeling, statistical and quantitative analysis, and pricing strategies for multiple classes of receivables. He is an honors graduate of Stanford University and Boston University School of Law. He has lectured extensively on bankruptcy, creditor rights, commercial litigation and regulatory and compliance issues in the United States and Canada. Michael L. Basile is the Chief Financial Officer of Oak Harbor Capital with over 15 years of experience in the receivables management industry, including his former roles of CFO and Chief Investment Officer at B-Line, LLC and management or consulting roles in multiple other consumer finance and distressed debt companies.Â  Prior management experience also included 5 years with Ernst & Young, LLP (specializing in the securities industry, auditing hedge funds, mutual funds, and fund-of-fund clients) and 4 years as Controller of the HealthPro division of CNA Financial. Mr. Basile holds both the Certified Public Accountant and Charted Global Management Accountant designations.Â  He earned his Bachelor of Science in Accounting from the University of Illinois and his Masters of Finance from Illinois Institute of Technology. Peter J. Fitzpatrick is the General Counsel and Chief Compliance Officer of Oak Harbor Capital. Mr. Fitzpatrick has practiced law for over 30 years. Prior to joining Oak Harbor Capital, he was a partner at K&L Gates LLP, where he served as Oak Harbor Capital’s longstanding outside legal counsel. Prior to commencing his legal career, Mr. Fitzpatrick was a lending officer at The Chase Manhattan Bank where he completed the Chase Credit Training Program with distinction. He also served as the Assistant to the Director of Labor Relations at Citibank, N.A. He graduated with honors from Harvard College and earned his law degree at Fordham Law School. Mr. Fitzpatrick was very involved in the early development of the secondary market for distressed debt and helped pioneer some of the original legal documentation used in the trading of distressed debt when the industry was in its nascent stage. Oak Harbor Capital 4530 South Eastern Avenue, Suite 10 Las Vegas, Nevada 89119 Â 1-855-330-9520 Â Â info@oakharborcapital.com Copyright Â©2022 Oak Harbor Capital. All Rights Reserved."
    },
    {
      "url": "https://www.oakharborchamber.com/about-us/",
      "text": "About Us - Oak Harbor Chamber of Commerce Skip to content Menu HOME RELOCATING Moving to Whidbey Island Retiring on Whidbey Island MILITARY SUPPORT Oak Harbor Military Affairs Committee Military Relocation EVENTS Calendar 2025 Monthly Luncheons Business Community After Hours Whidbey Island Culture Fest Independence Day Celebration Whidbey Wags 5th Annual Collaborative Golf Tournament Military Appreciation Picnic 2025 Awards Banquet New Yearâs Eve Fireworks VISIT WHIDBEY ISLAND Discover Oak Harbor Visitor Information Center Vacation on Whidbey Where To Go, What To Do Filming and Photography in Island County CHAMBER MEMBERS Member Login Join the Chamber Today Business Directory Become a Chamber Ambassador Volunteer ABOUT US Contact Us About Us Oak Harbor Chamber of Commerce Staff Board of Directors Job Postings About Us Vision The primary advocate empowering andÂ connecting members to achieveÂ their business goals Mission Serves and promotes the businessÂ Interests of greater Whidbey Island Serving whidbey island over 70 years First registering as a nonprofit in 1946, The Greater Oak Harbor Chamber of Commerce has always had a strong drive in community/business growth, civic improvement, and helping create opportunities to bring the people of Oak Harbor together in both celebration and activism. That is something that is carried on strong still, through the dedicated Chamber Board, Staff, Ambassadors, and Volunteers. We all have a commonality in our passion for this Community and our support of the Vision and Mission the Greater Oak Harbor Chamber of Commerce strives for. Would you like more information on how to become a Chamber member? Â CLICK HERE © 2025 Oak Harbor Chamber of Commerce | Site by GrowthZone Contact Us phone 360-675-3755 location 32630 SR 20, Oak Harbor, WA 98277 email Email US Members Member Login Member Directory Application to Join Jobs Hours Mon - Fri 9am - 5pm CONNECT Facebook Instagram © 2025 Oak Harbor Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://welcomehomeoakharbor.com/about-us/",
      "text": "About Us – Welcome Home Oak Harbor Skip to content info@welcomehomeoakharbor.com 235 SW 6th Ave, Oak Harbor, WA, 98277 (360) 682-5998 Welcome Home Oak Harbor Main Menu Home Our Home About Us Why Choose Us Reviews Services and Amenities Jobs Gallery Blog Contact Us About Us We created our residential care facility with the goal of providing thoughtful, thorough and professional care for seniors, those who need help in their activities of daily living and those suffering from memory loss, Alzheimer’s disease, other forms of dementia or other care needs within a beautiful and supportive home environment. Catering to our residents’ unique, individual needs is a priority with us. We can prepare diet-specific menus based on individual needs including gluten free, low sodium, diabetes-friendly and others ordered by the residents’ physicians. We created our residential care facility with the goal of providing thoughtful, thorough and professional care for seniors, those who need help in their activities of daily living and those suffering from memory loss, Alzheimer’s disease, other forms of dementia or other care needs within a beautiful and supportive home environment. Contact Us Today Find out why we are leaders in quality residential care for older adults. Contact us today at (360) 682-5998 to ask questions or to schedule a tour of our senior care home. Contact Us Welcome Home Oak Harbor 235 SW 6th Ave, Oak Harbor, WA 98277, USA Phone: (360) 682-5998 Home Our Home About Us Services and Amenities Why Choose Us Reviews Jobs Gallery Blog Contact Us Privacy Policy Cookie Policy Terms of Service Disclaimer Copyright © 2025 Assisted Living Boost! Scroll to Top"
    },
    {
      "url": "https://oakharborverobeach.com/home-health-services/",
      "text": "Home Health Services - Oak Harbor Skip to content Home The Club About Gallery Lifestyle and Activities Extensive Sports and Social Activities Dining Wellness Home Health Services Membership Real Estate Resales Contact Us Home The Club About Gallery Lifestyle and Activities Extensive Sports and Social Activities Dining Wellness Home Health Services Membership Real Estate Resales Contact Us Home Health Services Welcome to Oak Harbor Home Health Services, your FL State licensed in home care provider. As we strive to further the continuum of care we provide at Oak Harbor, we have created this amenity to serve those who aren’t quite yet in need of full-time, permanent assisted living care, the likes of which are accommodated through our Somerset House Assisted Living Facility (License #AL9120). Instead, our goal is to provide part-time, temporary, or interim care to help residents, or prospective future residents of our age-in-place community with only the specific needs they wish to have some assistance with. To us, caring for people comes from the heart and is a combination of enthusiasm, interest, passion, and commitment. We are dedicated to the services we provide and will truly care for you and/or your loved one in times of need. Below are some examples of services we offer. Services Companion care Collect newspapers/mail Personal shopping Transportation services to local doctor appointments Nurse visits (RN/LPN) In home care by a Home Health Aide (“HHA”) or a Certified Nurses Assistant (“CNA”) Medication management Blood pressure and vitals readings on a periodic basis (daily, weekly, or monthly) Respite care Hospital and rehab stay companion The Club’s unique Health and Wellness Center is staffed by an on-site Registered Nurse who assists and advises Members with various medical matters including designing the proper home health care program when needed.  The care provided through the Oak Harbor Home Health allows Members’ families to know that their family member is receiving the best care in their own home. Members needing a more concentrated level of care can make arrangements through the Club’s Health and Wellness Center to enter Somerset House for short or long-term rehabilitation or for continuing assisted living. The facilities and services offered through the Club’s Health and Wellness Center provide a point of difference at Oak Harbor Club.  This amenity is one of the ways that the Oak Harbor Club keeps its Members’ needs as a central focus of the Club. 4755 S. Harbor Drive Vero Beach, FL 32967 For Club Membership Information kjones@oakharborfl.com 772.562.3808 For Real Estate Information Oakharbor@sorensenrealestate.com 772.907.6014 Oakharbor@sorensenrealestate.com 772.907.6014 © 2024 | OAK HARBOR - SALES CENTER - VERO BEACH"
    }
  ]
}