{
  "fuentes": [
    {
      "url": "https://www.astonoaksgolfclub.com/",
      "email": "info@astonoaksgolfclub.com"
    },
    {
      "url": "https://northoaksgolfclub.com/contact-us",
      "email": "nogc@northoaksgolfclub.com"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/tee-times/",
      "email": "proshop@oaksnationalgolfclub.com"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/the-oaks-cafe/",
      "email": "proshop@oaksnationalgolfclub.com"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/",
      "email": "proshop@oaksnationalgolfclub.com"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "email": "david@goldenoaksgolfclub.com"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "email": "info@goldenoaksgolfclub.com"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "email": "office@goldenoaksgolfclub.com"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "email": "rick@goldenoaksgolfclub.com"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "email": "susan@goldenoaksgolfclub.com"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "email": "david@goldenoaksgolfclub.com"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "email": "office@goldenoaksgolfclub.com"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "email": "rick@goldenoaksgolfclub.com"
    },
    {
      "url": "http://www.theoaksgolfclub.co.uk/contact/",
      "email": "info@theoaksgolfclub.co.uk"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/course-information/",
      "email": "proshop@oaksnationalgolfclub.com"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/membership/",
      "email": "proshop@oaksnationalgolfclub.com"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/golf-instruction/",
      "email": "pkenny@pga.com"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/golf-instruction/",
      "email": "proshop@oaksnationalgolfclub.com"
    },
    {
      "url": "https://northoaksgolfclub.com/about-us",
      "email": "krista@northoaksgolfclub.com"
    },
    {
      "url": "https://northoaksgolfclub.com/about-us",
      "email": "pat@northoaksgolfclub.com"
    },
    {
      "url": "https://www.waldenoakscc.com/about/",
      "email": "mbernardo@pga.com"
    },
    {
      "url": "https://www.royaloaks.net/contact-us",
      "email": "rafreedman@comcast.net"
    },
    {
      "url": "https://www.countryoaksgolfclub.com/course/staff/",
      "email": "tmiller@countryoaksgolf.com"
    },
    {
      "url": "https://www.countryoaksgolfclub.com/course/staff/",
      "email": "tmiller@countryoaksgolfclub.com"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/experience-the-new-oaks-national/",
      "email": "proshop@oaksnationalgolfclub.com"
    },
    {
      "url": "https://theoaksgolf.co.uk/about-us/",
      "email": "info@theoaksgolf.co.uk"
    },
    {
      "url": "https://theoaksgolf.co.uk/contact-us/",
      "email": "info@theoaksgolf.co.uk"
    },
    {
      "url": "https://oaksgolf.com/contact-us/",
      "email": "andrew@oaksgolf.com"
    },
    {
      "url": "https://oaksgolf.com/contact-us/",
      "email": "brooklyn@oaksgolf.com"
    },
    {
      "url": "https://oaksgolf.com/contact-us/",
      "email": "dan.albright@oaksgolf.com"
    },
    {
      "url": "https://oaksgolf.com/contact-us/",
      "email": "johns@oaksgolf.com"
    },
    {
      "url": "https://oaksgolf.com/contact-us/",
      "email": "marc@oaksgolf.com"
    },
    {
      "url": "https://oaksgolf.com/contact-us/",
      "email": "oaksoffice@oaksgolf.com"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/1690-oaks-national-golf-club/search",
      "email": "nbc-golf-white@2x.png"
    }
  ],
  "mails": [
    "andrew@oaksgolf.com",
    "brooklyn@oaksgolf.com",
    "dan.albright@oaksgolf.com",
    "david@goldenoaksgolfclub.com",
    "dpylinski@sevenoaksgolf.com",
    "info@astonoaksgolfclub.com",
    "info@goldenoaksgolfclub.com",
    "info@theoaksgolf.co.uk",
    "info@theoaksgolfclub.co.uk",
    "johns@oaksgolf.com",
    "krista@northoaksgolfclub.com",
    "marc@oaksgolf.com",
    "mbernardo@pga.com",
    "nbc-golf-white@2x.png",
    "nogc@northoaksgolfclub.com",
    "oaksoffice@oaksgolf.com",
    "office@goldenoaksgolfclub.com",
    "pat@northoaksgolfclub.com",
    "pkenny@pga.com",
    "proshop@oaksnationalgolfclub.com",
    "rafreedman@comcast.net",
    "rick@goldenoaksgolfclub.com",
    "susan@goldenoaksgolfclub.com",
    "tmiller@countryoaksgolf.com",
    "tmiller@countryoaksgolfclub.com"
  ],
  "nombre_sitio": "oaksnationalgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.astonoaksgolfclub.com/",
      "text": "Home - Aston Oaks Golf Club Skip to main content Skip to footer Aston Oaks Golf Club Home Book A Tee Time Course Proshop Photo Gallery Scorecard Events Weddings & Banquets Tournaments Eclub Facilities Restaurant Contact Online Store Cart Checkout Golf Lessons Improve your game this season! Learn more about scheduling a golf lesson at Aston Oaks Golf Course. Learn More ❯ Book a Tee Time Book online for the best rates available. These rates are only available online and will not be offered by phone or by person. Book Now ❯ Tournaments Our experienced event specialists will make your golf tournament a total success. Read More ❯ Online Store Check out the online store!\r\nPurchase Gift Cards, Memberships and more! Click Here ❯ Home Welcome to Aston Oaks Golf Club A Jack Nicklaus Designed Golf Course Situated on rolling greens above the Ohio River, Aston Oaks takes full advantage of its magnificent location on what was once the initial stake of President William Henry Harrison. Each hole, dramatically sculpted from stands of huge white oak, hickory and other native hardwoods, is a picture waiting to be taken – with its own particular challenge to the golfer. Golf Facilities Before or after your round of golf, relax in the elegant & spacious clubhouse that features beautiful craftsman-style interiors and comfortable furnishings. Our Oak Leaf Restaurant offers a charming dining room and bar area and is open 7 days a week for lunch and twilight meals. Enjoy the patio for outdoor dining! The indoor and outdoor banquet facilities at Aston Oaks offers an ideal setting overlooking the scenic 9th fairway for meetings, special events or weddings. We are able to accommodate groups of various sizes, depending on your requirements. Let us help you plan the perfect Cincinnati golf outing, wedding, business function or banquet. Banquet Facilities Located in a stunningly beautiful setting just minutes west of downtown Cincinnati, the Aston Oaks Banquet Center is one of the areas newest and most scenic banquet and reception facilities, offering fine dining in a country club atmosphere at affordable prices. With comfortable seating for up to 300 guests, the elegantly decorated Oak Room at the Aston Oaks Banquet Center is the perfect setting for wedding receptions, reunions, anniversaries, showers, charity banquets, luncheons, retirement parties, sports banquets, business meetings and more. Whether you are planning a large wedding reception or an intimate dinner, the experienced staff at the Aston Oaks Banquet Center works alongside you. We cover every detail, helping to insure a memorable event. Amenities include a spacious dance floor, fully stocked bar, large screen projection facility and, the gorgeous golf course views. Host your wedding here! Learn about our five star Aston Oaks Banquet Center LEARN MORE Footer FOLLOW US employment book a tee time Contact Info Here at Aston Oaks Golf Club we pride ourselves on the high quality of magnificent golf, superb amenities and outstanding service that we offer our valued customers. We have worked hard over the years to become a staple of the community, and in the process we have earned recognition as one of the region’s premier golf experiences. Address: 1 Aston Oaks Drive North Bend, OH 45052 Phone: (513) 467-0070 Email: info@astonoaksgolfclub.com Weather NORTH BEND WEATHER Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Aston Oaks Golf Club | 1 Aston Oaks Drive North Bend, OH 45052 | (513) 467-0070 Copyright © 2025 Aston Oaks Golf Club All Rights Reserved. Powered by Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://northoaksgolfclub.com/contact-us",
      "text": "Contact Us - North Oaks Golf Club Skip to the main content. Member Login Contact Us Toggle Menu Toggle Menu Member Login Contact Us About Us Golf Amenities Racquets Dining Club Events Membership Employment Facebook Instagram Linkedin Contact Us Contact Us 54 East Oaks Road, North Oaks, MN 55127 Phone: 651.484.6311 Email: NOGC@northoaksgolfclub.com Directions From within North Oaks: Turn north from Hwy 96 West on Pleasant Lake Rd, turn right on East Pleasant Lake Rd. Continue on to East Oaks Rd, the club entrance is on the right. From Minneapolis: Take I-35W north until Exit 27, turn right on to Hwy 96 West. Turn north from Hwy 96 on Pleasant Lake Rd, turn right on East Pleasant Lake Rd. Continue on to East Oaks Rd, the club entrance is on the right. From St. Paul: Take I-35E north until Exit 117, turn left on to Hwy 96 East. Turn north from Hwy 96 East on Pleasant Lake Rd, turn right on East Pleasant Lake Rd. Continue on to East Oaks Rd, the club entrance is on the right. Contact us at North Oaks Golf Club. For membership inquiries, visit our Membership page . Learn More about Membership at North Oaks Golf Club Learn More → Contact Us Contact Us 54 East Oaks Road North Oaks, MN 55127 Office: 651-484-6311 North Oaks Blog North Oaks Blog Golf Lessons for Beginners: Introducing Couch to 9 Holes (C29H) Golf can be intimidating. That's not a secret. Heck, the rules and etiquette would be enough to... © 2025 North Oaks Golf Club Facebook Instagram Linkedin Return to top"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/tee-times/",
      "text": "Tee Times - Oaks National (Kissimmee Oaks) Skip to primary navigation Skip to main content Facebook Outings & Events Email Club Signup Oaks National (Kissimmee Oaks) Home Tee Times Golf Course Course Information Rates & Fees Golf Instruction Membership The Oaks Cafe Outings & Events Golf Outings Events Calendar New Management Contact Contact Us Email Club News & Reviews Golfer Survey Tee Times Sorry, the Tee-Times could not be displayed at this time. Page Footer Contact Us Address : 1500 The Oaks Boulevard Kissimmee, FL 34746 Email : proshop@oaksnationalgolfclub.com Phone : 407-483-3700 Copyright © 2025 Oaks National (Kissimmee Oaks) All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/the-oaks-cafe/",
      "text": "The Oaks Cafe - Oaks National (Kissimmee Oaks) Skip to primary navigation Skip to main content Facebook Outings & Events Email Club Signup Oaks National (Kissimmee Oaks) Home Tee Times Golf Course Course Information Rates & Fees Golf Instruction Membership The Oaks Cafe Outings & Events Golf Outings Events Calendar New Management Contact Contact Us Email Club News & Reviews Golfer Survey The Oaks Cafe Our friendly staff working in the Oaks Café is excited to provide you with delicious, hand-made wraps, hoagies, hot Panini’s with choices of tasty sides or happy to serve you a quick hot dog or brat on the go! We offer a lovely variety of food and drinks including liquor, beer, wine, soft drinks, energy drinks, water and so on. For those early morning tee times, our Oaks Café staff members will have your hot coffee ready! Come join us before your round, during and after. The Oaks Café proudly offers a plethora of sports amidst the 5 large flat screen TV’s around the seating area. Café Gallery Page Footer Contact Us Address : 1500 The Oaks Boulevard Kissimmee, FL 34746 Email : proshop@oaksnationalgolfclub.com Phone : 407-483-3700 Copyright © 2025 Oaks National (Kissimmee Oaks) All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/",
      "text": "Home - Oaks National (Kissimmee Oaks) Skip to primary navigation Skip to main content Facebook Outings & Events Email Club Signup Oaks National (Kissimmee Oaks) Home Tee Times Golf Course Course Information Rates & Fees Golf Instruction Membership The Oaks Cafe Outings & Events Golf Outings Events Calendar New Management Contact Contact Us Email Club News & Reviews Golfer Survey welcome to OAKS NATIONAL Golf club Book Now Contact Us Oaks National Golf Club Designed by legendary Golf Course Architect Karl Litten , Oaks National Golf Club is a “staple” in the Osceola County area. Located only minutes away from Walt Disney World and Orlando’s local attractions, Oaks National offers a tremendous golf experience at an affordable price. You’ll play 18 championship holes amidst the magnificent 100-year old oaks that are the signature of this fine course. Graceful sloping fairways wind around a multitude of pristine bodies of water with the wild turkey, heron, eagles and hawks providing a “gallery” of nature at it’s finest. Come enjoy Oaks National Golf Club, where the beauty of Florida and great golf come together! Our staff is focused on superior customer service and welcomes you to join the fun! Course Info What’s going on @ THE OAKS GOLF CLUB TEE TIMES Book your next round at Oaks National Golf Club. Book Now MEMBERSHIP Join Oaks National Golf Club today. 2024 Memberships GOLF OUTINGS Host your next event at Oaks National! Events Hosting Feel Like a VIP Guest Every Day… The Clubhouse at Oaks National is the perfect place to start and finish your golf experience with a variety of food & beverage options offered at The Oaks Café as well as flat screen TV’s on nearly every wall in the seating area. Warm up on the large practice facility that features 20 range stations, along with a separate chipping and putting green. Shop in the well-stocked Pro Shop that carries the latest in golf accessories and apparel. At the end of your round, enjoy lunch and a ice cold beverage inside or relax on the covered outdoor patio area. Events Calendar This course should be the reason anyone plays golf. The staff is friendly and they care about what is the most important thing in golf, which is being a better player. Easily the most challenging course in the area. You can drive by uptight golf courses all day, you will over pay everywhere. The Oaks is reasonably priced and fun. Remember to bring a few extra balls so can enjoy yourself and play to get better. Five stars. – Google Reviewer Upcoming Events There are no upcoming events. Join us EXPERIENCE OAKS NATIONAL BOOK NOW Page Footer Contact Us Address : 1500 The Oaks Boulevard Kissimmee, FL 34746 Email : proshop@oaksnationalgolfclub.com Phone : 407-483-3700 Copyright © 2025 Oaks National (Kissimmee Oaks) All Rights Reserved. Powered by"
    },
    {
      "url": "https://goldenoaksgolfclub.com/about-us/",
      "text": "About Us - Golden Oaks 610-944-6000 Info@goldenoaksgolfclub.com Facebook Instagram Facebook Instagram Home Tee Times Golf Golf Course Memberships Golf Simulators Pro Shop Golf Rates Scorecard About Us Contests & Raffles Host an Event Stay and Play Bogeys Pub Events News Contact Us Employment Select Page About Golden Oaks Golden Oaks is an award-winning high-end public golf club offering golfers a “Country Club Experience” without Country Club Prices. Golden Oaks Golf Club is the perfect venue for Corporate Functions and Golf Tournaments and is the home of the PIAA Eastern PA Championship. Book a Tee Time Rick Haring General Manager Rick@GoldenOaksGolfClub.com Susan Keefe Office Manager & Private Events Coordinator Office@GoldenOaksGolfClub.com David Zwoyer Pro Shop Manager & Director of Golf David@GoldenOaksGolfClub.com There are no upcoming events at this time. Subscribe to the Newsletter It's the easiest and best way to be informed about upcoming special events and programs at Golden Oaks! Success! Name Email Subscribe  Golden Oaks 10 Stonehedge Drive Fleetwood, PA 19522  Email Susan@goldenoaksgolfclub.com  Phone (610) 944-6000  Golf Shop Hours 8 AM – 7 PM, 7 Days a Week  Bogeys Pub Hours Monday– Sunday: 11am – 8pm © Golden Oaks Golf Club. All Rights Reserved. Website Design by FXV Digital Design ."
    },
    {
      "url": "http://www.theoaksgolfclub.co.uk/contact/",
      "text": "Contact – The Oaks Golf Club and Spa Toggle navigation Home Book a Tee Time Member Tee Time Booking Visitor Tee Time Booking The Golf Course Golf Membership Corporate / Society Golf Days Green Fee Rates Members Fixtures Card Golf Tuition Open Competitions Upcoming Opens Open Results Pro Am Menu & Events Bar Menu Sunday Lunch Functions and Events Christmas Events Golf Shop Custom Fitting The Oaks Shop Gift Vouchers The Spa Accommodation Contact Get In Touch 01757 288577 info@theoaksgolfclub.co.uk Our Policies Club Wellfare Officer Details Safeguarding Adults Safeguarding Children & Young Adults Skip to content Home Book a Tee Time Member Tee Time Booking Visitor Tee Time Booking The Golf Course Golf Membership Corporate / Society Golf Days Green Fee Rates Members Fixtures Card Golf Tuition Open Competitions Upcoming Opens Open Results Pro Am Menu & Events Bar Menu Sunday Lunch Functions and Events Christmas Events Golf Shop Custom Fitting The Oaks Shop Gift Vouchers The Spa Accommodation Contact Search for: Toggle sidebar & navigation Contact Ready to Help If you have any questions or would like to know more about what services we offer then please get in touch. Our friendly team is waiting to take you call and answer any questions you may have. If you would like to know more about our beautiful Spa please click here or if you are interested in our wedding venue services please click here We look forward to hearing from you The Oaks team Get in Touch The Oaks Golf Club, Aughton Common, Aughton, York, YO42 4PW Tel: 01757 288577 Email: info@theoaksgolfclub.co.uk Powered by WordPress Inspiro WordPress Theme by WPZOOM"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 52° Wed 09/10 clear sky 72°/47° Thu 09/11 clear sky 71°/50° Fri 09/12 clear sky 72°/51° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/course-information/",
      "text": "Course Information - Oaks National (Kissimmee Oaks) Skip to primary navigation Skip to main content Facebook Outings & Events Email Club Signup Oaks National (Kissimmee Oaks) Home Tee Times Golf Course Course Information Rates & Fees Golf Instruction Membership The Oaks Cafe Outings & Events Golf Outings Events Calendar New Management Contact Contact Us Email Club News & Reviews Golfer Survey Course Information Course Information, Scorecard & Photos Design: Oaks National Golf Club features a tremendous Karl Litten designed golf course that originally opened in 1986 and has been completely rebranded in 2015. Oaks National is a “staple” in the Osceola County area with a layout & design that is timeless to anyone that has a passion for the game of golf. Course: Immersed with ancient-old oak trees and picturesque bodies of water throughout, Oaks National provides for a very special golf experience. These views make the golf experience unique among the best golf courses in Florida. Captivating wildlife enhances the natural beauty of the environment creating a harmonious transition from Mother Nature to golf course. With the thoughtful location of four sets of tees, the peaceful and serene setting presents an inviting challenge that can be enjoyed by players of all skill levels. Proshop: The Oaks National Golf Shop is fully-stocked and features the latest in our logoed apparel and accessories from the top manufacturers. Pick up something for yourself to improve your round or find the perfect gift for your friends or family. Our experienced staff happily assist you with gift selections, gift certificate purchases, and tournament-prize selections. #1 In the United States! Proud Winner! Oaks National was named GolfAdvisor’s 2016 Winner for the Top 25 Most Improved Courses in the US! Click the logo below for the full article Scorecard Course Photo Gallery Page Footer Contact Us Address : 1500 The Oaks Boulevard Kissimmee, FL 34746 Email : proshop@oaksnationalgolfclub.com Phone : 407-483-3700 Copyright © 2025 Oaks National (Kissimmee Oaks) All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/membership/",
      "text": "Membership - Oaks National (Kissimmee Oaks) Skip to primary navigation Skip to main content Facebook Outings & Events Email Club Signup Oaks National (Kissimmee Oaks) Home Tee Times Golf Course Course Information Rates & Fees Golf Instruction Membership The Oaks Cafe Outings & Events Golf Outings Events Calendar New Management Contact Contact Us Email Club News & Reviews Golfer Survey Membership Oaks National Seasonal/Annual Golf Memberships 24-25 Single Seasonal Membership Nov 1, 2024- April 30, 2025 $950.00 (Pay only $24.95 Cart Fee for 18 and $14.95 for 9 per person* ). Priority tee times, invitations to special events, 50% discount on range membership, 10% off golf merchandise and a complimentary GHIN handicap included . Family Seasonal Membership Nov 1, 2024- April 30, 2025 $1650.00 (Pay only $24.95 Cart Fee for 18 and $14.95 for 9 per person* ). Priority tee times, invitations to special events, 50% discount on range membership, 10% off golf merchandise and a complimentary GHIN handicap included . Kids and grandkids 18 years of age or under are considered family. Single Annual Membership $1650.00 (Pay only $24.95 Cart Fee for 18 and $14.95 for 9 per person**). Priority tee times, invitations to special events, 50% discount on range membership, 10% off golf merchandise, and a complimentary GHIN handicap included. Family Annual Membership $2650.00 (Pay only $24.95 Cart Fee for 18 and $14.95 for 9 per person* ). Priority tee times, invitations to special events, 50% discount on range membership, 10% off golf merchandise and a complimentary GHIN handicap included . Kids and grandkids 18 years of age or under are considered family. Seasonal/Annual Driving Range Memberships Annual Driving Range Fee $125 a month (12 month contract) Small bucket $7.50 Large bucket $12.00 Club Rental $45.00 *By request only ** For single and Family ANNUAL membership only. Cart fees off season from June 1- Sept. 30th are charged for a 9 hole cart fee rate regardless of the amount of holes played that day. All pricing above does not include taxes/fees. Please call the clubhouse 407-483-3700 for more details. Page Footer Contact Us Address : 1500 The Oaks Boulevard Kissimmee, FL 34746 Email : proshop@oaksnationalgolfclub.com Phone : 407-483-3700 Copyright © 2025 Oaks National (Kissimmee Oaks) All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/golf-instruction/",
      "text": "Golf Instruction - Oaks National (Kissimmee Oaks) Skip to primary navigation Skip to main content Facebook Outings & Events Email Club Signup Oaks National (Kissimmee Oaks) Home Tee Times Golf Course Course Information Rates & Fees Golf Instruction Membership The Oaks Cafe Outings & Events Golf Outings Events Calendar New Management Contact Contact Us Email Club News & Reviews Golfer Survey Golf Instruction Golf Lessons & Instruction Lessons & Clinics: Golf Professional, John Broyles 30 mins – $50 1 hour – $90 Playing Lessons for 9 or 18 holes also available. Please call (407) 483-3700 or fill out the form to the right to inquire. Practice Facilities: Our practice facility features a full, 20-station target range as well as a separate putting green and chipping area. Lesson Inquiry Please enable JavaScript in your browser to complete this form. Name * First Last Email Address * Phone Number Select Lesson Type * Individual Lesson Group Lesson Lesson Series Playing Lessons Clinic / Camp Additional Details Submit Golf Instruction Team Paul Kenny, PGA Tel: (407) 729-7444  • E-mail: pkenny@pga.com Paul is a native of Bethel, CT and has spent the past 25 years in the golf business. What started out as a game became a passion and a career for Paul. He then moved south to further his career. While working at Blackmoor and Quail Creek he found his love for teaching the game of golf to all skill levels. After getting his PGA card in 1996 Paul moved back to CT. Working at CT Golf Center under Marsha Dolen as Head Teaching Professional, Paul learned how to teach students not just a golf swing. After many years Paul’s beliefs are simple, you teach a student how to swing for themselves with the shape and flexibility that they have, not just teach one swing to everyone. While in Florida, Paul has hosted his own television show, “Golfing with Paul E. Kenny” as well writing articles for a local newspaper. In Paul’s off time he works hard on his own game, playing on the mini tours with some success, he believes that it is important to know how all the students feel when they play tournament golf. Paul’s laid back style of teaching helps with the communication with his students, keeping it simple for the student to understand the golf swing and the game, making it more enjoyable. Package options and rates are as listed below. Paul is available to set up lessons based around your schedule.  If you have any questions or would like to set up a lesson, feel free to contact Paul through call, text, or e-mail. Lesson Programs & Rates Adults: 1 – 45 minute lesson:  $50.00 3 – 45 minute lessons:  $135.00 5 – 45 minute lessons: $225.00 Juniors: 1 – 30 minute lesson: $35.00 3 – 30 minute lessons: $90 Clinics: 3 or more adults: $20.00 (per person) 3 or more juniors: $15.00 (per person) Half day golf school: $150.00 (please contact for details) Page Footer Contact Us Address : 1500 The Oaks Boulevard Kissimmee, FL 34746 Email : proshop@oaksnationalgolfclub.com Phone : 407-483-3700 Copyright © 2025 Oaks National (Kissimmee Oaks) All Rights Reserved. Powered by"
    },
    {
      "url": "https://northoaksgolfclub.com/about-us",
      "text": "About Us - North Oaks Golf Club Skip to the main content. Member Login Contact Us Toggle Menu Toggle Menu Member Login Contact Us About Us Golf Amenities Racquets Dining Club Events Membership Employment Facebook Instagram Linkedin Building Connections Since 1951. At North Oaks Golf Club, being a member is a point of pride. Explore a Northwoods retreat without leaving the Metro area. Nestled just northeast of Minneapolis-St. Paul, North Oaks Golf Club gathers Minnesota families to build friendships, share everyday experiences, enjoy exceptional dining, celebrate special occasions, and enjoy golf and tennis. Find Your Belonging What once was the James J. Hill Farm in 1883 became a quiet residential community and retreat carried out by his son, Louis W. Hill, in 1948. Renowned architect Stanley Thompson was hired to design North Oaks Golf Club, which became his only course in Minnesota and the last course he designed in North America. Minnesota's own Tom Lehman revitalized our championship course, and it remains the envy of many amateur and professional golfers. Since 1951, aspiring and skilled golfers have tested their skills at one of the finest private community clubs in the Twin Cities and one of the most fun, challenging, and enjoyable golf courses in Minnesota. Then 1949 North Oaks Golf Club established 1949 1950 Course construction with Stanley Thompson 1951 Original clubhouse and Grand Opening with Patty Berg and Dot Kielty 1951 1966 Pro Shop addition 1975 NOGC 25 th Anniversary 1975 1991 New clubhouse ribbon cutting 1999 NOGC 50 th Anniversary 1999 2018 Clubhouse design remodel ribbon cut 2022 Lehman Master Plan 2.0 2022 2024 NOGC 75 th Anniversary 2025 Turf Maintenance Facility 2025 Now Headline goes here This is is supporting text. Where Community and Nature Thrive Together North Oaks Golf Club offers members and guests a premier private club experience in our unique Northwoods setting, while preserving its diverse wildlife and natural beauty for future generations. We remain committed to environmental stewardship while enhancing the golf experience. Meet Our Team Patrick Markley General Manager 651.444.1225 Pat@NorthOaksGolfClub.com Krista Dordal Director of Membership 651.444.1226 Krista@NorthOaksGolfClub.com Learn More about Membership at North Oaks Golf Club Learn More → Contact Us Contact Us 54 East Oaks Road North Oaks, MN 55127 Office: 651-484-6311 North Oaks Blog North Oaks Blog Golf Lessons for Beginners: Introducing Couch to 9 Holes (C29H) Golf can be intimidating. That's not a secret. Heck, the rules and etiquette would be enough to... © 2025 North Oaks Golf Club Facebook Instagram Linkedin Return to top"
    },
    {
      "url": "https://www.waldenoakscc.com/about/",
      "text": "Walden Oaks About Us HOME MEMBERSHIP EVENTS WEDDINGS / PARTIES CATERING GALLERY CONTACTS ABOUT EVENTS ABOUT US WELCOME TO WALDEN OAKS Walden Oaks Country Club is one of the area’s most renowned golf clubs with a truly beautiful championship 18 hole golf course. We are a fully integrated 18-hole championship golf course located in Cortland, NY that is open to the public. Our season typically runs from the last week in March thru December. Professional sport equipment at our Pro Shop Click Here Amazing scenery Golf cart for each member S ee our rates and reciprocals information Click Here INSTRUCTION AND GOLF LESSONS Course Layout Leagues Instruction & Lessons WALDEN OAKS FEATURES REGULAR COMPETITIONS Golf competitions for amateurs and professional players FULL PRO SHOP Golf irons, balls, golf bags & carts, gloves, apparel, shoes and accessories QUALIFIED INSTRUCTORS Our qualified instructors will help you make a better start in your golf training 18-HOLE GOLF COURSE With the biggest links course in the USA, we have been hosting EVENTS MEMBER-MEMBER 3 MAY 2020 MEMBER-MEMBER CAPT'N'MATE This Captian And Mate tournament is a great way to start off the year.  The tournament uses 80% Of Combind handicap and is followed by dinner. FRIDAY NIGHT COUPLES SPRING 22 MAY 2020 FRIDAY NIGHT COUPLES SPRING CAPT'N'MATE SPRING MIXER A great time and place to be with friends and friends you have not made yet. The tournament uses 100% Of Combind handicap and is followed by complementary dinner. MEMBER-PARTNER 31 MAY 2020 MEMBER-PARTNER CAPT'N'MATE TOURNAMENT Everyone will enjoy this amazing competition to find out the winner among our experienced players. The tournament uses 80% Of Combind handicap and is followed by dinner. FATHERS DAY 21 JUNE 2020 FATHERS DAY CAPT'N'MATE TOURNAMENT We can not wait to show you how fun it is to be in a tournament here. This is a 100% Combind handicap. ALL EVENTS C ortlands Elite Golf Club We make the game available to any person who wants to play golf with enjoyment. LATEST NEWS Ways To Improve Your Short Game Golfer’s Wish List: How To Fix A Slice Tips For Improving Your Game CONTACT Address 3369 Walden Oaks Boulevard Cortland, New York 13045 Telephone: (607) 753-9452 Fax: (607) 753-3572 Email: mbernardo@pga.com GALLERY © 2020 Walden Oaks Country Club All Rights Reserved Terms of use and Privacy policy Marcus Bernardo PGA Pro  (607) 753-9452 ×"
    },
    {
      "url": "https://www.royaloaks.net/contact-us",
      "text": "Contact Us | Royal Oaks Country Club Home About the Club Facilities Contact Us Careers Membership Request More Information Golf Golf Course Practice Facilities Player Development Golf Professionals Events Our Spaces Corporate Events & Meetings Spaces Weddings & Receptions Social Events & Holiday Parties Request More Information Member Login Menu Home About the Club Facilities Contact Us Careers Membership Request More Information Golf Golf Course Practice Facilities Player Development Golf Professionals Events Our Spaces Corporate Events & Meetings Spaces Weddings & Receptions Social Events & Holiday Parties Request More Information Member Login Home About the Club Facilities Contact Us Careers Home About the Club Facilities Contact Us Careers Contact Information Clubhouse: (360)256-1250 Golf Shop: (360)256-1350 Key Staff Marcia LaFond General Manager [email protected] Scott Leritz, PGA Head Golf Professional [email protected] Gordon Kiyokawa Golf Course Superintendent [email protected] Tami Bringman, MBA Controller [email protected] Brian Johnson Assistant General Manager [email protected] Kevin Klinicke Food & Beverage Director [email protected] Brian McElmeel Executive Chef brianM @royaloaks.net Sara Gilbert Director of Catering [email protected] Dana Hollowell Office Administrator [email protected] Eva Grady Accounting Specialist [email protected] Antonia Hernandez Administrative Assistant Personal Trainer Rich Freedman [email protected] Heidi Marshall [email protected] Chad Lowe Facilities Manager [email protected] home Membership Golf Events Member Login Royal Oaks Country Club, 8917 NE Fourth Plain Blvd. Vancouver, WA 98662 Clubhouse: (360) 256-1250 Golf Shop: (360) 256-1350 Copyright © Royal Oaks Country Club. All rights reserved. Powered by Northstar Technologies Inc. Member Login"
    },
    {
      "url": "https://www.countryoaksgolfclub.com/course/staff/",
      "text": "Staff - Country Oaks Golf Club Skip to primary navigation Skip to main content Skip to footer Country Oaks Golf Club Montgomery, IN Home Tee Times Course Course Layout Golf Instruction Course Videos Group Outings Gallery Rates Staff Events Pro Shop Pro Shop Club Repairs/Grips Email Club Contact Us Book My Tee Time Buy Gift Cards Online Staff PRO SHOP STAFF TREY MILLER General Manager / Head Golf Professional: Trey has been at Country Oaks since 2003, and has held the General Manager / Director of Golf position since the end of 2008. Trey is a graduate of Indiana University with a bachelor’s degree in Sports Marketing & Management (2007), and his Master’s in Athletic Administration (2009). Email : tmiller@countryoaksgolfclub.com AMY PERKINS Amy has been at Country Oaks since the beginning in 1997 serving as the office manager and human resources coordinator. DOMINIC DEPASS – Pro Shop Assistant Dominic is a graduate of Washington High School, and began working at Country Oaks Golf Club beginning in 2020 GROUNDS STAFF MAX NICKLESS Superintendent : Max joined the Country Oaks staff in the summer of 2010 as Head Golf Course Superintendent. Previously Max held the Superintendent and Pro Shop Manager job at Bicknell Country Club from 1995-2010. Max is a member of the Tri-State Superintendent Golf Association. BERT LENGACHER Assistant Superintendent : Bert has been a part of the Country Oaks Golf Club staff since 1997, and serves as the assistant superintendent. Forrest Chanley Assistant Superintendent : Forrest has been a part of the Country Oaks Golf Club staff since 2019, and serves as an assistant superintendent. Footer Visit Us Country Oaks Golf Club 5064 E. US HWY 50 Montgomery, IN 47558 Follow Us Contact Us Phone: (812) 486-3300 Email: tmiller@countryoaksgolfclub.com Country Oaks Golf Club | 5064 E. US HWY 50 | Montgomery, IN 47558 | Phone: (812) 486-3300 Copyright © 2025 Country Oaks Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.oaksnationalgolfclub.com/experience-the-new-oaks-national/",
      "text": "Experience the New Oaks National - Oaks National (Kissimmee Oaks) Skip to primary navigation Skip to main content Facebook Outings & Events Email Club Signup Oaks National (Kissimmee Oaks) Home Tee Times Golf Course Course Information Rates & Fees Golf Instruction Membership The Oaks Cafe Outings & Events Golf Outings Events Calendar New Management Contact Contact Us Email Club News & Reviews Golfer Survey Experience the New Oaks National Oaks National Golf Club Under New Management: A Fresh Start and Exciting Changes! Oaks National Golf Club is under new management and is completely revamping the experience for all golfers. Xude Hospitality ( www.xudehospitality.com ) is excited to announce the recent acquisition of Oaks National. Here’s a look at what’s new, what’s changed, and why you should come out and enjoy the upgraded Oaks National Golf Club. Exciting Course Renovations and New Equipment The biggest change at Oaks National is the course itself. Significant renovations have been made and are in process to improve the conditions and playability. This includes: Improved fairways, approaches and collars Reducing length and thickness of rough Bunkers refreshed Restoring power and upgrading irrigation system New golf cars New maintenance equipment On course beverage cart service New course signage, ball washers, markers and accessories Whether you’re hitting the links for the first time in a while or a regular visitor, you’ll notice the difference in the quality of the course! Enhanced Clubhouse, Player and Dining Experiences It’s not just the course that’s getting a makeover. The Oaks National is expanding its pro shop merchandise, food offerings and new player programs. Expanding all merchandise lines Expanding kitchen menu and adding food truck Increasing beer, wine and spirit selections Player Development Program (a low cast barrier to learn to play golf with professional instruction and on course learning) A Fresh Approach to Golfing With new management comes a fresh approach to hospitality and customer service. Whether you’re here for a quick round or a full-day experience, you can expect top-notch service at every turn. The new team is committed to ensuring your time at Oaks National is memorable and enjoyable. Come Out and Experience the New Oaks National! We invite golfers to visit Oaks National Golf Club and experience the new and improved facilities for yourself. With renovations to the course, clubhouse and a welcoming atmosphere, it’s the perfect time to rediscover the Oaks National Golf Club. So, what are you waiting for? Grab your clubs, come out to the Oaks National, and enjoy a fantastic round of golf at one of the best affordable courses in town! BOOK NOW Page Footer Contact Us Address : 1500 The Oaks Boulevard Kissimmee, FL 34746 Email : proshop@oaksnationalgolfclub.com Phone : 407-483-3700 Copyright © 2025 Oaks National (Kissimmee Oaks) All Rights Reserved. Powered by"
    },
    {
      "url": "https://theoaksgolf.co.uk/about-us/",
      "text": "About Us | The Oaks Golf Centre Skip to content Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Menu Close Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us VISITORS TEE TIME MEMBERS PRIORITY TEE TIME Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us VISITORS TEE OFF TIME BOOKINGS MEMBERS LOGIN MEMBERS PRIORITY TEE OFF TIME BOOKINGS VISITORS TEE OFF TIME BOOKINGS VISITORS TEE OFF TIME BOOKINGS MEMBERS PRIORITY TEE OFF TIME BOOKINGS Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us ABOUT US Call or Email us Telephone: 020 8643 8363 Email: info@theoaksgolf.co.uk HOURS oF OPENING 18-Hole Horley Course 9-Hole Acorn Course Weekdays from 7am Thursday to Sunday 8.30am to 8pm Driving Range: Driving Range open from 9am to 9pm Weekdays from 7am Thursday to Sunday 8.30am to 8pm Golf Pro Shop: Driving Range open from 9am to 9pm Open from 7am to 9pm weekdays and 7am to 8pm weekends How to find us… The Oaks Golf and Conference Centre Woodmansterne Road, Carshalton,Surrey SM5 4AN CLICK AND SCROLL THE LIVE MAP BELOW USEFUL LINKS Member's Login General Enquiries Membership Enquiries Visitors Golf Lessons Pro Shop Areas We Cover Blogs Opening Hours Shop hours- 7am-9pm Mon-Sun (stop serving 8:30pm) Driving Range Driving range hours- 9am-9pm Mon-Sun (stop serving 8:30pm) Cafe & Bar Monday to  Sunday - 8:00am to 9:00pm Friday and Saturday COURSES 18-Hole Horley Course 9-Hole Acorn Course EVENTS Function Suite Weddings Funeral Receptions Celebrations Opening Hours Shop Monday  to Thursday - 8:00am to 9:00pm Saturday and Sunday - 8:00am to 7:00pm Driving Range Monday  to Friday  - 9am to 9pm (Last balls 8.30pm) Saturday & Sunday 9am to 7pm (Last balls 6.30pm) Cafe & Bar Monday to  Sunday - 8:00am to 9:00pm Friday and Saturday CONTACT US 020 8643 8363: General 020 8722 0238: Events 020 8722 0236: Cafe/ Bar info@theoaksgolf.co.uk Map-marker-alt CLOSE CLOSE CLOSE"
    },
    {
      "url": "https://theoaksgolf.co.uk/contact-us/",
      "text": "Contact Us - Oaks Golf Club Skip to content Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Menu Close Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us VISITORS TEE TIME MEMBERS PRIORITY TEE TIME Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us VISITORS TEE OFF TIME BOOKINGS MEMBERS LOGIN MEMBERS PRIORITY TEE OFF TIME BOOKINGS VISITORS TEE OFF TIME BOOKINGS VISITORS TEE OFF TIME BOOKINGS MEMBERS PRIORITY TEE OFF TIME BOOKINGS Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us GET IN TOUCH We are looking forward to hearing from you. You can contact us via the phone numbers listed below or through the contact form provided. Enquiry Type General Enquiry Events Society Δ How to find us… The Oaks Woodmansterne Road, carshalton,Surrey SM5 4AN CLICK AND SCROLL THE LIVE MAP BELOW SUBSCRIBE NOW Subscribe now to receive exclusive offers, forthcoming events and news via email Δ USEFUL LINKS Member's Login General Enquiries Membership Enquiries Visitors Golf Lessons Pro Shop Areas We Cover Blogs Opening Hours Shop hours- 7am-9pm Mon-Sun (stop serving 8:30pm) Driving Range Driving range hours- 9am-9pm Mon-Sun (stop serving 8:30pm) Cafe & Bar Monday to  Sunday - 8:00am to 9:00pm Friday and Saturday COURSES 18-Hole Horley Course 9-Hole Acorn Course EVENTS Function Suite Weddings Funeral Receptions Celebrations Opening Hours Shop Monday  to Thursday - 8:00am to 9:00pm Saturday and Sunday - 8:00am to 7:00pm Driving Range Monday  to Friday  - 9am to 9pm (Last balls 8.30pm) Saturday & Sunday 9am to 7pm (Last balls 6.30pm) Cafe & Bar Monday to  Sunday - 8:00am to 9:00pm Friday and Saturday CONTACT US 020 8643 8363: General 020 8722 0238: Events 020 8722 0236: Cafe/ Bar info@theoaksgolf.co.uk Map-marker-alt CLOSE CLOSE CLOSE"
    },
    {
      "url": "https://oaksgolf.com/contact-us/",
      "text": "Contact Us - The Oaks Golf Club Toggle navigation Pro Shop 519.652.1762 | Office 519.652.1760 Home Golf Course Weddings Membership Tournaments Contact Us Members Login Login Clubhouse Members Calendar Accounting Mem. Bus. Directory Online Food Order Pickleball Court Booking 519.652.1760 Contact Us sprzedam tanie szwajcarskie rolex podróbka eta. Contact Information General Manager – Membership and Tournament Inquiries: John Schidowka (ext. 1) johns@oaksgolf.com Superintendent: Dan Albright (519-652-3177) dan.albright@oaksgolf.com Golf Professional: Marc Webster (519-652-1762) marc@oaksgolf.com Wedding Inquiries – Food & Beverage Manager-Special Events Brooklyn Hanson brooklyn@oaksgolf.com Executive Chef: Andrew Rigg (ext. 6) andrew@oaksgolf.com Accounts: Lois Hess (ext. 4) oaksoffice@oaksgolf.com Mailing Address: PO Box 7 Komoka, Ontario N0L 1R0 Employment Opportunities The Oaks objective is to find enthusiastic, service-oriented individuals committed to excellence. Our management and staff believe in a TEAM (Together Everyone Achieves More) atmosphere. If you are or know someone interested in joining the team, employment opportunities may be available at The Oaks during the season. For clubhouse employment, please forward your resume to John Schidowka at johns@oaksgolf.com . For all other areas of employment, please refer to the contact header in the menu bar for the appropriate contact. The Oaks Golf Cub welcomes applications from people with disabilities. Accommodations are available upon request. About The Oaks Golf Club 1552 Gideon Drive, Delaware, Ontario  N0L 1E0 Office 519.652.1760 Pro Shop 519.652.1762 Maintenance 519.652.3177 © 2025 The Oaks Golf Club | Privacy | Terms of Use Website by YasTech Developments"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/1690-oaks-national-golf-club/search",
      "text": "Oaks National Golf Club Tee Times - Kissimmee FL Log In / Sign Up Hot Deals Courses Near Me Destinations Best Courses Rewards Join GolfPass Gift Cards Search Hot Deals Near Me Off Sort Distance Time Price Golfers Holes Facility Type Reset Filters League Available Oaks National Golf Club 1500 The Oaks Blvd , Kissimmee , Florida , 34736 Holes 18 Par 72 Length 6902 yards Slope 131 Rating 73.7 \"Making Golf Affordable Again\" Try our NEW Champion Bermuda G12 Greens...The putting surfaces are amazing! \nDesigned by legendary Golf Course Architect Karl Litten, Oaks National Golf Club is a \"staple\" in the Osceola County area. Located only minutes away from Walt Disney World and Orlando's local attractions, Oaks National offers a tremendous golf experience at an affordable price. You'll play 18 championship holes amidst the magnificent 100-year old oaks that are the signature of this fine course. Graceful sloping fairways wind around a multitude of pristine bodies of water with the wild turkey, heron, eagles and hawks providing a \"gallery\" of nature at it's finest. Come enjoy Oaks National Golf Club, where the beauty of Florida and great golf come together! Our staff is focused on superior customer service and welcomes you to join the fun! One of the Orlando Area's Top Courses You Can Play Read More... Directions Course Details Review Leagues Available Social golf leagues available at this course Join Now Powered by Spark Golf We partnered up with Spark Golf to bring you social, competitive 9-hole leagues at your favorite courses. Each round has a 2-person team & individual game with end of league champs. Compete in a laid-back atmosphere over 9-holes Play with friends and meet like-minded new ones. Join the League × Last Modified: 9/8/2025 8:24:01 PM +00:00 Policies Metal spikes allowed: No Credit cards accepted: VISA, MasterCard, Discover Welcomed Rentals/Services Carts: Yes Clubs: Yes Practice/Instruction Driving range: Yes Pitching/chipping area: Yes Putting green: Yes Teaching pro: Yes Read More... View Full Map Directions More Hot Deals Searching next 3 days... × There are no Hot Deals available for the date selected. Fetching more results... Unable to Complete Search We're sorry, there was an error completing your search. Try changing locations, changing the date, expanding your distance, or updating your filters. How About a Mulligan? We’re sorry, there are currently no available tee times for your search. Try changing locations, changing the date, expanding your distance, or updating your filters. In the cabbage. There are no Daily Deal options on this date. Please check back again for another shot at Daily Deals. Check Next Day View All Nearby Tee Times Search Hot Deals Get your golf on Information About Us Careers Contact Us Help Gift Cards Rewards Premier Card Ad Choices Privacy Policy Cookie Preferences CA Notice Terms of Service - New Resources Destinations Best Tee Time Deals Weekend Tee Times Course Directory Private Club Directory GolfNow Reviews Mobile Apps Promotions Blog Simulators Private Clubs Featured Courses GolfNow Spotlights Club Champion Fittings Businesses Partner Support Golf Facilities GolfNow for Courses List My Facility on GolfNow Other Partnership Requests Partner Brands NBC Sports Golf Channel GolfPass GolfNow Compete TeeOff SportsEngine HQ SportsEngine Motion Don't miss out on great golf deals, special offers and more! Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Stay Connected Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Subscribe Our Mobile Apps © Copyright 2025 GolfNow. All rights reserved."
    }
  ]
}