{
  "fuentes": [
    {
      "url": "https://www.straitcountrytribute.com/event-details-registration/orange-blossom-opry-matinee-weirsdale-fl",
      "email": "office@obopry.com"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "alee@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "boardchair@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "cco@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "cdo@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "ceo@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "cfo@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "cto@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "cwilson@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "dsteves@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "ecureton@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "emiller@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "equityleader@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "hyoung@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "jling@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "kfv@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "klocke@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "kwg@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "legal@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "lkissling@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "people@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "programming@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "rellis@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "rprobst@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "schleicherj@washpost.com"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "stumarkin@opb.org"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "email": "tbrynelson@opb.org"
    },
    {
      "url": "https://www.orange.edu.au/contact-us/",
      "email": "info@orange.edu.au"
    },
    {
      "url": "https://local.aarp.org/place/the-orange-blossom-opry-weirsdale-fl.html",
      "email": "flaarp@aarp.org"
    },
    {
      "url": "https://www.iobeya.com/template/okr-board/",
      "email": "logo-iobeya-blanc@3xok-300x76.png"
    },
    {
      "url": "https://www.iobeya.com/template/okr-board/",
      "email": "logo-iobeya-blanc@3xok.png"
    },
    {
      "url": "https://www.iobeya.com/template/okr-board/",
      "email": "logo-iobeya@3x-1-1-300x76.png"
    },
    {
      "url": "https://www.iobeya.com/template/okr-board/",
      "email": "logo-iobeya@3x-1-1.png"
    },
    {
      "url": "https://www.iobeya.com/template/okr-board/",
      "email": "logo-iobeya@3x-1-300x76.png"
    },
    {
      "url": "https://www.iobeya.com/template/okr-board/",
      "email": "logo-iobeya@3x-1.png"
    },
    {
      "url": "https://www.iobeya.com/template/okr-board/",
      "email": "logo-iobeya@3x.png"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "alee@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "cwilson@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "dsteves@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "ecureton@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "emiller@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "hyoung@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "jling@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "kfv@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "kwg@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "lkissling@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "rellis@opb.org"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "schleicherj@washpost.com"
    },
    {
      "url": "https://www.opb.org/about/",
      "email": "tbrynelson@opb.org"
    },
    {
      "url": "https://www.straitcountrytribute.com/event-details-registration/orange-blossom-opry-weirsdale-fl",
      "email": "office@obopry.com"
    },
    {
      "url": "https://pocoband.com/tour/orange-blossom-opry",
      "email": "info@skylineonline.com"
    },
    {
      "url": "https://pocoband.com/tour/orange-blossom-opry",
      "email": "office@obopry.com"
    },
    {
      "url": "https://pocoband.com/tour/orange-blossom-opry",
      "email": "rickalter@aol.com"
    }
  ],
  "mails": [
    "alee@opb.org",
    "boardchair@opb.org",
    "cco@opb.org",
    "cdo@opb.org",
    "ceo@opb.org",
    "cfo@opb.org",
    "cto@opb.org",
    "cwilson@opb.org",
    "dsteves@opb.org",
    "ecureton@opb.org",
    "emiller@opb.org",
    "equityleader@opb.org",
    "flaarp@aarp.org",
    "hyoung@opb.org",
    "info@orange.edu.au",
    "info@skylineonline.com",
    "jling@opb.org",
    "kfv@opb.org",
    "klocke@opb.org",
    "kwg@opb.org",
    "legal@opb.org",
    "lkissling@opb.org",
    "logo-iobeya-blanc@3xok-300x76.png",
    "logo-iobeya-blanc@3xok.png",
    "logo-iobeya@3x-1-1-300x76.png",
    "logo-iobeya@3x-1-1.png",
    "logo-iobeya@3x-1-300x76.png",
    "logo-iobeya@3x-1.png",
    "logo-iobeya@3x.png",
    "office@obopry.com",
    "people@opb.org",
    "programming@opb.org",
    "rellis@opb.org",
    "rickalter@aol.com",
    "rprobst@opb.org",
    "schleicherj@washpost.com",
    "stumarkin@opb.org",
    "tbrynelson@opb.org"
  ],
  "nombre_sitio": "obopry.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.straitcountrytribute.com/event-details-registration/orange-blossom-opry-matinee-weirsdale-fl",
      "text": "SOLD OUT / Orange Blossom Opry Matinee : Weirsdale, FL | George Strait Trib. top of page George Strait Tribute Strait Country Tribute TRIBUTE CALENDAR BIO VIDEO PHOTOS CONTACT More Use tab to navigate through the menu items. Howard Decker; the nation's top tribute act to King George Strait Join Us SOLD OUT / Orange Blossom Opry Matinee : Weirsdale, FL Sat, Sep 14 | The Orange Blossom Opry Don’t miss this incredible matinee opportunity to watch Howard Decker perform with his incredible voice and stage presence, duplicating the legend himself, George Strait. You won’t be disappointed! Registration is closed See other events Time & Location Sep 14, 2024, 3:30 PM EDT The Orange Blossom Opry , SE 138th Ter, Florida 32195, USA About the event Tickets Now on Sale! The Orange Blossom Opry 16439 SE 138th Ter, Weirsdale, FL (352) 821-1201 office@obopry.com Show More Share this event George Strait Tribute Strait Country Tribute TRIBUTE CALENDAR BIO VIDEO PHOTOS CONTACT More Use tab to navigate through the menu items. ©2023 by George Strait Tribute - Strait Country Tribute . SUBSCRIBE for UPDATES BOOK a SHOW REQUEST a SHOW GET your TICKETS Decker's Favorite 5 Words \"Show Me to the Stage\" Music and Entertainment Websites by Nashville Web Design .BIZ All in tribute to King George and the entire team that built his legacy in country music! Click to the real Georg Strait too: George Strait Website :: George Strait Hall of Fame bottom of page"
    },
    {
      "url": "https://www.opb.org/leadership/",
      "text": "Leadership - OPB Sept. 11, 2025 contribute now About / Leadership Senior Leadership Rachel Smolkin, President and CEO Rachel Smolkin became president and CEO of OPB in 2024. She is responsible for leading the strategic direction and overall mission of the organization. Prior to OPB, she served as senior vice president of global news for CNN Digital, overseeing breaking news, politics and Washington, U.S. and international teams across the network’s digital platforms worldwide. She came to CNN in 2014 to build the network’s coverage of Washington, politics and elections into a top digital politics brand. Before coming to CNN, she served in leadership and editing roles at Politico, USA Today and American Journalism Review magazine. Rachel has an MBA from the University of Virginia Darden School of Business, where she attended the global executive program as a Batten Media Fellow alongside her work at CNN. She completed the Sulzberger Executive Leadership program at Columbia University and holds a bachelor’s degree in political science from Brown University. Contact Rachel at ceo@opb.org . Jason Potts, Senior Vice president, Chief Content Officer Jason Potts is OPB’s senior vice president and chief content officer, joining the organization in 2025. He is responsible for shaping OPB’s audience-centered storytelling through our journalism and strong partnerships around the region. Prior to OPB, he led business development and content strategy at Scripps News, driving audience growth and engagement. He conceived the popular Scripps News Viewer Hotline and Viewer Spotlight segments and led production teams to create award-winning news and documentary programming. Before Scripps, Potts managed experimental partnerships and internal innovations at the Disney-ABC Owned Television Stations group. Jason has received multiple accolades for his work, including a New England Emmy, National Headliner Award and a GLAAD Award. He received a BA in English from Yale University, an MBA from the UCLA Anderson School of Management and a certificate in generative AI from the University of Chicago. Contact Jason at cco@opb.org . Cheryl Ikemiya, Senior Vice President and Chief Development Officer Cheryl Ikemiya is OPB’s senior vice president and chief development officer. She leads a team of development professionals, focused on building relationships that provide revenue to power our public service mission. Our comprehensive development program builds support from members, foundation and individual philanthropy, and sponsors from corporate and non-profit sectors. With a background in non-profit management in performing arts, culture and history, Cheryl began at OPB in 2005 and moved into her current role in 2015. Contact Cheryl at cdo@opb.org . Lisa Garcia Grace, Senior Vice President, Programming and Audience Engagement Lisa Garcia Grace is senior vice president of programming and audience engagement. Her team connects OPB’s content with diverse audiences, fostering meaningful connections that inspire, inform and engage. Lisa joined OPB in 2016 and moved into her current role in 2022. She has worked in public media and nonprofit management for 20 years in a variety of roles including programming, engagement, development and communications. She has a bachelor’s degree in Journalism from the University of Colorado, is a graduate of the Kellog Media Executive Leadership program at Northwestern University and is a 2025 Sulzberger Executive Leadership Fellow. Contact Lisa at programming@opb.org . Stacy Tumarkin, Senior Vice President, Chief Operating Officer Stacy Tumarkin joined OPB as senior vice president and chief operating officer in 2025. Stacy is responsible for keeping the organization running smoothly, leading key operational departments and teams including finance and accounting, people and culture, technology, and legal to create cohesive internal systems and to facilitate the delivery of journalism to audiences across platforms. She possesses a broad background in executive leadership, having held COO, CFO, and Head of People roles across a diverse range of industries and markets. Prior to joining OPB, Stacy served as founding COO and CFO at Kubecost, an infrastructure technology startup that was acquired by IBM in 2024. Her nonprofit experience includes spending nearly two years running digital content at The Himalayan Institute, an international humanitarian organization focused on promoting holistic healing and yoga. Tumarkin holds an MBA from the University of Chicago Booth School of Business, and a BA in Business Economics from UC Santa Barbara. Contact Stacy at stumarkin@opb.org . Shayna Schlosberg, Vice President, Community Connections Shayna Schlosberg is OPB’s vice president of community connections. She develops and oversees initiatives that ensure OPB and KMHD are representative of the communities we serve across all aspects of our work. In her role, Shayna drives the strategy, vision and implementation of OPB and KMHD’s community representation and inclusion practices. Shayna joined OPB in 2022, and prior to her role here, she served as the Director of Strategy and Operations for Women of Color in the Arts. Shayna also has served as a Peace Corps volunteer in Armenia. Contact Shayna at equityleader@opb.org . Kim Locke, Chief of Staff Kim Locke serves as OPB’s Chief of Staff. In this role she brings teams together to shape and achieve strategic, operational, and cultural change. Prior to joining OPB in 2018, Kim worked in global technology and software companies before joining Nike’s global sales business operations team. With a lifelong interest in helping people succeed she holds a BA in Sociology from UC Santa Barbara and is a Prosci certified change practitioner. Contact Kim at klocke@opb.org . Holly Bullock-Denniston, Vice President, People and Culture Holly Bullock-Denniston is OPB’s vice president of people and culture (P&C). She has been at OPB since 1999, serving in volunteer management and HR roles. As the leader of the P&C department since 2020, she ensures OPB’s culture is inclusive and welcoming so that staff belong and thrive. Her team combines a systems approach and personalized interactions to optimize individual employee experience while maintaining legal and regulatory compliance. Holly has a master’s degree in public administration focusing on nonprofit management from Portland State University and a bachelor’s degree in planning, public policy and management focusing on social policy from the University of Oregon. She has held both the SHRM-SP and SPHR credentials. She was an adjunct professor at Portland State University in the MPA program, teaching nonprofit HR management classes. She has also served as an AmeriCorps/VISTA volunteer in Philadelphia. Contact Holly at people@opb.org . Jan Heskiss, CPA, Chief Financial Officer and Assistant Secretary-Treasurer Jan Heskiss is the chief financial officer of OPB, overseeing the financial operations of the company. Prior to joining OPB in 2001, Jan served in senior financial roles at organizations in various sectors, including nonprofit (Pace Center for Girls, Florida), broadcasting (KGW-TV, KINK-FM, KGW-AM, Oregon) and public accounting (KPMG, Oregon and Arizona). Contact Jan at cfo@opb.org . Rebecca Morris, Vice President and General Counsel Rebecca Morris is a vice president and general counsel for OPB. In her role, she oversees all OPB legal matters and leads an in-house legal team that works across the organization to solve problems, assess and mitigate risks, facilitate transactions, assist with regulatory compliance, manage litigation, and develop sound policies and procedures. Rebecca has been at OPB since 2006. Prior to that, she served as assistant general counsel at Thirteen/WNET in New York City. Contact Rebecca at legal@opb.org . Jonathan Newsome, Interim Chief Technology Officer and Vice President, Technology Jonathan Newsome currently serves as OPB’s interim chief technology officer and vice president of technology. In this role, he provides strategic leadership and vision for OPB’s technology department, ensuring the infrastructure supports seamless engagement with audiences, no matter the platform or location. His focus is ensuring that OPB’s systems empower staff and foster innovation across content creation and distribution. Jonathan’s path to public media began after his time at the Savannah College of Art and Design, launching his career as a musician and recording engineer. He entered public media in 2005 with Live Wire! Radio, and joined OPB in 2010 as the technical director for Think Out Loud. Since 2014, he has played a key role in OPB’s Engineering and Technology teams, helping to shape the organization’s technical evolution. Contact Jonathan at cto@opb.org . OPB Board of Directors Chair: John Topanga ( email ) Vice chair: Curtis Robinhold Secretary/Treasurer: Peter Platt Members: Rukaiyah Adams, Karen Anderson, Jesse Beason, Nils D. Christoffersen, Roger Cooke, Graciela Gomez Cowger, Rebecca DeCesaro, Elisa Dozono, Colin Evans, Kathleen George, Margaret Kirkpatrick, Sandy Rowe, Carla Salazar, Lee Weinstein, Sheryl WuDunn; Lisa Skari, ex-officio voting member; Rachel Smolkin, ex-officio nonvoting member Community Advisory Board (CAB) Members: Lesley Albert, John Bloss, Linda Castillo, Sokho Eath, Alex Garfield, Connie Green, Stephen Green, Andréa Guedes, Tracey Lam, Pat Lynch, Katy Nesbitt, Julie Nist, Melanie Potter, Nikki Pritchard, John Riutta, Tamara Russell, Rick Short, Teresa St. Martin, Sam Stites OPB Board Liaison: Rad Probst ( email ) THANKS TO OUR SPONSOR: Become a Sponsor Stand with OPB and protect independent journalism for everyone. Contribute now! About OPB Help Center Work With Us  Manage My Membership Sponsorship Contact Us Privacy Policy Cookie Preferences FCC Public Files FCC Applications Terms of Use Editorial Policy SMS T&C Contest Rules Accessibility Listen to the OPB News live stream (opens new window) Streaming Now On Point Show switch stream buttons Switch Stream: OPB News Listen to the OPB News live stream (opens new window) KMHD Listen to the KMHD live stream (opens new window)"
    },
    {
      "url": "https://www.orange.edu.au/contact-us/",
      "text": "Contact Us - Orange College English Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scottish Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sudanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Current Student Staff Our Courses Domestic Students NSW Smart & Skilled Government Assistance Certificate III in Carpentry – Domestic Certificate III in Painting and Decorating – Domestic Community Services Hub New Courses Certificate III in Individual Support New Short Courses White Card International Students General English Hub Business & Management Hub Certificate III in Business Certificate IV in Business Diploma of Business Diploma of Leadership and Management Advanced Diploma of Leadership and Management Diploma of Project Management Graduate Diploma of Management (Learning) Building & Construction Hub Certificate IV in Building and Construction (Building) Certificate III in Carpentry Diploma of Building and Construction (Building) Certificate III in Painting and Decorating Certificate III in Cabinet Making & Timber Technology (Furniture) (Kitchens & Bathrooms) Certificate IV in Building Project Support (Contract Administrator) Certificate IV in Building Project Support (Estimator) Short Courses White Card Study Tour Program View all Courses Why Orange What we offer Our history Our mission Meet our team Awards Student Support and Well-being Our Campuses FAQ How to apply Fees and scholarships RPL (Recognition of Prior Learning) Useful Links TPS Admissions Credential Cancellation Community News & Events Projects Success Stories Career Videos information Agent representatives Form and Policies Contact Apply Online Our Courses Domestic Students NSW Smart & Skilled Government Assistance Certificate III in Carpentry Certificate III in Painting and Decorating Community Services Hub New Courses Certificate III in Individual Support New Certificate IV in Disability New Short Courses White Card International Students General English Hub Business & Management Hub Certificate III in Business Certificate IV in Business Diploma of Business Diploma of Leadership and Management Advanced Diploma of Leadership and Management Diploma of Project Management Graduate Diploma of Management (Learning) Building & Construction Hub Certificate IV in Building and Construction (Building) Certificate III in Carpentry Diploma of Building and Construction (Building) Certificate III in Painting and Decorating Certificate III in Cabinet Making & Timber Technology Certificate IV in Building Project Support (Contract Administrator) Certificate IV in Building Project Support (Estimator) Short Courses White Card Study Tour Program View all Courses Why Orange What we offer Our history Our Mission Meet our team Awards Student Support and wellbeing Our Campuses FAQs How to apply Fees and scholarships RPL (Recognition of Prior Learning) Useful Links TPS Admissions Credential Cancellation Community News & Events Projects Success Stories Career Videos Information Agent representatives Form and Policies Contact Apply Online English Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scottish Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sudanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Current Student Staff FAQ's COVID-19 Information TPS Admissions Credential Cancellation CONTACT Get in touch! If you have any questions or queries, our friendly staff will be happy to help.\r\nAlternatively, feel free to contact us by email or phone. We will make sure to get back to you as soon as possible. CONTACT US NOW Enquiry form If you have any questions or queries, our friendly staff will be happy to help. Alternatively, feel free to contact us by email or phone. We will make sure to get back to you as soon as possible. Let’s have a chat START LIVE CHAT Drop us a line SUMBIT REQUEST Call us now 13000 69 642 CAMPUSES Our campuses Melbourne CBD Campus (Head Office) Level 6, 416-420 Collins Street Melbourne, Victoria 3000 Port Melbourne Campus 235 Ingles Street Port Melbourne, Victoria 3207 Start your career at Orange College Apply online now or reach out to speak with a career advisor who will be happy to assist you in getting started with your career journey. Get in touch Follow us! Contact information 13000 69 642 info@orange.edu.au Subscribe to our newsletter Subscribe to our newsletter for new announcements. Leave this field empty if you're human: Navigation Navigation Courses Why Orange Quality Indicator Report FAQ’S Contact Programs Programs English Courses Hub Business & Management Hub Building & Construction Hub Community Services Hub Short Courses Campus Campus Melbourne CBD Campus Level 6, 416-420 Collins Street Melbourne, Victoria 3000 Port Melbourne Campus 235 Ingles Street Port Melbourne, Victoria 3207 Copyright © 2025. All rights reserved |  Orange International College Pty. Ltd. T/A Orange College.   |   RTO No : 41315 |   CRICOS Provider Code : 03446A |   ABN : 15 167 063 596 × × Thanks for signing up for the Orange College newsletter! We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Cookie Settings Accept Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT \" * \" indicates required fields Email * Mobile Phone Number FirstName * LastName * Student or Agent? * Student or Agent? * Prospective Student Agent Other Company Name Nationality * Nationality * Adélie Land (France) Afghanistan Albania Algeria Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Argentinian Antarctic Territory Armenia Aruba Saint Helena, Ascension and Tristan da Cunha Australia Australian Antarctic Territory Australian External Territories, nec Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Born at sea Bosnia and Herzegovina Botswana Brazil British Antarctic Territory British Indian Ocean Territory British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Myanmar (Burma) Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Channel Islands Chile Chilean Antarctic Territory Colombia Comoros Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica Croatia Cuba Curacao Island Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador England Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Micronesia, Federated States of Fiji Finland Macedonia, The Former Yugoslav Republic of France French Guiana French Polynesia Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Ivory Coast Jamaica Japan Jersey Jordan Jugoslavia Kazakhstan Kenya Kiribati Korea, Republic of (South) Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macau Madagascar Malawi Malaysia Maldives Mali Malta Marianas Islands Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Monaco Mongolia Montenegro Montserrat Morocco Mozambique Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Africa, nec Northern Ireland Norway Not Specified Oman Pacific Islands Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Poland Polynesia (excludes Hawaii), nec Portugal Puerto Rico Qatar Queen Maud Land (Norway) Moldova, Republic of Réunion Romania Ross Dependency (New Zealand) Russian Federation Rwanda Samoa Samoa, American San Marino Sao Tomé and Principe Saudi Arabia Scotland Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South America, nec Spain Spanish North Africa Sri Lanka St Kitts and Nevis St Lucia St Pierre and Miquelon St Vincent and the Grenadines Sudan Suriname Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United States of America Unknown Uruguay US Virgin Islands Uzbekistan Vanuatu Vatican City Venezuela Vietnam Wales Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Kosovo Pitcairn Islands Aland Islands South Sudan Timor-Leste China Korea, Democratic People's Republic of (North) St Barthelemy St Martin (French part) Bonaire, Sint Eustatius and Saba Curacao Sint Maarten (Dutch part) United Kingdom Adélie Land (France) Afghanistan Albania Algeria Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Argentinian Antarctic Territory Armenia Aruba Saint Helena, Ascension and Tristan da Cunha Australia Australian Antarctic Territory Australian External Territories, nec Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Born at sea Bosnia and Herzegovina Botswana Brazil British Antarctic Territory British Indian Ocean Territory British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Myanmar (Burma) Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Channel Islands Chile Chilean Antarctic Territory Colombia Comoros Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica Croatia Cuba Curacao Island Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador England Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Micronesia, Federated States of Fiji Finland Macedonia, The Former Yugoslav Republic of France French Guiana French Polynesia Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Ivory Coast Jamaica Japan Jersey Jordan Jugoslavia Kazakhstan Kenya Kiribati Korea, Republic of (South) Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macau Madagascar Malawi Malaysia Maldives Mali Malta Marianas Islands Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Monaco Mongolia Montenegro Montserrat Morocco Mozambique Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Africa, nec Northern Ireland Norway Not Specified Oman Pacific Islands Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Poland Polynesia (excludes Hawaii), nec Portugal Puerto Rico Qatar Queen Maud Land (Norway) Moldova, Republic of Réunion Romania Ross Dependency (New Zealand) Russian Federation Rwanda Samoa Samoa, American San Marino Sao Tomé and Principe Saudi Arabia Scotland Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South America, nec Spain Spanish North Africa Sri Lanka St Kitts and Nevis St Lucia St Pierre and Miquelon St Vincent and the Grenadines Sudan Suriname Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United States of America Unknown Uruguay US Virgin Islands Uzbekistan Vanuatu Vatican City Venezuela Vietnam Wales Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Kosovo Pitcairn Islands Aland Islands South Sudan Timor-Leste China Korea, Democratic People's Republic of (North) St Barthelemy St Martin (French part) Bonaire, Sint Eustatius and Saba Curacao Sint Maarten (Dutch part) United Kingdom Campus Melbourne Port Melbourne Hobart Area of interest * Area of interest * Building and Construction Business and Management English Courses Short Courses Others Course (s) Advanced Diploma of Leadership and Management Certificate III in Business Certificate III in Carpentry Certificate III Painting and Decorating Certificate IV in Building and Construction (Building) Certificate IV in Business Diploma of Building and Construction Diploma of Building and Construction (Building) Diploma of Business Diploma of Leadership and Managemen Diploma of Project Management General English Program (Beginner To Advanced) Graduate Diploma of Leadership Management White Card Enquiry Type * Enquiry Type * Phone Email Walk-in Messenger Message Orange International College Pty. Ltd. is committed to protecting and respecting your privacy, and we’ll only use your personal information to administer your account and to provide the products and services you requested from us. From time to time, we would like to contact you about our products and services, as well as other content that may be of interest to you. If you consent to us contacting you for this purpose, please tick below to say how you would like us to contact you: * I agree to receive other communications from Orange International College Pty. Ltd.. You may unsubscribe from these communications at any time. For more information on how to unsubscribe, our privacy practices, and how we are committed to protecting and respecting your privacy, please review our Privacy Policy. By clicking submit below, you consent to allow Orange International College Pty. Ltd. to store and process the personal information submitted above to provide you the content requested. CAPTCHA × Student Review - Daniel and Stefania × Thanks for signing up for the Orange College newsletter! × Please fill in the form below to submit your request Please prove you are human by selecting the cup . ×"
    },
    {
      "url": "https://local.aarp.org/place/the-orange-blossom-opry-weirsdale-fl.html",
      "text": "The Orange Blossom Opry - Weirsdale, FL Join Renew Enroll: Automatic Renewal Rejoin Membership & Benefits Members Edition Rewards Star AARP Rewards %{points}% Help Register Login Login Hi, %{firstName}% My Account Account Details My Inbox Communication Preferences Newsletters Customize Your Membership Community Staying Sharp Logout Hi, %{firstName}% My Account Account Details My Inbox Communication Preferences Newsletters Customize Your Membership Community Staying Sharp Logout Content starts here CLOSE × Search {\"dropDownLabel\":\"All Topics\",\"dropDownValue\":\"everywhere\"},{\"dropDownLabel\":\"Entertainment\",\"dropDownValue\":\"entertainment\"},{\"dropDownLabel\":\"Health\",\"dropDownValue\":\"health\"},{\"dropDownLabel\":\"Money\",\"dropDownValue\":\"money\"},{\"dropDownLabel\":\"Policy & Research\",\"dropDownValue\":\"research\"},{\"dropDownLabel\":\"Travel\",\"dropDownValue\":\"travel\"},{\"dropDownLabel\":\"Work\",\"dropDownValue\":\"work\"},{\"dropDownLabel\":\"Member Benefits\",\"dropDownValue\":\"member benefits\"},{\"dropDownLabel\":\"Caregiving\",\"dropDownValue\":\"caregiving\"},{\"dropDownLabel\":\"Videos\",\"dropDownValue\":\"videos\"} Search Popular Searches Rolling Stones Presale Games Car rental AARP daily Crossword Puzzle Hotels with AARP discounts Life Insurance Suggested Links Help Show me my account info Change my Address How do I contact AARP? Where is my membership card? How do I get a digital card? AARP MEMBERSHIP Join AARP for just $15 for your first year when you sign up for automatic renewal. Gain instant access to exclusive products, hundreds of discounts and services, a free second membership, and a subscription to AARP The Magazine. Join Now Renew Now 120x30-AARP-logo-red Join Renew Enroll Rejoin right_container Health Money Work & Jobs Advocacy Social Security Medicare Caregiving Games Travel More... AARP en Español Membership & Benefits Members Edition AARP Rewards Membership & Benefits Members Edition AARP Rewards %{points}% Back Health Close Menu Healthy Living Conditions & Treatments Drugs & Supplements Health Care & Coverage Health Benefits AARP Eye Center Tips to Protect Your Eyesight AARP Hearing Center Ways To Improve Your Hearing Mental Health Resources Coping with Depression and Anxiety MEMBERS ONLY AARP Smart Guide Prepare for a Good Night's Sleep MEMBERS ONLY Back Money Close Menu Scams & Fraud Personal Finance Taxes Retirement Money Benefits Scams & Fraud View and Report Scams in Your Area Taxes Take the Charitable Giving Quiz AARP Money Map Get Your Finances Back on Track MEMBERS ONLY Budget & Savings Make Your Appliances Last Longer MEMBERS ONLY Back Work & Jobs Close Menu Job Search Careers Small Business Employers Age Discrimination Flexible Work Freelance Jobs You Can Do From Home AARP Skills Builder Online Courses to Boost Your Career Careers 31 Great Ways to Boost Your Career ON-DEMAND WEBINARS Tips to Enhance Your Job Search Back Advocacy Close Menu Drug Prices Saving You RX Dollars Social Security Fighting to Protect Social Security Medicare & Medicaid Advocating for Strong Programs Caregiving Supporting Family Caregivers Back Social Security Close Menu Webinars Get More out of Your Benefits Enrollment When to Start Taking Social Security Basics 10 Top Social Security FAQs Tools Social Security Benefits Calculator Back Medicare Close Menu Guide Start Your Medicare Journey With Our Medicare Enrollment Guide Tool Get Quick Medicare Answers With Our Medicare Q&A Tool medicare Learn How to Get Help With Common Medicare Problems Advocacy Learn How AARP is Fighting for Better Medicare Back Caregiving Close Menu Basics Care at Home Medical Financial & Legal Life Balance Local LONG-TERM CARE ​Understanding Basics of LTC Insurance​ State Guides Assistance and Services in Your Area Prepare to Care Guides How to Develop a Caregiving Plan End of Life How to Cope With Grief, Loss Back Games Close Menu All Recently Played Word & Trivia Rewards Atari® & Retro Mahjongg Members Only Staying Sharp Solitaire New Games Strategy Arcade Puzzles Card Juegos Daily Game Shows More About Games Right Again! Trivia Right Again! Trivia – Sports Atari® Video Games Throwback Thursday Crossword Back Travel Close Menu Travel Tips Vacation Ideas Destinations Travel Benefits Real ID Guide ID Goes into Effect on May 7 Affordable U.S. Destinations Stretch Your Travel Dollars Spring Travel Scenic Road Trips MEMBERS ONLY Vacation Lodging 40 Tips to Make Most of Stay MEMBERS ONLY Entertainment & Style Family & Relationships Personal Tech Home & Living Auto Staying Sharp Podcasts Videos Back Entertainment & Style Close Menu Movies TV Music Celebrities Beauty & Style Books Editors' Picks Best New Shows and Movies Celebrities Samuel L. Jackson Keeps Keeping On MEMBERS ONLY Looking Back ‘The Tonight Show’ Quiz MEMBERS ONLY Back Family & Relationships Close Menu Sex & Dating Your Questions Answered Grandparenting Everything You Need to Know MEMBERS ONLY Pets Your Guide to Health, Happy Pets MEMBERS ONLY Back Personal Tech Close Menu Home Technology Caregiver’s Guide to Smart Home Tech Get Happier Creating Social Connections Virtual Community Center Join Free Tech Help Events Back Home & Living Close Menu MEMBERS ONLY Age in Place What You Need to Know MEMBERS ONLY MEMBERS ONLY Recipes Favorites from Magnolia Bakery MEMBERS ONLY MEMBERS ONLY Declutter What to Do With Your Unwanted Stuff MEMBERS ONLY Back Auto Close Menu Car Buying Driver Safety Maintenance & Safety Trends & Technology Car Buying Is Now the Time to Buy an Electric Car? We Need To Talk Assess Your Loved One's Driving Skills Driver Safety AARP Smart Driver Course Back Staying Sharp Close Menu Assessment Challenges Articles Videos Recipes Building Resilience in Difficult Times Tips for Finding Your Calm Weight Loss After 50 Challenge Back Podcasts Close Menu Cautionary Tales of Today's Biggest Scams 7 Top Podcasts for Armchair Travelers MEMBERS ONLY Jean Chatzky: ‘Closing the Savings Gap’ MEMBERS ONLY Back Videos Close Menu Quick Digest of Today's Top News AARP Top Tips for Navigating Life Get Moving With Our Workout Series AARP Local Weirsdale, FL Sections Home Events Things to Do News Feed Volunteering State & Local Resources Movies for Grownups AARP in Action More Home & Community Local Offers Work & Jobs Community Calendar Back to Things to Do The Orange Blossom Opry 16439 SE 138th Terrace Weirsdale , FL 32195 The Orange Blossom Opry By clicking the links above, you'll leave AARP and go to a website that is not operated by AARP. A different privacy policy and terms of service will apply. 352-821-1201 About Us: The Orange Blossom Opry is a family oriented, smoke free, alcohol free, country music showcase located in the small Central Florida community of Weirsdale. It is located in what was originally the Weirsdale School Gymnasium. The gymnasium was converted several years ago to serve as an opry house. The Opry first opened as \"Haw Hee's\", then became the \"Weirsdale Opry\" and finally \"The Orange Blossom Opry\". The current owners, Estelle and Earl Benson , are in their third season and the Opry Cast , or, as they are also known, the \"Orange Blossom Opry Band\", has presented a variety of musical styles, mostly traditional country and Bluegrass, and its own special brand of humor for the past seven years. Mailing Address: The Orange Blossom Opry PO Box 979 Weirsdale FL 32195 Report an Issue Please use \"Flag This Place\" to alert us about content that is inappropriate or needs immediate attention. Nothing you submit will be shared with other site visitors. AARP Events for Weirsdale Featured Event Filing for Social Security Friday, Sep 19, 2025 at 1:00 p.m. ET Zoom Online Event Featured Event Scam-Proof Your Finances Wednesday, Oct 1, 2025 at 12:00 p.m. ET Zoom Online Event Featured Event Learn About New Car Safety Tech in your area Thursday, Oct 2, 2025 at 9:30 a.m. ET Sumter County Service Center WILDWOOD, FL View All AARP Events You’ll leave AARP and go to a website that is not operated by AARP. A different privacy policy and terms of service will apply. Only $15 your first year with Automatic Renewal Immediate access to your member benefits Discounts on travel and everyday savings Subscription to AARP The Magazine FREE second membership Join AARP Already a member? Renew or Print Card Facebook Contact AARP Florida FLAARP@aarp.org AARP Florida Contact Us Return to top AARP is a nonprofit, nonpartisan organization that empowers people to choose how they live as they age. About Us Donate Volunteer Membership AARP Rewards Advertise with AARP Contact Us Careers at AARP AARP Services Inc. Policy & Research Newsletters AARP In Your City AARP En Español AARP 樂齡會 Press Center AARP Foundation Wish of a Lifetime Senior Planet | OATS AgeTech Collaborative™ Legal Counsel for the Elderly AARP Privacy Hub Terms of Service Accessibility Statement AARP Rewards Terms & Conditions Copyright Information Vulnerability Disclosure Program Ad Choices Your Privacy Choices Facebook Twitter Instagram LinkedIn Close Cancel Choose a community Close What community do you want to visit? Find Your Community Or browse by state Cancel Elige una comunidad Close ¿Qué comunidad quieres visitar? Encuentra tu comunidad Cancelar Choose a community Close What community do you want to visit? Find Your Community Or browse by state Cancel Choose a community Close What community do you want to visit? Find Your Community Or browse by state Cancel × Close × Leaving AARP.org Website You are now leaving AARP.org and going to a website that is not operated by AARP. A different privacy policy and terms of service will apply. Continue Close"
    },
    {
      "url": "https://www.iobeya.com/template/okr-board/",
      "text": "OKR board - iObeya Skip to content Product Solution Pricing Resources Partner Contact us Request a demo English Français Product Solution Pricing Resources Partner Product Digital Obeyas for hybrid teams Digitize Lean and Agile systems Best in class integrations Enterprise-grade security Product highlights Discover the full range of iObeya features Product Digital Obeyas for hybrid teams Digitize Lean and Agile systems Best in class integrations Enterprise-grade security Product highlights Discover the full range of iObeya features Solution By Use case Lean Project Management Agile at Scale Lean Manufacturing By Industry Pharmaceutical Defense – Aerospace Logistics Energy iObeya for the pharmaceutical industry Discover many templates Solution By Use case Lean Project Management Agile at Scale Lean Manufacturing By Industry Pharmaceutical Defense – Aerospace Logistics Energy iObeya for the pharmaceutical industry Discover many templates Resources Blog Customers testimonials Events Discover our features Product highlights Templates Resource Center 12 June 2025 – Massy FRANCE iObeya User Exchange 2025 Resources Blog Customers testimonials Events Discover our features Product highlights Templates Resource Center 12 June 2025 – Massy FRANCE iObeya User Exchange 2025 Contact Us Request a demo English Français Home Templates OKR board OKR board Get this template What is an OKR board in iObeya? An OKR board is a Visual Management tool that allows you to track and display the Objectives and Key Results (OKR) of an organization, a team, or an individual. OKRs are widely used for performance management and goal setting. An OKR board is a physical or digital board where the main objectives of a company, team, or project, as well as the key results that need to be achieved to meet these objectives, are displayed. OKRs are designed to be specific, measurable, ambitious, relevant, and time-bound. They provide a clear framework for aligning efforts and priorities within an organization. Why use an OKR board? An OKR board allows you to track real-time progress toward the achievement of objectives and key results. It helps teams stay focused on what matters most, prioritize tasks, and ensure that everyone is aligned to achieve the company’s goals. The use of an OKR board offers several benefits for companies and organizations, including: Aligning teams with common objectives and key results; Transparency via OKR boards that make objectives and progress visible; Prioritizing tasks and projects based on the most important objectives; Holding each team member accountable for achieving their own objectives; Real-time tracking of progress toward set objectives. OKR boards facilitate quick adjustments when needed; Informed decision-making through OKR boards that provide a solid foundation with clear objectives and ongoing data collected on progress. In summary, OKR boards are well-suited for operational performance management and promote goal achievement within organizations. They enhance the productivity and efficiency of organizations that use them. Who uses an OKR board? OKR boards are used by both Lean and Agile teams. The Lean method and OKR boards share a common aim toward continuous improvement and transparency, but they differ in their primary focus and specific tools. OKR boards focus on objectives, while Lean focuses on the processes that support the achievement of these objectives ( including Kaizen or PDCA cycles). Combining these two approaches promotes operational excellence. The Agile method and OKR boards have in common their aim toward agility, alignment with objectives, transparency, iteration, and continuous improvement. Combining these two approaches allows for the flexibility and visibility of OKR boards while integrating Agile practices for project and product management. This contributes to creating an organizational culture focused on agility, performance, and goal achievement. How to set up an OKR board in iObeya To organize an OKR in your digital Obeya, follow these steps: Enter your room, then click ‘Configure’ the room at the bottom right of the screen. Add a blank board to your room. Select the OKR background from the background catalog. In the tool dock define a new set of Notes as Major goal / Objective / Key results, add Free text . Your board is now ready to be used. Expert tips on using an OKR board To maximize the effectiveness of OKR boards, here are expert tips: Take the time to properly train stakeholders on the OKR methodology and how it works. The OKR board should involve all hierarchical levels of th organization, from operational staff to top management. Management commitment is crucial to achieving expected results. Formulate each objective in a concise sentence with clear, achievable, and measurable key results. Limit yourself to 3 or 5 main objectives per period. This will help your teams stay focused on what really matters. Ensure that objectives and key results are aligned with the company’s mission and vision. This way, each team’s efforts remain aligned with the organization’s overall goals. Regularly update OKR boards, ideally on a weekly basis, to reflect actual team progress. Review and adjust your OKRs as needed to maximize the impact of actions and remain agile. Share the OKR board with all stakeholders. This transparency will promote accountability and alignment. Encourage a culture of learning by sharing experiences, especially when an OKR is not achieved. Failure is an opportunity for improvement. Feel free to customize these tips based on the specific needs of your organization! Lean Project Management Get started with this template Get this template More Performance Management templates Empathy Map An Empathy Map is designed to show detailed insights into how customers feel about your product or service, and if they think it’s suited for them. Design Thinking Team meeting The team meeting board helps you optimize your meeting by defining a clear structure to the topics you wish to address. Management A3 The A3 process is a problem solving tool Toyota developed to foster learning, collaboration, and personal growth in employees. Problem Solving Visit iObeya for Lean Manufacturing Take a tour Product Digital Obeyas Lean and Agile Integrations Security Digital Obeyas Lean and Agile Integrations Security Solution by use case Lean Project Management Agile at Scale Lean Manufacturing Lean Project Management Agile at Scale Lean Manufacturing Solution by industry Pharmaceutical Defense – Aerospace Logistics Energy Pharmaceutical Defense – Aerospace Logistics Energy Resources Resource Center Testimonials Blog Lean Corner Events Templates Videos Features Product highlights Trust Center Resource Center Testimonials Blog Lean Corner Events Templates Videos Features Product highlights Trust Center Get to know us Pricing Careers Partners Contact us Newsletter Support Pricing Careers Partners Contact us Newsletter Support Follow us on Linkedin-in Youtube Want to get \nin touch? Contact Our Team English Français Legal Disclaimer Privacy policy Sitemap English Français © iObeya 2014-2025 All rights Reserved Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Why iObeya Digital Obeyas for hybrid teams A work space structured as a physical Obeya Best in class integrations Jira, ADO or custom made with the API (0365 &Power automate...) Digitize Lean and Agile Systems Adopt Visual Management System for your Lean & Agile methods Enterprise-grade security The leading secure solution on the market Product Highlights Browse and read the latest product news and announcements from the iObeya team Discover the full range of iObeya features Boards, cards, facilitation mode, integrations and more... By Use Case Lean Project Management Lean Manufacturing Agile at Scale By Industry Pharmaceutical Defense - Aerospace Logistics Energy Sanofi x Forrester €16.5M in savings achieved through optimized meetings Discover many templates Download our ready to use Lean, Agile and Visual Management templates including kanban, SQCD, ROAM.... Resources Customer video testimonials Blog Events Resource Center Product highlights Features Discover many templates Lean corner Explore Our Library of Lean Standards Cheat Sheets Your guide to Manufacturing, Operational Excellence, Continuous Improvement & much more. June 12, 2025 - Massy, FRANCE iObeya User Exchange 2025 Sign up now for our must-attend annual event... with exclusive new features in store! Customer Testimonials Discover how leading companies are transforming their visual management practices with iObeya. Resources Customer testimonials Check out all of our customer and partner testimonials Blog Learn more about Visual Management Events Find out more about our past and future events Product highlights Browse and read the latest product news and announcements from the iObeya team Features Discover the full range of iObeya features Discover many teamplates Download our ready to use Lean, Agile and Visual Management templates including kanban, SQCD, ROAM.... Resource Center A dedicated space for our users to improve their visual management practices and new ways of working within iObeya Lean corner Explore Our Library of Lean Standards Cheat Sheets Your guide to Manufacturing, Operational Excellence, Continuous Improvement & much more."
    },
    {
      "url": "https://www.opb.org/about/",
      "text": "About OPB - OPB Sept. 11, 2025 contribute now About / About OPB Our Mission Connecting people across Oregon and the Pacific Northwest through the power of a shared story. We are an independent, nonprofit media organization serving communities across Oregon and the Pacific Northwest. Powered by the generous support of members, OPB connects people through trusted journalism that is freely accessible to everyone. At OPB, we believe stories have power. The power to educate. To entertain. To inform and enlighten. A story, told well, can help us feel a deeper connection with our neighbors and to the wider world. For more than 100 years , Oregon Public Broadcasting (OPB) has called this region home and shared stories that have shaped our region’s history. We’ve brought stories from around the world and around the corner into people’s homes, in their car, and wherever they go. Guided by a pursuit of truth, a spirit of curiosity, with equity and public service at the center of our work, we deliver in-depth, fact-driven coverage of politics , science and the environment , arts and culture , education and more. Because of the financial support of our members , our growing journalism operation is one of the largest in the Pacific Northwest. Our team of award-winning , dedicated reporters, producers and editors report on stories across the region — from southern Washington to southern Oregon. OPB’s journalism and programs seek to connect people across communities and go deeper into what makes this region special. We seek diverse voices to help us tell the stories that define who we all are, what we do, where we live and where we’re going. Tiffany Camhi, higher education reporter at Oregon Public Broadcasting, conducting an interview in Portland, April 7, 2022. Kristyna Wentz-Graff / OPB Explore OPB Connect with OPB’s daily news coverage, investigative reporting, in-depth documentaries, immersive podcasts, enlightening programs and much more. Here’s how: Watch programs on OPB TV or stream with OPB Passport on the PBS app Listen to OPB Radio , OPB podcasts or KMHD Jazz Radio Visit opb.org for our latest reporting, to stream live OPB Radio coverage and programs, explore original series and more Sign up for OPB’s daily “First Look” and other newsletters today Get the OPB News app for news updates, stream live OPB Radio, and more Follow on Instagram , Bluesky , YouTube, Linkedin and Facebook THANKS TO OUR SPONSOR: Become a Sponsor Stand with OPB and protect independent journalism for everyone. Contribute now! About OPB Help Center Work With Us  Manage My Membership Sponsorship Contact Us Privacy Policy Cookie Preferences FCC Public Files FCC Applications Terms of Use Editorial Policy SMS T&C Contest Rules Accessibility Listen to the OPB News live stream (opens new window) Streaming Now On Point Show switch stream buttons Switch Stream: OPB News Listen to the OPB News live stream (opens new window) KMHD Listen to the KMHD live stream (opens new window)"
    },
    {
      "url": "https://www.straitcountrytribute.com/event-details-registration/orange-blossom-opry-weirsdale-fl",
      "text": "SOLD OUT / Orange Blossom Opry : Weirsdale, FL  | George Strait Trib. top of page George Strait Tribute Strait Country Tribute TRIBUTE CALENDAR BIO VIDEO PHOTOS CONTACT More Use tab to navigate through the menu items. Howard Decker; the nation's top tribute act to King George Strait Join Us SOLD OUT / Orange Blossom Opry : Weirsdale, FL Sat, Sep 14 | The Orange Blossom Opry Don’t miss this incredible evening-show opportunity to watch Howard Decker perform with his incredible voice and stage presence, duplicating the legend himself, George Strait. You won’t be disappointed! Registration is closed See other events Time & Location Sep 14, 2024, 8:00 PM EDT The Orange Blossom Opry , SE 138th Ter, Florida 32195, USA About the event The Orange Blossom Opry 16439 SE 138th Ter, Weirsdale, FL (352) 821-1201 office@obopry.com obopry.com Show More Share this event George Strait Tribute Strait Country Tribute TRIBUTE CALENDAR BIO VIDEO PHOTOS CONTACT More Use tab to navigate through the menu items. ©2023 by George Strait Tribute - Strait Country Tribute . SUBSCRIBE for UPDATES BOOK a SHOW REQUEST a SHOW GET your TICKETS Decker's Favorite 5 Words \"Show Me to the Stage\" Music and Entertainment Websites by Nashville Web Design .BIZ All in tribute to King George and the entire team that built his legacy in country music! Click to the real Georg Strait too: George Strait Website :: George Strait Hall of Fame bottom of page"
    },
    {
      "url": "https://pocoband.com/tour/orange-blossom-opry",
      "text": "Poco Band Official Stay Connected Home Scrapbook Legacy Discography The Band Gallery Photos Videos Journal Store Tour Connect Social Wall Links Contact Home Legacy Discography The Band Photos Videos Journal Store Tour Social Wall Links Contact Stay Connected Orange Blossom Opry BACK TO TOUR Orange Blossom Opry March 8, 2020 16439 SE 138th Terrace Weirsdale, FL office@obopry.com View event website Sign-Up For Poco News PHP Social Stream: There is no feed data to display! Home Legacy Discography The Band Photos Videos Journal Store Tour Social Wall Links Contact Booking Skyline Music / Bruce Houghton info@skylineonline.com • (866) 531-2172 ext 108 Management / Private & Corporate Events Rick Alter Management / Drifter's Church Productions P.O. Box 1864, Brentwood, TN 37024 (615) 661-4157 • rickalter@aol.com STAY CONNECTED Web Site Design & Development by DANIMA Creative Group ©, 2025 Photo contributions by:  Ben Rothenberg and Larry Papke"
    }
  ]
}