{
  "fuentes": [
    {
      "url": "https://jbobriens.com/",
      "email": "jbobriens@comcast.net"
    },
    {
      "url": "https://brandonschooldistrict.org/",
      "email": "info@brandon.k12.mi.us"
    },
    {
      "url": "https://obriensirishpubsf.com/",
      "email": "info@obriensirishpubsf.com"
    }
  ],
  "mails": [
    "info@brandon.k12.mi.us",
    "info@obriensirishpubsf.com",
    "jbobriens@comcast.net"
  ],
  "nombre_sitio": "obrienspubsbrandon.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://jbobriens.com/",
      "text": "Local Irish Pub - Come on over to JB O'Brien's Irish Pub & Sports Bar HOME ABOUT PUB MENU J.B.’S BLOG CONTACT US Your Table Awaits 11am to 12am (Mon-Fri) | 9am to 12am (Sat-Sun) Happy Hour 3-6pm (it’s pretty amazing) CALL US to ORDER it \"TO GO\" It's easy - call us at 503.941.5592 JB O’Brien’s Irish Pub 503.941.5592 11555 SW Durham Road Tigard, OR 97224 ORDER NOW Keep In Touch Get On Our Mailing List For each petal on the shamrock this brings a wish your way – good health, good luck, and happiness for today and every day. ADD ME TO YOUR MAILING LIST BASK IN THE GLOW OF OUR FLAT-SCREEN “WALL OF SPORTS” 21 & Over Only No Live Music (so you can hear yourself “clink”) Come on over to J.B. ‘Brien’s Irish Pub & Sports Bar in Tigard, Oregon for a pint and a bite. Stay for the warm, friendly smile you’ll likely get in return! Ready to unwind? DIRECTIONS Watch the games at your Local Irish Pub — J.B. O’Brien’s Irish Pub & Sports Bar features wall-to-wall large-screen TVs. There are always plenty of great games on – Rugby, Soccer, Football, Basketball, Baseball, Tennis and Golf. We get all the channels, so pull up a dram and a chair today. What games are playing in the sports bar? Want to know what games are on? Call us at 503-941-5592 for info. What’re you drinking? {what’re  ól tú?} LOTS OF LOCAL BEERS – 4 TO 5 IPAS ON TAP J.B. O’Brien’s Makes everything from scratch YOU’RE GONNA NEED BOTH HANDS DELICIOUS PUB FOOD + MEXICAN/AMERICAN + BREAKFAST ANYTIME Our menu is always evolving. Our kitchen manager and his wife are from Mexico, so all our Mexican food is traditional. SEE OUR MENU Big salads that taste good. IT’S A TRUE PUBLIC HOUSE. THE REAL DEAL. J.B. O’Brien’s Irish Pub & Sports Bar is an easy-going meeting place for friends and neighbors. A traditional, dimly lit Irish pub where anyone can come in and feel comfortable. When you’re ready for another round, just raise a glass. Ready to order? Give us a wave. We’ll be right there. KEEP IN TOUCH Join our mailing list and get notified when we host Cornhole Tournaments, Pub Events and our annual St. Patrick’s Day Celebration. JOIN MAILING LIST BOOK GROUP EVENTS WITH US Bachelor/Bachelorette Parties Office Events Birthdays Send Offs You Name It! CONTACT US INSIDE SERVICE & ORDERS TO-GO Mon-Fri: 11am to 12am Sat & Sun: 9am to 12am 503.941.5592 J.B. O’Brien’s Irish Pub & Sports Bar 11555 SW Durham Road Tigard, OR 97224 (corner of 99W & Durham Road) 21 & Over No Live Music or Karaoke HOME ABOUT PUB MENU J.B.’S BLOG CONTACT US © 2025 JB O'Brien's Irish Pub & Sports Bar - All rights reserved | Site by DesignWise Art Join Our Mailing List Name First Last Email * Send Close"
    },
    {
      "url": "https://brandonschooldistrict.org/",
      "text": "Brandon School District - Home of the Blackhawks! ≡ Home Schools Latchkey Early Childhood & Preschool Harvey-Swanson Elementary Oakwood Elementary Brandon Middle School Brandon High School Summit Virtual Oakland Schools Technical Campuses Parents & Students Brandon Wellness Resources Bridges Math Career Cruising Grades 6-8 CMP3 Math K-8 Moodle NWEA MAP Resources ParentSquare Parent Portal Student Gmail Student Portal Xello Login Brandon Schools Spiritwear Parent Teacher Organizations Atlas Curriculum Mapping Brandon Bands Brandon Choirs https://www.michigan.gov/ok2say Departments Athletics Aquatics Board of Education Business Office Central Office Continuing Education Curriculum Department Enrollment Office Food Services Human Resources Maintenance & Operations Student Support Services Superintendent Technology Department Transportation Department Community Brandon Groveland Youth Assist Brandon Township Brandon Township Library Groveland Township Hadley Township Learning Achievement Coalition MSU Federal Credit Union Oakland Schools School Funding Project Ortonville DDA Village of Ortonville Bond Repayment Information School Finance Research Collaborative Staff Bridges Math Login Clever Lab Scheduler Mistar NWEA MAP Login ParentSquare Frontline/Aesop Login Professional Development FMX Login Schoology Staff Gmail Teacher Evaluations Website Worthy Form Brandon School District Brand Guide Website Login Employee Online Atlas Rubicon Staff Solution Box Business Plus (On Brandon network only) Favorites Students Athletics Breakfast & Lunch Menus Follett Destiny Student Gmail Student Portal Staff Aesop Education Staff Gmail Cloud Access Mistar BHS Daily Announcements Parents Event Calendar Parent Portal Parent Teacher Organizations Site Search Job Opportunities Quick Links 2025 Bond Proposal Information District Forms Brandon 2024-2027 Strategic Plan Brandon Wellness Resources Transportation Information Teacher and Support Staff Grant RFP's Annual Education Report Web Accessibility Policy Breakfast in Brandon Superintendent's Welcome Truth in Taxation Document District Calendars Brandon Schools Spiritwear District Home School Closing Information Distinguished Alumni Wall of Fame How to Enroll 2025 Bond Proposal Information Latest News Join Superintendent Carly Stone for Coffee and Conversation... September 05, 2025 2025 Bond Proposal Information August 06, 2025 Learn more about the 2025 Bond Proposal. Click here to read Frequently Asked Questions about the Bond Proposal Now Seeking Nominees for the Ed and Diane... August 04, 2025 Nominations will be accepted through August 31st, 2025. Please use the link below to find the nomination form and to also view the past recipients of the award. https://www.brandonschooldistrict.org/index.php/distinguished-alumni-award Pool Update as of August 6, 2025 July 17, 2025 POOL WILL BE OPEN ON AUGUST 7!! Open swim 7am-11am on Thursday and Friday and 10am-1pm on Saturday. All programs are back on their normal schedule. Join Superintendent Carly Stone for Coffee and Conversation... May 07, 2025 Kindergarten Round-up and Early Childhood Center Open House February 25, 2025 Save the date for Kindergarten Round-up events at Harvey-Swanson and Oakwood Elementary (March 4th, 5th) and an Open House at our Early Childhood Center (March 1st). Enrollment Fair - February 19th 2025 4:30 -... January 30, 2025 Due to the predicted weather forecast for Wednesday evening the Brandon Enrollment Fair has been rescheduled to Wednesday February 19th. You are invited to the Brandon School District 2025-2026 School Year Enrollment Fair. This open... Congratulations to our 2024 Retirees June 14, 2024 On behalf of everyone associated with the Brandon School District we would like to say THANK YOU for your outstanding service to our school community. Congratulations on your retirement and remember ‘Always Stay a Brandon... Brandon Board of Education Special Meeting June 04, 2024 The Brandon Board of Education will hold a Special Meeting for Part 2 Facilitated Superintendent Evaluation at 6:30 p.m. on Wednesday, June 5th, in the Central Office Board Room. Please access the link below for... Brandon Board of Education Special Meeting May 28, 2024 Brandon Board of Education Special Meeting The Brandon Board of Education will hold a Special Meeting for Part 1 Facilitated Superintendent Evaluation at 6:30 p.m. on Wednesday, May 29th, in the Central Office Board Room.... Meet The Team Night May 07, 2024 Save the date for the 2024-2025 Meet the Teams Night for Middle and High School Students. Any questions should be directed to the Athletic Office: https://brandonblackhawks.org/ Enrollment Event - May 30th, 2024 April 17, 2024 Save the date for an enrollment fair on May 30th. RSVP using the link below and you'll be entered for a raffle to win a prize basket! https://docs.google.com/forms/d/e/1FAIpQLScJ2w5v1GatYPgBYuAwDalqR1ZKO6kwIaQXVPzHjaxnB2oneg/viewform Upcoming Events 11 Sep Back to School Night: BMS Thursday - September 11, 2025 6:30 PM - 8:00 PM 19 Sep First Responders Football Game Friday - September 19, 2025 7:00 PM - 10:00 PM 22 Sep Picture Day: Harvey Monday - September 22, 2025 22 Sep STEMI  Visit Monday - September 22, 2025 23 Sep STEMI  Visit Monday - September 22, 2025 24 Sep STEMI  Visit Monday - September 22, 2025 24 Sep Mackinac Parent Meeting Wednesday - September 24, 2025 6:00 PM - 7:00 PM 25 Sep STEMI  Visit Monday - September 22, 2025 Spotlight on Brandon New Swimming School Record Congratulations to Senior Dominic Mahan for breaking the school record in the 100 M Breaststroke with a time of 1:03.73. First Team All-State Receiver Congratulations to senior Drew Hickmott for making FIRST TEAM ALL-STATE as a Wide Receiver! Way to go, Drew! State Champion Pole Vaulter Congratulations to Allison Shelton on winning the State Championship in the Pole Vault! We’re so proud of your determination and hard work! GO BLACKHAWKS!! Track Stars Earn All-State Honors Congratulations to Nolan Tews, Tricia Pierce, and Brooke Kilyk for earning All-State honors in track and field. Nolan placed 7th in the long jump, Tricia placed 5th in the pole... Veterans Visit Harvey-Swanson Veterans from Ortonville VFW Post 582 visited with students at Harvey-Swanson Elementary School recently. Here is the full story from the Citizen.Veterans Visit BHS Students Place 3rd in Nation Brandon High School students Kyra Burger, Haley Solo, and Sarah Pesta took 3rd place at the AASTO National Bridge Building competition in Maine. Congratulations, girls! Our Schools The Brandon School District is proud of its beautiful schools that set out to challenge and engage students on a daily basis. Early Childhood & Preschool 209 Varsity Drive Ortonville, MI 48462 (248) 627-1865 Chrissandra Padilla, Director Latchkey 209 Varsity Drive Ortonville, MI 48462 (248) 627-1859 Penny Green, Latchkey Coordinator Chrissandra Padilla, Director Harvey-Swanson Elementary 209 Varsity Drive Ortonville, MI 48462 (248) 627-1850 Jessica Hevel, Principal Brandon High School 1025 S Ortonville Road Ortonville, MI 48462 (248) 627-1820 Daniel Stevens, Principal Oakwood Elementary 2839 Oakwood Road Ortonville, MI 48462 (248) 627-1880 Colleen Ransford, Principal Summit Virtual School 1025 S Ortonville Road Ortonville, MI 48462 (248) 793-1808 Megan Koslowski, Director Brandon Middle School 609 S Ortonville Road Ortonville, MI 48462 (248) 627-1830 Kevin Ayre, Principal B-R-A-N-D-O-N! We've got a lot of great things going on here at Brandon. Here are just a few things you might not have known. By The Numbers 24.6 BHS freshman Taylor Whitkopf's new Brandon pool record in the 50 meter freestyle. 30+ ACT score achieved by BHS seniors Audrey Lamiman, Robert Kayfish, and Lilliana Taylor, putting them in the top 5% of all test takers! 76 Number of trombones in the big parade and the number of BMS 8th graders headed to Washington, D.C. next month. Did You Know? Music is an integral part of student life at Brandon. With a variety of bands and choirs from the elementary schools to the high school, we have something for any musical interest. Virtual learning has taken hold at Brandon. With a menu of options to meet special academic requests and scheduling conflicts, our virtual school has seen tremendous growth. Academics are a priority at all grade levels. With advanced and honors opportunities at the lower grades to a large AP offering, we can challenge even the most motivated students. Graduation is just the beginning. Recent graduates have matriculated at MIT, University of Chicago, University of Michigan, Michigan State, and many other excellent schools. Athletics bring our community together. Competing in the Flint Metro League, our Blackhawks regularly compete for league titles and berths in the state tournament. Technology is part of our fabric. Each school in our district is equipped with state of the art technology, highlighted by a 1:1 device to student ratio at Harvey-Swanson Elementary. Testimonials Jeremiah De Jose '04 The teachers and coaches during my time at BHS constantly challenged me to be a... Lori Marino, Parent We live in a neighboring community and I have brought my children to school in... Noah Cox '19 Brandon gave me a lot of great opportunities. I don’t think I’d be where I... Contact Us (248) 627-1800 (248) 627-4533 info@brandon.k12.mi.us www.brandonschooldistrict.org FOIA Requests Find Us Brandon School District 1025 S Ortonville Road Ortonville, MI 48462 Connect With Us Goto Top Home Schools Latchkey Early Childhood & Preschool Harvey-Swanson Elementary Oakwood Elementary Brandon Middle School Brandon High School Summit Virtual Oakland Schools Technical Campuses Menu Picture - Schools Parents & Students Brandon Wellness Resources Bridges Math Career Cruising Grades 6-8 CMP3 Math K-8 Moodle NWEA MAP Resources ParentSquare Parent Portal Student Gmail Student Portal Xello Login Brandon Schools Spiritwear Parent Teacher Organizations Atlas Curriculum Mapping Brandon Bands Brandon Choirs https://www.michigan.gov/ok2say Menu Picture - Parents & Students Departments Athletics Aquatics Board of Education Business Office Central Office Continuing Education Curriculum Department Enrollment Office Food Services Human Resources Maintenance & Operations Student Support Services Superintendent Technology Department Transportation Department Menu Picture - Departments Community Brandon Groveland Youth Assist Brandon Township Brandon Township Library Groveland Township Hadley Township Learning Achievement Coalition MSU Federal Credit Union Oakland Schools School Funding Project Ortonville DDA Village of Ortonville Bond Repayment Information School Finance Research Collaborative Menu Picture - Community Staff Bridges Math Login Clever Lab Scheduler Mistar NWEA MAP Login ParentSquare Frontline/Aesop Login Professional Development FMX Login Schoology Staff Gmail Teacher Evaluations Website Worthy Form Brandon School District Brand Guide Website Login Employee Online Atlas Rubicon Staff Solution Box Business Plus (On Brandon network only) Menu Picture - Staff Resources Favorites Students Athletics Breakfast & Lunch Menus Follett Destiny Student Gmail Student Portal Staff Aesop Education Staff Gmail Cloud Access Mistar BHS Daily Announcements Parents Event Calendar Parent Portal Parent Teacher Organizations Site Search Job Opportunities"
    },
    {
      "url": "https://obriensirishpubsf.com/",
      "text": "Welcome to Obrien's Irish Pub - Obriens Irish Pub Skip to content HOME MENU CONTACT HOME MENU CONTACT Instagram Yelp Phone RESERVATIONS ORDER TO-GO RESERVATIONS ORDER TO-GO HOME CONTACT MENU RESERVATIONS ORDER ON-LINE HOME CONTACT MENU RESERVATIONS ORDER ON-LINE Instagram Yelp Phone Welcome to O'Brien's Irish Pub The Best of Traditional Irish and Local Cuisine located in San Francisco’s Sunset District at 1940 Taraval Street. CONTACT US ORDER FOR PICK-UP SPECIAL EVENTS Join us for these special events and times. LIVE IRISH MUSIC • SUNDAYS Live Irish Traditional music by the GASMEN every Sunday from 6 – 8.30pm HAPPY HOUR • 4-6PM • MON-FRI Enjoy Happy Hour Drink and Food Specials weekdays from 4pm-6pm. WEEKEND BRUNCH Enjoy O’briens Bottomless Mimosa brunch every Saturday and Sunday. Check Hours for Times. POPULAR ITEMS FISH N CHIPS $22 Wild cod battered and fried, served with french fries, mushy peas and tartar sauce. DOUBLE PADDY BURGER $22 Two smash beef patties with American cheese, caramelized onions, lettuce, tomato, and secret sauce served with a side of fries. Half Roasted Chicken $30 served with fingerling potatoes, brussels sprouts, green beans, and lemon herb sauce. VIEW FULL MENU Testimonials Reviews from our visitors \"Definitely recommend the Full Irish for breakfast. Service is awesome! I sat at the bar and food and drink service was great.\" Gerald H. Fairfield, CA \" I lucked out, and the kitchen still had some of the weekend prime rib. A fine treat for Sunset folks who don't want to drive down to Van Ness for a good prime rib.\" Eric S. San Francisco, CA \"The service was outstanding, all of the staff were very friendly and the atmosphere was lively! If you're looking for a great feed and a fun date-night spot, then go to O'Briens!\" Wilton Groves Trader “I'm especially excited right now after the amazing brunch we had - Irish breakfast, eggs Benedict, and the Apple fritter pancake, Bloody Mary.” Victoria T San Francisco, CA Sign-up and be the first to know about upcoming events, food and drink specials. Name Email Submit Come and Enjoy the Best of Irish and Local Cuisine. Greeted with Warm Hospitality, Live Music, Sports, Craft Cocktails, and Local Beer. Location 1940 Taraval St. San Francisco, CA 94116 Phone 415-463-6712 Email info@obriensirishpubsf.com Kitchen Hours Monday - Friday 4pm – 10pm Saturday 11am – 10pm Brunch (11am – 3pm) Sunday 10am – 10pm Brunch (10am – 3pm) Bar Hours Monday - Thursday 4pm – 11:30pm Friday 3pm – 1:00am Saturday 11am – 1:00am Sunday 10am – 11:30pm © 2024 O’Briens Irish Pub. A SinceEighty6 Site Privacy Policy Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    }
  ]
}