{
  "fuentes": [
    {
      "url": "https://business.manateechamber.com/list/member/o-bricks-irish-pub-martini-bar-8155.htm",
      "email": "info@manateechamber.com"
    },
    {
      "url": "https://discoverbradenton.com/business/obricks-irish-pub-martini-bar/",
      "email": "20admin@discoverbradenton.com"
    },
    {
      "url": "https://discoverbradenton.com/business/obricks-irish-pub-martini-bar/",
      "email": "admin@discoverbradenton.com"
    }
  ],
  "mails": [
    "20admin@discoverbradenton.com",
    "admin@discoverbradenton.com",
    "info@manateechamber.com"
  ],
  "nombre_sitio": "obricks.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://business.manateechamber.com/list/member/o-bricks-irish-pub-martini-bar-8155.htm",
      "text": "O'Bricks Irish Pub & Martini Bar | Restaurants - Manatee Chamber of Commerce About Us About the Chamber Advocacy & Public Policy Chamber Committees Chamber Events Current Magazine In the News Manatee Chamber Foundation Manatee Young Professionals Meet the Board Meet the Chamber Ambassadors Meet the Staff Member Benefits & Engagement Guide Travel With the Chamber Business Better Business Council Business Against Narcotics and Drugs Find a Business Job Resources Join the Chamber Leadership Manatee Library of Recorded Webinars LocalQuotes4U Online Learning Start and Grow a Business Community Coupons Community Events Calendar Community Guide Digital Map Government & Community Resources Houses of Worship LocalQuotes4U New Resident Information Request a Relocation Packet Request a Visitor Packet Storm Recovery Things to See and Do Find a Business Contact Us Join the Chamber Select Page O'Bricks Irish Pub & Martini Bar Categories Restaurants 427 12th St. W. Bradenton FL 34205 (941) 896-8860 Visit Website Hours: Monday to Saturday Kitchen Hours | 11 AM - 10 PM Sunday Hours | CLOSED About Us Fabulous, inventive food and drink is better shared with friends. Take equal parts Manhattan style martini bar and Irish pub then mix in creative salads, fresh local and exotic seafood, perfect steaks, beers from around the globe, fabulous wines, and a completely new, smoke-free interior. Rep/Contact Info Bethany Carter × Close Bethany Carter Director of Operations Send an Email Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Contact Info Phone: 941-748-3411 Email: info@manateechamber.com Contact the Staff Two Offices to Serve You Bradenton Office: 222 10th St. W.; Bradenton, FL 34205 Lakewood Ranch Office at the McClure Center: 4215 Concept Court; Lakewood Ranch, FL 34211 The Manatee Chamber of Commerce, a Florida Chamber of Commerce, is located in Bradenton, Florida and serves Anna Maria Island, Bradenton, Bradenton Beach, Ellenton, Holmes Beach, Lakewood Ranch, Longboat Key, Palmetto, Parrish, and Myakka City. Lakewood Ranch and Longboat Key are bi-County areas, split between Sarasota and Manatee. The area is considered part of the South Tampa Bay Region. We provide education and networking opportunities, job / employment assistance, and small business start-up counseling while working on community issues such as legislation, water, transportation, and general quality of life. The Manatee Chamber has a full-service Better Business Council, Drug-Free Workplace Program. EMAIL: info@manateechamber.com //  PHONE: 941-748-3411 //  HOMEPAGE: Manatee Florida Chamber of Commerce (www.ManateeChamber.com)\nBradenton Office: 222 10th St. W.; Bradenton, FL 34205 | \nLakewood Ranch Office at the McClure Center: 4215 Concept Court; Lakewood Ranch, FL 34211 MANATEE COUNTY CHAMBER OF COMMERCE  //  VOTED #1 FLORIDA CHAMBER OF COMMERCE Five-time Florida Chamber of the Year Winner and Recipient of the Inaugural National Chamber of the Year Award. Facebook Instagram Linkedin Copyright 2024 Manatee Chamber of Commerce"
    },
    {
      "url": "https://discoverbradenton.com/business/obricks-irish-pub-martini-bar/",
      "text": "Discover Bradenton Directory: O'Bricks Irish Pub & Martini Bar Skip to content Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Instagram Facebook Envelope Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login send email Visit website Restaurants & Nightlife O'Bricks Irish Pub & Martini Bar Our bar, grill, and banquet room are housed in two of downtown Bradenton’s oldest structures – and the history and spirit of our buildings inspire us every day. With such a beautiful modern interior, it’s hard to believe that the two buildings occupied by O’bricks actually date back to the turn of the century. The Bar at O’bricks occupies space in the old Juplinor Hotel, and the adjoining Grill and Banquet Room reside in the Anderson-Finkham Building, which since its construction in 1901 has undergone several renovations. Come see us for Lunch, Dinner, or Cocktails seven days a week. We also feature a brunch menu on Saturday & Sunday. We pride ourselves in serving quality food & Cocktails. Happy Hour is seven days a week from 2 PM – 7 PM. CONTACT 941-896-8860 Address 427 12th Street West SOCIAL Facebook Instagram 8 Reviews on “O'Bricks Irish Pub & Martini Bar” Excellent 5 8 reviews 5 4 3 2 1 Jill D Very enjoyable experiences the 3 times we have been. Always great food, service and prices. Definitely on our list of frequent returns. June 21, 2023,\n\t\t\t\t\t\t\t6:59 pm Reply Nethranjalie This place is amazing. I had my birthday dinner here with friends from work and they absolutely loved it. The food was great and the portions were HUGE! I loved the steak. But what amazed me the most were their desserts. They were out of this world!!! Especially the molten lava cake and the creme brûlée. My husband loved the desserts too. We will definitely go there again! April 6, 2022,\n\t\t\t\t\t\t\t2:02 pm Reply Becky Arpaia Mike Carter Wings ate the BEST! February 14, 2021,\n\t\t\t\t\t\t\t9:51 pm Reply Johanna Carpenter O’bricks on Main Street in downtown Bradenton is a place where I celebrated with my mother for her 80th birthday!! It was the perfect venue for a precious event!! This year we will be celebrating my Mother’s 83rd Birthday with the O’Bricks staff!! Another family member will be able to join us this year!! I can’t think of any other venue for such an important event that can supply so many good memories with the best food of choices!! February 12, 2021,\n\t\t\t\t\t\t\t9:49 am Reply Ann Adams We have been several times and the service and food is amazing I definitely recommend this place for sure February 11, 2021,\n\t\t\t\t\t\t\t1:30 pm Reply Sarah Preston This place is perfect. First, the menu. Whether you’re looking for something casual or a nice dinner-they have the best of both worlds. I have never had a bad meal. Well priced for what you get. Same thing with the drinks. Excellent happy hour. And to top it off, the service is impeccable. This is one of “those” restaurants you could eat at 7 days a week and never get bored. August 13, 2020,\n\t\t\t\t\t\t\t2:13 pm Reply Amanda Curl Hands down our favorite place downtown. The martinis are perfect, food is always great. Love the brunch during the farmers market too so definitely don’t miss that when it’s offered. August 13, 2020,\n\t\t\t\t\t\t\t10:44 am Reply Margaret Parsons Wonderful restaurant in downtown Bradenton with indoor and outdoor dining options. They have the best lobster mac and cheese around. Staff friendly and nice atmosphere. August 7, 2020,\n\t\t\t\t\t\t\t8:24 am Reply Leave a Review Cancel reply Your email address will not be published. Review text Select a rating Overall Name Email Website Save my name, email, and website in this browser for the next time I comment. Previous Next More For You #SupportLocal Sponsor Featured Adobe Graffiti Lounge Read more >> Anna Maria Oyster Bar Read more >> #SupportLocal Sponsor Featured Avocados Mexican Restaurant Read more >> View all Images Courtesy of Pablo Ortega Photography Facebook Instagram Information 1201 6th Ave W #100, Bradenton, FL 34205 Admin@DiscoverBradenton.com Meet The Founder Disclaimer cancellation form © 2025 Discover Bradenton Terms and Conditions Privacy Policy Change Location Find awesome listings near you! Change Location"
    }
  ]
}