{
  "fuentes": [
    {
      "url": "https://www.clickorlando.com/news/local/2025/05/11/ocala-wetland-recharge-park-temporarily-closes-over-sinkholes-city-says/",
      "email": "bhogan1@wkmg.com"
    },
    {
      "url": "https://www.wcjb.com/2021/04/02/ocala-wetland-recharge-park-re-opens-with-new-educational-exhibits/",
      "email": "julia.laude@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com/2021/04/02/ocala-wetland-recharge-park-re-opens-with-new-educational-exhibits/",
      "email": "publicfile@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com/2021/04/12/ocala-wetland-recharge-park-closed-to-repair-sinkhole/",
      "email": "julia.laude@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com/2021/04/12/ocala-wetland-recharge-park-closed-to-repair-sinkhole/",
      "email": "publicfile@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com/content/news/Sinkholes-postpone-opening-of-Ocala-Wetland-Groundwater-Recharge-Park-513267661.html",
      "email": "gdmdev@gray.tv"
    },
    {
      "url": "https://www.wcjb.com/content/news/Sinkholes-postpone-opening-of-Ocala-Wetland-Groundwater-Recharge-Park-513267661.html",
      "email": "julia.laude@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com/content/news/Sinkholes-postpone-opening-of-Ocala-Wetland-Groundwater-Recharge-Park-513267661.html",
      "email": "publicfile@wcjb.com"
    },
    {
      "url": "https://www.stonecreekdelwebb.com/",
      "email": "cheri.irwin@fsresidential.com"
    },
    {
      "url": "https://www.stonecreekdelwebb.com/",
      "email": "dylan.whiteside@fsresidential.com"
    },
    {
      "url": "https://www.stonecreekdelwebb.com/",
      "email": "erik.hageman@fsresidential.com"
    },
    {
      "url": "https://www.stonecreekdelwebb.com/",
      "email": "nikki.courterier@fsresidential.com"
    },
    {
      "url": "https://www.stonecreekdelwebb.com/",
      "email": "rachel.mayer@fsresidential.com"
    }
  ],
  "mails": [
    "bhogan1@wkmg.com",
    "cheri.irwin@fsresidential.com",
    "dylan.whiteside@fsresidential.com",
    "erik.hageman@fsresidential.com",
    "gdmdev@gray.tv",
    "julia.laude@wcjb.com",
    "nikki.courterier@fsresidential.com",
    "publicfile@wcjb.com",
    "rachel.mayer@fsresidential.com"
  ],
  "nombre_sitio": "ocalafl.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.clickorlando.com/news/local/2025/05/11/ocala-wetland-recharge-park-temporarily-closes-over-sinkholes-city-says/",
      "text": "Ocala Wetland Recharge Park temporarily closes over sinkholes, city says Skip to main content Open Main Menu Navigation Open Search Clear icon 76 º Go to the WKMG homepage Join Insider Sign In Open the WKMG News 6 & ClickOrlando Help Desk Search News Watch Live Insider Investigators Local News Florida National World Politics Space News Entertainment Strange Florida Weather Weather News PinIt! Hurricane Weather Wise Forecasting Change Alerts Live Orlando Cam Live Beach Cam Live Port Cam Live Mount Dora Cam Live Palm Island Park Cam News 6+ Watch News 6+ Insider I-4 Food Tour Florida Foodie Solutionaries Black Men Sundays NEXTGEN TV The Hecht Effect Real Estate Getting Results. Results Desk Driving Change Protecting Our Community Getting Results In Our Schools Getting Results At Home Need Results? Traffic Ask Trooper Steve On Patrol Features Insider Events Calendar 6 Things To Do Theme Parks Pets Food Health Travel Tech Pros Who Know Branded Content Sports Orlando Magic Orlando Magic - Stats UCF Knights UCF Knights - Stats Florida Gators Florida Gators - Stats Orlando City SC Orlando Pride Miami Dolphins Dolphins - Stats Tampa Bay Buccaneers Buccaneers - Stats Jacksonville Jaguars Jaguars - Stats Player of the Week Olympics Contact Us Results Desk Insider Meet The Team Careers at WKMG Advertise with us Contests & Rules TV Listings Community Calendar Newsletters Newsletters News Weather News 6+ Getting Results. Traffic Features Sports Contact Us Newsletters News Weather News 6+ Getting Results. Traffic Features Sports Contact Us Newsletters WEATHER ALERT 2 warnings and 3 advisories in effect for 4 regions in the area Show Breaking News Bar Close Local News Brandon Hogan , Digital Editor Published: May 11, 2025 at 12:25 PM Tags: Ocala , Marion County , Sinkhole RELATED STORIES Hole stretches an estimated 500 feet below the surface Florida’s deepest sinkhole is off-limits. Here’s the tragic story behind it Read full article: Florida’s deepest sinkhole is off-limits. Here’s the tragic story behind it Kenny Pollard, 75, holds a photo in his home from a vacation that he and his wife, Elizabeth, took to Clearwater Beach, Fla., approximately 10 years ago. (AP Photo/Matt Freed) Crews recover the body of a woman from a Pennsylvania sinkhole Read full article: Crews recover the body of a woman from a Pennsylvania sinkhole UCF engineering professor explains how sinkholes happen What Florida homeowners should know about ‘Sinkhole Alley’ Read full article: What Florida homeowners should know about ‘Sinkhole Alley’ LATEST NEWS Commissioners must vote again on Sept. 23 2 hours ago Seminole County votes to raise property taxes for first time in 16 years Read full article: Seminole County votes to raise property taxes for first time in 16 years Lines painted on the center of a road. 5 hours ago Major Lake County road could be renamed after Charlie Kirk, commissioner says Read full article: Major Lake County road could be renamed after Charlie Kirk, commissioner says Supporters of Orlando Torah Center contend facility essential to the Orthodox Jewish community 7 hours ago DOJ opens civil rights investigation into Orange County zoning over Orlando Torah Center denial Read full article: DOJ opens civil rights investigation into Orange County zoning over Orlando Torah Center denial Florida Gov. Ron DeSantis 3 hours ago Florida leaders react after conservative influencer Charlie Kirk killed Read full article: Florida leaders react after conservative influencer Charlie Kirk killed Sign up for our events newsletter: Sign Up Local News Ocala Wetland Recharge Park temporarily closes over sinkholes, city says Park will remain closed pending results of full assessment Brandon Hogan , Digital Editor Published: May 11, 2025 at 12:25 PM Tags: Ocala , Marion County , Sinkhole Ocala Wetland Recharge Park temporarily closes over sinkholes, city says (City of Ocala) OCALA, Fla. – Ocala Wetland Recharge Park has temporarily closed due to multiple areas of ground subsidence and sinkholes, according to the city. The park will stay closed pending the results of a full assessment, the city of Ocala said Friday on social media . Recommended Videos Ocala Wetland Recharge Park temporarily closes over sinkholes, city says (City of Ocala) [EXCLUSIVE: Become a News 6 Insider (it’s FREE) | PINIT! Share your photos ] The post included photos showing the ground depressions, with one of them appearing to be several feet deep at the least. Ocala Wetland Recharge Park temporarily closes over sinkholes, city says (City of Ocala) Those with questions are encouraged to contact the city’s Water Resources Department by calling 352-351-6772. Copyright 2025 by WKMG ClickOrlando - All rights reserved. About the Author Brandon Hogan headshot Brandon Hogan Brandon, a UCF grad, joined the ClickOrlando team in November 2021. Before joining News 6, Brandon worked at WDBO. email RELATED STORIES Florida’s deepest sinkhole is off-limits. Here’s the tragic story behind it Read full article: Florida’s deepest sinkhole is off-limits. Here’s the tragic story behind it Crews recover the body of a woman from a Pennsylvania sinkhole Read full article: Crews recover the body of a woman from a Pennsylvania sinkhole What Florida homeowners should know about ‘Sinkhole Alley’ Read full article: What Florida homeowners should know about ‘Sinkhole Alley’ Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us / Follow on Social Media Careers at WKMG Closed Captioning / Audio Description Public File Current EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications EEO Report Disability Assistance Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (407) 291-6000 At WKMG, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 ClickOrlando.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    },
    {
      "url": "https://www.wcjb.com/2021/04/02/ocala-wetland-recharge-park-re-opens-with-new-educational-exhibits/",
      "text": "Ocala Wetland Recharge Park re-opens with new educational exhibits Skip to content Download Apps Newsletter Tell Us Something Good Be Our Guest Meet the Team Advertise with Us Submit Photos and Videos Watch Live Video News First Alert Weather Sports Features Hurricane HQ Telemundo Contact Us Community InvestigateTV Home Watch Live News Gainesville Ocala Lake City State National Crime Politics Education Health Good News Sponsored First Alert Weather Hurricane HQ 24/7 Live Weather Radar Weather Maps Forecast Graphics Tropics Graphics First Alert Explained Weather 101 Sports Florida Gators High School Scholar Athlete Russell Report TV20 Coaches Spotlight Junior College Chomp List Submit Your Sports Photos Español Contact Us News Tips Meet the Team Download Our Apps Advertise Employment Advertise Features Bright Futures One Class at a Time Hometown Heroes Paige's Kitchen Tech Tuesday FL Man Adventures Adopt A Pet Wildlife Wednesday Fitness Community Community Calendar Contests TV20 Newsletter Sign-Up Submit Photos and Videos Tell Us Something Good Programming Schedule Zeam - News Streams Gray DC Bureau NextGen TV Zeam - News Streams InvestigateTV Watching Your Wallet Be Our Guest Sky20 Drone Your Local Chamber Your Local Experts HealthCARES Watch ABC Online PowerNation Circle Country Digital Marketing Ocala Wetland Recharge Park re-opens with new educational exhibits By Julia Laude Published : Apr. 2, 2021 at 5:28 PM EDT Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn To keep up with the latest local news subscribe to our TV20 newsletter HERE and receive news straight to your email every morning. OCALA, Fla. (WCJB) - Ocala’s Wetland Recharge Park is open after being closed for two weeks to install educational exhibits in the park. Related story: Ocala Wetland Recharge Park gets educational exhibits The exhibits explain the water cycle, and show how plant and wildlife impact the park. TIME LAPSE | Here’s a look at some of the new educational installments at the Ocala Wetland Recharge Park! @CityofOcalaFL @WCJB20 pic.twitter.com/aLnVfGBChs — Julia Laude (@JuliaMaeLaude) April 2, 2021 City officials hope this shows people how they can be ‘environmentally friendly.’ “Basically that they appreciate the whole process and understand it, and understand how our water system works, and be more environmentally friendly as far as protecting our natural resource which is our water,” City Engineer and Director of Engineering and Water Resources, Sean Lanier said. Lanier also said that they want to build more educational elements for the park as well as a pavilion in the future. “We may in the future add additional exhibits along the trail. We also have in design right now, we’re going to construct a pavilion, which will be a covered area right here, along with another bathroom facility and it will have some additional educational exhibits the will be inside of it,” he said. The project was paid for by a grant from the Florida Department of Environmental Protection. Copyright 2021 WCJB. All rights reserved. Click here to subscribe to our newsletter. Most Read 3 killed after semi-truck does U-turn on Florida Turnpike 9-year-old arrested for bringing loaded gun on school bus in Ocala 16-year-old girl dies after crashing into semi-truck on US Highway 19 Deputies break up fights after hundreds crowd Dixie County bar, investigation underway Columbia County firefighter, wife arrested on child porn, bestiality charges Students walk out in support of Gainesville High School teacher accused of bullying Accident on US Highway 19 claims life of 16-year-old Dixie County student Class action lawsuit against UF will now proceed after the University withdrew its request for an appeal Latest News Dunnellon city council seat 2 filled after being empty for months Marion County commissioners decide to raise fire, solid waste fees Archer employee arrested for theft as residents call for county takeover Gainesville city commissioners vote to raise millage rate 4.7%, increase spending 4.3% Gainesville city commissioners vote to raise millage rate 4.7%, increase spending 4.3% Archer employee arrested for theft as residents call for county takeover University of Florida students rally to restore RTS bus routes: ‘We want our buses back’ Man arrested after falsifying documents in an attempt to steal someone’s home News First Alert Weather Sports Livestream Contests Contact Us WCJB E-News WCJB 6220 NW 43rd Street Gainesville, FL 32653 (352) 377-2020 Public Inspection File publicfile@wcjb.com -  (352) 416-0610 Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Closed Captioning/Audio Description Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "https://www.wcjb.com/2021/04/12/ocala-wetland-recharge-park-closed-to-repair-sinkhole/",
      "text": "Ocala Wetland Recharge Park closed to repair sinkhole Skip to content Download Apps Newsletter Tell Us Something Good Be Our Guest Meet the Team Advertise with Us Submit Photos and Videos Watch Live Video News First Alert Weather Sports Features Hurricane HQ Telemundo Contact Us Community InvestigateTV Home Watch Live News Gainesville Ocala Lake City State National Crime Politics Education Health Good News Sponsored First Alert Weather Hurricane HQ 24/7 Live Weather Radar Weather Maps Forecast Graphics Tropics Graphics First Alert Explained Weather 101 Sports Florida Gators High School Scholar Athlete Russell Report TV20 Coaches Spotlight Junior College Chomp List Submit Your Sports Photos Español Contact Us News Tips Meet the Team Download Our Apps Advertise Employment Advertise Features Bright Futures One Class at a Time Hometown Heroes Paige's Kitchen Tech Tuesday FL Man Adventures Adopt A Pet Wildlife Wednesday Fitness Community Community Calendar Contests TV20 Newsletter Sign-Up Submit Photos and Videos Tell Us Something Good Programming Schedule Zeam - News Streams Gray DC Bureau NextGen TV Zeam - News Streams InvestigateTV Watching Your Wallet Be Our Guest Sky20 Drone Your Local Chamber Your Local Experts HealthCARES Watch ABC Online PowerNation Circle Country Digital Marketing Ocala Wetland Recharge Park closed to repair sinkhole By Julia Laude Published : Apr. 12, 2021 at 5:15 PM EDT Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn To keep up with the latest local news subscribe to our TV20 newsletter HERE and receive news straight to your email every morning. OCALA, Fla. (WCJB) - The Ocala Wetland Recharge Park is dealing with another sinkhole. In 2019 the opening of several sinkholes at the park delayed the grand opening. Relayed story: Sinkholes postpone opening of Ocala Wetland Groundwater Recharge Park This most recent sinkhole opened up last Tuesday. Due to this sinkhole, 1.2 million gallons of public access reuse water was drained into the aquifer, but officials said that the loss of water and the sinkhole, are not a danger to the public. Ocala City Officials said this is a normal occurrence associated with a nature area like this one. “Especially in this area where we have, what they call karst topography, or karst formations. The lime rock formation beneath us in this part of Florida, the layer of soil over top of the actual lime rock is very thin and what happens is water over time will erode the lime rock and if there’s, basically its porous, kind of like Swiss cheese, there’s little caverns under there and if it erodes through a thing section of the ceiling of the cavern it’ll cause a collapse, it’ll erode it away and then everything just comes into it,” Ocala City Engineer and Director of Engineering and Water Resources, Sean Lanier said. The park closed Monday and will remain closed until Saturday for crews to go in and repair the hole. “This occurred in the deep zone so it’s not going to interfere with any of the plants that we’ve planted. There was an old inner there that was actually left from the golf course and we’re going to probable remove some of the liner and put down, do some back filling, compaction and then we’re going to put down a little clay layer, liner, and then we’ll be done,” Lanier added. Related story: New wetland recharge park opens in Ocala Copyright 2021 WCJB. All rights reserved. Click here to subscribe to our newsletter. Most Read 3 killed after semi-truck does U-turn on Florida Turnpike 9-year-old arrested for bringing loaded gun on school bus in Ocala 16-year-old girl dies after crashing into semi-truck on US Highway 19 Deputies break up fights after hundreds crowd Dixie County bar, investigation underway Columbia County firefighter, wife arrested on child porn, bestiality charges Students walk out in support of Gainesville High School teacher accused of bullying Accident on US Highway 19 claims life of 16-year-old Dixie County student Class action lawsuit against UF will now proceed after the University withdrew its request for an appeal Latest News Dunnellon city council seat 2 filled after being empty for months Marion County commissioners decide to raise fire, solid waste fees Archer employee arrested for theft as residents call for county takeover Gainesville city commissioners vote to raise millage rate 4.7%, increase spending 4.3% Gainesville city commissioners vote to raise millage rate 4.7%, increase spending 4.3% Archer employee arrested for theft as residents call for county takeover University of Florida students rally to restore RTS bus routes: ‘We want our buses back’ Man arrested after falsifying documents in an attempt to steal someone’s home News First Alert Weather Sports Livestream Contests Contact Us WCJB E-News WCJB 6220 NW 43rd Street Gainesville, FL 32653 (352) 377-2020 Public Inspection File publicfile@wcjb.com -  (352) 416-0610 Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Closed Captioning/Audio Description Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "https://www.wcjb.com/content/news/Sinkholes-postpone-opening-of-Ocala-Wetland-Groundwater-Recharge-Park-513267661.html",
      "text": "Sinkholes postpone opening of Ocala Wetland Groundwater Recharge Park Skip to content Download Apps Newsletter Tell Us Something Good Be Our Guest Meet the Team Advertise with Us Submit Photos and Videos Watch Live Video News First Alert Weather Sports Features Hurricane HQ Telemundo Contact Us Community InvestigateTV Home Watch Live News Gainesville Ocala Lake City State National Crime Politics Education Health Good News Sponsored First Alert Weather Hurricane HQ 24/7 Live Weather Radar Weather Maps Forecast Graphics Tropics Graphics First Alert Explained Weather 101 Sports Florida Gators High School Scholar Athlete Russell Report TV20 Coaches Spotlight Junior College Chomp List Submit Your Sports Photos Español Contact Us News Tips Meet the Team Download Our Apps Advertise Employment Advertise Features Bright Futures One Class at a Time Hometown Heroes Paige's Kitchen Tech Tuesday FL Man Adventures Adopt A Pet Wildlife Wednesday Fitness Community Community Calendar Contests TV20 Newsletter Sign-Up Submit Photos and Videos Tell Us Something Good Programming Schedule Zeam - News Streams Gray DC Bureau NextGen TV Zeam - News Streams InvestigateTV Watching Your Wallet Be Our Guest Sky20 Drone Your Local Chamber Your Local Experts HealthCARES Watch ABC Online PowerNation Circle Country Digital Marketing Sinkholes postpone opening of Ocala Wetland Groundwater Recharge Park By Julia Laude Published : Jul. 26, 2019 at 6:46 PM EDT Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn The City of Ocala is getting closer to opening its new Wetland Groundwater Recharge Park, but sinkholes have been opening up there, postponing the completion of the park. The Wetland Groundwater Recharge Park is a 60-acre recreation ground, allowing residents to take in some beautiful views and benefit from recycled filtered water. Water used for irrigation, drinking, and cooking will be filtered through the aquifer, and then pumped to the city's water treatment plant, for residents to use all over again. Officials said this natural filtration system will reduce the City's environmental footprint by 50 percent, by recharging up to five million gallons a day. But there have been some roadblocks during the construction of this new park. \"We've ha few, between 10 and 14 sinkholes, varying in sizes, most of them have been very small like a four inches pipe, something like that, what we call little chimneys and we've had about three or four bigger sinkholes between a four and five-foot round,” said Project Manager of the Recharge Park Jimmy Lopez. But according to Environmental Scientist and Systems Ecologist with the Florida Springs Institute, Bob Knight, there isn't any need for concern. Knight has over 38 years of experience as an aquatic and wetland ecologist in Florida. \"Having a sinkhole in the finished project would be a problem in terms of a direct connection but it's something that can be repaired as long as it's not too large and multiple sinkholes can be repaired and then growing the wetland plants out there will provide the benefits of removing nitrogen from the wastewater,” Knight said. The Recharge Park was originally set to open this fall, but due to the sinkholes, this has been pushed back. Contractors still need to do several tasks including planting the wetland plants in flooding areas. Most Read 3 killed after semi-truck does U-turn on Florida Turnpike 9-year-old arrested for bringing loaded gun on school bus in Ocala 16-year-old girl dies after crashing into semi-truck on US Highway 19 Deputies break up fights after hundreds crowd Dixie County bar, investigation underway Columbia County firefighter, wife arrested on child porn, bestiality charges Students walk out in support of Gainesville High School teacher accused of bullying Accident on US Highway 19 claims life of 16-year-old Dixie County student Class action lawsuit against UF will now proceed after the University withdrew its request for an appeal Latest News Dunnellon city council seat 2 filled after being empty for months Marion County commissioners decide to raise fire, solid waste fees Archer employee arrested for theft as residents call for county takeover Gainesville city commissioners vote to raise millage rate 4.7%, increase spending 4.3% Gainesville city commissioners vote to raise millage rate 4.7%, increase spending 4.3% Archer employee arrested for theft as residents call for county takeover University of Florida students rally to restore RTS bus routes: ‘We want our buses back’ Man arrested after falsifying documents in an attempt to steal someone’s home News First Alert Weather Sports Livestream Contests Contact Us WCJB E-News WCJB 6220 NW 43rd Street Gainesville, FL 32653 (352) 377-2020 Public Inspection File publicfile@wcjb.com -  (352) 416-0610 Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Closed Captioning/Audio Description Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "https://www.stonecreekdelwebb.com/",
      "text": "Stone Creek Homeowners Association Announcements Newsletters Event Calendars Lifestyle Events Classes at the Creek Charter Club Events Elan Spa Events HOA Meetings Today All Events Elan Spa Charter Clubs & Interest Groups Charter Clubs Interest Groups Resident Directory Marketplace Classifieds Merchants & Services account_circle Login / Register menu Menu Home Community Info Documents Neighborhoods Committees Proposed Agenda Item Stonewater Club Classes at the Creek Announcements Newsletters Event Calendars Lifestyle Events Classes at the Creek Charter Club Events Elan Spa Events HOA Meetings Today All Events Elan Spa Charter Clubs & Interest Groups Charter Clubs Interest Groups Resident Directory Marketplace Classifieds Merchants & Services Welcome to Stone Creek! This is the official website for the Stone Creek Homeowners Association located in Ocala, Florida. Login / Register More Info → Upcoming Events Lifestyle Events Featured Featured Watercolor for Beginners Sep            11             • 1:00 pm - 3:00 pm Featured Featured Golf Simulator Experience Sep            12             • 9:00 am - 12:00 pm Featured Featured Live Music on the Patio – One More Time Sep            12             • 5:30 pm - 8:30 pm View Calendar Charter Club Events Tennis Club: Members Open Play Sep            11             • 7:30 am - 9:00 am Tennis Club: Women’s Advanced Sep            11             • 7:30 am - 9:00 am Tennis Club: Members Drop-In Clinic (1-Hour) Sep            11             • 7:30 am - 9:00 am View Calendar Club Sponsored Events Open to the Community CERT Committee Sep            17             • 3:00 pm - 4:30 pm Kitchen Club Community Wide Dinner and Bingo Oct            3             • 5:30 pm - 8:30 pm HOA Meeting Oct            8             • 10:30 am - 12:00 pm View Calendar Elan Spa Events Tone and Balance 8:00am Sep            11             • 8:00 am - 8:45 am Level 2 Advanced Strictly Strength AM Sep            11             • 9:00 am - 9:45 am Tone and Balance 9:00am Sep            11             • 9:00 am - 9:45 am View Calendar About Our Community Stone Creek is a gated, 55+ active adult community located in the Horse Capital of the World®, Ocala, FL. Boasting an 18-hole championship golf course with full grill, resort-style pool, fitness center, spa, multiple game courts, a full-time lifestyle director and more, you will be ready for your \"Next Great Adventure.\" Stone Creek Homeowners Association is currently managed by FirstService Residential . More info → Contact Us Stone Creek Community Association, Inc. ℅ FirstService Residential 6111 SW 89th Court Rd. Ocala, FL 34481 (352) 237-8418 www.fsresidential.com OnSite Community Association Staff Community General Manager: Rachel Mayer (x227) Rachel.Mayer@fsresidential.com Community Association Manager: Dylan Whiteside (x225) Dylan.Whiteside@fsresidential.com Lifestyle Director: Nikki Courterier Nikki.Courterier@fsresidential.com Spa Director: Cheri Irwin (x243) Cheri.Irwin@fsresidential.com Maintenance Supervisor: Erik Hageman Erik.Hageman@fsresidential.com © 2025 Stone Creek • All Rights Reserved"
    }
  ]
}