{
  "fuentes": [
    {
      "url": "https://www.goldenhillsgolf.com/contact-us/",
      "email": "dian@goldenhillsgolf.com"
    },
    {
      "url": "https://www.goldenhillsgolf.com/contact-us/",
      "email": "info@goldenhillsgolf.com"
    },
    {
      "url": "https://www.goldenhillsgolf.com/contact-us/",
      "email": "steve@goldenhillsgolf.com"
    },
    {
      "url": "http://www.goldenhillshoa.net/",
      "email": "carmel@heywoodmanagement.com"
    },
    {
      "url": "http://www.goldenhillshoa.net/",
      "email": "larry@heywoodmanagement.com"
    },
    {
      "url": "https://www.theclubgv.com/",
      "email": "icon-60@2x.png"
    },
    {
      "url": "https://www.theclubgv.com/",
      "email": "icon-60@3x.png"
    },
    {
      "url": "https://www.theclubgv.com/",
      "email": "info@goldenvalleycountryclub.com"
    },
    {
      "url": "https://www.theclubgv.com/",
      "email": "info@theclubgv.com"
    },
    {
      "url": "https://www.arizonagolfresort.com/contact-us/",
      "email": "info@goldenhillsgc.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "aflaig@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "bbillings@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "bblanton@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "cbond@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "ccress@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "ceades@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "csebren@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "dbaker@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "dford@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "dloehrs@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "jhedrick@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "jlindley@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "jpavlick@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "jundem@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "jurban@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "jwhitacre@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "kbrewer@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "kmaddux@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "kryan@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "kwebb@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "membership@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "mlunsford@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "mnordyke@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "rcooper@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "sschenck@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "tblyleven@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "tcanaba@usasoftball.com"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "email": "wakley@usasoftball.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/mission-hills-country-club/who-we-are",
      "email": "ashley.varela@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/mission-hills-country-club/who-we-are",
      "email": "dan.hewitson@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/mission-hills-country-club/who-we-are",
      "email": "ramiro.magallon@invitedclubs.com"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/ocala/golden-ocala-golf-and-equestrian-club-183845/rates-tee-times",
      "email": "customerservice@golflink.com"
    }
  ],
  "mails": [
    "aflaig@usasoftball.com",
    "ashley.varela@invitedclubs.com",
    "bbillings@usasoftball.com",
    "bblanton@usasoftball.com",
    "carmel@heywoodmanagement.com",
    "cbond@usasoftball.com",
    "ccress@usasoftball.com",
    "ceades@usasoftball.com",
    "csebren@usasoftball.com",
    "customerservice@golflink.com",
    "dan.hewitson@invitedclubs.com",
    "dbaker@usasoftball.com",
    "dford@usasoftball.com",
    "dian@goldenhillsgolf.com",
    "dloehrs@usasoftball.com",
    "icon-60@2x.png",
    "icon-60@3x.png",
    "info@goldenhillsgc.com",
    "info@goldenhillsgolf.com",
    "info@goldenvalleycountryclub.com",
    "info@theclubgv.com",
    "jhedrick@usasoftball.com",
    "jlindley@usasoftball.com",
    "jpavlick@usasoftball.com",
    "jundem@usasoftball.com",
    "jurban@usasoftball.com",
    "jwhitacre@usasoftball.com",
    "kbrewer@usasoftball.com",
    "kmaddux@usasoftball.com",
    "kryan@usasoftball.com",
    "kwebb@usasoftball.com",
    "larry@heywoodmanagement.com",
    "membership@usasoftball.com",
    "mlunsford@usasoftball.com",
    "mnordyke@usasoftball.com",
    "ramiro.magallon@invitedclubs.com",
    "rcooper@usasoftball.com",
    "sschenck@usasoftball.com",
    "steve@goldenhillsgolf.com",
    "tblyleven@usasoftball.com",
    "tcanaba@usasoftball.com",
    "wakley@usasoftball.com"
  ],
  "nombre_sitio": "ocalanational.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.goldenhillsgolf.com/contact-us/",
      "text": "Contact Us - Golden Hills Country Club Skip to primary navigation Skip to main content Facebook Member Login Golden Hills Country Club Home About Us About Us Renovations Renovation Flipbooks Golf Golf Tournament Results Steve Larick – Dir. of Golf Golf Lessons Guest Tee Times Apparel & Equipment Practice Facilities Scorecard Leagues Tennis Swim Swimming Pool Pool Party Reservations Lifeguard & Swim Coach Pool Calendar Rules & Regulations Swimming Lessons Swim Team Online Registration Club House Members Only Member Tee Times Member Account Newsletters Hole in One Archive Contact Us Contact Us 803.957.3355 Golden Hills Golf & Country Club 100 SCOTLAND DRIVE, LEXINGTON, SC 29072 info@goldenhillsgolf.com Check us out on Facebook! Additional Contacts Pro Shop Phone: 803.957.3355 Head Pro: Steve Larick steve@goldenhillsgolf.com Pool Contact Phone: 803-957-3970 Swim Team: Golden Hills Gators Lessons: Swim Lessons Page Footer Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Contact Us Address : 100 Scotland Drive Lexington, SC 29072 Phone : 803.957.3355 Check us out on Facebook! Local Weather LEXINGTON WEATHER Copyright © 2025 Golden Hills Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "http://www.goldenhillshoa.net/",
      "text": "Golden Hills toggle navigation Menu Golden Hills About Updates Documents Support Photos Golden Hills Mesa, Arizona Subscribe Golden Hills Located in Mesa, Arizona Golden Hills, which weaves in and out of the famous Arizona Golf Resort, is located in Mesa, Arizona. Golden Hills boasts an amazing and relaxed golf resort-centric lifestyle. Residents love the available amenities and friendly neighbors. With nearby shopping centers, additional locally-renowned golf courses, and Superstition Springs Mall within minutes of the community, residents will agree that Golden Hills is an amazing place to live. Lush Landscaping Perfect Location Golf Course Views Friendly Neighbors Nearby Amenities Quiet & Peaceful Updates Dec. 13, 2021 Board Meeting Canceled Board Meeting that was scheduled for Wednesday, December 14th is CANCELED due to lack of quorum. Nov. 8, 2021 Board of Directors Meeting Board of Directors Meeting\r\nTuesday, November 9th, 2021\r\n7:00 p.m.\r\nArizona Golf Course Oct. 7, 2019 Board of Directors Meeting Canceled Due to a quorum not being able to be met, tomorrow's Board of Directors Meeting (October 8th) has been canceled. View all updates Documents Golden Hills documents and resources. View Documents Community Support Have a question or concern? Contact us below. Contact Us Frequently Asked Questions Are board meetings open to all residents? If so, where and when are they held and how do I attend? We encourage all Owners that want to volunteer and voice their input to attend the homeowner forum section of the meeting. Please refer to the events section of this website for meeting dates and times. Can I change the exterior of my property? All new construction and all exterior changes to existing or new structures, including landscaping, must be submitted to and approved by the Architectural Committee prior to the commencement of work. Can I walk my dog off the leash? The simple answer is no. Pursuant to Arizona Revised Statutes 11-1012, all dogs must be leashed (no greater than 6’ in length) when they are not on an individual owner's confined property. So if you are walking your dog on the sidewalk or in a common area, your dog must be leashed, according to the law. How often do I need to maintain my landscaping? Each property is unique and different and its landscaping needs will vary from property to property. However, all landscaped areas must be maintained at all times. All properties must be weed and debris free. All turf areas must be maintained at all times, which includes proper watering and mowing. If turf areas are over-seeded in the winter time they will most likely need to be mowed every 7 - 10 days. During the warmer seasons, yards are typically in need of mowing at least once each week. I want to make improvements to the exterior of my property. What do I need to do to submit for approval? Pursuant to your community CC&R's, any change on the exterior of your property is subject to prior written approval. Navigate to the Documents portion of this website to obtain information and the necessary form to submit for approval to the Association. Management Company Contacts (LC) Company: Heywood Community Management Address: 42 S. Hamilton Place; Suite 101 Gilbert, AZ 85233 Website: http://heywoodmanagement.com/ Contact Number: 480-820-1519 Fax: 480-912-3357 Manager: Larry Heywood Email: Larry@heywoodmanagement.com Admin Assistant: Carmel Schandle Email: Carmel@heywoodmanagement.com What can I do about a noise disturbance in Mesa? If you need to file a noise complaint, please contact City of Mesa Police Department. A noise disturbance is a Priority Three call for Mesa Police Department so there may be a delay in the response if officers are responding to higher priority calls. Mesa Police Non-Emergency phone number is 480-644-2211. What does the Association do? The vast majority of residential developments built these days are managed by their own individual Association. This is done to provide decision making of all aspects at the most local level possible by a group of individually elected owners within your Association. In addition, this helps to eliminate the burden of maintenance that would otherwise be placed on the local municipality. Most owners agree that the HOA will maintain the common areas better and more often than the local municipality. Therefore, it is more advantageous to be governed by an Association than oversight directly by the local city or town. What if I don’t correct the compliance issue I received notice about? For those who don’t comply with the established maintenance standards the Association can, after notice is given, impose monetary fines and, in some cases, perform the work to bring the property into compliance, and bill the expense back to the offending owner. This helps to preserve values and maintain a uniform and consistent appearance and aesthetic value for all owners. What is the Board of Directors? Because your association is a legal entity, it functions similar to a regular business organization. The Board of Directors is a group of elected volunteers who serve without compensation which provide oversight and management functions to the successful operation of the association’s business affairs -- which are in accordance with the standards set by your association’s governing documents. Our neighborhood community website was\n                    built with using the tools\n                    from our friends at Try it for free! Homeownly, LLC © 2025. All Rights Reserved. Neighborhoody™ Contact About Privacy Terms Email Us Please fill out all of the information below and someone\n                        will get back to you in a timely manner. Personal Information Subscribe to community Owner Property manager Resident Tenant Send me SMS updates Please provide your mobile phone number if available SUBSCRIPTION INFO Daily Immediately Weekly summary Message Details General Information Maintenance Request Report a Violation Cancel Send\n                            Message Sent! Your message has been sent successfully. Close × Subscription PERSONAL INFORMATION Send me SMS updates PROPERTY INFO Owner Property manager Resident Tenant SUBSCRIPTION INFO Daily Immediately Weekly summary Cancel Save Subscribed! Your subscription has been saved successfully. Close"
    },
    {
      "url": "https://www.theclubgv.com/",
      "text": "Home - The Club at Golden Valley Skip to main content THE CLUB AT GOLDEN VALLEY 763.732.4100 Menu Our Club Overview History The Clubhouse Guest Information Board of Directors Membership Overview Golf Membership Social Athletic Membership Social Dining Membership Corporate Membership Membership Information Golf About the Course Course Tour Map Overview 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 Golf Programs Practice Facilities Golf Shop Golf Outings Tournaments Home of Champions Racquet Sports Pool Dining Menus Breakfast Menu Kids Menu Lunch Menu Dinner Menu Drinks and Desserts Menu Bar Menu Sunday at the Club Pool Canteen Social Activities Youth Programs Weddings & Events Your Events, Our Expertise Weddings Corporate Events & Meetings Social Events Facilities Golf Outings Culinary Experience Request Event Information Contact Contact & Directions Our Team Employment Member Login CLICK HERE to Request Membership Information CLICK HERE to Request Banquet and Event info CLICK HERE for our Wedding Video EXPERIENCE THE CLUB AT GOLDEN VALLEY Featuring a world-class golf course, premier social amenities, tennis and swimming facilities, exceptional dining and an award-winning venue for weddings and receptions, social and corporate events. THE CLUB AT GOLDEN VALLEY REBRANDING Click Here Designed by SUSSNER 7001 Golden Valley Road Golden Valley, MN 55427 763.732.4100 info@theclubgv.com Facebook Instagram Pinterest Twitter YouTube LinkedIn Tweets by theclubgv The Club at Golden Valley BLOG © 2024 The Club at Golden Valley. All Rights Reserved ·"
    },
    {
      "url": "https://www.arizonagolfresort.com/contact-us/",
      "text": "- Golden Hills Golf Club (formerly, Arizona Golf Resort) Skip to main content Skip to footer Golden Hills Golf Club (formerly, Arizona Golf Resort) Home CLUB 425 Dining Options & Specials In-House Events Event Calendar Championship Golf Specials and Promotions Golf Course Details Golf Course Tour Golf Course Gallery GOLDEN HILLS GOLF CLUB Pro Shop Book a Tee Time Tournament Inquiry Wedding & Event Venue Weddings + Events Parties and Celebrations GOLDEN HILLS EVENTS Event Gallery Event Space Details Event Partners Contact Us Contact Us Careers Privacy Policy CORNHOLE Tournament Inquiry Gallery Directions From Phoenix Sky Harbor Airport From PHX-Mesa Gateway Airport From Falcon Field Municipal Airport From Grand Canyon From Tucson From Flagstaff From Prescott From Payson From Sedona From Albuquerque From Utah From Nevada From LA / California Contact Info Golden Hills Golf Club 425 S Power Rd. Mesa, AZ 85206 Pro Shop: 480-832-1661 Toll-Free: 800-528-8282 Main Phone: 480-832-3202 Front Office/Lobby: Ext 3 Golf Shop/Pro Shop: Ext 1 Accounting: Ext 6 Apartments: Ext 2 Restaurant : Ext 4 Sales : Ext 5 info@goldenhillsgc.com Facebook Twitter Pinterest Instagram Footer About Us Here at Golden Hills Golf Club we pride ourselves on the high quality of magnificent golf, superb amenities and outstanding service that we offer our valued customers. We have worked hard over the years to become a staple of the community, and in the process, we have earned recognition as one of the region's premier resort experiences. Weather Visit Us Golden Hills Golf Club 425 S Power Rd. Mesa, AZ 85206 Follow Us Facebook Instagram Pinterest Twitter Contact Us Golf Shop: 480-832-1661 Main Phone: 480-832-3202 Email: info@goldenhillsgc.com Find Us Copyright © 2025 Golden Hills Golf Club (formerly, Arizona Golf Resort) All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.usasoftball.com/about/national-office-staff/",
      "text": "National Office Staff - USA Softball Skip to main content Skip to primary navigation Search this website Register Events TournamentUSA Donate Safe Softball Team Shop Portal USA Softball Menu About About USA Softball National Office Staff Board of Directors Associations Governance Annual Council Meeting Careers Portal USA Softball Portal Umpire Portal Tournament Directors Portal Media Latest News Media Services Base Hits & Banter Photo Galleries Play USA Softball Membership Adult Program Junior Olympic Program High Performance Program Youth Programs Tournaments & National Championships Certified Equipment Tournament Forms Umpires About USA Softball Umpires National Umpire Staff National Umpire Schools Umpire-In-Chief Clinic Official Rulebook Official Scorebook Plays & Clarifications Umpire Manual Umpire Exam Awards & Certifications Official Gear National Teams WNT Program MNT Program WSPNT Program MSPNT Program Competitions Selection Procedures Athlete Resources Legacy Club & Fundraising Support Team USA National Teams History College Corner ESPN.com/USA Softball Collegiate Top 25 Poll Collegiate Player of the Year NCAA Women’s College World Series Devon Park Schedule Venue Information Tours and Special Events Job Opportunities Hotel Partners Renovations National Softball Hall of Fame Museum and Gift Shop About National Softball Hall of Fame Museum Qualifications & Procedures Hall of Fame Members Donate Safe Softball Safe Softball Handbook Report a Concern About Safe Softball Resources USA Softball Resource Guide USA Softball Brand Guidelines Trademarks & Copyrights Licensed Vendors Amateur Resource Center ACE Coach Training Bollinger Insurance Know Your Role™ Search this website BECOME A MEMBER About USA Softball National Office Staff National Office Staff Headquarters: 2801 NE 50th Street, Oklahoma City, OK 73111 EXECUTIVE oFFICE Craig Cress Chief Executive Officer 405.425.3430 Email FINANCE & it Cheryl Bond Chief Financial Officer 405.425.3429 Email Cindy Wakley Accounting Manager 405.425.3424 Email Jay Hedrick Director of Network Systems 405.425.3452 Email Kyle Brewer Network Systems Manager/Ticket Operations 405.425.3457 Email COMMUNICATIONS, MARKETING & PARTNERSHIPS Todd Blyleven Chief Marketing Officer 405.425.3402 Email Jordie Lindley Director of Communications & Marketing 405.669.3713 Email Delanie Baker Devon Park Marketing & Social Media Manager 405.425.3419 Email Bailea Blanton Grassroots Marketing & Communications Manager 405.425.3475 Email Jordan Urban Communications Manager – National Teams/College 405.425.3472 Email Johnna Pavlick Partner Relations Manager 405-425-3420 Email MEMBERSHIP SERVICES & ADMINISTRATION Allison Flaig Chief Operation Officer 405.425.3430 Email Kylee Webb Membership Services Manager 405.425.3461 Email Jessie Undem Athlete Safety and Screening Manager 405.425.3459 Email Debbie Ford Administrative Assistant 405.425.3453 Email MERCHANDISE Stacey Schenck Gift Shop Manager 405.425.3408 Email NATIONAL TEAMS & HIGH PERFORMANCE PROGRAM Chris Sebren Chief Sport Development Officer/Performance Officer 405.425.3432 Email Madison Nordyke National Teams Manager 405.425.3440 Email REGISTRATIONS & CUSTOMER SUPPORT Devin Loehrs Chief Information Officer 405.425.3491 Email Jaclyn Whitacre Registration Systems Manager 405.425.3438 Email STADIUM OPERATIONS Troy Canaba Director of Stadium Operations 405.666.5093 Email Brenda Billings Concessions & Special Events Manager 405.425.3474 Email Candice Eades Event Manager 405.425.3470 Email Richard Cooper Facility Maintenance Manager Email Kyle Maddux Facility Maintenance Manager 405.425.3435 Email Mike Lunsford Field Maintenance Email INDEPENDENT CONTRACTORS Kevin Ryan Director of Umpires 405.425.3449 Email About USA Softball National Office Staff Memberships Team USA Legacy Club & Fundraising Safe Softball Store Privacy Policy Site Map Privacy Policy Terms of Condition Do Not Sell My Information This website is powered by SportsEngine's Sports Relationship Management (SRM) software, and is owned and subject to the USA Softball privacy policy."
    },
    {
      "url": "https://www.invitedclubs.com/clubs/mission-hills-country-club/who-we-are",
      "text": "About Us | Mission Hills Country Club in Rancho Mirage × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Calendar Opens in new tab Newsletter Opens in new tab Member Login Opens in new tab Careers Mission Hills Country Club Main Site Navigation Who We Are Golf Amenities Membership Host An Event Join Now Host Event Contact Us Contact Us Menu Who We Are Our Team Calendar Directions & Hours Our History Golf Arnold Palmer Signature Course Dinah Shore Tournament Course Pete Dye Challenge Course Golf Academy Game On Golf Lessons Crush It! Youth Golf Lessons Galleri Classic Amenities Dining Racquet Sports Wellness Spa Croquet Champions Club Villas Membership XLife Benefits Host An Event Event Rooms Contact Us Real Estate Resources Calendar Opens in new tab Newsletter Opens in new tab Member Login Opens in new tab Careers Home Who We Are Skip Image Carousel Our Team Calendar Directions & Hours Our History Mission Hills Country Club: A Legacy of Excellence in Coachella Valley Where History, Community, and Innovation Unite For decades, Mission Hills Country Club has set the standard for luxury and leisure in Rancho Mirage, CA. Known for its iconic golf courses, world-class racquet sports facilities, and vibrant community, Mission Hills is more than just a country club—it’s a place where generations come together to play, connect, and make memories in the heart of the Coachella Valley. Shaping Legends in the Coachella Valley Since its founding in 1971, Mission Hills Country Club has been a hub for connection and camaraderie. The Dinah Shore Tournament Course, opened in 1972, brought international acclaim and cemented the club’s reputation as a premier golf destination in the Coachella Valley. Hosting the LPGA major now known as The Chevron Championship, Mission Hills has long been a breeding ground for champions, a legacy proudly upheld by its Members. Explore Our Timeline A Premier Lifestyle in Rancho Mirage Mission Hills Country Club offers a luxurious lifestyle, with 54 holes of championship golf and world-class racquet sports facilities, including 43 courts. The club hosts prestigious events like the PGA Champions Galleri Classic and PPA Tour The Masters, providing ample opportunities for competition and improvement. Members also enjoy a resort-style pool, spa, and exceptional dining, making it the ultimate destination for leisure and community in Rancho Mirage. Continuing Our Legacy in the Desert Mission Hills remains dedicated to evolving while honoring the heritage that established its status as a Coachella Valley icon. We’re enhancing amenities and introducing new experiences to ensure Members enjoy nothing less than excellence. Our vision is to be the premier destination for those seeking a premium lifestyle, where tradition and innovation seamlessly blend, positioning Mission Hills at the forefront of luxury country clubs in the Coachella Valley for generations to come. Explore Membership Dan Hewitson SVP & Managing Director Contact Me 760-883-5322 Contact Me About Dan + Close Dan Hewitson information modal Dan Hewitson SVP & Managing Director Serving since 2007 760-883-5322 Dan.Hewitson 760-883-5322 Dan.Hewitson Contact Me About Dan Dan comes to Mission Hills from his previous role as Regional Operations Managing Director for 18 clubs within the Pacific region of Invited. This is such a special opportunity and he is thrilled with the ability to dedicate his focus to our Clubs in the desert and deliver a premier club experience at Mission Hills our Members can all be proud of.  Dan has lived in the Palm Desert area for more than 15 years and raised his five children here. Like you, he considers the desert his home and Mission Hills a very special place. Contact Me Ashley Varela Club Manager Contact Me 760-883-1579 Contact Me + Close Ashley Varela information modal Ashley Varela Club Manager Serving since 2020 760-883-1579 Ashley.Varela 760-883-1579 Ashley.Varela Contact Me Contact Me Ramiro Magallon Membership Director Contact Me Contact Me + Close Ramiro Magallon information modal Ramiro Magallon Membership Director Serving since 2024 Ramiro.Magallon Ramiro.Magallon Contact Me Contact Me Join the Mission Hills Community Membership Learn the benefits of membership at Mission Hills and start experiencing the very best of Palm Springs and beyond. Learn More Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Who We Are Golf Amenities Membership Host An Event Contact Us Mission Hills Country Club Opens in new window 34600 Mission Hills Dr Rancho Mirage, CA \r\n                                92270 1 760-324-9400 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/ocala/golden-ocala-golf-and-equestrian-club-183845/rates-tee-times",
      "text": "Golden Ocala Golf and Equestrian Club, Golden Ocala, Ocala, FL Tee Times & Rates Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Home GO BACK Filter Tee Times by: Clear filters Date: Number of Golfers: Any 1 2 3 4 Number of Holes: Any 9 18 Price Range per Player: Minimum $ Maximum $ Start Time Range: 5:00 AM 12:00 AM 1:00 AM 2:00 AM 3:00 AM 4:00 AM 5:00 AM 6:00 AM 7:00 AM 8:00 AM 9:00 AM 10:00 AM 11:00 AM 12:00 PM 1:00 PM 2:00 PM 3:00 PM 4:00 PM 5:00 PM 6:00 PM 7:00 PM 8:00 PM 9:00 PM 10:00 PM 11:00 PM 9:00 PM 12:00 AM 1:00 AM 2:00 AM 3:00 AM 4:00 AM 5:00 AM 6:00 AM 7:00 AM 8:00 AM 9:00 AM 10:00 AM 11:00 AM 12:00 PM 1:00 PM 2:00 PM 3:00 PM 4:00 PM 5:00 PM 6:00 PM 7:00 PM 8:00 PM 9:00 PM 10:00 PM 11:00 PM Apply Filters Home Courses FL Ocala Golden Ocala Golf and Equestrian Club Private 4.5 1 Review Golden Ocala Golf and Equestrian Club Tee Times & Rates Designed by Ron Garl and opened in 2020 Golden Ocala - Ocala, Florida Showing Tee Times for: Show all filters Thu, Sep 11 Fore! We don't currently offer tee times that match your criteria. You can contact Golden Ocala Golf and Equestrian Club directly at (352) 671-3933 to inquire about the tee time you're looking for. In the meantime, here are the nearby tee times we found. Tee Time offers near Golden Ocala Sort by: Hot Deals First Hot Deals First Price Lowest to Highest Time 7:56 AM BOOK NOW Ocala National at Golden Hills Country Club $ 28.48 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 Hot Deals - Prepaid Time 18 Holes 1-4 Golfers 7:00 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 7:08 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 7:16 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 7:24 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 7:32 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart Advertisement 7:40 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 7:48 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 7:56 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 8:04 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 8:12 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 8:20 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart Advertisement 8:28 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 8:36 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 8:44 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 8:52 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 9:00 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 9:08 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart Advertisement 9:16 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 9:24 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 9:32 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 9:40 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 9:48 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 9:56 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart Advertisement 10:04 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 10:12 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 10:20 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 10:28 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 10:36 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 10:44 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart Advertisement 10:52 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 11:00 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1 Golfer Cart 11:08 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 11:16 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 11:24 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 11:32 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart Advertisement 11:40 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 11:48 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 11:56 AM BOOK NOW Ocala National at Golden Hills Country Club $ 37.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 12:04 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 12:20 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 12:28 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart Advertisement 12:36 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 12:44 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-2 Golfers Cart 1:00 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 1:08 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 1:16 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 1:24 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart Advertisement 1:32 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 1:40 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart 1:48 PM BOOK NOW Ocala National at Golden Hills Country Club $ 32.68 / Player Thursday, September 11, 2025 Ocala, FL, 34482-2032 18 Holes 1-4 Golfers Cart FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    }
  ]
}