{
  "fuentes": [
    {
      "url": "https://sites.google.com/pgahq.com/oceanside-country-club-hp24/home",
      "email": "kfisher@pgahq.com"
    },
    {
      "url": "https://sites.google.com/pgahq.com/oceanside-country-club-hp24/home",
      "email": "skmiec@pgahq.com"
    },
    {
      "url": "https://visitoceanside.org/contact/",
      "email": "groups@visitoceanside.org"
    },
    {
      "url": "https://visitoceanside.org/contact/",
      "email": "visitorinfo@visitoceanside.org"
    },
    {
      "url": "https://www.oceanhillscountryclub.com/about-us",
      "email": "gtodisco@keystonepacific.com"
    },
    {
      "url": "https://www.oceanhillscountryclub.com/about-us",
      "email": "wpanizza@keystonepacific.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "shawna@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "drakeb@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "jkulhamer@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "noakley@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "rzellner@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "sfrey@greenpondcc.com"
    },
    {
      "url": "https://occ1907.com/meet-the-staff",
      "email": "agcs@occ1907.com"
    },
    {
      "url": "https://occ1907.com/meet-the-staff",
      "email": "agp2@occ1907.com"
    },
    {
      "url": "https://occ1907.com/meet-the-staff",
      "email": "banquetmgr@occ1907.com"
    },
    {
      "url": "https://occ1907.com/meet-the-staff",
      "email": "reservations@occ1907.com"
    },
    {
      "url": "https://occ1907.com/web/pages/meet-the-staff",
      "email": "agcs@occ1907.com"
    },
    {
      "url": "https://occ1907.com/web/pages/meet-the-staff",
      "email": "agp2@occ1907.com"
    },
    {
      "url": "https://occ1907.com/web/pages/meet-the-staff",
      "email": "banquetmgr@occ1907.com"
    },
    {
      "url": "https://occ1907.com/web/pages/meet-the-staff",
      "email": "reservations@occ1907.com"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "berna.marketing@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "daisy.raquel@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "golf@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "info@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "mohammad.rashed@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "raymond.sandoval@acci.com.ph"
    },
    {
      "url": "https://arrowoodgolf.com/",
      "email": "info@arrowoodgolf.com"
    }
  ],
  "mails": [
    "agcs@occ1907.com",
    "agp2@occ1907.com",
    "banquetmgr@occ1907.com",
    "berna.marketing@acci.com.ph",
    "daisy.raquel@acci.com.ph",
    "drakeb@greenpondcc.com",
    "golf@acci.com.ph",
    "groups@visitoceanside.org",
    "gtodisco@keystonepacific.com",
    "info@acci.com.ph",
    "info@arrowoodgolf.com",
    "jkulhamer@greenpondcc.com",
    "kfisher@pgahq.com",
    "mohammad.rashed@acci.com.ph",
    "noakley@greenpondcc.com",
    "raymond.sandoval@acci.com.ph",
    "reservations@occ1907.com",
    "rzellner@greenpondcc.com",
    "sfrey@greenpondcc.com",
    "shawna@greenpondcc.com",
    "skmiec@pgahq.com",
    "visitorinfo@visitoceanside.org",
    "wpanizza@keystonepacific.com"
  ],
  "nombre_sitio": "occ1907.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sites.google.com/pgahq.com/oceanside-country-club-hp24/home",
      "text": "Oceanside Country Club Search this site Embedded Files Skip to main content Skip to navigation Oceanside Country Club Oceanside Country Club Ormond Beach, FL Head Golf Professional ABOUT OCEANSIDE COUNTRY CLUB Ormond Beach, FL | The Oceanside Country Club, founded in 1907, has a long history in the Ormond Beach community.  An exclusive private country club, Oceanside is located on the property between the Atlantic Ocean and the Halifax River.  The club amenities include the 18-hole golf course, 9 clay tennis courts, 2 swimming pools, and a 22,000-square-foot clubhouse.  A $3.5 million renovation project for the clubhouse was completed in 2020 and the golf course irrigation system was fully replaced in 2019.  The golf course would be described as a links-style, Florida seaside course. The South Atlantic Women's Amateur Championship, also known as the SALLY, dates back to 1926 and continues to field contestants from all over the world. This member-supported weeklong event, usually held the first week in January, is filled with great golf and lots of fun. During the week of the event, Oceanside hosts the Member-SALLY “Pro-Am” tournament. Social activities include a food & wine gala, a member hospitality tent on 18, and much more. Oceanside is proud to be home to the SALLY, one of the oldest surviving amateur golf classics in the country. Oceanside offers three different dining venues for members: the Grill Room is a great place for a casual lunch or dinner, the Main Dining Room is the Club's formal option for dining, and the Pool Deck, is open in the spring and summer seasons. CLUB DETAILS Facility: Member-Equity Course Access: Private Number of Holes: 18 Total Annual Rounds: 26,000 Number of Carts: 65 Members: 600 Primary Golf Season: November - April Caddie Program: No Practice Range: Yes Short Game Area: Yes Number of Staff Managed: 14 POSITION OVERVIEW Title: Head Golf Professional Reports to: General Manager Supervises: Assistant Golf Professionals, Golf Shop Staff, Cart/Bag Room Staff, Locker Room Staff Position Description: Oceanside Country Club is seeking a PGA Member in good standing to fill the position of Head Golf Professional. The Head Professional reports directly to the General Manager and works closely with the Golf Chairperson and Golf Committee. The Head Professional will have full responsibility for overseeing and managing all golf operations and services, furthering a strong culture of friendship, courtesy, and professionalism throughout the operations. Visibility and engagement are critical success factors for this role. Appropriate candidates need to be able to display a history of performing at a superior level of respectful, dignified, and exceptional levels of service. The Head Professional will Develop and implement programs, events, and activities designed to increase and retain golf membership in the Club. Provide a high level of member satisfaction by driving an exceptional golf experience. KEYS TO SUCCESSFUL PERFORMANCE Golf Operations Management Devote their full time, attention, and energies to the performance of their duties as Head Golf Professional Oversee starting activity on #1 and #10 tees, monitor the pace of play Track and verify all players and guests, green fees, golf cars, club care, lockers, handicap fees, and other charges necessary, and facilitate accurate accounting and recordkeeping Oversee golf car fleet while ensuring proper maintenance and recordkeeping Develop and manage an innovative tournament program, group outings, and leagues that service all customer segments Oversee the operations of a well-managed practice facility Provide professional club repair and club fitting services Ensure the proper storage, safety, and cleaning of golf equipment Play golf with a variety of members as time permits Administer the Rules of Golf and educate staff. Promote and provide Rules of Golf clinics to the membership Retail Management Oversee retail merchandise concession in step with the mission of the golf operation and facility Maintain a profitable golf merchandising operation Oversee development of buying plans and all golf-related purchasing including supplies associated with golf activities Supervise accurate and timely monthly physical inventories, present a diverse and desirable array of golf equipment, apparel, accessories Assist in the development of necessary systems utilizing POS to safeguard inventories and cash Establish accurate recordkeeping policies and procedures Supervise and train all golf shop staff to maximize sales opportunities Ensure the customer database includes and tracks important dates, spending, sizes, preferences Maintain an attractive and orderly appearance in and around the golf shop Player Development Develop, provide, and oversee an enhanced golf instruction program offering individual and group clinics for all levels. Ensure that the services of a well-trained staff of professional instructors are available where required Develop and oversee player development programs which should include women, families, seniors, and in particular a junior program. Manage the Club’s participation in PGA Junior League. This includes coordinating volunteers, liaisons, and generating interest in the program through outreach to local schools. Golf Administration Recruit, hire, train, motivate, and supervise all golf department staff and maintain accurate payroll records Ensure routine monitoring of the pace of play and activity on the golf course, especially during highly active periods of use. Ensure evaluations and annual reviews are completed and recorded for all applicable staff Update and maintain golf shop policies and procedures and job descriptions and ensure they are adhered to and posted in the proper areas Maintain safety standards and safety equipment within OSHA requirements Assist in the publication of newsletters, informational, and promotional materials Oversee the administration of the golf handicap program Work closely with and provide guidance and consultation with the golf committee Attend applicable committee meetings and management, and staff meetings when requested Adhere to, enforce, and implement policies and procedures of the facility Setup regular written communication with supervisor to include facility, programming, staff, and customer updates – monthly status report Business and Financial Responsible for the financial and operational performance of the golf shop operations and golf services Ensure all financial goals and objectives are being achieved Assist in the development and preparation of budgets, including forecasting and review of all golf operations revenues and expenses on a daily, weekly, monthly, and annual basis Ensure systems controls are in place to safeguard assets, revenues, and resources Other Facility/Departmental Responsibilities Annually Manage and preserve the Sally Golf Tournament and its historic place in our Club. Tournament Director for the Sally Attend Pre and Post Tournament Committee meetings and provide input for success Player Communication via website, email, phone, etc. Prepare the course in coordination with the Superintendent Prepare for extra carts, staffing, bleachers, and volunteers Work closely with all department heads to achieve the goals and objectives of the facility Maintain a close working relationship with the Golf Course Superintendent and provide advice on course playability and tournament setup Assist the Membership Sales Director in the promotion of new member leads and provide a supporting role in assisting with prospective members and orientation of new members Coordinate plans with the Food and Beverage Manager for food and beverage needs for all golf functions KNOWLEDGE, SKILLS AND TRAITS Fundamental knowledge of the game of golf, the rules of golf, golf facility operations, and tournament operations Fundamental supervisory practices and principles Act as a role model for all employees by demonstrating the behavior and work ethic expected of all employees Strong organizational, planning, and prioritization skills Self-motivated with a desire to promote and market Service and customer-focused attitude Experienced in written and oral business communications Remain up-to-date on customer relationship management tactics and strategies Maintain and promote a positive professional image within the community Attend conferences, workshops, meetings, and trade shows to keep abreast of marketing and business trends Maintain a credible golf game and remain current on teaching innovations OTHER ACCOUNTABILITIES As a member-owned equity Club, our goal is to provide individualized member services which requires our employees to provide a multitude of different functions; therefore, as an essential part of your job, you will be expected to help others when the occasion arises. Accordingly, you may be expected to perform other tasks as needed that are not included in the above Job Task List. Adheres to all federal, state, and local laws regarding health, safety, and employment Attends national and sectional conferences/meetings, merchandise shows, and educational and professional shows to encourage development and enhance the quality and image of the club Suggests improvements and capital outlays to golf course and golf facilities EXPERIENCE AND QUALIFICATIONS PGA of America membership as a Class A Professional in good standing is required Experience in one or more of the following is preferred: Private clubs, Resort Clubs/facilities, Golf Industry. An undergraduate degree is preferred but not required. Educational concentration in business management. Ability to communicate effectively with proper grammar. Ability to work well under pressure, coordinating multiple tasks at any given time. Responsible for maintaining good conduct and safe working habits. Proficient in Windows operating systems - Outlook, Word, Excel, NorthStar, or similar club-based POS/accounting/member billing system. Proficient in other applications, i.e. email, internet, tournament and database, Inventory tracking systems Physical Demands The physical demands, described here are representative of those that must be met by an Employee to successfully perform the essential functions of this job. Must be able to reach, bend, stoop, stand, and lift up to 30 pounds. Must be able to sit and/or stand for prolonged periods of time. Moderate noise level in the work environment. Going up and down stairs. The ability to use hands, fingers, arms and wrists, hearing, smell, and verbal skills are required in order to perform job duties. Ability to differentiate color. Ability to work in indoor and outdoor conditions. COMPENSATION AND BENEFITS The club will provide compensation and benefits package commensurate with experience and qualifications. This includes but is not limited to: Base Salary Range - $140,000 - $160,000 Commensurate with experience and skill set Lessons - Projected lessons of $20,000 based on historical average at the facility Bonus Opportunity - A bonus opportunity of $10,000 will be available based on performance standards as set by the facility Full benefits package (medical, dental, vision, and life insurance) 401k plan with company match Paid time off Golf Privileges Cell Phone Allowance Professional Dues Paid Clothing Allowance per facility policy Professional Expenses for PGA Show per facility policy Section/National Event stipend per facility policy APPLICATION INSTRUCTIONS All applications MUST be submitted through the PGA of America's Career Services Department as described below. Resume deadline is May 17, 2024 at 11:59 pm Eastern Time Combine your cover letter, resume, references, and any supporting documents into one (1) PDF document with the following file naming convention: Last Name, First Name, Oceanside Country Club, Head Golf Professional Please address all correspondence to - Mr David Main, CCM, CCE | General Manager/COO | | Oceanside Country Club Click Here to Submit Your Application Keith Fisher , PGA, and Scott Kmiec are leading this search, please contact them with any questions. Email: kfisher@pgahq.com skmiec@pgahq.com The employer does not wish to be contacted at this time Learn more about ExecuSearch To serve as the most trusted professional resource for employers seeking experts to lead an organization in the golf and hospitality industry, and support their future success by serving as lifelong partners. Report abuse Page details Page updated Report abuse"
    },
    {
      "url": "https://visitoceanside.org/contact/",
      "text": "Contact Us - Get in Touch | Visit Oceanside Skip to content Meetings & Groups Weddings Meetings & Retreats Reunions Sports Commission Incentives & Promos Planner Resources Submit RFP Planning Guide Media Resources Blog Contact Store Meetings & Groups Weddings Meetings & Retreats Reunions Sports Commission Incentives & Promos Planner Resources Submit RFP Planning Guide Media Resources Blog Contact Store Things to Do Outdoor Food & Drink Arts & Culture Nearby Attractions Retail Places to Stay Hotels Vacation Rentals Camping & RVs Events Plan Your Trip Welcome Center Transportation Itineraries Maps and Guides Neighborhoods Deals Visitor Guide O’side Sips Activity Marketplace Love O’side 68° Search Search Search Search CONTACT US We live to share the O’side love. Get in touch with questions about your upcoming trip to O’side. Fill out the form below and someone from the expert teams of the Visit Oceanside Conference and Visitors Bureau or the California Welcome Center in Oceanside will happily get right back to you. Or just drop by and say, “Yo!” What’s on your mind? First Name (Required) Last Name (Required) Email (Required) Phone (Required) Message (Required) CAPTCHA California Welcome Center – Oceanside : Toll Free: 800-350-7873 Phone: 760-721-1101 Fax: 760-421-0106 Email: visitorinfo@visitoceanside.org Hours of Operation: Mon-Sat, 9am – 5pm Address: 928 N. Coast Highway Oceanside, CA 92054 Business Development: Phone: 858-201-6186 groups@visitoceanside.org Let's Connect What's New in O'side? Check out Our 2025 Visitor Guide To find out. Send Me a Free Guide Sharing some O'side love with our Visitor guide. Get Your Free Guide Follow us on Social Media Use the hashtag #VisitOceanside Follow Us [adrotate banner=\"4\"] [adrotate banner=\"7\"] [adrotate banner=\"10\"] [adrotate banner=\"11\"] Subscribe to our newsletter! Email (Required) About Us Contact Us Travel Trade About Us Contact Us Travel Trade Contact Us Blog Sitemap Privacy Policy Contact Us Blog Sitemap Privacy Policy Blog Media Visitor Guide Blog Media Visitor Guide About Us Travel Trade Media Industry Resources Visitor Guide About Us Travel Trade Media Industry Resources Visitor Guide Industry Resources Privacy Policy Sitemap Accessibility Statement Industry Resources Privacy Policy Sitemap Accessibility Statement © Visit Oceanside 2023. All rights reserved. 928 North Coast Hwy, Oceanside, CA 92054 800-350-7873 Get Inside O'side Email (Required) scattered clouds 68°F Current Weather Thu 69°F 21°C Fri 67°F 19°C Sat 67°F 19°C Sun 67°F 19°C Mon 68°F 20°C source: openweathermap.org Facebook LinkedIn Twitter Pinterest Email Search Things to Do Outdoor Food & Drink Arts & Culture Nearby Attractions Retail Places to Stay Hotels Vacation Rentals Camping & RVs Events Plan Your Trip Welcome Center Transportation Itineraries Maps and Guides Neighborhoods Deals Visitor Guide O’side Sips Activity Marketplace Love O’side Meetings & Groups Weddings Meetings & Retreats Reunions Sports Commission Incentives & Promos Planner Resources Resources Blog Media Store 68° 68° 68°"
    },
    {
      "url": "https://www.oceanhillscountryclub.com/about-us",
      "text": "Ocean Hills Country Club - About Us top of page Resident Login The Basics Because we offer the very best in active lifestyle communities, not just anyone can become a resident of Ocean Hills Country Club. Here's the catch: you have to be old enough to really enjoy and appreciate what a great place this is to live. Every person residing in a home must either be 55 years of age or older, a spouse or cohabitant, or other qualifying resident. Age documentation records are required in compliance with Federal and State law. Visitors are limited to a maximum stay of 90 days (whether consecutive or non-consecutive) in any calendar year. The community is comprised of eight \"Villages,\" each a corporation with its own homeowners association and governed by a Board of Directors. The common area properties are governed by a separate corporation, Ocean Hills Country Club Homeowners Association, commonly called the \"Master Association.\" The community is governed by the Master CC&Rs, as well as each Villages' CC&Rs. Exterior improvements or alterations, modification or re-decorations, including landscape additions or changes, requires prior approval by the Architectural Committee. That's what keeps our community looking so beautiful and ensures our home values remain high. Homeowner association fees cover the cost of landscaping and maintaining front yards and common areas, irrigation systems, watering, roof & mailbox repairs, and exterior painting. Monthly homeowner fees vary from Village to Village. Check with your local realtor for current pricing and fees. Ocean Hills Country Club is managed by Keystone Pacific Property Management in Irvine, California, with a full-time staff on site. ​ Click here to download our Marketing Brochure. Our Mission Statement OHCC’s mission, through its Board of Directors, is to: Protect and preserve assets Enhance property values Promote safe and harmonious living Facilitate use and enjoyment of the property This will be accomplished by: Respecting and treating members fairly Enforcing the governing documents Communicating Board efforts and actions to members Making informed decisions for the common benefit of the owners Contact Us Ocean Hills Country Club Homeowners Association 4600 Leisure Village Way Oceanside, CA 92056 Tel: 760-758-7080 Gloria Todisco General Manager gtodisco@keystonepacific.com Where Are We? Home The OHCC Difference Our Amenities Your Interests Our Clubs Our Homes North Coastal San Diego About Us/Contact More Use tab to navigate through the menu items. bottom of page"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "text": "Contact Us: Get in Touch with Green Pond Country Club - Green Pond Country Club REQUEST AN EVENT GOLF:  610-691-9453 EVENTS: 610-253-2505 About The Club Employment Golf GOLF RATES & MEMBERSHIP GROUP OUTING PACKAGES LEHIGH VALLEY AMATEUR TOURNAMENT GREEN POND GOLF ASSOCIATION TOURNAMENT SCHEDULE SENIOR LEAGUE GOLF COURSE LAYOUT SCORECARD PRO SHOP GOLF LESSONS Course Videos LVHN GOLF PERFORMANCE PROGRAM Weddings WEDDING PACKAGES PHOTO GALLERY WEDDING VIDEOS TRUSTED VENDORS & PARTNERS Events Event Menus Location Contact Us Request an Event The Public's Country Club Contact Us Green Pond Country Club 3604 Farmersville Road Bethlehem, PA 18020 Call: (610) 253-2505 or Tee Times: (610) 691-9453 Do you need to contact us regarding our products and services? Are you interested in a tour of the property? Need to book a tee time?  Planning a party?  We've got you covered! We look forward to assisting you and hope to see you at Green Pond Country Club for a visit very soon. Current hours of operation are ; Open 7 days a week from 6:30am - 11:59pm Our contact information is below based on department. _______________________________________ Rodger Zellner, President, COO, GM John Kulhamer, Golf Pro Nanci Oakley, Golf Outings Coordinator Shawna Shriver, Event Coordinator Brian Drake, Food & Beverage Manager Sarah Frey, Office Manager _______________________________________ Should you have questions or need information, please email us or submit the contact form below. [To request an event, please call (610) 253-2505 or submit our Online Event Request Form ] Contact Us Notice: JavaScript is required for this content. Our Location: 3604 Farmersville Road Bethlehem, PA 18020 • Main Phone: (610) 253-2505 ABOUT • GOLF • WEDDINGS • BANQUETS • REQUEST AN EVENT • CONTACT US ©2025 Green Pond Country Club. Privacy Policy • Terms of Use Facebook Green Pond Country Club Instagram Green Pond Country Club Twitter Green Pond Country Club YouTube Green Pond Country Club LinkedIn Menu About The Club ▼ Employment Golf ▼ GOLF RATES & MEMBERSHIP GROUP OUTING PACKAGES LEHIGH VALLEY AMATEUR TOURNAMENT GREEN POND GOLF ASSOCIATION TOURNAMENT SCHEDULE SENIOR LEAGUE GOLF COURSE LAYOUT SCORECARD PRO SHOP GOLF LESSONS Course Videos LVHN ▼ GOLF PERFORMANCE PROGRAM Weddings ▼ WEDDING PACKAGES PHOTO GALLERY WEDDING VIDEOS TRUSTED VENDORS & PARTNERS Events ▼ Event Menus Location Contact Us ▼ Request an Event"
    },
    {
      "url": "https://occ1907.com/meet-the-staff",
      "text": "Meet the Staff - Oceanside Country Club Member Login Home About the Club Meet the Staff Mission & Vision Membership Membership Inquiry form Golf Golf FAQ Scorecard Course Tour Tennis Events Weddings Private Events Meetings Request More Info Lifestyle Dining Sally 2026 SALLY SALLY Qualifier 2026 Calendar of Events 2026 SALLY FAQ 2025 Sally 2025 Sally Tournament Calendar of Events 2025 SALLY FAQ 2025 SALLY Program Book Email the Sally The Sally Facebook Page Guest Information Contact & Directions Menu Home About the Club Meet the Staff Mission & Vision Membership Membership Inquiry form Golf Golf FAQ Scorecard Course Tour Tennis Events Weddings Private Events Meetings Request More Info Lifestyle Dining Sally 2026 SALLY SALLY Qualifier 2026 Calendar of Events 2026 SALLY FAQ 2025 Sally 2025 Sally Tournament Calendar of Events 2025 SALLY FAQ 2025 SALLY Program Book Email the Sally The Sally Facebook Page Guest Information Contact & Directions Login Meet the staff Dave Main, CCM, CCE General Manager/COO [email protected] Ext.306 Tara Heard Controller [email protected] Ext. 304 Mei Ng Office Manager [email protected] Ext. 302 Kelly Lawrence Director of Membership & Catering [email protected] Ext. 305 Ben Deininger Clubhouse Manager [email protected] Ext. 324 Lance Bohan Food & Beverage Manager [email protected] Ext. 307 Coady Taylor Food & Beverage Manager [email protected] Ext. 308 Clint Lefabvre Executive Chef [email protected] Ext. 310 Dan Gage Director of Golf [email protected] Ext. 315 Greg Brousse Head Golf Proffesional [email protected] Ext. 314 Christa Gargiso Assistant Golf Professional [email protected] Ext. 314 Anna Dunn Assistant Golf Professional [email protected] Ext. 314 Mike Sanders Tennis Director [email protected] Ext. 322 Maria Sablina Assistant Tennis Professional John Clifton Golf Course Superintendent [email protected] Ext. 320 Alexander Hamel Assistant Golf Course Superintendent [email protected] Jason Waterman Maintenance Manager [email protected] Ext. 318 Kerry Bounelis Administrative Assistant/Reservations [email protected] Ext. 301 Member login Careers Contact Us Oceanside Country Club | 75 North Halifax Drive, Ormond Beach, FL 32176 | Ph: 386-677-7200 © , All Rights Reserved. Powered by Northstar Technologies"
    },
    {
      "url": "https://occ1907.com/web/pages/meet-the-staff",
      "text": "Meet the Staff - Oceanside Country Club Member Login Home About the Club Meet the Staff Mission & Vision Membership Membership Inquiry form Golf Golf FAQ Scorecard Course Tour Tennis Events Weddings Private Events Meetings Request More Info Lifestyle Dining Sally 2026 SALLY SALLY Qualifier 2026 Calendar of Events 2026 SALLY FAQ 2025 Sally 2025 Sally Tournament Calendar of Events 2025 SALLY FAQ 2025 SALLY Program Book Email the Sally The Sally Facebook Page Guest Information Contact & Directions Menu Home About the Club Meet the Staff Mission & Vision Membership Membership Inquiry form Golf Golf FAQ Scorecard Course Tour Tennis Events Weddings Private Events Meetings Request More Info Lifestyle Dining Sally 2026 SALLY SALLY Qualifier 2026 Calendar of Events 2026 SALLY FAQ 2025 Sally 2025 Sally Tournament Calendar of Events 2025 SALLY FAQ 2025 SALLY Program Book Email the Sally The Sally Facebook Page Guest Information Contact & Directions Login Meet the staff Dave Main, CCM, CCE General Manager/COO [email protected] Ext.306 Tara Heard Controller [email protected] Ext. 304 Mei Ng Office Manager [email protected] Ext. 302 Kelly Lawrence Director of Membership & Catering [email protected] Ext. 305 Ben Deininger Clubhouse Manager [email protected] Ext. 324 Lance Bohan Food & Beverage Manager [email protected] Ext. 307 Coady Taylor Food & Beverage Manager [email protected] Ext. 308 Clint Lefabvre Executive Chef [email protected] Ext. 310 Dan Gage Director of Golf [email protected] Ext. 315 Greg Brousse Head Golf Proffesional [email protected] Ext. 314 Christa Gargiso Assistant Golf Professional [email protected] Ext. 314 Anna Dunn Assistant Golf Professional [email protected] Ext. 314 Mike Sanders Tennis Director [email protected] Ext. 322 Maria Sablina Assistant Tennis Professional John Clifton Golf Course Superintendent [email protected] Ext. 320 Alexander Hamel Assistant Golf Course Superintendent [email protected] Jason Waterman Maintenance Manager [email protected] Ext. 318 Kerry Bounelis Administrative Assistant/Reservations [email protected] Ext. 301 Member login Careers Contact Us Oceanside Country Club | 75 North Halifax Drive, Ormond Beach, FL 32176 | Ph: 386-677-7200 © , All Rights Reserved. Powered by Northstar Technologies"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "text": "Contact Us - Alabang Country Club, Inc. Skip to content Menu Facebook-f Instagram Search Contact Us Home Contact Us GET IN TOUCH For inquiries, please feel free to send us a message or reach us on the contact details provided below. clubhouse OPERATIONS Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph GOLF OPERATIONS Felicita V. Mallari 0998 587 9420 8842-3530 loc 157 golf@acci.com.ph corporate services Daisy C. Raquel 0998 587 9422 8842-3530 loc 176 daisy.raquel@acci.com.ph member relations Berna D. Malolos 0917 568 5764 8842-3530 loc 152 berna.marketing@acci.com.ph DINING & BANQUETS Mohammad Rashed Jr. 0918 239 4898 8842-3530 loc 226 mohammad.rashed@acci.com.ph data privacy officer Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph Contact Form \" * \" indicates required fields Full Name * Email * Contact Number * Subject * Subject * Membership Golf Operations Dining & Banquets Events Message Name This field is for validation purposes and should be left unchanged. ACCI started its operation in 1981 with a Member-base of 1,646. Our primary objective is to provide Members excellent leisure facilities designed for the whole family. Quick Links About Facilities Events Membership Careers Contact Us Contact Us 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines Follow Us Facebook-f Instagram © Copyright 2025 Alabang Country Club. All Rights Reserved. © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines Privacy Policy Facebook-f Instagram Home About Us History of the Club Mission & Vision Board of Directors The Committees Club Management Events Social Activities Monthly Newsletter Golf Course Tour Golf Tournaments Facilities Member Services Sports and Recreation Dining and Banquets Members Corner Contact Us Career"
    },
    {
      "url": "https://arrowoodgolf.com/",
      "text": "Welcome to Arrowood Golf Course Skip to content Facebook Tiktok Instagram New App! Pickleball Flight Deck Tee Time ABOUT Our Story Our Team Join Our Team Contact Us GOLF Palm Card Shop Rates Golf Outings Practice Programs Lessons Golf Clubs PGA Jr. League Course Tour FLIGHT DECK Information Flight Deck Golf League Food Truck Menu DINING Fairways Kitchen & Bar Information Fairway’s Menu ABOUT Our Story Our Team Join Our Team Contact Us GOLF Palm Card Shop Rates Golf Outings Practice Programs Lessons Golf Clubs PGA Jr. League Course Tour FLIGHT DECK Information Flight Deck Golf League Food Truck Menu DINING Fairways Kitchen & Bar Information Fairway’s Menu EVENTS Event Calendar Upcoming Event Information Private Event Information Golf Outings WEDDINGS Weddings PICKLEBALL Program Information Camps & Tournaments SOCIAL CLUB Information EVENTS Event Calendar Upcoming Event Information Private Event Information Golf Outings WEDDINGS Weddings PICKLEBALL Program Information Camps & Tournaments SOCIAL CLUB Information HOME ABOUT Our Story Our Team Join Our Team Contact Us GOLF Palm Card Shop Rates Golf Outings Practice Programs Lessons Golf Clubs PGA Jr. League Course Tour DINING Fairways Kitchen & Bar Information Fairways Menu FLIGHT DECK Information Flight Deck Golf League Food & Drink Menu EVENTS Event Calendar Upcoming Event Information Private Event Information Golf Events WEDDINGS Weddings PICKLEBALL Program Information Camps & Tournaments Information Memberships SOCIAL CLUB Information HOME ABOUT Our Story Our Team Join Our Team Contact Us GOLF Palm Card Shop Rates Golf Outings Practice Programs Lessons Golf Clubs PGA Jr. League Course Tour DINING Fairways Kitchen & Bar Information Fairways Menu FLIGHT DECK Information Flight Deck Golf League Food & Drink Menu EVENTS Event Calendar Upcoming Event Information Private Event Information Golf Events WEDDINGS Weddings PICKLEBALL Program Information Camps & Tournaments Information Memberships SOCIAL CLUB Information Arrowood Golf Course Home of the Quandary PALM Card Save big and play more with Arrowood’s PALM Cards—more rounds, more smiles, more memories. Because great golf should be played often! Learn More + Flight Deck offers Toptracer ® Range technology, interactive golf games, and virtual courses for all skill levels. With bay rentals, a food truck, and full bar, it’s a fun spot for golfers and non-golfers alike! Book Now + Weekly Events Line Dance Lessons Pickleball Live Ball - Tuesdays Witty Wednesdays - Trivia Pickleball Open Play Wednesdays Bingo Thursdays Men's Pickleball Clinic Thursdays Pickleball Live Ball - Fridays Friday Night Live Music Arrowood Night Range | Fri & Sat Saturday Skins Game Special Events Friday Live Music | Sept 5th Friday Live Music | Sept 12th Saturday Night Karaoke | Sept 13th Twisted Bingo | Sept 18th Sip & Savor | Sept 18th Saturday Night Karaoke | Sept 27th Titleist Club Fitting | Sept 18th Twisted Trivia: Friends Edition | Sept 20th XXIO Club Fitting Day | Sept 23rd TaylorMade Club Fitting | Oct 9th About Arrowood Designed by prominent local architect Ted Robinson Jr, the Arrowood golf course is a par-71, 6,721-yard layout imbedded in the Arrowood community. Located in Oceanside, adjacent to Camp Pendleton and only 35 miles north of San Diego, Arrowood sits on a scenic hilltop by the San Luis Rey Valley, only about 10 miles from the coastline. “This course is different from others we have designed in San Diego because of the topography and the extent of the natural areas adjacent to the holes. It feels open and unconfined,” remarks Robinson. Many holes are bordered by undeveloped riparian habitat, which give the course a feeling of natural seclusion. While the open spaces conduce to a sense of relaxation, the golf holes are not there for the taking. The course will challenge players of all abilities. It’s a concentration roller-coaster.” The greens are a blend of Poa annua and Bermuda grass, firm and fast. “We try to keep them rolling at 10 to 11 (on the stimpmeter)” indicates Nikki Prichard, Assistant General Manager. “This course will offer something for everyone,” she further points out. Four sets of tees ensure that there is a golf test to suit any skill level. A potential two-club wind further adds to the variety; play early in the morning under generally calm conditions and you will find a docile course. The ocean breeze will wake you up later in the morning and on into the afternoon. It typically peaks when you get to the more difficult part of the round, the final four holes which have recently been named The Quandary . Course Policies Two guests per golf cart. If you are in need of your own personal golf cart, a $20 fee will be incurred. As of June 1, 2025 the entire Arrowood facility will be cashless. We accept all major credit cards and debit cards, as well as Apple Pay and Google Pay. Dress Code: Proper golf attire is required, no denim, collared shirt required. Cart Policy: All riders are responsible for any damage to carts or property. The Quandary The state of perplexity or uncertainty over what to do in a difficult situation, a practical dilemma. It describes the final 4 holes perfectly! Hole 15 Par 3 – 187 Yards This hole will set the pace for the next three finishing holes on the course. This is a two tier green that breaks from back to front and is well guarded by three bunkers on the left and one on the right. Take one extra club if the pin is in the back. Anything on the green is a good shot here. Hole 16 Par 4 – 465 Yards The longest par four by some margin is downhill, but there are hazards both left and right. From there, the player must hit the mostly island green that, while large, requires relative precision with what will surely be a mid-long iron. The hillside short and right of the green may reject shots back into the water. Hole 17 Par 4 – 401 Yards Off the tee you want to avoid the bunker on the right and the hazard on the left. A well placed drive down the right center of the fairway sets up the angle for the approach shot. An extra club is essential to reach this heavily undulating and elevated green. Par is a good score here. Hole 18 Par 4 – 395 Yards This is a great finishing hole that challenges you off the tee and with your approach shot. A drive down the middle avoids the fairway bunkers on the left and right. A solid approach shot is required to carry the water hazard and make it safely on the green. This green is guarded by bunkers on the right and slopes from back to front. Testimonials \"I have played at Arrowood for 5+ years. I played today July 3rd and the course was in the best condition I can remember. Tees and fairways were in great shape. The greens were the best ever…running reasonably FAST and TRUE. Love the new sand trap on 14…looks like a great addition. Our group always comments that it seems as though every time we play, you have new and improved enhancements to the club house, range and course. Let’s not forget the staff….its nice being greeted in the pro shop by name. We had the 7;00 am and 7:20 am tee times and Don worked with us to put the two foursomes back-to-back. Overall a 10 out of 10 rating….I think my group today would say exactly the same thing. Congrats on a job well done. It takes great people to make this happen and you obviously work hard to find the right customer focused associates.\" 07/03/2025 \"I worked as a golf professional (club house) for a long period of my life. This business and golf experience is unmatched for a public golf course. Not to mention most private courses. Best bang for your buck and absolutely the best venue in So. Cal!! Incredible service, beautiful course, great food and the atmosphere is is kind, relaxing and worth every penny. Cheers to the staff especially Mark the superintendent for his gradual improvements he’s making on the course. Cheers.\" 06/25/2025 \"The staff in the pro shop, starters and the food service are all top notch. They are friendly, professional and always helpful. The best I have encountered at public golf courses!\" 06/17/2025 \"Was impressed with how well Ken handled getting golfers organized and on the tee in a professional and timely manner. Grounds crew were respectful and asked if we were enjoying our round. Person polishing the Quandary sign asked if we were enjoying our round! And thanked us for golfing! Ryan and Raqi are always friendly at Fairways and the Korean chicken sandwich was excellent.\" 04/30/2025 \"As usual . . . one of the best golf experiences in Southern California! Keep up the good work. See you again SOON!\" 04/10/2025 \"The thing that separated Arrowood Golf Course from other golf courses in the area is the staff. Everyone makes you feel welcome and a part of the club. This is one of the few public courses that feels like a private country club. Everyone including golfers have great attitudes and treat you with respect. You have set and maintain an atmosphere that is warm and welcoming.\" 03/26/2025 \"Everything was THE BEST! Keep up the great work! We'll be back and back and back . . . .\" 03/12/2025 \"Although Jacky was off today for the holidays she still made time to make sure our group was taken care of. Lily (beverage cart attendant) did a phenomenal job making sure our cups were always full and always had a smile on when tending to us. We really appreciate the platinum customer service the Arrowood team provides, which is the reason we continue to come back time and time again. Also, bob does a great job managing the pace of play and being methodically in his approach to the flow of golfers throughout the day! Thank you for the great experience!\" \"Thought course was in excellent shape and course has a fun layout for all skill levels. Pace of play was great and thought all the food and beverage options were great as well. Good seeing the course providing some entertainment with range and F&B all together for fun time for families. I'll be back again as the value vs Orange County golf makes this attractive to drive down from San Clemente to play.\" \"Other Courses Should Take Notes from This Club. Had a chance to play a 12:30 p.m. tee time. Place has a great clubhouse along with outside bar and food truck that day. Course was in phenomenal condition and the staff was super friendly and was instrumental in creating a fun and enjoyable atmosphere. It's a challenging course with great opportunities to score. If you are hitting the ball well. Also, the price was terrific for the quality of the course! Definitely worth another visit and would highly recommend this course to anyone looking to play in Southern California.\" \"I love everything this course offers. No other course we play in OC and North San Diego County offers what Arrowood does. I personally don't have time to sit and enjoy the food services, as we drive down from Laguna Niguel area when we play. But, everything here is top notch. The fairways were really good today, as were the greens. If I lived closer to the course, I'd be there every day and use all the facilities. The Arrowood experience is the best of any course we play, which includes Arroyo Trabuco, The Crossings at Carlsbad and Encinitas Ranch.\" “Best vibes in Southern California by far. Great value. Great food. Great service from the starter to the servers at the Flight Deck. Not much you could do better. Now I'd take that momentum and really concentrate on keeping the course conditions A+. With record amounts of rounds being played the last few years, too often I've seen clubs not take care of the course. That should be the priority. Arrowood should be a example to other clubs of what the future looks like. Such a great time out there!” “Just wanted to say thank you for your focus on your customers and the overall experience. Ever so friendly and helpful Pro shop staff, starter, maintenance folks, great layout and course conditions, full practice facility and now an upgraded range. I live in Dana Point and enjoy your overall experience more than any course I play in Orange County. Love your 5 rounds for $250 card and the way you brand and market (never thought Quandary would be in my vocab). I have 10+ rounds now since late summer, and I'll now even be coming down just to practice. Please keep pushing the envelope...you guys are really doing things exceptionally well.” “First class golf course! My first time playing, and I was very impressed! I've played many courses in San Diego county, and Arrowood is easily right there at the top of any I've been to. Everything about the experience was superb. I loved the layout of the course itself; it was immaculate and in excellent shape. I also loved the design and positioning of everything else. Every area of the course was conveniently laid out and strategically positioned to be only steps away from each other, which made everything very easy to access; from the clubhouse, to the restaurant and bar, to the starter and golf carts, to the driving range, chipping and putting, to the first tee. You could also tell there was pride in ownership as every area was pristine and in top notch shape as well. I really enjoyed the separate driving range section with lounges and with Top Tracer technology. For so long I've wanted to experience Top Golf in San Diego. This section is the closest I've ever come to it and I absolutely loved it!! Five star experience all around and can't wait to return!!” \"Arrowood is the best golf experience in SoCal. My son is a competitive junior golfer and we are at golf courses all over SoCal. The layout and course conditions, the practice area, the food & service at Fairways, snack cart service, the pro shop customer service, the overall ambience is better than any other course we go to. Your management and staff clearly take great pride in not just the course, but the whole atmosphere at Arrowood. It always makes for a comfortable and enjoyable experience!\" \"From the minute we arrived, we were greeted by the friendly starter. We had never been to your course before. We were impressed with everything about your course. The fairways and greens were pristine. Beautiful course and challenging enough. It was a great experience from start to finish. Everyone who works there acts like they love their job. Each person from starters, restaurant workers, and the pro shop people were completely friendly and helpful. It was really a special day for us and we were celebrating our anniversary! We will look forward to when we can come back again and bring friends!\" \"Your golf course is the most well run I’ve played, everything from the green speed and handicap ratings for choosing tees is great. The only improvement needed there is the curb painting indicating each tee needs to be redone, painting the tee color on the curbs was an excellent idea by the way. The staff are very friendly and one of the best features. The course layout is great and challenging. I don’t play Arrowood often since it’s almost an hour drive from home, but I always look forward to it. Thank you for running such a beautiful course.\" \"This is Class A golf course, to say the least.  But, I just wanted to point out a \"hidden\" treasure that is offered.  Nikki Pritchard, a truly amazing & comfortable teaching pro, has a clinic on Tuesday afternoons for a lesson & then 9 holes. Not only so very helpful to knock out the kinks, but 9 holes to work it!  The group is called \"9 & Wine\" and you can find it on Meet-up or email Nikki at Arrowood.  I am not employed by Arrowood and not a friend of Nikki.......just someone who did this for the first time yesterday and the value, & lesson was worth gold to me.  I can't even begin to express how much that lesson helped me....dead serious.  And, I'm going back for more! ........oh, yes there is wine!\" \"I can think of anything that would require as a necessary improvement. What GM Tom has done to the overall experience at Arrowood is fantastic. The staff is welcoming, friendly & most accommodating. From the front desk at check in, to the ambassador out front of pro shop, to your very friendly golf superintendent, to GM Tom, right down to the gentleman who helps us with our cart pre/post golfing. The Arrowood experience is The BEST of All courses we play throughout San Diego every Monday. I recommend Arrowood to every SD golfer in know.\" \"I play 10~12 times/month all over the county and really appreciate courses that provide decent playing conditions. The course today (5/17/21) was flawless. There is actual grass on the fairways and the rough was as it should be and well groomed. I know conditions like these are expensive to provide in southern California, but it is a major reason to keep me and my friends frequenting your course. Kudos to everyone involved!!\" \"Our first time in & really enjoyed such a nice/friendly staff & what a gorgeous course! The rolling hills & mostly wide fairways were awesome! Had pizza & drinks after our round and both were great, with nice/friendly staff! Restrooms were clean, stocked & appreciate that too! We will be back for sure, can’t wait to golf here at A W again! :)\" Selected as a 2024 Golf Range Association of America Top 50 Range in the Public Category Arrowood Golf Course’s 18 holes usher golfers over 6,721 yards of pristine turf marked by frequent swings in elevation. Ted Robinson Jr. designed layout. About Course Tour Rates Team Our Story Contact Us Academy Shop Golf Home Palm Card Practice Programs Golf Clubs Tournaments Flight Deck Fairways Grill Fairways Grill Order Online Food & Drink Menu Weddings & Events Weddings Upcoming Events Event Calendar Contact Us Email: info@arrowoodgolf.com Phone: (760) 967-8400 Address: 5201 Village Drive, Oceanside, CA 92057 Download Our New App! Copyright © 2025 ArrowoodGolf.com | Privacy Policy | Terms & Conditions Facebook Tiktok Instagram"
    }
  ]
}