{
  "query": "oceanbreezeinns.com email",
  "fuentes": [
    {
      "url": "https://business.sebastianchamber.com/list/member/ocean-breeze-inn-vero-beach-831",
      "email": "info@sebastianchamber.com"
    },
    {
      "url": "https://townofoceanbreeze.com/contact-us/",
      "email": "dhudson@townofoceanbreeze.org"
    },
    {
      "url": "https://townofoceanbreeze.com/contact-us/",
      "email": "townclerk@townofoceanbreeze.org"
    }
  ],
  "mails": [
    "dhudson@townofoceanbreeze.org",
    "info@sebastianchamber.com",
    "townclerk@townofoceanbreeze.org"
  ],
  "nombre_sitio": "oceanbreezeinns.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://business.sebastianchamber.com/list/member/ocean-breeze-inn-vero-beach-831",
      "text": "Ocean Breeze Inn - Vero Beach | Lodging | Lodging - Sebastian River Area Chamber of Commerce Skip to content Menu Chamber About Us Board of Directors Staff Employment Opportunities Committees Mural Program Economic Development Chamber Newsletter Contact Us Members Business Directory & Community Guide Member Directory Search Member to Member Deals Member News Member Login Become a Member Events Chamber Events Community Calendar Festivals & Special Events Area Our History Our Communities Business Directory & Community Guide Weather Real Estate Job Postings Photo/Video Gallery Request Information Visit Pelican Porch Visitor’s Center Digital Visitor Guide Festivals & Special Events Mural Trail Destination Videos Visit SRA Newsletter Visit SRA Facebook Ocean Breeze Inn - Vero Beach Categories Lodging Lodging 3384 Ocean Drive Vero Beach FL 32963 (772) 231-2300 (772) 234-8069 Send Email www.OceanBreezeInns.com About Us Enjoy the location Dazzling Vero Beach Oceanfront Hotel. Ocean Breeze Inn - Vero Beach! Our oceanside hotel guests enjoy beaches, beautiful sea views and excellent customer service. Surrounded by shops, restaurants and entertainment options, the hotel's enviable location in Vero Beach, FL is on Orchid Island Beach, Florida separated from the mainland by the Indian River Lagoon. The hotel's seaside places guests close to excellent leisure opportunities for recreation and entertainment options, including the Riverside Theater and Vero Beach Art Museum. Nature lovers will enjoy the parks and gardens, including the McKee Botanical Garden, while history buffs to explore the renowned Breconshire wreck of the steamship. Business travelers will enjoy easy access to many companies in Vero Beach near the location of this hotel's beachfront. The function room on site and can accommodate up to 90 people, offering a place for meetings with clients. Wi-Fi throughout the property helps guests stay connected to the house back office, as well. Our full-service accommodations offer much more than one location at the seaside Vero Beach. Hotel amenities include a heated outdoor pool, a laundry and a gym 24 hour fitness center and a business center. The hotel's restaurant, Mulligan Beach House serves fresh seafood and American cuisine throughout the day. Plan your next vacation for Ocean Breeze Inn - Vero Beach today! Highlights Images Gallery Image holiday%20inn%209.jpg × Gallery Image ocean%20breeze%201.png × Gallery Image ocean%20breeze%202.png × Gallery Image ocean%20breeze%203.png × Gallery Image ocean%20breeze%204.png × Gallery Image ocean%20breeze%205.png × Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel © 2025 Sebastian River Area Chamber of Commerce | Site by GrowthZone Get In Touch! 772.589.5969 700 Main Street Sebastian, FL 32958 email Email Us Additional Resources IRC Disaster Preparedness Member Login Member Directory Become a Member Stay Connected! Join Our Mailing List © Sebastian River Area Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://townofoceanbreeze.com/contact-us/",
      "text": "CONTACT US | Welcome to the Town of Ocean Breeze! HOME SERVICES BUILDING & PERMITTING ELECTIONS EMERGENCY / FEMA FINANCE PLANNING & ZONING HISTORY TOWN COUNCIL & BOARDS COUNCIL MEMBERS MINUTES & AGENDAS PUBLIC NOTICES TOWN CHARTER STAFF CONTACT US Select Page CONTACT THE TOWN OF OCEAN BREEZE Pamela Orr Town Clerk 772-807-2557 Email Gemma Torcivia, Esquire Attorney David Holcomb Code Enforcement 772-334-6826 Dan Hudson Town Management Consultant 772-334-6826 Email Steve Nicolosi Building Official 772-334-6826 Holly Vath Financial Analyst 772-334-6826 Physical Location 1508 NE Jensen Beach Blvd. Jensen Beach, FL 34957 772-334-6826 Mailing Address P. O. Box 1025 Jensen Beach, FL 34958 Office Hours: Mon – Thur 9:00 AM – 2:00 PM, closed on Fridays If you’d like to contact us, please complete the form below.  1508 NE Jensen Beach Blvd. Jensen Beach, FL 34957  Call Us: 772-334-6826 Office Hours: Mon – Thur 9:00 AM – 2:00 PM, closed on Fridays Notice: JavaScript is required for this content. Under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. The Town of Ocean Breeze is committed to ensuring accessibility of its website to people with disabilities. To report an ADA accessibility issue, request accessibility assistance regarding our website content, or to request a specific electronic format, please contact the Town Clerk at  772-334-6826. We will make reasonable efforts to accommodate all needs."
    }
  ]
}