{
  "fuentes": [
    {
      "url": "https://quarterdeckrestaurants.com/about/",
      "email": "events@quarterdeckrestaurants.com"
    },
    {
      "url": "https://quarterdeckrestaurants.com/about/",
      "email": "careers@quarterdeckrestaurants.com"
    },
    {
      "url": "https://ashoreresortoceancity.com/about-us/contact-us/",
      "email": "logo-new-dark@2x.png"
    }
  ],
  "mails": [
    "careers@quarterdeckrestaurants.com",
    "events@quarterdeckrestaurants.com",
    "logo-new-dark@2x.png"
  ],
  "nombre_sitio": "oceandeck.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://quarterdeckrestaurants.com/about/",
      "text": "About – Quarterdeck Restaurants Skip links Skip to primary navigation Skip to content Toggle navigation Home Menu Main Menu Endless Summer Specials Takeout Ft. Lauderdale Ft. Lauderdale Beach Dania Beach Davie Sawgrass Locations Press About ABOUT OUR AWARD-WINNING QUARTERDECK RESTAURANTS Since I first opened the doors of the very first location in the 80’s, I knew we had created something special, something uniquely South Florida. I can’t tell you how many people have told me that they met their spouse at the Quarterdeck or that we have sponsored their class reunions. 50 years is a long time. We now hire some high school students whose parents worked at the Quarterdeck location when they were young! More than 50 years later, we remain driven by the same old school, neighborhood values upon which we have built our success. Frank Zaffere and I opened the second Quarterdeck® on Fort Lauderdale Beach in 1995. We outlasted every restaurant in the area, except another staple of the community, the Elbo Room. We have 21 years of continuing operations; through five hurricanes and three recessions, we have stayed true to our old school values. – Paul Flanigan JAMES FLANIGAN PARTNER & CEO About James Flanigan James Flanigan PARTNER & CEO James has been in the restaurant industry since he was an early teenager, literally and figuratively working from the ground floor up to his current position as CEO. As a child, he shadowed and observed his father, Paul, build the business. He continued through high school, college, and law school and has worked in almost every position. James graduated from Florida Atlantic University with a degree in Accounting and from Florida State University College of Law. During college and law school, James worked in the federal trial court in Philadelphia and the state appellate and trial courts in Tallahassee. James practiced law for almost four years in Fort Lauderdale at Tripp Scott, focusing mainly on commercial litigation, bankruptcy and insolvency proceedings. Serving as CFO and chief legal officer of Old School Hospitality for several years, James was named CEO in 2022 and is currently responsible for managing all of the company’s operations. He lives in downtown Fort Lauderdale and plans to plant his roots in the area even further. His love for the bar and restaurant business, along with his extensive law and accounting background, make him the perfect candidate to not just run the business, but to grow it to new heights. James is happily married with three children, a son and twin daughters. PAUL FLANIGAN PARTNER & CHAIRMAN OF THE BOARD About Paul Flanigan Paul Flanigan PARTNER & CHAIRMAN OF THE BOARD The patriarch of the Old School family, Paul purchased Quarterdeck from Flanigan’s Enterprises, Inc. in 1986, and he partnered with Flanigan’s for close to a decade, opening and managing a number of Flanigan’s Seafood Bar and Grill franchise and company units. He opened a second Quarterdeck Seafood Bar & Neighborhood Grill on Fort Lauderdale Beach in 1995 and then he soon partnered with Frank Zaffere to open six additional Quarterdecks in Dade, Broward, and Palm Beach Counties from 1997 through 2004. Paul and Frank teamed up to design, create, and open Dive Bar Restaurant in Jupiter, Florida in 2011 and Dania Beach Quarterdeck in 2012, first Whiskey Neat in 2020 and the second in 2023. A contemporary tiki concept – The Hula Kai, and its rooftop bar, The Ohana Lounge, are set to begin construction fall 2024. Completion expected early spring 2025. Born in Texas, Paul has been in Florida for most of his life. He attended the University of Florida and then went on to graduate from the University of Notre Dame with a B.B.A. in Accounting, and later graduated from the University of Miami School of law. Prior to entering the restaurant business, Paul also worked as a staff accountant with Price Waterhouse in Tampa and later worked as an attorney with Morgan, Lewis, and Bockius in Miami. Paul is married with five children. FRANK ZAFFERE PARTNER & COO About Frank Zaffere Frank Zaffere PARTNER & DIRECTOR OF STRATEGIC BRAND DEVELOPMENT Frank is a long-time business partner and friend of his fellow Notre Dame alumni, Paul Flanigan. In less than 10 years of employment, Frank became Chief Operating Officer at Quarterdeck restaurants. Under his direction, Quarterdeck doubled units and sales, and established partnership relationships with three major sports franchises in South Florida: the Miami Dolphins, Florida Panthers and Florida Marlins. Frank was the impetus behind the adoption of sushi, first as a limited menu item, and then as a staple menu item. Frank’s restaurant experience includes serving as managing partner of all Quarterdeck locations and Good Spirits. Frank’s promotion to Director of Strategic Brand Development is a result of his extensive managerial restaurant experiences. JONATHAN JIMENEZ EXECUTIVE CHEF About Jonathan Jimenez Jonathan Jimenez EXECUTIVE CHEF Jonathan was born in Bogota, Colombia and moved at the age of 16 to Miami. Since he was a kid, he always found himself in the kitchen hungry and curious about how food was prepared. His first job in 1999 was at his aunt’s restaurant – a very busy Mexican restaurant in South Beach “El Rancho Grande”. While attending school, he worked there as a dishwasher and that’s where his love and passion for Mexican cuisine began. Jonathan then decided to move to Myrtle Beach, South Carolina, where he worked in fine dining at Marriott Resort & Spa at Grand Dunes and at Michaels on 79. From there, he moved back to Miami and took a job at Barton G Restaurant in South Beach where he started as a line cook and then got promoted to Sous Chef and then to Executive Sous Chef. After four years, he took an offer as a Executive Sous Chef to work for a well-known area restaurant, “Nikki Beach.” Jonathan has had the opportunity to travel and open two restaurants, one in Dominican Republic and one in Las Vegas. He has traveled the world, exploring food in the US, Thailand and Mexico. He got the opportunity to open a new Mexican Restaurant call “Lolos Surf Cantina” in South Beach. In 2018, he joined Old School Hospitality team. ALYSSA TIBBETTS OPERATIONS MANAGER About Alyssa Tibbetts Alyssa Tibbetts CHIEF OPERATING OFFICER & DIRECTOR OF OPERATIONS Alyssa is veteran of the Florida hospitality industry. Alyssa began as a hostess at the Davie Quarterdeck in 2006. Over the next several years, she progressed through various positions and levels of responsibility, ultimately becoming the General Manager in 2016. In 2017, Alyssa became General Manager of the original Quarterdeck, Project Manager for the new Quarterdeck along with an entirely new concept, Whiskey Neat, which opened in 2019. In 2021, Alyssa was assigned additional responsibilities including serving as a design consultant for the new Hula Kai Tiki. Early in 2022, Alyssa became Old School Hospitality Operations Manager. In 2025, Alyssa became Chief Operating Officer responsible for Quarterdeck, Whiskey Neat, Hula Kai and the rooftop Ohana Lounge. Alyssa is also engaged in brand development and strategic planning. WE HAVE SERVED MORE THAN 1,500,000 DOLPHIN SANDWICHES 1,000,000 FULL RIB DINNERS Our goal at the Quarterdeck has always been to deliver great tasting food and beverages at a competitive price in a fun, neighborhood environment. What sets us apart? Our Master Sushi Chef ensures the highest quality, freshest fish you can get. Corporate Chef, Kevin McCarthy, visits each store on a weekly basis creating new menu items, improving current items, and conducting regular tastings to ensure consistency and food quality while interacting directly with the chefs and kitchen managers. Our extensive wine and craft beer menu to pair with our customers favorite dishes. And our Spirit Master has crafted the finest cocktails to delight our customers’ palate. Our reasonably priced dishes rival the most upscale, expensive restaurants, in our neighborhoods. Finally, each Quarterdeck® has a casual atmosphere with no less than 40 TVs and is a great place to grab a gourmet burger, served over 500 different ways. One of the biggest changes for the Quarterdeck® has been our addition of sushi as a major menu item. We were ahead of time in incorporating this into the Quarterdecks, and it has really paid off as our customers have loved having this option on our menu. It’s really the ultimate health option. We have an old school approach when it comes to quality service, customer satisfaction, and value, but we always have their eyes open for new trends that our customers crave, like sushi. Right now that’s Classic Cocktails. We believe we have the best Old Fashioned in the area. Because of economies of scale, we can deliver the highest quality sushi and Classic Cocktails at a very reasonable prices. FOLLOW US @QUARTERDECKRESTAURANTS All vibes, no hangover. There’s a new zero proof For just $22, you get a plate so fancy even your f Come for the drinks, stay ‘til Monday.. Bring yo $6 ribs? Cheaper than therapy and twice as satisfy LOCATIONS DAVIE FT. LAUDERDALE DANIA BEACH SAWGRASS FT. LAUDERDALE BEACH MENU LUNCH & DINNER DRINKS ABOUT CAREERS PRESS SHOP FOLLOW CONTACT EMAIL US COPYRIGHT © 2021 QUARTERDECK | SEAFOOD BAR & NEIGHBORHOOD GRILL. ALL RIGHTS RESERVED. CRAFTED BY YOURS TRULY,"
    },
    {
      "url": "https://ashoreresortoceancity.com/about-us/contact-us/",
      "text": "Contact Us | Top Resorts near Ocean City, MD | Ashore Resort Skip to menu Skip to content Skip to footer ACCOMMODATIONS ROOMS & SUITES AMENITIES PACKAGES DINING TIDE ROOM THE TAPROOM WAHOO BEACH BAR SHORE DECK ASHORE THINGS WEDDINGS SERVICES WEDDING MENUS GALLERY REQUEST FOR PROPOSAL MEETINGS 2026 EVENT SPACE RENOVATION CONFERENCE CENTER MEETINGS SOCIAL EVENTS EVENT MENUS MEETING GALLERY FLOORPLANS & SERVICES REQUEST FOR PROPOSAL HAPPENINGS HAPPENINGS LIVE MUSIC ASHORE BEACH ABOUT US CONTACT US GALLERY BLOG EXPLORE LOCAL ATTRACTIONS GOLF COURSES BOOK NOW Main Navigation HOME ACCOMMODATIONS ROOMS & SUITES AMENITIES PACKAGES DINING DINING & NIGHTLIFE OVERVIEW SHORE DECK THE TAPROOM ASHORE THINGS TIDE ROOM WAHOO BEACH BAR WEDDINGS WEDDINGS OVERVIEW SERVICES WEDDING MENUS GALLERY REQUEST FOR PROPOSAL MEETINGS 2026 EVENT SPACE RENOVATION MEETINGS & EVENTS OVERVIEW CONFERENCE CENTER MEETINGS SOCIAL EVENTS EVENT MENUS MEETING GALLERY FLOORPLANS & SERVICES REQUEST FOR PROPOSAL EXPLORE EXPLORE OVERVIEW POOL EXPERIENCE LOCAL ATTRACTIONS LIVE MUSIC GOLF COURSES HAPPENINGS HAPPENINGS OVERVIEW HAPPENINGS LIVE MUSIC ABOUT US ABOUT US OVERVIEW CONTACT US GALLERY BLOG BOOK NOW BOOK NOW CONTACT US Get in Touch Questions about your reservation or upcoming trip to Ocean City, Maryland? Please get in touch via our contact form or other contact methods, listed below. Name (Required) First Last Phone (Required) Email (Required) Address (Required) Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Please briefly tell us how we can assist you below & someone from our team will be in touch soon! (Required) 10100 Coastal Highway Ocean City, MD 21842 410-524-3535 Facebook Instagram ACCOMMODATIONS DINING & NIGHTLIFE WEDDINGS MEETINGS & EVENTS EXPLORE ABOUT US VIEW OR CHANGE RESERVATION Stay In Touch Enter your email to get updates and the latest deals Email (Required) PRIVACY POLICY | ACCESSIBILITY ADVICE | SITEMAP This website uses cookies to improve your experience. By continuing to use this site, you agree to our use of cookies. View Privacy Policy Resort Website by O'Rourke 410-524-3535 Book Now X MAKE A RESERVATION Rooms 1 2 3 4 5 Adults 1 2 3 4 5 Children 1 2 3 4"
    }
  ]
}