{
  "fuentes": [
    {
      "url": "https://www.scottpoolsinc.com/contact-us",
      "email": "info@scottpoolsinc.com"
    },
    {
      "url": "https://book.breezes.com/ContactUs.aspx",
      "email": "customer.service@superclubs.com"
    },
    {
      "url": "https://www.oceanbreezebeachresort.com/meet-our-staff",
      "email": "contact@oceanbreezebeachresort.com"
    },
    {
      "url": "https://townofoceanbreeze.com/town-council-staff-2/",
      "email": "msquires@townofoceanbreeze.org"
    },
    {
      "url": "https://townofoceanbreeze.com/town-council-staff-2/",
      "email": "mheller@townofoceanbreeze.org"
    },
    {
      "url": "https://townofoceanbreeze.com/town-council-staff-2/",
      "email": "gciaschi@townofoceanbreeze.org"
    },
    {
      "url": "https://townofoceanbreeze.com/town-council-staff-2/",
      "email": "jgalante@townofoceanbreeze.org"
    },
    {
      "url": "https://townofoceanbreeze.com/town-council-staff-2/",
      "email": "kdocherty@townofoceanbreeze.org"
    },
    {
      "url": "https://townofoceanbreeze.com/town-council-staff-2/",
      "email": "mayor@townofoceanbreeze.org"
    },
    {
      "url": "https://townofoceanbreeze.com/town-council-staff-2/",
      "email": "skelley@townofoceanbreeze.org"
    },
    {
      "url": "https://learningpool.com/contact-us",
      "email": "sales@learningpool.com"
    },
    {
      "url": "https://oceanbreezewellbeing.com/",
      "email": "cropped-icon@1600x-180x180.png"
    },
    {
      "url": "https://oceanbreezewellbeing.com/",
      "email": "cropped-icon@1600x-192x192.png"
    },
    {
      "url": "https://oceanbreezewellbeing.com/",
      "email": "cropped-icon@1600x-270x270.png"
    },
    {
      "url": "https://oceanbreezewellbeing.com/",
      "email": "cropped-icon@1600x-32x32.png"
    },
    {
      "url": "https://oceanbreezewellbeing.com/",
      "email": "logo@1600x-100.jpg"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://www.marriott.com/en-us/dining/restaurant-bar/phxgp-sheraton-phoenix-downtown/6085473-breeze-bar.mi",
      "email": "sales.phoenixdowntown@sheraton.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "contact@oceanbreezebeachresort.com",
    "cropped-icon@1600x-180x180.png",
    "cropped-icon@1600x-192x192.png",
    "cropped-icon@1600x-270x270.png",
    "cropped-icon@1600x-32x32.png",
    "customer.service@superclubs.com",
    "gciaschi@townofoceanbreeze.org",
    "info.nairobi@skanem.com",
    "info@scottpoolsinc.com",
    "jane@skanem.ke",
    "jgalante@townofoceanbreeze.org",
    "kdocherty@townofoceanbreeze.org",
    "logo@1600x-100.jpg",
    "mayor@townofoceanbreeze.org",
    "mheller@townofoceanbreeze.org",
    "msquires@townofoceanbreeze.org",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sales.phoenixdowntown@sheraton.com",
    "sales@learningpool.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "skelley@townofoceanbreeze.org"
  ],
  "nombre_sitio": "oceanbreezeinns.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.scottpoolsinc.com/contact-us",
      "text": "Contact Us | Reach Out Today — Scott Pools 0 Skip to Content Home What We Offer About Us Our Team Contact Us Open Menu Close Menu Home What We Offer About Us Our Team Contact Us Open Menu Close Menu Home What We Offer About Us Our Team Contact Us Contact us today. Interested in our pool services? Fill out the form below and we will be in touch shortly! Or feel free to call or text (317) 846-5576. We can't wait to hear from you! Name * First Name Last Name Email * Phone * (###) ### #### Address * Address 1 Address 2 City State/Province Zip/Postal Code Country What inground pool services are you interested in? (Check all that apply) Opening Closing Pool Cleaning Equipment Inquiry Other Service Work Store related questions (Maytronics robot repair, water testing questions, etc) Pool Size Cover Type Auto cover Tarp Extras? Waterfall, fountain, floor system, etc. Requested Time Frame: (Not guaranteed) Spa? Yes, above ground/portable Yes, in ground No spa Additional comments How did you hear about us? * Mail flyer Google/search engine Saw one of our service vehicles Recommendation from a friend Social Media Preferred Contact Method: * Phone call Text Email Thank you! We’ll be in touch soon. Scott Pools Inc. 7715 Loma Ct. Fishers, IN 46038 Hours: Monday-Friday 8AM-5PM Saturday 8AM-1PM Sunday Closed (317) 846-5576 info@scottpoolsinc.com Copyright Scott Pools. All rights reserved."
    },
    {
      "url": "https://book.breezes.com/ContactUs.aspx",
      "text": "Contact Us Home Groups & Meetings Feeling Social? Contact Information Contact Information Please complete the form below and we will be in contact with you shortly. Items with * are required. Resort Name -- Any Resort -- Breezes Resort - Bahamas First Name * Required Field! Last Name * Required Field! Email * Required Field! Invalid Email! Phone Invalid phone number! What is your question about? * -- Choose One -- Resort - Rates, Promotions, Availability, Resort Information, etc. Groups (10 rooms or more) - Rates, Availability, Information, etc. Wedding/Honeymoon - Information, Planning, etc. Customer Relations - Feedback, Suggestions, etc. Brochure Requests Career Opportunities Technical Support - Online Reservation System Technical Support - Main Site: Feedback, Suggestions, Issues, etc. Status of Refunds, Commission Payments, Credit Card Charges, Inquiries, etc. Marketing Opportunities Required Field! Tell us more about what you need * Required Field! start over Clear Form Submit Prices and amenities are in US Dollars and are subject to change without notice. This is the official website for Breezes resorts. All copyrights and trademarks contained within this website are the sole property of VRL International Ltd. and\r\n                            cannot be used, reproduced, copied or modified, in its entirety or in part, without prior consent by an authorized agent of VRL International Ltd. All materials contained\r\n                            within this reservation system are the sole property of International Lifestyles, Inc. and cannot be used, reproduced, copied or modified, in its entirety or in part,\r\n                            without prior consent by an authorized agent. International Lifestyles, Inc. is registered with the State of Florida as a Seller of Travel [Registration #ST17761] Copyrighted © 2000-2009 VRL International Ltd.® All Rights Reserved. Information subject to change Policies & Terms • Privacy & Cookie Policy Copyright © 2008 VRL International Ltd. All Rights Reserved. Information and\r\n                activities subject to change without notice. All resorts disclaim liability for\r\n                use thereof. Questions? Feedback? powered by Olark live chat software"
    },
    {
      "url": "https://www.oceanbreezebeachresort.com/meet-our-staff",
      "text": "Meet the Ocean Breeze Team Members at Ocean Breeze Beach Resort top of page Menu Home Accommodations All Accommodations Our Suites Our Cabanas Our Studios Amenities About Us The Best Place to Stay! Placencia Village Owner Bio Meet Our Team Toucan Jack's Tiki Bar Tiki Bar Menu Photo Gallery Our Blog Cancellation Policy Plan Your Trip Belize Fun Facts How to Get To Placencia Trusted Hotel Partners Frequently Asked Questions Retiring in Belize Transportation Belize International Airport Crystal Car Rentals Budget Car Rentals Untamed Belize Shuttle Tropic Air Maya Island Air Resources International Living Magazine Weather Forecast Services All Our Services Room Add-Ons Beach Massage Golf Cart Rentals Beachside Wedding !! SPECIALS !! Our Excursions Our Packages Loyalty Guest Rewards Contact Us Reviews Close Home Accommodations All Accommodations Our Suites Our Cabanas Our Studios Amenities About Us The Best Place to Stay! Placencia Village Owner Bio Meet Our Team Toucan Jack's Tiki Bar Tiki Bar Menu Photo Gallery Our Blog Cancellation Policy Plan Your Trip Belize Fun Facts How to Get To Placencia Trusted Hotel Partners Frequently Asked Questions Retiring in Belize Transportation Belize International Airport Crystal Car Rentals Budget Car Rentals Untamed Belize Shuttle Tropic Air Maya Island Air Resources International Living Magazine Weather Forecast Services All Our Services Room Add-Ons Beach Massage Golf Cart Rentals Beachside Wedding !! SPECIALS !! Our Excursions Our Packages Loyalty Guest Rewards Contact Us Reviews Book Direct for Best Rate! Book Your Stay Golf Cart Rentals Meet Our Team We're excited to introduce you to our dedicated team who ensures your stay is exceptional. Craig Densham Owner Risa Scutellaro Sales & Marketing Director Carla Zuniga Assistant Manager Jasmine Westby Bartender Melissa Castillo Bartender/Housekeeping Angel Peck Property Maintenance Stephanie Menzies Housekeeping Nadia Burgess Front Desk/Housekeeping Roy Peters Security Elmer Ack Security/Maintenance Give Us the Opportunity to Serve You Let us provide you with exceptional hospitality and unforgettable memories. Book your stay today and allow us the opportunity to serve you with excellence! Book Your Stay Ocean Breeze Beach Resort CONTACT +501 671-3020 +501 671-1339 ​​(If calling from USA or Canada, enter 011 prior to number above.) ​ contact@oceanbreezebeachresort.com USA Offices located in Deerfield Beach, Florida, USA +1 813-716-2398 (Leave Voice Message) BELIZE Offices located in Placencia Village, Stann Creek, Belize © 2025 by Ocean Breeze Beach Resort LLC. All Rights Reserved. Home Accommodations All Accommodations Our Suites Our Cabanas Our Studios Amenities About Us The Best Place to Stay! Placencia Village Owner Bio Meet Our Team Toucan Jack's Tiki Bar Tiki Bar Menu Photo Gallery Our Blog Cancellation Policy Plan Your Trip Belize Fun Facts How to Get To Placencia Trusted Hotel Partners Frequently Asked Questions Retiring in Belize Transportation Belize International Airport Crystal Car Rentals Budget Car Rentals Untamed Belize Shuttle Tropic Air Maya Island Air Resources International Living Magazine Weather Forecast Services All Our Services Room Add-Ons Beach Massage Golf Cart Rentals Beachside Wedding !! SPECIALS !! Our Excursions Our Packages Loyalty Guest Rewards Contact Us Reviews bottom of page"
    },
    {
      "url": "https://townofoceanbreeze.com/town-council-staff-2/",
      "text": "TOWN COUNCIL & STAFF | Welcome to the Town of Ocean Breeze! HOME SERVICES BUILDING & PERMITTING ELECTIONS EMERGENCY / FEMA FINANCE PLANNING & ZONING HISTORY TOWN COUNCIL & BOARDS COUNCIL MEMBERS MINUTES & AGENDAS PUBLIC NOTICES TOWN CHARTER STAFF CONTACT US Select Page TOWN COUNCIL & BOARDS Members of the Ocean Breeze Town Council also server on the Zoning Board. Mayor Karen Ostrand Email Kevin Docherty President Council Member Email Sandy Kelley Vice President Council Member Email Janet Galante Council Member Email Matthew Squires Council Member Email George Ciaschi Council Member Email Michael Heller Council Member Email If you’d like to contact us, please complete the form below.  1508 NE Jensen Beach Blvd. Jensen Beach, FL 34957  Call Us: 772-334-6826 Office Hours: Mon – Thur 9:00 AM – 2:00 PM, closed on Fridays Notice: JavaScript is required for this content. Under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. The Town of Ocean Breeze is committed to ensuring accessibility of its website to people with disabilities. To report an ADA accessibility issue, request accessibility assistance regarding our website content, or to request a specific electronic format, please contact the Town Clerk at  772-334-6826. We will make reasonable efforts to accommodate all needs."
    },
    {
      "url": "https://learningpool.com/contact-us",
      "text": "Get in touch | Learning Pool Solutions Solutions The Learning Pool Platform Level up your workforce training with data-driven learning Discover more Use cases Onboarding Compliance Upskilling External Training Industries Business Services Construction Financial Services Hospitality Life Sciences Manufacturing Oil, Gas & Energy Retail Technology Telecommunications Products Products The Learning Pool Platform Level up your workforce training with data-driven learning Discover more Learning Platform Adaptive Compliance Courses OnScreen Guidance Learning Record Store Learning Content Management System Content Content Library Content Custom AI Coach AI Conversations AI Assess Resources Resources See how IHG upskilled 3,000 of its leaders across 42 different countries. Read the case study Blog Events Downloads Case Studies Webinars News Podcasts View all Resources Company Company We create learning experiences that deliver extraordinary outcomes for companies and their people. About us What We Believe What We Do Meet the Team Industry Recognition Careers Learning Pool Labs ESG Careers Support Contact Request for proposal Request a demo Request a demo Careers Support Contact Request for proposal Contact us Get in touch Learning that works for you, not the other way around. Find out how we help you create custom e-learning content, streamline onboarding, enhance compliance training, and transform learning data into a valuable business asset – all tailored to your needs. Use the form to start a conversation, or request a demo if you’re ready to explore our platform in action. Already working on a project? You can also submit an RFP and we’ll get back to you shortly. Get in touch How to reach us Support UK: +44 345 074 4114 US: +1 844 238 5577 support@learningpool.com Learn more Sales UK: +44 207 101 9383 sales@learningpool.com General Inquiry UK: +44 207 101 9383 hello@learningpool.com Registered billing addresses Learning Pool Ltd Old City Factory 100 Patrick Street Derry, Northern Ireland BT48 7EL Learning Pool Inc 2803 Philadelphia Pike Suite B #1023 Claymont Delaware 19703 United States Learning Pool Canada Inc 56A Mill St E Unit #247 Acton Ontario L7J 1H3 Find the perfect learning solutions for your team Take the next step towards smarter learning and discover the platform for yourself Contact sales UK: +44 207 101 9383 hello@learningpool.com Contact support UK: +44 345 074 4114 US: +1 844 238 5577 Canada: +1 833 430 2119 support@learningpool.com Request for proposal Solutions Onboarding Compliance Upskilling External Training Platform Learning Platform Adaptive Compliance Learning Record Store OnScreen Content Library Custom AI Conversations AI Coach AI Assess Resources Case Studies Blog Downloads Webinars Events Newsletter Product Roadmaps Podcast LXP vs LMS Company What we do What we believe Industry Recognition Leadership Careers ESG News © Learning Pool 2025 Privacy Policy Sitemap"
    },
    {
      "url": "https://oceanbreezewellbeing.com/",
      "text": "Ocean Breeze Wellbeing & Consultancy E-learning login Home About me Menopause Consultancy Menopause workshop and presentation Testimonials Blog Contact Oceanbreeze e-learning Welcome to Ocean Breeze Wellbeing & Consultancy My consultation and coaching is focused on helping leaders to build strong and high performing teams with a health and well being culture at the centre of their Business. Lets talk! Testimonial NetworkRail \"At Network Rail, we got in touch with Ali as we have a lot of managers who are male with female staff, we felt this would be a good opportunity to provide our male managers the chance to be able to support their female staff members when needed. At the beginning of the training our staff admitted they did not know much about the menopause, and were a little quite, after around 15 minutes all staff were engaging and were involved. By the end of the day all male staff members then felt they were equipped to help their female staff members when they start to go through the menopause process. The male staff went home and were speaking to their wives who they were also able to support as some were going through menopause. There was lots of positive talk for days after the training and we are also looking to get Ali back to deliver menopause training in other areas of the business.\" Group sessions Menopause workshops Raising awareness of why menopause is an important business issue and its effects on employees and their mental health. Understanding the risks of discrimination, case studies and workplace adjustments. Presentations, group sessions or 1:1 packages. Learn more! Let's talk! 1 to 1 Coaching Confidential leadership consultation Working 1:1 with business leaders in a confidential space where no work-related challenge or discussion is off the table.  Together we explore how you can improve your own performance, negotiate business challenges, and reach your potential. Learn more! Let's talk! My consultation and coaching is focused on helping leaders to build strong and high performing teams with a health and well being culture at the centre of their Business. I set up Ocean Breeze as I believe that leaders have responsibility to the people who work for them and that leadership development can bring about such positive outcomes to the people within an organisation. I have led successful teams and I have coached for most of my working life. I understand what it takes to create an engaged, healthy and high performing culture. Through this experience and with these insights I want to coach others to bring about changes that will have an impact on so many, build better more profitable businesses and make mental health and well being inclusion and conversation a normal part of working life. - Ali, Ocean Breeze Wellbeing Learn more about me → Testimonial Team Manager - Northants \"As someone who struggles to see their strengths and talk positively about themselves, having a job interview for a promotion to Team Leader, in which I had to talk about myself and those strengths was terrifying. Ali helped to make it possible , she not only helped me focus on the real objective at hand but she provided ways to answer tricky and challenging questions as well as how to keep my nerves at bay. She also provided insight into things that were potentially holding me back. Ali is one of the most encouraging people I have met. Her life experiences, coupled with what I know to be a true desire to see me succeed is what makes her fantastic at her job. Thank you Ali for your guidance, encouragement and support.\" Testimonial Secondary school - Worthing \" Ali provided a really informative session that allowed us to discuss the potential symptoms of the menopause without negativity or fearmongering. She was very open and shared her personal story which made it easier for the group to feel we could also talk openly about our own experiences and concerns. Together, we discussed what we would want to see in our organisation to create a culture of openness and honesty about the reproductive health of women. A really helpful and empowering meeting. \" Privacy Policy Contact © 2025 Ocean Breeze Wellbeing & Consultancy. Home About me Menopause Consultancy Menopause workshop and presentation Testimonials Blog Contact Lets talk! We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Enable All Save Settings"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://www.marriott.com/en-us/dining/restaurant-bar/phxgp-sheraton-phoenix-downtown/6085473-breeze-bar.mi",
      "text": "Breeze Bar in Phoenix | Marriott Bonvoy Skip to Content Open Menu Marriott Bonvoy Help English My Trips Sign In or Join Sign In or Join Sign In Join Sign In to your account Close Dialog Email or Member Number Email or Member Number Password Remember Me Sign In Forgot Password | Clear Remembered Account Activate online account Points SIGN IN Find & Reserve Back Find & Reserve Find a Hotel Book Meetings & Events Browse by Destination Lookup Reservation Worldwide Telephone Reservations Find a Private Home Rental Small & Midsize Business Program X Close Special Offers Back Special Offers Deals Gift Cards Opens a new window Shop Marriott Opens a new window Shop Sheraton Opens a new window Shop Westin Opens a new window Shop Courtyard Opens a new window Shop The Ritz-Carlton Opens a new window Shop EDITION Opens a new window Shop St. Regis Opens a new window Shop JW Marriott Opens a new window Shop W Hotels Opens a new window Exclusive getaways, member offers & more See All Savings Exclusive getaways, member offers & more X Close Vacations Back Vacations Explore Destinations Homes & Villas Opens a new window Residences Opens a new window The Marriott Vacation Clubs Opens a new window The Ritz-Carlton Yacht Collection Opens a new window Resorts All-Inclusive Vacations Opens a new window Hotel & Flight Packages Opens a new window Cars, Tours & Activities Opens a new window Travel Tips & Ideas Opens a new window Dine + Drink Golf Imagine Your Dream Vacation Get inspiration and plan your next getaway. Explore Vacations Imagine Your Dream Vacation Opens a new window X Close Our Brands Back Our Brands template Explore All Brands Opens a new window X Close Our Credit Cards About Marriott Bonvoy Back About Marriott Bonvoy Sign In Marriott Bonvoy Overview Member Benefits How to Earn Points How to Use Points/Certificates Buy Points Marriott Bonvoy Credit Card Marriott Bonvoy Moments Opens a new window Marriott Bonvoy Insiders Opens a new window Join Marriott Bonvoy Enjoy our lowest rates, all the time Free in-room Wi-Fi Mobile check-in and more Join Now Join Marriott Bonvoy Opens a new window X Close Meetings & Events Back Meetings & Events Meetings & Events Overview Business Meetings Weddings Social Events Group Travel Marriott Bonvoy Business® American Express® Card Book a Meeting or Event Innovative spaces. Inspired experiences. Personalized services. Book An Event Book a Meeting or Event X Close English X Close Dialog Close Dialog Close Dialog Please select your preferred language THE AMERICAS English Español Français Português ASIA and OCEANIA English Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt INTERNATIONAL English العربية EUROPE Dansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English Close Dialog 0 Points Buy Points Opens a new window Overview Activity My Trips Favorites Promotions Profile Member Benefits SIGN OUT Marriott Bonvoy™ Credit Cards Marriott Bonvoy™ Credit Cards ​​​​​​ RESTAURANTS + BARS Update Search Sorry, we can't find the page you requested You may have received this message because the page you requested is no longer available on the Marriott website. Our Company About Marriott International Careers Investor Relations News CEO Tony Capuano’s Blog Our Stories Digital Accessibility Work With Us Small & Midsize Business Program Travel Professionals Group Partners Hotel Development Affiliates Find Help Help & Contact Us Look Up Reservation Global Reservation Phone Numbers Best Rate Guarantee Missing Stay Form Site Map Privacy & Terms Privacy Center Your Privacy Choices Terms of Use Program Terms & Conditions Sustainability in the Supply Chain Top Destinations Top Destinations Las Vegas Hotels Miami Hotels Chicago Hotels Tokyo Hotels Orlando Hotels Key West Hotels London Hotels New York Hotels San Diego Hotels Boston Hotels Myrtle Beach Hotels Austin Hotels Nashville Hotels Denver Hotels Maui Hotels San Francisco Hotels New Orleans Hotels San Juan Hotels Seattle Hotels Santa Barbara Hotels Palm Springs Hotels Paris Hotels Rome Hotels Amsterdam Hotels Virginia Beach Hotels Ocean City Hotels Kauai Hotels View All Hotels Follow Marriott Bonvoy © 1996 - 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information English Select your language The Americas English Español Français Português Asia and Oceania English Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt International English العربية Europe Dansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English"
    }
  ]
}