{
  "fuentes": [
    {
      "url": "https://oceanlabbrewery.com/pages/contact-us",
      "email": "orders@oceanlabbrewery.com"
    },
    {
      "url": "https://business.stuartmartinchamber.org/list/member/ocean-republic-brewing-kitchen-12856",
      "email": "info@stuartmartinchamber.org"
    }
  ],
  "mails": [
    "info@stuartmartinchamber.org",
    "orders@oceanlabbrewery.com"
  ],
  "nombre_sitio": "oceanrepublicbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://oceanlabbrewery.com/pages/contact-us",
      "text": "Contact Us – Ocean Lab Brewing Co. Beers All Beers Core Beers Blonde Ale American Wheat Pale Ale IPA Sunset Amber SJU MayaWest Bottle MayaWest Can Stout HopDiver Ocean Baraka Fruit Beers BOB BOB Can Ruby Blue Mambo Mambo Can Specialty Beers All Specialty Beers NEW Discovery Raspberry Blonde Berliner Weisse Berliner Weisse Pinot Noir Barrel Aged Blonde Ale Pinot Noir Barrel Aged Brown Ale Pinot Noir Barrel Aged Brown Ale Whiskey Barrel Aged Discovery Pilsner Dragon Roll Deep Trip Discovery Saison Experimental Batch 22 Experimental Batch 20 Experimental Batch 19 Experimental Batch 18 Experimental Batch 17 Experimental Batch 16 Experimental Batch 15 Experimental Batch 14 Experimental Batch 13 Experimental Batch 10 Experimental Batch 09 Experimental Batch 08 Experimental Batch 07 Experimental Batch 06 Experimental Batch 05 Experimental Batch 04 Experimental Batch 03 Experimental Batch 02 Experimental Batch 01 Hurricaned Harvest Ale 2024 Sun Bay Lager Oktoberfest Marzen Pumpkin Lager 2024 Viva La Chela Mexican Lager Cans BOB Can Mambo Can MayaWest Can Hopdiver Can SJU Can Mambo Can Nano Kegs All Nano Kegs BOB Nano Keg Blonde Nano Keg IPA Nano Keg MayaWest Nano Keg Mambo Nano Keg SJU Nano Keg Premium Nano Keg Pump Barrel Aged Series Make Your Own Box Make Your Own 6-Pack Make Your Own 24-Box Gift Boxes Shop Apparel All Apparel Accessories Bottoms Headwear Jackets, Hoodies & Sweatshirts Shirts Rashguards & Sun Shirts Sunglasses Merch All Merch Gifts Under $25 Gifts Under $40 Bracelets Cigars and Accessories Coffee Accessories Games Gift Cards Lanyards Mobile Phone Stand Pens Pets Stickers Tin Tacker Signs All Merch Gear & Tech Drinkware All Drinkware 3 in 1 Cooler Pints Bottle Openers Champagne Tumblers Coasters Classic Tumblers Glassware Growlers Insulated Bottles Insulated Sleeves Insulators Mugs Shaker Tumblers Tropical Collection Tumblers Coolers, Bags & Luggage All Coolers, Bags & Luggage Coolers Bags Luggage Luggage Tags Bags & Luggage Tech Accessories Beer Cheese Jacinto - Manchego Cheese La Mancha - Manchego Cheese Restaurants Beachfront Menu San Patricio Menu Log in Search Contact 787-705-1421 hello@oceanlabbrewing.com Facebook Twitter Instagram YouTube Untappd Menu Search Cart Beers All Beers Core Beers Blonde Ale American Wheat Pale Ale IPA Sunset Amber SJU MayaWest Bottle MayaWest Can Stout HopDiver Ocean Baraka Fruit Beers BOB BOB Can Ruby Blue Mambo Mambo Can Specialty Beers All Specialty Beers NEW Discovery Raspberry Blonde Berliner Weisse Berliner Weisse Pinot Noir Barrel Aged Blonde Ale Pinot Noir Barrel Aged Brown Ale Pinot Noir Barrel Aged Brown Ale Whiskey Barrel Aged Discovery Pilsner Dragon Roll Deep Trip Discovery Saison Experimental Batch 22 Experimental Batch 20 Experimental Batch 19 Experimental Batch 18 Experimental Batch 17 Experimental Batch 16 Experimental Batch 15 Experimental Batch 14 Experimental Batch 13 Experimental Batch 10 Experimental Batch 09 Experimental Batch 08 Experimental Batch 07 Experimental Batch 06 Experimental Batch 05 Experimental Batch 04 Experimental Batch 03 Experimental Batch 02 Experimental Batch 01 Hurricaned Harvest Ale 2024 Sun Bay Lager Oktoberfest Marzen Pumpkin Lager 2024 Viva La Chela Mexican Lager Cans BOB Can Mambo Can MayaWest Can Hopdiver Can SJU Can Mambo Can Nano Kegs All Nano Kegs BOB Nano Keg Blonde Nano Keg IPA Nano Keg MayaWest Nano Keg Mambo Nano Keg SJU Nano Keg Premium Nano Keg Pump Barrel Aged Series Make Your Own Box Make Your Own 6-Pack Make Your Own 24-Box Gift Boxes Shop Apparel All Apparel Accessories Bottoms Headwear Jackets, Hoodies & Sweatshirts Shirts Rashguards & Sun Shirts Sunglasses Merch All Merch Gifts Under $25 Gifts Under $40 Bracelets Cigars and Accessories Coffee Accessories Games Gift Cards Lanyards Mobile Phone Stand Pens Pets Stickers Tin Tacker Signs All Merch Gear & Tech Drinkware All Drinkware 3 in 1 Cooler Pints Bottle Openers Champagne Tumblers Coasters Classic Tumblers Glassware Growlers Insulated Bottles Insulated Sleeves Insulators Mugs Shaker Tumblers Tropical Collection Tumblers Coolers, Bags & Luggage All Coolers, Bags & Luggage Coolers Bags Luggage Luggage Tags Bags & Luggage Tech Accessories Beer Cheese Jacinto - Manchego Cheese La Mancha - Manchego Cheese Restaurants Beachfront Menu San Patricio Menu Wholesale Log in Cart ( 0 ) Search Contact Us Contact Phone Number: 787-705-1421 Contact Email: orders@oceanlabbrewery.com Mailing Address: P.O. Box 360840, San Juan, Puerto Rico, U.S., 00936 Physical Address: 7000 Carr. 187 RR2, Carolina, Puerto Rico, U.S., 00979 Send us an email Name Email Phone Number Message Get Early Access To New Beers Sign up for to get early-access to new beers and exclusive discounts. Email Subscribe Shop Wholesale Beers Merch Company About Us Search Contact Us Terms and Conditions Refund and Returns Policy Privacy Policy Shipping Policy Contact hello@oceanlabbrewing.com 787-705-1421 P.O. Box 360840 San Juan Puerto Rico 00936 United States Facebook Twitter Instagram YouTube Untappd American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025, Ocean Lab Brewing Co. Close (esc) Popup Use this popup to embed a mailing list sign up form. Alternatively use it as a simple call to action with a link to a product or a page. Subscribe Age verification By clicking enter you are verifying that you are 18+ years old and can legally consume alcohol. Enter Leave Search Search Main menu Beers Make Your Own Box Gift Boxes Shop Restaurants Shopping Cart Your cart is currently empty. Shop now"
    },
    {
      "url": "https://business.stuartmartinchamber.org/list/member/ocean-republic-brewing-kitchen-12856",
      "text": "Ocean Republic Brewing & Kitchen | Restaurants and Nightlife | BREWERY/DISTILLERY | COCKTAILS/WINE/BEER  | LIVE ENTERTAINMENT | RESTAURANTS | RETAILERS Skip to content --°F Member Login Join Chamber The Chamber Close The Chamber Open The Chamber About Us President’s Report Membership Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship Vubiz Trains Events & News Close Events & News Open Events & News Upcoming Events Chamber Calendar Community Calendar Chamber Event Flyers Latest News Chamber & Member News Online Compass Florida Chamber News Legislative Updates Photo Galleries Breakfasts Luncheons Business After Hours Annual Expos Holiday Trade Show Installation of Officers LEADERship Ribbon Cuttings Golf Tournaments Special Events Business Close Business Open Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Close Tourism Open Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Close Relocation Open Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide The Digital Times Recreation Close Recreation Open Recreation Things to Do Boating Diving and Snorkeling Golf Courses Beaches and Parks Fish & Hunt Fishing Report Sailfish Tournaments Fishing Guide Ocean Republic Brewing & Kitchen Categories Restaurants and Nightlife BREWERY/DISTILLERY COCKTAILS/WINE/BEER LIVE ENTERTAINMENT RESTAURANTS RETAILERS 1630 S.E. Federal Highway Stuart FL 34994 (772) 600-5596 Send Email Visit My Company Hours: Open 7 days a week at 11:30 About Us Ocean Republic Brewing, located in the heart of Stuart, Florida, is a local favorite known for its craft beers brewed on site. In addition to its wide selection of house-made brews, the brewery also boasts a full liquor and wine bar. Ocean Republic offers a diverse kitchen menu, featuring everything from juicy burgers to signature beerzas (pizza) made with their flagship Flocal beer, mouthwatering tacos, and even poutine. Whether you're coming for the drinks or the food, there's something for everyone at Ocean Republic Brewing. The place is kids and pets friendly. Highlights Kitchen menu $8.00 - $22.00 Craft beer, burger, sandwiches, salad, flat breads, liquor, wine, happy hour Beers menu $6 - $7.50 Images Gallery Image 20230913_131511.jpg × Gallery Image received_1157846704861121.jpeg × Gallery Image FB_IMG_1683853926391.jpg × Gallery Image Messenger_creation_7baad073-ae1c-44d6-bc21-3b7608eecacf.jpeg × Gallery Image Screenshot_20240512_084136_OneDrive.jpg × Gallery Image Screenshot_20240730_095055_OneDrive.jpg × Gallery Image GP2A0011.JPG × Gallery Image Screenshot_20240819_211853_Maps.jpg × Gallery Image ORB(12of29).jpg × Gallery Image ORB(17of29).jpg × Gallery Image ORB(26of29).jpg × Gallery Image Screenshot_20231111_114933_OneDrive.jpg × Gallery Image 20240201_153927.jpg × Gallery Image received_3642326819412296.jpeg × Rep/Contact Info Mr. Alexandre Caron × Close Mr. Alexandre Caron Phone: (772) 600-5596 Send an Email Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel Connect with us 1650 S Kanner Highway Stuart, FL 34994 772-287-1088 x111 info@stuartmartinchamber.org Facebook-f Twitter Youtube Linkedin-in Chamber Info Join The Chamber Member Search Member Benefits President's Report Contact The Chamber Privacy Policy News & Events Online Compass Member News Chamber Calendar Community Calendar Non-Profit Events Health Resources Newsletter Enter your email, subscribe to our newsletter and stay informed! Subscription Form Newsletter First Name Last Name Subscribe © 2025 STUART/MARTIN COUNTY CHAMBER OF COMMERCE. ALL RIGHTS RESERVED. Member Login Join Chamber The Chamber About Us President’s Report Member Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship VUBIZ Trains Events & News Chamber Calendar Community Calendar Photo Gallery Member News Chamber Event Flyers Online Compass Florida Chamber News Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide Recreation Boating Fishing and Hunting Fishing Report Sailfish Tournaments Fishing Guide Diving and Snorkeling Golf Courses Beaches and Parks Facebook-f Twitter Youtube Linkedin-in Search"
    }
  ]
}