{
  "fuentes": [
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "communication@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "digital@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "info@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "info@montreuxjazzshop.com"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "n.oguey@mjaf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "partnership@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "planningvip@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "presse@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "programmation@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "restauration@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "staff@mjf.ch"
    },
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "email": "ticketinfo@mjf.ch"
    },
    {
      "url": "https://www.dcjazzfest.org/contact",
      "email": "info@dcjazzfest.org"
    },
    {
      "url": "https://ocean-team.com/",
      "email": "amm.ocean@ocean-team.com"
    },
    {
      "url": "https://www.mobafire.com/league-of-legends/wiki/buffs/ocean-soul",
      "email": "partnerships@mobafire.com"
    },
    {
      "url": "https://jazzfoundation.org/the-board/",
      "email": "info@jazzfoundation.org"
    },
    {
      "url": "https://www.oceans-network.eu/about/oceans-teams",
      "email": "info@oceans-network.eu"
    },
    {
      "url": "https://www.click2houston.com/news/local/2021/06/23/tsu-appoints-new-ocean-of-soul-band-director/",
      "email": "nsaavedra@kprc.com"
    },
    {
      "url": "https://www.tsu.edu/news/2021/06/tsu-taps-new-ocean-of-soul-band-director",
      "email": "web-accessibility@tsu.edu"
    },
    {
      "url": "https://colajazz.com/contact",
      "email": "contact@colajazz.com"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "email": "advertising@jazzoregon.org"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "email": "billing@jazzoregon.org"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "email": "calendar@jazzoregon.org"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "email": "editor@jazzoregon.org"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "email": "grants@jazzoregon.org"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "email": "info@jazzoregon.org"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "email": "sponsor@jazzoregon.org"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "email": "volunteer@jazzoregon.org"
    }
  ],
  "mails": [
    "advertising@jazzoregon.org",
    "amm.ocean@ocean-team.com",
    "billing@jazzoregon.org",
    "calendar@jazzoregon.org",
    "communication@mjf.ch",
    "contact@colajazz.com",
    "digital@mjf.ch",
    "editor@jazzoregon.org",
    "grants@jazzoregon.org",
    "info@dcjazzfest.org",
    "info@jazzfoundation.org",
    "info@jazzoregon.org",
    "info@mjf.ch",
    "info@montreuxjazzshop.com",
    "info@oceans-network.eu",
    "n.oguey@mjaf.ch",
    "nsaavedra@kprc.com",
    "partnership@mjf.ch",
    "partnerships@mobafire.com",
    "planningvip@mjf.ch",
    "presse@mjf.ch",
    "programmation@mjf.ch",
    "restauration@mjf.ch",
    "sponsor@jazzoregon.org",
    "staff@mjf.ch",
    "ticketinfo@mjf.ch",
    "volunteer@jazzoregon.org",
    "web-accessibility@tsu.edu"
  ],
  "nombre_sitio": "oceansofsoul.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.montreuxjazzfestival.com/en/festival/contact-us/",
      "text": "Contact us - Montreux Jazz Festival Skip to content FR EN DE July 3–18, 2026 Cart My account July 3–18, 2026 Festival NEWS Artists Foundation CAFÉ - CLUB - LOFT Boutique TICKETS & OFFERS Buy tickets Passes & Packages Group orders Gift Vouchers Ticketing Info PRACTICAL Transport & Accommodation Accessibility Sustainability Inclusion & Prevention Food & Beverages ABOUT US The Festival Map & Stages Timeline Concert Database Our Partners MORE Insider community MJF Spotlight FAQ Contact Become Staff Montreux Jazz Café Montreux Lausanne EPFL Geneva Airport Geneva Pont Rouge Lausanner EHL About Montreux Jazz Club Millennium – Crissier Montreux Jazz Loft Lausanne INTERNATIONAL FESTIVALS China Franschhoek Japan Miami Rio Follow the Festival Julius Baer Proud Global Partner of Montreux Jazz Festival More info INSIDER Join the Insider community and discover the Festival from the inside out. MORE INFOS Home FESTIVAL Contact us Contact us Due to the exceptional volume of messages, your message may take a little longer to reach us. Thank you for your patience!\n\n In the meantime, you can take a look at our FAQ – it may save you some time. CONTACT FORM First Name last Name e-mail address Message recipient Please choose a recipient General Information Artist Booking Montreux Jazz Artists Foundation F&B / Food stands Communication / Promotion Press Hospitality Sponsoring Staff / HR Ticketing Webmaster Montreux Jazz Shop Newsletter I would like to sign up to the Montreux Jazz Festival newsletter to receive all the latest news Terms and conditions I agree to the terms and conditions Submit Sending… Your request has been submited succesfully and you should hear from us very soon! OK Oops! Something went wrong, please try again. Close Fondation du Festival de Jazz de Montreux Avenue des Alpes 80b 1820 Montreux / Switzerland +41 21 966 44 44 Press STAFF Accessibility PARTNERS TEAM Stands MMV JOBS FAQ CONTACT Subscribe to our newsletter Global Partners Main Partners Terms & Conditions Privacy Policy Manage Cookies Follow the Festival Official Montreux Jazz Festival Website — 2025 © Fondation du Festival de Jazz de Montreux — All Rights Reserved Hosted by Handcrafted by"
    },
    {
      "url": "https://www.dcjazzfest.org/contact",
      "text": "Contact | DC Jazz Festival top of page DC JazzFest Major Programs DC JazzFest DCJF Education JazzDC Embassy Series Education Overview Artist in Residence DC JazzBops Jazzin' InSchool Jazzin’ AfterSchool DCJazzPrix Meet the Artist Organization History About Board of Directors DCJF Team 2024 Snapshot Snapshot Archive News Support Donate Corporate Support Thank You to our Donors Circle of Friends Matching Gift Program Volunteer 2025 DCJF Volunteer Waiver Contact Shop Donate Get in Touch To reach our administrative offices, send an email to info@dcjazzfest.org ​ If you have a question for us, please fill out the form below and a member of our team will get back in touch with you soon. Message Category: Get In Touch Volunteer Help with Tickets Sponsorship Join Our Mailing List Submit Thanks for submitting! We will be in touch with you soon. The DC Jazz Festival®, a 501(c)(3) non-profit service organization, and its programs are made possible, in part, with major grants from the Government of the District of Columbia, Muriel Bowser, Mayor; DC Commission on the Arts and Humanities; National Capital Arts and Cultural Affairs program of the U.S. Commission of Fine Arts; DC Office of Cable Television, Film, Music & Entertainment, the Office of the Deputy Mayor for Planning and Economic Development; and with awards from Mellon Foundation, Doris Duke Charitable Foundation, National Endowment for the Arts, Gillon Family Charitable Fund, Bloomberg Philanthropies, Galena-Yorktown Foundation, Morris and Gwendolyn Cafritz Foundation, Leonard and Elaine Silverstein Family Foundation, Henry J. Kaiser Family Foundation, Dallas Morse Coors Foundation for the Performing Arts, Max and Victoria Dreyfus Foundation, Mid Atlantic Arts, Venable Foundation, Ella Fitzgerald Foundation, and HumanitiesDC. ©2025 DC Jazz Festival. All rights reserved. DC JazzFest Hotline: 855-332-7767 Donate | Shop | Contact Support for the development of this website is provided in part by the Arts Forward Fund, a component fund of the Greater Washington Community Foundation. bottom of page"
    },
    {
      "url": "https://ocean-team.com/",
      "text": "Home - Ocean Team Home About Us Fleet Activities Companies Contact +39 040 305026 amm.ocean@ocean-team.com Home About Us Fleet Activities Companies Contact At the Service of the Sea Shipping, Harbour, Marine, Environment Companies activities arrow_downward fleet Fleet Currently operating 49 vessels and 10 barges and own a dedicated harbour facilities. The fleet operates under the Italy, Denmark, Germany, Kazakhstan flags. Through our subsidiaries in Slovenia and Montenegro we also operate vessels under Slovenia, Malta as well as Montenegro’s flag. Discover Activities Ocean operates on a global basis where serves three core marine business sectors: oil and gas – offshore harbours Discover Companies The Group incorporate a total of 18 companies and operates on a global basis. Ocean, and its affiliates companies are ISO 9001 certified. Headquarters location is in Trieste, Italy. Company’s strategic and operating branches located in Slovenia, Montenegro and Kazakhstan. Discover Ocean Team short profile The core business of the group is represented by the towage service in the Ports of Trieste , Monfalcone , Porto Nogaro , Koper (Slovenia) and Bar (Montenegro) carried out by its fleet of tugboats, equipped to face any kind of requirement. + 0 Persons 0 Seamen 0 Fleet + 0 Ships Harbour Towing Services Learn More News 28 August 2025 Innovation in environmental protection OCEAN SRL is thrilled to announce that on 28th August 2 Two cutting-edge marine drones,... Read more 6 March 2025 UZMAR Shipyard Delivers State-of-the-Art Escort Tug ‘TIGER’ to OCEAN S.R.L. OCEAN is proud to announce the successful delivery of NB-166 ‘TIGER’, a state-of-the-art RAstar 3200W... Read more 8 November 2024 OCEANTEAM’s fleet has broaden Ocean srl has launched a new cutting-edge tugboat “TIGER” at UZMAR Shipyard, where it has... Read more The Group incorporate a total of 16 companies and operates on a global basis. OCEAN S.R.L. UNIPERSONALE and its affiliates companies are ISO 9001 – 14001 and 45001 certified. Headquarters location is in Trieste, Italy. Quick Links Home About Us Fleet Activities Companies Contact Our activities Harbour Towing Services Sea Envinromental Services Naval Maintenance, Repair and Overhaul Bunkering service Flat Top barges and hold barges Collecting bilge waters, ballast water, slop and used oils Offshore services Bollard Pull test Insurance Broker Offshore service Caspian Sea Real Estates Salvage Shipping Agency Legal Privacy Policy Cookie Policy Legal notes Ethical code Adoption organizational model 231 Whistelblowing policy Corporate Sustainability Report Coming Onboard OCEAN SRL UNIPERSONALE a socio unico, capitale sociale € 4.000.000,00 i.v. - Sede legale Via Karl Ludwig Von Bruck 32 - 34144 - Trieste - cf/p.iva 00122510324, REA n. 72065 - Pec: ocean@legalmail.it This site only uses cookies that are strictly necessary for its operation. Ok Privacy policy"
    },
    {
      "url": "https://www.mobafire.com/league-of-legends/wiki/buffs/ocean-soul",
      "text": "Ocean Soul :: League of Legends Wiki :: MOBAFire MFN League of Legends Champion Guides Create Guides Champions TFT Tier Lists Community News Full Menu Champ Guide Member Forum Clear Free On Sale Strong Popular Join or Log In Join the leading League of Legends community. Create and share Champion Guides and Builds. Account Login Your Account Email Password Remember me Reset Password Create an MFN Account Your Desired Username Your Email Address Confirm Email Password Confirm Password I have read and agree to the user agreement . View our privacy policy. I want to subscribe to our newsletter. I want to receive promotions from our partners. Login Social Login Steam login has been removed. Please email support if you cannot access your account. Or Create Account Social Register WildRiftFire CounterStats RuneterraFire SmiteFire DOTAFire HeroesFire VaingloryFire FarmFriends ForzaFire LostArkFire Create Guides Create a New Guide Guide Tools Guide to Making a Guide BBCode Guide Responsive Columns Table Coding Rune Planner Make a Ward Map Guides & Builds All Guides & Builds Teamfight Tactics Guide Top Guides List Featured Guides Trending Guides Top Rated Guides Most Discussed Guides + Create a Guide Champs & Database Champions Champion Skins Items Abilities Runes Shards Summoner Spells MOBAFire Wiki Wiki Home Game Mechanics Wiki MOBAFire Wiki TeamFight Tactics TFT Set 15 TFT Home TFT Guide Tier Lists TFT Build Comps Tier List + Build a Team Comp Cheat Sheets TFT Items Cheat Sheet TFT Champions Cheat Sheet TFT Augments List TFT Power Ups List Tier Lists Tier Lists Community Tier List + Create a Tier List News Browse News Articles News Browse News Articles Community Community Center Discussion Forums Questions & Answers Community Content Member Blogs League Streamers Videos Social Channels Discord Twitter Facebook MFN WildRiftFire CounterStats RuneterraFire SmiteFire DOTAFire HeroesFire FarmFriends ForzaFire VaingloryFire LostArkFire Close X League of Legends Ocean Soul What is it? The Dragon Soul is a powerful team-wide neutral buff granted by the Dragon . It is available only on Summoner's Rift. If either team slays four elemental dragons, they will be granted the soul of the dominating element after the rift changes. The Ocean Soul is gained when the Ocean Dragon is dominating the rift. What does the Ocean Soul grant? - Dealing damage to enemies heals for 160 (+36% bonus attack damage) (+22.5% of ability power) (+9% bonus health) and restores 80 (+3.5% maximum mana) mana over 4 seconds. Damage to minions and monsters regenerates with 30% effectiveness. Sort: Date Popularity New Comment You need to log in before commenting. Loading Comments... Load More Comments Wiki Navigation Wiki Home Buffs Game Mechanics General Maps Minions MOBAFire Roles League of Legends Champions: Aatrox Ahri Akali Akshan Alistar Ambessa Amumu Anivia Annie Aphelios Ashe Aurelion Sol Aurora Azir Bard Bel'Veth Blitzcrank Brand Braum Briar Caitlyn Camille Cassiopeia Cho'Gath Corki Darius Diana Dr. Mundo Draven Ekko Elise Evelynn Ezreal Fiddlesticks Fiora Fizz Galio Gangplank Garen Gnar Gragas Graves Gwen Hecarim Heimerdinger Hwei Illaoi Irelia Ivern Janna Jarvan IV Jax Jayce Jhin Jinx K'Sante Kai'Sa Kalista Karma Karthus Kassadin Katarina Kayle Kayn Kennen Kha'Zix Kindred Kled Kog'Maw LeBlanc Lee Sin Leona Lillia Lissandra Lucian Lulu Lux Malphite Malzahar Maokai Master Yi Mel Milio Miss Fortune Mordekaiser Morgana Naafiri Nami Nasus Nautilus Neeko Nidalee Nilah Nocturne Nunu & Willump Olaf Orianna Ornn Pantheon Poppy Pyke Qiyana Quinn Rakan Rammus Rek'Sai Rell Renata Glasc Renekton Rengar Riven Rumble Ryze Samira Sejuani Senna Seraphine Sett Shaco Shen Shyvana Singed Sion Sivir Skarner Smolder Sona Soraka Swain Sylas Syndra Tahm Kench Taliyah Talon Taric Teemo Thresh Tristana Trundle Tryndamere Twisted Fate Twitch Udyr Urgot Varus Vayne Veigar Vel'Koz Vex Vi Viego Viktor Vladimir Volibear Warwick Wukong Xayah Xerath Xin Zhao Yasuo Yone Yorick Yunara Yuumi Zac Zed Zeri Ziggs Zilean Zoe Zyra Teamfight Tactics Guide M.O.B.A. Network MOBAFire League of Graphs Porofessor Counterstats WildriftFire RuneterraFire SmiteFire DOTAFire Valofessor Resetera FarmFriends ForzaFire HeroesFire LostarkFire VaingloryFire MTG Salvation Minecraft Forum WoWDB MMO-Champion mmorpg.com Bluetracker HearthPwn Diablo Fans Overframe #MOBAFire User Agreement Privacy Policy Advertising Job Openings Partnerships Support"
    },
    {
      "url": "https://jazzfoundation.org/the-board/",
      "text": "The Board - Jazz Foundation of America Contact 247 West 37 Street, Suite 201 · New York, NY 10018 212.245.3999 info@jazzfoundation.org SHOP COVID-19 Fund Main Stage About Artist Stories The Cause The Jazz Foundation Story Our Team The Board What We Do Musicians’ Emergency Fund Housing & Emergency Assistance Pro Bono Medical Disaster Relief Creating Employment Jazz & Blues in the Schools The Gig Fund Jazz & Blues in Nursing Homes Lessons From The Legends Partnerships & Projects Jazz Legacies Fellowship 1000 Watts The Last Note Events Events Calendar Annual Events A Great Night in Harlem The Loft Party Monday Night Jam Musicians For Hire News Get Help Donate The Board The Board Board of Directors Jarrett Lilien Chairman READ BIO Jarrett Lilien Jarrett Lilien is President & COO at WisdomTree Investments, Inc. He is also the Founder and Managing Partner of Bendigo Partners. Jarrett has enjoyed a long career in financial services, running both retail and institutional businesses. He has lived and worked in Tokyo, Hong Kong, London and New York. Jarrett was co-founder and CEO of TIR Securities, a global institutional stock broker, which was subsequently sold to E*TRADE Financial. At E*TRADE, he served as President and Chief Operating Officer and was responsible for building the premier online financial services franchise. Jarrett is currently Chairman of the Board of The Barton Group and Board Treasurer of The Baryshnikov Arts Center. Dr. Daveed D. Frazier President READ BIO Dr. Daveed Frazier Daveed D. Frazier is a board certified orthopedic surgeon with advanced training in spinal surgery and correction of spinal deformities. An assistant clinical professor of orthopedic surgery at Columbia University College of Physicians and Surgeons, Dr. Frazier is also a respected lecturer, accomplished researcher, and published author on spine disorders and treatment. Dr. Frazier graduated cum laude from Harvard Medical School and joined the institution’s long history of distinguished speakers when selected to address his 1990 graduating class. He went on to complete a combined surgical internship at the New England Deaconess Hospital and an orthopedic residency at Massachusetts General Hospital. In addition, Dr. Frazier serves as assistant clinical professor of orthopedic surgery at Columbia University, College of Physicians and Surgeons, and adjunct assistant clinical professor of orthopedic surgery at the SUNY Downstate Medical Center in Brooklyn. In recognition of his many accomplishments and prevention-focused approach to patient care, Dr. Frazier was twice named New York Super Doctor by the New York Times Magazine. More recently, he was featured on the cover of The Network Journal. His humanitarian efforts include service on the board of directors for FilmAid International—a charitable organization offering assistance to displaced persons worldwide through the power of film. Michael Devins Treasurer READ BIO Michael Devins MICHAEL DEVINS is partner in Sidley’s Insurance practice in New York. His practice focuses primarily on corporate transactions in the insurance industry, including the acquisition, divestiture, and merger of insurance and reinsurance businesses, as well as reinsurance and renewal of rights transactions, redomestications and company formations. In addition to transactional matters, Michael represents insurance and reinsurance companies in connection with regulatory matters. He has significant experience representing private equity and other non-traditional purchasers and sellers of insurance companies and insurance-related assets. Michael has been recognized by several industry publications, including IFLR1000 (2020-2021) where he is listed as a Notable Practitioner and The Legal 500 US (2012) which notes that Michael “has an encyclopedia-like understanding of the insurance M&A landscape and the legal framework for getting deals done.” Prior to joining Sidley, Michael was counsel at another global law firm in its M&A and Insurance Industry groups. Prior to law school, Michael served as a policy advisor to the premier of the Canadian province of Manitoba. He is a frequent writer and speaker on insurance industry and M&A topics. Michael serves on the Board of Directors and as finance and operations chair of the Jazz Foundation of America. Steve Jordan & Megan Voss Artistic Directors READ BIO Steve Jordan Steve Jordan has helped expand the vocabulary of modern music, not only as a drummer, but also as a composer, multi-instrumentalist, and producer. In 2021, Jordan replaced Rolling Stones drummer Charlie Watts on the Stones’ 13-date U.S. tour. Following Watts’ death, he continues to play with the Stones both live and in the studio. He has recorded with the Rolling Stones, Bruce Springsteen, Eric Clapton, Neil Young, Bob Dylan, Steve Wonder, B.B. King, Sonny Rollins, Sheryl Crow, Beyoncé, Alicia Keys, Aretha Franklin, Bruno Mars, Mark Ronson, the Pretenders, Stevie Nicks, Norah Jones, James Taylor, Diana Krall, Sting, Billy Joel, Don Henley, Herbie Hancock, Chick Corea, and the original Saturday Night Live Band, and he was a founding member of the World’s Most Dangerous Band for Late Night With David Letterman. As a Grammy-winning producer and Emmy-winning musical director, Jordan has made albums for Keith Richards and the X-Pensive Winos, John Mayer (which includes winning Pop Vocal Album of the Year for Continuum), John Mayer Trio, Robert Cray, Jon Spencer Blues Explosion, Los Lonely Boys, John Scofield, Buddy Guy, Booker T., Solomon Burke, Boz Scaggs, Hubert Sumlin, Tom Jones, Patty Scialfa, and Beyoncé. His most satisfying work is the collaboration with Meegan Voss and their band, the Verbs. He received an Emmy for his musical direction in Movies Rock in addition to working on Fashion Rocks, several Kennedy Center Honors and the 2004 Democratic Convention. He has worked as musical director/producer on films Lightning in a Bottle and Cadillac Records, and consulted on Standing in the Shadows of Motown. Jordan is currently producing Solid Soul, a documentary on the musical legacy of record producer Willie Mitchell. Steve and Meegan Voss are the founders of the independent recording company Jay-Vee Records, home to the Grammy-nominated album by Robert Cray & Hi Rhythm and their band, the Verbs. They are also the Co-Artistic Directors of the Jazz Foundation of America. In recent years, Steve has produced Keith Richards’ album Crosseyed Heart and John Mayer’s The Search for Everything, and is working on the Verbs’ new LP Garage Sale and new albums by Sheryl Crow, Josh Groban and Bettye LaVette. Additional production credits include Rod Stewart’s Soulbook, John Mayer’s Battle Studies, the Verbs’ Trip and Cover Story, Boz Scaggs’ Memphis and A Fool to Care, Robert Cray’s Hi Rhythm as well as Cray’s In My Soul and his live project 4 Nights of 40 Years Live. Jordan was musical director for the 61st, 62nd, 64th, 66th, 67th, and 68th Annual Primetime Emmy Awards, as well as musical director for the 2010 FIFA World Cup and the Michael J. Fox Foundation for Parkinson’s Research Annual Gala, in addition to touring with Eric Clapton. Abigail Scheuer READ BIO Abigail (Abby) Scheuer Abigail (Abby) Scheuer joined the Jazz Foundation of America board in 2012 and joined JFA’s Advisory board in 2009. She is also a member of the Board of Directors of The Center for Arts Education and KiDS of NYU Langone Health, a Trustee of The Bronx Museum of the Arts and The Southern California Institute of Architecture (SCI-Arc), and a member of the Board of Advocates for Human Rights First and the Natural Resources Defense Council. She has a BA from Middlebury College and a Master of Architecture from The Southern California Institute of Architecture. B. Bonin Bough READ BIO Bonin Bough Bonin Bough is one of the foremost-awarded marketing executives in his field, the producer and host of The Cleveland Hustles, and the author of TXT Me (646) 759-1837. Throughout his illustrious career as one of the youngest C-suite executives in a Fortune 50 company, Bonin has spearheaded some of the industry’s largest global marketing campaigns across digital, mobile, television, print, and experiential, including the premier of the first ever 3D printed food product, the customizable, real-time 3D printed Oreo at SXSW. Bonin’s prominence as a transformative activator has helped reinvigorate traditional marketing by combining innovative tech via breakthrough brand campaigns including Oreo, Honey Maid, Pepsi, Gatorade, and countless other billion dollar brands. He is seen as one of the top mobile marketers in the world, having been named Mobile Marketer of the Year by the MMA. In 2013, he was inducted into the American Advertising Federation’s Advertising Hall of Achievement and has been listed in Fortune Magazine’s 40 under 40, Fast Company’s 100 Most Creative People in Business, The Adweek 50 and PRWeek Power List. Ben Giordano READ BIO Ben Giordano Ben Giordano is president and owner of Media Syndication Global, a direct mail and advertising firm based in New York. Before founding Media Syndication in 1982, he held the titles of Director and of Vice President at Doubleday and at CBS. Bill Wurtzel READ BIO Bill Wurtzel Bill Wurtzel is an accomplished jazz guitarist and has been a member of the Jazz Foundation Board of Directors since 1989. The musicians he has played with include Wild Bill Davis, Bill Doggett, Count Basie alumni “The Countsmen”, Jimmy McGriff, and Harlem Blues & Jazz Band. Prior to taking on music full-time he began his career as a creative director in advertising. In addition to designing the JFA logo, Bill and his daughter Nina have created many JFA promotional materials. Casey Lipscomb READ BIO Casey Lipscomb Casey Lipscomb is the General Counsel and Secretary of MIO Partners, Inc. and an Associate General Counsel for McKinsey and Company, Inc. Prior to joining MIO and McKinsey, Mr. Lipscomb was an Associate at Sidley Austin Brown & Wood LLP from 1998 to 2004. Mr. Lipscomb holds a Bachelor of Arts degree in Government from Dartmouth College and a Juris Doctorate from Columbia University School of Law. Casey Patterson READ BIO Casey Patterson Casey Patterson is a four-time Emmy® and two-time PGA Awards-nominated, critically acclaimed executive producer who has created an array of groundbreaking programming during her 20-year tenure at Viacom. Casey Patterson Entertainment is a full-service production company producing premium content, live events, and talent-driven series and specials with offices in New York City and Los Angeles. Patterson’s current projects include the breakout hit-series Lip Sync Battle, the highest-rated series in Spike history (now Paramount Network), and Nickelodeon’s Lip Sync Battle Shorties. Additional credits include such high profile events as Lip Sync Battle LIVE: A Michael Jackson Celebration, Netflix’s A Very Murray Christmas, Spike’s One Night Only: Alec Baldwin, Rock the Troops with Dwayne Johnson’s Seven Bucks Productions, The Comedy Awards on Comedy Central, Taraji’s White Hot Holidays, MTV Movie & TV Awards, Guys Choice, The Concert for New York City, The Concert of the Century at the White House, Saturday Night Live 25th Anniversary Special, Between Two Ferns – A Fairy Tale of New York, SCREAM Awards, VH1’s Vogue Fashion Awards, VH1’s Divas Live, and NBC’s Concert for America. Dakota Pippins READ BIO Dakota Pippins Dakota Pippins is CEO & President of Pippins Strategies Group LLC. Pippins Strategies Group focuses primarily on creation of sustainability management strategies for companies and development of urban green infrastructure. Dakota Pippins teaches Sustainable Development Management and Marketing at New York University and consults/lectures extensively. He maintains that successful marketers in the 21st century must connect their brands to strongly held human family values that promote the triple bottom line: People, Planet, Profit. Dakota also serves as a member of the Board of Directors at Hormel Foods Corporation, former chair of the Corporate Governance Committee, Adjunct Associate Professor at New York University where he formerly served as Director of NYU’s Management Institute. He recently completed his 20th year of service. Danny Glover READ BIO Danny Glover Danny Glover has been a commanding presence on screen, stage and television for more than 25 years. His film credits range from the blockbuster “Lethal Weapon” franchise to the cult classic “Saw” to smaller independent features. The first “Lethal Weapon” film earned him an NAACP Image Award for Outstanding Lead Actor. Mr. Glover has also invested his talents in more personal projects, including the award-winning “To Sleep With Anger,” which he executive produced and for which he won an Independent Spirit Award for Best Actor. In 2005, Glover and his producing partner Joslyn Barnes co-founded Louverture Films, which is dedicated to the development and production of films of historical relevance, social purpose, commercial value and artistic integrity. The company’s credits include the Oscar® nominated documentary TROUBLE THE WATER, the music documentaries AFRICA UNITE, and the Oscar® shortlisted SOUNDTRACK FOR A REVOLUTION. Mr. Glover currently serves as a UNICEF Ambassador and has received numerous prestigious honors including the 2002 Marian Anderson Award, the 2003 NAACP Chairman’s Award, the 2004 BET Lifetime Achievement Award and the 2009 CBCF Phoenix Award. He is also Chairman of the Board of TransAfrica Forum, a non-profit global justice organization. Dr. Frank Forte READ BIO Dr. Franke Forte Dr. Frank Forte is Director of Medicine for the Bloodless Medicine and Surgery Program at Englewood Hospital as well as serving as Director of the Jazz Musicians Medical Volunteers. Dr. Forte received his medical degree with honors from Albert Einstein College of Medicine. In addition to being an avid jazz guitarist, Dr. Forte writes for Just Jazz Guitar magazine and is the recipient of the Commerce and Industry Association of New Jersey (CIANJ)’s Champion of Good Works Award in recognition for his work with The Jazz Foundation. Geoffrey D. Menin READ BIO Geoffrey D. Menin Geoffrey D. Menin graduated from Yale College (B.A. summa cum laude, 1974) and Harvard Law School (J.D. 1977). A founding partner of Levine Plotkin & Menin, LLP, Mr. Menin has, for over thirty years, represented individual artists and entrepreneurs in film, television, music, fashion and new media, as well as high profile executives in their employment matters across a broad range of industries. An accomplished composer and performer in the rock, jazz and classical genres, Mr. Menin brings to his law practice the ability to understand the creative artist and to guide the development of the artist’s professional activities. Mr. Menin has performed with the likes of Buddy Miles, Stanley Jordan, Odetta, Charlie Daniels and Keith Richards. His original compositions range from a classical song cycle based upon the poetry of Rainer Maria Rilke for tenor (voice) and piano to the celebrated “Hymn for Her,” composed for Jennifer Muller’s Mullerworks Dance Company and recorded by Mr. Menin with Paul Winter and Eugene Friesen. Lee S. Richards III READ BIO Lee S. Richards III Lee S. Richards III is experienced in trial work and securities; regulatory, banking, white-collar criminal and commercial litigation; and internal investigations. He received his B.A., summa cum laude, from Amherst College in 1972, where he was a member of Phi Beta Kappa, and his J.D. from Columbia University School of Law in 1975, where he was a Harlan Fiske Stone Scholar and a Parkhurst Fellow. Mr. Richards was a law clerk to the Honorable Milton Pollack, United States District Judge for the Southern District of New York, from 1975 to 1976. From 1977 to 1983, he was an Assistant United States Attorney for the Southern District of New York. Mr. Richards is a former Adjunct Assistant Professor at Fordham Law School, Chairman of the American Bar Association’s Subcommittee on Criminal Aspects of the Securities Laws, President Emeritus of the Federal Bar Council Inn of Court, a member of the Federal Bar Council Board of Directors, and a member of the Board of Trustees of the American Inns of Court. Marc Roth READ BIO Marc Roth Marc Roth is a New York City restaurateur and has been involved with the Jazz Foundation for over 7 years. Marc began donating and catering Jazz Foundation events which included musician memorials, performer greenrooms and our famed Loft and Apollo parties. He has provided employment for these musicians with a place to play and has learned how under-appreciated and underexposed some of them are. In past years, Marc sponsored the first live webcast from the Apollo to help increase donations during the event. He has traveled to NOLA and Chicago to help struggling musicians get back on their feet by bringing them food, finding them a place to stay, or supplying them with some money to take care of basic needs. Marlisa Vinciguerra READ BIO Marlisa Vinciguerra Marlisa Vinciguerra is a retired financial markets executive. She is a graduate of Cornell University (BS 1986) and the Yale Law School (JD 1989), where she was a senior editor of the Yale Law Journal. Her note, “The Aftermath of Meritor: A Search for Standards in the Law of Sexual Harassment” has been cited in federal court cases. Following law school, she was an Associate at Cadwalader. She joined Lehman Brothers in 1993, where she held a variety of positions, the last of which was Managing Director and Counsel for Equities Global. At Lehman, she was member of the Management and Executive Committees for Legal, Compliance and Audit and the Management Committee of Equities. She later worked at Barclays Capital as a Managing Director and Scout Trading in several executive capacities. Michael Novogratz READ BIO Michael Novogratz Michael E. Novogratz is the CEO of Galaxy Investment Partners and a former Principal of Fortress Investment Group LLC. Mr. Novogratz joined Fortress in 2002 after spending 11 years at Goldman Sachs, where he was elected partner in 1998. Mr. Novogratz serves as a member of the New York Federal Reserve’s Investment Advisory Committee on Financial Markets. Mr. Novogratz founded and serves as the Chairman of Board for Beat the Streets, a non-profit organization which builds wrestling programs in New York City public schools and is also the Honorary Chairman of USA Wrestling Foundation. Mr. Novogratz is Chairman of The Friends of the Hudson River Park. He also serves on the Board of the Acumen Fund, NYU Langone Medical Center and the Princeton Varsity Club. Mr. Novogratz received an AB from Princeton University in Economics, and served as a helicopter pilot in the US Army. In 2011, the Jazz Foundation gave Michael Novogratz our highest honor, the Dr. Billy Taylor Humanitarian Award. He has become a hero to the JFA and to the thousands of musicians and family members. Michael Pietrowicz READ BIO Michael D. Pietrowicz Michael D. Pietrowicz, 53, of Parsippany, NJ, was appointed Chief Strategy Office and Senior Vice President for Planning and Program Development of Englewood Hospital and Medical Center in 2014. Prior to this appointment, he served as Vice President for Planning and Program Development (2004 – 2014), Vice President for Physician Network Operations (1998–2002) and Vice President for Operations (1992-1998). He has held executive positions in healthcare for more than 30 years. Prior to joining Englewood Hospital and Medical Center in 1992, he served as Vice President for Hospital and Generals Support Services at the Philadelphia Geriatric Center in Philadelphia. During his three-year absence from the Medical Center 2002 –2004, Mr. Pietrowicz was Vice President and Site Administrator for Beth Israel North Medical Center in New York City. Mr. Pietrowicz is an active volunteer and board member in a variety of organizations including Chair – Visiting Nurse Association of Englewood; Vice Chair – Englewood Economic Development Committee; Parsippany Board of Education; President – Parsippany Little Viking Football Organization and Council Member for the Parsippany Parks and Recreation Commission. He is currently an active member of the New Jersey Hospital Association, the American College of Healthcare Executives and the Medical Group Management Association. Mr. Pietrowicz earned a dual BS degree in Biology and Business Administration from Albright College in 1985 and received an MBA in Healthcare Administration from Temple University in 1987. Dr. Nimesh Nagarsheth READ BIO Dr. Nimesh Nagarsheth Dr. Nagarsheth serves as the Chief Medical Advisor at the Jazz Foundation of America and is Director of Gynecologic Oncology, Director of Robotic Surgery and Director of the Dizzy Gillespie Institute at Englewood Health. Dr. Nagarsheth also holds an appointment as clinical professor of gynecologic oncology at the Icahn School of Medicine at Mount Sinai. He received his medical degree from Mount Sinai School of Medicine and completed his obstetrics and gynecology residency at Duke University Medical Center. He completed his gynecologic oncology fellowship at Mount Sinai Medical Center and his gynecologic oncology research thesis at NYU Langone Medical Center. He has consistently been named a top doctor in New York and New Jersey and is co-author on numerous research papers as well as author of the book Music and Cancer: A Prescription for Healing . An accomplished musician, Dr. Nagarsheth is the drummer and percussionist for No Evidence of Disease (N.E.D.) and is a subject in the critically-acclaimed documentary film No Evidence of Disease . Peter Low READ BIO Peter Low Peter Low, Ensequence’s president and chief executive officer, has an extensive background in television spanning more than 25 years, with expertise in programming and distribution. Before joining Ensequence, Low was executive vice president of cable distribution and marketing for MTV Networks and BET Networks, where he led cable distribution efforts for all 26 of the MTV and BET branded channels. In addition, Low was responsible for negotiating all large distribution agreements and developed the strategy that resulted in the most extensive digital channel launch in the industry. Prior to his position with MTV and BET, Low served as vice president of programming for CableVision. Low currently serves on the board of Cable Positive and the Jazz Foundation of America Robert Opatrny READ BIO Robert B. Opatrny Robert B. Opatrny, a graduate of Yale University and NYU Law School, practices law primarily in the fields of music and media. At the beginning of his career he worked at two major Wall Street firms practicing corporate law, and then established his own practice in 1994. From 2000 until 2007 he acted as Secretary and General Counsel of Pump Audio, Inc., an international independent music licensing company. Getty Images acquired Pump Audio in 2007. Mr. Opatrny serves as General Counsel to WhoSay Inc., an internet and mobile promotion company serving public figures. Stephen B. Siegel READ BIO Stephen B. Siegel Stephen B. Siegel, Chairman of Global Brokerage at CB Richard Ellis, is widely regarded in commercial real estate circles as one of the industry’s most talented and prolific professionals. He was involved with CBRE amassing over $224.6 billion in global sales and leasing transactions in 2006, nearly three times that of its nearest competitor. As Insignia-ESG’s chairman and CEO preceding its merger with CBRE, Siegel masterminded the firm’s growth nationwide and in Europe, Latin America and Asia. He also managed a group that co-invested approximately $2 billion in U.S. office, residential, hotel and retail real estate portfolios. In 2003, Crain’s New York Business named him “One of the 100 Most Influential Business Leaders in New York City.” Mr. Siegel is recognized as much for his generosity and contributions to the quality of life in New York as he is for his dedication to the business community and economic vitality of the City. Specific awards include the American Jewish Committee’s 2007 Real Estate Division National Human Relations Award; Israel Bonds’ Real Estate and Construction Division’s 2007 Israel Peace Medal for his leadership in building Israel’s economy through the Israel Bonds program; The Crohn’s & Colitis Foundation “Man of the Year” Award and many others. Alli McCartney READ BIO Alli McCartney Alli McCartney is a Managing Director with UBS Private Wealth Management in New York City. She has over 25 years of experience in the financial services industry working with families, endowments and foundations to streamline their financial, investment, trust and estate and philanthropic planning. Alli specializes in executive compensation working with founders and C-suite executives around complex liquidity situations. She is known by the moniker “Financial Feminist” for her passionate work around women and money and the imperative of women having a financial seat at all tables. She is a regular on CNBC and Fox Business, is frequently published and is a sought-after speaker at industry conferences given her unique ability to make finance and macro-economics accessible. Alli lives between Soho in NYC, Montauk, NY, and Los Angeles, CA with her two boys, is bi-lingual (Spanish) and spends her time obsessively following live music and supporting the Jazz Foundation of America, Vital Voices and Girl Rising. HONORARY FOUNDERS BOARD HONORARY FOUNDERS BOARD Wendy Oxenhorn READ BIO Wendy Oxenhorn Wendy Oxenhorn is the former Vice Chairman of the Jazz Foundation of America (JFA), which is committed to “providing jazz and blues musicians with financial, medical, housing, and legal assistance as well as performance opportunities, with a special focus on the elderly and veterans who have paid their dues and find themselves in crisis due to illness, age and/or circumstance.” At age 10, Oxenhorn attended the School of American Ballet and danced with New York City Ballet. At 17, she suffered a career-ending knee injury that catapulted her into depression, leading to her calling a suicide hotline. She ended up consoling the counselor on the line, who herself was depressed. Oxenhorn began working at the suicide hotline three days later, prompting her to make helping others her professional focus. In 1989, she co-founded Street News, a publication that provided employment and income for homeless individuals in New York City and that inspired more than 150 similar papers in major cities around the world. In 1994, she launched Children of Substance, a public school program that created support groups for female middle school students with drug-addicted parents. Six years later, she moved on to become Executive Director of JFA, which was founded in 1989 by Billy Taylor, Herb Storfer, Ann Ruckert and Phoebe Jacobs, originally with a local focus on New York City. By 2005, due to the work of Oxenhorn, the foundation expanded to nationwide operations with a full-time staff. Her efforts enabled the JFA to increase the organization’s capacity to provide emergency assistance from 35 to more than 8,000 cases annually. In 2005, the JFA participated in Hurricane Katrina relief on multiple levels: finding new housing; creating employment opportunities for more than 1,000 displaced New Orleans musicians and their children; and acquiring new musical instruments to replace those lost in the flood waters. In late 2005, Oxenhorn created the Agnes Varis Jazz in the Schools Program. The program’s goals are to create dignified work opportunities for ill as well as unemployed and underemployed musicians of retirement age, and introduce the music to new audiences. This program has enabled hundreds of musicians to participate in blues and jazz performances every year. Prior to the pandemic, it reached 80,000 listeners of all ages across approximately 15 states annually. Oxenhorn was honored for her humanitarian efforts on behalf of jazz and blues musicians at the 2004 Grammy Lunch by the Artist Empowerment Coalition (AEC), a nonprofit collective of artists, musicians and performers. She was also honored by SESAC, WBGO FM radio, the Jazz Journalists Association and HBO. In 2015, Jazz at Lincoln Center honored her with the Ashley Schiff Ramos Community Development in Jazz Award. Oxenhorn is the recipient of the 2016 A.B. Spellman NEA Jazz Masters Fellowship for Jazz Advocacy. She also serves on the board of directors of the Montreux Jazz Festival in Switzerland and is a blues harmonica player. Wendy Oxenhorn created a Utopian template that runs on the Power of Love and takes on 8,000 emergency cases a year. Her heart, her soul and her philosophy of giving have inspired over $70 million in funding during her time at JFA. Wendy became JFA’s Vice Chairman 2018. In 2020, she stepped off the bandstand, leaving the organization in the strong hands of the JFA team who have since helped thousands of musicians, getting them through the pandemic and continuing to tirelessly solve life-and-death emergencies every day. In 2022, Wendy went to Ukraine in the midst of the war, delivering food to children in orphanages and medical supplies to hospitals and civilian soldiers. While there, she located over 100 Ukrainian jazz musicians and connected them to JFA, which funded gigs and provided food and lifesaving supplies to their families, helping to keep the music alive during the war. Hank O’Neal READ BIO Hank O’Neal During a forty-year career in music, Hank O’Neal formed two record companies (Chiaroscuro Records and Hammond Music Enterprises); built two recording studios (WARP and Downtown Sound); produced over 200 jazz LPs/CDs and, in conjunction with his business partner Shelley M. Shier and their production company HOSS, Inc., produced over 100 music festivals (The Floating Jazz Festival, The Blues Cruise, Mardi Gras At Sea, Big Bands At Sea and others from 1983-2002); published a number of books and articles on jazz; photographed most of the giants of jazz from the second half of the 20th Century; exhibited these photographs regularly; and served on the boards of various non-profit organizations that serve the jazz community, including the Jazz and Contemporary Music Program of The New School (1985 to present), the Jazz Foundation of America (1993 to present), The Jazz Gallery (1995 to present), and the National Jazz Museum In Harlem. Jimmy Owens READ BIO Jimmy Owens Jimmy Owens is a trumpet and flugelhorn player, composer, arranger, educator, and music consultant. He possesses a Masters Degree in Education from the University of Massachusetts. Since 1969, his group Jimmy Owens Plus has performed concerts, taught, and lectured at all levels from elementary school through college. An active member of various boards and panels, he has served on the National Endowment for the Arts (NEA), the American Arts Alliance, the International Association of Jazz Educators (IAJE), and the faculties of the State University of New York and The New School. Sandy Jordan READ BIO Sandy Jordan Sandy Jordan is a professional graphics artist and has worked a lengthy stint as Executive Art Director for the Bill Lutz Group. She is the widow of one of the U.S.’s greatest jazz artists, Clifford Jordan, and has been an integral part of the jazz community for many years. She is a member of the National Academy for Recording Artists (NARAS). ADVISORY BOARD Dr. Jennifer Adams Robbin Ahrold Christian Alexander Arthur H. Barnes Joslyn Barnes Glen Barros Ron Carter Judy Chambers Chevy Chase Brandon Conley Elvis Costello Archibald Cox, Jr. Davell Crawford Susan Cronin Ron Delsener Jim Eigo Lois Gilbert Marius Andre Holzer Michael & Victoria Imperioli Marc Henry Johnson Phyllis Lubarsky Howard Mandel Bobbi Marcus Wynton Marsalis Jill Newman Jacques Nordeman James Polsky Fran Richard Cedric Rose Steve Shapiro Arnold J. Smith Lew Tabackin Ron Weisner support our mission Your donations help us reach more musicians and their families in times of crisis. Donate Now 247 W 37th Street, Suite 201 • info@jazzfoundation.org • Privacy Policy/SiteCredits • Website by RocketBike 247 W 37th Street, Suite 201 • info@jazzfoundation.org • Privacy Policy/SiteCredits • Website by RocketBike SHOP COVID-19 Fund Main Stage About Artist Stories The Cause The Jazz Foundation Story Our Team The Board What We Do Musicians’ Emergency Fund Housing & Emergency Assistance Pro Bono Medical Disaster Relief Creating Employment Jazz & Blues in the Schools The Gig Fund Jazz & Blues in Nursing Homes Lessons From The Legends Partnerships & Projects Jazz Legacies Fellowship 1000 Watts The Last Note Events Events Calendar Annual Events A Great Night in Harlem The Loft Party Monday Night Jam Musicians For Hire News Get Help Donate Cool Vibes All Summer Long Jazzhead cap and T-shirt to benefit the JFA. Use Coupon code JFAFREE for free shipping on your order. CLICK HERE x X X"
    },
    {
      "url": "https://www.oceans-network.eu/about/oceans-teams",
      "text": "OCEANS Teams | OCEANS Network Menu About About us Coordinating Board National Representatives OCEANS Teams Annual Work Plan Statute Partners FAQ Activities Events News Newsletters Membership Membership eligibility Why join? Testimonials Services Contact us Leaflet Community Join Us Start About OCEANS Teams Teams The OCEANS Network is a Student & Alumni Network for Erasmus+ Programme Countries and Erasmus+ Partner Countries 1. International Coordination Role & Responsibilities (What help is needed): Contact with universities (universities staff, international student clubs) Contacting partner organisations for outreach and building relationships Managing and contacting regional coordinators (country representatives) Developing organisational strategies About: Are you passionate about OCEANS’ worldwide expansion, and already have good network with higher education institutions and potential partners around the world? Then join this team (Also called the National/Regional Representatives) and help raise awareness of OCEANS internationally. Application: To join the team, visit the international coordination group on the OCEANS community portal and feel free to contact the head of the respective team. 2. Projects Role & Responsibilities (What help is needed): Be a point of contact where members can discuss potential ideas and act as a sounding board Review applications and offer advice Review which applications are successful and use this help guide other members Organisation of webinars for ESAA project writing (Including FAQ) About: Join this group if you want support ESAA projects & AGM organisation. Application: To join the team, visit the international coordination group on the OCEANS community portal and feel free to contact the head of the respective team. 3. Community Development Role & Responsibilities (What help is needed): Support OCEANS events, networking, and membership & volunteer trainings Engage with members and find out what support they need Contact universities and other bodies to make them aware of us and recruit new members Work with the board to organise AGM 2022 About: Join this group if you believe in lifelong learning and have a passion for implementing different education & training programs for the network. This working group will plan different training workshops for OCEANS members in various subject areas and will also work closely with the board and manage OCEANS’ flagship event- Annual General Meeting (AGM). Application: To join the team, visit the international coordination group on the OCEANS community portal and feel free to contact the head of the respective team. 4. Communications Role & Responsibilities (What help is needed): Promotion of OCEANS, Erasmus+, international mobility on social media Daily management of OCEANS social media channels Promoting OCEANS events and activities via SNS Manage visual (photo & video) assets of the network About: Passionate about creating engaging posts to promote OCEANS internationally? You’re interested in the latest social media tools and want to challenge yourself making OCEANS’ social media channel more visual and interactive, this working group is for you! Application: To join the team, visit the international coordination group on the OCEANS community portal and feel free to contact the head of the respective team. 5. Content Development Role & Responsibilities (What help is needed): Co-manage content on the OCEANS community website Configure and manage the newsletter tools Create the newsletter Keep the OCEANS website up to date and create new articles to share on social media channels by the communications with the working groups/teams. This includes articles, photos, videos, as well as any other type of content About: The team supports publishing webinars and written content for the OCEANS website. If you are a talented storyteller who loves to develop topics and ideas that resonate with our members, feel free to join this group. Application: To join the team, visit the international coordination group on the OCEANS community portal and feel free to contact the head of the respective team. Team Events 06 Mar 2021 Virtual OCEANS Board Hand-over The OCEANS Hand-over between the outgoing OCEANS Board 2020/21 and the incoming OCEANS Board 2021/22 will take place virtually on the weekend of the 6 th and 13 th March 2021. Read more Belgium #Working Group Event Stay in touch! Subscribe OCEANS network info@oceans-network.eu About Activities Membership Services Imprint Legal mentions Cookies © 2025 Oceans Network Home About About us Coordinating Board National Representatives OCEANS Teams Annual Work Plan Statute Partners FAQ Activities Events News Newsletters Membership Membership eligibility Why join? Testimonials Services Contact us Leaflet Cookies Online Community Cookie notice We use cookies on our website. Some of them are essential to ensure functionality, while others help us to continuously improve our online offering. You can find more detailed information in our privacy policy and on our cookie page (see footer). You can also edit your settings there yourself at any time. Accept all Configure manually Accept essential Edit settings Here you can select or disable different categories of cookies on this website. By clicking on the info icon you can learn more about the different cookies. Essential Cookies Essential Cookies Analytical Cookies Analytical Cookies External media External media Accept all Save"
    },
    {
      "url": "https://www.click2houston.com/news/local/2021/06/23/tsu-appoints-new-ocean-of-soul-band-director/",
      "text": "TSU appoints new ‘Ocean of Soul’ band director Skip to main content Open Main Menu Navigation Open Search Mostly Clear icon 86 º Go to the KPRC homepage Join Insider Sign In Open the KPRC Click2Houston Help Desk Search News Watch Live Business Click2Vote Consumer Crime Education Entertainment Health History Immigration Local News Money National Pets Politics Tech Texas World Weather Traffic Alerts Click2Pins Flood Tracker Galveston Houston Zoo Hurricane Headquarters Live Cams KPRC 2+ Watch Live The Evidence Room TV Listings News Team NEXTGEN TV Investigates The Bench The Evidence Room Astroworld Festival Tragedy DRAINED 2 Helps You Contact 2 Helps You Sports Friday Football Frenzy Texans Texans Stats Astros Astros Stats Rockets Rockets Stats Athlete of the Week Aggies Cougars Dynamo Longhorns NCAA Olympics Discover Contact Us Things To Do Events Calendar Contests & Rules Click2Pins DIY Events Families Food and Drinks Go Gold Habitat For Humanity KPRC 2 Community Outdoors Podcasts Senior Scholarships Travel Branded Content Houston Life About Us Be on the Show Seen on Houston Life Eat Like a Local Newsletters News Weather KPRC 2+ Investigates 2 Helps You Sports Discover Houston Life Newsletters News Weather KPRC 2+ Investigates 2 Helps You Sports Discover Houston Life Newsletters WEATHER ALERT 3 advisories in effect for 3 regions in the area Show Breaking News Bar Close Local News Ninfa Saavedra , Digital Content Specialist Published: June 23, 2021 at 4:36 PM Tags: TSU , College , Band , Education , Band Director , Texas Southern University , Brian Simmons , music Sign up for our Newsletters Sign Up LATEST NEWS images of the suspect 2 minutes ago FBI releases images of suspected shooter at Charlie Kirk event in Utah Read full article: FBI releases images of suspected shooter at Charlie Kirk event in Utah A firefighter rings a bell during a ceremony to mark the 24th anniversary of the 9/11 attacks, Thursday, Sept. 11, 2025, in New York. (AP Photo/Seth Wenig) 7 minutes ago Mayor Whitmire to hold 9/11 remembrance ceremony in Houston Read full article: Mayor Whitmire to hold 9/11 remembrance ceremony in Houston Humidity levels 1 hour ago Houston heats up with rising humidity heading into the weekend Read full article: Houston heats up with rising humidity heading into the weekend Pasadena ISD 2 hours ago Pasadena ISD addresses employee comments on Charlie Kirk’s death Read full article: Pasadena ISD addresses employee comments on Charlie Kirk’s death Recommended Videos Local News TSU appoints new ‘Ocean of Soul’ band director Ninfa Saavedra , Digital Content Specialist Published: June 23, 2021 at 4:36 PM Tags: TSU , College , Band , Education , Band Director , Texas Southern University , Brian Simmons , music Texas Southern University has named Mr. Brian Simmons as the new Director of The Ocean of Soul Marching Band. (TSU) HOUSTON – Texas Southern University has named Brian Simmons as the new Director of The Ocean of Soul Marching Band and an instructor in the music department. Simmons is set to start his new role on July 5. Recommended Videos “It is an honor to join the TSU Family,” he said. “Texas Southern has always been a respected rival of mine. I am excited to work with a program with so much history both in the band and HBCU world. I look to honor the rich history and traditions of the ‘Ocean of Soul’ while incorporating new and innovative ideas. Fans and alumni can expect to see what the band is known for as we rise to the next level. Ultimately, it will be the same Ocean, just a new wave.” Simmons will be the fifth director of The Ocean of Soul and succeeds Darryl Singleton. “The College of Liberal Arts and Behavioral Sciences welcomes Mr. Simmons to TSU, to the Ocean of Soul, and to the Music Department. I would like to thank all members of the search committee for moving us to this point,” said Needha Boutte-Queen, Dean College of Liberal Arts and Behavioral Sciences. “We are thrilled that Mr. Simmons accepted this opportunity to lead the historic Ocean into the future. His talents are widely known and will help propel the Ocean of Soul to new heights.” A New Orleans native, Simmons earned a Bachelor of Music and Master of Educational Leadership from Southern University. He also serves as an adjudicator and clinician to middle and high school bands nationwide. In addition, Simmons plays the euphonium and trombone. He is also a prolific arranger and educator respected throughout the country. He has received many awards and critical acclaim for his performances and arrangements. Simmons was appointed Director of Bands and Director of Fine Arts at the Louisiana Leadership Institute (LLI) by Louisiana Senator Cleo Fields. In January 2021, Simmons led LLI as they were selected to participate in the Inauguration of President Joe Biden and Vice President Kamala Harris. The TSU band was founded in 1945 by Mr. Allen E. Norton. The Ocean of Soul, also known as the 9th Wonder of the World, was founded by Mr. Benjamin J. Butler II in 1969. The band consists of more than 200 students, all of whom rehearse and perform as part of a year-round program. The Ocean of Soul has performed at numerous high-profile events, including Super Bowl XXXVIII, the 2013 NBA All-Star Game Pregame Concert and the 2018 NCAA Final Four. Most recently, the Ocean was featured in the 2021 Netflix series High on the Hog. Copyright 2021 by KPRC Click2Houston - All rights reserved. About the Author Ninfa Saavedra headshot Ninfa Saavedra email Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us Meet the Team Careers at KPRC Closed Captioning / Audio Description Public File Current EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (713) 778-4745 At KPRC, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 Click2Houston.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    },
    {
      "url": "https://www.tsu.edu/news/2021/06/tsu-taps-new-ocean-of-soul-band-director",
      "text": "File Not Found Skip to main content Apply Visit Give Login Search Site Admissions & Aid Freshman Graduate Transfer Office of the Registrar School of Law International Military & Veterans Cost of Attendance Financial Aid & Scholarships Steps to Enroll Academics Online Programs Colleges & Schools Academic Calendar Academic Catalog International Programs Library Learning Center T-CLAW Online Writing Lab Core Curriculum The Ombudsman Office About Request TSU Information Visit Us Administration Board of Regents Office of the President Student Government Association TSU Policies (MAPP) Campus Mission and Vision TSU History Athletics Sports Tickets The TSU Band Student Life Student Accounting Housing Dining Services Career Center Recreation Center Safety & Wellness More Student Services Find Support Veterans Affairs Research Events Browse Events Institutional Events News Press Releases Apply Visit Give Login File Not Found Colleges & Schools Business Communication Education Law Liberal Arts & Behavioral Sciences Transdisciplinary Studies Pharmacy & Health Sciences Public Affairs Science, Engineering, & Technology Honors Graduate Information For Students Alumni Employees Visitors Job Seekers Safety & Wellness Public Safety Mental Health Counseling Title IX Student Conduct Help Parking on Campus Bookstore Request Information Tiger Line Academic Advisor Locations Frequently Asked Questions Doing Business with TSU Web Accessibility Assistance Resources Campus Map Photo Gallery Office of Information Technology Library Learning Center University Museum TSU Policies (MAPP) Data Privacy Colleges & Schools Business Communication Education Law Liberal Arts & Behavioral Sciences Transdisciplinary Studies Pharmacy & Health Sciences Public Affairs Science, Engineering, & Technology Honors Graduate Information For Students Alumni Employees Visitors Job Seekers Safety & Wellness Public Safety Mental Health Counseling Title IX Student Conduct Help Parking on Campus Bookstore Request Information Tiger Line Academic Advisor Locations Frequently Asked Questions Doing Business with TSU Web Accessibility Assistance Resources Campus Map Photo Gallery Office of Information Technology Library Learning Center University Museum TSU Policies (MAPP) Data Privacy 3100 Cleburne Street Houston, Texas 77004 713.313.7011 Submit Inquiry Follow Texas Southern on Instagram Like Texas Southern University on Facebook Follow Texas Southern on X formerly Twitter Network with Texas Southern University on LinkedIn © Texas Southern University ©"
    },
    {
      "url": "https://colajazz.com/contact",
      "text": "Contact | Reach Out Today — ColaJazz Foundation 500 0 1000ms 100vh 0 Skip to Content Home Events Outreach Education Programs About Contact Jazz Camp Jazz Fest News BECOME A MEMBER Open Menu Close Menu Home Events Outreach Education Programs About Contact Jazz Camp Jazz Fest News BECOME A MEMBER Open Menu Close Menu Home Events Outreach Education Programs About Contact Jazz Camp Jazz Fest News BECOME A MEMBER Contact Contact us for anything School visits Academy classes Performances Need jazz for your event? A jazz duo to a full big band, we have the perfect group for you. EMAIL contact@colajazz.com Name * First Name Last Name Email * Phone (###) ### #### Message * Groovy! We will get back to you shortly. DON’T MISS A BEAT! ColaJazz works year-round presenting high-quality jazz concerts, events, and educational programs. Find Us ColaJazz Foundation 2123 College Street Columbia, SC 29205 ColaJazz is a 501(c)(3) non-profit organization. FEIN 84-2847862 The driving beat in jazz performances, education and outreach. PRIVACY | TERMS | COOKIES This project is funded in part by the South Carolina Arts Commission which receives support from the National Endowment for the Arts. This project is also funded in part by a generous award from the John and Susan Bennett Memorial Arts Fund of The Coastal Community Foundation of South Carolina. MADE WITH & BY MERAKI . LOVE JAZZ? Close"
    },
    {
      "url": "https://jazzoregon.org/about-us",
      "text": "About Us | Jazz Society of Oregon Skip to main content Join JSO About Us Membership Jazz Scene Calendar Upcoming Events Event List Events By Venue Submit Calendar Event / Gig 2025 Jazz Festival 2025 Festival Line-up Festival Sponsors 2025 Festival Performers Application Festival Online Store - T-shirts and Posters! Become a Sponsor Vendors Volunteer Donate Now! Give the Gift of Jazz! Login Jazz Society of Oregon About Us Support Live Local Music The Jazz Society of Oregon ™ is an all-volunteer 501(c)(3) non-profit organization whose mission is to promote jazz music in the Pacific Northwest. We seek to provide jazz education, build membership engagement through events and publications, provide scholarships to new and existing artists and programs that teach jazz music, and foster a greater appreciation of this indigenous art form. Many thanks to all of the members who have volunteered their time during the past 35+ years to keep this organization alive. New volunteers are always welcome. Just send mail to volunteer@jazzoregon.org Leadership Team Board of Directors - Executive Committee Rita Rega , President Robert Lubach , Vice President Adrienne Carmichael , Treasurer Vacant , Secretary Board of Directors Brian Foxworth Yvonne Lerch Machado Mijiga Alex Newman Chris Pfeifer Holly Resnick Nicholas Rolfe Cathedral Park Jazz Festival Committee Yvonne Lerch , Festival Director Rita Rega , Director Artist Engagement Sara Goldman , Operations Support Yvonne Lerch , VIP Hospitality Nicole Mongrain, Volunteer Coordinator Shawn Kirkeby , Featured Musician Interviews Stefan Lerch , Video Production Coordinator and Design Brian Foxworth , Artist Engagement Nick Rolfe , Artist Engagement Shawn Kirkeby , Social Media Linton Hale , Webmaster JazzScene™ Blog Machado Mijiga , CD Reviews, JazzScene Editor, Writer Website Design/Production/Hosting Linton Hale , Webmaster and Festival Sponsor Contacts Do you have comments or questions on our organization? Would you like to become a member or volunteer for an upcoming event ? Please get in touch! Just click any of these addresses to send us e-mail: info@jazzoregon.org general questions, how to become a member, member benefits, membership issues volunteer@jazzoregon.org how to become a volunteer, inquire about volunteer positions and assignments calendar@jazzoregon.org submit an event to the jazz calendar, questions about the calendar editor@jazzoregon.org questions, suggestions or problems related to JazzScene magazine sponsor@jazzoregon.org how to become a program or event sponsor grants@jazzoregon.org how to provide a grant or grant opportunities to our JSO grant writer advertising@jazzoregon.org how to purchase advertising in JazzScene and on the JSO web site billing@jazzoregon.org billing questions, general financial and business issues webmaster@jazzoregon.org web site problems, login/password problems, website ideas and suggestions no Blue Main color: #0074d9 This video was created by the 100seven creative agency! Learn more about them at 100seven.com. Learn More Join Our Mailing List Jazz Society of Oregon P.O. Box 19882 Portland, Oregon 97280 Or you can contact us at info@jazzoregon.org . Our federal tax ID number is: 23-7345364 Support Live Jazz Donate Now to JSO JSO, Jazz Society of Oregon, JazzScene, CPJazz and Cathedral Park Jazz Festival are trademarks of the Jazz Society of Oregon, a 501(c)(3) non-profit corporation. Become a Partner The Jazz Society of Oregon ™ is a 501(c)(3) non-profit volunteer organization working to support jazz music, America’s original art form, through our membership activities. Partner with the Society '"
    }
  ]
}