{
  "fuentes": [
    {
      "url": "https://ocoeelakeshorecenter.com/",
      "email": "reservations@ocoee.org"
    },
    {
      "url": "https://ocoeelakeshorecenter.com/",
      "email": "reservations@ocoee.org"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "email": "dabdo@ocoee.org"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "email": "mjohnson@ocoee.org"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "email": "mark.johnson@ci.ocoee.fl.us"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "email": "thogan@ocoee.org"
    },
    {
      "url": "https://thenickleygroup.com/communities/ocoee/",
      "email": "info@thenickleygroup.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://whoshotonline.com/listings/bill-breeze-park/",
      "email": "info@whoshotonline.com"
    },
    {
      "url": "https://www.ocoee.org/185/Special-Events",
      "email": "mark.johnson@ci.ocoee.fl.us"
    },
    {
      "url": "https://www.ocoee.org/185/Special-Events",
      "email": "sheena@orangeblossommarketco.com"
    },
    {
      "url": "https://www.ocoee.org/185/Special-Events",
      "email": "adorsey@ocoee.org"
    },
    {
      "url": "https://www.ocoee.org/185/Special-Events",
      "email": "twise@ocoee.org"
    },
    {
      "url": "https://mycentralfloridafamily.com/venue/bill-breeze-park/",
      "email": "newsletter@mycentralfloridafamily.com"
    },
    {
      "url": "https://mycentralfloridafamily.com/venue/bill-breeze-park/",
      "email": "brandi@mycentralfloridafamily.com"
    },
    {
      "url": "https://breeze.us/contact/",
      "email": "info@claritycannabis.us"
    }
  ],
  "mails": [
    "adorsey@ocoee.org",
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "brandi@mycentralfloridafamily.com",
    "dabdo@ocoee.org",
    "info.nairobi@skanem.com",
    "info@claritycannabis.us",
    "info@thenickleygroup.com",
    "info@whoshotonline.com",
    "jane@skanem.ke",
    "mark.johnson@ci.ocoee.fl.us",
    "mjohnson@ocoee.org",
    "newsletter@mycentralfloridafamily.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "reservations@ocoee.org",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "sheena@orangeblossommarketco.com",
    "thogan@ocoee.org",
    "twise@ocoee.org"
  ],
  "nombre_sitio": "ocoee.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://ocoeelakeshorecenter.com/",
      "text": "Ocoee Lakeshore Center Call Us 407-877-5803 125 N Lakeshore Drive, Ocoee Florida Reservations@ocoee.org Follow Us ABOUT US EVENTS VENUE Lakeshore Center Withers Maguire House Outdoor Options Ison Center GALLERY BLOG CONTACT SCHEDULE TOUR ABOUT US EVENTS VENUE Lakeshore Center Withers Maguire House Outdoor Options Ison Center GALLERY BLOG CONTACT SCHEDULE TOUR Discover the perfect setting for your event at the Ocoee Lakeshore Center! Constructed in 2014 and renovated in 2019, our facility boasts two separate and unique indoor rental options and three beautiful outdoor locations providing flexibility for any occasion. We are a proud part of the City of Ocoee routinely hosting local professional events, breathtaking weddings, and community happenings. Take a closer look at all we have to offer and we are excited to provide the perfect backdrop for your unforgettable event! Read More Venue Options LAKESHORE CENTER Overlooking Starke Lake our facility boasts a 400 person ballroom, breathtaking Lakeview indoor space, two ready rooms, a stunning catering kitchen, and a wrap-around porch. Perfect for any style event from professional to personal gatherings. Learn More WITHERS-MAGUIRE HOUSE Built in 1888 this historic house is one of Orange County’s oldest homes. It has been updated with a modern kitchen and restroom while the remainder of the house retains its original charm. Perfect for smaller more intimate events with a unique flare of history. Learn More OUTDOOR OPTIONS Three different outdoor options for all event sizes. Bill Breeze Park is one acre of open space for any type of event or festival. The Wedding Pavilion and lawn is the perfect setting for “I Do” while the Outdoor Garden is a smaller area shaded by beautiful oak trees for intimate gatherings or extra outdoor space. Learn More EVENTS WITH WATERFRONT VIEWS AND GRAND BALLROOMS With so many different indoor and outdoor options, come and see us in person to start planning your perfect event! Schedule a Tour Ocoee Lakeshore Center Blogs Keep up with news, trends, and unforgettable moments with our dynamic publications! July 15, 2025 Summer Soirées & Cocktail Hours: Enjoy the Summer Before It Slips Away! beatcreative June 30, 2025 Small Meetings, Big Impact: Utilizing OLC’s Intimate Spaces for Workshops and Seminars beatcreative May 28, 2025 Making Your Milestone Moments Shine: Host Birthday Parties and Anniversaries at Ocoee Lakeshore Center beatcreative #TipTuesday ➡️ It's time to start planning you A vibrant jazz brunch filled with music, food, and Happy Labor Day from Ocoee Lakeshore Center! 💙 Our Lakeview room is the perfect canvas for unforg 🎶 Brunch, jazz, and a whole lot of Rattler prid Dream venue, dream party! 🫶💜 Amanda's gradua Pure elegance! ✨ This gold and white wedding her We can’t stop watching this reception entrance b Swipe to see the excitement from the Hob Nob & Str This throwback wedding is giving us major fall vib Watch Amanda shine as she enters her graduation pa New Blog Alert! 🚨 Your dream event awaits at th TESTIMONIALS \"Beautiful place. Recently renovated. Love the staff, place, view and all the newly renovated technology ❤\" TIFFANY Bride \"The ladies at Ocoee were so extremely helpful. The venue is very picturesque, I loved the bridal suite at Withers-Maguire House and the main building where the reception was held was immaculate. The value is great and anyone that is looking to have a fabulous wedding and is on a budget would be very happy with the Ocoee Lakeshore Center.\" TRINETTE Bride Contact Us Today to Book your Event! Facilitating community building through hosting events and occasions, come plan your stunning event with us. The Ocoee Lakeshore Center features several indoor and outdoor spaces suitable for all types and sizes of events, with most of the spaces being available as a package or separately based on your desires and event size. CONTACT US TODAY TO BOOK YOUR EVENT! Complete the form below and one of our event coordinators will contact you shortly! How did you hear about us? Social Media Friend/Family Google Search Attended Previous Event Perfect Wedding Guide Wedding Venue Map The Knot Wedding Wire Other 407-877-5803 Reservations@ocoee.org 125 N Lakeshore Drive, Ocoee, Florida 34761 OFFICE HOURS Monday – Friday: 8:00 am – 5:00 pm About Us The expanded Ocoee Lakeshore Center and the surrounding greens are a space for you to come together to celebrate life’s special events, spend time with those you love, and meet new neighbors. Welcome to “the center of good living!” CONTACT US 125 N Lakeshore Drive Ocoee, Florida 34761 Phone: 407-877-5803 Fax: 407-877-5801 Email: reservations@ocoee.org Photos & Videos featured provided by: jerzynieves.com stellememories.com aislesandivy.com Accessibility Statement ©2024 Ocoee Lakeshore Center - All Rights Reserved"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "text": "About Us | Ocoee, FL Skip to Main Content Search City of Ocoee Phone: 407-905-3100 1 North Bluford Avenue, Ocoee, FL 34761 About Us Events Programs Facilities Parks Community Relations Home City Government Departments Parks & Leisure Services About Us About Us The City of Ocoee Parks and Leisure Services Department strives to provide the citizens of Ocoee with safe and enjoyable programs, parks and facilities that will enhance the quality of life for city residents and promote an overall sense of community. We are committed to providing quality recreational services and welcome your comments, suggestions and ideas. Ocoee Lakeshore Center The Ocoee Lakeshore Center is West Orange County’s premier event destination. From wedding to conventions, the Lakeshore Center can host your event in style. Enjoy lovely lake views and modern amenities from all areas of our facility. The Lakeshore Center features banquet seating for more than 200 people, a modern catering kitchen, additional rooms for use and a state of the art audio-visual system. The historic Withers-Maguire House is suited for bridal party preparations and smaller meetings and events. For more information contact the Parks and Leisure Services Administrative office at 407-877-5803. Facilities The Parks and Leisure Services Department manages six recreation centers located throughout the city. A variety of programs for youth, adults and seniors are offered at these centers throughout the week. All centers are available during weekday evenings and on weekends to rent for family gatherings, parties, meetings, receptions, banquets and other special occasions. For more information contact the Parks and Leisure Services Administrative office at 407-877-5803. Parks The Parks and Leisure Services Department operates and maintains thirteen parks throughout the city with some of the following amenities: picnic areas, playgrounds, basketball and tennis courts, baseball, softball, football and soccer fields, and pavilions. Discover a park close to you. Programs The Parks and Leisure Services Department provides a variety of year-round recreational programs and events for youth , adults and seniors to enhance the quality of life for the residents of Ocoee. For more information on the programs and classes, please contact the Jim Beech Recreation Center at 407-905-3180 or check out our Facebook Page . Family Aquatic Center The Ocoee Family Aquatic Center provides a safe and relaxing setting for families to enjoy their day. Special features include a zero depth entry for easy access and spray features for the kids to splash the day away. For more information on programs and classes at the aquatic center, contact the Jim Beech Recreation Center at 407-905-3180. Ocoee Music Festival The City of Ocoee’s Fall Music Festival is celebrated annually drawing more than 20,000 people each year. The festival includes both local and national entertainment and one of the best fireworks displays in Central Florida. It is non-stop fun! For more information please contact Mark Johnson , Parks & Leisure Services Director or check the Festival website . Contact Us Mark Johnson Parks and Recreation Director Email Dan Abdo Parks Operations Manager Email Toren Hogan Recreation Operations Manager Email 1 N. Bluford Ave Ocoee, FL 34761 Directions Ph: 407-877-5803 Hours Monday - Thursday 7:30 a.m. - 5:30 p.m. Friday 8:00 a.m. - 5:00 p.m. Staff Directory Parks & Recreation Advisory Board Helpful Links Accessibility Employment Site Map Ocoee CRA Website /QuickLinks.aspx FAQs How many counselors and/or children can I bring? How many counselors do I need to have? What days can I schedule a visit? How can I pay for my camp visit? What happens if it is raining or there is a storm prior to or during my visit? /FAQ.aspx Under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. To Top Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://thenickleygroup.com/communities/ocoee/",
      "text": "Ocoee - The Nickley Group 407.906.2456 info(at)thenickleygroup(dotted)com Home Sellers Sell With Us Get Your Home Value Seller’s Guide TNG Listing Showcase Buyers Buy With Us Communities Advanced Home Search Buyer’s Guide Buyer VIP Program Our Listings About Meet the Team Join Our Team Testimonials Media & Press Resources Raving Fans Club Resume Our Guarantees Financing Blog Send Us A Message Choose Side: First Name Last Name Phone Number Email Address Message How much is your home really worth? Find Out Now How much is your home really worth? Find Out Now Home Sellers Sell With Us Get Your Home Value Seller’s Guide TNG Listing Showcase Buyers Buy With Us Communities Advanced Home Search Buyer’s Guide Buyer VIP Program Our Listings About Meet the Team Join Our Team Testimonials Media & Press Resources Raving Fans Club Resume Our Guarantees Financing Blog youtube facebook instagram zillow email phone Learn More Main Content Home » Communities » Ocoee Ocoee Home » Communities » Ocoee Beverly Hills, CA Average Home Prices $1,299,000 Lowest $31,000,000 Average $150,000,000 Highest Average Home Statistics In Terms of 6 No. of beds 8 No. of baths 4,357 sq. ft. Average Home Prices Per Square Feet $760 Lowest $2,218 Average $7,197 Highest Florida 34761 Ocoee Table of Contents 1. Introduction to Ocoee 2. Where is Ocoee, Florida 3. More about Ocoee 4. Things to do in Ocoee 5. Schools in Ocoee 6. Ocoee, FL. Homes For Sale Introduction to Ocoee Ocoee, Florida is a small city located in Orange County, just outside of Orlando. It's a popular spot for homeowners who want to live in a tight community while also having all the amenities of a large city nearby. Where is Ocoee, Florida More About Ocoee The area was first settled in 1840 and was originally known as Starke Lake. But it wasn't until 1887 that the town was officially called Ocoee. The name comes from Lake Ocoee, located within the city limits and has been used for recreational activities for over a century. Today, the town has grown to encompass an estimated population of 36,000 people. Ocoee is known for its vibrant community; many residents participate in regular events such as the annual Turkey Trot 5k/10k run and biking events like Tour de Ocoee. There are also plenty of outdoor activities at nearby lakes and parks, such as fishing, kayaking, paddle boarding, nature trails, and more. Regarding business opportunities, Ocoee offers many retail outlets, including antique shops and specialty boutiques alongside national chains like Bed Bath & Beyond and Dick's Sporting Goods. The West Oaks Mall provides locals with more extensive store options, including department stores like JC Penny's, Macy's, and other retailers. Ocoee prides itself on being an inviting city by cultivating a vibrant culture through engaging community-driven initiatives like lending libraries, public art projects, farmers' markets, and festivals throughout the year. With so much to offer visitors and locals alike, it's no wonder why Ocoee is fast becoming one of Central Florida's must-live locations! Things to do in Ocoee Bill Breeze Park West Orange Trail Toll Road Brewing Family Aquatic Center Jim Beech Recreation Center Schools in Ocoee Although these schools are located in the City of Ocoee, school zones are set by the school district. You can find Orange county schools here . Elementary Ocoee Elementary School Citrus Elementary School Spring Lake Elementary School Wesbrooke Elementary School Thornebrooke Elementary School Middle Ocoee Middle School High Ocoee High School Private Innovation Montessori Ocoee Hope Charter School Renaissance Charter School at Crown Point Legacy Charter High School Ocoee, FL. Homes For Sale « New Search Saved Save This Search Save Search × Cities: Ocoee Property Type: House/Condo Min. Price: $250,000 Max. Price: $1,000,000 Registered Users (please sign in) Message Email Sign In Forgot Password? × Enter the email address associated with your account, and we'll email you a link to reset your password. Email Reset Password Close New Users Message First Name* Last Name* Email* Phone * *Required fields. A confirmation email will be sent to you with instructions for activating your account, so please be sure your email address is entered accurately. Sign up Close For Sale Pending Sold 111 Results Refine Search Min. Price $ Max. Price $ Beds Any 1+ 2+ 3+ 4+ 5+ Baths Any 1+ 2+ 3+ 4+ 5+ Update Sort Price (High to Low) Price (Low to High) Status City Listing Date Type / Price Descending Listing Number Open Home Date Asc $310,000 120 10TH AVENUE OCOEE, FL 34761 3 Beds 2 Baths 1,262 SqFt (35) 120 10TH AVENUE, OCOEE, FL 34761 × Close Virtual Tour #O6342717 | House $1,000,000 Undisclosed OCOEE, FL 34761 3 Beds 2 Baths 1,676 SqFt (23) Undisclosed, OCOEE, FL 34761 × Close #O6321923 | House $949,900 2002 ADAIR STREET OCOEE, FL 34761 5 Beds 4 Baths 3,687 SqFt (50) 2002 ADAIR STREET, OCOEE, FL 34761 × Close Virtual Tour #O6306517 | House $899,000 3013 SPICENUT COURT OCOEE, FL 34761 7 Beds 5 | 1 Baths 3,753 SqFt (58) 3013 SPICENUT COURT, OCOEE, FL 34761 × Close Virtual Tour #O6340450 | House $850,000 250 CALLIOPE STREET OCOEE, FL 34761 5 Beds 3 | 1 Baths 3,605 SqFt (68) 250 CALLIOPE STREET, OCOEE, FL 34761 × Close Virtual Tour #O6336640 | House $799,000 108 SAGECREST DRIVE OCOEE, FL 34761 5 Beds 3 Baths 3,376 SqFt (28) 108 SAGECREST DRIVE, OCOEE, FL 34761 × Close #O6307770 | House « 1 of 19 » © 2025 Stellar MLS. All rights reserved. The data relating to real estate displayed on this website comes in part from the Internet Data Exchange (IDX) Program of Stellar MLS. All listing information is deemed reliable but not guaranteed and should be independently verified through personal inspection by appropriate professionals. Listings displayed on this website may be subject to prior sale or removal from sale; the availability of any listing should always be independently verified. Listing information is provided for consumers' personal, non-commercial use, solely to identify potential properties for potential purchase; all other use is strictly prohibited and may violate relevant federal and state law. Stellar (MFR) data last updated at September 10, 2025, 1:44 PM ET Real Estate IDX Powered by iHomefinder For Sale Pending Sold Save this Search Refine Search Min. Price Max. Price Beds Any 1+ 2+ 3+ 4+ 5+ Baths Any 1+ 2+ 3+ 4+ 5+ Sort Price (High to Low) Price (Low to High) Status City Listing Date Type / Price Descending Listing Number Open Home Date Asc For Sale 120 10TH AVENUE OCOEE, FL 34761 $310,000 3 Beds 2 Baths 1,262 Sqft Listing No. O6342717 Property Type: House Virtual Tour (35) Details For Sale Undisclosed OCOEE, FL 34761 $1,000,000 3 Beds 2 Baths 1,676 Sqft Listing No. O6321923 Property Type: House (23) Details For Sale 2002 ADAIR STREET OCOEE, FL 34761 $949,900 5 Beds 4 Baths 3,687 Sqft Listing No. O6306517 Property Type: House Virtual Tour (50) Details For Sale 3013 SPICENUT COURT OCOEE, FL 34761 $899,000 7 Beds 5 | 1 Baths 3,753 Sqft Listing No. O6340450 Property Type: House Virtual Tour (58) Details For Sale 250 CALLIOPE STREET OCOEE, FL 34761 $850,000 5 Beds 3 | 1 Baths 3,605 Sqft Listing No. O6336640 Property Type: House Virtual Tour (68) Details For Sale 108 SAGECREST DRIVE OCOEE, FL 34761 $799,000 5 Beds 3 Baths 3,376 Sqft Listing No. O6307770 Property Type: House (28) Details 120 10TH AVENUE OCOEE, FL 34761 For Sale $310,000 Beds 3 Baths 2 Sqft 1,262 Property Type House Virtual Tour (35) Listing No. O6342717 Undisclosed OCOEE, FL 34761 For Sale $1,000,000 Beds 3 Baths 2 Sqft 1,676 Property Type House (23) Listing No. O6321923 2002 ADAIR STREET OCOEE, FL 34761 For Sale $949,900 Beds 5 Baths 4 Sqft 3,687 Property Type House Virtual Tour (50) Listing No. O6306517 3013 SPICENUT COURT OCOEE, FL 34761 For Sale $899,000 Beds 7 Baths 5 | 1 Sqft 3,753 Property Type House Virtual Tour (58) Listing No. O6340450 250 CALLIOPE STREET OCOEE, FL 34761 For Sale $850,000 Beds 5 Baths 3 | 1 Sqft 3,605 Property Type House Virtual Tour (68) Listing No. O6336640 108 SAGECREST DRIVE OCOEE, FL 34761 For Sale $799,000 Beds 5 Baths 3 Sqft 3,376 Property Type House (28) Listing No. O6307770 For Sale VIRTUAL TOUR (35) address 120 10TH AVENUE, OCOEE, FL 34761 price $310,000 beds 3 3 Beds baths 2 2 Baths lot size 1,262 Sqft 1,262 Sqft listing no. O6342717 Listing No. O6342717 property type House Property Type: House virtual tour VIRTUAL TOUR gallery photos (35) For Sale (23) address Undisclosed, OCOEE, FL 34761 price $1,000,000 beds 3 3 Beds baths 2 2 Baths lot size 1,676 Sqft 1,676 Sqft listing no. O6321923 Listing No. O6321923 property type House Property Type: House gallery photos (23) For Sale VIRTUAL TOUR (50) address 2002 ADAIR STREET, OCOEE, FL 34761 price $949,900 beds 5 5 Beds baths 4 4 Baths lot size 3,687 Sqft 3,687 Sqft listing no. O6306517 Listing No. O6306517 property type House Property Type: House virtual tour VIRTUAL TOUR gallery photos (50) For Sale VIRTUAL TOUR (58) address 3013 SPICENUT COURT, OCOEE, FL 34761 price $899,000 beds 7 7 Beds baths 5 | 1 5 | 1 Baths lot size 3,753 Sqft 3,753 Sqft listing no. O6340450 Listing No. O6340450 property type House Property Type: House virtual tour VIRTUAL TOUR gallery photos (58) For Sale VIRTUAL TOUR (68) address 250 CALLIOPE STREET, OCOEE, FL 34761 price $850,000 beds 5 5 Beds baths 3 | 1 3 | 1 Baths lot size 3,605 Sqft 3,605 Sqft listing no. O6336640 Listing No. O6336640 property type House Property Type: House virtual tour VIRTUAL TOUR gallery photos (68) For Sale (28) address 108 SAGECREST DRIVE, OCOEE, FL 34761 price $799,000 beds 5 5 Beds baths 3 3 Baths lot size 3,376 Sqft 3,376 Sqft listing no. O6307770 Listing No. O6307770 property type House Property Type: House gallery photos (28) 1 2 3 ... 17 18 19 Next © 2025 Stellar MLS. All rights reserved. The data relating to real estate displayed on this website comes in part from the Internet Data Exchange (IDX) Program of Stellar MLS. All listing information is deemed reliable but not guaranteed and should be independently verified through personal inspection by appropriate professionals. Listings displayed on this website may be subject to prior sale or removal from sale; the availability of any listing should always be independently verified. Listing information is provided for consumers' personal, non-commercial use, solely to identify potential properties for potential purchase; all other use is strictly prohibited and may violate relevant federal and state law. Stellar (MFR) data last updated at September 10, 2025, 1:44 PM ET Real Estate IDX Powered by iHomefinder Office Address 1013 E. Colonial Dr. Orlando, FL 32803 Phone 407.906.2456 Email info(at)thenickleygroup(dotted)com youtube facebook instagram zillow Copyright© 2025. The Nickley Group . All rights reserved. | Terms of Use | Sitemap . Real Estate Website Design by Agent Image"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://whoshotonline.com/listings/bill-breeze-park/",
      "text": "Bill Breeze Park - Who’s Hot Online Advertising Contests & Promotions About us Blog Contact us Advertising Contests & Promotions About us Blog Contact us Search Facebook Instagram Youtube HOME HOT SPOTS HOT EVENTS PHOTOS ARTISTS DIVAS BUSINESSES CHARITIES HOME HOT SPOTS HOT EVENTS PHOTOS ARTISTS DIVAS BUSINESSES CHARITIES Bill Breeze Park Bill Breeze Park is the city’s largest venue for non-sporting events that can go right to the water’s edge, by closing Lakeshore Drive which is bordered on the east side of the park. Average Reviews Photos Description Bill Breeze Park is the city’s largest venue for non-sporting events that can go right to the water’s edge, by closing Lakeshore Drive which is bordered on the east side of the park. Business Info +1 407-877-5803 https://ocoeelakeshorecenter.com/bill-breeze-park/ 150 N Lakeshore Dr, Ocoee, FL 34761, USA Categories Event Center Park Weddings Map Claim Listing Is this your business? Claim listing is the best way to manage and protect your business. 407 430-6800 info@whoshotonline.com Lake Mary, FL Find your Spot Bars & Restaurants Hot Events Photo Galleries Artists & Bands Diva of the Month Businesses Charities Useful Links Advertise with Us Contests Promotions About Us Contact Us Privacy Policy Terms of Service Locations Florida Orlando Daytona Beach Sanford Space Coast Lake Mary Tampa Join our Mailing List Name Email Subscribe Copyright © 2025 Who's Hot Online | Designed by Prugner's Digital Marketing Facebook-f Instagram Youtube"
    },
    {
      "url": "https://www.ocoee.org/185/Special-Events",
      "text": "Special Events | Ocoee, FL Skip to Main Content Search City of Ocoee Phone: 407-905-3100 1 North Bluford Avenue, Ocoee, FL 34761 About Us Events Programs Facilities Parks Community Relations Home City Government Departments Parks & Leisure Services Events Special Events Special Events Please subscribe to our calendar to stay up to date on our latest events. Special Events Food and Beverage Vendor Application Thank you for considering becoming a vendor with us! We are excited to learn more about you and your business. City of Ocoee Parks and Leisure Services hosts several special events throughout the year. Please take a moment to read more about Parks and Leisure Services' special events and submit your application . For more information contact Adrian Dorsey or Parks and Leisure Services at 407-905-3180. Community Market Come out and enjoy the new Community Market on the first Thursday of every month from 5 pm-9 pm. The Market will be located at Bill Breeze Park (125 N Lakeshore Drive, Ocoee, FL, 34761). There will be food trucks, artisan snacks, handmade goods, and live music. This event is managed by Orange Blossom Market CO in partnership with the City of Ocoee Parks and Leisure Services . For more information, contact Sheena Willis . Halloween Howl Night City of Ocoee Parks and Leisure Services will host Halloween Howl Night on Friday, October 24, 2025, from 6:00 pm -9:00 pm. The event will include a Trunk or Treat, glow hunt, food trucks, costume contest, games, & more. For more information contact Parks and Leisure Services at 407-905-3180. Ocoee Music Festival City of Ocoee’s Fall Music Festival is celebrated annually, drawing more than 20,000 people each year. The festival includes both local and national entertainment and one of the best fireworks displays in Central Florida. It is non-stop fun! For more information, please Email Mark Johnson , Parks and Leisure Services Director, or check the Festival website. Dash of the Century 5K The City of Ocoee will host a once-in-a-lifetime Dash of the Century 5K on Saturday, November 15, 2025. Join us for a historic 5K celebrating 100 years of community, pride, and progress. The race will take place in Downtown Ocoee, with warmups starting around 7 am and the race starting at 7:30 am. Register here Version OptionsSpecial EventsHeadline Dash of the Century 5K Dash of the Century 5K . For more information, email Tracy Wise-Donahey or contact Parks and Leisure Services at 407-905-3180. Evening with Santa City of Ocoee Parks and Leisure Services will host an Evening with Santa. Event Date and Time To Be Announced. The event will be held at the Ocoee Lakeshore Center. Enjoy a visit with Santa and his special guests, and share Christmas wishes, pictures, and much more. Space is limited . Registration is currently closed. For more information, contact Parks and Leisure Services at 407-905-3180. Jolly Jamboree & Tree Lighting City of Ocoee Parks and Leisure Services will host its Annual Jolly Jamboree & Tree Lighting Event on Saturday, December 13, 2025, from 1:00 pm-7:00 pm. This free event will feature Santa’s Village, a kids' zone, special guests, tree lighting, and much more. For more information, contact Adrian Dorsey or Parks and Leisure Services at 407-905-3180. Dog Parade City of Ocoee Parks & Leisure Services will host its Third Annual Holiday Dog Parade on Saturday, December 13, 2025. Judging will start at 1:30 pm. Registration will open on Saturday, November 1, 2025. Additional event details will be emailed to all registered particip ants. For further information and assistance with registration, contact Adrian Dorsey or Parks & Leisure Services at 407-905-3180. Highlighting Ocoee City of Ocoee Parks & Leisure Services Advisory Board meets on two (2) designated dates in December from 6:00 pm – 8:30 pm to view and judge the homes with the best Christmas lights in the city. If chosen, the homeowners are awarded a HighLIGHTing 2024 Light Up Ocoee sign to keep as a “Thank You” for their participation and efforts to spread the holiday cheer in our community. We welcome the community and your family to drive around town or maybe just a walk in your neighborhood to see the lights. The following areas/subdivisions were awarded with a sign. Family Movie Night City of Ocoee Parks and Leisure Services will host Family Movie Night. Event Date To Be Announced. Join us for food trucks, games, a Community Market, and a Movie. For more information contact Parks and Leisure Services at 407-905-3180. Valentines Day City of Ocoee Parks and Leisure Services will host a Valentine’s Celebration. Event Date To Be Announced. The event will be held at the Withers-Maguire House and Ocoee Lakeshore Center. Come join us for live music, painting, games, a special dance, and much more. For more information, contact Parks and Leisure Services at 407-905-3180. Downtown Block Party City of Ocoee Parks and Leisure Services will host a Block Party in Downtown Ocoee on McKey Street. Event Date To Be Announced. Come out for live music, food trucks, and family-friendly activities. For more information, contact Adrian Dorsey or Parks and Leisure Services at 407-905-3180. Annual Chick-Fil-A 5k City of Ocoee and Chick-fil-A will host their 15th Annual 5K on To Be Announced, starting at 7:30 am. There will also be a free Kids Fun Run, vendors, and other activities. The event will take place in Bill Breeze Park, which is down by the lake. To register, visit Chick-fil-A 5K and Kids Fun Run. For more information, Email Tracy Wise-Donahey or contact Parks and Leisure Services at 407-905-3180. Following the 5K, the Family Fun Day will take place at Bill Breeze Park from 9:00 am to 12:00 pm. This event will feature free games, rides, and activities for families to enjoy. There will also be live performances by local schools and groups. For more information, please contact Parks and Leisure Services at 407-905-3180 Breakfast with the Easter Bunny City of Ocoee Parks and Leisure Services will host Breakfast with the Easter Bunny. Event Date To Be Announced. The event will be held at the Ocoee Lakeshore Center. Breakfast. Visit the Easter Bunny, his special guest, and take pictures. All kids will be able to interact with the Easter Bunny and his special guest, along with exclusive use of the Fun Zone. For more information, contact Parks and Leisure Services at 407-905-3180 . Annual Easter Eggstravaganza City of Ocoee Parks and Leisure Services will host its Annual Easter Eggstravaganza. Event Date To Be Announced. This free event will be held at Bill Breeze Park. There will also be exciting games, crafts, and of course, an appearance by the Easter Bunny. For more information, contact Parks and Leisure Services at 407-905-3180 . 4th of July City of Ocoee Parks and Leisure Services July 4th Event. Event updates to come. For more information, contact Parks and Leisure Services at 407-905-3180 Family Recreation Day City of Ocoee Parks and Leisure Services will host Family Recreation Day. The event will be at the Jim Beech Recreation Center and Family Aquatic Center from 11:00 am-2:00 pm, For more information, contact Parks and Leisure Services at 407-905-3180. At this year's Family Recreation Day, Greater Vision Enterprise and Inspire will hold their 4th Annual Back to School Bash. The Back to School Bash will be hosted by Greater Vision Resources from 11:00 am-2:00 pm, for food, fun, pool, water slides, and entertainment for the entire family. Special Thanks to our Sponsors Ocoee Music Festival Special Events Helpful Links Accessibility Employment Site Map Ocoee CRA Website /QuickLinks.aspx FAQs How many counselors and/or children can I bring? How many counselors do I need to have? What days can I schedule a visit? How can I pay for my camp visit? What happens if it is raining or there is a storm prior to or during my visit? /FAQ.aspx Under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. To Top Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://mycentralfloridafamily.com/venue/bill-breeze-park/",
      "text": "Bill Breeze Park - MyCentralFloridaFamily.com Facebook Instagram TikTok Youtube Sign in Join Home Who Are We? Today’s Events Daily Event Calendar Submit an Event New Events Calendar Seasonal Falls, Fairs, and Festivals Guide Oktoberfest Guide Halloween Event Guide Pumpkin Patch Guide Corn Maze Guide Fall Consignment Sales End of Summer Deals Outdoor Movie Guide School Calendar Guide News Latest Family Event News News Categories Family Events Steals and Deals Outdoor Fun & Events Indoor Fun & Events Theme Parks News & Events Music & Theater Events Free Events Event Daily Calendar Event Reviews Giveaways Website Guide Family Guides All Family Guides Parks and Playground Guide Library Guide Zoo and Animal Guide Museum Guide School Calendars Kid’s Theater Guide Indoor Playground Guide Farmer’s Market Guide Race and Walk Guide Kids Expo Exhibitor Information More Contact Us Advertise Social Facebook Instagram TikTok YouTube Facebook Group Submit Submit an Event Feature Your Event Submit Press Release Summer Camp Guide Info Summer Camp Guide Advertising Summer Camp Media Kit 2025 Summer Camp Guide Submit Summer Camp Sign in Welcome! Log into your account your username your password Forgot your password? Create an account Sign up Welcome! Register for an account your email your username A password will be e-mailed to you. Password recovery Recover your password your email Search Thursday, September 11, 2025 Sign in / Join Home Who Are We? Today’s Events Daily Event Calendar Submit an Event New Events Calendar Seasonal Falls, Fairs, and Festivals Guide Oktoberfest Guide Halloween Event Guide Pumpkin Patch Guide Corn Maze Guide Fall Consignment Sales End of Summer Deals Outdoor Movie Guide School Calendar Guide News Latest Family Event News News Categories Family Events Steals and Deals Outdoor Fun & Events Indoor Fun & Events Theme Parks News & Events Music & Theater Events Free Events Event Daily Calendar Event Reviews Giveaways Website Guide Family Guides All Family Guides Parks and Playground Guide Library Guide Zoo and Animal Guide Museum Guide School Calendars Kid’s Theater Guide Indoor Playground Guide Farmer’s Market Guide Race and Walk Guide Kids Expo Exhibitor Information More Contact Us Advertise Social Facebook Instagram TikTok YouTube Facebook Group Submit Submit an Event Feature Your Event Submit Press Release Summer Camp Guide Info Summer Camp Guide Advertising Summer Camp Media Kit 2025 Summer Camp Guide Submit Summer Camp Facebook Instagram TikTok Youtube Sign in Welcome! Log into your account your username your password Forgot your password? Get help Create an account Create an account Welcome! Register for an account your email your username A password will be e-mailed to you. Password recovery Recover your password your email A password will be e-mailed to you. MyCentralFloridaFamily.com Home Who Are We? Today’s Events Daily Event Calendar Submit an Event New Events Calendar Seasonal Falls, Fairs, and Festivals Guide Oktoberfest Guide Halloween Event Guide Pumpkin Patch Guide Corn Maze Guide Fall Consignment Sales End of Summer Deals Outdoor Movie Guide School Calendar Guide News Latest Family Event News News Categories Family Events Steals and Deals Outdoor Fun & Events Indoor Fun & Events Theme Parks News & Events Music & Theater Events Free Events Event Daily Calendar Event Reviews Giveaways Website Guide Family Guides All Family Guides Parks and Playground Guide Library Guide Zoo and Animal Guide Museum Guide School Calendars Kid’s Theater Guide Indoor Playground Guide Farmer’s Market Guide Race and Walk Guide Kids Expo Exhibitor Information More Contact Us Advertise Social Facebook Instagram TikTok YouTube Facebook Group Submit Submit an Event Feature Your Event Submit Press Release Summer Camp Guide Info Summer Camp Guide Advertising Summer Camp Media Kit 2025 Summer Camp Guide Submit Summer Camp Facebook Instagram TikTok Youtube 1 event found. Orlando Family Events Calendar – Things to Do with Kids in Central Florida Discover the Orlando Family Events Calendar , your go-to guide for things to do with kids and families in Central Florida. From exciting Orlando festivals, family-friendly fairs, and seasonal holiday events to local story times, free community activities, and weekend fun across Orange, Seminole, Osceola, Lake, and Volusia counties, our calendar makes it easy to plan memorable outings. Whether you’re looking for kid-friendly events, indoor play, outdoor adventures, or special attractions like theme park happenings, our Central Florida events calendar Images by Blue Sunglass Photos With our Orlando Family Events Calendar , you can easily filter events by category to find exactly what fits your family’s needs. Browse holiday celebrations, free and low-cost events, back-to-school activities, seasonal festivals, and so much more. You can also filter by venue, city, cost, or even check out our featured events to quickly discover what’s happening near you. You can view listings by the day to plan their schedule, flip through different days to explore new opportunities, or switch to the monthly calendar view for a big-picture look at everything happening across Orlando and Central Florida. If you’re hosting a family-friendly event, you can even submit it directly to our calendar here . Want to have events and news deliverd to your inbox, click here to sign up for our weekly newsletters! Be sure to always double and triple check dates, times, and details of any event before heading out, as event producers may make last-minute changes without notifying us, and occasional errors may occur when loading events into the calendar. Bill Breeze Park Events Venues Bill Breeze Park Address 125 North Lakeshore Drive Ocoee , FL United States Get Directions Events at this venue Today Upcoming Upcoming Select date. Condense Events Series October 2025 Fri 24 October 24 @ 6:00 pm - 9:00 pm City of Ocoee Halloween Howl Night Bill Breeze Park 125 North Lakeshore Drive, Ocoee, FL, United States City of Ocoee Parks and Leisure Services will host Halloween Howl Night on Friday, October 24, 2025, from 6:00 pm -9:00 pm. The event will include a Trunk or Treat, glow hunt, food trucks, costume contest, games, & more. For more information contact Parks and Leisure Services at 407-905-3180. free Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Thank you for visiting us at MyCentralFloridaFamily.com. We're happy you're here! This website was designed to assist families with finding resources, ideas and things to do within the Central Florida community. We encourage all families to check and double check all events, information and news prior to making decisions for their families because, while we strive for perfection, information, news, events, and details always will and do change. Our website contains paid, non-paid, and in-trade mentions, articles, and reviews of organizations, events, schools and businesses throughout Central Florida. These mentions are for informational purposes only and should not be considered an endorsement. Please do further research on your own before choosing an event, organization, school or business to engage with. Families and individuals using our site assume all risks from any activities they participate in. MyCentralFloridaFamily.com, Epic Expos, Inc., their employees and owners are not responsible for any injuries or issues that come from participating in any of the events or opportunities listed on our website or social pages. All users/readers/visitors to MyCentralFloridaFamily.com agree to hold Epic Expos, Inc. and all of it's entities harmless in any such claims. With that said, we hope you find our website and social pages full of fun ideas and opportunities to make family memories and make your Central Florida living easier than ever. Copyright © 2025 MyCentralFloridaFamily.com Contact us: Newsletter@MyCentralFloridaFamily.com Facebook Instagram TikTok Youtube ©"
    },
    {
      "url": "https://breeze.us/contact/",
      "text": "Contact - Clarity™ Skip to content Shop Delivery Curbside Specials Blog About FAQ Contact Shop Delivery Curbside Specials Blog About FAQ Contact Contact Discover premium products, unbeatable deals, and fast delivery—everything you need for a seamless shopping experience. Store Business Hours Monday - Saturday: 8:00 AM - 10:00 PM Sunday: 10:00 AM - 8:00 PM Delivery Hours Monday - Saturday: 11:00 AM - 9:00 PM Sunday: 10:00 AM - 8:00 PM Here For A Pickup? Text Your Full Name and Parking Space Number to: (248) 838-9444 Send Us A Message FIll out the form below and we will cantact you as soon as possible First Name Last Name Email Phone Number Message Send Get In Touch Address: 24517 John R Rd, Hazel Park, MI 48030 Email: info@claritycannabis.us Phone: (248) 657-4201 Quick Links Shop Delivery Curbside Specials Blog About FAQ Contact Shop Delivery Curbside Specials Blog About FAQ Contact © 2025 Trucenta LLC DBA Clarity Cannabis All Rights Reserved."
    }
  ]
}