{
  "fuentes": [
    {
      "url": "https://oddmusebrewing.com/about-us/",
      "email": "cropped-odd-muse-circle-logo-full-color-rgb-817px@72ppi.jpg"
    },
    {
      "url": "https://oddmusebrewing.com/about-us/",
      "email": "odd-muse-circle-logo-full-color-rgb-817px@72ppi.jpg"
    },
    {
      "url": "https://www.lagerfinder.com/listing/odd-colony-brewing-company/",
      "email": "admin@lagerfinder.com"
    },
    {
      "url": "https://www.pnj.com/story/news/local/2019/04/08/odd-colony-brewing-co-brewery-opening-pensacola-summer/3356892002/",
      "email": "cgirod@pnj.com"
    },
    {
      "url": "https://www.pnj.com/story/news/local/2019/04/08/odd-colony-brewing-co-brewery-opening-pensacola-summer/3356892002/",
      "email": "jnewby@pnj.com"
    },
    {
      "url": "https://www.pnj.com/story/news/local/2019/10/16/odd-colony-brewing-co-opens-downtown-pensacola-thursday/3975019002/",
      "email": "gregg@pnj.com"
    },
    {
      "url": "https://www.pnj.com/story/news/local/2019/10/16/odd-colony-brewing-co-opens-downtown-pensacola-thursday/3975019002/",
      "email": "jnewby@pnj.com"
    },
    {
      "url": "https://www.oddcolony.com/jobs",
      "email": "brandi@oddcolony.com"
    },
    {
      "url": "https://ffcfc.com/SBA-504-Loan-Taps-Odd-Colony-Brewing-Company-for-Success-exist-0",
      "email": "info@ffcfc.com"
    }
  ],
  "mails": [
    "admin@lagerfinder.com",
    "brandi@oddcolony.com",
    "cgirod@pnj.com",
    "cropped-odd-muse-circle-logo-full-color-rgb-817px@72ppi.jpg",
    "gregg@pnj.com",
    "info@ffcfc.com",
    "jnewby@pnj.com",
    "odd-muse-circle-logo-full-color-rgb-817px@72ppi.jpg"
  ],
  "nombre_sitio": "oddcolony.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://oddmusebrewing.com/about-us/",
      "text": "About Us – ODD Muse Brewing Company TAPROOM NOW OPEN: Mon, Tue, Wed, Thur 4pm-10pm. Friday 12pm-11pm. Saturday 12p-11p. Sunday 12p-9p Beer To-Go Home Events FOOD ORDER ONLINE Jobs About Us Home Events FOOD ORDER ONLINE Jobs About Us ORDER ONLINE Food Truck Schedule Events About Contact Jobs About Us The ODD Muse Story THE NAME The name ‘ODD Muse’ has multiple meanings.  It’s a nod to the idea that inspiration can come from pretty strange places.  It can be unconventional, abnormal and unexpected and we encourage everyone to recognize and embrace it.  It’s also a direct representation of our owner’s personal inspiration, their daughter’s (O)livia and (D)aniella (D)iaz. WHO WE ARE ODD Muse started as an idea that beer should be a gateway to community, friendship, inclusion and culture.  We believe that beer is universal and beliefs, gender, race, ethnicity, don’t dictate who does and does not get to enjoy beer.  Beer is meant to be shared and enjoyed with people, any people. At ODD Muse we believe that brewing is both a science and an art form so it’s only fitting that we collaborate with local artists and musicians to emphasize the artistic aspect of brewing.  In keeping true to the principles that started ODD Muse we aim to team up with local artists and musicians to incorporate culture and creativity into our brewery. As far as our beer goes, its great!  We brew many styles of beer and we brew them well.  We focus on quality and craft and make sure that every beer we release meets our standards so that you can be confident you’re going to get good beer when you choose to drink ODD Muse. Hours Mon, Tue, Wed, Thur 4pm-10pm Friday 12pm-11pm Saturday 12p-11p Sunday 12p-9p Location 214-200-3172 4488 Spring Valley Rd Farmer’s Branch, TX 75244 Get Directions Social"
    },
    {
      "url": "https://www.lagerfinder.com/listing/odd-colony-brewing-company/",
      "text": "Odd Colony Brewing Company - Lagerfinder.com Home What is lager and why is it different? Glossary of Lager beer styles About This Site Suggest a listing LagerFinder.com Home What is lager and why is it different? Glossary of Lager beer styles About This Site Suggest a listing Odd Colony Brewing Company Pensacola , Florida , United States Share Post Facebook Twitter LinkedIn Pinterest Save Listing Description Information 260 N Palafox St Pensacola, FL 32502 Get Direction https://www.oddcolony.com/ Suggest a listing Submit a suggestion for another lager-centric brewery to include – email admin@lagerfinder.com © 2022 LagerFinder.com – All rights reserved Imprint Privacy Policy Contact"
    },
    {
      "url": "https://www.pnj.com/story/news/local/2019/04/08/odd-colony-brewing-co-brewery-opening-pensacola-summer/3356892002/",
      "text": "Odd Colony Brewing Co. brewery opening in Pensacola this summer News Sports Play Opinion Advertise Obituaries eNewspaper Legals LOCAL Odd Colony Brewing Co. to bring wilderness-inspired beers to Pensacola this summer Jake Newby Pensacola News Journal Three Pensacola residents will see their passion project come to fruition this summer when Odd Colony Brewing Co. opens at 260 N. Palafox St. in July or August. Owners Blake Foster and Brett Schweigert, and head brewer Ryan Brei, want to bring wild Florida into their new 4,765-square-foot brewery. \"One thing that we're going to implement in our brewery is a lot of conservation ethics and things we can give back to the wild spaces that we cherish so much,\" said Schweigert, the former head brewer at Perfect Plain Brewing Co. With a campfire incorporated into its logo, the brewery and the experienced team behind it said their style of craft beer, along with the ambiance of their tap room, will reflect their deep-rooted values in environmental conservation. The Odd Colony name, Schweigert said, blends Pensacola's history and diverse culture development with the trio's approach to integrating local ingredients into their wilderness-inspired beer. That barrel program will be mainly sour-focused, though they'll invest plenty of time in putting their personal spins on traditional craft beers. \"We took that odd, funky culture that we felt like we have here in Pensacola and we thought it'd be a cool play on words to feed it into our main focus, which is mixed culture fermentation,\" Schweigert said. \"We felt the end result is the odd, complex yeast colonies and bacterias that we hope to take and implement into our sour program.\" The brewery won't serve food, but like other local establishments that benefit mutually from a nearby food truck, Nomadic Eats on East Gregory Street is parked directly across the street from the property. Odd Colony won't have TVs, but will have two large projector screens that'll occasionally show movies and sporting events. The three music buffs will build an extensive vinyl collection, Schweigert said, and will play music from vinyl records over the tap room. They're also working with local artists to devise mural designs for the interior and exterior of the building. \"If we're brewing wilderness-inspired brews, we want to kind of have some kind of wild factor in here, something kind of eclectic and funky that we want feeding off of us, the people involved,\" Schweigert said of the team's vision for Odd Colony's atmosphere. Schweigert had been with Perfect Plain since it opened its doors in November 2017 . He said it was \"tough to leave a good thing,\" but when he was approached by Foster a year ago and offered an ownership role, Schweigert said the opportunity sounded too fulfilling to pass up. \"I'm still great friends with those guys,\" Schweigert said of the team at Perfect Plain. \"What it came down to when I talked to Blake was, do we have something that we're both passionate about that we can present to the community that would be representative of our values while fitting a niche, in a different layer?\" Foster, who has bounced around between the nursing field and hotel industry as an owner and manager, said owning a brewery had always been his pipe dream. When he found funding and started actualizing his vision for the brewery last spring, he called up Schweigert, someone he had known for 20 years. \"Truth be told, I really couldn't imagine starting a brewery with anyone but Brett,\" Foster said. Brei was actually running a brewery in Denmark last year when Odd Colony posted a job listing in search of a co-brewer to complement Schweigert. A Pensacola resident for just four months a few years ago, Brei's fiancée grew up in Pensacola. His local connection endeared him to Foster. \"Most applicants were people with no ties to the area,\" Foster said. \"Ryan wrote me an email explaining his Pensacola ties. I didn't interview anyone after I interviewed Ryan.\" Beyond the work they'll do in the brewery to add to a growing craft beer hub in Pensacola, Foster, Schweigert and Brei said they'll do their part to help preserve wild Florida. Whether it be personally volunteering with the Florida Park Service or partnering with The Longleaf Alliance of Milton to benefit the ecosystem, the guys at Odd Colony said their new venture is about more than just beer. \"Our tagline is 'Scavenge, Ferment, Transcend,'\" he said. \"Scavenge, talking about forging local ingredients, ferment, obviously talking about the beer that we'll produce from that, and then transcend being the bigger calling. Transcending beyond beer. What can we do to give back to the community and what can we do to give back to the wild spaces that we love and we're inspired by in northwest Florida.\" Odd Colony will also serve some wines and will eventually make its own kombucha and session ales, which are beers with a lighter alcohol content. A private event room will be available for rent when the brewery launches. ECSO deputy shot multiple times expected to make full recovery Four days into Pensacola cyberattack, officials don't know if personal information was compromised Gulf Breeze demolishes old fire station to make way for $2.2 million police station Wounded NAS Pensacola police officer, first to respond to shooting, helped others escape scene Milton revokes Jones Street license, paving the way for Panhandle Butterfly House to open Jake Newby can be reached at jnewby@pnj.com or 850-435-8538. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://www.pnj.com/story/news/local/2019/10/16/odd-colony-brewing-co-opens-downtown-pensacola-thursday/3975019002/",
      "text": "Odd Colony Brewing Co. opens in downtown Pensacola on Thursday News Sports Play Opinion Advertise Obituaries eNewspaper Legals LOCAL Odd Colony Brewing Co. opens Thursday on North Palafox Street Jake Newby Pensacola News Journal Thursday will mark the opening of another new brewery in Pensacola as Odd Colony Brewing Co . will pour its first few rounds of specially brewed, one-off beers from its 16 unique bone-handle taps. \"We're going to brew the whole gamut but we're focusing on three big styles,\" said co-owner Brett Schweigert Tuesday from the inside of his new taproom at 260 N. Palafox St. \"The first style we'll kind of hang our hats on is traditional sours brewed with distinct locality. Basically introducing as much local agriculture as possible.\" After the sours, old-world style lagers and Odd Colony IPAs form the brewing foundation for the company co-owned by Blake Foster and anchored on the brewing end by Ryan Brei. Ba ckground on Odd Colony, its founders: Odd Colony Brewing Co. to bring wilderness-inspired beers to Pensacola this summer \"We're going to have a couple of beers that will be like mainstays, I think the general idea is to keep things fresh and exciting,\" Brei said. \"Keep pushing what we can do. Like we'll have probably an American lager that will always be hanging around.\" At 4 p.m. Thursday, Pensacola's growing community of craft beer fans can finally enter a taproom that Schweigert and Foster describe as an urban farmhouse influenced by the Northwest Florida ecosystem. \"We pulled a lot on the inspiration side from kind of a Scandinavian influence, with the stark contrast between the black walls and the light maple,\" Schweigert said, pointing to the towering shelves behind the bar and taps. \"But then also like the urban farmhouse blended with some New Orleans funk.\" Vintage, multi-color furniture surrounds the taproom of the 4,765-square-foot brewery. To the immediate left of the entrance is the art wall, featuring about 20 pieces of art made by local artists. \"One of the biggest themes for us is making a product with distinct locality or sense of place and that goes beyond the beer itself. So we have the art wall, for instance,\" Schweigert explained. \"It's all local artists and it's a seasonal thing. We celebrate a lot of seasonality here.\" The conglomeration of art will switch up every six months. \"Anyone in here can buy that art, but they can't pick it up until the end of the season,\" Brei said. \"Ten percent of the sales from the art goes to the Wildlife Sanctuary of Northwest Florida .\" There are a few tables outside in front of the brewery and another dozen or so in the tap room. Smaller two-seat tables line the back walls of the taproom leading to the Odd Colony event space, which is decorated with more vintage couches and lounge chairs, as well as animal skulls sent straight from the Colorado ranch of Foster's family. \"Wild Florida is obviously a big influence and kind of making its presence felt through different knick-knacks we have lying around,\" Schweigert said. The event room will serve as an additional lounge whenever it's not booked for private events like rehearsal dinners, beer dinners and weddings. The space will also be home to a lot of live music, including a Tuesday, Nov. 5, performance by the nationally acclaimed Chris Staples from Seattle. Odd Colony adds to Pensacola's already thriving brewery scene. Recently, a national market research company found Pensacola to have the ninth most breweries per capita in the country. The brewery's three head men and bar manager Eniko Ujj said there's less of a competitive culture among the Pensacola breweries than one might think. They describe it as more of a city-wide camaraderie. \"One of the most uplifting parts is seeing the brewing community actually really start to come together,\" Schweigert said. \"We've had really somebody from mostly every brewery out there in the Pensacola area come help us at different parts of the project, unprompted. \"So when people ask that question, 'What about the competition?' we're bringing something that is distinctly us and unique to the area, and I think the other breweries are doing the same. So we think we can all co-exist.\" Two more breweries on the cusp of opening: The 5 Barrel brewery coming soon to Palafox in downtown Pensacola Emerald Republic Brewing Co. to open in Pensacola on West Government in 2019 On top of being the newest addition to the Pensacola brewery community, Odd Colony is excited to do its part in transforming the North Palafox pocket of downtown Pensacola into a destination area. \"With the lower rent situation, I think that's why you see so much youth and excitement moving north like Nomadic Eats , Mrs. Jones Coffee , Big Jerk Soda are all right in our back alley,\" Foster said. \"So I'm hoping this migration north will continue and inspire brands.\" The Nomadic Eats and Two Birds food trucks are two of the many that Odd Colony is scheduling to park near the brewery on different nights of the week. Odd Colony doesn't have a kitchen, so it will rely on food truck partnerships to satisfy hungry customers in their taproom. Odd Colony is open from 4 to 10 p.m. Monday through Thursday, 4 to 11 p.m. Friday, 11 a.m. to 11 p.m. Saturdays and 11 a.m. to 10 p.m. Sunday. Those one-off brews available on opening day are The Basement Grapes (6.4% alcohol content) and The Ardent Naturalist (5.2%). Only one keg of each was brewed. Jake Newby can be reached at jnewby@pnj.com or 850-435-8538. ECSO deputy shot multiple times expected to make full recovery Four days into Pensacola cyberattack, officials don't know if personal information was compromised Gulf Breeze demolishes old fire station to make way for $2.2 million police station Wounded NAS Pensacola police officer, first to respond to shooting, helped others escape scene Milton revokes Jones Street license, paving the way for Panhandle Butterfly House to open About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://www.oddcolony.com/jobs",
      "text": "Jobs — Odd Colony Brewing Company Skip to Content Open Menu Close Menu Home Private Events About Squad Jobs 0 0 Home Private Events About Squad Jobs 0 0 Open Menu Close Menu Home Private Events About Squad Jobs Join the OC Team We are always accepting applications! Name * First Name Last Name Email * Phone * (###) ### #### Why do you want to work at OC? * LinkedIn profile: http:// Thank you! If you were not able to include a public link to your resume, please send it over in PDF format to brandi@oddcolony.com 260 N palafox, pensacola, fl 32501 | (850) 285-0743 © 2023 by Odd Colony Brewing Company"
    },
    {
      "url": "https://ffcfc.com/SBA-504-Loan-Taps-Odd-Colony-Brewing-Company-for-Success-exist-0",
      "text": "SBA 504 Loan Taps Odd Colony Brewing Company for Success {meta_title} Increase Font Decrease Font Greyscale Highlight Links Regular Font Reset SBA 504 Loan Interest Rates August 2025 25-Year Fixed Rate Standard: 6.237% 25-Year Fixed Rate Refinance: 6.266% 20-Year Fixed Rate Standard: 6.255% 20-Year Fixed Rate Refinance: 6.285% 10-Year Fixed Rate Standard: 6.174% 10-Year Fixed Rate Refinance: 6.210% Official monthly SBA 504 effective interest rate tables can be found at Eagle\n        Compliance LLC . 25- and 20-year term loans fund every month; 10-year term loans fund every other month. Effective interest rates are inclusive of servicing fees, which are subject to\n        credit risk of the applicant. Search facebook twitter linkedin instagram Looking for some help? Call 800.504.LOAN or Email Us Loan Programs SBA 504 Loan Program for Borrowers 504 Overview & Eligibility 504 Commercial Real Estate Loans 504 Machinery & Equipment Loans 504 Green Loan Program 504 Commercial Debt Refinancing SBA 504 Loan Program for Lenders & Credit Unions SBA 504 Loan Program for Realtors & Brokers SBA 504 Loan Program for Economic Developers 504 Bridge Loan Program Overview Frequently Asked Questions Rebuild Florida Business Loan Fund Florida Recycling Loan Program Florida Finance Network News & Media FCF News Alabama News Florida News Georgia News Our Story About Florida First Capital Board of Directors Contact Us Talk to a Loan Expert Company Directory Interest Rates Menu Servicing the States of Alabama, Florida, and Georgia. Lending News Archives Lending News Archives Back to News SBA 504 Loan Taps Odd Colony Brewing Company for Success May 2020 In an urban farmhouse inspired setting in downtown Pensacola, Florida, Odd Colony Brewing Company pours rounds of hand crafted beers, featuring area agriculture, from its 16 unique bone-handle taps. Filled with local art and unique furnishings, the friendly farm to table-like taproom of the 4,765 square-foot brewery is an homage to the Northwest Florida roots of its co-founders, Blake Foster and Brett Schweigert. Head brewer, Ryan Brei, formerly with the renowned Goose Island Beer Co., is Pensacola's first professional brewer. Together, Brei and Schweigert are brewing a distinct locality into the traditional sours, old-world style lagers and Odd Colony IPAs with a focus on seasonality. \"The general idea is to keep things fresh and exciting,\" Brei said. \"Keep pushing what we can do.” Looking to bring a taste of wild Florida to Pensacola's blossoming beer scene, Odd Colony worked with Florida First Capital to secure Small Business Administration (SBA) 504 financing for leasehold improvements to a property in the Pensacola Urban Core Community Redevelopment Area. With a total cost of $806,200 and 80% financing with a 3.13% fixed interest rate for 10 years, Odd Colony hopped on the project. “Borrowers and lenders often don't think of an SBA 504 loan for leasehold improvements,” said Stacey Green, Florida First Capital Business Development Officer for Northwest Florida. “Low fixed interest rates and lower fees compared to a 7(a) loan preserves vital working capital for borrowers.” With an SBA 504 loan on tap to finance furnishings and equipment, stout success is brewing for Odd Colony. Visit Odd Colony at www.oddcolony.com or follow them on Facebook and Twitter . The SBA 504 Loan Program provides up to 90% financing at below-market, fixed interest rates and long amortization terms up to 25 years for the purchase of major fixed assets, such as owner-occupied commercial real estate, renovations, new construction, energy efficient “green” initiatives and/or fixed heavy duty machinery and equipment, as well as the refinance of commercial mortgage and other business debt with or without a cash-out option. Under a typical 504 loan structure, a commercial lending partner provides financing for 50% of the 504 loan and takes a first lien position; Florida First Capital/SBA provides 40% of the project financing and takes a second lien position; and the borrower provides a down payment of just 10% in most cases. 504 loans provide up to $5 million of aggregate SBA eligibility on standard 504 projects; up to $5.5 million per 504 energy efficient green project not exceed $16.5 million in the aggregate; and up to $5.5 million per eligible small manufacturing project with no limit on total SBA dollars available. These are SBA 2nd mortgage loan portions only; there is no limit on overall project dollar size. For more information about SBA 504 loans in Alabama, Florida or South Georgia, contact a Florida First Capital/First Capital Finance Loan Officer or email us at info@ffcfc.com . Phone: 850.681.3601 or toll-free at 800.504.LOAN. Archived 2025 - June 2025 - April 2025 - March 2025 - February 2024 - October 2024 - August 2024 - June 2024 - May 2024 - April 2024 - January 2023 - November 2023 - October 2023 - September 2023 - August 2023 - July 2023 - June 2023 - April 2023 - March 2023 - February 2022 - November 2022 - October 2022 - August 2022 - July 2022 - June 2022 - May 2022 - April 2022 - March 2022 - February 2022 - January 2021 - December 2021 - November 2021 - October 2021 - September 2021 - August 2021 - July 2021 - June 2021 - May 2021 - April 2021 - March 2021 - February 2021 - January 2020 - December 2020 - November 2020 - October 2020 - September 2020 - August Contact Us facebook twitter linkedin instagram First Capital Finance/Florida First Capital First Capital Finance/Florida First Capital (FCF/FFC) is a non-profit certified development company promoting economic development and job creation.\n        Under the SBA 504 Loan Program , FCF/FFC works with private-sector lenders to provide eligible small\n        business owners in Alabama, Florida, and Georgia with below-market, fixed interest rate long-term financing to buy or build commercial property and/or purchase fixed heavy duty machinery and\n        equipment. Florida First Capital also lends under the Rebuild Florida Business Loan\n        Fund as well as the Florida Recycling Loan Program and other small business\n        assistance programs. Corporate Headquarters: 1351 N. Gadsden Street, Tallahassee, FL 32303.  Ph: 800.504.LOAN or 850.681.3601. © 2023 First Capital Finance/Florida First Capital Finance.  All Rights Reserved."
    }
  ]
}