{
  "fuentes": [
    {
      "url": "https://www.odysseyspa.com/pages/contact",
      "email": "reservations@odysseyspa.com"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1018@2x-285x300.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1018@2x.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1055@2x-150x150.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1055@2x-300x300.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1055@2x-768x766.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1055@2x.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1056@2x-150x150.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1056@2x-300x300.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1056@2x-768x768.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1056@2x.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1057@2x-150x150.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1057@2x-300x300.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1057@2x-768x766.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1057@2x.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1077@2x-300x126.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1077@2x.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1078@2x-300x67.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-1078@2x.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-968@2x-1024x861.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-968@2x-300x252.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-968@2x-768x646.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-968@2x.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-969@2x-1024x861.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-969@2x-300x252.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-969@2x-768x646.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "group-969@2x.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "paper_thing-copy@2x-1024x1024.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "paper_thing-copy@2x-150x150.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "paper_thing-copy@2x-1536x1536.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "paper_thing-copy@2x-2048x2048.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "paper_thing-copy@2x-300x300.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "email": "paper_thing-copy@2x-768x768.png"
    },
    {
      "url": "https://www.odyssey.school/privacy-policy/",
      "email": "privacy@odyssey.club"
    },
    {
      "url": "https://odyssey-grp.com/our-people/",
      "email": "info@odyssey-grp.com"
    },
    {
      "url": "https://www.adventuresinodyssey.com/new/",
      "email": "screens_new@2x-1024x398.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/new/",
      "email": "screens_new@2x-1536x597.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/new/",
      "email": "screens_new@2x-2048x796.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/new/",
      "email": "screens_new@2x-300x117.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/new/",
      "email": "screens_new@2x-768x298.png"
    },
    {
      "url": "https://www.adventuresinodyssey.com/new/",
      "email": "screens_new@2x.png"
    },
    {
      "url": "https://www.theodysseytours.com/contact-us",
      "email": "bookings@theodysseytours.com"
    },
    {
      "url": "https://www.theodysseytours.com/contact-us",
      "email": "info@theodysseytours.com"
    }
  ],
  "mails": [
    "bookings@theodysseytours.com",
    "group-1018@2x-285x300.png",
    "group-1018@2x.png",
    "group-1055@2x-150x150.png",
    "group-1055@2x-300x300.png",
    "group-1055@2x-768x766.png",
    "group-1055@2x.png",
    "group-1056@2x-150x150.png",
    "group-1056@2x-300x300.png",
    "group-1056@2x-768x768.png",
    "group-1056@2x.png",
    "group-1057@2x-150x150.png",
    "group-1057@2x-300x300.png",
    "group-1057@2x-768x766.png",
    "group-1057@2x.png",
    "group-1077@2x-300x126.png",
    "group-1077@2x.png",
    "group-1078@2x-300x67.png",
    "group-1078@2x.png",
    "group-968@2x-1024x861.png",
    "group-968@2x-300x252.png",
    "group-968@2x-768x646.png",
    "group-968@2x.png",
    "group-969@2x-1024x861.png",
    "group-969@2x-300x252.png",
    "group-969@2x-768x646.png",
    "group-969@2x.png",
    "info@odyssey-grp.com",
    "info@theodysseytours.com",
    "paper_thing-copy@2x-1024x1024.png",
    "paper_thing-copy@2x-150x150.png",
    "paper_thing-copy@2x-1536x1536.png",
    "paper_thing-copy@2x-2048x2048.png",
    "paper_thing-copy@2x-300x300.png",
    "paper_thing-copy@2x-768x768.png",
    "privacy@odyssey.club",
    "reservations@odysseyspa.com",
    "screens_new@2x-1024x398.png",
    "screens_new@2x-1536x597.png",
    "screens_new@2x-2048x796.png",
    "screens_new@2x-300x117.png",
    "screens_new@2x-768x298.png",
    "screens_new@2x.png"
  ],
  "nombre_sitio": "odysseyadventureclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.odysseyspa.com/pages/contact",
      "text": "Contact Us - Odyssey Spa Hertfordshire Skip to content ABOUT US ABOUT US MEET THE TEAM CAREERS PARTNERS GALLERY BLOG TREATMENT MENU TREATMENT MENU SPA DAYS FACE BODY FACE & BODY HAIR REMOVAL BEAUTY HOLISTIC WELLNESS SUITE PREGNANCY SAFE WELLNESS FOR CANCER SPA DAYS SPECIAL OFFERS TREATCARD SHOP SHOP SKINCARE SKINCARE CLEANSE & TONE EYE CARE MASKS MEN'S MOISTURISERS NIGHT TREATMENTS PEELS & EXFOLIATORS SERUMS & OILS BODY & BATH BODY & BATH AROMATHERAPY BATH & SHOWER BODY EXFOLIATORS BODY MOISTURISERS BODY OILS JEWELLERY & FLIP FLOPS GIFTING GIFTING GIFT VOUCHERS SALE GIFT VOUCHERS CONTACT BOOK NOW Log in Facebook Instagram Search our site Clear ABOUT US MEET THE TEAM CAREERS PARTNERS GALLERY BLOG TREATMENT MENU SPA DAYS FACE BODY FACE & BODY HAIR REMOVAL BEAUTY HOLISTIC WELLNESS SUITE PREGNANCY SAFE WELLNESS FOR CANCER SPA DAYS SPECIAL OFFERS TREATCARD SHOP SKINCARE CLEANSE & TONE EYE CARE MASKS MEN'S MOISTURISERS NIGHT TREATMENTS PEELS & EXFOLIATORS SERUMS & OILS BODY & BATH AROMATHERAPY BATH & SHOWER BODY EXFOLIATORS BODY MOISTURISERS BODY OILS JEWELLERY & FLIP FLOPS GIFTING GIFT VOUCHERS SALE SHOP GIFT VOUCHERS ELEMIS PRO-COLLAGEN TONING MIST GIFT VOUCHERS CONTACT BOOK NOW Search our site Clear Log in Cart Cart Contact Have a question? Get in touch with the team at Odyssey Spa! Address Old Knebworth Lane, Stevenage, Herts, SG2 8DU Call Us 01438 313320 Email Us reservations@odysseyspa.com Opening Hours Monday CLOSED Tuesday 9am – 8pm Wednesday 9am – 9pm Thursday 9am – 9pm Friday 9am – 6pm Saturday 9am – 6pm Sunday 10am – 6pm Alternatively, fill in this form and we will get back to you shortly! Name Email * Phone number Comment Send message This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Treatment Menu DISCOVER OUR Treatment Menu Premium Skincare SHOP OUR Premium Skincare Spa Day Packages EXPLORE OUR Spa Day Packages Our Story DISCOVER Our Story QUICK LINKS CONTACT SHOP SEARCH LEAVE US A GOOGLE REVIEW TERMS & CONDITIONS KEEP UP TO DATE Enter email here Never miss a beat with the Odyssey Newsletter! Facebook Instagram Follow us on social media! © 2025, Odyssey Spa . All rights reserved. Designed by Lucky Seven Marketing Home Menu Search Shop Cart Account Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://www.adventuresinodyssey.com/join-the-adventure/",
      "text": "Join the Adventure - Adventures in Odyssey LOG IN Join the Club The Adventures in Odyssey Club is a fun-filled, faith-centered place for your family to learn and grow The Adventures in Odyssey Club is a fun-filled, faith-centered place for your family to learn and grow Join the Club Join the Club As an audio drama, Adventures in Odyssey uses professional actors and audio production to bring stories to life. The music and sound effects help the listener create vivid imagery in their mind’s eye. It’s an engaging way to spark creativity, encourage critical thinking and instill Christian values. The Adventures in Odyssey Club helps the whole family grow closer to Jesus and to each other. Episodes are the perfect length for car rides. And Club membership gives your family exclusive access to the full library of episodes—plus daily devotions, fun videos, faith-building activities and more! Join the Club Club membership is family-friendly, with customizable parental controls and age-appropriate content that helps kids apply biblical principles in their own lives. Club members can connect with each other on closely monitored message boards—to learn and grow a safe, faith-centered environment. The Adventures in Odyssey Club offers fun, faith and excitement for the whole family! The Adventures in Odyssey Club offers fun, faith and excitement for the whole family! On-demand, streaming access to more than 900 episodes. 25-minute episodes are the perfect length to captivate, engage and entertain. Personalized accounts let each family member customize their experience and engage at their own pace. Custom playlists and smart search features help members listen by theme or topic. Closely monitored message boards build connections and camaraderie. Members receive a subscription to Focus on the Family Clubhouse™ magazine, an award-winning monthly publication for kids that includes even more games and activities, including a special section for Adventures in Odyssey Club members. On-demand, streaming access to more than 900 episodes. 25-minute episodes are the perfect length to captivate, engage and entertain. Personalized accounts let each family member customize their experience and engage at their own pace. Custom playlists and smart search features help members listen by theme or topic. Closely monitored message boards build connections and camaraderie. Members receive a subscription to Focus on the Family Clubhouse™ magazine, an award-winning monthly publication for kids that includes even more games and activities, including a special section for Adventures in Odyssey Club members. Join the Club Join the Club Join the Club On-demand, streaming access to more than 900 episodes. 25-minute episodes are the perfect length to captivate, engage and entertain. Personalized accounts let each family member customize their experience and engage at their own pace. Custom playlists and smart search features help members listen by theme or topic. Closely monitored message boards build connections and camaraderie. Members receive a subscription to Focus on the Family Clubhouse™ magazine, an award-winning monthly publication for kids that includes even more games and activities, including a special section for Adventures in Odyssey Club members. Your next great adventure awaits Join the Adventures in Odyssey Club and give your family a virtual home away from home. (Billed as $107.88 every 12 months) SAVE 10% (Billed as $107.88 every 12 months) SAVE 10% (Billed as $56.94 every 6 months) SAVE 5% (Billed as $56.94 every 6 months) SAVE 5% (Billed as $56.94 every 6 months) SAVE 5% Join the Club Join the Club Join the Club Join the Club Join the Club Join the Club Join the Club Join the Club Monthly Monthly Monthly Monthly Monthly Monthly Monthly Monthly “What I love about Adventures in Odyssey is how it makes learning about the love of God and His principles fun and exciting for everyone!” – Wesley C “I love Odyssey because the characters, plots, and drama draw me into fun and entertaining stories, all while teaching me life lessons and truths about God. Adventures in Odyssey definitely challenges me to live for God.” – Carly W “I love Odyssey because the characters, plots, and drama draw me into fun and entertaining stories, all while teaching me life lessons and truths about God. Adventures in Odyssey definitely challenges me to live for God.” – Carly W. “What I love about Adventures in Odyssey is how it makes learning about the love of God and His principles fun and exciting for everyone!” – Wesley C. “I love Odyssey because the characters, plots, and drama draw me into fun and entertaining stories, all while teaching me life lessons and truths about God. Adventures in Odyssey definitely challenges me to live for God.” – Carly W. “What I love about Adventures in Odyssey is how it makes learning about the love of God and His principles fun and exciting for everyone!” – Wesley C. A family-friendly place for your whole family Adventures in Odyssey is an award-winning audio drama series that’s created for 8 to 12-year-olds, but enjoyed by the whole family! Each 25-minute episode brings biblical principles to life with fun characters and engaging storylines. By joining the Adventures in Odyssey Club, families gain access to unlimited episodes, exclusive content, faith-building games, daily devotions and more. A family-friendly place for your whole family Adventures in Odyssey is an award-winning audio drama series that’s created for 8 to 12-year-olds, but enjoyed by the whole family! Each 25-minute episode brings biblical principles to life with fun characters and engaging storylines. By joining the Adventures in Odyssey Club, families gain access to unlimited episodes, exclusive content, faith-building games, daily devotions and more. Listen Radio Start Here About History Contact Us Store Books Listen Radio Start Here About History Contact Us Store Books"
    },
    {
      "url": "https://www.odyssey.school/privacy-policy/",
      "text": "Odyssey Club Privacy Policy - Safeguarding Your Data Skip to content Our Teaching Team Admissions FAQs Apply now Apply now Our Teaching Team Admissions FAQs Enroll Now It is our mission to help middle school students explore the professional world. To achieve this, we have designed a year-long, structured fellowship where students will get hands-on exposure to the world of work and personalised coaching. It is hence critical that we create a safe and secure environment where teachers, children, and parents freely share content and ideas. Creating such a safe and secure environment is central to the success of our endeavours. Last Updated: October 8, 2023 Introduction This Privacy Policy governs the use of data collected by our website www.odyssey.school and our Odyssey Fellowship Program (hereafter, collectively referred to as “the Service”, “Odyssey”, or “the Odyssey Fellowship”). By using Odyssey, you are agreeing to this Privacy Policy. If you do not agree, please refrain from using Odyssey. You can contact us anytime with queries about this Privacy Policy at privacy@odyssey.club . Definitions Profile: This includes personally identifiable information that we collect when you register for the Service. This may include First Name, Last Name, Email, and Phone Number of the user. Student Data: Any data collected by Odyssey that can be linked back to an individual student. This contains name, age, Email ID, name of parents, school name, phone number and the assessment data. Odyssey Program Data: Information related to the students’ participation, progress, and performance within the Odyssey Fellowship Program. “Program Insights” Odyssey analyses the Odyssey Program Data and converts them into actionable points to support teachers in teaching and learning. This set of actionable data-points is collectively referred to as Insights. What is Odyssey? Odyssey is a year-long fellowship program for middle school students, designed to explore the world of work, discover passions, and acquire vital interdisciplinary skills. It combines live online and in-person sessions, providing exposure to various career domains and personalized coaching. Odyssey is committed to safeguarding the privacy of student information, ensuring responsible stewardship, protection, and transparent handling of student personal information. Odyssey and Privacy Certifications Odyssey is committed to safeguarding the privacy of student information, ensuring responsible stewardship, protection, and transparent handling of student personal information. Parental Consent We collect parental consent for all students who participate in the Odyssey program. If you discover an instance where Odyssey is collecting information from a student without parental consent, please contact us immediately at privacy@odyssey.club . Compliance with Data Protection Laws Odyssey adheres to applicable data protection laws and regulations, ensuring the privacy and security of the data we handle. Data Collected by Odyssey We collect data necessary for providing Odyssey services, minimizing the data we collect about our users. This includes information from students, parents, and schools. What is the data NOT collected for? We do not allow advertising or sharing data for advertising for any data collected through Odyssey We never display ads, share data for the purpose of displaying ads, or allow data collection by advertisers or data brokers We never sell data to anyone for any purposes We never allow profiling of our users for targeted online ads Data Retention Odyssey will keep your data for only as long as it is required or as mandated by law or as requested by the 3rd party. Before deleting your data, Odyssey will send out 3 reminders to you. Cookie Policy We use Cookies and other similar services (such as Local Storage) to keep you logged in to Odyssey, customize your Odyssey experience, understand how you use Odyssey, and promote Odyssey to relevant teachers and schools. You can remove or disable cookies via your browser settings, in which case your experience with Odyssey will not be optimal. Abandoned accounts We consider an account to be abandoned if it has not been accessed for over a year. We will delete an account and all content associated with such accounts. However, to prevent accidental deletion, we will notify the teacher, the school and any other email IDs associated with the account and provide an opportunity to download the data of the abandoned account. Viewing, editing or Porting your information Parents are encouraged to work directly with teachers and school to make any changes in your data. If however, you need to get in touch with us, you can write to privacy@odyssey.club and we will work with the school and do our best to make the required changes. Teachers, administrators and parents can directly edit their information in their Odyssey profiles. Schools also have a right to use any other similar service and can place a request to get all of their data. We will do our best to comply with such requests. Once the pending request is processed, the data retention and deletion policies will be followed. Deleting Odyssey Account You have the right to “forget ability”, i.e., we will remove all your information from our systems if you so wish. If you would like to delete your Odyssey account or any content submitted to Odyssey, please send an email to to privacy@odyssey.club . We will notify you by email before deleting your account from our database. After receiving your request, we may still retain information for up to 365 days to provide customer support and prevent accidental deletion. Data Protection Practices We follow the latest, industry standards to protect your data. Some measures that are in place include use of highly secure, access-controlled data centres, data encryption in transit, and encryption data at rest etc. Despite these measures, in the event of a security breach, we will notify affected account holders within the amount of time required by the local law or by Odyssey’s internal data breach policy, whichever is more stringent, so that you can take steps to keep your data safe. Changes to the Privacy Policy We may from time to time make changes to this Privacy Policy to account for changes to our practices or applicable law. If we make changes to this Privacy Policy that we believe will materially affect your rights, we will notify you by email about these changes. If you continue to use our service after you receive notice of changes to this Privacy Policy, we will assume that you have accepted these changes. For previous versions of the Privacy Policy, please reach out to us at privacy@odyssey.club . Contact Information Our Data Protection Officer is Nikhil Gumbhir. If you have any questions about this Privacy Policy, please feel free to write to us at: privacy@odyssey.club and we will reach out to you as soon as possible. If you are based in India and you have any grievance or complaint about how your personal data is being processed you can contact the Grievance Officer for India – Nikhil Gumbhir via e-mail address privacy@odyssey.club . Odyssey (n) A journey marked by adventure, exploration, and personal growth. (v) To embark on a transformative path, discovering one's passion and purpose. 590, 12th Main Rd, HAL 2nd Stage, Indiranagar, Bengaluru, Karnataka 560038, India +91 77189 03454 | hello@odyssey.school Company Odyssey Our Team FAQs Privacy Policy Apply Now"
    },
    {
      "url": "https://odyssey-grp.com/our-people/",
      "text": "Our People - Odyssey Group Divisions Asset Management Wealth Management Real Estate Our People Giving Back Blog Careers Contact Select Page Odyssey Group believes in identifying the top, experienced talents in this space in order to consistently generate innovative, attractive investment opportunities in the market today. Over the years, we have been fortunate to attract some of the most talented professionals in our industry. They stay to build rewarding careers because of our entrepreneurial spirit, a commitment to our people and the high expectation for excellence. We believe that people are our most valuable asset to provide the highest quality investment plan to our valued clients. All Advisory Board Asset Management Board Distribution Fund Management Management Team Operations Private Equity Real Estate Wealth Management Alexander Walker Dan Vovil David Nicholas Ainsworth Mullikkottu Veetil Ramadasan Lanny Lim John Miller Shinji Yamauchi Richard Lo Kiyoshi Hirasawa Yutaka Matsunaga Margaret Yao Sam Luck Yuki Baba Kentaro Aoki John Kakita Ruben Tobias Riza Marinduque Contact Us GET IN TOUCH Facebook X Instagram © 2022 Odyssey Group. All rights reserved. Disclaimer | Personal Data Protection Policy - SG | Personal Data Protection Policy - HK Alexander Walker Position: CEO Department: Odyssey Group Industry Experience: 22 years Nationality: Australian Country Experience: Australia, Hong Kong, Singapore & Dubai Languages: English Alex Walker is the CEO & Co-Founder of Odyssey Group Limited. Alex is actively involved in the planning and strategic direction of the company, including the day-to-day management decisions for the group, the subsidiary and portfolio companies. Alex is the Chairman of the group and Board member of the respective subsidiaries and portfolio companies of the group. Alex’s seasoned business leadership skills and people management expertise developed over 22 years in the finance industry allows him to successfully execute changes and bring about the company’s growth and overall success. Alex has more than two decades of experience in the onshore, offshore finance and banking industry, leading projects ranging from establishing a bank, to listing companies and building and selling asset management companies. Prior to the establishment of Odyssey Group, Alex held senior positions at Swiss Asia Asset Management (HK) Ltd and Financial Partners, two of Asia’s leading wealth and asset management companies. Mr. Walker is educated in the fields of Business, Finance, Health Science and the Arts, which allows him to bring a wealth of knowledge to any business that he is managing. Dan Vovil Position: President Department: Odyssey Group Industry Experience: 22 years Nationality: Australian Country Experience: Australia & Hong Kong Languages: English, Italian (conversational) and Thai (conversational) Daniel Vovil is a Co-Founder and President of Capital Odyssey Group. He leads investment projects, sales and distribution across all business lines and divisions. Daniel is a Board member of the group’s respective subsidiaries and portfolio companies. He is a qualified chartered accountant and has worked in the financial industry for more than 17 years. Daniel held Director positions within the Investment Banking divisions at Macquarie and Standard Chartered Bank in Hong Kong. Clients included large institutions across the Asia Pacific-listed securities. He managed an international team of 100+ analysts and 20 sales consultants throughout Asia. In addition to the Investment Banking and Securities industry, Daniel has over 20 years of experience in real estate private equity across 9 countries. Daniel holds a Bachelor of Commerce in Accounting and Finance from the University of Western Australia. David Nicholas Ainsworth Position: Head of Institutional Sales Department: Odyssey Group Industry Experience: 30 years Nationality: British Country Experience: London, Hong Kong, Tokyo, Vietnam, Thailand Languages: English Nick has many decades of experience in the finance and banking industry. Nick’s most recent role was in Saigon as CMO for Dragon Capital, the largest investment firm in Vietnam. During his tenure, AUM rose from US$1 billion to US$6 billion, and several new funds were launched. His financial career began in London in 1984 with a Japanese investment bank, from there he moved to Morgan Stanley where he remained for 21 years in sales and management roles in Japanese and Asia Pacific equity distribution from Hong Kong, Tokyo, and London. Following this were 4 years at Macquarie Bank in Hong Kong as regional head of sales, and before his 6 years in Vietnam, 3 years at an independent research platform as their global head of sales. In all his roles, he has been focused on institutional investor marketing, sales, and investor relations; he has built a very large and diverse network in the process. Nick holds an MA in natural sciences (biology) from the University of Cambridge and an MBA from the City University Business School (CASS). Mullikkottu Veetil Ramadasan Name: Mullikkottu Veetil Ramadasa Position: Managing Director – Wealth Management Department: Private Clients Industry Experience: 35 years Country Experience: Singapore, Hong Kong, India, Middle East Languages: English, 3 Major Indian Languages Ram is an experienced private banker with over 35 years of experience in the finance field across APAC regions. Prior to his joining, he was in Credit Agricole Group in Hong Kong as the Head of Division of Commodities and Trade Finance with Clients among Asian countries such as India, Thailand, Sri Lanka, etc. He led the team to bring in new strategies for profit maximisation and company long-term development. He has 20 years of industry experience across Asia in wealth management. He has been responsible for Client Relationships and Marketing Services. He strives to provide best services to his clients and is very specialised in Portfolio Management covering Global Equities, Fixed Income Products, Forex Structured and Derivative Products. Ram holds a Masters Degree in Science from the Mandras University and Associate of Chartered Institute of Bankers. On top of being elected as an Associate of the Hong Kong Institute of Bankers, he also has the CPWP Certification from the Private Wealth Management Association. Lanny Lim Position: Chief Investment Officer Department: Asset Management Industry Experience: 25 years Nationality: Australian Country Experience: Singapore, Hong Kong, and Australia Lanny’s career background has been at the forefront of the financial markets for more than two decades. Most of his experience has been focused on equity and fixed income, as well as alternatives and manager selection. He oversaw top-ranked research teams and improved his analytical skills until he was led as the Global Head of Investment Research by ABN Amro Bank. In the second half of his career, he applied these skills to the buy-side, where he achieved numerous awards for his financial management performance.  He has 15 years of experience managing multi-strategy absolute return mandates for one of Asia’s large family offices and institutions with funds ranging in size from USD100mn to USD2.5bn, and serving as the chief investment officer of a wealth management firm that invests in all key asset classes. His clients included family offices with tens of billions of dollars in revenue, along with large pension and insurance companies in Europe. His academic background in research enables him to fully understand investments. He holds two master’s degrees and has published several articles in international journals. John Miller Position: Senior Advisor Department: Advisory Board Industry Experience: 20 years Nationality: American Country Experience: United States, Canada, Hong Kong and. Japan Languages: English Mr. Miller is a qualified Architect and has 30 years’ experience in the hotel and hospitality industry, primarily in Asia. He has worked in the design, development and project management of both greenfield developments, hotel Acquisition, conversion and renovation projects. Mr. Miller has worked for major real estate and hospitality investment and development groups including Prudential Insurance, MGM Hotels, The Peninsula Group (Tokyo) and Four Seasons. Shinji Yamauchi Position: Senior Advisor Department: Advisory Board Industry Experience: 20 years Nationality: Japanese Country Experience: Japan and the United States Languages: English and Japanese Mr. Yamauchi is a seasoned finance and private equity professional in Japan. Mr. Yamauchi served as the MD of Global Private Equity for SBI HOldings for more than 10 years. Prior to working with SBI, Mr. Yamauchi worked for Masayoshi Son (founder of Softbank) and acted as the CFO to lead the IPO of Trend Micro on the Tokyo Stock Exchange. He also worked as an M&A banker at Morgan Stanley, New York, and Tokyo. Mr. Yamauchi is a graduate of the Japan Defence Academy and earned his MBA at Columbia in New York and is fluent in both English and Japanese. Richard Lo Position: Non-Executive Director Department: Board Industry Experience: 40+ years Nationality: Hong Kong Country Experience: Hong Kong, Japan and, Singapore Languages: English and, Cantonese Mr. Lo has over 40 years of business experience in Japan, including engaging in distributorships of computer and related products for major Japanese corporations in China and South East Asia. Mr. Lo has over 20 years of experience in real estate investment management and has invested in real estate in Japan since 1999. Mr. Lo has established a wide network of contacts in both the property and corporate sectors in Japan. Mr.Lo is a founder and director of a computer and related-products distribution group of companies, but he is no longer involved in the daily operations of these companies and will dedicate substantially all his time to the Asset Manager. Mr. Lo was instrumental in founding and listing Saizen REIT on the Singaporean exchange. Saizen REIT originally owned a portfolio of around 166 residential properties across 14 cities in Japan, valued at JP 39B (US$ 350M). Mr. Lo holds a Master of Business Administration from the University of California, Los Angelas (UCLA). Kiyoshi Hirasawa Position: Senior Advisor Department: Advisory Board Industry Experience: 25 years Nationality: Japanese Country Experience: Japan, Hong Kong, Singapore, and Vietnam Languages: English and Japanese Mr. Hirasawa is the Founder and CEO of Real Capital K.K and has been involved in the Asian private equity and real estate industry as a lawyer, advisor and fund manager since 1990. He also served as Senior Vice President with Rothschild, where he started a Private Equity fund and made several investments. Mr. Hirasawa worked as a corporate lawyer with one of Japan’s leading law firms, Nagashima Ohno & Tsunematsu and was involved in several landmark transactions. Mr. Hirasawa graduated with an LL.B from the University of Tokyo and holds an MBA from the Stanford Graduate School of Business, Stanford University. He is fluent in English and Japanese. Yutaka Matsunaga Position: Non-Executive Director Department: Board Industry Experience: 20 years Nationality: Japanese Country Experience: Japan, Hong Kong, and Singapore Languages: English and Japanese Mr. Matsunaga is based in Tokyo, Japan, and has been managing Japanese real estate since 1999. He has over 20 years of experience in real estate investments and has established an extensive network in the property market in Japan. From 1999 to 2001, Mr. Matsunaga was the chief investment officer and director of JAIC International (HK) Co Ltd, a wholly-owned subsidiary of Japan Asia Investment Co Ltd, one of the largest specialist private equity investments managers listed on the Main Board of the Tokyo Stock Exchange. Mr. Matsunaga was instrumental in founding and listing Saizen REIT on the Singaporean exchange. Saizen REIT originally owned a portfolio of around 166 residential properties across 14 cities in Japan, valued at JP 39B (US$ 250M). Mr. Matsunaga holds a bachelor’s degree in commerce from Meiji University. Margaret Yao Position: Senior Director Department: Private Clients Industry Experience: 38 years Nationality: Chinese Country Experience: Hong Kong & USA Languages: English, Mandarin, Cantonese Margaret is an experienced private banker with over 26 years of investment management experience in both the APAC and North American regions. Most notably, Margarete previously held positions as Director of Investments within the Private Wealth Division of Bank of America Merrill Lynch where she managed a USD150m portfolio and UBS where she managed a portfolio of over USD300m. Margaret has also held numerous management positions across the priority banking, consumer banking and investment services divisions within Citibank in New York and Hong Kong, where she supervised operations and developed client relationships. Margaret has a Bachelors of Arts in Sociology from the University of Saskatchewan in addition to being an active member of numerous professional and social organizations including the Hong Kong Professional Women Association, Y’s Men Club and Po Leung Kuk where she serves as a director. Sam Luck Position: Associate Director – Operations Department: Head of Operations Industry Experience: 7 years Nationality: Australian Country Experience: Australia, Taiwan, China & Hong Kong Languages: English, Korean & Japanese Sam is the head of operations for the Japan Real Estate team at Odyssey and works closely with senior management, the real estate team, and third-party providers. He is also directly involved in working with international investors, the wealth management team and administrative staff for the fund and syndication divisions. Sam was most recently an Analyst at Odyssey and helped develop the firms’ network in Taiwan and China. He has start-up and mature business operational experience and has worked in Sydney, Taiwan, Shanghai and now Hong Kong. Previously an analyst for a tech start-up, Sam has been involved in systems implementation, human resource management & employment relations, staff recruitment and training. Prior to this role, Sam was the team leader for National Australia Bank’s custodial services division in Sydney. Sam has Australian and Korean heritage and was also educated at the Sydney International Japanese School. Sam majored in Psychology and Human Resource Management at the University of Sydney. Yuki Baba Position: Japanese Hospitality Real Estate Advisor Department: Japan Advisory Board Industry Experience: 10 years Nationality: Japanese Country Experience: Japan, Hong Kong, UK & France Languages: Japanese(Native), English(Fluent) & French(Fluent) Yuki Baba is a Senior Advisor to Odyssey’s Japan Real Estate Department, with a specialization in Japanese Hospitality Real Estate, particularly the Ryokan Sector (traditional Japanese Inns). Yuki supports Odyssey with her extensive personal industry experience, network of operators, brokers, private sellers and associations with a multitude of service providers and industry professionals. Yuki has extensive experience in the Ryokan sector. Previously a Ryokan owner herself, Yuki has first-hand experience operating, restructuring, managing and exiting this unique asset type. Yuki provides deep insight and skills to drive new business plans, enhance profits, promotion to international clientele and leading exit strategies to completion. Yuki started her career as an international cabin attendant at All Nippon Airways. She then moved into the finance sector, working in the air leasing department of Chase Investment Bank, in Tokyo. Yuki holds a BA of History from the University of the Sacred Heart (Japan) and a MA from Birkbeck, University of London. Kentaro Aoki Position: Consultant, Private Equity Real Estate Department: Private Equity Real Estate Industry Experience: 20 years Nationality: Japanese Country Experience: Japan and USA Languages: English and Japanese Kentaro Aoki as Consultant for the Odyssey Japan Real Estate Division. Mr. Aoki provides expert insights on hotel operations, acquisition, asset valuation, restructuring, cashflow & revenue management, budgeting, hotel operator selection & contract negotiation, feasibility studies and pre-opening planning. He has held various operational and management positions in the industry over the past 20 years working for, and with, a number of well-known hospitality groups throughout Japan, including AMAN, Hilton and the SAVVY collective with financial management and asset management positions with institutions including Idera Capital Management. Mr. Aoki has extensive experience with cashflow management focusing on profitability, together with broad knowledge and developing a wide network of operating partners, brokers and other hospitality specialists. Mr. Aoki graduated from Meiji University with a Bachelor’s Degree in Business Administration and later from Cornell University, New York with a Master of Management in Hospitality.” John Kakita Position: Managing Director – Japan Real Estate Department: Odyssey Asset Management Industry Experience: 20 years Nationality: Japanese Country Experience: USA & Japan Languages: English, Japanese John Kakita is the Managing Director in charge of Japan Real Estate at Odyssey Asset Management. Kakita-san is actively overseeing the company`s real estate projects in Japan including acquisitions of new hospitality assets and management of fund operations. In the industry, John has been assuming various executive positions for the past 20 years. At Goldman Sachs Realty Japan, he led Asset Management of its 4-5 star hotel asset portfolio including newly formed REIT assets, which follows his assignment as Hilton’s Regional Director of Japan & Micronesia, managing the global hotel chain’s operations in the region. John also engaged in the development of 5 star hotels in Japan as head of development at a Japanese major real estate company. Most recently, John has been, on the investor-side, working on development and asset management of hospitality assets including Ryokans as CIO of a real estate fund in Tokyo. Prior to the industry, John had been a marketing expert. His accomplishments in the arena include the launch of Apple Store in Japan as marketing manager of Apple Inc., and led Mobil Corporation’s brand management project in the Japan market as market research manager. Kakita-san obtained an MBA at Kellogg School of Northwestern University, and earned B.A. in Law at Waseda University. Ruben Tobias Position: Sales Associate Department: Distribution Industry Experience: 20 years Nationality: Filipino Country Experience: USA, Singapore & Philippines Languages: English, Filipino, and French (Conversational) Ruben is the Sales Associate for the Odyssey Group and will be responsible for building strong relationships with business clients. He will work closely with our team to ensure all partners, clients and prospects are serviced at the highest level. Ruben has an extensive 20-year experience in building strong relationships with B2B clients. He has held managerial designations at HSBC (HDPP) and REED ELSEVIER (LexisNexis) tasked in sales and client management. In addition, Ruben is also a trained financial trader and a licensed non-life insurance broker (MAPFRE). Riza Marinduque Position: Client Relationship Manager Department: Distribution Industry Experience: 10 years Nationality: Filipino Languages: English, Filipino and Visayan Riza has 10 years of customer service, sales, and technical support experience in Business Process Industry (BPO). She is responsible for generating/searching for prospective leads, setting up appointments, and ensuring that Odyssey’s products or services are presented to investors effectively. Moreover, she has five years of experience as a licensed real estate specialist in the Philippines. During their 2022 National Real Estate Convention, she was recognized for her exceptional sales. Divisions Asset Management Wealth Management Real Estate Our People Giving Back Blog Careers Contact"
    },
    {
      "url": "https://www.adventuresinodyssey.com/new/",
      "text": "New - Adventures in Odyssey The next great adventure awaits. Welcome to the Club, again. The Adventures in Odyssey Club is getting an update! We thought you’d enjoy a sneak peek at the new design and exciting new features. Although some elements may change a bit in the final version, these videos reveal some of the things you can look forward to seeing in the weeks to come. Then log in beginning July 18th, 2022 for a fresh, new Club experience! Welcome to the NEW Adventures in Odyssey Club experience! Here’s what you’ll find: Enhanced Sound & Controls Listen to Adventures in Odyssey like never before. Enjoy richer sound— more than double the audio quality —and an updated, easy-to-use player. Pause episodes at any point and the player will keep your place, even across multiple devices! And with the continuous-play feature, the next episode will begin automatically when the previous one is finished. A Personalized Adventure Managing your membership is easier than ever. With the new Adventures in Odyssey Club, everyone on your account uses the same convenient login information. Meanwhile, unique user profiles and optional PINs enable each child to watch episodes individually, post their own comments, create their own playlists, and earn their own badges. Custom Playlists The new Club grants members the freedom to build playlists of their favorite audio and video content. Browse themed playlists created by our actors and special guests. And if you’re not sure what to listen to—or whose turn it is to pick the episode—use Whit’s latest invention to play a random episode! Fun Badges Now members get an extra reward for listening to shows and completing Club challenges. The new Adventures in Odyssey Club experience includes a series of digital badges. Visit the badge folder to learn how to complete some of those challenges. Others may pop up as a total surprise. Keep exploring and collect them all! Smarter Search When the new Club goes live, it’ll be easier than ever to find what you’re looking for. In just a few clicks, a dynamic new search tool guides you to content based on title, theme, character or other key words. It’s like having a roadmap to Odyssey at your fingertips. Family-Friendly Features Parents now have more control, thanks to personalized profiles they can tailor to the ages and stages of young Odyssey fans. Is there a theme you’d rather avoid? Not comfortable with the message boards? Adjust each child’s settings according to your preferences. Remember : the new Adventures in Odyssey experience goes live on July 18th, 2022. We’ll see you soon at the NEW Adventures in Odyssey Club experience, where the next great adventure awaits! Smart new features. Same familiar faces. Smart new features. Same familiar faces. Smart new features. Same familiar faces. Frequently Asked Questions Can I use the same login on the new site? There will be some differences. The username will now be the email address of the Club account administrator. The password can be the same one the account administrator currently uses or the password can be reset. Does everyone on my account use the same login? Yes. Similar to other streaming services, there’s one login for everyone on the account. From there profiles should be set up for each person on the account. That way each person can customize their playlists, earn badges, etc. Do I need to set up a profile for each person on the Club account? Yes, we recommend that each person on your account has a profile. The account administrator can set up PIN numbers for each profile to allow for customized settings and controls for each. Will there a new app for mobile devices? Yes. If the mobile device is set for automatic updates, the new app may automatically be downloaded to your mobile device. If not, it can be downloaded from the App Store or Google Play. Who can I contact if I have questions or need help accessing the new Club platform? Call the Adventures in Odyssey helpline at 1-800-A-FAMILY (232-6459) Monday-Friday 6am – 8pm Mountain time. Or email us at [email protected] © 2022 Focus on the Family. All Rights Reserved. Privacy Policy"
    },
    {
      "url": "https://www.theodysseytours.com/contact-us",
      "text": "Contact The Odyssey Tours | Get in Touch | Book Your Adventure Contact Odyssey Tours | Get in Touch | Book Your Adventure Home Day Tours & Experiences Lisbon Tours Porto/Douro Tours Groups & Events Sintra & Cascais Tour Requests Contact Us Contact info@theodysseytours.com Home Day Tours & Experiences Lisbon Tours Porto/Douro Tours Groups & Events Sintra & Cascais Tour Requests Contact Us Call Us Feel free to give us a call. +351 920 101 898 Email Us For general inquiries & questions, contact us via email info@theodysseytours.com Visit Us Rua da Prata 80, 1100-415 Lisboa View on Map We’d love to hear from you. Choose the most convenient method and we’ll get back to you as soon as we can. Contact Us Name: Email: Phone: Message: Thank you for contacting us. We will get back to you as soon as possible Oops, there was an error sending your message. Please try again later +351 920101898 bookings@theodysseytours.com Rua da Prata 80, Lisboa, 1100-415, PT Visit Us! CONTACT INFO bookings@theodysseytours.com Rua da Prata 80, Lisboa, 1100-415, PT USEFUL LINKS Home Day Tours & Experiences Lisbon Tours Porto/Douro Tours Groups & Events Sintra & Cascais Tour Requests Contact Us FOLLOW US Join our mailing list! Thank you for joining our mailing list! Oops, there was an error sending your message. Please try again later Share by: Powered by Bókun"
    }
  ]
}