{
  "fuentes": [
    {
      "url": "https://support.river.com/kb/guide/en/how-do-i-contact-rivers-support-team-8w7bpRgp5H/Steps/2175612",
      "email": "you@company.com"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "email": "teachertraining@theriveryogadenver.com"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "email": "retreats@theriveryogadenver.com"
    },
    {
      "url": "https://riveractionuk.com/about/",
      "email": "info@riveractionuk.com"
    },
    {
      "url": "https://riveractionuk.com/about/",
      "email": "media@riveractionuk.com"
    },
    {
      "url": "https://www.takemetotheriver.org/contact/",
      "email": "info@takemetotheriver.org"
    },
    {
      "url": "https://www.takemetotheriver.org/contact/",
      "email": "rupert@prbpresents.com"
    },
    {
      "url": "https://folar.org/",
      "email": "contact@folar.org"
    },
    {
      "url": "https://folar.org/",
      "email": "sponsorships@folar.org"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "andy.jones@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "benjamin.gregory@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "chris.carter@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "chris.hood@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "dave.furlong@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "david.walters@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "emma.rogers@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "ethan.dent@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "info@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "jeff.cummins@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "jim.moore@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "john.gray@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "jonathan.nelson@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "marc.dabbadie@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "marion.savill@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "mark.borzomato@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "martin.sutton@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "rae.reardon@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "sarah.moss@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "steve.hitchen@rivercapitaluk.com"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "email": "sue.chambers@rivercapitaluk.com"
    },
    {
      "url": "https://riverlink.com/contactus/",
      "email": "customerservice@riverlink.com"
    }
  ],
  "mails": [
    "andy.jones@rivercapitaluk.com",
    "benjamin.gregory@rivercapitaluk.com",
    "chris.carter@rivercapitaluk.com",
    "chris.hood@rivercapitaluk.com",
    "contact@folar.org",
    "customerservice@riverlink.com",
    "dave.furlong@rivercapitaluk.com",
    "david.walters@rivercapitaluk.com",
    "emma.rogers@rivercapitaluk.com",
    "ethan.dent@rivercapitaluk.com",
    "info@riveractionuk.com",
    "info@rivercapitaluk.com",
    "info@takemetotheriver.org",
    "jeff.cummins@rivercapitaluk.com",
    "jim.moore@rivercapitaluk.com",
    "john.gray@rivercapitaluk.com",
    "jonathan.nelson@rivercapitaluk.com",
    "marc.dabbadie@rivercapitaluk.com",
    "marion.savill@rivercapitaluk.com",
    "mark.borzomato@rivercapitaluk.com",
    "martin.sutton@rivercapitaluk.com",
    "media@riveractionuk.com",
    "rae.reardon@rivercapitaluk.com",
    "retreats@theriveryogadenver.com",
    "rupert@prbpresents.com",
    "sarah.moss@rivercapitaluk.com",
    "sponsorships@folar.org",
    "steve.hitchen@rivercapitaluk.com",
    "sue.chambers@rivercapitaluk.com",
    "teachertraining@theriveryogadenver.com",
    "you@company.com"
  ],
  "nombre_sitio": "offtheriver.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://support.river.com/kb/guide/en/how-do-i-contact-rivers-support-team-8w7bpRgp5H/Steps/2175612",
      "text": "How do I contact River? | River Help Center Skip to main content 0% How do I contact River? River Help Center Managing my account Support How do I contact River? River Help Center Managing my account Support River Home River Learn Contact us How do I contact River? Our Help Center contains answers to the most frequently asked questions. If you’re not able to find the answer to your question in our Help Center, you can email or call Client Services. You can email Client Services anytime at support@river.com . If you wish to instead speak with a live representative, you may also call us at (888) 801-2586 during business hours: Monday through Thursday 9:00 AM - 7 :00 PM EST Friday 9:00 AM - 5:00 PM EST Contact a member of our team"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "text": "Contact Us: We're Here to Help! Reach Out to Our Denver Denver Yoga Studio | The River Yoga | Golden Triangle, Sunnyside, Five Points &amp;amp;amp;amp;lt;img height=\"1\" width=\"1\" style=\"display:none\"\n  src=\"https://www.facebook.com/tr?id=646216975547069&amp;amp;amp;amp;amp;ev=PageView&amp;amp;amp;amp;amp;noscript=1\"\n/&amp;amp;amp;amp;gt; 0 Skip to Content About Meet the Team Mission & Vision Contact Us River Partners + Community Locations Golden Triangle Sunnyside Five Points Schedule Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Pricing Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Open Menu Close Menu About Meet the Team Mission & Vision Contact Us River Partners + Community Locations Golden Triangle Sunnyside Five Points Schedule Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Pricing Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Open Menu Close Menu Folder: About Back Meet the Team Mission & Vision Contact Us River Partners + Community Folder: Locations Back Golden Triangle Sunnyside Five Points Folder: Schedule Back Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Folder: Pricing Back Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Contact Us We’d love to hear from you! General Inquiries hello@theriveryogadenver.com To cancel or pause your membership you must notify us via our Membership Change Form at least 7 days before your next billing date Teacher Training & Continuing Ed. Inquiries TeacherTraining@theriveryogadenver.com Retreats retreats@theriveryogadenver.com Frequently Asked Questions Visit us at our 3 Denver, CO locations and online: Five Points Sunnyside Golden Triangle Online Studio Name * First Name Last Name Email * Message * Thank you! Locations Golden Triangle Sunnyside Five Points HELP Contact Us My Account Membership Changes FAQ Careers Connect Newsworthy Gift Cards Nominate a River Magic Maker Community Partners ©2025 The River Yoga | Privacy Policy | Terms and Conditions | Disclaimer | Photography by Jes Kimak | Videography by Reah Agency"
    },
    {
      "url": "https://riveractionuk.com/about/",
      "text": "Our Mission - River Action UK Skip to content Campaigns News About Our Mission Our Impact Our Team Our Supporters Contact Join Us Take action Donate Campaigns Agriculture Sewage Influencing Policy News About Our Mission Our Impact Our Team Our Supporters Contact Join Us Take action Donate Campaigns Influencing Policy Agriculture Sewage Latest View All Independent Water Commission View campaign River Thames Campaign View campaign Our Mission & Strategy We’re on a mission to rescue Britain’s rivers Rivers are the lifeblood of our land. Their health is intertwined with our health as individuals and communities, and with  humanity as a whole. We would not be here without them, and we are dependent on their survival. Our rivers  are facing an environmental calamity, caused by a deluge of pollution and over-abstraction. We believe however, that  this can be reversed and they can be returned to their rightful, vibrant health. The Problem Our rivers are in crisis - they are  dying and our very life line is at risk. All Britain’s rivers are polluted. In England, only 14% of rivers have ‘good’ ecological status and zero have good chemical status. Climate-change driven floods and droughts combined with polluted water threaten communities’ health and water supply. Simultaneously, the government agencies tasked with monitoring and regulating rivers have been defunded so polluters profiteer with impunity. River Action was founded to tackle this crisis. We have devised a solution that goes to the root causes of the problem, using a holistic approach to cascade urgent systemic change across the country. Our Solution Our approach is grounded in community-leadership, natural systems and collaborative action. Our five-year strategy has three overarching goals: 1. Empower local communities: Provide communities and activists with a toolkit that enables them to rescue their local river catchments. Enable citizen science groups and NGOs to collect evidence of pollution levels such as excess nutrients and dangerous bacteria. 2. Mobilise public opinion: Raise public awareness through creative and original content designed to go viral, gain maximum exposure in the national media, and amplify activists’ voices. Leverage this awareness to influence the Government and polluting industries through petitions, boycotts, shareholder actions and positive direct engagement between stakeholders. 3. Advocate government policy and industry practice change: Drive government policy enforcement of regulations through taking legal action against the relevant government bodies and creating a charter of best practices for rivers to expedite reform in regulation, incentivise sustainable water management and to enforce the law. Catalyse behaviour change in polluting industries to adopt river-friendly practices by presenting them with evidence of the pollution they are causing, pressuring urgent investment in outdated infrastructure, offering nature-based solutions, and leveraging consumer and stakeholder support. Take Action End Toxic Sludge Sign the petition to stop spreading sewage sludge. Sign Petition Donate Donate to rescue Britain’s rivers. Donate River Rescue Kit Explore our River Rescue kit to find out how you can take action for your river. Learn more Tell Nando's Tell Nando's CEO: stop killing our rivers! Email the CEO Join us in our mission to rescue britain's rivers. Donate Subscribe to our newsletter Subscribe to our mailing list to keep up with our latest news. Name First Last Email Email This field is for validation purposes and should be left unchanged. Δ River action Campaigns News About Contact Get Involved Take action Donate Join Us Get In touch info@riveractionuk.com media@riveractionuk.com Terms Privacy © 2025 River Action UK | Charity Number: 1194995 Design: A-Side Code: Lewis Edward We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Reject Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. Enable All Save Settings"
    },
    {
      "url": "https://www.takemetotheriver.org/contact/",
      "text": "Contact - Take Me To The River Skip to content Home About Us Education Films & Albums Tour Shop Contact Donate Donate Main Menu Home About Us Education Films & Albums Tour Shop Contact Contact Support our education initiative by donating, volunteering, or spreading the word. Together, we can continue to build a legacy of musical education and cultural appreciation for generations to come. Phone Email us 😉 Donation Center 1001 Bridgeway, Sausalito CA 94965 Need assistance? Use the contact form below Get in touch How can we help you? Have questions or want to get involved? Contact us through our form or reach out via social media. Stay updated by signing up for our newsletter. Let’s keep the conversation about music and culture going. HQ Bridgeway Avenue Sausalito California For Touring and Music information Please contact our manager at info@takemetotheriver.org For booking outside the USA contact: Rupert Orton @ PRB Presents rupert@prbpresents.com Follow us on Facebook Instagram YouTube Twitter Full Name Email Subject Message Send Message The form has been submitted successfully! There has been some error while submitting the form. Please verify all form fields again. Where we work We work with hundreds of artists across the United States and Internationally. But we’re located in sunny California Keep the Music Flowing Every Dollar You Donate Echoes Through Generations! Donate Now A movement of social conciousness About Us Our History Our Films Our Albums Education Ways To Give Fundraise Paypal Brand Partnership Legacy Giving Contact Info info@takemetotheriver.org © 2025  Take Me To The River Education Initiative, a 501(c)3 Not For Profit Organization. All rights reserved. Scroll to Top"
    },
    {
      "url": "https://folar.org/",
      "text": "FoLAR organizes the Great LA River CleanUp Skip to main content Facebook instagram Youtube Linked About FoLAR Our Work K-12 Education The Great LA River Cleanup Community Events Advocacy and Policy River Fellows River Resources Get Involved Ways to Give Donate PayPal Benevity Memberships Donate from your DAF Events Donate Facebook instagram Youtube Linked Donate ☰ × Home About FoLAR Our Work K-12 Education The Great LA River Cleanup Community Events Advocacy and Policy River Fellows River Resources Get Involved Ways to Give Donate PayPal Benevity Memberships Events Join the Great LA River CleanUp October 11th & 18th Register Today! Scroll Down WHO WE ARE We build capacity for communities, students, and future leaders to advocate for nature, climate, and equity on the Los Angeles River. Learn More Impact Not long ago, most Angelenos didn’t even realize a River ran through their city. For almost 40 years, FoLAR has been working to change that. We make the LA River healthier, greener, and more accessible by restoring habitat, educating the next generation, and advocating for a future where both people and wildlife can thrive. Learn More Advocate The LA River is an iconic landmark, a vital resource, and a powerful tool for climate resilience. Stretching from Canoga Park to Long Beach, it connects communities across the city. FoLAR is working to ensure the River thrives and remains accessible to all Angelenos. Learn More Support With your help, we can keep the LA River healthy, accessible, and full of life. Through community events, education, and advocacy, we are working to protect and restore the River—but we can’t do it without you. Learn More Explore Whether you are kayaking, birdwatching, or just taking it all in, there are plenty of ways to connect with the River. FoLAR provides maps, field guides, and resources to help you discover everything the River has to offer. Learn More SIGN UP & STAY IN TOUCH SUBSCRIBE WHAT WE DO BRINGING THE LA RIVER TO LIFE FoLAR restores habitat, advocates for smart policy, and connects people to the LA River through education, community events, and hands-on action. K-12 Education FoLAR’s education programs bring the LA River into classrooms and students into the River, fostering the next generation of environmental stewards through hands-on learning and exploration. Community Events FoLAR’s events connect people to the LA River through shared experiences that inspire action, learning, and a deeper appreciation for this vital resource. Advocacy & Policy FoLAR works to ensure the LA River’s future is shaped by policies that prioritize ecological health, equitable access, and climate resilience, amplifying community voices in the decision-making process. Great LA River CleanUp Every year, thousands of volunteers join together to remove trash from the LA River, making it the largest urban river cleanup in the country and a powerful act of community-driven restoration. Membership & Sponsorship Opportunities Make a long-lasting impact on the LA River & its surrounding communities Individual Membership Learn More Organizational Membership Learn More Event Sponsorship Learn More 2025 Organizational Members Thank you for your generous support. M2O City of Long Beach REI Bank of America Niagara Cares WRD Stantec ladwp Harvard Westlake SoCal Gas Radford City National Bank Paramount Pictures Athens Services Be a Friend of the LA River! Attend an Event View More Attending a FoLAR event is a chance to connect with the LA River, meet like-minded people, and take meaningful action to restore and protect your neighborhood River. September 13, 2025 River Field Trip 10:00 am - 11:30 am DeForest Park, Long Beach September 27, 2025 Habitat Restoration Day September 8:00 am - 11:00 am Sepulveda Basin Wildlife Preserve Volunteer With Us Volunteering with FoLAR is a fun, hands-on way to help the LA River—join a cleanup, plant native habitat, or share your skills to support the community. Make a Donation Your support helps restore habitat, educate the next generation, and advocate for policies that protect the River for people and wildlife. Every contribution, big or small, makes a real impact in shaping the River’s future and ensuring it remains a resource for all Angelenos. FoLAR builds capacity for communities, students, and future leaders to advocate for nature, climate, and equity on the Los Angeles River. Donate Contact Main office: 323.223.0585 570 W. Ave 26 #250 Los Angeles, CA 90065 Office Hours: Monday to Friday 10am to 6pm General Inquiries: contact@folar.org Sponsorship Inquiries: sponsorships@folar.org Explore Home ABOUT US WHAT WE DO GET INVOLVED EMPLOYMENT DONATE Contact Us Privacy Policy Newsletter Follow Us Facebook instagram Youtube Linked © Copyright FoLAR 2025 Friends of the Los Angeles River (FoLAR) is a nonprofit and tax-exempt charitable organization (tax identification number is 95-4171497) under Section 501(c)(3) of the Internal Revenue Code. Donations are tax-deductible as allowed by law. Website Services by Skyhound Internet"
    },
    {
      "url": "https://rivercapitaluk.com/about-us/our-people/",
      "text": "Our People – River Capital About Us Our People Our Purpose & Values Environmental, Social and Governance Our Partners Products Venture Capital Mezzanine Funding Private Equity Investment Debt Funds Portfolio News Complaints Privacy Policy Cookies River Capital About Us Products Funds Portfolio News Let’s talk Let's Talk Our People Our Purpose & Values Environmental, Social and Governance Our Partners Fuelling Ambition Our People Our people Our people are unique and the strength of our team is crucial to our success. Come meet us: Dr Marc d’Abbadie Head of Venture & COO Mark Borzomato CEO and Head of Private Equity Chris Carter Investment Manager Sue Chambers Investment Manager Jeff Cummins Investment Manager Ethan Dent Marketing Manager Dave Furlong Investment Director John Gray Head of Debt Steve Hitchen Debt Portfolio Manager Ben Gregory Investment Manager Chris Hood Retail Operations Director Andy Jones Investment Manager Jim Moore Investment Manager Sarah Moss Head of Finance Rae Reardon Executive Assistant Marion Savill Portfolio Director Emma Rogers Business Support Manager Martin Sutton Venture Partner Jonathan Nelson Investment Manager Hannah Taylor HR Manager David Walters Investment Director Dr Marc d’Abbadie Head of Venture & COO marc.dabbadie@rivercapitaluk.com 0151 236 4040 What is my role? I am proud to look after River’s Equity practice as well our Operations and Compliance. Hobbies or interests outside of work? Tango Cooking Swimming. Favourite album? Appetite for Destruction by Guns n’ Roses. Mark Borzomato CEO and Head of Private Equity mark.borzomato@rivercapitaluk.com 0151 236 4040 What is my role? I am CEO of River and have been involved in private equity and investing for over twenty years. I am passionate about working with and supporting entrepreneurs/management of teams/SME’s to successfully deliver their aspirations. I am responsible for the strategic direction and vision of the business and maintaining our key stakeholder relationships, including with our investors. I am proud to lead a team at River who share this vision. Hobbies or interests outside of work? I manage a local football team I am a sporadic golfer A regular quiz go-er And full-time sufferer in the pain of being a Middlesbrough FC supporter! Favourite album? Rattle ‘n’ Hum by U2. Chris Carter Investment Manager chris.carter@rivercapitaluk.com 0151 236 4040 What is my role? I am an Investment Manager working on the NW BGL fund and responsible for the deployment of the fund across the North West, based from our Manchester office. We work to support the SME market at various stages of their growth cycle with funding requirements between £100k-£500k. Hobbies or interests outside of work? I am a massive sports and music enthusiast. I watch most sports on offer and, time permitting, am a keen runner, golfer, gym-frequenter, and with my footballing days very much heading towards their end, replacing this with playing darts! Favourite Album? Possibly the most difficult question I’ve ever been asked, and it depends on several factors such as what day of the week it is, what I had for dinner the night before, what direction the wind is blowing…. but I have chosen: Funeral For A Friend, Casually Dressed And Deep In Conversation Sue Chambers Investment Manager sue.chambers@rivercapitaluk.com 0151 236 4040 What is my role? I am an Investment Manager supporting small and medium businesses with debt finance up to £250,000 across the North West. In my role, I am also proud to be River’s Diversity and Inclusion Champion. Hobbies or interests outside of work? Theatre Concerts Pilates. Favourite album? Different Class by Pulp. Jeff Cummins Investment Manager jeff.cummins@rivercapitaluk.com 0151 236 4040 What is my role? I am an Investment Manager in our Debt team, who works with business owners and advisors to identify funding needs for a business and then deliver the most suitable solutions for that business. I am currently managing all enquiries and applications for the Flexible Growth Fund which is a debt fund aimed at supporting LCR businesses with transformational Capital Expenditure projects. Hobbies or interests outside of work? Playing Golf Watching Football Cycling, to keep fit & to watch. Favourite album? The soundtrack to Saturday Night Fever. Ethan Dent Marketing Manager ethan.dent@rivercapitaluk.com 0151 236 4040 What is my role? As Marketing Manager, I’m responsible for the day-to-day planning and execution of all marketing activities and support the business in communicating the types of funds we have available to investors. Hobbies or interests outside of work? Tragically supporting Everton Cricket Walking/Hiking. What is your all-time favourite album? Six60 by Six60. Dave Furlong Investment Director dave.furlong@rivercapitaluk.com 0151 236 4040 What is your role: I’m responsible for our private equity fund, investing in high quality businesses across the North West looking for help with accelerating their growth, change of ownership (management buy-out etc), succession planning, partial de-risking of owners stakes in businesses and acquisition strategies. Hobbies outside of work. I’m a keen (but very lapsed!) guitarist who’s moved into the ‘all the gear and no idea’ phase of life. I’m also a Liverpool FC season ticket holder, and lover of rugby, cricket and ice hockey. I’m also a listening volunteer for Samaritans. I also love walking our Labrador with my wife and two daughters. When I can keep up with them…. Favourite Album: Tough choice in a crowded field, but In Rainbows by Radiohead. John Gray Head of Debt john.gray@rivercapitaluk.com 0151 236 4040 What is my role? As Head of Debt, I work with the team of Investment managers and oversee a portfolio of over £40m of debt funds, including the Northern Powerhouse Investment Fund , Flexible Growth Fund , and Business Growth Loan Fund . I’m driven by the company’s long-term goals and ambitions and was particularly drawn to River Capital’s commitment to growing funds under management, which will enable us to provide more efficient and effective support to SMEs not only in the Liverpool City Region but beyond. Hobbies? Golf Running Getting out into nature Fave album? Meatloaf – Bat Out of Hell Steve Hitchen Debt Portfolio Manager steve.hitchen@rivercapitaluk.com 0151 236 4040 What is my role? I provide post-investment support to our Debt Portfolio clients as their dedicated point of contact. Alongside this I manage the “collections” side of the debt book. Hobbies or interests outside of work? Sporting.Keep fit/gym/rugby training Watching Saints RLFC Dining out. Favourite album? That’s the Way of the World by Earth, Wind & Fire. Ben Gregory Investment Manager benjamin.gregory@rivercapitaluk.com 0151 236 4040 What is my role? I am an Investment Manager investing from our flagship Private Equity fund across the North of England. The best part about my job is meeting and learning from ambitious Management teams who have genuine passion for their craft. In my opinion, there are lots of exciting businesses in the market who have aspirations of going on a growth journey but often do not meet the financial criteria set by typical PE funds, which is the gap we are looking to bridge. Hobbies or interests outside of work? Outside of work you will usually find me in the gym, playing golf or complaining about Everton. What is your all-time favourite album? Same Town by the Killers. Chris Hood Retail Operations Director chris.hood@rivercapitaluk.com 0151 236 4040 What is my role? As Retail Operations Director I work closely with Financial Advisers/Intermediaries to enable clients to invest in appropriate Tax Wrappers such as the River Capital AI Enterprise Investment Scheme. Hobbies or interests outside of work? Supporting Liverpool Football Club Keeping Fit by playing various sports Travelling Fave album? Back In Black AC/DC Andy Jones Investment Manager andy.jones@rivercapitaluk.com 0151 236 4040 What is my role? As part of the Debt Team, I look at funding propositions for businesses of all ages, shapes and sizes who are looking to grow, expand, consolidate or even get off the ground. My part of our business is to look at supporting entrepreneurs and companies looking for between £5,000 and £250,000. I lead on our Small Business Loan Fund which has enabled me to spend time with other small business lenders who are also part of the Responsible Finance network nationally. In addition, as our ESG Champion, I am looking at how our business can reduce its carbon footprint by working on a Net Zero project with the aim of reviewing working practices, energy usage etc to ensure we are playing our part in this critical area. Hobbies or interests outside of work? Socialising with friends and family Tranmere Rovers – following them attending games Tennis – playing and also an active member of the Committee at Pinewood LTC in Heswall. Favourite album? Melting Pot by The Charlatans. Jim Moore Investment Manager jim.moore@rivercapitaluk.com 0151 236 4040 What is my role? I focus on purely Loan & Mezzanine Debt Funds assessing and recommending loans typically from £100k up to £1m across the North-West. Hobbies or interests outside of work? All things Glasgow Celtic All things golfing Holidays involving sunshine. Favourite album? Anything by the ‘Boss’. Sarah Moss Head of Finance sarah.moss@rivercapitaluk.com 0151 236 4040 What is my role? I oversee the finance function of the business, including producing monthly management reports, analysis of the business performance and how to drive this forward. In addition, I create annual budgets, cash forecasting and regulatory reporting. Hobbies or interests outside of work? Running & triathlon training Walking my dog Kip Reading, a good crime novel or self development book. Favourite album? It’ll All Make Sense In The End by James Arthur. Rae Reardon Executive Assistant rae.reardon@rivercapitaluk.com 0151 236 4040 What is my role? I provide executive support to the CEO and general support to the wider team. My role includes managing the CEO’s diary, scheduling meetings, coordinating strategy days and events, and ensuring the smooth day-to-day running of the office. I arrange and take minutes for meetings across the Debt, Equity, and Venture investment committees, as well as for Portfolio Reviews. I also support the River Capital and MSIF boards by managing meeting schedules, preparing agendas, and taking minutes. Hobbies or interests outside of work? I am passionate about caring for dogs and love boarding them in my home! It is truly rewarding to provide a safe and happy space for them while their families are away on holiday. I also enjoy spending time outdoors, especially taking long walks on the beach or through local parks with them. Family plays a central role in my life, and I deeply value the time we spend together. Favourite Album Def Leopard – Hysteria Marion Savill Portfolio Director marion.savill@rivercapitaluk.com 0151 236 4040 What is my role? I manage a portfolio of equity investments mostly in the Merseyside Loan and Equity Fund. In addition to this, I work with the boards of our investee companies to help them achieve their strategic goals and ultimately to maximise the value of our investment via a sale or flotation. Hobbies or interests outside of work? I enjoy outdoor sports and activities I play hockey for Chester Ladies I am a regular runner and enjoy hill walking I also love travelling and skiing. Favourite album? 21 by Adele. Emma Rogers Business Support Manager emma.rogers@rivercapitaluk.com 0151 236 4040 What is my role? I have various jobs within the Company. I support our Debt Investment Team including drawing up offer letters, checking drawdowns, completing KYC/AML checks, making sure required reporting is done on time and dealing with audits of the funds. I also assist our Equity Team with collections and share reconciliations. Alongside the funds, I also help the Financial Controller with monthly/annual accounts. Hobbies or interests outside of work? I am part of my local judo club where I am also the Club Welfare Officer Spending time with friends – especially our trips to Kraków Swimming. Favourite album? Slippery When Wet by Bon Jovi. Martin Sutton Venture Partner martin.sutton@rivercapitaluk.com 0151 236 4040 My Role: To find great businesses that could be a fit for FundAI and help the founders navigate the investment process.  Having spent all my career working in fast growth / venture backed tech firms I’m passionate about making the investment process more straightforward for founding teams. Hobbies: Being outdoors either running or walking in the lakes with Lenny our Airedale Terrier followed by a pint of Guinness in a proper pub with a few mates. I’m also a bit of an anorak for older air-cooled Porsches. Favourite album: Plastic Beach by Gorillaz Jonathan Nelson Investment Manager jonathan.nelson@rivercapitaluk.com 0151 236 4040 About my role: I assist businesses in Lancashire and Cumbria with access to NPIF II funding and look to provide loans between £25,000 & £100,000k. Hobbies: I help manage a senior and Under 23s team at Croston Football Club, watch both my lads play football, regular taxi service for them as well, eating out with my wife Nicola which always includes coffee or a beer and occasionally a walk! Poor golfer, tennis player and exerciser but will give anything a go! Album: Parallel Lines by Blondie Hannah Taylor HR Manager 0151 236 4040 What is my role? As our HR Manager, I am responsible for managing River’s employee life cycle (recruitment, onboarding, training and leavers) as well as the administration of employee benefits. Working alongside the management team, it is my mission to ensure that River’s employees are adequately managed, appropriately compensated and effectively trained. Hobbies or interests outside of work? Book worm Going to gigs Following Manchester United across the U.K. and abroad. What is your all-time favourite album? St. Jude by The Courteeners. David Walters Investment Director david.walters@rivercapitaluk.com 0151 236 4040 What is my role? I work in the Equity Team as a Technology Investment Director and support technology businesses across the region. I have also operated as a CTO at multiple PE backed companies and have also run AI practices. Data and Artificial Intelligence is my superpower and I am a member of the DataIQ 100. Hobbies or interests outside of work? I collect and restore classic Italian scooters I play the guitar I support the mighty Tranmere Rovers. Favourite album? Sound Affects by The Jam. River Capital info@rivercapitaluk.com 0151 236 4040 River Capital Management Limited is authorised and regulated by the Financial Conduct Authority (FCA 180891) About Us Products Funds Portfolio News Contact Us Complaints Privacy Policy Cookies Investor Documents Linkedin Twitter Suite 6C, The Plaza, 100 Old Hall Street, Liverpool L3 9QJ Suite 9e, The Bloc, 17 Marble Street, Manchester, M2 3AW Copyright © 2025 River Capital All rights reserved"
    },
    {
      "url": "https://riverlink.com/contactus/",
      "text": "Contact Us - RiverLink Pay Tolls Open/Manage Account Tolling Options & Rates Overview Account With Transponder Account Without Transponder No Account Traveler Tips About Overview Tolled Bridges How It Works Non-Tolled Alternatives Project History Joint Board & Tolling Body Reports Contact/Help Contact Us FAQs How-To Guides Select Page Contact Us How Can We Help You? CALL 855-RIV-LINK Call Center: 8 a.m. – 6 p.m., Monday – Friday Send Message View Maps Kentucky Walk-Up Center: 8 a.m. – 6 p.m., Monday – Friday Indiana Walk-Up Center: 8 a.m. – 6 p.m., Monday – Friday Dispute Form (PDF) Believe You Were Charged in Error? Download the Toll Dispute Form (PDF), complete it and submit it using any of the methods described on the form. For more information, view the Toll Dispute FAQs. Dispute Form (PDF) Toll Dispute FAQs Pay by Mail RIVERLINK PO BOX 646000 CINCINNATI OH 45264-6000 Be sure to include your name, invoice number, license plate number (including state) and preferred contact information on all correspondence. Correspondence Address RIVERLINK PO BOX 436177 LOUISVILLE, KY 40253 Be sure to include your name and preferred contact information on all correspondence. Visit Us in Person Kentucky Customer Service Center Toll Dispute 204 S Floyd St Louisville, KY 40202 Kentucky Walk-Up Center: 8 a.m. – 6 p.m., Monday – Friday GET DIRECTIONS Indiana Customer Service Center Toll Dispute 103 Quartermaster Ct. Jeffersonville, IN 47130 Indiana Walk-Up Center: 8 a.m. – 6 p.m., Monday – Friday Off East 10th Street between Watt and Mechanic GET DIRECTIONS 204 South Floyd St, Louisville, KY 40202 103 Quartermaster Ct, Jeffersonville, IN 47130 Additional Help Frequently Asked Questions VIEW FAQs Step-by-Step How-To Guides View How-To Guides Learn About Transponders Transponder Info About RiverLink Contact Us Commercial Accounts & Fleet Vehicles RiverLink Account Terms & Conditions (PDF) Privacy RiverLink © 2023. All rights reserved. Follow Follow Follow Text Message Fraud Alert RiverLink is alerting customers about fraudulent text messages currently circulating in the market. These m essages impersonate tolling agencies nationwide, warning customers of unpaid tolls and indicate fees will be incurred if payment is not sent immediately. If you receive one of these texts, do not click the link . Instead, check your account directly at RiverLink.com or call our customer service team at 1-855-RIV-LINK. Recipients are encouraged to delete any fraudulent texts they may receive. If you have provided any personal information, contact your bank immediately. You can also report this to the FBI’s Internet Crime Complaint Center (IC3) at www.ic3.gov , or to the Federal Trade Commission at www.reportfraud.ftc.gov . You can also forward the suspicious message to 7726 (SPAM) to alert your mobile provider. Please reach out to our customer service team with any questions, or to check the status of your account at any time."
    }
  ]
}