{
  "fuentes": [
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "alvaro.vejar@aquatiq.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "angeles.brahm@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "arne.wrali@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "atletico.nathanael@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "audrey.campbell@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "bruno.paredes@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "carole.hedges@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "cesar.corona@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "chesa.febrizky@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "contact@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "elvin.bugge@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "fernando.suardi@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "guido.veliz@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "hanne.mertens@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "hemi.trifani@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "ivan.contreras@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "julie.bugge@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "julio.doval@aquatiq.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "luis.robles@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "margareth.famunghui@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "markus.wu@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "mike.friedman@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "peter.coull@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "rachel.brown@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "rodrigo.seitz@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "roy.strom@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "spiridion.adventino@aqua-pharma.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "synnove.venas@aquatiq.com"
    },
    {
      "url": "https://aqua-pharma.com/about/team/",
      "email": "tom.candy@aqua-pharma.com"
    },
    {
      "url": "https://www.forbes.com/sites/rachelingram/2024/07/04/how-aqua-expeditions-ceo-built-a-luxury-tourism-brand-on-waters-less-explored/",
      "email": "corrections@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/rachelingram/2024/07/04/how-aqua-expeditions-ceo-built-a-luxury-tourism-brand-on-waters-less-explored/",
      "email": "feedback@forbes.com"
    },
    {
      "url": "https://www.respectmyregion.com/okeechobee-festival-camping-stages-activities/image_2022-02-22_171907/",
      "email": "info@respectmyregion.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://aquaaction.org/en/contact",
      "email": "info@aquaaction.org"
    },
    {
      "url": "https://www.aquafinance.com/contact/",
      "email": "info@aquafinance.com"
    },
    {
      "url": "https://aquamea.com/en/about-us/",
      "email": "info@aquamea.it"
    }
  ],
  "mails": [
    "alvaro.vejar@aquatiq.com",
    "angeles.brahm@aqua-pharma.com",
    "arne.wrali@aqua-pharma.com",
    "atletico.nathanael@aqua-pharma.com",
    "audrey.campbell@aqua-pharma.com",
    "bruno.paredes@aqua-pharma.com",
    "carole.hedges@aqua-pharma.com",
    "cesar.corona@aqua-pharma.com",
    "chesa.febrizky@aqua-pharma.com",
    "contact@aqua-pharma.com",
    "corrections@forbes.com",
    "elvin.bugge@aqua-pharma.com",
    "feedback@forbes.com",
    "fernando.suardi@aqua-pharma.com",
    "guido.veliz@aqua-pharma.com",
    "hanne.mertens@aqua-pharma.com",
    "hemi.trifani@aqua-pharma.com",
    "info@aquaaction.org",
    "info@aquafinance.com",
    "info@aquamea.it",
    "info@reception-plus.de",
    "info@respectmyregion.com",
    "info@scibpaints.com",
    "ivan.contreras@aqua-pharma.com",
    "julie.bugge@aqua-pharma.com",
    "julio.doval@aquatiq.com",
    "luis.robles@aqua-pharma.com",
    "margareth.famunghui@aqua-pharma.com",
    "markus.wu@aqua-pharma.com",
    "mike.friedman@aqua-pharma.com",
    "peter.coull@aqua-pharma.com",
    "rachel.brown@aqua-pharma.com",
    "rodrigo.seitz@aqua-pharma.com",
    "roy.strom@aqua-pharma.com",
    "sales@finewineliquors.com",
    "spiridion.adventino@aqua-pharma.com",
    "synnove.venas@aquatiq.com",
    "tom.candy@aqua-pharma.com"
  ],
  "nombre_sitio": "okeechobeefest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://aqua-pharma.com/about/team/",
      "text": "Team – Aqua Pharma Skip to content Menu Menu Salmon Farming Bath treatments Dosing units and services Shrimp Farming Water conditioning and oxygenation Sustainability About About us Team Pioneering Media Contact OUR team Sort: Management South America North Atlantic South-East Asia Group Support Services Show all Management team Elvin Bugge CEO +47 911 01 112 elvin.bugge@aqua-pharma.com Hanne Mertens COO +32 486 03 9069 hanne.mertens@aqua-pharma.com Synnøve Venås HR Business Partner +47 950 46 704 synnove.venas@aquatiq.com Business unit South america Cesar Corona General Manager, South America +56 982 986 118 cesar.corona@aqua-pharma.com Luis Robles General Manager, Ecuador luis.robles@aqua-pharma.com María de los Angeles Brahm Manager Técnico Veterinario +56 938 622 802 angeles.brahm@aqua-pharma.com Ivan Contreras Treatment Expert +56 982 792 889 ivan.contreras@aqua-pharma.com Rodrigo Seitz Logistics Manager +56 934 681 931 rodrigo.seitz@aqua-pharma.com Bruno Paredes Service Technician +56 9 3197 9117 bruno.paredes@aqua-pharma.com Guido Véliz Manager Técnico Veterinario & Project Manager +56 9 3243 8371 guido.veliz@aqua-pharma.com Juan Carlos Silva Hinojosa -EXT Safety Coordination BUsiness unit North atlantic Hanne Mertens COO +32 486 03 9069 hanne.mertens@aqua-pharma.com Rachel Brown Business Development Manager +44 7961 030 229 rachel.brown@aqua-pharma.com Arne Wråli Global Logistics & Customer Service Manager +47 417 67 918 arne.wrali@aqua-pharma.com Julie Bugge Marine Biology Project Manager & Quality Coordinator +47 951 62 390 julie.bugge@aqua-pharma.com Carole Hedges Logistics & Customer Service Manager, Quality Coordinator +44 784 381 7253 carole.hedges@aqua-pharma.com Álvaro Véjar Zúñiga Logistics & Customer Service Manager +44 746 857 7063 alvaro.vejar@aquatiq.com Peter Coull Treatment Supervisor +44 7286 555447 peter.coull@aqua-pharma.com business unit south-east asia Markus Wu General Manager, South-East Asia +62 817 819 567 markus.wu@aqua-pharma.com Atletico Nathanael Field Support Coordinator & Logistics Coordinator +62 8787 6811 555 atletico.nathanael@aqua-pharma.com Margareth Famunghui Microbiology Lead Researcher +62 81289260861 margareth.famunghui@aqua-pharma.com Chesa Febrizky Microbiology Tech Farm Support +62 81223789878 chesa.febrizky@aqua-pharma.com Hemi Tri Fani Aquaculture Laboratory Analyst +62 85712824024 hemi.trifani@aqua-pharma.com Spiridion Adventino Technical Coordinator +62 812 3165 8506 spiridion.adventino@aqua-pharma.com group support services Technical & health, Safety, environment Fernando Suardi Global Technical & HSE Manager +55 41 999348329 fernando.suardi@aqua-pharma.com research & development Roy Strøm Concept Expert & Internal Training +47 948 70 381 roy.strom@aqua-pharma.com Tom Candy Product & Regulatory Expert +44 738 424 2850 tom.candy@aqua-pharma.com Mike Friedman Principal Data Scientist & Project Coordinator +32 472 07 41 73 mike.friedman@aqua-pharma.com Business services Julio Doval Garcia Controller South America +47 481 29 777 julio.doval@aquatiq.com Audrey Campbell Spare Parts and Administrative Coordinator +44 7586 289639 audrey.campbell@aqua-pharma.com We operate around the world Aqua Pharma operate in 9 countries (Australia, Belgium, Canada, Chile, Ecuador, Indonesia, Norway, Scotland and the USA), with around 50 employees across the globe. Aqua Pharma Group is structurally backed by two innovative parent companies, Solvay (a global leader in sustainable materials and solutions) and Aquatiq (a Norwegian reference in Food Safety). Contact us We’re happy to answer any questions and get you introduced to Aqua Pharma. Send us an e-mail, call one of our regional managers or fill out the form. Either way we will respond as quickly as possible contact@aqua-pharma.com First name Last name Email address Subject Message Yes, I accept that my information is stored and processed. Salmon Farming Bath treatments Dosing units and services Shrimp Farming Water conditioning and oxygenation Sustainability About About us Team Pioneering Media Contact Aqua Pharma Phone: +47 61 24 70 10 E-mail: contact@aqua-pharma.com Find us on Linkedin Headquarters Hovemoveien 1 2624 Lillehammer Norway Directions at Google maps Copyright © 2025 Aqua Pharma Privacy Notice and Cookie Policy Terms and Conditions Transparency Act 🇬🇧 APG Supplier Code of Conduct 🇪🇸 APG Supplier Code of Conduct Copyright © 2025 Aquatiq Close Salmon Farming Bath treatments Dosing units and services Shrimp Farming Water conditioning and oxygenation Sustainability About About us Team Pioneering Media Contact"
    },
    {
      "url": "https://www.forbes.com/sites/rachelingram/2024/07/04/how-aqua-expeditions-ceo-built-a-luxury-tourism-brand-on-waters-less-explored/",
      "text": "How Aqua Expeditions CEO Built A Luxury Tourism Brand On Waters Less Explored Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions BETA This is a BETA experience. opt-out here Lifestyle Boats & Planes How Aqua Expeditions CEO Built A Luxury Tourism Brand On Waters Less Explored By Rachel Ingram , Contributor. Forbes contributors publish independent expert analyses and insights. Rachel Ingram is a reporter who covers superyachts and private jets Follow Author Jul 04, 2024, 05:35am EDT Jul 05, 2024, 04:39am EDT Share Save Comment Aqua Blu is transforming luxury expedition yachting in Indonesia Aqua Expeditions If you want to inspire Aqua Expeditions CEO and Founder Francesco Galli Zugaro, don’t tell him he’s brilliant, even though he is. Tell him he’s crazy. Tell him his ambitions are impossible. And then sit back and watch the magic happen. Galli Zugaro is a man who thrives on turning challenge into opportunity. The Italian-American has built a business operating luxury river cruises and yacht charters in some of the most complex destinations in the world – the Peruvian Amazon, the Vietnamese Mekong, the remotest Indonesian islands – onboard yachts he has had specially built. Since founding Aqua Expeditions in 2007, Galli Zugaro has created several game-changing travel propositions for “affluent explorers” and been commended for feats including launching Peru's first luxury river cruise on the Amazon River, transforming luxury expedition yachting in Indonesia with Aqua Blu , and taking the first commercial superyacht ( Aqua Mare ) to the Galapagos. And with a fleet of six boats and counting, he’s not done yet. As Aqua Expeditions prepares to announce its next project, we take a deep dive into Galli Zugaro’s greatest passions, chart his journey to success, and unveil the next steps of his master plan – which may soon be open to strategic investment. Francesco Galli Zugaro, CEO of Aqua Expeditions Aqua Expeditions Where did your passion for travel stem from? Francesco Galli Zugaro: Growing up in 16 countries put the travel bug in me. My dad was Managing Director for Latin America for Alitalia – it was in his blood to travel and this passed down to me. When my parents divorced, I started living with my mom and my stepdad; he was Bureau Chief for TIME magazine in many countries so we moved around from Germany to Lebanon to Israel to Cyprus to Italy, and so forth. After later graduating from Boston, I started working with a private equity group in South America that was investing in telecom and tourism. I ran the telecom startup for five years and then moved over to a small ship expedition investment that we made in the Galapagos. That was how I cut my teeth in travel. MORE FROM FORBES ADVISOR Best High-Yield Savings Accounts Of 2024 By Kevin Payne Contributor Best 5% Interest Savings Accounts of 2024 By Cassidy Horton Contributor What lead you to leave the private equity group and set up Aqua Expeditions ? Having left Ecuador and the investment there that we exited, I started looking around South America. Originally, I wanted to go to Argentina. There was an American gentleman called Douglas Tompkins who owned North Face and invested in buying up cattle ranches so I thought, ‘let's head out there’. On the way, I stopped at Iquitos and the Peruvian Amazon and I realise no one was doing the Amazon at a really high-end level’. I went around Iquitos with a Peruvian Navy Admiral who told me there was a 50-metre steel hull for sale around one of the tributaries. So, we took one of the Navy’s little tugboats and knocked on the shed and this guy sold it to me – I towed it away that day. I then commissioned a shipyard to obviously build it for me and brought in Jordi Puig, a very well-known Peruvian architect at the time. From buying it to launching it with heads and beds took us eight months. I don't claim to be the first, but I was the first at the top-end level catering to what I call today ‘affluent explorers’. Onboard Aqua Blu in Indonesia Aqua Expeditions Why did you pick South America to launch the business? I picked South America because I knew it. At the time, the hottest package in South America was Machu Picchu and Galapagos. Compared to Ecuador at the time, the potential growth in Peru was amazing. Orient Express had come in and has five properties and three trains so they were pumping money into promoting the destination. So, I thought, all I have to do is plug a great product in the Peruvian Amazon and it's automatically going to be packaged up into the circuit of Peru at the time. It was very easy to quickly position a top end premium product. So I sold my house in Ecuador, moved my whole family to Peru and put everything into it. It was a risk, but I have a healthy measured appetite for risk. Why did you decide to build a boat-focused business rather than enter the hotel market? Having operated in the Galapagos, I thought how cool is it that you can control the guest experience? To really curate a guest experience in a one-night stay in a hotel is very difficult – you can't really make an impact. With the whole yachting experience cruising experience, you can curate something and create really cool environment for guests. From a business perspective, these businesses are very cash rich because you can have high cash flow because people are booking ahead of time, with very few cancellations because these are long-haul aspirational trips. So, this has always been an appealing a both experiential and business opportunity. Service and hospitality is key onboard all of Aqua Expeditions' boats Aqua Expeditions Why did you decide to build 12-cabin boats, and do you have plans to create larger ships? I wanted something small. Originally the concept was to copy the idea of houseboats from Kerala put them on Amazon. I said ‘let's do four ships with two smaller cabins’, but when I ran the numbers, it wasn't scalable – the more you grow, the more fixed costs you have. Whereas on a 12-cabin ship, you can have 24 guests, but the economies of scale, as soon as you break even, become super attractive because our variable costs are very low. The only variable costs are the additional food and additional guides; the fuel and the operation are still fixed. Secondly, the guest experience has to be dictated by small groups. These are trips with a high level of engagement to the the connection with the guides is key. We will never do anything that's above four couples to a guide – that allows you really to have an opportunity to engage, and the guide can tailor the excursions to that group. You can’t accomplish something so unique with a 100-guest ship. Francesco Galli Zugaro in front of luxury river boat Aqua Mekong Quan light-writer Photography How many of your ships are private charters versus tour operator bookings? About a quarter of our business is private charter. Today, all of our ships operate 48 weeks. We have 30% charters, so about 15 charters a year, and most of them are private, but a lot of them are tour operator buyouts. So, in other words, a client comes in, buys out the ship for the week, and then resells it under their brand, because they package that up with a week in Siem Reap or Ho Chi Minh. On private charters, what happens a lot is that we have two principal clients paying and it was hard for them to figure out who gets that top owner suite. So, in our river ships we have three suites which are very similar and very large. We've done that on all the ships, and that's allowed us to appeal very well to a private charter client. Why did you choose to focus your business on areas that are more complex than others? I just like the challenge. I like the feeling of accomplishment when I’ve been told many times ‘no it’s impossible, or no, you’re crazy,’ and then I showcase that it can be done. It just requires a vision and the capacity to execute. What initially started off as a vision is today a realization of 300 talented individuals that are working with me, from crew to management. I like a challenge; I don't like to take the easy way out. My biggest enjoyment comes from seeing guests appreciate what we've done. Raja Ampat Aqua Expeditions Aqua Blu is redefining luxury expedition cruising in Indonesia . What lead you to operate in this destination? I liked Indonesia you still feel like you're exploring. Galapagos in comparison is very structured. It's an amazing guest experience, but it's very regimented. In Indonesia, you can go exploring to see volcanoes, find dragons and birds-of-paradise, sail around Raja Ampat and the Spice Islands, and see what nature throws at you. That excites me, even though it's very difficult to get the permits. It look me two years to get the permits to flag in Indonesia, but I want to bring guests to see these parts of the world that are logistically complicated, and do it at a very high level. What are your guests looking for, and how do you match destinations to meet their expectations? If you talk to our guests, they've done everything. They're looking for something cool, different and relaxed. They want the world-class service but they're not pretentious so they're willing to walk barefoot and let their hair down. And a destination has to check their boxes in terms of nature and wildlife. I chose the Vietnamese Mekong because it’s an iconic river connected to two iconic World Heritage sights – Siem Reap and Angkor Wat. And then I decided to operate in three marine biosphere reserves – Galapagos, Raja Ampat and Komodo – which are on everybody's bucket list. The next destinations will have a combination of that; they'll have either iconic rivers of the world or iconic coastal cruising that will provide a wildlife and nature component, and sometimes even a cultural component. Private beach sundowners at Komodo National Park Aqua Expeditions What are your long-term plans for the company? I've got a very clear map of exactly where I'm going to put ships. Pretty much true to form, I've delivered one every three years. Next year will be my 18th year and I'll be delivering my sixth ship. The details of where how and where will be revealed later this year. I've scouted the destinations and built itineraries – that's what I do on my off-time; I spend weeks and months scouting different bodies of water all over the world. That's my passion; finding new logistically complex destinations that I think I could venture into; raising the capital to finance the ships, because these are getting more and more expensive; and building unique itineraries. What opportunities are there for interested investors? This is a very profitable business because of our fixed costs. As long as you break even, profit could be in the range of somewhere around 50%. This year we’re going to exceed our forecast and forward bookings for 2025 are very strong already. From an investor point of view, I've obviously retained control of the business and continue to do so. It doesn't mean that that will continue to be the case in the future. I'm open minded to see if I can add value strategically from a strategic partner – I have access to capital, but that strategic capital is something that I'm looking for in the future so that I can strategically roll out my business faster, and maybe have an opportunity to bring passenger flow to us faster, rather than organically growing. There aren’t that many Aquas around. We’re the only business that has this size, this niche, this reach. The day Aqua goes out to market to find that strategic partner, I think it’s going to attract a lot of eyes that want to get into that space. Editorial Standards Reprints & Permissions LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Your Privacy Choices Cookie Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    },
    {
      "url": "https://www.respectmyregion.com/okeechobee-festival-camping-stages-activities/image_2022-02-22_171907/",
      "text": "How to Make the Most of Your Time at Okeechobee Music Festival: Camping, Stages, & Activities Skip to content About Advertise Contact Submissions About Advertise Contact Submissions Music Concerts / Live Music Music Festivals Electronic Rap & Hip-Hop Reggae Rock Culture Art Fashion Food & Drink Sports Basketball Esports American Football Soccer / Football UFC Submissions Music Concerts / Live Music Music Festivals Electronic Rap & Hip-Hop Reggae Rock Culture Art Fashion Food & Drink Sports Basketball Esports American Football Soccer / Football UFC Submissions Madi Forbes Events , Live Music February 23, 2022 How to Make the Most of Your Time at Okeechobee Music Festival: Camping, Stages, & Activities While the music lineup is one of the main reasons you might be going to the Okeechobee Music & Arts Festival, there are lots of other things that make this festival great. To experience Okeechobee Festival to the fullest, you have to check out all of the stages, activities, and more. Continue reading to find out more about the campground, activities, and stages. How to Max Out Your Experience at Okeechobee Music Festival Stages There are seven fantastic stages at the festival that will facilitate live performances from the artists you came to see. The Be Stage is the exceptional main stage. It is complete with two large screens that broadcast the stage happenings, so even from a distance, you can still catch all the action. Okeechobee music festival stages The Here Stage and Now Stage are also main stages that will be remembered fondly in your concert memory for their top-notch sound and beautiful architecture. Aquachobee Beach is a stage near a beach. Fans and festival friends can relax in the water, tan at the beach, and feel the electric roar of the crowd gathered at this iconic stage. When you are ready to get out of the sun, there is a shade that stretches over the crowd in front of the stage. Okeechobee music festival activities Jungle 51 is a smaller stage but that doesn’t mean it doesn’t impress. Complete with memorizing lights and fire DJ sets until 7am every day (besides Sunday, aka Monday, when it ends at 5am), you may want to dance here until the sun comes up. Okeechobee music festival camping Spanish speakers may have already known from the title, but the Incendia Stage is fire, literally. Incendia means fire and you’ll know why it got its name when you see the dazzling pyrotechnics showcased at the stage. This is a traveling stage that you may have came across at previous festivals, just as the RMR team did at Suwannee Hulaween . It is famous for hosting surprise b2b sets with some of the hottest names in EDM. Okeechobee music festival 2022 The last stage at Okeechobee Fest is the PoWoW! Stage . It will have performances from George Clinton & Parlament Funkadelic with Brandon “Taz” Niederauer & Mononeon, and surprise guests. Okeechobee music festival lineup Camping Camping at Okeechobee Fest is more than just a good alternative to renting a hotel. The campground will become your home for the event. It is a place to recharge and has activities and amenities for all festival campers to enjoy. Amenities include free filtered water, clean toilets, and shower pods. The shower pods will be open Thursday from 12pm to 7pm. Additionally, on Friday, Saturday, and Sunday it will be open from 7am to 7pm and on Monday it will be open from 7am to 1pm. Furthermore, the campground has 24-hour emergency medical services, a lost & found, merch booths, and general store booths. Activities Also offered at the campgrounds is Yogachobee. It is an activity that you don’t want to miss out on where you can reconnect your body and mind. Yogachobee is a place of restoration, inspiration, and alignment, and it’s encouraged to bring your mat, a drum, and to open up your heart and mind. Okeechobee music festival activities There is also the Healing Sanctuary near the camping area. It is a quiet oasis amid the noise and bustle of the large crowd gathered at Okeechobee. Each day, the Healing Sanctuary conducts morning meditations, Thai yoga and massages, neuromuscular and connective tissue therapy, biodynamic cranial touch, sound healing, shamanic workshops, and more. Furthermore, outside of the campgrounds you can find workshops, classes, and immersive art exhibits. For instance, you can attend classes from the Earth Arts Academy to connect more with the planet or do improv workshops at the Jive Joint. To find the art you can go to the Chobeewobee Village. It is a center with food and art, perfect to visit in between sets. FOR MORE CANNABIS & MUSIC NEWS, FOLLOW RESPECT MY REGION ON FACEBOOK & TWITTER . TO HAVE A STORY FEATURED OR YOUR BRAND OR PRODUCTS REVIEWED, PLEASE EMAIL US. Stay Connected Facebook Instagram X-twitter Envelope Disclaimer Warning: This product has intoxicating effects and may be habit-forming. Smoking is hazardous to your health. There may be health risks associated with consumption of this product. Should not be used by women that are pregnant or breast feeding. For use only by adults twenty-one and older. Keep out of reach of children and pets. Marijuana can impair concentration, coordination, and judgment. Do not operate a vehicle or machinery under the influence of this drug. The articles featured on this website are the opinion of the author and may not reflect the opinion of Respect My Region, its sponsors, advertisers, or affiliates. Prev Previous Propeller & Red Rocks Amphitheatre Team Up to Reward Concertgoers Through Social Impact Initiatives Next Marijuana Venture’s Interchange Trade Shows Offer Speed Dating-Like Networking in Washington and Oregon Next Related Posts Video Games ‘Hollow Knight: Silksong’ Breaks the Internet In Route to Game of the Year Contention Hollow Knight: Silksong is a side-scrolling action-adventure game (Metroidvania) from Team Cherry. The Hollow Knight series is beloved in the gaming world, and the newest Read More » NFL Raiders vs Patriots Week 1 Recap 2025: Las Vegas Take Down New England 20–13 The NFL owns the calendar from September through February. In 2025, it also owns your app library, your Sundays, and your late-night Twitter feeds. Week Read More » Technology How Fintech Apps Are Redefining Personal Finance in 2025 The fintech apps revolution has permanently changed the way people think about money. Once dominated by banks and credit unions, personal finance is now largely Read More » Search Facebook Instagram Envelope X-twitter About Advertise Contact About Advertise Contact ® Copyright 2025 Respect My Region | Sitemap"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name name Surname First Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://aquaaction.org/en/contact",
      "text": "Contact Us About Us Show submenu for About Us Our Mission and Vision Our Impact Our Team Our Youth Advisory Board Our Partners & Supporters Contact Us Partners The Freshwater Crisis Programs Show submenu for Programs AquaHacking Show submenu for AquaHacking Binational 2026 Prairies Past AquaHacking AquaEntrepreneur AquaNation Innovators Impact News Show submenu for News Blogs In the News Press Release Events Get Involved Show submenu for Get Involved Careers About Us Show submenu for About Us Our Mission and Vision Our Impact Our Team Our Youth Advisory Board Our Partners & Supporters Contact Us Partners The Freshwater Crisis Programs Show submenu for Programs AquaHacking Show submenu for AquaHacking Binational 2026 Prairies Past AquaHacking AquaEntrepreneur AquaNation Innovators Impact News Show submenu for News Blogs In the News Press Release Events Get Involved Show submenu for Get Involved Careers Donate English Français English English Contact us Get in touch. We would love to hear from you. Get In Touch Get in touch 800, rue du Square-Victoria Suite 411 Montréal (H3C 0B4) Québec, CANADA (Ax-C) 1520 Woodward Avenue Suite 300 Detroit MI USA 48226 (Urban Tech Xchange) Subscribe to our newsletter to add water impact in your inbox! AquaHacking waiting list AquaEntrepreneur waiting list Together, let’s take aqua action Please use the form to tell us more about yourself and let us know how we can help you. For the latest, follow us: Located on the traditional territory of the Kanien’kehá:ka (Mohawk), a place long served as a site of meeting and exchange amongst many diverse First Nations, including the Algonquin-Anishinaabe, Atikamekw, and Huron-Wendat. Donate Subscribe to our newsletter Our Mission Our Programs Our Partners Join Us Contact Us Privacy Policy Get social : #TakeAquaAction Dive in and give to help us create meaningful change today. Every drop counts! AquaAction is a registered charity in Canada and the United States. Canada Charitable Reg #: 79 333 5498 RR 0001 US Tax ID: 52-1273585 Established by Powered by Accelerated by"
    },
    {
      "url": "https://www.aquafinance.com/contact/",
      "text": "Contact Us - Get in Touch with Aqua Finance Skip to main content Welcome previous State Farm customers! As of April 14, 2025, Aqua Finance, Inc. will be servicing your account. Click here to learn more Customer Portal Dealer Portal ES About Dealers Customers News & Insights Contact FAQs Careers Diversity & Inclusion Customer Portal Dealer Portal ES Let’s talk. Friendly team members are standing by. Looking for a quick answer to your question? Check out our FAQs . Customer support Speak to a representative: 800-234-3663 , option 1 Send us a message Customer Portal Dealer support Water Treatment Home Improvement Recreation Media inquiries Locations 877-717-9494 [email protected] Dealer Portal 877-717-9494 [email protected] Dealer Portal 877-366-8406 option 5, ext. 6015 Fax: 715-849-4855 [email protected] For media inquiries contact [email protected] Corporate headquarters One Corporate Drive, Suite 300 Wausau, WI 54401 Mailing address PO Box 844 Wausau, WI 54402-0844 Additional Locations 1325 Airmotive Way, Suite 208 Reno, NV 89502 Water Treatment 877-717-9494 [email protected] Dealer Portal Home Improvement 877-717-9494 [email protected] Dealer Portal Recreation 877-366-8406 option 5, ext. 6015 Fax: 715-849-4855 [email protected] Media inquiries For media inquiries contact [email protected] Locations Corporate headquarters One Corporate Drive, Suite 300 Wausau, WI 54401 Mailing address PO Box 844 Wausau, WI 54402-0844 Additional Locations 1325 Airmotive Way, Suite 208 Reno, NV 89502 Send us a message Fill out the form below or email us at [email protected] Name* (Required) Email* (Required) Phone Message : (Required) * Indicates mandatory field For California or EU Residents: Please use this form to submit CCPA or GDPR requests.  To use this form to submit CCPA or GDPR requests, please identify in the “How can we help you?” field what privacy right you would like to exercise. CAPTCHA Home About Dealers Customers Contact Careers Privacy Policy Do Not Call Policy FAQs Aqua Finance, Inc.’s NMLS identifier is #1082164 which may be verified at NMLS Consumer Access . Aqua Finance, Inc.’s California Debt Collection License is #11319-99 Michigan Aqua Finance, Inc.’s NMLS identifier is #1082164 which may be verified at NMLS Consumer Access . For residents of New York City, New York: Aqua Finance, Inc. provides servicing options that allow for verbal communication in Spanish. Aqua Finance, Inc. provides servicing and collection letters in Spanish. A translation of commonly used terms is available on the NYC Department of Consumer and Worker Protection website at nyc.gov/dca . For Residents of New Mexico: Click here to access the New Mexico Informational Brochure for Consumers including important information about terms and definitions in credit transactions as required by New Mexico law. Click here for general information regarding loans and fees for consumers in New Mexico. NEW MEXICO ONLY: TO REPORT A PROBLEM OR COMPLAINT WITH THIS LENDER, YOU MAY WRITE OR CALL: Chief Compliance Officer One Corporate Drive Suite 300 Wausau, WI 54401 1.800.234.3663 [email protected] New Mexico Only: This lender is licensed and regulated by the New Mexico Regulation and Licensing Department, Financial Institutions Division, P.O. Box 25101, 2550 Cerrillos Road, Santa Fe, New Mexico 87504. To report any unresolved problems or complaints, contact the Division by telephone number (505) 476-4885 or visit the website: https://www.rld.nm.gov/financial-institutions/ For Vermont loans: For any Vermont loans not originated by Aqua Finance, Inc.: THIS IS A LOAN SOLICITATION ONLY. AQUA FINANCE, INC. IS NOT THE LENDER. INFORMATION RECEIVED WILL BE SHARED WITH ONE OR MORE THIRD PARTIES IN CONNECTION WITH YOUR LOAN INQUIRY. THE LENDER MAY NOT BE SUBJECT TO ALL VERMONT LENDING LAWS. THE LENDER MAY BE SUBJECT TO FEDERAL LENDING LAWS. © 2025 Aqua Finance, Inc. All rights reserved. To review Aqua’s licenses click here Make a Payment Dealer Inquiry Form \" * \" indicates required fields Personal information Name * First name Last name Position with company * Contact phone number * Contact email address * Business information Business name * Company website Business category * Check all that apply Water Treatment Home Improvement Recreation HVAC Pool & Spa Other (specify) Sub Category RV Marine Powersports Utility Trailers Other category Business address * Street Address City State / Province / Region ZIP In business since Referred by Annual revenue Captcha * Indicates mandatory field"
    },
    {
      "url": "https://aquamea.com/en/about-us/",
      "text": "About Us - Aquamea × SCOPRI L’OFFERTA ESCLUSIVA DEL MOMENTO! Purificatori Aquamea in piccole e comode rate a partire da meno di due caffè al giorno + BONUS! Scopri di più Menù Living Hospitality Work Why We About Us Free Consultation Menù Living Hospitality Work Why We About Us We leave the word TO OUR CUSTOMERS Here is a collection of the experiences-true and verified-of those who have thrown open the door of their hearts to Aquamea They say about us Extraordinary companies that have long HAVE CONFIDENCE IN US Registered Office: via Montenapoleone 8 – 20121 Milan (MI) Headquarters: Via Andromeda 8 – 09016 Iglesias (SU) CONTACTS Email: info@aquamea.it WhatsApp: +39 329 2235873 LINKS Work with us Request your Runbott © Copyright 2025. Aquamea S.p.A. – All rights reserved – Registered office: Via Montenapoleone 8, 20121 Milan (MI) – Italy Share Capital: € 50,000.00 fully paid – Registered with the Companies Register of Milan Monza Brianza Lodi, Tax Code and VAT No.: 03552000923 – R.E.A. MI-2667462 Facebook Instagram Youtube Linkedin Info Cookies Policy / Privacy Policy Registered Office: via Montenapoleone 8 – 20121 Milan (MI) Headquarters: Via Andromeda 8 – 09016 Iglesias (SU) E-mail: info@aquamea.it LINKS Offers Work with us Request your Runbott © Copyright 2025. Aquamea S.p.A. – All rights reserved – Registered office: Via Montenapoleone 8, 20121 Milan (MI) – Italy Share Capital: € 50,000.00 fully paid – Registered with the Companies Register of Milan Monza Brianza Lodi, Tax Code and VAT No.: 03552000923 – R.E.A. MI-2667462 Facebook Instagram Youtube Linkedin Info Cookies Policy / Privacy Policy Request free consultation"
    }
  ]
}