{
  "fuentes": [
    {
      "url": "https://www.cardiganbaytrading.co.uk/contact-us-2-w.asp",
      "email": "cardiganbaytrading@outlook.com"
    },
    {
      "url": "https://www.cardiganbaytrading.co.uk/contact-us-2-w.asp",
      "email": "paypal2@2x.png"
    },
    {
      "url": "https://www.cardiganbaytrading.co.uk/contact-us-2-w.asp",
      "email": "paypal@2x.png"
    },
    {
      "url": "https://steemteam.com/about-us",
      "email": "max@domain.com"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "email": "info@eastbaydist.com"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "email": "sales@eastbaydist.com"
    },
    {
      "url": "https://www.thephotoboardcompany.com/products/staff-photo-display-boards",
      "email": "info@bdpcreative.co.uk"
    },
    {
      "url": "https://www.thephotoboardcompany.com/products/staff-photo-display-boards",
      "email": "u003einfo@bdpcreative.co.uk"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.breakersfwb.com/experience/dining/old-bay-steamer/",
      "email": "dev@bizcor.com"
    },
    {
      "url": "https://www.breakersfwb.com/experience/dining/old-bay-steamer/",
      "email": "info@breakersfwb.com"
    }
  ],
  "mails": [
    "cardiganbaytrading@outlook.com",
    "dev@bizcor.com",
    "info@bdpcreative.co.uk",
    "info@breakersfwb.com",
    "info@eastbaydist.com",
    "info@scibpaints.com",
    "max@domain.com",
    "paypal2@2x.png",
    "paypal@2x.png",
    "sales@eastbaydist.com",
    "u003einfo@bdpcreative.co.uk"
  ],
  "nombre_sitio": "oldbaysteamerfwb.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cardiganbaytrading.co.uk/contact-us-2-w.asp",
      "text": "Cardigan Bay Trading Contact Us 01239710703 cardiganbaytrading@outlook.com Â£0.00 My Cart - 0 Item(s) Discounts: - Â£0.00 Tax: Â£0.00 Delivery: Â£0.00 Total: Â£0.00 View Cart Checkout Thunderbolts Contact Us If you have any questions please get in touch. Phone: 01239 710703 (9.00am - 5.00pm, Monday - Friday), (9.00am - 4.00pm, Saturday) Address: CNE Supplies (Cardigan Bay Trading), The Old Sawmills, Station Road, Newcastle Emlyn, Carmarthenshire, SA38 9BX Store Opening Times: Monday - Friday 7.30am to 5.00pm, Saturday 8.00am to 4.00pm. Alternatively, use this contact form and we will get back to you as soon as possible. * Required Field Name: * Email Address: * Message: Please enable JavaScript in your browser to send us a message. Useful Links Home About Us Contact Us Delivery & Returns Payments Terms and conditions Privacy Sitemap Stay Connected Delivery Royal Mail 2nd Class Â£3.99 Royal Mail 1st Class Tracked Â£6.99 Royal Mail Tracked & Signed Â£9.99 Royal Mail 2nd Class Â£3.99 CONTACT US Cardigan Bay Trading, The Old Sawmills, Station Road, Newcastle Emlyn, Carmarthenshire, SA38 9BX 01239 710703 We Accept © Copyright 2015-2025 Cardigan Bay Trading All rights reserved Thank you for signing up to our newsletter Please check your inbox to confirm your subscription."
    },
    {
      "url": "https://steemteam.com/about-us",
      "text": "About Us - Stanley Steemer | The Steem Team Skip to content Facebook YouTube Email Home About Us Our Services Air Duct Cleaning Area Rug Cleaning Auto, Boats, & RV’s Carpet Cleaning Furniture Cleaning Hardwood Services Tile & Grout Cleaning Water Restoration Contact Us Contact Form Career Opportunities Quote & Schedule Home About Us Our Services Air Duct Cleaning Area Rug Cleaning Auto, Boats, & RV’s Carpet Cleaning Furniture Cleaning Hardwood Services Tile & Grout Cleaning Water Restoration Contact Us Contact Form Career Opportunities Quote & Schedule About Us Josh Mitchell 2023-04-12T17:20:14-04:00 Meet Your Steem Team Leaders “The #1 Stanley Steemer Franchise in the South-East” The Gellner Family started their cleaning adventure in Winter Park Florida back in 1981. Moving from Columbus Ohio with only one cleaning van and an amazing work ethic, their over 30 years of dedication and hard work has paid off. Our Corporate Office and Contact Center are located in a state of the art facility, in Apopka Florida, and manage more than fifty cleaning vehicles each day.  Each of our satellite offices has its own local manager and fully trained cleaning technicians. Additionally, we’re proud to say that almost half of the 120 person staff have been a committed part of the Steem Team for over 10 years. We all love collectively giving back to the community, by not only volunteering our time, but donating a minimum of $30,000 every year to many local and national charities. The Gellner Family still takes a personal interest in making every customer happy, and pride themselves on still being a locally owned and operated business. Budd & Sally Gellner Founders Budd and Sally Gellner started the business model back in 1981, and although Budd passed away in 2013, Sally is retired and still lives here locally in Daytona Beach Florida. Mark Gellner Owner/Operator Mark Gellner was the original carpet cleaner, working under his father, back in 1981; he now carries the family business by managing the daily operations of all 7 Stanley Steemer operations. Additionally, he maintains an active role in marketing strategies for all the branches as well. Connie Gellner Corporate Coordinator Connie started in 2001 and is the founder for what we now know as, “The Steem Team”, an internal organization of employees who donate their time and give back to the community. Furthermore, Connie also coordinates all additional community involvement, special events, and charity work. Tracey Williams-Ouellette Corporate Manager Tracey started in 1984, when there was only a single working office. Currently, she works side-by-side with our accounting department, while still managing human resources and legalities for each of our locations throughout the south-east region. Trish Wieland Accounting Manager Trish started in 2012 and is the head of our accounting department. With daily communication with each branch manager, she coordinates the incoming paperwork, maintains the books, and more; all while overseeing her accounting staff. Mike Paluzzi Regional Manager Mike started in 2007 as a regular cleaning technician. He now manages the contact center with a staff of 10 customer service agents. Additionally, he oversees the movement of all 57 cleaning vans though out the south-east region, maintains our strict quality control policy, as well as provides support for each technician in each branch location. QUOTE & SCHEDULE CALL 1-888-STEEMER QUOTE & SCHEDULE CALL 1-888-STEEMER With hundreds of satisfied customers each day, we can’t wait to make you one of them! 0 Fully Loaded Cleaning Vehicles 0 Staff Ready To Serve You 0 Satisfied Customers THE CLEAN WE BRING TO YOU Josh Mitchell 2022-05-16T10:45:00-04:00 Air Duct Cleaning Josh Mitchell 2023-06-08T12:24:30-04:00 Area Rug Cleaning Josh Mitchell 2022-05-12T05:51:10-04:00 Autos, Boats & RV’S Josh Mitchell 2023-04-30T17:20:56-04:00 Carpet Cleaning Josh Mitchell 2022-05-12T05:50:40-04:00 Furniture Cleaning Josh Mitchell 2022-05-12T05:52:36-04:00 Hardwood Cleaning Josh Mitchell 2020-06-01T15:09:24-04:00 Leather Cleaning Josh Mitchell 2023-04-30T17:19:56-04:00 Tile & Grout Cleaning Josh Mitchell 2021-10-06T16:22:33-04:00 Water Damage Restoration What Client’s Say Stanley Steemer 4.7 C L V ★★★★★ a week ago Stanley Steemer did an amazing job! My grout had never been cleaned and now it looks almost like new. My rugs smell … More fresh. The team was quick, professional, and explained all the steps. They were thorough and efficient throughout the entire process. Highly recommend their services! I had Joshua and Gustavo, so nice ! I took a photo but does not do it justice on the grout ! Maryann K ★★★★★ a month ago I am very happy with the service I received from Stanley steamer. The technicians were very courteous. I had my … More air ducts and dryer vent done. I was impressed by how efficient they were. They even took the time to make sure everything was clean before they left.I would highly recommend Stanley steamer if you are in need of having this type of work done. It was a good experience. They really care about their customers. April M ★★★★★ 3 months ago Shaun and his partner did such a great job cleaning our grout, couches and rug today. They were prompt, super professional, … More and mindful of our dogs. These guys did such a great job! I’ll definitely use Stanley Streamer again. Frank O ★★★★★ 2 months ago This experience was pretty easy and fantastic!  Originally was just going to have area rugs cleaned in my home, … More but the guys suggested that they would be better cleaned if they took them to the special area rug cleaning place.  Within a week, they were brought back clean and smelling nice, and the guys even put them back exactly where they took them from.  Overall I am very satisfied, will definitely call Stanley Steemer again when I need my rugs cleaned Privacy Policy • Terms of Use 1981 - 2025 Gellner Enterprises LLC | All Rights Reserved Facebook YouTube Email Page load link READY TO SAVE MONEY? Sign up and receive our newest PROMO codes as soon as they're released. Maximum of two offers a month. 100% Privacy. We don't spam. This website uses cookies and third party services. OK"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "text": "Contact East Bay Distributors | Get in Touch Facebook-f X-twitter Instagram Youtube Linkedin-in $ 0.00 0 Cart Shop Inventory Management Custom Manufacturing Resources About Us FAQs Contact Us Contact Us Home Contact Us Contact East Bay Get in Touch Have a question or need assistance? Fill out the form below, and our team will get back to you as soon as possible. We’re here to help! Contact Name Email Address Phone Number Message Send 401-254-2960 401-254-2962 sales@eastbaydist.com 400 Franklin Street Bristol, RI 02809 8a-4p M-F Explore Our Collection and Find The Best products We’ve built our business by providing fast, honest, and quality service backed by an extensive line of products at great prices. Shop Now Why choose an ISO company? |Prototype Development | Sub-Assembly | Inventory Management | Custom Machined Plastics |Inline Static Mixers Call Us 401.254.2960 Email Us info@eastbaydist.com Our Location 400 Franklin St, Bristol, RI 02809, USA East Bay © 2025 East Bay Distributors. All Rights Reserved Search Menu Categories Accessories Fashion Toys Shop Blog Portfolio Wishlist Compare Login / Register Shopping cart Close Sign in Close Username or email address * Password * Log in Lost your password? Remember me No account yet? Create an Account Shop 0 Wishlist 0 items Cart My account"
    },
    {
      "url": "https://www.thephotoboardcompany.com/products/staff-photo-display-boards",
      "text": "Meet The Staff Photo Board – The Photo Board Company Custom Designed Staff Photo Boards Log in or Create account Menu Cart 0 Our Services Our Staff Photo Boards + - Staff Photo Boards for Business Staff Photo Boards for Care Homes & Hospitals Staff Photo Boards for Churches and Volunteer Groups Staff Photo Boards for Emergency Services Staff Photo Boards for Schools, Colleges and Universities Our Schools Site Customer Reviews Contact Us Log in Create account Custom Designed Staff Photo Boards Our Services Our Staff Photo Boards Staff Photo Boards for Business Staff Photo Boards for Care Homes & Hospitals Staff Photo Boards for Churches and Volunteer Groups Staff Photo Boards for Emergency Services Staff Photo Boards for Schools, Colleges and Universities Our Schools Site Customer Reviews Contact Us Home › Meet The Staff Photo Board Meet The Staff Photo Board Default Title - £0.00 GBP Quantity Meet The Staff Photo board Our top-selling Meet and Greet Photo Boards are an excellent way to display staff photos in reception areas and entrances. A wall mounted picture frame in a bespoke design . Our meet the staff photo boards can be produced to any size and shape required. They are available in a wide range of materials/finishes including acrylic, brushed aluminium and brushed black aluminium Our Meet the Staff Photo Boards are designed to be completely unique for your business, organisation or school. Also available are Meet and Greet Photo Board with Optional IN / OUT sliders to show which members of staff are available. An optional extra, easily removed, clear acrylic security cover covers the whole board to stop anyone tampering with the photos. This can be quickly and easily removed to enable easy changing of photos. Photo Pockets/Photographs The clear photo pockets, which are available in any size you require, allow the photos to be easily changed without removing the frame from the wall. We also produce the staff photos to be inserted with the staff members name and job title printed on. If any staff change, simply let us know the changes and we will produce a new photo for you to insert. Delivery/Installation Our Meet and Greet Photo Boards are supplied with all fixtures and fittings including aluminium stand off mounts to give a 3D effect. A drilling template is also supplied to make fitting very easy. We ship to the United States, Canada, the UK and any other country in the world Price/Contact If you require a quote or just want to chat about your requirements, please either fill in the Contact Form. email us us on info@bdpcreative.co.uk or phone us on  (+44) 01257 278289 for a no obligation quote. Quick Links Our Services Our Staff Photo Boards Our Schools Site Customer Reviews Contact Us Contact Us The Photo Board Company Unit 15 Conway Business Park Skull House Lane Appley Bridge WN6 9EU United Kingdom 01257 278289 info@bdpcreative.co.uk Contact Us! Copyright © 2025, The Photo Board Company ."
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.breakersfwb.com/experience/dining/old-bay-steamer/",
      "text": "Old Bay Steamer | Restaurants in Ft Walton Beach | Breakers FWB My Favs email (800) 395-GULF Rental Information Search All Rentals Search Rentals by Bedroom One Bedroom Condos Two Bedroom Condos Three Bedroom Condos Two Bedroom, Two Bathroom Condos Three Bedroom, Two Bathroom Condos Three Bedroom, Three Bathroom Condos Search by Amenity Spring Rentals Last-Minute Rentals Specials Rate Sheet Floor Plans Make a payment Experience Fort Walton Amenities Activities Attractions Blog Complementary Activities Dining Enchanting Picnic Golf Holidays Journeys Top 5 Weddings Venue Venue Information About Travel Insurance Contact Us FAQ Our Photos Reviews * First Email* * Phone What would you like to know more about? CAPTCHA Company This field is for validation purposes and should be left unchanged. Current PHP version: 7.4.33.11 SLIDE Use promo code SLIDE at checkout for 15% off! ** For stays in September. Cannot be combined with any other discounts/offers/promotions. Not valid for existing reservations. ** More information here Old Bay Steamer Old Bay Steamer offers visitors a mouthwatering menu of fresh seafood cuisine in a relaxed atmosphere located just across the water on Okaloosa Island. Find out more about what makes Old Bay Steamer worth visiting during your time in Fort Walton Beach below! Fresh Steamed Seafood and More on Okaloosa Island Situated on Okaloosa Island at 102 Santa Rosa Blvd., Fort Walton Beach, FL 32548, Old Bay Steamer is famous for their succulent steamed seafood, caught and served fresh. The restaurant is locally owned and operated, ensuring that you and your guests experience that attention to detail, freshness, and taste that can only come from locals who know where to get the best seafood and how to do it justice when it’s served on your plate. Start off with appetizers like crab stuffed mushrooms, black mussels or clams, blue crab claws, seafood nachos, crab cakes, jumbo sea scallops, royal red shrimp, gumbo, or oysters served raw, steamed, or baked. From there, you have a variety of options for your mouthwatering entrée. Steamers feed 1-2 people and can be filled your choice of Maine lobster tails, royal red shrimp, king crab, Alaskan king crab, snow crab, Dungeness crab, oysters, mussels, or clams, served with corn on the cob and potatoes on the side. The jumbo family steamer includes everything and is a fantastic option for feeding all of your guests . Other delectable entrée options include jumbo sea scallops, grilled tuna, crab cakes, and pastas like mussels Josephine and shrimp alfredo. For those who (shockingly) don’t want or like seafood, or want the best of both worlds with surf and turf entrées, the restaurant offers quality cuts of filet mignon, New York strip, and more. If you’re craving nothing but lobster tail, snow crab, a crab cake, Dungeness crab, or a king crab leg and claw, you can order those items a la carte. You could even order them a la carte and eat them as a side to one of the restaurant’s delicious meals; we won’t judge! Old Bay Steamer has restaurant hours from 4:00pm to 10:00pm daily, making it an ideal place to grab dinner. You can learn more details on Old Bay Steamer by calling (850) 664-2795 or by speaking with our representatives at The Breakers at Fort Walton Beach . A Unique Take on Dining Fun! While Old Bay Steamer is a fan-favorite eatery amongst locals and visitors alike for its savory menu options and friendly service, it also hosts a one-of-a-kind feature that’s promises to inspire. Situated at one of the tables within the restaurant is what is referred to as “The Old Lady.” This iconic restaurant element is in fact a full-sized mannequin of an aged patron surrounded by handcrafted cocktails! The scene is finished off with the patron lazily smoking a cigarette and enjoying a fantastic dining experience while showcasing a vibrant sequined gown! This whimsical and purely fun display is designed to inspire guests to get close and take a picture that serves as a fun memory of your time at Old Bay Steamer. While you’re snapping that one-of-a-kind shot, you might be inspired by some of the cocktail selections “The Old Lady” has decided to indulge in and order one up for yourself when you’re seated! Some of the highlight cocktail options served up at Old Bay Steamer include everything from Blood Mary’s and Long Island Ice Teas to Top Shelf Margaritas, Lynchburg Lemonade, and Cucumber Coolers. Whether you go with a savory Bahama Mama or a mouthwatering Moscow Mule, your tastebuds are sure to thank you! For those that prefer to go the route of a refreshing beer or two, Old Bay Steamer has plenty of options to choose from as well. Selections on tap include Yuengling, Blue Moon, Sweetwater 420, and Prop’s Blonde Bomber Ale. Traditional beer options and often favorites include Miller Lite, Coors Light, Budweiser, Michelob Ultra, Red Stripe, Stella Artois, Landshark, Heineken, Sam Adamas Boston Lager, Corona, O’doul’s and Angry Orchard just to name a few. Of course, for many patrons of Old Bay Steamer , a meal enjoyed here isn’t quite complete without the addition of one of the special house martinis! The Metrotini is a refreshing concoction of Bacardi Limon, black raspberry, pineapple juice, sour and sugar. The Perfect Dry Martini is great for those who prefer Ketel one vodka paired with olive juice, a hint of vermouth and 2 blue cheese stuffed olives to top it all off. Looking for something a bit sweeter? The caramel appletini combines the best of Smirnoff apple vodka with butterscotch, pucker and sour in a caramel drizzled glass! Fruit fanatics will love the Kitty Kat which seamlessly combines Smirnoff citrus vodka with cranberry and peach schnapps. No matter which selection you make, it’s hard to go wrong with the versatile options at Old Bay Steamer. Restaurants In Ft Walton Beach To find out more information on Old Bay Steamer and other great spots you can enjoy while staying in Fort Walton Beach, contact our reservations team and discuss reserving your accommodations with us today! contact us today * First Email* * Phone Message Instagram This field is for validation purposes and should be left unchanged. or search rental The Breakers of Fort Walton Beach 381 Santa Rosa Boulevard Fort Walton Beach, FL 32548 Phone: (800) 395-GULF (4853) Email: info@breakersfwb.com Popular RENTALS Fort Walton Beach Rentals 1 Bedroom Rentals 2 Bedroom Rentals 3 Bedroom Rentals Beachfront Rentals Ocean View Rentals Short Term Rentals Weekly Rentals Beach Resort Rentals Corporate Rentals Event Rentals Family Rentals Spring Rentals Holiday Rentals Alphabetical Property List Nearby Activities Golfing Deep Sea Fishing Dolphin Cruise Jet Ski and Pontoon Rentals Parasailing OUR COMPANY Terms & Conditions Rental Policies Rental FAQs Travel Insurance Request Estoppel Letter About Us Owner Streamline Login Owner AppFolio Login Contact Us STAY CONNECTED owner streamline login owner appfolio login Email (Required) Fort Walton Beach Rentals Contact Us Blog About Us FAQ Things To Do Privacy Policy Floor Plans Resort Rentals Careers © The Breakers of Fort Walton - All rights reserved ×"
    }
  ]
}