{
  "fuentes": [
    {
      "url": "https://stamarketingpr.com/old-coast-ales",
      "email": "jon@oldcoastales.com"
    },
    {
      "url": "https://stamarketingpr.com/old-coast-ales",
      "email": "info@stamarketingpr.com"
    },
    {
      "url": "https://stamarketingpr.com/old-coast-ales",
      "email": "info@stamarketplace.com"
    },
    {
      "url": "https://oldhousedorking.co.uk/contactus.php",
      "email": "oldhouse@dorkingbrewery.com"
    },
    {
      "url": "https://gchaveyoursay.com.au/contactus",
      "email": "gchaveyoursay@goldcoast.qld.gov.au"
    },
    {
      "url": "https://historiccoastculture.com/venue/old-coast-ales/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/venue/old-coast-ales/",
      "email": "jon@oldcoastales.com"
    },
    {
      "url": "https://historiccoastculture.com/venue/old-coast-ales/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://historiccoastculture.com/organization/old-coast-ales/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/organization/old-coast-ales/",
      "email": "matt@oldcoastales.com"
    },
    {
      "url": "https://historiccoastculture.com/organization/old-coast-ales/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "advisor.services@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ask@ominternational.com"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "complaintadmin@oldmutual.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalcpt@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationaljhb@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalkzn@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalpe@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalpta@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalservice@omwealth.co.za"
    },
    {
      "url": "https://ncts.com.au/contact/",
      "email": "service@ncts.com.au"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "email": "bvlogo-cropped@2-100x100.png"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "email": "bvlogo-cropped@2-150x150.png"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "email": "bvlogo-cropped@2-300x297.png"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "email": "bvlogo-cropped@2.png"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "email": "cropped-bvlogo-cropped@2-100x100.png.jpg"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "email": "cropped-bvlogo-cropped@2-300x300.png.jpg"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "email": "cropped-bvlogo-cropped@2.png"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "email": "geoi@bineandvine.com"
    },
    {
      "url": "https://www.seaplacefl.com/blog/breweries-st-augustine-fl",
      "email": "rentals@coastalrealtyfl.com"
    }
  ],
  "mails": [
    "advisor.services@omwealth.co.za",
    "ask@ominternational.com",
    "bvlogo-cropped@2-100x100.png",
    "bvlogo-cropped@2-150x150.png",
    "bvlogo-cropped@2-300x297.png",
    "bvlogo-cropped@2.png",
    "complaintadmin@oldmutual.co.za",
    "cropped-bvlogo-cropped@2-100x100.png.jpg",
    "cropped-bvlogo-cropped@2-300x300.png.jpg",
    "cropped-bvlogo-cropped@2.png",
    "gchaveyoursay@goldcoast.qld.gov.au",
    "geoi@bineandvine.com",
    "info@stamarketingpr.com",
    "info@stamarketplace.com",
    "jon@oldcoastales.com",
    "matt@oldcoastales.com",
    "oldhouse@dorkingbrewery.com",
    "ominternationalcpt@omwealth.co.za",
    "ominternationaljhb@omwealth.co.za",
    "ominternationalkzn@omwealth.co.za",
    "ominternationalpe@omwealth.co.za",
    "ominternationalpta@omwealth.co.za",
    "ominternationalservice@omwealth.co.za",
    "rentals@coastalrealtyfl.com",
    "service@ncts.com.au",
    "sjcc@historiccoastculture.com",
    "x@2x.png"
  ],
  "nombre_sitio": "oldcoastales.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://stamarketingpr.com/old-coast-ales",
      "text": "Old Coast Ales — STA Marketing & PR Skip to Content Open Menu Close Menu Services Our Work Websites Branding Print Events Copywriting SEO Consulting News STA Marketplace Calendar Festivals Happenings 0 0 Services Our Work Websites Branding Print Events Copywriting SEO Consulting News STA Marketplace Calendar Festivals Happenings 0 0 Open Menu Close Menu Services Folder: Our Work Back Websites Branding Print Events Copywriting SEO Consulting News STA Marketplace Folder: Calendar Back Festivals Happenings OLD COAST ALES Share the Beer Old Coast Ales is a St. Augustine taproom and brewery serving a wide range of local small-batch handcrafted ales in a Cheers environment. Sip on brews at this fun neighborhood bar while sitting on the patio or challenge others to a game of Jenga or ping pong. Buy a friend a beer for their next visit on OCA’s chalkboard tab. And, those who head to Old Coast Ales on their bicycles receive a discount on their brew. Old Coast Ales features flagship beers such as Empircal IP, BLVD Brown, Burt’s Summer Ale, Signal Pale Ale and Port of Call - all brewed on site at their Anastasia Boulevard location. Old Coast Ales also offers a selection of wines and Kombucha from local booch. Hanging out at Old Coast and getting hungry? Grab a taco (or they’ll bring it to you) from next door at Osprey Tacos . Old Coast even has an event space, the Barrel Room, perfect for business meetings or birthday and anniversary parties. Ride your bike to Old Coast Ales any time and receive 10% off. If you’re a Lighthouse member, you get 10% off too! Stop by and meet the guys behind all the creations of the pub, while you enjoy a fresh pint. Cheers! 300 Anastasia Blvd C, St. Augustine, FL 32080 904.484.7705    | Jon@oldcoastales.com STA FEATURES WEBSITE FACEBOOK INSTAGRAM © 2025 STA Marketing & PR info@stamarketingpr.com STA Marketing & PR"
    },
    {
      "url": "https://oldhousedorking.co.uk/contactus.php",
      "text": "The Old House - Contactus. , Pub and Drinks in Dorking, Pubs with Fires, Pubs with Beers Gardens, Young's Ales, Surrey, London, RH4 Home About Us Food \t& Drink Bookings What's On Gallery Contact SHOWREEL The Old House Home About Us Food \t& Drink Bookings What's On Gallery Contact SHOWREEL X Welcome to The Old House Contact Us 24 West Street, Dorking, Surrey RH4 1BY Mon - Thurs   12:00 - 23:00 Fri & Sat           12:00 - 00:00 Sun                    12:00 - 22:00 Telephone: 01306 284100 • Email: oldhouse@dorkingbrewery.com Name* Email* Telephone Comments Become a friend Send Details We are committed to protecting your data and it will be processed in accordance with our privacy policy. Please read this policy before completing this form. View Privacy Policy Our Kitchen is now open. Please see the downloadable menus on the Food and Drink tab. LIKE US WE MAKE SURE THAT YOU DO FOLLOW US FIND OUT ABOUT EVENTS AND OFFERS Sign Up Name* Email* Birthday Anniversary Submit The Old House 24 West Street, Dorking, Surrey RH4 1BY Mon - Thurs   12:00 - 23:00 Fri & Sat           12:00 - 00:00 Sun                    12:00 - 22:00 Telephone: 01306 284100 •  Email: oldhouse@dorkingbrewery.com Contact Us Your name Your email address Your message Become a friend Send We are committed to protecting your data and it will be processed in accordance with our privacy policy. Please read this policy before completing this form. View Privacy Policy Latest tweets Tweets by Oldhousedorking Website by RedBox Studio Ltd"
    },
    {
      "url": "https://gchaveyoursay.com.au/contactus",
      "text": "Contact us\n | GC have your say × Skip To Skip To Skip to content Jump to navigation Search IE10 and below are not supported. Google Chrome Mozilla Firefox Contact us for any help on browser support You are here: Home Contact us Some content on this page may not display correctly. Please enable JavaScript in your browser's settings and refresh the page. Contact us City of Gold Coast services You can contact us online, by phone, mail, relay services or visit one of our Customer Contact Centres. CONTACT US All urgent enquiries and emergencies Call us on 1300 GOLDCOAST (1300 465 326) Technical support with GC Have Your Say Please contact the platform provider Granicus via support@granicus.com Questions about open consultations Contact us via gchaveyoursay@goldcoast.qld.gov.au"
    },
    {
      "url": "https://historiccoastculture.com/venue/old-coast-ales/",
      "text": "Old Coast Ales - HistoricCoastCulture.com Old Coast Ales - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Venue Type Amphitheatre Amusement Park Bar/Tavern Bookstore Business/Company Campground Church College/University Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Golf Club Historic Building/Landmark Hotel/Inn Library Meeting Space Movie Theater Museum Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater Zoo State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue Old Coast Ales Facebook Twitter Linkedin Print Old Coast Ales A comfortable and inviting atmosphere welcomes you as you enter the property adorned with palm trees & sea grapes for a true Florida island experience.  Our 7-barrel brewhouse is the heart of all our beers.  We are large enough to ensure plenty of beer on-hand and small enough to allow real hand-crafted ingenuity. The taproom features a custom one of a kind curved bar faced with 100-year-old cypress. Old Coast Ales offers up to 12 taps of pure liquid excellence.  With two separate patios, there is ample outdoor seating to enjoy the warm, Florida sunshine.  There are games free to play while you are enjoying a nice cold one including Jenga and the crowd favorite: Ping-Pong (and the only table in town). We are family-friendly and, yes, well-behaved dogs are welcome too. A comfortable and inviting atmosphere welcomes you as you enter the property adorned with palm trees & sea grapes for a true Florida island experience.  Our 7-barrel brewhouse is the heart of all our beers.  We are large enough to ensure plenty of beer on-hand and small enough to allow real hand-crafted ingenuity. The taproom features a custom one of a kind curved bar faced with 100-year-old cypress. Old Coast Ales offers up to 12 taps of pure liquid excellence.  With two separate patios, there is ample outdoor seating to enjoy the warm, Florida sunshine.  There are games free to play while you are enjoying a nice cold one including Jenga and the crowd favorite: Ping-Pong (and the only table in town). We are family-friendly and, yes, well-behaved dogs are welcome too. View less MORE ABOUT THIS VENUE Venue Type: Bar/Tavern ; Business/Company ; Meeting Space LOCATION Old Coast Ales 300 Anastasia Blvd, St. Augustine, FL 32080 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette PHOTOS Contact information Email / Website / Facebook / 300 Anastasia Blvd, St. Augustine, FL 32080 (904) 484-7705 Find A Venue Search by Keyword Venue Type Amphitheatre Amusement Park Bar/Tavern Bookstore Business/Company Campground Church College/University Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Golf Club Historic Building/Landmark Hotel/Inn Library Meeting Space Movie Theater Museum Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater Zoo State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access Featured Venues Lightner Museum With sparkling crystal chandeliers, intricate mosaic tile flooring, majestic arched windows, and carved wooden staircases, Lightner Museum is a show-stopper! The museum opened in 1948, displaying the collections of Otto C. Lightner, which include 19th-century artwork, glassware, sculpture, furniture, stained glass, and antique chandeliers throughout the three floors of exhibits. Originally built as the Hotel Alcazar in 1888 by Standard Oil co-founder Henry Flagler, this beautiful structure was created in the Spanish Renaissance Revival Style. In addition to the Lightner Museum, it also houses St. Augustine City Hall, several antique shops, and Cafe Alcazar, a restaurant that sits in the location of what was once the world’s largest indoor swimming pool. Beluthahatchee Park Beluthahatchee Park is a four-acre park located within the 70-acre tract of land purchased by Stetson Kennedy in 1948 after the 18-acre Beluthahatchee Lake was created by impounding Mill Creek in 1945. This lake meanders through a natural basin and is surrounded by high bluffs, currently owned by the Lake Dwellers Association, a non-profit Florida corporation formed by the lakefront residents. In 1949, the 70-acre tract was subdivided and platted by the owner/developer Stetson Kennedy who recorded the restrictive covenants setting aside land in perpetuity as a wildlife refuge, and stipulating that residential construction be consistent with the developer’s goal of “serving as a working demonstration that human and natural habitat need not be mutually exclusive, but can coexist in harmony.” DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://historiccoastculture.com/organization/old-coast-ales/",
      "text": "Old Coast Ales - HistoricCoastCulture.com Old Coast Ales - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 SEARCH Advanced Filters Home Organization Old Coast Ales Facebook Twitter Linkedin Print Old Coast Ales Old Coast Ales began brewing 10 gallons at a time in the garage many years ago like many other great breweries. The first beer they ever brewed was the Empirical IPA. While that recipe has evolved over time, the essence of it never changed. Now brewing 200 gallons at a time, Old Coast continues the long tradition of “bootstrapping” and hard work to bring a wide selection of your favorite styles to life. From malty stouts, porters, and brown ales to a double red, a classic ESB, and the refreshing local favorite, Burt’s Summer American wheat ale, there is something for every palate. They offer special barrel-aged ales and, of course, their world-class IPAs. After many books, projections, podcasts, revised projections, conferences, many trips to speak with brewers, and “sampling” beer all over the country (R&D), Old Coast has set their sights to the sky and there ain’t no turning back!! The Brewery and Taproom A comfortable and inviting atmosphere welcomes you as you enter the property adorned with palm trees & sea grapes for a true Florida island experience. The 7-barrel brewhouse is the heart of all Old Coast beers. They are large enough to ensure plenty of beer on-hand and small enough to allow real hand-crafted ingenuity. The taproom features a custom one-of-a-kind curved bar faced with 100-year-old cypress. Old Coast Ales offers up to 12 taps of pure liquid excellence. With two separate patios, there is ample outdoor seating to enjoy the warm Florida sunshine. In addition t ... view more » Old Coast Ales began brewing 10 gallons at a time in the garage many years ago like many other great breweries. The first beer they ever brewed was the Empirical IPA. While that recipe has evolved over time, the essence of it never changed. Now brewing 200 gallons at a time, Old Coast continues the long tradition of “bootstrapping” and hard work to bring a wide selection of your favorite styles to life. From malty stouts, porters, and brown ales to a double red, a classic ESB, and the refreshing local favorite, Burt’s Summer American wheat ale, there is something for every palate. They offer special barrel-aged ales and, of course, their world-class IPAs. After many books, projections, podcasts, revised projections, conferences, many trips to speak with brewers, and “sampling” beer all over the country (R&D), Old Coast has set their sights to the sky and there ain’t no turning back!! The Brewery and Taproom A comfortable and inviting atmosphere welcomes you as you enter the property adorned with palm trees & sea grapes for a true Florida island experience. The 7-barrel brewhouse is the heart of all Old Coast beers. They are large enough to ensure plenty of beer on-hand and small enough to allow real hand-crafted ingenuity. The taproom features a custom one-of-a-kind curved bar faced with 100-year-old cypress. Old Coast Ales offers up to 12 taps of pure liquid excellence. With two separate patios, there is ample outdoor seating to enjoy the warm Florida sunshine. In addition to the in-house craft-brewed beers, Old Coast Ales also offers a selection of wines, N/A kombucha, and all-natural soda. Make your visit one to remember with a great location close to the historic district, the St. Augustine Lighthouse & Maritime Museum, Alligator Farm, State park, and beautiful beaches. View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: Commercial Business ; Food/Drink ; Retail PHOTOS Contact information Email / Website / Facebook / Instagram / Primary address: 300 Anastasia Boulevard, St. Augustine, FL 32080 (904) 484-7705 Find An Organization Search by Keyword Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Featured Organizations EMMA Concert Association Presenting beautiful music in beautiful St. Augustine at the Lewis Auditorium at Flagler College! EMMA’s mission is to offer quality music and dance performances by national and international artists. They also aim to encourage interest in classical music and to provide opportunities for the youth of St. Johns County. EMMA accomplishes this by offering school concerts in local schools and funding requests from music teachers for instruments and equipment. Historic Florida Militia The Historic Florida Militia (HFM) is a non-profit umbrella organization supporting re-created historic interpretive units and representing a number of cultures and time periods. \"We are not street performers, we are educators. We are not parades, we are historic programs. This is not an exercise in free speech, this is an opportunity to educate. We are not promoting a political agenda, we are promoting the city's history through a practical and factual teaching method\". Crisp-Ellert Art Museum at Flagler College Built in honor of Dr. JoAnn Crisp-Ellert and her husband, Dr. Robert Ellert, the Crisp-Ellert Art Museum offers Flagler College students and the Northeast Florida community a venue for fostering knowledge and a deep appreciation of contemporary art. As an educational resource for the College, the Museum exhibits regional, national and international artists, and provides opportunities for critical engagement and exposure to a variety of exhibitions and personal interactions with visiting artists. The Museum challenges students, the Flagler community and the public to cultivate individual creativity, critical reflection, historical consciousness and respect for the free exchange of ideas. In this spirit, the Museum also hosts public programs, including artist talks, readings, panel discussions and film series that provide a platform for vital interdisciplinary dialogue. DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "text": "Contact Us - Oldmutual About us Contact us Literature Library ≡ WHY CHOOSE US? BENEFITS OF INVESTING OUR PRODUCTS INVESTMENT AND FUNDS UPCOMING EVENTS About us Contact us Literature Library IMS LOGIN IMS LOGIN Contact Us Share Print CONTACT US ∨ FRAUD REPORTING PERSONALISED REGIONAL SERVICE TEAM CONTACT US If you are unable to find the information you are looking for on this website or would like to speak to one of our regional staff you can contact us using the details below. If you are unsure who you need to speak to please fill in our contact form and one of our staff will contact you at your convenience. OLD MUTUAL INTERNATIONAL (OMI) REGIONAL SERVICE TEAMS: Our OMI Regional Service Teams are contactable as follows: Western Cape (Cape Town) - ominternationalcpt@omwealth.co.za Gauteng (Johannesburg) & Free State - ominternationaljhb@omwealth.co.za Pretoria, Polokwane & Mpumalanga - ominternationalpta@omwealth.co.za KwaZulu-Natal (Durban) - ominternationalkzn@omwealth.co.za Eastern Cape (Port Elizabeth) - ominternationalpe@omwealth.co.za Commission queries - advisor.services@omwealth.co.za OMI General Service - ominternationalservice@omwealth.co.za For further information - our OMI Offshore Specialists & OMI Service Team Specialists direct contact details are available on: https://www.omi-int.com/contactUsServiceTeam.html Contact Locations OMI's extensive network allows investors access to our products and services. From a network of office and operations, the Old Mutual International Sales Division provide financial advisers with information and support on Old Mutual International's full range of products and services. These financial advisers access\n          OMI's products to meet the needs of their individual clients. The list below provides you with the direct contact details of OMI's international network of offices: Old Mutual International Cape Town Contact Centre PO Box 31 Mutual Park, Pinelands 7451 Cape Town South Africa Tel: +27 (0)21 509 2187 Fax: +27 (0)86 6466 885 Email: ominternationalservice@omwealth.co.za Guernsey Albert House, South Esplanade, St Peter Port, Guernsey, Channel Islands, GY1 1AW Tel: +27 (0)21 509 2187 Fax: +27 (0)86 6466 885 Email: ominternationalservice@omwealth.co.za Old Mutual Isle of Man branch of OMLACSA 5A Village Walk, Onchan, Isle of Man, IM3 4EB British Isles Tel: +27 (0)21 509 2187 Email: ominternationalservice@omwealth.co.za For any Old Mutual Hong Kong queries/unclaimed benefits - please contact: Tel: +27 (0)21 509 2187 Email: ominternationalservice@omwealth.co.za Contact Us Form PLEASE TAKE NOTE: This Contact Us Form is for Old Mutual International South Africa queries, advisers and clients ONLY. Any queries relating to Old Mutual Limited or Old Mutual Insure or Old Mutual Life Assurance Company (South Africa) Pty Ltd will NOT be actioned here and must be raised via www.oldmutual.com or www.oldmutual.co.za or complaintadmin@oldmutual.co.za Title *First name *Surname Phone number *Email address Nature of feedback Please select... Your experience of dealing with us Our website Our secure online services Other feedback Message How would you like us to respond to your feedback Please select... By email By phone By letter No response needed * This field is required As part of our commitment to quality service, your telephone calls may be recorded. SEND YOUR MESSAGE Thank you for taking the time to contact us. Your request was successfully submitted. You can expect a response in due course. We are experiencing difficulties in processing your request. Please reload the page and try again in a few minutes. ↑ Back to top Accessibility Legal and Regulatory Privacy Notice and Cookie Policy Terms of Use Complaints Procedure Data Protection Rights PRIVACY POLICY UPDATE Please note that our Privacy Policy has been updated. Please see the updated policy here If you \"Accept All\", you agree to the use of cookies for an improved browsing experience, enhancing site navigation and analysing site usage. Learn more here Accept All"
    },
    {
      "url": "https://ncts.com.au/contact/",
      "text": "Contact – North Coast Telephone Systems Skip to content Contact Us Fast & Professional Responses. 02 6621 5553 Local, Aussie Support. Mon - Thu: 8:00 AM - 5:00 PM || Fri: 8:00 AM - 4:00 PM Office Operating Hours. Contact Us Fast & Professional Responses. 02 6621 5553 Local, Aussie Support. Mon - Thu: 8:00 AM - 5:00 PM || Fri: 8:00 AM - 4:00 PM Office Operating Hours. ‏‏‎ Known Outages ‏‏‎ ‏‏‎ ‎‏‏‎‎‎My Account ‏‏‎ Known Outages ‏‏‎ ‏‏‎ ‎‏‏‎‎‎My Account Home About Telco Internet Voice Mobile Phone Systems Traditional Hosted Services Installation Services Maintenance Services Wireless Networks Phone Bill Management & Advice Contact Home About Telco Internet Voice Mobile Phone Systems Traditional Hosted Services Installation Services Maintenance Services Wireless Networks Phone Bill Management & Advice Contact Contact Us Get in touch with NCTS. Call Us 02 6621 5553 Email Us service@ncts.com.au Visit Us 1/80 Conway Street, Lismore NSW 2480 Please fill in the contact form below, and a representative from NCTS will respond within a timely manner. You can also contact us by visiting our Facebook Page . Name Company Phone No. Email Location Message Send General Sales & Service Phone: 1300 420 354 Email Service: service@ncts.com.au Telco Billing & Support Phone: 1300 813 889 Email Support: support@ncts.com.au ( For Landline, Mobile & Internet services only) Important Documents General Policy & Legal Critical Information Summaries Telco Brochures Office Hours Mon – Thu: 8:00 AM – 5:00 PM Fri: 8:00 AM – 4:00 PM Get In Touch. Scrolled this far? Head over to our contact page in order to get in touch with us. Contact Page Click Here to Download TeamViewer Quick Support! General Sales & Service Phone: 1300 420 354 Email Service: service@ncts.com.au Fax: 02 6621 9556 Telco Billing & Support Phone: 1300 813 889 Email Support: support@ncts.com.au ( For Landline, Mobile & Internet services only) Important Documents General Policy & Legal Critical Information Summaries Telco Brochures Get In Touch. Scrolled this far? Head over to our contact page in order to get in touch with us. Contact Page © 2025 North Coast Telecommunication Services PTY LTD"
    },
    {
      "url": "https://bineandvine.com/product/north-coast-red-seal-ale/",
      "text": "North Coast Red Seal Ale 12oz-6pk | Bine & Vine Skip to content All Beer Food/Snacks Hard Kombucha Mead | Sake | Cider Merch Non-Alcoholic Beverages Uncategorized Wine Search for: Login / Register Cart Cart No products in the cart. Return to shop *$25 Minimum Order* Home Wine Varietal RED WHITE SPARKLING ROSÉ NATURAL ORANGE Region FRANCE ITALY SPAIN CALIFORNIA SOUTH AMERICA All Regions... Beer Style IPA STOUT SOURS LAGERS Other Styles... Country/State SAN DIEGO CALIFORNIA BELGIUM GERMANY All Regions... Shop Cider Mead Sake Non-Alcoholic Beverages Food/Snacks Merch Wine Club About Us Blog Who We Are Brick & Mortar Contact Home / Beer / Other / American Amber Ale Add to wishlist North Coast Red Seal Ale 12oz-6pk $ 13.99 North Coast Red Seal Ale Malt and hops are beautifully married in this full-bodied, copper-red Pale Ale. Red Seal is generously hopped for a long, spicy finish. An excellent accompaniment to grilled meats and rich sauces. Out of stock Add to wishlist Categories: American Amber Ale , Beer , ESB , Irish Stout , Other , Stout Tags: Amber Ale , American Amber Ale , California , North Coast Brewing , Red Ale All Beer Food/Snacks Hard Kombucha Mead | Sake | Cider Merch Non-Alcoholic Beverages Uncategorized Wine Search for: Product categories Select a category Beer Barleywine American Barleywine English Barleywine Farmhouse Bière de Garde Saison Witbier IPA Belgian IPA Black IPA Cold IPA English IPA Hazy Double IPA Hazy IPA Hazy Triple IPA Milkshake IPA New Zealand IPA Session IPA West Coast Double IPA West Coast IPA West Coast Quadruple IPA West Coast Triple IPA Lager Alsatian Pilsner Altbier Amber Lager American Pale Lager American Pilsner Bock Czech Amber Lager Czech Dark Lager Czech Pilsner Doppelbock Dortmunder/Export Lager Dunkel Euro Pale Lager German Pilsner Helles Lager India Pale Lager Italian Pilsner Japanese Lager Kellerbier Maibock Mexican Lager New Zealand Pilsner Oktoberfest-Festbier Oktoberfest-Märzen Schwarzbier Vienna Lager West Coast Pilsner Other American Amber Ale American Blonde Ale American Brown Ale American Strong Ale American Wheat Ale Belgian Blonde Ale Belgian Enkel/Patersbier Belgian Strong Dark Ale Belgian Strong Golden Ale Berliner Weisse Bitter California Common Cream Ale Dubbel Dunkelwiezen Eisbock English Brown Ale English Strong Ale ESB Fruit Beer Gruit Hefeweizen Herb/Spiced Imperial Red Ale Irish Red Ale Kölsch Kristalweizen Mild Ale Old Ale Quadrupel Rauchbier Sahti Scotch Ale/Wee Heavy Scottish Ale Tripel Weizenbock Wheat Wine Winter Warmer Pale Ale Belgian English Hazy Pale West Coast Pale Porter American Porter Baltic Porter English Porter German Porter Imperial Porter Sour/Wild Flemish Sour Ale Kettle Sour Lambic-Fruit Lambic-Gueuze Smoothie Sour Stout American Stout English Stout Foreign Export Stout Imperial Stout Irish Stout Milk/Sweet Stout Oatmeal Stout Pastry Stout Food/Snacks Chocolate Freeze Dried Fruits Hot Sauce Olive Oil Vinegar Hard Kombucha Mead | Sake | Cider Cider Mead Sake Merch Bags Glassware Non-Alcoholic Beverages CBD Drinks Cold Brew Coffee Craft Soda Iced Tea Non-Alcoholic Beer Non-Alcoholic Cider Non-Alcoholic Wine Sparkling Water Uncategorized Wine Dessert Other Dessert Port Sherry Orange/Skin-Contact Red Aglianico Barbera Cabernet Franc Cabernet Sauvignon Carignan Gamay Grenache Malbec Merlot Nebbiolo Other Red Pinot Noir Red Blend Sangiovese Syrah Tempranillo Region Arizona Australia Austria California Napa Valley Other California Santa Barbara Sonoma France Bordeaux Burgundy Champagne Loire Other French Rhône Germany Greece Italy Other Italy Piedmont Sicily Tuscany New Zealand Oregon Other Regions Bulgaria Croatia Hungary Republic of Georgia Romania Serbia Slovakia Slovenia Portugal South America Argentina Chile Mexico Spain Other Spain Rioja Washington State Rosé Sparkling Cava Champagne Pét-Nat Sparkling Red Sparkling Rosé Sparkling White White Chardonnay Chenin Blanc Grüner Veltliner Other White Riesling Sauvignon Blanc White Blend Cart Description Additional information Reviews (0) North Coast Red Seal Ale Formerly known as: Ruedrich’s Red Seal Ale STYLE American Amber Ale COLOR Amber ABV 5.4% BITTERNESS 42 IBUs RED SEAL ALE MEDALS & AWARDS GOLD 2006 World Beer Championships, Chicago 2005 World Beer Championships, Chicago 2004 World Beer Championships, Chicago 2004 Spring Beer & Wine Festival, Portland 2003 World Beer Championships, Chicago 2000 GABF, American Amber Ale 2000 Stockholm Beer Festival, Sweden 1999 World Beer Championships, Chicago 1995 World Beer Championships, Chicago 1994 World Beer Championships, Chicago SILVER 2002 GABF, American Amber Ale 1992 GABF, American Amber Ale Weight 12 lbs Dimensions 4 × 4 × 12 in Type Beer Style American Amber Ale Country/State US-California Brewery North Coast Size 12oz bottle, 12oz bottle 6pk Reviews There are no reviews yet. Only logged in customers who have purchased this product may leave a review. Related products Add to wishlist Quick View St Bernardus Abt 12 750ML $ 16.99 Add to cart Add to wishlist Quick View Traquair Jacobite Ale 11.2oz $ 8.69 Add to cart Add to wishlist Quick View St. Bernardus Tripel 750ML $ 14.99 Add to cart Add to wishlist Quick View Samuel Smith Oatmeal Stout 12oz $ 4.49 – $ 14.99 Price range: $4.49 through $14.99 Select options This product has multiple variants. The options may be chosen on the product page Add to wishlist Quick View Ayinger Bräuweisse 11.2oz $ 4.49 – $ 14.99 Price range: $4.49 through $14.99 Select options This product has multiple variants. The options may be chosen on the product page Add to wishlist Quick View Allagash Tripel 12oz-6pk $ 17.99 Add to cart Add to wishlist Quick View Duvel $ 6.49 – $ 21.99 Price range: $6.49 through $21.99 Select options This product has multiple variants. The options may be chosen on the product page Add to wishlist Quick View Westmalle Trappist Tripel $ 15.99 Select options This product has multiple variants. The options may be chosen on the product page Need recommendations or have questions? Reach out and we'll get back to you! Contact Us My Account My Cart Orders Account Details Logout Customer service Contact Us Privacy Policy Terms & Conditions About Us Bine & Vine Bottle Shop © 2025 Copyright 2025 © FRANC ROSE MEDIA Visa PayPal Stripe MasterCard Cash On Delivery WARNING: Drinking distilled spirits, beer, coolers, wine and other alcoholic beverages may increase cancer risk, and, during pregnancy, can cause birth defects. For more information go to www.P65Warnings.ca.gov All Beer Food/Snacks Hard Kombucha Mead | Sake | Cider Merch Non-Alcoholic Beverages Uncategorized Wine Search for: Home Wine Beer Shop Cider Mead Sake Non-Alcoholic Beverages Food/Snacks Merch Wine Club About Us Blog Who We Are Brick & Mortar Contact Login / Register Cart Cart No products in the cart. Return to shop *$25 Minimum Order* North Coast Red Seal Ale 12oz-6pk Out of stock"
    },
    {
      "url": "https://www.seaplacefl.com/blog/breweries-st-augustine-fl",
      "text": "Breweries in St. Augustine FL  | Sea Place FL Skip to main content 800-587-2287 Menu Vacation Rentals Rentals by Name Premium Specials Oceanfront Ocean View/Pool View Rentals for Small Groups Rental Amenities Property Map Things To Do Activities Blog Events Contact Us Vacation Rental Management You are here Home Get a Pint at These 3 Breweries in St. Augustine FL Breweries in St. Augustine FL are popping up all over the place, bringing in a whole new way to experience this historic city. The craft beer industry is booming throughout the country, so it's no surprise locals here are getting into the spirit of creating unique ales, lagers, and beyond. If you're a hops fan, visit our favorite breweries in St. Augustine FL while you're here. Ancient City Brewing Ancient City Brewing has a relaxed and fun atmosphere. With games like cornhole, darts, and life-sized Jenga, it is an awesome place for friends to gather for a night out. Pop in for happy hour from 3-7 pm and get 20% off beer and wines. A definite must-try is the Galleon’s Golden Ale, a light beer perfect for summertime sipping. Ancient City Brewing is located on the downtown square and is the perfect location to relax after a day of exploring. Address: 3420 Agriculture Center Dr., St. Augustine, FL 32092 Dog Rose Brewing Company Off the beaten path, Dog Rose Brewing Company is definitely a beer lover’s dream. With four regular beers on tap plus seasonal brews, there is something to please everyone’s palette. Located in Lincolnville, it’s the perfect place to go after you have had dinner at one of the many restaurants nearby. Dog Rose often hosts local bands and food trucks so be sure to check out the schedule online. Address: 77 Bridge St., St. Augustine, FL 320874 Old Coast Ales Located on Anastasia Island, Old Coast Ales is an awesome spot to stop after a day at the beach. Old Coast Ales has 12 beers on tap and allows guests to bring in food from their next-door neighbor, Osprey Tacos. Having a private event? Buy a beer keg with one of their unique creations for a one of a kind experience. Address: 300 Anastasia Blvd., St. Augustine, FL 32080 Plan Your Next St. Augustine Beach Vacation Whether you’re in town to soak up the sun at the beach or discover St. Augustine’s vibrant history, our oceanside and oceanfront condos are waiting for you! Contact us today to start planning your next dream vacation, or just book your Saint Augustine vacation rental online. Categories: Things to do in St. Augustine FL Recent Blog Posts Helpful Reminders for Sea Turtle Nesting Season in St. Augustine Top 5 St. Augustine Vacation Rentals for Fall Top Attractions in St. Augustine! St. Augustine Food and Wine Festival 2022 Why You Should Enjoy a Holiday at the Beach in St. Augustine Blog Posts Things to do in St. Augustine FL (9) St. Augustine Trip Planning (10) General (1) Arrival * Departure * Adults Adults: 1 Adults: 2 Adults: 3 Adults: 4 Adults: 5 Adults: 6 Adults: 7 Adults: 8 Adults: 9 Adults: 10 Adults: 11 Adults: 12 Children Children: 0 Children: 1 Children: 2 Children: 3 Children: 4 Children: 5 Children: 6 Children: 7 Children: 8 Children: 9 Children: 10 Children: 11 Children: 12 Facebook Instagram Youtube Coastal Realty & Property Management 3942 A1A South St. Augustine , Florida - 32080 United States 800-587-2287 rentals@coastalrealtyfl.com About Coastal Realty With nearly 30 years in the vacation rental and property management industries, Coastal Realty has a passion for offering the best customer experience by providing personal, hands-on service.  Our offices and vacation rental properites are all located in beautiful St. Augustine, Florida. Quick Links Guest Login Rental Owner Login Search rentals by name. Search by Title Sea Place 11104 Sea Place 11110 Sea Place 11202 Sea Place 11206 Sea Place 12113 Sea Place 12119 Sea Place 12125 Sea Place 12214 Sea Place 12229 Sea Place 14152 Sea Place 14254 Sea Place 14266 Sea Place 15269 Sea Place 15271 Sea Place 15274 Sea Place 15277 Sea Place 15278 Login | Proudly built by Bluetent |\n        © 2025"
    }
  ]
}