{
  "fuentes": [
    {
      "url": "https://olddavieschool.org/venue-rental/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/orange-blossom-fest/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/orange-blossom-fest/",
      "email": "pr@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/event/orange-blossom-festival-car-show-at-old-davie-school/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://www.wedding-spot.com/venue/6081/old-davie-school-historical-museum/",
      "email": "byob@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/6081/old-davie-school-historical-museum/",
      "email": "indooroutdoor@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/6081/old-davie-school-historical-museum/",
      "email": "upgradedrentals@2x.png"
    },
    {
      "url": "https://olddavieschool.org/nenitapwildblogpost/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://davie-school-foundation-inc.square.site/product/stitched-together-an-exhibit/66?cs=true&cst=custom",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://www.davisonschools.org/staff-directory",
      "email": "medwards@davisonschools.org"
    },
    {
      "url": "https://www.artscalendar.com/venue/old-davie-school-historical-museum/",
      "email": "events@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/director-staff/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/directions-parking/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "http://olddavieschool.org/film-photography/",
      "email": "events@olddavieschool.org"
    },
    {
      "url": "http://olddavieschool.org/film-photography/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://www.olddavieschool.org/construction-underway-on-agricultural-and-citrus-packing-house-at-old-davie-school-historical-museum/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/venue/old-davie-school-historical-museum/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/about-the-foundation/",
      "email": "collections@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/about-the-foundation/",
      "email": "coordinator@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/about-the-foundation/",
      "email": "director@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/about-the-foundation/",
      "email": "education@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/about-the-foundation/",
      "email": "events@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/about-the-foundation/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/about-the-foundation/",
      "email": "pr@oldavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/visit/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/visit/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/learn/",
      "email": "education@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/learn/",
      "email": "join@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/learn/",
      "email": "odshm@olddavieschool.org"
    },
    {
      "url": "https://olddavieschool.org/",
      "email": "odshm@olddavieschool.org"
    }
  ],
  "mails": [
    "byob@2x.png",
    "collections@olddavieschool.org",
    "coordinator@olddavieschool.org",
    "director@olddavieschool.org",
    "education@olddavieschool.org",
    "events@olddavieschool.org",
    "indooroutdoor@2x.png",
    "join@olddavieschool.org",
    "medwards@davisonschools.org",
    "odshm@olddavieschool.org",
    "pr@oldavieschool.org",
    "pr@olddavieschool.org",
    "upgradedrentals@2x.png"
  ],
  "nombre_sitio": "olddavieschool.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://olddavieschool.org/venue-rental/",
      "text": "Venue Rental | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest Celebrate Create Unforgettable Memories at the Charming and Historic 1918 Davie School Whether you’re planning an elegant wedding, graduation, birthday party , or retirement celebration, the dedicated team at Old Davie School is here to ensure your day is truly one to remember. With the flexibility to choose your own caterers, photographers, musicians, and florists, the possibilities are endless to craft the event of your dreams. Contact us today to learn more or to schedule a personalized tour of our beautiful venue! The Historic Auditorium The Historic Auditorium in the 1918 Davie School is a stunning venue that combines timeless charm with modern amenities, making it the ideal setting for a wedding reception. The space boasts beautiful, gleaming hardwood floors that add warmth and elegance to the atmosphere. Large windows allow an abundance of natural light to flood the room, The rich history of the building adds a unique, romantic touch, creating a memorable backdrop for your special day. The Historic Auditorium provides the perfect ambiance for an unforgettable wedding reception. This venue space can accommodate up to 175 guests and includes the outdoor authentic Seminole Chickee Hut perfect for ceremonies or an outdoor cocktail hour. Harmony Grove Harmony Grove is a picturesque setting for an outdoor wedding ceremony. Choose between the shady area under the Plum trees or the amphitheater on the south end.  The backdrop of natural everglades landscape and the shade of the large Jambolyn Plum trees make for a beautiful area for you and your guests. Heritage Hall Heritage Hall is a versatile and elegant venue, perfect for hosting a wide range of events, from business meetings and music recitals to graduations, retirement parties, bridal showers, weddings, and other special occasions. The space is defined by its impressive high ceilings, creating an open, airy atmosphere that adds grandeur to any event, as well as its grand stage. Its flexible layout allows it to serve as a blank canvas, easily adaptable to fit any vision or theme. Whether you’re planning a formal gathering, a casual celebration, or a creative affair, Heritage Hall offers the ideal setting to bring your event to life and can hold up to 150 people. The outdoor Courtyard area can be added on for ceremonies, cocktail parties, and more. Orange Villa The Orange Villa, a historic home built in 1914, is the perfect location for your boutique event–ceremonies and receptions, cocktail parties, baby or bridal showers, the possibilities are endless. The first floor of the home includes the beautiful sunroom, living room, dining room and caterer’s kitchen. This venue space can hold up to 20 people and is perfect for intimate gatherings. Outdoor spaces around the campus can be added on to elevate your event to the next level. Request Booking Information No matter what stage of planning you are in, we are here to help! Fill in the form below and someone will be in touch with you shortly. We look forward to hearing from you. Request Booking Information Full Name * E-Mail * Phone Number * What type of event are you looking for? * Event Date * Is your date flexible? * Yes No How did you hear about us? * Google Facebook Instagram Vendor Referral Client Referral The Knot WeddingWire Zola Other Tells more about your event! * LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    },
    {
      "url": "https://olddavieschool.org/orange-blossom-fest/",
      "text": "2020 Orange Blossom Fest | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest 83rd Annual Orange Blossom Festival The Old Davie School has been a part of Davie's historic Orange Blossom Festival for the past 83 years. Be a part of the local tradition by stopping by the Old Davie School Historical Museum! The Old Davie School will be hosting tons of free, fun, and family-friendly activities all weekend long. Stop by for free guided tours, pancake breakfast, flea market, and experience authentic pioneer cooking! Like the event on our Facebook page for the latest news and updates on the event! Like Event Schedule Feb 29th - March 1st Opens at 9am Opening at 9am, stop by Old Davie School to browse our Flea Market! Every purchase from the Flea Market goes back into helping to maintain operations at the Old Davie School. Contact us for more info if you wish to donate any items you for the Flea Market! Feb 29th - March 1st 12-2pm Take a quick snack break with our pioneer food! We will be using recipes from authentic pioneer cookbooks just like they did it, over an open fire. Stop by between 12-2pm to learn their techniques and try free samples! Feb 29th - March 1st 12:30pm & 1:30pm Take a step back in time with a free guided tour of the Old Davie School. Learn about the fascinating history of Davie, hardships of early Florida pioneer life, and preservation efforts to teach future generations. March 1st 11am - 2pm Due to popular demand, the Old Davie Car & Truck Show is back! This free and family-friendly event showcases a wide variety of cars from Model-Ts to dragsters. Which car will win this year's first-place prize? If you think yours has a shot, then register it today to enter the show! Contact Us Like Event Like Event Enter Your Car LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    },
    {
      "url": "https://olddavieschool.org/event/orange-blossom-festival-car-show-at-old-davie-school/",
      "text": "Orange Blossom Festival Car Show at Old Davie School | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest « All Events This event has passed. Orange Blossom Festival Car Show at Old Davie School February 23 @ 11:00 am - 2:00 pm Onsite Day of Registration:  $20 Limited Availability Details Date: February 23 Time: 11:00 am - 2:00 pm Event Category: Featured Events Website: https://square.link/u/HEeO0FjA Venue Old Davie School Museum & Event Venue 6650 Griffin Road Davie , FL 33314 United States + Google Map Phone 954-797-1044 Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Share this entry Share on Facebook Share on X Share on Pinterest Share on LinkedIn Share by Mail Related Events Open Mic Night at the Museum September 11 @ 7:00 pm - 9:00 pm Event Series Step Back in Time Saturdays September 20 @ 11:00 am - 2:00 pm Homeschool Day September 26 @ 10:00 am - 12:00 pm Details Date: February 23 Time: 11:00 am - 2:00 pm Event Category: Featured Events Website: https://square.link/u/HEeO0FjA Venue Old Davie School Museum & Event Venue 6650 Griffin Road Davie , FL 33314 United States + Google Map Phone 954-797-1044 Event Navigation « Love Letter Day Old School Cool : Concert in the Grove » Recent Posts Maintenance Event Job Description Endless Opportunity at FAU Davie Episode 17: Orange Blossom Festival Episode 1: History of the Old Davie School 5 Hidden Facts in the Town of Davie Logo Archives August 2021 May 2021 February 2021 January 2021 May 2020 March 2020 February 2020 February 2019 February 2017 January 2017 December 2016 Categories Kim's Korner Newsletter Press Release Uncategorized LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Love Letter Day Old School Cool : Concert in the Grove Scroll to top"
    },
    {
      "url": "https://www.wedding-spot.com/venue/6081/old-davie-school-historical-museum/",
      "text": "Old Davie School Historical Museum | Venue - Davie, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Provided by: Old Davie School Historical Museum Report Old Davie School Historical Museum 954-797-1044 CALL VENUE FAVORITE Venue highlights Indoor and outdoor spaces BYO Upgraded rentals included Venue details Style: Historic/Landmark Building, Outdoor Guest capacity: Accommodates up to 175 guests Services: Ceremony / Reception Indoor / Outdoor VIEW OPTIONS Location: 6650 Griffin Road Davie, FL 33314 Description: Celebrate your nuptials in a historical setting that will bless your marriage with the same longevity that marks its existence – Old Davie School. Originally built in 1918, the Old Davie School house is the oldest permanent school in Broward County. The beautiful historic campus is a perfect place to host your wedding celebration. The newly completed Amphitheater is a picturesque setting for a heartfelt outdoor ceremony. The backdrop of natural everglades landscape and the shade of large Jambolyn Plum trees make for a beautiful setting to say “I do,” in front of guests. Following the ceremony guests can enjoy cocktail hour under the school’s authentic Seminole Chickee Hut. The open air, thatched roof venue also provides a unique alternative for your ceremony.  Meanwhile you can enjoy a quiet moment together and pose for photographs. Many settings are available for portraits throughout the school and 10-acre property. After cocktail hour, the festivities continue with dinner and dancing in the schoolhouse museum’s auditorium. The Old Davie School staff is dedicated to making your special day and event to remember. READ MORE Additional details Service Options Venue notes The 2021 Ultimate Wedding Package is $6,500 for a 6 hour event that includes a Bridal Suite, Library Suite, Amphitheater/outdoor wedding space with white garden chairs, chickee hut for cocktail hour with 8 high top tables, Auditorium for reception with chivari chairs, Ample time is provided for set up and clean up at no extra charge. Additional hours can be arranged for a fee of $500/hr. A refundable security deposit of $800 is required. Please call for 2022 rental pricing. Amenities and Restrictions Amenities - Bride's dressing area - Groom's dressing area - Tables and chairs provided - Upgraded chairs - Outdoor lighting - Venue set up and clean up - Day-of coordinator - Kitchen for prep only - Large parking lot - Dance area Restrictions - BYO alcohol - General liability insurance required - No rice, birdseed, confetti, etc. - Approved outside caterer allowed - Amplified music OK indoors and outdoors - Smoking in designated areas only - Music must end by 11:00PM - Outdoor music must end by 8:00PM - No outside furniture unless pre approved by venue Amenities - Bride's dressing area - Groom's dressing area - Tables and chairs provided - Upgraded chairs - Outdoor lighting - Venue set up and clean up - Day-of coordinator - Kitchen for prep only - Large parking lot - Dance area Restrictions - BYO alcohol - General liability insurance required - No rice, birdseed, confetti, etc. - Approved outside caterer allowed - Amplified music OK indoors and outdoors - Smoking in designated areas only - Music must end by 11:00PM - Outdoor music must end by 8:00PM - No outside furniture unless pre approved by venue Links Old Davie School Historical Museum 954-797-1044 CALL VENUE FAVORITE Venue Highlights Indoor and outdoor spaces BYO Upgraded rentals included STARTING AT $3,262 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor / Outdoor available Max Indoor capacity: 175 Max Outdoor capacity: 175 Reception Indoor / Outdoor available Max Indoor capacity: 175 Max Outdoor capacity: 175 STARTING AT $3,262 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://olddavieschool.org/nenitapwildblogpost/",
      "text": "Endless Opportunity at FAU Davie | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest Endless Opportunity at FAU Davie May 15, 2021 By Nenita P. Wild — Old Davie School Intern, Graduate of FAU History Masters program. Formative Years at the Florida Atlantic University Davie in the late 1980s was still mostly undeveloped and well-known for its rural appeal—but there was high demand for higher education in the area. Broward County in this period was the second most populous county in the state. State legislators recognized the need for a public university in the county, which resulted in Florida Atlantic University (FAU) expanding its campus to Davie. In an interview with Dr. Joyanne Stephens conducted by Nenita P. Wild, a history grad student at FAU Boca, she provided a glimpse of FAU’s formative years. Dr. Stephens was assistant to the Broward Provost in 1989, who coordinated and worked closely with the Deans and administrators at the FAU Boca campus to grow the programs in Broward. Prior to Dr. Stephens’s retirement, she was the vice president and associate provost of regional campuses in FAU and worked tirelessly to meet the goal in providing the students with higher education. Cape Fear, 1991. Locations throughout South Florida were featured in the movie. During the expansion years of FAU in Davie, there was no I-595 for easy commuting, but many faculty members like Dr. Stephens were committed to making a difference in the student life on campus. She shared a fun-fact of one of the memorable experiences during her first semester at the Davie Campus.  Before the construction of the buildings in the early 1990s, the faculty and staff members of FAU occupied rented buildings at Broward Community College. She said, “I arrived on Monday morning to see the first floor of our rented building totally transformed. Hallways had been narrowed, fake exposed ductwork.  What was going on? [They were filming] a remake of the movie ‘Cape Fear’ and our building was part of the action.” FAU grew from the rented floors to state-of-the-art buildings that fosters student’s dreams of higher education. Learning Opportunities in Rural Davie The programs at FAU Davie were designed to cater to the needs of students in the area, especially those from Broward Community College (BCC). The partnership of FAU and BCC was called a two-plus-two, where FAU offered the junior and senior courses of the undergraduate programs, as well as graduate programs. Dr. Stephens described this partnership, “as the model for university/community college relationships. With the support of our Deans and faculty from both FAU and BCC, the emphasis was placed on the articulation of programs and assuring that students move seamlessly from BCC to FAU.” Students in the area were from different backgrounds including non-traditional, older, and married with families. Many of the courses at FAU were offered in the evening—from 4 in the afternoon and on Saturdays. More importantly, according to Dr. Stephens, “most students were first generation; the first in their family to attend college.” The student body also consisted of “minority students whose parents had migrated from the Caribbean, South and Central America.” The diversity of the students inspired the faculty, both those who were hired to be full time faculty for the Davie campus and faculty who came from the Boca Campus.  According to Dr. Stephens the combination of resident and traveling faculty “allowed the university to offer complete degree programs on the Davie Campus, essential for students with complex lives who needed educational opportunities close to work and home.”  Dr. Stephens commented, “many were Broward County teachers who would rush from their classes to ours, working on graduate degrees.  Others were older students, women and men, who had interrupted their education to marry and raise a family.” There were traditional age students as well who worked full time and needed a campus close to their jobs.  Dr. Stephens was so proud of the students enrolled at FAU’s Davie Campus.  She said,” I love, love, love non- traditional students.  They are focused, committed and grateful for the opportunities that BC and FAU provides. The $14.5 million FAU/BCC University/College Library expanded the old library’s holdings by more than 100,000 volumes, expanded its physical size from 37,000 square feet to 112,000, and added sophisticated technological capabilities to benefit students. 1994. By 1990, FAU fully opened its doors to students from BCC and others in the area who were seeking a bachelor and master’s degree.  In the later years, the multi-million-dollar state of the art library and other classroom facilities were constructed. The library was a symbol of the partnership between Florida Atlantic University and Broward Community College (BCC). While the Davie campus was still considered to be in a rural area, it was successful in providing local students a chance to pursue their degree in higher education. Go Owls! The partnership between FAU and BCC was “wonderful” as Dr. Stephens noted. Dr. Stephens joined FAU in 1989 and after a year, the enrollment reached around one thousand students in Davie. By 2007, the enrollment increased to six thousand students. FAU continued to expand its academic programs in Broward that resulted in the growth of faculty and staff members as well. When Florida Atlantic University looked to expand offerings in downtown Fort Lauderdale, BCC was pleased to share its site. In closing, it was a great honor and privilege to interview Dr. Stephens, especially her openness to share the historical event of FAU Davie through her personal memories. With this interview, undoubtedly, she was one of the driving forces who enabled FAU to thrive in the midst of adversity. As an alumnus at FAU Boca, I am a proud nontraditional student who earned a degree in higher education under the tutelage of scholars like Dr. Stephens whose goal was to foster the student’s interest in education. Share this entry Share on Facebook Share on X Share on Pinterest Share on LinkedIn Share by Mail https://olddavieschool.org/wp-content/uploads/2025/01/Copy-of-Museum-Event-Venue-10.png 0 0 ODSadmin https://olddavieschool.org/wp-content/uploads/2025/01/Copy-of-Museum-Event-Venue-10.png ODSadmin 2021-05-15 12:37:31 2021-05-15 12:37:31 Endless Opportunity at FAU Davie Recent Posts Maintenance Event Job Description Endless Opportunity at FAU Davie Episode 17: Orange Blossom Festival Recent Posts Maintenance Event Job Description Endless Opportunity at FAU Davie Episode 17: Orange Blossom Festival Episode 1: History of the Old Davie School 5 Hidden Facts in the Town of Davie Logo Archives August 2021 May 2021 February 2021 January 2021 May 2020 March 2020 February 2020 February 2019 February 2017 January 2017 December 2016 Categories Kim's Korner Newsletter Press Release Uncategorized LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Episode 17: Orange Blossom Festival Maintenance Event Job Description Scroll to top"
    },
    {
      "url": "https://davie-school-foundation-inc.square.site/product/stitched-together-an-exhibit/66?cs=true&cst=custom",
      "text": "Museum Admission | Old Davie School Museum & Event Venue"
    },
    {
      "url": "https://www.davisonschools.org/staff-directory",
      "text": "Staff Directory - Davison Community Schools Skip To Main Content Close Menu Search Clear Search Athletics Tryout Dates Cardinal Connection Athletic Newsletter About Us Welcome to DCS Our History Balanced Calendar Davison Educational Foundation Employment Enrollment Information FERPA (Privacy Policy) Freedom of Information Act Requests Non Discrimination Policies Request Your Transcript School Safety Drills Safety Drills 2025-26 Safety Drills 2024-25 Safety Drills 2023-24 Safety Drills 2022-23 Safety Drills 2021-22 Safety Drills Grievance Procedures Annual Reports Building and Site Sinking Fund November 4, 2025, Ballot Departments Homepage Superintendent Board of Education Board Minutes Board Minutes 2024-25 Board Minutes 2023-24 Board Minutes 2022-23 Board Minutes 2021-22 Board Minutes 2020-2021 Board Minutes 2019-20 Board Minutes 2018-19 Board Minutes 2017-18 Board Minutes  2016-17 Board Minutes 2015-16 Board Minutes 2014-15 Board Minutes 2013-14 Board Minutes 2012-13 Board Minutes 2011-12 Board Minutes 2010-11 Board Minutes 2009-10 Human Resources and Operations Job Opportunities Grievance Procedure (opens in new window/tab) Student Services PA 380.1310a Reporting of Crimes Health/Medical Information Specific Learning Disabilities Eligibility Statement Business and Finance Transparency Reporting Collective Bargaining Agreements & Health Care Benefit Plans Communications Board Briefs Board Briefs 2022-23 2017-18 Chirp Sheet (formerly Building Beat) 2024-25 2023-24 2022-23 2021-22 2019-20 2018-19 2016-17 2015-16 2014-15 2013-14 2012-13 Cardinal Caller Curriculum Challenging Academic Potential (CAP) Curriculum Guides Library Facilities and Operations Storm Water Management Bid Documents Food and Nutrition Technology Services Transportation Safety and Security DCER DCER Site (opens in new window/tab) Early Childhood Learning Cardinal's Nest 3-Year-Old Tuition Preschool 4-Year-Old Preschool Program Options Parent Resources Davison Latchkey GSRP Free Preschool Parent Information Program Options Enrollment Steps Schools Homepage Davison High School (opens in new window/tab) Davison Alternative High School (opens in new window/tab) Davison Middle School (opens in new window/tab) Hahn Intermediate (opens in new window/tab) Central Elementary (opens in new window/tab) Gates Elementary (opens in new window/tab) Hill Elementary (opens in new window/tab) Siple Elementary (opens in new window/tab) Thomson Elementary (opens in new window/tab) Staff Employee Benefits Open Enrollment Documents and Forms Employee Web (New Version) (opens in new window/tab) NWEA (opens in new window/tab) PIVOT (opens in new window/tab) EasyIEP (opens in new window/tab) Technology Help Desk Info Photo Directory for Staff Parents Annual Notices Parent and Student Handbook e~Funds Protect MI Child Suicide Prevention Hotline ParentVUE/StudentVUE Information and Tip Sheets Course Outlines and Priority Standards District School Year Calendar Kindergarten Registration for 2025-26 school year Firearm Storage Requirements and Penalties Quick Links Calendar ParentVUE/StudentVUE Staff Directory Facebook Twitter Instagram District Schools Davison High School Davison Alternative Education Davison Middle School Hahn Intermediate Central Elementary Gates Elementary Hill Elementary Siple Elementary Thomson Elementary Davison Athletic Department Davison Community Enrichment and Recreation (DCER) Open Menu Logo Image Logo Title Davison Community Schools Where Kids Come First and Futures Begin Quick Links Calendar ParentVUE/StudentVUE Staff Directory Open Search Search Clear Search Close Search Athletics Tryout Dates Cardinal Connection Athletic Newsletter About Us Welcome to DCS Our History Balanced Calendar Davison Educational Foundation Employment Enrollment Information FERPA (Privacy Policy) Freedom of Information Act Requests Non Discrimination Policies Request Your Transcript School Safety Drills Grievance Procedures Annual Reports Building and Site Sinking Fund November 4, 2025, Ballot Departments Homepage Superintendent Board of Education Human Resources and Operations Student Services Business and Finance Communications Curriculum Facilities and Operations Food and Nutrition Technology Services Transportation Safety and Security DCER DCER Site (opens in new window/tab) Early Childhood Learning Cardinal's Nest Davison Latchkey GSRP Free Preschool Schools Homepage Davison High School (opens in new window/tab) Davison Alternative High School (opens in new window/tab) Davison Middle School (opens in new window/tab) Hahn Intermediate (opens in new window/tab) Central Elementary (opens in new window/tab) Gates Elementary (opens in new window/tab) Hill Elementary (opens in new window/tab) Siple Elementary (opens in new window/tab) Thomson Elementary (opens in new window/tab) Staff Employee Benefits Open Enrollment Documents and Forms Employee Web (New Version) (opens in new window/tab) NWEA (opens in new window/tab) PIVOT (opens in new window/tab) EasyIEP (opens in new window/tab) Technology Help Desk Info Photo Directory for Staff Parents Annual Notices Parent and Student Handbook e~Funds Protect MI Child Suicide Prevention Hotline ParentVUE/StudentVUE Information and Tip Sheets Course Outlines and Priority Standards District School Year Calendar Kindergarten Registration for 2025-26 school year Firearm Storage Requirements and Penalties In This Section Staff Directory Staff Directory Have a question or comment about Davison Community Schools? Please send it to medwards@davisonschools.org Keyword First Name Last Name Location All Locations Alternative Education High School Cardinal Center Cardinal Station Cardinal Station - DCER Cardinal Station - Food Service Cardinal Station - Transportation Cardinal's Nest Cardinal's Nest - GSRP Central - GSRP Central Elementary Copy Center Davison High School Davison Middle School Gates Elementary Hahn Intermediate High School/DAEHS Hill and Central Hill Elementary Siple Elementary Thomson Elementary 1 2 3 … 15 > showing 1 - 40 of 570 constituents Jodi Aboneaaj Teacher Davison High School School: 810-591-0924 ext. 1212 Sarah Abraham Counselor Davison Middle School School: 810-591-5091 ext. 2157 Andrea Alband Latchkey Program Director, Monitor Hill Elementary School: 810-591-0839 Penelope Alband Head Cook Hill Elementary School: 810-591-0841 ext. 2422 Heidi Alcodray Teacher Central - GSRP School: 810-600-4714 ext. 2774 Debbie Alderson Secretary to the Principal Hill Elementary School: 810-591-0839 ext. 2400 Shane Alderson Teacher Davison High School School: 810-591-0626 ext. 1331 Kerin Alford Parapro Central Elementary School: 810-591-0818 Melissa Allen Parapro Hahn Intermediate School: 810-591-0530 Shawn Allen Building Security Hahn Intermediate School: 810-591-1125 ext. 2255 Kellie Alvarado Teacher Davison Middle School School: 810-591-0968 ext. 2153 Matthew Ames Teacher Davison High School School: 810-591-0022 ext. 1105 Denise Arksey Head Cook Siple Elementary School: 810-591-5107 ext. 2620 Dennice Atkinson Parapro Central Elementary School: 810-591-0818 Brit Austin Speech Pathologist Hill Elementary School: 810-591-4843 ext. 2419 Ruth Babcock Head Cook Davison High School School: 810-591-0108 ext. 1108 Kimberly Badger Parapro Hill Elementary School: 810-591-0839 Amanda Bailey Teacher Davison High School School: 810-591-0602 ext. 1221 Mariah Bailey Teacher Central - GSRP School: 810-600-4716 ext. 2776 Kristin Baker Teacher Davison High School School: 810-591-0618 ext. 1318 Jennifer Balabon Apprentice Teacher Davison Middle School School: 810-591-0848 Frances Balakier Monitor Central Elementary School: 810-591-0818 Jody Baldridge Teacher Davison High School School: 810-591-0613 ext. 1303 Danyel Ball Cook Hahn Intermediate School: 810-591-1145 ext. 2249 Jake Balla Technology Services Manager Cardinal Center Stephanie Barnes Secretary Siple Elementary School: 810-591-5104 ext. 2600 Amanda Barrett Teacher Gates Elementary School: 810-591-5007 ext. 2307 Mandy Barrett MTSS Intervention Teacher Siple Elementary School: 810-591-0114 ext. 2632 Kasey Baryo Teacher Davison High School School: 810-591-0658 ext. 1258 Brenda Bauer Parapro Hill Elementary School: 810-591-0839 Alicia Bautista Teacher Central - GSRP School: 810-600-4715 ext. 2775 Amy Baxter Teacher Gates Elementary School: 810-591-4789 ext. 2325 Kayla Baxter Cook Hahn Intermediate School: 810-591-0530 ext. 2249 Brielle Bayliss Dean of Students Central Elementary, Gates Elementary School: 810-591-0818 David Beamer Athletic Director Davison High School School: 810-591-1073 ext. 1073 Susan Beattie Bus Driver Cardinal Station - Transportation School: 810-591-0816 Lacey Bedsole Instructional Coach Gates Elementary School: 810-591-4188 ext. 2316 Andrea Bell Teacher Thomson Elementary School: 810-591-0571 ext. 2517 Brandon Bell Teacher Davison High School School: 810-591-0627 ext. 1310 Melissa Bellinger Teacher Hahn Intermediate School: 810-591-1133 ext. 2237 Logo Image Logo Title Davison Community Schools 1490 N. Oak Road Davison MI 48423 (810) 591-0801 (810) 591-7813 Stay Connected Facebook Twitter Instagram Privacy Policy Site Map Accessibility Powered by Finalsite"
    },
    {
      "url": "https://www.artscalendar.com/venue/old-davie-school-historical-museum/",
      "text": "Old Davie School Historical Museum - ArtsCalendar.com English Arabic Chinese (Simplified) Chinese (Traditional) English French German Russian Spanish Vietnamese SUBMIT EVENT LOGIN LOGOUT MENU Home Events Explore The Causeway Grantees 2022/23 Innovation Grantees 2024 Innovation Grantees 2024 Regional Grantees Public Art Plans Dania Beach Public Art Plan Stories News (BAJA) Blogs OPPS Calls & Jobs in the Arts Find ARTISTS ORGANIZATIONS VENUES Home Events Explore The Causeway Grantees 2022/23 Innovation Grantees 2024 Innovation Grantees 2024 Regional Grantees Public Art Plans Dania Beach Public Art Plan Stories News (BAJA) Blogs OPPS Calls & Jobs in the Arts Find ARTISTS ORGANIZATIONS VENUES Venue Type Arena/Stadium Bar/Tavern Bookstore Business/Company Community Center Concert Hall Cultural District Dance Fairgrounds Film & Video Gallery Historic Building/Landmark Hotel/Inn Kids & Families Library Museum Music Nature Nightclub Online/Virtual Park/Garden Performing Arts Center Poetry & Literature Restaurant/Cafe School Shopping District Special Events Studio Theater Visual Art Winery State / Province FL City/Town Broadview Park Coconut Creek Cooper City Coral Springs Dania Dania Beach Davie Deerfield Beach Fort Lauderdale Hallandale Hallandale Beach Hillsboro Beach Hillsboro Pines Hollywood Lauderdale Lakes Lauderdale-by-the-Sea Lauderhill Lazy Lake Lighthouse Point Margate Miramar North Lauderdale Oakland Park Pembroke Pines Plantation Pompano Beach Southwest Ranches Sunrise Tamarac West Park Weston Wilton Manors Zip/Postal Code 33004 33008 33009 33019 33020 33021 33022 33023 33024 33025 33026 33027 33028 33029 33060 33061 33062 33063 33064 33065 33066 33067 33068 33069 33071 33072 33073 33074 33075 33076 33077 33081 33082 33083 33084 33093 33097 33301 33302 33303 33304 33305 33306 33307 33308 33309 33310 33311 33312 33313 33314 33315 33316 33317 33318 33319 33320 33321 33322 33323 33324 33325 33326 33327 33328 33329 33330 33331 33332 33334 33335 33336 33337 33338 33339 33340 33345 33346 33348 33349 33351 33355 33359 33388 33394 33441 33442 33443 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue Old Davie School Historical Museum Facebook Twitter Linkedin Print Old Davie School Historical Museum Events and Venue Rentals Events and Venue Rentals View less MORE ABOUT THIS VENUE Venue Type: Community Center ; Historic Building/Landmark ; Kids & Families ; Museum ; Special Events LOCATION Old Davie School Historical Museum 6650 Griffin Road, Davie, FL 33314 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette Accessibility Information Wheelchair Access PARKING INFO Free Parking on site. PAST EVENTS Tea with Barbie Presented by Old Davie School Historical Museum at Old Davie School Historical Museum Jul 26, 2025 Accessibility Info Facebook Twitter Linkedin BUY TICKETS Paranormal Investigation with War Party Paranormal Presented by Old Davie School Historical Museum at Old Davie School Historical Museum May 30, 2025 Accessibility Info Facebook Twitter Linkedin BUY TICKETS Homeschool Day at Old Davie School Presented by Old Davie School Historical Museum at Old Davie School Historical Museum May 29, 2025 Accessibility Info Facebook Twitter Linkedin BUY TICKETS Legends of Yesterday – Walking Ghost Tour Presented by Old Davie School Historical Museum at Old Davie School Historical Museum May 23, 2025 Accessibility Info Facebook Twitter Linkedin BUY TICKETS Step Back in Time Saturday Presented by Old Davie School Historical Museum at Old Davie School Historical Museum May 17, 2025 Accessibility Info Facebook Twitter Linkedin BUY TICKETS SHOW MORE Contact information Email / Website / Facebook / Instagram / Pinterest 6650 Griffin Road, Davie, FL 33314 9547971044 Find A Local Venue Search by Keyword Venue Type Arena/Stadium Bar/Tavern Bookstore Business/Company Community Center Concert Hall Cultural District Dance Fairgrounds Film & Video Gallery Historic Building/Landmark Hotel/Inn Kids & Families Library Museum Music Nature Nightclub Online/Virtual Park/Garden Performing Arts Center Poetry & Literature Restaurant/Cafe School Shopping District Special Events Studio Theater Visual Art Winery State / Province FL City/Town Broadview Park Coconut Creek Cooper City Coral Springs Dania Dania Beach Davie Deerfield Beach Fort Lauderdale Hallandale Hallandale Beach Hillsboro Beach Hillsboro Pines Hollywood Lauderdale Lakes Lauderdale-by-the-Sea Lauderhill Lazy Lake Lighthouse Point Margate Miramar North Lauderdale Oakland Park Pembroke Pines Plantation Pompano Beach Southwest Ranches Sunrise Tamarac West Park Weston Wilton Manors Zip/Postal Code 33004 33008 33009 33019 33020 33021 33022 33023 33024 33025 33026 33027 33028 33029 33060 33061 33062 33063 33064 33065 33066 33067 33068 33069 33071 33072 33073 33074 33075 33076 33077 33081 33082 33083 33084 33093 33097 33301 33302 33303 33304 33305 33306 33307 33308 33309 33310 33311 33312 33313 33314 33315 33316 33317 33318 33319 33320 33321 33322 33323 33324 33325 33326 33327 33328 33329 33330 33331 33332 33334 33335 33336 33337 33338 33339 33340 33345 33346 33348 33349 33351 33355 33359 33388 33394 33441 33442 33443 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access Subscribe to our mailing list art in your inbox Signup Today. No Spam. Just Arts. subscribe PROUDLY BROUGHT TO YOU BY f FOLLOW US EVENTS: Classes | Comedy | Culinary | Culture | Dance | Fashion | Festivals | Free | Kids | Music | Theatre | Visual Arts DIRECTORIES Artists Organization Venues CALLS FOR ARTISTS SUBMIT Copyright 2025 Broward Cultural Division | Contact Us I Privacy Policy/Terms of Service { Powered by ARTSOPOLIS }"
    },
    {
      "url": "https://olddavieschool.org/director-staff/",
      "text": "Director & Staff | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    },
    {
      "url": "https://olddavieschool.org/directions-parking/",
      "text": "Directions & Parking | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    },
    {
      "url": "http://olddavieschool.org/film-photography/",
      "text": "Film & Photography | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest Film & Professional Photography A Beautiful Campus for Your Media Needs The School House Museum & Event Center is available for film, TV commercials and still photography. Certain rules and restrictions apply. Film and TV commercial rates vary based on area and time needed. Photo opportunities are available in the historic classroom of the old school and around the campus. Photographers are subject to certain rules and restrictions and sessions must be scheduled in advance. Email events@olddavieschool.org for more information or to schedule an appointment today. Stay Informed Sign Up for our Email Newsletter Sign-up LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    },
    {
      "url": "https://www.olddavieschool.org/construction-underway-on-agricultural-and-citrus-packing-house-at-old-davie-school-historical-museum/",
      "text": "Construction Nearing Completion on Agricultural and Citrus Packing House at Old Davie School Historical Museum | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest Construction Nearing Completion on Agricultural and Citrus Packing House at Old Davie School Historical Museum February 1, 2017 New Interactive Educational Exhibit allows Students  and Museumgoers to Step Back in Time to the Pioneer Days Construction is nearing completion on the Agricultural and Citrus Packing House Exhibit at the Old Davie School Historical Museum. The new exhibit will become a part of the Step-Back-in-Time interactive educational program that demonstrates the life of Davie pioneers to the thousands of students and museumgoers that frequent the historical campus each year. The Agricultural and Citrus Packing House Exhibit places Davie in the context of a growing Florida citrus industry by using equipment donated by Math Igler Grove, a citrus grove and packing house business that has operated in Davie since the 1950s. “This new exhibit will provide an opportunity for both residents and tourists to understand how oranges are grown, harvested and marketed, and to understand the tremendous influence the industry had on Davie and Florida’s history,” said Leslie Schroeder, Executive Director of the Museum. The equipment was donated after the Old Davie School Historical Museum Board of Trustees became aware that the business was being dismantled to make way for the development of homes and a park. The equipment consists of scrubber sections, which cleaned the fruit; the sorting section, where workers pulled the fruit that was too small for shipping; the wax and dryer, to polish the fruit; and, the bin area to prepare the fruit for shipping. The exhibit will include the citrus packing equipment, antique farm equipment and other early 20th century artifacts. The building will visually replicate an original citrus packing house and will prominently display the citrus packing house equipment to allow visitors to experience the packing process. Citrus crates and signage will be placed around the packing equipment to replicate the interior of a citrus packing house as it was in the 1940s. Photographs, ledger books noting production schedules, collection bags, clothing and other items associated with Davie’s citrus farms, along with agricultural equipment from the early 1900s to the 1950s, including a tractor, hay rake, oxen plow and other unique implements used to farm in the Everglades will be arranged in a manner to help a visitor think they are stepping back into a moment in time. The design, fabrication and installation of the exhibit will be completed with the help of museum staff, as well as donated time by local grove owners, architects, engineers, contractors, graphic designers, writers and photographers. Share this entry Share on Facebook Share on X Share on Pinterest Share on LinkedIn Share by Mail https://olddavieschool.org/wp-content/uploads/2016/10/IMG_2670.jpg 3000 4000 ODSadmin https://olddavieschool.org/wp-content/uploads/2025/01/Copy-of-Museum-Event-Venue-10.png ODSadmin 2017-02-01 15:21:17 2017-03-05 09:26:14 Construction Nearing Completion on Agricultural and Citrus Packing House at Old Davie School Historical Museum Recent Posts Maintenance Event Job Description Endless Opportunity at FAU Davie Episode 17: Orange Blossom Festival Recent Posts Maintenance Event Job Description Endless Opportunity at FAU Davie Episode 17: Orange Blossom Festival Episode 1: History of the Old Davie School 5 Hidden Facts in the Town of Davie Logo Archives August 2021 May 2021 February 2021 January 2021 May 2020 March 2020 February 2020 February 2019 February 2017 January 2017 December 2016 Categories Kim's Korner Newsletter Press Release Uncategorized LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy 2016 Year in Review Video Class Reunion of the Century Scroll to top"
    },
    {
      "url": "https://olddavieschool.org/venue/old-davie-school-historical-museum/",
      "text": "Old Davie School Museum & Event Venue | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest 10 events found. Old Davie School Museum & Event Venue Events Venues Old Davie School Museum & Event Venue 6650 Griffin Road Davie , FL 33314 United States Get Directions 954-797-1044 Events at this venue Today Now Now - 2025-10-26 October 26 Select date. September 2025 Thu 11 September 11 @ 7:00 pm - 9:00 pm Event Series Open Mic Night at the Museum Open Mic Night at the Museum Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States Musicians - Comedians - Poets - Storytellers - Artists and more! Come show your stuff on the 2nd Thursday of each month at the Old Davie School. Sign Ups begin at 6:45pm. Show at 7pm.   Admission $10 / Students at the Door with I.D. $5 / Performers FREE.   Hosted by This is […] Sat 20 September 20 @ 11:00 am - 2:00 pm Step Back in Time Saturdays Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States Fri 26 September 26 @ 10:00 am - 12:00 pm Homeschool Day Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States Fri 26 September 26 @ 7:00 pm - 9:00 pm Legends of Yesterday Ghost Tour Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States Join the ConspiriSisters from This Is Improv on a spirited stroll through Davie, uncovering its historical and supernatural hotspots along the way! Admission $30. 15% discount for groups of 4+ : please call to purchase group rate! October 2025 Thu 9 October 9 @ 7:00 pm - 9:00 pm Event Series Open Mic Night at the Museum Open Mic Night at the Museum Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States Musicians - Comedians - Poets - Storytellers - Artists and more! Come show your stuff on the 2nd Thursday of each month at the Old Davie School. Sign Ups begin at 6:45pm. Show at 7pm.   Admission $10 / Students at the Door with I.D. $5 / Performers FREE.   Hosted by This is […] Fri 10 October 10 @ 8:00 pm - 11:00 pm Paranormal Investigation with War Party Paranormal Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States Friday, October 10, 20258pm Explore the 1918 Davie School & more with experienced professionals using the latest technology and your own intuition! Admission $40 / ODS Members, Teachers, Students (I.D. required) $35. --- Fri 17 October 17 @ 7:00 pm - 9:00 pm Spirited History : A Tipsy Tour Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States A Halloween Spook-easy evening at the School House! Take a tour and hear the local love stories from Davie's history. Enjoy libations & relax to the musical stylings of the Moonshyne Players! You'll need a password to this speakeasy -- so get your tickets now! 21+ Event Special Price for Teachers and College Students!! (must […] Sat 25 October 25 @ 10:00 am - 12:00 pm Historic Davie Walking Tour Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States 10am - 12pmGeneral Admission: $15 Members: $12 Sun 26 October 26 @ 11:00 am - 2:00 pm Haunted Hot Rods Car REGISTRATION Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States Onsite Registration $20. Limited spaces available.  No entry after 11am. Sun 26 October 26 @ 11:00 am - 2:00 pm Haunted Hot Rods Family Fun Event Old Davie School Museum & Event Venue 6650 Griffin Road, Davie, FL, United States Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Recent Posts Maintenance Event Job Description Endless Opportunity at FAU Davie Episode 17: Orange Blossom Festival Episode 1: History of the Old Davie School 5 Hidden Facts in the Town of Davie Logo Archives August 2021 May 2021 February 2021 January 2021 May 2020 March 2020 February 2020 February 2019 February 2017 January 2017 December 2016 Categories Kim's Korner Newsletter Press Release Uncategorized LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Bamford Sports Complex Scroll to top"
    },
    {
      "url": "https://olddavieschool.org/about-the-foundation/",
      "text": "About the Foundation | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest About the Foundation The Davie School Foundation was established in 1984 to protect and restore the Davie School to the integrity of its earlier appearance. The Foundation in conjunction with the Town of Davie, the Broward County School Board, the Soroptimist International of Davie, the Davie Historical Society and the community at large has worked tirelessly to preserve this important piece of Broward County’s history. Support Three Ways to Get Involved Become a Member Join the Davie School Foundation and help preserve our heritage by becoming a member today. Learn More Give a Gift Show someone you care by donating in their honor to the Old Davie School. Learn More Volunteer Volunteers are the heart of the Old Davie School. Get involved today by becoming a docent, volunteering for events and many more opportunities. Learn More Museum Staff Directory Executive Director Leslie Schroeder director@olddavieschool.org Education, Group & Private Tours Kim Weismantle, Education Director education@olddavieschool.org 954-797-1044 Facility Rentals/Special Events Kris Stansell, Events Manager events@olddavieschool.org 954-797-1044 Rentals Coordinator Christine McDonough, Events Coordinator coordinator@olddavieschool.org 954-797-1044 Curatorial Stephanie Tindall, Collections Manager collections@olddavieschool.org 954-797-1044 Press/Media Inquiries pr@oldavieschool.org 954-797-1044 Leadership Board of Trustees President: Michael Crowley Community Volunteer Vice-President: Angie Leto Past Comm, Central Broward Water Control District Secretary: Michele Vander Linde Gold Coast Hi-Lift Treasurer: Tom Gill Gill Realty Dianne Aucamp Community Volunteer Ramona Bostani Community Volunteer Kathy Cox Community Volunteer Neal Kalis Kalis, Kleiman & Wolfe Attorneys at Law Monroe Kiar Attorney, Retired Cliff Lockwood Community Volunteer Barbara McCall Founding Member Scott McLaughlin McLaughlin Engineering Judy Paul Town of Davie Mayor Danielle Reinaldo Community Volunteer Janice Strickland Community Volunteer Advisory Board Ron Bergeron Bergeron Properties and Investment Corp Kona Gray EDSA Cindy Griffin Broward Schools Joan Kovac Kovac Automotive Sheldon McCartney Project Stable Valerie Moran VLM Communications Lori Nance Parrish Past Broward County Property Appraiser Dr. Mary Ann Taylor Retired Principal Matthew Tindall Tindall Growers Daniel Weekley Weekley Asphalt Paving Stay Informed Sign Up for our Email Newsletter Sign-up LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    },
    {
      "url": "https://olddavieschool.org/visit/",
      "text": "Visit | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest TOURS Guided Tour of the Museum By Appointment Only and must be scheduled at least 24 hours in advance. Please call 954.797.1044 or email ODSHM@olddavieschool.org to schedule your Guided Tour! Appointments Self-Guided Tour Walk-in Visitors are welcome to enjoy a Self-Guided Tour of the Museum, subject to availability, TUESDAY – FRIDAY (due to morning programming): 12:30pm – 2:30pm, last entry at 2:30pm. Please call to confirm if an earlier time may be available. SATURDAY: 10am – 2:30pm, last entry at 2:30pm. SUNDAY & MONDAY: Closed. Admission Self-Guided Tours Adults: $10 Children (5-12) & Seniors (65+): $7 Guided Tours $15 per person Purchase Your Tickets in Advance! Maps were disabled by the visitor on this site. Click to open the map in a new window. Directions We are Located in Davie From I-95 From I-95 take Griffin Road west 4-1/2 miles to 6650 Griffin Road. The museum is located on the south side of Griffin Road west of Davie Road and east of University Drive. From Fort Lauderdale – Hollywood International Airport When exiting the airport, follow signs for US 1 South to Griffin Road.  Head west on Griffin Road 5-3/4 miles to 6650 Griffin Road.  First left west of Davie Road. The museum is located on the south side of Griffin Road west of Davie Road and east of University Drive. From Turnpike From Turnpike take Griffin Road west 1-1/4 miles to 6650 Griffin Road. First left west of Davie Road. The museum is located on the south side of Griffin Road west of Davie Road and east of University Drive. Get Directions Membership Become a Member and Visit for Free! Learn More Stay Informed Sign Up for our Email Newsletter Sign-up The Old Davie School is a 501(c)(3) not-for-profit organization registered with the Florida Department of Agriculture & Consumer Services as number SC-06825.  100% of all contributions are used for maintaining the Old Davie School Historical Museum as a historic site and educational resource for the community. LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    },
    {
      "url": "https://olddavieschool.org/learn/",
      "text": "Field Trip Programs | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest Learn Live History with Educational Programs Educational Programs at the Old Davie School provide an up-close, hands-on experience that brings the story of the Everglades frontier to life. The Old Davie School educational programs can be adapted to meet the needs of your group, and welcomes public and private schools, homeschool groups and civic organizations. For assistance with funding, ask your school about the School Board of Broward County’s Supplemental Arts and Sciences Program (SASP). Groups are welcome to bring their own bag lunches, and eat at the outdoor picnic tables or under the Chickee Hut after the tour.  The gift shop is located in the Museum Office and available to student groups by request. All programs are designed to meet the Florida Next Generation Sunshine State Standards . For more information or to submit your field request, click here Reviews From Teachers “ As teachers, we enjoyed the overall experience and watching our students excitement as things taught in our classrooms came to life for them. ” “ The curriculum that was taught was relevant and informative. Every activity was a learning opportunity. ” “ My students are studying historical Florida and having an experience like this, really helps them understand what it was like back then. ” Step Back in Time Kindergarten – 5th grade The Step Back in Tim e interactive program investigates life as it was for the pioneers of Davie and western Broward through artifacts, photographs, and hands-on activities. Tour the historic Davie School—built in 1918—and recreate the students’ first day. Students attend a lesson in the restored classroom and practice writing with dip ink pens and explore the museum exhibits. Other activities may include a tour through the 1909 Florida Pioneer House and washing laundry on a washboard, meeting farm animals, pumping water from the well, making fresh orange juice or butter, or visiting the vegetable garden and authentic Seminole Chickee Hut. Program Time: 2 Hour Program. Tuesday – Friday, by reservation only. The tour starts promptly at 10:00 a.m. and runs until 12:00 p.m. Program Cost: $10 per student; one chaperone required per ten students, admitted free. $8 additional chaperones. Number of Participants: 20 minimum, 100 maximum Updated Curriculum Guide for 2025 – 2026! Download the Step Back in Time Curriculum Guide with activities for students and additional information for teachers. Curriculum Guide Additional Program Opportunities We can gear and adapt our program for any age-range or needs. Please contact our Education Director at education@olddavieschool.org for more information. Learn More Other Amazing Programs High School Volunteers Looking to earn volunteer hours for graduation requirements? Email join@olddavieschool.org to join our Contact List for upcoming opportunities! Time Travelers Club Summertime Program The Time Travelers Club Summertime program is a chance for Summer Camps around Broward, Miami-Dade and Palm Beach to visit the Old Davie School and experience an old-fashioned summertime! The 90-minute program takes campers back in time to what life was like for children 100 years ago. Scheduling for the program begins in February. Scout Programs Interested in completing merit badge requirements or projects with the Old Davie School? Contact education@olddavieschool.org or call 954-797-1044 for more information. Stay Informed Sign Up for our Email Newsletter Sign-up LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    },
    {
      "url": "https://olddavieschool.org/",
      "text": "Home | Old Davie School Museum & Event Venue Plan Your Visit Upcoming Events The Venues Education Field Trips Homeschool Days Virtual Programming Summertime Program 2025 Davie Elementary Yearbook Project Join & Support Become a Member Become a Sponsor Give Volunteer About History of the Davie School About the Foundation Film & Photography Press & Newsletter Sign Up for E-News Directions Menu Menu Facebook Instagram Youtube Pinterest Step Back in Time at the Old Davie School Built 1918 Oldest Existing School Building on its Original Location in Broward County Listed on the National Register of Historic Places 1988 Preserve Explore the Museum Educate Experiences for Students & Groups Celebrate Historic Venue for Your Events Celebrate The Perfect Vintage Setting for your Classic Wedding Learn More About the Venues Upcoming Events Step Back in Time Saturdays September 20, 2025 https://olddavieschool.org/wp-content/uploads/2023/08/Copy-of-For-Website-Icon-3.png 1080 1080 ODSadmin https://olddavieschool.org/wp-content/uploads/2025/01/Copy-of-Museum-Event-Venue-10.png ODSadmin 2023-08-20 10:12:31 2025-08-26 17:41:01 Step Back in Time Saturdays Homeschool Day September 26, 2025 https://olddavieschool.org/wp-content/uploads/2024/01/Website-Icon-11.png 1080 1080 ODSadmin https://olddavieschool.org/wp-content/uploads/2025/01/Copy-of-Museum-Event-Venue-10.png ODSadmin 2024-01-05 12:22:42 2025-08-21 12:35:30 Homeschool Day Legends of Yesterday Ghost Tour September 26, 2025 Join the ConspiriSisters from This Is Improv on a spirited… https://olddavieschool.org/wp-content/uploads/2024/09/Website-Icon-8.png 1080 1080 ODSadmin https://olddavieschool.org/wp-content/uploads/2025/01/Copy-of-Museum-Event-Venue-10.png ODSadmin 2024-09-10 11:28:58 2025-08-26 17:40:29 Legends of Yesterday Ghost Tour View More Get the Latest from the Museum Sign Up for Email Updates on Upcoming Events, Exhibits, and More! Sign-up Our Mission Old Davie School enriches the community as a timeless destination linking our past, present, and future. PAST : … by preserving the history of Davie and western Broward and engaging a variety of audiences through exhibits, programming, and field trips. PRESENT : … by offering a venue for creating memories through social events, workshops and classes, event rentals, and other educational experiences. FUTURE : … by seizing opportunities for growth and change to reflect the ever-evolving community of South Florida. Learn More LOCATION 6650 Griffin Road, Davie, FL 33314 954-797-1044 Email MUSEUM & EVENT VENUE OFFICE: Tuesday—Saturday 10 a.m. to 3 p.m. MUSEUM TOURS: Explore the \"Plan Your Visit\" page above to learn about tour opportunities. Copyright © Old Davie School Facebook Instagram Youtube Pinterest Privacy Policy Scroll to top"
    }
  ]
}