{
  "fuentes": [
    {
      "url": "https://www.hickorybbq.com/contactus",
      "email": "sales@hickorybbq.com"
    },
    {
      "url": "https://www.pnj.com/story/news/2019/01/21/old-hickory-whiskey-bar-owner-katie-garrett-blazes-trail-downtown-pensacola/2605304002/",
      "email": "cgirod@pnj.com"
    },
    {
      "url": "https://www.pnj.com/story/news/2019/01/21/old-hickory-whiskey-bar-owner-katie-garrett-blazes-trail-downtown-pensacola/2605304002/",
      "email": "jnewby@pnj.com"
    },
    {
      "url": "https://www.pnj.com/story/news/2019/09/30/old-hickory-owner-opens-kennedy-bar-palafox-pensacola/3785777002/",
      "email": "gregg@pnj.com"
    },
    {
      "url": "https://www.pnj.com/story/news/2019/09/30/old-hickory-owner-opens-kennedy-bar-palafox-pensacola/3785777002/",
      "email": "jnewby@pnj.com"
    },
    {
      "url": "https://www.hickorybbq.com/about-us",
      "email": "sales@hickorybbq.com"
    },
    {
      "url": "https://cameraandflask.com/steven-gray-commercial-photographer-blog/2015/01/17/old-hickory-whiskey-bar-pensacola-photographer",
      "email": "steven@cameraandflask.com"
    }
  ],
  "mails": [
    "cgirod@pnj.com",
    "gregg@pnj.com",
    "jnewby@pnj.com",
    "sales@hickorybbq.com",
    "steven@cameraandflask.com"
  ],
  "nombre_sitio": "oldhickorywhiskeybar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hickorybbq.com/contactus",
      "text": "Contact Us | Old Hickory Since 1946: America’s Rotisserie Leader 0 My Cart 0 Wishlist Sign in Home Products All Products U.S.-made rotisseries and cooking equipment trusted by supermarkets and restaurants for over 75 years Batch Rotisserie High-capacity, production focused ovens built for efficiency and volume Vertical Rotisserie Most popular--showcase presentation with consistent cooking Churrasco Authentic open-fire grilling--mulitple menu items, high guest appeal Display Warmers Keep food fresh, hot, and visually appealing to drive repeat sales Supermarkets Why Rotisserie Programs Matter Rotisseries drive deli traffic ROI Pay back your oven in as little as 50 working days Case Studies See how others built successful programs Training & Support From startup to training, we set you up for success Equipment for Supermarkets Display Warmers Why Old Hickory? American-made craftsmanship, proven since 1946 Foodservice Computers & Devices Laptops Desktop computers Components Tablets Smartphones iPhone Monitors Televisions Office screens Projectors Electronics Camera GPS & navigation Accessories Home audio Office audio Promotions Computers Electronics Monitors Networks Follow us Support Customer Help ​ F.A.Q. Quick answers to common questions ​ Find a Technician Locate service partners near you ​ Warranty Coverage details & registration Resources ​ Operational Manuals Downloads for all models ​ Blog News, updates & case studies ​ Events Training & industry trade shows ​ Shop Parts Order replacement parts ​ Services Support packages & training ​ Find Your Old Hickory Answer a few questions & we'll match you About Us Contact Us ​ 0 0 Home Products Supermarkets Foodservice Support About Us Since 1946: America’s Rotisserie Leader Sign in Contact Us ​ Contact us Hickory BBQ HQ 4900 W Side Avenue, North Bergen, NJ 07047 +1 (201) 223-0050 sales@hickorybbq.com Contact us about anything related to our company or services. We'll do our best to get back to you as soon as possible. Your Name * Phone Number Your Email * Your Company * Subject * Your Question * Submit Thank You For Your Feedback Our team will message you back as soon as possible. In the meantime we invite you to visit our website . By subscribing to Old Hickory text messages, you agree to receive recurring messages. Message and data rates may apply. Message frequency depends on your interactions and preferences. If you've received a message, reply STOP to opt-out of future messages or HELP for more information. Useful Links Home About us Products Services Privacy Policy Legal Contact us We're Hiring! About us Crafting Excellence since 1946. Made in the USA. North Jersey Proud. Woman-Owned and Minority Owned. Hablamos Español! Commercial Chicken Rotisserie Ovens Machines Experience the Old Hickory Difference Today. Connect with us Contact us sales@hickorybbq.com +1 (201) 223-0050 Follow us Copyright © Hickory Industries, Inc. English (US) | Español (CL) Powered by - \n                    The #1 Open Source eCommerce Respecting your privacy is our priority. Allow the use of cookies from this website on this browser? We use cookies to provide improved experience on this website. You can learn more about our cookies and how we use them in our Cookie Policy . Allow all cookies Only allow essential cookies × Get Your Custom ROI Tell us where to send it—then we’ll take you right to your request. Full Name* Work Email* Company Phone Continue By continuing you agree to our Privacy Policy . Full Name* Work Email* Company Phone Continue By continuing you agree to our Privacy Policy . Skip for now"
    },
    {
      "url": "https://www.pnj.com/story/news/2019/01/21/old-hickory-whiskey-bar-owner-katie-garrett-blazes-trail-downtown-pensacola/2605304002/",
      "text": "Old Hickory Whiskey Bar owner Katie Garrett blazes trail in downtown Pensacola News Sports Play Opinion Advertise Obituaries eNewspaper Legals NEWS Old Hickory Whiskey Bar owner blazes her own trail in downtown Pensacola Jake Newby Pensacola News Journal Editor's note: This is the first of a four-part series profiling entrepreneurs who have opened successful businesses that have reshaped downtown Pensacola. Sometimes, Katie Garrett likes to sit off in the shadows of her bar on 123 South Palafox St. and listen to patrons talk about the business. Sometimes, when those patrons spot the 31-year-old owner hanging out off to the side, they ask her what she does for a living. Almost every time, they react in disbelief when Garrett tells them that the dimly lit Old Hickory Whiskey Bar — with its iconic ceiling-high library shelves lined with different whiskey and bourbon brands — is her brainchild. \"I think it’s fun to shock people in a good way and show them young women are capable of doing things like owning a whiskey bar,\" said Garrett, who opened Old Hickory in 2014. \"I’ve had people straight up tell me, 'Oh, I figured it was just a 50-year-old man who loved whiskey and just had a lot of money to burn.' No, complete opposite. I've even been met with people who’ve thought I was lying, who Googled me right there.\" Garrett, a Pensacola native, entered a barren job market in 2010 with a history background after earning her bachelor's and master's degrees at the University of West Florida. She had to expand her job search outside of her college major, which is how she landed at a human resources company and began \"accidentally\" learning business, working her way up from a customer service representative to a business development manager at the company. She said she fell in love with the whiskey industry after first falling in love with whiskey. But it was not love at first sip. \"I was the only one who drank whiskey out of all of my friends, but it got to the point where it was kind of boring drinking the same whiskey over and over and over,\" Garrett said. \"I wanted something different so I was going to the liquor store, shelling out money and buying more crafty products, hoping I'd find something I enjoyed. And it wasn’t always something I enjoyed, and it just sat on my shelf and I felt like I wasted money on a product I didn’t really love. I knew I couldn’t be the only person who felt like that because whiskey became cool again in that time frame.\" Read the rest of the series: Kevin and Catalina Lehman | Pure Barre and Fosko Matt LaFon and Scott Zepp | World of Beer DC Reeves | Perfect Plain Brewing Co . Garrett's sort of trial and error experience with leisurely drinking whiskey sparked her idea for what is now Old Hickory. \"Old Hickory came from a place of need for me personally, wanting to go somewhere different and try something personally without committing to purchasing an entire bottle, so, it was a selfish act, I’m not gonna lie, to open up Old Hickory,\" she said. \"But, I’m pretty sure everyone was OK with that decision in the end.” Garrett explored three different downtown locations before leasing Old Hickory's current spot. By about 2014, the bar and restaurant scene was on the upswing so Garrett felt like settling in on Palafox with new bars on either side of her was a solid opportunity. \"The draw to be down here is great. If you only have one great bar, it’s not gonna be successful so we’re really lucky to have great neighbors,\" Garrett said. Garrett said she went solo through a bank to acquire a business loan of about $75,000 to get Old Hickory off the ground. And when it did get going, the bar's whiskey wall was about one-third of the size it is now. Garrett also credits the now closed 5 1/2 Bar for pioneering a craft cocktail interest downtown, another key component to Old Hickory's success \"The fact that there were no whiskey bars, and at the time, cocktails were on the upswing in Pensacola, so we're lucky 5 1/2 brought that entire movement here” Garrett said. \"So turning ourselves into a craft cocktail bar as well turned out to be more of a good thing. So I think we kind of hit both markets and niches that were not being met in Pensacola.\" More: Old Hickory Whiskey Bar owner opening new cocktail bar on Palafox in place of Pita Pit Over the past five years, Garrett has faced some of the challenges that all first-time small business owners face with turnover and learning on the go. But she doesn't consider being a young, female owner in a predominantly male industry to be one of those challenges. On business trips to Kentucky, the talks of female customers and owners elbowing their way into the whiskey conversation are positive ones among major distillers, Garrett said. Now, Garrett is taking one of the best pieces of advice she's ever received to heart. \"You always want your business to get to the point where if you step away, it can run itself,\" she said. \"I started to get to that point where Old Hickory could run itself because I had a great team behind me that made me realize, 'OK, it's time to do something else.'\" Now in a position to give back, Garrett is focused more than ever on charity work. She's also the co-host of a weekly podcast called \" Bourbon Betty's ,\" and is in the process of opening up her second venture, The Kennedy , a cocktail lounge that will be located at 1 Palafox Place, likely opening this year. \"I've learned not to try to force something to happen, so we just kinda let it fall into our laps as far as the location and were lucky enough to snag it up,\" Garrett said. \"I feel like it was time.\" Jake Newby can be reached at jnewby@pnj.com or 850-435-8538. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://www.pnj.com/story/news/2019/09/30/old-hickory-owner-opens-kennedy-bar-palafox-pensacola/3785777002/",
      "text": "Old Hickory owner opens The Kennedy bar on Palafox in Pensacola News Sports Play Opinion Advertise Obituaries eNewspaper Legals NEWS The Kennedy cocktail bar opens at the corner of Palafox with 1960s theme, full food menu Jake Newby Pensacola News Journal The lights are on, the doors are open and the drinks are flowing at The Kennedy on 1 South Palafox Place, the highly anticipated second venture of Old Hickory Whiskey Bar owner Katie Garrett . Downtown Pensacola's newest upscale bar opened Thursday inside the Blount Building, which was last occupied by the Pita Pit in 2017 . The Kennedy's \"classic and sleek theme\" was designed with its debonair namesake in mind. \"As a historian, I fell in love (with) the drinking culture of the '50s and '60s and I wanted to keep with the theme of naming my bar after a president,\" Garrett said in an email to the News Journal about her new bar. \"JFK is the quintessential person I think of when thinking of the 1960s.\" Joining the fray this winter: The 5 Barrel brewery coming soon to Palafox in downtown Pensacola When you first walk through the door of the 1,500-square-foot bar, Garrett said, you'll spot the serpentine bar-top and custom black-tufted leather banquet seating with gold accents throughout. What is on the Kennedy's food and drink menu? The Kennedy's \"Where mid-century cocktails meet 21st century libations\" tagline is reflected in its initial easy-to-digest drink menu consisting of 10 Classics, each priced at $10.50, and 10 Moderns for $12.50. ► The Kennedy's drink menu: \"From the drinks to the food menu, everything is exceptional,\" Garrett said. \"One of the things I'm most excited about is our 'shareable sips,' which are large format cocktails for groups of two or more. These cocktails are served with a unique presentation. For example, one is served in a pineapple and another is served in a teapot with tea cups.\" The Kennedy, which seats 72, also serves $17.50 flights, red and white wine and imported and domestic beers. Unlike its sister bar down the street, The Kennedy comes equipped with a kitchen and is serving a full food menu right out of the gate, featuring shareable bites, boards, sandwiches and salads and desserts. ► The Kennedy's food menu: \"I am really excited about our food menu,\" Garrett said. \"It includes classics from the 1960s such as ham salad, shrimp cocktail and jello, but also modern specialties. My absolute favorite is Elvis bread pudding ... .\" Excited to get started Garrett signed a lease with Bobby's Switzer's One Palafox Place LLC in January 2018. She had originally pegged an opening date near the end of the 2018 summer . Garrett opted not to divulge details about what delayed the bar's opening, but said she's accrued even more valuable learning experience as a bar owner in the past year. \"I am very passionate about giving Pensacola the best dining and entertainment venue, so I take the setbacks as opportunities to grow and learn,\" she said. \"I am thrilled that we are open.\" Switzer said he's excited to see The Kennedy's progress. \"They're sort of a boutique bar, and upscale, and I think there are people looking for that type of experience and ambiance,\" the building owner said. \"And they know what they're doing as far as creating that type of atmosphere. They did it at Old Hickory and I'm sure they'll do a good job of it up here.\" When is The Kennedy open? The Kennedy's hours are 4 p.m. until midnight Sunday through Thursday and 4 p.m. until 2 a.m. Fridays and Saturdays. Jake Newby can be reached at jnewby@pnj.com or 850-435-8538. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://www.hickorybbq.com/about-us",
      "text": "About Us | Old Hickory Since 1946: America’s Rotisserie Leader 0 My Cart 0 Wishlist Sign in Home Products All Products U.S.-made rotisseries and cooking equipment trusted by supermarkets and restaurants for over 75 years Batch Rotisserie High-capacity, production focused ovens built for efficiency and volume Vertical Rotisserie Most popular--showcase presentation with consistent cooking Churrasco Authentic open-fire grilling--mulitple menu items, high guest appeal Display Warmers Keep food fresh, hot, and visually appealing to drive repeat sales Supermarkets Why Rotisserie Programs Matter Rotisseries drive deli traffic ROI Pay back your oven in as little as 50 working days Case Studies See how others built successful programs Training & Support From startup to training, we set you up for success Equipment for Supermarkets Display Warmers Why Old Hickory? American-made craftsmanship, proven since 1946 Foodservice Computers & Devices Laptops Desktop computers Components Tablets Smartphones iPhone Monitors Televisions Office screens Projectors Electronics Camera GPS & navigation Accessories Home audio Office audio Promotions Computers Electronics Monitors Networks Follow us Support Customer Help ​ F.A.Q. Quick answers to common questions ​ Find a Technician Locate service partners near you ​ Warranty Coverage details & registration Resources ​ Operational Manuals Downloads for all models ​ Blog News, updates & case studies ​ Events Training & industry trade shows ​ Shop Parts Order replacement parts ​ Services Support packages & training ​ Find Your Old Hickory Answer a few questions & we'll match you About Us Contact Us ​ 0 0 Home Products Supermarkets Foodservice Support About Us Since 1946: America’s Rotisserie Leader Sign in Contact Us ​ Designed by Industrial Engineers in New York City, 1946 Our Mission At Old Hickory, we design and build durable, U.S.-made rotisserie ovens and cooking equipment that empower supermarkets, restaurants, and foodservice operators to grow their business. We pair our products with expert training , responsive support , and continuous innovation —delivering consistency, efficiency, and flavor in every operation Contact us 79 Years in business 10 Core Models 4 Generations of Owners 100% Commitment to Your Success Our Vision To be the most trusted American manufacturer of rotisserie and cooking equipment, known worldwide for innovation, craftsmanship, and training that helps our partners deliver food that keeps customers coming back Contact us THE NEW OLD HICKORY Return on Investment Faster ROI, Lasting Returns Pay back your rotisserie in as little as 50 working days Long equipment life and a lower cost of ownership Efficient designs that refuce waste and labor More Details Training Training & Partnership for Success Expert startup and product training Responsive tech support and part availability Resources that keep your rotisseire program running strong More Details Quality American Craftsmanship since 1949 100% U.S.-made rotisseries and cooking equipment Built for durability, conssitency, and performacne Proven in supermarkets and foodservice operations More Details They Trust Us American-Made. Trusted Since 1946. Old Hickory builds U.S.-made rotisseries and display equipment—and partners with supermarkets to run profitable deli programs. Explore Equipment Talk to Sales Since 1946 75+ years of rotisserie craft U.S.-Made Built and supported in New Jersey 50 working days Typical payback with average programs* Our Story Founded in 1946, Old Hickory Bar-B-Q Machines has helped shape the modern rotisserie—first for restaurants, then for the supermarket deli revolution. Today, the “New Old Hickory” is built around partnership: durable, U.S.-made equipment plus training and support that keep programs running strong across single stores and multi-location chains. We believe rotisserie is more than a hot meal—it’s a profit center. That’s why our focus is squarely on supermarkets, with solutions that deliver consistency, speed payback, and build customer loyalty. Why Rotisserie Matters What We Make. Who We Serve. Rotisserie Ovens Batch and vertical models designed for daily supermarket volume and consistent results. See equipment → Display Warmers Hold quality and showcase presentation to extend sell window and drive impulse buys. Explore warmers → Training & Support Startup, SOPs, bilingual guides, and responsive service for repeatable results. How we help → Durability Serviceable construction, available parts, and fewer interruptions to your program. Consistency Even heat, simple controls, and clear SOPs for store-to-store repeatability. ROI Focus Programs that can pay back in as little as 50 working days with average assumptions. Made in the USA From our New Jersey facility, we build equipment for real supermarket demands: high capacity, easy cleaning, and reliable daily use. Our team partners with operators to select the right models, plan day-parts, and keep quality consistent across shifts. Engineer for cleanability and food safety Quick access to service and parts Models for back-of-house efficiency and front-of-house theatre From Heritage to What’s Next 1946 Old Hickory is founded—American rotisserie craft begins. 1970s–2000s Supermarket deli expansion; durability and scale become our hallmark. Today Supermarket-first focus: equipment + training + support. Next Ventless flexibility, auto-clean options, and smarter controls. “Old Hickory helped us standardize quality across locations and keep sales hot all day. The support has been outstanding.” — Deli Director, Regional Supermarket Read Case Studies See ROI The Team Engineers, trainers, and support specialists who care about your deli program’s success. We’re here before install, on launch day, and long after. Meet our team → Careers Join a company that builds things that last—right here in the U.S. We hire makers, problem-solvers, and people who love great food. See Open Roles Let’s Build Your Rotisserie Program Whether you’re outfitting one store or a 300-location chain, we’ll help you choose, launch, and run it right. Talk to Sales Explore Equipment *Payback based on typical cost and average rotisserie sales assumptions. Useful Links Home About us Products Services Privacy Policy Legal Contact us We're Hiring! About us Crafting Excellence since 1946. Made in the USA. North Jersey Proud. Woman-Owned and Minority Owned. Hablamos Español! Commercial Chicken Rotisserie Ovens Machines Experience the Old Hickory Difference Today. Connect with us Contact us sales@hickorybbq.com +1 (201) 223-0050 Follow us Copyright © Hickory Industries, Inc. English (US) | Español (CL) Powered by - \n                    The #1 Open Source eCommerce Respecting your privacy is our priority. Allow the use of cookies from this website on this browser? We use cookies to provide improved experience on this website. You can learn more about our cookies and how we use them in our Cookie Policy . Allow all cookies Only allow essential cookies × Get Your Custom ROI Tell us where to send it—then we’ll take you right to your request. Full Name* Work Email* Company Phone Continue By continuing you agree to our Privacy Policy . Full Name* Work Email* Company Phone Continue By continuing you agree to our Privacy Policy . Skip for now"
    },
    {
      "url": "https://cameraandflask.com/steven-gray-commercial-photographer-blog/2015/01/17/old-hickory-whiskey-bar-pensacola-photographer",
      "text": "Old Hickory Whiskey Bar - Pensacola Photographer — Steven Gray | Commercial Photographer Skip to Content Open Menu Close Menu Work Hotels Restaurants Bars About / Contact Store Fine Art Prints Puzzles Login Account 0 0 Work Hotels Restaurants Bars About / Contact Store Fine Art Prints Puzzles Login Account 0 0 Open Menu Close Menu Folder: Work Back Hotels Restaurants Bars About / Contact Folder: Store Back Fine Art Prints Puzzles Login Account Old Hickory Whiskey Bar - Pensacola Photographer Blog Editorial Photography Jan 17 Written By Steven Gray Old Hickory Whiskey Bar, photographed by Steven Gray Where to begin? Old Hickory first earned my affection on the strength of the name. I grew up with my grandmother telling me that her side of the family was descended from President Andrew \" Old Hickory \" Jackson, the historical bad@$$ who invaded Spanish Florida twice and generally Honey Badgered his way through into historical record. Long story short, Pensacola, for its own quirky reasons, reveres Andrew Jackson. There are several sites around town dedicated to his memory and my ears perk up when I hear about a new one. Two years ago, Old Hickory opened its doors and I was absolutely floored by the atmosphere of the bar, the number of whiskeys in stock and the incredible friendliness of the owners and staff. It's a place that keeps the music low and the cocktails perfect. It invites slow drinks and long conversations with both friends and strangers. And, like any good craft cocktail bar, the signature drinks often involve bursts of flame. Old Hickory Whiskey Bar 123 S. Palafox St., Pensacola, FL 32501 https://www.facebook.com/OldHickoryWhiskeyBar Owner: Katie Garrett Bar Manager: Jeff Knott bar cocktail bar downtown pensacola jeff knott katie garrett old hickory old hickory whiskey bar palafox street pensacola pensacola photographer steven gray steven gray photography upside of florida upsideofflorida whiskey whiskey bar Steven Gray Previous Previous Aerial Yoga - Downtown Pensacola Next Next Under the Tree: Baby Piper - Pensacola Photographer All content © Steven Gray 2025"
    }
  ]
}