{
  "fuentes": [
    {
      "url": "https://oldshavana.com/events/",
      "email": "events@gastronomicamiami.com"
    }
  ],
  "mails": [
    "events@gastronomicamiami.com"
  ],
  "nombre_sitio": "oldshavana.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://oldshavana.com/events/",
      "text": "PRIVATE EVENTS – Olds Havana HOME MENU PRIVATE EVENTS DELIVERY RESERVATIONS CATERING GIFT CARDS HOME MENU PRIVATE EVENTS DELIVERY RESERVATIONS CATERING GIFT CARDS MAIN MENU Close Close HOME MENU PRIVATE EVENTS DELIVERY RESERVATIONS CATERING GIFT CARDS AN EVENT IN THE HEART OF LITTLE HAVANA Host Your Private Event at Old’s Havana in Miami Make your celebration unforgettable at Old’s Havana Cuban Bar & Cocina in the heart of Little Havana. From corporate events and team-building to wedding rehearsals, birthdays, and private parties , our authentic Cuban atmosphere sets the perfect stage. Enjoy family-style dining, signature cocktails, live music, and interactive Mojito demos that bring the spirit of Cuba to your event. RESERVATIONS CLICK TO get a free custom quote CALL OR WHASTAPP AT (786) 578 2220 OUR PACKAGES • BUFFETS Enjoy a variety of authentic Cuban dishes served buffet-style, perfect for large groups. • SET MENUS Curated dining experiences with signature Cuban favorites for your guests. • OPEN BAR Full bar service featuring craft cocktails, Cuban classics, and premium spirits. • HOURS D’OUEVRES Hand-crafted bites inspired by Cuban flavors, ideal for cocktail receptions. • FULL VENUE RENTAL Reserve our entire Little Havana location for a truly private celebration. • LIVE MUSIC Add authentic Cuban rhythms to your event with live bands and performers. •BIRTHDAYS Celebrate your special day with Cuban flair, food, and festive energy. • WEDDING DINNERS A romantic and lively setting for unforgettable memories. • OPEN BAR A Mark the milestone with family-style dining and Cuban hospitality. • GRADUATIONS Mark the milestone with family-style dining and Cuban hospitality. • CORPORATE DINNER Perfect for client entertainment or team-building with a cultural twist. • HOLIDAY EVENTS Celebrate the season with vibrant Cuban music, cuisine, and cocktails. • BUFFETS Enjoy a variety of authentic Cuban dishes served buffet-style, perfect for large groups. • SET MENUS Curated dining experiences with signature Cuban favorites for your guests. • OPEN BAR Full bar service featuring craft cocktails, Cuban classics, and premium spirits. • HOURS D’OUEVRES Hand-crafted bites inspired by Cuban flavors, ideal for cocktail receptions. • FULL VENUE RENTAL Reserve our entire Little Havana location for a truly private celebration. • LIVE MUSIC Add authentic Cuban rhythms to your event with live bands and performers. •BIRTHDAYS Celebrate your special day with Cuban flair, food, and festive energy. • WEDDING DINNERS A romantic and lively setting for unforgettable memories. • OPEN BAR A Mark the milestone with family-style dining and Cuban hospitality. • GRADUATIONS Mark the milestone with family-style dining and Cuban hospitality. • CORPORATE DINNER Perfect for client entertainment or team-building with a cultural twist. • HOLIDAY EVENTS Celebrate the season with vibrant Cuban music, cuisine, and cocktails. THE MAGIC OF OLD'S HAVANA OUR CAPACITY get a free custom quote CALL OR WHASTAPP AT (786) 578 2220 HOURS Sunday- Thursday 11:00 am – 11:00 pm Friday-Saturday 11:00 am – 12:00 am LOCATION 1442 SW 8th St, Miami, FL 33135 FOR RESERVATIONS +1 786 518 2196 FOR PRIVATE EVENTS +1 786 578 2220 BUY A GIFTCARD Is there a better gift than Cuban food and drinks? Click Here Instagram Facebook HOURS Sunday- Thursday 11:00 am – 11:00 pm Friday-Saturday 11:00 am – 12:00 am LOCATION & CONTACT 1442 SW 8th St, Miami, FL 33135 Events Manager - Melissa Rivera +1 (786) 578 2220 events@gastronomicamiami.com Instagram Facebook"
    }
  ]
}