{
  "query": "oldschoolsquare.org email",
  "fuentes": [
    {
      "url": "https://oldschoolsquare.org/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/all-events/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/cornell-museum/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://downtowndelraybeach.com/oldschoolsquare",
      "email": "oss@downtowndelraybeach.com"
    },
    {
      "url": "https://oldschoolsquare.org/crest-theatre/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/6x6-sale/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/pavilion-shows-events/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/about/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/rent/facilities/fieldhouse/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/rent/facilities/fieldhouse/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/creative-arts-school/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/about/history/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/about/board-of-directors/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/cabaret/",
      "email": "info@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/cabaret/",
      "email": "events@oldschool.org"
    },
    {
      "url": "https://old-school-square-membership.square.site/about",
      "email": "info@oldschool.org"
    },
    {
      "url": "https://oldschoolsquare.org/partners/",
      "email": "events@oldschool.org"
    }
  ],
  "mails": [
    "info@oldschool.org",
    "oss@downtowndelraybeach.com",
    "events@oldschool.org"
  ],
  "nombre_sitio": "oldschoolsquare.org",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://oldschoolsquare.org/",
      "text": "Old School Square Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Old School Square Center for the Arts continues to be a driving force in the community for Arts & Cultural programming and education. Old School Square Center for the Arts continues to be a driving force in the community for Arts & Cultural programming and education. Old School Square Center for the Arts continues to be a driving force in the community for Arts & Cultural programming and education. Old School Square Center for the Arts continues to be a driving force in the community for Arts & Cultural programming and education. Old School Square Center for the Arts continues to be a driving force in the community for Arts & Cultural programming and education. Old School Square Old School Square Center for the Arts continues to partner with public and private entities to promote Arts & Cultural programming and education. In April 2023, OSS and the City of Delray Beach both dropped their respective lawsuits and signed a settlement agreement. In May 2023, the City Commission and Old School Square met and participated in a workshop to start mending the relationship. A workshop is scheduled to take place in September 2023 between OSS, the DDA, and the City. In  November 2023 – the City of Delray Beach opened a Request for letter of Interest (RFLI) to manage the Crest Theatre Building    Old School Square Center for the Arts submitted their proposal and the bid closed in January 2024.  Old School Square Center for the Arts awaits the City Commissions action and decision. In May 2024 – when it became clear a partnership was not possible we responded with this letter . News Old School Square and the City of Delray Beach have both signed a settlement offer September 7, 2023 Joint Public Announcement: During a special commission meeting held on March 31st, 2023, the Delray Beach City Commission voted to accept a settlement offer proposed by the non-profit Old School Square Center for the Arts. Old School Square Announces New Concert Series October 23, 2021 As you are aware, the City’s impulsive termination of our lease forced us to make some very difficult decisions with regards to our existing calendar of seasonal events and programs – events and programs that required financial and operational commitments that we no longer had the capacity to support after the multitude of challenges imposed Read more… Old School Square accused of misleading public by Mayor August 16, 2021 Mayor Petrolia stated in her correspondence with our supporters that “the information sent out by the management at OSS is misleading.”  We would ask Mayor Petrolia to clarify what was the information OSS shared with our supporters/her constituents that was misleading.  Mayor Petrolia also stated that her decision to vote to terminate the lease with Read more… Read More News GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/all-events/",
      "text": "Events Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Events Old School Square Center for the Arts presents a variety of special events and festivals throughout the year. Current Events Old School Square Center for the Arts is pleased to host their 10th Annual 6×6 Exhibition & Sale on May 16th. This year, the event will be held at the Delray Beach Chamber of Commerce, just steps from downtown. The 10th Annual 6×6 Exhibition brings together hundreds of original artworks in all disciplines, made and donated by international & local artists and local students. The community can view and then buy their chosen 6×6 artwork during the event for $40 each. All proceeds will benefit youth-related art education programs and the Delray Chamber Education Fund. Artwork will be juried and awarded.  Art submissions by April 24, 2025.  Please click Learn More or QR code for Artist Information & Registration. Past Events GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/cornell-museum/",
      "text": "Cornell Art Museum Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Cornell Art Museum Image Courtesy of Delray Beach Historical Society Cornell Art Museum, Fabricated Exhibition, 2017 Flora Exhibition, 2018 Flora Exhibition, 2018 Art on the Square, 2017 Olivia Steele, LIT Exhibition, 2016 History of Cornell Art Museum The Cornell Art Museum is housed in the restored 1913 Delray Elementary School building on the Old School Square campus. The Cornell Art Museum was dedicated in 1990 and named in honor of Delray Beach residents Harriet W. and George D. Cornell. The architecture, formally known as “Masonry Vernacular,” makes the building unique in the downtown area. This style was used for several smaller buildings in the Old School Square Historic Arts District. During the restoration process, the original atrium and classrooms, which are now exhibition spaces, were restored to preserve the rare Dade County Pine floors, tall windows, and open space. The only significant modification to the interior was to open the atrium up to the second floor, allowing for natural light to stream in and provide a more spacious feel. Thanks to a patron of the arts, Margaret Blume, the Museum completed a $1 million interior renovation in November 2017. GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://downtowndelraybeach.com/oldschoolsquare",
      "text": "OLD SCHOOL SQUARE | Downtown Delray Beach Skip to main content Join us on Business Login Find Your Fun Stay Things to Do Dine Shop Happy Hour Getting Around Events About Us Search a listing Categories Stay Arts & Culture -- Art Galleries, Studios & Antiques -- Museums & Nature Centers -- Theaters & Performing Arts Beauty and Wellness -- Beauty & Spa -- Fitness -- Health & Wellness ---- Chiropractors ---- Counseling ---- Cosmetic/plastic surgeons ---- Dentists ---- Medical massage therapy ---- Optometrists ---- Other therapies ---- Periodontist ---- Podiatrist Entertainment Things to Do Other Services -- Alterations & Cleaners -- Catering -- Education -- Banks -- Business/Marketing Consultants -- Developer -- Financial -- General Contractors -- Home Care -- Housing Authority -- Interior Design -- Legal -- Marketing Agencies -- Matting and Framing -- Pharmacy -- Photography -- Place to Live -- Postal Services -- Realtors -- Sports Agency -- Travel Agent Parks and Nature Dine -- Bars -- Candy, Bakery, Coffee, Ice Cream -- Juice Bars -- Restaurants SHOP -- Arts, Crafts & Framing -- Beauty & Wellness Products -- Books and Music -- Clothing & Accessories -- Consignment -- Convenience Store -- Florist -- Furniture, Home & Garden -- Jewelry -- Markets -- Office Supply & Greeting Cards -- Pets & Grooming -- Shoes -- Specialty -- Wine, Liquors & Cigars Weddings and Celebrations Parking Locations Beachside Pineapple Grove Arts District SOFA (South of Atlantic) The Ave The Set (West Atlantic) US1 Search Delray Beach Find Your Fun Things to Do OLD SCHOOL SQUARE Old School Square is an historic cultural arts campus in the heart of Downtown Delray Beach. Old School Square’s mission is to create a welcoming space where the community comes together for high-quality, diverse and interactive art experiences, while honoring the 100-year-old historic campus. The 6-acre campus is home to early 20th century school buildings that have been renovated and are now a fine arts museum ( Cornell Art Museum ), wedding and events venue (The Vintage Gym), and a performance theatre and creative arts school (Crest Theatre building). The campus also boasts an outdoor amphitheatre for live music performances, a park and its own parking garage , located adjacent to the park. Old School Square takes up an entire city block at the corner of Atlantic Avenue and Swinton Avenue. The address is 51 N. Swinton Avenue, Delray Beach, FL 33444. The Old School Square campus is one of the largest cultural venues within the city of Delray Beach where there are showcases of fine art exhibits, large concerts, and theater performances along with an historic venue to hold private events such as weddings and special celebrations. For venue rentals and inquiries, email us at oss@downtowndelraybeach.com or call (561) 243-1077. Visit The Delray Old School Square Website For Events & All Information! Delray Old School Square Website Click To Visit The Old School Square campus is one of the largest cultural venues within the city of Delray Beach where there are showcases of fine art exhibits, large concerts, and theater performances along with an historic venue to hold private events such as weddings and special celebrations. SEE CURRENT EXHIBITIONS CORNELL ART MUSEUM at Old School Square Fine Art Museum VINTAGE GYM at Old School Square Event Venue: Call 561-243-1077 CREST THEATRE BUILDING at Old School Square Currently Closed for Renovations THE PAVILION at Old School Square Concert Venue: Call 561-243-1077 Sign Up for DDA Updates First Name Last Name Email* Please verify your request* Submit Media Video Gallery Careers About Us Our mission is to grow, strengthen, and enhance the economic vitality of Downtown Delray Beach. As an autonomous agency of the City, the Delray Beach DDA advocates, facilitates, plans, and executes business development, fosters business relations, helps with the planning of public and private projects, and markets the downtown district. Contact Information 350 SE 1st Street ∙ Delray Beach, FL 33483 (561) 243-1077 Copyright © 2025 Downtown Delray Beach. All rights reserved. Privacy Policy Business Login Powered by VUP Media"
    },
    {
      "url": "https://oldschoolsquare.org/crest-theatre/",
      "text": "Crest Theatre Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Crest Theatre Image Courtesy of Delray Beach Historical Society Image Courtesy of Delray Beach Historical Society History of Crest Theatre The Crest Theatre was restored by Old School Square Center for the Arts thru generous support from the Forrest C. Lattner family foundation. The Crest Theatre is housed in the restored 1925 Delray High School building on the Old School Square campus in Delray Beach. It was dedicated in 1993 as the performing arts center of Old School Square. Originally the high school auditorium, the Crest Theatre was re-designed as a charming, 323-seat, state-of-the-art facility combining the original high school color (blue) with warm burgundy and gold accents. The original stage was only 12 feet deep; therefore two stories of additional space were added during restoration to provide backstage, dressing room and storage areas. The original proscenium remains an important historic feature of the theatre. GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/6x6-sale/",
      "text": "6x6 Exhibition and Sale - Exciting New Location Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE 6×6 Exhibition and Sale – Exciting New Location Old School Square Center for the Arts is pleased to host their 9th annual 6×6 Exhibition & Sale featuring donated artwork from around the country. Participating artists are asked to donate original works of art. The art works will be the feature exhibit and sold at the 6×6 Exhibitions & Art Sale on May 31st at the Hub @ Space of Mind. View our Events page for more information. Twenty (20) artists will be asked to display larger works from their collection to be on view the night of the event and will be for sale by the artist. This year, artwork will be judged by established artist William DeBilzan and Palm Beach gallerist Rolando Chang Bararro, who will choose 1st, 2nd, and 3rd place awards. There will also be another set of awards at the student level! SAME GREAT EVENT…EXCITING NEW LOCATION! The Hub @ Space and Mind | 102 N Swinton Ave, Delray Beach, FL 33444 Collector views rows of donated 6×6 works. 2019 Are you an artist? Donate a 6×6″ piece of artwork! Complete the linked registration form and submit with your artwork. No form, no display! All artwork must be received by 4:00 pm on Tuesday, April 25, 2023 by 4:00 PM. Questions? Email events@oldschool.org with questions or call Petrina Easton: 954-825-9113. ARTIST REGISTRATION FORM IMPORTANT DATES: May 10 : William DeBilzan & Rolando Chang Barraro will view and judge the artwork May 11 , 10:00am – 7:00pm: Artwork will be on view to the public May 12th 6:00pm – 9:00pm Artwork goes on sale! Join us for the celebration and sale! SPECIAL THANKS TO OUR SPONSORS! DeBilzan Galleries Stuart & Shelby Development Inc. The Box Art Gallery Easton Art Gallery Artist-Entry-Form-6×6-2023 Download GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/pavilion-shows-events/",
      "text": "Pavilion Shows & Events Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Pavilion Shows & Events Date Color Current Month No Events GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization. X"
    },
    {
      "url": "https://oldschoolsquare.org/about/",
      "text": "Old School Square Center for the Arts History Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Old School Square Center for the Arts History Old School Square Center for the Arts had its beginnings, as Old School Square.  Old School Square Center for the Arts lovingly restored the buildings and worked to have them named a National Historic Site.  The Early 20th Century School Buildings serve the greater Delray Beach Community and South Florida. Located in the heart of downtown Delray Beach, this award-winning, nationally recognized arts center successfully combined historic preservation and the arts to become the catalyst for the 1990’s renaissance of downtown Delray Beach. It all began with the vision of one person, our founder, Frances F. Bourque. Mission Statement Old School Square Center for the Arts mission is to support arts and culture through original programming and events, public and private partnerships, arts and cultural education, and advocacy for the arts and culture in our community. Value Statement We strive to provide superior, professional and accessible programs and services through a team of dedicated staff and volunteers who embrace cultural diversity and work to establish strong partnerships. Vision Statement Our vision is to offer a broad range of programs and services that will inspire every segment of the community to participate. OLD SCHOOL SQUARE BOARD DIVERSITY POLICY Old School Square Center for The Arts, Inc. a Nonprofit Florida Organization is committed to a diverse, inclusive, and equitable environment where all board members, staff, volunteers, and members feel respected and valued regardless of gender, age, race, ethnicity, national origin, sexual orientation or identity, disability, education, or any other bias. We’re committed to being nondiscriminatory and providing equal opportunities for employment, volunteering, and advancement in all areas of our work. We respect the value that diverse life experiences bring to our board and leadership, and we strive to listen to their views and give them value. We’re committed to modeling diversity, inclusion, and equity and maintaining fair and equal treatment for all. Our board’s philosophy on our goals to provide informed leadership for diversity, inclusion, and equity include: We will strive to see diversity, inclusion, and equity in connection with our vision and mission for the benefit of those we serve. We aim to recognize and address inequities in our policies, programs, and services. We will update and document progress on our diversity, equity, and inclusion practices. We promise to investigate underlying assumptions that interfere with our diversity policy. We commit to advocating for systemic inequities that impact our work at the board level and address it according to this policy and in accordance with our mission. We commit to challenging commonly accepted notions about what constitutes strong leadership within our organization. We commit to being transparent about diversity in all our interactions. We will dedicate our time and resources to expanding greater diversity within our board and leadership positions. We commit to leading with respect and tolerance and we encourage all employees and volunteers to express this in their work within our organization. Old School Square Center for The Arts, Inc. a Nonprofit Florida Organization agrees to abide by the following action items to promote diversity, inclusion, and equity in our work: We will create new learning opportunities and formal, transparent policies as we strive for cultural competency throughout our organization. We will take action to improve diversity, inclusion, and equity in our board and leadership positions. We will continue to develop our programming to demonstrate our commitment to diversity, inclusion, and equity. We will train our personnel to be responsible for orienting, onboarding, and training our staff and volunteers on equitable practices. Old School Square’s BOD will annually review and implement any necessary changes to improve or modify our diversity policy. GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/rent/facilities/fieldhouse/",
      "text": "Fieldhouse Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Fieldhouse Located adjacent to the Crest Theatre building Used for weddings, receptions, craft shows and more Accommodates up to 225 at tables or 300 theatre-style Room is 40’ x 70’ 12’ x 28’ stage Balcony for additional seating Adjacent food preparation/load-in area – does not include commercial equipment Former locker rooms were converted to beautifully appointed restrooms High ceilings with rafters provide great opportunities for creative design Maximum capacity: banquet, 225; theatre style, 300; children and youth oriented event, 150 (additional security personnel required). For inquiries, please email Events@oldschool.org GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/creative-arts-school/",
      "text": "Creative Arts School Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Creative Arts School Photograph by Lee Gordon Creative Arts School History Old School Square Center for the Arts most successful program was the Creative Arts School created in 1995. The school offered beginner through master level classes, for all ages. Many of the students won local, state and national awards. GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/about/history/",
      "text": "History Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE History 1913 Elementary building before restoration Cornell Museum of Art & American Culture Delray High School (c. 1925) became part of the Delray Elementary campus after the last graduating class in 1949. It served the community in this capacity until the mid 1980's when the entire campus was abandoned bu the Palm Beach County School District. This photo shows the building in 1989, just before restoration. The Crest Theatre is housed in the restored Delray High School building (c. 1925) 1925 Gymnasium entrance before restoration Vintage Gymnasium after restoration Old School Square was created thanks to the determination of a local group of citizens who saved the 1913 Delray Elementary and 1925 Delray High School buildings from demolition after they were abandoned by the Palm Beach County School District in the mid 1980’s. Over $7 million was raised to restore and re-adapt the facilities for use as a museum and theatre. These Delray Beach Schools are listed on the National Register of Historic Places. The entire site serves as a gathering place for the community. History Time Line 1913 – Delray Elementary was built on the corner of Swinton and Atlantic Avenues for grades one through twelve. 1925 – Delray High School was built just north of the elementary building, on the same site, to serve the growing population. 1949 – Last graduation for Delray High School. Plans were for a new high school to be built north of town, leaving the original elementary and high school buildings to serve as Delray Elementary. Mid 1980’s – Palm Beach County School Board abandoned both school buildings. A new elementary school (Banyan Creek) in the western part of town opened in the fall of 1988. Late 1985 – A group of concerned citizens, spearheaded by then Delray Beach Historical Society Vice President, Frances Bourque, established a task force to save the buildings and recapture some of their historic meaning. In their view, this four-acre site, containing the two classroom buildings with a 320 seat auditorium and gymnasium, had great potential as both an important historic preservation project and an arts center benefiting Delray Beach and the surrounding communities. It was also thought that the restored buildings could jumpstart a plan to revitalize the struggling downtown, which had an occupancy rate of just over 30%. 1986 – The site was incorporated as Old School Square, Inc. and the ambitious restoration project was underway. June, 1988 – Delray Elementary finally closed. The buildings fell into disrepair and the site became a fenced, dilapidated eyesore. The task force, however, had been actively raising funds and working with the City of Delray Beach to acquire the property. 1990 – The 1913 elementary building had been completely restored as the Cornell Museum of Art and History; and the exterior restoration of the original high school building was also completed. 1993 – With restoration completed, the Crest Theatre opened its first season. 1998 – Restoration of the classrooms in the Crest Theatre building was completed. 2002 – Phase I of a 10-year Master Plan for expansion was completed with opening of the Entertainment Pavilion. GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/about/board-of-directors/",
      "text": "Board of Directors Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Board of Directors Patty Jones – Chairman Donor and community volunteer, Patty has been involved with OSS since 2011 and has previously held positions as vice president and secretary. She was also chair of OSS’s Thanks for the Memories and Concert Series. Patty is the former chair of both Empty Bowls Delray Beach and Women of Grace. She has been involved in many local fundraising committees, as well as PTO president of Upper School for four years. Deborah Dowd – Vice Chairman Retired Palm Beach County educator of nearly 40 years, long time active Delray Beach resident, and a member and donor to many local non-profits, including Impact 100 Women and Women of Grace. Pati Maguire – Secretary A professional artist on her sixth term on the OSS board, Pati is also a founding board member of Plein Air Palm Beach and served on the board of In The Pines, an organization dedicated to improving the lives and building homes of the farmworker community in Delray Beach and Boynton. Bill Branning President of BSA Construction, and former board member of numerous community industry and business associations, including Delray Beach CRA, Site Plan Review & Appearance Board, Historic Preservation Board, Delray Beach Chamber of Commerce, and the Delray Beach Historical Society. Sherry Davis Founder of The Davis Team, retired in 2017. Active tennis player and Delray Beach Resident Joe Gillie Former president and CEO of Old School Square, a position he served for 23 years. Joe has supported the arts in Palm Beach County for over 35 years. Janet Meeks Retired former Education Coordinator for Delray Beach & active Delray Beach Resident Judy Mollica – Treasurer Owner & Broker of Ocean East Properties and active Delray Beach resident Cynthia Ridley Community volunteer and outreach coordinator for such organizations as CROS Ministries, MAD DADs of Greater Delray Beach, Delray Beach Homeless Task Force, Roots Culture Festival of Delray Beach, and Community Justice Planner for the City of Delray Beach. Gregg Weiss Business owner and highly-involved Delray community member, Gregg supports such organizations as Arts Garage, Milagro Center, Greater Delray Beach Chamber of Commerce, and HOW Foundation. Ex-Officio Board Members Frances F. Bourque – Founder and Chairman Emeritus Philanthropist, arts supporter, and founder of Old School Square Center for the Arts, Inc. Robert D. Chapin – President Emeritus Attorney and founding partner of Chapin, Ballerano & Cheslack. GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    },
    {
      "url": "https://oldschoolsquare.org/cabaret/",
      "text": "Cabaret Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Cabaret Old School Square is proud to announce that the 25th Anniversary Season of the Broadway Cabaret Series will return in Winter 2022 with to our beloved Crest Theatre! Get ready for some of Broadway’s brightest stars in Delray Beach to perform their intimate cabaret shows on Monday and Tuesday nights. Previous Broadway Cabaret Subscribers and Old School Square Members will have exclusive access to tickets starting Monday, June 28th at 10 AM , prior to the general public on-sale, which is slated for Friday, October 1st at 10 AM! Stay tuned for further information late Spring / early Summer 2021 ! If you have any immediate questions, please email Info@oldschool.org ! Date Color Current Month No Events GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization. X"
    },
    {
      "url": "https://old-school-square-membership.square.site/about",
      "text": ""
    },
    {
      "url": "https://oldschoolsquare.org/partners/",
      "text": "Partners Home About OSS History Board of Directors Letter to Supporters News Press / Media Delray Beach Cornell Art Museum Cornell Art Museum History Creative Arts School Create Arts School History Crest Theatre Crest Theatre History Events Pavilion & OSS Park Pavilion Fieldhouse History Sponsors DONATE Partners Over the years, Old School Square has become a leader in establishing partnerships with other organizations to perpetuate arts and entertainment in the community. Annual event partnerships include the Delray Beach Orchid Society Show & Sale, Southern Handcraft Holiday Show & Sale, the City of Delray Beach 100-foot Christmas Tree and Festivities, the Palm Beach Poetry Festival, Delray Affair, Palm Beach Chamber Music Summer Festival and others. Old School Square receives generous support from city, county and state agencies as well as local businesses and organizations. Programming Support: 5th Avenue Grill Acupuncture Associates All About Florida Homes / Keller Williams Aspen Air Conditioning Beacon South Beach Hotel Bermuda Landscaping BSA Corporation General Contractors, Delray Beach Capital One Cafe CenterState Bank, Delray Beach Coastal Commercial Group, LLC Colony Hotel and Cabana Club Crane’s BeachHouse Hotel & Luxury Villas Day Pitney LLC Delivery Dudes Fred Astaire Dance Studio, Delray Beach Greenlane Lagunitas Brewing Company Lee Cohen (1-800-Call- Lee) Life Storage Lumitec Marcy & Leona Chanin Foundation Mitzi Kaitz Modern Restaurant Group AmTrust Bank, a Division of New York Community Bank Northern Trust, Delray Beach Old School Bakery Patricia Jones PBC Food Bank PerfecTemp Plastridge Insurance Putt’n Around Shamrock Restoration Stuart & Shelby Development, Inc. Tratt & Associates Whitewall Contemporary Yoga Fun Day Young Dentistry General Support: City of Delray Beach Delray Beach Community Redevelopment Agency Cultural Council of Palm Beach County Discover the Palm Beaches Florida Arts/Division of Cultural Affairs Palm Beach County Tourist Development Council Visit Florida Media Support: Atlantic Ave magazine ArtHiveMagazine Delray Newspaper iHeartRadio Legends Radio Business Partners Delray Beach Chamber of Commerce Delray Beach Downtown Development Authority Delray Beach Marketing Cooperative GO Connect With Us Facebook Instagram Twitter YouTube Cornell Art Museum Creative Arts School Crest Theatre Fieldhouse The Pavilion Delray Beach CONTACT\nevents@oldschool.org © 2025 Copyright Old School Square. All Rights Reserved. Terms of Use and Privacy Policy • Site Map • Website designed by Power Play Marketing • All Rights Reserved. Old School Square Center for the Arts, Inc. is a 501(c3) registered non-profit cultural arts organization."
    }
  ]
}