{
  "fuentes": [
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "email": "hero-contact@2x.jpg"
    },
    {
      "url": "https://www.cobbgrillamerica.com/pages/contact-us",
      "email": "cobb@cobbgrillamerica.com"
    },
    {
      "url": "https://www.cobbgrillamerica.com/pages/contact-us",
      "email": "info@cobbglobal.com"
    },
    {
      "url": "https://www.cobbgrillamerica.com/pages/contact-us",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    }
  ],
  "mails": [
    "cobb@cobbgrillamerica.com",
    "hero-contact@2x.jpg",
    "info@cobbglobal.com",
    "info@rivervillegrill.com",
    "info@stagheaddesigns.com"
  ],
  "nombre_sitio": "ontheedgebarandgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "text": "Contact Us - Sidebar Grill 778.298.7433 | Now Hiring View Menu Promotions Order Online Book A Table Live Music Home About Us Menu Events & News Event Venue Gift Cards Contact Us CONTACT US Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly. 778.298.7433 info@sidebargrill.com View Form Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available SUNDAY TO THURSDAY 11am  - 11pm FRIDAY & SATURDAY 11am  - 12am Get Directions Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly at: 778-298-7433. First Name * Last Name * Email * Phone Message 778.298.7433 info@sidebargrill.com Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available Available to serve you seven days a week: Monday – Thursday 10:00am-11:00pm Friday and Saturday 9:00am – 12:00am Sunday 9:00am - 11:00pm Home About Us Menu Events & News Private Dining Gift Cards Contact Us"
    },
    {
      "url": "https://www.cobbgrillamerica.com/pages/contact-us",
      "text": "Get in Touch with COBB®\n – COBB Grill America Skip to content Your cart is empty Continue shopping Have an account? Log in to check out faster. Shopping cart Loading... Add note Add note Shipping Country United States --- Canada United States Province Zip/Postal Code Discount SAVE Subtotal $0.00 Taxes and shipping calculated at checkout Update Check out View Cart 844-770-9900 info@cobbglobal.com FB IN YouTube SHOP SHOP COBB GRILLS COBB ACCESSORIES COBB SPARE PARTS ABOUT COBB RECIPES RECIPES THE BASICS COBB SPECIALTIES GETTING STARTED FAQ Log in FB IN YouTube SHOP COBB GRILLS COBB ACCESSORIES COBB SPARE PARTS ABOUT COBB RECIPES THE BASICS COBB SPECIALTIES GETTING STARTED FAQ Log in Cart Wishlist Search Search Contact Us Home / Contact Us Phone 844-770-9900 Email info@cobbglobal.com Address COBB Grill America 1906 South Kaufman Street Ennis, Texas 75119 Contact form Name Email * Phone number Comment Send Quick Links Accessories Spare Parts Grill Company About COBB Contact Us Shipping & Returns Warranty Privacy Policy Resources Videos Blog Recipes Getting Started FAQs Follow Us FB IN YouTube © 2025 COBB Grill America, All Right Reserved. Payment methods American Express Diners Club Discover JCB Mastercard PayPal Venmo Visa Choosing a selection results in a full page refresh. Back to top"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    }
  ]
}