{
  "fuentes": [
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://www.linkedin.com/company/cityofmiamibeach",
      "email": "biancaguevara@miamibeachfl.gov"
    },
    {
      "url": "https://www.linkedin.com/company/cityofmiamibeach",
      "email": "leonorhernandez@miamibeachfl.gov"
    },
    {
      "url": "https://www.boozycardz.com/blogs/news/shaking-up-the-industry-on-the-rocks-journey-from-garage-to-global-brand",
      "email": "boozy_cardz_-_logo_-_blue_-_round_55x@2x.png"
    },
    {
      "url": "https://nikkibeach.com/miami-beach/",
      "email": "reservations.miamibeach@nikkibeach.com"
    },
    {
      "url": "https://mobilebarontherocks.com/",
      "email": "contact@sansoxygen.com"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "buyer@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "education@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "events@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "info@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "reservations@maritimeme.org"
    },
    {
      "url": "https://otrbartenders.com/",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://www.64ontherocks.com/aboutus",
      "email": "info@64ontherocks.com"
    },
    {
      "url": "https://ontherockscomo.com/",
      "email": "info@ontherockscomo.com"
    }
  ],
  "mails": [
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "biancaguevara@miamibeachfl.gov",
    "boozy_cardz_-_logo_-_blue_-_round_55x@2x.png",
    "boxoffice@diamondheadtheatre.com",
    "buyer@maritimeme.org",
    "cdungca@diamondheadtheatre.com",
    "contact@sansoxygen.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "eben@eyebytes.com",
    "education@maritimeme.org",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "events@maritimeme.org",
    "info@64ontherocks.com",
    "info@maritimeme.org",
    "info@ontherockscomo.com",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "leonorhernandez@miamibeachfl.gov",
    "productions@diamondheadtheatre.com",
    "reservations.miamibeach@nikkibeach.com",
    "reservations@maritimeme.org",
    "rtandal@diamondheadtheatre.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "ontherocksmiamibeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://www.linkedin.com/company/cityofmiamibeach",
      "text": "City of Miami Beach | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now City of Miami Beach Government Administration Miami Beach, Florida 11,170 followers One Team, One City See jobs Follow View all 1,149 employees Report this company About us The City of Miami Beach was incorporated on March 26, 1915. Miami Beach operates on a commission/city manager form of government. The commission consists of a mayor and six commissioners who serve as the policy-making body of the city. The city manager ensures that policies, directives, resolutions and ordinances adopted by the city commission are enforced and implemented. The city manager is also charged with the daily operations of the city. \r\n\r\nThrough fiscal prudence and good leadership, the city’s journey to excellence is guided by its mission, vision and strategic plan that is making Miami Beach a better place to live, work and play.\r\n\r\nWith Biscayne Bay to the west and the Atlantic Ocean to the east, the City of Miami Beach is not just a favorite for international and domestic visitors but for a growing residential population too.  The cosmopolitan island city, just 7.1 square miles, is everything that is cool and hot. Website http://www.miamibeachfl.gov External link for City of Miami Beach Industry Government Administration Company size 1,001-5,000 employees Headquarters Miami Beach, Florida Type Government Agency Founded 1915 Specialties Government, Public Safety, Municipal, Public Works, Parks & Recreation, and Tourism, Culture & Economic Development Locations Primary 1700 Convention Center Drive Miami Beach, Florida 33139, US Get directions Get directions Employees at City of Miami Beach Mike Gibaldi Lauren Firtel Victoria Pelletier C-Suite Transformational Leader | Keynote & TEDx Speaker | Board Director | Author | Passionate Diversity & Inclusion Leader | Tanya Katzoff Bhatt Miami Beach Commissioner | Brand Building, Communications & Marketing Strategy for the Greater Good See all employees Updates City of Miami Beach 11,170 followers 2d Report this post Miami Beach’s Brittany’s Bay Park Project Awarded 2025 Best Restored Shore \n— From the American Shore and Beach Preservation Association —\n\nDetails: https://lnkd.in/eFrPKaSm 17 Like Comment Share City of Miami Beach 11,170 followers 5d Report this post Our biweekly e-newsletter is out now!\n\nHere’s a look at what’s inside:\n🧺 North Beach Community Picnic\n🌊 King Tide Information\n🇺🇸 9/11 Remembrance Ceremony\n🕺 Seniors’ Fall Bash\n🎶 Hispanic Heritage Festival\n🏝️ International Coastal Cleanup\n🌴… and much more!\n\nRead it now: https://conta.cc/3UYSBD8 2 Like Comment Share City of Miami Beach 11,170 followers 1w Report this post Congratulations to our Information Technology Department for being recognized with a 2025 Best of Florida Award by Government Technology for Innovative Use of Data Analytics.\n \nThis recognition highlights the city’s work on data analytics initiatives and focuses on the Fleet Efficiency Analytics initiative, a collaborative effort between the Information Technology Department and Facilities & Fleet Management. The project leverages Miami Beach’s enterprise technical architecture and real-time telematics data to evaluate vehicle utilization, identify underused assets and support cost saving data-driven decisions regarding the rightsizing of the city's fleet. By visualizing complex data and performance trends, the solution enhances transparency, reduces operational costs and improves service delivery.\n \nThis award affirms the city's commitment to innovation, sustainability and continuous improvement in public service delivery. Keep up the great work, team! #InformationTechnology 167 9 Comments Like Comment Share City of Miami Beach 11,170 followers 2w Report this post The DBPR Ombudsman will be at City Hall on Thursday, September 4 from 10 a.m. to 2 p.m.\n\nThis your opportunity to discuss condominium-related concerns directly with a DBPR representative.\n\nAppointments are required, walk-ins will not be accommodated. To arrange your session or for further details, please contact Bianca Guevara at BiancaGuevara@miamibeachfl.gov . 3 Like Comment Share City of Miami Beach 11,170 followers 3w Report this post Join the Black Professionals Network in partnership with the City of Miami Beach for a live pitch night and networking mixer spotlighting Black entrepreneurs building bold businesses in our community. \n\nThursday, August 28\n6 PM - 9 PM\nCasa Matilda\n411 Washington Avenue\n\nRegister to attend: https://lnkd.in/eybE_wFm #MBBiz #BlackBusinessMonth 3 Like Comment Share City of Miami Beach 11,170 followers 3w Report this post The Miami Beach Hispanic Affairs Committee has extended the nomination period for the 2025 Hispanic Heritage Month Awards until 5 p.m. on Thursday, August 21. The committee will honor recipients at an awards ceremony this fall.\n \nNational Hispanic Heritage Month is celebrated annually from September 15 to October 15. The Hispanic Heritage Month Awards are intended to honor members of the Hispanic community who live or work in the City of Miami Beach and who have made a positive contribution to the community in their respective professions.\n \nThe committee will select individuals or businesses from the following categories:\n \nIndividual — Educator, public safety personnel, social service provider, artist, youth (under 18 involved in community service), adult contributing to the success of youth and any Hispanic Miami Beach community member.\n \nBusiness — Business, business owner, or employee of a qualified business (must have at least 51% Hispanic ownership).\n \nNomination forms are available here: https://lnkd.in/dBcBYbUD Completed forms can be submitted via email to leonorhernandez@miamibeachfl.gov or via mail to Leonor Hernandez, City of Miami Beach, Hispanic Affairs Committee Liaison, 1700 Convention Center Drive, Miami Beach, FL, 33139. Like Comment Share City of Miami Beach 11,170 followers 3w Report this post Join Commissioner Alex Fernandez on Wednesday, August 20 from 5 p.m. to 7 p.m. at the Miami Beach City Commission Chambers for an informative session on the property tax appeal process, presented by Miami-Dade Clerk of the Court & Comptroller Juan Fernandez-Barquin and Value Adjustment Board Chairman Senator Rene Garcia.\n\nThe session will explain how to appeal your property tax assessment and introduce the online property fraud alert system.\n\nA Q&A will follow. Don’t miss this opportunity to learn your rights as a property owner and discover the resources available to you. Like Comment Share City of Miami Beach 11,170 followers 3w Report this post Join Miami Vice's Olivia Brown in celebrating the history of Miami Beach & Miami Vice while we host a Live Runway Model Casting Call for the upcoming first-of-its-kind Miami Vice Car & Fashion Show on Ocean Drive this September 10 during Miami Vice Week.\n\nRunway Model Casting Call\nFriday, August 22\n6 PM\nGalería Ocean Drive\n1101 Ocean Drive 3 Like Comment Share City of Miami Beach 11,170 followers 3w Report this post Last chance! The Miami Beach Hispanic Affairs Committee is seeking nominations for the 2025 Hispanic Heritage Month Awards by 5 p.m. tomorrow, August 15. The committee will honor recipients at an awards ceremony this fall.\n \nNational Hispanic Heritage Month is celebrated annually from September 15 to October 15. The Hispanic Heritage Month Awards are intended to honor members of the Hispanic community who live or work in the City of Miami Beach and who have made a positive contribution to the community in their respective professions.\n \nThe committee will select individuals or businesses from the following categories:\n \nIndividual — Educator, public safety personnel, social service provider, artist, youth (under 18 involved in community service), adult contributing to the success of youth and any Hispanic Miami Beach community member.\n \nBusiness — Business, business owner, or employee of a qualified business (must have at least 51% Hispanic ownership).\n \nNomination forms are available here: https://lnkd.in/dBcBYbUD Completed forms can be submitted via email to leonorhernandez@miamibeachfl.gov or via mail to Leonor Hernandez, City of Miami Beach, Hispanic Affairs Committee Liaison, 1700 Convention Center Drive, Miami Beach, FL, 33139. 2 Like Comment Share City of Miami Beach 11,170 followers 3w Report this post Join us for a Business Concierge & Licensing Open House! \n\nWhether you’re just starting out or looking to grow, this open house is your one-stop shop for personalized, in-person support. Meet directly with city staff, county agencies and local business resource partners who are here to help you cut through red tape, unlock new opportunities and get answers on the spot.\n\nGet expert guidance, explore funding and incentive programs, and find out how to make the most of what Miami Beach has to offer for your business. #BlackBusinessMonth Friday, August 22\n10 AM - 3 PM\nMiami Beach City Hall\n1700 Convention Center Drive – 2nd Floor\n\nLearn more: https://lnkd.in/eyJwjgQq 4 Like Comment Share Join now to see what you are missing Find people you know at City of Miami Beach Browse recommended jobs for you View all updates, news, and articles Join now Similar pages City of Miami Government Administration Miami, FL Miami-Dade County Government Administration Miami, Florida City of Coral Gables Government Administration Coral Gables, FL City of Fort Lauderdale Government Administration Fort Lauderdale, FL City of North Miami Beach Government Administration North Miami Beach, FL Broward County Government Government Administration Fort Lauderdale, FL State of Florida Government Administration Miami International Airport Airlines and Aviation Miami, Florida Miami Beach Convention Center Hospitality Miami Beach, Florida City of Hollywood, Florida Government Administration Show more similar pages Show fewer similar pages Browse jobs Executive jobs 690,514 open jobs Social Media Manager jobs 27,779 open jobs Area Manager jobs 170,475 open jobs Video Editor jobs 5,556 open jobs Finance Intern jobs 13,270 open jobs Power Plant Operator jobs 1,743 open jobs Director jobs 1,220,357 open jobs Curator jobs 1,797 open jobs Analyst jobs 694,057 open jobs Executive Vice President of Operations jobs 2,201 open jobs Associate jobs 1,091,945 open jobs Property Coordinator jobs 33,022 open jobs Marketing Manager jobs 106,879 open jobs Office Manager jobs 164,964 open jobs Brand Manager jobs 61,397 open jobs Executive Assistant jobs 28,934 open jobs Assistant Project Manager jobs 39,510 open jobs Paralegal jobs 33,712 open jobs Assistant jobs 711,811 open jobs Receptionist jobs 64,579 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Designer jobs Support Specialist jobs Product Designer jobs Operational Specialist jobs Customer Service Representative jobs Graphic Designer jobs Curator jobs Lean Specialist jobs Specialist jobs Chief Executive Officer jobs Manager jobs Tax Analyst jobs Mergers and Acquisitions Analyst jobs Scientist jobs Head of Human Resources jobs Continuous Improvement Specialist jobs Director of Education jobs Process Improvement Manager jobs Human Resources Manager jobs Human Resources Specialist jobs Administrator jobs Executive Director jobs Intern jobs Analyst jobs User Experience Designer jobs Pilot jobs Service Advisor jobs Security Guard jobs Environmental Specialist jobs Visual Designer jobs Fleet Manager jobs Journalist jobs Service Manager jobs Professor jobs Maintenance Manager jobs Engineer jobs Art Director jobs Employee Relations Specialist jobs Developer jobs Health Policy Analyst jobs Director jobs Project Manager jobs Clinical Manager jobs Medical Coder jobs Medical Sales Representative jobs Representative jobs Writer jobs Content Producer jobs Creative Director jobs Videographer jobs System Support Engineer jobs Strategist jobs Staff Software Engineer jobs Associate jobs Park Director jobs Forester jobs Arborist jobs Superintendent jobs Planner jobs Auditor jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at City of Miami Beach Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.boozycardz.com/blogs/news/shaking-up-the-industry-on-the-rocks-journey-from-garage-to-global-brand",
      "text": "Shaking Up the Industry: On The Rocks’ Journey from Garage to Global B\n– Boozy Cardz Skip to content Just added to your cart Qty: View cart ( ) Continue shopping Submit Close search FREE shipping when you buy 3 or more | 20% OFF 10 or more Home Shop How To Use FAQ Contact Search Log in Cart 0 items Home Shop How To Use FAQ Contact Shaking Up the Industry: On The Rocks’ Journey from Garage to Global Brand by Boozy Cardz December 1, 2023 The Humble Beginnings of a Cocktail Revolution In 2015, a visionary duo, Patrick Halbert, an entrepreneur and restaurateur, and Rocco Milano, a bartender, embarked on a journey that would revolutionize the ready-to-drink (RTD) cocktail industry. They began in a garage, experimenting with spirits and dreaming big. Their goal was simple yet ambitious: to create premium-quality cocktails with all-natural ingredients that could be enjoyed anywhere. This was the genesis of On The Rocks Cocktails (OTR). Crafting the Perfect Mix: Innovation and Partnership The founders of OTR brought a blend of industry expertise and innovative thinking to the table. They tapped into unexplored territories like air travel and hotel room service, bringing their craft-made bottled cocktails to places where a bartender wasn’t available. Their quest for premiumization led to a significant partnership with Beam Suntory in 2018, incorporating top-shelf spirits into their cocktails. This collaboration was a game-changer, propelling OTR into national recognition by 2019 and setting a new standard for the RTD market. A Success Story: Acquisition by Beam Suntory The pinnacle of OTR’s success story came in 2020 when Beam Suntory, a global leader in premium spirits, acquired OTR. This acquisition was not just a business transaction; it was an acknowledgment of OTR’s pioneering role in the premium pre-mixed cocktails category. With Beam Suntory’s backing, OTR was perfectly positioned to expand and innovate further in the rapidly growing spirits-based RTD market, which is one of the fastest-growing segments in the US. The Parallel Path of BoozyCardz BoozyCardz , with its innovative approach to greeting cards, mirrors the inventive spirit of OTR. Like OTR’s reinvention of the cocktail experience, BoozyCardz revolutionizes the traditional greeting card by integrating the joy of gifting a shot bottle. This blend of creativity and practicality places BoozyCardz on a similar trajectory to OTR – starting from a unique idea, focusing on quality, and aiming for expansive growth. Inspiring Innovation in the Spirits Industry The story of OTR is not just about cocktails; it’s about vision, quality, and innovation. It demonstrates that with the right blend of creativity and strategic partnerships, startups can rise to become industry leaders. BoozyCardz , following in the footsteps of such trailblazers, is poised to make its mark in the gifting and spirits industry. It’s a testament to the fact that great ideas, when executed with passion and precision, can lead to extraordinary success. Back to News Boozy Cardz We're a US-based company that designs boozy greeting cards. Our innovative, patented design allows you to gift your favorite bottle to friends and family with a personal touch. Boozy Cardz can also be found at several liquor stores around the USA. P.S. Shot bottle is not included with purchase! Legal Shipping Policy Refund Policy Privacy Policy Terms of Service Non-Affiliate Disclaimer Partnerships Wholesale/Bulk Orders Affiliate Program Corporate Orders Custom Orders Support Boozy News Contact Us FAQ Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa Facebook Twitter Instagram YouTube RSS Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa © 2025, Boozy Cardz Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection. FAQ FAQ"
    },
    {
      "url": "https://nikkibeach.com/miami-beach/",
      "text": "Restaurant & Beach Club Miami Beach | Nikki Beach Skip to main content Menu Book now Select an option Restaurant Beach Club Close Book now (opens in new tab) Reservations Close Happenings Meetings & Events Menus Gallery Shop Global Home Careers Press Contact Nikki Beach Hospitality Group Destinations Europe Europe France Saint-Tropez Restaurant & Beach Club Greece Porto Heli Resort & Spa Restaurant Santorini Resort & Spa Restaurant & Beach Club Italy Costa Smeralda Restaurant & Beach Club Porto Cervo The Nikki Beach Cocktail Club Monaco Monte Carlo Restaurant & Beach Club Spain Marbella Restaurant & Beach Club Mallorca Restaurant & Beach Club Ibiza Restaurant & Beach Club Americas Americas Caribbean Saint Barth Restaurant & Beach Club Antigua IN DEVELOPMENT Resort & Spa Restaurant & Beach Club USA Miami Beach Restaurant & Beach Club Middle East Middle East UAE Dubai Resort & Spa Restaurant & Beach Club Ras Al-Khaimah IN DEVELOPMENT Resort & Spa Oman Muscat IN DEVELOPMENT Resort & Spa Restaurant & Beach Club Asia & Pacific Asia & Pacific Thailand Koh Samui Resort & Spa Restaurant & Beach Club Azerbaijan Baku Resort & Spa In Development Restaurant & Beach Club Miami Beach - Restaurant & Beach Club • USA Book now Nikki Beach Miami Beach: An Iconic Coastal Paradise on South Beach Welcome to Nikki Beach Miami Beach, an iconic South Beach destination since 1998. Located at 1 Ocean Drive in the exclusive South of Fifth neighborhood, Nikki Beach has evolved from a quaint seaside garden into the original barefoot luxury beach club, known for its vibrant atmosphere and exceptional service. Nikki Beach seamlessly blends music, dining, entertainment, fashion, film, and art into one unforgettable experience that defines the essence of Miami Beach. Indulge in full-service beachfront dining on lounge chairs or enjoy a meal with your toes in the sand at the restaurant. Whether basking in the sun or dining with friends, the atmosphere is completed by the sounds of the ocean and the unmistakable energy of Nikki Beach. The beach club also features a bar, a stylish lifestyle boutique, and private event spaces that cater to all types of memorable occasions. For those seeking a cool escape, the indoor dining area, Summer House, offers a welcoming retreat during Miami’s warmest days. With over 25 years of history, Nikki Beach Miami Beach continues to embody the quintessential Miami lifestyle, blending laid-back luxury with the vibrant spirit of South Beach in one of the world’s most famous beachside settings. Book now (opens in new tab) Dine & Drink At Nikki Beach Miami Beach, dining is a celebration of global flavors, curated by Executive Chef Frank Ferreiro. Chef Frank brings his culinary expertise and passion for fresh, high-quality ingredients to every dish, offering an eclectic menu that reflects the vibrant energy of South Beach. Enjoy signature favorites like Nikki Beach’s famous Sushi Boat, alongside fresh seafood, healthy salads, and dishes inspired by Nikki Beach locations around the world. Whether dining on the beachfront or in the open-air restaurant, each meal is a fusion of bold flavors and innovative presentations designed to elevate the Miami dining experience. Our menus Meetings & Events Nikki Beach Miami Beach is an exclusive beachfront venue offering a stunning backdrop for private events. With its blend of indoor and outdoor spaces, it's ideal for both intimate gatherings and large-scale celebrations, all tailored to create unforgettable experiences. Explore more Corporate Events Brand Partnerships Weddings Request Proposal Hours Beach Daily 11AM- 6PM Restaurant Monday - Thursday 12PM – 6PM Friday - Sunday 12PM – 7PM Amazing Sundays Brunch 11AM – 4PM After-Brunch Menu 4PM – 8PM Boutique Daily 12PM – 5PM Contact Address Nikki Beach Miami Beach 1 Ocean Drive Miami Beach, FL 33139 USA Contact phone + 1 305 321 5238 Contact email reservations.miamibeach@nikkibeach.com Boat coordinates 25°46’9.2″N 80°7’56.1″W Get directions (opens in new tab) Nikki Beach Miami Beach, 1 Ocean Drive, Miami Beach, FL, 33139 USA reservations.miamibeach@nikkibeach.com + 1 305 321 5238 Reservation & Door Policy Careers Press Nikki Beach Hospitality Group Global Home Contact Privacy Policy Cookie Policy Manage Cookies Accessibility Terms & Conditions Sitemap © 2025 Nikki Beach Global. All rights reserved. Created at The Hideout JOIN OUR INNER CIRCLE Become part of the Tribe to be the first to hear about our news and events from around the world! Sign Up For Our Newsletter Close JOIN OUR INNER CIRCLE Become part of the Tribe to be the first to hear about our news and events from around the world! First Name Last Name Email address I have read and agree to the privacy policy Join now Thank you for joining our inner circle Cookies We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept all Reject all Manage Close GDPR Cookie Settings Cookie Overview Essential Cookies Analytical Cookies Cookie Policy Cookie Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Essential Cookies Essential Cookies should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Analytical Cookies This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Enable or Disable Cookies Cookie Policy More information about our Cookie Policy Accept All Reject All Save Changes Powered by GDPR Cookie Compliance"
    },
    {
      "url": "https://mobilebarontherocks.com/",
      "text": "On The Rocks Mobile Bar Welcome to Welcome to Welcome to Welcome to More Welcome to Welcome to Welcome to Welcome to On The Rocks is a mobile bar company that will bring a unique experience to any event! ABOUT US! On The Rocks Mobile Bar is perfect for any occasion! Our fully insured and RAMP certified bartending company will bring a unique experience to any event, whether it be a birthday celebration, graduation, bridal/baby shower, wedding or a simple get-together with friends and family.  Due to state laws & regulations, we are a dry hire business, which means you provide the alcohol and we provide everything else! The team at On The Rocks will be sure never to leave any guest unhappy or a glass empty! HOW IT WORKS Inquire below about your event date. Please include your name, event type, date and preferred package. Once we have the basic information a contract will be drafted for you to accept. You will need to sign the contract and send a 50% deposit to secure your event date. We will then provide a custom shopping list specifically designed for your event allowing you to purchase alcohol to your preference. The remaining 50% balance will be due 30 days prior to the date of your event. *If you cancel our services >90 days in advance, you will receive 50% of your initial deposit back. *If you cancel <90 days to your event date no refund will be issued. PACKAGES & PRICING BRONZE ($1200) Mobile bar rental 3 hours of service Ice Mixers Simple garnishes Plastic glassware, napkins, straws Decor SILVER ($1450) Includes everything from Bronze package 4 hours of service Signature cocktail w/ premium garnishes GOLD ($1700) Includes everything from previous two packages 5 hours of service Additional signature cocktail *ALL EVENTS WITH <75 GUESTS WILL AUTOMATICALLY COME WITH ONE BARTENDER. IF THE EVENT IS 76-150 GUESTS A SECOND BARTENDER WILL BE REQUIRED - A FLAT FEE OF $150 WILL BE ADDED FOR THE SECOND BARTENDER. ANY EVENT >150 GUESTS WILL REQUIRE A THIRD BARTENDER AT THE SAME RATE. *AN ADDITIONAL CHARGE FOR ANYTHING OVER A 50 MILE RADIUS OF 18443 WILL BE $1/MILE ROUND TRIP. CONTACT US! Questions or Booking Send us a message or ask a question using this form. If inquiring about reserving us for an event please include event type, date and which package you would like to purchase. We will do our best to get back to you soon! Get in Touch! Get in Touch! Name Email* Attach Files Attachments (0) This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel CHECK US OUT ON SOCIAL MEDIA! Find us on The Knot! The Knot - On the rocks mobile bar Copyright © 2025 On The Rocks Mobile Bar - All Rights Reserved. Powered by GoDaddy This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "text": "Our Team | Staff, Interns, Volunteers & Board of Trustees — Maine Maritime Museum 0 Skip to Content Maine Maritime Museum Exhibits Cruises Give More Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Open Menu Close Menu Maine Maritime Museum Exhibits Cruises Give More Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Open Menu Close Menu Exhibits Cruises Give Folder: More Back Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Our Team A dedicated group of individuals–our staff, board of trustees, interns, and volunteers–make this museum a leading cultural institution and community pillar. As active stewards and educators of history and culture, of our historic site, and of our collections, we strive to inspire an ever-growing audience to experience the local, regional, and global stories of Maine. Leadership Team Featured Chelsea Lane, Director of Visitor Experience Read More → Kurt Spiridakis, Director of Boatbuilding Read More → Jason Morin, Director of Operations Read More → Luke Gates-Milardo, Director of Exhibits & Learning Read More → Chris Timm, Executive Director Read More → Rebecca Roche, Chief Advancement Officer Read More → Chris Jacobs, Director of Finance Read More → Kelly Page, Curator of Collections Read More → Current Opportunities Featured Exhibit Designer Visitor Service Assistants (Volunteer) Visitor Experience Associate Percy & Small Shipyard Guide (Volunteer) Donnell House Guide (Volunteer) Our Board of Trustees, comprised of a group of dedicated individuals, who collectively guide and advise museum policies. Board of  Trustees OFFICERS Thomas C. Whelan, Chair Loren B. Wright, Vice Chair Ross Burgess, Treasurer Lon F. Povich, Secretary TRUSTEES EMERITI Stephen C. Caulfield George H. McEvoy Jackson A. Parker William A. Rogers Elena D. Vandervoort David R. Weiss VOLUNTEER CHAIR Joan Knight TRUSTEES Greger C. Anderson William J. Brennan Tess Chakkalakal Joseph A. Drago Susan S. Duncan Kristin L. Fletcher Raymond E. Hender Leonard W. Langer Kenneth Moller John G. Morse Andrew Perry Carl D. Rapp Mandy Reynolds Thomas Sturgeon Thomas C. Whelan Nancy A. Wilkes Victoria M. Willock John Zittel Volunteer with Us A SENSE OF ACCOMPLISHMENT… As a nonprofit organization, the museum depends on its volunteers who annually contribute over $500,000 worth of their time, skills, and talents. As a Maine Maritime Museum volunteer, you will be able to work with others who share your interests and experience the sense of camaraderie that has lured people to the museum for over 50 years. There is something for everyone: maritime history, historic homes, gardening, art, education, and much more! Throughout the year, volunteers are invited to join in receptions, dinners, and cruises that celebrate their contributions. Volunteers who donate at least 15 hours of their time are also eligible for a complimentary membership and other exclusive benefits. VOLUNTEER LOG IN Looking for something else? To schedule a school visit for children, email us at education@maritimeme.org . To schedule a group tour for adults, email us at reservations@maritimeme.org . For weddings and private events, email us at events@maritimeme.org . For press inquiries, or anything else, email us at info@maritimeme.org . Prospective vendors for our museum store, email our store buyer at buyer@maritimeme.org . To inquire about donating an item to the collection, please complete this form . Have a question for the Curatorial Team? Submit a research request . Subscribe to Our Newsletter Sign up with your email address to receive news and updates. Email Address Sign Up Thank you! Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours &   Charters Weddings & Rentals Digital Guide Collection & Research Education School Visits Learning Resources Our Programs Discovery Boatbuilding For Homeschool Camps Support Join Give Business Support Donation Requests & Guidelines About Museum History Our Team Mission, Vision, Values The Rhumb Line Press Win This Boat! Store Contact Location 243 Washington St Bath, ME 04530 Hours Monday – Sunday 9:30 am – 5:00 pm Closed Thanksgiving, Christmas & New Year’s Day, and occasionally if we get some weather. Questions? We’re here. info@maritimeme.org (207) 443-1316 ©2025 Maine Maritime Museum | Privacy Policy | Digital Guide | Instagram | Facebook | Volunteer Login"
    },
    {
      "url": "https://otrbartenders.com/",
      "text": "otrbartending On The Rocks Bartending On The Rocks Bartending On The Rocks Bartending On The Rocks Bartending On The Rocks Bartending East Tennessee's Original Mobile Bartending Service Contact Us On The Rocks Bartending On The Rocks Bartending On The Rocks Bartending On The Rocks Bartending On The Rocks Bartending East Tennessee's Original Mobile Bartending Service Contact Us Please feel free to contact On the Rocks by phone at any time. You may request a quote or schedule an event with us by Email. Be  sure to include the type of event, date, time, location, and the number of guests you will be serving.  We look forward to hearing from You!   Jim Chambers PO Box 2113 Johnson City, TN 37605 [ 423 ] 600-9424 info@otrbartenders.com Cocktails with Experience It’s your party – you should enjoy it too! Let us take the stress out of it. On the Rocks Bartending is ready to help,  in the Tri Cities and beyond . Whether you’re serving a few traditional drinks or hosting a full bar, On the Rocks is right for you! We provide professional, friendly, bartenders at competitive prices. We have been serving the area with great results for many years. From corporate events, weddings, to private residential parties, we have handled it all. We are fully insured. Covered by General Liability & Liquor Liability. We have a working relationship with most Venues and Vendors in the area and beyond. All OTR employees are licensed to serve .OTR will be happy to provide you with proof of coverage {if notified in advance} We have you covered Bar Services for Your Event You provide the alcohol,  We will provide: licensed bartenders, bar set up {clean up} Including: shakers/strainers, bottle openers, bottle pourers, napkins, stirrers, garnish caddies, muddlers, wine openers, bar towels, wine buckets, coolers, ice, bar glasses, disposable bar glasses, tablecloths All of these things and more listed in our packages. Pricing on request. Events Facebook Reviews Copyright © 2022 On The Rocks Bartending - All Rights Reserved. Powered by GoDaddy This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.64ontherocks.com/aboutus",
      "text": "About Us — 64 On The Rocks Skip to Content Open Menu Close Menu Home Food Drinks Rock About Us 64 On The Pier FAQ's Gallery 0 0 Home Food Drinks Rock About Us 64 On The Pier FAQ's Gallery 0 0 Open Menu Close Menu Home Food Drinks Rock About Us 64 On The Pier FAQ's Gallery Our Story Rockin’ since 2020. EAT. DRINK. ROCK. People always ask, where did the name 64 On The Rocks come from? The answer is neither overly creative nor complex. “On The Rocks” is our way of highlighting our amazing bar and a nod to our selection of bourbons and whiskeys. In order to make the name unique to us, we added the number sixty-four- our address in the quaint village of Fredonia- 64 West Main Street. At 64 On The Rocks, we have created an atmosphere that combines that big city feel with the comfort of home. During the warmer months, The Rocks is bustling with family and friends enjoying food and drinks on one of our outdoor patios or around our gorgeous back firepit. During the colder months, our customers are either cozied up next to our fireplace or enjoying dinner and drinks at one of our high-top tables, comfortable booths or at our stylish bar. We have you covered year-round! Your experience at 64 On The Rocks can be summed up in three words: Eat. Drink. Rock. You will love our pub-style menu which includes large portions and a fun selection of appetizers, unique burgers and sandwiches, personal style pizza, fingers, and our mouthwatering chicken wings in all flavors! Our bar offers a wide selection of draft and bottled beer, mixed cocktails, and our specialty drinks such as the Dwayne Johnson, Rocky Road or Pebble Beach to name a few. Lastly, on weekends stay and enjoy live music on either our indoor stage or weather permitting, back patio.  If hanging with friends and playing corn hole or darts is your thing, we have that too! We look forward to serving you and hope you enjoy your time with us. Contact 64 West Main Street Fredonia, NY 716-672-6464 info@64ontherocks.com 64 on THe Rocks Hours Thursday, Friday & Saturday: 4:30-Close (Kitchen closes 9pm) 64 ON THE PIER HOURS Open Daily 11am-Close (Kitchen Closes 8pm) Seasonal"
    },
    {
      "url": "https://ontherockscomo.com/",
      "text": "On The Rocks - Martini Bar & Night Club Columbia, Missouri Skip to content Search for: CONTACT CATERING MARTINIS SHOTS COCKTAILS LIQUORS JOBS Home On the Rocks Bar 2024-08-18T03:02:16+00:00 1011 East Broadway, Columbia, MO (573) 874-0680 Scroll Down for our Drinks! On the Rocks Bar : Downtown Columbia Delicious Low Priced Martinis , Jumbo Shots & Cocktails The Largest Shots in Columbia! JOIN US ON THE ROCKS have the night of your life On The Rocks is a Martini Bar located in Downtown Columbia, Missouri, also called “The District.” We are famous for our delicious and low priced martinis as well as our Jumbo Shots which are the largest shots in Columbia. Please take a look at our menu, events, and photo gallery to learn more about us. We have signature cocktails, classic cocktails, martinis, premium martinis, and of course our famous Jumbo Shots. SEE YOU AT THE BAR! SIGNATURE COCKTAILS Dirty Leprechaun *OTR TOP SELLER* Jameson Irish Whiskey, Grand Marnier, Ginger Ale, Lemon Juice Razzie Fizz *OTR TOP SELLER* Premium Raspberry Vodka, Crème de Cassis, Ginger Ale Lemonade Stand Citrus Vodka, Disaronno Amaretto, Lemonade The Sassy *OTR TOP SELLER* Premium Raspberry Vodka, Disaronno Amaretto, Soda, Splash of Cranberry Juice Big Mac Daddy Jim Beam Bourbon, Disaronno Amaretto, Crème de Cassis, Ginger Ale, Splash of Cranberry Juice Eden’s Garden 3 Olives Strawberry Vodka, Pinnacle Vanilla Vodka, Lemonade, Cranberry Juice John Daly Deep Eddy’s Sweet Tea Vodka, Lemonade CLASSIC COCKTAILS Uptown Old Fashioned Not your parents Old Fashioned – Your choice of bourbon, muddled orange, splash of Luxardo liqueur, squeeze of lemon and sweet vermouth. Manhattan Similar to an Old Fashioned, served as a martini with a dash of sweet vermouth. Pack-Your-Own Mule A real kicker – mix of lime juice, ginger beer and your selection of any vodka, gin, bourbon or tequila. Dark n Stormy Featuring Goslings Dark Rum and ginger beer, The perfect blend of sweet and tart. Negroni Classic cocktail with Beefeater Gin, Campari and sweet vermouth with an orange garnish. A drink bitter, sweet and simple. Sidecar Cognac, lemon juice and simple syrup shaken vigorously with ice and strained. Its a classic that’s tart, crisp and very refreshing! Honey Crisp Bärenjäger Honey liqueur, Angry Orchard, dash of bitters. How ’bout them apples? $5.50 MARTINIS Apple Martini Vodka, Sour Apple Schnapps, Sprite OTR Cosmopolitan Vodka, Triple Sec, Lime, Cranberry Juice Classic Martini Your Choice: Vodka or Gin – Dry or Dirty Fuzzy Martini Vodka, Peach Schnapps, Cranberry and OJ Pomegranate Martini Vodka, Pomegranate Liqueur, Cranberry Juice Watermelon Martini Vodka, Watermelon Schnapps, Sprite *Upgrades available at an additional charge. (prices may vary) PREMIUM MARTINIS Espresso Martini Need a little perk? Our ever popular Espresso Martini is dark, rich and frothy. Perfect for a late night pickup! Topped with espresso beans. Blue Raspberry Martini Stoli Raspberry Vodka, Blue Curaçao, Cranberry Juice Caribbean Martini *OTR TOP SELLER* Vanilla Vodka, Cruzan Coconut Rum, Pineapple Juice Chocolate Martini Chocolate Vodka, Dark Crème de Cacao, Irish Cream Hollywood Cosmo *OTR TOP SELLER* Orange Vodka, Triple Sec, Cranberry Juice, Splash of Lime Juice Margatini Premium Silver Tequila, Triple Sec, Pineapple Juice JUMBO SHOTS Alabama Slammer SoCo, Amaretto, OJ, Grenadine Alligator Piss *OTR TOP SELLER* Cruzan Banana, Melon Liqueur, Pineapple Juice Apple Sauce Fireball, Apple Schnapps, Pineapple Juice Banana Split Cruzan Banana, Dark Cacao, Irish Cream Banana Foster Rumchata, Cruzan Banana, Frangelico Bomb Pop *OTR TOP SELLER* Pinnacle Raspberry, Blue Curaçao, Sprite Brass Balls Grand Marnier, Peach Schnapps, Pineapple Juice Blueberry Pancake Stoli Blueberry, Butterscotch Schnapps, OJ Cherry Cheesecake Pinnacle Vanilla, Rumchata, Cranberry Juice, Splash of Grenadine Cherry Limeade Premium Silver Tequila, Lemonade, Lime Juice, Grenadine Chuck Liddell *Staff Favorite* Cherry Vodka Girl Scout Cookie Rumplemintz, Irish Cream, Dark Cacao Green Tea Jameson, Peach Schnapps, Sour, Sprite Honey Badger Wild Turkey American Honey, Rumchata Irish Pancake Jameson, Butterscotch, OJ Lake Water Coconut Rum, Blue Curaçao, Pineapple Juice Lunch Box Amaretto, Beer, OJ PB & J Screwball Whiskey, Crème de Cassis, Cranberry Juice Pineapple Upsidedown Cake Vanilla Vodka, Pineapple Juice, Grenadine Scooby Snack Irish Cream, Melon Liqueur, Coconut Rum Starburst Flavored Rums, Energy Drink The Big Dill Jameson shot with Pickle Juice. Vegas Bomb Crown Royal, Peach Schnapps, Energy Drink, Grenadine Washington Apple *Staff Favorite* Crown Royal, Apple Schnapps, Cranberry White Gummy Bear *OTR TOP SELLER* Pinnacle Raz, Peach Schnapps, Sprite SIGNATURE COCKTAILS Dirty Leprechaun *OTR TOP SELLER* Jameson Irish Whiskey, Grand Marnier, Ginger Ale, Lemon Juice Razzie Fizz *OTR TOP SELLER* Premium Raspberry Vodka, Crème de Cassis, Ginger Ale Lemonade Stand Citrus Vodka, Disaronno Amaretto, Lemonade The Sassy *OTR TOP SELLER* Premium Raspberry Vodka, Disaronno Amaretto, Soda, Splash of Cranberry Juice Big Mac Daddy Jim Beam Bourbon, Disaronno Amaretto, Crème de Cassis, Ginger Ale, Splash of Cranberry Juice Eden’s Garden Strawberry Vodka, Vanilla Vodka John Daly Deep Eddy’s Sweet Tea Vodka, Lemonade CLASSIC COCKTAILS Uptown Old Fashioned Not your parents Old Fashioned – Your choice of bourbon, muddled orange, splash of Luxardo liqueur, squeeze of lemon and sweet vermouth. Manhattan Similar to an Old Fashioned, served as a martini with a dash of sweet vermouth. Pack-Your-Own Mule A real kicker – mix of lime juice, ginger beer and your selection of any vodka, gin, bourbon or tequila. Dark n Stormy Featuring Goslings Dark Rum and ginger beer, The perfect blend of sweet and tart. Negroni Classic cocktail with Beefeater Gin, Campari and sweet vermouth with an orange garnish. A drink bitter, sweet and simple. Honey Rye *OTR TOP SELLER* You choose the rye whiskey, we fuse it with Bärenjäger Honey Liqueur, ginger ale and orange bitters. Honey Crisp Bärenjäger Honey liqueur, Angry Orchard, dash of bitters. How ’bout them apples? LIQUORS VODKA 1220 Encrypted Vodka Absolut Vodka Grey Goose Ketel One Vodka Pinnacle Citrus Pinnacle Vanilla Stoli Blueberry Stoli Razberry Suntory Haku Titos Vodka Pinnacle Strawberry Deep Eddy Lemon 360 Chocolate GIN 1220 Orgins Gin Beefeater Gin Bombay Shapphire Hendrix Gin Suntori Roku Gin Tanquery Gin TEQUILA Don Julio Anejo Olmeca Plata Olmeca Resposado Patron Silver Herradurra Reposado Herradurra Anejo Don Julio Blanco SHOOTABLES (kept cold) Fireball Cinnamon Whiskey Rumplemintz Wild Turkey American Honey Jägermeister Goldschläger Rumchata Bärenjäger Honey Liqueur BOURBON & WHISKEY Angel’s Envy Finished Rye Basil Hayden Blanton’s Single Barrel Bulleit Bourbon Bulleit Rye Crown Royal Col. E.H. Taylor Sm. Batch Eagle Rare 10 yr Sm. Batch Jack Daniels Jameson Irish Whiskey Jefferson’s Reserve Knob Creek Maker’s Mark Michter’s Sm. Batch Rye Stagg Jr. Stranahan’s Whiskey Templeton Rye Tullamore Dew 12yr Wild Turkey Honey Woodford Reserve Whistle Pig 10yr Whistle Pig 12yr Whistle Pig Boss Hogg WL Weller 12yr 1792 Small Batch Angels Envy Port Finish Barrel Bourbon Barrel Dovetail Buffalo Trace High West American Prairie Benchmark Very Old Bartons 80 Very Old Bartons 100 WL Weller Special Reserve Yellowstone Whiskey RUM Bacardi Superior Captain Morgan Malibu Goslings Dark Rum COGNAC & CORDIALS Martell VS Cognac Brady’s Irish Cream Di Saronno Amaretto Frangelico Dry Vermouth Sweet Vermouth Grand Marnier Cognac Fernet Branca Luxardo Campari Copper and Kings Absenthe SCOTCH Glenlivet 12yr Glenfiddich 14yr Talisker 10yr (H) Talisker Storm (H) Glenmorangie 10yr (H) Glenmorangie 12yr Sherry Cask (H) Bowmore 12yr (I) The Glenlivet 12yr (S) The Macallan 12yr (S) IN DOG BEERS I’VE ONLY HAD ONE IN DOG BEERS I’VE ONLY HAD ONE By On the Rocks Bar | 2020-03-04T17:42:36+00:00 February 21st, 2020 | Categories: Instagram | We love our furry drinking buddies. Let’s see yours!!! Read More Comments Off on IN DOG BEERS I’VE ONLY HAD ONE DRINKIN LIKE LINCOLN DRINKIN LIKE LINCOLN By On the Rocks Bar | 2020-03-04T17:43:38+00:00 February 18th, 2020 | Categories: Instagram | It's #PresidentsDay and at @OTRCOMO we're highlighting a few former presidents who enjoyed Read More Comments Off on DRINKIN LIKE LINCOLN GET READY TO PAAARRRTTY IT’S GALENTINE’S DAY GET READY TO PAAARRRTTY IT’S GALENTINE’S DAY By On the Rocks Bar | 2020-03-04T17:44:34+00:00 February 14th, 2020 | Categories: Instagram | Happy #galentinesday. A night full of #OTRMartinis is perfect for any #GirlsNight. Bonus Read More Comments Off on GET READY TO PAAARRRTTY IT’S GALENTINE’S DAY INSTAWOOT DAY! GUESS WHAT DAY IT IS! INSTAWOOT DAY! GUESS WHAT DAY IT IS! By On the Rocks Bar | 2020-03-04T17:45:29+00:00 February 12th, 2020 | Categories: Instagram | That's right!!! It's #WhiskeyWednesday Plus it's $3 Double Well Drinks Read More Comments Off on INSTAWOOT DAY! GUESS WHAT DAY IT IS! ME, WHEN I HEAR SOMEONE SAY….SHOTS! ME, WHEN I HEAR SOMEONE SAY….SHOTS! By On the Rocks Bar | 2020-03-04T17:46:38+00:00 January 30th, 2020 | Categories: Instagram | #ThirstyThursday calls for some great shot specials. Thursday’s we have Read More Comments Off on ME, WHEN I HEAR SOMEONE SAY….SHOTS! Come to On The Rocks Bar for a Little Pep In Your Step! Come to On The Rocks Bar for a Little Pep In Your Step! By On the Rocks Bar | 2019-10-25T18:18:04+00:00 October 28th, 2019 | Categories: Instagram | You do anything fun this weekend? Let's hear it!! If Read More Comments Off on Come to On The Rocks Bar for a Little Pep In Your Step! Zombie Pub Crawl in Columbia Missouri 2019 Zombie Pub Crawl in Columbia Missouri 2019 By On the Rocks Bar | 2019-10-25T18:28:12+00:00 October 25th, 2019 | Categories: Instagram | Zombie Pub Crawl in Columbia Missouri 2019 Downtown CoMo / Read More Comments Off on Zombie Pub Crawl in Columbia Missouri 2019 Rain Or Shine, Drinking is Fine! Rain Or Shine, Drinking is Fine! By On the Rocks Bar | 2019-10-23T13:40:57+00:00 October 23rd, 2019 | Categories: Instagram | Don't let the rain, thunder, and lightning keep you away! Read More Comments Off on Rain Or Shine, Drinking is Fine! Sippin’ on Sangrias at On The Rocks Bar Sippin’ on Sangrias at On The Rocks Bar By On the Rocks Bar | 2019-10-16T01:05:21+00:00 October 16th, 2019 | Categories: Instagram | Apple Martini, Pomegranate Martini, Watermelon Martini, Blue Raspberry Martini, Chocolate Read More Comments Off on Sippin’ on Sangrias at On The Rocks Bar 1 2 Next On the Rocks 1011 East Broadway\nColumbia, MO info@ontherockscomo.com (573) 874-0680 Open Monday-Saturday\n6:00pm-1:15am Special Events / Private Parties Employment © Copyright 2012 - |   All Rights Reserved   |   Site by Floating Ax Technologies Page load link Go to Top"
    }
  ]
}