{
  "fuentes": [
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-florida-keys/things-to-do/nightlife/reviews/breezers-tiki-bar-and-grille-575867",
      "email": "facebook-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-florida-keys/things-to-do/nightlife/reviews/breezers-tiki-bar-and-grille-575867",
      "email": "facebook-white@3x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-florida-keys/things-to-do/nightlife/reviews/breezers-tiki-bar-and-grille-575867",
      "email": "instagram-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-florida-keys/things-to-do/nightlife/reviews/breezers-tiki-bar-and-grille-575867",
      "email": "instagram-white@3x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-florida-keys/things-to-do/nightlife/reviews/breezers-tiki-bar-and-grille-575867",
      "email": "pinterest-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-florida-keys/things-to-do/nightlife/reviews/breezers-tiki-bar-and-grille-575867",
      "email": "pinterest-white@3x.png"
    },
    {
      "url": "https://www.opalcollection.com/harborside/marina/",
      "email": "marina@theharborsidehotel.com"
    },
    {
      "url": "https://www.opalcollection.com/harborside/marina/",
      "email": "marina@theharborsidehotel.com"
    },
    {
      "url": "https://www.linkedin.com/in/william-visel-70642110/",
      "email": "bgutierrez@micros.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/breezers-tiki-bar-key-largo-2",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/breezers-tiki-bar-key-largo-2",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://tikipub.com/contact-us/",
      "email": "ponceinlet@paddlepub.com"
    },
    {
      "url": "https://www.groupon.com/biz/key-largo-fl/breezers-tiki-bar",
      "email": "verify@r.groupon.com"
    }
  ],
  "mails": [
    "bgutierrez@micros.com",
    "corporate@giftly.com",
    "facebook-white@2x.png",
    "facebook-white@3x.png",
    "instagram-white@2x.png",
    "instagram-white@3x.png",
    "marina@theharborsidehotel.com",
    "merchants@giftly.com",
    "pinterest-white@2x.png",
    "pinterest-white@3x.png",
    "ponceinlet@paddlepub.com",
    "verify@r.groupon.com"
  ],
  "nombre_sitio": "opalcollection.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-florida-keys/things-to-do/nightlife/reviews/breezers-tiki-bar-and-grille-575867",
      "text": "Breezer’s Tiki Bar Review - The Florida Keys Florida - Nightlife | Fodor’s Travel Go Destinations Hotels Travel News Cruises Forums Trip Ideas More Forums Trip Ideas Subscribe Login Subscribe Login USA Europe Africa & The Middle\n                        East Asia Australia & The\n                        Pacific Canada Caribbean Mexico &\n                        Central America South America Cruise Overview Cruise News Cruising 101 Line & Ship Directory Guidebooks Africa & the Middle East Asia Australia & the Pacific Canada Caribbean Europe Mexico & Central America South America United States Air Travel Cruises Travel Tips & Trip Ideas Forums Help View All Forums National Parks Best Road Trips in America Ultimate Guides for the ultimate trip Love to travel? Get FREE email communications from Fodor's Travel, covering must-see travel destinations, expert\n                        trip planning advice, and travel inspiration to fuel your passion. By signing up for the newsletter, I agree to the Privacy Policy. You must check the box to subscribe Home Destinations USA Europe Africa & The Middle East Asia Australia & The Pacific Canada Caribbean Mexico & Central America South America View All Destinations Hotels Travel News Cruises Cruise Overview Cruise News Cruising 101 Cruise Directory Forums Africa & the Middle East Asia Australia & the Pacific Canada Caribbean Europe Mexico & Central America South America United States Air Travel Cruises Travel Tips & Trip Ideas Forums Help View All Forums Trip Ideas National Parks Best Road Trips in America Ultimate Guides Login Subscribe The Florida Keys Overview Hotels Restaurants Sights Top Places Shopping Nightlife Performing Arts Gallery More The Florida Keys Things to Do The Florida Keys Travel Guide Overview Hotels Restaurants See Top Places Shopping Nightlife Arts Gallery Sights Shopping Nightlife Performing Arts Fodor's Expert Review Breezer’s Tiki Bar Key Largo Bars Mingle with locals over cocktails and catch amazing sunsets from the comfort of an enclosed, air-conditioned bar. Floor-to-ceiling doors can be opened on cool days and closed on hot days. Bars Quick Facts 103800 Overseas Hwy. Florida 33037, USA 305-453–0000 Related Stories Trip Ideas The Florida Keys’ Top 14 Experiences Fodor's Editors VIEW ALL What’s Nearby Related Stories Trip Ideas The Florida Keys’ Top 14 Experiences Fodor's Editors VIEW ALL Related Forum Posts Florida Keys by SaulYS on\n                                    Feb 21, 2025 Neighborhood Feel in Miami to kill a weekend by ChgoGal on\n                                    Feb 14, 2025 3 Weeks USA - Itinerary Review (NYC, East Coast + Cali) by AlwaysTYOCar on\n                                    Jan 03, 2025 Italy , Greece and Spain by patriots2020 on\n                                    Mar 21, 2024 VIEW ALL Related Forum Posts Florida Keys by SaulYS on\n                                    Feb 21, 2025 Neighborhood Feel in Miami to kill a weekend by ChgoGal on\n                                    Feb 14, 2025 3 Weeks USA - Itinerary Review (NYC, East Coast + Cali) by AlwaysTYOCar on\n                                    Jan 03, 2025 Italy , Greece and Spain by patriots2020 on\n                                    Mar 21, 2024 VIEW ALL Destinations USA Florida The Florida Keys Things to Do Nightlife Breezer’s Tiki Bar About Us Contact Us Our Team Press Room FAQs Award Licensing Advertising Content Licensing Site Map About Us Contact Us Our Team Press Room FAQs Award Licensing Site Map Advertising Content Licensing Follow Us Fodor’s Travel Use of this site indicates your consent to the Terms of Use. Copyright © 2025 by MH\n                Sub I, LLC dba Internet Brands. Fodor’s is a registered trademark of MH Sub I, LLC dba Internet Brands. All rights reserved. Terms of Use | Privacy Policy | Cookie Policy | Manage Preferences | Your Privacy Choices Subscribe to Newsletter Sign up for Travel Tips & News Please Enter a Valid Email Address Subscribe I want emails from Fodor's Travel with travel information and promotions. I can unsubscribe\n            any time using the unsubscribe link at the end of all emails. Thank you for your interest! Look out for our newsletters with travel tips and special offers. Sign up for Travel Tips & News By signing up for the\n                newsletter, I agree to the Privacy Policy . You must check the box to subscribe Thank you for your interest! Look out for our newsletters with travel tips and special offers."
    },
    {
      "url": "https://www.opalcollection.com/harborside/marina/",
      "text": "Full-Service Marina Downtown Bar Harbor | Harborside Hotel Marina Book Now Opal Collection Stay Eat and Drink Gather Spa Experiences Marina Club Offers Gallery FAQ Local: 207.288.5033 Res: 866.258.7253 55 West Street, Bar Harbor, ME 04609 Back Hotels & Resorts Destinations Eat & Drink Gather Offers About Us Blog Contact Us Press Back Florida East Coast Florida Gulf Coast Florida Keys New England Coast New York Adirondacks All Destinations Meetings Weddings Back Florida East Coast Delray Beach/Boca Raton Hutchinson Island Jupiter Beach See All Florida East Coast Florida Gulf Coast Clearwater Naples Treasure Island Sarasota/Longboat Key See All Florida Gulf Coast Florida Keys Key West Key Largo See All Florida Keys New England Coast Camden/Rockport Bar Harbor Portsmouth See All New England Coast New York Adirondacks Lake George Lake Placid See All New York Adirondacks Stay Eat and Drink Gather Spa Experiences Marina Club Offers Gallery FAQ Local: 207.288.5033 Res: 866.258.7253 55 West Street, Bar Harbor, ME 04609 Return to Harborside Hotel, Spa & Marina Opal Collection Hotels & Resorts Destinations Florida East Coast Delray Beach/Boca Raton Hutchinson Island Jupiter Beach See All Florida East Coast Florida Gulf Coast Clearwater Naples Treasure Island Sarasota/Longboat Key See All Florida Gulf Coast Florida Keys Key West Key Largo See All Florida Keys New England Coast Camden/Rockport Bar Harbor Portsmouth See All New England Coast New York Adirondacks Lake George Lake Placid See All New York Adirondacks All Destinations Eat & Drink Gather Meetings Weddings Offers About Us Blog Contact Us Press Contact Services Rentals & Docking Fees Marina Contact Contact Services Rentals & Docking Fees Cruise up, check in, and enjoy Located just minutes from Acadia National Park, our downtown Bar Harbor marina features floating docks that can accommodate a wide range of vessels. We also offer a variety of marina services. And, while docked here, you and your passengers will have full access to Harborside’s outstanding amenities, including an oceanfront pool and hot tub, poolside dining, concierge service, tennis courts, and more. Bar Harbor Marina 111 West St, Bar Harbor, ME 04609 207.801.7024 [email protected] MARINA SERVICES Fresh Water Hook Up 50 Amp, 100 Amp 3-Phase Shore Power, 100 Single-Phase Requires Splitter, 30 Amp Requires Splitter Trash Drop-Off Diesel Fuel (Up to 9,000 Gallons) Local Driver By Request Oil Drop-Off By Request RESORT SERVICES Oceanfront Outdoor Heated Pool and Hot Tub Poolside Dining at Splash Pool Bar Authentic Italian Dining at La Bella Vita Business Center with Fax and Delivery Service Three Clay Oceanside Tennis Courts Fully Equipped Fitness Center and Spa Docking Fees VESSELS (DAILY FEE) Ft. (size) Price Resort Fee Parking 40 – 150’+ $10.00/ft. plus tax $35.00 $15.00 ELECTRICAL (DAILY FEE) Category Price 30 amp (splitter needed) $50 (each service) 50 amp $75 (each service) 100 amp (single phase, splitter needed) $135 100 (three phase) $135 Please Note: Rates are subject to change without notice. The minimum billable length is $40 per foot. Tenders greater than 11 ft. are subject to additional charges if not kept on the yacht. OUR POLICIES DEPOSIT/CANCEL POLICY: All reservations require a dockage agreement and credit card authorization with 100 percent deposit required in advance. May, June & September: Reservations can be cancelled more than 14 days in advance. Any cancellations made within 14 days of arrival will result in a forfeiture of the advance deposit. July & August: Reservations can be cancelled more than 30 days in advance. Any cancellations made within 30 days of arrival will result in a forfeiture of the advance deposit. RESORT & PARKING FEES: All vessels pay a daily $35 resort fee which allows access to the resort amenities listed above and a $15 daily parking fee for vehicles. General Information Provisions Name Phone Number Distance Hannaford 207.288.4021 0.4 miles Walgreens 207.288.2222 0.2 miles Ace Hardware 207.288.4995 0.4 miles Bayside Liquors 207.288.2772 0.2 miles West Marine 207.244.0300 10 miles Hamilton Marine 207.244.7870 10 miles Billings Diesel 207.367.2320 60 miles Napa Autoparts 207.244.0511 10 miles Transportation Company Phone Number Distance Enterprise Car Rental 207.664.2662 13 miles Hertz Car Rental 207.667.5017 13 miles Maine Chauffer 207.356.4766 50 miles Shipping something? Want to send a package prior to your arrival? Please send to the address below and ensure your vessel name and a phone number to contact you is included in the package. 207.801.3904 Sales Office 111 West Street Bar Harbor, ME 04609 Sign up for news & updates from Harborside Hotel, Spa & Marina Email Sign Up Additional terms and conditions Contact Us Policies & Guidelines In-Room Amenities Events Gift Cards Local: 207.288.5033 Res: 866.258.7253 55 West Street, Bar Harbor, ME 04609 866.258.7247 Accessibility Statement Terms & Conditions Privacy Policy Careers Press Retrieve Reservations © 2013-2025. OPAL®, OPAL COLLECTION®/ Portsmouth Corporate Financial Services, Inc. \"Opal\" and \"Opal Collection\" are descriptive terms used in the marketing of a number of independently owned and operated hotels and is not intended as a reference to ownership. Careers Press Retrieve Reservations 866.258.7247 This website uses cookies and similar technologies. By using this site, you are agreeing to our Privacy Policy. Accept Book a Room Stay EAT & DRINK GATHER SPA Property or Area Harborside Hotel, Spa & Marina Property or Area Florida Keys Sunset Key Cottages The Laureate The Capitana Opal Key Resort & Marina Reefhouse Resort & Marina Florida East Coast Delray Sands Resort Opal Grand Oceanfront Resort & Spa Jupiter Beach Resort & Spa Hutchinson Shores Resort & Spa The Lucie The Atlantic Suites on the Ave Florida Gulf Coast Opal Sands Resort Sandpearl Resort Belleview Inn Edgewater Beach Hotel Zota Beach Resort The Resort at Longboat Key Club Cirque St. Armands Beachside Lido Beach Resort Treasure Island Beach Resort The Capri Inn Opal Sol New England Coast Harborside Hotel, Spa & Marina West Street Hotel Samoset Resort Wentworth by the Sea New York Adirondacks Lake Placid Lodge The Sagamore Resort Check-in / Check-Out Guests 1 adults Select Guests Clear Adults Ages 18 & up - + Children Ages 17 & under stay free - + Enter children's ages: Code Type Select Code Type Select Corporate Code Promotional Code Group/Block Code Rate Code Code CHECK AVAILABILITY F&B Outlet Stewman's Downtown La Bella Vita This restaurant is walk-in only. This restaurant is walk-in only. Event Information Select Property* Olde Naples Hotel Sandpearl Resort Belleview Inn Edgewater Beach Hotel Zota Beach Resort The Resort at Longboat Key Club Cirque St. Armands Beachside Lido Beach Resort Treasure Island Beach Resort The Capri Inn Opal Sol/Opal Sands Resort Delray Sands Resort Opal Grand Oceanfront Resort & Spa Jupiter Beach Resort & Spa Hutchinson Shores Resort & Spa Sunset Key Cottages The Laureate The Capitana Opal Key Resort & Marina Reefhouse Resort & Marina Harborside Hotel, Spa & Marina West Street Hotel Samoset Resort Lake Placid Lodge The Sagamore Resort The Lucie The Atlantic Suites on the Ave Wentworth by the Sea What type of event are you inquiring about?* Select Event Type Weddings Meetings Celebrations Approx. Dates Approx. # of Guests Approx. # of Rooms Comments Personal Information Is this RFP being sent on behalf of a client as a professional planner? Yes No First name* Last name* Email address* Phone number* State* Please select Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming District of Columbia Puerto Rico Guam American Samoa U.S. Virgin Islands Northern Mariana Islands Other Agree I agree that the information in this form will be shared with representatives of the property and that the property may contact me about this RFP request. (Required) Additional terms and conditions Request Proposal Select Property Sandpearl Resort The Resort at Longboat Key Club Opal Sol/Opal Sands Resort Opal Grand Oceanfront Resort & Spa Jupiter Beach Resort & Spa Hutchinson Shores Resort & Spa Sunset Key Cottages Reefhouse Resort & Marina Harborside Hotel, Spa & Marina West Street Hotel Samoset Resort The Sagamore Resort Wentworth by the Sea Book Spa Appointment To make a reservation by phone, please call: (941) 387-1587 Book Spa Appointment Book Spa Appointment Book Spa Appointment Book Spa Appointment Book Spa Appointment Book Spa Appointment Book Spa Appointment Book Spa Appointment Book Spa Appointment Book Spa Appointment Book Spa Appointment Select Dates Clear Min. Stay Not Avail Opal Moment Savings"
    },
    {
      "url": "https://www.linkedin.com/in/william-visel-70642110/",
      "text": "William Visel - Marriott International | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Join now Sign in William Visel Greater Orlando 1K followers 500+ connections See your mutual connections View mutual connections with William Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now Join to view profile Marriott International Baker College Report this profile About With over 20 years of experience in information technology, I am a seasoned Director of… see more Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now Activity Dreaming of your next leadership opportunity? ✨ We’re hiring for management roles including Senior Banquet Chef, HR Manager, Catering and Events… Dreaming of your next leadership opportunity? ✨ We’re hiring for management roles including Senior Banquet Chef, HR Manager, Catering and Events… Liked by William Visel 📍 Growing Forward: U.S. & Canada Field Support Training\n\n✅️ 3 weeks of training completed\n\nThe training expanded my technical expertise and… 📍 Growing Forward: U.S. & Canada Field Support Training\n\n✅️ 3 weeks of training completed\n\nThe training expanded my technical expertise and… Liked by William Visel We’re thrilled to welcome Cindy Erazo as the new Director of HR Operations at the Walt Disney World Swan Reserve! \n\nWith a deep passion for people… We’re thrilled to welcome Cindy Erazo as the new Director of HR Operations at the Walt Disney World Swan Reserve! \n\nWith a deep passion for people… Liked by William Visel Join now to see all activity Experience & Education Marriott International ******** ** ********** *** ******* ********** ********* *********** ********** ******* *********** *********** ******** ** ******* ***** ******* ******** ** ******* ******** *********** ******* 1999 - 2003 ******* ********** ******** *** *********** ******** *** ******* ******** 2017 - 2017 View William’s full experience See their title, tenure and more. Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Licenses & Certifications Expert Insights on Developing as a Leader Skillsoft Issued Jul 2022 Credential ID 55679245 See credential Volunteer Experience Sole volunteer TENT for homeless vet. Jun 2014 - Present 11 years 4 months Disaster and Humanitarian Relief http://www.gofundme.com/TentForChris WEBSITE and link should provide what I have done. Publications Customized 3D Print design discussed on 3dprint.com 3dprint.com September 12, 2015 one of my many 3d print designs caught the eye of 3dprint.com. http://3dprint.com/95050/customized-3d-printed-cat-water-dish-delights-designers-daughters-and-cats/ See publication Courses Computer Forensics CYBER502x! Projects Front Desk, Reservations and office move Mar 2016 Open new front desk (technology) in new front desk lobby, set up all terminals, credit card, Saflok, Printing, telecommunications for font desk, new reservations department as well as front office manager.  Consisting 8 terminals and 4 printers with Minimal to no front facing downtime. See project Hospitality Call Accounting System Jul 2014 Objective = Discover/Resolve why property call accounting system is not working , losing revenue. * Project Managed multiple vendors, Hersha Corporate IT, Telecom, Call accounting provider. * Provided regular updates on progress and status. * Discovered hardware failure and replaced equipment * Tested system from call to accounting end. * Provided process to keep system updated and resolved. Other creators See project Project Management Installation and switch over 50m fiber connection Jul 2014 Provided a seamless transition from current internet infrastructure to ATT 50M fiber internet connection * Reported regular updates to Corporate infrastructure team as well as local management of progress. * Coordinated Vendors and construction for switch over * Pre testing of infrastructure before live migration. ** downtime = 5 minutes Other creators See project Micros / Gift Card Redemption Jun 2014 Objective = Discover/Resolve why Gift cards will not redeem in outlets. Ongoing issue for 1 year * Managed,Coordinated Multiple Vendors, Givex, Micros, Hersha IT Security & Infrastructure, * Discovered that current system/process was not installed correctly * Managed proper installation and configuration of Micros/gift card redemption * Tested system and reported failures and success. * Monitored system for continued success until deemed completed. * Reported success… Show more Objective = Discover/Resolve why Gift cards will not redeem in outlets. Ongoing issue for 1 year * Managed,Coordinated Multiple Vendors, Givex, Micros, Hersha IT Security & Infrastructure, * Discovered that current system/process was not installed correctly * Managed proper installation and configuration of Micros/gift card redemption * Tested system and reported failures and success. * Monitored system for continued success until deemed completed. * Reported success to Corporate and Local Management. Show less Other creators See project Micros Overhaul May 2014 Micros Administration and back end operations Replace Network Infrastructure. Reprogram Micros units to proper outlets. Update programming and systems. Other creators See project Hyper V , Migration project Jan 2014 Completed Hyper V, Physical to Virtual server Migration on to new Hyper V server. # came across a licensing issue with solidworks, ## resolution = detaching the license from the physical server and attaching it to the VM. Hardware Dell T620 See project PCI Audit - Highscope Educational Research Foundation Jan 2014 Q: To whom does PCI apply? A: PCI applies to ALL organizations or merchants, regardless of size or number of transactions, that accepts, transmits or stores any cardholder data. Said another way, if any customer of that organization ever pays the merchant directly using a credit card or debit card, then the PCI DSS requirements apply. back to top Q: Where can I find the PCI Data Security Standards (PCI DSS)? A: The Standard can be found on the PCI SSC's Website:… Show more Q: To whom does PCI apply? A: PCI applies to ALL organizations or merchants, regardless of size or number of transactions, that accepts, transmits or stores any cardholder data. Said another way, if any customer of that organization ever pays the merchant directly using a credit card or debit card, then the PCI DSS requirements apply. back to top Q: Where can I find the PCI Data Security Standards (PCI DSS)? A: The Standard can be found on the PCI SSC's Website: https://www.pcisecuritystandards.org/security_standards/pci_dss.shtml back to top Q: What are the PCI compliance deadlines? A: All merchant that stores, processes or transmits cardholder data must be compliant now.  However, as a Level 4 merchant, you will have to refer to your merchant bank for their specific validation requirements and deadlines.  All deadline enforcement will come from your merchant bank. You may also find more information on Visa’s Website: http://usa.visa.com/download/merchants/payment_application_security_mandates.pdf. back to top Q: What are the PCI compliance ‘levels’ and how are they determined? A: All merchants will fall into one of the four merchant levels based on Visa transaction volume over a 12-month period. Transaction volume is based on the aggregate number of Visa transactions (inclusive of credit, debit and prepaid) from a merchant Doing Business As (‘DBA’). In cases where a merchant corporation has more than one DBA, Visa acquirers must consider the aggregate volume of transactions stored, processed or transmitted by the corporate entity to determine the validation level. If data is not aggregated, such that the corporate entity does not store, process or transmit cardholder data on behalf of multiple DBAs, acquirers will continue to consider the DBA’s individual transaction volume to determine the validation level. Show less See project Schnorr.com Microsoft 365 Migration Jan 2014 Migrate existing email system to Microsoft 365. Completed project with no down time to company operations. Provided training and support for end users on the new interface. Other creators See project Website update/revamp/design Jan 2014 Current Aged website has not been updated and needs a complete overhaul. Project ongoing. See project BACKUP SYSTEMS Recovery.  -Robertson Morrision HVAC company Oct 2013 Restored System backups to a recoverable state after numorous unsuccessful backup attempts.. Symantec Backup Exec 2013 R3 See project Data Center Migration to New Location Aug 2013 Migration of the Existing Data Center to CYPQ's new location. Project included disassembling existing infrastructure, advisement and reassembling all Server Technology as well as telecommunications at the new site. Other creators See project Exchange to Microsoft 365 Project Aug 2013 While price is certainly one factor where Office 365 reigns supreme compared to hosted Exchange offerings, this is not the only merit that takes it over the top. Businesses and organizations want the entire package -- security, stability, functionality, scalability, and elasticity - in addition to a cost effective bottom line. I fully believe that Office 365 is finally delivering on the promise that Microsoft's budding cloud vision entailed a few years ago. Hosted Exchange Providers… Show more While price is certainly one factor where Office 365 reigns supreme compared to hosted Exchange offerings, this is not the only merit that takes it over the top. Businesses and organizations want the entire package -- security, stability, functionality, scalability, and elasticity - in addition to a cost effective bottom line. I fully believe that Office 365 is finally delivering on the promise that Microsoft's budding cloud vision entailed a few years ago. Hosted Exchange Providers can't touch Office 365 on Price As a technology consultant by day, I know that price alone should not be the deciding factor on which platform a business chooses. But then again, cost does affect the bottom line, and it's something that inevitably needs to be considered heavily. This is one area where Office 365 just blows the away competition. The chart below just exemplifies how well Microsoft has leveraged its tremendous weight in cloud economies of scale to bring Office 365 pricing down to extremely affordable levels. Show less INVESTIGATION - Suspected, intellectual property breach. Jul 2013 Conducted investigation on user (s) suspected of office violations utilizing corporate computer systems. See project A****** Title Company Jan 2013 Completed a Server/Virtualization and migration project. Hyper-V Dist2VHD Small Business Server 2003 AD DNS Networking This project took me a little longer than anticipated because I was troubleshooting a networking issue. Resolution, Even know the \"physical server\" was shut down the NIC card was still plugged in and causing problems with the new virtualized server. I discovered a few Licensing challenges but was able to overcome them as well. The client is… Show more Completed a Server/Virtualization and migration project. Hyper-V Dist2VHD Small Business Server 2003 AD DNS Networking This project took me a little longer than anticipated because I was troubleshooting a networking issue. Resolution, Even know the \"physical server\" was shut down the NIC card was still plugged in and causing problems with the new virtualized server. I discovered a few Licensing challenges but was able to overcome them as well. The client is very pleased. Show less VOIP - Comcast - Polycom installation 3 sites Feb 2012 Proposal, Design and Project Management of new VOIP Phone system. Polycom in 3 sites. Auto Attendant programing and system configuration. See project Data Center Build - Galaxe Solutions. Sep 2010 Designed/Built/Project Management for Galaxe Solutions new Data Center in Detroit Michigan. Facility The hosting facility is in compliance with the following requirements as minimums. Project management included. power, data center power, data center power capacity, calculate power requirements, data center fire, data center fire protection, data center fire suppression, fire suppression system, data center fire prevention, facilities, DC power, data center power… Show more Designed/Built/Project Management for Galaxe Solutions new Data Center in Detroit Michigan. Facility The hosting facility is in compliance with the following requirements as minimums. Project management included. power, data center power, data center power capacity, calculate power requirements, data center fire, data center fire protection, data center fire suppression, fire suppression system, data center fire prevention, facilities, DC power, data center power planning, Building data center, build data center, facilities management, building a data center, building site selection Show less Other creators See project Iphone/Phone security Measures for healthcare Aug 2010 Remove internal cameras from company phones to ensure client/patient security - see Image galaxe solutions. Installation of IDEA PAINT for Project Management Jul 2010 Note, Idea paint should NOT be installed during work hours, I suggest Friday evening. There is a VERY strong ODOR. See project More activity by William I am thrilled to announce William Fink as the General Manager of the Walt Disney World Swan and Walt Disney World Swan Reserve hotels.\n\nBill brings… I am thrilled to announce William Fink as the General Manager of the Walt Disney World Swan and Walt Disney World Swan Reserve hotels.\n\nBill brings… Liked by William Visel 🎉 Celebrating 10 Years of Secure Compliance Solutions! 🎉\n\nToday marks 10 years since we founded Secure Compliance Solutions with a simple mission:… 🎉 Celebrating 10 Years of Secure Compliance Solutions! 🎉\n\nToday marks 10 years since we founded Secure Compliance Solutions with a simple mission:… Liked by William Visel Birthday 🎂 Vacation is Over!! Best Birthday Ever💪🏾🌎 Now Back to work on some New Amazing Radio 📻 Technology Birthday 🎂 Vacation is Over!! Best Birthday Ever💪🏾🌎 Now Back to work on some New Amazing Radio 📻 Technology Liked by William Visel View William’s full profile See who you know in common Get introduced Contact William directly Join to view full profile Other similar profiles Birhane Retta IT Manager at Education Week Washington, DC Connect Patrick Domingues Palm Coast, FL Connect Marco Dantas Sanford, NC Connect Burt Grinley Palm Harbor, FL Connect Paul Tancreti New Port Richey, FL Connect Pedro Olavarria , MBA Leading IT strategy and transformation across multiple agencies. Orlando, FL Connect Aaron Fowler, CISM Information Security Manager @GilatDataPath | Cybersecurity Expertise Atlanta Metropolitan Area Connect Tab Leonard Waxhaw, NC Connect Jim Shempert Cleveland, MS Connect Spencer Simpson Metro Jacksonville Connect Explore top content on LinkedIn Find curated posts and insights for relevant topics all in one place. View top content LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . View William’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now"
    },
    {
      "url": "https://www.giftly.com/gift-card/breezers-tiki-bar-key-largo-2",
      "text": "Breezer's Tiki Bar Giftly - Beautiful Gift Card Alternative Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Key Largo Going Out Breezer's Tiki Bar Breezer's Tiki Bar Gift Card Breezer's Tiki Bar Giftly A beautiful gift card alternative for Breezer's Tiki Bar Breezer's Tiki Bar 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Breezer's Tiki Bar (36) (305) 453-0000 Categories Tiki Bars Location 103800 Overseas Highway Mile Marker 103.8, Key Largo, FL Gift Ideas for Breezer's Tiki Bar If you're looking for the perfect gift for a friend or loved one who loves the laid-back, tropical vibes of the Florida Keys, look no further than Breezer's Tiki Bar. This iconic bar is a local institution, famous for its delicious drinks, mouth-watering food, and live music. For the cocktail lover in your life, why not gift them a bottle of Breezer's famous rum? This smooth and full-bodied rum is the perfect addition to any tropical drink, and is sure to transport the recipient back to their favorite beachside bar with every sip. If food is more their thing, then a gift card to Breezer's is a no-brainer. With a wide range of dishes on offer, from fresh seafood to juicy burgers, there's something for everyone on the menu. And with the laid-back and friendly atmosphere, they're sure to have a great time enjoying their meal, and perhaps even catching some live music while they're there. For those looking to bring a piece of Breezer's Tiki Bar home with them, why not gift one of the bar's iconic t-shirts or hats? These stylish and comfortable items are perfect for anyone looking to add a touch of tropical flair to their wardrobe. And of course, no gift from Breezer's Tiki Bar would be complete without a little bit of the bar's signature charm. Why not pick up a classic tiki mug or shot glass, to help the recipient recreate their favorite Breezer's drinks in the comfort of their own home? Whatever you choose, a gift from Breezer's Tiki Bar is sure to delight and inspire. So why not spread a little bit of tropical sunshine this gift-giving season, and treat someone special to a taste of the Florida Keys? Click here to send a gift up to $1,000 with the suggestion to use it at Breezer's Tiki Bar. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Breezer's Tiki Bar Price $$ Ambience Casual, Touristy Hours Monday-Sunday: 4PM-10PM Breezer's Tiki Bar, located in Key Largo, Florida, is the perfect spot to unwind and relax with friends and family. This laid-back establishment boasts a casual and touristy ambiance, perfect for those looking to experience the true Florida Keys lifestyle. From the moment you walk through the door, you will be struck by the stunning view of the ocean and the friendly atmosphere that permeates the bar. The service is top-notch, with attentive staff who are always on hand to ensure that your experience is nothing short of exceptional. But what truly sets Breezer's Tiki Bar apart from other bars in the area is its live music. Whether you're sitting inside or out, you'll be able to enjoy some of the best local musicians in the area, playing everything from classic rock to Caribbean beats. Of course, no visit to Breezer's Tiki Bar would be complete without sampling some of their delicious food and drinks. The menu features a range of mouth-watering dishes, from fresh seafood to juicy burgers, all cooked to perfection. And with an extensive drinks menu that includes everything from classic cocktails to local brews, you're sure to find the perfect beverage to complement your meal. Whether you're a local looking for a fun night out or a tourist looking to experience the best of the Florida Keys, Breezer's Tiki Bar is a must-visit destination. So why not grab some friends, head down to Key Largo, and experience the magic of Breezer's Tiki Bar for yourself? You won't regret it! Great Alternatives Buy a Gift & Greeting Card for Gilbert's Tiki Bar : Welcome to Gilbert's Tiki Bar, a tropical oasis in Key Largo where you can indulge in delightful cocktails, soak up the sun, and experience a slice of paradise. Gift $100 for Cruisin’ Tikis Key Largo : Cruisin' Tikis Key Largo offers a unique and unforgettable tropical adventure, where you can explore the sparkling waters of Key Largo aboard your very own tiki bar floating on the waves. Updated: August 29, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Breezer's Tiki Bar gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Breezer's Tiki Bar. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Breezer's Tiki Bar or anywhere else they like! Top Related Gifts Amerant Bank Arena Where the Excitement Comes Alive 1 Panther Pkwy, Sunrise, FL 3.7 (51) • Music Venues Casa Florida Classic Cocktails, Timeless Miami Charm 437 SW 2nd St, Miami, FL 3.6 (308) • $$ • Cocktail Bars Swizzle Rum Bar & Drinkery Rum, Relax, and Revelry in Miami 1120 Collins Ave, Miami Beach, FL 4.9 (245) • $$ • Cocktail Bars Brendan's Sports Pub Catch the Game, Savor the Flavor 868 S Federal Hwy, Pompano Beach, FL 4.3 (108) • $$ • Sports Bars Jimmy Johnson’s Big Chill Island flavors and sunset views 104000 Overseas Hwy, Key Largo, FL 3.0 (845) • $$ • Sports Bars Tiki Bar Tropical Vibes, Stunning Sunsets 84001 Overseas Hwy, Islamorada, FL 3.6 (52) • $$ • Tiki Bars Tiki Bar Tropical Sips by the Poolside 80001 Overseas Hwy, Islamorada, FL 5.0 (4) • Tiki Bars The Catch Catch Fresh Flavor in Key Largo 102041 Overseas Hwy, Key Largo, FL 4.2 (242) • $$ • Sports Bars More Nearby Businesses Caribbean Club 104080 Overseas Hwy, Key Largo, FL 3.7 (135) • $ • Dive Bars Hog Heaven Sports Bar & Grill 85361 Overseas Hwy, Islamorada, FL 3.6 (555) • $$ • Sports Bars Keg South Of Kendall 12805 SW 136th Ave, Miami, FL 3.7 (268) • $$ • Sports Bars Corbett's Sports Bar & Grill 12721 S Dixie Hwy, Miami, FL 3.6 (77) • $$ • Sports Bars Hole In the Wall 8002 SW 81st Dr, Miami, FL 3.7 (194) • $$ • Sports Bars The Comedy Inn 14501 S Dixie Hwy, Miami, FL 4.6 (34) • $$ • Comedy Clubs Mellow Grapes 15512 SW 88th St, Miami, FL 4.6 (88) • $$ • Wine Bars A Party Hall 10957 SW 186th St, Miami, FL 3.7 (3) • $$ • Dance Clubs Tucandela Bar Kendall 8405 Mills Dr, Kendall, FL 2.4 (106) • $$ • Bars Sharp Shooters Billiards 7200 SW 117th Ave, Miami, FL 3.8 (45) • $ • Pool Halls Island Grill At Ocean Pointe 500 Burton Dr, Tavernier, FL 3.7 (3) • Cocktail Bars Islamorada Wine 80925 Overseas Hwy, Islamorada, FL 5.0 (19) • Wine Bars Spit-Fya Productions Cutler Bay, FL 5.0 (1) • Music Production Services Osumi Cocktail & Sushi Bar 110 Giralda Ave, Coral Gables, FL 4.3 (49) • Cocktail Bars The Mar Bar 90775 Old Hwy, Tavernier, FL 4.5 (82) • $$ • Wine Bars Exit One Taproom 12 NE 3rd St, Florida City, FL 4.2 (90) • $$ • Beer Bar Hole in the Wall 14421 S Dixie Hwy, Miami, FL 3.9 (120) • $$ • Pubs Hammocks Grill 14617 SW 104th St, The Hammocks, FL 3.8 (204) • $$ • Sports Bars Sunset Tavern 7230 SW 59th Ave, South Miami, FL 3.8 (163) • $$ • Sports Bars Backroom Live 100TH Ave Sw 56 St, Miami, FL 4.6 (5) • $$ • Jazz & Blues Islamorada Fishing Club 104 Madeira Rd, Islamorada, FL 3.8 (9) • $$ • Pubs Hole in the Wall 14437 SW 144th St, Palmetto Bay, FL 4.0 (9) • $$ • Sports Bars Hole in the Wall 9821 SW 184th St, Palmetto Bay, FL 3.4 (132) • $ • Sports Bars Oceanside Safari Restaurant & Lounge 73814 Overseas Hwy, Islamorada, FL 4.0 (51) • Lounges Crooked Palm Cabana 90184 Overseas Hwy, Tavernier, FL 4.8 (46) • Cocktail Bars The Nest BBQ & Sports Bar 81219 Overseas Hwy, Islamorada, FL 4.4 (10) • Sports Bars Axe Habits 9228 SW 156th St, Palmetto Bay, FL 4.6 (96) • Axe Throwing Beauty & The Butcher 6915 SW 57th Ave, Coral Gables, FL 4.1 (230) • Cocktail Bars Sports Grill - Sunset 10005 SW 72nd St, Miami, FL 3.9 (424) • $$ • Sports Bars Sandbar Sports Grill 20305 Old Cutler Rd, Cutler Bay, FL 3.5 (217) • $$ • Sports Bars Old Tom’s Sports Bar - Kendall 9525 N Kendall Dr, Kendall, FL 3.7 (243) • $$ • Sports Bars Sports Grill - Kendall 9090 SW 97th Ave, Miami, FL 4.2 (484) • $$ • Sports Bars Bougainvillea's Old Florida Tavern 7221 SW 58th Ave, South Miami, FL 3.8 (293) • $$ • Bars Cariflex Sports Diner 14291 SW 120th St, Miami, FL 4.5 (71) • $$ • Karaoke Kara-O-King DJ and Karaoke Entertainment 26521 SW 128th Ct, Miami, FL 4.0 (4) • $$ • Karaoke Vacancy Bar 13700 SW 139th Ct, Miami, FL 5.0 (4) • $$ • Cocktail Bars Mamey - Miami 1350 S Dixie Hwy, Coral Gables, FL 4.0 (584) • $$$ • Cocktail Bars The OceanView Pub & Sports Bar 84500 Overseas Hwy, Islamorada, FL 3.8 (154) • $ • Sports Bars Dive Bar On The Bay 200 Florida Ave, Tavernier, FL 4.9 (9) • Beer Bar Sandbar On Tap 83413 Overseas Hwy, Islamorada, FL 3.5 (17) • Wine Bars Galiano Cigar Room 2310 Galiano St, Coral Gables, FL 4.6 (67) • Cigar Bars Cigar Cellar of Miami 1557 Sunset Dr, Coral Gables, FL 4.8 (17) • Lounges See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Tiki Bars 3.8 30-39 4 single place gcdp beautiful_gift_card_alternative_in_title_tag Key Largo, FL M XS Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://tikipub.com/contact-us/",
      "text": "Contact Us | Tiki Pub - Lacrosse & Ponce Inlet - FL LOCATIONS SPECIALTY SPECIALTIES Where every event feels like a getaway. BACHELORETTE PARTIES Bachelor Parties Birthday Parties Girls Day Wedding Events Engagement Parties Graduation Parties Retirement Celebrations Team Building Events Holiday Parties Sunset Cruise Booze Cruise Sand Bar Party Corporate Outing VIEW ALL SPECIALTIES FRANCHISE ABOUT US CONTACT US LOCATION LOCATION MENU CONTACT US Do you have any questions about our franchise opportunities or Tiki boat tours? If you’re eager to dive into the Tiki Pub experience, drop us a line. We’re always happy to chat and make some waves together! follow us on social media Facebook-f Instagram Youtube choose your location A tiki pub is a tropical-themed bar that serves exotic cocktails in a vibrant, Polynesian-inspired setting, offering a fun and relaxed atmosphere for patrons. GET IN TOUCH WITH US Submitting this form is the easiest way to contact us about any questions you may have about your tour. You can also give us a call. We’d love to hear from you! Name * name Last Phone * Email * Message * PONCE INLET, FL PONCE INLET, FL LACROSSE, WI LACROSSE, WI FORT MYERS, FL FORT MYERS BEACH, FL SUBSCRIBE TO OUR NEWSLETTER Email * Looking for the ultimate party boat experience? Look no further than Tiki Pub! Our tiki-themed party boats are the perfect choice for an unforgettable celebration. Cruise in style, sip on tropical cocktails, and dance to the rhythm of live music. With our top-notch customer service and custom-designed boats, Tiki Pub is the go-to destination for a party on the water. Book your spot today and get ready to have a blast in the one and only Tiki Pub party boat! Facebook-f Instagram Youtube VISIT LOCATIONS PONCE INLET, FL PONCE INLET WAIVER LACROSSE, WI LACROSSE WAIVER FORT MYERS BEACH, FL FORT MYERS WAIVER WRIGHTSVILLE BEACH, NC VISIT WRIGHTSVILLE DESTIN, FL VISIT DESTIN PRIVACY POLICY FRANCHISE SPECIALTY CONTACT US ABOUT US © Copyright 2025 – All Rights Reserved PRIVACY POLICY FRANCHISE SPECIALTY CONTACT US ABOUT US LOCATIONS PONCE INLET, FL LACROSSE, WI FORT MYERS, FL WRIGHTSVILLE BEACH, NC DESTIN, FL SPECIALTY BACHELOR PARTIES BACHELORETTE PARTIES BIRTHDAY PARTIES GIRLS DAY WEDDING EVENTS ENGAGEMENT PARTIES GRADUATION PARTIES RETIREMENT CELEBRATIONS TEAM BUILDING EVENTS HOLIDAY PARTIES SUNSET CRUISE BOOZE CRUISE SAND BAR PARTY CORPORATE OUTING FRANCHISE ABOUT US CONTACT US WAIVER BOOK NOW +1 386-478-9207 ponceinlet@paddlepub.com +1 386-478-9207 ponceinlet@paddlepub.com LOCATIONS BACK PONCE INLET, FL VISIT SITE LACROSSE, WI VISIT SITE FORT MYERS BEACH, FL VISIT SITE WRIGHTSVILLE BEACH, NC VISIT SITE DESTIN, FL VISIT SITE"
    },
    {
      "url": "https://www.groupon.com/biz/key-largo-fl/breezers-tiki-bar",
      "text": "Breezer's Tiki Bar, 103800 Overseas Highway, Key Largo, FL - Groupon Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home Breezer's Tiki Bar, Key Largo Breezer's Tiki Bar, Key Largo 103800 Overseas Highway, Key Largo, FL 33037 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? Similar deals American Aid Society of German Descendants Oktoberfest Celebration at American Aid Society of German Descendants 259 West Grand Avenue, Lake Villa 44.0 mi $33 $22 -33% 4.8 (723) How to reach us © MapTiler © OpenStreetMap contributors Breezer's Tiki Bar 1228.0 mi 103800 Overseas Highway, Key Largo, FL 33037 Closed Opening at 4:00 PM Closed Opening at 4:00 PM Call Directions Visit website +13054530000 http://www.marriott.com/hotel-restaurants/mthkl-key-largo-bay-marriott-beach-resort/breezer's-tiki-bar/78470/home-page.mi About Breezer's Tiki Bar Treat yourself to good food and drink at Breezer's Tiki Bar in Key Largo. Pair your entree with a glass of wine or draft beer ? this restaurant has a fully-stocked bar to complement your meal. The happy hour at Breezer's Tiki Bar offers deals you won't want to miss. Dine out in the open during Breezer's Tiki Bar's summer season when patio tables are available for use. The restaurant has ample room for dancing, and patrons can be seen jamming out on the floor. We're happy to report we have parking available onsite. We'll meet you here. Breezer's Tiki Bar makes bikers feel at ease with the multiple storage racks outside. Meals at Breezer's Tiki Bar usually set you back about $30 per diner. Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    }
  ]
}