{
  "fuentes": [
    {
      "url": "http://hollywoodfl.org/Facilities/Facility/Details/Orangebrook-Golf-Country-Club-101",
      "email": "citizenservices@hollywoodfl.org"
    },
    {
      "url": "http://www.orangebrook.com/course-managers/",
      "email": "ira@jcdsportsgroup.com"
    },
    {
      "url": "https://www.orangebrook.com/rates/",
      "email": "ira@jcdsportsgroup.com"
    },
    {
      "url": "https://www.orangebrook.com/rates/",
      "email": "kenny@jcdsportsgroup.com"
    },
    {
      "url": "https://chamber.hollywoodchamber.org/list/member/orangebrook-golf-country-club-3358",
      "email": "information@hollywoodchamber.org"
    },
    {
      "url": "https://www.orangebrook.com/contact-us/",
      "email": "ira@jcdsportsgroup.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/orangebrook-golf-country-club/",
      "email": "default-80@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/orangebrook-golf-country-club/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/orangebrook-golf-country-club/",
      "email": "iglick@jcdsportsgroup.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/orangebrook-golf-country-club/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://orangebrookfl.com/",
      "email": "info@orangebrookfl.com"
    },
    {
      "url": "https://www.orangebrook.com/about-us/",
      "email": "ira@jcdsportsgroup.com"
    },
    {
      "url": "https://www.orangebrook.com/",
      "email": "ira@jcdsportsgroup.com"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/6661-orangebrook-west/search",
      "email": "nbc-golf-white@2x.png"
    }
  ],
  "mails": [
    "citizenservices@hollywoodfl.org",
    "default-80@2x.png",
    "golf-club-detail@2x.png",
    "iglick@jcdsportsgroup.com",
    "info@orangebrookfl.com",
    "information@hollywoodchamber.org",
    "ira@jcdsportsgroup.com",
    "kenny@jcdsportsgroup.com",
    "nbc-golf-white@2x.png",
    "travel@albrecht.de"
  ],
  "nombre_sitio": "orangebrook.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://hollywoodfl.org/Facilities/Facility/Details/Orangebrook-Golf-Country-Club-101",
      "text": "Parks, Facilities, & Venues • Orangebrook Golf & Country Clu Skip to Main Content Search Government Departments Services Business Visit How Do I… Home Parks, Facilities, & Venues Get Directions Google Bing Orangebrook Golf & Country Club 400 Entrada Drive Hollywood, FL 33020 Contact 954-967-4653 Parks, Facilities, & Venues Feature Overview View all facilities Orangebrook Golf & Country Club Other Link Orangebrook Golf & Country Club Features ADA Accessible Club House Event Hall Golf Locker Room Meeting/Multi-Purpose Rooms Parking Lot Public Wi-Fi Restaurant / Cafe Restrooms Security Orangebrook Golf & Country Club is a historic 36-hole championship golf course located in the heart of Hollywood, Florida. Originally built as an 18-hole facility in 1933, a second 18 holes were added in 1959. Orangebrook plays host to the Women’s International 4-Ball golf tournament, which is the longest-running women’s amateur event held at one location in the United States. Past champions include Babe Zaharias, Peggy Kirk Bell and Louise Suggs. Orangebrook has also played host to the Men’s Amateur 4-Ball golf tournament, which in 1960 was won by Jack Nicklaus and Deane Beman. As well as having 36 holes of championship golf, the facility has a fully stocked Pro Shop, lighted driving range (open till 10:00 PM), a restaurant with full bar service, and a banquet room with seating for up to 250. Whether you are looking for a round of golf, lunch with your friends, or that special place to hold your functions, Orangebrook has it all. Experience the beauty of the fairways at Hollywood's Golf Courses! In collaboration with reputable management partners, our golf courses offer a pristine setting for enthusiasts of all skill levels. Enjoy the lush greens, challenging holes, and a golfing experience tailored to your preferences. Tee off at Hollywood's premier golf destinations and savor the perfect swing in a picturesque environment. For information regarding programs click or contact the administrator below. Location No. of Holes Administrator Phone Number Orangebrook Golf and Country Club 36 / driving range JCD Sports Group 954.967.4653 ▲ Back to top Payment Center Report a Concern Sign Up for Notifications Employment Open Government Customer Service Directory Contact Us City of Hollywood 2600 Hollywood Boulevard Hollywood, FL 33020-4807 General Info: 954.967.4357 Police/Fire Only - Non-Emergency: 954.764.HELP (4357) Report Water & Sewer Emergency: 954.921.3046 Report King Tide Flooding 954.764.4357 Hours: Mon – Thurs, 7am – 6pm Send Us an Email Staff Directory Quick Links Staff Directory Business Support & Economic Development A-Z Directory Hollywood Connect Pay Your Utility Bill Local Weather /QuickLinks.aspx Using This Site Site Map Accessibility Privacy Statement/Disclaimer/Legal Notice Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "http://www.orangebrook.com/course-managers/",
      "text": "Course Managers - Orangebrook Golf & Country Club - West Skip to primary navigation Skip to main content Orangebrook Golf & Country Club - West Facebook Tee Times Member Tee Times Home Tee Times Public Tee Times Member Tee Times Course About Us Rates Scorecards Photo Gallery Lessons Tips for Playing Course Managers Events Restaurant Contact Us Contact Us Join E-Club Course Managers Ira Glick, General Manager Ira was born in Hollywood, Florida and has lived there most of his life. Ira started out in the golf business in 1995 at Hillcrest Golf & Country Club. After holding almost every position on the golf side of the business, Ira moved into the clubhouse to learn that side of the operation. He worked his way up and his last few years were spent as the Assistant General Manager. In November of 2006 Ira was hired as the General Manager of Orangebrook Golf & Country Club. Howard Hulsebosch, Golf Course Superintendent Kenny Szuch, PGA Director of Golf Page Footer Contact Us Address : 400 Entrada Drive Hollywood, FL 33021 Email : ira@jcdsportsgroup.com Phone : (954) 967-4653 Join E-Club Copyright © 2025 Orangebrook Golf & Country Club – West All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.orangebrook.com/rates/",
      "text": "Rates - Orangebrook Golf & Country Club - West Skip to primary navigation Skip to main content Orangebrook Golf & Country Club - West Facebook Tee Times Member Tee Times Home Tee Times Public Tee Times Member Tee Times Course About Us Rates Scorecards Photo Gallery Lessons Tips for Playing Course Managers Events Restaurant Contact Us Contact Us Join E-Club Rates Membership Application 2024-2025 Orangebrook Golf & Country Club 400 Entrada Drive Hollywood Fl, 33021 400 Entrada Drive Hollywood Fl, 33021 Book tee times over the phone or on our website 24 hrs a day! Rates effective: December 13, 2024 Public Rates 18 holes w/ Golf Cart Time of Day Before 3:00 PM Monday to Friday $57.00 Weekend $57.00 18 holes Walking Time of Day Before 3:00 PM Monday to Friday $45.00 Weekend $45.00 18 holes w/ Golf Cart Time of Day After 3:00 PM Monday to Friday $30.00 Weekend $30.00 18 holes Walking Time of Day After 3:00 PM Monday to Friday $23.00 Weekend $23.00 Hollywood Resident Rates 18 holes w/ Golf Cart Time of Day Before 3:00 PM Monday to Friday $52.00 Weekend $52.00 18 holes Walking Time of Day Before 3:00 PM Monday to Friday $41.00 Weekend $41.00 18 holes w/ Golf Cart Time of Day After 3:00 PM Monday to Friday $26.00 Weekend $26.00 18 holes Walking Time of Day After 3:00 PM Monday to Friday $20.00 Weekend $20.00 Member Rates 18 holes w/ Golf Cart Time of Day Before 3:00 PM Monday to Friday $42.00 Weekend $42.00 18 holes Walking Time of Day Before 3:00 PM Monday to Friday $35.00 Weekend $35.00 18 holes w/ Golf Cart Time of Day After 3:00 PM Monday to Friday $25.00 Weekend $25.00 18 holes Walking Time of Day After 3:00 PM Monday to Friday $18.00 Weekend $18.00 Hollywood residents must show proof of residency Rates include $4.00 Capital Improvement surcharge and $0.50 Diamonds in the Rough surchage Rates DO NOT include Sales Tax. All rates are subject to change Don’t forget to ask about Golf Instruction: PGA Head Golf Professional Kenny Szuch is here to help you lower your score this season. Email: kenny@jcdsportsgroup.com or Call (954) 967 – 4653 Page Footer Contact Us Address : 400 Entrada Drive Hollywood, FL 33021 Email : ira@jcdsportsgroup.com Phone : (954) 967-4653 Join E-Club Copyright © 2025 Orangebrook Golf & Country Club – West All Rights Reserved. Powered by"
    },
    {
      "url": "https://chamber.hollywoodchamber.org/list/member/orangebrook-golf-country-club-3358",
      "text": "Orangebrook Golf & Country Club | Golf Courses / Country Clubs | Country Clubs - Event - Greater Hollywood Chamber of Commerce 954.923.4000 Email Facebook Instagram Email Facebook Instagram Member Directory Newsletter Member Login What We Do BE INVESTED. Join Our Membership Why You Must Join Membership Overview Market Your Business With Us Member Directory BE INVOLVED. Industry Groups Leads Groups Upcoming Events BE INFLUENTIAL. Committees & Task Forces Sponsorship & Opportunities Leadership Hollywood Foundation Leadership Hollywood Graduation Gala BE INVITED. Board Installation & Business Leaders Awards Teacher of the Year Spark Hollywood FL Disaster Preparedness Conference Leadership Hollywood Graduation Gala Grapes for Grades Golf Classic Who We Are About Us Our Team Board of Directors Ambassadors Greater Hollywood Chamber of Commerce’s 100th Birthday Contact Do Business in Hollywood ABOUT HOLLYWOOD From the Mayor Census/Demographics Hollywood’s History City of Hollywood Official Site Community Redevelopment Agency Broward County Public Schools WORK WITH HOLLYWOOD Vendor Guide Business Connections Guide Job Postings & Hiring Guide GHCC Business Alerts VISIT HOLLYWOOD Plan Your Visit Member Directory Member Directory JOIN NOW Select Page Orangebrook Golf & Country Club Categories Golf Courses / Country Clubs Country Clubs 400 Entrada Drive Hollywood FL 33021 (954) 967-4653 (954) 967-4660 Visit Website Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Email Facebook Instagram © Greater Hollywood Chamber of Commerce. All rights reserved. Privacy Policy."
    },
    {
      "url": "https://www.orangebrook.com/contact-us/",
      "text": "Contact Us - Orangebrook Golf & Country Club - West Skip to primary navigation Skip to main content Orangebrook Golf & Country Club - West Facebook Tee Times Member Tee Times Home Tee Times Public Tee Times Member Tee Times Course About Us Rates Scorecards Photo Gallery Lessons Tips for Playing Course Managers Events Restaurant Contact Us Contact Us Join E-Club Contact Us Phone: 954-967-4653 Fax: (954) 967-4660 Orangebrook Golf & Country Club – West 400 Entrada Drive Hollywood, FL 33021 ira@jcdsportsgroup.com Contact Us Please enable JavaScript in your browser to complete this form. Name * First Last Email * Address Address Line 1 Address Line 2 City — Select state — Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming State Zip Code Daytime Phone Evening Phone Comments or Questions Submit Page Footer Contact Us Address : 400 Entrada Drive Hollywood, FL 33021 Email : ira@jcdsportsgroup.com Phone : (954) 967-4653 Join E-Club Copyright © 2025 Orangebrook Golf & Country Club – West All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.1golf.eu/en/club/orangebrook-golf-country-club/",
      "text": "Orangebrook Golf & Country Club, Hollywood, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Orangebrook Golf & Country Club 36 Hole Public Overview Courses Visitors Prices Amenities Club Reviews No image available Orangebrook Golf & Country Club 400 Entrada Dr, Hollywood, FL 33021-7040, USA Phone: +1 954-967-4653 , Fax: +1 954-967-4660 iglick@jcdsportsgroup.com www.orangebrook.com Map Save Share 3.0 of 5 stars 1 Review Courses 18-Hole East Course 18-Hole West Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round Green fees $9 (8 €) / 18 Holes Courses 18-Hole East Course Opened in 1936. Design: A. J. Ewing . Style: Parkland. Terrain: Water hazards Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Blue (Men) 72 71.3 120 6574 yards White (Men) 72 69 114 6108 yards Green (Men) 72 70.1 117 5509 yards 18-Hole West Course Opened in 1956. Design: A. J. Ewing . Style: Parkland. Terrain: Water hazards Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Gold (Men) 71 71.5 125 6626 yards Blue (Men) 71 69.5 121 6208 yards White (Men) 71 66.9 115 5712 yards Green (Men) 72 66.9 114 4680 yards Practice Facilities Driving Range Putting Green Chipping Green Visitors Both Courses Visitors are welcome every day. Etiquette Softspikes required. Green Fees Both Courses Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes $9 (8 €) $9 (8 €) Prices incl. cart! Amenities Club Amenities Clubhouse Club accepts credit cards Pro Shop Restaurant Bar Snack Bar Beverage Cart Rentals Clubs for hire Trolley for hire Electro-cart for hire The Club Personnel Title Name Manager Ira Glick Enlarge / get directions Nearby Courses Sunset GC Hollywood (1.7 km) 9 Hole 15 € / 18 Holes Hillcrest G&CC Hollywood (1.7 km) 2.0 of 5 stars (3) 18 Hole 34-38 € / 18 Holes Hollywood Beach Golf Resort Hollywood (3.7 km) 3.0 of 5 stars (1) 18 Hole 38-43 € / 18 Holes See all User Reviews 3.0 of 5 stars 1 Review 5 Stars: 0 4 Stars: 0 3 Stars: 1 2 Stars: 0 1 star: 0 Write a Review Most Recent Reviews pitchmark 388 Reviews Automatic translation Original version Spacious area 3.0 of 5 stars Reviewed May 13, 2018 True to the motto we play old places, we wanted aufteen on the East Course. We booked the East Course - built in 1933. You did not want us to play on this - the West Course - built in 1959 - would be nicer and better. In addition, you should play this, if you are here for the first time. Consequently, we have responded to the recommendation - obedient as we are. The place is something for the driver, maximum power. Nothing can happen, the fairways are very wide. They are almost completely flat. There is also plenty of space next to it, and the green can still be reached from almost every imaginable location. The greens follow the fairways, they are almost completely flat. On some holes, water is involved. Also many iguanas are in the game, leisurely an older gentleman crossed the bridge in front of us. We've never seen so many in a single place - madness. Well kept place, apart from some problem areas. Many of Hurricans' uprooted, felled trees are still lying. They make a bizarre picture. This does not disturb any houses within the complex. The noise of the nearby streets is audible and a little disturbing. It was fun to play here, the balls were also obedient, they wanted to experience something else. Very nice staff. Translated by Google . Been to Orangebrook Golf & Country Club ? Share your experiences! Write a Review See all reviews Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://orangebrookfl.com/",
      "text": "Manufactured Home Community in Hollywood, FL | Orangebrook 954-539-6230 Email Us Join Our Newsletter Facebook Home Available Homes Lifestyle Gallery Location Specials FAQ Contact Us Move in Ready Homes Available Now! View Homes Upgrade Your Lifestyle! Learn More LIVE THE FLORIDA SUNNY LIFESTYLE EXPLORE THE AREA Download Brochure Welcome Home Orangebrook Harbor combines everything you love about retiring in Florida with the conveniences you want from a manufactured home community in Hollywood . Home here comes with amenities you need for comfort, convenience, and entertainment in a city with dining, shopping, and entertainment on all sides. At our 55+ community near Fort Lauderdale , you can attend events in the clubhouse, swim in our heated pool, play a game of shuffleboard with your neighbors, or head right next door for a round of golf at Orangebrook Golf and Country Club. Our community offers all the advantages of owning a house in a neighborhood atmosphere just minutes from the Hollywood Beach Broadwalk. We’re 4 miles from Historic Downtown Hollywood, 12 miles from the heart of Fort Lauderdale, and 20 miles from Miami. This is home. Want to learn more about our 55+ community? First Name* * Last Name* * Phone Email * Text Message Consent Yes, I would like to receive SMS updates with the latest information and offers* * Disclaimer: By checking this box, I consent to receive SMS messages from Orangebrook Harbor, managed by MUREX HOUSING LLC, regarding updates, offers, and information. Message and data rates may apply. You may opt-out at any time. Δ Amenities Discover Fun Heated pool Unwind at the on-site community swimming pool. Clubhouse This is a center for resident activities and entertainment. Shuffleboard Play a game with friends and family in our neighborhood. Events Our community calendar is packed with resident events. PÉtanque court Play a game of pétanque on our on-site court. What's Nearby Contact Us today for more information! Sold 2 BED 2 BATH 888 SQ. FT. Orangebrook 3310 Golf St. $175,000 2 BED 2 BATH 1104 SQ. FT. Orangebrook 3233 State St. $94,900 2 BED 2 BATH 1100 SQ. FT. Orangebrook 1320 S 33rd Road $91,000 Explore the neighborhood The heart of Hollywood, Fl Nestled between Fort Lauderdale and Miami, Hollywood is the epitome of Old Florida charm. Our 55+ community is less than 6 miles from the famous Hollywood Beach where you can enjoy the iconic Hollywood Beach Broadwalk, art galleries, restaurants, casinos, and the vibrant downtown area. Orangebrook is also nestled alongside Orangebrook Golf & Country Club, featuring two 18-hole courses that are open to the public. Come visit. discover the best of Hollywood Location 3318 orange street hollywood, FL 33021 Come visit. discover the best of Hollywood Location 3318 orange street hollywood, FL 33021 Office hours Monday – Friday 9am to 5pm Saturday & Sunday By appointment Contact 954.539.6230 3318 Orange Street Hollywood, FL 33021 © Orangebrook Harbor All rights reserved Privacy policy Terms of Use Do Not Sell or Share My Personal Information X Close Privacy Policy Orangebrook Harbor Privacy Policy I. SCOPE OF THIS POLICY II. INFORMATION THAT WE COLLECT OR RECEIVE III. USE OF INFORMATION Orangebrook Harbor Privacy Policy This Privacy Policy describes how Orangebrook Harbor collects, uses, and discloses your personal information. This Privacy Policy should be read in conjunction with our Terms of Service, and any other policy, agreement, or terms which may affect your relationship with us. I. SCOPE OF THIS POLICY This Privacy Policy applies to https://www.orangebrookfl.com including all its sub-domains and other websites that link to this Privacy Policy, when accessing and using them in the United States, as well as any of our other services and tools that might be made available by us from time to time, including offline tools, surveys, applications, services, advertisements, events, and promotions (collectively, “Services”). We may provide links to external-party websites that are not owned by Orangebrook Harbor. Orangebrook Harbor has no control over external-party privacy practices and assumes no responsibility in connection with your use of external-party websites, applications, or any other services offered by other parties. Any external-party services are governed by the privacy policies appearing on those sites and applications. By using the Services, you signify your consent to this Privacy Policy and the Terms of Service for the use of our Services. If you do not agree to this Privacy Policy or Terms of Service for the use of our Services, please do not use our Services. II. INFORMATION THAT WE COLLECT OR RECEIVE We collect and receive information from and about you by different means, including, without limitation: (i) information you submit or provide to us; (ii) information collected automatically and manually; and (iii) information provided to us by other sources. Some of the information we collect and receive includes “personal information,” which is generally information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with you. Personal information does not include information that is publicly available, de-identified, aggregated, or otherwise exempted by applicable laws.  The information we may collect will vary and depend on the nature of your relationship with us and the reason(s) for providing/collecting the information. A. Information You Submit or Provide to Us We or our vendors collect the information that you directly provide to us, such as when you enter it on a webpage, submit an online form, use a chat feature we may offer, or include it in an email that you send to us in relation to our Services. In addition, we may collect information through relevant business support processes, during the registration or account creation processes, and through other business functions where we ask you to provide information, including: Contact Information (e.g., name, email or mailing address, or phone number); Account Administration Information (e.g., username, password, or security questions); Communications (e.g., information you submit through our interactive chat feature or through other communications with us, including potential customer service call recordings); Payments and financial information (e.g., information necessary to process transactions, conduct due diligence, as part of an application, or for other business needs); Employment-related information and education information (e.g., information you may provide when applying for a job, or which may be included as part of an application); Demographic information (e.g., ethnicity, sex, gender, birth date, age, languages spoken, disability, housing status, household size, household type, family members, marital status, annual income, desired housing characteristics and desired housing location or community); Location information (e.g., geolocation inferred from your access to our websites or from your device); and Commercial records, customer records, and preference information (e.g., your purchase history, leasing details, rental history, property records, tenant data, and related information). Your use of interactive features we may offer on our Services is voluntary, and we may retain the information that you submit through these features. If you participate in interactive chat, either with a virtual or live agent, the contents of the chat may be captured by us or our service provider and kept as a transcript. If you use these features, you understand that our vendors may process the information obtained through the feature to provide the Service on our behalf. If you submit personal information of other people to us, e.g., when participating in a resident referral program we may offer, you represent that you have permission and authority to provide us with such personal information.  If you do not have permission, please do not provide us with their information. B. Types of Information Collected Automatically We may automatically or manually collect information related to your use of Services.   For example, data collected in this manner may include: Web Browsing Data. When you use our Services, our servers may automatically record information, including information that your browser or mobile device sends when you visit or use our Services. Technical Information. We may collect certain technical information about your computer systems or about your visits to our online environments when you use our Services. Device Information. We may collect information about the device you are using to access our Services, including what type of device it is, what operating system you are using, device settings, unique device identifiers and crash data. Cookie Data. Depending on how you are accessing our online environments, we may use “cookies” (a small text file sent by your device each time you visit our websites, unique to your Orangebrook Harbor account or your browser). When we use cookies, we may use “session” cookies (that last until you close your browser) or “persistent” cookies (that last until you or your browser delete them). For example, we may use cookies to remember your personal preferences, such as sections of our Services that you visit frequently, your user ID or other settings so you do not have to set them up every time you visit our Services. Some of the cookies we use may be associated with your Orangebrook Harbor account (including information about you, such as the email address you gave us), and other cookies are not. In addition, we may use web beacons, pixels, or other web programming code or embedded scripts. Analytics Data. We may use Google Analytics or other providers for analytics services. We may also implement Google Analytics Advertising Features such as remarketing with analytics and interest-based ads. We may use first-party cookies or other first-party identifiers as well as third-party cookies or other third-party identifiers to, e.g., deliver advertisements, measure your interests, and/or personalize content. For more information on how Google Analytics uses data collected through our services, visit http://www.google.com/policies/privacy/partners. To opt out of Google Analytics cookies, visit https://tools.google.com/dlpage/gaoptout or download the Google Analytics Opt-Out Browser Add-On. Sensory Data.  In order to provide you with the best possible support, prevent fraud, and improve our Services.  We may also use surveillance cameras on our property in order to provide security. C. Information Provided to Us by Other Sources To improve the quality of our Services, and to carry out research and analysis, we and our vendors may supplement the information we collect with information from other sources, such as publicly available information, commercially available sources, and information from our business partners or other third parties. III. USE OF INFORMATION We may use the information we collect through the Services or otherwise obtain for a number of purposes including to: Provide our Services; Understand and improve our operations, Services, and performance; Assist in customer service and transactions; Generate feedback regarding the Services which we offer; Conduct research or for analytics purposes; Develop new Services; Deliver marketing communications or promotional materials that may be of interest to you; Improve the services we provide and the usefulness of the Services; Customize our users’ experience when using the Services; Protect ourselves and our users; and/or Comply with applicable laws. IV. WHY WE MAY DISCLOSE INFORMATION We may disclose your personal information with other parties as follows: Provision of Services. We may disclose your personal information with our business partners, vendors, and service providers in order to provide our Services, including as necessary for financial transactions, to conduct due diligence, to detect and prevent fraud, to comply with applicable laws and/or contractual obligations, to ensure quality of our Services, and as otherwise necessary to support our Services. Law Enforcement, Judicial, Administrative, or Regulatory Disclosures. When we believe in good faith that the law requires disclosure or that disclosure is necessary to protect or enforce the rights, property, safety, or security of ourselves or others. Business Transfers. In connection with sale of the applicable business, a portion of the business, or certain stock and/or assets, or a corporate merger, consolidation, restructuring, or other corporate change including, without limitation, during the course of any due diligence process. Marketing and Advertisements. We may disclose your personal information to our vendors or third parties to facilitate marketing and provide you with advertisements which may interest you. Sweepstakes, Contests, and Promotions. We may offer sweepstakes, contests, and other promotions (each, a “Promotion”), including Promotions jointly sponsored or offered by third parties which may require submitting personal information.  If you voluntarily choose to enter a Promotion, your information may be disclosed to us, our co-sponsors, service providers, and other third parties, including for administrative purposes and as required by law (e.g., on a winner’s list). By entering, you are agreeing to the official rules that govern that Promotion, which may include consent to additional or differing data practices from those contained in this Privacy Policy.  Please review those rules carefully. V. CHOICES YOU HAVE ABOUT YOUR INFORMATION You may always limit the amount and type of information that we collect from you by choosing not to enter or provide information requested from you on our Services. However, some of our features and Services can only be provided to you if you provide us with requested information (including, in some instances, personal information). Some of the Services offered may ask whether you wish to opt out or opt into our contact lists for offers, promotions and additional Services that may be of interest to you. VI. DO NOT TRACK SIGNALS Some web browsers may transmit “Do-Not-Track” signals to websites with which the browser communicates. As with many other companies, we do not currently respond to these signals. VII. HOW WE SECURE YOUR INFORMATION Orangebrook Harbor is committed to protecting the confidentiality and security of your information against unauthorized access and disclosure. We only disclose your personal information to our personnel or others who need to know the information to service your account or to provide our Services, and as otherwise permitted or required by law. We maintain strict physical, electronic, and procedural safeguards to protect your information. VIII. OUR POLICY ON THE INFORMATION OF CHILDREN Orangebrook Harbor does not seek or knowingly collect personal information from children under the age of thirteen (13), and we request that children do not provide information through the Services. If you are a parent or guardian and become aware that your child has provided us with information, please contact us using one of the methods specified below, and we will work with you to address the issue. IX. INTERNATIONAL TRANSFERS We are a United States company and we provide our Services subject to United States law. However, we may transfer information to our affiliates, vendors, and business partners in other countries around the world, subject to applicable laws, and as a result personal information may be transferred to, processed, and stored in the other countries. As such, courts, law enforcement, and authorities in other countries may, in certain circumstances, be entitled to access your personal information. By using the Services or providing us with any information through the Services, you consent to this potential transfer, processing and storage of your information, and you acknowledge that other countries and jurisdictions may not provide the same privacy protections and their privacy laws may not be as comprehensive as those in the United States or in the country where you reside or are a citizen. X. CHANGES TO THE PRIVACY POLICY We reserve the right to amend this Privacy Policy at any time to reflect technological advancements, legal and regulatory changes and good business practices or otherwise at our discretion subject to applicable laws. If we make any changes, a new Privacy Policy will reflect those changes and the effective date of the revised Privacy Policy will be set forth at the top of the Privacy Policy. Your continued use of the Services after we make changes to this Privacy Policy is deemed to be acceptance of those changes, so please check this Privacy Policy periodically for updates. XI. HOW TO CONTACT US If you have anyquestions or comments about this Privacy Policy or the ways in which we use information subject to this statement, please do not hesitate to contact us by emailing info@orangebrookfl.com, writing to 3318 Orange Street, Hollywood, FL 33021, or calling us at 954.989.4772. X Close Orangebrook Harbor Online Terms of Use These Terms of Use or “Terms” apply to your use of or access to our online interfaces and digital properties, including our websites that link to these Terms (collectively, the “Sites”). “Orangebrook Harbor,” “we,” “us,” or “our” mean Orangebrook Harbor and/or one of our brands, affiliates, or subsidiaries. By using or accessing the Sites, you acknowledge that you have read, understood, and agreed to be bound by these Terms and our Privacy Policy, which contains important information about how we process personal information we may obtain through the Sites and is incorporated into these Terms by reference. If you do not wish to be bound by these Terms, please discontinue using and accessing the Sites. PLEASE READ THESE TERMS CAREFULLY BEFORE ACCESSING OR USING THE SITES. THESE TERMS INCLUDE AN ARBITRATION CLAUSE AND A WAIVER OF YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE LAWSUIT. THESE TERMS TAKE EFFECT WHEN YOU ACCESS OR USE THE SITES. BY ACCESSING OR USING THE SITES, YOU ATTEST THAT YOU ARE AT LEAST THE AGE OF MAJORITY IN YOUR STATE OF RESIDENCE AND ARE LEGALLY CAPABLE OF ENTERING INTO A BINDING CONTRACT. We reserve the right to change these Terms at any time, in our sole discretion and without prior notice. We will indicate changes to these Terms by updating the “Effective Date” above. Your use of the Sites following a change to these Terms signals your acceptance of the modification(s). Some areas or functionalities of the Sites may have additional terms and conditions that apply to your access or use of those areas or functionalities of the Sites (“Additional Terms”). If there is a conflict or inconsistency between these Terms and any Additional Terms, the Additional Terms shall govern your access and use of the respective area or functionality of the Sites. 1. LIMITED LICENSE Subject to your compliance with these Terms, you are granted a limited, non-exclusive, revocable, non-sublicensable, non-transferable license to access the Sites in accordance with the requirements and restrictions set forth below. If you do not agree to these Terms, or any amended Terms, you may not access or use the Sites for any purpose and shall promptly discontinue such use of the Sites. 2. INTELLECTUAL PROPERTY RIGHTS The Sites and all of their content and information (collectively, “Content”), including all copyrights, trademarks, service marks, trade names, and all other intellectual property rights (“Intellectual Property”) are owned and controlled by us, our subsidiaries, or our licensors, and are protected by copyright or other applicable intellectual property laws. You may print one copy of the Content for your personal non-commercial use only. You may not, however, copy, use, reproduce, or distribute the Content or otherwise use our Intellectual Property in any way, absent specific, prior written permission from us. 3. CONTENT DISCLAIMER The Content was believed to be accurate at the time it was published. Although we may periodically update the Content, it is subject to change without notice, and we make no guarantee as to the timeliness or accuracy of any Content presented on this Sites at the time accessed. We are not responsible, and hereby disclaim liability, for any errors, omissions, or availability of the Content. The Sites and Content are provided on an “as is,” and “as available” basis without representation or warranty of any kind whatsoever. We reserve the right to add, remove, and change information at any time without notice in our sole discretion. 4. USE OF THE SITES The Sites are intended for personal use only. You agree not to use the Sites for any commercial purposes. You further agree that you will not: Access or use the Sites (or any portion thereof) in violation of these Terms or applicable laws; Attempt to modify, alter, recreate, or otherwise use the Sites for any purpose other than as specifically permitted in these Terms; Attempt to probe, scan, or assess the vulnerability of the Sites; Breach any security, technological, or authentication measures on the Sites; Use any device, software, or routine to attempt to interfere with the Sites or otherwise disrupt the Sites or servers or networks connected to the Sites; Use any robot, spider, scraper, data mining tools, data gathering and extraction tools, or other automatic device or manual process to access, copy, or scrape the Sites for any purpose; Collect or store personal information about other users of the Sites without their consent; Use any part or feature of the Sites for any purpose that is unlawful, tortious, libelous, defamatory, obscene, threatening, or intrusive on another person’s privacy; Use the Sites to harm or harass any person or entity; Take any action that imposes, in the Company’s sole discretion, an unreasonable or disproportionately large load on the Company’s infrastructure; or Use the Sites for any reason for which the Sites are not intended. The Company reserves the right, in its sole discretion and without limiting its other remedies, to restrict, suspend, or terminate your access to, or use of, the Sites at any time with or without cause, including if the Company believes that you may be in breach of these Terms or applicable laws or are misusing the Sites. 5. REGISTRATION Some Sites may permit or require you to register for an online account with a user ID and/or password (“Login Credentials”). Otherwise, no account is needed to access the Sites. Your Login Credentials and any information that you provide in connection with your account must remain accurate and complete at all times. You are responsible for maintaining the confidentiality and security of your Login Credentials, and you are fully responsible for any and all access and use of your account. Please notify us immediately of any unauthorized use of your account, or any other known or suspected breach of security, including without limitation any loss, theft, or unauthorized use of your Login Credentials. If we have reasonable grounds to suspect that the security of your Login Credentials has been compromised, we may suspend or terminate your account, refuse any and all current or future use of the services, and pursue any appropriate legal remedies. 6. LINKS TO EXTERNAL WEBSITES The Sites may include links to external websites or resources, for your convenience. Such third-party websites contain information created, published, maintained, or otherwise posted by organizations and entities independent of us. We are not responsible for the content of those websites, nor do we approve, endorse, or certify information available at these websites or any linked addresses contained therein. We make no warranties and hereby disclaim all liability as to the accuracy of the content and to any representations made concerning the quality of products or services provided on those websites or pages. We are also not responsible for the privacy policies or practices of those websites or of those companies. 7. SUBMISSIONS TO THE SITES By providing information or materials to the Sites (other than personal information, which is subject to our Privacy Policy), you grant to us an unrestricted, irrevocable, worldwide, royalty-free license to use, reproduce, display, publicly perform, and transmit such information and materials for any purpose, including without limitation, disclosing any such information and materials as necessary to satisfy any law, regulation, or governmental request. You are prohibited from submitting or transmitting any material or communication through the Sites that we deem discriminatory, racist, offensive, pornographic, defamatory, harassing, threatening, inappropriate, violates any law, or infringes on any third party’s intellectual property rights. We reserve the right to take any available steps to prevent or prohibit any such transmission that violates this provision, which shall be determined at our sole discretion, and to take any appropriate legal action. 8. CHANGES TO THE SITES; TERMINATION OF ACCESS We reserve the right to, at any time, modify, suspend, discontinue, or reduce the functionality of the Sites (or any portion thereof), temporarily or permanently, with or without notice. In addition, we may suspend or terminate your access to the Sites at any time for any reason, at our sole discretion and without prior notice. To the fullest extent permitted by applicable law, you agree that we shall not be liable to you or to any third party for any modification, suspension, or discontinuance of the Sites (or any portion thereof) for any reason at any time. 9. DISCLAIMER OF WARRANTIES AND LIABILITY Your use of this website and Content is at your own risk. Content may become inaccurate as a result of developments after its publication on these Sites. We assume no responsibility to keep Content current or to correct inaccuracies or errors in Content. The Content on these Sites and the operation of them are provided “as is,” and we disclaim all representations or warranties of any kind, either express or implied, including warranties of merchantability, fitness for particular purpose, title, non-infringement, accuracy, completeness, and timeliness. Certain jurisdictions may not permit certain disclaimers of warranties. In such case, we disclaim warranties to the fullest extent permitted by the applicable law. WE SPECIFICALLY DISCLAIM ANY LIABILITY, whether based in contract, tort, negligence, strict liability, or otherwise, for damages of any kind including, but not limited to, any direct, indirect, incidental, consequential, special, punitive, and/or exemplary damages caused by, arising out of, and/or in any way connected with functionality or operation of, access to, use of, or reliance on the Sites or the Content (even if we or our representatives have been advised of the possibility of such damages) or that are caused by and/or arise in connection with mistakes or omissions in, or delays in transmission of, information to or from the Sites, interruptions in telecommunications connections to the Sites, or viruses that may infect your computer equipment or other property, whether caused in whole or in part by negligence, acts of God, telecommunications failure, theft, or destruction of, or unauthorized access to the Sites or the Content. This limitation of liability may be different in connection with specific products and services offered by us. Some states do not allow the limitation of liability, so the foregoing limitation may not apply to you. 10. INDEMNIFICATION You agree to defend and indemnify us, our affiliates, employees, and officers of each, from and against any and all third-party claims, debts, losses, liabilities, demands, obligations, actions, and causes of action, alleged claims or litigation, damages, judgments, judgments for damages, fines, penalties, expenses, and costs (including, but not limited to, reasonable attorneys’ fees) caused by, arising out of, or resulting from your use of the Sites or the Content in a manner not expressly authorized by these Terms or that violates these Terms, any law, or the rights of a third party. 11. DISPUTE RESOLUTION: MANDATORY BINDING INDIVIDUAL ARBITRATION AND CLASS AND COLLECTIVE ACTION WAIVER The exclusive means of resolving any claim related to your use of the Sites or these Terms shall be BINDING ARBITRATION. Except as provided below in the case of a Mass Filing, the arbitration will be administered by JAMS under the JAMS Streamlined Arbitration Rules & Procedures. If you are a consumer, as defined by JAMS in its Consumer Minimum Standards, you may request that the arbitration hearing be conducted in the area in which you reside. Otherwise, the hearing (if any) shall take place in Broward County, Florida, United States of America. You agree to first give us an opportunity to resolve any claims by contacting us in writing (the “Claims Notice”). After receipt of a Claims Notice, we may request an individualized video or telephone conference which both parties will personally attend (with counsel, if represented). If we are not able to resolve your claims within sixty (60) days of receiving the Claims Notice, you may seek relief through arbitration, as set forth in this section. You agree that you will not take any legal action, including any demand for arbitration, until after the expiration of this 60-day dispute resolution period. EACH PARTY WAIVES ITS RIGHTS TO GO TO COURT, TO A TRIAL BY JURY, AND TO PARTICIPATE IN A CLASS ACTION, CLASS ARBITRATION, OR OTHER REPRESENTATIVE PROCEEDING WITH RESPECT TO ANY COVERED CLAIM. If, at any time, twenty-five (25) or more claimants (including you) submit demands or seek to file demands for arbitration raising similar claims against us, and such circumstances meet the definition and criteria of Mass Filings (“Mass Filing”) set forth in National Arbitration & Mediation's (“NAM”) Mass Filing Supplemental Dispute Resolution Rules and Procedures (“NAM's Mass Filing Rules,” available at https://www.namadr.com/resources/rules-fees-forms/), you and we agree that JAMS shall not serve as the arbitration administrator and that instead NAM shall administer any such Mass Filing and the NAM Mass Filing Rules in effect at the time such claim is filed shall apply. You agree that throughout this process, the parties' counsel shall meet and confer to discuss modifications to these procedures, including the possibility of procedural consolidation of similar claims for arbitration, based on the particular needs of the Mass Filing. You acknowledge and agree that by electing to participate in a Mass Filing, the adjudication of your dispute might be delayed. You and we agree that each party values the integrity and efficiency of arbitration and wishes to employ the process for the fair resolution of genuine and sincere disputes between the parties. You and we acknowledge and agree to act in good faith to ensure the processes set forth herein are followed. 12. GOVERNING LAW AND JURISDICTION These Terms shall be governed by, and construed in accordance with, the laws of the United States and the State of Florida, without giving effect to conflict of law principles thereof. Subject to Section 11, you hereby consent and submit to personal jurisdiction in the state and federal courts located in Broward County, Florida. 13. COMPLIANCE WITH LAW We provide our Sites in accordance with United States law. By using our Sites or providing us with any information through the Sites, you acknowledge that our Sites are subject to United States law and that other countries and jurisdictions may not provide the same rights or protections as those in the United States or in the country where you reside or are a citizen. Persons who access these Sites do so on their own initiative and are responsible for compliance with applicable local laws and regulations. By downloading software or other material from the Sites, you represent and warrant that you are able to do so in full compliance with the laws of the United States and your resident country, including any applicable export controls. 14. GENERAL INFORMATION Except for any Additional Terms that apply, this is the entire understanding between you and us regarding the use of the Sites and supersedes all prior and contemporaneous agreements and understandings between you and us regarding this subject matter. If any provision of these Terms is held to be invalid or unenforceable, it will not affect the validity or enforceability of any other provision hereof. The failure of the Company to exercise or enforce any right or provision of these Terms shall not constitute a waiver of such right or provision. 15. CONTACT INFORMATION If you have questions regarding these Terms of Use, you can contact us by email at info@orangebrookfl.com , by phone at 954.989.4772, or by postal mail at 3318 Orange Street, Hollywood, FL 33021."
    },
    {
      "url": "https://www.orangebrook.com/about-us/",
      "text": "About Us - Orangebrook Golf & Country Club - West Skip to primary navigation Skip to main content Orangebrook Golf & Country Club - West Facebook Tee Times Member Tee Times Home Tee Times Public Tee Times Member Tee Times Course About Us Rates Scorecards Photo Gallery Lessons Tips for Playing Course Managers Events Restaurant Contact Us Contact Us Join E-Club About Us Orangebrook Golf & Country Club Orangebrook Golf & Country Club is a historic 36-hole championship golf course located in the heart of Hollywood, Florida. Originally built as an 18-hole facility in 1933, a second 18 holes were added in 1959. Orangebrook plays host to the Women’s International 4-Ball golf tournament, which is the longest-running women’s amateur event held at one location in the United States. Past champions include Babe Zaharias, Peggy Kirk Bell and Louise Suggs. Orangebrook has also played host to the Men’s Amateur 4-Ball golf tournament, which in 1960 was won by Jack Nicklaus and Deane Beman. Orangebrook Golf & Country Club 400 Entrada Drive Hollywood, FL 33021 Phone: (954) 967-4653 Fax: (954) 967-4660 Join the team Page Footer Contact Us Address : 400 Entrada Drive Hollywood, FL 33021 Email : ira@jcdsportsgroup.com Phone : (954) 967-4653 Join E-Club Copyright © 2025 Orangebrook Golf & Country Club – West All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.orangebrook.com/",
      "text": "Home - Orangebrook Golf & Country Club - West Skip to primary navigation Skip to main content Orangebrook Golf & Country Club - West Facebook Tee Times Member Tee Times Home Tee Times Public Tee Times Member Tee Times Course About Us Rates Scorecards Photo Gallery Lessons Tips for Playing Course Managers Events Restaurant Contact Us Contact Us Join E-Club WELCOME TO Orangebrook Golf & Country Club BOOK NOW A challenging and beautiful layout! Orangebrook Golf & Country Club is a historic, 36-hole championship golf course located in the heart of Hollywood, Florida. Originally built as an 18-hole facility in 1933, a second 18 hole golf course was added in 1959. The West Course has larger greens and a forward set of tees, which makes it easier for beginners. The course is identified by its solid pin flags and granite tee signs. The East Course has smaller greens, which present more of a challenge to golfers of all skill levels, and is labeled by its checkered pin flags and plain tee signs. Book A Tee Time Book your next round at Orangebrook today! BOOK NOW CURRENT RATEs View our current rates for the 2025 season! VIEW RATES E-Club Sign up for exclusive club news and offers! SIGN UP WHAT GUESTS SAY Loved the play at your own pace, well maintained fairways, and greens are fast. Great views and price is very reasonable. – Google Reviewer Upcoming Events There are no upcoming events. RESTAURANT Feeling hungry? Stop by our full service bar and grille after your next round! Dining Menu Book your next round AT ORANGEBROOK BOOK NOW Page Footer Contact Us Address : 400 Entrada Drive Hollywood, FL 33021 Email : ira@jcdsportsgroup.com Phone : (954) 967-4653 Join E-Club Copyright © 2025 Orangebrook Golf & Country Club – West All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/6661-orangebrook-west/search",
      "text": "Orangebrook - West Tee Times - Hollywood FL Log In / Sign Up Hot Deals Courses Near Me Destinations Best Courses Rewards Join GolfPass Gift Cards Search Hot Deals Near Me Off Sort Distance Time Price Golfers Holes Facility Type Reset Filters Top Pick Orangebrook - West 400 Entrada Dr , Hollywood , Florida , 33021 Holes 18 Par 71 Length 6481 yards Slope 121 Rating 70.7 Orangebrook Golf & Country Club\u0014 West Course is one half of a historic, 36-hole, championship golf facility located in the heart of Hollywood, Florida. Tee times at this city-owned layout are among the most affordable you\u0019 ll find anywhere between Fort Lauderdale and Miami. For decades top women amateur golfers from across the country came to the club to play the Women\u0019 s International 4-Ball Golf Tournament at the club\u0019 s 1933-vintage Orangebook\u0014 East Course. Jack Nicklaus was even part of a winning team at a men's amateur tournament held at the facility. Orangebrook Golf & Country Club\u0014 West Course opened in 1959. The playing field is wide open and flat. It\u0019 s a course well suited for beginners and middle-level players because it provides a straightforward challenge with minimal trouble throughout the round. Four sets of tee markers stretch the par-71 layout from 4,680 yards to 6,626 yards. While you may see water on about half of the holes of Orangebrook Golf & Country Club\u0014 West Course, the hazards aren\u0019 t especially intimidating. The layout's strength is its collection of par 3 holes\u0014 four of the five are at least 195 yards from the tips. Par 5s bookend the round. Eighteen is by far the longest test of the day with OB up the left side and water along the right. The final approach is a challenging shot to a green fronted by water and further defended by bunkers at the back left of the green. Orangebrook Golf & Country Club\u0014 West Course is a very walkable playing field. You may see some wildlife at some point during the round\u0014 the golf grounds are an owl habitat. Practice facilities include a lighted driving range, practice bunker, and putting green. The clubhouse features a golf shop and a snack bar (alcohol is available). Orangebrook Golf & Country Club\u0014 West Course is part of a historic municipal facility in Hollywood that has long been a popular choice for all levels of players looking for an affordable tee time. Read More... Directions Course Details Review Related Facilities Policies Walking allowed: Yes Metal spikes allowed: No Credit cards accepted: VISA, MasterCard, Amex, Discover Welcomed Dress Code: Appropriate golf attire. Rentals/Services Carts: Yes Clubs: Yes Practice/Instruction Driving range: Yes Pitching/chipping area: Yes Putting green: Yes Teaching pro: Yes Read More... View Full Map Directions More Hot Deals Searching next 3 days... × There are no Hot Deals available for the date selected. Fetching more results... Unable to Complete Search We're sorry, there was an error completing your search. Try changing locations, changing the date, expanding your distance, or updating your filters. How About a Mulligan? We’re sorry, there are currently no available tee times for your search. Try changing locations, changing the date, expanding your distance, or updating your filters. In the cabbage. There are no Daily Deal options on this date. Please check back again for another shot at Daily Deals. Check Next Day View All Nearby Tee Times Search Hot Deals Other Golfing Options Nearby Get your golf on Information About Us Careers Contact Us Help Gift Cards Rewards Premier Card Ad Choices Privacy Policy Cookie Preferences CA Notice Terms of Service - New Resources Destinations Best Tee Time Deals Weekend Tee Times Course Directory Private Club Directory GolfNow Reviews Mobile Apps Promotions Blog Simulators Private Clubs Featured Courses GolfNow Spotlights Club Champion Fittings Businesses Partner Support Golf Facilities GolfNow for Courses List My Facility on GolfNow Other Partnership Requests Partner Brands NBC Sports Golf Channel GolfPass GolfNow Compete TeeOff SportsEngine HQ SportsEngine Motion Don't miss out on great golf deals, special offers and more! Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Stay Connected Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Subscribe Our Mobile Apps © Copyright 2025 GolfNow. All rights reserved."
    }
  ]
}