{
  "fuentes": [
    {
      "url": "https://www.orangecountyfl.net/DesktopModules/OCFL/CountyParks/OCPark.aspx?m=dtlvw&d=118",
      "email": "greenplace@ocfl.net"
    },
    {
      "url": "https://simplywall.st/stocks/us/tech/nasdaq-trmb/trimble/management",
      "email": "peter@google.com"
    },
    {
      "url": "https://www.orangecountyfl.net/BoardofCommissioners/District3Commissioner.aspx",
      "email": "district3@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/BoardofCommissioners/District3Commissioner.aspx",
      "email": "lauren.rosado@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/BoardofCommissioners/District3Commissioner.aspx",
      "email": "district3@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/BoardofCommissioners/District3Commissioner.aspx",
      "email": "renata.oliveira@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/BoardofCommissioners/District3Commissioner.aspx",
      "email": "veronica.florescarrera@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/cultureparks/parks.aspx?m=dtlvw&d=40",
      "email": "parks@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/CultureParks/ParksFAQ.aspx",
      "email": "info@cypressgroveestatehouse.com"
    },
    {
      "url": "https://www.orangecountyfl.net/CultureParks/ParksFAQ.aspx",
      "email": "parks@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/DesktopModules/OCFL/CountyParks/OCPark.aspx?m=dtlvw&d=12",
      "email": "info@cypressgroveestatehouse.com"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=351&sn=ga",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.orangecountyfl.net/EmploymentVolunteerism/JobOpenings.aspx",
      "email": "online-apps@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/EmploymentVolunteerism/JobOpenings.aspx",
      "email": "online-apps@ocfl.net"
    },
    {
      "url": "https://trimblehollowpress.com/contact/",
      "email": "trimblehollowpress@yahoo.com"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "alan.marshall@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "animalservices@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "businessdevelopment@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "epd@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "economicdevelopment@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "environmental.compliance@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "firerescue1@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "growthmanagement@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "honorguard@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "housing@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "lauren.buckner@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "medical.examiner@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "occdrecords@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "ocneighborhoods@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "ocoem@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "pio@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "permittingservices@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "planning@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "procurement@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "publicrecordrequest@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "roadcrew@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "solid.waste@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "utilities.devengineering@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "utilities.information@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "water.division@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "water.reclamation@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "benefits@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "businessdevelopment@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "ccd@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "info@occc.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "parks@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "planning@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "records@ocfl.net"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "email": "roadcrew@ocfl.net"
    },
    {
      "url": "https://trimbleeng.com/who-we-are/",
      "email": "d.simanowitz@trimbleeng.com"
    }
  ],
  "mails": [
    "alan.marshall@ocfl.net",
    "animalservices@ocfl.net",
    "app-promo-phones@2x.png",
    "benefits@ocfl.net",
    "businessdevelopment@ocfl.net",
    "ccd@ocfl.net",
    "d.simanowitz@trimbleeng.com",
    "district3@ocfl.net",
    "economicdevelopment@ocfl.net",
    "environmental.compliance@ocfl.net",
    "epd@ocfl.net",
    "firerescue1@ocfl.net",
    "greenplace@ocfl.net",
    "growthmanagement@ocfl.net",
    "honorguard@ocfl.net",
    "housing@ocfl.net",
    "info@cypressgroveestatehouse.com",
    "info@occc.net",
    "lauren.buckner@ocfl.net",
    "lauren.rosado@ocfl.net",
    "medical.examiner@ocfl.net",
    "occdrecords@ocfl.net",
    "ocneighborhoods@ocfl.net",
    "ocoem@ocfl.net",
    "online-apps@ocfl.net",
    "parks@ocfl.net",
    "permittingservices@ocfl.net",
    "peter@google.com",
    "pio@ocfl.net",
    "planning@ocfl.net",
    "procurement@ocfl.net",
    "publicrecordrequest@ocfl.net",
    "records@ocfl.net",
    "renata.oliveira@ocfl.net",
    "roadcrew@ocfl.net",
    "solid.waste@ocfl.net",
    "trimblehollowpress@yahoo.com",
    "utilities.devengineering@ocfl.net",
    "utilities.information@ocfl.net",
    "veronica.florescarrera@ocfl.net",
    "water.division@ocfl.net",
    "water.reclamation@ocfl.net"
  ],
  "nombre_sitio": "orangecountyfl.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.orangecountyfl.net/DesktopModules/OCFL/CountyParks/OCPark.aspx?m=dtlvw&d=118",
      "text": "Parks - Isle of Pine Preserve View of Lake Mary Jane. Isle of Pine Preserve Hours of Operation: Sunrise to sunset Phone Number: (407) 836-1400 Address: 14032  Lacebark Pine Rd. Orlando, FL 32832 Acreage: 534.49 Location: Get detailed directions Points of Interest: Head over to the new Green PLACE website to learn more about the program and see what Orange County has to offer. The Isle of Pine Preserve is located in southeast Orange County off of Lake Mary Jane Road and is managed by the Orange County Environmental Protection Division. Hike or horseback ride on miles of trails through some of Florida’s unique habitats and there are lots of opportunities to view wildlife. Picnic on the shoreline of Lake Mary Jane or in the Isle of Pine that inspired the name for the property. The property is awash with blooming wildflowers in the spring and summer. No bicycles allowed. For more information on this or other Green PLACE properties, contact: Environmental Protection Division 3165 McCrory Pl. Orlando, FL 32803 Phone 407-836-1400 Email GreenPLACE@ocfl.net Green PLACE website"
    },
    {
      "url": "https://simplywall.st/stocks/us/tech/nasdaq-trmb/trimble/management",
      "text": "Trimble Inc. (TRMB) Leadership & Management Team Analysis - Simply Wall St Dashboard Portfolios Watchlist Community Discover Screener NOT FOR DISTRIBUTION Trimble Inc. NasdaqGS:TRMB Stock Report Market Cap: US$19.1b Portfolio Add to Portfolio Holding More actions … Portfolio Add to Portfolio Holding … Company Overview 1 Valuation 2 Future Growth 3 Past Performance 4 Financial Health 5 Dividend 6 Management 7 Ownership Other Information Stock Community View Dividend Trimble Management Management criteria checks 2/4 Trimble's CEO is Rob Painter, appointed in Jan 2020,  has a tenure of 5.67 years.  total yearly compensation is $18.94M, comprised of 5% salary and 95% bonuses, including company stock and options.  directly owns 0.13% of the company’s shares, worth $25.48M. The average tenure of the management team and the board of directors is 4.9 years and 5.7 years respectively. Key information Rob Painter Chief executive officer US$18.9m Total compensation CEO salary percentage 5.02% CEO tenure 5.7yrs CEO ownership 0.1% Management average tenure 4.9yrs Board average tenure 5.7yrs Recent management updates Trimble Inc., Annual General Meeting, Jun 17, 2025 May 02 CEO, President & Director exercised options to buy US$1.4m worth of stock. Apr 18 Trimble Inc., Annual General Meeting, May 30, 2024 Apr 17 Trimble Inc. Announces Resignation of Ann Fandozz from Board of Directors Feb 16 Trimble Inc. Appoints Kara Sprague and Ron Nersesian to Board of Directors Jan 31 Trimble Inc. Announces Executive Changes Nov 03 Show all updates Recent updates Is Now The Time To Look At Buying Trimble Inc. (NASDAQ:TRMB)? Sep 09 Now 21% undervalued Sep 02 Trimble Launches Freight Marketplace in North America with Procter & Gamble as First Shipper Customer Aug 27 Trimble and Hyundai Construction Equipment Announce Trimble Ready Option for New Line of HD130A Dozers Aug 19 + 1 more update Price target increased by 8.9% to US$94.75 Aug 07 New minor risk - Profit margin trend Aug 06 Trimble Inc. Provides Earnings Guidance for the Third Quarter of 2025 and Revises Earnings Guidance for the Full Year of 2025 Aug 06 Is Trimble (NASDAQ:TRMB) A Risky Investment? Aug 05 A Look At The Intrinsic Value Of Trimble Inc. (NASDAQ:TRMB) Jul 07 Trimble's Restructuring: Subscription Model And Divestitures Unlock Long-Term Potential Jul 04 Capital Allocation Trends At Trimble (NASDAQ:TRMB) Aren't Ideal Jun 24 Trimble Introduces Trimble Materials to Enable Construction Material Procurement and Management May 20 Trimble Launches Forestry One to Connect and Streamline Forestry Operations May 15 Trimble Inc. Provides Earnings Guidance for the Second Quarter of 2025 and Maintains Earnings Guidance for the Full Year 2025 May 07 Trimble Inc., Annual General Meeting, Jun 17, 2025 May 02 Trimble Expands Field-To-Office Connectivity for Heavy Civil Contractors Apr 24 Trimble Announces Availability of Its Trimble Siteworks Machine Guidance Module for Tilt Buckets Apr 08 + 1 more update Trimble Adds New Api Capabilities to Accubid Anywhere Estimate Application Apr 02 Trimble: Authorized $1 Billion Buyback Sets The Tone For 2025 Mar 18 Trimble Inc. Expands Connected Workflows in Tekla Structures 2025 Mar 12 + 1 more update Trimble Inc. announced delayed annual 10-K filing Mar 06 Trimble's (NASDAQ:TRMB) Profits Appear To Have Quality Issues Feb 26 Trimble®? Announces New Visualization and Interoperability Capabilities in Its Latest Software Release for Sketchup®? Feb 26 Trimble Inc.: ARR Growth Looks Strong, But Total Revenue Expected To Decline Into 2025 Feb 25 Trimble Inc. Provides Earnings Guidance for the First Quarter and Full Year of 2025 Feb 20 Full year 2024 earnings: Revenues exceed analysts expectations while EPS lags behind Feb 19 Trimble Inc. (NasdaqGS:TRMB) announces an Equity Buyback for $1,000 million worth of its shares. Feb 19 Platform Science, Inc. completed the acquisition of 100% interest in Global transportation business units of Trimble Inc. (NasdaqGS:TRMB). Feb 10 Trimble (NASDAQ:TRMB) Seems To Use Debt Quite Sensibly Feb 09 Trimble: Anticipating Double-Digits Growth In ARR; Initiating With 'Buy' Nov 28 Trimble Receives Expected Delisting and Deficiency Notice from Nasdaq Due to Non-Compliance with Nasdaq Listing Rule 5250(c)(1) Nov 14 Trimble Advances Construction Workflow Connectivity with New Self-Service Integration Tools Nov 12 Trimble Inc. announced delayed 10-Q filing Nov 08 Price target increased by 11% to US$76.17 Nov 07 Third quarter 2024 earnings: Revenues exceed analysts expectations while EPS lags behind Nov 07 Trimble Introduces Siteworks Machine Guidance Module for Compact Track Loaders Nov 07 Trimble Inc. (NASDAQ:TRMB) Shares Could Be 21% Below Their Intrinsic Value Estimate Nov 07 Trimble Inc. Provides Earnings Guidance for the Fourth Quarter and Full Year of 2024 Nov 07 Trimble Unveils Transporeon Visibility with Seamless TMS Integration Sep 17 Platform Science, Inc. entered into a definitive agreement to acquire Global transportation business units of Trimble Inc. (NasdaqGS:TRMB). Sep 16 Trimble Receives Expected Notification of Deficiency from Nasdaq Related to Delayed Filing of Quarterly Report on Form 10-Q Aug 22 Connect & Scale And AI Integration Promise Growth Amid Financial And Geopolitical Risks Aug 22 Trimble's Connect & Scale strategy and focus on AI in AECO and transportation are set to boost recurring revenue and differentiate its offerings. Trimble: Undervalued Amid Strong Q2 Results And FY25 Estimates Aug 13 Trimble Inc. announced delayed 10-Q filing Aug 08 Trimble Inc. Provides Earnings Guidance for the Third Quarter and Full Year of 2024 Aug 06 Trimble Launches End-To-End Asset Lifecycle Management Software Suite Jun 29 Trimble Releases Top-Tier R980 GNSS System Delivering Greater Work Productivity for Geospatial Professionals Jun 19 Trimble Receives Expects Notification of Deficiency from Nasdaq Related to Delayed Filing of Quarterly Report on Form 10-Q May 19 Trimble Inc. (NasdaqGS:TRMB) acquired Flashtract, Inc. May 09 Trimble: On Position Again, Supported By Some Real Green Shoots May 08 Trimble Inc. Provides Earnings Guidance for the Second Quarter and Full Year of 2024 May 06 New minor risk - Earnings quality May 04 CEO, President & Director exercised options to buy US$1.4m worth of stock. Apr 18 Trimble Inc., Annual General Meeting, May 30, 2024 Apr 17 Now 21% undervalued Apr 04 Now 20% undervalued Mar 15 Trimble Announces Introduction of 2024 Versions of Its Tekla Software for Constructible Building Information Modeling, Structural Engineering and Steel Fabrication Management Mar 13 Trimble Introduces Roadworks Paving Control Platform for Mills and Cold Planers Feb 20 Trimble Inc. Announces Resignation of Ann Fandozz from Board of Directors Feb 16 Full year 2023 earnings: EPS misses analyst expectations Feb 14 Trimble Inc. Provides Earnings Guidance for the First Quarter and Full Year 2024 Feb 12 Trimble: Growth At A Very Reasonable Price Feb 05 Trimble Inc. to Report Q4, 2023 Results on Feb 12, 2024 Feb 01 Trimble Inc. Appoints Kara Sprague and Ron Nersesian to Board of Directors Jan 31 New minor risk - Insider selling Jan 17 JANA Partners Urges Trimble to Focus on Organic Growth Dec 13 Trimble Inc. Announces Executive Changes Nov 03 New minor risk - Earnings quality Nov 02 Price target decreased by 9.1% to US$58.04 Nov 02 Trimble Inc. Provides Earnings Guidance for the Fourth Quarter of 2023 and Full-Year 2023 Nov 02 + 1 more update Third quarter 2023 earnings: EPS exceeds analyst expectations while revenues lag behind Nov 02 Price target increased by 7.2% to US$64.38 Sep 29 Trimble Launches Cloud-Based Appian Daily Planner to Simplify Complex, Multi-Stop Routing Sep 20 Consensus EPS estimates fall by 23% Aug 11 Trimble Announces the Release of Its Flexible API for the Trimble Agriculture Cloud Aug 09 Trimble Inc. Provides Earnings Guidance for the Third Quarter and Full Year of 2023 Aug 04 CEO Compensation Analysis How has Rob Painter's remuneration changed compared to Trimble's earnings? Date Total Compensation Salary Company Earnings Jul 04 2025 n/a n/a US$287m Apr 04 2025 n/a n/a US$2b Jan 03 2025 US$19m US$950k US$2b Sep 27 2024 n/a n/a US$1b Jun 28 2024 n/a n/a US$2b Mar 29 2024 n/a n/a US$240m Dec 29 2023 US$15m US$950k US$311m Sep 29 2023 n/a n/a US$334m Jun 30 2023 n/a n/a US$345m Mar 31 2023 n/a n/a US$468m Dec 30 2022 US$16m US$938k US$450m Sep 30 2022 n/a n/a US$479m Jul 01 2022 n/a n/a US$518m Apr 01 2022 n/a n/a US$489m Dec 31 2021 US$14m US$883k US$493m Oct 01 2021 n/a n/a US$558m Jul 02 2021 n/a n/a US$518m Apr 02 2021 n/a n/a US$443m Jan 01 2021 US$13m US$871k US$390m Oct 02 2020 n/a n/a US$489m Jul 03 2020 n/a n/a US$482m Apr 03 2020 n/a n/a US$514m Jan 03 2020 US$3m US$535k US$514m Sep 27 2019 n/a n/a US$322m Jun 28 2019 n/a n/a US$317m Mar 29 2019 n/a n/a US$287m Dec 28 2018 US$3m US$482k US$283m Compensation vs Market : Rob's total compensation ($USD18.94M) is above average for companies of similar size in the US market ($USD13.61M). Compensation vs Earnings : Rob's compensation has increased by more than 20% whilst company earnings have fallen more than 20% in the past year. CEO Rob Painter (53 yo) 5.7yrs Tenure US$18,938,871 Compensation Mr. Robert G. Painter, also known as Rob, has been Chief Executive Officer, President and Director of Trimble Inc. (also known as Trimble Outdoors) since January 4, 2020. Mr. Painter serves as Director at ... Show more Leadership Team Name Position Tenure Compensation Ownership Robert Painter CEO, President & Director 5.7yrs US$18.94m 0.13% $ 25.5m Phillip Sawarynski Senior VP & CFO 1.1yrs US$4.56m 0.013% $ 2.4m Peter Large Senior Vice President of Strategy 4.2yrs US$2.07m 0.0069% $ 1.3m Ronald Bisio Senior Vice President of Field Systems 6.6yrs US$4.57m 0.037% $ 7.1m Mark Schwartz Senior Vice President of AECO Software 4.9yrs US$4.72m 0.0088% $ 1.7m Leah Lambertson Senior VP of Operations & Head of Sustainability 8.5yrs no data no data Julie Shepard VP of Finance & Chief Accounting Officer 8.3yrs US$968.58k 0.024% $ 4.6m Jim Palermo Chief Information Officer less than a year no data no data Michael Leyba Director of Investor Relations no data no data no data Jennifer Allison VP, Company Secretary & General Counsel 2.4yrs no data 0.0012% $ 230.5k Jaime Nielsen Senior VP & Chief People Officer 4.9yrs no data no data Garland Jackson Senior VP & GM of Connected Asset Health Solutions - Trimble Transportation 6.7yrs no data no data Show more 4.9yrs Average Tenure 53yo Average Age Experienced Management : TRMB's management team is considered experienced (4.9 years average tenure). Board Members Name Position Tenure Compensation Ownership Robert Painter CEO, President & Director 5.7yrs US$18.94m 0.13% $ 25.5m E. Ekholm Independent Chairman 5.7yrs US$372.47k 0.026% $ 4.9m Ronald Nersesian Independent Director 1.6yrs US$468.42k 0.0052% $ 986.9k Mark Peek Lead Independent Director 15.5yrs US$372.47k 0.039% $ 7.4m Kaigham Gabriel Independent Director 10.7yrs US$372.47k 0.0071% $ 1.4m Thomas Sweet Independent Director 3.7yrs US$372.47k 0.0080% $ 1.5m Johan Wibergh Independent Director 7.6yrs US$372.47k 0.015% $ 2.9m Meaghan Lloyd Independent Director 9.7yrs US$372.47k 0.022% $ 4.3m Kara Sprague Independent Director 1.6yrs US$468.42k 0.0029% $ 544.9k James Dalton Independent Director 4.9yrs US$372.47k 0.0058% $ 1.1m Show more 5.7yrs Average Tenure 63.5yo Average Age Experienced Board : TRMB's board of directors are considered experienced (5.7 years average tenure). View Ownership Company Analysis and Financial Data Status Data Last Updated (UTC time) Company Analysis 2025/09/10 04:02 End of Day Share Price 2025/09/10 00:00 Earnings 2025/07/04 Annual Earnings 2025/01/03 Data Sources The data used in our company analysis is from S&P Global Market Intelligence LLC . The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available. Package Data Timeframe Example US Source * Company Financials 10 years Income statement Cash flow statement Balance sheet SEC Form 10-K SEC Form 10-Q Analyst Consensus Estimates +3 years Forecast financials Analyst price targets Analyst Research Reports Blue Matrix Market Prices 30 years Stock prices Dividends, Splits and Actions ICE Market Data SEC Form S-1 Ownership 10 years Top shareholders Insider trading SEC Form 4 SEC Form 13D Management 10 years Leadership team Board of directors SEC Form 10-K SEC Form DEF 14A Key Developments 10 years Company announcements SEC Form 8-K * Example for US securities, for non-US equivalent regulatory forms and sources are used. Unless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more . Analysis Model and Snowflake Details of the analysis model used to generate this report is available on our Github page , we also have guides on how to use our reports and tutorials on Youtube . Learn about the world class team who designed and built the Simply Wall St analysis model. Industry and Sector Metrics Our industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github . Analyst Sources Trimble Inc. is covered by 41 analysts. 10 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day. Analyst Institution Robert Mason Baird Gal Munda Berenberg Ryan Connors Boenning & Scattergood, Inc. Show 38 more analysts Level 5, 320 Pitt Street, Sydney Financial Data provided by S&P Global Market Intelligence LLC, analysis provided by Simply Wall Street Pty Ltd. Copyright © 2025 , S&P Global Market Intelligence LLC. All rights reserved. View Data Sources Markets US: NYSE & NASDAQ UK: FTSE Australia: ASX India: NIFTY Canada: TSX South Africa: JSE Japan: NIKKEI South Korea: KOSPI Germany: DAX Investing Ideas Undervalued Companies Dividend Powerhouses Insider Buying Nuclear Energy Autonomous Vehicles Artificial Intelligence Crypto and Blockchain Cybersecurity More ideas Stock Communities AstraZeneca HSBC Holdings Shell Unilever Diageo Rio Tinto Group RELX BP Barclays Features & Tools Portfolio Tracker Stock Screener & Alerts Narratives & Fair Values Dividend Calculator News & Discovery Latest Stock News Global Market Insights Investing Ideas Community Narratives What's New Simply Wall St Plans & Pricing About Us Our People Contact Us Careers Help Center Learn Stock Investing Affiliate Program Business & Enterprise Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. © 2025 Simply Wall Street Pty Ltd, US Design Patent #29/544/281, Community and European Design Registration #2845206 Terms and Conditions Privacy Policy Financial Services Guide Logos provided by Clearbit"
    },
    {
      "url": "https://www.orangecountyfl.net/BoardofCommissioners/District3Commissioner.aspx",
      "text": "District 3 Commissioner Skip to main content Site Map | A To Z Index | Español Payment Center Follow Us On Search our site Residents Visitors Businesses Employees About Us Site Map A To Z Index Español Payment Center Browse Services Search our site Browse Services RESIDENTS Resident Home Page Animals & Pets Area Agencies Arts & Culture Community & Family Services Consumer Protection County Commission (BCC) Emergency & Safety Employment & Volunteerism Environment Health Services Get Involved Neighborhoods & Housing Open Government Orange County Library System Orange TV Parks Payment Center Permits & Licenses Sustainability Traffic & Transportation Visit Orlando Volunteer Opportunities Water, Garbage & Recycling VISITORS Visitors Home Page Arts and Culture Consumer Protection Convention Center County Commission (BCC) Emergency & Safety Environment Orange County Library System Orange County Regional History Center Parks Visit Orlando BUSINESSES Businesses Home Page Business Resources Area Agencies Central Florida Research Park Convention Center County Commission (BCC) Economic Development Employment & Volunteerism Environment Health Services National Entrepreneur Center Open Government Payment Center Permits & Licenses Planning & Development Sustainability Team Orlando (US military simulation) Traffic & Transportation UCF Business Incubation Program Vendor Services Water, Garbage and Recycling EMPLOYEES Essential Employee Info: myOCHR Upload Your Benefits Documents Verification of Employment Career Opportunities Fire Rescue Careers Corrections Careers Job Descriptions New Hire Hub Open Enrollment Employee Benefits Retirement Benefits myOCWellness OC MINDMATTERS ABOUT US You are here: Board of Commissioners | District 3 Commissioner Mayra Uribe District 3 Commissioner Board of County Commissioners Newsletter Sign-Up District 3 Events District 3 Map Mayra Uribe was elected to the Board of Orange County Commission District 3 in 2018 and has since been re-elected in 2020 and 2024. She is an Orlando native, born and raised in the district she represents. Mayra is of Colombian and Argentinean descent and celebrates the diversity in herself and in our community. Mayra is a business owner who understands the concerns of those calling Central Florida home. While the economy has strengthened for some, not everyone feels that the County has done enough to address their needs. She serves on several boards, including MetroPlan Orlando, East Central Florida Regional Planning Council, Affordable Housing Advisory Board, Community Action Board and The Transportation Disadvantaged Local Coordinating Board. She motivates her office to focus on consistency and accuracy through believing no issue is too small if it affects her constituents. She is a fierce and tireless servant of the people in her district. Read more Prior to running for Commissioner, Mayra was an aide to U.S. Senator Bill Nelson. There she helped the citizens of Florida deal with concerns regarding the military, FEMA, immigration, transportation and labor matters. That experience hardened her resolve to serve her community. All her life she has been a champion of civic and moral causes. She lends her efforts to several nonprofit groups, such as Catholic Charities, Christian Service Center, Boot Camp for New Dads and Healthy Start. For nearly a decade, Mayra co-hosted The Kevin Sutton Show on ESPN 580 Orlando and iHeart Radio. She was able to reach a wide audience, providing a woman’s point of view in sports and entertainment. Mayra is the proud wife of Kevin Sutton, director of Boot Camp for Dads, a fatherhood nonprofit program, and is also mother to 21-year-old daughter, Faith, and 8-year-old son, Lincoln. Being the matriarch of her family has strengthened her devotion to improving the lives of those in our community. Mayra’s family, faith and focus on our community’s future gives her the resolve and encouragement to make a difference in all of our lives. Stay Connected Sign up for the Orange County District 3 Newsletter and Newsroom Follow the commissioner on Facebook . View District 3 calendar of events. Maps District 3 Traffic and Transportation Transportation Projects District 3 Staff Veronica Flores Constituent Aide 407-836-5140 Renata Oliveira Aide 407-836-5320 Lauren Rosado Aide 407-836-5320 Videos Contact Us Orange County District 3 201 S. Rosalind Ave., 5th Floor Orlando, FL 32801 Email: District3@ocfl.net Phone: 407-836-5140 All e-mail sent to this address becomes part of Orange County public record. Comments received by our e-mail subsystem can be read by anyone who requests that privilege. In compliance with \"Government in the Sunshine\" laws, Orange County Government must make available, at request, any and all information not deemed a threat to the security of law enforcement agencies and personnel. County Commission (BCC) Open Government Media Center Animals & Pets Convention Center Community & Family Services Culture & Parks Economic Development Emergency & Safety Employment & Volunteerism Environment Health Services Jail & Inmate Services Medical Examiner Neighborhoods & Housing Permits & Licenses Planning & Development Traffic & Transportation Vendor Services Water, Garbage & Recycling Zoning © 2025 Orange County Government, Florida Privacy & Terms · Accessibility · Title VI · Browse Contacts · 311 Help & Info Follow Us On opens in a new tab pdf opens in a new tab video opens in a new tab"
    },
    {
      "url": "https://www.orangecountyfl.net/cultureparks/parks.aspx?m=dtlvw&d=40",
      "text": "Parks - Trimble Park Skip to main content Site Map | A To Z Index | Español Payment Center Follow Us On Search our site Residents Visitors Businesses Employees About Us Site Map A To Z Index Español Payment Center Browse Services Search our site Browse Services RESIDENTS Resident Home Page Animals & Pets Area Agencies Arts & Culture Community & Family Services Consumer Protection County Commission (BCC) Emergency & Safety Employment & Volunteerism Environment Health Services Get Involved Neighborhoods & Housing Open Government Orange County Library System Orange TV Parks Payment Center Permits & Licenses Sustainability Traffic & Transportation Visit Orlando Volunteer Opportunities Water, Garbage & Recycling VISITORS Visitors Home Page Arts and Culture Consumer Protection Convention Center County Commission (BCC) Emergency & Safety Environment Orange County Library System Orange County Regional History Center Parks Visit Orlando BUSINESSES Businesses Home Page Business Resources Area Agencies Central Florida Research Park Convention Center County Commission (BCC) Economic Development Employment & Volunteerism Environment Health Services National Entrepreneur Center Open Government Payment Center Permits & Licenses Planning & Development Sustainability Team Orlando (US military simulation) Traffic & Transportation UCF Business Incubation Program Vendor Services Water, Garbage and Recycling EMPLOYEES Essential Employee Info: myOCHR Upload Your Benefits Documents Verification of Employment Career Opportunities Fire Rescue Careers Corrections Careers Job Descriptions New Hire Hub Open Enrollment Employee Benefits Retirement Benefits myOCWellness OC MINDMATTERS ABOUT US You are here: Culture & Parks | Parks At A Glance All Parks Athletics for Adults Athletics for Youth Bird and Critter Search Boat Ramp Ordinance Camping Guide Camping in Orange County E-newsletter Sign-Up Group Visitation Guidelines Horizon West Survey Horizon West Trails Study Junior Magic Goals / Philosophy / Coaches Junior Magic Rulebook Lifetime Entrance Pass Master Plan - Parks Master Plan - Trails Metal Detecting Moss Park Orienteering Maps: Beginner & Intermediate Parent Manual for Youth Programs Parks Fee Schedule Pavilion & Room Rentals Questions & Comments Form Registration Release Donate and Volunteer Adopt a Park Donate STARS Volunteering Volunteer Coaching Parks, natural fun starts in parks Our Parks Story Orange County Parks Map Camping in Orange County Headline 1: Parks and Recreation is HIRING! See job opportunities and apply online: Jobs Dashboard page. Headline 2: Headline 3: Headline 4: Headline 5: Headline 6: Headline 7: Headline 8: Headline 9: Headline 10: Headlines << Return to list Get away for a weekend of camping at Trimble Park or one of our six beautiful camping parks. Trimble Park Hours of Operation: Summer: 8 a.m.- 8 p.m.; Winter: 8 a.m.- 6 p.m.; Monday - Sunday Phone Number: (407) 254-1982 Address: 5802  Trimble Park RD Mt. Dora, FL 32757 Acreage: 63.92 Location: Get detailed directions Points of Interest: To make a reservation, please call the park directly at 407-254-1982; leave a detailed message if you reach voicemail. Tent and RV camping are available at this park. Recreational vehicles cannot exceed a maximum length of 35 feet or maximum height of 12 feet. To reserve an individual campsite, please visit Camping & Environmental Education and click \"Online Camping Reservations.\" Trimble Park map Boat Ramp Information Public Boat Ramp Commercial Operations Guideline Public Boat Ramp Ordinance No. 2020-11 Click here to watch a video about all this park has to offer! Contact Us Orange County Parks and Recreation 4801 W. Colonial Dr. Orlando, FL 32808 To reach a specific park : click on the A–Z tab and select the park or facility you are interested in for the phone number. Email: parks@ocfl.net Parks Administration: 407-836-6200 Parks' Events InfoLine: 407-836-6280 Facebook Events List: Orange County, Florida Twitter: @OrangeCoParksFL County Commission (BCC) Open Government Media Center Animals & Pets Convention Center Community & Family Services Culture & Parks Economic Development Emergency & Safety Employment & Volunteerism Environment Health Services Jail & Inmate Services Medical Examiner Neighborhoods & Housing Permits & Licenses Planning & Development Traffic & Transportation Vendor Services Water, Garbage & Recycling Zoning © 2025 Orange County Government, Florida Privacy & Terms · Accessibility · Title VI · Browse Contacts · 311 Help & Info Follow Us On opens in a new tab pdf opens in a new tab video opens in a new tab"
    },
    {
      "url": "https://www.orangecountyfl.net/CultureParks/ParksFAQ.aspx",
      "text": "Parks FAQ Skip to main content Site Map | A To Z Index | Español Payment Center Follow Us On Search our site Residents Visitors Businesses Employees About Us Site Map A To Z Index Español Payment Center Browse Services Search our site Browse Services RESIDENTS Resident Home Page Animals & Pets Area Agencies Arts & Culture Community & Family Services Consumer Protection County Commission (BCC) Emergency & Safety Employment & Volunteerism Environment Health Services Get Involved Neighborhoods & Housing Open Government Orange County Library System Orange TV Parks Payment Center Permits & Licenses Sustainability Traffic & Transportation Visit Orlando Volunteer Opportunities Water, Garbage & Recycling VISITORS Visitors Home Page Arts and Culture Consumer Protection Convention Center County Commission (BCC) Emergency & Safety Environment Orange County Library System Orange County Regional History Center Parks Visit Orlando BUSINESSES Businesses Home Page Business Resources Area Agencies Central Florida Research Park Convention Center County Commission (BCC) Economic Development Employment & Volunteerism Environment Health Services National Entrepreneur Center Open Government Payment Center Permits & Licenses Planning & Development Sustainability Team Orlando (US military simulation) Traffic & Transportation UCF Business Incubation Program Vendor Services Water, Garbage and Recycling EMPLOYEES Essential Employee Info: myOCHR Upload Your Benefits Documents Verification of Employment Career Opportunities Fire Rescue Careers Corrections Careers Job Descriptions New Hire Hub Open Enrollment Employee Benefits Retirement Benefits myOCWellness OC MINDMATTERS ABOUT US You are here: Culture & Parks | Parks FAQ At A Glance All Parks Athletics for Adults Athletics for Youth Bird and Critter Search Boat Ramp Ordinance Camping Guide Camping in Orange County E-newsletter Sign-Up Group Visitation Guidelines Horizon West Survey Horizon West Trails Study Junior Magic Goals / Philosophy / Coaches Junior Magic Rulebook Lifetime Entrance Pass Master Plan - Parks Master Plan - Trails Metal Detecting Moss Park Orienteering Maps: Beginner & Intermediate Parent Manual for Youth Programs Parks Fee Schedule Pavilion & Room Rentals Questions & Comments Form Registration Release Donate and Volunteer Adopt a Park Donate STARS Volunteering Volunteer Coaching Parks FAQ Frequently-requested information Parks FAQ Frequently-requested information Reserve Cypress Grove Park Estate House To reserve the historic 1925 estate house at Cypress Grove Park, 290 Holden Ave. in Orlando, for a wedding, meeting, reception or special event, contact the management company listed below: Big City Catering, Inc., (407) 749-0792 or email info@CypressGroveEstateHouse.com or visit their website . Reserve A Picnic Pavilion At Any Orange County Park Rentals are a valuable part of Orange County Parks' services. Pavilion rentals are handled at the individual park’s office (25 parks). Rental cost depends on the number of people who will be using it, and there is a refundable cleaning/damage deposit. Meeting Rooms At Parks Meeting rooms are available as rentals in the six Orange County Recreation Centers, as well as meeting rooms and the ballrooms at Marks Street Senior Center and Renaissance Senior Center at South Econ Community Park. Sports Facilities Rentals If you have a league looking for a field to play on, sports fields can be rented through Orange County Parks: Multi-purpose fields at 15 parks Softball fields at four parks Soccer fields at seven parks Indoor gyms at six parks Camping RV and tent camping is offered at five parks. View fees and deposit information Search the list of parks according to amenities Contact Us Orange County Parks and Recreation 4801 W. Colonial Dr. Orlando, FL 32808 To reach a specific park : click on the A–Z tab and select the park or facility you are interested in for the phone number. Email: parks@ocfl.net Phone: (407) 836-6200 Parks' Events InfoLine: (407) 836-6280 Facebook Events List: Orange County, Florida Twitter: @OrangeCoParksFL All e-mail sent to this address becomes part of Orange County public record. Comments received by our e-mail subsystem can be read by anyone who requests that privilege. In compliance with \"Government in the Sunshine\" laws, Orange County Government must make available, at request, any and all information not deemed a threat to the security of law enforcement agencies and personnel. County Commission (BCC) Open Government Media Center Animals & Pets Convention Center Community & Family Services Culture & Parks Economic Development Emergency & Safety Employment & Volunteerism Environment Health Services Jail & Inmate Services Medical Examiner Neighborhoods & Housing Permits & Licenses Planning & Development Traffic & Transportation Vendor Services Water, Garbage & Recycling Zoning © 2025 Orange County Government, Florida Privacy & Terms · Accessibility · Title VI · Browse Contacts · 311 Help & Info Follow Us On opens in a new tab pdf opens in a new tab video opens in a new tab"
    },
    {
      "url": "https://www.orangecountyfl.net/DesktopModules/OCFL/CountyParks/OCPark.aspx?m=dtlvw&d=12",
      "text": "Parks - Cypress Grove Park Hold your wedding or reception, meeting or any other special event at Cypress Grove's newly renovated 1925 estate house. Located on beautiful Lake Jessamine, Cypress Grove Park is sure to make any occasion an extraordinary one. Cypress Grove Park Hours of Operation: Summer 8 a.m. - 8 p.m. / Winter 8 a.m. - 6 p.m., Sunday - Saturday; special events until 11 p.m. Phone Number: (407) 254-6770 Address: 290  Holden AV Orlando, FL 32839 Acreage: 90.2 Location: Get detailed directions Points of Interest: The park's pavilion and group area are available for rental; please contact the office at 407-254-6770 and leave a message (appointments recommended). Please note that Orange County Parks and Recreation requires 30 days or more to schedule and complete payment and paperwork for all rentals. For Estate House or Grove House event rentals, contact Big City Catering, Inc., 407-749-0792 or email info@CypressGroveEstateHouse.com or visit their website . Cypress Grove Park opened on May 8, 1994."
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=351&sn=ga",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.orangecountyfl.net/EmploymentVolunteerism/JobOpenings.aspx",
      "text": "Job Openings Skip to main content Site Map | A To Z Index | Español Payment Center Follow Us On Search our site Residents Visitors Businesses Employees About Us Site Map A To Z Index Español Payment Center Browse Services Search our site Browse Services RESIDENTS Resident Home Page Animals & Pets Area Agencies Arts & Culture Community & Family Services Consumer Protection County Commission (BCC) Emergency & Safety Employment & Volunteerism Environment Health Services Get Involved Neighborhoods & Housing Open Government Orange County Library System Orange TV Parks Payment Center Permits & Licenses Sustainability Traffic & Transportation Visit Orlando Volunteer Opportunities Water, Garbage & Recycling VISITORS Visitors Home Page Arts and Culture Consumer Protection Convention Center County Commission (BCC) Emergency & Safety Environment Orange County Library System Orange County Regional History Center Parks Visit Orlando BUSINESSES Businesses Home Page Business Resources Area Agencies Central Florida Research Park Convention Center County Commission (BCC) Economic Development Employment & Volunteerism Environment Health Services National Entrepreneur Center Open Government Payment Center Permits & Licenses Planning & Development Sustainability Team Orlando (US military simulation) Traffic & Transportation UCF Business Incubation Program Vendor Services Water, Garbage and Recycling EMPLOYEES Essential Employee Info: myOCHR Upload Your Benefits Documents Verification of Employment Career Opportunities Fire Rescue Careers Corrections Careers Job Descriptions New Hire Hub Open Enrollment Employee Benefits Retirement Benefits myOCWellness OC MINDMATTERS ABOUT US You are here: Employment & Volunteerism | Job Openings Mission & Values Benefits Incentives Career Paths Employment Info Contact Us Orange County Board of County Commissioners now uses E-Verify® in its hiring practices. E-Verify® is a registered trademark of the U.S. Department of Homeland Security. External Applicants (how to apply online) Internal Applicants (using the oc network) Our Mission & Core Values Meaningful Benefits Medical, Dental and Vision Care Free Access to Wellness Centers Vacation Leave and Twelve Paid Holidays Florida Retirement System and 457(k) Plan Disability and Life Insurance Tuition Reimbursement Learn More About Our Benefits Incentives Learn more about our recruitment initiatives: Sign-on Incentive Guidelines Referral Incentive Guidelines Referral Incentive FAQs Career Paths Dr. Atalie Ashley West Community Action Donnie Krantz Fire Rescue Dr. Hefang Lin Corrections Department Zach Fether Convention Center Sonya Hill Head Start Delloreen Ennis Parks & Recreation Geoff Shetka Environmental Protection Kristin Tsukamoto Animal Services Vanessa Lewis Commissioner Aide Laura Lord-Blackwell Human Resources Jason Reynolds Neighborhood Services Deja Barnes Citizen's Commission for Children Nina Dorn Parks & Recreation Mehul Parekh Public Works Lisa Graham Corrections Sabrina Grays 3-1-1 Representative Diana Almodovar Public Works Learn more about our career opportunities: Convention Center Corrections Fire Rescue Utilities Employment Information Federal Employment Laws Applicants have rights under Federal Employment Laws: Family and Medical Leave\n\t\t\t\t\t\tAct (FMLA) Equal Employment\n\t\t\t\t\t\tOpportunity (EEO) Equal\n\t\t\t\t\t\t\tEmployment Opportunity (EEO) Utilization Report Employee Polygraph\n\t\t\t\t\t\tProtection Act (EPPA) Veterans' Preference Are you claiming Veterans' Preference on your employment application? You are responsible for providing the required eligibility documentation by the closing date of the\n\t\t\t\tposting. Please scan and upload a copy of your cover letter and supporting documents, to Orange County\n\t\t\t\tHuman Resources Division via the secure Box.com folder . Your cover letter should include the Job ID number you are applying for, the title of the position, your\n\t\t\t\tfull name and the last 4 digits of your social security number. *If you are a current employee returning from active military service, you may be eligible for promotion\n\t\t\t\tpreference if the active military service qualifies for Veterans' Preference. Please note that Veterans'\n\t\t\t\tPreference applies only to a veterans' first promotion after reinstatement or reemployment, without\n\t\t\t\texception. File Upload Instructions: The maximum file size is 5 MB, and only the following file types may be used:\n\t\t\t\t.pdf (unlocked), .jpg, .jpeg, .gif, .tiff, .bmp, and .txt Select or drag your document(s) then click submit. A progress window will display the status of each upload until 100% is reached. After you submit your documents, you will see a \"Success\" page. This page serves as confirmation\n\t\t\t\t\tthat your documents were received. For assistance, questions, or more information call Orange County Government Florida Human Resources at\n\t\t\t\t(407)836-5661 and select Option 2. To learn more about Veterans' Preference, please visit https://www.floridavets.org/benefits-services/veterans-preference Special Accommodation Orange County provides equal opportunity to qualified individuals with disabilities and disabled\n\t\t\t\tveterans. As a part of that commitment, we strive to ensure that our online application process is\n\t\t\t\taccessible to qualified individuals with disabilities and disabled veterans. If you require a reasonable accommodation to assist you with the application process, including your\n\t\t\t\taccess to and/or use of Orange County's online application process, please call us at (407) 836-5661\n\t\t\t\tprior to the application deadline. You may also send an e-mail to online-apps@ocfl.net and provide us with your name, contact\n\t\t\t\tinformation and the best time of day for us to reach you. Job Offers If you receive a job offer, you will need to: Provide copies of credentials such as diplomas or licenses Complete a pre-employment physical, drug test and background check Register for selective service if you are required to do so Sign up for direct deposit by the first day on the job Diplomas & Degrees If your education was obtained in the United States, the County recognizes degrees or diplomas which are\n\t\t\t\taccredited by an agency recognized by the United States\n\t\t\t\t\tDepartment of Education (USDE) or the Council for\n\t\t\t\t\tHigher Education Accreditation (CHEA) . If you have obtained education from a country other than the United States, your degree or diploma must\n\t\t\t\tbe evaluated to determine the United States equivalency by a member of the National\n\t\t\t\t\tAssociation of Credential Evaluation Service (NACES) or the Association\n\t\t\t\t\tof International Credentials Evaluations (AICE) at your expense. Contact Us Orange County Employment Center 450 E. South Street, 1st Floor Orlando, FL 32801 Service Hours Monday – Friday 8 a.m. to 5 p.m. Phone: (407) 836-5661 Email: Online-apps@ocfl.net All e-mail sent to this address becomes part of Orange County public record. Comments received by our e-mail subsystem can be read by anyone who requests that privilege. In compliance with \"Government in the Sunshine\" laws, Orange County Government must make available, at request, any and all information not deemed a threat to the security of law enforcement agencies and personnel. Apply Now County Commission (BCC) Open Government Media Center Animals & Pets Convention Center Community & Family Services Culture & Parks Economic Development Emergency & Safety Employment & Volunteerism Environment Health Services Jail & Inmate Services Medical Examiner Neighborhoods & Housing Permits & Licenses Planning & Development Traffic & Transportation Vendor Services Water, Garbage & Recycling Zoning © 2025 Orange County Government, Florida Privacy & Terms · Accessibility · Title VI · Browse Contacts · 311 Help & Info Follow Us On opens in a new tab pdf opens in a new tab video opens in a new tab"
    },
    {
      "url": "https://trimblehollowpress.com/contact/",
      "text": "Contact US – Trimble Hollow Press Skip to content Trimble Hollow Press Editing and Publishing Services Menu + × expanded collapsed Home About Services and Rates Contact US Blog Contact US Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch Acworth , Georgia USA trimblehollowpress@yahoo.com Instagram Facebook Twitter WordPress Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning Message (required) Warning Warning. Submit Δ Like Loading... Trimble Hollow Press , Blog at WordPress.com. Subscribe Subscribed Trimble Hollow Press Sign me up Already have a WordPress.com account? Log in now. Trimble Hollow Press Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website %d"
    },
    {
      "url": "https://www.orangecountyfl.net/browsecontacts.aspx",
      "text": "Browse Contacts Skip to main content Site Map | A To Z Index | Español Payment Center Follow Us On Search our site Residents Visitors Businesses Employees About Us Site Map A To Z Index Español Payment Center Browse Services Search our site Browse Services RESIDENTS Resident Home Page Animals & Pets Area Agencies Arts & Culture Community & Family Services Consumer Protection County Commission (BCC) Emergency & Safety Employment & Volunteerism Environment Health Services Get Involved Neighborhoods & Housing Open Government Orange County Library System Orange TV Parks Payment Center Permits & Licenses Sustainability Traffic & Transportation Visit Orlando Volunteer Opportunities Water, Garbage & Recycling VISITORS Visitors Home Page Arts and Culture Consumer Protection Convention Center County Commission (BCC) Emergency & Safety Environment Orange County Library System Orange County Regional History Center Parks Visit Orlando BUSINESSES Businesses Home Page Business Resources Area Agencies Central Florida Research Park Convention Center County Commission (BCC) Economic Development Employment & Volunteerism Environment Health Services National Entrepreneur Center Open Government Payment Center Permits & Licenses Planning & Development Sustainability Team Orlando (US military simulation) Traffic & Transportation UCF Business Incubation Program Vendor Services Water, Garbage and Recycling EMPLOYEES Essential Employee Info: myOCHR Upload Your Benefits Documents Verification of Employment Career Opportunities Fire Rescue Careers Corrections Careers Job Descriptions New Hire Hub Open Enrollment Employee Benefits Retirement Benefits myOCWellness OC MINDMATTERS ABOUT US You are here: Browse Contacts Browse Contacts Animals & Pets Pet Rescue & Adoption Center AnimalServices@ocfl.net 2769 Conroy RD Orlando, FL 32839-2162 Phone: (407) 254-9150 Volunteer Coordinator AnimalServices@ocfl.net 2769 Conroy RD Orlando, FL 32839-2162 Phone: (407) 254-9155 Clerk of Courts Orange County Courthouse myorangeclerk.com 425 N. Orange Avenue Orlando, FL 32801 Phone: (407) 836-2000 Comptroller Administrative Office occompt.com PO Box 38 Orlando, FL 32802 Phone: (407) 836-5690 Convention Center Administrative Office info@occc.net PO Box 691509 Orlando, FL 32869-1509 Phone: (407) 685-9800 Culture & Parks Arts & Cultural Affairs 450 E South ST, 3 rd Fl Orlando, FL 32801 Phone: (407) 836-5540 Parks & Recreation Barnett Park (Main office) OrangeCountyParks.net parks@ocfl.net 4801 W Colonial DR Orlando, FL 32808 Phone: (407) 836-6200 Regional History Center TheHistoryCenter.org 65 East Central BLVD Orlando, FL 32801 Phone: (407) 836-8500 Economic Development Economic Development, Office of EconomicDevelopment@ocfl.net 201 S Rosalind AV, 5 th Floor Orlando, FL 32801 Phone: (407) 836-7370 Fax: (407) 836-7399 Education & Training Community Action (Literacy/GED/Job Skills) 2100 E Michigan ST, 1 st & 2 nd Floors Orlando, FL 32806 Phone: (407) 836-9333 Fax: (407) 836-7690 Cooperative Extension Orange.IFAS.UFL.edu 6021 S Conway RD Orlando, FL 32812 Phone: (407) 254-9200 Fax: (407) 850-5125 Head Start (Pre-K Program) 2011 E Michigan ST Orlando, FL 32806 Phone: (407) 836-6590 Fax: (407) 836-7420 Emergency & Safety Emergency Medical Services 2002-A East Michigan ST Orlando, FL 32806 Phone: (407) 836-8960 Fire Rescue FireRescue1@ocfl.net PO Box 5879 Winter Park, FL 32793 Phone: (407) 836-9000 Office of Emergency Management OCOEM@ocfl.net PO Box 5879 Winter Park, FL 32793 Phone: (407) 836-9140 Employment & Volunteerism Benefits benefits@ocfl.net PO Box 1393 Orlando, FL 32802 Phone: (407) 836-2900 Employment Center 450 E South ST, 2 nd Floor Orlando, FL 32801 Phone: (407) 836-5661 Environment Environmental Protection EPD@ocfl.net 3165 McCrory Place, Suite 200 Orlando, FL 32803 Phone: (407) 836-1400 Fax: (407) 836-1499 Families, Health & Social Services Citizen Resource & Outreach Office 2100 E Michigan ST Orlando, FL 32806 Phone: (407) 836-6565 Citizens’ Commission for Children 2100 E Michigan ST Orlando, FL 32806 Phone: (407) 836-7610 Community Action 2100 E Michigan ST, 1 st /2 nd Floors Orlando, FL 32806 Phone: (407) 836-9333 District Nine Medical Examiner's Office Medical.Examiner@ocfl.net 2350 E Michigan ST Orlando, FL 32806 Phone: (407) 836-9400 Fax: (407) 836-9450 Head Start 2100 E Michigan ST Orlando, FL 32806 Phone: (407) 836-6590 Health Department 6101 Lake Ellenor Dr. Orlando, FL 32809 Phone: (407) 858-1400 Health Information Privacy Officer 2002-A E. Michigan Street Orlando, FL 32806 Phone: (407) 836-7611 Health Services Administrative Office 2002-A E Michigan ST Orlando, FL 32806 Phone: (407) 836-7611 Mental Health & Homelessness 2100 E Michigan ST Orlando, FL 32806 Phone: (407) 836-7608 Mosquito Control Office 2715 Conroy RD, Building A Orlando, FL 32839 Phone: (407) 254-9120 Fax: (407) 345-5538 Office On Aging 2100 E Michigan ST, 2 nd Floor Orlando, FL 32806 Phone: (407) 836-6563 Office on Disability 2100 E. Michigan ST, Orlando, FL 32806 Phone: (407) 836-7588 Ryan White 2100 E Michigan ST Orlando, FL 32806 Phone: (407) 836-7631 Veterans' Services 2100 E Michigan ST Orlando, FL 32806 Phone: (407) 836-8990 Youth & Family Services Administrative Office 2100 E Michigan ST Orlando, FL 32806 Phone: (407) 836-7600 Jail & Inmate Services Bail Bond Processing 3855 South John Young PKWY Orlando, FL 32839 Phone: (407) 836-3400 Booking & Release Center (BRC) 3855 South John Young PKWY Orlando, FL 32839 Phone: (407) 836-3400 Community Corrections ccd@ocfl.net 3723 Vision BLVD, 2 nd /3 rd Floors Orlando, FL 32839 Phone: (407) 836-3000 Corrections Mailing Address: PO Box 4970 Orlando, FL 32802-4970 (Mail cannot be accepted at any Corrections unit office address.) Phone: (407) 836-3400 Corrections Administration 3723 Vision BLVD Orlando, FL 32839 Phone: (407) 836-3560 Custodian of Records OCCDRecords@ocfl.net 3723 Vision BLVD, 4 th Floor Orlando, FL 32839 Phone: (407) 836-0321 Honor Guard HonorGuard@ocfl.net 3723 Vision BLVD, 4 th Floor Orlando, FL 32839 Phone: (407) 836-3560 H.R. C.O. Recruiting Section 2450 W 33 rd ST Orlando, FL 32839 Phone: (407) 836-3543 Inmate Medical Inquiries 3855 South John Young PKWY Orlando, FL 32839 Phone: (407) 254-7561 Inmate Money Accounts & Property 3855 South John Young PKWY Orlando, FL 32839 Phone: (407) 448-8320 Inmate Phone Service 3723 Vision BLVD, 4 th Floor Orlando, FL 328399 Setup Account Phone: (888) 949-3303 Stop Inmate Calls Phone: (407) 836-3117 Public Information 3723 Vision BLVD, 4 th Floor Orlando, FL 32839 Phone: (407) 836-3023 Jail Tours 3723 Vision BLVD, 4 th Floor Orlando, FL 32839 Phone: (407) 836-3312 Video Visitation Center 3000 39th ST Orlando, FL 32839 Phone: (407) 836-8061 Judiciary Orange County Courthouse ninthcircuit.org 425 North Orange Avenue Orlando, FL 32801 Phone: (407) 836-2050 Library System Main Location ocls.info 101 E. Central Blvd. Orlando, FL 32801 Phone: (407) 835-7323 Neighborhoods & Housing Housing & Community Development Housing@ocfl.net 525 E South ST Orlando, FL 32801 Phone: (407) 836-5150 Neighborhood Services Division OCNeighborhoods@ocfl.net 2450 W. 33rd Street, 2nd Floor Orlando, FL 32839 Phone: (407) 836-4200 News Media Communications PIO@ocfl.net 201 S Rosalind AV, 3 rd Floor Orlando, FL 32801 Phone: (407) 836-5301 or (407) 836-5818 Permits & Licenses One Stop Permitting PermittingServices@ocfl.net Administration Building, 1 st Floor 201 S. Rosalind AV Orlando, FL 32801 Phone: (407) 836-8181 Planning & Development Neighborhood Services Division Code Compliance 2450 W 33rd ST, 2 nd Floor Orlando, FL 32839 Phone: (407) 836-3111 Fax: (407) 836-4240 Comprehensive Planning Planning@ocfl.net 201 South Rosalind AV, 2 nd Floor Orlando, FL 32801 Phone: (407) 836-5600 Fax: (407) 836-5862 Public Works (Land Survey) Public Works Complex Building 1 4200 South John Young PKWY Orlando, FL 32839 Phone: (407) 836-7900 Utilities Development Engineering Utilities.DevEngineering@ocfl.net 9150 Curry Ford RD, 2 nd Floor Orlando, FL 32825 Phone: (407) 254-9900 Research & Intergovernmental Planning@ocfl.net 201 South Rosalind AV, 2 nd Floor Orlando, FL 32801 Phone: (407) 836-0952 Fax: (407) 836-5862 Growth Management GrowthManagement@ocfl.net 201 S. Rosalind AV Orlando, FL 32801 Phone: (407) 836-5600 Fax: (407) 836-5862 Property Appraiser Administrative Office ocpafl.org 200 S. Orange Avenue Suite 1700. Orlando, FL 32801 Phone: (407) 836-5044 Public Defender Main Office myfloridapd.com 435 North Orange Avenue Suite 400. Orlando, FL 32801 Phone: (407) 836-4800 REQUEST FOR PUBLIC RECORDS PublicRecordRequest@ocfl.net 450 E. South Street, 3rd Floor, Orlando, FL 32801 Phone: (407) 836-5400 Fax: (407) 836-5377 REQUEST FOR RECORDS - BACKGROUND CHECKS AND POLICE/SHERIFF REPORTS records@ocfl.net Phone: (407) 254-7000, option #4 Public Schools Administrative Office ocps.net 445 W Amelia Street Orlando, FL 32801 Phone: (407) 317-3200 Sheriff Administrative Services ocso.com P.O. Box 1440 Orlando, FL 32802 Phone: (407) 254-7000 State Attorney Main Office sao9.net 415 North Orange Avenue Suite 1700. Orlando, FL 32801 Phone: (407) 836-2400 Supervisor of Elections Elections Office ocfelections.com 119 W Kaley Street Orlando, FL 32806 Phone: (407) 836-2070 Tax Collector Tax Collectors Office octaxcol.com 200 South Orange Avenue P.O. Box 2551 Suite 1500 Orlando, FL 32802 Phone: (407) 845-6200 Traffic & Transportation Roads & Drainage Public Works Complex Building 1 4200 South John Young PKWY Orlando, FL 32839 Phone: (407) 836-3111 Traffic Engineering Public Works Complex Building 1 4200 South John Young PKWY Orlando, FL 32839 Phone: (407) 836-3111 or Phone: (407) 836-7900 Office of Regional Mobility Lauren.Buckner@ocfl.net 201 S. Rosalind AV, 5 th Floor Orlando, FL 32801 Phone: (407) 836-5610 Fax: (407) 836-7399 Vendor Services Procurement Division Procurement@ocfl.net 400 E South Street, 2nd Floor Orlando, Florida 32801 Phone: (407) 836-5635 Business Development BusinessDevelopment@ocfl.net Internal Operations Centre II, 2 nd Floor 400 E South ST Orlando, FL 32801 Phone: (407) 836-7317 Fax: (407) 836-5477 Water, Garbage & Recycling Utilities Customer Service Utilities.Information@ocfl.net 9150 Curry Ford RD, 1 st Floor Orlando, FL 32825 Phone: (407) 836-5515 Utilities Emergency Dispatch 9150 Curry Ford RD, 1 st Floor Orlando, FL 32825 Phone: (407) 836-2777 Solid Waste Solid.Waste@ocfl.net 5901 Young Pine RD Orlando, FL 32829 Phone: (407) 836-6601 Water Water.Division@ocfl.net 9150 Curry Ford RD, 3 rd Floor Orlando, FL 32825 Phone: (407) 254-9850 Water Reclamation Water.Reclamation@ocfl.net 9150 Curry Ford RD, 3 rd Floor Orlando, FL 32825 Phone: (407) 254-9680 Environmental Compliance Environmental.Compliance@ocfl.net 4760 W Sand Lake RD Orlando, FL 32819 Phone: (407) 254-7708 Utilities Engineering 9150 Curry Ford RD, 2 nd Floor Orlando, FL 32825 Phone: (407) 254-9900 All Other Inquiries Customer Service 311 Phone: (407) 836-3111 Email And Public Records All e-mail sent to Orange County email addresses becomes part of Orange County public record. Comments received by our e-mail subsystem can be read by anyone who requests that privilege. In compliance with \"Government in the Sunshine\" laws, Orange County Government must make available, at request, any and all information not deemed a threat to the security of law enforcement agencies and personnel. County Commission (BCC) Open Government Media Center Animals & Pets Convention Center Community & Family Services Culture & Parks Economic Development Emergency & Safety Employment & Volunteerism Environment Health Services Jail & Inmate Services Medical Examiner Neighborhoods & Housing Permits & Licenses Planning & Development Traffic & Transportation Vendor Services Water, Garbage & Recycling Zoning © 2025 Orange County Government, Florida Privacy & Terms · Accessibility · Title VI · Browse Contacts · 311 Help & Info Follow Us On opens in a new tab pdf opens in a new tab video opens in a new tab"
    },
    {
      "url": "https://trimbleeng.com/who-we-are/",
      "text": "Who We Are - Trimble Sustainment Engineering Skip to content Menu Home Who We Are What We Do Reverse Engineering Design Support Production Support Depot-Level Repair What We Make Contact Us Menu Home Who We Are What We Do Reverse Engineering Design Support Production Support Depot-Level Repair What We Make Contact Us NOW WITH TWO LOCATIONS TO SERVE YOU BETTER Who We Are Trimble Sustainment Engineering Inc is a Service-Disabled Veteran Owned Small Business that was established in 2011 to meet the growing sustainment needs of the military. Trimble’s singular vision is the Service Life Extension of all devices that are critical to the success of our customer’s mission. If it is important to you, then it is important to us. SDVOSB Certification \"Congratulations and welcome to the U.S. Small Business Administration’s (SBA) Veteran Small Business Certification (VetCert) Program.\" Read Full Certification Letter Our Philosophy Most people don’t remember how all of this was started, so I’m sharing the story here.  I believe that it explains our philosophy very well…I’ll try to keep it short, but no promises. Many years ago, when I was a fairly new electrical engineer, I was tasked with assisting a technician who was repairing circuit cards in a very old security system, one made by Info-Graphics (which should date this story nicely).  We found that the system was nearly impossible to support, as the exact replacement components were no longer available.  After a bit of analysis, I was able to locate currently manufactured variations for the most critical parts, and functionally equivalent parts for the rest. Downside? The parts that mattered were in completely different package types than what was required and, after some discussion, it was determined that IC adapters simply could not fit inside the limited space provided.  It just didn’t seem like there was a good solution that involved the original PCB.  So what was my solution?  Recreating the PCB from scratch, of course. I approached the customer and presented my idea.  They, in turn, listened politely and just as politely told me no.  It wasn’t that the idea was a bad one, it was that I was unproven, inexperienced.  I walked away from that meeting feeling like I had let down the technicians and, more importantly, the end user.  I kept seeing this pile of hardware that had been rendered to paperweights because of this one board. I realized that this feeling of failure was one that I didn’t care for, so instead of accepting that the customer’s ‘no’ was the ending, I instead spent my evenings and weekends designing the replacement on my own dime.  I drew up the schematics, laid out the board and , once the PCB’s had arrived, did all of the assembly.  I then brought the completed product into work with me, presented it to the lab lead and asked if I could install it into the testbed.  Saying that he was skeptical was a bit of an understatement, but after going over the schematic and my approach he reluctantly agreed to let me place it into the testbed… and it worked. Now, if I said that everything that I’d made since worked the first time that I’d installed it I’d be a liar, but the God of Engineers certainly smiled upon me that day. The day that the customer came in to witness the prototype board working in the system was the beginning, the start of our journey.  They were very impressed with the results, with how quickly I was able to create something, that integrating a replacement into a system was actually feasible, which led to more and more projects of increasing difficulty (I still have nightmares about the 8-layer, 120+ IC PCB that I was tasked with replacing that had no schematics, of course), eventually transitioning from individual boards to complete sub-systems. The experience that we take away from each project that we’ve completed allows us to support ever more complex mission-critical redesigns, each building on the next; e.g., our testing support gave us the knowledge to support the AN/GTM-3B Cable Test Set for our Marines, a design that went from white-paper concept to deliverable that met all requirements (including MIL-28800 Class III environmentals) in 60 working days. If there’s something that we truly love, it’s a challenge.  Think you have an impossible design problem or a system that we can’t support?  We accept that challenge.  Give us a call and let’s talk. – David Simanowitz, President and CEO And by the way, if anyone out there needs a communications board for a CAS-100, give me a call – I may still know where the schematics are. V.I.P Certified Trimble Sustainment Engineering Inc, Colorado Springs, CO, recently completed the Veteran Institute Procurement (VIP), a comprehensive training and certification program that helps veteran-owned businesses strengthen their ability to win government contracts and do business with both military and civilian agencies they once served in uniform. On October 23, 2014, Trimble Sustainment Engineering Inc was one of 49 businesses from 13 states and the District of Columbia to graduate from the National Center for the Veteran Institute for Procurement. During the program’s graduation, David Simanowitz, President and CEO, was presented with a congressional citation on behalf of Congressman Doug Lamborn. Get In Touch 480-690-5229 2598 Palmer Park Blvd Colorado Springs, CO 80909 6030 South Kent Street Mesa, AZ 85212 d.simanowitz@trimbleeng.com What We do Reverse Engineering Design Support Production Support Depot-Level Repair Who We Are Trimble Sustainment Engineering Inc is a Service-Disabled Veteran Owned Small Business that was established in 2011 to meet the growing sustainment needs of the military. © 2025 Trimble Sustainment Engineering | Privacy Policy | Terms & Conditions | Website Developed & Maintained by Third Angle"
    }
  ]
}