{
  "fuentes": [
    {
      "url": "https://www.golfnow.com/tee-times/facility/229-orange-tree-golf-club/search",
      "email": "nbc-golf-white@2x.png"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/contact/",
      "email": "georgew@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/contact/",
      "email": "jennyc@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/contact/",
      "email": "cpierce@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/contact/",
      "email": "dd@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/contact/",
      "email": "gwyckhuyse@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/contact/",
      "email": "rtorri@orangetreegolfclub.com"
    },
    {
      "url": "https://orangetreecommunity.com/camporangetree/",
      "email": "office@orangetreecommunity.com"
    },
    {
      "url": "https://orangetreecommunity.com/camporangetree/",
      "email": "office@orangetreecommunity.com"
    },
    {
      "url": "https://www.orangetreeschool.org/contact",
      "email": "reception@ellernmede.org"
    },
    {
      "url": "https://www.orangetreeschool.org/contact",
      "email": "reception@orangetreeschool.org"
    },
    {
      "url": "https://www.orangetreegolfclub.com/instruction/",
      "email": "chall@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/instruction/",
      "email": "jhart@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/instruction/",
      "email": "dbigbie@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/instruction/",
      "email": "dd@orangetreegolfclub.com"
    },
    {
      "url": "https://www.orangetreegolfclub.com/instruction/",
      "email": "mnash@orangetreegolfclub.com"
    }
  ],
  "mails": [
    "chall@orangetreegolfclub.com",
    "cpierce@orangetreegolfclub.com",
    "dbigbie@orangetreegolfclub.com",
    "dd@orangetreegolfclub.com",
    "dpylinski@sevenoaksgolf.com",
    "georgew@orangetreegolfclub.com",
    "gwyckhuyse@orangetreegolfclub.com",
    "jennyc@orangetreegolfclub.com",
    "jhart@orangetreegolfclub.com",
    "mnash@orangetreegolfclub.com",
    "nbc-golf-white@2x.png",
    "office@orangetreecommunity.com",
    "reception@ellernmede.org",
    "reception@orangetreeschool.org",
    "rtorri@orangetreegolfclub.com"
  ],
  "nombre_sitio": "orangetreegolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.golfnow.com/tee-times/facility/229-orange-tree-golf-club/search",
      "text": "Orange Tree Golf Club Tee Times - Scottsdale AZ Log In / Sign Up Hot Deals Courses Near Me Destinations Best Courses Rewards Join GolfPass Gift Cards Search Hot Deals Near Me Off Sort Distance Time Price Golfers Holes Facility Type Reset Filters Top Pick League Available Orange Tree Golf Club 10601 N. 56th Street , Scottsdale , Arizona , 85254 Holes 18 Par 72 Length 6762 yards Slope 122 Rating 71.3 A longtime favorite in the Phoenix area, Orange Tree Golf Club and resort is a parkland-style course that's one of the six oldest layouts in the Valley of the Sun. The course, which used to be Century Country Club, was designed by Johnny Bulla and opened in 1957. The par-72 layout has four sets of tees, playing from 4,777 yards to 6,7740 yards. The fairways are generous, but the 60-yard-old trees can certainly catch an errant tee shot. Orange Tree's greens are small, well-bunkered and tilt from back to front. Water comes into play on a third of the holes, especially on nine and 18, where a lake divides the two holes. And there are plenty of mountain views to take in as well. In addition to the course, Orange Tree has excellent practice facilities. The driving range tee is over 80 yards wide with grass year-round. There are two practice putting greens, including one that's nearly 18,000 square feet near the range, and there is a short-game area as well. There is also a golf academy that offers golf schools, clinics, and individual lessons. In addition,  Orange Tree has been recognized by the community for its green efforts in reducing non-recyclable waste, reducing water usage and implementing a recycling program on property. The facility also offers a well-stocked golf shop. And guests can also enjoy a restaurant and bar that serves breakfast, lunch and offers a happy hour, too, with drink and beer specials. Read More... Directions Course Details Review Leagues Available Social golf leagues available at this course Join Now Powered by Spark Golf We partnered up with Spark Golf to bring you social, competitive 9-hole leagues at your favorite courses. Each round has a 2-person team & individual game with end of league champs. Compete in a laid-back atmosphere over 9-holes Play with friends and meet like-minded new ones. Join the League × Last Modified: 9/8/2025 8:24:01 PM +00:00 Policies Walking allowed: No Metal spikes allowed: No Credit cards accepted: VISA, MasterCard, Amex, Discover Welcomed Dress Code: Collared shirt and bermuda shorts required. No denim. Rentals/Services Carts: Yes - included in green fees Clubs: Yes Caddies available: No Practice/Instruction Driving range: Yes Pitching/chipping area: Yes Putting green: Yes Teaching pro: Yes Read More... View Full Map Directions More Hot Deals Searching next 3 days... × There are no Hot Deals available for the date selected. Fetching more results... Unable to Complete Search We're sorry, there was an error completing your search. Try changing locations, changing the date, expanding your distance, or updating your filters. How About a Mulligan? We’re sorry, there are currently no available tee times for your search. Try changing locations, changing the date, expanding your distance, or updating your filters. In the cabbage. There are no Daily Deal options on this date. Please check back again for another shot at Daily Deals. Check Next Day View All Nearby Tee Times Search Hot Deals Get your golf on Information About Us Careers Contact Us Help Gift Cards Rewards Premier Card Ad Choices Privacy Policy Cookie Preferences CA Notice Terms of Service - New Resources Destinations Best Tee Time Deals Weekend Tee Times Course Directory Private Club Directory GolfNow Reviews Mobile Apps Promotions Blog Simulators Private Clubs Featured Courses GolfNow Spotlights Club Champion Fittings Businesses Partner Support Golf Facilities GolfNow for Courses List My Facility on GolfNow Other Partnership Requests Partner Brands NBC Sports Golf Channel GolfPass GolfNow Compete TeeOff SportsEngine HQ SportsEngine Motion Don't miss out on great golf deals, special offers and more! Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Stay Connected Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Subscribe Our Mobile Apps © Copyright 2025 GolfNow. All rights reserved."
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 54° Thu 09/11 clear sky 73°/53° Fri 09/12 clear sky 72°/52° Sat 09/13 overcast clouds 71°/55° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.orangetreegolfclub.com/contact/",
      "text": "Contact - Orange Tree Golf Club Skip to primary navigation Skip to main content Skip to footer Orange Tree Golf Club Home Golf The Course Course Rules Lessons Weddings & Events Weddings & Events Golf Outings Membership About OTGC About Us Club News Club Menus Contact Member Login Contact You can contact Orange Tree Golf Club in the following ways: By Mail: Orange Tree Golf Club, 7540 Woodgreen Drive, Orlando, FL 32819 By Phone: You can access all departments through our Main line: (407) 351-4034, listen for the prompts. Or you may call directly: Office: (407) 351-4034 Pro Shop: (407) 351-2521 Membership: (407) 351-4034 Restaurant: (407) 351-4041 By Email: David Damesworth Director of Golf dd@orangetreegolfclub.com Rob Torri Superintendent rtorri@orangetreegolfclub.com Jenny Callero Events Manager JennyC@orangetreegolfclub.com Christy Pierce Membership cpierce@orangetreegolfclub.com George Wyckhuyse General Manager GeorgeW@orangetreegolfclub.com Message Us! Please contact us through this form, if you need further information about anything on this site. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Comment or Message * Message Submit Footer Contact Us 7540 Woodgreen Dr, Orlando, FL 32819 (407) 351-4034 Quick Links About OTGC Club News Course Rules Contact Follow Us Facebook Instagram YouTube Twitter Orange Tree Golf Club | 7540 Woodgreen Drive Orlando, FL 32819 | (407) 351 - 4034 Copyright © 2025 Orange Tree Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://orangetreecommunity.com/camporangetree/",
      "text": "Camp Orange Tree – Orange Tree Community Association Skip to content 407-351-8747 7201 Woodgreen Drive | Orlando, FL 32819 Office@orangetreecommunity.com Facebook Orange Tree Community Association Just another WordPress site Home About Orange Tree Recreation Center Gate Information News & Events Calendar Members Camp Orange Tree Contact Search: Home About Orange Tree Recreation Center Gate Information News & Events Calendar Members Camp Orange Tree Contact About Camp Orange Tree Camp Orange Tree Orange Tree Community, Many of us were disappointed to learn that Camp Orange Tree 2025 was cancelled for this summer. Summer camp has been a long-standing tradition for many years. We apologize for any inconvenience this has caused to the families planning on our camp for their children this summer. We are grateful to our most recent camp administrators Amber Wasendorf and Tommy Sprague; they have done an amazing job for the past 7 years; thank you to Lisa Carnevale who partnered with Amber for the initial start, prior to Tommy. For the years prior, we are grateful to Keola Mount for Camp Woodgreen and her efforts of over 15 years and for the legacy of the camp she established. Finally, let’s not forget to thank our own Fred Kemball, who contributed to the very beginnings of a summer experience for our children. We know you join us in expressing your appreciation for how each has served our community with its changes in demographics and needs throughout the years. Please read more for some current facts: • Summer Camp has been a long-standing Orange Tree tradition for over 25 years. • In November of 2024, the board voted unanimously on the camp budget; in 2025, preparation for summer camp began. • In February 2025, understanding that non-resident campers were joining their friends from Orange Tree, the BOD voted 7-0 to apply the same Rec Center Use Policy to camp as for others: non-  resident friends of Orange Tree campers could join them at camp and resident family members, such as grandchildren, were invited to be campers. • There is no provision in our covenants for open public use of the amenities, however, as with all other Rec Center usage, Orange Tree Residents may invite friends and guests to join them. • After the vote, we learned that Orange Tree campers represented only 25 out of 100 campers; we also learned that attendance by Orange Tree campers has been in decline over the past years. • Camp Administration projected a significant drop in registration and profitability if the Rec Center Use Policy was followed. • The board was informed that the camp would not take place; the board did not cancel the camp. • We would like to serve our community by having a summer experience for the children of Orange Tree and their guests (including Orange Tree resident grandchildren / family). We are looking for committee members to brainstorm ideas. If you would like to participate, please email office@orangetreecommunity.com SUBJECT LINE: Orange Tree Camper Summer Experience. We regret the impact that the cancellation of camp might have had but are VERY committed to pursuing the possibility of a summer experience for the children of Orange Tree families and their guests for 2026. Orange Tree Master Maintenance Association, Inc. Board of Directors – April 16, 2025 ﻿ SEE YOU NEXT SUMMER !!! Hear What Everyone's Saying Testimonials Camp orange tree has been part of our lives since my daughter was five years old. I can still remember her first day of camp… read more Stefanie Camp Parent Our family had an amazing experience at Camp Orange Tree the summer of 2019! This wonderful camp read more Giselle Camp Parent Camp Orange Tree is THE best summer camp around! If you are looking for good old fashioned summer camp fun that has the best staff around, read more Emille Camp Parent My son has been attending Camp Orange Tree since he was old enough to attend and we have loved every minute of it. read more Erin Camp Parent Camp Orange Tree is a wonderful, safe, and fun offering that Orange Tree provides and I cannot imagine not having it. read more Emiko Beck Camp Parent I like to think of Camp Orange Tree as my second home, and most importantly, my second family. For the past 14 years, read more Mackenzie Lambert Camper for 8 years Orange Tree Master Association Thank you for visiting Orange Tree Master Association.  If you need to contact us please click on the contact button below. Copyright © 2017 Orange Tree Master Association Home About Orange Tree Recreation Center Gate Information News & Events Calendar Members Camp Orange Tree Contact Navigation Go to Top"
    },
    {
      "url": "https://www.orangetreeschool.org/contact",
      "text": "contact About Welcome Why OTS? Vision and ethos The Orange Tree approach Meet our team Ridgeway Site Inspection reports Policies School registration Learning Curriculum Exam Results Subjects Inclusion Careers Education Student life Term dates 2024-2025 Term dates 2025-2026 The School Day #OTStories Engagement and Wellbeing Clubs Attendance and Punctuality School Meals Safeguarding Community This is us Admissions Overview Parents Local authority funding route Online application Local Authorities and Commissioning Bodies Consultation process FAQs News Key Dates Newsletters Blog Events Contact Us Work with us Vacancies Working at OTS Contact Us Get in touch Fill out the form below The Orange Tree School Oakleigh Park North Whetstone, London N20 9AR Email: reception@orangetreeschool.org Telephone: 020 8148 1700 How to get here Car Orange Tree is 7 miles from Junctions 23 or 24 of the M25, 5 miles from Stirling corner on the A1 or from Junction 2 of the M1. The A1000 is to the west of the school. Train The Totteridge and Whetstone Underground station (Northern Line) is less than 0.5 miles to the west and provides regular services into Central London via Charing Cross and Bank. The School is also accessible via Oakleigh Park station serviced by Great Northern Trains running between Central London and Welwyn Garden City. Bus Central London is approximately ten miles to the south; East Barnet is to the east and North Finchley to the south. A number of bus routes run along the nearby roads and, although located in a residential road, the site is well located for local shopping and other amenities. Find us on google maps reception@orangetreeschool.org Follow us on Facebook Follow us on LinkedIn Follow us on Twitter Follow us on Instagram Get in Touch 020 8148 1700 Orange Tree School, Oakleigh Park North, London, N20 9AR Company Quick Links Home Admissions News Contact us Resources Registered office: Ellern Mede Ridgeway, Holcombe Hill, Mill Hill, London, NW7 4HX, England Ellern Mede Schools Company reg no: 10642453 Orange Tree School | Department for Education: 302/6118 | URN: 135072 | UK PRN: 10017857 © 2023 Ellern Mede School | T&Cs | Privacy Policy | Cookie Policy"
    },
    {
      "url": "https://www.orangetreegolfclub.com/instruction/",
      "text": "Lessons - Orange Tree Golf Club Skip to primary navigation Skip to main content Skip to footer Orange Tree Golf Club Home Golf The Course Course Rules Lessons Weddings & Events Weddings & Events Golf Outings Membership About OTGC About Us Club News Club Menus Contact Member Login Lessons Orange Tree Golf Club’s PGA and TPI certified professionals will help you play your best golf with personalized instruction and V1 Pro software, the latest in video swing technology. Individual and group lessons, packages, and clinics are available. Please contact the Pro Shop at 407-351-2521 . Meet the Instructors DAVID “DD” DAMESWORTH, PGA, TPI Director of Golf Direct: (407) 436-2348 Email: dd@orangetreegolfclub.com Orange Tree Pro Shop: (407) 351-2521 Teaching Credentials​ PGA of America Class A Member with 20 Years of Teaching Experience Certified T.P.I. (Titleist Performance Institute) Golf Fitness Instructor Certified Golf Club Fitter Titleist L.A.S. (Leadership Advisory Staff) Member 2016 North Florida PGA East Chapter Golf Professional of the Year 2015 North Florida PGA East Chapter Youth Development Award 2013, 2014, 2015, 2018 NFPGA East Chapter Player of the Year 2013 North Florida PNC Champion 2011 North Florida PGA Champion DANIEL BIGBIE, PGA Head Golf Professional Email: dbigbie@orangetreegolfclub.com Orange Tree Pro Shop: (407) 351-2521 Pro Shop Assistants Michele Nash PGA Associate Email: mnash@orangetreegolfclub.com Collin Hall PGA Associate Email: CHall@orangetreegolfclub.com Jack Hart PGA Associate Email: JHart@orangetreegolfclub.com Video Tips from the Pros Schedule a Lesson Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Service Instruction Outing Message Submit Footer Contact Us 7540 Woodgreen Dr, Orlando, FL 32819 (407) 351-4034 Quick Links About OTGC Club News Course Rules Contact Follow Us Facebook Instagram YouTube Twitter Orange Tree Golf Club | 7540 Woodgreen Drive Orlando, FL 32819 | (407) 351 - 4034 Copyright © 2025 Orange Tree Golf Club All Rights Reserved. Powered by"
    }
  ]
}