{
  "fuentes": [
    {
      "url": "https://orbitskyline.com/contact-us/",
      "email": "careers@orbitskyline.com"
    },
    {
      "url": "https://orbitskyline.com/contact-us/",
      "email": "hr@orbitskyline.com"
    },
    {
      "url": "https://orbitskyline.com/contact-us/",
      "email": "hr@orbitsolutions.net"
    },
    {
      "url": "https://orbitskyline.com/contact-us/",
      "email": "recruitment@orbitsolutions.net"
    },
    {
      "url": "https://www.orbit.online/contact/",
      "email": "contact@orbit.online"
    },
    {
      "url": "https://orbit-team.com/",
      "email": "info@orbit-team.com"
    },
    {
      "url": "https://www.orbit19lounge.com/contact/",
      "email": "booking@orbit19lounge.com"
    },
    {
      "url": "https://www.orbit19lounge.com/contact/",
      "email": "info@orbit19lounge.com"
    }
  ],
  "mails": [
    "booking@orbit19lounge.com",
    "careers@orbitskyline.com",
    "contact@orbit.online",
    "hr@orbitskyline.com",
    "hr@orbitsolutions.net",
    "info@orbit-team.com",
    "info@orbit19lounge.com",
    "recruitment@orbitsolutions.net"
  ],
  "nombre_sitio": "orbit19lounge.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://orbitskyline.com/contact-us/",
      "text": "Contact Orbit & Skyline: Get in Touch Today Services Open menu Semiconductor FAB Solutions Equipment Engineering Process Engineering Semiconductor Material Supply Fab Facility Solutions VLSI Design Services OEM Solutions Engineering & Product Management Legacy Tool Management Services Global Supply Chain Management Services Global Field Engineering About Us Open menu Mission, Vision & Values Leadership FAR Compliance Resources Open menu Case Studies Webinars PR & News Podcast Events Blog Careers Open menu Company Culture Job Openings Contact Us Semiconductor FAB Solutions Equipment Engineering Process Engineering Semiconductor Material Supply Fab Facility Solutions VLSI Design Services OEM Solutions Engineering & Product Management Legacy Tool Management Services Global Supply Chain Management Global Field Engineering Home Contact Us Let’s Talk Don't Hesitate to Reach Out! GET IN TOUCH WITH INDUSTRY EXPERTS Partner with top semiconductor experts to explore your project needs. Our team is dedicated to delivering tailored solutions that drive your success. Contact us today! support@orbitskyline.com recruitment@orbitsolutions.net hr@orbitsolutions.net +1-510-509-3202 Get in Touch Our team of seasoned professionals is at the forefront of\r\ninnovation in the semiconductor industry. Please leave this field empty. Customers & Partners Global Expertise, Trusted Partnerships Worldwide team with deep semiconductor experience in equipment, process, and facility management. 150+ Global Clients 3000+ Tools Managed 15+ Years Excellence global headquarters Newport Beach Irvine Newport Beach Regional Offices IRELAND Italy INDIA TAIWAN Singapore Saudi Arabia ISRAEL WE HAVE AN INFLUENTIAL GLOBAL PRESENCE Our global reach enables us to deliver semiconductor solutions wherever they're needed, ensuring excellence worldwide. Global Headquarters Regional Offices Orbit & Skyline, Inc. Orbit Engineering, LLC 4930 Campus Drive, Newport Beach, CA 92660 Skyline Semiconductor Services, LLC 18012 Cowan, #200-#241, Irvine, CA 92614 Orbit & Skyline Ireland ltd. 93 Upper George’s Street, Dun Laoghaire, Dublin, A96V1K8, IRELAND Orbit & Skyline (Italy) ltd. S.r.l. Via del Lauro 9 20121, Milan Italy Orbit & Skyline India pvt. ltd. B602, Bestech Business Tower, Sector 66, Mohali Punjab 160066 INDIA Orbit & Skyline pte. ltd. 6F.NO.378, Changchun RD Zhongshan Dist Taipei City 104, TAIWAN Skyline Semiconductor Services pte. ltd. 112 Robinson Road #03-04 Robinson 112 Singapore 068902 Orbit Engineering Prince Mohammed Bin Abdulaziz Road AI Olaya District, Riyadh 12213 Kingdom of Saudi Arabia Skyline Semiconductor Services ltd. P.O. 3004224, Ramat Yishai Street, ISRAEL Orbit & Skyline India pvt. ltd. T7 Teck Park, Plot C-119, Phase 7, Industrial area, Sector 73, Mohali, Punjab Skyline Semiconductor Services Japan, LLC Umezaki Building, 3rd Floor, 4-4-4 Hatchobori, Chuo-ku, Tokyo Join Our Winning Team Explore career opportunities and join our growth story. Join our team and shape the future of semiconductors. Join Our Team Company Company Culture Our Leadership Contact Us Our Mission PR & News Events Blogs Semiconductor Fab Solutions Equipment Engineering Process Engineering Semiconductor Material Supply VLSI Design Services OEM Solutions Engineering & Product Management Legacy Tool Management Services Global Supply Chain Management Services Global Field Engineering USA 4930 Campus Drive, Newport Beach, CA 92660 INDIA B602, Bestech Business Tower, Sector 66, Mohali Punjab 160066 INDIA Contact Us Sales & Partnerships hello@orbitskyline.com Job Applicants careers@orbitskyline.com HR hr@orbitskyline.com USA 4930 Campus Drive, Newport Beach, CA 92660 +1-510-509-3202 INDIA B602, Bestech Business Tower, Sector 66, Mohali Punjab 160066 INDIA +91-172-509-9933 Social Media Sales & Partnerships hello@orbitskyline.com Job Applicants careers@orbitskyline.com HR hr@orbitskyline.com Get in Touch +1-510-509-3202 +91-172-509-9933 FARs & DFRs Terms & Conditions Privacy Policy Copyright © 2025 Orbit & Skyline, Inc. All rights reserved."
    },
    {
      "url": "https://www.orbit.online/contact/",
      "text": "Contact us today Solutions By Industry Architecture Engineering Construction Manufacturing By Team Business Development Bidding Department Project Manager Chief Project Officer Use Cases Green Survey is ready to scale There is no doubt about Green Survey’s advice for other startup businesses when it comes to the implementation of a digital solution for all their data. The biggest Orbit implementation to date - COWI COWI maintains a competitive advantage with new, superior solution to handle CV and Reference data Explore All Customer Cases → Platform Bidding & Qualifications Bid Management CV & Reference CRM Software Skills & Certifications Planning & Execution Project Planning Resource Planning Stakeholder Engagement Document Management Apps & Integrations Power BI Dashboards Inspiration With Orbit for Power BI With the Orbit app for Power BI you get processed, ready to use data, for visual reporting, giving you the insights you need to make better business decisions. AI for projects in Orbit In Orbit, you can integrate AI and get the most out of your project data. With AI in Orbit, you can optimise your workflow and spend more time on what matters to you and your business. Explore all apps & integrations → Knowledge Guides Work better with your data Posts from development Learn about the technology that makes up Orbit Case stories Understand how Orbit makes it easy to do it right. Orbit Community Sign up for live events and share insights from your industry This Is Orbit Online Pricing Search... Ctrl K English Book Demo Questions or comments? Don't hesitate to contact us We hope you found the information you needed – if you have any further questions, feel free to reach out; we're here to help! Contact us for a live demo of Orbit, a chat about digitalising your business, or any other questions you may have. Talk to you soon! René Dalsgaard CEO Orbit Online A/S Address Orbit Online A/S Åbogade 25 8200 Århus N Denmark Phone +45 7734 4539 Email contact@orbit.online Name E-mail Message By signing up, you agree to our Orbit Online privacy policy . Move along, nothing to see here Send Our users on Orbit Orbit helped us achieve a better solution than we could have imagined. Through ongoing advice and guidance from Orbit, we now have a platform that suits our needs. Mila Stenbye Vester Business Development NCC Ultimately, the two decisive factors for choosing Orbit were the modern design style combined with great features that already met most of our needs. Raphael Fischer Application Engineer at SKAN AG We use Orbit daily to collect, store and manage our employees' skills documentation. Orbit provides a good overview, and we can extract various data for our projects and competency checks. Lea Zindorff Gram Projects at Aarsleff Rail Orbit's competence management solution provides us with the best overview. It helps us not only in relation to quality assurance and our ISO certification but also when we draft proposals. It's the only system we know of that offers interaction between competencies, CVs and references. Stinna Christensen Human Resources at Wicotec Kirkebjerg I just have to say - how cool is the new CV system? When you need a few words about a given employee, you look them up in a flash and move on with your work - freaking awesome. Trine Developer at NCC Footer End-to-end project management - from first sales contact to finished product. LinkedIn Github Company This is Orbit Online A/S Contact us Become Orbit partner Privacy policy Platform Planning & Execution Bidding & Qualification Apps & Integrations MARS Powered by Orbit Address Orbit Online A/S Åbogade 25 8200 Aarhus N Phone +45 7734 4539 Email contact@orbit.online © 2024 Orbit Online A/S. All rights reserved."
    },
    {
      "url": "https://orbit-team.com/",
      "text": "Orbit Trading & Contracting Co. Home Projects About us Contact Home Projects About us Contact Mehr More child Email Old Email Welcome to Orbit - Team Team Engineering & Contracting Wll. was incepted in 2001 by professionals the Construction & Project Management fields to cater to the needs of the ever expanding Qatari construction industry and Q companies. Since then, Team Engineering & Contracting Wll. has done many prestigious construction and interior projects and proved their credentials in the market. For more details. Our Mission To strive for par excellence and always endeavour to achieve the set goal in our construction and Fit Out works within professional & Ethical standards. Aim To ensure high quality finishes through experienced staff members embracing a professional approach. To identify, assess and acquire projects that require various skills embraced by our employees and ensuring client satisfaction; offering turnkey services of construction as well as a specialist contractor for finishes. We offer cost effective packages keeping in mind our broad based local and international database of manufacturers and suppliers while ensuring prompt & efficient services. We offer quality construction works, high quality carpentry & joinery products, decorative plaster works and various other floor/wall/ceiling finishes. We strive to approach the problem head-on tackling at its core in finding & executing the best suitable solution and in the process enforcing identification/planning/strategy/implementation. SCOPE Team Engineering & Contracting Wll. is providing professional services in the area of engineering construction, design & build concept, quantity surveying, site supervision, project management and trading. Team Engineering & Contracting Wll. has developed and implemented the Quality Management System (QMS) as described in this manual to help the organization to demonstrate their ability to consistently provide services that meet the customer & regulatory requirements and operate with increased effectiveness and efficiency with the overall aim of enhancing customer satisfaction. This manual also serves as a reference to the customer, auditor and all interested parties for the purpose of understanding the QMS adopted by Team Engineering & Contracting Wll. The requirements specified in the manual are aimed at achieving the Organizationâs commitment to Quality Policies & Objectives by providing guidance to all Team Engineering & Contracting WLLâs personnel and other interested parties. Team Engineering & Contracting WLLâs Quality Management System (QMS) documentation is written, implemented, and maintained to meet most current requirements of ISO9001:2000 with a scope for enhancement in the future. CONTACT DETAILS +974 44374522 info@orbit-team.com Team Engineering & Contracting Wll, Building No: 54, Office No: S-09, Al Wakrah Commercial Complex, Postal Adress : Post Box 31514 Â© All rights reserved"
    },
    {
      "url": "https://www.orbit19lounge.com/contact/",
      "text": "Contact – Orbit 19 Lounge About Photos Videos Contact Home Menu Menu Link to Instagram Link to Facebook Maps were disabled by the visitor on this site. Click to open the map in a new window. Contact Orbit19 As one of the few underground establishments in the Tampa Bay Area, word of mouth is the primary source of our success for the last 11 1/2 years. Orbit 19 is a dynamic meeting spot for people-watching, conducting business, and/or chilling out. Hidden behind an unassuming entrance the lounge hosts weekly events from bands to DJs in a diverse and relaxed setting. Address 1542 US Highway 19 North Holiday, Florida 34691 Club Info info@orbit19lounge.com Booking Info booking@orbit19lounge.com Message Orbit19 Name * E-Mail * Message * This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. This contact form is deactivated because you refused to accept Google reCaptcha service which is necessary to validate any messages sent by the form. Copyright © Orbit 19 Lounge, All Rights Reserved. | Website Hosting & Web Development by RAD TECH Link to Instagram Link to Facebook About Photos Videos Contact Home Scroll to top Scroll to top Scroll to top"
    }
  ]
}