{
  "fuentes": [
    {
      "url": "https://www.pnj.com/story/news/crime/2021/07/23/orileys-shooting-ppd-investigating-shooting-after-thursday-bar-fight/8068195002/",
      "email": "colinwarrenhicks@pnj.com"
    },
    {
      "url": "https://beautifulpathvacations.com/travel-spot-guide/orileys-uptown-tavern/",
      "email": "logo@2x.png"
    }
  ],
  "mails": [
    "colinwarrenhicks@pnj.com",
    "logo@2x.png"
  ],
  "nombre_sitio": "orileystavern.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pnj.com/story/news/crime/2021/07/23/orileys-shooting-ppd-investigating-shooting-after-thursday-bar-fight/8068195002/",
      "text": "O'Riley's Uptown Tavern customer accidentally shoots himself at bar News Sports Play Opinion Advertise Obituaries eNewspaper Legals CRIME O'Riley's Uptown Tavern customer accidentally shoots himself while showing off gun Colin Warren-Hicks Pensacola News Journal A customer at the O'Riley's Uptown Tavern on Creighton Road appears to have accidentally shot himself while showing his gun to fellow patrons Thursday night, according to surveillance video from the bar. Pensacola police initially released information Friday morning that said a shooting took place inside the bar while officers were responding to a report of a fight outside. Pensacola Police Department spokesman Greg Gordon retracted that information later in the day, saying it was based on reports submitted by various patrol units and was partly inaccurate. Gordon said Friday afternoon that the first officer to respond to the scene Thursday night was on routine patrol on Creighton Road when he was flagged down by a patron who ran out of the bar immediately after the gun was fired at about 11 p.m. While officers were inside the bar investigating, Gordon said a fight broke out between patrons just outside the bar's main building. He said officers walked outside to help de-escalate that fight. The fight was not related to the shooting​​​​, according to Gordon. Warren Sonnen, a manager at O'Riley's Uptown Tavern, allowed the News Journal to view security footage from Thursday night, which shows the incident occurred at 11:01 p.m. In the video, a man can be seen sitting at the bar engaged in conversation with a woman and another man at 11 p.m. At 11:01 p.m., the man uses his right hand to pull out a handgun and shows it to the two people for a couple of seconds. He then makes a quick motion as if he were putting the gun into an invisible holster beneath his left shoulder and discharges the weapon, shooting himself in the upper torso. \"I don't know if he was pretending to be a badass or something,\" Sonnen said. \"But from what I can tell, it was completely by accident.\" The man left the bar moments after discharging the weapon. Police made contact with the man they suspect fired the gun after he checked himself into a hospital shortly after the incident. As of 3 p.m. Friday, authorities were still determining whether he would face charges. Colin Warren-Hicks can be reached at colinwarrenhicks@pnj.com or 850-435-8680. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://beautifulpathvacations.com/travel-spot-guide/orileys-uptown-tavern/",
      "text": "O'Riley's Uptown Tavern - BEAUTIFUL PATH VACATIONS Home About Us Experiences Listings Management Blog Home About Us Experiences Listings Management Blog Book Now Login Register Become a Host Pensacola O’Riley’s Uptown Tavern Nestled near our Pensacola property, O’Riley’s Uptown Tavern is a neighborhood bar with a lively atmosphere and a wide selection of drinks. Whether you’re looking for a casual hangout spot, a place to catch a game, or enjoy live music, O’Riley’s offers a welcoming environment where you can relax and have a great time. Visit Link +1 850-474-0522 3728 Creighton Rd, Pensacola, FL 32504, United States Some Places You Might Like Downtown Pensacola Visit Link Pensacola, FL Tucked away near our Pensacola property, Downtown Pensacola is a vibrant and historic area filled with charming boutiques, art galleries, restaurants, and lively nightlife. Pensacola Beach Gulf Pier Pensacola Visit Link +1 850-934-7200 41 Fort Pickens Rd #2005, Pensacola Beach, FL 32561, United States Just a short distance from our Pensacola property, the Pensacola Beach Gulf Pier offers breathtaking views of the Gulf of Mexico. Taqueria El Asador Pensacola Visit Link +1 850-696-3232 7955 N Davis Hwy, Pensacola, FL 32514, United States Tucked away near our Pensacola property, Taqueria El Asador is a hidden gem for authentic Mexican cuisine. Why You Should Choose (Business Name)? Luxury Amenities Prime Locations Spacious accommodations Stunning views Modern design Impeccable cleanliness Personalized experiences Excellent customer service Book Your Stay Search Property Ready for the best Home Rental Experience Book Your Stay JOIN OUR NEWSLETTER Subscribe our newsletter to get latest updates Email Subscribe Quick Links Home About Us Experiences Listings Management Property Owner Home About Us Experiences Listings Management Property Owner CONTACT INFO 603 848 2301 BeautifulPathInvesting@gmail.com Copyright © 2023 | Website made by Boostly Currency Facebook Instagram Youtube Search Where to go? Los Angeles Pensacola Ramat Gan San Francisco Arrive Depart September 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 October 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 November 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 December 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 January 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 February 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 March 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 April 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 May 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 June 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 July 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 August 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Clear Done Guests 0 Adults 0 Children Pets Yes No Apply Advanced Size n. of bedrooms 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 n. of rooms 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Room Type Price Min. $10.00 $20.00 $30.00 $40.00 $50.00 $60.00 $70.00 $80.00 $90.00 $100.00 $110.00 $120.00 $130.00 $140.00 $150.00 $160.00 Max. $50.00 $100.00 $125.00 $150.00 $160.00 $200.00 $250.00 $300.00 $400.00 $500.00 $600.00 $700.00 $800.00 $900.00 $1,000.00 $1,200.00 Amenities Air Conditioning Balcony Bathtub Bed linens Cable TV Carbon monoxide detector Cleaned with disinfectant Cleaning before checkout Clothes Dryer Coffee Maker Cookware Deck / Patio Desk Dishes & Utensils Dishwasher Doorman Dryer Elevator Fire extinguisher Free parking on premises Free street parking Game console Hair Dryer Heating Internet Iron Iron & Board Kitchen Lawn / Garden Linens Provided Microwave Outdoor Grill Oven Pantry Items Parking Pets allowed Private entrance Refrigerator Safe Smoke detector Smoking allowed Stove Television Toaster Towels Provided TV Washer Washing Machine Wireless Internet More Reset Apply Filters Search × Login Remember me Forgot password? Log In Don't have an account? Register × Register User registration is disabled in this website. × Forgot Password Please enter your username or email address. You will receive a link to create a new password via email. Submit Compare listings Compare Compare experiences Compare Close O’Riley’s Uptown Tavern Sleep up to  ,  Bedroom ,\n                             Bathroom In this home, you will find... Select Currency US Dollar USD - $ Canadian Dollar CAD - CA$ Euro EUR - € Pound Stirling GBP - £ Home About Us Experiences Listings Management Blog Book Now"
    }
  ]
}