{
  "fuentes": [
    {
      "url": "https://avalonparkorlando.com/contact-us/",
      "email": "avalonmanager@lelandmanagement.com"
    },
    {
      "url": "https://avalonparkorlando.com/contact-us/",
      "email": "info@avalonparkgroup.com"
    },
    {
      "url": "https://orlando-parenting.com/orlando-family-stage-review-affordable-fun-for-all/",
      "email": "boxoffice@orlandofamilystage.com"
    },
    {
      "url": "https://orlando-parenting.com/orlando-family-stage-review-affordable-fun-for-all/",
      "email": "info@orlando-parenting.com"
    },
    {
      "url": "https://artists.unitedartscfl.org/educator/orlando-repertory-theatre/",
      "email": "education@orlandofamilystage.com"
    },
    {
      "url": "https://artists.unitedartscfl.org/educator/orlando-repertory-theatre/",
      "email": "fieldtrips@orlandofamilystage.com"
    },
    {
      "url": "https://artists.unitedartscfl.org/educator/orlando-repertory-theatre/",
      "email": "fieldtrips@orlandorep.com"
    },
    {
      "url": "https://orlandoyouthsoccernetwork.com/contactus",
      "email": "admin@orlandoyouthsoccer.com"
    },
    {
      "url": "https://orlandoyouthsoccernetwork.com/contactus",
      "email": "ocysn@orlandocitysc.com"
    },
    {
      "url": "https://orlandofamilystage.com/youth-academy-faqs/",
      "email": "education@orlandofamilystage.com"
    },
    {
      "url": "https://orlandofamilystage.com/get-involved/careers/",
      "email": "cksmith@orlandofamilystage.com"
    },
    {
      "url": "https://artsinorlando.com/organization/orlando-repertory-theatre/",
      "email": "boxoffice@orlandofamilystage.com"
    },
    {
      "url": "https://thevendry.com/venue/20398/orlando-family-stage-orlando-fl",
      "email": "bgroth@orlandorep.com"
    },
    {
      "url": "https://thevendry.com/venue/20398/orlando-family-stage-orlando-fl",
      "email": "rentals@orlandofamilystage.com"
    }
  ],
  "mails": [
    "admin@orlandoyouthsoccer.com",
    "avalonmanager@lelandmanagement.com",
    "bgroth@orlandorep.com",
    "boxoffice@orlandofamilystage.com",
    "cksmith@orlandofamilystage.com",
    "education@orlandofamilystage.com",
    "fieldtrips@orlandofamilystage.com",
    "fieldtrips@orlandorep.com",
    "info@avalonparkgroup.com",
    "info@orlando-parenting.com",
    "ocysn@orlandocitysc.com",
    "rentals@orlandofamilystage.com"
  ],
  "nombre_sitio": "orlandofamilystage.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://avalonparkorlando.com/contact-us/",
      "text": "Contact Us | Avalon Park Orlando Event Calendar Newsletter Signup Menu About Developer Story Site Plan Live Single-Family Homes Townhomes Live/Work Units Apartments Senior Living Property Owners Learn Schools Daycare Spiritual Centers Cultural Arts Work Directory Commercial Properties Job Opportunities Play Complete Event Calendar Community Events Avalon Park Murals Food Truck Nights Movie Under the Stars Festivals Absolutely Avalon Fall Craft Fair Fourth of July Oktoberfest Spooktacular Avalon Aglow Sidewalk Sales Artisan and Maker’s Markets Night Markets Community Amenities Parks Bike Trails Pools Community Centers Avalon Park Sun Featured News Advertising Other Avalon Park Arts & Culture Center Volunteer Opportunities Live Well Vendor Opportunities Dining Guide Contact Us Search for: Downtown Avalon Park Business Directory Get Contact Information for 150+ Shops and Restaurants in Downtown Avalon Park. Sign up for community updates Sign up for community updates Home Contact Us Home Contact Us Contact Avalon Park Orlando Click Here to Sign-Up for our Newsletter! Note: It is our responsibility to protect your privacy and we guarantee that your data will be completely confidential. APPOA Association Managers 13401 Tanja King Blvd. Orlando, FL 32828 Phone: 407-249-9395 Fax: 407-249-9437 avalonmanager@lelandmanagement.com Avalon Park Group Management, Inc. 3801 Avalon Park East Blvd., Ste. 400 Orlando, FL 32828 Phone: 407-658-6565 Fax: 407-658-6246 info@avalonparkgroup.com Thank you for Signing Up Join Our Newsletter Please complete this form to create an account, receive email updates and much more. Please correct the marked field(s) below. First Name 1,false,1,First Name,2 Last Name 1,false,1,Last Name,2 Contact Email * 1,true,6,Contact Email,2 Message 1,false,5,Note,2 Avalon Area of Interest Avalon Park Orlando Avalon Park Daytona Avalon Park Tavares Galveneyes Avex Avalon Park Wesley Chapel Avalon Park Group Cultivate AI Avalon Park Sun Avalon Park Wesley Chapel Avalon Park Daytona Avalon Park Tavares Avalon Park Group Avex Avalon Park Sun Avalon Park Tavares Avalon Park Daytona Avalon Park Wesley Chapel Avex Galveneyes Avalon Park Sun Avalon Park Group Stanley Martin Homes Stanley Martin Homes Cultivate AI 1,false,13,Avalon Area of Interest,2 * *Required Fields Note: It is our responsibility to protect your privacy and we guarantee that your data will be completely confidential. UPCOMING EVENTS Whether you are enjoying one of the large quarterly festivals or relaxing in the park at one of the monthly movies, the community is full of life and a variety of family-friendly activities. View The Full Event Calendar Sep 13 OnSpot Dermatology September 2025-09-13 @ 7:30am - 3:30pm OnSpot Dermatology September 🚐✨ OnSpot Dermatology is coming to Avalon Park! 📅 Saturday, Sept 16th ⏰ 7:30 AM – 3:30 PM 📍 Parked across from Mejana ✅ 15 minutes could save your life! ✅ Most major insurances accepted ✅ Book your appointment online today – https://onspotdermatology.com/locations/avalon-park/ Don’t wait—schedule your skin check and take charge of your health! Date: 2025-09-13 7:30am - 3:30pm Website: https://onspotdermatology.com/locations/avalon-park/ Download Event Flyer Sep 13 Rising Star Robotics 2025-09-13 @ 10:00am - 12:30pm Rising Star Robotics Join us every Saturday at Rising Star Robotic—an engaging and interactive experience where students in grades 1–8 dive into the exciting world of robotics and coding! Each weekly session sparks creativity and curiosity as students explore the basics of robot building, simple command programming, and hands-on problem solving—all while growing their passion for STEM. 📅 Saturdays | August 23rd – November 15th 📍 Avalon Arts Center | 13013 Founders Square Drive 🕙 1st–3rd Grade: 10:00 – 11:00 AM 🕦 4th–8th Grade: 11:30 AM – 12:30 PM 💲 $40 per session | $450 for full program (includes 1 free class!) 🎉 First class just $10! Stay tuned for a special final project and student showcase at the end of the program! Sign up today! https://www.eventeny.com/events/risingstarrobotics-22168/ 📩 For more information, contact Janeth Jepkogei at janethjeps@gmail.com Date: 2025-09-13 10:00am - 12:30pm Download Event Flyer Sep 14 Bowigens Beer Games-September 2025-09-14 @ 12:00pm - 3:00pm Bowigens Beer Games-September Get ready for an afternoon of friendly competition and big laughs at Bowigens Beer Games!  Join us on Sunday, September 14th from Noon–3 PM at Bowigens Beer Co. in Avalon Park for: Corn Hole & Beer Pong Tournaments Giant Connect 4, Giant Jenga, Flip Cup & more! Prizes including gift cards, merch, and beer! Grab your friends, bring your A-game, and let’s see who takes home the bragging rights! Date: 2025-09-14 12:00pm - 3:00pm Address: Marketplace Download Event Flyer Sep 17 Murder Book Club-September 2025 2025-09-17 @ 6:30pm - Murder Book Club-September 2025 Murder, Mystery & Merlot! Join the Jetsetters Murder Book Club! Calling all mystery lovers! Dive into thrilling tales of intrigue and suspense with our Murder Book Club, meeting on the 3rd Wednesday of each month at Avalon General inside The Marketplace. Grab a glass of wine, meet fellow book enthusiasts, and unravel twisted plots together. Upcoming Meetings: September 17, 6:30 PM: The Poet by Michael Connelly Mayhem, Adventure, Intrigue! Whether you’re a seasoned sleuth or a first-time reader, you’re invited. Come for the mystery, stay for the wine! RSVP or get more info: joniostroff@gmail.com Date: 2025-09-17 6:30pm - Address: Avalon General 3801 Avalon Park East Blvd., Ste. 100, Orlando, FL 32828 Download Event Flyer Sep 17 WonderArte September Art Classes 2025-09-17 @ 5:00pm - 6:15pm WonderArte September Art Classes 🎨 WonderArte September Classes 🎨 Calling all young artists (ages 6–12)! Join us at the Avalon Park Arts & Culture Center every Wednesday from Aug 27 – Sept 17, 5–6:15 PM for a creative 4-week journey inspired by carnival colors and imagination. ✨ What’s in store: 🐘 Week 1: Chagall’s Flying Animals – Paint your own magical creature 🎭 Week 2: Carnival Masks – Feathers, sequins & bold designs 🐿️ Week 3: Mixed Media Squirrel Art – Play with textures & color 👕 Week 4: Carnival T-Shirts – Design your own wearable masterpiece! All materials provided, no experience needed. Kids’ work will even be featured in the September/October Exhibition! 📍 Avalon Park Arts & Culture Center 🎟 Register for the 4-week series ➡️ https://loom.ly/VvVaXsg 🎟 Or drop in for a single class ➡️ https://loom.ly/OJg7FwQ Date: 2025-09-17 5:00pm - 6:15pm Address: Avalon Park Arts & Culture Center Website: AvalonArtsCenter.com Download Event Flyer Get Tickets Sep 20 Noche Latina – September 2025-09-20 @ 6:00pm - 10:00pm Noche Latina – September Get ready to dance the night away at Noche Latina, an entertainment series at the Marketplace! Each month, we’re bringing you the hottest Latin music talent to light up the stage. #MeetMeAtTheMarketplace for the ultimate fiesta! Date: 2025-09-20 6:00pm - 10:00pm Address: Marketplace at Avalon Park Download Event Flyer REQUEST INFORMATION 407-658-6565 Privacy Policy Site Map © Copyright 2020 APPOA Association Manager Leland Management 13401 Tanja King Blvd. Orlando, FL 32828 P: 407-249-9395 Avalon Park Group Mgmt Inc. 3801 Avalon Park East Blvd., Ste. 400 Orlando, FL 32828 P: 407-658-6565 info@avalonparkgroup.com Sign up for Community Updates Stay up-to-date with all things Avalon Park Orlando, east Orlando’s Premier Community to Live, Learn, Work & Play! Email Address * CAPTCHA This field is hidden when viewing the form Avalon Park Area of Interest X/Twitter This field is for validation purposes and should be left unchanged. Δ"
    },
    {
      "url": "https://orlando-parenting.com/orlando-family-stage-review-affordable-fun-for-all/",
      "text": "Orlando Family Stage Review: Affordable Fun for All - Orlando Parenting Magazine Skip to content Facebook Twitter Instagram Pinterest YouTube Topics Expand Summer Camp Guide Schools Directory Eats Education Health + Wellness Travel Birthdays Expand Birthday Party Venues Neighborhoods Theme Parks & Attractions Things To Do About Us The Magazine Search Get our Weekly Top Picks of Things to Do in the Orlando area and beyond by Email! Email * Email Submit Please enable JavaScript in your browser to submit the form Or Get the Magazine in the Mail! Subscribe to Orlando Parenting Magazine for a year - or gift it to someone special! Each bi-monthly issue is mailed directly to the recipient's address. Subscribe to the Magazine Search Toggle Menu Subscribe to the Magazine! Get the Magazine! or Get our Newsletter! Email Submit Please enable JavaScript in your browser to submit the form Orlando Family Stage Review: Affordable Fun for All Education | Neighborhoods | Orlando and Orange County | Summer Camps + Programs Maria DiCicco June 16, 2024 June 21, 2024 Located at Loch Haven Park’s cultural epicenter, the Orlando Family Stage focuses on Central Florida’s children with performances for families, workshops, and classes for kids and so much more. It’s one of our favorite affordable things to do for kids. This wonderful venue put on a witty show that caught my eye recently (a brief review below), and my daughter and I are now hooked. I’ll be looking to spend time here much more often! Read on to learn more about this charming addition to the Central Florida arts scene and their offerings. In Case You’re Interested: >> Super Fun Family Restaurants >> Cheap Family Fun >> Orlando Hotels with Waterparks About the Orlando Family Stage Their mission, as part of the United Arts Collaborative Campaign for the Arts, is to bring art closer than ever before to the families and kids who are your neighbors. Providing accessible arts for youth, this “theater in the round”, if you will, creates a performance venue targeted specifically for children. The stage is surrounded by a horseshoe of seating options, providing wonderful viewpoints for anyone in the audience. Orlando Family Stage – Image from Orlando Family Stage Programs and Offerings At Orlando Family Stage, in addition to live performances for kids, they also offer workshops, school field trip shows, and interactive baby & me time for parents, grandparents or caregivers to enjoy with their 0-24 month old children. Their story strolls are similarly engaging events allocated for parents and caregivers of 2-3 year olds, where a stroll through Loch Haven Park is in order. Their youth academy offers camps and classes for children, sorted on their website by grade level. These performance workshops are great for budding actors, actresses and little kids who just love the theater. A Show Review When I went to the production of “ The Lightning Thief: The Percy Jackson Musical ”, my daughter and I were blown away by the production value. The humor and even the more intense scenes were gauged just right for all audiences to enjoy, not to mention their stage action was very impressive! My daughter is still trying to figure out how Percy, played by a captivating Jose Rivera, was able to click his magic pen onstage and turn it into a sword in the blink of an eye. She’s four, and although I understand the concept of the slight of hand, my brain also still can’t figure out how they pulled it off – I guess I was too busy looking at the minotaur on set. Orlando Family Stage Percy Jackson Lightning Thief – Image from Orlando Family Stage Meanwhile, other things to take note of for this and other shows is the run time was a comfortable 75 minutes, with no intermission to distract the kiddos away. Age scales indicate who the play is best suited for (this was ages 9 and up), but my well-versed in the Percy Jackson movies 4 year old girl just loved every minute of it. I could see the emotions all over her face at every scene. The entire cast, composed of only six adult actors, was phenomenal, and that’s not gauging them on a scale of what you may expect from a children’s performance. Many of them wore several character hats in the show, too – brilliantly executed! The staff were all courteous and knew how to deal with children and all their chaos, and we really enjoyed the cute themed snack bag they put together for the event. Around the theater lobby were options for buying Percy Jackson books and apparel, and they truly created a memorable theater experience for the children. Bravo to the team at Orlando Family Stage for this one, they’ve definitely found a repeat visitor out of my family. Orlando Family Stage Percy Jackson Lightning Thief – Image from Orlando Family Stage How You Can Contribute If the arts are important to you, there are many ways that you can help to support their campaign. Ticket sales are an obvious boost, however, they also run numerous fundraising events throughout the year. Visit their donations page for more information on donation levels and their matching program, or consider volunteering your time to the organization. If You Go Upcoming Performances and More Go to OrlandoFamilyStage.com for details on upcoming performances and events. Now Playing & Upcoming Shows The SpongeBob Musical: Youth Edition : July 19 – 28, 2024 P.Nokio: A Hip-Hop Musical : September 3 – 22, 2024 Theatre for the Very Young: Yo, Ho, Ho! Let’s Go! : September 25 – October 20, 2024 Junie B. Jones in BOO… and I Mean It! : September 30 – November 1, 2024 Pip-Squeak: An Anti-Bullying Magic Show : October 15 – 18, 2024 A Charlie Brown Christmas: Live On Stage : November 11 – December 29, 2024 Teen Perspectives Lab Presentation: Girls in the Boat : November 14 – 15, 2024 The Best Christmas Pageant Ever: The Musical : December 6 – 8, 2024 Dragons Love Tacos: The Musical : February 3 – March 9, 2025 Teen Perspectives Lab Presentation: Rosaline Wrecked It All : March 6 – 7, 2025 Diary of a Wimpy Kid The Musical : March 10 – April 20, 2025 Theatre for the Very Young: Dinosaur Dance Party : April 12, May 9, 2025 Cyrano de Burger Shack : May 2 – 4, 2025 Tickets can be purchased online or same day in the box office. The Orlando Family Stage is also a participant in the Orange County Library System’s Local Wanderer program , providing FREE tickets and admission for Orange County Library cardholders. Further discounts are available for seniors, educators, and more. Learn about these discounts by visiting the Orlando Family Stage website. Box Office Information 407-896-7365 boxoffice@orlandofamilystage.com 1001 E. Princeton St. Orlando, FL 32803 Maria DiCicco Published author of children's travel activity books \"Scavenger Hunt Spain\" and \"Scavenger Hunt Japan\", blogger of all things International Travel on Alwayspacktissues.com, and Travel Writer for multiple publications, Maria is a daughter, girl-mom, and also wife to a Spaniard. She is a karaoke wunderkind, natural born storyteller and creative writer. She’s a wine and gin enthusiast and charcuterie builder extraordinaire. Follow her travels on Instagram and at Alwayspacktissues.com Instagram Pinterest Post navigation Previous Previous Avoid These Mistakes During the Holidays and Christmas at Walt Disney World Next Continue Top 10 Fun Florida Mall Activities For Kids of All Ages [the_ad_group id=”53″] The Magazine Orlando Parenting is a resource and a guide for moms, dads and families living in and visiting the Orlando area! Our content is written by local parents, for local parents (and visiting parents, too 🙂 ) (813) 949-4400 info@orlando-parenting.com 320 W. Kennedy Blvd. Suite 220, Tampa FL 33606 Orlando Parenting Things to Do in Orlando with Kids Family Friendly Things to Do in Tampa Bay About Us Subscribe! Get Orlando’s Best Things to Do for Families delivered weekly! Email Submit Please enable JavaScript in your browser to submit the form Visit Our Partners © 2024 Orlando Parenting Magazine.  All rights reserved. Search for: Search Topics Toggle child menu Expand Summer Camp Guide Schools Directory Eats Education Health + Wellness Travel Birthdays Toggle child menu Expand Birthday Party Venues Neighborhoods Theme Parks & Attractions Things To Do About Us The Magazine Toggle Menu Close Search for: Search"
    },
    {
      "url": "https://artists.unitedartscfl.org/educator/orlando-repertory-theatre/",
      "text": "Orlando Family Stage LOGIN REGISTER LOGOUT ACCOUNT MENU ARTISTS Search Directory ARTISTS RESOURCES Call for Artists Grants Career & Volunteer ARTS EDUCATION Login Program Directory Submission Details Resources ARTS & CULTURE CALENDAR ARTISTS Search Directory ARTISTS RESOURCES Call for Artists Grants Career & Volunteer ARTS EDUCATION Login Program Directory Submission Details Resources ARTS & CULTURE CALENDAR Program Provider African Diasporic Arts and Education Albin Polasek Museum & Sculpture Gardens Art & History Museums - Maitland Asian Cultural Association of Central Florida, Inc. Bach Festival Society of Winter Park: FreshStARTs Bronze Kingdom Museum Central Florida Ballet Central Florida Community Arts Central Florida Vocal Arts Chris Kahl Community Clay Connections Crealdé School of Art Dr. Phillips Center for the Performing Arts Flamenco del Sol Holocaust Center Howey Mansion Music Series Ilana Zaks Individual Teaching Artists La ConeXión Mennello Museum of American Art MicheLee Puppets Opera Orlando Orange County Regional History Center, The Orlando Ballet Orlando Family Stage Orlando Fringe Orlando Museum of Art Orlando Philharmonic Orchestra Orlando Science Center Orlando Shakes Osceola County Historical Society Steinway Society of Central Florida Teatro for the Soul Timucua Arts Foundation Voci Dance Wayne Densch Performing Arts Center Winter Garden Heritage Foundation Winter Park Playhouse REACH, The Write To Be Scene Inc Program Type Field Trip In-School Performance In-School Workshops & Classes Online & Streaming Professional Development Residency (including Camps) Student Showcase Opportunities Population Served Pre-K Kindergarten Grade 1 Grade 2 Grade 3 Grade 4 Grade 5 Grade 6 Grade 7 Grade 8 Grade 9 Grade 10 Grade 11 Grade 12 18+ 55+ Subject Fine Arts: Dance Fine Arts: Music Fine Arts: Theatre Fine Arts: Visual Art History Language Arts Math Other Science Social Studies Artistic Discipline Dance Literary Arts Media (film, video, etc.) Multi-discipline Music Storytelling Theatre Visual Arts Cultural Origin African Asian European Latino Middle Eastern Multicultural Native American Other Pacific Islander Educator Type Individual Organization Standards & Benchmarks Bilingual Free Program Specifications ACCESS FUND ELIGIBILE Lake County Public Schools Orange County Public Schools Osceola County Public Schools Seminole County Public Schools SEARCH RESET Advanced Filters Home Educator Orlando Family Stage Facebook Twitter Linkedin Print Orlando Family Stage The Finest in Family Theatre! Orlando Family Stage is a place that promises to create experiences that enlighten, entertain, and rich the lives of family and young audiences. Education Programming at Orlando Family Stage The Youth Academy provides outstanding classes, camps, workshops, and … View more The Finest in Family Theatre! Orlando Family Stage is a place that promises to create experiences that enlighten, entertain, and rich the lives of family and young audiences. Education Programming at Orlando Family Stage The Youth Academy provides outstanding classes, camps, workshops, and performance opportunities for young people. The Youth Academy’s programming consists of a variety of performance and technical classes during the school year and summer. The Academy casts young people in their own full-scale productions, complete with professional directors and designers. Its mission is to provide a professional theatrical experience in an educational environment that is by, for and about young people. For additional questions, please contact the Youth Academy Office at education@orlandofamilystage.com. Field Trips at Orlando Family Stage Whether you are a group of hundreds or a “group” of one, Orlando Family Stage wants to be on your calendar for academic enrichment activities. We welcome all school, community, and family groups! Choose from many different shows throughout the year, all for young audiences. Please contact the Field Trip staff at fieldtrips@orlandofamilystage.com Community Engagement at Orlando Family Stage Orlando Family Stage is dedicated to providing theatre-based opportunities for youth in Central Florida – this work doesn’t stop with our productions! Orlando Family Stage enjoys relationships with a great number of groups serving under served youth to provide in depth, curriculum-based, professional development, and enrichment opportunities. Community Engagement manages a number of programs with one common goal – promoting accessibility to theatre and arts experiences to educators, organizations, and children throughout Central Florida. For more information contact education@orlandofamilystage.com View less Educator CONTACT INFO Email Website 1001 E. Princeton St., Orlando, FL 32803 Orange 407 896 7365 407 218 5020 SELECT A PROGRAM Select Program SELECT A PROGRAM Student Matinees Student Matinees **Only Orange County Public Schools can apply for funding for this program; Lake, Osceola, and Seminole schools can purchase a program if desired. Book This Organization Orlando Repertory Theatre is now Orlando Family Stage! Whether you are a group of hundreds or a group of one, Orlando Family Stage wants to be on your calendar for academic enrichment activities! We serve the Greater Orlando area ... View more **Only Orange County Public Schools can apply for funding for this program; Lake, Osceola, and Seminole schools can purchase a program if desired. Book This Organization Orlando Repertory Theatre is now Orlando Family Stage! Whether you are a group of hundreds or a group of one, Orlando Family Stage wants to be on your calendar for academic enrichment activities! We serve the Greater Orlando area and welcome all school, community, and homeschool groups. Orlando Family Stage is proud to produce professional plays and musicals, often based on beloved children’s literature. Each season runs September through May and reflects options for a variety of age groups. Choose from many different shows throughout the year, all for young audiences! We strive to offer field trips that spark a love for theatre and the arts that will last a lifetime! As part of your field trip experience, Orlando Family Stage also provides complimentary Teacher Resource Guides thoughtfully created by our Education team. These include a full synopsis of each show, activities to encourage deeper learning through arts integration, correlating Florida learning standards, and more! Field trip show times are at 10:30 AM unless otherwise noted, and estimated run times will be available when booking so you can plan accordingly for bus transportation. Orlando Family Stage is located at Loch Haven Park near the heart of Orlando, and there is a beautiful green space available for lunch during your trip. Pack a blanket, and plan for a sunny picnic! Of course, we recommend having a contingency plan just in case of inclement weather. Please request a show and date online on our website! Planning every detail for your outing can be complex, so we aim to make our process as user-friendly and streamlined as possible. Our Group Sales Manager will work with you to schedule your field trip and keep you informed about any upcoming deadlines, such as payment reminders, final count updates, and even a week-of guide for the day of your adventure! Orlando Family Stage is here to help! If you have any questions, please feel free to contact us during business hours at 407.896.7365 or email us anytime at fieldtrips@orlandofamilystage.com Thank you for choosing Orlando Family Stage! View less Booking / scheduling contact Cerise Sweezey 407-896-7365 x225 fieldtrips@orlandofamilystage.com BOOK THIS PROGRAM Program Detail Program type: Field Trip Artistic Discipline: Theatre Subject: Fine Arts: Theatre Population Served Kindergarten, Grade 1, Grade 2, Grade 3, Grade 4, Grade 5, Grade 6, Grade 7, Grade 8, Grade 9, Grade 10, Grade 11, Grade 12 Bilingual: No Available dates: Go, Dog. Go! • ¡Ve, Perro, Ve! Sept 4–Oct 3, 2025 Goosebumps the Musical: Phantom of the Auditorium Sept 29–Oct 31, 2025 Pip-Squeak: An Anti-Bullying Magic Show Oct 14–17, 2025 A Charlie Brown Christmas: Live on Stage Nov 13–Dec 19, 2025 Tiara’s Hat Parade Feb 9–20, 2026 Lilly and the Pirates Feb 16–Mar 9, 2026 Disney Pixar’s Finding Nemo April 7 – May 8, 2026 Available times: Field trip show times are at 10:30 AM unless otherwise noted. Max number of students: 300 Length of :Program 75 Location(s): Orlando Family Stage 1001 E. Princeton Street Orlando, FL 32803 Fees / Ticketing: Tickets are $20 each*. For groups with a minimum of 50 tickets, we offer one complimentary seat for every 10 in your ticket order. *This rate applies for all shows except A Charlie Brown Christmas: Live On Stage. These tickets are $25 each. ARTS EDUCATION ACCESS FUND ACCESS FUND ELIGIBILE: Orange County Public Schools Qualifications Performs criminal background checks on staff with youth contact: Yes Maintains general liability insurance: Yes Provides study guides for teachers and or students: Yes Provide Lesson Plans: Yes Connects to State and or Common Core Curriculum Standards: Yes Provides tools to assess student learning (workshops and residencies): Yes Instructors receive annual professional development training: Yes Provides scholarship and reduced fees: Yes Conducts ongoing assessments of program quality: Yes Standards are customized for every classroom visit: Yes PHOTOS References Cancellation Policy Please contact us at fieldtrips@orlandofamilystage.com for more information. Find Education Programs Search by Keyword Program Provider African Diasporic Arts and Education Albin Polasek Museum & Sculpture Gardens Art & History Museums - Maitland Bach Festival Society of Winter Park: FreshStARTs Central Florida Community Arts Chris Kahl Crealdé School of Art Holocaust Center Ilana Zaks Individual Teaching Artists La ConeXión Mennello Museum of American Art Opera Orlando Orange County Regional History Center, The Orlando Ballet Orlando Family Stage Orlando Fringe Orlando Museum of Art Orlando Philharmonic Orchestra Orlando Science Center Orlando Shakes Osceola County Historical Society Teatro for the Soul Voci Dance Wayne Densch Performing Arts Center Winter Garden Heritage Foundation Program Type Field Trip In-School Performance In-School Workshops & Classes Online & Streaming Professional Development Residency (including Camps) Student Showcase Opportunities Population Served Pre-K Kindergarten Grade 1 Grade 2 Grade 3 Grade 4 Grade 5 Grade 6 Grade 7 Grade 8 Grade 9 Grade 10 Grade 11 Grade 12 18+ 55+ Subject Fine Arts: Dance Fine Arts: Music Fine Arts: Theatre Fine Arts: Visual Art History Language Arts Math Other Science Social Studies Artistic Discipline Dance Literary Arts Media (film, video, etc.) Multi-discipline Music Storytelling Theatre Visual Arts Cultural Origin African European Latino Middle Eastern Multicultural Native American Other Pacific Islander Educator Type Individual Organization Date range Start day End day Standards & Benchmarks Bilingual Free SEARCH RESET FEATURED TESTIMONIALS Our Trustees & Supporters: ABOUT Our Purpose Trustees & Board of Directors Staff Financials & Reports Careers & Volunteer News Contact INITIATIVES Arts Education Diversity in the Arts Community & Neighborhoods Arts Advocacy Cultural Tourism Research ARTS & CULTURE CALENDAR SPOTLIGHT Spotlight Stories Artistry Magazine Donors & Sponsors APPLY FOR FUNDING Search for Arts Grants Grant Resources Apply to Grants SUPPORT Make a Gift Legacy Giving Donate Stocks Workplace Giving Corporate Support Campaign for the Arts Volunteer United ArtsCard Contact CONNECT Facebook-square Instagram Youtube Tiktok Linkedin-in © 2025 United Arts. Built by Vidi Global and Brave . Calendar powered by ARTSOPOLIS . Media Privacy Terms Compliance Board Login Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://orlandoyouthsoccernetwork.com/contactus",
      "text": "Contact  Us | Get In Touch Today — Orlando Youth Soccer Network 0 Skip to Content Home Soccer Schools Soccer School Locations Orlando City Soccer Schools Orlando Pride Soccer Schools Affiliate Program Camps & Clinics Camps & Clinics Summer Camps Pride Fantasy Camp Youth Tournaments Youth Tournaments After School Program Youth Waiver Contact  Us Store Open Menu Close Menu Home Soccer Schools Soccer School Locations Orlando City Soccer Schools Orlando Pride Soccer Schools Affiliate Program Camps & Clinics Camps & Clinics Summer Camps Pride Fantasy Camp Youth Tournaments Youth Tournaments After School Program Youth Waiver Contact  Us Store Open Menu Close Menu Home Folder: Soccer Schools Back Soccer School Locations Orlando City Soccer Schools Orlando Pride Soccer Schools Affiliate Program Folder: Camps & Clinics Back Camps & Clinics Summer Camps Pride Fantasy Camp Folder: Youth Tournaments Back Youth Tournaments After School Program Youth Waiver Contact  Us Store Contact us. 655 W. Church Street Orlando, Florida 32805 Orlando Youth Soccer Network ocysn@orlandocitysc.com Name * First Name Last Name Email * Message * Thank you! Follow our journey. Location 655 W. Church Street Orlando, Florida 32805 Contact Us At: admin@orlandoyouthsoccer.com QUICK LINKS Home Affiliate Soccer School Leagues Contact Us Orlando City Orlando Pride Contact admin@orlandoyouthsoccer.com"
    },
    {
      "url": "https://orlandofamilystage.com/youth-academy-faqs/",
      "text": "Youth Academy FAQs | Orlando Family Stage Skip to content Accessibility Info Contact Get Involved Search for: Orlando Family Stage The Finest in Family Theater Shows & Events Main Menu Shows & Events Whether you are a fan of classic children’s stories or innovative new works, you are sure to find something to love on our stages. Buy Tickets School Field Trips Now Playing Go, Dog. Go! • Ve Perro ¡Ve! Baby & Me: Go, Baby, Go Story Stroll: Oh, The Places You’ll Stroll Goosebumps The Musical: Phantom of the Auditorium Baby & Me: Peek-A-BOO View All More Field Trips Become a Member Group Tickets Plan Your Visit Touring Shows Discounts & Offers Services & Policies Events Previous Shows Resource Go, Dog. Go! • Ve Perro ¡Ve! ... Learn More Youth Academy Main Menu Youth Academy Theatre camps, classes, and experiences where young people grow in empathy, courage, and self-expression through hands-on learning both onstage and off. View Classes Account Login Activities Camps & Classes Teen Perspectives Lab More Auditions Apprentices Financial Aid Teaching Artists Policies & FAQs Arts-Based Learning Main Menu Arts-based Learning Using arts-integration as a tool for learning, teacher professional development, and engagement with other content areas. Learn More Programming Residencies Field Trip Workshops Teacher Professional Development More All Workshops & Residencies Arts Integration In Teacher Professional Development Playwrights for Change Mind Matters About Main Menu About Us Empowering young people to be brave and empathetic by creating quality theatrical experiences. Learn More Our Organization Our Staff Board of Directors EDI Commitment Partnership with UCF MicheLee Puppets Initiative Press Room Blog More Venue Rentals Careers Volunteer Auditions Ticket Donation Requests Join Our Mailing List Sponsor Our Work Latest Press Orlando Family Stage Announces Accessible Performance Dates for 2025–2026 Season Learn More Edyth Bush Charitable Foundation Awards Orlando Family Stage $500,000 Learn More Buy Tickets Donate Contact (407) 896-7365 1001 E. Princeton Street Orlando, FL 32803 Box Office Hours Monday – Friday 9:00am to 5:00pm* Follow Us Facebook Instagram Donate Buy Tickets Youth Academy Frequently Asked Questions For summer camps, what grade do I register my child as? For Summer programs, register your child for the camp based on the grade they are going into the following school year. For example: 'rising' 3rd graders should be registered for a 3rd grade camp. What is the refund and cancellation policy for a class, camp, or Performance Workshop? Classes/Camps/Performance Workshops All withdrawal requests must be sent in writing to [email protected] If a student withdraws from a class before the first day of class, the registration cost is refunded, less the $25 administrative fee. If a student withdraws from a class at any time on or after the day of the program, no refunds are given. The only exception is a medical reason, which requires a physician’s note. In the event of a withdrawal due to a medical issue, the registration fee is prorated, the unused portion is refunded, and the administrative fee waived. Orlando Family Stage reserves the right to alter or cancel scheduled programs as necessary. If a program is cancelled, a full refund of the cancelled program’s tuition is issued. If we must cancel an in-person class prior to the start date due to Covid-19, a full refund is issued within 5-7 business days. If the in-person class is already in session, prorated refunds are issued upon cancellation. What is the refund policy for a Youth Academy Production? Youth Academy Productions All refunds for withdrawal incur a $25 administrative fee. All withdrawal requests must be sent in writing to [email protected] . If a child withdraws from a program before the first day of class, the registration cost is refunded, less the $25 administrative fee. If a student withdraws at any time at or after the first rehearsal and before the third rehearsal, a flat fee of $25 for each scheduled rehearsal day (whether or not attended) is incurred and is deducted from any refund, in addition to the $25 administrative fee. Remaining balances are credited to the original form of payment. No refunds are made after the third rehearsal. Orlando Family Stage reserves the right to alter or cancel scheduled programs as necessary. If a program is canceled, a full refund of the canceled program’s tuition is issued. The only exception is a medical reason, which requires a physician’s note. In the event of a withdrawal due to a medical issue, the registration fee is prorated, the unused portion is refunded, and the administrative fee waived. What is the waitlist policy? Families who join a waitlist are contacted if a spot becomes available in the class. Regardless of placement on the waitlist, Orlando Family Stage cannot guarantee that there will be availability or when availability could happen. If you accept a spot in an additional session of a class you are waitlisted for, you release your initial waitlist placement unless you otherwise request to stay on the initial waitlist. What is the drop-off/pick-up procedure? Drop-Off For safety purposes, please remain in your vehicle with your students throughout the check-in process. Check-in begins 15 minutes prior to your camp’s scheduled start time at the designated Welcome Point. Welcome Points are notated in the Welcome Email from the Education Department. At your scheduled check-in time, report to your assigned Welcome Point, join the car line, and remain in your vehicle. A designated staff member greets you to facilitate the check-in process. Once students have been checked-in, parents should clear the area to expedite other check-ins. Staff members will be available at your designated Welcome Point until 15 minutes after the start of class. If you are running later than 15 minutes, please inform the Education Department by email or phone, and plan to drop your student off at the front of the building (Welcome Point Purple). Pick-Up Camps check-out from their designated Welcome Point at the end of the scheduled camp day. Please report to your assigned Welcome Point, join the car line, and remain in your vehicle. To expedite pick-up, parents are provided two car sheets with their student’s last name to be placed on the dashboard for pick-up. This allows our staff to prepare your student for pick-up when your vehicle approaches the Welcome Point. Parents and approved pick-up individuals must have the provided car sheets displayed on the dashboard when picking up. Approved pick-up individuals without a car sheet displayed are required to present a photo ID to pick-up their student. Photo IDs must match the name on the approved pick-up list. Pick up authorization lists are generated from information collected at registration. Additional names may be added to the pick-up list by emailing [email protected] . A staff member escorts your student to the vehicle for curbside pick-up. Once your student’s pick-up is complete, please clear the area to expedite other pick-ups. Please inform the Education Department if you are running late by either emailing [email protected] , or by calling 407.896.7365 x219 Parents needing to drop-off / pick-up students outside of the normal drop-off / pick-up times may pull up to the main entrance. Self Check-in & Check-out (9-12th grades) 9th-12th grade students may utilize self-check in/out by bringing in a self-check in/out form filled out by a guardian. These are available upon parent request on the first day of class or during registration. Self driving students must have a signed self-check in/out form. Self-check in/out only applies to arrival and dismissal, not breaks during the day. If breaks are long enough that Orlando Family Stage allows students to leave, the education office still needs permission from a parent. What is the dress code? Students should dress in shoes and clothes in which they can comfortably move. We play a variety of theatre games for which dresses/skirts, and sandals/flip-flops are not appropriate. Clunky or excessive jewelry is discouraged. What are Orlando Family Stage's health and medical policies? Please submit info on the Medical Form at registration. Basic first aid, such as adhesive bandages and ice packs, are available. Orlando Family Stage staff does not administer pain relievers or other medications to students. Orlando Family Stage staff is trained to administer Epi-Pens, if necessary. A Severe Allergy Form must be completed for children with Epi Pens. Orlando Family Stage requires emergency telephone numbers on file for parents/guardians, as well as emergency contact numbers for a secondary person when primary contacts cannot be reached. In the event of an emergency, Orlando Family Stage may call 911 for medical attention on behalf of a student. If medical treatment is necessary, every attempt to reach the primary parents/guardians is made. Secondary contacts are a last resort. Can I stay and watch my child's class? Orlando Family Stage does not typically allow parents/guardians into the classroom. Parents are invited to walk their student into check-in, but we ask you to be mindful of the car line traffic. Families and friends are invited to a presentation on the last day of class where students will show off all they have learned and practiced! Do classes and camps have snack and meal breaks? SUMMER CAMPS Half-day 4-5 year old camps have a snack break. 9am-2pm camps have a lunch break in the middle of their day. 9am-4pm camps have a lunch break in the middle of their day and one additional snack break. SCHOOL YEAR CLASSES Performance Workshops and the Youth Academy productions are the only classes that have snack/meal breaks. PLEASE NOTE: Please avoid packing products with peanut or tree-nut ingredients. Thank you for your help in keeping all our students safe and healthy as we have many students with severe nut allergies. Most classes have multiple water breaks in which students may want to have a quick snack if they get hungry often. Snacks are not provided for students who do not bring them, unless specific arrangements have been made between parents and staff. Water bottles are recommended. Students are encouraged to put their name on everything. Do you provide extended care beyond the camp day? Only for Summer and Spring Break and specific camps based on day/availability Extended Care is supervised, but unstructured times offered to assist with family schedules. Extended care may include movies, outside play, or games. Tuition is charged per week and pro-rating is not available. See registration materials for times and cost. Are there auditions for classes? There are no auditions required to register for classes, camps, or Performance Workshops at Orlando Family Stage. Performance Workshops do have a final performance with assigned roles. The students audition for these roles during the first class of the session. Casting is at the discretion of the Teaching Artists for the best possible production and learning experience for the students. Youth Academy productions do require auditions. These auditions are held at the beginning of each semester, usually in August for the fall production (3-8 grades), January for the spring production (3-8 grades), and April/May for the summer production (7-12 grades). You can find more information here. Is there a final presentation? Yes! Camp presentations are intended to be lively presentations of class work. Families and friends of presenting students are invited to join us for this celebration of their Youth Academy experience. Presentations occur on the last day of camp. Exact times for these presentations are announced on the first day of camp. Students should arrive for camp at their usual time. Parents are invited to enter the theatre at the presentation time and students may be signed out once their presentation is over. Experience the Magic of Theatre Don't miss out on the magic. Grab your tickets now and make unforgettable memories at Orlando Family Stage! Buy Tickets Orlando Repertory Theatre (Orlando REP) has changed its name to Orlando Family Stage. Founded in 1926, Orlando Family Stage is the seventh iteration of the original theatre company and has operated for the past 20 years as Florida’s only professional theatre for young audiences. Contact (407) 896-7365 1001 E. Princeton Street Orlando, FL 32803 Box Office Hours Monday – Friday 9:00am to 5:00pm* Follow Us Facebook Instagram Shows & Events Shows Field Trips Become a Member PatronPortal Events Previous Shows Youth Academy Camps and Classes Productions Residencies UCF MFA Program Account Login Art-based Learning Workshops Field Trips Resource Guides About About Us Contact Buy Tickets Get Involved Press Room Ticket Donation Requests © 2025 Orlando Family Stage. All Rights Reserved. Web Design by Terms & Conditions Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Accessibility Info Accessibility Info"
    },
    {
      "url": "https://orlandofamilystage.com/get-involved/careers/",
      "text": "Careers at Orlando Family Stage Skip to content Accessibility Info Contact Get Involved Search for: Orlando Family Stage The Finest in Family Theater Shows & Events Main Menu Shows & Events Whether you are a fan of classic children’s stories or innovative new works, you are sure to find something to love on our stages. Buy Tickets School Field Trips Now Playing Go, Dog. Go! • Ve Perro ¡Ve! Baby & Me: Go, Baby, Go Story Stroll: Oh, The Places You’ll Stroll Goosebumps The Musical: Phantom of the Auditorium Baby & Me: Peek-A-BOO View All More Field Trips Become a Member Group Tickets Plan Your Visit Touring Shows Discounts & Offers Services & Policies Events Previous Shows Resource Go, Dog. Go! • Ve Perro ¡Ve! ... Learn More Youth Academy Main Menu Youth Academy Theatre camps, classes, and experiences where young people grow in empathy, courage, and self-expression through hands-on learning both onstage and off. View Classes Account Login Activities Camps & Classes Teen Perspectives Lab More Auditions Apprentices Financial Aid Teaching Artists Policies & FAQs Arts-Based Learning Main Menu Arts-based Learning Using arts-integration as a tool for learning, teacher professional development, and engagement with other content areas. Learn More Programming Residencies Field Trip Workshops Teacher Professional Development More All Workshops & Residencies Arts Integration In Teacher Professional Development Playwrights for Change Mind Matters About Main Menu About Us Empowering young people to be brave and empathetic by creating quality theatrical experiences. Learn More Our Organization Our Staff Board of Directors EDI Commitment Partnership with UCF MicheLee Puppets Initiative Press Room Blog More Venue Rentals Careers Volunteer Auditions Ticket Donation Requests Join Our Mailing List Sponsor Our Work Latest Press Orlando Family Stage Announces Accessible Performance Dates for 2025–2026 Season Learn More Edyth Bush Charitable Foundation Awards Orlando Family Stage $500,000 Learn More Buy Tickets Donate Contact (407) 896-7365 1001 E. Princeton Street Orlando, FL 32803 Box Office Hours Monday – Friday 9:00am to 5:00pm* Follow Us Facebook Instagram Donate Buy Tickets Orlando Family Stage Careers Orlando Family Stage, one of Central Florida’s oldest arts groups, is the State of Florida’s only professional Theatre for Young Audiences (TYA), and the eighth iteration of a company founded in 1926. Each year, we reach over 100,000 individuals in our three-theatre facility and in the community through our season of professional productions, a Youth Academy of camps and classes, and innovative educational and community engagement programming. We work closely with the University of Central Florida in many different capacities – most notably, hosting the Master of Fine Arts program in Theatre for Young Audiences. Our mission is to empower young people to be brave and empathetic by creating quality theatrical experiences. We continuously strive to build and maintain a team that reflects and represents the diverse community we serve. Orlando Family Stage is an equal opportunity employer and as such, we consider individuals for employment according to their abilities and performance. Employment decisions are made without regard to race, age, religion, color, gender, sexual orientation, national origin, physical or mental disability, marital or veteran status, or any other classification protected by law. CLICK HERE for more information on the many ways to get involved with Orlando Family Stage! Staff Positions Patron Services Manager Job Summary: The Patron Services Manager (full-time, year-round) ensures the highest level of patron satisfaction by managing all aspects of the Box Office of Orlando Family Stage.  This role requires exceptional customer service, operational excellence, and a visible commitment to inclusion. Bilingual English-Spanish skills are highly valued, reflecting our diverse patron community. The Patron Services Manager oversees ticket and membership sales, collaborates with staff across departments, and actively builds loyalty through personal engagement, innovative practices, and a welcoming environment for all. The Patron Services Manager reports directly to the Director of Patron Engagement. Individual Duties and Responsibilities: Manage the Box Office daily operation: Sell single tickets, special event admissions, and process donations for all Orlando Family Stage events Process Group Sale and Field Trip reservations and payments Build patron loyalty by providing excellent customer service Ensure accurate financials by overseeing and reporting daily transactions and deposits Consistently review all Box Office daily procedures Maintain ticketing database and stay current with new functions and procedures Train all box office personnel Manage current and future Members: Encourage deeper engagement by building strong relationships with Members and loyal patrons Encourage and process donations during ticket purchases Assist in developing new Membership programs and benefits Be an active participant in each patron’s experience Manage Box Office administration: Work closely with the Front of House Manager to maintain the appropriate amount and correct denominations of petty cash to be used for ticket, merchandise, and concession sales Manage cash handling procedures for on-site ticket sales by supervising Box Office cash drawer set up, cash out, and end of day sales reporting procedures Facilitate secondary review of end of day sales deposit reports to be provided to the Accounting Manager by confirming accuracy and resolving and reporting any discrepancies Maintain accurate record keeping of cash handling procedures in compliance with Orlando Family Stage revenue management standards Oversee all complimentary ticket requests for non-profits, schools, and community partners Collaborate with all departments to manage the box office operation for all Orlando Family Stage events Direct reports include Part-time and Seasonal Box Office Staff Additional duties and special projects as assigned Operations Team Duties and Responsibilities: Process ticket sales, purchases, donations, and rental payments as needed Serve as the first point of contact for inbound calls and onsite visitors to Orlando Family Stage Provide concierge level service to all visitors Ensure the highest quality of phone etiquette and customer service for all patrons and volunteers Keep the lobbies and Front of House areas clean and presentable Support Director of Patron Engagement and Sr Director of Operations with maintaining the ticketing system including event creation and various event settings and updates Manage mail, packages, and other front of house administration as needed Maintain confidentiality on all aspects related to the organization Work night and weekend hours as required by Orlando Family Stage programming Desired Qualifications: Demonstrated previous experience in performing arts administration or front of house operations Strong understanding of box office and ticketing procedures Demonstrated ability to responsibly and accurately handle cash and other financial transactions Excellent interpersonal skills and strong customer service experience Represent an example of honesty and integrity Ability to work in a fast-paced environment while maintaining strict attention to detail Strong written and verbal communications Bilingual (English/Spanish) highly preferred Compensation and Benefits: At Orlando Family Stage, we work hard to provide competitive compensation and benefits to our employees. Our salaries are enhanced with valuable benefits, including health insurance, retirement plan with matching, and paid time off. Starting Salary for this position: (Tier 4 – Manager) $40,000 annually or $19.23 per hour Health Insurance Package Paid Vacation and Sick Time Off 401k Retirement plan – Orlando Family Stage matches up to 3.5% Optional Short-term Disability, Vision, Dental plans To apply, please send your cover letter and resume by email to [email protected] with the subject line: Patron Services Manager Application 2025 by September 24, 2025. Director of Scenery (Technical Director) Job Summary: Under the direction of the Sr. Director of Production, the Director of Scenery (full-time, year-round) will maintain Orlando Family Stage’s high standard for safety and craftsmanship while leading the scenic department and overseeing the full life cycle of scenic productions – budgeting, drafting, building, installing, and striking scenery for Orlando Family Stage productions.  Although titled Director of Scenery, this role aligns with industry standards and is equivalent in scope and responsibility to that of a Technical Director. Individual Duties and Responsibilities: Oversee all aspects of scenic production, including the build, installation, and strike of scenery for all productions and related projects while ensuring safety and craftmanship are top priorities throughout the process. Lead contractors and seasonal employees in the scene shop and scenic art, as well as the full time Scene Shop Manager and Scene Shop Coordinator. Create budget estimates and build schedules for scenic elements in Orlando Family Stage productions and other related projects. Create construction drawings based on Scenic Designers’ artistic drawings, as well as delegate drafting projects to the Scene Shop Manager. Collaborate with the creative team and production staff to establish technical needs as it pertains to scenery. Assist in the creation of technical solutions for the construction and function of scenic elements. Hire scenic carpenters, painters, and artisans as needed to support build schedules. Verify and submit weekly time sheets for hourly employees. Work occasional nights and weekends. Serve as shopper/buyer for scenic elements on all productions and related projects. Additional duties and special projects as assigned. Production Team Duties and Responsibilities: Attend all Production Meetings, Designer Runs, Technical Rehearsals, Dress Rehearsals, Production Staff Meetings, and Staff Meetings. Retain confidentiality on all aspects related to the organization, performers, and staff. Have a strong knowledge of all Orlando Family Stage productions. Maintain a safe, efficient, organized, and clean working environment in all production spaces, backstage areas, and shops. Desired Qualifications: Ability to read and interpret designer drawings, and create construction drawings. Proficient in 2D and 3D drafting (AutoCAD, Vectorworks, SketchUp, etc). Extremely proficient in carpentry using various sheet materials (e.g. plywood, MDF, masonite, plexiglass) and stick lumber. Extremely proficient in theatrical rigging practice and hardware. Knowledgeable in various scenic art techniques (scenic painting, faux finishes, etc), mold making, and working with atypical scenery materials such as foam or fiberglass. Proficient in metalworking and MIG welding. Knowledgeable in using scenic fabrics for various tasks (e.g. muslin, burlap, duvetyn, velour, scrim) and basic sewing skills. Previous experience working in a theatrical scene shop environment. Strong and demonstrated ability to collaborate with a production team, work independently, and lead a crew. Ability to remain calm and collected under pressure. Demonstrated leadership, management, and organization skills. Demonstrated ability to meet deadlines and follow schedules. Valid driver’s license and comfortable driving a cargo van. Ability to work in an environment that requires standing, bending, crawling, climbing, crouching, kneeling, pushing, pulling, and lifting 50lbs for extended periods Ability to climb ladders and stairs, as well as work at significant elevations (e.g., theatre grid or genie upright lift) Familiarity with OSHA safety standards and best practices, and a dedicated commitment to maintaining a safe work environment for all employees. Compensation and Benefits: At Orlando Family Stage, we work hard to provide competitive compensation and benefits to our employees. Our salaries are enhanced with valuable benefits, including health insurance, retirement plan with matching, and paid time off. Starting Salary: (Tier 3 – Director) $50,000 annually or $24.04 per hour Health Insurance Package Paid Vacation and Sick Time Off 401k Retirement Plan – Orlando Family Stage matches up to 3.5% Optional Short-term Disability, Vision, and Dental plans To apply, please send your cover letter and resume by email to [email protected] with the subject line: Director of Scenery Application 2025 by September 8, 2025. Seasonal and Contract Positions Orlando Family Stage is always accepting resumes for a variety of seasonal and contracted roles: Assistant Stage Managers Job Summary: Assistant Stage Managers assist with maintaining the high production value for Orlando Family Stage’s productions. Assistant Stage Managers are classified as Seasonal Employees and work closely with and report to Production Stage Managers and the Sr. Director of Production. Individual Duties and Responsibilities: Record blocking and choreography during rehearsals Track scenic, prop, and costume elements during rehearsals, and create and maintain tracking documents Create and maintain run notes Assist with line notes for performers Oversee production crew members during tech and performances Complete pre-show checks and provide maintenance for props and scenic elements, including performing minor repairs as needed Complete prop, scenic, and costume presets Assist performers with putting on and taking off microphones Assist with scene changes, costume changes prop hand-offs, deck cues, and fly cues Additional duties as assigned Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Previous experience creating run notes and tracking documents Previous experience in a theatrical rehearsal setting Previous experience as an Assistant Stage Manager or serving on backstage crew Capable of bending, pushing, and pulling movements Ability to climb ladders and stairs Ability to stand for long periods of time Capable of lifting up to 50lbs Prior experience operating a fly system is preferred Schedule: Assistant Stage Managers are required to attend all rehearsals, technical rehearsals, and performances.  The typical rehearsal schedule is Monday through Friday from 10am-6pm.  The typical performance schedule is Mondays, Tuesdays, Thursdays, and Fridays at 10:30am; Saturdays at 2pm and 5:30pm; Sundays at 10:30am and 2pm.  Wednesdays are dark. Compensation: Assistant Stage Managers are Seasonal Employees hired on a per contract basis and paid weekly.  The weekly rate for this position is $480. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Assistant Stage Manager . Backstage Run Crew Job Summary: Backstage Run Crew Members assist with maintaining the high production value for Orlando Family Stage’s productions. Backstage Run Crew Members are classified as Seasonal Employees and work closely with and report to Production Stage Managers. Individual Duties and Responsibilities: Assist with sweeping and mopping of the stage Complete pre-show checks and provide maintenance for props and scenic elements, including performing minor repairs as needed Complete prop, scenic, and costume presets Assist performers with putting on and taking off microphones Assist performers with costume quick changes during performances Complete scene changes, prop hand-offs, deck cues, and fly cues as assigned Additional duties as assigned Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Capable of bending, pushing, and pulling movements Ability to climb ladders and stairs Ability to stand for long periods of time Capable of lifting up to 50lbs Prior experience operating a fly system is preferred Basic carpentry skills are preferred Schedule: Backstage Run Crew Members are required to attend all technical rehearsals and performances.  The typical performance schedule is Mondays, Tuesdays, Thursdays, and Fridays at 10:30am; Saturdays at 2pm and 5:30pm; Sundays at 10:30am and 2pm.  Wednesdays are dark. Compensation: Backstage Run Members are Seasonal Employees hired on a per contract basis and paid weekly.  The weekly rate for this position is $455. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Backstage Run Crew Application . Carpenters Job Summary: Carpenters will support Orlando Family Stage’s production department with the build, installation, and strike of theatrical scenery while maintaining Orlando Family Stage’s high standard for safety and craftsmanship.  Carpenters are classified as Seasonal Employees and work closely with and report to the Scene Shop Coordinator and the Scenic Manager. Individual Duties and Responsibilities: Read and interpret shop drawings and renderings Use a variety of tools, processes, and materials to construct theatrical scenery Assist with the installation and strike of scenic elements Additional duties and special projects as assigned Production Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Ability to read and interpret shop drawings Proficient in stage carpentry using various sheet materials (e.g. plywood, MDF, masonite, plexiglass) and stick lumber Knowledge of theatrical rigging hardware and procedures Experience with theatrical counterweighted fly systems, including operating, loading, and adjustments of scenery, softgoods, and lighting equipment Ability to lift 50lbs, comfortable working at heights of 20ft+, comfortable with ladders, stairs and personal lifts Ability to stand for long periods of time Experience in metalworking, MIG welding, rigging, and foam carving preferred Ability to manage time effectively Ability to communicate with other team members concerning problems and possible solutions Compensation: Carpenters are Seasonal Employees hired on a per contract basis and paid hourly.  The starting hourly rate for this position starts at $15 per hour. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Carpenter . Costume Technicians Job Summary: Costume Technicians will support Orlando Family Stage’s production department with the execution of costume designs, including alterations and the construction of garments.  Costume Technicians are classified as Seasonal Employees and work closely with and report to the Costume Shop Coordinator and Costume Shop Manager. Individual Duties and Responsibilities: Alteration of commercial and original patterns Cutting fabric based on patterns and prepare pieces for construction Costume construction, alteration, and finishing work using both hand and machine stitching Assistant with fittings as needed Assisting with millinery, dye projects, and craft projects as needed Additional duties and special projects as assigned Production Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Experience in a variety of machine sewing techniques (domestic & industrial) Experience in a variety of hand sewing techniques Ability to manage time effectively Ability to perform maintenance of personal work area, including sewing machinery as necessary to keep work moving effectively Ability to communicate with other team members concerning problems and possible solutions Good interpersonal and communication skills Patterning, draping, and/or millinery skills are a plus Compensation: Costume Technicians are Seasonal Employees hired on a per contract basis and paid hourly.  The starting hourly rate for this position is $15 per hour. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Costume Technician . Light Board Operators Job Summary: Light Board Operators support the Orlando Family Stage production department by maintaining the high quality of lighting effects for Orlando Family Stage’s productions.  Light Board Operators are classified as Seasonal Employees and work closely with and report to Production Stage Managers. Individual Duties and Responsibilities: Complete pre-show checks and maintain/troubleshoot all lighting equipment before each performance, including dimmer checks, replacing gels, replacing lamps, performing focus notes, etc. Operate the light board during performances Complete shutdown procedures for all lighting equipment after each performance Additional duties as assigned Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: A working knowledge of ETC Ion and EOS family lighting consoles, including general operation and basic programming commands The ability to troubleshoot conventional and intelligent lighting fixtures, such as Chauvet, Vari-Lite, Elation, Martin brands A working knowledge of networked, DMX, and wireless control systems The ability to troubleshoot and maintain atmospheric equipment, such as foggers and hazers Ability to lift up to 50lbs, comfortable working at heights of 20ft+, comfortable with ladders, stairs and personal lifts Schedule: Light Board Operators are required to attend all technical rehearsals and performances.  The typical performance schedule is Mondays, Tuesdays, Thursdays, and Fridays at 10:30am; Saturdays at 2pm and 5:30pm; Sundays at 10:30am and 2pm.  Wednesdays are dark. Compensation: Light Board Operators are Seasonal Employees hired on a per contract basis and paid weekly.  The weekly rate for this position is $455. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Light Board Operator . Lighting Technicians Job Summary: Lighting Technicians will support Orlando Family Stage’s production department with the execution of theatrical lighting installation, hangs, and focuses.  Lighting Technicians are classified as Seasonal Employees and work closely with and report to the Production Technology Manager and Director of Production Technology. Individual Duties and Responsibilities: Assist with the preparation, installation, and focus of theatrical lighting instruments Assist with the installation and troubleshooting of atmospheric and special effects equipment, such as practicals, foggers, hazers, strobes, LED Tape, pixel-mappable products, etc. Additional duties and special projects as assigned Production Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Demonstrated proficiency with conventional lighting fixtures Knowledgeable of automated/intelligent lighting fixtures Knowledgeable of DMX and wireless DMX standards Knowledgeable of special effects equipment Ability to read and interpret theatrical lighting plots Ability to lift 50lbs, comfortable working at heights of 20ft+, comfortable with ladders, stairs and personal lifts Ability to manage time effectively Ability to communicate with other team members concerning problems and possible solutions Compensation: Lighting Technicians are Seasonal Employees hired on a per contract basis and paid hourly. The starting hourly rate for this position is $15 per hour. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Lighting Technician . Props Technicians Job Summary: Props Technicians will support Orlando Family Stage’s production department with the procurement and creation of show props while maintaining Orlando Family Stage’s high standard for safety and craftmanship.  Props Technicians are classified as Seasonal Employees and work closely with and report to the Props Manager. Individual Duties and Responsibilities: Use a variety of tools, processes, and materials to build, craft, and alter show props Pull and restock props from Orlando Family Stage stock Assist with the organization and maintenance of prop stock and shop inventory Additional duties and special projects as assigned Production Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Carpentry experience using a variety of hand and power tools (e.g. drills/screw guns, Dremel, drill press, sanders, saws, hot glue guns, pneumatic staplers, etc.) Experience in scenic art and various painting techniques Knowledgeable in crafting techniques, sculpting, molding, casting, upholstery, and foam work (Bead-foam, Pink Foam, EVA and other closed-cell foam) Ability to sew using hand stitching techniques and on sewing machines Ability to lift 30-50lbs and to stand for long periods of time Ability to manage time effectively Ability to communicate with other team members concerning problems and possible solutions Compensation: Props Technicians are Seasonal Employees hired on a per contract basis and paid hourly.  The starting hourly rate for this position is $15 per hour. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Props Technician . Sound Board Operators Job Summary: Sound Board Operators support the Orlando Family Stage production department by maintaining the high quality of audio for Orlando Family Stage’s productions.  Sound Board Operators are classified as Seasonal Employees and work closely with and report to Production Stage Managers. Individual Duties and Responsibilities: Install and patch microphone receivers Program and operate a Yamaha QL5 digital mixing console Complete pre-show checks and maintain/troubleshoot all audio equipment before each performance, including audience assisted listening devices, audio and video monitors, cue lights, headsets and communication systems, and production microphones Prep production microphones and assist performers in putting on and taking off microphones Complete shutdown procedures for all audio equipment after each performance Additional duties as assigned Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Experience mixing up to 24 wireless microphones Comfortable mixing live bands and pre-recorded tracked music Knowledgeable in the setup and troubleshooting of wireless microphones and RF frequencies Knowledgeable of theatrical sound systems and equipment, including speakers, microphones, amplifiers, EQ and processing gear, QLab, Dante, and the Yamaha QL5 audio console Ability to up to lift 50lbs, comfortable working at heights of 20ft+, comfortable with ladders, stairs and personal lifts Schedule: Sound Board Operators are required to attend all technical rehearsals and performances.  The typical performance schedule is Mondays, Tuesdays, Thursdays, and Fridays at 10:30am; Saturdays at 2pm & 5:30pm; and Sundays at 10:30am and 2pm.  Wednesdays are dark. Compensation: Sound Board Operators are Seasonal Employees hired on a per contract basis and paid weekly.  The weekly rate for this position is $515. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Sound Board Operator . Spot Light Operators Job Summary: Spot Light Operators assist with maintaining the high production value for Orlando Family Stage’s productions.  Spot Light Operators are classified as Seasonal Employees and work closely with and report to Production Stage Managers. Individual Duties and Responsibilities: Assist with the pre-show checks and maintenance of the lighting equipment before each performance, including lamp check, dimmer check, replacing gels, replacing lamps, performing focus notes, etc. Assist with prop, scenic, and costume presets Assist with sweeping and mopping of the stage Operate the spot light during performances Assist with shutdown procedures for the lighting equipment after each performance Additional duties as assigned Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Ability to climb ladders, stairs, and stand for long periods of time Ability to lift up to 50lbs Comfortable working on personal lifts and at heights of 20ft+ The ability to troubleshoot conventional lighting fixtures is preferred Previous experience operating Lycian SuperArc 400 is preferred Schedule: Spot Light Operators are required to attend all technical rehearsals and performances.  The typical performance schedule is Mondays, Tuesdays, Thursdays, and Fridays at 10:30am; Saturdays at 2pm and 5:30pm; Sundays at 10:30am and 2pm.  Wednesdays are dark. Compensation: Spot Light Operators are Seasonal Employees hired on a per contract basis and paid weekly.  The weekly rate for this position is $455. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Spot Light Operator . Stage Managers Job Summary: Stage Managers assist with maintaining the high production value for Orlando Family Stage’s productions. Stage Managers are classified as Seasonal Employees and work closely with and report to the Sr. Director of Production. Individual Duties and Responsibilities: Prepare the rehearsal space for rehearsals, including taping out dimensions of the set on the floor and gathering rehearsal props, furniture, and costume pieces Take notes and generate production meeting, rehearsal, and performance reports Record blocking and choreography during rehearsals Track scenic, prop, and costume elements during rehearsals, and create and maintain tracking documents Create and maintain run notes Assist with line notes for performers Oversee cast and crew during tech and performances Operate QLab during performances and call all lighting cues, deck cues, and fly cues Maintain the artistic integrity of the production Additional duties as assigned Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Previous experience creating run notes and tracking documents Previous experience as an Assistant Stage Manager Capable of bending, pushing, and pulling movements Ability to climb ladders and stairs Ability to stand for long periods of time Knowledgeable of QLab software Schedule: Stage Managers are required to attend all rehearsals, technical rehearsals, and performances.  The typical rehearsal schedule is Monday through Friday from 10am-6pm.  The typical performance schedule is Mondays, Tuesdays, Thursdays, and Fridays at 10:30am; Saturdays at 2pm and 5:30pm; Sundays at 10:30am and 2pm. Wednesdays are dark. Compensation: Stage Managers are Seasonal Employees hired on a per contract basis and paid weekly.  The weekly rate for this position is $515. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. To apply, please send your cover letter and resume by email to [email protected] with the subject line: Stage Manager . Teaching Artists Job Summary: The Teaching Artist is responsible for inspiring and educating the young people in their assigned classes. Teaching Artists serve as a positive representative for Orlando Family Stage with a commitment to our mission of building bravery and empathy in young people. Teaching Artist roles exist within our: Youth Academy camps, classes, and workshops for performance, tech, and design skills. Arts Integration Residencies and Professional Development Dual Language Story Drama Youth Academy Productions, Teen Perspectives Lab, and Design and Tech Academy. Duties and Responsibilities: Develop, write, and submit age & contextually appropriate lesson plans based on Curriculum Guides and Florida State standards (in collaboration with co-teachers where required) Maintain a safe learning environment by supporting student well-being, confidence, and personal growth Manage classroom behavior, procedures, and assessments Manage student arrival and departure Maintain administrative documents Support program evaluation Attend all required meetings and training sessions Collaborate with Co-Teaching Artists and Student Apprentices (when applicable) Facilitate final class presentations Follow and enforce all health and safety policies outlined by Orlando Family Stage and any participating partners (where applicable) Desired Qualifications: Prior work leading youth required Demonstrated experience in theater or other performing arts preferred Ability to pass a background check required Commitment to Orlando Family Stage’s philosophy of helping students find purpose through performance by creating a collaborative safe space that encourages growth, passion, courage, and perseverance through the theatre arts. We invest in imagination and creativity through programming that allows students to be seen, heard, and understood as they are and who they want to be. Compensation: Varies based on type and length of workshop, class, or camp. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. Interested applicants should send a resume to [email protected] with the subject line: Teaching Artist Application . Wardrobe Crew Job Summary: Wardrobe Crew Members are responsible for the overall execution and implementation of the running and maintenance of costumes and wigs during a production at Orlando Family Stage.  The Wardrobe Crew Members are classified as Seasonal Employees and report to the Costume Shop and production Stage Managers. Individual Duties and Responsibilities: Assist performers with costume changes before, during, and after performances Assist performers with wig and/or make-up application Perform costume care and maintenance on all garments and accessories associated with the production, including laundry, spot cleaning, pressing, and steaming Perform minor repairs and stitching as needed Maintain wigs, including minor style touch-ups as needed Maintain dressing plots and costume related production paperwork Maintain costume inventory and dressing room spaces Communicate costume related notes with Stage Management and Costume Shop Assist with the run crew with scene changes, prop hand-offs, etc. as needed Additional duties as assigned Team Duties and Responsibilities: Retain confidentiality on all aspects related to the organization, performers, and staff Maintain a safe, efficient, organized, and clean working environment Desired Qualifications: Experience in Costume Production and/or Wardrobe Crew Experience in basic machine and hand sewing Experience with wigs and make-up Ability to remain calm under pressure Ability to troubleshoot and problem solve quickly Ability to work in a fast pace environment while maintaining strict attention to detail Strong communication skills Schedule: Wardrobe Crew Members are required to attend all technical rehearsals and performances.  The typical performance schedule is Mondays, Tuesdays, Thursdays, and Fridays at 10:30am; Saturdays at 2pm and 5:30pm; Sundays at 10:30am and 2pm.  Wednesdays are dark. Compensation: Wardrobe Crew Members are Seasonal Employees hired on a per contract basis and paid weekly.  The weekly rate for this position is $455. Orlando Family Stage will deduct the appropriate taxes from weekly payments and Seasonal Employees may opt for Direct Deposit payments. Interested applicants should send a resume to [email protected] with the subject line: Wardrobe Crew Application . Experience the Magic of Theatre Don't miss out on the magic. Grab your tickets now and make unforgettable memories at Orlando Family Stage! Buy Tickets Orlando Repertory Theatre (Orlando REP) has changed its name to Orlando Family Stage. Founded in 1926, Orlando Family Stage is the seventh iteration of the original theatre company and has operated for the past 20 years as Florida’s only professional theatre for young audiences. Contact (407) 896-7365 1001 E. Princeton Street Orlando, FL 32803 Box Office Hours Monday – Friday 9:00am to 5:00pm* Follow Us Facebook Instagram Shows & Events Shows Field Trips Become a Member PatronPortal Events Previous Shows Youth Academy Camps and Classes Productions Residencies UCF MFA Program Account Login Art-based Learning Workshops Field Trips Resource Guides About About Us Contact Buy Tickets Get Involved Press Room Ticket Donation Requests © 2025 Orlando Family Stage. All Rights Reserved. Web Design by Terms & Conditions Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Accessibility Info Accessibility Info"
    },
    {
      "url": "https://artsinorlando.com/organization/orlando-repertory-theatre/",
      "text": "Orlando Family Stage - Central Florida's Arts & Culture Calendar LOGIN REGISTER LOGOUT ACCOUNT SEARCH MENU Local Guides Cultural Tours Museums Theatre Music & Dance Festivals Culinary Arts Artsy Hotels Shows & Events Free Music Dance Theatre Visual Arts Attractions Literature Science & Nature History & Heritage Eats & Drinks Age Specific Early Childhood (0-5) Family Kid-Friendly Students Young Professionals Seniors Camps & Workshops Camps Dance Workshop Music Workshop Studio Art Workshop Theatre Workshop Hire An Artist Blog About Local Guides Cultural Tours Museums Theatre Music & Dance Festivals Culinary Arts Artsy Hotels Shows & Events Free Music Dance Theatre Visual Arts Attractions Literature Science & Nature History & Heritage Eats & Drinks Age Specific Early Childhood (0-5) Family Kid-Friendly Students Young Professionals Seniors Camps & Workshops Camps Dance Workshop Music Workshop Studio Art Workshop Theatre Workshop Hire An Artist Blog About Organization Type Association/Club/Group Commercial Business Corporation CT Funded Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Government History/Heritage Kids/Family Library Literature/Poetry Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Traditional Arts Travel Visual Arts City/Town Altamonte Springs Alturas Apopka Astatula Auburndale Babson Park Barberville Bartow Bradley Cape Canaveral Cassadaga Casselberry Christmas Clarcona Clermont Cocoa Cocoa Beach Davenport Daytona Beach De Leon Springs Debary Deland Deltona Dundee Eagle Lake Eaton Park Edgewater Eustis Fedhaven Ferndale Fort Meade Frostproof Geneva Glenwood Goldenrod Gotha Grand Island Grant Groveland Haines City Highland City Homeland Howey in the Hills Indialantic Indian Lake Estates Intercession City Kenansville Killarney Kissimmee Lady Lake Lake Alfred Lake Hamilton Lake Helen Lake Mary Lake Monroe Lake Wales Lakeland Leesburg Longwood Loughman Maitland Malabar Mascotte Melbourne Melbourne Beach Merritt Island Mid Florida Minneola Montverde Mount Dora Nalcrest New Smyrna Beach Nichols Oak Hill Oakland Ocoee Okahumpka Ona Orange City Orlando Ormond Beach Oviedo Paisley Palm Bay Patrick Air Force Base Plymouth Port Orange River Ranch Rockledge Saint Cloud Sanford Satellite Beach Scottsmoor Sebastian Seville Sharpes Tangerine Tavares Titusville Waverly Windermere Winter Garden Winter Haven Winter Park Winter Springs Yalaha Zellwood Zip/Postal Code 32105 32114 32115 32116 32117 32118 32119 32120 32121 32122 32123 32124 32125 32126 32127 32128 32129 32130 32132 32141 32158 32159 32162 32168 32169 32170 32173 32174 32175 32176 32190 32198 32701 32703 32704 32706 32707 32708 32709 32710 32712 32713 32714 32715 32716 32718 32719 32720 32721 32722 32723 32724 32725 32726 32727 32728 32730 32732 32733 32735 32736 32738 32739 32744 32745 32746 32747 32750 32751 32752 32753 32756 32757 32759 32762 32763 32765 32766 32767 32768 32771 32772 32773 32774 32775 32777 32778 32779 32780 32781 32782 32783 32789 32790 32791 32792 32793 32794 32795 32796 32798 32799 32801 32802 32803 32804 32805 32806 32807 32808 32809 32810 32811 32812 32814 32815 32816 32817 32818 32819 32820 32821 32822 32824 32825 32826 32827 32828 32829 32830 32831 32832 32833 32834 32835 32836 32837 32839 32853 32854 32855 32856 32857 32858 32859 32860 32861 32862 32867 32868 32869 32872 32877 32878 32885 32886 32887 32890 32891 32893 32896 32897 32898 32899 32901 32902 32903 32904 32905 32906 32907 32908 32909 32910 32911 32912 32919 32920 32922 32923 32924 32925 32926 32927 32931 32932 32934 32935 32936 32937 32940 32941 32949 32950 32951 32952 32953 32954 32955 32956 32958 32959 32976 32978 33801 33802 33803 33804 33805 33806 33807 33809 33810 33811 33813 33815 33820 33823 33827 33830 33831 33835 33836 33837 33838 33839 33840 33841 33843 33844 33845 33846 33847 33848 33850 33851 33853 33854 33855 33856 33858 33859 33863 33865 33867 33877 33880 33881 33882 33883 33884 33885 33888 33896 33897 33898 34705 34711 34712 34713 34729 34734 34736 34737 34739 34740 34741 34742 34743 34744 34745 34746 34747 34748 34749 34753 34755 34756 34758 34759 34760 34761 34762 34769 34770 34771 34772 34773 34777 34778 34786 34787 34788 34789 34797 SEARCH Advanced Filters Home Organization Orlando Family Stage Facebook Twitter Linkedin Print Orlando Family Stage The Orlando Family Stage provides quality family entertainment and educational programs to Central Floridians through its professional productions, youth academy classes, and arts based learning programs. Orlando Family Stage’s mission is to empower young people to be brave and empathetic by creating quality theatrical experiences. The Orlando Family Stage provides quality family entertainment and educational programs to Central Floridians through its professional productions, youth academy classes, and arts based learning programs. Orlando Family Stage’s mission is to empower young people to be brave and empathetic by creating quality theatrical experiences. View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: CT Funded ; Educational ; Kids/Family ; Performing Arts ; Theatre UPCOMING EVENTS PAST EVENTS Go, Dog. Go! • Ve Perro ¡Ve! Presented by Orlando Family Stage at Orlando Family Stage Sep 6 - Oct 5, 2025 Accessibility Info Facebook Twitter Linkedin BUY TICKETS Goosebumps The Musical: Phantom of the Auditorium Presented by Orlando Family Stage at Orlando Family Stage Oct 4 - Nov 2, 2025 Accessibility Info Facebook Twitter Linkedin BUY TICKETS A Charlie Brown Christmas: Live on Stage Presented by Orlando Family Stage at Orlando Family Stage Nov 24 - Dec 23, 2025 Accessibility Info Facebook Twitter Linkedin BUY TICKETS Tiara’s Hat Parade Presented by Orlando Family Stage at Orlando Family Stage Feb 7 - Feb 15, 2026 Accessibility Info Facebook Twitter Linkedin BUY TICKETS Lilly and the Pirates Presented by Orlando Family Stage at Orlando Family Stage Feb 28 - Mar 15, 2026 Accessibility Info Facebook Twitter Linkedin BUY TICKETS SHOW MORE Maui's Tales of the Tides (4-5 year olds) Presented by Orlando Family Stage at Orlando Family Stage Aug 4 - Aug 8, 2025 Facebook Twitter Linkedin BUY TICKETS MARVEL-ous Heroes (1-2 graders) Presented by Orlando Family Stage at Orlando Family Stage Aug 4 - Aug 8, 2025 Facebook Twitter Linkedin BUY TICKETS Cardboard Creators: Theme Park-itects (3-5 graders) Presented by Orlando Family Stage at Orlando Family Stage Aug 4 - Aug 8, 2025 Facebook Twitter Linkedin BUY TICKETS Welcome to the School of Wizardry (1-2 grades) Presented by Orlando Family Stage at Orlando Family Stage Jul 28 - Aug 1, 2025 Facebook Twitter Linkedin BUY TICKETS Secrets of the Forbidden Forest (6-10 graders) Presented by Orlando Family Stage at Orlando Family Stage Jul 28 - Aug 1, 2025 Facebook Twitter Linkedin BUY TICKETS SHOW MORE Contact information Email / Website / Facebook / Instagram / Primary address: 1001 East Princeton Street, Orlando, FL 32803 407.896.7365 Find An Organization Search by Keyword Organization Type Association/Club/Group Commercial Business Corporation CT Funded Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Government History/Heritage Kids/Family Library Literature/Poetry Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Traditional Arts Travel Visual Arts City/Town Altamonte Springs Alturas Apopka Astatula Auburndale Babson Park Barberville Bartow Bradley Cape Canaveral Cassadaga Casselberry Christmas Clarcona Clermont Cocoa Cocoa Beach Davenport Daytona Beach De Leon Springs Debary Deland Deltona Dundee Eagle Lake Eaton Park Edgewater Eustis Fedhaven Ferndale Fort Meade Frostproof Geneva Glenwood Goldenrod Gotha Grand Island Grant Groveland Haines City Highland City Homeland Howey in the Hills Indialantic Indian Lake Estates Intercession City Kenansville Killarney Kissimmee Lady Lake Lake Alfred Lake Hamilton Lake Helen Lake Mary Lake Monroe Lake Wales Lakeland Leesburg Longwood Loughman Maitland Malabar Mascotte Melbourne Melbourne Beach Merritt Island Mid Florida Minneola Montverde Mount Dora Nalcrest New Smyrna Beach Nichols Oak Hill Oakland Ocoee Okahumpka Ona Orange City Orlando Ormond Beach Oviedo Paisley Palm Bay Patrick Air Force Base Plymouth Port Orange River Ranch Rockledge Saint Cloud Sanford Satellite Beach Scottsmoor Sebastian Seville Sharpes Tangerine Tavares Titusville Waverly Windermere Winter Garden Winter Haven Winter Park Winter Springs Yalaha Zellwood Zip/Postal Code 32105 32114 32115 32116 32117 32118 32119 32120 32121 32122 32123 32124 32125 32126 32127 32128 32129 32130 32132 32141 32158 32159 32162 32168 32169 32170 32173 32174 32175 32176 32190 32198 32701 32703 32704 32706 32707 32708 32709 32710 32712 32713 32714 32715 32716 32718 32719 32720 32721 32722 32723 32724 32725 32726 32727 32728 32730 32732 32733 32735 32736 32738 32739 32744 32745 32746 32747 32750 32751 32752 32753 32756 32757 32759 32762 32763 32765 32766 32767 32768 32771 32772 32773 32774 32775 32777 32778 32779 32780 32781 32782 32783 32789 32790 32791 32792 32793 32794 32795 32796 32798 32799 32801 32802 32803 32804 32805 32806 32807 32808 32809 32810 32811 32812 32814 32815 32816 32817 32818 32819 32820 32821 32822 32824 32825 32826 32827 32828 32829 32830 32831 32832 32833 32834 32835 32836 32837 32839 32853 32854 32855 32856 32857 32858 32859 32860 32861 32862 32867 32868 32869 32872 32877 32878 32885 32886 32887 32890 32891 32893 32896 32897 32898 32899 32901 32902 32903 32904 32905 32906 32907 32908 32909 32910 32911 32912 32919 32920 32922 32923 32924 32925 32926 32927 32931 32932 32934 32935 32936 32937 32940 32941 32949 32950 32951 32952 32953 32954 32955 32956 32958 32959 32976 32978 33801 33802 33803 33804 33805 33806 33807 33809 33810 33811 33813 33815 33820 33823 33827 33830 33831 33835 33836 33837 33838 33839 33840 33841 33843 33844 33845 33846 33847 33848 33850 33851 33853 33854 33855 33856 33858 33859 33863 33865 33867 33877 33880 33881 33882 33883 33884 33885 33888 33896 33897 33898 34705 34711 34712 34713 34729 34734 34736 34737 34739 34740 34741 34742 34743 34744 34745 34746 34747 34748 34749 34753 34755 34756 34758 34759 34760 34761 34762 34769 34770 34771 34772 34773 34777 34778 34786 34787 34788 34789 34797 Our Trustees Stay in the Loop Discover all the art events, shows, stories and culture in Central Florida. LOCAL GUIDE Art Tours Museums Theatre Music & Dance Festivals Culinary Arts Artsy Hotels SHOWS & EVENTS Free Music Dance Theatre Visual Arts Attractions Literature Science & Nature History & Heritage Eats & Drinks Age-Specific CAMPS & WORKSHOPS Camps Dance Workshop Music Workshop Studio Art Workshop Theatre Workshop HIRE AN ARTIST ABOUT CONNECT Facebook-square Instagram Youtube Tiktok Linkedin-in © 2025 United Arts. Calendar powered by ARTSOPOLIS . Media Privacy, Terms & Compliance"
    },
    {
      "url": "https://thevendry.com/venue/20398/orlando-family-stage-orlando-fl",
      "text": "Orlando Family Stage - Performance Space in Orlando, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Nearby Hotels Orlando Family Stage Performance Space 1001 E Princeton St, Orlando, FL 32803, USA Lake Formosa Orlando Family Stage 1001 E Princeton St, Orlando, FL 32803, USA Lake Formosa Request Pricing # of Spaces 5 Space s Capacity Max Seated: 328 Max Standing: 150 Our expert event planning staff can suggest caterers and other service providers, or you may make your own arrangements. All events are expected to harmonize with the character and mission of Orlando Family Stage and must be approved by OFS. Orlando Family Stage reserves the right to refuse to make its facilities available to a prospective renter for any use it deems inappropriate at its sole discretion.\n\nOrlando Family Stage has three theaters, two lobbies, two rehearsal rooms, and a complete prop shop. There are also green rooms and dressing rooms for each. The lobbies may be rented independently of the auditorium if the performance schedule permits. Show more Request Pricing 1001 East Princeton Street, Orlando, FL Show on the map Spaces Universal Orlando Foundation Theatre Max Seated: 328 Edyth Bush Theatre Max Seated: 328 Black Box Theatre Max Seated: 100 Universal Lobby Max Seated: 65 Max Standing: 150 Edyth Bush Lobby Max Seated: 25 Max Standing: 75 Universal Orlando Foundation Theatre Max Seated: 328 Edyth Bush Theatre Max Seated: 328 Black Box Theatre Max Seated: 100 Universal Lobby Max Seated: 65 Max Standing: 150 Edyth Bush Lobby Max Seated: 25 Max Standing: 75 Do you work for Orlando Family Stage ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Orlando for Your Event Orlando Convention Centers Orlando Restaurants Orlando Event Spaces Orlando Aquariums / Zoos Orlando Vineyards Orlando Hotels Orlando Breweries / Distilleries Orlando Bars / Clubs Orlando Performance Spaces Orlando Golf Courses Orlando Museums / Galleries Orlando Public Spaces Orlando Stadiums Orlando Private Group Activites Orlando Private Clubs Orlando Convention Centers Orlando Restaurants Orlando Event Spaces Orlando Aquariums / Zoos Orlando Vineyards Orlando Hotels Orlando Breweries / Distilleries Orlando Bars / Clubs Orlando Performance Spaces Orlando Golf Courses Orlando Museums / Galleries Orlando Public Spaces Orlando Stadiums Orlando Private Group Activites Orlando Private Clubs"
    }
  ]
}