{
  "fuentes": [
    {
      "url": "https://capitalfringe.org/about/",
      "email": "20info@capitalfringe.org"
    },
    {
      "url": "https://capitalfringe.org/about/",
      "email": "info@capitalfringe.org"
    },
    {
      "url": "https://fringearts.com/about/ceo/",
      "email": "patronservices@fringearts.com"
    },
    {
      "url": "https://fringearts.com/contact/",
      "email": "devi@fringearts.com"
    },
    {
      "url": "https://fringearts.com/contact/",
      "email": "patronservices@fringearts.com"
    },
    {
      "url": "https://fringearts.com/contact/",
      "email": "press@fringearts.com"
    },
    {
      "url": "https://fringearts.com/contact/",
      "email": "patronservices@fringearts.com"
    },
    {
      "url": "https://www.artspace.com/contact",
      "email": "inspace@artspace.com"
    },
    {
      "url": "https://www.artspace.com/contact",
      "email": "press@artspace.com"
    },
    {
      "url": "https://www.artspace.com/contact",
      "email": "service@artspace.com"
    },
    {
      "url": "https://www.artspace.com/team",
      "email": "service@artspace.com"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "addison.grant@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "andrew.michaelson@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "annie.richardson@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "becky.carlsonstclair@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "beth.chalmers@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "carly.karjala@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "dana.mattice@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "doran.harper@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "freddie.houston@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "jackie.ralles@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "jean.kramerjohnson@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "jennifer.marmol@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "jessi.fett@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "kelli.miles@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "lee.jin@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "lucas.koski@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "maryjo.johnson@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "molly.mckeen@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "nu.lee@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "pablo.lituma@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "pace.winkels@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "sarah.swingley@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "shaela.wilson@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "sierra.scheet@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "steve.stanley@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "tio.aiken@artspace.org"
    },
    {
      "url": "https://www.artspace.org/staff",
      "email": "will.law@artspace.org"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    }
  ],
  "mails": [
    "20info@capitalfringe.org",
    "addison.grant@artspace.org",
    "andrew.michaelson@artspace.org",
    "annie.richardson@artspace.org",
    "becky.carlsonstclair@artspace.org",
    "beth.chalmers@artspace.org",
    "carly.karjala@artspace.org",
    "dana.mattice@artspace.org",
    "devi@fringearts.com",
    "doran.harper@artspace.org",
    "freddie.houston@artspace.org",
    "info@capitalfringe.org",
    "info@theatrenantucket.org",
    "inspace@artspace.com",
    "jackie.ralles@artspace.org",
    "jean.kramerjohnson@artspace.org",
    "jennifer.marmol@artspace.org",
    "jessi.fett@artspace.org",
    "kelli.miles@artspace.org",
    "lee.jin@artspace.org",
    "lucas.koski@artspace.org",
    "maryjo.johnson@artspace.org",
    "molly.mckeen@artspace.org",
    "nu.lee@artspace.org",
    "pablo.lituma@artspace.org",
    "pace.winkels@artspace.org",
    "patronservices@fringearts.com",
    "press@artspace.com",
    "press@fringearts.com",
    "sarah.swingley@artspace.org",
    "service@artspace.com",
    "shaela.wilson@artspace.org",
    "sierra.scheet@artspace.org",
    "steve.stanley@artspace.org",
    "tio.aiken@artspace.org",
    "will.law@artspace.org"
  ],
  "nombre_sitio": "orlandofringe.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://capitalfringe.org/about/",
      "text": "About - Capital Fringe Skip to content About The Tyler Blog Book of Fringe Archive Envelope Facebook-f Twitter Instagram DONATE About Capital Fringe Founded in 2005, Capital Fringe is a leading force in championing cultural democracy and expanding access to independent artistic expression. For nearly two decades, our annual open-access Fringe Festival and year-round programming provided a vital platform for boundary-pushing work and radical experimentation in performance. Through these efforts, Capital Fringe engaged over 87,000 artists and welcomed more than half a million audience members, generating more than $3.29 million in direct revenue for artists. Over time, we cultivated a community of theatergoers untethered from traditional institutions, audiences who were curious, loyal, and drawn to work and places that felt authentic. Capital Fringe began in a Columbia Heights group house and grew into a multimillion-dollar arts organization with its own building. In time, we returned to our nomadic roots, remaining committed to accessibility, flexibility, and our unwavering artist-first values. Today, Capital Fringe continues to evolve, supporting independent artists through initiatives like the Ed Tyler Fringe Touring Fund and advocating for equitable, artist-centered arts infrastructure. Always evolving, Capital Fringe looks for new ways to support bold ideas and independent creativity. If you’re interested in collaborating, we’d love to hear from you. Julianne Brienza was born and raised in Montana, where her passion for live performance began at the Depot Theatre in Dillon—a former train station turned vaudeville house and community hub. From acting on stage and painting sets to working concessions and watching her town gather for performances, that early experience sparked a lifelong commitment to creative expression and the power of collective imagination. She holds a BFA in Theatre with minors in Visual Art and Philosophy from Viterbo University, and lived in Philadelphia working in theatre before moving to Washington, DC in 2003. An arts leader, creative producer, and cultural strategist, her career has been dedicated to supporting independent artists and building sustainable arts infrastructure. As the founder and longtime Director of Capital Fringe in Washington, DC, she transformed a grassroots idea into one of the nation’s most influential Fringe Festivals. Her work redefined where audiences in Washington went to experience live performance, activating everything from storefronts and church basements to fully equipped arts campuses. In response to financial constraints that made the annual festival unsustainable, she established the Ed Tyler Fringe Touring Fund in 2025, using that moment to reimagine how the organization could continue serving artists. Today, she champions programs that prioritize equity, access, and artist mobility, ensuring the Fringe ethos thrives in new forms. “I think it's increasingly rare in our world today for people with original ideas to be able to put them up.” — Julianne Brienza, The Washington Post (Stephanie Williams) “Fringe is supposed to be in opposition to something.” — Julianne Brienza, The Georgetowner (Richard Selden) Recognition Capital Fringe and its founder, Julianne Brienza, have been widely recognized for bold leadership, innovation, and impact on Washington, DC’s cultural landscape. The organization has received multiple Mayor’s Arts Awards across three mayoral administrations, including Innovation in the Arts, Service in the Arts, and Visionary Leadership. Under Julianne’s direction, Capital Fringe also earned two Momentum Awards from the Downtown DC BID and was celebrated by Washingtonian Magazine as one of the “People Who Made a Mark on the District.” Individually, Julianne was honored with the Helen Hayes Award for Innovative Leadership from Theatre Washington, named Nonprofit CEO of the Year by the Washington Business Journal, and recognized in its “40 Under 40” list of emerging leaders. These awards reflect the lasting influence of Capital Fringe’s artist-first values and its role in shaping a more adventurous and inclusive arts scene in the nation’s capital. A deep dive into the raw, unfiltered story of Capital Fringe—born at Fort Fringe, forged in DC’s shifting political landscape, and powered by the passion of artists and administrators who dared to build something radical. The Book of Fringe Pre-order your signed copy today! Available as a limited-edition hardcover, expertly crafted with archival materials an art book designed to last. Learn More Tyler Fringe Fund Applications open annually on October 1 and close on November 30. Learn More Fringe Archives 20 Years of Fringe Coming soon Subscribe Sign up for the Fringe newsletter for exclusive deals, news, event information, contests and much more. Email Subscribe Connect Want more Fringe? Facebook-f Twitter Instagram Contact Phone (202) 731 6634 Email info@capitalfringe.org Tickets (866) 811 4111 Subscribe Join our community of subscribers and stay informed with the Captial Fringe email newsletter. Email Subscribe About The Tyler Book of Fringe Donate Blog Contact Us Contact Box Officers created with"
    },
    {
      "url": "https://fringearts.com/about/ceo/",
      "text": "Announcing Our New CEO & Producing Director! – FringeArts Donate Events Upcoming Events at FringeArts 2025 Philly Fringe Festival Events Upcoming Events at Fringe Bar About Who We Are Staff & Board Philadelphia Fringe Festival CHAMP Careers & Internships Rent Our Space Contact Your Visit Box Office & Tickets Accessibility Getting to FringeArts Fringe Bar Health & Safety Frequently Asked Questions Join + Support Membership Producers Circle Sponsorship Ways to Give FringeGala 2024 Our Supporters Get Involved Volunteer Philadelphia Fringe Festival Artists Go Deeper Blog Podcast #PhillyFringe Digital Playbills 2024 Annual Report FringeArts Publications Donate Search Announcing Our New CEO & Producing Director! The FringeArts Board of Directors announced today that, after a nationwide search conducted by Arts Consulting Group, award-winning theater director, creator, and arts administrator Nell Bang-Jensen has been appointed as the organization’s new Chief Executive Officer and Producing Director . Bang-Jensen, who has directed and created theater in Philadelphia and at FringeArts for the past fourteen years, joins the organization after a successful tenure as Artistic Director at Theatre Horizon in Norristown. She will lead FringeArts’ efforts to enrich Philadelphia’s vibrant arts community and those who reside, work, and visit the region. “After conducting a nationwide search, I’m ecstatic that we’ve been able to hire a visionary, innovative and strategic leader with a commitment to community, artists, and audiences,” said Mark Dichter, Chair, FringeArts Board of Directors. “It was a real challenge to find someone to follow our amazing founder, Nick Stuccio. With Nell’s experience of having presented both independent and curated shows at our Fringe Festivals, and her strong relationships with the performing arts community and those who support it, she is ideally suited to continue and expand Nick’s groundbreaking presentations of world-class, cutting-edge contemporary performing arts which challenge conventions and push creative boundaries.” “I am thrilled to welcome Nell Bang-Jensen to the FringeArts team,” added David Lipson, FringeArts board member and chair of the organization’s Executive Search Committee. “Nell is an accomplished director and creator. Her extensive experience and deep connections within the Philadelphia theater community make her an exceptional addition. With nearly 15 years in the scene and leadership roles at esteemed institutions like Theatre Horizon, the Wilma Theatre, and Pig Iron Theatre Company, Nell brings a wealth of knowledge and a fresh perspective that will undoubtedly enhance our mission.” Please join us in welcoming Nell to FringeArts! She will begin her new role on October 15th, 2024. About Nell Bang-Jensen Nell Bang-Jensen is passionate about work that helps arts organizations align with community-held values and creating theater with people who do not identify as professional artists. Nell is the recipient of a 2019 Map Fund grant, a Next Stage Director’s Fellowship from the Drama League (2019), and a Thomas J. Watson Fellowship (2011). In 2016, Nell was a participant in Theatre Communication Group’s Leadership U: One-on-One program, a national fellowship given to eight individuals who TCG believes are the core and future of theater. Nell is an Educator and has taught Directing and Civic Practice for colleges and universities including the University of the Arts, the Pig Iron Graduate School for Advanced Performance training, Swarthmore College, and Carleton College, among others. She has led workshops in presence, leadership, and civic engagement for teams at Temple University, University of Washington, the Wharton Women’s Leadership Conference, and PECO, and was a participant in the 2022 Core Class of Leadership Philadelphia. As a Director, Bang-Jensen has created five original works, in addition to producing and directing for Philadelphia’s major theater institutions including FringeArts, People’s Light, Philadelphia Theatre Company, the Wilma, Pig Iron, and the Painted Bride. Nell has served as the Artistic Director of Theatre Horizon since 2019. Recent productions include Christmas Carol (People’s Light), Empathitrax (Philadelphia Theatre Company), and Town (Theatre Horizon).  Currently, she is directing the 2024 Fringe Festival production of Lightning Rod Special’s Nosejob . A Message from Nell Participating in the Fringe Festival over a decade ago was my first foray into the Philadelphia arts & culture scene and a big part of why I’ve stayed. FringeArts has helped define Philadelphia as a city of makers and artists, allowing grit and ingenuity to be on full display. At a time where there is less and less support for artistic risk, it’s imperative to recognize FringeArts for the gem that it is and the potential it has to continue to put our city on the map. I’m honored to keep building on this legacy to make FringeArts a space where local, national, and international artists are celebrated, and everyone’s invited. In the Press WHYY.org Interview on Morning Edition with Jennifer Lynn on WHYY KYW News Radio Coverage: KYW audio FringeArts New CEO Nell Bang Jensen Fringe Festival Check out The Inquirer Events Upcoming Events at FringeArts 2025 Philly Fringe Festival Events Upcoming Events at Fringe Bar About Who We Are Staff & Board Philadelphia Fringe Festival CHAMP Careers & Internships Rent Our Space Contact Your Visit Box Office & Tickets Accessibility Getting to FringeArts Fringe Bar Health & Safety Frequently Asked Questions Join + Support Membership Producers Circle Sponsorship Ways to Give FringeGala 2024 Our Supporters Get Involved Volunteer Philadelphia Fringe Festival Artists Go Deeper Blog Podcast #PhillyFringe Digital Playbills 2024 Annual Report FringeArts Publications 140 N. Columbus Blvd. (at Race St.) Philadelphia, PA 19106 Directions Tickets: 215.413.1318 Email Us Admin Office: 215.413.9006 Email Us Press Room Advertise Neighborhood Partners Privacy Policy"
    },
    {
      "url": "https://fringearts.com/contact/",
      "text": "Contact – FringeArts Donate Events Upcoming Events at FringeArts 2025 Philly Fringe Festival Events Upcoming Events at Fringe Bar About Who We Are Staff & Board Philadelphia Fringe Festival CHAMP Careers & Internships Rent Our Space Contact Your Visit Box Office & Tickets Accessibility Getting to FringeArts Fringe Bar Health & Safety Frequently Asked Questions Join + Support Membership Producers Circle Sponsorship Ways to Give FringeGala 2024 Our Supporters Get Involved Volunteer Philadelphia Fringe Festival Artists Go Deeper Blog Podcast #PhillyFringe Digital Playbills 2024 Annual Report FringeArts Publications Donate Search Contact FringeArts 140 N. Columbus Blvd. (at Race St.) Philadelphia, PA 19106 Office: 215.413.9006 Tickets 215.413.1318 PatronServices@FringeArts.com Press Contact Melissa Negro Press@FringeArts.com Venue Rental Devi Bass, Director of Venue and Patron Services 267.613.9815 Devi@FringeArts.com Join Our Mailing List Sign up to receive emails from FringeArts about season announcements, discounts, special events, and more! (We promise not to spam and you can always opt-out.) Staff + Board Send Us a Message For general inquiries contact patronservices@fringearts.com Name * First Last Email * Enter Email Confirm Email Message * Δ Events Upcoming Events at FringeArts 2025 Philly Fringe Festival Events Upcoming Events at Fringe Bar About Who We Are Staff & Board Philadelphia Fringe Festival CHAMP Careers & Internships Rent Our Space Contact Your Visit Box Office & Tickets Accessibility Getting to FringeArts Fringe Bar Health & Safety Frequently Asked Questions Join + Support Membership Producers Circle Sponsorship Ways to Give FringeGala 2024 Our Supporters Get Involved Volunteer Philadelphia Fringe Festival Artists Go Deeper Blog Podcast #PhillyFringe Digital Playbills 2024 Annual Report FringeArts Publications 140 N. Columbus Blvd. (at Race St.) Philadelphia, PA 19106 Directions Tickets: 215.413.1318 Email Us Admin Office: 215.413.9006 Email Us Press Room Advertise Neighborhood Partners Privacy Policy"
    },
    {
      "url": "https://www.artspace.com/contact",
      "text": "Artspace - Contact Skip to main content Sign Up Log In SIGN UP FOR OUR EMAIL & ENJOY 10% OFF ON YOUR FIRST ORDER! Sign In | Join Artspace | $ USD $ USD £ GBP € EUR | More ART Best Sellers Collection: The Summer Edit Collection: DogDogs by Elliott Erwitt Collection: 2025 Pantone Color of the Year Curated Collections Iconic Artists Shop by Medium Shop All New & Now Exclusive Editions Design Made by MSCHF Collection Julian Opie Collection Tom Wesselmann Neon Collection Shop All Designs Artists All Artists Artist Direct: Featured Magazine Read All Interviews & Features News & Events Art 101 Contributors ART Best Sellers Collection: The Summer Edit Collection: DogDogs by Elliott Erwitt Collection: 2025 Pantone Color of the Year Curated Collections Iconic Artists Shop by Medium Shop All New & Now Exclusive Editions Design Made by MSCHF Collection Julian Opie Collection Tom Wesselmann Neon Collection Shop All Designs Artists All Artists Artist Direct: Featured Magazine Read All Interviews & Features News & Events Art 101 Contributors CONTACT ARTSPACE Need help? Contact us at service@artspace.com Customer Service, Feedback, and Suggestions: Email: service@artspace.com Corporate Address: 111 Broadway, Suite 301 New York, NY 10006 Trade Related Inquiries: If you are an Art Advisor, Architect or an Interior Designer, please email us at inspace@artspace.com or enroll for trade services here . Press: If you are interested in learning more about Artspace, please email press@artspace.com . Partners: If you are a museum, cultural institution or non-profit and would like to partner with Artspace, send us your submission , we'd love to hear from you. Sign up for our Newsletter Get early access to new artworks, special offers, and recent news. Get Our Newsletter Thanks for subscribing! You're already subscribed! Create an account and save your preferences. © 2025 Artspace LLC All rights reserved. About Us Contact Us Partners Collector's Circle For the Trade Site Map Privacy Policy Customer Service Egift Cards Pay With Affirm Shipping & Tax Framing and Care Return Policy Auctions Exhibitions Movements & Styles Collections Terms of Service Accessibility Statement RECEIVE OUR AWARD WINNING EMAILS & AND ENJOY 10% OFF YOUR FIRST PURCHASE Receive our newsletter Sign Up Now I accept the terms and conditions THANKS FOR SIGNING UP FOR OUR NEWSLETTER. THAT EMAIL HAS ALREADY BEEN SUBSCRIBED. Now, personalize your account so you can discover more art you'll love. PERSONALIZE YOUR ACCOUNT DISCOVER a treasure trove of fine art from the world's most renowned artists, galleries,\n             museums and cultural institutions. We offer exclusive works you can't find anywhere else. LEARN through exclusive content featuring art news, collecting guides, and interviews with artists,\n             dealers, collectors, curators and influencers. BUY authentic artworks from across the globe. Collecting with us means you're helping to\n             sustain creative culture and supporting organizations that are making the world a better place. CONNECT with our art advisors for buying advice or to help you find the art that's perfect for you. We have the resources to find works that suit your needs. INSIDER ACCESS TO THE WORLD'S BEST ART Artspace offers you authentic, exclusive works from world-renowned artists, galleries, museums and cultural institutions. Collecting with us helps support creative culture while bringing you art news, interviews and access to global art resources. COLLECT FROM 300+ GALLERIES & MUSEUMS Sign In Sign in for personalized experiences, exclusive access to new works,\n                    special offers, invitations and features. Sign in now Not a member yet? Join Artspace | Forgot your password? Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Sign up to view price Love art? Collect the world's best Sign up to view price and receive personalized experiences exclusive access to new works,\n                special offers, invitations and features. I accept the terms and conditions Sign up now Already a member? Sign in here Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Thank you for signing up Tailor your art, news & information to your preferences. View Preference Center Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 THANK YOU FOR SIGNING-UP TO ARTSPACE Welcome to the world's premier online marketplace for fine art. Enjoy 10% on your next purchase by using coupon code WELCOME10 at checkout. Continue to Site *10% off is valid on orders at Artspace.com by using the promotional code WELCOME10. Some exclusions apply. This offer cannot be applied to previous purchases, combined with any other promotional codes, used towards gift cards, or redeemed for cash. Offer excludes works from the following partners: , Marian Goodman Gallery, Bomb Magazine, Oxbow School, Art Plural Gallery, Revolver Gallery, The Novogratz, Victoria Miro, Neue Galerie, and White Cube. Offer is applied by using the code WELCOME10 at checkout. Terms and inventory available are subject to change at any time. THANK YOU FOR RETURNING TO ARTSPACE The world's premier online marketplace for fine art. Enjoy 10% on your next purchase by using coupon code PHAIDON10 at checkout. Continue to Site *10% off is valid on orders at Artspace.com by using the promotional code PHAIDON10. Some exclusions apply.\n                 This offer cannot be applied to previous purchases, combined with any other promotional codes,\n                 used towards gift cards, or redeemed for cash. Offer excludes works from the following partners: ,\n                 Marian Goodman Gallery, Bomb Magazine, Oxbow School, Art Plural Gallery, Revolver Gallery,\n                 The Novogratz, Victoria Miro, Neue Galerie, and White Cube. Offer is applied by using the code\n                 PHAIDON10 at checkout. Terms and inventory available are subject to change at any time. auction pre-registration Auction Pre-Registration If you already have an account and wish to place a bid, please ensure your credit card\n                  details are up to date. If you don’t have an account yet, kindly complete and submit the\n                  form below Already have a login: Sign In Now Credit Card Validation In order to secure a bid, please enter your credit card details below.\n                    We will not charge your card but only use it to validate your bid.\n                    We only need to validate your card once. You will be notified that you are the winning bidder\n                    before your card is charged, and you will have the option to change your payment method at that time. *Card Number *Expiration Date 01 - January 02 - February 03 - March 04 - April 05 - May 06 - June 07 - July 08 - August 09 - September 10 - October 11 - November 12 - December 2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 2035 *Security Code *First name *Last name *Address Address 2 ( optional ) *Country United States Argentina Australia Austria Belgium Brazil Canada Chile China Cyprus Czech Republic Denmark France Germany Greece Hong Kong SAR China Hungary India Ireland Israel Italy Japan Kuwait Luxembourg Mexico Monaco Netherlands New Zealand Norway Poland Portugal Singapore South Korea Spain Sweden Switzerland Taiwan Thailand United Arab Emirates United Kingdom *Postal Code *City *State / Province Province *Phone Number I accept the terms and conditions. Complete Registration Already a member? Sign in here Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 I acknowledge I read the Artspace terms and conditions. Forgot your password? Please enter your email below and we will send you a new password. We've emailed you a new password. Sign In Submit Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Interested in Firstname Lastname? To follow this artist and get updates on new work & exclusives,\n              you must be signed into your Artspace account. Sign in now Join Artspace | Forgot your password? follow join modal Interested in Firstname Lastname? To follow this artist and get updates on new work & exclusives, you must be signed into your Artspace account. Don't have one? Create one now. I accept the terms and conditions Sign up now Already a member? Sign in here You are now following first name last name Tailor your art, news & information to your preferences. View Preference Center Interested in saving this work? To save this work to your personal gallery and to access other features like this, you must be signed into your Artspace account. Sign in now Join Artspace | Forgot your password? follow email form Interested in saving this work? To follow this artist and get updates on new work & exclusives, you must be signed into your Artspace account. Don't have one? Create one now. I accept the terms and conditions Sign up now Already a member? Sign in here prompt placeholder Yes No Ok prompt placeholder Confirm Bid Cancel Share on Facebook Share on Twitter Share on Pinterest avid collector Success! Your email has been submitted and a 10% off discount code sent to you. Next, personalize your Artspace experience by creating an account. Please select the statement that best describes you: I am an existing collector. I am a new and aspiring collector. Save and Continue 1 of 4 Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Types of art that interest you Select all that interest you: Print Photograph Painting Sculpture Mixed Media Work on Paper Book New Media Design and Decorative Arts Save and Continue 2 of 4 Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Partners You'd Like to Follow Enter or select all partners that interest you: <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> M+B <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> America: Now+Here <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> Lincoln Center for the Performing Arts <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> David Zwirner <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> Pace Prints <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> Electric Works Save and Continue 4 of 4 Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Thank you Your preferences have been saved to your account. Update them at any time in your Preference Center Continue Browsing Art Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 AUCTION PROCEDURES HOW TO BID To place a bid, enter the maximum amount you are willing to pay for the work. Artspace will accept a\n                  bid at the next increment, and save any excess amount as a maximum bid. If you are outbid, we will\n                  continue bid on your behalf up to your maximum bid. Bid Increments Bidding increments increase at the following intervals: Between $700 and $1,499: $200 Between $1,500 and $2,499: $300 Between $2,500 and $4,999: $500 Between $5,000 and $9,999: $1,000 Between $10,000 and $19,999: $2,000 Between $20,000 and $29,999: $3,000 Between $30,000 and $49,999: $4,000 Between $50,000 and $99,999: $5,000 Above $100,000: $10,000 You will receive an email confirmation of your bid and when you are outbid. If you are the winning bidder, you will be contacted 48 hours after the close\n                     of the auction. Maximum Bidding Every bid submitted is treated as a maximum bid. You should always bid the maximum you are willing to\n                  spend for a work, though this does not necessarily mean you will pay that price. As the auction\n                  unfolds, we will increase your bid by increments to ensure you remain the highest bidder. If the\n                  winning amount is less than your maximum bid, you will pay the current increment. If your maximum\n                  bid no longer exceeds the current bid, you will receive an outbid notification email, and have the\n                  option to bid again. In the case of multiple bidders placing the same maximum bid, the first person to place the maximum\n                  amount takes precedence as the highest bid until another bidder exceeds the maximum amount. Buyer's Premium & Additional Charges For Artspace Benefit Auctions, Buyer's Premiums are not applied. Purchases made from all auctions,\n                including benefit auctions, are subject to sales tax. Check Out Winning bidders will be contacted within 48 hours to arrange shipping and to provide final price\n                  including commission, shipping, and taxes and duties when applicable. Promotion codes cannot\n                  be applied to auction works. * Price listed does not include buyer's premium (if applicable), sales tax, shipping, or handling fees. Create an Artspace account I accept the terms and conditions Sign up now Already a member? Sign in here Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 FRAME DETAILS & ELEMENTS Frame All our frames are manufactured in the USA, using eco-friendly & sustainably sourced engineered hardwood for durability and a uniform finish that is free of defects. Frames are available in Black or White Satin and Honey Pecan. White Satin Honey Pecan Black Satin Mat All prints are hinged to a conservation quality, acid-free and lignin-free Alpha Cellulose matboard, using an acid-free linen tape. The mat's surface paper is fade and bleed resistant and is attached to a conservation quality foam-core mounting board that will keep the work safe from deterioration over time. Artworks with a deckled or decorative edges will be floated on the matboard, with acrylic spacers to separate the art from the glazing. All mounting is fully reversible, without any potential damage to the art. Acrylic Glazing All of our frames come with picture quality .090 mm plexiglass, which blocks 66% of UV to prevent color fading from exposure to light, keeping your art protected for years to come. It is now considered the industry standard for artists, museums and galleries throughout the world. Dimensions For images up to 30\" x 40\" 1 1/4” wide, 3/4” deep, with a 2 1/2” wide mat. We generally leave 1/4” - 1/2” of paper showing around the image, to accommodate signatures and for visual appeal. For sheet sizes larger than 30” x 40” Please contact an Artspace advisor for a custom quote. If you have any questions about framing or care, please email email customer service service@artspace.com . Easy and Secure Financing with Own now and pay over time! 1 Simple checkout Add to Cart At checkout select 2 Finance with Affirm You will be redirected to Affirm to provide your information for real-time decision. Choose to pay over 3, 6, or 12 months.* 3 Enjoy your purchase immediately Complete your purchase in Affirm and you'll be redirected to Artspace to view your order confirmation. * Subject to credit check and approval. Down payment may be required. For purchases\n              under $100, limited payment options are available. Estimated payment amount excludes taxes and shipping\n              fees. Affirm loans are made by Cross River Bank, a New Jersey-chartered bank, Member FDIC.\n              See www.affirm.com/faqs for details. SHOP NOW\n            Just select “Affirm” at checkout Artists you'd like to follow Enter or select all artists that interest you: Aaron Parazette Adam Pendleton Ala Ebtekar Alec Soth Alexis Rockman Alix Smith Save and Continue 3 of 4 Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 prompt placeholder Confirm Bid Cancel"
    },
    {
      "url": "https://www.artspace.com/team",
      "text": "Artspace - Team Skip to main content Sign Up Log In SIGN UP FOR OUR EMAIL & ENJOY 10% OFF ON YOUR FIRST ORDER! Sign In | Join Artspace | $ USD $ USD £ GBP € EUR | More ART Best Sellers Collection: The Summer Edit Collection: DogDogs by Elliott Erwitt Collection: 2025 Pantone Color of the Year Curated Collections Iconic Artists Shop by Medium Shop All New & Now Exclusive Editions Design Made by MSCHF Collection Julian Opie Collection Tom Wesselmann Neon Collection Shop All Designs Artists All Artists Artist Direct: Featured Magazine Read All Interviews & Features News & Events Art 101 Contributors ART Best Sellers Collection: The Summer Edit Collection: DogDogs by Elliott Erwitt Collection: 2025 Pantone Color of the Year Curated Collections Iconic Artists Shop by Medium Shop All New & Now Exclusive Editions Design Made by MSCHF Collection Julian Opie Collection Tom Wesselmann Neon Collection Shop All Designs Artists All Artists Artist Direct: Featured Magazine Read All Interviews & Features News & Events Art 101 Contributors THE ARTSPACE TEAM AMANDA KNUPPEL Managing Director Amanda brings specialized experience in the contemporary art world to her role at Artspace.\n              As Private Sales Director, Amanda seeks to provide private clients and trade partners with personalized\n              insight and guidance gained from nearly a decade working in esteemed New York City galleries, including\n              Van Doren Waxter, Koenig & Clinton, and Alexander Gray Associates, among others. She earned her B.A.\n              degrees in Art History and Journalism from New York University. Work I Love IF, 1995 Ed Ruscha SUSAN YI Director of Operations Susan Yi has been deeply engaged in the contemporary art world for over a decade with experiences\n                in both galleries and non-profit institutions including the Museum of Contemporary Art, Los Angeles,\n                and the Long Beach Museum of Art, CA. Having also represented galleries in both New York and\n                Los Angeles serving as a gallery director, she brings her passion for collaboration, partnership\n                development, project management, and artist-driven practice to her role as Director of Operations\n                at Artspace. She holds a Master's Degree in Modern and Contemporary Art from Christie’s Education,\n                London, and a B.A. in Art History from the University of California, Irvine Work I Love Rearranged for Bill, 2021 JIM HODGES SARAH GRACE JONES Product Coordinator Sarah Grace Jones brings with her profound passion for contemporary art and breadth of knowledge\n                in art history and art business. With experience in both commercial galleries and non-profit\n                contemporary art organizations, Sarah Grace manages Artspace's global community of partners as\n                Product Coordinator, maintaining relationships with our exceptional roster of cultural institutions,\n                galleries, and artists, as well as our database of authentic works of art made available from around\n                the world. She graduated Cum Laude from the College of Charleston, earning her B.A. in Art History,\n                and is earning her M.A. in Art History from Hunter College, NY. Work I Love Unfrisiert mit Schneeblumen (Not Hair Dressed with Snow Flowers), 2001 PIPILOTTI RIST INTERESTED IN JOINING US? Check out our openings on the job page. Sign up for our Newsletter Get early access to new artworks, special offers, and recent news. Get Our Newsletter Thanks for subscribing! You're already subscribed! Create an account and save your preferences. © 2025 Artspace LLC All rights reserved. About Us Contact Us Partners Collector's Circle For the Trade Site Map Privacy Policy Customer Service Egift Cards Pay With Affirm Shipping & Tax Framing and Care Return Policy Auctions Exhibitions Movements & Styles Collections Terms of Service Accessibility Statement RECEIVE OUR AWARD WINNING EMAILS & AND ENJOY 10% OFF YOUR FIRST PURCHASE Receive our newsletter Sign Up Now I accept the terms and conditions THANKS FOR SIGNING UP FOR OUR NEWSLETTER. THAT EMAIL HAS ALREADY BEEN SUBSCRIBED. Now, personalize your account so you can discover more art you'll love. PERSONALIZE YOUR ACCOUNT DISCOVER a treasure trove of fine art from the world's most renowned artists, galleries,\n             museums and cultural institutions. We offer exclusive works you can't find anywhere else. LEARN through exclusive content featuring art news, collecting guides, and interviews with artists,\n             dealers, collectors, curators and influencers. BUY authentic artworks from across the globe. Collecting with us means you're helping to\n             sustain creative culture and supporting organizations that are making the world a better place. CONNECT with our art advisors for buying advice or to help you find the art that's perfect for you. We have the resources to find works that suit your needs. INSIDER ACCESS TO THE WORLD'S BEST ART Artspace offers you authentic, exclusive works from world-renowned artists, galleries, museums and cultural institutions. Collecting with us helps support creative culture while bringing you art news, interviews and access to global art resources. COLLECT FROM 300+ GALLERIES & MUSEUMS Sign In Sign in for personalized experiences, exclusive access to new works,\n                    special offers, invitations and features. Sign in now Not a member yet? Join Artspace | Forgot your password? Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Sign up to view price Love art? Collect the world's best Sign up to view price and receive personalized experiences exclusive access to new works,\n                special offers, invitations and features. I accept the terms and conditions Sign up now Already a member? Sign in here Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Thank you for signing up Tailor your art, news & information to your preferences. View Preference Center Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 THANK YOU FOR SIGNING-UP TO ARTSPACE Welcome to the world's premier online marketplace for fine art. Enjoy 10% on your next purchase by using coupon code WELCOME10 at checkout. Continue to Site *10% off is valid on orders at Artspace.com by using the promotional code WELCOME10. Some exclusions apply. This offer cannot be applied to previous purchases, combined with any other promotional codes, used towards gift cards, or redeemed for cash. Offer excludes works from the following partners: , Marian Goodman Gallery, Bomb Magazine, Oxbow School, Art Plural Gallery, Revolver Gallery, The Novogratz, Victoria Miro, Neue Galerie, and White Cube. Offer is applied by using the code WELCOME10 at checkout. Terms and inventory available are subject to change at any time. THANK YOU FOR RETURNING TO ARTSPACE The world's premier online marketplace for fine art. Enjoy 10% on your next purchase by using coupon code PHAIDON10 at checkout. Continue to Site *10% off is valid on orders at Artspace.com by using the promotional code PHAIDON10. Some exclusions apply.\n                 This offer cannot be applied to previous purchases, combined with any other promotional codes,\n                 used towards gift cards, or redeemed for cash. Offer excludes works from the following partners: ,\n                 Marian Goodman Gallery, Bomb Magazine, Oxbow School, Art Plural Gallery, Revolver Gallery,\n                 The Novogratz, Victoria Miro, Neue Galerie, and White Cube. Offer is applied by using the code\n                 PHAIDON10 at checkout. Terms and inventory available are subject to change at any time. auction pre-registration Auction Pre-Registration If you already have an account and wish to place a bid, please ensure your credit card\n                  details are up to date. If you don’t have an account yet, kindly complete and submit the\n                  form below Already have a login: Sign In Now Credit Card Validation In order to secure a bid, please enter your credit card details below.\n                    We will not charge your card but only use it to validate your bid.\n                    We only need to validate your card once. You will be notified that you are the winning bidder\n                    before your card is charged, and you will have the option to change your payment method at that time. *Card Number *Expiration Date 01 - January 02 - February 03 - March 04 - April 05 - May 06 - June 07 - July 08 - August 09 - September 10 - October 11 - November 12 - December 2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 2035 *Security Code *First name *Last name *Address Address 2 ( optional ) *Country United States Argentina Australia Austria Belgium Brazil Canada Chile China Cyprus Czech Republic Denmark France Germany Greece Hong Kong SAR China Hungary India Ireland Israel Italy Japan Kuwait Luxembourg Mexico Monaco Netherlands New Zealand Norway Poland Portugal Singapore South Korea Spain Sweden Switzerland Taiwan Thailand United Arab Emirates United Kingdom *Postal Code *City *State / Province Province *Phone Number I accept the terms and conditions. Complete Registration Already a member? Sign in here Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 I acknowledge I read the Artspace terms and conditions. Forgot your password? Please enter your email below and we will send you a new password. We've emailed you a new password. Sign In Submit Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Interested in Firstname Lastname? To follow this artist and get updates on new work & exclusives,\n              you must be signed into your Artspace account. Sign in now Join Artspace | Forgot your password? follow join modal Interested in Firstname Lastname? To follow this artist and get updates on new work & exclusives, you must be signed into your Artspace account. Don't have one? Create one now. I accept the terms and conditions Sign up now Already a member? Sign in here You are now following first name last name Tailor your art, news & information to your preferences. View Preference Center Interested in saving this work? To save this work to your personal gallery and to access other features like this, you must be signed into your Artspace account. Sign in now Join Artspace | Forgot your password? follow email form Interested in saving this work? To follow this artist and get updates on new work & exclusives, you must be signed into your Artspace account. Don't have one? Create one now. I accept the terms and conditions Sign up now Already a member? Sign in here prompt placeholder Yes No Ok prompt placeholder Confirm Bid Cancel Share on Facebook Share on Twitter Share on Pinterest avid collector Success! Your email has been submitted and a 10% off discount code sent to you. Next, personalize your Artspace experience by creating an account. Please select the statement that best describes you: I am an existing collector. I am a new and aspiring collector. Save and Continue 1 of 4 Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Types of art that interest you Select all that interest you: Print Photograph Painting Sculpture Mixed Media Work on Paper Book New Media Design and Decorative Arts Save and Continue 2 of 4 Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Partners You'd Like to Follow Enter or select all partners that interest you: <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> M+B <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> America: Now+Here <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> Lincoln Center for the Performing Arts <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> David Zwirner <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> Pace Prints <FollowQuerySet [{'obj_id': 89, 'obj_name': 'M+B', 'follow_type': 'partner', 'num_follows': 1766}, {'obj_id': 1, 'obj_name': 'America: Now+Here', 'follow_type': 'partner', 'num_follows': 2165}, {'obj_id': 25, 'obj_name': 'Lincoln Center for the Performing Arts', 'follow_type': 'partner', 'num_follows': 2177}, {'obj_id': 16, 'obj_name': 'David Zwirner', 'follow_type': 'partner', 'num_follows': 7491}, {'obj_id': 408, 'obj_name': 'Pace Prints ', 'follow_type': 'partner', 'num_follows': 2676}, {'obj_id': 274, 'obj_name': 'Electric Works', 'follow_type': 'partner', 'num_follows': 1475}]> Electric Works Save and Continue 4 of 4 Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 Thank you Your preferences have been saved to your account. Update them at any time in your Preference Center Continue Browsing Art Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 AUCTION PROCEDURES HOW TO BID To place a bid, enter the maximum amount you are willing to pay for the work. Artspace will accept a\n                  bid at the next increment, and save any excess amount as a maximum bid. If you are outbid, we will\n                  continue bid on your behalf up to your maximum bid. Bid Increments Bidding increments increase at the following intervals: Between $700 and $1,499: $200 Between $1,500 and $2,499: $300 Between $2,500 and $4,999: $500 Between $5,000 and $9,999: $1,000 Between $10,000 and $19,999: $2,000 Between $20,000 and $29,999: $3,000 Between $30,000 and $49,999: $4,000 Between $50,000 and $99,999: $5,000 Above $100,000: $10,000 You will receive an email confirmation of your bid and when you are outbid. If you are the winning bidder, you will be contacted 48 hours after the close\n                     of the auction. Maximum Bidding Every bid submitted is treated as a maximum bid. You should always bid the maximum you are willing to\n                  spend for a work, though this does not necessarily mean you will pay that price. As the auction\n                  unfolds, we will increase your bid by increments to ensure you remain the highest bidder. If the\n                  winning amount is less than your maximum bid, you will pay the current increment. If your maximum\n                  bid no longer exceeds the current bid, you will receive an outbid notification email, and have the\n                  option to bid again. In the case of multiple bidders placing the same maximum bid, the first person to place the maximum\n                  amount takes precedence as the highest bid until another bidder exceeds the maximum amount. Buyer's Premium & Additional Charges For Artspace Benefit Auctions, Buyer's Premiums are not applied. Purchases made from all auctions,\n                including benefit auctions, are subject to sales tax. Check Out Winning bidders will be contacted within 48 hours to arrange shipping and to provide final price\n                  including commission, shipping, and taxes and duties when applicable. Promotion codes cannot\n                  be applied to auction works. * Price listed does not include buyer's premium (if applicable), sales tax, shipping, or handling fees. Create an Artspace account I accept the terms and conditions Sign up now Already a member? Sign in here Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 FRAME DETAILS & ELEMENTS Frame All our frames are manufactured in the USA, using eco-friendly & sustainably sourced engineered hardwood for durability and a uniform finish that is free of defects. Frames are available in Black or White Satin and Honey Pecan. White Satin Honey Pecan Black Satin Mat All prints are hinged to a conservation quality, acid-free and lignin-free Alpha Cellulose matboard, using an acid-free linen tape. The mat's surface paper is fade and bleed resistant and is attached to a conservation quality foam-core mounting board that will keep the work safe from deterioration over time. Artworks with a deckled or decorative edges will be floated on the matboard, with acrylic spacers to separate the art from the glazing. All mounting is fully reversible, without any potential damage to the art. Acrylic Glazing All of our frames come with picture quality .090 mm plexiglass, which blocks 66% of UV to prevent color fading from exposure to light, keeping your art protected for years to come. It is now considered the industry standard for artists, museums and galleries throughout the world. Dimensions For images up to 30\" x 40\" 1 1/4” wide, 3/4” deep, with a 2 1/2” wide mat. We generally leave 1/4” - 1/2” of paper showing around the image, to accommodate signatures and for visual appeal. For sheet sizes larger than 30” x 40” Please contact an Artspace advisor for a custom quote. If you have any questions about framing or care, please email email customer service service@artspace.com . Easy and Secure Financing with Own now and pay over time! 1 Simple checkout Add to Cart At checkout select 2 Finance with Affirm You will be redirected to Affirm to provide your information for real-time decision. Choose to pay over 3, 6, or 12 months.* 3 Enjoy your purchase immediately Complete your purchase in Affirm and you'll be redirected to Artspace to view your order confirmation. * Subject to credit check and approval. Down payment may be required. For purchases\n              under $100, limited payment options are available. Estimated payment amount excludes taxes and shipping\n              fees. Affirm loans are made by Cross River Bank, a New Jersey-chartered bank, Member FDIC.\n              See www.affirm.com/faqs for details. SHOP NOW\n            Just select “Affirm” at checkout Artists you'd like to follow Enter or select all artists that interest you: Aaron Parazette Adam Pendleton Ala Ebtekar Alec Soth Alexis Rockman Alix Smith Save and Continue 3 of 4 Damien Hirst, Pardon, 2012 James Welling, H1, 2006 Josh Smith,LARGE IMAGE J.S. (Untitled, 2006), 2012 Sol LeWitt, Two Centimeter Wavy Bands In Colors, 1996 Coke Wisdom O'Neal, The Gospel of Wealth, 2013 Alex Katz, Coleman Pond II, 2007 prompt placeholder Confirm Bid Cancel"
    },
    {
      "url": "https://www.artspace.org/staff",
      "text": "Staff | Artspace Skip to main content Main navigation About What We Do Staff Board History Programs Careers Contact Us Our Places All Places Past Places Leasing Services Consulting Artspace Immersion News + Stories Donate Search form Search Search Menu Staff Artspace's dedicated, national team. Read more Leadership Will Law President / Chief Executive Officer × Will Law President / Chief Executive Officer will.law@artspace.org Will Law joined Artspace in 1992 and has worked in property development, asset management, consulting, and financial management. Among the major projects for which he has had primary responsibility are the Tilsner Artists’ Cooperative in Saint Paul, the Washington Studios in Duluth, the Riverside Artist Lofts in Reno, and El Barrio’s Artspace PS109 in New York. As President, Mr. Law is a member of Artspace’s senior management team and is responsible for overseeing the organization’s day-to-day operations. Mr. Law graduated from the Metropolitan State College in Denver, Colorado, with a Bachelor of Arts degree in English and Political Science. Tionenji Aiken Chief Communications Officer × Tionenji Aiken Chief Communications Officer tio.aiken@artspace.org Tionenji Aiken (Tio Aiken) is the Chief Communications Officer for Artspace Projects Inc. Recruited to Artspace in 2016 as the Communications Manager, Aiken has slowly shifted the Artspace brand to focus on multi-format storytelling with a deep desire to highlight the intersectionality of Artspace's diverse residential communities and partnerships nationwide. In 2017, Aiken became the Director of Communications. She also became the Program Director for the Rafala Green Fellowship program, a two-year fellowship that promotes equity and inclusion in non-profit real-estate by training the next generation of POCI emerging leaders working at the intersection of arts, real-estate, and community development, funded by the Ford Foundation. Outside of her formal roles at Artspace, Aiken is a practicing poet and a champion of anyone using their creative expression to make space in the world for positive change. She currently sits on the advisory boards of Made Here MN and Giant Steps MN, and the Board of Directors for the Twin Cities Jazzfest. She is a graduate of the University of Minnesota Twin Cities, and holds a BA., in Cultural Studies, Comparative Literature, and Media Studies. Beth Chalmers Chief Financial Officer × Beth Chalmers Chief Financial Officer beth.chalmers@artspace.org With over 30 years of financial expertise, Beth Chalmers serves as the Chief Financial Officer at Artspace Projects. Passionate about the arts and social impact, Beth leads financial operations and strategic planning for the nonprofit organization dedicated to creating affordable spaces for artists and arts organizations. Beth is a seasoned Finance and Human Resources strategist with a rich background spanning diverse industries including public accounting, manufacturing, banking, consulting, housing, and the nonprofit sector. She also manages Artspace’s Human Resources and IT functions, further strengthening the organization’s operational infrastructure. Prior to Artspace, Beth directed financial operations at People Serving People, focusing on supporting homeless families. Her career has been marked by a relentless pursuit of excellence and a commitment to driving organizational success through sound financial management, strategic HR initiatives, and technology oversight. Beth holds a Bachelor of Arts in Accounting and is dedicated to leveraging financial strategies to support arts communities. She is excited to continue her journey with Artspace Projects and looks forward to collaborating with the team to make impactful contributions to the arts landscape. Freddie Houston President, Performance Property Management Company × Freddie Houston President, Performance Property Management Company freddie.houston@artspace.org Freddie, despite all attempts, has been able to skillfully evade his colleagues and refuses to write a bio of himself. It's okay, Freddie. We've got your back. Here is what we know: He wears, on occasion, an amazing (and massive) Russian fur hat given to him by his fantastic wife. His sense of humor is so intact that he manages to play verbal defense in a way that would shock a politician. In 2009, Freddie started exploring the real estate business and began working for Artspace leading the Performance Property team. In his spare time, Freddie likes to drink pink ladies while hanging out with his friends; enjoys making people laugh; go on bike rides in the rain; and read science fiction books while soaking in a bubble bath. Just kidding. Well, everything except the making people laugh part. His good nature is contagious. Freddie is our talented President of Performance Property, and we are so fortunate to have him taking care of myriad things at our properties. Rock on, Freddie. Steve Stanley Chief Asset Officer × Steve Stanley Chief Asset Officer steve.stanley@artspace.org As Chief Asset Officer, Steve collaborates closely with leadership and staff to oversee Artspace’s LIHTC and Historic Credit projects. With the asset team, he is redesigning Artspace’s project evaluation framework to ensure properties maximize eligible rental income while identifying opportunities for expense reductions. In the coming years, the team will reassess each project to determine its optimal path forward—including potential sales or dispositions. In today’s evolving affordable housing landscape, Steve emphasizes adaptability, innovation, and creative problem-solving to navigate challenges. Before joining Artspace, Steve built a diverse career in public accounting, real estate development (spanning both LIHTC and market-rate properties), brokerage, mortgage lending, and business management. With experience managing projects nationwide, he brings a multifaceted perspective to his role. Steve holds a B.A. in Accounting from Iowa Wesleyan University. Consulting Jessi Fett Director, Consulting × Jessi Fett Director, Consulting jessi.fett@artspace.org Lucas Koski Vice President, Consulting × Lucas Koski Vice President, Consulting lucas.koski@artspace.org Lucas Koski is the Vice President of Consulting at Artspace, having previously worked in both Artspace’s Asset Management and Property Development departments. He is a former resident of Artspace’s Tilsner Artists’ Cooperative in Saint Paul, and as an Asset Manager was the liaison for several projects across Artspace’s portfolio including Galveston’s National Hotel Artist Lofts, El Paso’s Roderick Lofts and Santa Cruz’s Tannery Campus. In his role with Property Development, Lucas led the adaptive reuse development of the 130 year old Feed and Grain in Loveland, marshalled a 51 unit new construction project in Colorado Springs, and has guided the Windgate Arts Campus in Little Rock, among other initiatives. A proud graduate of Carleton College, Lucas has woven together a career that combines artistic and professional pursuits, including creative event production, dynamic installations, and functional art—often using cuisine as a metaphor. A multidisciplinary artist who balances big picture concepts with detailed minutiae, Lucas explores mise en place with produce and protein, programs in pseudo-public places, and loves the business side of art. As a board member of the Creative Enterprise Zone , Lucas helped the organization establish earned revenue streams through the creation of a real estate department that helps place creative businesses in Saint Paul; he also helped guide the creation of Creative Enterprise Zone’s mural festival, Chroma-Zone (a first of its kind in Minnesota). Lucas fervently believes that the answer to the challenges of tomorrow will be met by the meticulous planning and creative leadership of today. He has been a Jerome, Wilder, Knight, ArtPlace America and McKnight Foundation grantee, an Elsewhere resident, an Art Shanty-er, a member of Intermedia Arts' Creative Community Leadership Institute, a member of Saint Paul’s 2040 Visioning Project, A James P. Shannon Institute member, And a fellow of the Young Cultural Innovators Forum of the Salzburg Global Seminar. As a creative Lucas once held a chef residency at the castle where The Sound of Music was filmed and also created photovoltaic sculptures mimicking rain cycles for the Bakken Museum in Minneapolis. When he is not at Artspace, you may often find Lucas in his workshop, at the market, with his kid, listening to some jams, or thinking about noodles. Kelli Miles Project Manager, Consulting × Kelli Miles Project Manager, Consulting kelli.miles@artspace.org Kelli joined Artspace in 2022 as the Consulting Coordinator. She believes that art is a tool for economic development and community enrichment. Within the Consulting Department, Kelli is the administrative switchboard operator for all consulting projects, the wrangler of schedules, and the first point of contact for new inquiries. A passionate artist herself, Kelli is also a Minneapolis-based dancer, choreographer and teacher. She is constantly inspired by the way in which this movement form sparks conversation, invokes empathy and creates community. Throughout her training, she has spent time dancing in New York City, San Francisco, Chicago, Nashville and Israel. Kelli holds a BFA in Dance and a Minor in Leadership from the University of Minnesota - Twin Cities. When she isn't working, Kelli enjoys being a tourist in her own city - exploring local eats, drinks and activities. She is a lover of live music, rock climbing and board games. She is constantly planning her next trip to cities and countries around the world. Jackie Ralles Program Manager, Consulting × Jackie Ralles Program Manager, Consulting jackie.ralles@artspace.org National Advancement Dana Mattice Vice President, National Advancement × Dana Mattice Vice President, National Advancement dana.mattice@artspace.org Dana is a systems thinker and strategy wrangler who’s spent nearly 20 years helping arts nonprofits tell their stories, rally support, and turn big ideas into reality. With a background in English, Art, and Nonprofit Leadership, her journey began in the press room at the Museum of Fine Arts, Houston (MFAH), where she secured national media coverage for exhibitions and programs. She went on to lead communications and fundraising at the Duluth Art Institute (DAI), where she boosted grant revenue by more than 60%. Since 2017, Dana has been a driving force at Artspace, cultivating relationships and securing the resources that fuel our mission—from core operations to innovative programs and creative-sector infrastructure in communities across the country. Dana thrives where creativity meets logistics, always working to turn vision into impact. Pace Winkels Manager, National Advancement × Pace Winkels Manager, National Advancement pace.winkels@artspace.org Pace Winkels (He/Him) joined Artspace in 2022 as the National Advancement Manager.  The son of a musician and costume designer, Pace has been steeped in the Minneapolis artist community and understands the importance of fostering and housing the arts across the globe.  After receiving his BA in writing for TV and Film at DePaul University,  Pace returned home to Minneapolis and began work at an accessibility company, creating audio description for television and film. When he's not working, Pace enjoys a wide variety of horror films and is an avid practitioner of Muay Thai. He's also the father to the light of his life - his pitbull, Imelda Mae. Finance and Administration Addison Grant Staff Accountant × Addison Grant Staff Accountant addison.grant@artspace.org Addison joined Performance Property Management's team at the beginning of 2021. With a BA in mathematics and theatre arts from Simpson College in Iowa, Addison believes that she's found an excellent place to work! Addison is a bookkeeper for a handful of Artspace's real estate properties and performs regular accounting duties for the team. When she's not in the office, Addison spends much of her time around Lake Bde Maka Ska, singing showtunes around her apartment, and reading the same novels over and over. An Iowa native, Addison is thrilled to be in the Twin Cities where the winters are only marginally worse and the accent is contagious. Mary Jo Johnson Accounting Special Projects × Mary Jo Johnson Accounting Special Projects maryjo.johnson@artspace.org Mary Jo joined Artspace in 2009 as a temp after taking a few years off to raise 3 children.  Mary Jo is responsible for master lease accounts receivable, El Barrio accounts receivable and accounts payable and helps the Finance Team with other projects as needed.  She also files annual reports for all Artspace entities keeping them in good standing.  Prior to joining Artspace, Mary Jo worked as a legal secretary at a law firm in Minneapolis. When not working, Mary Jo enjoys going on walks, exploring new places and going to plays at community theaters. Carly Karjala Staff Accountant × Carly Karjala Staff Accountant carly.karjala@artspace.org Carly Karjala graduated from South Dakota State University with a BS in Art Education. Karjala is certified through the Professional Picture Framers Association and has worked as a CPF for 10 years. She recently finished an AA in Accounting. She is excited to be a part of the finance team at Artspace. In her spare time she enjoys hiking, biking, camping, and traveling with her husband, Brent, and their son, Owen. Nu Lee Director × Nu Lee Director nu.lee@artspace.org Nu Lee joined Artspace Project’s Performance Property Management Company team in May 2011 after graduating from Metropolitan State University in St. Paul with a BA in Accounting. Nu is Bookkeeper for several of Artspace’s real estate commercial and residential properties locally and regionally. She performs regular accounting duties, prepares monthly financial statements, and conducts regular accounting audits. Nu brings a sense of enthusiasm to the Finance team, as well as an attention to detail that is necessary for her position. Her previous work experience varies from providing administrative support at the Department of Natural Resources; extensive customer service at the House of Wong family restaurant; and peer tutoring at St. Paul Public School’s Bruce F. Vento Elementary. When she is not working, she cooks for big family parties, keeps the house polished, and enjoys scrapbooks and photography. Molly McKeen Accounts Payable and Financial Specialist × Molly McKeen Accounts Payable and Financial Specialist molly.mckeen@artspace.org Molly McKeen (they/them) joined Artspace as a Temporary Assistant to the Finance department in the spring of 2022. McKeen is a freelance pet sitter, plays video games, and enjoys spending time with their nieces and nephews. Annie Richardson Staff Accountant × Annie Richardson Staff Accountant annie.richardson@artspace.org Sierra Scheet Controller × Sierra Scheet Controller sierra.scheet@artspace.org Shaela Wilson Operations Manager & Commercial Leasing Administrator, Asset Management × Shaela Wilson Operations Manager & Commercial Leasing Administrator, Asset Management shaela.wilson@artspace.org Shaela Wilson graduated from the Academy of Design and Technology , Chicago, in 2004. She then began to freelance while pursuing her dream of owning her own FedEx Kinkos . Shortly after that idea was born-- and after giving birth to two dance machine, lip gloss-popping divas; and after reading “ The Secret ”-- she began working at Artspace Projects in 2010. From making coffee and scheduling appointments to drawing up leases and managing the Artspace database, Shaela puts her awesome multi-tasking skills to work at Artspace daily. She is not limited to being the Queen of the front desk, however-- she was also MVP of the Minneapolis Pee Wee League Championship game in 1991. In her free time, she likes to draw, spend time with her two lovely daughters, watch popcorn pop in the microwave,  watch the exercise channel while eating that butter-soaked popcorn from the couch. Lee Jin Lead Designer, Communications × Lee Jin Lead Designer, Communications lee.jin@artspace.org Properties Doran O. Harper Director of Project Initiatives, Asset Management × Doran O. Harper Director of Project Initiatives, Asset Management doran.harper@artspace.org Educated in the Chicago Community College system, and DePaul University, Doran also holds the following certifications:  “Certified Property Manager (IREM-NAR); Community Association Manager (License – Illinois); and Certified Manager of Community Associations (CMCA/CAI).  Doran has specialized in the management and development of affordable housing assets for most of his career in the real estate industry, but he has also managed commercial assets that were adjunct to his assigned residential assets.  Geographically, Doran’s asset assignments have included sites in Illinois, Ohio, Iowa, Indiana, Michigan, Kentucky, Arkansas, Missouri, Minnesota, and Wisconsin.  And his program experience includes:  Section 42/LIHTC; Project-Based Section 8 for Families and Seniors; Section 236; RAD; Rural Development; Public and Indian Housing; and Market Rate.  Doran’s connection to the arts is in music.  He was a performing percussionist, who later wrote and taught youth in the field of marching percussive arts.  Doran is married to the love of his life: Tina, and they have 6 adult children and 10 grandchildren. Jean Kramer-Johnson Director of Commercial Leasing, Asset Management × Jean Kramer-Johnson Director of Commercial Leasing, Asset Management jean.kramerjohnson@artspace.org Jean Kramer-Johnson first joined the Artspace family remotely coordinating staff travel from her Montana home. In 2002, Jean moved back to her hometown of Minneapolis, and was offered the position of Executive Assistant to the President. Three years later, Jean joined the Asset Management team and now leads Artspace’s commercial leasing operations. Jean is also the point of contact supporting new project lease up efforts and continues to serve as travel consultant to Artspace staff. When not working, Jean loves to camp, ski, and go on long walks with her husband and her dog, Mayla Belle. Pablo Lituma Project Manager, Property Development × Pablo Lituma Project Manager, Property Development pablo.lituma@artspace.org Get in touch with Pablo here. Pablo Lituma is a first-generation Ecuadorian-American with roots in New York. Mr. Lituma is Indigenous from Azuay, Ecuador, and advocates for the cultural preservation of diaspora communities in the U.S.A. His experiences of living in distinct cultural communities have shaped a path to advocate for equity and diversity in communities. Mr. Lituma's early aspirations to create equity through community and real estate development led him to obtain his  Bachelor of Science of Architecture degree from the University at Buffalo, in New York, and later his dual Master's degrees in Architecture and Community and Regional Planning from the University of New Mexico. Mr. Lituma was part of the second cohort Rafala Green Fellowship at Artspace and now supports Artspace in a Project Manager role in the Property Development department. Jennifer Marmol Director of Investor and Lender Compliance, Asset Management × Jennifer Marmol Director of Investor and Lender Compliance, Asset Management jennifer.marmol@artspace.org Jennifer was born and raised in New York City, where her parents met after migrating from the Dominican Republic. Jennifer is the youngest of three children and the first college graduate in the family. She holds a bachelor's degree in Forensic Science from the John Jay College of Criminal Justice, and is always seeking to learn more, with an interest in a wide variety of subjects. Before joining Artspace in 2014, Jennifer was a project manager at El Barrio's Operation Fightback , a property management and community organization focused on housing, economic development, and social service needs of East Harlem's El Barrio neighborhood. Her bright and easygoing personality, along with her deep understanding of the El Barrio neighborhood, brought great strength and coordination to Artspace's largest project to date: El Barrio's Artspace PS109; of which Jennifer is the Asset Manager. Andrew Michaelson Vice President, Property Development × Andrew Michaelson Vice President, Property Development andrew.michaelson@artspace.org Andrew Michaelson has more than 10 years of experience in the field of affordable housing. He began his career with Artspace as an intern in 2006, and is now Director of Property Development. He played a key role in the development of the Cowles Center for Dance and the Performing Arts, and is currently team lead for the Pullman Artspace Lofts in Chicago and the Space to Create Colorado initiative. He has extensive experience in historic adaptive reuse, including the rehabilitation and conversion of former cavalry buildings at Fort Snelling into supportive housing for homeless veterans and their families (a project he completed as a Senior Project Manager for CommonBond Communities). Andrew holds a Bachelor of Arts and a Forensic Science Certificate from Hamline University, and a Juris Doctor from William Mitchell College of Law (now Mitchell Hamline School of Law). Andrew is a Minneapolis native, and currently resides in the Fulton neighborhood with his wife and two young daughters. He plays drums in his spare time, dabbles in home brewing, and enjoys tinkering in his basement workshop. Becky Carlson St. Clair Vice President, Property Development × Becky Carlson St. Clair Vice President, Property Development becky.carlsonstclair@artspace.org Becky Carlson St. Clair joined Artspace in 2011. She played a key role in the development of projects in Minot, ND; Dearborn, MI; Hastings, MN and Minneapolis, MN and is currently leading the development of SOMO Artspace Lofts, Artspace Utica Lofts, and the NKB Residential Project. Prior to joining Artspace, Becky worked for five years at Somerset Development Company, an affordable housing development company in Washington, D.C. Before moving into real estate development, she worked for two years as a cartographer at Syracuse University and at a custom cartography company in D.C. Becky has a Master of Urban and Environmental Planning from the University of Virginia, a B.A. in Geography from the Maxwell School of Citizenship, and a B.A. in Spanish from Syracuse University. Becky lives in Minneapolis with her husband and two boys. Sarah Swingley Director, Property Development × Sarah Swingley Director, Property Development sarah.swingley@artspace.org Sarah Swingley joined Artspace in 2011, serving in Artspace’s Property Development division for over a decade. Sarah oversees a number of financial processes for Artspace, from financing applications to managing the successful closings of projects, thereby launching new construction in Artspace’s pipeline. Sarah also administers construction draws for projects across the portfolio, and had significant responsibilities advancing developments in Elgin, IL; Waukegan, IL; Hamilton, OH; and El Paso, TX—enabling 184 new units of affordable housing for artists and their families. Previously, Sarah was Senior Mutual Fund Accountant at First American Funds. She holds a Master of Urban & Regional Planning degree from the University of Minnesota’s Humphrey School of Public Affairs, and a B.S. in Finance from the University of Minnesota Carlson School of Management. In her free time, Sarah stays busy with her three very active children. She enjoys home improvement projects, exploring parks and playgrounds, geocaching, kayaking, and hitting the pool. She is also a candy addict. See the PPMC staff list. Learn about your rights in the workplace. Subscribe to our newsletter Instagram Facebook LinkedIn 528 Hennepin Ave, Suite 700, Minneapolis, MN 55403 | ©2024 Artspace Projects, Inc. About What We Do Staff Board History Programs Careers Contact Us Our Places All Places Past Places Leasing Services Consulting Artspace Immersion News + Stories Donate"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    }
  ]
}