{
  "fuentes": [
    {
      "url": "https://www.ormondchamber.com/welcome-to-ormond-beach/",
      "email": "info@ormondchamber.com"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/faq",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/faq",
      "email": "micah@micahrich.com"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/faq",
      "email": "volusia@ifas.ufl.edu"
    },
    {
      "url": "https://www.mapquest.com/us/florida/ormond-scenic-loop-trail-527385284",
      "email": "fishinmagician01@msn.com"
    },
    {
      "url": "https://cdtcoalition.org/about-us/staff-and-board-of-directors/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://cdtcoalition.org/about-us/staff-and-board-of-directors/",
      "email": "info@continentaldividetrail.org"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/",
      "email": "micah@micahrich.com"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/contact",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/contact",
      "email": "micah@micahrich.com"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/on-the-loop",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/on-the-loop",
      "email": "micah@micahrich.com"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "filler@godaddy.com",
    "fishinmagician01@msn.com",
    "info@continentaldividetrail.org",
    "info@ormondchamber.com",
    "micah@micahrich.com",
    "volusia@ifas.ufl.edu"
  ],
  "nombre_sitio": "ormondscenicloopandtrail.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ormondchamber.com/welcome-to-ormond-beach/",
      "text": "Welcome to Ormond Beach - Ormond Beach Chamber of Commerce Skip to content Menu The Chamber Board of Directors About Us Ambassador Committee Partners Staff Contact Us Membership Member Application Member Map Membership Benefits Hot Deals Member-to-Member Deals Member Login Events/Programs Signature Events & Programs Chamber Calendar Community Calendar Visitor Information Welcome to Ormond Beach Weather Information Request Lodging Dining Real Estate Business Resources Resources Job Postings What’s New Menu The Chamber Board of Directors About Us Ambassador Committee Partners Staff Contact Us Membership Member Application Member Map Membership Benefits Hot Deals Member-to-Member Deals Member Login Events/Programs Signature Events & Programs Chamber Calendar Community Calendar Visitor Information Welcome to Ormond Beach Weather Information Request Lodging Dining Real Estate Business Resources Resources Job Postings What’s New Welcome to Ormond Beach About Ormond Beach The History of Speed in Ormond Beach ORMOND BEACH, Fla. - In 1903, the smooth, hard-packed sands of Ormond Beach became a proving ground for automobile inventors and drivers. These first speed tournaments in the US earned Ormond thetitle âBirthplace of Speed.â Records set here during speed trial tournaments for much of the next eight years would be the first significant marks recorded outside of Europe. Motorcycle and automobile owners and racers brought vehicles that used gasoline, steam and electric engines. They came from France, Germany, and England as well as from across the United States. The Ormond Garage, the first gasoline alley before Indianapolis Speedway, was built in 1905 by Henry Flagler, owner of the Ormond Hotel, to accommodate participating race cars during theÂ beach races. The Ormond Garage would house the drivers and mechanics during the speed time trials.Owners and manufacturers stayed, of course, at Flaglerâs Ormond Hotel. Tragically, the Ormond Garage caught fire and burned to the ground in 1976, destroying one of autohistoryâs most important landmarks as well as antique cars owned by local residents who used theGarage as a museum. Sadly, all that remains is a historic marker, in front of SunTrust Bank, built on its ashes on East Granada Boulevard. Racing on Ormond Beach started in 1902. But the cityâs famous connection with racing began in 1903when the Winton Bullet won a Challenge Cup against the Olds Pirate by two-tenths of a second. American records were set that year, and the world took notice. The very next year, world records were set during the 1904 speed tournaments, including one for motorcycles that lasted for seven yearsÂ âÂ 67.36 mph set by Glenn H. Curtiss on his two-cylindermotorcycle. Though poorly organized, the event was a huge success, according to Dick Punnettâs book,Racing on the Rim. Incredibly, the flying mile world record was broken three different times by three different drivers in a 30- minute period that same year. The standing record of 92.31 mph was broken by Louis Ross in his steam- powered racer, the famous Wogglebug, at 94.73 mph. Five minutes later that record was broken by Arthur Macdonald in his Napier with a speed of 104.65 mph. The finalâbut unofficialâworld record for the mile race went to H. L. Bowden, who drove his Mercedes at109.76 mph to break the previously set record. That final time was later disallowed because Bowdenâs carweighed more than 1,000-kg, a limit set by the Automobile Club de France. The Stanley legacy that led to Ormond Beachâs longest-lasting automobile land speed record began in 1897. That year, twin brothers F.E. and F.O. Stanley from Massachusetts built their first steam car. By the turn of the century, their Stanley-Locomobile car was selling better than gas powered cars. The Stanleyscompetitive nature drove them to demonstrate their carâs speed and durability. With impressive wins and near-wins behind them by late 1905, F.E. Stanley designed, built and tested the Stanley Rocket, the most aerodynamic racer of the day. In January of 1906, the Rocket was brought to Ormond Beach to participate in the annual speed tournament. Pictured:Â The Ormond Garage in 1905, with Louis Ross in his steam-powered \"Wogglebug\" No. 4 and other racers. Parks, Scenic Loop & Trails Parks Ames Park 195 South Beach Street Ormond Beach, FL 32174 (386) 676-3216 Gardens, seating, boat launch, fishing pier, restrooms and is great for weddings or photos Andy Romano Beachfront Park 839 S. Atlantic Avenue Ormond Beach, FL 32176 386-676-3250 Gazebo/Pavilion, Outdoor Grill, Parking, Picnic Area, Playground, and Restrooms Bailey Riverbridge Gardens 1 N. Beach Street (386) 676-3216 Dock/Pier, Fishing, Parking, and Walk/Jog Bike Path Birthplace of Speed Park 21 Ocean Shore Blvd Ormond Beach, FL 32176 (386) 676-3250 picnic shelter and tables, grills, boardwalk, deck, seating, restrooms, and outdoor shower Central Park 601 Fleming Avenue 701 Hammock Lane Ormond Beach, FL 32174 (386) 676-3250 Picnic shelter and tables, grills, restrooms, physical fitness trail and playground. Fortunato Park 2 John Anderson Drive Ormond Beach, FL 32176 (386) 676-3216 Northeast corner of the Granada Bridge Boat ramp, tables, picnic areas, playground, restrooms, fishing pier. Magic Forest and Nova Community Center 440 North Nova Road Ormond Beach, FL 32174 (386) 676-3252 Playgrounds, picnic areas, pavilion, racquetball, basketball, and tennis courts. Memorial Gardens Park 78 East Granada Boulevard Ormond Beach, FL 32176 (386) 676-3216 Gazebo, picnic benches, beautiful foliage, excellent for weddings or gatherings. Riviera Park 901 South Beach Street Ormond Beach, FL 32174 (386) 676-3250 Picnic tables and benches, grill, dock/pier, gazebo, fishing, walk/jog path and playground. Rockefeller Gardens Park 26 Riverside Drive Ormond Beach, FL 32176 (386) 676-3216 fishing, parking, walk/jog/bike path, Beautiful scenic gardens and vistas. Sanchez Park 329 Sanchez Avenue Ormond Beach, FL 32174 (386) 676-3250 Gazebo/Pavilion, outdoor grill, parking, playground, restrooms, walk/jog/bike path, fishing and boat launch. County and State Parks Bicentennial Park- County Park 1850 Ocean Shore Blvd Ormond Beach, FL 32176 (386) 736-5953 Baseball Fields, Basketball, Community Center/Meeting Room, Dock/Pier, Fishing, Gazebo/Pavilion, Outdoor Tennis, Parking, Picnic Area, Playground, Restrooms, and Walk/Jog Bike Path Highbridge Park- Volusia County 39 Highbridge Road Ormond Beach, FL 32176 Boardwalk, boat ramps, fishing dock, canoeing, picnic area, outdoor grill, parking and restrooms. Tom Renick Park 1565 Ocean Shore Blvd Ormond Beach, FL 32176 (386) 257-6000, ext. 5953 Fishing, Gazebo, Parking, Picnic Area, Playground, and Restrooms Tomoka State Park- State of Florida 2099 North Beach Street Ormond Beach, FL 32174 (386) 676-4050 Boat Ramp, Camping, Canoe/Non-Motor Boats, Dock/Pier, Fishing, Gazebo/Pavilion, Outdoor Grill, Parking, Picnic Area, Playground, Restrooms, and Walk/Jog Bike Path Scenic Loop & Trails Ormond Scenic Loop & Trail (OSLT) is a 30+ mile double loop of roadways traversing some of the most beautiful and diverse natural scenery remaining in all of northeast Florida. Â There is ready access to the Atlantic Ocean, North Peninsula, Tomoka and Bulow Creek State Parks as well as numerous city and county parks. Â  The roadway view includes unobstructed vistas of two rivers, creeks and marshes, barrier island dunes and beach, and historic dwellings. Visitors seeking a cultural and/or historic experience will find museums and historic public buildings and private homes along the corridor, in Tomoka State Park and in locations a few blocks off the designated roadways. Â Recreational opportunities abound with numerous parks and trails offering boating, fishing, hiking, swimming, bicycling, beach walking and much more. Â Vast expanses of water and natural Florida scrub vegetation create beautiful scenic vistas waiting to be photographed. Â Northern right whales and humpback whales can be seen offshore during migration seasons. Â Dolphins are a common sight. Â Loggerhead, green and leatherback turtles use the sandy beaches along A1A for nesting. Click here Â to visit the Ormond Scenic Loop and Trail website. City of Ormond Beach Map Ormond Beach Area Public Schools Education â Volusia County Schools Ormond Beach Elementary School Osceola Elementary School Pathways Elementary School Pine Trail Elementary School Tomoka Elementary School Hinson Middle School Ormond Middle School Seabreeze High School Private Schools and Higher Education Affiliates © 2025 Ormond Beach Chamber of Commerce | Site by GrowthZone Get In Touch! 386. 677.3454 map and address 165 W. Granada Blvd,Â Ormond Beach, FL 32174 email info@ormondchamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! facebook linked in youtube Instagram icon © 2025 Ormond Beach Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/faq",
      "text": "FAQ Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums More Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Account My Account Sign out Sign In My Account FREQUENTLY ASKED QUESTIONS Please contact us at OrmondScenicLoop@gmail.com if you cannot find an answer to your question. Where is the entrance to the Ormond Scenic Loop and Trail? The Ormond Scenic Loop and Trail is a series of roadways that can be joined at multiple locations. · From Daytona Beach - travel north to Granada Boulevard and continue north utilizing any of the following intersections:  North Beach Street, John Anderson Drive, or A1A/Ocean Shore Boulevard. Or travel north on AIA ( beachside) or Beach Street (mainland) past Granada Boulevard to enter the Loop. · From Flagler County - travel south on A1A/Ocean Shore Boulevard to Highbridge Road and turn right.  Or travel south on John Anderson Drive or Old Kings Highway to Walter Boardman Lane/Old Dixie Highway. You can continue on Walter Boardman Lane (turn left) or continue south on Old Dixie Highway. · From I-95 - take exit 278, Old Dixie Highway and turn left into Walter Boardman Lane or continue on Old Dixie Highway, both will take you around the Loop in different directions. To view our map click here Can you ride a bicycle along the Ormond Scenic Loop and Trail? People do ride bicycles the Loop, however, please be aware that there are no designated bike paths outside of the parks and that many of the roadways are narrow and may have heavy traffic during peak commuting times. How do I find out more about ReGrow the Loop? For more information, visi t https://www.volusia.org/regrowtheloop or contact Sheila Hutchinson at 386-822-5778 or volusia@ifas.ufl.edu . To sign up to take the citizen pledge https://forms.office.com/pages/responsepage.aspx?id=k1x47dXPr02hA03pUaQ7cMaiROt5IlpHsRBDUZ-eorNUMlZJWEo2VzJDNzE1M1RSNzk5MkY2NktGMS4u To register for programs https://www.eventbrite.com/cc/regrow-the-loop-2190559?fbclid=IwAR0XLF2llXB6T5Csb1H6kCNXt4_zYkHoUOgXVqVxd5ZqR3wuQk-sbQOHe9A Where can I get a hard copy of the OSLT map? Click here to view a copy of the OSLT map. Our brochure , which includes the map at the top of page 2, is available at the following locations: MacDonald House - 38 E. Granada Blvd, Ormond Beach Ormond Beach Regional Library - 30 S. Beach Street, Ormond Beach What are your hours? Ormond Scenic Loop and Trail is a series of public roadways which are open 24 hours a day. For optimal viewing of scenery and wildlife daylight hours are recommended. Please obey all speed limits and traffic laws, and watch for birds and animals crossing the roadways, especially at dawn and dusk. Copyright © 2025 Ormond Scenic Loop and Trail - All Rights Reserved. Home On the Loop OSLT Events In the News FDOT Updates Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://www.mapquest.com/us/florida/ormond-scenic-loop-trail-527385284",
      "text": "Ormond Scenic Loop & Trail, Old Dixie Hwy, Ormond Beach, FL 32174, US - MapQuest Get directions My saved places MapQuest Travel Route Planner Print your map Get help Search the web Send feedback Learn more about our mobile apps. Enterprise solutions Claim your business Developer resources Jobs Advertise with us Terms of use Privacy policy Data and licenses About our ads Do not sell Advertisement Advertisement Search places or paste a link Hotels Food Shopping Coffee Grocery Gas Ormond Scenic Loop & Trail ( 616 ) Save Call Website Share Directions Advertisement Advertisement Photos Photo by WhoELS Old Dixie Hwy Ormond Beach, FL 32174 +1 (386) 299-2441 http://www.ormondscenicloopandtrail.com The Ormond Scenic Loop & Trail (OSLT) is a 30-mile double loop of roadways that offers a unique and unforgettable experience of old Florida. This official Florida Scenic Highway and National Scenic Byway showcases the stunning natural beauty of coastal central Florida, with access to the Atlantic Ocean, North Peninsula, Bulow Creek, and Tomoka State Parks. Visitors can enjoy breathtaking views of rivers, creeks, marshes, dunes, and beaches, as well as explore over 299 years of history, including the famous winter residence of John D. Rockefeller, The Casements. Recreational opportunities abound along the OSLT, with numerous parks and trails offering activities such as boating, fishing, hiking, swimming, bicycling, and beach walking. Wildlife enthusiasts can also witness rare and protected species, such as marine turtles nesting from May to September and right whales migrating to birth their calves from December to April. With its diverse natural scenery and rich history, the Ormond Scenic Loop & Trail is a must-visit destination for those seeking an authentic Florida experience. Generated from the website Reviews 4.5 616 reviews Driving the Loop 3/13/2023 A nice way to see the ocean and surrounding area.  It was a beautiful day.  Our trip was during Bike... Read more on Tripadvisor Unique parks and diverse nature 3/3/2023 Stop off to see the Fairchild Oak at Bulow Creek State Park. See  dolphins, boats, birds, and shells... Read more on Tripadvisor Untamed nature 2/26/2023 The drive along the scenic loop began well with an impressive tunnel of oak trees . The road took us... Read more on Tripadvisor Own this business? Claim it See a problem? Let us know You might also like Limitless Charters 2 \"Had a great trip! Spent 4 hours straight catching fish. Caught of variety of fish which included red...\" Jason D Fishin Magician Inshore Charters Fishin Magician Inshore Charters, owned and operated by Captain Butch Morrisey, offers an exceptional fishing experience in Daytona Beach, FL. With over 40 years of experience in the back country and as a professional fishing guide since 1999, Captain Morrisey ensures a memorable trip on his New 2015 24' Skeeter Bay boat powered by a 300 hp Yamaha, providing ample space for 2 people. Tackle and licenses are provided, while clients are encouraged to bring snacks, drinks, sunblock, and a camera for a truly enjoyable adventure. Specializing in inland and nearshore fishing, Fishin Magician Inshore Charters also offers the option of multiple boats for larger groups. With a commitment to customer satisfaction, Captain Morrisey can be contacted at 386-212-4661 or Fishinmagician01@msn.com to arrange an unforgettable fishing experience in the beautiful waters of Daytona Beach.Generated from the website Captain CB Fishing Charters 12 \"Five star experience without a doubt. Me and my family had an awesome time. Captain chuck and Dwayne...\" I3976ATtylerp United States › Florida › Ormond Beach › Ormond Scenic Loop & Trail Advertisement Advertisement"
    },
    {
      "url": "https://cdtcoalition.org/about-us/staff-and-board-of-directors/",
      "text": "Meet Our Team at CDTC Explore the Trail Take a Hike Day/Section Hiking Thruhiking Interactive Map Closures and Alerts The CDT Experience History of the CDT Hiking Resources Maps & Data Northern Terminus Southern Terminus Shuttle Bears and the CDT CDT Finishers Animal Companions in the CDT Register CDT Gateway Communities Colorado Idaho/Montana New Mexico Wyoming × Our Work Advocating for the CDT CDT Communities Gateway Communities Cultural Resources Faces of the Divide Pride on the Divide Education and Outreach Education Resources CDT Families Small Business Resources Gateway Community Summit Trail & Lands Trail Completion Trail Protection Trail Management × Get Involved Volunteer Community Ambassadors Adopt a Trail Program Business Memberships CDT Action Center Help Us Help the CDT Donate today to help us improve the Continental Divide. Donate Contact Us  303-996-2759  [email protected] Contact Us × News & Events Trail Days Dark Skies All News All Events All Publications Passages Magazine Stay Up to Date Subscribe to Our Newsletter today to receive the latest with CDTC. Sign Up Contact Us  303-996-2759  [email protected] Contact Us × About Us Contact Us Corporate & Business Partners Staff & Board Employment Organizational Governance Stay Up to Date Subscribe to Our Newsletter today to receive the latest with CDTC. Sign Up Contact Us  303-996-2759  [email protected] Contact Us × Resources Land Manager Info Publications & Reports Policies Tourism Toolkit Stay Up to Date Subscribe to Our Newsletter today to receive the latest with CDTC. Sign Up Contact Us  303-996-2759  [email protected] Contact Us × Explore the Trail Closures and Alerts Take a Hike Day/Section Hiking Thruhiking Interactive Map Hiking Resources Maps & Data Register Northern Terminus Southern Terminus Shuttle Pets and Pack Animals CDT Completers Bears and the CDT Gateway Communities Colorado Idaho/Montana New Mexico Wyoming Our Work Advocacy For The CDT CDT Communities Cultural Resources Faces Of The Continental Divide Pride on the Divide Education and Outreach Trail Education CDT Families Small Business Resources CDT Gateway Community Summit Trail & Lands Trail Completion Trail Protection Trail Management Get Involved Volunteer CDT Action Center Sign up for Advocacy Alerts Community Ambassadors Adopt A Section Business Memberships News & Events News Events Continental Divide Trail Days Publications Passages Magazine About Us Contact Us Corporate & Business Partners Staff & Board Employment Organizational Governance Resources Land Manager Information Publications & Reports Gas, Electric, And Other Linear Transmission Facilities Policy Tourism Toolkit Donate Store Staff – Board Of Directors Staff Board of Directors Zack Bumgarner | GIS Specialist Zack grew up in North Carolina and developed a love for the outdoors wandering nearby forests and creeks before pursuing a B.S in Geography from Appalachian State University. After several years working for local government in North Carolina, Zack moved to New Mexico to combine his passions for maps and public lands. He spent five years as a Wilderness Ranger on the Santa Fe National Forest, conducting inventories, making public contacts, clearing trail, and protecting Wilderness Character. In 2018, Zack received the USDA’s Wilderness Partnership Champion Award for his efforts. As GIS Specialist, he looks forward to continuing to be a steward of the trail and public lands, and help tell the story of the Continental Divide. L Fisher | Director of Trail Programs L Fisher is an educator and community organizer who grew up in rural Indiana. They received dual degrees in Philosophy and Political Science before earning their Masters in Political Science from Indiana University. Before moving out west, they worked on campaigns and in policy advocacy throughout Indiana and parts of Texas. L’s passion for environmental policy eventually took them to Montana, where they worked as a conservationist and outdoor educator along the Rocky Mountain Front. When they are not working, L is dedicated to being an avid reader, amateur chef, and hiking enthusiast. Dan Carter | Trail and Lands Conservation Manager Dan grew up in rural Tennessee climbing trees and wandering creeks and woods on foot, bike, and horseback. Before heading west, he earned Bachelor’s and Master’s degrees in Civil and Environmental Engineering, respectively, from the University of Tennessee in Knoxville. Dan has been based in New Mexico for the past 11 years, where he’s worked as an engineer, field biologist, and GIS analyst. He earned another Master’s degree in Applied Geography from New Mexico State University. Dan co-founded and serves as President of the Southern New Mexico Trail Alliance. Dan got his first taste of the CDT in 2010, when he joined his friend Peter to hike from Las Cruces to the CDT in the Black Range of the Gila. Since then, Dan has run trail races, backpacked, bikepacked, and maintained trails along sections of the CDT. He’s completed the Pacific Crest Trail, Pyrenees Traverse, and the Monumental Loop bikepacking route. When not on a trail, Dan is usually fixing up his “shack” in the desert, petting his two dogs, rock climbing, or still trying to learn to play music. Haley Gamertsfelder | Field Operations Program Manager Haley Gamertsfelder (she/her) grew up in the mid-Atlantic, with the privilege of frequent visits out west where she was left awestruck by bears and geysers in Yellowstone, towering granite faces in Yosemite, and wide sweeping valleys dotted with mesas in the Southwest. She went on to pursue a degree in Environmental Science and Technology from the University of Maryland. Following college she traveled abroad with her sister for 4 months. In 2018 she moved to Montana for a 3 month long internship and hasn’t left since. She considers herself lucky to have been involved in many facets of western Montana conservation, from the wilderness of the Montana/Idaho border to the seldom visited middle fork of the Flathead in Glacier National Park. When Haley is not in the field or working from home you can find her backpacking, skiing, or gravel biking around her home in western Montana. Claire Cutler | Trail Policy Specialist Claire Cutler grew up in Kailua, Hawaii exploring Oahu’s mountains and ocean. She developed a love for environmental science and policy, and attended Georgetown University to study Science, Technology, and International Affairs. After graduating, she spent time serving as an AmeriCorps VISTA and living in Great Basin National Park, where she helped the park’s non-profit partner with education programs and communications. She is an avid runner on both roads and trails and also enjoys hiking, elaborate baking projects, and reading. Jaime Jennings | Office Manager and Bookkeeper Jaime grew up in Colorado but didn’t begin exploring its beautiful landscapes until her 30s. Since then, she’s fully embraced running, hiking, backpacking, and snowshoeing across Colorado and beyond. After founding and running a successful craft retail store in Denver from 2006 to 2021, Jaime sold it to dedicate her skills to her growing passion for the outdoors. In 2022, she completed a thru-hike of the Colorado Trail, further sparking her love for the CDT. Jaime is thrilled to now be part of the CDTC team, preserving and promoting one of the country’s most stunning long trails. Danny Knoll | Trail Information Manager Danny grew up in Washington D.C. and was introduced to the National Scenic Trails at an early age. He would frequently hike in the nearby Appalachian Mountains which later inspired him to thru-hike the Appalachian Trail, Pacific Crest Trail, and finally the Continental Divide Trail in 2016. After he earned his degree in Business Administration from Valparaiso University he went on to do a variety of things working as a backcountry guide, outdoor educator, wildland firefighter with the U.S. Forest Service, and even a scuba instructor in various locations around the world. Danny is now thrilled to be working with the CDTC and involved in protecting the trail that has had such a profound impact on his life. Audra Labert (Press Contact) | Director of Communications communications at cdtcoalition.org Audra grew up in Central Montana and still calls the region home. She began her career working along the Continental Divide in the Bob Marshall Wilderness but has done various things in her professional life, from Wilderness Ranger to farmer, backcountry guide, and yoga teacher. Audra developed her niche several years ago in the communications and marketing realm, and she loves the creative and storytelling aspects of the work. With such an amazing backyard, Audra spends as much time outside as possible with her family and border collie Echo. She also loves exploring the desert wildlands of the Southwest. Sierra LaBonte | Montana Regional Representative Sierra comes to CDTC via the long scenic route. Originally hailing from western Massachusetts (think farms, rivers, hills), Sierra moved out west after high school, attending college in Vancouver, BC. After just two years, Sierra was unsure of her direction in school and left, moving to Flagstaff, AZ to join a conservation corps and begin her first (of three) AmeriCorps terms. Arizona led to Montana, where she began her work in outdoor education, introducing teens to conservation work throughout the state. Finally, she was ready to continue her education, and enrolled at the University of Montana to study Philosophy and Public Health. Her summers were spent in NH and ME, instructing teenagers on skills ranging from backpacking, canoeing and rock-climbing. In 2017, she joined a USFS trail crew, beginning as a trail crew member and ending as foreman. She is proud of her time working in some of the wildest places in the lower 48 (Selway Bitterroot Wilderness, Frank Church River of No Return Wilderness and the Bob Marshall Wilderness) and even more proud to call herself a trail dog. Outside of work, you can find Sierra in her gardens with her four Indian runner ducks and spotted dog Frank, or pressuring her partner Sam to start a new house/yard project. Teresa Martinez | Executive Director For over 30 years, Teresa has worked professionally to increase awareness, engagement, access, and stewardship of our entire National Trails System. A graduate of Virginia Tech, Teresa holds a B.S. and M.S from the Department of Fisheries and Wildlife in the College of Natural Resources. Teresa is a life long outdoor recreationist and from 1987-2007 she worked for the Appalachian Trail Conservancy, from 2007 to 2012 she worked for the Continental Divide Trail Alliance and since 2012 she has been the Executive Director (and co-founder) of the Continental Divide Trail Coalition. She serves on the Trail Leadership Council of the Partnership for the National Trails System and has served as the Chair of the Federal Advisory Committee to aid the USFS in the development of the Pacific Northwest National Scenic Trail. Teresa is actively involved in the creation of equitable spaces for all people in the outdoors and currently serves as the acting chair of the Board for the Next100 Coalition. In 2019,Teresa was honored by the Virginia Tech College of Natural Resources as the recipient of the Gerald Cross Alumni Leadership Award. When not working on behalf of one of our National Trails, Teresa may be found exploring trails in and around Santa Fe, NM, by bike, horse, and foot and is always up for a discada with friends in cool outdoor places! Allie McCurry | Development Specialist Allie grew up in Bend, Oregon, where she spent her time roaming the high desert with her dogs. Allie’s fascination with how people interact with their landscape led her to complete her undergraduate and graduate degrees in anthropology and archaeology. After graduating, she spent several years switching between seasonal park ranger jobs for the National Park Service and extended trips abroad with her husband before working as an assistant park manager for Montana Fish, Wildlife, and Parks. Allie and her husband run a hobby cherry orchard in Bigfork, Montana, where they live with their two young children, two dogs, and lots of chickens. Allie is deeply passionate about sharing her love of the outdoors with her children, and she spends her time hiking, camping, skiing, and boating with her family. Michael McDaniel | Technical Field Specialist Michael “Peacock” McDaniel grew up in Kansas City, Missouri. He left home to voyage across international borders during his young adulthood, traveling to all continents but Antartica. In 2015, he stumbled upon the Appalachian Trail, an adventure so grand it became the basis for a nearly decade long love affair with long distance hiking. He moved to Colorado later that year and began exploring many of America’s long distance trails, including the Continental Divide Trail. Lauren Murray | Director of Development Lauren joined CDTC in 2018 and lives just outside of Helena, Montana. She was born and raised in a small Colorado mountain town and earned her degree in Environmental History and Political Science from Colorado State University. She’s been fortunate to live and work in Yosemite National Park, to travel across North America with her husband in a van for a year, and to develop an affection for all outdoor pursuits including mountain biking, backpacking, and climbing. To balance out her “extreme” hobbies, Lauren is also an avid gardener, highly unsuccessful mushroom hunter, and loving mother to one human and one rottweiler. Lauren can be reached at development at cdtcoalition.org. Becca Olson | Community & Outreach Coordinator Becca grew up in the land of 10,000 lakes (and even more mosquitos). Her passion for the water and the outdoors deepened in 2014 when her aunt took her on her first backpacking trip to Glacier National Park. She was captivated by the landscape, wildflowers and mountain culture. When deciding where to go to college, she felt drawn to the West and found herself at the University of Montana. Becca graduated with a bachelor’s degree in Journalism, concentrating on RTV Production. Her goal is to combine her storytelling skills with her passion for wild places to advocate for conservation and the protection of our natural landscapes. Steven Shattuck | Director of Operations Steven “Twinkle” Shattuck is an accounting and finance professional with a passion for the outdoors. He has a Bachelor’s in Business Administration and a M.S. in Accounting from Grand Valley State University in Michigan. Steven is a licensed CPA in both Michigan and Colorado who enjoys time away from the computer screen being active in the outdoors. Long distance hiking, backcountry skiing, canyoneering, packrafting, and mountaineering are his favorite outdoor pursuits when not reading SEC filings. Having hiked most of the CDT in 2015, Steven couldn’t be more excited to work for an organization that gives back by protecting and promoting the trail high on the Divide. Cornell \"Corey\" Torivio | New Mexico Regional Representative Cornell “Corey” Torivio was born in San Bernardino, CA. He is Native American from the Pueblo of Acoma, NM. Corey has a BA in Culinary Arts and a passion for the outdoors, particularly wilderness and desert areas, and has devoted his life to giving Native youth an opportunity to be successful in the ever-changing world. The founder of Ancestral Lands Conservation Corps, he has built a strong foundation that, to this day, continues to change the lives of Native youth. Corey has been in the preservation and conservation field for more than 20 years. Having worked with Acoma’s Historic Preservation Office, he received the Heritage Preservation Award from former New Mexico Governor Bill Richardson for his outstanding work on the San Estevan Del Rey Mission at Old Acoma. He also has devoted his time to working with the National Park Service in the preservation of Native and Non-Native Historic and prehistoric sites in the El Malpais/El Morro conservation area and monument, Petrified Forest National Park, and Aztec Ruins National Monument. He continues to advocate for the protection of all culturally sensitive areas in and around the Four Corners Region, both Native and Non-Native. Corey began conservation work with the Southwest Conservation Corps in 2006, and he played a key role in SCC’s transformation to Conservation Legacy. Having served as a vice chair and board member for more than 13 years, he has been instrumental to conservation and trail efforts in the Southwest. Corey brings his knowledge and expertise in working with Indigenous communities, preservation, and conservation, with him to the Continental Divide Trail Coalition. Corey’s most successful effort was having Ancestral Lands Youth Corps be the model of the Native American Conservation Act. Working with former Senator Tom Udall (D-NM), and many others, Corey helped guide this act through Congress, and it now provides opportunities for all Indigenous communities across the United States to build community conservation organizations. Corey believes in giving his 110% to CDTC and hopes to help build a stronger, brighter future, not only for CDTC but for the trail itself. Kinsey Warnock | Field Crew Leader Kinsey “Past Ten(t)se” Warnock grew up in the wide open spaces of New Mexico. She earned an Environmental Studies degree from Brandeis University. After graduating during the pandemic she took a job with the Idaho Conservation Corps and hasn’t left the trail world since! She thru-hiked the PCT in 2021 and was hooked. In 2023, she completed the CDT. This trail felt like coming home to her. She loved every minute of it and felt connected to it in a way that she didn’t experience on the PCT. She is excited to spend another year with the CDTC working on the trail she holds close to her heart. Bring on another season of good people, rewarding work and nights under the stars. Jordan Williams | Colorado Regional Representative Jordan calls the Pacific Northwest home, but the sunshine and mountains have kept him in Colorado for over ten years now. After graduating from Gonzaga University in Spokane, WA, Jordan received his Master’s degree from the University of Northern Colorado and currently lives in Fort Collins, CO with his wife and their Australian Cattle Dog. Jordan’s professional background includes stints in college athletics, community recreation, and natural resources. While working for the Poudre Heritage Alliance (the nonprofit partner of the Cache la Poudre River National Heritage Area), his wife had the crazy idea to hike the Colorado Trail from Denver to Durango with their dog. After 31 days of backpacking, Jordan had officially fallen in love with the Continental Divide. Now he looks forward to promoting and protecting that landscape throughout Colorado with CDTC. Jordan spends his free time volunteering in the Northern Colorado community, trail running with his dog, trying to become a better skier, and supporting his wife’s love of rock climbing. Jill Yoder | Development Manager Jill Yoder lives in Anaconda, Montana with her two dogs, Maisie and Benny. Jill came to Montana via a summer job in Yellowstone National Park and then she attended Montana State University earning a B.A. and M.A. in English. After graduating from MSU, Jill began working in nonprofits where she developed a love for nonprofit fundraising, grant writing, and grant management. Jill spends much of her time hiking, fishing, backpacking, and skiing near and far from her home in Anaconda. Interested In Joining Our Team? Check Out Our Job Openings! Check Out Our Openings Board Of Directors Greg Pierce | President Greg is an active outdoorsman and has been a supporter of the Continental Divide Trail for well over a decade. He has been active as a volunteer by building trail and by advocating for the Trail and the CDTC. He is a CDTC charter member and served on the original Advisory Committee to develop the CDTC’s vision, values and organizational pillars. Greg joined the CDTC Board of Directors in December 2016. He has a background in problem solving, consensus-building, and navigating thorny circumstances in his outdoor and professional careers. Greg is a product manager and analyst by profession, working with customers and other stakeholders and technical experts to solve problems and improve processes through the use of technology. Additionally, he develops long-term product strategies and implements them using near-term incremental achievements. A native Coloradan with ties to Wyoming and New Mexico, Greg is dedicated to completing and promoting the CDT as a 3100-mile sanctuary for those who seek wild places. Dean Myerson | VP Dean is a New York native who moved to Colorado in 1990 to pursue an undergraduate degree in Civil Engineering from the University of Colorado, ultimately completing his studies there with an MS in Construction Engineering and Management. Professionally, Dean has spent his career in real estate development and construction. He has been instrumental in the developments at many ski resort related projects including Keystone’s River Run Village, Copper Mountain and the Village at Winter Park. In 2008 he started his own real estate investment company focusing on residential in-fill developments. Dean is also active in the Colorado startup community as both an investor and mentor to entrepreneurs. Growing up in New York near the Appalachian Trail and being actively involved in scouts created a love for the outdoors that has continued to play an important role in his life. While in college Dean worked summers as a trip leader taking teens on backpacking, canoeing and cycling trips throughout the Northeast. He has also travelled extensively by bicycle across North America (cross country twice) as well as many destinations around the world including Europe, Australia and New Zealand. More recently, Dean has completed thru-hikes of the John Muir Trail, the Appalachian Trail, the Pacific Crest Trail and the Colorado Trail. His previous board experience includes participation with the Urban Land Institute, the Denver Art Museum and YMCA Camp Jewell. Sharon Buccino | Secretary Growing up in central Florida, Sharon soon realized she needed more mountains in her life.  Standing on top of Yosemite’s Half Dome convinced her to pursue environmental law.  From California, Sharon went to Alaska where the mountains were even bigger.  She worked for the Alaska Supreme Court as it dealt with the aftermath of the Exxon Valdez oil spill. While dramatic landscapes first drew Sharon to environmental law, it is people who have kept her in the game.  People like the folks who care passionately about the CDT and the communities along it.  Inspired by writers like Wallace Stegner, Mardy Murie and E.O. Wilson, Sharon has come to know the importance of saving the wild in the world – not for nature’s own sake, but to save ourselves. Sharon has served in a variety of professional roles.  Most recently she led the Office of Surface Mining Reclamation and Enforcement at the U.S. Department of the Interior.  Previously, Sharon directed the Land & Wildlife program at the Natural Resources Defense Council.  She is an active member of the Wyoming Bar.  In her practice, Sharon works with non-profits and local governments on community economic development and effective public engagement strategies.  She has served as an adjunct professor at the University of Wyoming and Georgetown Law School.  In addition, Sharon serves as a Planning Commissioner for the City of Laramie, Wyoming. Sharon moved to Laramie after living in Washington, DC, for over 25 years.  She is always looking for ways to get outside.  Every once in a while, she can convince her husband or two daughters to come sleep on the ground with her.  Even when she can’t, you’ll find Sharon exploring the Medicine Bow National Forest, the Red Desert and the CDT. Arthur Foley | Treasurer Currently living in Colorado Springs, Colorado, Arthur’s love for long-distance trails began on the A.T. as a Boy Scout while growing up in Virginia, and has continued throughout his adult life while residing in West Virginia, North Carolina, and Colorado. A life-long hiker, Arthur has been an active Appalachian Trail volunteer for more than 46 years. He served on the board of the Appalachian Trail Conservancy for 24 years, including 18 years as ATC treasurer. He continues to serve as a member of the ATC Audit Committee In 2011 he became the 54th person, in ATC’s 95-year history, to be named an ATC Honorary Member, the Appalachian Trail Conservancy’s highest award. Professionally, Arthur worked in higher education finance for 32 years, serving as chief financial officer of 2 universities. Additionally, he served 4 years on the board of the National Association of College and University Business Officers. Following early retirement from the University of North Carolina at Asheville, he was recognized as Vice Chancellor Emeritus for Financial Affairs. Previously, Arthur served a short period on the board of the Continental Divide Trail Alliance prior to its close. In March 2018, he joined the CDTC board and looks forward to using his knowledge, experiences and skills to advance the CDTC and CDT. Brett Bruyere | Member At Large Brett Bruyere is a faculty member and conservation social scientist at Colorado State University. Over the years his teaching and research has focused on conservation education, collaboration and partnerships, and conservation leadership. He has published 50+ publications in academic journals and received several teaching, mentoring and outreach awards. Several of his graduate students have worked with CDT on topics related to CDTC’s Gateway Communities program. An avid trail runner living in Colorado, Brett has covered thousands of miles of trails in the state, including segments of the CDT in the northern part of the state. He has served up trail magic to many CDT thru hikers over the years and provided rides for hikers headed into towns to resupply.  Brett also co-founded a non-profit focused on empowerment of women and youth in Kenya, and has served on several boards related to conservation, science and education. Amy Camp | Member At Large Amy Camp founded Cycle Forward in 2013 with the plan to help communities better connect to and benefit from their trails. She is a trails and tourism consultant, a place-maker, and a certified coach. She helped to launch the nationally recognized Trail Town Program ® in 2007. She has since offered her consulting services along trails of all types throughout the U.S. and Canada. Amy’s book, Deciding on Trails: 7 Practices of Healthy Trail Towns, was published in December 2020. It outlines the history of the Trail Town/Gateway Community movement and recommends best practices for trail communities. Amy has had consulting engagements in two CDT Gateway Communities (Silver City and Lemhi County) and instantly fell for both places. She looks forward to getting to know others along the trail as well as the trail itself. Amy served on the Board of American Trails from 2012-17, acting as Board Secretary and Chair of the Hulet Hornbeck Emerging Leaders Scholarship Program. She is an Associate Certified Coach through the International Coach Federation and firmly believes that her coaching certification makes her a better consultant. Amy lives in Pittsburgh, Pennsylvania, where she first grew to love communities and began her work to help improve them. In her spare time, she hikes, bikes, and cross country skis, and generally enjoys being outside as often as possible. Naomi Hudentz | Member At Large Naomi thru-hiked the CDT in 2012. While she doesn’t have a “favorite trail,” she says that if she could only hike one more trail, it would be the CDT. Thru-hiking inspired her to leave her corporate career to pursue her passion for the outdoors. She’s a co-founder of Treeline Review, a website dedicated to making the outdoors accessible to everyone while also reducing consumption. As an actuary, she brings decades of private sector experience in project management, budget and financial projections, and long-term business vision, strategy, and goals. As a website owner, she brings 7 years of search optimization (SEO) experience and content management. She currently resides in Washington state. Joe Jessepe | Member At Large Joe Jessepe is an enrolled member of the Blackfeet Tribe and has spent his entire life on the Blackfeet Indian Reservation. He attended college at Flathead Valley Community College, University of Montana, and was a member of the first cohort of the Native Americans in Natural Resources at Humboldt State University at Arcata, California and majored in Natural Resource Conservation. Joe has served on the Board of Directors of: The Glacier Natural History Association, Opportunities Incorporated, and the Cook Scholarship for St. Paul’s School in New Hampshire. Joe is currently the President of CIRCLE, a Non-Profit Indian Education consulting group. He was also a founding member of the Badger-Two Medicine Alliance. Joe has been the driving force behind Scholars of Promise for the past 15 years, supporting students to apply to and graduate from college.  This includes serving as the advisor and mentor to a student intern which he helped obtain a position with NOAA. And, Joe serves as an Associate Judge on the Blackfeet Tribal Appellate Court. Kathleen Lynch | Member At Large Hailing from Connecticut—a state tied with Iowa as having the lowest percentage of public land in the U.S.—Kathleen was first exposed to National Scenic Trails when her 10th grade math teacher thru-hiked the Appalachian Trail. After nearly a decade of savings, Kathleen fulfilled her pipedream of thru-hiking the Pacific Crest Trail in 2014 and the Continental Divide Trail in 2015. Kathleen works in Sustainability at Levi Strauss & Co. in San Francisco, where she oversees material and supply chain innovation, and is responsible for executing Levi’s industry-leading greenhouse gas emissions reduction targets. Kathleen sits on several industry committees tackling the most pressing climate, energy, and DEI opportunities of our time. Prior to Levi’s, Kathleen worked in sustainability and sourcing at Big Agnes, Inc. in Steamboat Springs, Colorado. While at Big Agnes, Kathleen brokered the company’s adoption of 74 miles of the CDT, and planned and oversaw a three-month, 750-mile employee relay on the Colorado section of the trail. Kathleen took her Mom on her first-ever backpacking trip on the CDT, cementing Santa Fe National Forest as a place that holds her heart. Amy McCormick-Friesz | Member At Large Amy McCormick has spent her 14 plus fundraising career at the Appalachian Trail Conservancy (ATC) and in the land trust community and is now a fundraising and communications consultant and principal at McCormick & CO Consulting. Amy holds a Masters in Corporate and Organizational Communications from West Virginia University (WVU) and is a native West Virginian. After a number of years living in Portland, Oregon, she now lives in Astoria, remains smitten by the Pacific Northwest, especially the Oregon coast. When she’s not working, Amy can be found hiking or camping in the East Cascade Mountains or walking along the Oregon coast’s beaches and old growth forests with her partner Dan and their beloved (and terribly rotten) Shiba Inu, Moxxi. Regan Betts | Member At Large Regan Betts has spent most of the last 20 years within the outdoor industry not only as a marketer, but as an architect of corporate advocacy groups. Most recently, at Oboz Footwear, Regan was the Brand Manager and a founding member of Oboz’s Inclusion, Diversity, Equity, and Access committee. Then in the fall of 2023, she established her own marketing and copywriting business, and now also works part-time at her daughter’s elementary school as a paraprofessional. Regan grew up in southeastern Ohio and, after graduating from Miami University, moved westward. She immediately fell in love with the Rocky Mountains and all the skiing, riding, and hiking it had to offer while living in Steamboat Springs, CO, but it wasn’t until much later when she moved to Lyme, NH where she caught the long-distance hiking bug and spent the weekends section hiking the AT with her husband. However it wasn’t long until the Rockies beckoned her back, this time to Bozeman, MT where she currently resides with her husband, daughter, and energetic pup, Billie Rose. When she’s not working, Regan can be found hiking, running, skiing, knitting, or having fun with her family. Amiththan Sebarajah | Member At Large Amiththan brings years of experience in building community and organizing anchored in approaches to consensus and grassroots activism to the CDTC Board of Directors. He holds a Graduate degree and has hiked thousands of miles along distance trails world-wide. He believes that there is no trail without people. As a student, Amiththan co-founded two successful, grassroots movements for Sri-Lankan-Canadian youth centered on post-civil-war dialogue towards inter-communal reconciliation. He conceived and orchestrated successful fundraisers, shaped their voice and communication strategies, wrote public opinion pieces and secured multi-year grants at the federal level. He is proud to have been at the ground level of The Tamil Student Volunteer Program and The Sri Lankans Without Borders not-for profits. Both of these organizations emerged at a pivotal moment for the emerging Sri Lankan-Canadian community and he takes special pride in creating a space where none existed. As an academic he is keenly interested in ideas of kinship, belonging, and, of course the land. As a transplant to North America and a survivor of civil war his advocacy and activism are rooted in the ways in which land as a socio-political construct and lived reality underpin belonging. He also believes that the work around creating any sense of belonging is always ongoing. The Continental Divide Trail traverses millions of footsteps across a number of ancestral indigenous homelands. There are, as well, many other stakeholders in this landscape. However, he sees the CDT as not only a delineated footpath that connect these communities but also as an opportunity for creating and fostering an interconnected web of consensus and relationships, centered around the stewardship for the land. As a member of the CDTC’s Board of Directors he hopes to build, lead and connect the trail to the people, the people to the land and each other. Amiththan welcomes the opportunity to champion initiatives that continue to distinguish the CDTC as a leader in building a trail as well as trail of communities. Kevin Webber | Member At Large Kevin Webber is a dynamic & innovative entrepreneur with backgrounds in sales, marketing, business development, and manufacturing. He is the CEO and co-founder of Colorado’s largest wine operation: Carboy Winery. Since 2016 Carboy Winery has slowly turned a state known for its beer into one that makes exciting wines, lifting the Colorado wine industry into prominence. Kevin currently sits on both the Colorado Wine Industry Development Board as the marketing chair and the Colorado Association for Viticulture & Enology’s Board of Directors as the legislative chair. His passion is for building impactful brands that give back. During his time at Fourpoints, Kevin was a steering committee member for the Colorado Outdoor Business Alliance (Conservation Colorado), and he worked with outdoor environmental partners including the CDTC to push conservation initiatives such as the CORE Act and more specifically protection of the Camp Hale Continental Divide Wilderness Area. In his free time, Kevin enjoys spending time with his wife and kids in the great outdoors. Alexa Tubbs | Member At Large Alexa “Highlight” Tubbs is a creative entrepreneur and passionate community builder who thrives on bringing people together. Initially pursuing a career in the arts, she earned a Master’s in Art Business from the Sotheby’s Institute of Art and spent eight years working in the New York City art world. But in 2018, she traded gallery walls for the open trail, leaving the city to thru-hike the Appalachian Trail southbound. That journey led to a CDT thru-hike in 2019, where she met her partner, Matt “Brew Hiker” Leef in Glacier National Park. Inspired by their shared love of long trails and the communities that make them special, Alexa and Matt planted roots in Silver City, NM, and co-founded Open Space Brewing—a craft brewery with a mission to give back to the trail community. As CEO of Open Space Brewing, Alexa fosters relationships with outdoor advocacy groups like New Mexico Wild, the National Forest Foundation, and Gila Back Country Horsemen to support trails and public lands. As a dedicated public lands advocate and community organizer, she is excited to join the CDTC board to champion the protection, completion, and stewardship of the CDT. When she’s not working on the brewery, Alexa enjoys volunteering on trail crews and exploring her big backyard, the Gila Wilderness, with her partner, Matt, their dog, Bobby, and their hiking cat, Jerry.  Help Support The Continental Divide Trail Coalition Donate Today  Visit Our Store! Proceeds from all products sold through the CDTC Trail Shop support our work to complete, promote, and protect the Continental Divide Trail, so you can rep the CDT with pride knowing your dollars support the trail you love. Visit Trail Store  Contact Us Have any comments, questions, or concerns? We’d love to hear from you! Follow the link and someone will reach out to you shortly. Get in Touch Stay Up to Date! Sign Up for Our Newsletter Today Sign Up Today Follow Follow Follow Follow The Continental Divide Trail Coalition (CDTC) is a 501(c)(3) national non-profit organization building a strong community of CDT volunteers, enthusiasts, and supporters who want to see the Continental Divide National Scenic Trail (CDT) completed and protected. Get In Touch  Mailing Address: 619 12th Street, PO Box 428 Golden, CO 80402  (303) 996-2759  [email protected] Explore News & Events Employment Magazine Contributor Info Press & Media Corporate Partners Incident Report Form Donate © 2025 Continental Divide Trail Coalition | All Rights Reserved | Terms of Service | Privacy Policy | Cookie Policy"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/",
      "text": "Ormond Scenic Loop and Trail - Scenic Highway, Hiking, Fishing, Beaches, Florida State Parks, Birding, Scenic Drive, History of Ormond Beach Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums More Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Account My Account Sign out Sign In My Account Ormond Scenic Loop and Trail Ormond Scenic Loop and Trail Ormond Scenic Loop and Trail Ormond Scenic Loop and Trail An official Florida Scenic Highway & National Scenic Byway Ormond Scenic Loop and Trail Ormond Scenic Loop and Trail Ormond Scenic Loop and Trail Ormond Scenic Loop and Trail An official Florida Scenic Highway & National Scenic Byway THE LOOP Come experience a unique and special part of old Florida you won't soon forget! Ormond Scenic Loop and Trail (OSLT) is a 34 mile double loop of roadways traversing some of the most beautiful and diverse natural scenery remaining in all of coastal central Florida.  There is ready access to the Atlantic Ocean, North Peninsula, Bulow Creek and Tomoka State Parks. The roadway view includes vistas of rivers, creeks, marshes,  dunes, and beaches. You can see those natural features balanced with over 300 years of history including The Casements, the winter residence of John D Rockefeller. There are several unique opportunities to view rare and protected wildlife on the beach, May-September is marine turtle nesting season and December-April the right whale migrates off our coast to birth their calves. Recreational opportunities abound with numerous parks and trails offering boating, fishing, hiking, swimming, bicycling, beach walking, and much more. Please click here for our brochure PLACES TO VISIT ON THE  LOOP The On the Loop page highlights some of the major attractions on the Ormond Scenic Loop and Trail. Our Parks page lists all parks on the Loop. Included are three Florida State Parks; North Peninsula State Park, Bulow Creek State Park, and Tomoka State Park as well as  Volusia County parks and City of Ormond Beach parks. Our On the Loop page has additional details about the major parks. A  large section of the Ormond Scenic Loop and Trail runs along AIA where there are many beach access points. Our Beaches page lists these addresses plus beach rules and information. Our Fishing page has information on surf and bank fishing and locations of docks and bridges, as well as fishing licenses and regulations. Hiking trails are listed on our Hiking page. Historic sites and other points of interest are listed on our Historic Sites/Museums page. All roadways are public access with no tolls. Please obey all speed limits and traffic laws, and watch for birds and animals crossing the roadways, especially at dawn and dusk. UPCOMING EVENTS OSLT August Newsletter Ormond Scenic Loop and Trail Monthly Newsletter Coastal Clean Up - September 20th We are very excited to once again be participating in the Ocean Conservancy's 40th Annual International Coastal Cleanup and we need your help!  The International Coastal Cleanup® (ICC) is a global initiative that engages volunteers and organizations to remove trash from the world’s beaches and waterways, all on the same day! To learn more visit: International Coastal Cleanup® - Ocean Conservancy Click the link below to read more... https://oslttest.blogspot.com/2025/08/help-clean-up-along-loop.html OSLT Monthly Meeting Ormond Scenic Loop and Trail Monthly Meeting We hope you will join us to learn about OSLT's upcoming events and plans. WHEN: Wednesday, August 27th WHERE: Virtual Only We will be suspending in-person meetings during the months of June, July and August. We invite you to join us remotely using the link below. Call in instructions are also included. TIME: 5:00 p.m. - 6:30 p.m. Join Us Remotely: Click here for instructions Ormond Beach Farmers Market Ormond Beach Farmers Market Ormond Beach Farmers Market Returning: September 18th, 2025 Please join us on the 3rd Thursday of September at the Ormond Beach Farmers Market! Time: 8 am - 1 pm Where: 30 S. Beach St, Ormond Beach, FL After a short summer break, we will be back with information about the Loop, other non-profit organizations, fishing and wildlife, and OSLT merchandise. Freebie for the kids! To lean about volunteering at the Market or other Community events please email us at OrmondScenicLoop@gmail.com NATIONAL SCENIC BYWAY FLORIDA SCENIC HIGHWAY NATIONAL SCENIC BYWAY October 2009 Ormond Scenic Loop and Trail is designated as a National Scenic Byway. OUR MISSION FLORIDA SCENIC HIGHWAY NATIONAL SCENIC BYWAY To preserve, protect and enhance the Ormond Scenic Loop and Trail by serving as a focused source of education, community outreach, and enhancement projects consistent with our volunteer resources and the guidelines of the Florida Scenic Highway and National Scenic Byway programs. FLORIDA SCENIC HIGHWAY FLORIDA SCENIC HIGHWAY FLORIDA SCENIC HIGHWAY July 2007 Ormond Scenic Loop & Trail is officially designated as a Florida Scenic Highway. Organization becomes a Corridor Management Entity (CME) Copyright © 2025 Ormond Scenic Loop and Trail - All Rights Reserved. Home On the Loop OSLT Events In the News FDOT Updates Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/contact",
      "text": "Contact Us Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums More Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Account My Account Sign out Sign In My Account Subscribe to our Newsletter Sign up to hear about upcoming meetings, events, and volunteer opportunities. Please add our email address to your contacts to avoid having your newsletter go into your SPAM folder Email Sign up Volunteer Sign Up Name* Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. CONTACT US The Ormond Scenic Loop and Trail OSLT is part of Florida Scenic Highways and America's Byways P.O. Box 1807 Ormond Beach, FL 32175 OrmondScenicLoop@gmail.com Contact Us Contact Us Name* Email* Sign up for our email list to receive our Monthly Newsletter with news and events. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Contact Us Facebook Instagram Copyright © 2025 Ormond Scenic Loop and Trail - All Rights Reserved. Home On the Loop OSLT Events In the News FDOT Updates Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://ormondscenicloopandtrail.com/on-the-loop",
      "text": "On the Loop Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums More Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home On the Loop OSLT Events In the News FDOT Updates Our History Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Account My Account Sign out Sign In My Account On the Loop - State Parks Tomoka State Park North Peninsula State Park Tomoka State Park Tomoka State Park offers hiking, full-facility camping, fishing, and boating. There is also a boat ramp and a park store that offers camping supplies, snacks, and canoe and kayak rentals. Open every day, 8 am - sundown $5 per vehicle 2099 N. Beach St., Ormond Beach FL 32174 Bulow State Park North Peninsula State Park Tomoka State Park Bulow State Park, home of the Fairchild Oak, possibly the largest live oak tree, has several hiking trails including one that leads to the Bulow Plantation Ruins Historic State Park . Open every day, 8 am - sundown No entrance fee 3351 Old Dixie Highway, Ormond Beach FL North Peninsula State Park North Peninsula State Park North Peninsula State Park North Peninsula State Park offers three miles of sandy beaches, a picnic area, hiking, birding, a bicycle  maintenance station and picnic area along a restored salt marsh. Open every day, 8 am - sundown No entrance fee 40 Highbridge Road Ormond by the Sea,  FL On the Loop - N Beach St / Old Dixie Highway Bailey Riverbridge Gardens Bailey Riverbridge Gardens Bailey Riverbridge Gardens on the east side of Halifax River just north of the Granada Bridge, has a fountain, gardens, and a walkway over the Halifax River to a gazebo on the water. Also in the park is Pilgrims Rest Church, the historic site of the first Christian wedding in North America was preserved by the Ormond Beach Historic Trust Open 24 hours - No entrance fee 1 N Beach St, Ormond Beach, FL 32174 Ormond Yacht Club Bailey Riverbridge Gardens The Ormond Yacht Club sits on pilings over the tidal waters of the Halifax River.  Currently undergoing renovations, it was built in 1910 by several of Ormond’s founding fathers including John Anderson. When built it was not listed on the county or city tax rolls since it sat offshore on the Halifax. The interior has a coquina fireplace, a pool table, meeting areas, and kitchen facilities. https://ormondyachtclub.com/history-1.html Anderson-Price Memorial Building Named in honor of John Anderson and Joseph Price, known for the Hotel Ormond and establishing racing on the beach to promote their hotel. For many years the building was used as the Ormond Beach Library. The Women’s Club deeded the property to the Ormond Beach Historical Society in 2002 which maintains the building. 42 North Beach Street, Ormond Beach, Florida The Dix House Dix House was constructed in 1878 by Colonel Dix for his sisters, Ruth and Eliza, two of the first settlers in the area. Originally used as a boarding house by the Dix sisters, the second floor, Dix Hall, was used for meetings and social events. This is where John Anderson and Andrew Bostrom convinced the city founders to change New Briton to Ormond Beach in honor of James Ormond on April 22, 1880. This is a private residence. 178 N. Beach Street, Ormond Beach Huguenot Park Woodham Woods Trail Huguenot Park is a .5 acre park located on the banks of the scenic Halifax River. This picturesque park provides access to fishing and views of the water. https://www.ormondbeach.org/Facilities/Facility/Details/Huguenot-ParkMini-Park-30 401 N Beach St, Ormond Beach, FL 32176 Open - Sunrise to Sunset Free admission Woodham Woods Trail Woodham Woods Trail Woodham Woods Trail Hikers and cyclists share this paved trail and leashed dogs are welcome. The trail continues through a wooded area to Tomoka State Park Free unless you enter the park gates then $2 per pedestrian/cyclist. Restroom inside the park gates at the concession area Open 8 AM to sunset. Trailhead: 29.3277, -81.0774 Address: Corner of Beach St & Inglesa Ave Tomoka State Park Tomoka State Park Open daily, 8 am - sundown $5 per vehicle 2099 N. Beach St., Ormond Beach FL 32174 Dummett Sugar Mill Ruins Dummett Sugar Mill Ruins were part of the Dummett Plantation and the site of the first steam-powered cane-crushing mill in the area. Dummett used the labor of about 100 African slaves and 40 local tribe members to turn the juices from the crushed sugar cane into molasses which was later distilled into rum. During the 2nd Seminole War in 1836, the plantation was burned and the main house and other buildings were destroyed Off of Dixie Highway about a mile past Pine Tree Drive. Ormond Tomb Park Ormond Tomb Park is the final resting place of James Ormond II, the son of Captain James Ormond I, an Anglo-Irish-Scotch Sea captain, who was commissioned to bring Franciscan settlers to the area. Originally part of a 2000-acre cotton and indigo plantation called Damietta, the current 9-acre park was donated to the park service in 1945. In addition to the tomb, there’s a playground, nature trail, pavilion, picnic tables, restrooms and parking. Open sunrise to sunset. 3268 Old Dixie Highway, Ormond Beach Bulow State Park Bulow State Park, home of the Fairchild Oak, has several hiking trails including one that leads to the Bulow Plantation Ruins Historic State Park . There are also restrooms, picnic areas and a kiosk. Open every day, 8 am - sundown No entrance fee 3351 Old Dixie Highway, Ormond Beach FL Fairchild Oak The Fairchild Oak, dedicated to the memory of the renowned botanist David Fairchild. It is estimated to be between 300 - 400 yrs old over 68' high and 24' around.  At Bulow Creek Open every day, 8 am - sundown No entrance fee 3351 Old Dixie Highway, Ormond Beach FL Turn onto Walter Boardman Once you pass the first Halifax Plantation sign on your left look for the Florida Scenic Highway sign to turn right onto Walter Boardman which turns into Highbridge Road, and continue your journey along the Loop. On the Loop - Walter Boardman Ln / Highbridge Rd Bulow Creek Hiking Trails Bulow Creek Hiking Trails Bulow Creek Hiking Trails Bulow Creek State Park Hiking Trails are located on both sides of Walter Boardman. Hike marked trails through this Pine Flatwood forest to various scenic areas. Free admission, leashed pets welcome 3351 Old Dixie Highway, Ormond Beach, FL https://www.floridastateparks.org/learn/hiking-bulow-creek Marsh Bulow Creek Hiking Trails Bulow Creek Hiking Trails As you continue down Walter Boardman and Highbridge Road you will travel through marsh areas where you will see a variety of birds. You will also cross some small bridges where fishing is allowed. Knox Memorial Bridge Bulow Creek Hiking Trails Knox Memorial Bridge Built in 1955, Knox Memorial Bridge is one of only three remaining drawbridges crossing the intracoastal waterway in Volusia County and the only drawbridge in the area loosely referred to as Ormond Beach. Spanning the Intercoastal at Highbridge Road Smith Creek Landing Knox Memorial Bridge Smith Creek Landing is one of the entrance points to North Peninsula State Park. Here you will find the 2.5 mile Coastal Strand Trail beginning along a restored salt marsh before looping back through a sunny coastal strand. Open every day, 8 am - sundown N o entrance fee 40 Highbridge Road Ormond by the Sea,  FL Highbridge Park Highbridge Park sits on the bank of the Halifax River on the south side of Highbridge Road This one-acre park's facilities include a boat ramp, a kayak/canoe launch, a fishing pier, picnic tables, barbeque grills, restrooms, and a fishing supply store. Free admission Open - Sunrise to Sunset 39 Highbridge Road, Ormond Beach, FL Florida Scenic sign to turn on JA At this point you can either turn right onto John Anderson and continue this tour or go straight to Ocean Shore/A1A On The Loop -  John Anderson / E on Granada Seabridge Riverfront Park Seabridge Riverfront Park Seabridge Riverfront Park Seabridge Riverfront Park has a fishing pier, a shady picnic area, and a boardwalk over the Halifax River. The dock and walkway were recently completed after a two-year Volusia County construction project. It's a wonderful spot to fish, watch the sunset, or just relax along the river. No entrance fee 3570 John Anderson Dr., Ormond Beach, FL Hammock Home Seabridge Riverfront Park Seabridge Riverfront Park Joseph Price, an Ormond Beach pioneer, bought acreage along John Anderson Drive in 1887, and for nearly ten years, an orange grove and a small one-bedroom cottage were on the property. In 1915, Hammock Home, which now spans 5,589 square feet with six bedrooms and five baths, was built. The original one-bedroom cottage, built in 1889, is still standing in the northeast corner of the property. Hammock Home is located at  311 John Anderson Drive where it serves as a private residence. The Rowalian Seabridge Riverfront Park Nathan Cobb Cottage The Rowallan was built in 1913 to serve as the winter residence for Alexander Millar Lindsay, this residence was named Rowallan after a castle in his native Ayrshire. It was also owned by Englishman Leonard Martin and then Harold and Eileen Butts who renamed the house Linsaroe “by the water” in Celtic.  Currently a private residence, The Rowallan was added to U.S. National Register of Historic Places in 1988. 253 John Anderson Drive, Ormond Beach Nathan Cobb Cottage Nathan Cobb Cottage Nathan Cobb Cottage Built in 1897 by Billy Fagen from wood salvaged from the shipwrecked Nathan F. Cobb schooner, this one-and-a-half-story cottage has the original wood floors, staircase, and brick fireplace and chimney.   The Nathan Cobb Cottage was designated as a Florida Heritage Site in 2021 and is currently owned and operated by the Ormond Beach Historical Society which offers an annual open house in March. 137 Orchard Lane, Ormond Beach Fortunato Park Nathan Cobb Cottage Hotel Ormond Cupola Fortunato Park is located along the Halifax River, northeast of the Granada Bridge. In addition to grills and a picnic area there is a  kayak and canoe launch area, a path you can walk or bike, a playground and fishing pier. Open every day, sunrise - sundown No entrance fee 2 John Anderson Dr, Ormond Beach, FL Hotel Ormond Cupola Nathan Cobb Cottage Hotel Ormond Cupola The Hotel Ormond Cupola is all that remains of the hotel built by John Anderson and Joseph Price in 1887.The hotel was located east of John Anderson Drive on Granada Boulevard where a condominium now stands Open Saturdays and Sundays, September - May, 2-4 pm. Admission is free. Located in Fortunato Park The Casements The Casements was the winter home of John D. Rockefeller and now serves as the Cultural Center for the City of Ormond Beach. Tours of the house are available. Tour details here . Open Mon - Fri 8 am - 5 pm  Sat 8 am-12 pm No entrance fee - donations accepted 25 Riverside Dr, Ormond Beach, FL 32176 MacDonald House The MacDonald House , fondly called the Mac House was built in 1903 by architect Sommer Gove. Operated by the Ormond Beach Historical Society and serving as a welcome center, this building features information about the Timucua Indians, the Spanish and British Colonial Periods, early pioneer settlers, the Hotel Ormond, 'Birthplace of Speed', and John D. Rockefeller. 10 a.m. - 3 p.m. Tuesday - Saturday. 38 East Granada Blvd, Ormond Beach Ormond Memorial Art Museum Ormond Memorial Art Museum and Garden s was established in 1946 with the stated mission “to inspire the community through art and nature while honoring those who fought for freedom.” The museum regularly features local artists and has an annual student exhibit. You can also see works by national and international artists exhibited. Renovated in 2022, the building hosts many events in its new classrooms and has a rooftop terrace. Museum Hours: 10a-4p Weekdays; Noon-4p Weekends Garden Hours: Open sunrise to sunset $2 per person suggested donation. 78 East Granada Blvd, Ormond Beach Ormond Art Museum Gardens Ormond Art Museum Gardens Located directly behind the building are the Memorial Gardens where, in addition to a lush tropical garden, there are sculptures dedicated to veterans of the Vietnam and Korean Wars. Open sunrise to sunset On the Loop - Ocean Shore / A1A Birthplace of Speed Park Michael Crotty Bicentennial Park Michael Crotty Bicentennial Park Birthplace of Speed Park is off the beach that made this area famous for speed racing. A replica of the Ormond Garage has replicas of Bullet #1 and the Pirate automobiles. Open every day 6 am to 7 pm Fee or parking pass required 21 Ocean Shore Boulevard Michael Crotty Bicentennial Park Michael Crotty Bicentennial Park Michael Crotty Bicentennial Park Michael Crotty Bicentennia l Park crosses the entire peninsula from the beach to a pier on the Halifax River. and offers fishing, hiking, 2 dog parks, a playground, and various sports fields. Open every day, sunrise - sundown Fee or parking pass required for front lot. 1800 N. Ocean Shore Blvd., Ormond Beach WWII Submarine Watch Tower Michael Crotty Bicentennial Park WWII Submarine Watch Tower This WWII Submarine Watch Tower is one of the few remaining WWII watchtowers. A monument to the civilians who guarded our coastline it also serves as a private beach walkover. Privately owned by Verona 2269 Ocean Shore Blvd, Ormond Beach, FL Tom Renick Park WWII Submarine Watch Tower Tom Renick Park , is located on Ocean Shore and is beautifully set into the natural coastal landscape with a variety of dune vegetation throughout, including Sea Grapes, Sea Oats, and Cabbage Palms.  Facilities include a walkway to the beach, a playground, picnic tables - some under shelters, showers, bathrooms, a parking lot, and bike racks.  It The park is dedicated to former Volusia County Beach Safety Director Tom Renick, who became a lifeguard in 1969 and died of cancer in 2001. Fee or parking pass required Open daily - Sunrise to Sunset . 1565 Ocean Shore Blvd, Ormond Beach, FL Al Weeks Sr. North Shore Park Al Weeks Sr. North Shore Park , located off Ocean Shore/A1A  has an accessible beach ramp, showers, bathrooms, a lifeguard station, and a parking lot with over 100 spaces. Open every day - Sunrise to Sunset Fee or parking pass required 1631 Ocean Shore, Ormond-by-the-Sea , FL BEACH PARKING FEES VOLUSIA COUNTY Effective January 1, 2025 All County-owned and operated off-beach parking lots require a $20 daily parking fee , separate from on-beach driving fees. The daily parking fee can be paid by following the directions on the signage in the parking lots.Volusia County residents can park for free if they register their vehicles online at parkvolusia.org or in-person at one of two ParkVolusia offices Copyright © 2025 Ormond Scenic Loop and Trail - All Rights Reserved. Home On the Loop OSLT Events In the News FDOT Updates Support OSLT Contact Us FAQ Parks Beaches Fishing Hiking Historic Sites/Museums Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    }
  ]
}