{
  "fuentes": [
    {
      "url": "https://sfbwmag.com/coral-gables-welcomes-new-japanese-eatery-osumi-sushi-bar/",
      "email": "sfbw-logo-2023-100x50-v6-@2x.png"
    },
    {
      "url": "https://sfbwmag.com/coral-gables-welcomes-new-japanese-eatery-osumi-sushi-bar/",
      "email": "info@sfbwmag.com"
    },
    {
      "url": "https://umaisushi.co.uk/contact-us/",
      "email": "info@umaisushi.co.uk"
    },
    {
      "url": "https://sokaisushi.com/contact-us/",
      "email": "20info@sokaisushi.com"
    },
    {
      "url": "https://sokaisushi.com/contact-us/",
      "email": "info@sokaisushi.com"
    }
  ],
  "mails": [
    "20info@sokaisushi.com",
    "info@sfbwmag.com",
    "info@sokaisushi.com",
    "info@umaisushi.co.uk",
    "sfbw-logo-2023-100x50-v6-@2x.png"
  ],
  "nombre_sitio": "osumisushibar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sfbwmag.com/coral-gables-welcomes-new-japanese-eatery-osumi-sushi-bar/",
      "text": "Coral Gables Welcomes New Japanese Eatery: Osumi Sushi Bar - S. Florida Business & Wealth Lifestyle Magazine Digital Magazine Skip to content Main Navigation S. Florida Business & Wealth Search for: Sections Calendar Community Event Calendar Submit an event Cruise Corner Editor’s Choice Editor’s Choice Profiles Great Places and Spaces Events Event Recap Apogee Awards CEO Connect CEO Connect: Women of Influence Diversity & Inclusion Awards HR Awards Prestigious Women Awards Industries Aviation Banking & Financial Advice Cars, Boats & Toys Dining Education & Philanthropy Entrepreneurs & Business Strategy Health Care & Wellness Industry Superstars Interior Design, Art & Architecture Law/Professional Services Marine Real Estate Retail Technology Travel & Recreation Local Buzz One Liners Broward Miami Dade Palm Beach Signature Events ALL EVENTS S. Florida Legal Guide Browse the Legal Guide Listing Update Your Listing Sponsored Content Sponsored Content The Good Life Thought Leadership Commercial Real Estate Tips From Marcus & Millichap Financial Insights | First American Bank Webinars Web Extras About SFBW Advertising With Us Contact Us Digital Magazines Meet The Team Subscribe Social Media Connect Our Other Brands South Florida Business & Wealth Subscribe Header Navigation Editor’s Choice Signature Events Upcoming Events Event Highlights Excellence in Human Resources 2025 Apogee Awards Diversity & Inclusion Awards Prestigious Women Awards Up & Comer Awards Industries Dining Travel & Recreation Real Estate Entrepreneurs & Business Strategy Industry Superstars Banking & Financial Advice Health Care & Wellness Interior Design, Art & Architecture Cars, Boats & Toys Retail Education & Philanthropy Law & Professional Services Technology Thought Leadership Financial Insights | First American Bank Commercial Real Estate Tips From Marcus & Millichap Calendar Community Event Calendar Submit an Event Webinars About Us Contact Us Meet The Team Advertise with SFBW Stocks Ticker Dining Coral Gables Welcomes New Japanese Eatery: Osumi Sushi Bar Coral Gables Welcomes New Japanese Eatery: Osumi Sushi Bar July 18, 2024 | Danielle Charbonneau Coral Gables is now home to a stylish new dining spot in Giralda Plaza. Osumi Sushi Bar, which translates to “dwell” in Japanese, offers a sophisticated Japanese dining experience with a hint of Latin influence. The interior features natural elements such as wood and greenery, creating a peaceful Zen atmosphere. Outside, a spacious patio provides the perfect setting for people-watching along the pedestrian-only avenue. Osumi’s “Executive Lunch” menu, priced at $20 for an entrée and beverage or $26 for an appetizer, entrée, and beverage, is ideal for a relaxing lunch with friends or colleagues. During Happy Hour from 4 p.m. to 6 p.m., guests can enjoy a selection of $7 cocktails and small bites. In the evening, Osumi offers an elegant setting for a romantic night out, featuring sake, nigiri, and Wagyu. The Osumi Sushi Bar menu also boasts a harmonious blend of signature rolls, traditional sushi, and Asian-inspired main dishes. The Osumi Sushi Roll, named after the restaurant, is made with shrimp tempura, avocado, Hamachi, Japanese acevichada and crispy quinoa furikake. Starters showcase the restaurant’s unique approach to ingredients, with dishes like the Shishito Ponzu, featuring shishito peppers, Andean corn, sesame ponzu, and crunchy bonito flakes. Standout savory entrees include the Shrimp Furrita, featuring shrimp tempura topped with yuzu garlic aioli served on a bed of steamed rice, the Gochudare Ribs, which are Gochujang-based pork ribs served with yuzu coleslaw, the Surf & Turf Maki consisting of shrimp tempura, lobster, and avocado with Wagyu and Japanese teriyaki, and the signature Osumi Steak served with escabeche beans and sautéed vegetables. Osumi Sushi Bar takes pride in its extensive cocktail menu, curated by The Garnish’s co-founders and renowned mixologists Andy Cabrera and Loiver Hernandez Crespo. Notable cocktails on offer include the Lychee Highball, made with Canaima Gin, dry vermouth, lychee, citrus, absinthe, and bubbles, as well as the Ibaraki Sour, a blend of Ichiiko Saiten Shoshu, Midori, sugar, lime, and creamy Yuzu foam. The bar also features an impressive array of Japanese whiskies, including the revered Nikka Coffey Malt Whisky and Hibiki Japanese Harmony, alongside a selection of Amaro Montenegro, Ume Plum Liquor, Sake, and other fine spirits and wines. For more information, visit www.osumisushibar.com or follow on Instagram at @osumisushibar . Print Share Share on Facebook Share on Twitter Share on LinkedIn Share on Pinterest You May Also Like Going Gale June 25, 2015 Economic Flight Path February 18, 2016 International air charter company opens office in South Florida February 1, 2016 From Topgun to Seaplanes March 23, 2016 Latest Blancpain Shrinks an Icon Sep 9, 2025 Broward County Finally Goes Virtual Sep 9, 2025 Beyond the Role Sep 9, 2025 Awards & Events Celebrating Powerhouses in Heels: SFBW’s 2025 Prestigious Women Awards Jun 15, 2025 Latest Issue READ LATEST ISSUE MAGAZINE ARCHIVE More Dining Posts Cruising Ahead April 22, 2016 | SFBW Staff By Kevin Gale South Florida is the epicenter of the global cruise industry, with PortMiami ranked No. 1 and Port Everglades ranked No. 2 as the busiest ports, based on Read More Dolphins’ stadium: World’s largest erector set April 28, 2016 | SFBW Staff The Dolphins drafted offensive line Laremy Tunsil  ith the 13th pick in the NFL Draft on Thursday night, but the biggest star these days is arguably the team’s stadium, which is Read More Forget vineyards, the new status symbol is a distillery May 3, 2016 | SFBW Staff You’ve undoubtedly seen celebrities who’ve invested in vineyards and the wave of craft breweries popping up in South Florida, but Nanette Watson has what could be the next hot thing. Read More Another piece of business history disappears May 6, 2016 | SFBW Staff About 10 years ago Louis Flematti gave me a tour of the French Quarter, his restaurant just north of Las Olas Boulevard, and talked about how he had sold his 10 Read More Other Posts Yo ho, ho at the rum distillery May 13, 2016 | SFBW Staff Avi Aisenberg used drive by hundreds of thousands of acres of sugar cane traveling to his family’s plastics recycling plant in South Bay, a small community along Lake Okeechobee. Now, Read More A night with a Macallan scotch expert May 24, 2016 | SFBW Staff Seminole Casino Coconut Creek likes to play up the theme “Live the Good Life,” holding events such as the scotch tasting the presented at NYY Steak earlier this month. I’m Read More More Than Guest-Work July 26, 2016 | SFBW Staff Kolter’s growing collection of hotels keeps its leader going By Arnie Rosenberg | Photography by Larry Wood Scott Webb knew all about office buildings. Heading up the commercial division of Read More Sip Happens-But This One’s for the Kids June 24, 2025 | SFBW Staff Raise a glass for good. Read More Editor’s Choice Sponsored Advertising with SFBW Company South Florida Business & Wealth (SFBW) is South Florida’s premier business and lifestyle magazine serving Miami-Dade, Broward and Palm Beach counties. From the corner suite, to the worlds of wealth management and philanthropy, to the finer things (real estate, travel, auto, yachts, design), SFBW is your curated guide to aiming higher and living well. Read More… 3200 N. Federal Highway Suite 228 Boca Raton, FL 33431 (954) 601-3979 info@sfbwmag.com About SFBW Contact SFBW Advertise with SFBW Latest Digital Edition View All Editions Subscribe Email Address Name This field is for validation purposes and should be left unchanged. Social Connect"
    },
    {
      "url": "https://umaisushi.co.uk/contact-us/",
      "text": "Contact Us | Umai Sushi West London Skip to content Umai Sushi 020 3627 4611 183 Twickenham Rd, Isleworth TW7 6AB Facebook Instagram Tiktok Home About Us Menu Contact Us Order Now 02036274611 181B Twickenham Road Isleworth TW7 6AB Menu Home About Menu Contact Us Order Now Contact Us Celebrate everything with a memorable dining experience! We are here to assist you Feel free to contact us or just drop a line here. Our support stuff will reach you very soon Facebook Instagram Tiktok Get In Touch Address 183 Twickenham Rd, Isleworth TW7 6AB Call Us 020 3627 4611 Email Us info@umaisushi.co.uk Feel free to drop a message Name Phone Email Message Send Call Us And Book Your Table Now 02036 274 611 Contact Us 02036274611 info@umaisushi.co.uk Address 183 Twickenham Rd, Isleworth TW7 6AB Opening Hours Everyday : From 12.30 To 23.00 Kitchen Closes At 22.00 Privacy Policy Facebook Instagram Tiktok © 2024 Umai Sushi || Designed & Developed By Alumination Facebook Instagram Tiktok Contact Us 02036274611 info@umaisushi.co.uk Address 181B Twickenham Road Isleworth TW7 6AB Opening Hours Everyday : From 12.30 To 23.00 Kitchen Closes At 22.00 © 2024 Umai Sushi || Designed & Developed By Alumination © 2024 Umai Sushi || Designed & Developed By Alumination Privacy Policy Scroll to Top"
    },
    {
      "url": "https://sokaisushi.com/contact-us/",
      "text": "Contact Us | Sokai Sushi Bar Skip to content Use code SOKAI15 for 15% off on your next Toast order! DELIVERY & TAKE-OUT: Doral Flagler The Falls Kendall Downtown Hallandale RESERVE: Doral Flagler The Falls Kendall Downtown Hallandale HOME ABOUT US LOCATIONS Doral Flagler The Falls Kendall Downtown Hallandale MENU Hallandale Doral Flagler The Falls Kendall Downtown Miami PLACE AN ORDER FOR PICK UP ORDER ONLINE GIFT CARD CAREERS CONTACT Menu HOME ABOUT US LOCATIONS Doral Flagler The Falls Kendall Downtown Hallandale MENU Hallandale Doral Flagler The Falls Kendall Downtown Miami PLACE AN ORDER FOR PICK UP ORDER ONLINE GIFT CARD CAREERS CONTACT INFO & RSVP Our friendly staff is always willing to provide the help you need and answer any questions your may have. We can also accommodate special requests to the best of our abilities when presented in advance. Hosting your next event? Allow us to cater your next birthday, corporate event or any type of celebration, so that your guests can enjoy our fresh and delicious menu. WRITE US: info@sokaisushi.com DORAL (305) 499-9701 10726 NW 74th Street – Medley, FL 33178 Business Hours Monday – Thursday: 12:00PM – 10:30PM Friday – Saturday: 12:00PM – 11:30PM Sunday: 12:00PM – 10:00PM Reserve Now WEST FLAGLER (786) 534-7007 10141 W. Flagler Street #D130-D140 – Miami, FL 33172 Business Hours Monday – Thursday: 12:00PM – 10:30PM Friday – Saturday: 12:00PM – 11:30PM Sunday: 12:00PM – 10:00PM Reserve Now THE FALLS (786) 732-7584 8888 SW 136th St. Unit #383 – Miami, FL 33176 Business Hours Monday – Thursday: 12:00PM – 10:30PM Friday – Saturday: 12:00PM – 11:30PM Sunday: 12:00PM – 10:00PM Reserve Now KENDALL (786) 766-9989 11735 SW 147th Ave. – Miami, FL 33196 Business Hours Monday – Thursday: 12:00PM – 10:30PM Friday – Saturday: 12:00PM – 11:30PM Sunday: 12:00PM – 10:00PM Reserve Now DOWNTOWN (786) 936-2322 1371 NE Miami CT, Miami, FL 33132 Business Hours Monday – Thursday: 12:00PM – 10:30PM Friday – Saturday: 12:00PM – 11:30PM Sunday: 12:00PM – 10:00PM Reserve Now HALLANDALE (754) 315-2211 801 N Federal Hwy, Hallandale Beach, FL 33009 Business Hours Monday – Thursday: 12:00PM – 10:30PM Friday – Saturday: 12:00PM – 11:30PM Sunday: 12:00PM – 10:00PM Reserve Now CONTACT US QUESTIONS OR COMMENTS? Name Phone Email Message SEND MESSAGE MAKE A RESERVATION R.S.V.P. NOW! DORAL Ph. +1 (305) 499-9701 10726 NW 74th St Medley, FL 33178 FLAGLER Ph. +1 (786) 534-7007 10141 W. Flagler St #D130-140 Miami, FL 33172 THE FALLS Ph. +1 (786) 732-7584 8888 SW 136th St Unit# 383 Miami, FL 33176 KENDALL Ph. +1 (786) 766-9989 11735 SW 147th Ave. Miami, FL 33196 DOWNTOWN Ph. +1 (786) 936-2322 1371 NE Miami Ct, Miami, FL 33132 HALLANDALE Ph.  +1 (754) 315-2211 801 N Federal Hwy, Hallandale Beach, FL 33009 Instagram Facebook-f Tiktok Youtube © 2025 Sokai Sushi Bar. All Rights Reserved. In accordance with the Americans With Disabilities Act of 1990, as amended (ADA), and the Web Content Accessibility Guidelines (WCAG) 2.0 technical standards, Sokai Sushi Bar makes reasonable efforts to make its online web site accessible to people with disabilities, including those with blindness and low vision. Any difficulties encountered in accessing our website should be reported for investigation and any necessary improvements to: info@sokaisushi.com | Read Accessibility Statement | Privacy Policy"
    }
  ]
}