{
  "fuentes": [
    {
      "url": "https://queerforty.com/outshine-lgbtq-film-festival-miami-celebrates-25th-anniversary",
      "email": "advertising@grayjonesmedia.com"
    },
    {
      "url": "https://queerforty.com/outshine-lgbtq-film-festival-miami-celebrates-25th-anniversary",
      "email": "queerforty@grayjonesmedia.com"
    },
    {
      "url": "https://www.nbcmiami.com/news/local/outshine-lgbtq-film-festival-miami-returns/3288858/",
      "email": "southflorida-web@3x.png"
    },
    {
      "url": "https://hotspotsmagazine.com/2024/10/09/outshine-lgbtq-film-festival-announces-new-combined-fall-edition/",
      "email": "info@hotspots.lgbt"
    },
    {
      "url": "https://www.gogayfortlauderdale.com/events/details/outshine-lgbtq-film-festival-spring-edition-36552",
      "email": "admin@gflglcc.org"
    },
    {
      "url": "https://www.gogayfortlauderdale.com/events/details/outshine-lgbtq-film-festival-spring-edition-36552",
      "email": "allen@outshinefilm.com"
    },
    {
      "url": "https://outshinefilm.com/travel",
      "email": "miami@axelhotels.com"
    },
    {
      "url": "https://outshinefilm.com/faqs",
      "email": "spc@outshinefilm.com"
    },
    {
      "url": "https://outcoast.com/directory/listing/outshine-film-festival",
      "email": "info@outcoast.com"
    },
    {
      "url": "https://outcoast.com/directory/listing/outshine-film-festival",
      "email": "operations@outshinefilm.com"
    },
    {
      "url": "https://outshinefilm.com/about",
      "email": "customerservice@outshinefilm.com"
    },
    {
      "url": "https://hotspotsmagazine.com/2023/04/18/the-outshine-lgbtq-film-festival-miami-edition-begins-april-20/",
      "email": "info@hotspots.lgbt"
    }
  ],
  "mails": [
    "admin@gflglcc.org",
    "advertising@grayjonesmedia.com",
    "allen@outshinefilm.com",
    "customerservice@outshinefilm.com",
    "info@hotspots.lgbt",
    "info@outcoast.com",
    "miami@axelhotels.com",
    "operations@outshinefilm.com",
    "queerforty@grayjonesmedia.com",
    "southflorida-web@3x.png",
    "spc@outshinefilm.com"
  ],
  "nombre_sitio": "outshinefilm.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://queerforty.com/outshine-lgbtq-film-festival-miami-celebrates-25th-anniversary",
      "text": "OUTshine LGBTQ+ Film Festival Miami celebrates 25th anniversary - Queer Forty Skip to content Thursday, September 11, 2025 News & Features Interviews Anthony meets Politics Opinion Travel Digital Tours Events Health & Happiness Advice Pride Retirement Sport & Fitness Entertainment Art Books Movies Music Podcasts Q40 Book Club Television Theatre At Home Food & Drink Jonathan Bardzik Motoring Technology Homes & Gardens Front Cover Events Movies OUTshine LGBTQ+ Film Festival Miami celebrates  25th anniversary April 18, 2023 Queer Forty Staff 6 min read Milestone year featuring over 65 films opens with Fairyland on April 20 at its New Home at Silverspot Cinema Miami; Olympic champion turned actor Danell Leyva to be honored on April 26 at Clocked screening . OUTshine LGBTQ+ Film Festival Miami , internationally acclaimed as one of the largest LGBTQ+ cultural festivals in the world, will celebrate its 25 th anniversary with the opening screening of the drama “Fairyland” (2023) at its new home at Silverspot Cinema Miami (300 Southeast 3rd Street) at 7 p.m. on Thursday, April 20. Attendees will enjoy a dinner-at-your-seats luxury experience followed by a dessert celebration after-party. The Festival continues for a full 11 days with over 65 features, shorts, and documentaries from all around the world that inspire, entertain, and educate along with a variety of parties and special events. “During this commemorative year, OUTshine is thrilled to partner with the luxurious and sophisticated state-of-the-art Silverspot Cinema in Downtown Miami. This central location for all films makes the Festival more exciting, more magical and more accessible to a greater cross-section of the community,” said Mark Gilbert, board chair and interim executive director of OUTshine LGBTQ+ Film Festival. “Also, new this year are free community Cocktails & Cinema Happy Hours after the films on Mondays, Tuesdays, and Wednesdays and exclusive films not seen anywhere else.” Written and directed by Andrew Durham, produced by Sofia Coppola, Durham, Megan Carlson, Greg Lauritano, Siena Oberman, and Laure Sudreau and starring Emilia Jones, Scoot McNairy, and Geena Davis, “Fairyland” captures the complexities, embarrassment, and pride that are part of any father-daughter relationship, especially in San Francisco during the 1970s and ‘80s, with its indelible legacy of loss and love. Following the sudden death of her mother, young Alysia is uprooted by her father Steve, in hopes of restarting his life. They move to San Francisco, where Steve develops his poetic and personal writing and begins to openly date men. Steve’s bohemian lifestyle clashes with the expectations of parenthood from the outside world and from Alysia herself. As Alysia grows into a young woman on the cusp of adulthood, their bonds and duty to each other are tested in painful and sudden ways. “As a leading LGBTQ+ voice in the community, we are committed to bringing people together to champion diversity, inclusiveness and awareness in the arts and beyond. This year promises an unforgettable line-up of dramas, comedies, shorts, and thought-provoking documentaries, many of which you will only see at the Festival,” added Gilbert. On Saturday, April 22, at 7:30 p.m., OUTshine will present its Men’s Spotlight film, “ Drifter ” (2023), a North American premiere fresh from its screenings at Berlinale, Germany where it competed for the Teddy Award for Best LGBTQIA+ film in the festival. An after-party at the OUTshine Lounge at Silverspot will follow. Miami’s own Olympic athlete champion Danell Leyva will be honored on Wednesday, April 26, at 7:15 p.m., prior to the screening of “ Clocked ” (2023), in which he stars. Leyva is a two-time Team USA Olympian and three-time Olympic Medalist as well as a World Champion on Parallel Bars. He was the first Cuban American on the United States Olympic men’s gymnastics team. After his second Olympics, Leyva tied to be the most decorated male gymnast for Team USA. Leyva retired from gymnastics and moved to Los Angeles to pursue his passion for performing. Since then, he has been featured in multiple nationwide commercials, a recurring role on Paradise Run , series regular on the scripted podcast Southbridge , multiple short films, web series, and roles on Hialeah and Love , Victor . He also performs live in Cirque du Soleil’s KA in Las Vegas. Leyva actively participates and donates to various charitable organizations and is an advocate for mental health, LGBTQIA+, and civil rights. He has also been a competitor on Univision’s Mira Quien Baila and NBC’s American Ninja Warrior , both for charities. Continuing the fun on Thursday, April 27, at 7 p.m., will be the Festival’s Centerpiece film, “ L’Immensita ” (2022).  This Italian film, with an amazing performance by Penelope Cruz, is set in 1970s Rome. While the film tells the story of the breakdown of a marital relationship, it also tells the story of the oldest daughter who longs to live life as his true self and proclaims he wants to be called Andrew. With musical numbers and a fantastic soundtrack, the film packs an emotional wallop while maintaining an entertaining tone. Next, it’s time for the ladies to shine with the Women’s Spotlight film, “ Love Proof (Karleeksbevis) ” (2022), a Swedish feature screening on Saturday, April 29, at 7:15 p.m. Thomas and Marie are getting divorced and must meet one last weekend to empty and sell their summer house when a mysterious woman enters their lives and shakes up the scene. OUTshine wraps it all up on Sunday, April 30,  beginning at 6 p.m. with the Closing Night film, “ Three Nights A Week ” (2023), a French film that utilizes the art and culture of drag to tell a poignant, yet entertaining story that will bring out the true diva in all of us. Post-festival, the “OUTshine At Home” viewing begins on May 1 with many of the films that screened in theaters as well as several exclusive to the on-demand streaming platform. OUTrageous, OUTspoken, and OUTstanding, this year’s OUTshine Film Festival Miami is presented by Gilead and Miami-Dade County. Tickets to the opening night film “Fairyland,” dinner-at-your-seat, and after-party are $95 each. This is an in-person screening, only. Tickets start at just $8 for other individual films with group discounts and additional offers available. All films and events take place at Silverspot Cinema Miami unless otherwise noted. For more information, films line-up and tickets for the 25th annual OUTshine LGBTQ+ Film Festival Miami, call (877) 766-8156 or visit outshinefilm.com . A full schedule of parties and special events is available at outshinefilm.com/films/program . About OUTshine LGBTQ+ Film Festival The OUTshine LGBTQ+ Film Festival, celebrating its 25 th anniversary, is a bi-annual film festival with a mission to inspire, entertain, and educate; encouraging a sense of community through international and culturally diverse film, video and other media that offer historical, contemporary and entertaining perspectives on the LGBTQ+ experience. Launched separately – in 1998, as The Miami Gay & Lesbian Film Festival, and in 2008, as the Fort Lauderdale Gay & Lesbian Film Festival – both were brought together under one brand to become OUTshine Film Festival, underscoring its brightness, broad appeal and dynamic multicultural locations, the nonprofit festival is critically and internationally acclaimed as one of the largest LGBTQ+ cultural arts happenings in the world. OUTrageous. OUTspoken. And OUTstanding in what we deliver. For more information and tickets, visit outshinefilm.com and follow us on Facebook @OUTshineFilmFestival , on Twitter @OUTshineFilm and on Instagram @OUTshineFilm . Latest Articles id=\"breaking-news-widget-prev_colormag_breaking_news_widget-3\"> 10 essential things to do on your first visit to Philly October 24, 2024 Queer Forty Staff 6 min read Thailand has marriage equality, it’s time to visit! October 15, 2024 Merryn Johns 31 min read Camp Chateau reinvents summer camp for women of all ages and identities October 1, 2024 Merryn Johns 13 min read The Flannel Bear launches the Pride 365 candle July 16, 2024 Queer Forty Staff 2 min read A most unusual boy: Charles Busch on writing and performing women’s roles July 12, 2024 Merryn Johns 14 min read id=\"breaking-news-widget-next_colormag_breaking_news_widget-3\"> Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Queer Forty Staff Queer Forty writing staff work hard to bring you all the latest articles to help inspire and inform. Queer Forty Staff has 2411 posts and counting. See all posts by Queer Forty Staff Share This Post: Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * I accept that my given data and my IP address is sent to a server in the USA only for the purpose of spam prevention through the Akismet program. More information on Akismet and GDPR . Name * Email * Website Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. This Month’s Front Cover LATEST ARTICLES 10 essential things to do on your first visit to Philly Thailand has marriage equality, it’s time to visit! Camp Chateau reinvents summer camp for women of all ages and identities The Flannel Bear launches the Pride 365 candle A most unusual boy: Charles Busch on writing and performing women’s roles From Sondheim to Sarah Paulson, the winners of the 2024 Dorian Theater Awards Gay Open House: Marvelous Malta Taste the season with this watermelon and gorgonzola salad Celebrate Summer with an elevated picnic featuring Clif Family Winery The ultimate LGBTQ+ cruise app is here GOT A STORY? If you have a news story you’d like to share with us, email the Editor by clicking here . About Us Queer Forty is a Gray Jones Media brand, visit www.grayjonesmedia.com for more info. Advertising Queer Forty reaches over 210,000 people per month through our website and socials. Download the 2024 Queer Forty Intro Deck here. To advertise, please contact advertising@grayjonesmedia.com Contact Us If you have a news story you’d like to share with us, email the Editor by clicking here . Privacy Policy Cookie Policy Copyright © 2025 Gray Jones Media. All rights reserved. Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://www.nbcmiami.com/news/local/outshine-lgbtq-film-festival-miami-returns/3288858/",
      "text": "OUTshine LGBTQ+ Film Festival Miami Returns – NBC 6 South Florida Skip to content Main Navigation Search Search for: Local Weather Video On Your Side Investigates Responds Newsletters TV Listings Watch 24/7 Create profile / Log in Dashboard Email preferences Sign out Trending 🌪️Hurricane Season 6 to Know 📺Watch News 24/7 🔎 Send a Tip What’s Being Built Here Money Chat Dangerous Drive Newsletters How to Stream Expand Community OUTshine LGBTQ+ Film Festival Miami Returns The 26th annual festival runs April 18 - 28 Published April 24, 2024 • Updated on April 24, 2024 at 6:36 pm BOOKMARKER The highly anticipated OUTshine LGBTQ+ Film Festival celebrating queer culture runs April 18 - 28 and will feature more than 50 internationally acclaimed features and shorts including premieres and documentaries that inspire, entertain, and educate. Adding to the excitement and sense of community this year will be a Latin Spotlight featuring men’s and women’s films, a panel for aspiring filmmakers and FREE Uber rides to and from select film screenings. The films will screen at Silverspot Cinema Miami (300 Southeast 3rd Street) from April 18 to 24 and at Regal South Beach (1120 Lincoln Road Mall, Miami Beach) from April 25 to 28. A variety of parties and special events will take place at various locations throughout Miami. Watch NBC6 free wherever you are WATCH HERE This year’s opening night film taking place at 7 p.m. on Thursday, April 18, at Silverspot Cinema Miami is Turtles (Les Tortues) (Belgium/Canada, 2023). Directed by David Lambert, this relationship comedy-drama follows the ups and downs of married couple Thom and Henri, together for 35 years, now facing retired life and what happens when a love turns sour. The W Hotel Miami Afterparty will take place immediately following the screening. Brand new to the Miami line-up this year is a Latin Spotlight night set for Saturday, April 20, at Silverspot Cinema Miami, with four films from Latin America. Plus two nights of Cocktails & Cinema will celebrate our local filmmakers, cast and crews from students to seasoned veterans of the industry at 7:30 p.m. on Monday, April 22, and Tuesday, April 23, at Silverspot Cinema Miami. To encourage more local LGBTQ+ filmmakers to tell their stories, OUTshine will present its Filmmaker Panel on Saturday, April 27, at 2 p.m. at Regal South Beach. This special event will feature local directors Hansel Porras Garcia, director of Febrero and OOLITE Arts; Chris Molina, director of Fallen Fruit, I Wonder If I’m Growing and programmer with the Miami Film Festival; Freddy Rodriguez, director of Open Dialogues: Stories from the LGBTQ Community; Filmmaker Bootcat; Joe Tufte, Miami Dade College film professor; Noah Salzman, director of Clocked and Angelica Bourland, director of Warrior and Unstuck. The North American premiere of Mascarpone: The Rainbow Cake (Maschile Plural) (Italy, 2024) will be the Closing Night Film commencing at 6 p.m. on Sunday, April 28, at Regal South Beach. Director Alesandro Haigh presents an intoxicating drama about sexy duo Antonio and Luca who are trying to pick up the pieces three years after their friend Denis’s passing. While each went their separate ways, when the two meet again Antonio mistakes Luca’s desire to reconnect as more than just a pure gesture of friendship. Immediately following at 8 p.m., a celebratory South Beach Group Hotel Closing Night Party will take place at the Miami Beach Women's Club (2401 Pine Tree Drive, Miami Beach). Local 6 to Know 4 hours ago 6 to know – Top stories of the day Miami-Dade County 14 mins ago Miami Fire Rescue captain accused of assaulting deputy could have charges dropped To make attending OUTshine’s incredible films and special events more accessible, the City of Miami is offering FREE Uber Rides to and from Silverspot Cinema (within a 25 mile radius) valid from April 18 through April 24! OUTrageous, OUTspoken, and OUTstanding, this year’s OUTshine LGBTQ+ Film Festival Miami is sponsored, in part, by Miami Dade County, the City of Miami Beach and Gilead. For a full schedule of films, parties and special events or for more information, visit outshinefilm.com . This article tagged under: Community nbc 6 pride on now Live: NBC6 South Florida Midday Trending Stories Lawsuits Paperwork error at Doral car dealership leads to arrest of U.S. Coast Guard officer YNW Melly Rapper YNW Melly seeks to replace legal team amid Broward double murder re-trial Hollywood Girl who went missing from Hollywood found in New York with mother: Police Gun violence 17-year-old killed, 5 men hurt in Tampa shooting: Police Trump Administration Live updates: High-powered rifle recovered as manhunt intensifies for Charlie Kirk's shooter Weather Forecast Facebook Instagram TikTok Youtube About NBC 6 Our News Standards Submit Tips for Investigations Newsletters Contact Us Xfinity: Internet, TV, streaming, more WTVJ Public Inspection File WTVJ Accessibility WTVJ Employment Information FCC Applications Terms of Service Advertise with us Send Feedback Privacy Policy Your Privacy Choices CA Notice Ad Choices Copyright © 2025 NBCUniversal Media, LLC. All rights reserved Close Menu Create profile / Log in Dashboard Search for: Newsletters News [MIA]NBC 6 News Local US & World Weather Weather alerts Hurricane Season On Your Side Investigates Responds Submit a tip PolitiFact Impact With Jackie Nespral Voices With Jawan Strader South Florida Live Entertainment Traffic Sports Community About NBC 6 Our News Standards Submit a Consumer Complaint Submit Photos and Video Contests TV Schedule Our Apps Newsletters TV Schedule Cozi TV Follow Us Facebook Instagram TikTok Youtube Contact Us"
    },
    {
      "url": "https://hotspotsmagazine.com/2024/10/09/outshine-lgbtq-film-festival-announces-new-combined-fall-edition/",
      "text": "OUTshine LGBTQ+ Film Festival Announces New Combined Fall Edition | Hotspots Magazine Facebook Instagram Twitter Magazine South Florida: Current Issue Magazine Archives: 2024 Magazine Archives: 2023 Magazine Archives: 2022 Magazine Archives: 2021 Magazine Archives: 2020 Magazine Archives: 2019 What’s Hot South Florida’s Hot Entertainment Hotspots Hotties Hot Advice Hot Beats Hot Bodies Hot Eats Women Press Play Women’s Events Must See Must Read Must Watch Women’s History Month Articles Feature Stories Deep Inside Hollywood Discover Gay FL Queens We Love DJs We Love Photos TV Happening Out Television Network The Bobby Blair Show The FayWhat?! Show Queer News Tonight Queer God Squad Events About Hotspots! Events Monthly Events Art Gallery Opening Reception Pride Skate Nights Art Walk Wilton Manors Artists Showcase Annual Events Stonewall Pride Parade & Festival Black History Month Events The Cookout: Black History Month Pride On The Drive Women’s History Month HOTtopics: Town Hall Series (Quarterly) July 4th Fireworks Cruise PrideFête: An LGBTQ Caribbean Festival The South Florida Men’s Wellness Conference Taste of the Island Art HOTspots Art About HOTspots Art Art Walk Wilton Manors Sculpture Walk Art Gallery with Dennis Dean Classifieds About Join Us Contact Us Advertise Search 86.9 F Fort Lauderdale Advertise with Us Contact Us Facebook Instagram Twitter Sign in Welcome! Log into your account your username your password Forgot your password? Get help Privacy Policy Password recovery Recover your password your email A password will be e-mailed to you. Magazine South Florida: Current Issue Magazine Archives: 2024 Magazine Archives: 2023 Magazine Archives: 2022 Magazine Archives: 2021 Magazine Archives: 2020 Magazine Archives: 2019 What’s Hot South Florida’s Hot Entertainment Hotspots Hotties Hot Advice Hot Beats Hot Bodies Hot Eats Women Press Play Women’s Events Must See Must Read Must Watch Women’s History Month Articles Feature Stories Deep Inside Hollywood Discover Gay FL Queens We Love DJs We Love Photos Hot Shots PHOTOS: The 25th Annual Black Fort Lauderdale Festival at The Manor Hot Shots PHOTOS – PrideFête: An LGBTQ+ Caribbean Festival 2025 Hot Shots PHOTOS: 10th Annual FlockFest Beach Party Hot Shots PHOTOS: Lez Chic Monthly Brunch: May 2025 Hot Shots PHOTOS – Wilton Manors Stonewall Pride Parade & Street Festival 2025… TV Happening Out Television Network The Bobby Blair Show The FayWhat?! Show Queer News Tonight Queer God Squad Events About Hotspots! Events Monthly Events Art Gallery Opening Reception Pride Skate Nights Art Walk Wilton Manors Artists Showcase Annual Events Stonewall Pride Parade & Festival Black History Month Events The Cookout: Black History Month Pride On The Drive Women’s History Month HOTtopics: Town Hall Series (Quarterly) July 4th Fireworks Cruise PrideFête: An LGBTQ Caribbean Festival The South Florida Men’s Wellness Conference Taste of the Island Art HOTspots Art About HOTspots Art Art Walk Wilton Manors Sculpture Walk Art Gallery with Dennis Dean Classifieds About Join Us Contact Us Advertise Hotspots Magazine Home Features OUTshine LGBTQ+ Film Festival Announces New Combined Fall Edition Features OUTshine LGBTQ+ Film Festival Announces New Combined Fall Edition By Hotspots Magazine - October 9, 2024 693 Facebook Twitter Pinterest WhatsApp Advertisement OUTshine LGBTQ+ Film Festival , internationally acclaimed as one of the largest LGBTQ+ cultural festivals in the world, has announced its full schedule for its newly combined South Florida fall edition running from Thursday, October 17, through Sunday, October 27 with an OUTshine AT HOME select films viewing extension running from Monday, October 28, to Sunday, November 3. This season’s OUTshine LGBTQ+ Film Festival will offer 62 acclaimed features and shorts including premieres and documentaries from 25 countries that inspire, entertain and educate to cinema enthusiasts in both Broward and Miami-Dade counties during one run. “We are thrilled to introduce this newly reimagined OUTshine LGBTQ+ Film Festival to South Florida,” said Allen Martello, festival co-director, OUTshine LGBTQ+ Film Festival. “Film is better with friends and our vision is to bring our community together to celebrate inspiring LGBTQ+ cinema with fall and spring festivals in both Miami and Fort Lauderdale. By connecting our community, we’re also adding on extra views, parties, and special events.” To make attending OUTshine’s incredible films and special events in Miami-Dade more accessible for Broward residents who travel to Downtown Miami via rail, the City of Miami is offering FREE Uber Rides to and from select screenings (within a 25-mile radius). Young Hearts BelgiumNetherlands 2023 Young Hearts (Belgium/Netherlands, 2023) will open this year’s fall festival on Thursday, October 17, at 7pm, at Regal Dania Pointe (128 Sunset Dr, Dania Beach). Written and directed by Anthony Schatteman in his feature debut, the film explores first love as 14-year-old Elias (Lou Goossens, in a breakthrough performance) contends with his feelings for Alex, a cool new neighbor. Exquisitely filmed in the Belgian countryside, this profound story resonates on multiple levels: a balm for those whose initial queer experiences were traumatic, a mirror for today’s LGBTQ+ youth, and a hopeful message for parents of future generations. An afterparty at the Dania Improv will take place immediately following the screening. For thriller and horror aficionados, OUTshine is proud to present two OUTshine After Dark features. On October 19 at 9:30pm at the Paradigm Cinemas: Gateway Fort Lauderdale (1820 E Sunrise Blvd, Fort Lauderdale) will be the Popcorn Fright Nights Audience Award-winner Birthrite (USA, 2023), a slow burn, atmospheric folk horror nightmare of karmic debt and dread. And, at 9:45pm on October 26 at Silverspot Cinema Miami (300 Southeast 3rd Street) OUTshine presents Haze (USA 2024), a psychological thriller focusing on a journalist’s investigation into a hushed case of eight gay men who allegedly died by suicide at a now-abandoned psychiatric hospital. OUTshine is also hosting two special editions brunches and film showings – one in Broward on October 20 at 12:30pm at Paradigm Cinemas: Gateway Fort Lauderdale (1820 E Sunrise Blvd, Fort Lauderdale) paired and followed by the Ladies’ Shorts Program and one in Miami at Axel Beach Miami (1500 Collins Ave, Miami Beach) on October 26 at 11:30am to include the narrative Lost Boys & Fairies (UK, 2024). Focusing on local LGBTQ+ filmmaking talent, OUTshine has curated a new South Florida Shorts Showcase and will present a special Cocktails & Cinema reception on October 23 at 7:30 pm at Paradigm Cinemas: Gateway Fort Lauderdale to celebrate South Florida Filmmakers – from students to seasoned veterans of the industry. This is a combination of queer filmmakers making queer films, queer people behind the camera, and queer actors from South Florida. There will be a Q&A with filmmakers, cast and crew after the screenings. This year’s Centerpiece Film screening at 7:30pm on October 24 at Savor Cinema (503 SE 6th St, Fort Lauderdale) will be the East Coast premiere of Hammarskjöld – Fight For Peace (Sweden, 2024), a speculative biopic about Swedish UN Secretary-General Dag Hammarskjöld, the anti-colonialist, allegedly queer diplomat who died under mysterious circumstances during the Cold War while trying to bring peace to The Congo. The film is directed by Per Fly. Back by popular demand is the festival’s Latin Spotlight featuring critically acclaimed men’s and women’s films set to take place on October 25 at Silverspot Cinema Miami (300 Southeast 3rd Street). The fall edition’s selections are The Astronaut Lovers (Los Amantes Astronautas) (Argentina/Spain, 2024) and the North American premiere of The Muleteer (La Arriera ) (Mexico, 2024). Directed by Marco Berger, The Astronaut Lovers is a breezy comedy about Pedro and Maxi, childhood friends reuniting as young men who fall in love and comically try to hide it from family and friends. In The Muleteer , Director Isabel Cristina Fregoso presents a compelling 1930s narrative about daring teenage Emilia who ventures from the ranch where she grew up to find her biological father. Riding her horse through the mountains, where she pretends to be a young muleteer, she discovers a different world that leads her to find her destiny. “Film lovers can expect a lineup of international, North American, U.S. and East Coast premieres stacked with notable award-winning and up-and-coming directors, actors and writers sharing creative visions and personal experiences that excite, exhilarate and uplift the human spirit,” said Joe Bilancio, director of programming, OUTshine LGBTQ+ Film Festival . “At a time when diversity and acceptance is in the spotlight, it’s paramount for us to present films and programs with balanced viewpoints that promote tolerance, equality, understanding and empathy.” OUTshine LGBTQ+ Film Festival’s fall edition closes at 6pm at Regal Cinemas South Beach (1120 Lincoln Road Mall, Miami Beach) with the film LAYLA (UK, 2024), a love letter to the queer community. Written and directed by Amrou Al-Kadhi, the film focuses on Layla, a struggling Arab non-binary drag queen whose confident façade hides their desperate desire for love. When Layla’s performance at a belittling corporate Pride event turns into a transgressive takedown, they are surprised to catch the eye of marketing executive Max, whose attentions sweep Layla off their feet. As Layla starts to alter who they are in order to keep Max’s interest, they both must face uncomfortable truths. Immediately following, a celebratory Closing Night Party will take place on historic Lincoln Road. Ticket subscription packages and individual tickets starting at $15 are on sale now. OUTshine passholders and Producer Circle members receive priority advance ticket purchase opportunities. For more information and/or to purchase tickets, visit outshinefilm.com . Hotspots Magazine See Full Bio TAGS OUTshine Film Festival Facebook Twitter Pinterest WhatsApp Previous article Come Out With Pride Marks 20th Anniversary Biggest Parade Yet Next article Fall 2024’s Film Preview Hotspots Magazine RELATED ARTICLES MORE FROM AUTHOR Queer News Tonight DeSantis’ War on Rainbow Crosswalks Hits Key West in The Dead of Night Queer News Tonight South Park Continues To Build On Gay Relationship Between Trump And Satan Queer News Tonight Here Is The Full LGBTQ Cast Of SNL Season 51 Queer News Tonight Trans Flag Creator Monica Helms Plans to Flee U.S. Amid Rising Persecution Queer News Tonight Compass Earns Triple Nod at Nonprofit Awards Queer News Tonight LGBTQ+ Pilgrims Make Historic Jubilee Walk at Vatican Advertisement ABOUT US © HOTspots Happening Out - Non-Profit (501c3) LGBTQ+ Media Network  \r\n2025 - Privacy Policy - Hotspots Magazine Contact us: info@hotspots.lgbt FOLLOW US Facebook Instagram Twitter © Hotspots! - Copyright 2024 - By 7Elements Web Design This website uses cookies to ensure you get the best experience on our website. Yes, I accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT MORE STORIES Imperial Sun Court Hosts Mr., Miss, and Mx Gay ISCOAF Pageant, September 27 Happening Out Television Network - September 11, 2025 Go to mobile version"
    },
    {
      "url": "https://www.gogayfortlauderdale.com/events/details/outshine-lgbtq-film-festival-spring-edition-36552",
      "text": "OUTshine LGBTQ+ Film Festival SPRING EDITION - Apr 22, 2025 to Apr 24, 2025 Skip to content Menu Directory About About Us Chamber Team Stay Informed / Contact Us NGLCC Affiliate Members 2025 Membership Drive Member Login Membership Benefits Member Application Networking Job Postings Services Education & Advocacy Where to Play Where to Stay Where to Dine Hot Deals! News Events Chamber Events Member Events Join Today! OUTshine LGBTQ+ Film Festival SPRING EDITION The Miami Gay & Lesbian Film Festival started in 1998; and the Fort Lauderdale Gay & Lesbian Film Festival in 2008. Both were brought together under one brand: OUTshine LGBTQ+ Film Festival - underscoring our broad appeal and dynamic multicultural location. Critically and internationally acclaimed, it serves as a platform for numerous premiers and is the largest LGBTQ+ cultural arts event in South Florida. OUTshine is everything you want in a film festival... inviting, glowing, and eclipsing all others before it. Our mission is to inspire, entertain, and educate; encouraging a sense of community through international and culturally diverse film, video, and other media that offer historical and contemporary perspectives on the LGBTQ+ experience. OUTshine LGBTQ+ Film Festival SPRING ... Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Date and Time Tuesday Apr 22, 2025 Thursday Apr 24, 2025 Website OUTshine LGBTQ+ Film Festival Contact Information OUTshine Film Festival Send Email Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Business Directory News Releases Events Calendar Hot Deals Member To Member Deals Marketspace Job Postings Contact Us Information & Brochures Join The Chamber Share × Print Email Add to Calendar Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Select Calendar Type × Google Yahoo iCal (Outlook, Apple, or other) Close © 2025 GFLGLCC – Greater Fort Lauderdale LGBT Chamber of Commerce | Site by GrowthZone phone 855.435.4522 (GFL-GLCC) location 2300 NE 7th Avenue Wilton Manors, FL 33305 email admin@gflglcc.org Members Member Login Member Directory Application to Join Member Deals Resources Privacy & Photo Policy Terms and Conditions CONNECT Facebook Twitter LinkedIn blog spot © 2025 GFLGLCC - Greater Fort Lauderdale LGBT Chamber of Commerce. All Rights Reserved | Site by GrowthZone"
    },
    {
      "url": "https://outshinefilm.com/travel",
      "text": "OUTshine Film Festival - Travel Menu Program Film Program Past Programs Buy Tickets Filmmaker Q&A's Watch on Your TV Festival About / Contact Events Film Entry Jury Talent Venues Winners Festival Team Travel Packages ADA Information FAQs Get Involved Careers Photo Gallery Membership Sponsors Support Us Official OUTshine Partner Hotels Miami Ft. Lauderdale Hotel Gaythering South Beach Group Boutique Hotels Axel Beach Miami Hotel Gaythering 1409 Lincoln Rd, Miami Beach, FL 33139 Use promocode OUTshine24 when booking to save 15% off your rate. Book direct at gaythering.com following the link below or email your requests to manager@gaythering.com. Book It! The Gayest Hotel in Miami Beach Why stay at a gay friendly hotel when you can stay at a friendly gay hotel? Our MiMo style building lives in the heart of Miami Beach’s gayborhood, catering exclusively to gay guests who want to experience a local’s life. Besides having our popular Bar Gaythering on the first floor of the property, guests can take advantage of their complimentary access to our Men’s Sauna, bikes, beach gear and daily breakfast. Located just steps away from the Miami Beach festival venues, there’s plenty to do in the Lincoln Road area including some amazing restaurants, shops and sightseeing spots. Reserve your room today! South Beach Group Use Promo code OUT24 for direct reservations at all the hotels at www.southbeachgroup.com You Deserve A Getaway South Beach Group hotels have everything one needs to enjoy Miami Beach, the hottest destination famed for its picture-perfect beach views, historical Art Deco district, numerous restaurants with cuisine from all around the world, beautiful people, and famous nightlife. The hotels’ prime locations just steps from the ocean and close to local attractions are an excellent choice for your Miami Beach getaway. Our sparkling pools, spacious suites, happening happy hours are among the highlights and comforts that will complement your beach vacation. It will be our pleasure to host you The Catalina Hotel & Beach Club Riviera Suites South Beach Lincoln Arms Suites Tradewinds Apartment + Hotel Hotel Croydon Miami Beach Axel Beach Miami 1500 Collins Ave, Miami Beach, FL 33139 +1 (786) 628 6362 · miami@axelhotels.com Book directly at www.axelhotels.com choose the offer that best suits you and get up to 20% off. Book It! The LGBTIQ+ hotel in Miami South Beach First Axel Hotel in the U.S.!!! AXEL HOTELS In 2003, the world's first urban LGBTQ+ hotel came to life in Barcelona. Since then, we have worked every day to build safe and free places. Axel hotels has celebrated its 20th anniversary, and a new era begins more open, spontaneous, and true. AXEL BEACH MIAMI A fusion of modernity and Art Deco by the sea. Axel Beach Miami is located at 1500 Collins Avenue, a block away from the beach, in the heart of South Beach. The hotel has 160 rooms that conserve the Art Deco design, seducing you with their SoBe (South Beach) personality. With an Art Deco interior that still retains its original bohemian spirit of '40s, Axel Beach Miami is an exclusive paradise whose facilities – such as the pool, the Sky bar overlooking Washington Avenue with a color-changing dance floor, Spa & Gym, restaurant, and Lobby bar - will ensure that you enjoy the authentic Axel Hotels experience in Miami Beach. Additionally, at Axel Beach Miami you will have at your disposal parking and the beach\n\t\t\t\t\t\ton 15th street. Come at Axel Beach Miami and let your true colors shine through. Wilton River Suites OUTshine's Official Host Hotel 611 NE 29th Drive Wilton Manors, FL, 33334 www.wiltonsuites.com Use coupon code OUTSHINESAVE25 at checkout when booking your Suite to save 25% Book direct at WiltonSuites.com The one bedroom suites accommodate up to two people and the two bedrooms suites can accommodate up to 4. A 15 unit all-suite luxurious Hotel located walking distance from the drive. All suites have full kitchens, luxurious baths, living room accommodations and all the comforts of home with hotel style amenities.    There is an onsite gym, pool and expansive dock which is fantastic for paddle boarding, kayaking and other similar activities.   Your guests can walk to the many restaurants and bars that Wilton Manors has to offer.  We offer seamless, contactless check in and plenty of free parking including an EV station. Grants Program Film Program Past Programs Buy Tickets Filmmaker Q&A's Watch on Your TV Festival About / Contact Film Entry Jury Talent Venues Winners Festival Team Travel Packages ADA Information FAQs Get Involved Events Sponsors Membership Careers Photo Gallery Press Room Press Releases Press Credentials Festival Materials Media Interviews Social © OUTshine - All Rights Reserved | Privacy Policy"
    },
    {
      "url": "https://outshinefilm.com/faqs",
      "text": "OUTshine Film Festival - Faqs Menu Program Film Program Past Programs Buy Tickets Filmmaker Q&A's Watch on Your TV Festival About / Contact Events Film Entry Jury Talent Venues Winners Festival Team Travel Packages ADA Information FAQs Get Involved Careers Photo Gallery Membership Sponsors Support Us FAQs Virtual Festival How does the NEW Eventive Streaming Platform work? Click here for answers to system requirements, how do I watch on my TV, Amazon Fire Stick, Roku, computer, etc... Do I have a Florida IP address? About the Festival Is the Festival is 501(c)3? Yes, we are.  You can download our IRS 501(c)(3) determination letter here . Is the Festival Sales Tax Exempt? Yes, we are.  You can download our tax-exempt certificate here . Do you play the same films in Miami and Fort Lauderdale? No, each edition is unique with only a handful of overlap. How can I volunteer, and what can I volunteer for? There are many ways you can help out the Festival, you can learn more and volunteer here: http://outshinefilm.com/volunteer Who selects the films in the Festival? There is a multi-tier process of how films are selected for the Festival, but it starts with persons like you.  We have a screening committee made up of people like you who watch, rate, and vote on the submitted films.  If you wish to become a member of the screening committee, please e-mail spc@outshinefilm.com and let us know. Membership Is my membership good for both Miami and Fort Lauderdale? Yes, your membership is good for a full year and does include both editions. What are the benefits of membership? Too many to list here.  But you can look here: http://outshinefilm.com/member-benefits for all your answers. Are there payment plans for Producers Circle Membership? Yes, there are. Is my membership tax deductible? Depending on your membership level, a portion of your membership is tax deductible.  In January the Festival mails out tax-deduction letters for your tax return. Ticketing Do you only show movies? No, we have a number of great events and panels during each edition, as well as events throughout the year. Where do I purchase tickets? 1.  You can get them here at the website when you click on the \"PROGRAM\" tab, then films, then the \"Get Tickets\" Button.  (24/7) 2.  You can purchase at our venue box-office. (1 hr before the first showtime of the day until 30 mins past the last screening of the day.) Are there physical tickets? 1.  If you order the tickets on-line, then you will receive an e-mail with your tickets as a .pdf attachment you can either a.) print and bring with you, or b.) have scanned from your smart phone. 2.  If you order the tickets by phone, then the same process as above. 3.  If you purchase your tickets at the venue box-office, then you will receive a ticket there. What's a RUSH Line?  And how does it work? When a film is sold-out, Festival staff will create a RUSH Line for patrons who do not have tickets.  Unclaimed and unused tickets for the screening will be released at showtime for persons in the RUSH Line in a first-come first-served basis.  Tickets will be sold at a flat $15 rate for regular screening and $25 for special event screening--CASH only. Grants Program Film Program Past Programs Buy Tickets Filmmaker Q&A's Watch on Your TV Festival About / Contact Film Entry Jury Talent Venues Winners Festival Team Travel Packages ADA Information FAQs Get Involved Events Sponsors Membership Careers Photo Gallery Press Room Press Releases Press Credentials Festival Materials Media Interviews Social © OUTshine - All Rights Reserved | Privacy Policy"
    },
    {
      "url": "https://outcoast.com/directory/listing/outshine-film-festival",
      "text": "OUTShine Film Festival - OutCoast.com Skip to content Home About Destinations California Florida Popular Destinations Fort Lauderdale Jacksonville Key West Miami Orlando St. Pete/Clearwater Tampa The Palm Beaches Wilton Manors Other Florida Destinations Amelia Island Clearwater Daytona Beach DeLand Delray Beach Dunedin Hollywood Mount Dora Naples & Marco Island Orlando North Panhandle Road Trip Pensacola Sarasota Treasure Island Wynwood Regions Central Florida Florida Keys Florida Panhandle North Florida Northeast Florida Panhandle South Florida Southwest Florida Treasure Coast Florida LGBTQ News & Media Resources Illinois Maine Marlyand Massachusetts Pennsylvania Texas Virginia Inspiration Accommodations Art Galleries & Museums Bars & Clubs Beaches Entertainment Fashion Food & Drink Holidays Outdoors & Nature Party Planning Pride Romance Shopping Sports Tours & Attractions Weddings Wellness Travel OutCoastTV Directory Add Your Business Adventure Book Accommodations Eat, Drink & Party Get Support Sightsee Shop Tie the Knot Resources Accessible Travel Business Services Health & Wellness Hurricane Help Legal Neurodivergent Travel Nonprofits Spirituality Universities Work With Us Home About Destinations California Florida Popular Destinations Fort Lauderdale Jacksonville Key West Miami Orlando St. Pete/Clearwater Tampa The Palm Beaches Wilton Manors Other Florida Destinations Amelia Island Clearwater Daytona Beach DeLand Delray Beach Dunedin Hollywood Mount Dora Naples & Marco Island Orlando North Panhandle Road Trip Pensacola Sarasota Treasure Island Wynwood Regions Central Florida Florida Keys Florida Panhandle North Florida Northeast Florida Panhandle South Florida Southwest Florida Treasure Coast Florida LGBTQ News & Media Resources Illinois Maine Marlyand Massachusetts Pennsylvania Texas Virginia Inspiration Accommodations Art Galleries & Museums Bars & Clubs Beaches Entertainment Fashion Food & Drink Holidays Outdoors & Nature Party Planning Pride Romance Shopping Sports Tours & Attractions Weddings Wellness Travel OutCoastTV Directory Add Your Business Adventure Book Accommodations Eat, Drink & Party Get Support Sightsee Shop Tie the Knot Resources Accessible Travel Business Services Health & Wellness Hurricane Help Legal Neurodivergent Travel Nonprofits Spirituality Universities Work With Us Home About Destinations California Florida Popular Destinations Fort Lauderdale Jacksonville Key West Miami Orlando St. Pete/Clearwater Tampa The Palm Beaches Wilton Manors Other Florida Destinations Amelia Island Clearwater Daytona Beach DeLand Delray Beach Dunedin Hollywood Mount Dora Naples & Marco Island Orlando North Panhandle Road Trip Pensacola Sarasota Treasure Island Wynwood Regions Central Florida Florida Keys Florida Panhandle North Florida Northeast Florida Panhandle South Florida Southwest Florida Treasure Coast Florida LGBTQ News & Media Resources Illinois Maine Marlyand Massachusetts Pennsylvania Texas Virginia Inspiration Accommodations Art Galleries & Museums Bars & Clubs Beaches Entertainment Fashion Food & Drink Holidays Outdoors & Nature Party Planning Pride Romance Shopping Sports Tours & Attractions Weddings Wellness Travel OutCoastTV Directory Add Your Business Adventure Book Accommodations Eat, Drink & Party Get Support Sightsee Shop Tie the Knot Resources Accessible Travel Business Services Health & Wellness Hurricane Help Legal Neurodivergent Travel Nonprofits Spirituality Universities Work With Us Home About Destinations California Florida Popular Destinations Fort Lauderdale Jacksonville Key West Miami Orlando St. Pete/Clearwater Tampa The Palm Beaches Wilton Manors Other Florida Destinations Amelia Island Clearwater Daytona Beach DeLand Delray Beach Dunedin Hollywood Mount Dora Naples & Marco Island Orlando North Panhandle Road Trip Pensacola Sarasota Treasure Island Wynwood Regions Central Florida Florida Keys Florida Panhandle North Florida Northeast Florida Panhandle South Florida Southwest Florida Treasure Coast Florida LGBTQ News & Media Resources Illinois Maine Marlyand Massachusetts Pennsylvania Texas Virginia Inspiration Accommodations Art Galleries & Museums Bars & Clubs Beaches Entertainment Fashion Food & Drink Holidays Outdoors & Nature Party Planning Pride Romance Shopping Sports Tours & Attractions Weddings Wellness Travel OutCoastTV Directory Add Your Business Adventure Book Accommodations Eat, Drink & Party Get Support Sightsee Shop Tie the Knot Resources Accessible Travel Business Services Health & Wellness Hurricane Help Legal Neurodivergent Travel Nonprofits Spirituality Universities Work With Us OUTShine Film Festival No Reviews 6360 Northeast 4th Court, Miami, FL 33138, USA Show On Map Favorite Profile Photos Map Reviews Profile The Miami Gay & Lesbian Film Festival started in 1998; the Fort Lauderdale Gay & Lesbian Film Festival in 2008. Both were brought together under one brand to become The MiFo LGBT Film Festival in 2015, with a seasonal event serving each city. Critically and internationally acclaimed, it serves as a platform for numerous premiers and is the largest LGBT cultural arts event in South Florida. Because of its increasing popularity and success, MiFo has been rechristened to the OUTSHINE Film Festival , underscoring its brightness, broad appeal and dynamic multi-cultural location. Outshine is everything you want in a film festival… inviting, glowing, and eclipsing all others before it. Our mission is to inspire, entertain, and educate; encouraging a sense of community through international and culturally diverse film, video, and other media that offer historical and contemporary perspectives on the gay, lesbian, bisexual, and transgender experience. OUTrageous. OUTspoken. And OUTstanding in what we deliver. Join us in 2018 for our 10th Annual Fort Lauderdale Edition, October 18-28 and in 2019 for our 21st Annual Miami Edition, April 18-28. OUTshine Film Festival is a d/b/a of the Miami Gay & Lesbian Film Festival, a 501(c)(3) Not-for-Profit. A copy of the official registration and financial information may be obtained from the Division of Consumer Services of Florida by calling toll-free within the state to 1-800-HELP-FLA(435-7352) or by visiting www.FloridaConsumerHelp.com. Registration does not imply endorsement, approval, or recommendation by the State. You can download our IRS 501(c)(3) determination letter here , and our tax-exempt certificate here . Board of Directors and Staff are listed under Festival Team CONTACT US OUTshine Film Festival 6360 NE 4th Court Miami, FL 33138 (305)751-6305 operations@outshinefilm.com Photos Map Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Enter your location Get Directions Travel mode Driving Walking Bicycling Public Transport Distance units Miles Kilometers Reviews Leave a Review Cancel reply You must be logged in to post a comment. Contact Info LGBTQ Social & Outreach and Theatre 6360 Northeast 4th Court, Miami, FL 33138, USA, Miami, Florida, 33138, United States Phone: (305)751-6305 Email: operations @ outshinefilm.com Website @OUTshineFilm Facebook OutCoast.com is an LGBTQ+ travel blog that offers info on gay Florida and LGBTQ-inclusive destinations, business and events across the “U.S. Gay.” We are the one-stop resource for LGBTQ people who love to travel and explore freely and without judgement. Copyright 2025 OutCoast, L.L.C. About Team Advertise info@outcoast.com Δ Email (Required) First Name (Required) Last Name LinkedIn This field is for validation purposes and should be left unchanged. Change Location Find awesome listings near you! Change Location X X"
    },
    {
      "url": "https://outshinefilm.com/about",
      "text": "OUTshine Film Festival - About Menu Program Film Program Past Programs Buy Tickets Filmmaker Q&A's Watch on Your TV Festival About / Contact Events Film Entry Jury Talent Venues Winners Festival Team Travel Packages ADA Information FAQs Get Involved Careers Photo Gallery Membership Sponsors Support Us About Us OUTshine LGBTQ+ Film Festival: Celebrating Cinema, Diversity & Community The OUTshine LGBTQ+ Film Festival is South Florida’s premier LGBTQ+ cultural arts event, originating from the Miami Gay & Lesbian Film Festival (1998) and the Fort Lauderdale Gay & Lesbian Film Festival (2008). These two iconic festivals merged under one dynamic brand, reflecting our vibrant, multicultural audience and international recognition. As a critically acclaimed platform, OUTshine is more than just a film festival—it’s an immersive experience designed to inspire, entertain, and educate . Our mission is to foster community and celebrate LGBTQ+ stories through diverse films, videos, and media that explore historical and contemporary perspectives. Experience OUTshine in 2025 Spring Edition : April 17 – 27 OUTshine At Home : April 28 – May 4 Fall Edition : October 16 – 26 OUTshine At Home : October 27 – November 2 Beyond our flagship festivals, OUTshine is a year-round cultural event featuring: Monthly screenings , including the popular Cocktails & Cinema™ series Exclusive sneak-peek events of upcoming films OUTshine At-Home , a virtual programming experience bringing LGBTQ+ cinema to audiences across Florida Join us in celebrating bold storytelling, diverse voices, and unforgettable cinematic moments. Be part of the OUTrageous, OUTspoken, and OUTstanding experience that is OUTshine LGBTQ+ Film Festival! Get tickets OUTshine Film Festival is a d/b/a of the Miami Gay & Lesbian Film Festival, a 501(c)(3) Not-for-Profit. A copy of the official registration and financial information may be obtained from the Division of Consumer Services of Florida by calling toll-free within the state to 1-800-HELP-FLA(435-7352) or by visiting www.FloridaConsumerHelp.com . Registration does not imply endorsement, approval, or recommendation by the State. You can download our IRS 501(c)(3) determination letter here , and our tax-exempt certificate here . Board of Directors and Staff are listed under Festival Team Contact Us OUTshine Film Festival PO Box 530280 Miami, FL 33153-0280 United States Tel: 305-849-7010 customerservice@outshinefilm.com Grants Program Film Program Past Programs Buy Tickets Filmmaker Q&A's Watch on Your TV Festival About / Contact Film Entry Jury Talent Venues Winners Festival Team Travel Packages ADA Information FAQs Get Involved Events Sponsors Membership Careers Photo Gallery Press Room Press Releases Press Credentials Festival Materials Media Interviews Social © OUTshine - All Rights Reserved | Privacy Policy"
    },
    {
      "url": "https://hotspotsmagazine.com/2023/04/18/the-outshine-lgbtq-film-festival-miami-edition-begins-april-20/",
      "text": "The OUTshine LGBTQ+ Film Festival, Miami Edition, Begins April 20 | Hotspots Magazine Facebook Instagram Twitter Magazine South Florida: Current Issue Magazine Archives: 2024 Magazine Archives: 2023 Magazine Archives: 2022 Magazine Archives: 2021 Magazine Archives: 2020 Magazine Archives: 2019 What’s Hot South Florida’s Hot Entertainment Hotspots Hotties Hot Advice Hot Beats Hot Bodies Hot Eats Women Press Play Women’s Events Must See Must Read Must Watch Women’s History Month Articles Feature Stories Deep Inside Hollywood Discover Gay FL Queens We Love DJs We Love Photos TV Happening Out Television Network The Bobby Blair Show The FayWhat?! Show Queer News Tonight Queer God Squad Events About Hotspots! Events Monthly Events Art Gallery Opening Reception Pride Skate Nights Art Walk Wilton Manors Artists Showcase Annual Events Stonewall Pride Parade & Festival Black History Month Events The Cookout: Black History Month Pride On The Drive Women’s History Month HOTtopics: Town Hall Series (Quarterly) July 4th Fireworks Cruise PrideFête: An LGBTQ Caribbean Festival The South Florida Men’s Wellness Conference Taste of the Island Art HOTspots Art About HOTspots Art Art Walk Wilton Manors Sculpture Walk Art Gallery with Dennis Dean Classifieds About Join Us Contact Us Advertise Search 86.9 F Fort Lauderdale Advertise with Us Contact Us Facebook Instagram Twitter Sign in Welcome! Log into your account your username your password Forgot your password? Get help Privacy Policy Password recovery Recover your password your email A password will be e-mailed to you. Magazine South Florida: Current Issue Magazine Archives: 2024 Magazine Archives: 2023 Magazine Archives: 2022 Magazine Archives: 2021 Magazine Archives: 2020 Magazine Archives: 2019 What’s Hot South Florida’s Hot Entertainment Hotspots Hotties Hot Advice Hot Beats Hot Bodies Hot Eats Women Press Play Women’s Events Must See Must Read Must Watch Women’s History Month Articles Feature Stories Deep Inside Hollywood Discover Gay FL Queens We Love DJs We Love Photos Hot Shots PHOTOS: The 25th Annual Black Fort Lauderdale Festival at The Manor Hot Shots PHOTOS – PrideFête: An LGBTQ+ Caribbean Festival 2025 Hot Shots PHOTOS: 10th Annual FlockFest Beach Party Hot Shots PHOTOS: Lez Chic Monthly Brunch: May 2025 Hot Shots PHOTOS – Wilton Manors Stonewall Pride Parade & Street Festival 2025… TV Happening Out Television Network The Bobby Blair Show The FayWhat?! Show Queer News Tonight Queer God Squad Events About Hotspots! Events Monthly Events Art Gallery Opening Reception Pride Skate Nights Art Walk Wilton Manors Artists Showcase Annual Events Stonewall Pride Parade & Festival Black History Month Events The Cookout: Black History Month Pride On The Drive Women’s History Month HOTtopics: Town Hall Series (Quarterly) July 4th Fireworks Cruise PrideFête: An LGBTQ Caribbean Festival The South Florida Men’s Wellness Conference Taste of the Island Art HOTspots Art About HOTspots Art Art Walk Wilton Manors Sculpture Walk Art Gallery with Dennis Dean Classifieds About Join Us Contact Us Advertise Hotspots Magazine Home Happening Out Television Network Queer News Tonight The OUTshine LGBTQ+ Film Festival, Miami Edition, Begins April 20 Queer News Tonight The OUTshine LGBTQ+ Film Festival, Miami Edition, Begins April 20 By Happening Out Television Network - April 18, 2023 588 Facebook Twitter Pinterest WhatsApp Advertisement Hotspots Magazine Happening Out Television Network is one of the world’s largest LGBTQ+ media networks. And we are proud to be Outshine LGBTQ+ Film Festival’s Presenting LGBTQ+ Media Sponsor. We are honored to celebrate the Outshine LGBTQ+ Film Festival’s 25th Anniversary. Outshine is everything you want in a film festival… inviting, glowing, and eclipsing all others before it. It serves as a platform for numerous premiers. It is also the largest LGBTQ+ cultural arts event in South Florida and is supported by one of the world’s largest LGBTQ+ media networks – Hotspot’s Magazine. Join the festival in 2023 for the Miami Edition of OUTshine. April 20 – 30, 2023, and the Fort Lauderdale Edition of OUTshine, October 12 – 22, 2023. Take time to celebrate our Queer community with Outshine and Hotspots Magazine and Happening Out Television Network including Queer News Tonight, It’s Happening Out, Sunshine Cathedral Sunday, and The FayWhat Show. We will see you in the movies. Happening Out Television Network See Full Bio TAGS OUTshine LGBTQ+ Film Festival Facebook Twitter Pinterest WhatsApp Previous article Defending Diversity: Outshine Chairman Dino Mosquera on the Importance of Latino Films and Language Next article OUTshine’s 25th Anniversary Celebrates ‘Birdcage’ High Atop Lincoln Road’s Rooftop Cinema Happening Out Television Network RELATED ARTICLES MORE FROM AUTHOR Queer News Tonight Imperial Sun Court Hosts Mr., Miss, and Mx Gay ISCOAF Pageant, September 27 Queer News Tonight Outshine Presents “Unicorns” in Pride Film Focus Series, September 11 Queer News Tonight Coffee & Conversation Unites LGBTQ+ Active Agers at The Pride Center, Every Tuesday Queer News Tonight Free HIV & STD Testing Coming to Wilton Manors, Every Friday & Saturday Queer News Tonight Pride Center Wants You To Leave A Legacy That Builds Equality One Stone At A Time Queer News Tonight Hotspots Shines Spotlight on Chic & Unique Ball Burlesque in Its New Issue, coming September 11 Advertisement ABOUT US © HOTspots Happening Out - Non-Profit (501c3) LGBTQ+ Media Network  \r\n2025 - Privacy Policy - Hotspots Magazine Contact us: info@hotspots.lgbt FOLLOW US Facebook Instagram Twitter © Hotspots! - Copyright 2024 - By 7Elements Web Design This website uses cookies to ensure you get the best experience on our website. Yes, I accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT MORE STORIES Imperial Sun Court Hosts Mr., Miss, and Mx Gay ISCOAF Pageant, September 27 Happening Out Television Network - September 11, 2025 Go to mobile version"
    }
  ]
}