{
  "fuentes": [
    {
      "url": "https://www.oysterbar.net/2022/10/21/anna-maria-oyster-bar-announces-north-port/",
      "email": "eleni@oystersrock.net"
    }
  ],
  "mails": [
    "eleni@oystersrock.net"
  ],
  "nombre_sitio": "oysterbar.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.oysterbar.net/2022/10/21/anna-maria-oyster-bar-announces-north-port/",
      "text": "Anna Maria Oyster Bar Announces Its First Sarasota County Location – Anna Maria Oyster Bar Skip to content ORDER ONLINE! MENUS AMOB MAIN MENU PIER MENU DEALS Locations Landside Cortez Ellenton Pier UTC North Port ABOUT CAREERS Purchase Gift Cards Host an Event Donation Request DIVE INTO READING CONTACT SHUCKIN’ GOOD CAUSE What is Shuckin’ Good Cause Donate to Shuckin’ Good Cause. Menu ORDER ONLINE! MENUS AMOB MAIN MENU PIER MENU DEALS Locations Landside Cortez Ellenton Pier UTC North Port ABOUT CAREERS Purchase Gift Cards Host an Event Donation Request DIVE INTO READING CONTACT SHUCKIN’ GOOD CAUSE What is Shuckin’ Good Cause Donate to Shuckin’ Good Cause. Anna Maria Oyster Bar Announces Its First Sarasota County Location October 21, 2022 FOR IMMEDIATE RELEASE MEDIA CONTACT: Eleni Sokos, Director of Brand Strategy Oysters Rock Hospitality eleni@oystersrock.net • (941) 725-0100 6688 Cortez Road West, Bradenton, FL 34210 Anna Maria Oyster Bar Announces Its First Sarasota County Location Oysters Rock Hospitality has closed on the building where its sixth Anna Maria Oyster Bar restaurant will open in early 2023 Bradenton, FL – Oysters Rock Hospitality, the parent company of well-known local restaurant brands Anna Maria Oyster Bar (AMOB) and Café L’Europe, announced today the purchase of property where the sixth Anna Maria Oyster Bar will be located at 14132 Tamiami Trail in North Port, Florida. John Horne, Chief Executive Oyster of Oysters Rock Hospitality, shared, “North Port is a special community that really reminds us of Bradenton. We loved meeting so many new neighbors when we hosted a pop-up meal service in the wake of Hurricane Ian. The people we met were so incredibly giving, friendly, and gracious – anyone would be lucky to have them as neighbors or guests in their restaurant. We can’t wait to open our doors early next year to serve our signature brand of “Five Star Fun,” delicious food, and a great atmosphere.” The new restaurant will have a menu very similar to the other AMOB locations, focusing on fresh fish, steaks, and wings, along with the restaurant’s award-winning oysters, burgers, and margaritas. The building, formerly the Family Table restaurant, will not require much construction to transform the interior into the signature Anna Maria Island-inspired eatery. However, plans are in place to add an indoor-outdoor bar to the north end of the property. Earlier this year, Oysters Rock Hospitality announced plans for a location at The Square at UTC , where construction will soon be underway as well. Chris Frawley, Chief Operating Officer of Oysters Rock Hospitality, said, “Everyone we’ve encountered in North Port shares our excitement for Anna Maria Oyster Bar’s sixth location. We’ve found the perfect location to plant our flag in South Sarasota County. I’m especially grateful to the previous owners of this restaurant for maintaining it so well and being so accommodating throughout this transaction, even in the face of an approaching Category 4 hurricane.” The permitting and buildout phase will soon commence, but as of print, the restaurant hopes to open in February 2023 when we can’t wait to meet and greet our new neighbors. ### About Anna Maria Oyster Bar Established in 1996 on the Anna Maria Pier, today the Anna Maria Oyster Bars are consistently awarded the Best All-Around Restaurant, Best Seafood Restaurant, and Best Margarita in the Bradenton, FL area. Beloved for its fun, family-friendly atmosphere, AMOB, as locals affectionately refer to the casual restaurant chain, offers a menu of seafood classics plus things that don’t swim, an expansive tropical-inspired cocktail menu, and its namesake Gulf oysters in a variety of preparations. The brand is nationally-recognized for its philanthropic initiatives in support of educational initiatives including Dive Into Reading, a summer reading program focused on combating the “summer slide” in rising second and third graders.  For more information, visit OysterBar.net , Facebook , and Instagram . Anna Maria Oyster Bar Locations: Landside: 6906 14th Street West, Bradenton, FL Cortez: 6696 Cortez Road, Bradenton, FL Ellen ton: 1525 51st Avenue East, Ellenton, FL Pier: Bridge Street Pier, Bradenton Beach, FL UTC: 5405 University Pkwy, Unit 110, Bradenton, FL North Port: 14132 Tamiami Trail, North Port, FL Related Posts Rollback Day 2025 Rolling Back the Clock for 30 Years of Five Star Fun Anna Maria Oyster Bar is turning the big 30, and we are celebrating in Thanksgiving at AMOB Landside Join Us for Thanksgiving at AMOB Let us take care of the cooking…and you can enjoy the holiday This Thanksgiving, AMOB is opening its doors Bayou to the Bay Menu Celebrate the flavors of the Gulf Coast this summer at Anna Maria Oyster Bar! Dive into our “Bayou to the Bay” Seasonal Menu, available starting Anna Maria Oyster Bar: A Seafood Evolution Anna Maria Island has long been a treasure trove of hidden culinary gems, and Anna Maria Oyster Bar (AMOB) is one of its crown jewels. CELEBRATING MORE THAN 25 YEARS SERVING  GREAT FOOD AT A GREAT VALUE IN A FUN,  FAMILY-FRIENDLY ATMOSPHERE. You’ll feel like family in our casual seafood restaurants that transport you from our door straight to Anna Maria Island!  The Anna Maria Oyster Bars serve Five Star Fun with great seafood and great hospitality inspired by life on Florida’s Gulf Coast. Subscribe for News & Coupons Locations Careers Menu Gift Cards © 2025 Anna Maria Oyster Bar | All Rights Reserved"
    }
  ]
}