{
  "fuentes": [
    {
      "url": "https://www.celticbars.com/celtic-bar/paddy-murphys-irish-pub/",
      "email": "green@2x.png"
    },
    {
      "url": "https://www.murphysirishpub.com.au/",
      "email": "info@murphys.ws"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://foursquare.com/v/paddy-murphys/4b636bcff964a5209c782ae3",
      "email": "icon-go_foursquare8@2x-8104e4d03ad47b81f079c1f043220e75.png"
    }
  ],
  "mails": [
    "green@2x.png",
    "icon-go_foursquare8@2x-8104e4d03ad47b81f079c1f043220e75.png",
    "info@communityaccessnaperville.org",
    "info@murphys.ws"
  ],
  "nombre_sitio": "paddymurphys.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.celticbars.com/celtic-bar/paddy-murphys-irish-pub/",
      "text": "Paddy Murphy's Irish Pub - Celticbars.com Skip to content Home Find a Celtic Bar CSC’s Profile of a CSC Away Days A-Z Celtic Bars About Contact Twitter Email Paddy Murphy’s Irish Pub Nearest Metro Beurs 4 mins walk. Not a Celtic bar, but shows our televised games. 0/5 (0 Reviews) Paddy Murphy’s Irish Pub Rodezand 15 Rotterdam 3011 AM Holland Directions: Click here for directions Shows Celtic games live on TV Telephone: 31 10 411 0078 Twitter: https://twitter.com/PaddyMurphysPub Facebook: https://www.facebook.com/pages/Paddy-Murphys/114488028623317 One Review to “Paddy Murphy’s Irish Pub” Shoni Courtney says: November 11, 2023 at 6:18 pm Will you be showing celtic match tomorrow? Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Football Without Fans – The History of Celtic Supporters Clubs As featured on Celtic TV Now on sale on Amazon Automatically locate a CSC. By allowing Celticbars to use your location, Google locates the nearest post code from the area you are in and automatically lists the nearest CSC to your current location within a 500 mile radius. This updates when you travel around. Your personal details don’t come to Celticbars. Check bar is showing the game If you are travelling a fair distance to a bar, check first to confirm they will be showing the games, especially if a game is televised on Premier Sports. Leave a review If you are in a Celtic Bar, can you please leave a comment so we can get some feedback? Thanks. © 2025 Celticbars.com Powered by WordPress / Theme by Design Lab"
    },
    {
      "url": "https://www.murphysirishpub.com.au/",
      "text": "Home | MURPHY'S IRISH PUB top of page Murphy's Irish Pub Home Make a Booking Our Menu Giftcards Events Functions FAQ Gallery Job Opportunities More Use tab to navigate through the menu items. Welcome to Murphy's Irish Pub Mandurah, Western Australia Our Story Established in 2008, Murphy's Irish Pub has been locally owned & operated ever since. Located in the heart of Mandurah Foreshore overlooking Mandjar Bay, we provide great entertainment most nights of the week free for all patrons including free trivia on Monday’s, Karaoke Wednesday, live soloists on Thursdays (excl winter), live bands Fridays & Saturdays before winding down with our Sunday sessions. We have a large selection of beer & cider on tap and also serve a great selection of wines, spirits, cocktails & coffees. Our delicious menu is far from the norm “pub food”. Our food is a favourite for locals and tourists for our great quality, big serves & delicious selection. If it’s live sport you’re after, then come and watch all the coverage on one of our 6 plasma screens or two huge cinema screens. We show a great variety of local & international sports so you’ll be sure to find the sporting match you’re after at Murphy’s. Showing matches on Optus Sports, STAN, HD Foxtel & Digital-TV. Check out our gallery Dining at Murphy's Chef's cooking 7 days a week! 11am 'til late Bookings recommended. Click the navigation bars at the top to make your reservation. View Our Menu Enjoy our menu for lunch & dinner, and all day on weekends. Most days we have a snack menu midweek between lunch & dinner (depending on chef availability) See our chalkboard inside for more daily chef specials For reservations you can now book online. For tables larger than 8, please contact the venue on (08) 9535 2666. Lunch & Dinner Menu Upcoming Events AFL Grand Final & All Blacks v Wallabies Sat, 27 Sept Mandurah Learn more Country Festival - Official After-Party venue! Sat, 25 Oct Mandurah Learn more Current Dining Specials & Deals Cold Beers on Tap We serve a large selection of products on tap including all the best Irish brands like Guinness, Kilkenny & Magners Cider. Plus 9 other great beers on tap including Hahn SuperDry full-strength & mid-strength, Heineken, Little Creatures, Swan Draught & a few more. We serve a great range of wines, spirits & cocktails too. ​Join us for Happy Hour 5pm-6pm Monday to Friday. Murphy's Irish Pub (08) 9535 2666 43-44 Mandurah Terrace, Mandurah WA 6210, Australia Tavern Licence:  6020120270 Licensee: Seaview Imports PTY LTD ABN 93 470 892 841 info@murphys.ws ©2022 by Murphy's Irish Pub. To view our Privacy Policy, plese head to our FAQ Page bottom of page"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join us at our Annual Fall Fundraiser! Click here for details. Click here to make an online donation Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Brenda Hasler, Operations Director Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Gia Hanrahan, Intern Coordinator & Program Leader Sarah VanStedum, Program Leader Dawn Callahan, Program Leader Andrew Zelasko, Program Leader Diana Chrostowski, Community Relations Coordinator Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Delani Kosner, Program Assistant Joseph Kim, Program Assistant Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    },
    {
      "url": "https://foursquare.com/v/paddy-murphys/4b636bcff964a5209c782ae3",
      "text": "Log in Foursquare City Guide Sign Up Nearby: Get inspired: Top Picks Trending Food Coffee Nightlife Fun Shopping Log in to Foursquare Email or Phone Number: Password: (Forgot password?) Sign up for Foursquare Log in with Facebook You must enable JavaScript to use foursquare.com We use the latest and greatest technology available to provide the best possible web experience. Please enable JavaScript in your browser settings to continue. Download Foursquare for your smart phone and start exploring the world around you!"
    }
  ]
}