{
  "query": "paddywagonorlando.com email",
  "fuentes": [
    {
      "url": "https://www.tripadvisor.com/Restaurant_Review-g34515-d10834746-Reviews-Paddywagon-Orlando_Florida.html",
      "email": "admin@paddywagonorlando.com"
    }
  ],
  "mails": [
    "admin@paddywagonorlando.com",
    "orlandofl@giverrang.com",
    "bulk-orders.orlandofl@giverrang.com"
  ],
  "nombre_sitio": "paddywagonorlando.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://www.tripadvisor.com/Restaurant_Review-g34515-d10834746-Reviews-Paddywagon-Orlando_Florida.html",
      "text": "PADDYWAGON, Orlando - Doctor Phillips - Restaurant Reviews, Photos & Phone Number - Tripadvisor Skip to main content Rewards Discover Trips Review USD Sign in Orlando Hotels Things to Do Restaurants Flights Cruises Vacation Rentals Forums United States Florida (FL) Central Florida Orlando Orlando Restaurants Paddywagon Paddywagon Claimed Someone from this business manages this listing. Learn More Share Review Save 3.7 3.7 of 5 bubbles ( 15 reviews ) #30 of 49 Bars & Pubs in Orlando Irish , Bar , $$ - $$$ 34 What is Travelers’ Choice? Tripadvisor gives a Travelers’ Choice award to accommodations, attractions and restaurants that consistently earn great reviews from travelers and are ranked within the top 10% of properties on Tripadvisor. Paddywagon Share Review Save At a glance Open until 2:00 AM See all hours 7940 Via Dellagio Way Ste 118, Orlando, FL 32819-5400 Website +1 407-420-7165 Email Improve this listing About Paddywagon Irish Pub is a neighborhood bar that prides itself on serving a good drink, at a fit price, in a clan inviting atmosphere. Whether booking a corporate outing, hosting a birthday party, or just grabbing a cold beer and playing our free steel tip darts, we've got something for everybody! Read more Read less Features CUISINES Irish, Bar, Pub Meal types Lunch, Dinner PRICE $$ - $$$ FEATURES Wheelchair Accessible Location 7940 Via Dellagio Way Ste 118, Orlando, FL 32819-5400 Doctor Phillips Is this location primarily known for Bars & Pubs ? Yes No Unsure Save this restaurant Save Hours Suggest an edit Open until 2:00 AM Sunday 12:00 PM - 2:00 AM Monday 12:00 PM - 2:00 AM Tuesday 12:00 PM - 2:00 AM Wednesday 12:00 PM - 2:00 AM Thursday 12:00 PM - 2:00 AM Friday 12:00 PM - 2:00 AM Saturday 12:00 PM - 2:00 AM Reviews Tips/Q&A All reviews Write a review Traveler photos All reviews Write a review Reviews are the subjective opinion of Tripadvisor members and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. No reviews for this property yet. Write a review Related Stories How to do Orlando with kids without stepping into a theme park Jul 11, 2025 • 4 min read How to do Orlando with kids without stepping into Disney. By Megan duBois Everything you need to know about Universal's Epic Universe May 20, 2025 • 6 min read To say that expectations around Universal's new Epic Universe are high is an understatement: this massive $7 billion theme park (the first major one to open in the U.S. since 1999) is pulling out all the stops with five themed lands: Wizarding World of Harry Potter–Ministry of Magic; How to Train Your Dragon–Isle of Berk; Dark Universe; Super Nintendo World; and Celestial Park. By Shayla Martin 12 incredible places to visit in May around the world Apr 10, 2025 • 8 min read From wildflowers to icebergs, we’re embracing the wonders of late spring. By Nicholas DeRenzo Best bars and pubs See all Velvet Bar 4.6 4.6 of 5 bubbles ( 83 reviews ) American • $$ - $$$ Closed now World of Beer 4.1 4.1 of 5 bubbles ( 148 reviews ) American • $$ - $$$ Open now Vanbarry's Public House 4.2 4.2 of 5 bubbles ( 108 reviews ) American • $$ - $$$ Open now Ten 10 Brewing Company 4.3 4.3 of 5 bubbles ( 67 reviews ) American • $$ - $$$ KPOT Korean BBQ & Hot Pot 4.4 4.4 of 5 bubbles ( 36 reviews ) Chinese • $$ - $$$ Open now Game Changers 3.7 3.7 of 5 bubbles ( 355 reviews ) American • $$ - $$$ Open now Mcorz_vitale, Spa Café 4.6 4.6 of 5 bubbles ( 54 reviews ) American • $$ - $$$ Open now Bar Louie - Orlando Gateway 3.8 3.8 of 5 bubbles ( 115 reviews ) American • $$ - $$$ Open now Reserve Bar Louie 3.9 3.9 of 5 bubbles ( 88 reviews ) American • $$ - $$$ Open now Roque Pub 4.8 4.8 of 5 bubbles ( 26 reviews ) American • $$ - $$$ Open now Order online Best nearby We rank these hotels, restaurants, and attractions by balancing reviews from our members with how close they are to this location. Best nearby hotels See all Hampton Inn Orlando/Lake Buena Vista 4.6 4.6 of 5 bubbles ( 5,068 ) 4.17 miles away Home2 Suites by Hilton Orlando South Park 4.6 4.6 of 5 bubbles ( 470 ) 4.04 miles away Drury Inn & Suites Near Universal Orlando Resort 4.7 4.7 of 5 bubbles ( 3,093 ) 0.94 miles away Hotel Monreale Express I-Drive Orlando 4.6 4.6 of 5 bubbles ( 2,613 ) 1.81 miles away Best nearby restaurants See all Bosphorous Turkish Cuisine - Dr Phillips 4.8 4.8 of 5 bubbles ( 1,418 ) 0.2 miles away Fleming's Prime Steakhouse & Wine Bar 4.5 4.5 of 5 bubbles ( 543 ) 0.12 miles away The Melting Pot 4.9 4.9 of 5 bubbles ( 5,677 ) 0.41 miles away Dragonfly Robata Grill & Sushi 4.4 4.4 of 5 bubbles ( 529 ) 0.08 miles away Best nearby attractions See all Corona Cigar Co. & Drew Estate Lounge 4.8 4.8 of 5 bubbles ( 221 ) 0.21 miles away Theatre South Playhouse 5.0 5 of 5 bubbles ( 1 ) 0.14 miles away The Wizarding World of Harry Potter at Universal Orlando Resort 4.8 4.8 of 5 bubbles ( 41,351 ) 2.39 miles away The Escape Game Orlando 5.0 5 of 5 bubbles ( 7,031 ) 1.33 miles away Is This Your Listing? Own or manage this property?  Claim your listing for free to respond to reviews, update your profile and much more. Claim Your Free Listing PADDYWAGON, Orlando - Doctor Phillips - Restaurant Reviews, Photos & Phone Number - Tripadvisor Orlando Orlando Tourism Orlando Hotels Orlando Bed and Breakfast Orlando Vacation Rentals Flights to Orlando Orlando Restaurants Things to Do in Orlando Orlando Travel Forum Orlando Photos Orlando Map Hotels All Orlando Hotels Orlando Hotel Deals Last Minute Hotels in Orlando Hotels Near Me By Hotel Type Orlando Motels Orlando Campgrounds Orlando Hostels Romantic Hotels in Orlando Orlando Luxury Hotels Orlando Resorts Orlando Green Hotels Orlando Business Hotels Orlando Beach Hotels Orlando Family Hotels Orlando Spa Resorts By Hotel Class 3-Star Hotels in Orlando 5-Star Hotels in Orlando 4-Star Hotels in Orlando By Hotel Brand Comfort Inns in Orlando Autograph Collection (Marriott Bonvoy) Hotels in Orlando The Walt Disney Company Hotels in Orlando WoodSpring Suites in Orlando Days Inns in Orlando Hyatt Place Hotels in Orlando La Quinta Inns & Suites in Orlando Loews Hotels in Orlando Staybridge Suites in Orlando Holiday Inns Express in Orlando Element (Marriott Bonvoy) Hotels in Orlando Westgate Resorts in Orlando Universal Resorts in Orlando Marriott Vacation Club (Marriott Bonvoy) Hotels in Orlando Tribute Portfolio (Marriott Bonvoy) Hotels in Orlando Popular Amenities Orlando Hotels with Free Parking Pet Friendly Hotels in Orlando Orlando Hotels with Pools Popular Neighborhoods Lake Buena Vista Hotels Doctor Phillips Hotels Metro West Hotels Millenia Hotels Lake Nona Hotels Downtown Orlando Hotels International Drive Hotels Florida Center Hotels Hotels near Baybreeze Manor Hotels near Colonialtown North Popular Orlando Categories Hotels with Shuttle in Orlando Suite Hotels in Orlando Condo Resorts in Orlando Hotels with Lazy Rivers in Orlando Orlando Hotels with Waterparks All Inclusive Resorts in Orlando Boutique Bed and Breakfast in Orlando Historic Hotels in Orlando Orlando Adults Only and Adult Friendly Hotels Hotels on the River in Orlando Near Landmarks Hotels near Universal Islands of Adventure Hotels near Universal Studios Florida Hotels near The Wizarding World of Harry Potter at Universal Orlando Resort Hotels near Disney's Animal Kingdom Theme Park Hotels near Walt Disney World Resort Hotels near SeaWorld Hotels near Epcot Hotels near Happily Ever After Fireworks Hotels near Discovery Cove Hotels near Epcot World Showcase Near Train Stations Hotels near Orlando Health/Amtrak Station Hotels near Church St Station Hotels near Lynx Central Station Hotels near Sand Lake Road Station Hotels near Florida Hospital Health Village Station Hotels near Winter Park Station Hotels near Maitland Station Hotels near Altamonte Springs Station Near Airports Hotels near Orlando Intl Airport (MCO) Hotels near Orlando Sanford International Airport (SFB) Hotels near Daytona Beach Regional Airport (DAB) Motels near Orlando Sanford International Airport (SFB) Motels near Daytona Beach Regional Airport (DAB) Motels near Orlando Intl Airport (MCO) Near Colleges Hotels near Orlando Tech Hotels near Keiser University Hotels near International Academy of Design and Technology, Orlando Hotels near Florida College of Integrative Medicine Hotels near Mid Florida Tech Hotels near ITT Technical Institute - Orlando Campus Hotels near Everest University - South Orlando, FL Hotels near Le Cordon Bleu College of Culinary Arts in Orlando Hotels near Valencia College Orlando, FL Hotels near ITT Technical Institute Popular Hotel Categories Popular Spa Hotels Popular Singles Resorts Popular Apartment Hotels Popular Hostels Popular Family Hotels Popular Spa Resorts Popular Casino Hotels Popular Villas Popular Bed and Breakfasts Popular Family Resorts Things to Do Restaurants All Orlando Restaurants Restaurants near Paddywagon Popular Types of Food Healthy Restaurants in Orlando Cuban Restaurants in Orlando Korean Restaurants in Orlando Venezuelan Restaurants in Orlando Fast Food Restaurants in Orlando Latin Restaurants in Orlando Vegan Restaurants in Orlando Halal Restaurants in Orlando Vegetarian Restaurants in Orlando Gluten Free Restaurants in Orlando European Restaurants for Special Occasions in Orlando French Restaurants with Outdoor Seating in Orlando Greek Restaurants with Outdoor Seating in Orlando Popular Dishes Best Falafel in Orlando Best Saltimbocca in Orlando Best Juice & Smoothies in Orlando Best Lobster in Orlando Best Baked Ziti in Orlando Best Tzatziki in Orlando Best Arepas in Orlando Best Kimchi in Orlando Best Hummus in Orlando Best Salmon in Orlando Best Clam Chowder in Orlando Best Swordfish in Orlando Best Steak Frites in Orlando Best Shrimp and Grits in Orlando Best Cod in Orlando Popular Restaurant Categories Breakfast Restaurants in Orlando Lunch Restaurants in Orlando Dinner Restaurants in Orlando Restaurants for Special Occasions in Orlando Cheap Eats in Orlando Private Dining Restaurants in Orlando Restaurants with Outdoor Seating in Orlando Restaurants for Group Dining in Orlando Romantic Restaurants in Orlando Kid Friendly Restaurants in Orlando Desserts in Orlando Bakeries in Orlando Coffee & Tea in Orlando Popular Neighborhoods Doctor Phillips Restaurants Millenia Restaurants Metro West Restaurants Florida Mall Restaurants Hunters Creek Restaurants St Joses Restaurants Florida Center Restaurants Downtown Orlando Restaurants Flights Vacation Rentals Travel Stories Cruises More Tours Add a Place Travel Forum Airlines Travelers' Choice Help Center Trip Planner © 2025 Tripadvisor LLC All rights reserved. Terms of Use Privacy and Cookies Statement Cookie consent Site Map How the site works Contact us Accessibility Statement This is the version of our website addressed to speakers of English in the United States . If you are a resident of another country or region, please select the appropriate version of Tripadvisor for your country or region in the drop-down menu. Tripadvisor  LLC makes no guarantees for availability of prices advertised on our sites and applications. Listed prices may require a stay of a particular length or have blackout dates, qualifications or other applicable restrictions. Tripadvisor LLC is not responsible for any content on external web sites that are not owned or operated by Tripadvisor . Indicative hotel prices displayed on our “Explore” pages are estimates extrapolated from historic pricing data. Tripadvisor LLC is not a booking agent or tour operator. When you book with one of our partners, please be sure to check their site for a full disclosure of all applicable fees. Read more $ USD United States"
    }
  ]
}