{
  "fuentes": [
    {
      "url": "https://borellis.co.uk/contact/",
      "email": "info@borellis.co.uk"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "email": "hero-contact@2x.jpg"
    }
  ],
  "mails": [
    "hero-contact@2x.jpg",
    "info@borellis.co.uk",
    "info@rivervillegrill.com"
  ],
  "nombre_sitio": "palletbarandgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://borellis.co.uk/contact/",
      "text": "Contact – Borellis Wine Bar & Grill Skip to content Borellis Wine Bar & Grill The best location in Farnham Menu expanded collapsed Menu Reservations Comedy Club Vacancies Contact Contact Let’s talk 👋 Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch Borellis Borelli Yard Farnham Surrey GU9 7NU UK info@borellis.co.uk +44 1252 735254 Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Phone (required) Warning Message (required) Warning Warning. Submit Δ Borellis Wine Bar & Grill ,"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "text": "Contact Us - Sidebar Grill 778.298.7433 | Now Hiring View Menu Promotions Order Online Book A Table Live Music Home About Us Menu Events & News Event Venue Gift Cards Contact Us CONTACT US Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly. 778.298.7433 info@sidebargrill.com View Form Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available SUNDAY TO THURSDAY 11am  - 11pm FRIDAY & SATURDAY 11am  - 12am Get Directions Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly at: 778-298-7433. First Name * Last Name * Email * Phone Message 778.298.7433 info@sidebargrill.com Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available Available to serve you seven days a week: Monday – Thursday 10:00am-11:00pm Friday and Saturday 9:00am – 12:00am Sunday 9:00am - 11:00pm Home About Us Menu Events & News Private Dining Gift Cards Contact Us"
    }
  ]
}