{
  "fuentes": [
    {
      "url": "https://palmvalleyfishcamp.com/private-dining/",
      "email": "laura@southerntablehospitality.com"
    },
    {
      "url": "https://palmvalleyfishcamp.com/private-dining/",
      "email": "laura@southerntablehospitality.com"
    },
    {
      "url": "https://historiccoastculture.com/organization/palm-valley-fish-camp/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/organization/palm-valley-fish-camp/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://thenorthbeachfishcamp.com/gallery/",
      "email": "info@thenorthbeachfishcamp.com"
    }
  ],
  "mails": [
    "info@thenorthbeachfishcamp.com",
    "laura@southerntablehospitality.com",
    "sjcc@historiccoastculture.com",
    "x@2x.png"
  ],
  "nombre_sitio": "palmvalleyfishcamp.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://palmvalleyfishcamp.com/private-dining/",
      "text": "Private Dining | The Palm Valley Fish Camp Order Online Menu About Blog Join Our Team Gallery Gift Cards Order Online Reservations Reservations Catering & Private Dining Contact Buyout Want to throw a party? For parties of 16 more or if you wish to book a room for a special occasion, please contact Laura Hayes, Director of Events and Catering, at 904-654-9877 or email laura@ southerntablehospitality.com Please contact our Special Events Planner: Laura Hayes Director of Sales & Marketing O: (904) 654-9877 Laura@southerntablehospitality.com ONLINE RESERVATIONS Call us at (904) 285-3200 to make a reservation, or make one online by clicking the button below. Book your Palm Valley Fish Camp reservation on Resy SHOP Shop Gift Cards Gift Cards St. Augustine Fish Camp 142 Riberia St St. Augustine, FL 32084 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 827-7000 Follow Follow Palm Valley Fish Camp 299 Roscoe Blvd N Ponte Vedra Beach, FL 32082 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 285-3200 Follow Follow Follow Julington Creek Fish Camp 12760 San Jose Blvd Jacksonville, FL 32223 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 886-2267 Follow Follow North Beach Fish Camp 100 First St Neptune Beach, FL 32266 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 249-3474 Follow Follow DINE WITH THE SOUTHERN TABLE HOSPITALITY FAMILY Online Ordering Private Dining Careers Contact Order Online leave us a review Follow Follow join our growing team Copyright © 2025 | Palm Valley Fish Camp English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Accessibility  Adjustments Powered by OneTap Select your accessibility profile Vision Impaired Mode Enhances website's visuals Seizure Safe Profile Clear flashes & reduces color ADHD Friendly Mode Focused browsing, distraction-free Blindness Mode Reduces distractions, improves focus Epilepsy Safe Mode Dims colors and stops blinking Content Bigger Text Cursor Line Height Letter Spacing Readable Font Dyslexic Font Align Text Text Magnifier Highlight Links Colors Invert Colors Brightness Contrast Grayscale Saturation Orientation Reading Line Keyboard Navigation Highlight Titles Reading Mask Hide Images Highlight Al Read Page Mute Sounds Stop Animations Reset Settings Version 6.2.0"
    },
    {
      "url": "https://historiccoastculture.com/organization/palm-valley-fish-camp/",
      "text": "Palm Valley Fish Camp - HistoricCoastCulture.com Palm Valley Fish Camp - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 SEARCH Advanced Filters Home Organization Palm Valley Fish Camp Facebook Twitter Linkedin Print Palm Valley Fish Camp The owners of the fine-dining spot Marker 32, Ben and Liza, opened the Palm Valley Fish Camp near Ponte Vedra Beach in 2009. Located on the Intracoastal, Palm Valley Fish Camp is the result of Groshell’s vision to create a restaurant with a neighborhood feel, the freshest seafood, amazing views, and old favorite entrees with creative, new twists. This venue’s interior is as fresh and inviting as the catch of the day, and the light from the sun shimmers off the water as a simple gift just before the sun sets. The locals know exactly where to come to get that getaway feel right here at home. If the freshest oysters on the half shell and true southern seafood awaken your taste buds, stop in today for an unforgettable lunch or dinner with a lively atmosphere, knowledgeable and friendly service, and spectacular views. The owners of the fine-dining spot Marker 32, Ben and Liza, opened the Palm Valley Fish Camp near Ponte Vedra Beach in 2009. Located on the Intracoastal, Palm Valley Fish Camp is the result of Groshell’s vision to create a restaurant with a neighborhood feel, the freshest seafood, amazing views, and old favorite entrees with creative, new twists. This venue’s interior is as fresh and inviting as the catch of the day, and the light from the sun shimmers off the water as a simple gift just before the sun sets. The locals know exactly where to come to get that getaway feel right here at home. If the freshest oysters on the half shell and true southern seafood awaken your taste buds, stop in today for an unforgettable lunch or dinner with a lively atmosphere, knowledgeable and friendly service, and spectacular views. View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: Commercial Business ; Food/Drink PHOTOS Contact information Website / Facebook / Instagram / Primary address: 299 Roscoe Boulevard N, Ponte Vedra Beach, FL 32082 904-285-3200 Find An Organization Search by Keyword Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Featured Organizations EMMA Concert Association Presenting beautiful music in beautiful St. Augustine at the Lewis Auditorium at Flagler College! EMMA’s mission is to offer quality music and dance performances by national and international artists. They also aim to encourage interest in classical music and to provide opportunities for the youth of St. Johns County. EMMA accomplishes this by offering school concerts in local schools and funding requests from music teachers for instruments and equipment. Historic Florida Militia The Historic Florida Militia (HFM) is a non-profit umbrella organization supporting re-created historic interpretive units and representing a number of cultures and time periods. \"We are not street performers, we are educators. We are not parades, we are historic programs. This is not an exercise in free speech, this is an opportunity to educate. We are not promoting a political agenda, we are promoting the city's history through a practical and factual teaching method\". Crisp-Ellert Art Museum at Flagler College Built in honor of Dr. JoAnn Crisp-Ellert and her husband, Dr. Robert Ellert, the Crisp-Ellert Art Museum offers Flagler College students and the Northeast Florida community a venue for fostering knowledge and a deep appreciation of contemporary art. As an educational resource for the College, the Museum exhibits regional, national and international artists, and provides opportunities for critical engagement and exposure to a variety of exhibitions and personal interactions with visiting artists. The Museum challenges students, the Flagler community and the public to cultivate individual creativity, critical reflection, historical consciousness and respect for the free exchange of ideas. In this spirit, the Museum also hosts public programs, including artist talks, readings, panel discussions and film series that provide a platform for vital interdisciplinary dialogue. DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://thenorthbeachfishcamp.com/gallery/",
      "text": "Gallery | The North Beach Fish Camp Order Online Menu About Blog Gallery Join Our Team Gift Cards Order Online Reservations Reservations Catering & Private Dining Contact Gallery As you can see, good times never end here at North Beach Fish Camp! Besides our creative menu, our scenic view and lively atmosphere make us the perfect dining spot in Neptune Beach! If you haven’t dined at the North Beach Fish Camp recently, here is where you can get a picture of who we are here and what we’re all about. Click on a photo to enlarge it, then use the arrows provided to view other photos. Have any great shots of you and your friends dining at the North Beach Fish Camp? Send them our way! info@thenorthbeachfishcamp.com ONLINE RESERVATIONS Call us at (904) 249-3474 to make a reservation, or make one online by clicking the button below. Book your North Beach Fish Camp reservation on Resy SHOP Shop Gift Cards Gift Cards St. Augustine Fish Camp 142 Riberia St St. Augustine, FL 32084 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 827-7000 Follow Follow Palm Valley Fish Camp 299 Roscoe Blvd N Ponte Vedra Beach, FL 32082 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 285-3200 Follow Follow Follow Julington Creek Fish Camp 12760 San Jose Blvd Jacksonville, FL 32223 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 886-2267 Follow Follow North Beach Fish Camp 100 First St Neptune Beach, FL 32266 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 249-3474 Follow Follow DINE WITH THE SOUTHERN TABLE HOSPITALITY FAMILY Online Ordering Private Dining Careers Contact join our growing team Order Online leave us a review Follow Follow Copyright © 2025 | North Beach Fish Camp English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Accessibility  Adjustments Powered by OneTap Select your accessibility profile Vision Impaired Mode Enhances website's visuals Seizure Safe Profile Clear flashes & reduces color ADHD Friendly Mode Focused browsing, distraction-free Blindness Mode Reduces distractions, improves focus Epilepsy Safe Mode Dims colors and stops blinking Content Bigger Text Cursor Line Height Letter Spacing Readable Font Dyslexic Font Align Text Text Magnifier Highlight Links Colors Invert Colors Brightness Contrast Grayscale Saturation Orientation Reading Line Keyboard Navigation Highlight Titles Reading Mask Hide Images Highlight Al Read Page Mute Sounds Stop Animations Reset Settings Version 6.2.0"
    }
  ]
}