{
  "fuentes": [
    {
      "url": "https://business.palmcitychamber.com/",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://www.pdacc.org/about-us/",
      "email": "ceo@pdacc.org"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "email": "22chamber@lexingtonchamber.net"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "email": "chamber@lexingtonchamber.net"
    },
    {
      "url": "https://pschamber.org/board-staff/",
      "email": "aflores@pschamber.org"
    },
    {
      "url": "https://pschamber.org/board-staff/",
      "email": "bwatson@pschamber.org"
    },
    {
      "url": "https://pschamber.org/board-staff/",
      "email": "dwhite@pschamber.org"
    },
    {
      "url": "https://pschamber.org/board-staff/",
      "email": "egray@pschamber.org"
    },
    {
      "url": "https://pschamber.org/board-staff/",
      "email": "info@pschamber.org"
    },
    {
      "url": "https://pschamber.org/board-staff/",
      "email": "mellis@pschamber.org"
    },
    {
      "url": "https://pschamber.org/board-staff/",
      "email": "nwatson@pschamber.org"
    },
    {
      "url": "https://business.palmcitychamber.com/event-calendar/details/clipper-cuts-ribbon-cutting-879648",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://business.palmcitychamber.com/event-calendar/details/clipper-cuts-ribbon-cutting-879648",
      "email": "missi@palmcitychamber.com"
    },
    {
      "url": "https://www.indiantownchamber.com/member/detail/id/251/pid/7/letter/P",
      "email": "missi@palmcitychamber.com"
    },
    {
      "url": "https://www.palmcitychamber.com/our-team/",
      "email": "christiana@palmcitychamber.com"
    },
    {
      "url": "https://www.palmcitychamber.com/our-team/",
      "email": "christiana@palmcitychamber.com"
    },
    {
      "url": "https://www.palmcitychamber.com/our-team/",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://www.palmcitychamber.com/our-team/",
      "email": "liz@palmcitychamber.com"
    },
    {
      "url": "https://www.palmcitychamber.com/presidents-message/",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://business.palmcitychamber.com/event-calendar/Details/business-after-hours-ribbon-cutting-for-aanya-boutique-633059?sourceTypeId=Website",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://business.palmcitychamber.com/event-calendar/Details/business-after-hours-ribbon-cutting-for-aanya-boutique-633059?sourceTypeId=Website",
      "email": "missi@palmcitychamber.com"
    },
    {
      "url": "https://www.webwonders.nl/en/contact/",
      "email": "info@webwonders.nl"
    },
    {
      "url": "https://business.stuartmartinchamber.org/members/member/palm-city-chamber-of-commerce-4558",
      "email": "info@stuartmartinchamber.org"
    },
    {
      "url": "https://www.palmcitychamber.com/ambassadors/",
      "email": "liz@palmcitychamber.com"
    },
    {
      "url": "https://www.palmcitychamber.com/ambassadors/",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://www.palmcitychamber.com/ambassadors/",
      "email": "missi@palmcitychamber.com"
    },
    {
      "url": "https://business.palmbeaches.org/contact",
      "email": "chamber@palmbeaches.org"
    },
    {
      "url": "https://business.palmbeaches.org/contact",
      "email": "chamber@palmbeaches.org"
    },
    {
      "url": "https://leadiq.com/c/palm-city-chamber-of-commerce/5a1ddddf2300005400ed5b32/email-format",
      "email": "john@palmcitychamber.com"
    },
    {
      "url": "https://leadiq.com/c/palm-city-chamber-of-commerce/5a1ddddf2300005400ed5b32/email-format",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/palm-city-chamber-of-commerce/5a1ddddf2300005400ed5b32/email-format",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://www.pbnchamber.com/",
      "email": "eharrigan@gssef.org"
    },
    {
      "url": "https://www.palmcitychamber.com/",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://business.palmcitychamber.com/business-directory/Details/martin-downs-property-owners-association-inc-1712752",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://palmbeaches.org/gz/contact-us/",
      "email": "chamber@palmbeaches.org"
    },
    {
      "url": "https://www.indiantownchamber.com/member/detail/id/251/pid/40",
      "email": "missi@palmcitychamber.com"
    },
    {
      "url": "https://pcfchamber.com/about/contact/",
      "email": "info@pcfchamber.com"
    },
    {
      "url": "https://pcfchamber.com/about/contact/",
      "email": "kelsie@pcfchamber.com"
    },
    {
      "url": "https://pschamber.org/contact-us/",
      "email": "info@pschamber.org"
    },
    {
      "url": "https://business.palmcitychamber.com/business-directory/FindStartsWith?term=P",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://www.britcham.com/committees/get-involved",
      "email": "contact@britcham.com"
    },
    {
      "url": "https://www.britcham.com/committees/get-involved",
      "email": "glueup-logo-white@2x.png"
    },
    {
      "url": "https://www.britcham.com/committees/get-involved",
      "email": "roberta@britcham.com"
    },
    {
      "url": "https://www.palmcitychamber.com/about-us/",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://business.palmcitychamber.com/contact-us",
      "email": "info@palmcitychamber.com"
    },
    {
      "url": "https://www.palmcitychamber.com/board-of-directors/",
      "email": "info@palmcitychamber.com"
    }
  ],
  "mails": [
    "22chamber@lexingtonchamber.net",
    "aflores@pschamber.org",
    "bwatson@pschamber.org",
    "ceo@pdacc.org",
    "chamber@lexingtonchamber.net",
    "chamber@palmbeaches.org",
    "christiana@palmcitychamber.com",
    "contact@britcham.com",
    "dwhite@pschamber.org",
    "egray@pschamber.org",
    "eharrigan@gssef.org",
    "glueup-logo-white@2x.png",
    "info@palmcitychamber.com",
    "info@pcfchamber.com",
    "info@pschamber.org",
    "info@stuartmartinchamber.org",
    "info@webwonders.nl",
    "john@palmcitychamber.com",
    "kelsie@pcfchamber.com",
    "liz@palmcitychamber.com",
    "mellis@pschamber.org",
    "missi@palmcitychamber.com",
    "name@company.com",
    "nwatson@pschamber.org",
    "roberta@britcham.com",
    "sales@leadiq.com"
  ],
  "nombre_sitio": "palmcitychamber.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://business.palmcitychamber.com/",
      "text": "Public Modules - Palm City Chamber of Commerce  - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Palm City Chamber of Commerce Public Modules - Development Mode TODO: Redirect to your home page Powered By GrowthZone © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.pdacc.org/about-us/",
      "text": "About Us - Palm Desert Area Chamber of Commerce Skip to content Menu The Chamber About Us Staff Ambassadors Board of Directors Contact US Info Request Executive Council Directory Member Directory Local Business Guide Business Guide Prices Members Member Login Membership Benefits Member News and Events Member To Member Deals Member Map Chamber Master Training Videos Testimonial Submissions Local Spotlight Calendars Chamber Events Community Events Weather Advocacy Elected Officials Tax Rate Update Events Business Breakfast After Hours Mixer Profit Connection Lunch Ribbon Cutting State of the City Putt Putt on El Paseo Business Awards Health and Wellness Fair Photos/Videos Golf Cart Parade 2024 State of the City 2024 Keep PD Moving Forward Chamber Videos Health and Wellness Fair 2025 Travel Canadian Rockies by Train New England Holiday Spotlight on Northern Italy Join the Chamber About Us The Palm Desert Area Chamber of Commerce is focused on creating a strong local economy through speakers, seminars, networking, promotion, and advocating on issues that create a strong local economy. Mission Statement The Palm Desert Chamber of Commerce is a corporation organized and dedicated to promote, support, and enhance business prosperity, civic vitality, and quality of life. Vision Statement To proactively contribute to a successful business environment through collaborative efforts utilizing valley resources. About the Palm Desert Chamber of Commerce We are excited to tell you more about the historical City of Palm Desert and the Palm Desert Area Chamber of Commerce. Incepted in 1954, the Chamber has existed in place longer than the city of Palm Desert. The founders of this Chamber understood the importance of providing support to a new and growing area. Likewise, we understand the importance today of serving the Area and its Business Community in todayâs business environment, with all of itâs opportunities and challenges. Palm Desert is the center of the Retail world in the Coachella Valley and the Chamber is here to support that business community. Small businesses are the life blood of Palm Desert and we exist to provide service and value to them. The Palm Desert Area Chamber of Commerce proudly represents a membership that not only spans the entire Coachella Valley, but Riverside, Imperial, Orange and San Diego counties as well. We strive for excellence. We are committed to offering premium services, programs, signature events, and monthly events that provide value to our members and our community at large. Stay updated at our websiteÂ pdacc.org Â that highlights upcoming events and activities. May you live, love and play well in the Coachella Valley as you engage in this vibrant community. We are a nonprofit membership organization whose members are local businesses invested in developing their business and its people, growing our economy, and strengthening our community. We work with our members to invest in a broad range of initiatives that support Palm Desert, being the best place to live, work, play and do business. We are an independent organization. While we work closely with our community partners, we are not a part of the City of Palm Desert. We are a nonprofit organization funded by membership investment from local businesses. Like most professional and trade associations, we are categorized as a non-tax-exempt 501(c)(6) organization. The Palm Desert Chamber of Commerce is governed exclusively by our local board of directors and is run by professional staff who work to serve and advance the interest of ourÂ members. OUR MISSION To promote, support and enhance business prosperity, civic vitality and quality of life. OUR VISION To proactively contribute to a successful business environment through collaborative efforts utilizing valley resources. © 2025 Palm Desert  Area Chamber of Commerce | Site by GrowthZone Get In Touch! 760-346-6111 72559 Hwy 111, Palm Desert, CA 92260 Email Us Additional Resources Member Login Become a Member Contact Us Stay Connected! Black Facebook F logo icon that links to the PDACC Facebook page. Black Square Instagram Icon that links to the PDACC Instagram Page © Palm Desert  Area Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "text": "Contact Us - Lexington Area Chamber of Commerce Skip to content Home Member Directory Expand Member Login Chamber Directory List Virtual Membership Directory About The Chamber Expand Chamber Board of Directors Chamber Team Member Benefits Lexington Leaders Program of Work Community Resources Expand Employment Opportunities Special Deals Portraits of Davidson County Events Expand Host Your Event at The Breeden Insurance Amphitheatre Chamber Ribbon Cutting Ceremonies Join The Chamber Contact Us Search Toggle Menu Search Contact Us Your questions and concerns are important to us, and we want to answer any questions you may have. However, the high volume of messages we receive can make it difficult for us to respond to every one promptly. If you sent us a message/question and haven’t heard back within a week, please call us at 336-248-5929 . Location: 507 East Center Street., Lexington, NC 27292 Contact Information: PH: 336-248-5929 Mail: Lexington Area Chamber of Commerce P.O. Drawer C, Lexington, NC 27293 Follow Us Facebook LinkedIn Contact Us \" * \" indicates required fields Δ Today's Date * MM slash DD slash YYYY Name * First Last Email * Enter Email Confirm Email Main Contact Number * Organization * If not an organization or business, please put N/A. Address * Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Country Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Comments * Please let us know what's on your mind. Have a question for us? Ask away. About The Chamber Community Resources Member Directory Join The Chamber Contact Us Get In Touch! PH: 336-248-5929 chamber@lexingtonchamber.net 507 East Center St. Lexington, NC 27292 Facebook LinkedIn Instagram © 2025 Lexington Area Chamber of Commerce - WordPress Theme by Kadence WP Scroll to top Scroll to top Home Member Directory Toggle child menu Expand Member Login Chamber Directory List Virtual Membership Directory About The Chamber Toggle child menu Expand Chamber Board of Directors Chamber Team Member Benefits Lexington Leaders Program of Work Community Resources Toggle child menu Expand Employment Opportunities Special Deals Portraits of Davidson County Events Toggle child menu Expand Host Your Event at The Breeden Insurance Amphitheatre Chamber Ribbon Cutting Ceremonies Join The Chamber Contact Us Toggle Menu Close Search for: Search"
    },
    {
      "url": "https://pschamber.org/board-staff/",
      "text": "Board & Staff | Palm Springs Chamber of Commerce Membership Join the Chamber Member Benefits Marketing Opportunities President’s Circle Business Resources Starting Your New Business About Palm Springs Community Resources Co-Working FAQs Job Board Business Directory Events & Programs List of Current Events Palm Springs United Signature Events Police and Fire Appreciation Luncheon Business Expo & Taste of Palm Springs State of the City Rock the Park Palm Springs Car Show & Festival Member Connections Ribbon Cuttings Leads Lunches Chamber Mixers Chamber Travel Walk of the Stars EMERGE Palm Springs Leadership Coachella Valley Media Newsletter Signup ”PS I Love You” Magazine Shop About Us Board & Staff Contact Us JOIN TODAY! Board & Staff At the Palm Springs Chamber of Commerce, our Board of Directors is comprised of dedicated leaders from diverse industries who are committed to advancing the economic vitality of our community. Together, they provide strategic direction, foster partnerships, and advocate for policies that enhance the business climate in Palm Springs. Our professional staff works tirelessly alongside the Board to implement initiatives, organize events, and support the day-to-day needs of our members. With a passion for the city’s growth and prosperity, they provide essential services, deliver programs, and ensure that businesses have the resources they need to thrive. Together, the Board of Directors and the staff form a dynamic team focused on creating a vibrant business environment and making Palm Springs a great place to live, work, and do business. Wendy Beerbower President Eisenhower Health Kristin Bloomer Immediate Past President Angel View Kate Anderson Director Agua Caliente Band of Cahuilla Indians John Bolton Director Oak View Group / Acrisure Arena Todd Burke Director Visit Greater Palm Springs Chris Drumm Director Hall Wines Kelly McClean Director Poppy Daniel Meier Director Palm Springs International Airport Shannon Miller Director Coach Miller Julie Montante Director PSA Organica Bryan Rogers Director Boozehounds Kim Roznoski Director Grocery Outlet Scott Saunders Director Walter Clark Kelly Teo Director Parker Palm Springs Gabriel Terrado Director Lulu California Bistro Nona Watson Chief Executive Office nwatson@pschamber.org Michael Ellis Community Relations Director mellis@pschamber.org Brittne Meier Executive Assitant bwatson@pschamber.org Evan Gray Director of Programs egray@pschamber.org David White Business Development dwhite@pschamber.org Araceli Flores Administrative Assitant aflores@pschamber.org We're Social Follow Follow Resources Home Join Today Business Directory Event Calendar Stay In The Loop Newsletter Signup Get In Touch 190 West Amado Road Palm Springs, CA 92262 (760) 325-1577 info@pschamber.org Copyright © 2025 Palm Springs Chamber of Commerce. All Rights Reserved."
    },
    {
      "url": "https://business.palmcitychamber.com/event-calendar/details/clipper-cuts-ribbon-cutting-879648",
      "text": "Clipper Cuts Ribbon Cutting  - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Clipper Cuts Ribbon Cutting Back to Search Clipper Cuts Ribbon Cutting Tuesday, April 18, 2023 (12:00 PM - 1:00 PM)\r\n                        ( EDT ) Additional Info Images × Clipper Cuts 2930 SW Mapp Rd Palm City , FL 34990 United States Event Contact Missi Campbell (772) 286-8121 Send Email Tuesday, April 18, 2023 (12:00 PM - 1:00 PM)\r\n                                ( EDT ) Registered Guests 5 Registration Closed Registered Guests × Close Share × Print Email Add to Calendar Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.indiantownchamber.com/member/detail/id/251/pid/7/letter/P",
      "text": "Indiantown Chamber of Commerce - Members by Company - Palm City Chamber of Commerce 772.597.2184 Member List Eat Stay Work Play Join Us Area Map Contact Us MEMBERS 772.597.2184 Online Store My Account Login View Cart (0 items) Follow Us Facebook Twitter A A A Top > Member Directory > By Company > Palm City Chamber of Commerce Palm City Chamber of Commerce Non-Profit/Civic Organization Chamber of Commerce Campbell, Missi - Executive Director Palm City Chamber of Commerce 2701 SW Cornell Ave Palm City , FL 34990 p. work 772-286-8121 c. cell f. fax 772-286-3331 e. missi@palmcitychamber.com missi@palmcitychamber.com w. www.palmcitychamber.com http://www.palmcitychamber.com Keywords: Description: « Return to Membership List Top Home About Us Indiantown Chamber PRCA 2025 Rodeo Monthly Networking Events Calendar Board of Directors Become a Member Become A Member Member Login Meet Our New Members! Meet our Trustees! Member Directory All Members By Company By Category By Person New Members Attractions DuPuis Management Area Eat Stay CMS Sign In 16656 SW Warfield Blvd., Indiantown, FL 34956   |   772.597.2184 copyright © 2025 Indiantown Chamber of Commerce. All Rights Reserved."
    },
    {
      "url": "https://www.palmcitychamber.com/our-team/",
      "text": "Our Team - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Our Team Liz Ciampi Executive Director liz@palmcitychamber.com Christiana Masterson Marketing and Sales Director Christiana@palmcitychamber.com Hours of Operation: Monday-Thursday 9am-4pm Friday 9am- 12pm Email: info@palmcitychamber.com Phone: 772.286.8121 Address: 2701 SW Cornell Avenue, Palm City, FL 34990 © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.palmcitychamber.com/presidents-message/",
      "text": "President's Message - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application President’s Message 2022 President of the Palm City Chamber of Commerce Christina Franco JUNE Your Palm City Chamber welcomes you, to an active Summer in 2022! We want to share some helpful tips to make your summer cool and full of tripsâ¦ to your local businesses in the county that offer services in the bounty. So stay cool and donât be a fool. Call your local AC tech before you drool. Stay hydrated by drinking lots And call your local landscapers if you need new flowers and pots. Stay protected by applying your sunscreen And if a hurricane comes, reach out for a new porch screen. Remember to be kind to one another this summer. And may Summer 2022 be anything but a bummer! Letâs all be sure to follow the Six Pillars of Character as outlined by Character Counts! The Six Pillars of Character The Six Pillars of Character are the core ethical values ofÂ CHARACTER COUNTS! Â These values were identified by a nonpartisan, secular group of youth development experts in 1992 as core ethical values that transcend cultural, religious, and socioeconomic differences. The Six Pillars of CharacterÂ are trustworthiness, respect, responsibility, fairness, caring, and citizenship. We recommend using the Pillars in your character education or SEL initiative in this specific order and using the acronymÂ âT.R.R.F.C.C.â Â (terrific). Each of the Six Pillars of Character help instill a positive school climate and a culture of kindness, making schools a safe environment for students to learn. TRUSTWORTHINESS Be honest. Donât deceive, cheat, or steal. Have integrity. Do what you say youâll do. Keep your promises. Be loyal. Stand by your values. RESPECT Follow the Golden Rule. Be accepting of differences. Be courteous to others. Deal peacefully with anger, insults, and disagreements. Be considerate of othersâ feelings. RESPONSIBILITY Do what you are supposed to do. Try your best. Keep on trying. Be self-disciplined. Think before you act. Consider the consequences. Be accountable for your words, actions, and attitudes. FAIRNESS Play by the rules. Take turns and share. Be open-minded. Listen to others. Donât take advantage of others. CARING Be kind. Be compassionate. Express gratitude. Forgive others. CITIZENSHIP Do your share to make your home, school, and community better. Stay informed. Vote. Be a good neighbor. Make choices that protect the safety and rights of others. Protect the environment. MAY Happy Spring from your Palm City Chamber!Â  April has been a busy month!! On April 8th,Â our Palm City Chamber Board of Directors, Ambassadors and Presidentâs Council members were invited to \"ride the rails\" with Brightline. We had the opportunity to board the train in West Palm Beach and ride Brightline down to Miami.Â  Once we arrived in Miami, we were given a tour of their corporate office and watched a presentation about the future of Brightline. We had a nice lunch and then headed back to Palm Beach and Palm City.Â Â  The ride on the train was smooth, quiet, and very clean. Palm City Chamber of Commerce was invited to patriciate in Elevate Hopeâs Lip Sync Battle on April 30 th Â at Lyric Theatre.Â  The seats were sold out and this President is scared! Â We have a wonderful line up of songs and our dancers Missi, Nikki Leserra with Sky is the Limit, Megan Shirey from Ocean Republic Brewing and our guy's David Bradford with Edward Jones and Tyson Waters, with Fox McCluskey Bush Robison are ready to roll!Â Â  We were happy to support this great local community organization. Welcome to our new members- Wiz Home Services/Treasure Coast Auto Spa/Birgit Ager with Coldwell Banker Realty/Aanya's Boutique/Design Construction Management Group, LLC. We are thrilled for you to join our Palm City Chamber of Commerce look forward to meeting you all. The Palm City chamber of Commerce is #YourCommunityChamber so please reach out to us for any of your business needs. APRIL Spring has Sprung at the Palm City Chamber of Commerce! So, hop on over to some of our wonderful events planned for the Spring. April 14 th is a Business After Hours at the Hope Center for Autism.Â  We are having a Lunch and Learn sponsored by Carolyn and Les Leibowitz with Cruise Planners on April 19 th at Maneroâs.Â  They can help you plan your dream vacation on land or sea.Â  April 27 th is our Networking Breakfast sponsored by White Glove Moving and Storage and Aycock Funeral Home at Monarch Country Club. Our 27 th Â Annual Golf Tournament is happening on Friday, May 6, 2022, at the fabulous championship course at Piperâs Landing Yacht and Country Club.Â  Registration is at 8AM with a shotgun start at 9AM.Â  The theme for the tournament is Cinco de Mayo so be prepared to enjoy margaritas, Jell-O shots, and pinatas.Â  There will be a silent auction, prizes, breakfast, lunch and treats along the course.Â  Call the Chamber at 772-286-8121 to register your foursome. We are excited to announce that our membership has been growing in leaps and bounds. Thank you to our wonderful office team ofÂ Missi, Nikki, and Liz. Â We have gained 18 new members so far this year.Â  Keep up with these new members and other fun videos on our Facebook page.Â  Please watch and share our videos so that we can keep our momentum going! If you know of someone who would like to join the Palm City Chamber, please have them call the office or visit our website at www.palmcitychamber.com Â  Â One of our friendly and knowledgeable staff members will be happy to explain all the benefits of our #CommunityChamber. Hoppy Spring!!! MARCH 2022 I want to thank EVERYONE for this amazing opportunity to serve as President of the Palm City Chamber of Commerce.Â  It is an honor and privilege to serve the business community in this capacity. I am so excited to have your trust in doing so. I want to thank Missi, Nikki and Liz for being the best group of women to lead this Chamber over this past year. We cannot wait for the new events and fun you have to share for the upcoming year!Â  Â Â We are grateful for your dedication and love for our Palm City Chamber of Commerce and our community. Thank you for making us the Chamber of Commerce that local businesses want to be part of.Â  I also want to send a big thank you to Tyson Waters, our Immediate Past President, for his leadership this past year. Tyson was also a great mentor, every time I said I couldnât do this he said, âYes and you will be greatâ. Â For that I thank you, Tyson. On February 5 th , the Palm City Chamber of Commerce held its 43rd Annual Installation Gala. The theme for this yearâs gala was a Salute to Service where we celebrated the 100 th Birthday of World War II Veteran Seymour Hoffman. Missi had arranged for an American flag to be flown over the Capitol to celebrate Seymourâs birthday. The flag was presented to him at the gala by Representative John Snyder and Commissioner Ed Ciampi. We had everyone dressed in red, white and blue which added the final touches to the wonderful event. Senator Gayle Harrell swore in the 2022 Board of Directors. As I mentioned in my speech, we are a great organization striving to do great things for our community. Keep and eye on our Palm City Chamber website, Facebook page and emails. We have exciting events in the weeks and months to come. I encourage you to get involved with the Chamber! We can help you and your business grow.Â  In addition to our monthly breakfasts, after hours and ribbon cuttings, the Palm City Chamber of Commerce continues to create opportunities for our local businesses to network and promote themselves. We are here for you and your business, big or small. The Palm City Chamber of Commerce is a great resource for you and your company. As we look forward to 2022, we will keep the focus on our community and its needs. This is why we are #YourCommunityChamber! January  2022 January started off with a bang at the Palm City Chamber of Commerce.Â  Literally.Â  Last month the Palm City Chamber of Commerce hosted the 2 nd Annual Clay Shoot at the South Florida Shooting Grounds. It was an exciting, and loud, day.Â  Many thanks to all of our participants and sponsors.Â  The Clay Shoot was followed by an enjoyable monthly breakfast at the Rockin H Ranch.Â  We also started the year with a couple of Business After Hours events.Â  If your company has not hosted or sponsored a Business After Hours, I would encourage you to contact Missi Campbell to get more information about how your business can participate.Â  These after hour events are a great way to introduce, or reintroduce, your company to a large group of active business leaders. As we start the month of February, it is hard to believe that my year as President of the Palm City Chamber of Commerce is coming to an end.Â  I am excited about the leadership, energy and enthusiasm our incoming President brings, but saddened to know that my time serving you and the Chamber as President is over.Â  First and foremost, I want to say thank you.Â  Thank you to Missi Campbell, our incredible Executive Director, for all that you do for the Chamber and our business community.Â  As a Chamber member we all know you do a lot, but this past year as President I have had the privilege of working by your side and seeing all that you do behind the scenes. Â You are a brilliant, special person and we, as a Chamber, are so very lucky to have you.Â  Thank you also to Nikki and Liz.Â  Your energy and endless effort make such a difference for what the Chamber can offer our members.Â  Thank you to our Board of Directors for the commitment and willingness to serve.Â  This Chamber is what it is because of your commitment.Â  And thank you to all of our members, for the Chamber exists because of and for you.Â  Over this past year I have had the pleasure of meeting and spending time with many of you.Â  For that I am forever grateful. I have stressed over this past year that the Palm City Chamber of Commerce is your âCommunity Chamber.âÂ  Attending so many events, talking with so many people and learning so much about our local businesses, this message has been reinforced time and time again.Â  We are stronger together.Â  We are better when we support each other.Â  Thank you for this past year and I look forward to the years ahead and your Palm City Chamber of Commerce leading the way. December Happy New Year! If you are like me, and like many others, as we say goodbye to 2021 and hello to 2022, we make our annual New Yearâs resolutions.Â  Resolutions for both personal growth and business success.Â  Personally, we make resolutions that we will exercise more frequently (or at all), we will eat healthier, along a long list of other goals.Â  Professionally, our resolutions may be to work less, be more productive, make more money or grow our client and customer base (at least one resolution should also be to join or become even more active in your Palm City Chamber of Commerce!).Â  And if you are like me, within a month, a week, or sometimes even a few hours, those great intentions and wonderful resolutions are forgotten or breached. As I contemplated this yearâs resolutions, I was struck by some words that I recently heard.Â  Last month I attended the Education Foundation of Martin Countyâs Teacher of the Year event.Â  A great event each year to celebrate the teachers of the year from each school and to award the Elementary School Teacher of the Year, the Middle School Teacher of the Year, the High School Teacher of the Year, and the Martin County teacher of the year.Â  At this yearâs event, the State of Florida Teacher of the Year for 2020-2021 was the guest speaker.Â  A very impressive individual, she spoke about some of the struggles that she had during the past couple of years and coping with Covid restrictions, restrictions that had an emotional effect on both her and her students.Â  She explained how frustrated she would get as technology failed and students struggled.Â  Her frustration at times ended up being directed at her students.Â  One day, as technology failed her and her students again, with frustration and anger rising to the surface, one of her students questioned what was wrong, and wisely told her that she needed to take a deep breath and âfind joy.â Find joy .Â  The words stuck with her for the rest of the year and became her and her classâs motto.Â Find joy .Â  Those words also struck all of us listening to her at the event.Â  And now, as we enter 2022, those words remain with me. In addition to those resolutions, we always make each year, I would encourage you to make one additional resolution this year: Find joy .Â  Find joy with your friends and family.Â  Find joy in raising two teenagers, and the roller coaster of attitudes and odd looks you get from them (yes this is a personal one).Â  Find joy in your business, your co-workers and your clients and customers.Â  Our professional lives are often trying as we address unexpected issues almost every day. We struggle to meet expectations and demands (and yes, another personal one).Â  We began to lose sight of who we are and why we do what we do.Â  When this happens, slow down, look around, and find joy in all the other things that you do that make such a difference on so many others. Find joy in 2022 .Â  And find joy in the Palm City Chamber of Commerce.Â  We are here for you, no matter the need or issue.Â  Missi, Nikki and Liz work tirelessly each day to bring our members more information, opportunities and events.Â  Your Board of Directors is dedicated to improving what the Chamber can do for our members.Â  The Palm City Chamber of Commerce is your Community Chamber.Â  Find joy in the future of Palm City, Martin County, and all of you. Happy New Year and cheers to lasting resolutions! November Though we should be doing it much more often, November is the month we often slow down and think about what we are thankful for.Â  For me, number one on the list is always this easiest: I am so very thankful for my wonderful wife and two incredible children.Â  I am fortunate to be a part of such a loving and caring family.Â  I am also very thankful to have the opportunity to serve as the President of the Palm City Chamber of Commerce.Â  Working with Missi, Nikki and the Board of Directors on an almost daily basis has been a wonderful experience.Â  As President, I have attended more events than ever and realize what a great membership we have in this Chamber.Â  We live in such a terrific community and being active in the Palm City Chamber of Commerce has allowed me to see all the incredible business leaders we have here.Â  Though I have many, many more Chamber members I want to meet and talk with, the new relationships I have developed over these past few months will last long after my Presidency ends. As we get closer to the end of the year, your Chamber of Commerce is as active as ever.Â  In October we held the first annual Boos and Brews event at Charlie Leighton Park.Â  Thank you for all who attended (and a special thanks to those that also dressed up).Â  Our very own Speak Life End Bullying non-profit (located right here in Palm City) had a sneak peek viewing of its new anti-bullying video, which allowed Martin County residents the opportunity to get a first look at the new movie they produced, which will soon be released nationwide.Â  If you do not know about Speak Life End Bullying and its campaign, please visit their website .Â  They do, and will continue, to make such an impactful difference on our youth.Â  We should all be thankful for their efforts. We also had the second annual Veterans Memorial Bridge 5K , which allows us all to say a very, very special thank you to all of those men and women that have served this great country of ours over the years.Â  Moving forward, be on the look out for information on the Holiday Village celebration at Town Center on Mapp Road. The event is scheduled for December 1 st and will be a fun way to kick off the holiday season. Thank you for all that you have done as part of the Palm City Chamber of Commerce.Â  We are your community Chamber and would not be here without your support and involvement. October Exciting, active times, at the Palm City Chamber of Commerce. We celebrated the grand opening of the Mapp Road and Palm City Community Redevelopment Area improvements in August and continue to be excited about the improvements and expectations for whatâs ahead. Stay tuned as we hope to get new projects off the ground and moving in the CRA. Thank you to Commissioner Ed Ciampi, Martin County staff and Sunshine Land Design for all the work in getting the project completed. We are also excited to prepare for and announce the first Annual Brews and Boos event. Friday night, October 22nd, we will have beer tastings, food trucks, music and lots of fun. Please visit the Palm City Chamber website or check out our Facebook page for more information. Sponsorships are still available, but you need to hurry before the opportunity has passed. Please also mark on your calendar the Palm City Chamber of Commerce Veterans Memorial Bridge 5K run (and walk) . We had an incredible turnout last year and expect an even bigger event this time. The run will start at Jock Leighton Park and continue over the Veterans Memorial Bridge. We are planning on some very special attendees, so whether you run or not please plan on attending to celebrate our veterans on that very special day. Your Palm City Chamber of Commerce is busy this month so please visit our website so you can stay up to date on all the events we have lined up in the weeks and months ahead. I have said it before and will always believe it, you get from the Chamber what you put into the Chamber. These events are for you and an opportunity for you to grow and learn. And remember, we are your community Chamber and are here for you whenever you need us, for whatever reason. Be safe! SeptemberÂ One step closer to fall and cooler weather (well cooler weather somewhere!).Â  Having thought we had moved on from Covid concerns, or at least reduced those concerns, we are now once again faced with wearing masks when out and about and last month confronted with sending our children back to school, with or without a mask requirement.Â  As we encountered last year around the same time, the decision to wear or not wear mask often results in heated discussions and strong beliefs one way or the other.Â  We have seen these emotional responses across the nation, within the state and our County.Â  Those that know me well know my feelings and past requests for respectful discussions, whether with the idea of having a cup of coffee with someone whose opinions may differ from you or just a simple statement on thinking before we speak.Â  With what has occurred recently, and with anticipation that emotions may remain high in the weeks and months ahead, I wanted to use this monthâs article to republish the Chamberâs statement on civility that we prepared and issued around this time last year.Â  Please read.Â  We are a small community, but a strong and vocal one.Â  We must slow down and give all others the same level of respect we desire to be given to ourselves.Â  It is okay to disagree and in fact that is what makes us stronger and better.Â  Even if you donât agree with another person, slow down and take the time to listen and try to understand why they believe and feel the way they do.Â  You may likely still not agree with them, but you at least will hopefully appreciate their feelings.Â  This remains true for your neighbors, for strangers and especially our local officials.Â  If you find yourself on the other side of a discussion with someone, take a deep breath and before posting something on social media, writing an angry letter or providing public comment at a meeting, give that person a call, take the time to sit down with them (and yes have a cup of coffee or a beer with them) and just listen.Â  You will be amazed at the difference it will make. I would love to be your first call to have a cup of coffee (or beer) with!Â  We are your Community Chamber and are always Keepinâ It PC. July 2020 Civility â a formal politeness and courtesy in behavior and speech.Â  As we struggle our way through the Covid-19 pandemic, the resulting regulations, mandates and closures, and in anticipation of local, state and federal elections in the coming months, we must never forget this word, its meaning and the underlying principles.Â  We must never forget we are but one community, one state and one country.Â  We, as individuals and as the Palm City Chamber of Commerce, cherish our rights of free speech and the value of honest debate and discussion.Â  But as we debate and discuss the issues that confront us, and the tough decisions that follow, we must always demonstrate civility, and respect, especially to those that may disagree with us and to those we have placed in charge to govern.Â  We must appreciate differing views and opinions, even if we donât agree with them.Â  We must listen.Â  The next time you make public comment at a Commission or Board meeting, the next time you go to post a message on social media, or even the next time you debate a neighbor, friend or stranger, slow down, think about the words you are about to say and the actions to come.Â  Think of these words.Â  CIVILITY.Â  RESPECT.Â  Embrace them.Â  Too many in our community, our state and in our country have lost sight of the basic principles.Â  If you will not uphold and honor these words in your actions, why should others.Â  Why should our leaders?Â  Why should our teachers?Â  Why should our children!Â  Change starts with you.Â  Change starts with us.Â  Change starts with our community.Â  Let us appreciate each other and our differing views and opinions, without name calling, demeaning rhetoric or, even worse, hate filled speech.Â  We, as the Palm City Chamber of Commerce, as leaders of the community, and as your neighbors and friends, take the pledge to do so.Â  As we work our way through these difficult and trying times, let us respect our differences.Â  Let us be civil in our words, actions and deeds.Â  The time is now.Â  We, as individuals and as a community-oriented Chamber of Commerce, will demand this of our leaders and of those that exercise their rights of free speech and public comment.Â  Please, let us all practice civility. © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://business.palmcitychamber.com/event-calendar/Details/business-after-hours-ribbon-cutting-for-aanya-boutique-633059?sourceTypeId=Website",
      "text": "Business After Hours/Ribbon Cutting for Aanya Boutique  - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Business After Hours/Ribbon Cutting for Aanya Boutique Back to Search Business After Hours/Ribbon Cutting for Aanya Boutique Tuesday, April 26, 2022 (5:30 PM - 7:00 PM)\r\n                        ( EDT ) Additional Info Images × 1129 SW Martin Downs Blvd. Palm City , FL 34990 United States Event Contact Missi Campbell (772) 286-8121 Send Email Tuesday, April 26, 2022 (5:30 PM - 7:00 PM)\r\n                                ( EDT ) Registered Guests 19 Registration Closed Registered Guests × Close Share × Print Email Add to Calendar Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.webwonders.nl/en/contact/",
      "text": "Contact webwonders: your partner for digital solutions Skip to content Solutions Umbraco HubSpot Job Vacancies 1 Menu ▾ Nederlands Contact Umbraco HubSpot Cases Solutions Solutions Digital strategy Understanding your customer Technology in order Making an impact online Job Vacancies 1 Our services Way of working About us Contact Nederlands Contact with Webwonders Let's hear it! Any questions? Find out if our approach suits your business? Leave your details or fill in the form on this page. We will contact you as soon as possible. Webwonders B.V. Klokgebouw 262 5617AC Eindhoven Email. info@webwonders.nl Tel: 040 82 00 393 KVK 71255060 All our offers and agreements are subject to the NL Digital Conditions, which are filed with the Chamber of Commerce Central Netherlands under number 30174840. Download the NLdigital terms and conditions here Don't feel like waiting? Schedule a meeting in the Webwonders agenda! Want to know how Webwonders can help you? Then book an introductory meeting in our calendar right away. View the agenda How to Get to Webwonders? Public transport Coming by train? The Klokgebouw is adjacent to Strijp-S station. By bus, take line 401, 402 or 403 and get off at the Strijp-S stop. By car Navigate to Strijp-S. There are several parking facilities on site, you can find them here. In front of the door are paid parking spaces on the road, some of which have the option of charging your car. By bike We have a secured bicycle storage where your bike can stay warm and dry. Just give us a call when you arrive, and we'll open the door for you. Klokgebouw 262 Eindhoven Phone. 040 82 00 393 E-mail. info@webwonders.nl Our services Cases About Webwonders Blogs Privacy statement Contact Sitemap"
    },
    {
      "url": "https://business.stuartmartinchamber.org/members/member/palm-city-chamber-of-commerce-4558",
      "text": "Palm City Chamber of Commerce | Non Profit and Community Organizations | CHAMBERS OF COMMERCE Skip to content --°F Member Login Join Chamber The Chamber Close The Chamber Open The Chamber About Us President’s Report Membership Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship Vubiz Trains Events & News Close Events & News Open Events & News Upcoming Events Chamber Calendar Community Calendar Chamber Event Flyers Latest News Chamber & Member News Online Compass Florida Chamber News Legislative Updates Photo Galleries Breakfasts Luncheons Business After Hours Annual Expos Holiday Trade Show Installation of Officers LEADERship Ribbon Cuttings Golf Tournaments Special Events Business Close Business Open Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Close Tourism Open Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Close Relocation Open Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide The Digital Times Recreation Close Recreation Open Recreation Things to Do Boating Diving and Snorkeling Golf Courses Beaches and Parks Fish & Hunt Fishing Report Sailfish Tournaments Fishing Guide Palm City Chamber of Commerce Categories Non Profit and Community Organizations CHAMBERS OF COMMERCE 3168 S.W. Martin Downs Blvd. Palm City FL 34990 (772) 286-8121 www.palmcitychamber.com Rep/Contact Info Ms. Liz Ciampi × Close Ms. Liz Ciampi Executive Director Send an Email Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Connect with us 1650 S Kanner Highway Stuart, FL 34994 772-287-1088 x111 info@stuartmartinchamber.org Facebook-f Twitter Youtube Linkedin-in Chamber Info Join The Chamber Member Search Member Benefits President's Report Contact The Chamber Privacy Policy News & Events Online Compass Member News Chamber Calendar Community Calendar Non-Profit Events Health Resources Newsletter Enter your email, subscribe to our newsletter and stay informed! Subscription Form Newsletter First Name Last Name Subscribe © 2025 STUART/MARTIN COUNTY CHAMBER OF COMMERCE. ALL RIGHTS RESERVED. Member Login Join Chamber The Chamber About Us President’s Report Member Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship VUBIZ Trains Events & News Chamber Calendar Community Calendar Photo Gallery Member News Chamber Event Flyers Online Compass Florida Chamber News Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide Recreation Boating Fishing and Hunting Fishing Report Sailfish Tournaments Fishing Guide Diving and Snorkeling Golf Courses Beaches and Parks Facebook-f Twitter Youtube Linkedin-in Search"
    },
    {
      "url": "https://www.palmcitychamber.com/ambassadors/",
      "text": "Ambassadors - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Ambassadors Chamber Ambassadors help represent the Palm City Chamber of Commerce by volunteering on welcome committees, helping with membership campaigns and act as public relations liaisons related to networking/social events sponsored by the chamber. Our Ambassadors committee is constructed of local business owners, managers, and executives. For more information on how you can become a Palm City Chamber Ambassador, contact Liz Ciampi at Liz@palmcitychamber.com Christina McIntosh Chair Independent Director, Pampered Chef ââWebsite Mandi Roe RE/MAX of Stuart- Palm City Location Website Cher Fisher Family Promise of Martin County ââWebsite Lesley Vestrich Kane Center ââWebsite Allison Prause Palm City Eye Care Dawn Smith First Southern Bank Mary Eagle Rockin' H Ranch Les Leibowitz Cruise Planners âWebsite Lisa Vasquez Seacoast National Bank âWebsite Amy Ondrovic First Southern Bank Kelly Moore Engel and Volkers Josh Coker Rockin' H Ranch © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://business.palmbeaches.org/contact",
      "text": "Contact Us - Chamber of Commerce of the Palm Beaches. Contact Us. Join Us Member Login Membership Member Benefits Membership Levels Sponsorship Packages Advertising Opportunities Chamber Trustees New Member Signup Events Chamber Event Calendar Signature Events Power Networking After-Hours Community Calendar About Board of Directors Chamber Staff Purpose PBC Built Campaign Brand Standards Contact Programs Chamber Committees Ambassadors Women’s Leadership YPOP Leadership West Palm Beach Chamber Trustees Seminars & Workshops Executive Mentorship Newsroom Chamber News Business Watch Photo Gallery Join Newsletter Resources Business Directory Chamber Guide Ribbon Cuttings Advocacy Government Affairs Leadership PAC Member Board Community Calendar Press Releases Job Board Exclusive Deals Member Login Visit Chamber Calendar Signature Events Chamber News Newsroom August 13, 2025 Chamber Launches New Signature... All News Amplify your reach. Join the Chamber today! About Contact Us Have a question, comment, or something you’d like to discuss? Use the form below to get in touch with our team. We review every message carefully and aim to respond promptly with thoughtful, helpful answers. Contact Us Send us your questions or comments using the form below. We will respond promptly to your inquiry. Contact Information * Required field Name * Looks good! Please add your name. Organization Mailing Address * Looks good! Please add your mailing address. Mailing Address line 2 City * Looks good! Please add your City State * Looks good! Please add your State Postal Code * Looks good! Please add your Postal Code Country * Choose... Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Belgium Belize Bermuda Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Bulgaria Cambodia Cameroon Canada Caribbean Chile China Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czechia Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Ghana Greece Greenland Guatemala Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Laos Latin America Latvia Liechtenstein Lithuania Luxembourg Macao SAR Macedonia, FYRO Malaysia Maldives Mali Malta Mexico Moldova Monaco Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa Spain Sri Lanka Sweden Switzerland Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Türkiye Turkmenistan Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Venezuela Vietnam World Yemen Looks good! Please add your country. Phone * Looks good! Please add your phone number. Email * Looks good! Please add a valid email. Leave Blank Contact Preference * Choose... Phone Email Mail Looks good! Please select a contact preference. Comments/Questions Release this information The Chamber of Commerce of the Palm Beaches will not sell your contact or email information. In order to serve your request, our office shares information with chamber member businesses who can provide you with additional information. Please indicate below if we may share your request for information: Yes, you may release this information. No, please do not release this information. Captcha Validation Please complete the Captcha Submit form Chamber of Commerce of the Palm Beaches 401 North Flagler Drive West Palm Beach, FL 33401 (561) 833-3711 Fax: (561) 833-5582 Chamber@PalmBeaches.org Built for Business Sign up for news, events, and more. Subscribe 401 North Flagler Drive West Palm Beach, FL 33401 chamber@palmbeaches.org 561.833.3711 Facebook X-twitter Youtube Linkedin Instagram © 2025 Chamber of Commerce of the Palm Beaches.  All Rights Reserved. Privacy Policy Sitemap Join Our Newsletter Join Our Email List Email (required) * First Name Last Name Select list(s) to subscribe to Chamber Update Example: Yes, I would like to receive emails from CCPB. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: . You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact Heading Sub heading List items Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum. Ribbon Cuttings Preparation Ribbon Cutting time availabilities Monday- Thursday 9:00a.m, 12:00a.m. or 5:30p.m. at host location or area location. (Palm Beach County, FL) 1st Friday of the month 1:00p.m. after the Ambassador meeting. Pictures are always better with a banner, or sign and designated area to set up for photography. Identify the best place for the picture in advance to ensure a smooth event. The Chamber of Commerce Membership Services Associate will arrive 20 minutes before the start of the event with a camera, ribbon, and scissors. They will assist in choosing the best position for the photo, if necessary. The person selected to cut the ribbon will be directed and assisted as to where to stand during the picture and how to handle the scissors. Ambassadors of the Chamber of Commerce will hold the ribbon as the ribbon is cut. Ambassadors meet and greet your guests. Photographer will prompt you when to cut the ribbon, after several photos taken of the group are posed and ready. We look forward to a great event! Possible Participants: The Chamber Ambassadors can be invited to participate. Additional committees can be included as appropriate. Company staff including owner, CEO, CFO, COO, management, staff and invited guests. Food/Refreshments- Optional. Your event will be better attended with refreshment provided. The food preference and the theme for your Ribbon Cutting Ceremony is entirely up to you. Photos will be placed on the Chamber website, launched on the Chamber’s social media platforms and forwarded to the Ribbon Cutting host. For the Membership Services Associate: Please state if there are any special driving instructions, parking instructions, and if there are any special requests. Please submit the Ribbon Cutting Request Form one month in advance. Ribbon Cutting Request Form"
    },
    {
      "url": "https://leadiq.com/c/palm-city-chamber-of-commerce/5a1ddddf2300005400ed5b32/email-format",
      "text": "Palm City Chamber of Commerce Email Formats & Email Address Examples | LeadIQ Learn more at LeadIQ.com Start free Most Common Email Formats at Palm City Chamber of Commerce The most accurate and popular Palm City Chamber of Commerce 's email format is  (ex. ). Palm City Chamber of Commerce also uses as email structures. Palm City Chamber of Commerce uses up to 1 different email patterns. Palm City Chamber of Commerce Email Formats Example Percentage First@palmcitychamber.com John@palmcitychamber.com 42% FLast@palmcitychamber.com JDoe@palmcitychamber.com 8% Last@palmcitychamber.com Doe@palmcitychamber.com 8% First@palmcitychamber.com John@palmcitychamber.com 42% Frequently Asked Questions What does Palm City Chamber of Commerce do? Palm City Chamber of Commerce was founded in 1983 . The company's main headquarters is located in 2701 SW Cornell Ave, Palm City, Florida 34990, US operates in the Civic and Social Organizations industry , along with similar companies like Stuart/Martin County Chamber of Commerce . You can visit palmcitychamber.com . Explore Palm City Chamber of Commerce 's company overview page for more information. What is Palm City Chamber of Commerce 's email address format? Palm City Chamber of Commerce 's email format typically follows the pattern of First@palmcitychamber.com; this email format is used 42% of the time. Other contacts within LeadIQ's database had email formats such as FLast@palmcitychamber.com Last@palmcitychamber.com . Looking for more contact data? Unlock accurate emails and phone numbers from millions of profiles verified in real-time. How many employees does Palm City Chamber of Commerce have currently? Palm City Chamber of Commerce has approximately 6 employees as of 1983 . Key team members to contact include President: L. H. Executive Director: C. D. Executive Director: C. D. . For more team information and contact data, explore Palm City Chamber of Commerce 's employee directory with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Palm City Chamber of Commerce Email Format Civic and Social Organizations United States 2-10 Employees Our Mission is to serve as the principal advocate of the community and its businesses, acting as the catalyst in promoting the economic development of the Palm City area, stimulating jobs and improving the quality of life. Sign up for free to view info Company overview Employee directory Verify Palm City Chamber of Commerce email addresses Verify Email Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://www.pbnchamber.com/",
      "text": "Home - Palm Beach North Chamber of Commerce Skip to content Member Login About About the Chamber Board of Directors Strategic Plan Annual Report Committees & Councils Ambassadors Economic Development Committee Sustainability Sub-Committee of the Economic Development Committee Education Committee Government Affairs Committee Healthcare & Life Science Committee Women in Business Council Veterans Business Coalition Young Professionals of Palm Beach North Our Staff Palm Beach North Podcast Brand Standards Advocacy Get Involved Federal, State and Local Government Links Legislative Agenda NorthPAC Palm Beach North Education Foundation Resources Business Directory Hot Deals Job Postings Member News Publications Local Business Center Internships Florida SBDC at FAU Membership Join as a Member Member Login Member Directory Member Benefits Executive Trustee Council Commerce & Culture Events Event Calendars Chamber Calendar Community Calendar Premier Events ArtiGras Fine Arts Festival, Presented by Tampa General Hospital Tampa General Hospital Loggerhead Triathlon ArtFest by the Sea at Juno Beach, Presented by the Palm Beach Gardens Medical Center Chamber Events Overview Annual Awards WIBC Mentorship Academy Volunteer Opportunities Commerce & Culture Contact Contact Us Submit News & Events Requests Ribbon Cutting Request Member Mailing List Request for Proposal Loggerhead Triathlon Join About About the Chamber Board of Directors Strategic Plan Annual Report Committees & Councils Publications Our Staff Palm Beach North Podcast Brand Standards Events Event Calendars Premier Events Chamber Events Overview Annual Awards WIBC Mentorship Academy Volunteer Opportunities Commerce & Culture Resources Business Directory Hot Deals Job Postings Member News Publications Internships Florida SBDC at FAU Membership Join as a Member Member Login Member Directory Member Benefits Hot Deals Job Postings Member News Executive Trustee Council Commerce & Culture Advocacy Get Involved Federal, State and Local Government Links Legislative Agenda Palm Beach North Education Foundation NorthPAC Contact Contact Us Submit News and Events Requests Loggerhead Triathlon × About About the Chamber Board of Directors Strategic Plan Annual Report Committees & Councils Publications Our Staff Palm Beach North Podcast Brand Standards Events Event Calendars Premier Events Chamber Events Overview Annual Awards WIBC Mentorship Academy Volunteer Opportunities Commerce & Culture Resources Business Directory Hot Deals Job Postings Member News Publications Internships Florida SBDC at FAU Membership Join as a Member Member Login Member Directory Member Benefits Hot Deals Job Postings Member News Executive Trustee Council Commerce & Culture Advocacy Get Involved Federal, State and Local Government Links Legislative Agenda Palm Beach North Education Foundation NorthPAC Contact Contact Us Submit News and Events Requests Loggerhead Triathlon Building a Prosperous Community Building a Prosperous Community Our shared purpose is to foster a partnership of private, public, education, and civic organizations working together to ensure Palm Beach North is Florida's \"Prosperity Coast.\" Our shared purpose is to foster a partnership of private, public, education, and civic organizations working together to ensure Palm Beach North is Florida's \"Prosperity Coast.\" Become a Member Palm Beach North Podcast Watch Now In this episode of the Palm Beach North Podcast, Cressman Bronson, South Florida EVP & President at PNC Bank , shares his journey from a humble upbringing and early sports career to leading one of the most influential banking institutions in Florida. He opens up about the life lessons that shaped his leadership style, the pivotal role his family has played in his success, and his commitment to making a meaningful impact on the community. Cressman discusses PNC Bank’s growth story in Florida, the importance of building strong partnerships, and why early childhood education has become a cornerstone of the bank’s philanthropic efforts. He also provides valuable advice for business owners on creating sustainable success, staying grounded during uncertainty, and embracing community engagement as a driver of long-term impact. 2024-2025 Annual Report View Our Annual Report Upcoming Chamber Events September 12, 2025 (CONNECT) Successful Business Strategies: Chamber 201 Welcome to the NEW Small Business Seminar and Step 2 in the New Member Learn. Connect. Grow.&n... More Details September 12, 2025 Chamber Government Affairs Committee Meeting The Chamber's Government Affairs Committee Meeting. Open to all members. This committee informs ... More Details September 19, 2025 Power Networking Join The Palm Beach North Chamber of Commerce's Ambassador Committee for our Power Networking e... More Details Event Calendar Palm Beach North School Needs Do you or your business want to help support the needs of public schools in the Palm Beach North region? If so, please check out a list of local needs here . If any of these opportunities are something you or your business can help with, please reach out to Elle Harrigan, Co-Chair of the Education Committee, at eharrigan@gssef.org . Thank you for your interest in helping the schools in our community! View List of School Needs Member Businesses Member Search New Members Jupiter Christian School (EXECUTIVE TRUSTEE) Aviation Museum on the Beach, Inc. Loggy The Sweat Shoppe by Randi (Referred By: Jonathan Ozner and Mae Lozado) Justin Shulman - Young Professional Joseph Gaudet IV - Young Professional Ridgecap Roofing Sunset Slush Jupiter Lahaina Poke Co. (Referred By: Sunset Slush) Signal of South Central Florida Florida Adult Education, INC. Performance and Wellness Chiropractic (Referred By: Kevin DiLallo, Ian Crowley) JuAn C. Cocuy Wealth Advisor-JP Morgan Palm Beach Memory Care Danielle Gregoire - Young Professional SalesBountyHunter (EXECUTIVE TRUSTEE) Hometown Senior Placement (Referred By: Anne Desormier-Cartwright, Elder & Estate Planning Attorneys PA) VersaGym Palm Beach HotelPlanner Zeus Consulting Services Corporation Legacy Contracting Solutions, Inc Andrews Luther Webb Group, J.P. Morgan Wealth Management Sue Eusepi & Associates Inc Somerset Academy Avenir (Referred By: Dana Middleton) The Club at Ibis (Referred By: Taylor Smith) Driving sustainable growth and prosperity We focus on the development and retention of businesses by taking an active role in issues that affect the profitability of local companies, protecting and improving the quality of life for residents and, above all, providing superior services and resources to our members. Explore Member benefits Advertising: Post your Events and Jobs Included in your membership is the opportunity to submit your event to be published on our community calendar as well as job openings . Recurring events as well as special events are highly encouraged. Marketing: Hot Deals Advertise specials or offer coupons and special packages on our website and gain access to other exclusive member deals. Promotion: Submit News Chamber members can submit press releases and announcements in our monthly newsletter, which sees over 8,000+ business people and community members. Networking Networking at over 100 events with major savings on special pricing for member tickets, exhibitor tables and sponsorships. Advocacy Participate in over 8 committees and Councils , which facilitate conversation that lead to providing advocacy for your business with your voice. Building relationships is still the best way to build your business. Ready to get started? Become a Member We are the unified voice of business The Palm Beach North Chamber of Commerce is pleased to serve the 11 municipalities that make up Palm Beach North. Founded in 2007 as a result of a merger from two previous chambers, the Jupiter Tequesta Juno Beach Chamber of Commerce (founded in 1948) and the North Palm Beach County Chamber of Commerce (founded in 1947), the Palm Beach North Chamber of Commerce strives to be a dynamic organization that serves as a vital business and community resource. Stay in the Know MEMBER LOGIN About Events Members Advocacy Contact Join About Events Members Advocacy Contact Copyright © 2025 Palm Beach North Chamber of Commerce, all rights reserved. If you experience any issues with the website, please contact our office at 561-746-7111."
    },
    {
      "url": "https://www.palmcitychamber.com/",
      "text": "Home - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application WELCOME TO THE Palm City Chamber of Commerce Business Directory Business Directory Social Media Social Media Events Events Blog Blog Our Mission is to serve as the principal advocate of the community and its businesses, acting as the catalyst in promoting the economic development of the Palm City area, stimulating jobs and improving the quality of life. Helpful Links Connect Martin Attractions Parks Hospitality Healthcare View Directory Current Events Learn More New Members Learn More Local News Learn More Palm City Happenings Chamber Talks Check out the latest updates from our Executive Director . Check out our President's Message . Education Because of the hardworking school administrators, teachers and staff, Martin County is an A+ school district. Our area schools include the Martin County School District and Treasure Coast Classical Academy . Sponsorship Opportunities We have a variety of initiatives, programs and events to assist you in promoting your business. Learn More Community Champions © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://business.palmcitychamber.com/business-directory/Details/martin-downs-property-owners-association-inc-1712752",
      "text": "Martin Downs Property Owners Association, Inc.  - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Martin Downs Property Owners Association, Inc. Back to Search Martin Downs Property Owners Association, Inc. Categories Homeowners Associations 3501 SW Corporate Pkwy. , Palm City , FL , 34990 (772) 283-4746 mdpoa.org Share × Print Email Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://palmbeaches.org/gz/contact-us/",
      "text": "Chamber of Commerce of the Palm Beaches. Contact Us. Join Us Member Login Membership Member Benefits Membership Levels Sponsorship Packages Advertising Opportunities Chamber Trustees New Member Signup Events Chamber Event Calendar Signature Events Power Networking After-Hours Community Calendar About Board of Directors Chamber Staff Purpose PBC Built Campaign Brand Standards Contact Programs Chamber Committees Ambassadors Women’s Leadership YPOP Leadership West Palm Beach Chamber Trustees Seminars & Workshops Executive Mentorship Newsroom Chamber News Business Watch Photo Gallery Join Newsletter Resources Business Directory Chamber Guide Ribbon Cuttings Advocacy Government Affairs Leadership PAC Member Board Community Calendar Press Releases Job Board Exclusive Deals Member Login Visit Chamber Calendar Signature Events Chamber News Newsroom August 13, 2025 Chamber Launches New Signature... All News Amplify your reach. Join the Chamber today! About Contact Us Have a question, comment, or something you’d like to discuss? Use the form below to get in touch with our team. We review every message carefully and aim to respond promptly with thoughtful, helpful answers. #MICRONET_CONTENT# Built for Business Sign up for news, events, and more. Subscribe 401 North Flagler Drive West Palm Beach, FL 33401 chamber@palmbeaches.org 561.833.3711 Facebook X-twitter Youtube Linkedin Instagram © 2025 Chamber of Commerce of the Palm Beaches.  All Rights Reserved. Privacy Policy Sitemap Join Our Newsletter Join Our Email List Email (required) * First Name Last Name Select list(s) to subscribe to Chamber Update Example: Yes, I would like to receive emails from CCPB. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: . You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact Heading Sub heading List items Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum. Ribbon Cuttings Preparation Ribbon Cutting time availabilities Monday- Thursday 9:00a.m, 12:00a.m. or 5:30p.m. at host location or area location. (Palm Beach County, FL) 1st Friday of the month 1:00p.m. after the Ambassador meeting. Pictures are always better with a banner, or sign and designated area to set up for photography. Identify the best place for the picture in advance to ensure a smooth event. The Chamber of Commerce Membership Services Associate will arrive 20 minutes before the start of the event with a camera, ribbon, and scissors. They will assist in choosing the best position for the photo, if necessary. The person selected to cut the ribbon will be directed and assisted as to where to stand during the picture and how to handle the scissors. Ambassadors of the Chamber of Commerce will hold the ribbon as the ribbon is cut. Ambassadors meet and greet your guests. Photographer will prompt you when to cut the ribbon, after several photos taken of the group are posed and ready. We look forward to a great event! Possible Participants: The Chamber Ambassadors can be invited to participate. Additional committees can be included as appropriate. Company staff including owner, CEO, CFO, COO, management, staff and invited guests. Food/Refreshments- Optional. Your event will be better attended with refreshment provided. The food preference and the theme for your Ribbon Cutting Ceremony is entirely up to you. Photos will be placed on the Chamber website, launched on the Chamber’s social media platforms and forwarded to the Ribbon Cutting host. For the Membership Services Associate: Please state if there are any special driving instructions, parking instructions, and if there are any special requests. Please submit the Ribbon Cutting Request Form one month in advance. Ribbon Cutting Request Form"
    },
    {
      "url": "https://www.indiantownchamber.com/member/detail/id/251/pid/40",
      "text": "Indiantown Chamber of Commerce - All Members - Palm City Chamber of Commerce 772.597.2184 Member List Eat Stay Work Play Join Us Area Map Contact Us MEMBERS 772.597.2184 Online Store My Account Login View Cart (0 items) Follow Us Facebook Twitter A A A Top > Member Directory > All Members > Palm City Chamber of Commerce Palm City Chamber of Commerce Non-Profit/Civic Organization Chamber of Commerce Campbell, Missi - Executive Director Palm City Chamber of Commerce 2701 SW Cornell Ave Palm City , FL 34990 p. work 772-286-8121 c. cell f. fax 772-286-3331 e. missi@palmcitychamber.com missi@palmcitychamber.com w. www.palmcitychamber.com http://www.palmcitychamber.com Keywords: Description: « Return to Membership List Top Home About Us Indiantown Chamber PRCA 2025 Rodeo Monthly Networking Events Calendar Board of Directors Become a Member Become A Member Member Login Meet Our New Members! Meet our Trustees! Member Directory All Members By Company By Category By Person New Members Attractions DuPuis Management Area Eat Stay CMS Sign In 16656 SW Warfield Blvd., Indiantown, FL 34956   |   772.597.2184 copyright © 2025 Indiantown Chamber of Commerce. All Rights Reserved."
    },
    {
      "url": "https://pcfchamber.com/about/contact/",
      "text": "Contact Us  - Palm Coast-Flagler Regional Chamber of Commerce Skip to content Facebook Icon LinkedIn icon Twitter icon Instagram icon Youtube icon Member Login About About Us Advocate Educate Connect Committees Membership Why Join? Membership Levels News & Media Ask Flagler Chamber Business Report Evolve Magazine Flagler Buzz Flagler Live Flagler News Weekly Flagler Radio Palm Coast Observer About Flagler County Flagler County Tourism Flagler County Scorecard Government Sites City of Bunnell Flagler Beach Flagler County Palm Coast Town of Beverly Beach Town of Marineland Contact Us First Name Last Name Organization Title Address Line 1 Address Line 2 City State Postal Code Address Type Country United States Canada Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo Democratic Republic of Cook Islands Costa Rica Coted Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea Bissau Guyana Haiti Heard Island and Mc Donald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isleof Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea Democratic Peoples Republic Korea Republic of Kuwait Kyrgyzstan Lao Peoples Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Barthelemy Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands British Virgin Islands US Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Sark Phone Email Contact Preference Comments Send Message Palm Coast-Flagler Regional Chamber of Commerce 145 City Place Suite 300-A Palm Coast, FL 32164 (386) 283-4884 kelsie@pcfchamber.com Powered By GrowthZone © 2025 Palm Coast-Flagler Regional Chamber of Commerce | Site by GrowthZone Get In Touch! 145 City Place Suite 300A Palm Coast, FL 32164 phone icon 386-283-4884 email icon info@PCFchamber.com Additional Resources Join the Chamber Visitor Information Stay Connected! Facebook Icon LinkedIn icon Twitter icon Instagram icon Youtube icon © 2025 Palm Coast-Flagler Regional Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://pschamber.org/contact-us/",
      "text": "Contact Us | Palm Springs Chamber of Commerce Membership Join the Chamber Member Benefits Marketing Opportunities President’s Circle Business Resources Starting Your New Business About Palm Springs Community Resources Co-Working FAQs Job Board Business Directory Events & Programs List of Current Events Palm Springs United Signature Events Police and Fire Appreciation Luncheon Business Expo & Taste of Palm Springs State of the City Rock the Park Palm Springs Car Show & Festival Member Connections Ribbon Cuttings Leads Lunches Chamber Mixers Chamber Travel Walk of the Stars EMERGE Palm Springs Leadership Coachella Valley Media Newsletter Signup ”PS I Love You” Magazine Shop About Us Board & Staff Contact Us JOIN TODAY! Contact Us Discover how we can support your business growth and community involvement. Reach out to us for more information on membership and upcoming events. Contact Us 190 West Amado Rd Palm Springs, CA 92262 (760) 325-1577 info@pschamber.org Name (Required) Email Address (Required) Company Phone # How Can We Help? 7 + 4 = Submit Chamber Hours Hours: Monday          8:00 am – 4:30 pm Tuesday         8:00 am – 4:30 pm Wednesday    8:00  am – 4:30 pm Thursday        8:00 am – 4:30 pm Friday             8:00 am – 4:30 pm Saturday        CLOSED Sunday          CLOSED Please note hours may vary due to ribbon cuttings and Chamber events. Please give us a call. We're Social Follow Follow Resources Home Join Today Business Directory Event Calendar Stay In The Loop Newsletter Signup Get In Touch 190 West Amado Road Palm Springs, CA 92262 (760) 325-1577 info@pschamber.org Copyright © 2025 Palm Springs Chamber of Commerce. All Rights Reserved."
    },
    {
      "url": "https://business.palmcitychamber.com/business-directory/FindStartsWith?term=P",
      "text": "Directory  - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Business Directory Business Directory Business Directory Search Radius... 1 mi 5 mi 10 mi 50 mi 100 mi P Back to Search Results: 18 PAC Seating Systems, Inc. PAC Seating Systems, Inc. 3370 SW 42nd Ave. , Palm City , FL 34990 (772) 286-6670 Visit Website More Details Manufacturing Manufacturing Aviation Palm Beach Dermatology Group 3654 SW 30th Ave , Palm City , FL 34990 Healthcare Providers Dermatology (772) 210-7555 More Details Physician / Hospitals / Medical Centers Palm City Animal Medical Center 3090 SW Mapp Rd. , Palm City , FL 34990 (772) 283-0920 Visit Website More Details Pet Services Palm City Elementary Palm City Elementary 1951 SW 34th St. , Palm City , FL 34990 (772) 219-1565 Visit Website More Details Palm City Eye Care Palm City Eye Care 2660 SW Immanuel Dr. , Palm City , FL 34990 (772) 283-1191 Visit Website More Details Physician / Hospitals / Medical Centers Palm City Liquors Palm City Liquors 3243 SW Mapp Rd. , Palm City , FL 34990 (772) 221-0633 More Details Retail Palm City New Hope and High Hopes PreSchool Palm City New Hope and High Hopes PreSchool 3900 SW Citrus Blvd. , Palm City , FL 34990 (772) 283-8343 Visit Website More Details Houses of Worship Palm City Nursing and Rehab Center Palm City Nursing and Rehab Center 2505 SW Martin Hwy. , Palm City , FL 34990 (772) 288-0060 Visit Website More Details Palm City Pool & Spa Palm City Pool & Spa 2830 SW Mapp Rd. , Palm City , FL 34990 (772) 288-2270 Visit Website More Details Pools: Construction / Design / Repair / Supplies / Maintenance Palm City Social Palm City Social 3162 SW Martin Downs Blvd. , Palm City , FL 34990 772-254-4247 Visit Website More Details Restaurants / Hospitality Palm Cove Golf Palm Cove Golf 2363 SW Carriage Hill Terrace , Palm CIty , FL 34990 5619134653 Visit Website More Details Golf Country Clubs and Courses Pamela R Norris, M.S., CCC-SLP Pamela R Norris, M.S., CCC-SLP 3168 SW Martin Downs Blvd , Palm City , FL 34990 (772) 240-2050 Visit Website More Details Health / Fitness / Services Patty D Photography Patty D Photography 4053 SE Fairway East , Stuart , FL 34997 (732) 991-5483 Visit Website More Details Piper's Landing Yacht & Country Club Piper's Landing Yacht & Country Club 6160 SW Thistle Ter. , Palm City , FL 34990 (772) 283-7000 Visit Website More Details Golf Country Clubs and Courses Place of Hope Place of Hope 11810 SE Dixie Hwy , Hobe Sound , FL 33455 (561) 775-7195 Visit Website More Details Non-Profits Plop-Jon, Inc. Plop-Jon, Inc. 12100 SW Martin Hwy. , Palm City , FL 34990 (772) 370-0831 Visit Website More Details Sanitation Proctor Construction Company LLC Proctor Construction Company LLC 2050 US Hwy 1 , Suite 200 , Vero Beach , FL 32960 7722348164 Visit Website More Details General Memberships Project LIFT Project LIFT 1330 SW 34th St. , Palm City , FL 34990 (772) 221-2244 Visit Website More Details Non-Profits Powered By GrowthZone © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.britcham.com/committees/get-involved",
      "text": "Get in Touch | The British Chamber Of Commerce In Hong Kong Skip to main content Search Search Enter the terms you wish to search for. Check our social media on linkedin Register Login About About Us Mission, Vision & Values Code of Conduct Governance Our Team Contact Us Join Member Benefits Types of Memberships Member Offers Member Directory Events Events Events Calendar Events Archive Get in Touch Committees Our Committees Get in Touch Advocacy Overview Policy Council Expert Groups Policy Engagement Get in Touch News & Resources News Articles Doing Business in Hong Kong Chamber in the Community Get in Touch Check our social media on linkedin Login Register About About Us Mission, Vision & Values Code of Conduct Governance Our Team Contact Us Join Member Benefits Types of Memberships Member Offers Member Directory Events Events Events Calendar Events Archive Get in Touch Committees Our Committees Get in Touch Advocacy Overview Policy Council Expert Groups Policy Engagement Get in Touch News & Resources News Articles Doing Business in Hong Kong Chamber in the Community Get in Touch About About Us Mission, Vision & Values Code of Conduct Governance Our Team Contact Us Join Member Benefits Types of Memberships Member Offers Member Directory Events Events Events Calendar Events Archive Get in Touch Committees Our Committees Get in Touch Advocacy Overview Policy Council Expert Groups Policy Engagement Get in Touch News & Resources News Articles Doing Business in Hong Kong Chamber in the Community Get in Touch Home get involved Get in Touch Roberta Hamilton HEAD OF EVENTS, COMMITTEES & SPONSORSHIP Once you join the Chamber you have the opportunity to join a Committee which will give you an avenue to network with other professionals with shared interests and help to shape the chambers events programme and policy work. For further information about an individual Committee’s work please contact the Committee Secretary listed on the Committee page or get in touch using the form below. Your Name Your Email Message Send Subscribe to our Newsletter Please enter a valid email Sign Up Navigate About Join Events Committees Advocacy News & Resources Connect With Us Check our social media on linkedin Contact Information The British Chamber Of Commerce In Hong Kong RM1201, Emperor Group Centre, 288 Hennessy Road, WanChai HONG KONG Email: contact@britcham.com Phone: +852 2824 2211 Fax: +852 2824 1333 Privacy Policy Powered by"
    },
    {
      "url": "https://www.palmcitychamber.com/about-us/",
      "text": "About Us - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application About Us 40 Years of Accomplishments The Palm City Chamber of Commerce has been in business for over 40 years. That's over 40 years of accomplishments and change in the community. 1990 2nd SPAN OF PALM CITY BRIDGE Mr. James Ware, Project Engineer Cone Constructive, Inc. addressed and answered questions at the April 1990 breakfast meeting of Chamber members with the plans for the new span, as the chamber wants to cooperate and insure that everything possible is done from our end to make the construction effort go as quickly and smoothly as possible. Construction was scheduled to commence by the end of June. The second (2nd) span over the River opened October 23, 1991 GROWTH FOCUSâBrings Town Hall Meetings In 1990, as development projects rose through the city, residents and chamber members held their 1st Town Hall Meetingâ170 residents gathered in Palm City Elementary to ask officials from the county, commission, school board and Sheriffâs Department for answer of how their city will be affected from proposed and approved projects. 1991 PALM CITY PARKâFinally Finished It took 3 years to finish, but the wait was finally over May 15, 1991. The original park with several ball-fields as itsÂ  only amenity, will now feature 31 acres of activities including horseshoes, a fitness center, picnic shelters, restrooms, racquetball, tennis courts, softball baseball fields and a soccer field. Renamed Lance Corporal Justin Wilson Memorial Park 1-95 INTERCHANGE OPENS TO TRAFFIC State Senator William G. Myers and other dignitaries opened the barricades to the new interstate 95 interchange in Palm City, November 22, 1991. After nine months of construction, 4 years after so-called missing link of 1-95 opened, exit 61C (now exit 102) opened with a slight delay and only a little bit of ballyhoo. Life became easier for Palm City Residents with the opening of the High Meadow interchange in 1991 and alleviated traffic on the Palm City Bridge by linking the interstate to Martin Downs Blvd. 1994 CHAMBER MEMBERS SUPPORT PENDARVIS COVE PARK PROJECT In 1987 the 44-acre waterfront parcel of land at the end of Mapp Road was offered by the South Florida Water Management District to the County for development as a park according to Chamber Vice President, Dr. Rex Sentell. The County Board of Commissioners will review the phasing plans, cost estimates and a list of possible funding. Opened in 1994 with 6 shelters with grills, an extended dock for fishing and rack for launching canoes and passive boating vehicles. 1995 PETER AND JULIE CUMMINGS/PALM CITY LIBRARY The original Library was built in 1995 but was closed for renovations and expansion for over a year while new features were added. It re-opened on May 11, 2009 with an expanded meeting room, coffee bar, inter generational area including Teen Zone with computers, and an exploration lab in Childrenâs World that gives a view of the wetlands. In 2011 a 2nd floor was added to the library. 2004 FIRE STATION On May 19, 2004 Palm City opened the new Fire Station on Mapp Road. 2008 CITRUS BOULEVARD In the fall of 2008Â  Citrus Blvd. in Palm City was opened and extended west from Hwy. 714 to Port St. Lucie Blvd. Connecting Palm City to the town of Port St. Lucie, Florida. 2011 VETERANS BRIDGE 1994 plans for the Indian River Street Bridge began, in 1997 construction is approved for $22.8 million but was delayed by court challenges. A project nearly 26 years in the making officially broke ground on April 18, 2011. It was originally dubbed the Indian Street Bridge, before being renamed in 2011 during the 10th Anniversary of September 11, 2001âwas borne of controversy â¦ but now residents, walkers and drivers love it! The bridge was dedicated and officially opened Saturday, November 16, 2013 with the first day of use for auto traffic and joggers the evening of Saturday, December 21. 2012 âNEW SIGNALS ADDED TO MARTIN HIGHWAY Two (2) new traffic signals on Martin Highway in Palm City were installed in February 2012, a step toward managing heavier traffic with the opening of the new Veterans Bridge next year. Thanks to Hal Smith of Whispering Sound community and Commissioner Ed Caimpi. 2013 BASEBALL COMPLEX Construction on a project to build a baseball complex in western Palm City started in the summer of 2013. The development would place four ballparks on an approx.. 26-acre field at the northern property line of Citrus grove Elementary School between the Florida Turnpike and Southern Citrus Boulevard. 2019 WIDENING OF MAPP ROAD The Old Palm City CRS plan and concept from a decade ago ( early 2000âs) was for a Mapp Road that looked a lot like an old fashioned friendly downtown. According to Project Manager Jordan Pastori, (Phase One) engineering and storm-water projects are complete and (Phase Two) âTown Centerâ is planned to start in late Spring of 2019, and should take approximately 10 months to complete. They will include one-site parallel parking, shrubs, street lights, sidewalks, benches, trash bins, bike racks and crosswalks. Trails around the ponds will be added in (Phase Three). © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://business.palmcitychamber.com/contact-us",
      "text": "Contact Us  - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Contact Us First Name Last Name Organization Title Address Line 1 Address Line 2 City State Postal Code Address Type Country United States Canada Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo Democratic Republic of Cook Islands Costa Rica Coted Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea Bissau Guyana Haiti Heard Island and Mc Donald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isleof Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea Democratic Peoples Republic Korea Republic of Kuwait Kyrgyzstan Lao Peoples Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Barthelemy Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands British Virgin Islands US Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Sark Phone Email Contact Preference Comments Send Message Palm City Chamber of Commerce 2701 SW Cornell Avenue Palm City, FL 34990 (772) 286-8121 info@palmcitychamber.com Powered By GrowthZone © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.palmcitychamber.com/board-of-directors/",
      "text": "Board of Directors - Palm City Chamber of Commerce Skip to content Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Menu Home About About Us Board of Directors Community Champions Community Builders Ambassadors Our Team Contact Us Member Center Member Login Business Directory Membership Benefits Marketing Opportunities Member to Member Deals Events Calendar Networking What’s New Hot Deals Job Postings News Join Today! Membership Application Board of Directors Meet Our Board of Directors Rebecca Beckett President Â HJ SIMS Website Chris Coller Treasurer Twinkles Gift Shop Website Meghan Shirey President Elect Boys and Girls Club of Martin County Website Amanda Foster Executive Board Member Zarro Mortgage Website Mike Gonzalez Vice President Blue Stream Fiber Website David Bradford Past President Edward Jones Website Carolyn Leibowitz Director Cruise Planners Website Pat Gleason Director State Insurance Agency Website Daniel Wade Director Century 21 Move with Us Website Rob McLaughlin Director Access 365 Urgent Care/Back in Action âWebsite Lori McNicholas Director Keller Williams of the Treasure Coast James FitzGerald Director Mattamy Homes Website Angela Kacprowicz Director Guaranteed Garage Doors and Repair Ryan Bloss Director Ashley Capital Rob Ranieri Director House of Hope Toby Overdorf Ex-Officio Florida State Representative Ed Ciampi Ex-Officio Martin County Commissioner District 5 Marsha Powers Ex-Officio Martin County School Board Member âDistrict 2 © 2025 Palm City Chamber of Commerce | Site by GrowthZone Get In Touch! Call the Chamber (772) 286-8121 Address & Map 2701 SW Cornell Avenue, Palm City, FL 34990 Email the Chamber info@palmcitychamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! Facebook Instagram © 2025 Palm City Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    }
  ]
}