{
  "fuentes": [
    {
      "url": "https://corporate.palmettogba.com/about/leadership/",
      "email": "info@palmettogba.com"
    },
    {
      "url": "https://corporate.palmettogba.com/about/board-of-directors/",
      "email": "info@palmettogba.com"
    },
    {
      "url": "http://www.tropicalpalmsvilla.com/item/palmetto-pine-country-club.html",
      "email": "asanders@palmettopinecc.com"
    },
    {
      "url": "http://www.tropicalpalmsvilla.com/item/palmetto-pine-country-club.html",
      "email": "bfennel@palmettopinecc.com"
    },
    {
      "url": "http://www.tropicalpalmsvilla.com/item/palmetto-pine-country-club.html",
      "email": "cnagle@palmettopinecc.com"
    },
    {
      "url": "http://www.tropicalpalmsvilla.com/item/palmetto-pine-country-club.html",
      "email": "mwhite@palmettopinecc.com"
    },
    {
      "url": "https://palmettocouncil.org/volunteers",
      "email": "morgan.hawkins@scouting.org"
    },
    {
      "url": "https://palmettocouncil.org/volunteers",
      "email": "palmetto.scoutshop@scouting.org"
    },
    {
      "url": "https://palmettocouncil.org/volunteers",
      "email": "palmettocouncil@scouting.org"
    },
    {
      "url": "https://leadiq.com/c/palmetto-pine-country-club/5a1da03f23000059009126d7",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/palmetto-pine-country-club/5a1da03f23000059009126d7",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/palmetto-pine-country-club/",
      "email": "bfennel@palmettopinecc.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/palmetto-pine-country-club/",
      "email": "default-80@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/palmetto-pine-country-club/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://leadiq.com/c/palmetto-pine-country-club/5a1da03f23000059009126d7/email-format",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/palmetto-pine-country-club/5a1da03f23000059009126d7/email-format",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://www.palmettoandpine.co/get-in-touch",
      "email": "alex@palmettoandpine.co"
    },
    {
      "url": "https://www.palmettohillsgolfclub.com/our-team/",
      "email": "gbolden@palmettohillsgolfclub.com"
    }
  ],
  "mails": [
    "alex@palmettoandpine.co",
    "asanders@palmettopinecc.com",
    "bfennel@palmettopinecc.com",
    "cnagle@palmettopinecc.com",
    "default-80@2x.png",
    "gbolden@palmettohillsgolfclub.com",
    "info@palmettogba.com",
    "morgan.hawkins@scouting.org",
    "mwhite@palmettopinecc.com",
    "name@company.com",
    "palmetto.scoutshop@scouting.org",
    "palmettocouncil@scouting.org",
    "sales@leadiq.com",
    "travel@albrecht.de"
  ],
  "nombre_sitio": "palmettopinecc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://corporate.palmettogba.com/about/leadership/",
      "text": "Leadership - Palmetto GBA Toggle navigation Medicare New to Medicare? Jurisdiction J Part A MAC Jurisdiction J Part B MAC Jurisdiction M Part A MAC Jurisdiction M Part B MAC Jurisdiction M Home Health and Hospice MAC CSSC Operations DMEPOS Competitive Bidding Program MolDX® National Provider Enrollment (NPE) West Pricing, Data Analysis, and Coding (PDAC) Prior Authorization RRB Specialty MAC Beneficiaries RRB Specialty MAC Providers Third Party Administrator Philosophy Capabilities Administrative Services Enterprise Solutions Web & Portal Development Transaction Processing Data Analytics iFlow Training Help Desk Testing Partnering OASIS Program About Contracts Leadership Board of Directors Annual Reports Happenings Community Initiatives Careers Contact Medicare New to Medicare? Jurisdiction J Part A MAC Jurisdiction J Part B MAC Jurisdiction M Part A MAC Jurisdiction M Part B MAC Jurisdiction M Home Health and Hospice MAC CSSC Operations DMEPOS Competitive Bidding Program MolDX® National Provider Enrollment (NPE) West Pricing, Data Analysis, and Coding (PDAC) Prior Authorization RRB Specialty MAC Beneficiaries RRB Specialty MAC Providers Third Party Administrator Careers Contact Philosophy Capabilities Overview > Administrative Services Enterprise Solutions Web & Portal Development Transaction Processing Data Analytics iFlow Training Help Desk Testing Partnering Overview > OASIS Program About Overview > Contracts Leadership Board of Directors Annual Reports Happenings Community Initiatives Home About Leadership Contracts Leadership Board of Directors Annual Reports Happenings Community Initiatives Leadership Neal Burkhead President and Chief Operating Officer Bio Neal has over 25 years of leadership experience in the health care industry. During his tenure at Palmetto GBA, he has held a variety of leadership positions in operations supporting both government and commercial contracts. Neal is a graduate of the University of North Carolina at Chapel Hill with a degree in Political Science. Before joining Palmetto GBA, he worked in health care IT for medical universities and their affiliated physician practices. Neal is active in the local community, currently serving as a Board member for Youth Corps, a Midland’s based non-profit whose mission is to support the development of leadership skills for Midland’s youth. Nella Bishop Chief Information Officer and Vice President of Systems & Support Bio Nella has close to 30 years of experience in Information Technology and Systems. As the CIO and Vice President of Systems and Support, Nella provides strategic guidance in the design and development of new technical initiatives to support Palmetto GBA’s strategic business programs. In this role, Nella has oversight responsibility for Palmetto GBA’s Systems and Support Division providing technical services for all Palmetto GBA contracts as well as directly to the Federal Government and other external business entities. In addition, Nella has responsibility for several technical contracts and Palmetto GBA’s system security program. The Palmetto GBA Systems Division consists of over 500 technicians, software engineers and architects, analysts and technical support personnel. Nella is a graduate of Columbia College with a bachelor’s degree in Mathematics and the Georgia Institute of Technology with a Master of Science in Computer Science. Before joining Palmetto GBA, Nella held a number of leadership positions in the technology industry, specifically the telecommunications and high-tech sectors. Debbie Dickson Vice President of Jurisdiction J A/B MAC Operations Bio Debbie has over 30 years of experience in Medicare contractor operations with progressive leadership responsibilities. Debbie’s area of expertise is in financial management and internal controls ensuring that an effective internal control structure over Medicare financial management operations is in place and operating effectively. She has a proven track record in successfully managing large workloads and system transitions. Debbie is the Program Manager responsible for the oversight and administration of Palmetto GBA's Jurisdiction J A/B Medicare Administrative Contractor (JJ A/B MAC) contract in the states of Alabama, Georgia and Tennessee. Debbie graduated from Francis Marion College earning a Bachelor of Business Administration in Accounting and is a 2010 graduate of the Leadership for the New South Columbia College’s Leadership Institute. Jennifer Dowell Assistant Vice President of Prior Authorization Programs Bio Jennifer is a Registered Nurse with over 20 years of experience in the health care field, 14 of those years in government programs to include Medicare operations and survey and certification work for state agencies. As the Assistant Vice President of Prior Authorization Programs, Jennifer oversees the Review Choice Demonstrations for Home Health and Inpatient Rehabilitation Facility services as well as the prior authorization of certain outpatient department services and repetitive non-emergent ambulance transport. Jennifer also supports the continued growth of innovative pilot opportunities within the Centers for Medicare & Medicaid Services (CMS) contracts. Prior to joining Palmetto GBA in 2016, Jennifer’s clinical experience was focused on trauma/burn intensive care, whole organ transplant intensive care and cardiac catheterization. Jennifer received a Bachelor of Science in Nursing from the University of Alabama, received a Certificate of Leadership from Cornell University and will be a graduate of the Leadership Columbia class of 2024. Robin Free Vice President of Support Operations Bio Robin is a Registered Nurse with over 24 years of experience in the health care field, 20 of those years in Medicare operations. As Palmetto GBA’s Vice President of Support Operations, Robin oversees the Medicare Competitive Bidding Implementation contract, National Provider Enrollment (NPE) West contract, Provider Enrollment and Oversight (PEO) Eastern Region Site Verification Services, Program Improvement, and the Camden, SC Document Control Center. Prior to joining Palmetto GBA in 2003, Robin's clinical experience was focused on Home Health Case Management and inpatient orthopedic, neurological, and cardiac care. Robin received a Bachelor of Science in Nursing from Capital University in Columbus, Ohio, is a 2014 recipient of a Certificate in Leadership from the Institute for Leadership & Professional Excellence at Columbia College and a 2018 graduate of Leadership Columbia. Taliah S. Jarvis Vice President of Compliance and Privacy Bio Taliah has over 20 of experience with government contracts, ten of which have been focused on compliance and privacy programs. As Palmetto GBA’s Vice President of Compliance and Privacy, Taliah oversees and manages the Palmetto GBA Compliance group that actively encourages and enforces adherence to the corporate code of conduct and to all ethical, legal, regulatory, and contractual requirements and obligations. Taliah provides information and guidance to Palmetto GBA senior management and the Board of Directors Compliance Committee. Taliah graduated from the University of South Carolina with a Bachelor of Science degree in Computer Science and later a Master of Business Administration degree. Prior to joining Palmetto GBA, Taliah served as the Vice President of Compliance and Privacy at Companion Data Services. Gina Jenkins Vice President of Shared Services Bio Gina serves as the Vice President of Shared Services, where she oversees critical operations including Jurisdiction J and Jurisdiction M A/B MAC appeals, claims, and pricing functions. Additionally, she manages the Railroad Retirement Board (RRB) Specialty Medicare Contractor (SMAC) contract and the Continuing Education/Medicare Learning Network (CE/MLN) contract and DEX® Registry. Her leadership spans across teams located in South Carolina, Ohio, and Georgia. Joining Palmetto GBA in 2000 with the procurement of the RRB SMAC contract, Gina has held a series of progressively responsible roles, culminating in her position as Senior Director of RRB SMAC Operations. She holds a Bachelor of Business Administration in Management from Brenau University and a Master of Business Administration from the University of South Carolina Aiken. Nancy Lybrand Vice President and Chief Financial Officer Bio Nancy has over 36 years of experience in Accounting and Financial Management. As Chief Financial Officer for Palmetto GBA, Nancy has overall responsibility for the Finance and Accounting division. This division supports all of the company’s administrative accounting functions, the business proposal functions, as well as the finance operational functions of Palmetto GBA’s large Medicare administrative services contracts. In addition, this division provides financial operations support to the BlueCross BlueShield of South Carolina’s Medicaid division. Most recently, Nancy served as the Accounting Director for Palmetto GBA for 22 years. In this role, Nancy was responsible for all financial functions regarding the budgeting, accounting, time keeping, and pricing new business proposals. Nancy is a graduate of Winthrop University earning a Bachelor of Business Administration in Accounting. Tim Masheck Vice President, Information Technology Services Bio Tim has over 33 years of leadership experience and has led operational as well as Information Technology business segments. For the last 24 years, Tim has been focused on Information Technology, Strategy and Financial services specializing in supporting the federal health care market. Prior to joining Palmetto GBA, Tim was the Vice President of Health Information Technology and was responsible for federal government programs. As Vice President, Information Technology (IT) Services, Tim will lead a business unit pursuing information technology and data analytics business opportunities. Tim is a graduate of Butler University with a Bachelor of Science in Finance. Additionally, he received his Master of Business Administration with concentrations in Management, Human Resources and Entrepreneurship from Indiana Institute of Technology. Margaret Price Vice President, Chief Technology Officer Bio Margaret has over 30 years’ experience providing Information Technology Services for health care, manufacturing, and education industries. In her role as the Vice President and Chief Technology Officer for Palmetto GBA, she leads the technical architecture and solutions development in support of growing and diversifying Information Technology and Data Analytics services. Prior to joining Palmetto GBA, Margaret was the Assistant Vice President of BlueCross BlueShield of South Carolina’s Infrastructure area where she lead the strategic planning, acquisition, delivery, and operations of the Network, Telephony, and Database Administration environment. Additionally, she was also responsible for the security and compliance operations teams that support government contracts and maintained the required compliance with many of the security requirements. Margaret has a Bachelor of Science in Business Administration from Central Michigan University and a number of technical certifications resulting from her extensive professional training. Ed Sanchez Vice President of Jurisdiction M A/B MAC Operations Bio Ed serves as Vice President of Operations and is the Program Manager responsible for the oversight and administration of Palmetto GBA’s Jurisdiction M A/B Medicare Administrative Contract (JM A/B MAC) in the states of North and South Carolina, Virginia and West Virginia as well as the Regional Home Health and Hospice contracts for a 16-state jurisdiction. These responsibilities encompass a broad range of functions including review choice demonstration initiatives, prior authorization, claims processing, customer service, appeals, medical policy, provider enrollment, provider outreach and education, provider audit and reimbursement and medical review. Additionally, he supports organic growth expansion and innovation pilot opportunities within Centers for Medicare & Medicaid Services (CMS) contracts. Ed has over 39 years of professional experience and over 23 years leading Medicare Integrity Program functions in Medicare Part A/B, Home Health & Hospice and Durable Medical Equipment environments. A licensed Attorney, Ed holds a Bachelor of Arts degree in Economics from Haverford College, a Juris Doctor from Temple University, and a Master’s in Business Administration from Drexel University. Ed also earned a master’s certification in Federal Government Contracting from George Washington University. Philosophy Capabilities Partnering About Careers Contact Palmetto GBA, LLC 17 Technology Circle Columbia, South Carolina 29203 TEL (803) 735-1034 info@palmettogba.com Other Palmetto GBA sites New to Medicare? Coverage Gap Discount Program Third Party Administrator CSSC Operations DEX DMEPOS Competitive Bidding Program Jurisdiction J Part A MAC Jurisdiction J Part B MAC Jurisdiction M Part A MAC Jurisdiction M Part B MAC Jurisdiction M Home Health and Hospice MAC MolDX® National Provider Enrollment (NPE) West Pricing, Data Analysis, and Coding (PDAC) Prior Authorization RRB Specialty MAC Beneficiaries RRB Specialty MAC Providers Privacy Policy Terms of Use Connect Facebook LinkedIn Twitter YouTube © 2025 Palmetto GBA, LLC A Celerian Group Company Palmetto GBA is one of the nation’s largest providers of high volume claims and transaction processing, contact center operations and technical services to the federal government and other commercial customers."
    },
    {
      "url": "https://corporate.palmettogba.com/about/board-of-directors/",
      "text": "Board of Directors - Palmetto GBA Toggle navigation Medicare New to Medicare? Jurisdiction J Part A MAC Jurisdiction J Part B MAC Jurisdiction M Part A MAC Jurisdiction M Part B MAC Jurisdiction M Home Health and Hospice MAC CSSC Operations DMEPOS Competitive Bidding Program MolDX® National Provider Enrollment (NPE) West Pricing, Data Analysis, and Coding (PDAC) Prior Authorization RRB Specialty MAC Beneficiaries RRB Specialty MAC Providers Third Party Administrator Philosophy Capabilities Administrative Services Enterprise Solutions Web & Portal Development Transaction Processing Data Analytics iFlow Training Help Desk Testing Partnering OASIS Program About Contracts Leadership Board of Directors Annual Reports Happenings Community Initiatives Careers Contact Medicare New to Medicare? Jurisdiction J Part A MAC Jurisdiction J Part B MAC Jurisdiction M Part A MAC Jurisdiction M Part B MAC Jurisdiction M Home Health and Hospice MAC CSSC Operations DMEPOS Competitive Bidding Program MolDX® National Provider Enrollment (NPE) West Pricing, Data Analysis, and Coding (PDAC) Prior Authorization RRB Specialty MAC Beneficiaries RRB Specialty MAC Providers Third Party Administrator Careers Contact Philosophy Capabilities Overview > Administrative Services Enterprise Solutions Web & Portal Development Transaction Processing Data Analytics iFlow Training Help Desk Testing Partnering Overview > OASIS Program About Overview > Contracts Leadership Board of Directors Annual Reports Happenings Community Initiatives Home About Board of Directors Contracts Leadership Board of Directors Annual Reports Happenings Community Initiatives Board of Directors Allow us to introduce ourselves. The desire to care for clients and communities permeates our organization and is exemplified by our leadership team. Mike Mizeur Chairman, Board of Directors, Palmetto GBA, LLC President/CEO, BlueCross BlueShield of South Carolina David Pankau Chairman, Board of Directors, BlueCross BlueShield of South Carolina Bruce W. Hughes President & COO, Celerian Group, BlueCross BlueShield of South Carolina Lori Hair Executive Vice President, Chief Financial Officer and Treasurer, BlueCross BlueShield of South Carolina Neal Burkhead President & COO, Palmetto GBA David Butler Retired Chief Operating Officer, Strategic Management Systems, Inc. Martin Kappert Retired Deputy Assistant Secretary Health Affairs, Department of Defense Ilene H. Nagel President and CEO, Education Executives, LLC Col. Robert E. Shields Retired, Humana Military/Healthcare Services (TRICARE) Philosophy Capabilities Partnering About Careers Contact Palmetto GBA, LLC 17 Technology Circle Columbia, South Carolina 29203 TEL (803) 735-1034 info@palmettogba.com Other Palmetto GBA sites New to Medicare? Coverage Gap Discount Program Third Party Administrator CSSC Operations DEX DMEPOS Competitive Bidding Program Jurisdiction J Part A MAC Jurisdiction J Part B MAC Jurisdiction M Part A MAC Jurisdiction M Part B MAC Jurisdiction M Home Health and Hospice MAC MolDX® National Provider Enrollment (NPE) West Pricing, Data Analysis, and Coding (PDAC) Prior Authorization RRB Specialty MAC Beneficiaries RRB Specialty MAC Providers Privacy Policy Terms of Use Connect Facebook LinkedIn Twitter YouTube © 2025 Palmetto GBA, LLC A Celerian Group Company Palmetto GBA is one of the nation’s largest providers of high volume claims and transaction processing, contact center operations and technical services to the federal government and other commercial customers."
    },
    {
      "url": "http://www.tropicalpalmsvilla.com/item/palmetto-pine-country-club.html",
      "text": "Tropical Palms Villa | Palmetto - Pine Country Club Follow via Facebook Follow via Twitter The Villa Take A Tour Pool & Lanai First Master Bedroom Suite Second Master Bedroom Suite Dock & Sundeck Great Hall, Kitchen & Dining Front Entrance Third Bedroom Fourth Bedroom Fifth Bedroom Games Room / Garage Laundry Room Bathroom Background Pictures Accessibility Accessibility Pics Accessible Resources Cape Coral What's Nearby Guestbook Calendar Contact Home What's Nearby Golf Courses Palmetto - Pine Country Club (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) (Google Geocoding API error: The request was denied.) All Categories Airports Cruise Ports Shopping Restaurants Local Attractions Theme Parks Beaches Golf Courses MLB Training Pro Sports < Prev Palmetto - Pine Country Club Welcome to Palmetto-Pine Country Club If year-round golf in warm weather and still warmer friendships is a life-style you want, Palmetto-Pine Country Club provides an atmosphere of fun and relaxation that is unique and much-valued among its members. Additionally, Forbes Magazine selected Cape Coral as one of the 25 best places to retire in 2012! For more info click here: FORBES MAGAZINE. And in April 2013, MSN Money Magazine selected Cape Coral as the No. 7 city out of the top 10 \"where retirees rule.\" For ardent golfers, the course offers both challenge and pleasure from any of the five sets of tees. For our members who do not play golf, Palmetto-Pine Country Club offers a very active social calendar from which to choose. Let us help you discover how Palmetto-Pine Country Club can be your paradise found. Distance from Tropical Palms Villa 7.7 miles Approximate Driving Time 17 minutes Contact Info To make a tee time, please call: 239-574-2141 Banquet Manager - Charles Nagle 239-574-4711 or cnagle@palmettopinecc.com Controller - Michelle White 239-574-7262 or mwhite@palmettopinecc.com Head Golf Professional - Brady Fennel, PGA 239-574-2141 or bfennel@palmettopinecc.com Membership Director - Ashley Sanders Office: 239-574-7262 Ext.27 Cell: 239-895-8070 or asanders@palmettopinecc.com 1940 S.W. 9th Court Cape Coral, FL 33991 Official Website Tropical Palms Villa Copyright © 2025. All Rights Reserved Designed by Web Presence Design Lab ."
    },
    {
      "url": "https://palmettocouncil.org/volunteers",
      "text": "Board of Directors - Palmetto Council, Scouting America Home About Us Mission and Values Staff Board of Directors Vision 2026 2024 Annual Report Programs Service Area Palmetto Council Blog Contact Us Ways to Give Donate Online Golfing for Scouting 2025 Shooting for Scouting Camp Conley Clarke Memorial Donations Special Events Matching Gifts Endowment Scholarships 2024 Community Partners Leaders Quick Links Program Planning Popcorn Information Awards and Recogition Council Communications District Information Forms and Documents Merit Badge Counselors Scouting Adventure Cards for Leaders Scouting for Food Territory 15 Calendar Training FAQs Scouts All Things Eagle Order of the Arrow Scholarships Exploring Resources Parents Why Scouting? Unit Finder Forms and Documents Council Communications for Parents FAQs Scout Shop Events Order of the Arrow Volunteer Leader Training Events Cub Scout Rangemaster Training Trainers Edge Beach Sweep New Cub Scout Shoot-O-Ree Camp Expo 2025 Veterans Day Campout 2026 National Jamboree DM Fall Family Campout York Gold Rush DM Veterans Day Campout Fall IOLS Sign In My Account Menu 420 South Church Street Spartanburg, SC (864) 585-4391 Your Custom Text Here Home About Us Mission and Values Staff Board of Directors Vision 2026 2024 Annual Report Programs Service Area Palmetto Council Blog Contact Us Ways to Give Donate Online Golfing for Scouting 2025 Shooting for Scouting Camp Conley Clarke Memorial Donations Special Events Matching Gifts Endowment Scholarships 2024 Community Partners Leaders Quick Links Program Planning Popcorn Information Awards and Recogition Council Communications District Information Forms and Documents Merit Badge Counselors Scouting Adventure Cards for Leaders Scouting for Food Territory 15 Calendar Training FAQs Scouts All Things Eagle Order of the Arrow Scholarships Exploring Resources Parents Why Scouting? Unit Finder Forms and Documents Council Communications for Parents FAQs Scout Shop Events Order of the Arrow Volunteer Leader Training Events Cub Scout Rangemaster Training Trainers Edge Beach Sweep New Cub Scout Shoot-O-Ree Camp Expo 2025 Veterans Day Campout 2026 National Jamboree DM Fall Family Campout York Gold Rush DM Veterans Day Campout Fall IOLS Sign In My Account Palmetto Council Leadership Council President                                                COuncil Commissioner                                        Scout Executive/CEO C. Daniel Atkinson Patrick Cote                                                                                     Justin K. Williams Palmetto Council Inc. Is a registered 501(c)3 organization. Copyright Palmetto Council, Scouting America, 2024 Palmetto Council, Scouting America 420 S. Church Street, Spartanburg, SC 29306 Phone Number: 864-585-4391 Email: palmettocouncil@scouting.org Hours of Operation: Monday - by appointment only Tuesday - Thursday: 9:30 AM - 5:30 PM Friday: by appointment only Saturday & Sunday: Closed Scout Shop 420 S. Chuch Street, Spartanburg, SC Phone Number: 864-585-4391 email: palmetto.scoutshop@scouting.org Hours of Operation: Monday: by appointment only Tuesday - Thursday: 9:30 AM - 5:30 PM Friday: by appointment only Saturday & Sunday: closed"
    },
    {
      "url": "https://leadiq.com/c/palmetto-pine-country-club/5a1da03f23000059009126d7",
      "text": "Palmetto-Pine Country Club Company Overview, Contact Details & Competitors | LeadIQ Learn more at LeadIQ.com Start free Insights Similar companies Tech Stack Media & News Email Format FAQ Insights Gathering insights about Palmetto-Pine Country Club â¦ Similar companies to Palmetto-Pine Country Club The Forest Country Club Gulf Harbour Yacht & Country Club Explore similar companies Palmetto-Pine Country Club Tech Stack Palmetto-Pine Country Club uses 8 technology products and services including RackSpace Cloud, Font Awesome, Google Font API, and more. Explore Palmetto-Pine Country Club 's tech stack below. RackSpace Cloud Data Management Platforms Font Awesome Font Scripts Google Font API Font Scripts Modernizr Javascript Libraries jQuery Javascript Libraries Video.js Javascript Libraries Bootstrap UI Frameworks Google Analytics Web Analytics Media & News Palmetto-Pine Country Club 's Email Address Formats Palmetto-Pine Country Club uses at least 2 format(s): Palmetto-Pine Country Club Email Formats Example Percentage FLast@palmettopinecc.com JDoe@palmettopinecc.com 100% FLast@palmettopine.com JDoe@palmettopine.com 75% First.Last@palmettopine.com John.Doe@palmettopine.com 25% See more formats Frequently Asked Questions Where is Palmetto-Pine Country Club 's headquarters located? Palmetto-Pine Country Club 's main headquarters is located at 1940 S.W. 9th Court, Cape Coral, FL 33991, US . The company has employees across 1 continents, including North America . What is Palmetto-Pine Country Club 's phone number? You can contact Palmetto-Pine Country Club 's main corporate office by phone at +1-239-574-**** . For more prospecting data, LeadIQ has access to up-to-date and accurate contact information within our platform. Find, capture, and sync contact data to your CRM and sales tools in one click. What is Palmetto-Pine Country Club 's official website and social media links? Palmetto-Pine Country Club 's official website is palmettopine.com and has social profiles on LinkedIn . What is Palmetto-Pine Country Club 's NAICS code ? Palmetto-Pine Country Club 's NAICS code is 7211 - Traveler Accommodation . How many employees does Palmetto-Pine Country Club have currently? As of August 2025 , Palmetto-Pine Country Club has approximately 18 employees across 1 continents, including North America . Key team members include Head Golf Professional: S. B. Head Golf Professional: T. S. Founder: A. P. . Explore Palmetto-Pine Country Club 's employee directory with LeadIQ. What industry does Palmetto-Pine Country Club belong to? Palmetto-Pine Country Club operates in the Hospitality industry. What technology does Palmetto-Pine Country Club use? Palmetto-Pine Country Club 's tech stack includes RackSpace Cloud Font Awesome Google Font API Modernizr jQuery Video.js Bootstrap Google Analytics . What is Palmetto-Pine Country Club 's email format? Palmetto-Pine Country Club 's email format typically follows the pattern of . Find more Palmetto-Pine Country Club email formats with LeadIQ. When was Palmetto-Pine Country Club founded? Palmetto-Pine Country Club was founded in 1969 . Palmetto-Pine Country Club Hospitality United States 11-50 Employees Palmetto-Pine Country Club is a semi-private, equity owned club located in Cape Coral, Florida. Since 1969, Palmetto-Pine has been the staple of Cape Coral providing championship golf and a host of dining and social activities for its members and guests.\r\n\r\nOur championship golf course designed by renowned architect, Arthur Hills, provides a fair yet challenging test of golf for players of all abilities from one of our eight sets of tees. In addition, our greens are known as some of the best in the area, smooth and fast!\r\n\r\nFor the dining and social enthusiast, we have a full-service restaurant, bar and social calendar throughout the year. Whether it's a quick bite after golf or dinner with family and friends, we have you covered! If you searching for a venue to host a large private party, we can accommodate up to 225 patrons in our banquet facilities as well!\r\n\r\nCome visit Palmetto-Pine Country Club and enjoy everything we have to offer! Sign up for free to view info Email Format Employee directory Company Overview Headquarters 1940 S.W. 9th Court, Cape Coral, FL 33991, US Phone number +1-239-574-**** Website palmettopine.com NAICS Code 7211 - Traveler Accommodation Founded 1969 Employees 11-50 Media & News Read more news Funding & Financials Funding & Financials Company Leadership S. B. Head Golf Professional Mobile Phone Email T. S. Head Golf Professional Mobile Phone Email A. P. Founder Mobile Phone Email G. S. Food And Beverage Director Mobile Phone Email G. S. Food And Beverage Director Mobile Phone Email Employee Directory B. D. General Manager Mobile Phone Email C. N. Maintenance Operations Manager Mobile Phone Email M. T. Golf Operations Mobile Phone Email G. G. Outside Operations Mobile Phone Email G. W. Operational Art Subject Matter Expert Mobile Phone Email Go to Employee Directory Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://www.1golf.eu/en/club/palmetto-pine-country-club/",
      "text": "Palmetto-Pine Country Club, Cape Coral, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Palmetto-Pine Country Club 18 Hole Semi- Private Overview Course Visitors Prices Amenities Club Reviews Palmetto-Pine Country Club 1940 SW 9th Court, Cape Coral, FL 33991, USA Phone: +1 239-574-2141 , Fax: +1 239-574-4255 bfennel@palmettopinecc.com palmettopinecc.com Map Save Share 3.6 of 5 stars 23 Reviews “ Golfer96 Response ” 10/2014 The Course 18-Hole Palmetto-Pine Country Club Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round The Course 18-Hole Palmetto-Pine Country Club Course Opened in 1969. Design: Arthur Hills . Terrain: Flat with water hazards Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Black (Men) 72 71.3 134 6590 yards Blue (Men) 72 70.1 122 6329 yards White (Men) 72 69.3 120 6150 yards Yellow (Men) 72 67.3 116 5700 yards Red (Women) 72 69 112 5090 yards Practice Facilities Driving Range Putting Green Chipping Green Practice bunker Visitors 18-Hole Palmetto-Pine Country Club Course Visitors are welcome every day. Etiquette Softspikes required. No dogs allowed. Mobile phone permitted on course. GPS devices approved. Green Fees Driving Range Monday - Sunday Bucket (70 balls) $8 (7 €) Amenities Club Amenities Clubhouse Pro Shop Restaurant Bar Rentals Clubs for hire Electro-cart for hire The Club General Information Founded : 1969 Enlarge / get directions Nearby Courses Cape Coral Executive Course Cape Coral (3.6 km) 2.8 of 5 stars (6) 9 Hole 19 € / 18 Holes Royal Tee Country Club Cape Coral (3.8 km) 2.3 of 5 stars (10) 27 Hole Coral Oaks Golf Course Cape Coral (8.6 km) 3.6 of 5 stars (11) 18 Hole 56 € / 18 Holes See all User Reviews 3.6 of 5 stars 23 Reviews 5 Stars: 4 4 Stars: 8 3 Stars: 10 2 Stars: 0 1 star: 1 Write a Review Most Recent Reviews bfennel 1 Review Golfer96 Response 5.0 of 5 stars Reviewed October 8, 2014 Thank you for your review. For clarification, we had aerified the greens less than 10 days prior to you playing our course. We welcome you to play during season when the course is in great shape and the greens are fast and smooth. We hope to see you soon! Brady Fennel, PGA Head Golf Professional Palmetto-Pine Country Club Harry W 78 Reviews Automatic translation Original version Best place in Cape Coral 4.0 of 5 stars Reviewed January 17, 2024 Very nice and interesting place to play. Condition of the facility is top. Unfortunately, the location in the middle of houses is not the real thing Translated by Google . Hampe 61 167 Reviews Automatic translation Original version Great clubhouse 4.0 of 5 stars Reviewed January 23, 2019 I played the course on 22.1 with 3 colleagues. A fair, not too difficult course, flat as practically everyone here in Florida. The Farways were currently due to the little rain dry and therefore very hard. Greens relatively fast and consistent. Highly recommended is the restaurant in the beautiful clubhouse. The service extremely courteous! Translated by Google . Been to Palmetto-Pine Country Club ? Share your experiences! Write a Review See all 23 reviews Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://leadiq.com/c/palmetto-pine-country-club/5a1da03f23000059009126d7/email-format",
      "text": "Palmetto-Pine Country Club Email Formats & Email Address Examples | LeadIQ Learn more at LeadIQ.com Start free Most Common Email Formats at Palmetto-Pine Country Club The most accurate and popular Palmetto-Pine Country Club 's email format is  (ex. ). Palmetto-Pine Country Club also uses (ex. ) as email structures. Palmetto-Pine Country Club uses up to 2 different email patterns. Palmetto-Pine Country Club Email Formats Example Percentage FLast@palmettopinecc.com JDoe@palmettopinecc.com 100% FLast@palmettopine.com JDoe@palmettopine.com 75% First.Last@palmettopine.com John.Doe@palmettopine.com 25% Frequently Asked Questions What does Palmetto-Pine Country Club do? Palmetto-Pine Country Club was founded in 1969 . The company's main headquarters is located in 1940 S.W. 9th Court, Cape Coral, FL 33991, US operates in the Hospitality industry , along with similar companies like The Forest Country Club Gulf Harbour Yacht & Country Club . You can visit palmettopine.com contact Palmetto-Pine Country Club 's headquarters by phone at +1-239-574-**** . Explore Palmetto-Pine Country Club 's company overview page for more information. What is Palmetto-Pine Country Club 's email address format? Palmetto-Pine Country Club 's email format typically follows the pattern of FLast@palmettopinecc.com; this email format is used 100% of the time. Other contacts within LeadIQ's database had email formats such as FLast@palmettopine.com First.Last@palmettopine.com . Looking for more contact data? Unlock accurate emails and phone numbers from millions of profiles verified in real-time. How many employees does Palmetto-Pine Country Club have currently? Palmetto-Pine Country Club has approximately 18 employees as of 1969 . Key team members to contact include Head Golf Professional: S. B. Head Golf Professional: T. S. Founder: A. P. . For more team information and contact data, explore Palmetto-Pine Country Club 's employee directory with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Palmetto-Pine Country Club Email Format Hospitality United States 11-50 Employees Palmetto-Pine Country Club is a semi-private, equity owned club located in Cape Coral, Florida. Since 1969, Palmetto-Pine has been the staple of Cape Coral providing championship golf and a host of dining and social activities for its members and guests.\r\n\r\nOur championship golf course designed by renowned architect, Arthur Hills, provides a fair yet challenging test of golf for players of all abilities from one of our eight sets of tees. In addition, our greens are known as some of the best in the area, smooth and fast!\r\n\r\nFor the dining and social enthusiast, we have a full-service restaurant, bar and social calendar throughout the year. Whether it's a quick bite after golf or dinner with family and friends, we have you covered! If you searching for a venue to host a large private party, we can accommodate up to 225 patrons in our banquet facilities as well!\r\n\r\nCome visit Palmetto-Pine Country Club and enjoy everything we have to offer! Sign up for free to view info Company overview Employee directory Verify Palmetto-Pine Country Club email addresses Verify Email Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://www.palmettoandpine.co/get-in-touch",
      "text": "Palmetto & Pine | Get in touch For owners For intermediaries Get in touch Get in touch Are you thinking of selling, or do you know someone we should meet? Email us at alex@palmettoandpine.co or submit your contact information here. â We look forward to hearing from you. Phone 415-275-0245 Proudly Based In Matthews, NC Name* Email* Company name* Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Home For owners For intermediaries Get in touch alex@palmettoandpine.co Have us reach out to you Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. â¸ Palmetto & Pine - All Rights Reserved"
    },
    {
      "url": "https://www.palmettohillsgolfclub.com/our-team/",
      "text": "Our Team - Palmetto Hills Golf Club Skip to primary navigation Skip to main content Palmetto Hills Golf Club Facebook Member Login Online Store Home Course Tee Times Membership Events Upcoming Events Special Events Contact Contact Us Join E-Club Our Team Advertisement Our Team Gage Bolden General Manager – Palmetto Hills Golf Club gbolden@palmettohillsgolfclub.com Gage Bolden A native of North Myrtle Beach, South Carolina, Gage Bolden carries on a legacy nearly 50 years in the making. His grandfather built the original course in 1979 under the name The Widowmaker, and in 2020, the family had the opportunity to bring the property back into the family’s care. After graduating from The Citadel, The Military College of South Carolina in 2017 with a degree in Criminal Justice, Gage began a career in law enforcement with the Horry County Sheriff’s Office and later worked as a private investigator across South Carolina, North Carolina, Georgia, and Texas. But golf and family heritage called him back. In March of 2022, Gage officially stepped in as the General Manager of Palmetto Hills Golf Club, LLC, overseeing the course’s ongoing development, operations, and community revival with a deep sense of purpose and pride. Outside of the course, Gage is a newlywed to his wife Allie, the Varsity Competition Cheer Coach at Dorman High School. They live locally with their two dogs—Maverick, an Australian Shepherd, and Bowen, a friendly Bernedoodle—who can occasionally be spotted greeting golfers around the property. At Palmetto Hills, Gage combines his professional discipline, family values, and vision for the future to ensure every golfer feels welcome and part of something special. Page Footer Contact Us Address : 5451 S Pine St Spartanburg, SC 29302 Email : gbolden@palmettohillsgolfclub.com Phone : (864) 582-7579 Palmetto Hills Golf Club | 5451 S Pine St Spartanburg, SC 29302 | (864) 582-7579 Copyright © 2025  Palmetto Hills Golf Club All Rights Reserved. Powered by"
    }
  ]
}