{
  "fuentes": [
    {
      "url": "https://palmterracefl.com/faq/",
      "email": "pmt@cobblestoneassets.com"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48061-palm-terrace-village-3260-west-kevin-lane-lecanto-fl-34461",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48061-palm-terrace-village-3260-west-kevin-lane-lecanto-fl-34461",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48061-palm-terrace-village-3260-west-kevin-lane-lecanto-fl-34461",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48061-palm-terrace-village-3260-west-kevin-lane-lecanto-fl-34461",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://palmterracefl.com/contact-us/",
      "email": "pmt@cobblestoneassets.com"
    },
    {
      "url": "https://www.palmbeachsports.com/about-us/board-and-committees-2/",
      "email": "info@palmbeachsports.com"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/54577-palm-terrace-mobile-village-12149-indiana-avenue-lot-o-riverside-ca-92503",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/54577-palm-terrace-mobile-village-12149-indiana-avenue-lot-o-riverside-ca-92503",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/54577-palm-terrace-mobile-village-12149-indiana-avenue-lot-o-riverside-ca-92503",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/54577-palm-terrace-mobile-village-12149-indiana-avenue-lot-o-riverside-ca-92503",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://palmterracefl.com/location/",
      "email": "pmt@cobblestoneassets.com"
    },
    {
      "url": "https://palmlakeresort.com.au/tea-gardens/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "http://www.palmresacapark.org/about-us/board-of-directors/",
      "email": "manager@palmresacapark.org"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "emilyh@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "angie@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "annemarie@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "ashley@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "carolina@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "colleen@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "davis@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "erica@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "gary@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "gerry@ommac.co.uk"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "jeff@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "joanne@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "josh@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "juliek@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "laurenb@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "lynne@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "mary@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "oleg@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "rich@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "rob@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "sean@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "suzanne@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "tammy@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "todd@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "will@visitgreaterps.com"
    },
    {
      "url": "https://www.palmhousehotel.com/contact-us/",
      "email": "info@palmhouse.com"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/76651-desert-terrace-mobile-estates-5063-s-hwy-97-redmond-or-97756",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/76651-desert-terrace-mobile-estates-5063-s-hwy-97-redmond-or-97756",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/76651-desert-terrace-mobile-estates-5063-s-hwy-97-redmond-or-97756",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/76651-desert-terrace-mobile-estates-5063-s-hwy-97-redmond-or-97756",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    }
  ],
  "mails": [
    "angie@visitgreaterps.com",
    "annemarie@visitgreaterps.com",
    "ashley@visitgreaterps.com",
    "carolina@visitgreaterps.com",
    "chosen-sprite@2x.png",
    "colleen@visitgreaterps.com",
    "davis@visitgreaterps.com",
    "emilyh@visitgreaterps.com",
    "erica@visitgreaterps.com",
    "gary@visitgreaterps.com",
    "gerry@ommac.co.uk",
    "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png",
    "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png",
    "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png",
    "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png",
    "info@palmbeachsports.com",
    "info@palmhouse.com",
    "jeff@visitgreaterps.com",
    "joanne@visitgreaterps.com",
    "josh@visitgreaterps.com",
    "juliek@visitgreaterps.com",
    "laurenb@visitgreaterps.com",
    "lynne@visitgreaterps.com",
    "manager@palmresacapark.org",
    "mary@visitgreaterps.com",
    "oleg@visitgreaterps.com",
    "pmt@cobblestoneassets.com",
    "rich@visitgreaterps.com",
    "rob@visitgreaterps.com",
    "sean@visitgreaterps.com",
    "suzanne@visitgreaterps.com",
    "tammy@visitgreaterps.com",
    "todd@visitgreaterps.com",
    "will@visitgreaterps.com"
  ],
  "nombre_sitio": "palmterracefl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://palmterracefl.com/faq/",
      "text": "FAQs | 55+ Active Adult Community | Sarasota FL 941.529.7005 Email Us Resident Portal Join Our Newsletter 9415297005 Available Homes RV Stays Lifestyle Gallery Location Specials FAQ Contact Us FAQ What’s the difference between a manufactured home, a mobile home, and a modular home? A manufactured home is a home constructed in a factory according to strict code that must be adhered to, the National Manufactured Housing Construction and Safety Standards ( HUD code ) of July 15, 1976. A manufactured home is transportable in one or more sections, built on a permanent chassis, and is a home with or without a permanent foundation.  Manufactured home titles must be transferred to the new owner as part of the transaction.  Modular homes are factory built and brought to the site in one or more sections. Unlike a manufactured home, which must adhere to the national HUD code, the modular home is regulated by the BOCA code.  This is the same code site-built homes must adhere to and must be placed on a permanent foundation that meets the local requirements. A mobile home is a factory-built home that was built before the July 1, 1976 HUD code came into effect. Mobile Home is a legal term for modern manufactured housing. Can you move/relocate a home to your communities? No, as part of our efforts to ensure the value of your home and the quality of your neighborhood remains high, there are strict internal quality control standards in place and private home placements are not available at this time.  We do however offer a home customization program through our manufacturer and we can help you create your own ideal home to move into. Do you allow pets? Yes, our communities are pet friendly and allow up to 2 small pets.  Breed restrictions do apply. Please see the community manager for details. Will I own or lease the land? You own your home and lease the land. What are the benefits to owning in a Manufactured Home Community? Manufactured homes offer a low maintenance lifestyle and quality living at an affordable price. Residents also enjoy all of the great resort style amenities , clubs and activities that the community has to offer. Are my children and grandchildren able to visit? Yes, we allow younger relatives short-term visits. Guests must be accompanied by resident when using amenities. There are limits on the length of time non-Residents are permitted to stay. Please consult with the property manager for full details. Do you do background checks? Yes.  We require a background check on all residents who are living on our properties. Who manages the community? All Cobblestone managed communities have experienced on-site management. Is there financing available for manufactured homes? Yes, we have lenders we can recommend to help you secure the right mortgage for you and your new home. What upgrades are being planned? Our plans are still in progress.  Stay tuned for details. Do you have other communities available? Cobblestone Management offers a variety of communities locally and nationwide. Visit our website at Live Cobblestone for more information. Do you have to be 55+ to live in your communities? Residency restrictions require one of each home's residents to be at least 55 years old. Contact property management for details. Do you have rental homes? We do not have homes available for rent. Check our Available Homes page for any availability. see more interested in our community? Contact us to learn more! contact us office hours Monday - Saturday 9:00am – 4:00pm Sales Office Tuesday - Saturday 9:00am – 5:00pm CONTACT 941.529.7005 3223 N. Lockwood Ridge Road Sarasota, FL 34234 © Palm Terrace All rights reserved Privacy Policy Terms of Use Do Not Sell or Share My Personal Information Palm Terrace Privacy Policy This Privacy Policy describes how Palm Terrace collects, uses, and discloses your personal information. This Privacy Policy should be read in conjunction with our Terms of Service, and any other policy, agreement, or terms which may affect your relationship with us. I. SCOPE OF THIS POLICY This Privacy Policy applies to https://palmterracefl.com including all its sub-domains and other websites that link to this Privacy Policy, when accessing and using them in the United States, as well as any of our other services and tools that might be made available by us from time to time, including offline tools, surveys, applications, services, advertisements, events, and promotions (collectively, “Services”). We may provide links to external-party websites that are not owned by Palm Terrace has no control over external-party privacy practices and assumes no responsibility in connection with your use of external-party websites, applications, or any other services offered by other parties. Any external-party services are governed by the privacy policies appearing on those sites and applications. By using the Services, you signify your consent to this Privacy Policy and the Terms of Service for the use of our Services. If you do not agree to this Privacy Policy or Terms of Service for the use of our Services, please do not use our Services. II. INFORMATION THAT WE COLLECT OR RECEIVE We collect and receive information from and about you by different means, including, without limitation: (i) information you submit or provide to us; (ii) information collected automatically and manually; and (iii) information provided to us by other sources. Some of the information we collect and receive includes “personal information,” which is generally information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with you. Personal information does not include information that is publicly available, de-identified, aggregated, or otherwise exempted by applicable laws. The information we may collect will vary and depend on the nature of your relationship with us and the reason(s) for providing/collecting the information. A. Information You Submit or Provide to Us We or our vendors collect the information that you directly provide to us, such as when you enter it on a webpage, submit an online form, use a chat feature we may offer, or include it in an email that you send to us in relation to our Services. In addition, we may collect information through relevant business support processes, during the registration or account creation processes, and through other business functions where we ask you to provide information, including: Contact Information (e.g., name, email or mailing address, or phone number); Account Administration Information (e.g., username, 1 / 5 password, or security questions); Communications (e.g., information you submit through our interactive chat feature or through other communications with us, including potential customer service call recordings); Payments and financial information (e.g., information necessary to process transactions, conduct due diligence, as part of an application, or for other business needs); Employment-related information and education information (e.g., information you may provide when applying for a job, or which may be included as part of an application); Demographic information (e.g., ethnicity, sex, gender, birth date, age, languages spoken, disability, housing status, household size, household type, family members, marital status, annual income, desired housing characteristics and desired housing location or community); Location information (e.g., geolocation inferred from your access to our websites or from your device); and Commercial records, customer records, and preference information (e.g., your purchase history, leasing details, rental history, property records, tenant data, and related information). Your use of interactive features we may offer on our Services is voluntary, and we may retain the information that you submit through these features. If you participate in interactive chat, either with a virtual or live agent, the contents of the chat may be captured by us or our service provider and kept as a transcript. If you use these features, you understand that our vendors may process the information obtained through the feature to provide the Service on our behalf. If you submit personal information of other people to us, e.g., when participating in a resident referral program we may offer, you represent that you have permission and authority to provide us with such personal information. If you do not have permission, please do not provide us with their information. B. Types of Information Collected Automatically We may automatically or manually collect information related to your use of Services. For example, data collected in this manner may include: Web Browsing Data. When you use our Services, our servers may automatically record information, including information that your browser or mobile device sends when you visit or use our Services. Technical Information. We may collect certain technical information about your computer systems or about your visits to our online environments when you use our Services. Device Information. We may collect information about the device you are using to access our Services, including what type of device it is, what operating system you are using, device settings, unique device identifiers and crash data. Cookie Data. Depending on how you are accessing our online environments, we may use “cookies” (a small text file sent by your device each time you visit our websites, unique to your Palm Terrace account or your browser). When we use cookies, we may use “session” cookies (that last until you close your browser) or “persistent” cookies (that last until you or your browser delete them). For example, we may use cookies to 2 / 5 remember your personal preferences, such as sections of our Services that you visit frequently, your user ID or other settings so you do not have to set them up every time you visit our Services. Some of the cookies we use may be associated with your Palm Terrace account (including information about you, such as the email address you gave us), and other cookies are not. In addition, we may use web beacons, pixels, or other web programming code or embedded scripts. Analytics Data. We may use Google Analytics or other providers for analytics services. We may also implement Google Analytics Advertising Features such as remarketing with analytics and interest-based ads. We may use first-party cookies or other first- party identifiers as well as third-party cookies or other third-party identifiers to, e.g., deliver advertisements, measure your interests, and/or personalize content. For more information on how Google Analytics uses data collected through our services, visit http://www.google.com/policies/privacy/partners. To opt out of Google Analytics cookies, visit https://tools.google.com/dlpage/gaoptout or download the Google Analytics Opt-Out Browser Add-On. Sensory Data. In order to provide you with the best possible support, prevent fraud, and improve our Services. We may also use surveillance cameras on our property in order to provide security. C. Information Provided to Us by Other Sources To improve the quality of our Services, and to carry out research and analysis, we and our vendors may supplement the information we collect with information from other sources, such as publicly available information, commercially available sources, and information from our business partners or other third parties. III. USE OF INFORMATION We may use the information we collect through the Services or otherwise obtain for a number of purposes including to: • Provide our Services; • Understand and improve our operations, Services, and performance; • Assist in customer service and transactions; • Generate feedback regarding the Services which we offer; • Conduct research or for analytics purposes; • Develop new Services; • Deliver marketing communications or promotional materials that may be of interest to you; • Improve the services we provide and the usefulness of the Services; • Customize our users’ experience when using the Services; • Protect ourselves and our users; and/or • Comply with applicable laws. IV. WHY WE MAY DISCLOSE INFORMATION We may disclose your personal information with other parties as follows: Provision of Services. We may disclose your personal information with our business partners, vendors, and service providers in order to provide our Services, including as necessary for financial transactions, to conduct due diligence, to 3 / 5 detect and prevent fraud, to comply with applicable laws and/or contractual obligations, to ensure quality of our Services, and as otherwise necessary to support our Services. Law Enforcement, Judicial, Administrative, or Regulatory Disclosures. When we believe in good faith that the law requires disclosure or that disclosure is necessary to protect or enforce the rights, property, safety, or security of ourselves or others. Business Transfers. In connection with sale of the applicable business, a portion of the business, or certain stock and/or assets, or a corporate merger, consolidation, restructuring, or other corporate change including, without limitation, during the course of any due diligence process. Marketing and Advertisements. We may disclose your personal information to our vendors or third parties to facilitate marketing and provide you with advertisements which may interest you. Sweepstakes, Contests, and Promotions. We may offer sweepstakes, contests, and other promotions (each, a “Promotion”), including Promotions jointly sponsored or offered by third parties which may require submitting personal information. If you voluntarily choose to enter a Promotion, your information may be disclosed to us, our co-sponsors, service providers, and other third parties, including for administrative purposes and as required by law (e.g., on a winner’s list). By entering, you are agreeing to the official rules that govern that Promotion, which may include consent to additional or differing data practices from those contained in this Privacy Policy. Please review those rules carefully. V. CHOICES YOU HAVE ABOUT YOUR INFORMATION You may always limit the amount and type of information that we collect from you by choosing not to enter or provide information requested from you on our Services. However, some of our features and Services can only be provided to you if you provide us with requested information (including, in some instances, personal information). Some of the Services offered may ask whether you wish to opt out or opt into our contact lists for offers, promotions and additional Services that may be of interest to you. VI. DO NOT TRACK SIGNALS Some web browsers may transmit “Do-Not-Track” signals to websites with which the browser communicates. As with many other companies, we do not currently respond to these signals. VII. HOW WE SECURE YOUR INFORMATION Palm Terrace is committed to protecting the confidentiality and security of your information against unauthorized access and disclosure. We only disclose your personal information to our personnel or others who need to know the information to service your account or to provide our Services, and as otherwise permitted or required by law. We maintain strict physical, electronic, and procedural safeguards to protect your information. VIII. OUR POLICY ON THE INFORMATION OF CHILDREN Palm Terrace does not seek or knowingly collect personal information from children under the age of thirteen (13), and we request that children do not provide information through the 4 / 5 Services. If you are a parent or guardian and become aware that your child has provided us with information, please contact us using one of the methods specified below, and we will work with you to address the issue. IX. INTERNATIONAL TRANSFERS We are a United States company and we provide our Services subject to United States law. However, we may transfer information to our affiliates, vendors, and business partners in other countries around the world, subject to applicable laws, and as a result personal information may be transferred to, processed, and stored in the other countries. As such, courts, law enforcement, and authorities in other countries may, in certain circumstances, be entitled to access your personal information. By using the Services or providing us with any information through the Services, you consent to this potential transfer, processing and storage of your information, and you acknowledge that other countries and jurisdictions may not provide the same privacy protections and their privacy laws may not be as comprehensive as those in the United States or in the country where you reside or are a citizen. X. CHANGES TO THE PRIVACY POLICY We reserve the right to amend this Privacy Policy at any time to reflect technological advancements, legal and regulatory changes and good business practices or otherwise at our discretion subject to applicable laws. If we make any changes, a new Privacy Policy will reflect those changes and the effective date of the revised Privacy Policy will be set forth at the top of the Privacy Policy. Your continued use of the Services after we make changes to this Privacy Policy is deemed to be acceptance of those changes, so please check this Privacy Policy periodically for updates. XI. HOW TO CONTACT US If you have any questions or comments about this Privacy Policy or the ways in which we use information subject to this statement, please do not hesitate to contact us by emailing pmt@cobblestoneassets.com, writing to 3223 N Lockwood Ridge Road, Sarasota, FL 34234, or calling us at 941.529.7005. Palm Terrace Online Terms of Use These Terms of Use or “Terms” apply to your use of or access to our online interfaces and digital properties, including our websites that link to these Terms (collectively, the “Sites”). “Palm Terrace,” “we,” “us,” or “our” mean Palm Terrace and/or one of our brands, affiliates, or subsidiaries. By using or accessing the Sites, you acknowledge that you have read, understood, and agreed to be bound by these Terms and our Privacy Policy, which contains important information about how we process personal information we may obtain through the Sites and is incorporated into these Terms by reference. If you do not wish to be bound by these Terms, please discontinue using and accessing the Sites. PLEASE READ THESE TERMS CAREFULLY BEFORE ACCESSING OR USING THE SITES. THESE TERMS INCLUDE AN ARBITRATION CLAUSE AND A WAIVER OF YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE LAWSUIT. THESE TERMS TAKE EFFECT WHEN YOU ACCESS OR USE THE SITES. BY ACCESSING OR USING THE SITES, YOU ATTEST THAT YOU ARE AT LEAST THE AGE OF MAJORITY IN YOUR STATE OF RESIDENCE AND ARE LEGALLY CAPABLE OF ENTERING INTO A BINDING CONTRACT. We reserve the right to change these Terms at any time, in our sole discretion and without prior notice. We will indicate changes to these Terms by updating the “Effective Date” above. Your use of the Sites following a change to these Terms signals your acceptance of the modification(s). Some areas or functionalities of the Sites may have additional terms and conditions that apply to your access or use of those areas or functionalities of the Sites (“Additional Terms”). If there is a conflict or inconsistency between these Terms and any Additional Terms, the Additional Terms shall govern your access and use of the respective area or functionality of the Sites. 1. LIMITED LICENSE Subject to your compliance with these Terms, you are granted a limited, non-exclusive, revocable, non-sublicensable, non-transferable license to access the Sites in accordance with the requirements and restrictions set forth below. If you do not agree to these Terms, or any amended Terms, you may not access or use the Sites for any purpose and shall promptly discontinue such use of the Sites. 2. INTELLECTUAL PROPERTY RIGHTS The Sites and all of their content and information (collectively, “Content”), including all copyrights, trademarks, service marks, trade names, and all other intellectual property rights (“Intellectual Property”) are owned and controlled by us, our subsidiaries, or our licensors, and are protected by copyright or other applicable intellectual property laws. You may print one copy of the Content for your personal non-commercial use only. You may not, however, copy, use, reproduce, or distribute the Content or otherwise use our Intellectual Property in any way, absent specific, prior written permission from us. 3. CONTENT DISCLAIMER The Content was believed to be accurate at the time it was published. Although we may periodically update the Content, it is subject to change without notice, and we make no guarantee as to the timeliness or accuracy of any Content presented on this Sites at the time accessed. We are not responsible, and hereby disclaim liability, for any errors, omissions, or availability of the Content. The Sites and Content are provided on an “as is,” and “as available” basis without representation or warranty of any kind whatsoever. We reserve the right to add, remove, and change information at any time without notice in our sole discretion. 4. USE OF THE SITES The Sites are intended for personal use only. You agree not to use the Sites for any commercial purposes. You further agree that you will not: Access or use the Sites (or any portion thereof) in violation of these Terms or applicable laws; Attempt to modify, alter, recreate, or otherwise use the Sites for any purpose other than as specifically permitted in these Terms; Attempt to probe, scan, or assess the vulnerability of the Sites; Breach any security, technological, or authentication measures on the Sites; Use any device, software, or routine to attempt to interfere with the Sites or otherwise disrupt the Sites or servers or networks connected to the Sites; Use any robot, spider, scraper, data mining tools, data gathering and extraction tools, or other automatic device or manual process to access, copy, or scrape the Sites for any purpose; Collect or store personal information about other users of the Sites without their consent; Use any part or feature of the Sites for any purpose that is unlawful, tortious, libelous, defamatory, obscene, threatening, or intrusive on another person’s privacy; Use the Sites to harm or harass any person or entity; Take any action that imposes, in the Company’s sole discretion, an unreasonable or disproportionately large load on the Company’s infrastructure; or Use the Sites for any reason for which the Sites are not intended. The Company reserves the right, in its sole discretion and without limiting its other remedies, to restrict, suspend, or terminate your access to, or use of, the Sites at any time with or without cause, including if the Company believes that you may be in breach of these Terms or applicable laws or are misusing the Sites. 5. REGISTRATION Some Sites may permit or require you to register for an online account with a user ID and/or password (“Login Credentials”). Otherwise, no account is needed to access the Sites. Your Login Credentials and any information that you provide in connection with your account must remain accurate and complete at all times. You are responsible for maintaining the confidentiality and security of your Login Credentials, and you are fully responsible for any and all access and use of your account. Please notify us immediately of any unauthorized use of your account, or any other known or suspected breach of security, including without limitation any loss, theft, or unauthorized use of your Login Credentials. If we have reasonable grounds to suspect that the security of your Login Credentials has been compromised, we may suspend or terminate your account, refuse any and all current or future use of the services, and pursue any appropriate legal remedies. 6. LINKS TO EXTERNAL WEBSITES The Sites may include links to external websites or resources, for your convenience. Such third-party websites contain information created, published, maintained, or otherwise posted by organizations and entities independent of us. We are not responsible for the content of those websites, nor do we approve, endorse, or certify information available at these websites or any linked addresses contained therein. We make no warranties and hereby disclaim all liability as to the accuracy of the content and to any representations made concerning the quality of products or services provided on those websites or pages. We are also not responsible for the privacy policies or practices of those websites or of those companies. 7. SUBMISSIONS TO THE SITES By providing information or materials to the Sites (other than personal information, which is subject to our Privacy Policy), you grant to us an unrestricted, irrevocable, worldwide, royalty-free license to use, reproduce, display, publicly perform, and transmit such information and materials for any purpose, including without limitation, disclosing any such information and materials as necessary to satisfy any law, regulation, or governmental request. You are prohibited from submitting or transmitting any material or communication through the Sites that we deem discriminatory, racist, offensive, pornographic, defamatory, harassing, threatening, inappropriate, violates any law, or infringes on any third party’s intellectual property rights. We reserve the right to take any available steps to prevent or prohibit any such transmission that violates this provision, which shall be determined at our sole discretion, and to take any appropriate legal action. 8. CHANGES TO THE SITES; TERMINATION OF ACCESS We reserve the right to, at any time, modify, suspend, discontinue, or reduce the functionality of the Sites (or any portion thereof), temporarily or permanently, with or without notice. In addition, we may suspend or terminate your access to the Sites at any time for any reason, at our sole discretion and without prior notice. To the fullest extent permitted by applicable law, you agree that we shall not be liable to you or to any third party for any modification, suspension, or discontinuance of the Sites (or any portion thereof) for any reason at any time. 9. DISCLAIMER OF WARRANTIES AND LIABILITY Your use of this website and Content is at your own risk. Content may become inaccurate as a result of developments after its publication on these Sites. We assume no responsibility to keep Content current or to correct inaccuracies or errors in Content. The Content on these Sites and the operation of them are provided “as is,” and we disclaim all representations or warranties of any kind, either express or implied, including warranties of merchantability, fitness for particular purpose, title, non-infringement, accuracy, completeness, and timeliness. Certain jurisdictions may not permit certain disclaimers of warranties. In such case, we disclaim warranties to the fullest extent permitted by the applicable law. WE SPECIFICALLY DISCLAIM ANY LIABILITY, whether based in contract, tort, negligence, strict liability, or otherwise, for damages of any kind including, but not limited to, any direct, indirect, incidental, consequential, special, punitive, and/or exemplary damages caused by, arising out of, and/or in any way connected with functionality or operation of, access to, use of, or reliance on the Sites or the Content (even if we or our representatives have been advised of the possibility of such damages) or that are caused by and/or arise in connection with mistakes or omissions in, or delays in transmission of, information to or from the Sites, interruptions in telecommunications connections to the Sites, or viruses that may infect your computer equipment or other property, whether caused in whole or in part by negligence, acts of God, telecommunications failure, theft, or destruction of, or unauthorized access to the Sites or the Content. This limitation of liability may be different in connection with specific products and services offered by us. Some states do not allow the limitation of liability, so the foregoing limitation may not apply to you. 10. INDEMNIFICATION You agree to defend and indemnify us, our affiliates, employees, and officers of each, from and against any and all third-party claims, debts, losses, liabilities, demands, obligations, actions, and causes of action, alleged claims or litigation, damages, judgments, judgments for damages, fines, penalties, expenses, and costs (including, but not limited to, reasonable attorneys’ fees) caused by, arising out of, or resulting from your use of the Sites or the Content in a manner not expressly authorized by these Terms or that violates these Terms, any law, or the rights of a third party. 11. DISPUTE RESOLUTION: MANDATORY BINDING INDIVIDUAL ARBITRATION AND CLASS AND COLLECTIVE ACTION WAIVER The exclusive means of resolving any claim related to your use of the Sites or these Terms shall be BINDING ARBITRATION. Except as provided below in the case of a Mass Filing, the arbitration will be administered by JAMS under the JAMS Streamlined Arbitration Rules & Procedures. If you are a consumer, as defined by JAMS in its Consumer Minimum Standards, you may request that the arbitration hearing be conducted in the area in which you reside. Otherwise, the hearing (if any) shall take place in Sarasota County, Florida, United States of America. You agree to first give us an opportunity to resolve any claims by contacting us in writing (the “Claims Notice”). After receipt of a Claims Notice, we may request an individualized video or telephone conference which both parties will personally attend (with counsel, if represented). If we are not able to resolve your claims within sixty (60) days of receiving the Claims Notice, you may seek relief through arbitration, as set forth in this section. You agree that you will not take any legal action, including any demand for arbitration, until after the expiration of this 60-day dispute resolution period. EACH PARTY WAIVES ITS RIGHTS TO GO TO COURT, TO A TRIAL BY JURY, AND TO PARTICIPATE IN A CLASS ACTION, CLASS ARBITRATION, OR OTHER REPRESENTATIVE PROCEEDING WITH RESPECT TO ANY COVERED CLAIM. If, at any time, twenty-five (25) or more claimants (including you) submit demands or seek to file demands for arbitration raising similar claims against us, and such circumstances meet the definition and criteria of Mass Filings (“Mass Filing”) set forth in National Arbitration & Mediation's (“NAM”) Mass Filing Supplemental Dispute Resolution Rules and Procedures (“NAM's Mass Filing Rules,” available at https://www.namadr.com/resources/rules-fees-forms/), you and we agree that JAMS shall not serve as the arbitration administrator and that instead NAM shall administer any such Mass Filing and the NAM Mass Filing Rules in effect at the time such claim is filed shall apply. You agree that throughout this process, the parties' counsel shall meet and confer to discuss modifications to these procedures, including the possibility of procedural consolidation of similar claims for arbitration, based on the particular needs of the Mass Filing. You acknowledge and agree that by electing to participate in a Mass Filing, the adjudication of your dispute might be delayed. You and we agree that each party values the integrity and efficiency of arbitration and wishes to employ the process for the fair resolution of genuine and sincere disputes between the parties. You and we acknowledge and agree to act in good faith to ensure the processes set forth herein are followed. 12. GOVERNING LAW AND JURISDICTION These Terms shall be governed by, and construed in accordance with, the laws of the United States and the State of Florida, without giving effect to conflict of law principles thereof. Subject to Section 11, you hereby consent and submit to personal jurisdiction in the state and federal courts located in Sarasota County, Florida. 13. COMPLIANCE WITH LAW We provide our Sites in accordance with United States law. By using our Sites or providing us with any information through the Sites, you acknowledge that our Sites are subject to United States law and that other countries and jurisdictions may not provide the same rights or protections as those in the United States or in the country where you reside or are a citizen. Persons who access these Sites do so on their own initiative and are responsible for compliance with applicable local laws and regulations. By downloading software or other material from the Sites, you represent and warrant that you are able to do so in full compliance with the laws of the United States and your resident country, including any applicable export controls. 14. GENERAL INFORMATION Except for any Additional Terms that apply, this is the entire understanding between you and us regarding the use of the Sites and supersedes all prior and contemporaneous agreements and understandings between you and us regarding this subject matter. If any provision of these Terms is held to be invalid or unenforceable, it will not affect the validity or enforceability of any other provision hereof. The failure of the Company to exercise or enforce any right or provision of these Terms shall not constitute a waiver of such right or provision. 15. CONTACT INFORMATION If you have questions regarding these Terms of Use, you can contact us by email at pmt@cobblestoneassets.com , by phone at 941.529.7005, or by postal mail at 3223 N Lockwood Rd., Sarasota, FL 34234."
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48061-palm-terrace-village-3260-west-kevin-lane-lecanto-fl-34461",
      "text": "Palm Terrace Village | 3260 West Kevin Lane, Lecanto, FL 34461 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Palm Terrace Village 3260 West Kevin Lane location_on Map It Lecanto, FL 34461 | ID: 48061 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ALL AGES PHOTOS VIDEO STREET VIEW 28.8218071 -82.4904067 953521 3260 West Kevin Lane, Lecanto, FL 34461 Details Name Palm Terrace Village Type of community All-ages community ? Lot rent range $350 - $750 Office Phone (352) 527-0800 Total # of lots 91 Property manager on site check Water type City Sewer type City provided Street width Average Parking Off-street Street type Paved Climate Zone Rating HOT-HUMID MORE OWNER/MANAGER? CLAIM THIS COMMUNITY Call Us (352) 527-0800 Sales & Leasing input SEND TO MY PHONE About lot rent The lot rent ranges from $350 - $750 per month and includes: check Trash pickup check Water Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Palm Terrace Village is an all-ages manufactured home community located in 3260 West Kevin Lane, Lecanto, FL 34461. Palm Terrace Village is a land-lease community and has a total of 91 home sites. Home site lot rent ranges from $350 - $750 per month and includes the following: Trash pickup Water The streets in the community are paved, and are of an average street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Palm Terrace Village is an affordable housing choice for active, family-friendly living. This well-maintained community has easy access to local schools, recreation, shopping and entertainment. Equal Housing Opportunity Local Climate HOT-HUMID Palm Terrace Village is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Palm Terrace Village at 3260 West Kevin Lane, Lecanto, FL 34461 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Stonebrook Homosassa, FL Features pool Pool Forest View Homosassa, FL Features pool Pool Sun Retreats Crys... Crystal River, FL Community Type family_restroom All Ages About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://palmterracefl.com/contact-us/",
      "text": "Contact Our Team | Sarasota Manufactured Home & RV Community 941.529.7005 Email Us Resident Portal Join Our Newsletter 9415297005 Available Homes RV Stays Lifestyle Gallery Location Specials FAQ Contact Us Contact Us Send us a message Δ First * Last * Email * Phone Message Text Message Consent Yes, I would like to receive SMS updates with the latest information and offers* * Disclaimer: By checking this box, I consent to receive SMS messages from Palm Terrace, managed by Cobblestone Assets, regarding updates, offers, and information. Message and data rates may apply. You may opt-out at any time. Visit Us 3223 N. Lockwood Ridge Rd. Sarasota, Fl 34234 Call Us 941.529.7005 office hours Monday - Saturday 9:00am – 4:00pm Sales Office Tuesday - Saturday 9:00am – 5:00pm CONTACT 941.529.7005 3223 N. Lockwood Ridge Road Sarasota, FL 34234 © Palm Terrace All rights reserved Privacy Policy Terms of Use Do Not Sell or Share My Personal Information Palm Terrace Privacy Policy This Privacy Policy describes how Palm Terrace collects, uses, and discloses your personal information. This Privacy Policy should be read in conjunction with our Terms of Service, and any other policy, agreement, or terms which may affect your relationship with us. I. SCOPE OF THIS POLICY This Privacy Policy applies to https://palmterracefl.com including all its sub-domains and other websites that link to this Privacy Policy, when accessing and using them in the United States, as well as any of our other services and tools that might be made available by us from time to time, including offline tools, surveys, applications, services, advertisements, events, and promotions (collectively, “Services”). We may provide links to external-party websites that are not owned by Palm Terrace has no control over external-party privacy practices and assumes no responsibility in connection with your use of external-party websites, applications, or any other services offered by other parties. Any external-party services are governed by the privacy policies appearing on those sites and applications. By using the Services, you signify your consent to this Privacy Policy and the Terms of Service for the use of our Services. If you do not agree to this Privacy Policy or Terms of Service for the use of our Services, please do not use our Services. II. INFORMATION THAT WE COLLECT OR RECEIVE We collect and receive information from and about you by different means, including, without limitation: (i) information you submit or provide to us; (ii) information collected automatically and manually; and (iii) information provided to us by other sources. Some of the information we collect and receive includes “personal information,” which is generally information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with you. Personal information does not include information that is publicly available, de-identified, aggregated, or otherwise exempted by applicable laws. The information we may collect will vary and depend on the nature of your relationship with us and the reason(s) for providing/collecting the information. A. Information You Submit or Provide to Us We or our vendors collect the information that you directly provide to us, such as when you enter it on a webpage, submit an online form, use a chat feature we may offer, or include it in an email that you send to us in relation to our Services. In addition, we may collect information through relevant business support processes, during the registration or account creation processes, and through other business functions where we ask you to provide information, including: Contact Information (e.g., name, email or mailing address, or phone number); Account Administration Information (e.g., username, 1 / 5 password, or security questions); Communications (e.g., information you submit through our interactive chat feature or through other communications with us, including potential customer service call recordings); Payments and financial information (e.g., information necessary to process transactions, conduct due diligence, as part of an application, or for other business needs); Employment-related information and education information (e.g., information you may provide when applying for a job, or which may be included as part of an application); Demographic information (e.g., ethnicity, sex, gender, birth date, age, languages spoken, disability, housing status, household size, household type, family members, marital status, annual income, desired housing characteristics and desired housing location or community); Location information (e.g., geolocation inferred from your access to our websites or from your device); and Commercial records, customer records, and preference information (e.g., your purchase history, leasing details, rental history, property records, tenant data, and related information). Your use of interactive features we may offer on our Services is voluntary, and we may retain the information that you submit through these features. If you participate in interactive chat, either with a virtual or live agent, the contents of the chat may be captured by us or our service provider and kept as a transcript. If you use these features, you understand that our vendors may process the information obtained through the feature to provide the Service on our behalf. If you submit personal information of other people to us, e.g., when participating in a resident referral program we may offer, you represent that you have permission and authority to provide us with such personal information. If you do not have permission, please do not provide us with their information. B. Types of Information Collected Automatically We may automatically or manually collect information related to your use of Services. For example, data collected in this manner may include: Web Browsing Data. When you use our Services, our servers may automatically record information, including information that your browser or mobile device sends when you visit or use our Services. Technical Information. We may collect certain technical information about your computer systems or about your visits to our online environments when you use our Services. Device Information. We may collect information about the device you are using to access our Services, including what type of device it is, what operating system you are using, device settings, unique device identifiers and crash data. Cookie Data. Depending on how you are accessing our online environments, we may use “cookies” (a small text file sent by your device each time you visit our websites, unique to your Palm Terrace account or your browser). When we use cookies, we may use “session” cookies (that last until you close your browser) or “persistent” cookies (that last until you or your browser delete them). For example, we may use cookies to 2 / 5 remember your personal preferences, such as sections of our Services that you visit frequently, your user ID or other settings so you do not have to set them up every time you visit our Services. Some of the cookies we use may be associated with your Palm Terrace account (including information about you, such as the email address you gave us), and other cookies are not. In addition, we may use web beacons, pixels, or other web programming code or embedded scripts. Analytics Data. We may use Google Analytics or other providers for analytics services. We may also implement Google Analytics Advertising Features such as remarketing with analytics and interest-based ads. We may use first-party cookies or other first- party identifiers as well as third-party cookies or other third-party identifiers to, e.g., deliver advertisements, measure your interests, and/or personalize content. For more information on how Google Analytics uses data collected through our services, visit http://www.google.com/policies/privacy/partners. To opt out of Google Analytics cookies, visit https://tools.google.com/dlpage/gaoptout or download the Google Analytics Opt-Out Browser Add-On. Sensory Data. In order to provide you with the best possible support, prevent fraud, and improve our Services. We may also use surveillance cameras on our property in order to provide security. C. Information Provided to Us by Other Sources To improve the quality of our Services, and to carry out research and analysis, we and our vendors may supplement the information we collect with information from other sources, such as publicly available information, commercially available sources, and information from our business partners or other third parties. III. USE OF INFORMATION We may use the information we collect through the Services or otherwise obtain for a number of purposes including to: • Provide our Services; • Understand and improve our operations, Services, and performance; • Assist in customer service and transactions; • Generate feedback regarding the Services which we offer; • Conduct research or for analytics purposes; • Develop new Services; • Deliver marketing communications or promotional materials that may be of interest to you; • Improve the services we provide and the usefulness of the Services; • Customize our users’ experience when using the Services; • Protect ourselves and our users; and/or • Comply with applicable laws. IV. WHY WE MAY DISCLOSE INFORMATION We may disclose your personal information with other parties as follows: Provision of Services. We may disclose your personal information with our business partners, vendors, and service providers in order to provide our Services, including as necessary for financial transactions, to conduct due diligence, to 3 / 5 detect and prevent fraud, to comply with applicable laws and/or contractual obligations, to ensure quality of our Services, and as otherwise necessary to support our Services. Law Enforcement, Judicial, Administrative, or Regulatory Disclosures. When we believe in good faith that the law requires disclosure or that disclosure is necessary to protect or enforce the rights, property, safety, or security of ourselves or others. Business Transfers. In connection with sale of the applicable business, a portion of the business, or certain stock and/or assets, or a corporate merger, consolidation, restructuring, or other corporate change including, without limitation, during the course of any due diligence process. Marketing and Advertisements. We may disclose your personal information to our vendors or third parties to facilitate marketing and provide you with advertisements which may interest you. Sweepstakes, Contests, and Promotions. We may offer sweepstakes, contests, and other promotions (each, a “Promotion”), including Promotions jointly sponsored or offered by third parties which may require submitting personal information. If you voluntarily choose to enter a Promotion, your information may be disclosed to us, our co-sponsors, service providers, and other third parties, including for administrative purposes and as required by law (e.g., on a winner’s list). By entering, you are agreeing to the official rules that govern that Promotion, which may include consent to additional or differing data practices from those contained in this Privacy Policy. Please review those rules carefully. V. CHOICES YOU HAVE ABOUT YOUR INFORMATION You may always limit the amount and type of information that we collect from you by choosing not to enter or provide information requested from you on our Services. However, some of our features and Services can only be provided to you if you provide us with requested information (including, in some instances, personal information). Some of the Services offered may ask whether you wish to opt out or opt into our contact lists for offers, promotions and additional Services that may be of interest to you. VI. DO NOT TRACK SIGNALS Some web browsers may transmit “Do-Not-Track” signals to websites with which the browser communicates. As with many other companies, we do not currently respond to these signals. VII. HOW WE SECURE YOUR INFORMATION Palm Terrace is committed to protecting the confidentiality and security of your information against unauthorized access and disclosure. We only disclose your personal information to our personnel or others who need to know the information to service your account or to provide our Services, and as otherwise permitted or required by law. We maintain strict physical, electronic, and procedural safeguards to protect your information. VIII. OUR POLICY ON THE INFORMATION OF CHILDREN Palm Terrace does not seek or knowingly collect personal information from children under the age of thirteen (13), and we request that children do not provide information through the 4 / 5 Services. If you are a parent or guardian and become aware that your child has provided us with information, please contact us using one of the methods specified below, and we will work with you to address the issue. IX. INTERNATIONAL TRANSFERS We are a United States company and we provide our Services subject to United States law. However, we may transfer information to our affiliates, vendors, and business partners in other countries around the world, subject to applicable laws, and as a result personal information may be transferred to, processed, and stored in the other countries. As such, courts, law enforcement, and authorities in other countries may, in certain circumstances, be entitled to access your personal information. By using the Services or providing us with any information through the Services, you consent to this potential transfer, processing and storage of your information, and you acknowledge that other countries and jurisdictions may not provide the same privacy protections and their privacy laws may not be as comprehensive as those in the United States or in the country where you reside or are a citizen. X. CHANGES TO THE PRIVACY POLICY We reserve the right to amend this Privacy Policy at any time to reflect technological advancements, legal and regulatory changes and good business practices or otherwise at our discretion subject to applicable laws. If we make any changes, a new Privacy Policy will reflect those changes and the effective date of the revised Privacy Policy will be set forth at the top of the Privacy Policy. Your continued use of the Services after we make changes to this Privacy Policy is deemed to be acceptance of those changes, so please check this Privacy Policy periodically for updates. XI. HOW TO CONTACT US If you have any questions or comments about this Privacy Policy or the ways in which we use information subject to this statement, please do not hesitate to contact us by emailing pmt@cobblestoneassets.com, writing to 3223 N Lockwood Ridge Road, Sarasota, FL 34234, or calling us at 941.529.7005. Palm Terrace Online Terms of Use These Terms of Use or “Terms” apply to your use of or access to our online interfaces and digital properties, including our websites that link to these Terms (collectively, the “Sites”). “Palm Terrace,” “we,” “us,” or “our” mean Palm Terrace and/or one of our brands, affiliates, or subsidiaries. By using or accessing the Sites, you acknowledge that you have read, understood, and agreed to be bound by these Terms and our Privacy Policy, which contains important information about how we process personal information we may obtain through the Sites and is incorporated into these Terms by reference. If you do not wish to be bound by these Terms, please discontinue using and accessing the Sites. PLEASE READ THESE TERMS CAREFULLY BEFORE ACCESSING OR USING THE SITES. THESE TERMS INCLUDE AN ARBITRATION CLAUSE AND A WAIVER OF YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE LAWSUIT. THESE TERMS TAKE EFFECT WHEN YOU ACCESS OR USE THE SITES. BY ACCESSING OR USING THE SITES, YOU ATTEST THAT YOU ARE AT LEAST THE AGE OF MAJORITY IN YOUR STATE OF RESIDENCE AND ARE LEGALLY CAPABLE OF ENTERING INTO A BINDING CONTRACT. We reserve the right to change these Terms at any time, in our sole discretion and without prior notice. We will indicate changes to these Terms by updating the “Effective Date” above. Your use of the Sites following a change to these Terms signals your acceptance of the modification(s). Some areas or functionalities of the Sites may have additional terms and conditions that apply to your access or use of those areas or functionalities of the Sites (“Additional Terms”). If there is a conflict or inconsistency between these Terms and any Additional Terms, the Additional Terms shall govern your access and use of the respective area or functionality of the Sites. 1. LIMITED LICENSE Subject to your compliance with these Terms, you are granted a limited, non-exclusive, revocable, non-sublicensable, non-transferable license to access the Sites in accordance with the requirements and restrictions set forth below. If you do not agree to these Terms, or any amended Terms, you may not access or use the Sites for any purpose and shall promptly discontinue such use of the Sites. 2. INTELLECTUAL PROPERTY RIGHTS The Sites and all of their content and information (collectively, “Content”), including all copyrights, trademarks, service marks, trade names, and all other intellectual property rights (“Intellectual Property”) are owned and controlled by us, our subsidiaries, or our licensors, and are protected by copyright or other applicable intellectual property laws. You may print one copy of the Content for your personal non-commercial use only. You may not, however, copy, use, reproduce, or distribute the Content or otherwise use our Intellectual Property in any way, absent specific, prior written permission from us. 3. CONTENT DISCLAIMER The Content was believed to be accurate at the time it was published. Although we may periodically update the Content, it is subject to change without notice, and we make no guarantee as to the timeliness or accuracy of any Content presented on this Sites at the time accessed. We are not responsible, and hereby disclaim liability, for any errors, omissions, or availability of the Content. The Sites and Content are provided on an “as is,” and “as available” basis without representation or warranty of any kind whatsoever. We reserve the right to add, remove, and change information at any time without notice in our sole discretion. 4. USE OF THE SITES The Sites are intended for personal use only. You agree not to use the Sites for any commercial purposes. You further agree that you will not: Access or use the Sites (or any portion thereof) in violation of these Terms or applicable laws; Attempt to modify, alter, recreate, or otherwise use the Sites for any purpose other than as specifically permitted in these Terms; Attempt to probe, scan, or assess the vulnerability of the Sites; Breach any security, technological, or authentication measures on the Sites; Use any device, software, or routine to attempt to interfere with the Sites or otherwise disrupt the Sites or servers or networks connected to the Sites; Use any robot, spider, scraper, data mining tools, data gathering and extraction tools, or other automatic device or manual process to access, copy, or scrape the Sites for any purpose; Collect or store personal information about other users of the Sites without their consent; Use any part or feature of the Sites for any purpose that is unlawful, tortious, libelous, defamatory, obscene, threatening, or intrusive on another person’s privacy; Use the Sites to harm or harass any person or entity; Take any action that imposes, in the Company’s sole discretion, an unreasonable or disproportionately large load on the Company’s infrastructure; or Use the Sites for any reason for which the Sites are not intended. The Company reserves the right, in its sole discretion and without limiting its other remedies, to restrict, suspend, or terminate your access to, or use of, the Sites at any time with or without cause, including if the Company believes that you may be in breach of these Terms or applicable laws or are misusing the Sites. 5. REGISTRATION Some Sites may permit or require you to register for an online account with a user ID and/or password (“Login Credentials”). Otherwise, no account is needed to access the Sites. Your Login Credentials and any information that you provide in connection with your account must remain accurate and complete at all times. You are responsible for maintaining the confidentiality and security of your Login Credentials, and you are fully responsible for any and all access and use of your account. Please notify us immediately of any unauthorized use of your account, or any other known or suspected breach of security, including without limitation any loss, theft, or unauthorized use of your Login Credentials. If we have reasonable grounds to suspect that the security of your Login Credentials has been compromised, we may suspend or terminate your account, refuse any and all current or future use of the services, and pursue any appropriate legal remedies. 6. LINKS TO EXTERNAL WEBSITES The Sites may include links to external websites or resources, for your convenience. Such third-party websites contain information created, published, maintained, or otherwise posted by organizations and entities independent of us. We are not responsible for the content of those websites, nor do we approve, endorse, or certify information available at these websites or any linked addresses contained therein. We make no warranties and hereby disclaim all liability as to the accuracy of the content and to any representations made concerning the quality of products or services provided on those websites or pages. We are also not responsible for the privacy policies or practices of those websites or of those companies. 7. SUBMISSIONS TO THE SITES By providing information or materials to the Sites (other than personal information, which is subject to our Privacy Policy), you grant to us an unrestricted, irrevocable, worldwide, royalty-free license to use, reproduce, display, publicly perform, and transmit such information and materials for any purpose, including without limitation, disclosing any such information and materials as necessary to satisfy any law, regulation, or governmental request. You are prohibited from submitting or transmitting any material or communication through the Sites that we deem discriminatory, racist, offensive, pornographic, defamatory, harassing, threatening, inappropriate, violates any law, or infringes on any third party’s intellectual property rights. We reserve the right to take any available steps to prevent or prohibit any such transmission that violates this provision, which shall be determined at our sole discretion, and to take any appropriate legal action. 8. CHANGES TO THE SITES; TERMINATION OF ACCESS We reserve the right to, at any time, modify, suspend, discontinue, or reduce the functionality of the Sites (or any portion thereof), temporarily or permanently, with or without notice. In addition, we may suspend or terminate your access to the Sites at any time for any reason, at our sole discretion and without prior notice. To the fullest extent permitted by applicable law, you agree that we shall not be liable to you or to any third party for any modification, suspension, or discontinuance of the Sites (or any portion thereof) for any reason at any time. 9. DISCLAIMER OF WARRANTIES AND LIABILITY Your use of this website and Content is at your own risk. Content may become inaccurate as a result of developments after its publication on these Sites. We assume no responsibility to keep Content current or to correct inaccuracies or errors in Content. The Content on these Sites and the operation of them are provided “as is,” and we disclaim all representations or warranties of any kind, either express or implied, including warranties of merchantability, fitness for particular purpose, title, non-infringement, accuracy, completeness, and timeliness. Certain jurisdictions may not permit certain disclaimers of warranties. In such case, we disclaim warranties to the fullest extent permitted by the applicable law. WE SPECIFICALLY DISCLAIM ANY LIABILITY, whether based in contract, tort, negligence, strict liability, or otherwise, for damages of any kind including, but not limited to, any direct, indirect, incidental, consequential, special, punitive, and/or exemplary damages caused by, arising out of, and/or in any way connected with functionality or operation of, access to, use of, or reliance on the Sites or the Content (even if we or our representatives have been advised of the possibility of such damages) or that are caused by and/or arise in connection with mistakes or omissions in, or delays in transmission of, information to or from the Sites, interruptions in telecommunications connections to the Sites, or viruses that may infect your computer equipment or other property, whether caused in whole or in part by negligence, acts of God, telecommunications failure, theft, or destruction of, or unauthorized access to the Sites or the Content. This limitation of liability may be different in connection with specific products and services offered by us. Some states do not allow the limitation of liability, so the foregoing limitation may not apply to you. 10. INDEMNIFICATION You agree to defend and indemnify us, our affiliates, employees, and officers of each, from and against any and all third-party claims, debts, losses, liabilities, demands, obligations, actions, and causes of action, alleged claims or litigation, damages, judgments, judgments for damages, fines, penalties, expenses, and costs (including, but not limited to, reasonable attorneys’ fees) caused by, arising out of, or resulting from your use of the Sites or the Content in a manner not expressly authorized by these Terms or that violates these Terms, any law, or the rights of a third party. 11. DISPUTE RESOLUTION: MANDATORY BINDING INDIVIDUAL ARBITRATION AND CLASS AND COLLECTIVE ACTION WAIVER The exclusive means of resolving any claim related to your use of the Sites or these Terms shall be BINDING ARBITRATION. Except as provided below in the case of a Mass Filing, the arbitration will be administered by JAMS under the JAMS Streamlined Arbitration Rules & Procedures. If you are a consumer, as defined by JAMS in its Consumer Minimum Standards, you may request that the arbitration hearing be conducted in the area in which you reside. Otherwise, the hearing (if any) shall take place in Sarasota County, Florida, United States of America. You agree to first give us an opportunity to resolve any claims by contacting us in writing (the “Claims Notice”). After receipt of a Claims Notice, we may request an individualized video or telephone conference which both parties will personally attend (with counsel, if represented). If we are not able to resolve your claims within sixty (60) days of receiving the Claims Notice, you may seek relief through arbitration, as set forth in this section. You agree that you will not take any legal action, including any demand for arbitration, until after the expiration of this 60-day dispute resolution period. EACH PARTY WAIVES ITS RIGHTS TO GO TO COURT, TO A TRIAL BY JURY, AND TO PARTICIPATE IN A CLASS ACTION, CLASS ARBITRATION, OR OTHER REPRESENTATIVE PROCEEDING WITH RESPECT TO ANY COVERED CLAIM. If, at any time, twenty-five (25) or more claimants (including you) submit demands or seek to file demands for arbitration raising similar claims against us, and such circumstances meet the definition and criteria of Mass Filings (“Mass Filing”) set forth in National Arbitration & Mediation's (“NAM”) Mass Filing Supplemental Dispute Resolution Rules and Procedures (“NAM's Mass Filing Rules,” available at https://www.namadr.com/resources/rules-fees-forms/), you and we agree that JAMS shall not serve as the arbitration administrator and that instead NAM shall administer any such Mass Filing and the NAM Mass Filing Rules in effect at the time such claim is filed shall apply. You agree that throughout this process, the parties' counsel shall meet and confer to discuss modifications to these procedures, including the possibility of procedural consolidation of similar claims for arbitration, based on the particular needs of the Mass Filing. You acknowledge and agree that by electing to participate in a Mass Filing, the adjudication of your dispute might be delayed. You and we agree that each party values the integrity and efficiency of arbitration and wishes to employ the process for the fair resolution of genuine and sincere disputes between the parties. You and we acknowledge and agree to act in good faith to ensure the processes set forth herein are followed. 12. GOVERNING LAW AND JURISDICTION These Terms shall be governed by, and construed in accordance with, the laws of the United States and the State of Florida, without giving effect to conflict of law principles thereof. Subject to Section 11, you hereby consent and submit to personal jurisdiction in the state and federal courts located in Sarasota County, Florida. 13. COMPLIANCE WITH LAW We provide our Sites in accordance with United States law. By using our Sites or providing us with any information through the Sites, you acknowledge that our Sites are subject to United States law and that other countries and jurisdictions may not provide the same rights or protections as those in the United States or in the country where you reside or are a citizen. Persons who access these Sites do so on their own initiative and are responsible for compliance with applicable local laws and regulations. By downloading software or other material from the Sites, you represent and warrant that you are able to do so in full compliance with the laws of the United States and your resident country, including any applicable export controls. 14. GENERAL INFORMATION Except for any Additional Terms that apply, this is the entire understanding between you and us regarding the use of the Sites and supersedes all prior and contemporaneous agreements and understandings between you and us regarding this subject matter. If any provision of these Terms is held to be invalid or unenforceable, it will not affect the validity or enforceability of any other provision hereof. The failure of the Company to exercise or enforce any right or provision of these Terms shall not constitute a waiver of such right or provision. 15. CONTACT INFORMATION If you have questions regarding these Terms of Use, you can contact us by email at pmt@cobblestoneassets.com , by phone at 941.529.7005, or by postal mail at 3223 N Lockwood Rd., Sarasota, FL 34234."
    },
    {
      "url": "https://www.palmbeachsports.com/about-us/board-and-committees-2/",
      "text": "Board and Committees - Palm Beach County Sports Commission Hotels Giving Back Videos Gallery Careers Grant Application Donate Member Login About Us About Us Board and Committees Staff Pay Dues Online Grant Application Brand Assets Meeting Notices Facilities All Facilities Hotels Facility Guide Events Upcoming Events The Ultimate Weeks of Sport are Coming to The Palm Beaches The Palm Beach County Sports Hall of Fame The Palm Beaches Golf Classic Kids Fitness Festival of The Palm Beaches Holiday Basketball Classic of The Palm Beaches Lou Groza Award Celebration News The Palm Beaches Play in The Palm Beaches Discover the Palm Beaches Golf Palm Beaches TV Hotels Get Involved Memberships Volunteer Opportunities Support Sports License Tags Contact Us Board & Committees The Board of Directors aids the Palm Beach County Sports Commission to achieve its mission. Board of Directors Eric M. Call Palm Beach County Parks and Recreation, Retired Jon Carter Palm Beach County Jennifer Cirillo Palm Beach County Parks and Recreation William C. Davis Private Funding Specialists Bishop W. Oshea Granger Mount Calvary Baptist Church Susan Guinan Vinceremos Therapeutic Riding Center Malachi Knowles Inner City Youth Golfers, Inc.; African American Golfers Hall of Fame Anthony M. Lofaso Palm Planning Group Doug Mosley ESPN - Boca Raton Bowl Stephanie Prince Good Karma Brands Guy E. Quattlebaum, Esq. Law Offices of James N. Brown, PA & Associates Steve Rockoff The Corcoran Group Larry Schner Sachs, Sax & Caplan, Attorneys at Law John Smith PopStroke Entertainment Group Maricela Torres Esperanza Community Center Dr. Gary Vonk Keiser University Jeff Zipper Fifth Third Private Bank Palm Beach County Sports Commission Officers Doug Mosley President Bishop W. Oshea Granger Vice President Steve Rockoff Secretary & Treasurer Tourist Development Council Liaison Don Dufresne Becker Ex-Officio Directors Jim Barnes Village of Wellington Mike Bauer Roger Dean Chevrolet Stadium Martha Clark National Council on Compensation Ins. (NCCI) Dan Cornely Florida Atlantic University Jason Hagensick YMCA of South Palm Beach County Ken Kennerly K2 Sports Ventures Reginald Laroche Baptist Health Courtney Lovely Palm Beach Atlantic College Michelle McGann LPGA Golfer Steve Politziner Good Karma Brands Eric Poms Orange Bowl Committee Chris Snyder Dreyfoos School of the Arts Foundation Mike Sophia Ballpark of the Palm Beaches Robert Weinroth Brian White Florida Atlantic University Emeritus Directors Committees Audit Committee Steve Rockoff, Chair Bishop W. Oshea Granger Eric Call Marty Dytrych Anthony M. Lofaso Doug Mosley Guy Quattlebaum Larry Schner Brand Awareness Equestrian Committee Don Dufresne Susan Guinan Executive Committee Doug Mosley, President Bishop W. Oshea Granger, Vice President Steve Rockoff, Sec./Treas. Anthony Lofaso, Immediate Past President Eric Call, Grant Review Committee Chair William C. Davis (At Large) Stephanie Prince (At Large) Guy Quattlebaum, Esq. (At Large) Facilities and Franchise Committee Doug Mosley, Chair Jim Barnes Mike Bauer Eric Call Susan Guinan Jason Hagensick Ken Kennerly Malachi Knowles Larry Schner Mike Sophia Dr. Gary Vonk Jeff Zipper Finance Committee Steve Rockoff, Chair Eric Call, Vice Chair Marty Dytrych Bishop W. Oshea Granger Ken Kennerly Malachi Knowles Anthony M. Lofaso John Smith Governance Committee Doug Mosley, Chair Bishop W. Oshea Granger Anthony M. Lofaso Stephanie Prince Steve Rockoff Grant Review Committee Eric Call, Chairperson John Smith, Vice Chairperson Bishop W. Oshea Granger Joan Hutchinson Ken Kennerly Anthony Lofaso Doug Mosley Stephanie Prince Jeff Zipper Hall of Fame Committee Steve Rockoff, Chair Sam Agresti Sam Budnyk Eric Call Alec Ceravolo Martha Clark Robert D'Angio William C. Davis Bill Dunn Hamid Faquire Trish Faulkner Alex Gilles Yetta Greene Dorian Hawkins Jeffrey Jackson Malachi Knowles Anthony M. Lofaso Pat Murphy Eddie Rhodes Rick Rothman Jay Seider Scott Siegel Laura South Vinny Sutherland Ed Whipple Gail Whitney Jeff Zipper Kids Fitness Festival Jeff Zipper, Chair Bobby Gilbert Malachi Knowles Sarah Mooney Chris Snyder Lou Groza Award Committee William C. Davis, Chair John Smith, Vice Chairperson Roberto Aguayo Sam Budnyk Eric Call Hamid Faquire Patrick McGlon III Doug Mosley Eric Poms Stephanie Prince Will Rhody Dan Smith Vinny Sutherland Membership Committee Malachi Knowles, Chair Marth Clark Jeff Zipper Strategic Planning Committee Vacant Seat, Chairperson Martha Clark Bishop W. Oshea Granger Malachi Knowles Guy Quattlebaum Steve Rockoff Just Bring Your Game! We would love to hear about your event! Contact us today to schedule a facility tour. Contact Us News There is always something to Discover in The Palm Beaches. Learn More Contact Us 2195 Southern Blvd, Ste 550 West Palm Beach, FL 33406 Phone: (561) 233-3180 Fax: (561) 233-3125 info@palmbeachsports.com Other Helpful Palm Beach County Agencies Convention Center Cultural Council Film & Television Commission Discover the Palm Beaches Newsletter Signup Email Address * Required CAPTCHA Submit © 2025 Palm Beach County Sports Commission | Website by Ideabar"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/54577-palm-terrace-mobile-village-12149-indiana-avenue-lot-o-riverside-ca-92503",
      "text": "Palm Terrace Mobile Village | 12149 Indiana Avenue, Lot #O, Riverside, CA 92503 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Palm Terrace Mobile Village 12149 Indiana Avenue, Lot #O location_on Map It Riverside, CA 92503 | ID: 54577 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ALL AGES PET FRIENDLY PHOTOS VIDEO STREET VIEW 33.8875559 -117.494517 962678 12149 Indiana Avenue, Lot #O, Riverside, CA 92503 Details Name Palm Terrace Mobile Village Type of community All-ages community ? Lot rent range $475 - $725 Office Phone (951) 689-4650 Total # of lots 119 Pet policy check Pet friendly See Community - Pet restrictions Community owner type Company, privately held Year built 1974 Water type City Sewer type City provided Street width Average Parking Off-street Street type Paved Climate Zone Rating HOT-DRY MORE Schedule a Visit Check out Palm Terrace Mobi... Call Us (951) 689-4650 Sales & Leasing input SEND TO MY PHONE About lot rent The lot rent ranges from $475 - $725 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Palm Terrace Mobile Village is an all-ages manufactured home community located in 12149 Indiana Avenue, Lot #O, Riverside, CA 92503. Palm Terrace Mobile Village is a land-lease community was built in 1974. and has a total of 119 home sites. Home site lot rent ranges from $475 - $725 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an average street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Palm Terrace Mobile Village is an affordable housing choice for active, family-friendly living. This well-maintained community has easy access to local schools, recreation, shopping and entertainment. Equal Housing Opportunity Amenities check Clubhouse check Recreation facilities check Swimming pool Local Climate HOT-DRY Palm Terrace Mobile Village is located in Climate Zone 2.\n        A HOT-DRY climate is defined as a region that receives less than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 45°F (7°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-DRY climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Palm Terrace Mobile Village at 12149 Indiana Avenue, Lot #O, Riverside, CA 92503 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Jurupa Hills Casc... Jurupa Valley, CA Features pool Pool Rancho Caballero Riverside, CA Community Type family_restroom All Ages Mission Village Riverside, CA Homes Ranging From $112K - $180K About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://palmterracefl.com/location/",
      "text": "Convenient Location | 55+ Community Near Siesta Key Beach 941.529.7005 Email Us Resident Portal Join Our Newsletter 9415297005 Available Homes RV Stays Lifestyle Gallery Location Specials FAQ Contact Us Location discover sarasota The Palm Terrace community is nestled in a charming and relaxed Sarasota neighborhood just 4 miles from downtown Sarasota and 10 miles from Siesta Key Beach. Here, homeowners enjoy the best of all worlds. There's the serene environment, fun-filled amenities, a low-maintenance lifestyle, and proximity to shopping, dining, entertainment, world-class golf courses, healthcare, and all imaginable conveniences. Best of all - it's affordable! SIGHTS, SCENES, & CULTURE museums & exhibits Experience art exhibits, botanical gardens, The  John & Mable Ringling Museum of Art and  The Ringling. siesta key beach Officially ranked as \"the finest, whitest sand beach in the world.\" Enjoy this award-winning beach’s quartz-crystal sand. gardens & Parks Visit Marie Selby Botanical Gardens, Bayfront Park, Sarasota Jungle Gardens, and South Lido County Park for some fresh air. downtown sarasota There is something for everyone with great restaurants, theaters, museums, and unique boutiques, and art galleries. Shopping Dining Attractions Outdoors Hospital Entertainment Explore South Sarasota Palm Terrace is the ideal home base for incredible day and weekend trips, including: Boca Grande - A small, residential beach community on Gasparilla Island. This seaside town is a beautiful place to charter a boat, fish, golf, and explore Gasparilla Island State Park. Punta Gorda - A quaint town located on the Gasparilla Sound, just an hour south of Sarasota. Sanibel Island - A popular vacation destination known for its shell beaches, fishing pier, and wildlife. KEEP IT local Just 4 miles from downtown Sarasota, you can explore the thriving art scene and entertainment at the Sarasota Opera House and the Florida Studio Theatre. You can also take a leisurely stroll and enjoy the Marie Selby Botanical Gardens' natural surroundings or take in the waterfront views at Bayfront Park. World-class museums are also on offer in Sarasota, like The John & Mable Ringling Museum of Art and The Ringling.  Less than 7 miles from Palm Terrace is St. Armands Circle, home to local craft festivals, galleries, upscale shopping, and dining. Here you can also access stunning Yacht Clubs, beaches, parks, and fishing piers. Best of all, perhaps, is Palm Terrace's proximity to the best beach in America - Siesta Key. The famous, white sand beaches of Siesta Key Beach are just 10 miles from Palm Terrace and provide even more dining, shopping, and entertainment options. Florida's Palm Terrace IS HOME It won't take long to discover what makes Sarasota so special - especially when you live at Palm Terrace! Contact us today to find out more about the new and resale manufactured homes available today. interested in our community? Contact us to learn more! contact us office hours Monday - Saturday 9:00am – 4:00pm Sales Office Tuesday - Saturday 9:00am – 5:00pm CONTACT 941.529.7005 3223 N. Lockwood Ridge Road Sarasota, FL 34234 © Palm Terrace All rights reserved Privacy Policy Terms of Use Do Not Sell or Share My Personal Information Palm Terrace Privacy Policy This Privacy Policy describes how Palm Terrace collects, uses, and discloses your personal information. This Privacy Policy should be read in conjunction with our Terms of Service, and any other policy, agreement, or terms which may affect your relationship with us. I. SCOPE OF THIS POLICY This Privacy Policy applies to https://palmterracefl.com including all its sub-domains and other websites that link to this Privacy Policy, when accessing and using them in the United States, as well as any of our other services and tools that might be made available by us from time to time, including offline tools, surveys, applications, services, advertisements, events, and promotions (collectively, “Services”). We may provide links to external-party websites that are not owned by Palm Terrace has no control over external-party privacy practices and assumes no responsibility in connection with your use of external-party websites, applications, or any other services offered by other parties. Any external-party services are governed by the privacy policies appearing on those sites and applications. By using the Services, you signify your consent to this Privacy Policy and the Terms of Service for the use of our Services. If you do not agree to this Privacy Policy or Terms of Service for the use of our Services, please do not use our Services. II. INFORMATION THAT WE COLLECT OR RECEIVE We collect and receive information from and about you by different means, including, without limitation: (i) information you submit or provide to us; (ii) information collected automatically and manually; and (iii) information provided to us by other sources. Some of the information we collect and receive includes “personal information,” which is generally information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with you. Personal information does not include information that is publicly available, de-identified, aggregated, or otherwise exempted by applicable laws. The information we may collect will vary and depend on the nature of your relationship with us and the reason(s) for providing/collecting the information. A. Information You Submit or Provide to Us We or our vendors collect the information that you directly provide to us, such as when you enter it on a webpage, submit an online form, use a chat feature we may offer, or include it in an email that you send to us in relation to our Services. In addition, we may collect information through relevant business support processes, during the registration or account creation processes, and through other business functions where we ask you to provide information, including: Contact Information (e.g., name, email or mailing address, or phone number); Account Administration Information (e.g., username, 1 / 5 password, or security questions); Communications (e.g., information you submit through our interactive chat feature or through other communications with us, including potential customer service call recordings); Payments and financial information (e.g., information necessary to process transactions, conduct due diligence, as part of an application, or for other business needs); Employment-related information and education information (e.g., information you may provide when applying for a job, or which may be included as part of an application); Demographic information (e.g., ethnicity, sex, gender, birth date, age, languages spoken, disability, housing status, household size, household type, family members, marital status, annual income, desired housing characteristics and desired housing location or community); Location information (e.g., geolocation inferred from your access to our websites or from your device); and Commercial records, customer records, and preference information (e.g., your purchase history, leasing details, rental history, property records, tenant data, and related information). Your use of interactive features we may offer on our Services is voluntary, and we may retain the information that you submit through these features. If you participate in interactive chat, either with a virtual or live agent, the contents of the chat may be captured by us or our service provider and kept as a transcript. If you use these features, you understand that our vendors may process the information obtained through the feature to provide the Service on our behalf. If you submit personal information of other people to us, e.g., when participating in a resident referral program we may offer, you represent that you have permission and authority to provide us with such personal information. If you do not have permission, please do not provide us with their information. B. Types of Information Collected Automatically We may automatically or manually collect information related to your use of Services. For example, data collected in this manner may include: Web Browsing Data. When you use our Services, our servers may automatically record information, including information that your browser or mobile device sends when you visit or use our Services. Technical Information. We may collect certain technical information about your computer systems or about your visits to our online environments when you use our Services. Device Information. We may collect information about the device you are using to access our Services, including what type of device it is, what operating system you are using, device settings, unique device identifiers and crash data. Cookie Data. Depending on how you are accessing our online environments, we may use “cookies” (a small text file sent by your device each time you visit our websites, unique to your Palm Terrace account or your browser). When we use cookies, we may use “session” cookies (that last until you close your browser) or “persistent” cookies (that last until you or your browser delete them). For example, we may use cookies to 2 / 5 remember your personal preferences, such as sections of our Services that you visit frequently, your user ID or other settings so you do not have to set them up every time you visit our Services. Some of the cookies we use may be associated with your Palm Terrace account (including information about you, such as the email address you gave us), and other cookies are not. In addition, we may use web beacons, pixels, or other web programming code or embedded scripts. Analytics Data. We may use Google Analytics or other providers for analytics services. We may also implement Google Analytics Advertising Features such as remarketing with analytics and interest-based ads. We may use first-party cookies or other first- party identifiers as well as third-party cookies or other third-party identifiers to, e.g., deliver advertisements, measure your interests, and/or personalize content. For more information on how Google Analytics uses data collected through our services, visit http://www.google.com/policies/privacy/partners. To opt out of Google Analytics cookies, visit https://tools.google.com/dlpage/gaoptout or download the Google Analytics Opt-Out Browser Add-On. Sensory Data. In order to provide you with the best possible support, prevent fraud, and improve our Services. We may also use surveillance cameras on our property in order to provide security. C. Information Provided to Us by Other Sources To improve the quality of our Services, and to carry out research and analysis, we and our vendors may supplement the information we collect with information from other sources, such as publicly available information, commercially available sources, and information from our business partners or other third parties. III. USE OF INFORMATION We may use the information we collect through the Services or otherwise obtain for a number of purposes including to: • Provide our Services; • Understand and improve our operations, Services, and performance; • Assist in customer service and transactions; • Generate feedback regarding the Services which we offer; • Conduct research or for analytics purposes; • Develop new Services; • Deliver marketing communications or promotional materials that may be of interest to you; • Improve the services we provide and the usefulness of the Services; • Customize our users’ experience when using the Services; • Protect ourselves and our users; and/or • Comply with applicable laws. IV. WHY WE MAY DISCLOSE INFORMATION We may disclose your personal information with other parties as follows: Provision of Services. We may disclose your personal information with our business partners, vendors, and service providers in order to provide our Services, including as necessary for financial transactions, to conduct due diligence, to 3 / 5 detect and prevent fraud, to comply with applicable laws and/or contractual obligations, to ensure quality of our Services, and as otherwise necessary to support our Services. Law Enforcement, Judicial, Administrative, or Regulatory Disclosures. When we believe in good faith that the law requires disclosure or that disclosure is necessary to protect or enforce the rights, property, safety, or security of ourselves or others. Business Transfers. In connection with sale of the applicable business, a portion of the business, or certain stock and/or assets, or a corporate merger, consolidation, restructuring, or other corporate change including, without limitation, during the course of any due diligence process. Marketing and Advertisements. We may disclose your personal information to our vendors or third parties to facilitate marketing and provide you with advertisements which may interest you. Sweepstakes, Contests, and Promotions. We may offer sweepstakes, contests, and other promotions (each, a “Promotion”), including Promotions jointly sponsored or offered by third parties which may require submitting personal information. If you voluntarily choose to enter a Promotion, your information may be disclosed to us, our co-sponsors, service providers, and other third parties, including for administrative purposes and as required by law (e.g., on a winner’s list). By entering, you are agreeing to the official rules that govern that Promotion, which may include consent to additional or differing data practices from those contained in this Privacy Policy. Please review those rules carefully. V. CHOICES YOU HAVE ABOUT YOUR INFORMATION You may always limit the amount and type of information that we collect from you by choosing not to enter or provide information requested from you on our Services. However, some of our features and Services can only be provided to you if you provide us with requested information (including, in some instances, personal information). Some of the Services offered may ask whether you wish to opt out or opt into our contact lists for offers, promotions and additional Services that may be of interest to you. VI. DO NOT TRACK SIGNALS Some web browsers may transmit “Do-Not-Track” signals to websites with which the browser communicates. As with many other companies, we do not currently respond to these signals. VII. HOW WE SECURE YOUR INFORMATION Palm Terrace is committed to protecting the confidentiality and security of your information against unauthorized access and disclosure. We only disclose your personal information to our personnel or others who need to know the information to service your account or to provide our Services, and as otherwise permitted or required by law. We maintain strict physical, electronic, and procedural safeguards to protect your information. VIII. OUR POLICY ON THE INFORMATION OF CHILDREN Palm Terrace does not seek or knowingly collect personal information from children under the age of thirteen (13), and we request that children do not provide information through the 4 / 5 Services. If you are a parent or guardian and become aware that your child has provided us with information, please contact us using one of the methods specified below, and we will work with you to address the issue. IX. INTERNATIONAL TRANSFERS We are a United States company and we provide our Services subject to United States law. However, we may transfer information to our affiliates, vendors, and business partners in other countries around the world, subject to applicable laws, and as a result personal information may be transferred to, processed, and stored in the other countries. As such, courts, law enforcement, and authorities in other countries may, in certain circumstances, be entitled to access your personal information. By using the Services or providing us with any information through the Services, you consent to this potential transfer, processing and storage of your information, and you acknowledge that other countries and jurisdictions may not provide the same privacy protections and their privacy laws may not be as comprehensive as those in the United States or in the country where you reside or are a citizen. X. CHANGES TO THE PRIVACY POLICY We reserve the right to amend this Privacy Policy at any time to reflect technological advancements, legal and regulatory changes and good business practices or otherwise at our discretion subject to applicable laws. If we make any changes, a new Privacy Policy will reflect those changes and the effective date of the revised Privacy Policy will be set forth at the top of the Privacy Policy. Your continued use of the Services after we make changes to this Privacy Policy is deemed to be acceptance of those changes, so please check this Privacy Policy periodically for updates. XI. HOW TO CONTACT US If you have any questions or comments about this Privacy Policy or the ways in which we use information subject to this statement, please do not hesitate to contact us by emailing pmt@cobblestoneassets.com, writing to 3223 N Lockwood Ridge Road, Sarasota, FL 34234, or calling us at 941.529.7005. Palm Terrace Online Terms of Use These Terms of Use or “Terms” apply to your use of or access to our online interfaces and digital properties, including our websites that link to these Terms (collectively, the “Sites”). “Palm Terrace,” “we,” “us,” or “our” mean Palm Terrace and/or one of our brands, affiliates, or subsidiaries. By using or accessing the Sites, you acknowledge that you have read, understood, and agreed to be bound by these Terms and our Privacy Policy, which contains important information about how we process personal information we may obtain through the Sites and is incorporated into these Terms by reference. If you do not wish to be bound by these Terms, please discontinue using and accessing the Sites. PLEASE READ THESE TERMS CAREFULLY BEFORE ACCESSING OR USING THE SITES. THESE TERMS INCLUDE AN ARBITRATION CLAUSE AND A WAIVER OF YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE LAWSUIT. THESE TERMS TAKE EFFECT WHEN YOU ACCESS OR USE THE SITES. BY ACCESSING OR USING THE SITES, YOU ATTEST THAT YOU ARE AT LEAST THE AGE OF MAJORITY IN YOUR STATE OF RESIDENCE AND ARE LEGALLY CAPABLE OF ENTERING INTO A BINDING CONTRACT. We reserve the right to change these Terms at any time, in our sole discretion and without prior notice. We will indicate changes to these Terms by updating the “Effective Date” above. Your use of the Sites following a change to these Terms signals your acceptance of the modification(s). Some areas or functionalities of the Sites may have additional terms and conditions that apply to your access or use of those areas or functionalities of the Sites (“Additional Terms”). If there is a conflict or inconsistency between these Terms and any Additional Terms, the Additional Terms shall govern your access and use of the respective area or functionality of the Sites. 1. LIMITED LICENSE Subject to your compliance with these Terms, you are granted a limited, non-exclusive, revocable, non-sublicensable, non-transferable license to access the Sites in accordance with the requirements and restrictions set forth below. If you do not agree to these Terms, or any amended Terms, you may not access or use the Sites for any purpose and shall promptly discontinue such use of the Sites. 2. INTELLECTUAL PROPERTY RIGHTS The Sites and all of their content and information (collectively, “Content”), including all copyrights, trademarks, service marks, trade names, and all other intellectual property rights (“Intellectual Property”) are owned and controlled by us, our subsidiaries, or our licensors, and are protected by copyright or other applicable intellectual property laws. You may print one copy of the Content for your personal non-commercial use only. You may not, however, copy, use, reproduce, or distribute the Content or otherwise use our Intellectual Property in any way, absent specific, prior written permission from us. 3. CONTENT DISCLAIMER The Content was believed to be accurate at the time it was published. Although we may periodically update the Content, it is subject to change without notice, and we make no guarantee as to the timeliness or accuracy of any Content presented on this Sites at the time accessed. We are not responsible, and hereby disclaim liability, for any errors, omissions, or availability of the Content. The Sites and Content are provided on an “as is,” and “as available” basis without representation or warranty of any kind whatsoever. We reserve the right to add, remove, and change information at any time without notice in our sole discretion. 4. USE OF THE SITES The Sites are intended for personal use only. You agree not to use the Sites for any commercial purposes. You further agree that you will not: Access or use the Sites (or any portion thereof) in violation of these Terms or applicable laws; Attempt to modify, alter, recreate, or otherwise use the Sites for any purpose other than as specifically permitted in these Terms; Attempt to probe, scan, or assess the vulnerability of the Sites; Breach any security, technological, or authentication measures on the Sites; Use any device, software, or routine to attempt to interfere with the Sites or otherwise disrupt the Sites or servers or networks connected to the Sites; Use any robot, spider, scraper, data mining tools, data gathering and extraction tools, or other automatic device or manual process to access, copy, or scrape the Sites for any purpose; Collect or store personal information about other users of the Sites without their consent; Use any part or feature of the Sites for any purpose that is unlawful, tortious, libelous, defamatory, obscene, threatening, or intrusive on another person’s privacy; Use the Sites to harm or harass any person or entity; Take any action that imposes, in the Company’s sole discretion, an unreasonable or disproportionately large load on the Company’s infrastructure; or Use the Sites for any reason for which the Sites are not intended. The Company reserves the right, in its sole discretion and without limiting its other remedies, to restrict, suspend, or terminate your access to, or use of, the Sites at any time with or without cause, including if the Company believes that you may be in breach of these Terms or applicable laws or are misusing the Sites. 5. REGISTRATION Some Sites may permit or require you to register for an online account with a user ID and/or password (“Login Credentials”). Otherwise, no account is needed to access the Sites. Your Login Credentials and any information that you provide in connection with your account must remain accurate and complete at all times. You are responsible for maintaining the confidentiality and security of your Login Credentials, and you are fully responsible for any and all access and use of your account. Please notify us immediately of any unauthorized use of your account, or any other known or suspected breach of security, including without limitation any loss, theft, or unauthorized use of your Login Credentials. If we have reasonable grounds to suspect that the security of your Login Credentials has been compromised, we may suspend or terminate your account, refuse any and all current or future use of the services, and pursue any appropriate legal remedies. 6. LINKS TO EXTERNAL WEBSITES The Sites may include links to external websites or resources, for your convenience. Such third-party websites contain information created, published, maintained, or otherwise posted by organizations and entities independent of us. We are not responsible for the content of those websites, nor do we approve, endorse, or certify information available at these websites or any linked addresses contained therein. We make no warranties and hereby disclaim all liability as to the accuracy of the content and to any representations made concerning the quality of products or services provided on those websites or pages. We are also not responsible for the privacy policies or practices of those websites or of those companies. 7. SUBMISSIONS TO THE SITES By providing information or materials to the Sites (other than personal information, which is subject to our Privacy Policy), you grant to us an unrestricted, irrevocable, worldwide, royalty-free license to use, reproduce, display, publicly perform, and transmit such information and materials for any purpose, including without limitation, disclosing any such information and materials as necessary to satisfy any law, regulation, or governmental request. You are prohibited from submitting or transmitting any material or communication through the Sites that we deem discriminatory, racist, offensive, pornographic, defamatory, harassing, threatening, inappropriate, violates any law, or infringes on any third party’s intellectual property rights. We reserve the right to take any available steps to prevent or prohibit any such transmission that violates this provision, which shall be determined at our sole discretion, and to take any appropriate legal action. 8. CHANGES TO THE SITES; TERMINATION OF ACCESS We reserve the right to, at any time, modify, suspend, discontinue, or reduce the functionality of the Sites (or any portion thereof), temporarily or permanently, with or without notice. In addition, we may suspend or terminate your access to the Sites at any time for any reason, at our sole discretion and without prior notice. To the fullest extent permitted by applicable law, you agree that we shall not be liable to you or to any third party for any modification, suspension, or discontinuance of the Sites (or any portion thereof) for any reason at any time. 9. DISCLAIMER OF WARRANTIES AND LIABILITY Your use of this website and Content is at your own risk. Content may become inaccurate as a result of developments after its publication on these Sites. We assume no responsibility to keep Content current or to correct inaccuracies or errors in Content. The Content on these Sites and the operation of them are provided “as is,” and we disclaim all representations or warranties of any kind, either express or implied, including warranties of merchantability, fitness for particular purpose, title, non-infringement, accuracy, completeness, and timeliness. Certain jurisdictions may not permit certain disclaimers of warranties. In such case, we disclaim warranties to the fullest extent permitted by the applicable law. WE SPECIFICALLY DISCLAIM ANY LIABILITY, whether based in contract, tort, negligence, strict liability, or otherwise, for damages of any kind including, but not limited to, any direct, indirect, incidental, consequential, special, punitive, and/or exemplary damages caused by, arising out of, and/or in any way connected with functionality or operation of, access to, use of, or reliance on the Sites or the Content (even if we or our representatives have been advised of the possibility of such damages) or that are caused by and/or arise in connection with mistakes or omissions in, or delays in transmission of, information to or from the Sites, interruptions in telecommunications connections to the Sites, or viruses that may infect your computer equipment or other property, whether caused in whole or in part by negligence, acts of God, telecommunications failure, theft, or destruction of, or unauthorized access to the Sites or the Content. This limitation of liability may be different in connection with specific products and services offered by us. Some states do not allow the limitation of liability, so the foregoing limitation may not apply to you. 10. INDEMNIFICATION You agree to defend and indemnify us, our affiliates, employees, and officers of each, from and against any and all third-party claims, debts, losses, liabilities, demands, obligations, actions, and causes of action, alleged claims or litigation, damages, judgments, judgments for damages, fines, penalties, expenses, and costs (including, but not limited to, reasonable attorneys’ fees) caused by, arising out of, or resulting from your use of the Sites or the Content in a manner not expressly authorized by these Terms or that violates these Terms, any law, or the rights of a third party. 11. DISPUTE RESOLUTION: MANDATORY BINDING INDIVIDUAL ARBITRATION AND CLASS AND COLLECTIVE ACTION WAIVER The exclusive means of resolving any claim related to your use of the Sites or these Terms shall be BINDING ARBITRATION. Except as provided below in the case of a Mass Filing, the arbitration will be administered by JAMS under the JAMS Streamlined Arbitration Rules & Procedures. If you are a consumer, as defined by JAMS in its Consumer Minimum Standards, you may request that the arbitration hearing be conducted in the area in which you reside. Otherwise, the hearing (if any) shall take place in Sarasota County, Florida, United States of America. You agree to first give us an opportunity to resolve any claims by contacting us in writing (the “Claims Notice”). After receipt of a Claims Notice, we may request an individualized video or telephone conference which both parties will personally attend (with counsel, if represented). If we are not able to resolve your claims within sixty (60) days of receiving the Claims Notice, you may seek relief through arbitration, as set forth in this section. You agree that you will not take any legal action, including any demand for arbitration, until after the expiration of this 60-day dispute resolution period. EACH PARTY WAIVES ITS RIGHTS TO GO TO COURT, TO A TRIAL BY JURY, AND TO PARTICIPATE IN A CLASS ACTION, CLASS ARBITRATION, OR OTHER REPRESENTATIVE PROCEEDING WITH RESPECT TO ANY COVERED CLAIM. If, at any time, twenty-five (25) or more claimants (including you) submit demands or seek to file demands for arbitration raising similar claims against us, and such circumstances meet the definition and criteria of Mass Filings (“Mass Filing”) set forth in National Arbitration & Mediation's (“NAM”) Mass Filing Supplemental Dispute Resolution Rules and Procedures (“NAM's Mass Filing Rules,” available at https://www.namadr.com/resources/rules-fees-forms/), you and we agree that JAMS shall not serve as the arbitration administrator and that instead NAM shall administer any such Mass Filing and the NAM Mass Filing Rules in effect at the time such claim is filed shall apply. You agree that throughout this process, the parties' counsel shall meet and confer to discuss modifications to these procedures, including the possibility of procedural consolidation of similar claims for arbitration, based on the particular needs of the Mass Filing. You acknowledge and agree that by electing to participate in a Mass Filing, the adjudication of your dispute might be delayed. You and we agree that each party values the integrity and efficiency of arbitration and wishes to employ the process for the fair resolution of genuine and sincere disputes between the parties. You and we acknowledge and agree to act in good faith to ensure the processes set forth herein are followed. 12. GOVERNING LAW AND JURISDICTION These Terms shall be governed by, and construed in accordance with, the laws of the United States and the State of Florida, without giving effect to conflict of law principles thereof. Subject to Section 11, you hereby consent and submit to personal jurisdiction in the state and federal courts located in Sarasota County, Florida. 13. COMPLIANCE WITH LAW We provide our Sites in accordance with United States law. By using our Sites or providing us with any information through the Sites, you acknowledge that our Sites are subject to United States law and that other countries and jurisdictions may not provide the same rights or protections as those in the United States or in the country where you reside or are a citizen. Persons who access these Sites do so on their own initiative and are responsible for compliance with applicable local laws and regulations. By downloading software or other material from the Sites, you represent and warrant that you are able to do so in full compliance with the laws of the United States and your resident country, including any applicable export controls. 14. GENERAL INFORMATION Except for any Additional Terms that apply, this is the entire understanding between you and us regarding the use of the Sites and supersedes all prior and contemporaneous agreements and understandings between you and us regarding this subject matter. If any provision of these Terms is held to be invalid or unenforceable, it will not affect the validity or enforceability of any other provision hereof. The failure of the Company to exercise or enforce any right or provision of these Terms shall not constitute a waiver of such right or provision. 15. CONTACT INFORMATION If you have questions regarding these Terms of Use, you can contact us by email at pmt@cobblestoneassets.com , by phone at 941.529.7005, or by postal mail at 3223 N Lockwood Rd., Sarasota, FL 34234."
    },
    {
      "url": "https://palmlakeresort.com.au/tea-gardens/",
      "text": "Palm Lake Resort Tea Gardens | Luxury over-55s living in the Mid-Coast, NSW Menu Tea Gardens Homes News Book Private Inspection Request Info Pack 1800 756 740 Palm Lake Resort Home About Palm Lake Resort Our Resorts All Our Resorts Queensland Our Resorts Queensland Bargara Beachmere Bay Beachmere Sands Bethania Caloundra Cay Carindale Cooroy-Noosa Deception Bay Eagleby Heights Hervey Bay Mt Warren Park Pelican Waters Toowoomba Upper Coomera Waterford New South Wales Our Resorts New South Wales Ballina Banora Point Fern Bay Forster Lakes Tea Gardens Tweed River Yamba Yamba Cove Victoria Our Resorts Victoria Paynesville Phillip Island Truganina Willow Lodge Homes Events News & Lifestyle All News & Lifestyle Your Time Magazine Resort Newsletter Blog Now Available Your Time Winter 2025 Contact Book private inspection Request an information pack Contact Us Contact Us 50 Spinifex Avenue Tea Gardens NSW 2324 Book Private Inspection 1800 756 740 Palm Lake Resort Tea Gardens THE BEST IN OVER-55s LIVING. THIS IS YOUR TIME. Scroll to Explore Lifestyle Exclusive resort-style living We believe that variety is the spice of life, so we’ve carefully planned Palm Lake Resort Tea Gardens over 23 hectares with plenty to see and do. Palm Lake Resort is designed around the little things, like garden enclaves with bench seats for soaking up some dappled sunshine and watching the garden grow. Go walking, or hit a birdie on the local 18 hole golf course! Show the grandkids how to stand up paddle board or just go fishing for the day on the Myall River. Whether you’re a golfer, a shopper or you’re just after an entertaining day out, the Tea Gardens region has so much to offer. You stroll the markets, take the grand kids out for the day or enjoy time at the exclusive country club offering an array of activities and games. The Palm Lake Resort Tea Gardens luxury resort lifestyle allows you to elevate the best years of your retirement in style. Our Homes Discover your next home A range of different home designs are positioned amongst wonderful gardens, stunning natural parkland, lakes and recreation facilities. The resort has been master planned to give each home close proximity to one of our two country clubs, which will form the hubs of activity in the community. View all homes Resort features Water Lilies Country Club Promenade Country Club Pet-friendly resort Undercover eight-rink bowling green Outdoor swimming pool Indoor swimming pool Mineral spa and saunas Gym Tenpin bowling alley Tennis precinct Virtual golf simulator with international courses Billiards room Well-equipped workshop Luxury movie theatre Library Dance floor and stage Art and craft room Licenced bar and lounge Renoir II external Van Gogh II Outdoor living Palm lake resort tea gardens generic home (4) PalmLakeResortTeaGardens386 Exterior East PalmLakeResortTeaGardens161 Indoor pool PalmLakeResortTeaGardens079 Palm lake resort tea gardens generic home (5) Palm lake resort tea gardens generic home (6) Palm lake resort tea gardens generic home (9) Palm lake resort tea gardens generic home (3) Palm lake resort tea gardens generic home (7) Palm lake resort tea gardens generic home (10) Palm lake resort tea gardens generic home (8) Palm lake resort tea gardens generic home (2) PalmLakeResortTeaGardens101 Ten Pin Bowling Cinema ext Dining 3 hero PLRTeaGardens Sugar Glider Corridor between the stages Unique boutique lifestyle community Living at Palm Lake Resort Tea Gardens offers residents features that complement their investment and lifestyle. Lifestyle features Financial features Lifestyle features Independent living Secure lock-and-leave lifestyle On-site management Complimentary activities Limited on-site caravan, RV and boat storage 40-seat resort coach Internet Financial features Stamp duty free Owner-occupied living Retain your capital gain Council rates free Location A new style of retirement chic This pristine, unspoilt place boasts stunning headlands, quiet lakes, meandering rivers, national parks and reserves, surf beaches, sand dunes and a myriad of marine life and wildlife. Catch a ferry across the water to Nelson Bay, or cross the Singing Bridge to Hawks Nest and look out to sea. You may spot the humpback whales that migrate along the coast each year. With restaurants, cafés and shopping, the area offers a diverse range of attractions. You’ll love the fact that you’re away from it all but still so close to everything! 65 minutes north of Newcastle 2.5 hours north of Sydney Discover your new lifestyle News View News More than 48 years of crafting luxury resort lifestyles Palm Lake Resort Ballina is the culmination of more than 48 years of Palm Lake Group expertise and first-hand knowledge in crafting designer resort-style living for savvy over-55s. Proudly Australian family-owned, we create communities that are friendly, exciting, inspirational and aspirational. Taking the time to understand how people want to live today has resulted in innovative and revolutionary resorts for a vibrant generation of retirees who refuse to settle for outdated retirement lifestyles. Award-winning Our portfolio of 27 communities across Australia has been richly rewarded, having won several Master Builders Association awards for our resorts, country clubs and display homes. Consistently exceeding industry standards, we have established ourselves as true leaders in delivering Australia’s best luxury over-55s resorts. More Information Retirement Villages Act 1999 Please click to download further information on the New South Wales Retirement Villages Act 1999. Download Start your journey here Get in touch with us today to start your luxury resort lifestyle and elevate the best years of your life in style. Notice: JavaScript is required for this content. Facebook Instagram YouTube Our Resorts Queensland Bargara Beachmere Bay Beachmere Sands Bethania Caloundra Cay Carindale Cooroy-Noosa Deception Bay Eagleby Heights Hervey Bay Mt Warren Park Pelican Waters Toowoomba Upper Coomera Waterford New South Wales Ballina Banora Point Fern Bay Forster Lakes Tea Gardens Tweed River Yamba Yamba Cove Victoria Paynesville Phillip Island Truganina Willow Lodge Site Links Homes Palm Lake Resort Home About Palm Lake Resort Palm Lake Care Events Contact Back to Top Facilities listed are subject to change without notice. Artist impressions are indicative only. Comparison Documents Terms and Conditions Privacy & Security Policy Environmental Policy © Copyright Palm Lake Resort 2025 | Made by a"
    },
    {
      "url": "http://www.palmresacapark.org/about-us/board-of-directors/",
      "text": "Palm Resaca Mobile Home Park - Board of Directors Expand/collapse navigation Home About Us Board of Directors Manager and Office Staff Maintenance Staff Applications & Forms Fees & Services Living at Palm Resaca Activities Amenities Places to Go Activities Calendar Homes for Sale Rental Units RV Rental Pads Maps Photo Gallery Shareholders Only Testimonials Park Internet Contact Us Palm Resaca Park Palm Resaca Park Home About Us Applications & Forms Fees & Services Living at Palm Resaca Activities Calendar Homes for Sale Rental Units RV Rental Pads Maps Photo Gallery Shareholders Only Testimonials Park Internet Contact Us Board of Directors President Caryl Unger Second generation resident 13 years experience on the Board of Directors: two years as President Dedicated to making sound decisions for the betterment of all residents and the community of Palm Resaca Mobile Home Park 1st Vice President Jon Moulton My wife Pat and I came to Palm Resaca with our RV for several years to be with our good friend Bob Odegaard from our mutual hometown of\nRush City, Minnesota.  Later we rented a mobile home in the park for one year before purchasing that mobile. I have been on the PRMHP board since 2019. My occupations are dairy farmer  for 38 years and CPA for 46 years. Our youngest son has taken over the dairy farm and our youngest\ndaughter has taken over the CPA office but both still bear my name and want my services! 2nd Vice President Dennis Pepe I was born in September 1946 in Grand Blanc Michigan and lived in Illinois from 1951\nuntil the present.  I graduated high school in 1966 and then did a four year stint in the US Navy.  After the Navy I spent about 37 years working in a manufacturing factory setting. \nInitially as an Automatic Assembly Line Maintainer in a Continental Can Company can making factory for ten years.  I was operating and repairing the can fabricating machinery for an entire\nbeverage can production line sending 12 oz. beverage cans through a hole in the wall to the Coca-Cola bottling plant on the other side until that plant was closed in 1980.  I then moved on to\nthe Electromotive Division of General Motors, testing locomotive engines for a couple years.  After being laid off from Electromotive I found employment as a Maintenance Department Supervisor\nand eventually Superintendent of a fifty man maintenance crew at a Chicago floor tile manufacturer for the next twenty years and finally finished my work life as a maintenance foreman at another\nfactory before retiring in 2008. Since High School, I’ve done all my own vehicle repairs and maintenance until the last\nseven or eight years when cars became so computer dependent that the “Shadetree Mechanic” in me was forced to admit I couldn’t do it anymore, plus advancing age told me to let the pro’s handle\nit. I have always been interested in electronics and home computers and have built both the\ncomputer I currently use and Patti’s computer, brand new, from components purchased at an electronics supply store for about half the cost of buying one at a big box store.  It’s the cheapskate\nin me I guess, plus it’s fun I rode motorcycles in my twenty’s and early thirty’s until shortly after the birth of my\nkids and the emotional and financial responsibilities of raising a family and providing for them forced me to give up motorcycling.  After becoming an empty nester in my early fifties and then\nlosing my first wife following a lengthy illness I’ve gotten back into riding again and have had several bikes since, culminating in the 2011 Harley Trike (my version of a golf cart) I’m currently\nriding. The initial home my first wife and I bought was a condominium that we had for about\ntwelve years, the last eight of which I was a member of the board of directors for our condo association. Following a visit to Palm Resaca in about February of 2017 Patti and I really loved this\nplace and decided to sell our home up north in Oak Forest, Illinois, keep our summer get away trailer in Seneca, Illinois and become Winter Texans here at Palm Resaca.  We bought and moved into\n#49 in April of 2019 and we’re now putting the finishing touches on a brand new trailer on lot #51.  We’re generally up north from mid April through mid October and down here the rest of the\nyear. Patti and I both have kids and grandkids in northern Illinois so we won’t giving up our\nnorthern summers anytime soon but are looking forward to many more fun winters down here. Director Barry MacDonald From Prince Edward Island  now living in Peterbourgh Ontario. Worked 20 years for Xerox ?? 6 years Ikon and 15 years for BrainsII as\nHardware engineer. Ran a home renovation business for 20 years on the side. Retired in 2016 now manage rental house at home. Susan and I came to Palm Resaca in 2018 We have two daughters and four grandchildren. Looking to help keep the park moving forward for the next members. Director Terry Roberts I am currently an administrator with First Baptist School , where I have served for 17 years.   I have had many\nopportunities to serve on governing boards and I trust my experiences will benefit the park.  My wife Rosemary and I are going into our fifth season at Palm Resaca Park.  We are thankful\nfor the park and want to be involved in many activities.  Working full-time limits our opportunities to get involved.  Serving on the board of directors is our way to “give back” to the\npark. Working together, we look forward to many great years. Director Blake Willard Blake is a retired Captain with the Calgary Fire Department who served 32 years.  Plus\nfor over 25 years (and still going) an entrepreneur…  with being the Owner/Operator of Quick Fire Fireplaces, owing many rental properties and in 2022 becoming the new Owners of Motel Tipton, a\n13-room boutique motel in Tipton Iowa. In the fall of 2024, Blake along with his wife Shelley will be into their thirteenth season\nas Winter Texans at Palm Resaca Park.  Together, they love our beautiful park and continue to be involved in many activities throughout the winter season. They are proud to make a positive\ncontribution to enhance the Park while in turn, preserving the vision of the Founders.   Together, they look forward to many great years with our Palm Resaca Family!  Since 2016, Blake has\nserved on the Board of Directors and his term will continue until 2026.  Has been on these committees  Property, Nominations and Finance , Welcome committee, Chairman of the Long-Term\nPlanning, He has also been the Board Liaison with the Internet and Rec Club committees. He is a Father of three adult children, a Grandfather to eight Grandchildren plus a Great\nGrandfather to eight Great Grandkids, with one more on the way .  Blake and Shelley are currently in the “traveling” mode of life and have travelled to all 50 US States (Alaska is on the sights\nfor the summer of 2024), plus various countries with more on their bucket list! Director Robyn Zettler More info coming soon! Board of Directors Manager and Office Staff Maintenance Staff Where to Find Us: Palm Resaca Park 100 Tangerine Blvd Attn: Park Office Brownsville, TX 78521 Phone: (956)546-7423 Fax: (956)504-5745 Toll Free: (800)667-6881 Email: manager@palmresacapark.org Office Hours: Monday - Friday 10:00am - 4:00pm Saturday & Sunday Closed Print | Sitemap © Palm Resaca Park INC This website was created using IONOS MyWebsite . Login Web View Mobile View Logout | Edit page"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "text": "Team & Board - Visit Greater Palm Springs Skip navigation Skip to main content Meetings Weddings Wedding Venues Iconic & Unique Homes Unique Venues Bachelorette Parties Honeymoons & Romantic Getaways Wedding Vendor Services Contact Us Travel Trade Getting Here Brochures & Promotional Materials What's New Media Library Resources & Training Itineraries Contact Us Media Press Releases In The News Media Library Media Assistance What's New Influencer Collaboration Request In the news featured Film Film Permits Services Location Information Contact Partner Portal Meetings Weddings Travel Trade Media Film Partner Portal Meetings Weddings Travel Trade Media Film Partner Portal Things To Do Attractions & Activities Acrisure Arena The Living Desert BMW Performance Center Palm Springs Aerial Tramway Palm Springs Air Museum Date Farms Sunnylands Windmills Moorten Botanical Garden Forever Marilyn Arts & Culture Native American Culture Agua Caliente Cultural Plaza Murals Palm Springs Art Museum Museums Art Galleries Movie Theaters Architecture Theater & Performing Arts Hiking & Trails Waterfalls San Jacinto Peak Palm Springs Aerial Tramway Tahquitz Canyon Indian Canyons Outdoors & Recreation ATV & Off-Road Rentals Stargazing Tennis Pickleball Hot-Air Ballooning & Air Tours Rock Climbing & Bouldering Horseback Riding & Polo Biking & Bike Rentals Footgolf Motorbike Rentals California Deserts Hot Springs Spas, Beauty & Wellness Spa Month Spas Resort Spas Natural Mineral Water Spas Mobile Spas Day Spas Golf Shopping El Paseo Shopping District Outlet Malls Farmers Markets Antique & Vintage Shopping Dog-Friendly Dog Friendly Hotels Dog Friendly Dining Dog Parks & Hiking Tours Midcentury Modern Tour Jeep & Humvee Sightseeing Free Things To Do Things To Do With Kids Events Events & Festivals Club Skirts Dinah Shore Weekend Modernism Week Joshua Tree Music Festival Acrisure Series Palm Springs International Film Festival The American Express La Quinta Art Celebration Greater Palm Springs LGBTQ+ Pride BNP Paribas Open Fashion Week El Paseo The Galleri Classic Coachella Valley Music & Arts Festival Stagecoach Country Music Festival Desert X Splash House Spa Month This Weekend Concerts & Live Music Food Festivals Art Festivals Film Festivals Submit An Event Restaurants & Nightlife All Restaurants Kid Friendly Casual Dining Fine Dining Dog-Friendly Restaurants Breakfast & Brunch Ice Cream & Sweets Nightclubs & Lounges Craft Breweries & Distilleries Casinos & Entertainment Happy Hours Sports Bars Wine DineGPS Newsletter Places To Stay Hotels & Resorts Vacation Rentals LGBTQ Hotels Luxury Hotels Hot Mineral Water Spa Hotels Pet Friendly Hotels Budget Friendly & Moderate Boutique Hotels & Inns RV Resorts & Rentals Timeshares Packages & Deals Plan Free Visitors Guide E-Newsletter Spa Month Summer Travel Sun Seeker Mindful Foodie Culture Connoisseur Enlightened Traveler Taste Trailblazer Nature Lover Community And Culture Accessible Travel Accessible Attractions Autism Travel LGBTQ+ Getaway Offers In The News Deals Spa Month Happy Hours Staycation Trip Ideas & Itineraries 3 Day Weekend In Greater Palm Springs Day Trip in Greater Palm Springs Relocation & Resources Digital Guides Travel Tips Work Remote Sustainability Original Video Series Weather Getting Here & Around Charging Stations Car Rentals and Transportation Visit Greater Palm Springs App Coachella Valley Cathedral City Places To Stay Things To Do Restaurants Coachella Restaurants Casinos & Live Entertainment Community Parks Desert Hot Springs Places To Stay Restaurants Mineral Water Day Pass Things To Do Indian Wells Places To Stay Spa Experiences Golf Restaurants Tennis Meetings & Events Say \"I do\" Indian Wells Blog e-newsletter Indio Places To Stay Things To Do Restaurants Vacation Rentals La Quinta Places To Stay Things To Do Restaurants Palm Desert Places To Stay Things To Do Restaurants Palm Springs Places To Stay Things To Do Restaurants Rancho Mirage Places To Stay Things To Do Restaurants Blog Things To Do Events Restaurants & Nightlife Places To Stay Plan Coachella Valley Blog Things To Do Events Restaurants & Nightlife Places To Stay Plan Coachella Valley Blog Search Home About Us Our Team & Board Share Team & Board JPA Executive Committee Joint Powers Authority (JPA) Executive Committee Waymond Fermon JPA  Executive Committee Chair Council Member, City of Indio Linda Evans JPA Executive Committee Vice Chair Mayor, City of La Quinta Nancy Ross JPA Executive Committee Member Mayor, City of Cathedral City Gary Gardner JPA Executive Committee Member Mayor Pro Tem, City of Desert Hot Springs Dr. Frank Figueroa JPA Executive Committee Member Council Member, City of Coachella Brian Penna JPA Executive Committee Member Council Member, City of Indian Wells Jan Harnik JPA Executive Committee Member Mayor, City of Palm Desert Jeffrey Bernstein JPA Executive Committee Member Council Member, City of Palm Springs Ted Weill JPA Executive Committee Member Mayor, City of Rancho Mirage V. Manuel Perez JPA Executive Committee Member 4th District Supervisor, County of Riverside Board of Directors Visit GPS Board of Directors Rolf Hoehn Board of Directors Chair Director of Business Development, Indian Wells Tennis Garden Peggy Trott Board of Directors Vice Chair ​General Manager, Kimpton Rowan Palm Springs Aftab Dada Treasurer Managing Director, Hilton Palm Springs Kate Anderson Board Member Director of Public Relations, Agua Caliente Band of Cahuilla Indians Lorraine Becker Board Member Advisory Council Member, Cabot's Pueblo Museum Sejal Bhakta Board Member Owner/Operator, Hampton Inn & Suites John Bolton Board Member Senior Vice President, Oak View Group Celeste Brackley Board Member General Manager, The Line & Saguaro Hotels Gary Cardiff Board Member Owner/President, Cardiff Limousine & Transportation Kenny Cassady Board Member Director of Business Development, Acme House Company Jay Chesterton Board Member Vice President of Hotel Operations and Food & Beverage, Fantasy Springs Resort Casino Dermot Connolly Board Member General Manager, La Quinta Resort & Club Tim Ellis Board Member Emeritus Principal, Ellis Hospitality Services Eddy Estrada Board Member Owner, Smarter Property Management ​ David Feltman Board Member Co-Founder, VRON of Palm Springs Shannon Gilbert Board Member General Manager, The Ritz-Carlton, Rancho Mirage Mark Girton Board Member VP/General Manager, Goldenvoice & Empire Polo Rob Hampton Board Member General Manager, Palm Springs Convention Center Dan Johnson Board Member General Manager, Grand Hyatt Indian Wells Resort & Villas Jerry Keller Board Member Owner, Lulu California Bistro Patrick Klein Board Member General Manager, The Gardens on El Paseo / El Paseo Village Kelly McLean Board Member Co-Owner, Poppy Vacation Rentals Nusrat Mirza Board Member General Manager, JW Marriott Desert Springs Resort & Spa Allen Monroe Board Member President/CEO, The Living Desert Lee Morcus Board Member Emeritus Owner, Kaiser Restaurant Group Liz Ostoich Board Member Owner, FARM and Tac/Quila Restaurants Brad Poncher Board Member Mentor/Consultant, Homewood Suites by Hilton La Quinta Greg Purdy Board Member VP of Marketing and Public Affairs, Palm Springs Aerial Tramway Tim Pyne Board Member General Manager, Renaissance Esmeralda Resort & Spa Saverio Scheri Board Member COO, Agua Caliente Casinos Bob Schneider Board Member Principal, Desert Consulting Ankit Sekhri Board Member General Manager, Two Bunch Palms Resort & Spa Barb Smith Board Member Partner, Eventis Destination Services Boris Stark Board Member CEO, Palm Desert Vacation Properties Ebony Stinson Board Member General Manager, DoubleTree by Hilton Golf Resort Palm Springs Joseph Tormey Board Member Director of Hospitality Program, CSUSB Palm Desert Campus Doug Watson Board Member CEO, Strategy | Innovation | Co. Staff Executive, Finance & Operations Executive Office Scott White President/CEO Sarah Goslin Executive Assistant & Board Administrator Finance & Administration Brian Kelty Vice President, Finance & Administration Andy Cloutier Director of Human Resources Jorge Rodriguez Accounting Manager Dan Tackett Staff Accountant Siong Teo Staff Accountant Operations Stefanie Kilcoyne Director of Technology and Operations Rebecca Kirkpatrick Analytics Manager Carlos Lerma Property Maintenance Manager Samuel Espinoza Help Desk Manager Cameron Vaughan Front Desk | Visitor Assistance Convention Sales Convention Sales Colleen Pace Chief Sales & Marketing Officer colleen@visitgreaterps.com Carolina Viazcan Vice President Of Sales carolina@visitgreaterps.com Rob Osterberg Director of Sales Operations Specialty Accounts/Sports rob@visitgreaterps.com Tammy Bucklin Director of Sales Southwest/Southern California tammy@visitgreaterps.com Anne Marie Mourhess Director of Group Sales Northern California & Pacific Northwest annemarie@visitgreaterps.com Lynne Bowis, CMP Director of Sales & Business Development lynne@visitgreaterps.com Will Trokey, CMP National Accounts Director Mid-Atlantic will@visitgreaterps.com Suzanne Aed National Accounts Director Mountain States/ Los Angeles/Orange County suzanne@visitgreaterps.com Mary Ryan National Accounts Director Midwest Region/International Meeting Requests mary@visitgreaterps.com Angie Day, CMP National Accounts Director Northeast & Canada angie@visitgreaterps.com Rich Ainsworth Small Meetings Manager rich@visitgreaterps.com Ashley Owens National Sales Manager Southeast ashley@visitgreaterps.com Emily Heggernes National Sports Sales Manager EmilyH@visitgreaterps.com Emily Alvarez-Zurita Convention Sales Coordinator Merve Gusroy Sales Data Specialist Rozanne Sutherland Convention Sales Coordinator Destination Experiences Destination Experiences Kahlia Gainey Senior Destination Experiences Manager Jackie Vega Senior Community Events Manager Elizabeth Jamison Destination Experiences Manager Marta Battle Destination Experiences Manager Alex Mercado Assistant Destination Experiences Manager Lauren Taylor Destination Experiences Specialist Melissa Bernal Destination Experiences Coordinator Yvonne Gonzalez Destination Experiences Coordinator Tourism Development Tourism Development Gary Orfield Director of Tourism Development gary@visitgreaterps.com Gerry Boyle Tourism Development Manager gerry@ommac.co.uk Joanne Ohanesian Tourism Development Manager joanne@visitgreaterps.com Julie Kawaguchi Tourism Development Manager juliek@visitgreaterps.com Oleg Nakonechny Tourism Development Manager oleg@visitgreaterps.com Partnership Partnership Davis Meyer Vice President of Government & Industry Relations davis@visitgreaterps.com Lauren Bruggemans Director of Sustainability & Community Engagement laurenb@visitgreaterps.com Sean Smith Director of Economic Development sean@visitgreaterps.com Erica Abarca Community Engagement Manager erica@visitgreaterps.com Josh Heinz Community Engagement Manager josh@visitgreaterps.com Laura Hunt Little Community Engagement Manager Marketing & PR Marketing Colleen Pace Chief Sales & Marketing Officer colleen@visitgreaterps.com Dana Fury Director of Marketing Samuel Thompson Director of Indian Wells Tourism Gary Forsyth Director of Palm Springs Tourism Krystal Kusmieruk Senior Marketing Manager Andrew McCauley Website Manager Caroline Polly Social Media Manager Jeffrey Farnsworth Marketing & Sales Coordinator jeff@visitgreaterps.com Celena Correa Digital Database Specialist Paola Fernandez Marketing Specialist Maya Jimenez Digital Marketing Specialist Anthony Ruiz Website Specialist Brand Development Julie Sinclair Director of Corporate Communications Miranda Caudell Senior Brand Marketing Manager Stacie Herndon Senior Graphic Designer Denise Marley Senior Graphic Designer Bob Wilson Brand Communications Specialist Media & Communications Todd Burke Vice President of Communications todd@visitgreaterps.com Joyce Kiehl Director of Communications Madison Morgan Media Relations Manager Halle Wells Communications Coordinator Request a Free Visitors Guide Sign up for our E-Newsletter Top VISIT GREATER PALM SPRINGS Toll-free: 800.967.3767 p: 760.770.9000 Visitor Center: Monday – Friday  8:00 am to 5:00 pm 70100 Highway 111 Rancho Mirage, CA 92270 Greater Palm Springs is a Certified Autism Destination™ Partner Portal About Us Our Team & Board Careers TBID Foundation Economic Development Contact Sitemap Privacy Policy Cookie Settings Agendas Partner Portal About Us Contact Sitemap Privacy Policy Cookie Settings Agendas PARTNERS & SPONSORS 1 /8 © 2025 Visit Greater Palm Springs. All rights reserved."
    },
    {
      "url": "https://www.palmhousehotel.com/contact-us/",
      "text": "Contact Palm House | Reach Us for Bookings & Inquiries Rooms Palm King Rooms Signature King Rooms Grand Double Queen Room Premier King Rooms Summer Escape This season, enjoy Palm Beach at its most peaceful with our exclusive Summer Escape Package. Read More Suites Junior Suites Premier Bedroom Suites Premier Two Bedroom Suites Royal Palm Two Bedroom Suite Flagler One Bedroom Suite Presidential Suite Suite Life Reserve two nights or more in our luxury suites to receive up to 30% off. Reserve Food & Drink Dining Room Book a Table Menus Weekend Brunch Brunch is served in the Dining Room on Saturdays and Sundays from 10:30am - 3:00pm. View Menu Things to do Pool, Beach & Leisure Shopping Arts & Culture Water Adventures Family & Wildlife Experiences Golf & Parks Entertainment & Events Urban Exploration Nightlife & Evening Spa & Wellness Pool, Beach & Leisure Unwind by the pool or beach or take a leisurely bike ride along the scenic Lake Trail. Read more Meetings & Events Event Spaces Exclusive Use Get in Touch Nestled in the heart of Palm Beach, our event spaces are the perfect setting for impactful meetings and unforgettable events. Inquire Now Weddings & Celebrations Weddings Celebrations Palm House Weddings With lush gardens, inspiring spaces and impeccable service, our luxurious hotel will ensure your special day is as effortless as it is extraordinary. Inquire Now Offers Fall Escape Package Suite Life FL GA Resident Rate Honeymooner's Package Stay More Save More Advance Purchase AAA/AARP Rate Stay More Save More Stay with us for more than 4 consecutive nights and receive up to 20% off your room or suite. Blackout dates apply. Reserve Contact Us EN IT BOOK A ROOM BOOK A TABLE Arrival 05 September 2024 Find a reservation Departure 05 September 2024 No. of Guests 2 SPACER TEXT Adults 2 Children 0 Number of Rooms 1 SPACER TEXT Rooms 1 Promo code Book Now Book A Table a table at The Dining Room Palm King Rooms Signature King Rooms Grand Double Queen Room Premier King Rooms Summer Escape This season, enjoy Palm Beach at its most peaceful with our exclusive Summer Escape Package. Read More Junior Suites Premier Bedroom Suites Premier Two Bedroom Suites Royal Palm Two Bedroom Suite Flagler One Bedroom Suite Presidential Suite Suite Life Reserve two nights or more in our luxury suites to receive up to 30% off. Reserve Dining Room Book a Table Menus Weekend Brunch Brunch is served in the Dining Room on Saturdays and Sundays from 10:30am - 3:00pm. View Menu Pool, Beach & Leisure Shopping Arts & Culture Water Adventures Family & Wildlife Experiences Golf & Parks Entertainment & Events Urban Exploration Nightlife & Evening Spa & Wellness Pool, Beach & Leisure Unwind by the pool or beach or take a leisurely bike ride along the scenic Lake Trail. Read more Event Spaces Exclusive Use Get in Touch Nestled in the heart of Palm Beach, our event spaces are the perfect setting for impactful meetings and unforgettable events. Inquire Now Weddings Celebrations Palm House Weddings With lush gardens, inspiring spaces and impeccable service, our luxurious hotel will ensure your special day is as effortless as it is extraordinary. Inquire Now Fall Escape Package Suite Life FL GA Resident Rate Honeymooner's Package Stay More Save More Advance Purchase AAA/AARP Rate Stay More Save More Stay with us for more than 4 consecutive nights and receive up to 20% off your room or suite. Blackout dates apply. Reserve Rooms Suites Food & Drink Things to do Meetings & Events Weddings & Celebrations Offers Contact Us Book Now Rooms Suites Food & Drink Things to do Meetings & Events Weddings & Celebrations Offers Book Now Book Now EN IT Opening 27th November 2024 I would like to: Book a Room Book A Table  Dining Room } Number of Adults Number of Children Summary Adults 2 Children 0 Number of Rooms Number of Rooms Rooms 1 Check Availability Check Availability Contact Us Get in touch Palm House 160 Royal Palm Way, Palm Beach, Florida 33480, United States Tel: +1 561-858-1600 Connect With Us @palmhousehotel_ Palm House 160 Royal Palm Way, Palm Beach, Florida 33480, United States Tel: +1 561-858-1600 E: info@palmhouse.com Our Hotel About Us Concierge & Services FAQS Press & Media Press Awards Keep In Touch Contact Us Careers Newsletter sign up Legal Privacy Policy & Cookies Terms & Conditions Accessibility Statement Our Collection Chewton Glen Cliveden House The Lygon Arms The Mayfair Townhouse 11 Cadogan Gardens The Chelsea Townhouse Hotel Excelsior Venice Lido Resort Gran Marbella Resort & Beach Club © Palm House 2025 Website by 80 DAYS close Register interest By ticking the box you confirm that you would like to sign up to receive email updates from Palm House. Send"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/76651-desert-terrace-mobile-estates-5063-s-hwy-97-redmond-or-97756",
      "text": "Desert Terrace Mobile Estates | 5063 S Hwy 97, Redmond, OR 97756 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Desert Terrace Mobile Estates 5063 S Hwy 97 location_on Map It Redmond, OR 97756 | ID: 76651 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ALL AGES PET FRIENDLY PHOTOS VIDEO STREET VIEW 44.229684 -121.2073741 988650 5063 S Hwy 97, Redmond, OR 97756 Details Name Desert Terrace Mobile Estates Type of community All-ages community ? Lot rent range $475 - $725 Office Phone (541) 548-2546 Total # of lots 53 Pet policy check Pet friendly check Pet restrictions apply 75lbs or less - Pet restrictions Community owner type Company, privately held Year built 1960 Average monthly HOA/Lot Rent fees $445 Water type Well Sewer type Septic Street width Average Parking Off-street Street type Paved Climate Zone Rating COLD MORE OWNER/MANAGER? CLAIM THIS COMMUNITY Call Us (541) 548-2546 Sales & Leasing input SEND TO MY PHONE About lot rent The lot rent ranges from $475 - $725 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Desert Terrace Mobile Estates is an all-ages manufactured home community located in 5063 S Hwy 97, Redmond, OR 97756. Desert Terrace Mobile Estates is a land-lease community was built in 1960. and has a total of 53 home sites. Home site lot rent ranges from $475 - $725 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an average street width. The water in the community is sourced from the well and the sewer system is septic. Parking is off-street The community has 0 parking spaces available for RVs. Desert Terrace Mobile Estates is an affordable housing choice for active, family-friendly living. This well-maintained community has easy access to local schools, recreation, shopping and entertainment. Equal Housing Opportunity Local Climate COLD Desert Terrace Mobile Estates is located in Climate Zone 5.\n        A COLD climate is defined as a region with between 5,400 and 9,000 heating degree days (65°F basis). Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America COLD climate zone corresponds to the portions of IECC zone 5 and 6. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Desert Terrace Mobile Estates at 5063 S Hwy 97, Redmond, OR 97756 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Sun Outdoors Bend Bend, OR Community Type family_restroom All Ages City MHC Prineville, OR Community Type group_add Age Restricted Juniper Hilltop MHC Bend, OR Community Type family_restroom All Ages About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    }
  ]
}