{
  "fuentes": [
    {
      "url": "https://www.palmbeachzoo.org/donate-1",
      "email": "donate@palmbeachzoo.org"
    },
    {
      "url": "https://www.palmbeachzoo.org/big-cat-society",
      "email": "donate@palmbeachzoo.org"
    },
    {
      "url": "https://www.palmbeachzoo.org/zoo-news",
      "email": "finalists_socials_v@-04.png"
    },
    {
      "url": "https://www.palmbeachzoo.org/zoo-news",
      "email": "webadmin@rpagency.com"
    },
    {
      "url": "https://business.palmbeaches.org/list/member/palm-beach-zoo-conservation-society-749",
      "email": "chamber@palmbeaches.org"
    },
    {
      "url": "https://www.wptv.com/news/region-c-palm-beach-county/west-palm-beach/meet-the-new-leader-of-the-palm-beach-zoo",
      "email": "erin.sadler@wptv.com"
    },
    {
      "url": "https://www.wptv.com/news/region-c-palm-beach-county/west-palm-beach/meet-the-new-leader-of-the-palm-beach-zoo",
      "email": "alanna.quillen@wptv.com"
    },
    {
      "url": "https://www.wptv.com/news/region-c-palm-beach-county/west-palm-beach/meet-the-new-leader-of-the-palm-beach-zoo",
      "email": "sbilling@wptv.com"
    },
    {
      "url": "https://primetimepbc.org/palm-beach-zoo/",
      "email": "education@palmbeachzoo.org"
    },
    {
      "url": "https://leadiq.com/c/palm-beach-zoo--conservation-society/5a1d98f7230000540087908c",
      "email": "john@palmbeachzoo.org"
    },
    {
      "url": "https://leadiq.com/c/palm-beach-zoo--conservation-society/5a1d98f7230000540087908c",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/palm-beach-zoo--conservation-society/5a1d98f7230000540087908c",
      "email": "sales@leadiq.com"
    }
  ],
  "mails": [
    "alanna.quillen@wptv.com",
    "chamber@palmbeaches.org",
    "donate@palmbeachzoo.org",
    "education@palmbeachzoo.org",
    "erin.sadler@wptv.com",
    "finalists_socials_v@-04.png",
    "john@palmbeachzoo.org",
    "name@company.com",
    "sales@leadiq.com",
    "sbilling@wptv.com",
    "webadmin@rpagency.com"
  ],
  "nombre_sitio": "palmbeachzoo.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.palmbeachzoo.org/donate-1",
      "text": "Donate Close Tickets & Information Purchase Daytime Tickets Membership Reciprocal Zoos Membership FAQ Military Discount Animals Play, Eat, Shop Zoo Map NEW Panther Cam Lorikeet Loft Animal Experiences Animal Experience Info Aldabra Tortoise Experience Panther Experience Otter Experience Koala Experience Bear Experience Animal Experience FAQs Sloth Experience Zoo Camp & Teen Volunteers Wildlife Saving Hero Zoo Teen Volunteer Program Summer Zoo Camp Groups & Events Group Rates Events Zoo Events Calendar Do at the Zoo Gala Parties and Gatherings Autism Awareness Day Saving Wildlife Palm Beach Zoo Wildlife Conservation Florida Wildlife Corridor: Protecting Florida Panther Swallow-tailed Kites Snail Kite Flamingos in Florida Florida's Coral Reef Saving Giraffe Tiger Conservation Everglades Center Wildlife Saving Actions Coloring Pages Support The Zoo Donate To Your Zoo Big Cat Society Help Fund Capital Projects Partners Contact Us Donation Request Policy Media Contact Partner Spotlight: Palm Beach Post Adopt an Animal Partnerships Donor Privacy Policy Join The Team Job Opportunities About Us Zoo Mission Zoo History Zoo News Zoo News Leadership Meet the Chiefs Board of Directors Association of Zoos and Aquariums (AZA) Donation Request Financials Impact Reports Updates Donate to your Zoo Order Food Buy Tickets Join the Team Facebook Twitter YouTube Pinterest Instagram Link to Homepage Donate to your Zoo Order Food Buy Tickets Join the Team Facebook Twitter YouTube Pinterest Instagram Tickets & Information Purchase Daytime Tickets Membership Reciprocal Zoos Membership FAQ Military Discount Animals Play, Eat, Shop Zoo Map NEW Panther Cam Lorikeet Loft Animal Experiences Animal Experience Info Aldabra Tortoise Experience Panther Experience Otter Experience Koala Experience Bear Experience Animal Experience FAQs Sloth Experience Zoo Camp & Teen Volunteers Wildlife Saving Hero Zoo Teen Volunteer Program Summer Zoo Camp Groups & Events Group Rates Events Zoo Events Calendar Do at the Zoo Gala Parties and Gatherings Autism Awareness Day Saving Wildlife Palm Beach Zoo Wildlife Conservation Florida Wildlife Corridor: Protecting Florida Panther Swallow-tailed Kites Snail Kite Flamingos in Florida Florida's Coral Reef Saving Giraffe Tiger Conservation Everglades Center Wildlife Saving Actions Coloring Pages Support The Zoo Donate To Your Zoo Big Cat Society Help Fund Capital Projects Partners Contact Us Donation Request Policy Media Contact Partner Spotlight: Palm Beach Post Adopt an Animal Partnerships Donor Privacy Policy Join The Team Job Opportunities About Us Zoo Mission Zoo History Zoo News Zoo News Leadership Meet the Chiefs Board of Directors Association of Zoos and Aquariums (AZA) Donation Request Financials Impact Reports Updates Link to Homepage Link to Open Menu CLOSE Enter your search term and press enter. Press Esc or X to close. Donate Now Learn More Support The Zoo Donate To Your Zoo The wildlife in our care count on us. Palm Beach Zoo & Conservation Society provides the highest quality of health and wellbeing for our animal residents. The Zoo counts on you! The generosity of our community helps us continue to advance our care for animals, educate children (future wildlife-saving heroes!) and protect wildlife here at home and across the globe. Your support means the world to our animals and people who love them. DONATE TODAY Zoo Something Good & Get a Sticker Donate to receive a collectible, eco-friendly sticker for doing your part to help wildlife. Help us to ZOO even more good for our animals and carry out our essential wildlife-saving mission with a donation today. LEARN MORE Connect with us to hear more about our wildlife-saving mission. Questions? Please contact Brittany Wade, Annual Giving Manager, at [email protected] or 561.533.0887 x222. Donor Privacy Policy Palm Beach Zoo is committed to protecting the privacy of our donors. We will not sell, trade or share a donor’s personal information with anyone else. See complete policy. Palm Beach Zoo & Conservation Society is a 501(c)(3) non-profit organization and relies on your support to continue providing extraordinary animal care and saving wildlife in wild places. All donations to the Palm Beach Zoo are tax-exempt. Zoological Society of the Palm Beaches EIN 59-1259270. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING FDACS.GOV. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. REGISTRATION #CH970 Palm Beach Zoo & Conservation Society 1301 Summit Blvd. West Palm Beach, FL 33405 We're currently experiencing technical difficulties with our payment processor. If you are interested in donating, please contact Brittany Wade at [email protected] for immediate assistance. Thank you for your support of Palm Beach Zoo & Conservation Society. Our Sponsors View all sponsors Link to Homepage 1301 Summit Boulevard West Palm Beach, Florida 33405-3035 (561) 547-9453 (WILD) Quick Links Home Hours & Admission Directions Visitor Code of Conduct Contact Us Terms and Conditions Home Hours & Admission Directions Visitor Code of Conduct Contact Us Terms and Conditions Palm Beach Zoo & Conservation Society is a 501(c)(3) non-profit organization and relies on your support to continue providing extraordinary animal care and saving wildlife in wild places. All donations to the Palm Beach Zoo are tax-exempt. Memphis Web Design by Speak . Sitemap . Facebook Twitter YouTube Pinterest Instagram Buy Tickets"
    },
    {
      "url": "https://www.palmbeachzoo.org/big-cat-society",
      "text": "Big Cat Society | Palm Beach Zoo Close Tickets & Information Purchase Daytime Tickets Membership Reciprocal Zoos Membership FAQ Military Discount Animals Play, Eat, Shop Zoo Map NEW Panther Cam Lorikeet Loft Animal Experiences Animal Experience Info Aldabra Tortoise Experience Panther Experience Otter Experience Koala Experience Bear Experience Animal Experience FAQs Sloth Experience Zoo Camp & Teen Volunteers Wildlife Saving Hero Zoo Teen Volunteer Program Summer Zoo Camp Groups & Events Group Rates Events Zoo Events Calendar Do at the Zoo Gala Parties and Gatherings Autism Awareness Day Saving Wildlife Palm Beach Zoo Wildlife Conservation Florida Wildlife Corridor: Protecting Florida Panther Swallow-tailed Kites Snail Kite Flamingos in Florida Florida's Coral Reef Saving Giraffe Tiger Conservation Everglades Center Wildlife Saving Actions Coloring Pages Support The Zoo Donate To Your Zoo Big Cat Society Help Fund Capital Projects Partners Contact Us Donation Request Policy Media Contact Partner Spotlight: Palm Beach Post Adopt an Animal Partnerships Donor Privacy Policy Join The Team Job Opportunities About Us Zoo Mission Zoo History Zoo News Zoo News Leadership Meet the Chiefs Board of Directors Association of Zoos and Aquariums (AZA) Donation Request Financials Impact Reports Updates Donate to your Zoo Order Food Buy Tickets Join the Team Facebook Twitter YouTube Pinterest Instagram Link to Homepage Donate to your Zoo Order Food Buy Tickets Join the Team Facebook Twitter YouTube Pinterest Instagram Tickets & Information Purchase Daytime Tickets Membership Reciprocal Zoos Membership FAQ Military Discount Animals Play, Eat, Shop Zoo Map NEW Panther Cam Lorikeet Loft Animal Experiences Animal Experience Info Aldabra Tortoise Experience Panther Experience Otter Experience Koala Experience Bear Experience Animal Experience FAQs Sloth Experience Zoo Camp & Teen Volunteers Wildlife Saving Hero Zoo Teen Volunteer Program Summer Zoo Camp Groups & Events Group Rates Events Zoo Events Calendar Do at the Zoo Gala Parties and Gatherings Autism Awareness Day Saving Wildlife Palm Beach Zoo Wildlife Conservation Florida Wildlife Corridor: Protecting Florida Panther Swallow-tailed Kites Snail Kite Flamingos in Florida Florida's Coral Reef Saving Giraffe Tiger Conservation Everglades Center Wildlife Saving Actions Coloring Pages Support The Zoo Donate To Your Zoo Big Cat Society Help Fund Capital Projects Partners Contact Us Donation Request Policy Media Contact Partner Spotlight: Palm Beach Post Adopt an Animal Partnerships Donor Privacy Policy Join The Team Job Opportunities About Us Zoo Mission Zoo History Zoo News Zoo News Leadership Meet the Chiefs Board of Directors Association of Zoos and Aquariums (AZA) Donation Request Financials Impact Reports Updates Link to Homepage Link to Open Menu CLOSE Enter your search term and press enter. Press Esc or X to close. Give Now Learn More Support The Zoo Big Cat Society Zoo More Good for Big Cats As a philanthropic community member, you are invited to join Palm Beach Zoo's Big Cat Society. Big Cat Society members are annual Zoo supporters who care about tigers, jaguars and panthers here at home and in the wild. Big Cat Society = Connection Enjoy insider access to Zoo news, birth announcements, invitations to Zoo events and habitat previews, and unlimited admission for you and your family, discounts at our cafe and gift shops, plus free or discounted access to over 140 AZA-accredited zoos, aquariums and museums worldwide. Your support makes a real difference in protecting big cats and their habitats. Join today to roar for big cats (and little ones, too). Join Today Benefits Become a member of Big Cat Society and experience unparalleled access to wildlife while supporting vital conservation efforts. Membership includes: Unlimited daytime family admission to the Zoo Discounts at Latitude 26 Café, concession areas and the gift shop Free or discounted admission to 140+ AZA-accredited zoos, aquariums and museums worldwide Exclusive invitations to special events and habitat previews Monthly Big Cat Insider updates with the latest Zoo news, including births and new arrivals Opportunities for private animal experiences and tours (varies by level) This membership group offers exclusive access to Palm Beach Zoo’s remarkable animals, staff and programs, providing a unique opportunity to connect more deeply with our wildlife-saving mission alongside fellow conservation supporters. ANNUAL MEMBERSHIP LEVELS Please select your level by\n                            \t\t\t\tclicking on the images. Thank you for your support. Big Cat Champion - $25,000 Tiger - $10,000 Panther - $5,000 Jaguar - $2,500 Serval Cat - $1,000 Cub Club - $500 Make a one-time gift (Fully Tax-Deductible) Give A Gift Wildlife-Saving Initiatives for Big Cats Helping Jaguars and Humans Thrive Palm Beach Zoo is partnering with Belizean conservationists at Belize Zoo to provide equipment and supplies that ensure safe solutions and education for people living around jaguars in the wild. These beautiful animals in Belize face many of the same threats as Florida panthers at home. Conservationists need to find ways to ensure humans and wildlife can live and thrive in the same landscape. The Zoo also supports planning for wildlife road mortality prevention, which includes designing safe road-crossing options for jaguars and other wildlife in Belize. Every Zoo visit or membership helps save jaguars in the wild. Join Today Credit: Carlton Ward Jr. Saving Wild Panthers, Bears and Other Florida Wildlife Palm Beach Zoo staff assisted Carlton Ward Jr., founder of the Florida Wildlife Corridor program, in installing trail cameras to track the movement of wild panthers. Findings highlighted the need for land connectivity throughout the state. This essential work led to the unanimous passing of the Florida Wildlife Corridor Act in 2021, providing incentives and formal designation for the statewide corridor. A statewide system for the endangered Florida panther simultaneously creates safe passage for black bears, white-tailed deer, otters and other wildlife. Every Zoo visit or membership helps save panthers in the wild. Join Today Credit: Carlton Ward Jr. Welcome to Tiger Forest Our Zoo is committed to tigers, especially Malayan tigers. They are in trouble in the wild, and their populations are not sufficiently robust in zoos throughout the United States and Europe. Palm Beach Zoo has had tremendous success. Our Malayan tiger offspring are among the most essential births for the subspecies in the world. With our new Tiger Forest habitat, we built a sanctuary for tigers in Palm Beach, which created the most unforgettable guest experience. Tiger Forest brings people up-close with just a sheet of glass between human and tiger for a nose-to-whisker encounter. Most importantly, this new habitat gets visitors excited about tiger conservation. We’ve designed for our big cats the wildest, best place to live in a zoo, and we remain committed to conserving them in the wild. Palm Beach Zoo partners with Panthera Malaysia (an organization dedicated to preserving 40 species of wild cats) and its conservation efforts in Kenyir-Taman Negara, Peninsular Malaysia. Led by Dr. Wai Yee Lam, the team monitors Malayan tigers using remote trail cameras and patrols miles of forest to collect data, detect poaching activity and implement wildlife protection strategies. Every Zoo visit or membership helps save tigers in the wild. Join Today Questions? Please contact Brittany Wade, Annual Giving Manager, at [email protected] or 561.533.0887 x222. Donor Privacy Policy Palm Beach Zoo is committed to protecting the privacy of our donors. We will not sell, trade or share a donor’s personal information with anyone else. See complete policy. Palm Beach Zoo & Conservation Society is a 501(c)3 non-profit organization and relies on your support to continue providing extraordinary animal care and saving wildlife in wild places. All donations to the Palm Beach Zoo are tax-exempt. Zoological Society of the Palm Beaches EIN 59-1259270. *GOODS & SERVICES ARE VALUED AT $224.95 PER MEMBERSHIP. CONTRIBUTIONS IN EXCESS OF $224.95 ARE TAX-DEDUCTIBLE TO THE FULL EXTENT PERMITTED BY THE LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING FDACS.GOV. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. REGISTRATION #CH970 Palm Beach Zoo & Conservation Society 1301 Summit Blvd. West Palm Beach, FL 33405 We're currently experiencing technical difficulties with our payment processor. If you are interested in joining Big Cat Society or renewing your membership, please contact Brittany Wade at [email protected] for immediate assistance. Thank you for your support of Palm Beach Zoo & Conservation Society. Our Sponsors View all sponsors Link to Homepage 1301 Summit Boulevard West Palm Beach, Florida 33405-3035 (561) 547-9453 (WILD) Quick Links Home Hours & Admission Directions Visitor Code of Conduct Contact Us Terms and Conditions Home Hours & Admission Directions Visitor Code of Conduct Contact Us Terms and Conditions Palm Beach Zoo & Conservation Society is a 501(c)(3) non-profit organization and relies on your support to continue providing extraordinary animal care and saving wildlife in wild places. All donations to the Palm Beach Zoo are tax-exempt. Memphis Web Design by Speak . Sitemap . Facebook Twitter YouTube Pinterest Instagram Buy Tickets"
    },
    {
      "url": "https://www.palmbeachzoo.org/zoo-news",
      "text": "Zoo News Close Tickets & Information Purchase Daytime Tickets Membership Reciprocal Zoos Membership FAQ Military Discount Animals Play, Eat, Shop Zoo Map NEW Panther Cam Lorikeet Loft Animal Experiences Animal Experience Info Aldabra Tortoise Experience Panther Experience Otter Experience Koala Experience Bear Experience Animal Experience FAQs Sloth Experience Zoo Camp & Teen Volunteers Wildlife Saving Hero Zoo Teen Volunteer Program Summer Zoo Camp Groups & Events Group Rates Events Zoo Events Calendar Do at the Zoo Gala Parties and Gatherings Autism Awareness Day Saving Wildlife Palm Beach Zoo Wildlife Conservation Florida Wildlife Corridor: Protecting Florida Panther Swallow-tailed Kites Snail Kite Flamingos in Florida Florida's Coral Reef Saving Giraffe Tiger Conservation Everglades Center Wildlife Saving Actions Coloring Pages Support The Zoo Donate To Your Zoo Big Cat Society Help Fund Capital Projects Partners Contact Us Donation Request Policy Media Contact Partner Spotlight: Palm Beach Post Adopt an Animal Partnerships Donor Privacy Policy Join The Team Job Opportunities About Us Zoo Mission Zoo History Zoo News Zoo News Leadership Meet the Chiefs Board of Directors Association of Zoos and Aquariums (AZA) Donation Request Financials Impact Reports Updates Donate to your Zoo Order Food Buy Tickets Join the Team Facebook Twitter YouTube Pinterest Instagram Link to Homepage Donate to your Zoo Order Food Buy Tickets Join the Team Facebook Twitter YouTube Pinterest Instagram Tickets & Information Purchase Daytime Tickets Membership Reciprocal Zoos Membership FAQ Military Discount Animals Play, Eat, Shop Zoo Map NEW Panther Cam Lorikeet Loft Animal Experiences Animal Experience Info Aldabra Tortoise Experience Panther Experience Otter Experience Koala Experience Bear Experience Animal Experience FAQs Sloth Experience Zoo Camp & Teen Volunteers Wildlife Saving Hero Zoo Teen Volunteer Program Summer Zoo Camp Groups & Events Group Rates Events Zoo Events Calendar Do at the Zoo Gala Parties and Gatherings Autism Awareness Day Saving Wildlife Palm Beach Zoo Wildlife Conservation Florida Wildlife Corridor: Protecting Florida Panther Swallow-tailed Kites Snail Kite Flamingos in Florida Florida's Coral Reef Saving Giraffe Tiger Conservation Everglades Center Wildlife Saving Actions Coloring Pages Support The Zoo Donate To Your Zoo Big Cat Society Help Fund Capital Projects Partners Contact Us Donation Request Policy Media Contact Partner Spotlight: Palm Beach Post Adopt an Animal Partnerships Donor Privacy Policy Join The Team Job Opportunities About Us Zoo Mission Zoo History Zoo News Zoo News Leadership Meet the Chiefs Board of Directors Association of Zoos and Aquariums (AZA) Donation Request Financials Impact Reports Updates Link to Homepage Link to Open Menu CLOSE Enter your search term and press enter. Press Esc or X to close. About Us Zoo News Zoo News Friday , Aug 29 , 2025 Palm Beach Zoo's Partnership in New Bear Film We’re excited to share that Palm Beach Zoo has partnered with National Geographic, Wildpath, and our longtime friend Carlton Ward Jr. on a new short film, Florida Bear Tracks. This inspiring project was made possible by the generosity of one of our wonderful long-time donors, a passionate advocate for black bear conservation.\n                                                                        The film follows an all-women Florida Fish and Wildlife Conservation Commission (FWC) team as they study and protect Florida black be... Read More Posted by RP Web Admin at Friday , Aug 29 , 2025 Friday , Aug 29 , 2025 Swaptember Returns Double your membership perks during the month of September! Our members can enjoy free daily admission to both the Palm Beach Zoo & Cox Science Center & Aquarium on the same day. Up to four members per party can enjoy this special perk and make it a whole day of fun between both locations.\n                                                                        Looking to become a member? You can still sign up today and enjoy this perk right away. Members of the Palm Beach Zoo & Conservation Society can enjoy special events throughout the year. Just recently, our ... Read More Posted by RP Web Admin at Friday , Aug 29 , 2025 Wednesday , Aug 20 , 2025 New Home for Sloths and Tamarins Palm Beach Zoo & Conservation Society is inviting guests to take a walk through the forest with the newest addition to its immersive experiences. An extraordinary habitat for sloths and tamarins opens Thursday, August 28, giving visitors a chance to explore a unique canopy designed for these charismatic tree-dwellers—all from the comfort of their own zoo.\n                                                                        Guests will be arms length away from wildlife because of the habitat’s immersive design. As people visit this new wild space, s... Read More Posted by RP Web Admin at Wednesday , Aug 20 , 2025 Tuesday , Jun 3 , 2025 Kids Free Summer 2025! KIDS FREE is back at Palm Beach Zoo this Summer!\n                                                                        What better way to entertain the kids this summer than a visit to Palm Beach Zoo? Keep cool under shaded pathways as you explore exotic habitats and meet the incredible animals that call this place home. Make a splash in the newly reimagined Fountain Plaza Splash Pad, chill out with ice-cold Dippin' Dots, take a magical spin on the carousel, and create unforgettable moments feeding our vibrant flock of birds in the Lorikeet Loft.\n                                                                        At Palm Beach ... Read More Posted by RP Web Admin at Tuesday , Jun 3 , 2025 Thursday , May 15 , 2025 Take Action: The Endangered Species Act Needs Your Voice. At Palm Beach Zoo, our mission is to inspire people to act on behalf of wildlife and the natural world. As a conservation society, we don’t just encourage action, we lead by example. Advocacy is one of the many ways we protect wildlife in wild places.\n                                                                        Habitat protection is essential for the survival of countless threatened and endangered species and truly, for all life. That’s why Zoo Leadership is speaking out against proposed changes to the Endangered Species Act (ESA).\n                                                                        The ESA ... Read More Posted by RP Web Admin at Thursday , May 15 , 2025 Friday , Apr 11 , 2025 NEW Sloth and Golden Lion Tamarin Habitat Coming This Summer Palm Beach Zoo & Conservation Society is proud to announce the construction of its latest innovative habitat that will elevate the guest experience and animal welfare.\n                                                                        Two iconic South American species, the Hoffman's two-toed sloth and the golden lion tamarin, a tiny orange monkey, will share an environment that supports greater choices for the animals to interact (or not, as they choose) with more opportunities to travel, rest, forage or to just hang around!\n                                                                        Guests will feel as though they h... Read More Posted by RP Web Admin at Friday , Apr 11 , 2025 Tuesday , Apr 1 , 2025 Be a Wildlife-Saving Hero Be a Wildlife-Saving Hero \n                                                                        Palm Beach Zoo is excited to celebrate Earth Day with you on April 22. The easiest way to celebrate is by coming to Palm Beach Zoo. A portion of your ticket goes to saving wildlife. BUT, there are lots of ways you can be a Wildlife Saving Hero.\n                                                                        Be Bear Aware!\n                                                                        \n                                                                        Bears have a very powerful sense of smell but have a hard time distinguishing between their natural diet, and garbage left out by humans. This can often lure them into neighborhoods where they are no... Read More Posted by RP Web Admin at Tuesday , Apr 1 , 2025 Saturday , Mar 1 , 2025 Join Us For Save the Panther Day Join Us For Save the Panther Day\n                                                                        Saturday, March 15Come to Palm Beach Zoo to spend a fun and educational day meeting Sassy, a Florida Panther, up close and speaking with Zoologists and experts about Florida panthers. Florida panthers are critically endangered, but Floridians (like you!) have done a lot to help the species by supporting and creating wildlife corridors across Florida. Corridors allow panthers to travel between habitats to find food, shelter, and mates.\n                                                                         \n                                                                        \n                                                                        Your Zoo Is Savin... Read More Posted by RP Web Admin at Saturday , Mar 1 , 2025 Monday , Feb 3 , 2025 New Tiger Habitat Unveiled - Tiger Forest Palm Beach Zoo & Conservation Society is thrilled to announce the grand opening of \"Tiger Forest,\" a groundbreaking habitat that redefines wildlife care and guest engagement. Opening on Saturday, February 15, 2025, this innovative exhibit marks a significant step forward in the Zoo’s mission to protect endangered species while creating transformative experiences for visitors of all ages.\n                                                                        The Tiger Forest habitat exemplifies the Zoo of the Future, where innovative animal care practi... Read More Posted by RP Web Admin at Monday , Feb 3 , 2025 Saturday , Feb 1 , 2025 This Valentine’s Day Give Your Loved Ones Bird-Friendly Chocolate Eating chocolate on Valentine’s Day is a treasured tradition that can also save wildlife! Chocolate that has been certified by the Smithsonian’s Bird Friendly certification program can help the wild counterparts of birds, like Ajax, Palm Beach Zoo’s resident red-tailed hawk, in the wild. Chocolate with this certification guarantees that 100% of the cocoa used comes from farms that help to protect forests and native shade trees where these birds need to thrive in the wild.&nb... Read More at Saturday , Feb 1 , 2025 Friday , Jan 3 , 2025 New Tiger, New Home, New Adventure! Palm Beach Zoo & Conservation Society is excited to announce its new arrival, Olan, a 10-year-old male Malayan Tiger. The team of Zoologists who care for him are enjoying getting to know him as he acclimates to his new home. Olan is adjusting very well, and his friendly and fun disposition was evident on day one. Guests can see Olan playing, enjoying enrichment, and sharing space between the Tiger Forest and Tiger Falls habitats.\n                                                                        Olan arrives from El Paso Zoo through a Malayan Tiger Species S... Read More Posted by RP Web Admin at Friday , Jan 3 , 2025 Wednesday , Jan 1 , 2025 Have a Wildlife-Saving Birthday Party! Celebrating a birthday at Palm Beach Zoo & Conservation Society is a unique and exciting experience! Guests can enjoy a day surrounded by exotic animals, from playful monkeys to majestic big cats.\n                                                                        Guests can kick off the celebration with an exciting Lorikeet loft feeding, where everyone can interact with these colorful birds. Head over to the carousel where kids will love taking a spin, right next to the Panther Plaza. The party includes admission to the entire zoo, allowing guests to explore... Read More at Wednesday , Jan 1 , 2025 Tuesday , Dec 3 , 2024 Donor Brick Removal in Preparation for Renovations and Additions In 2005 and 2006, Palm Beach Zoo & Conservation Society, then known as Palm Beach Zoo at Dreher Park, began selling engraved bricks to be placed in the Zoo’s carousel courtyard and former aviary and pollinator garden as a fundraiser for community members to honor someone special in their lives. These pavers - now almost 20 years old - will be removed during the  Fall of 2024 to accommodate imminent renovations that will take place on Zoo grounds over the next few years.\n                                                                        \n                                                                        \n                                                                         The sta... Read More Posted by RP Web Admin at Tuesday , Dec 3 , 2024 Sunday , Dec 1 , 2024 Give the Perfect Gift From Palm Beach Zoo This Holiday Season Palm Beach Zoo has your gift list covered this holiday season. Surprise your loved ones with a wild adventure all year long with an annual membership, an incredible up-close animal experience with their favorite animal, or a night under the stars with Zoo Light tickets for a holiday spectacular like no other. Want more? Give the gift that keeps on giving with an annual membership. Each gift supports Palm Beach Zoo’s wildlife saving and conservation efforts. There’s so much to... Read More Posted by RP Web Admin at Sunday , Dec 1 , 2024 Monday , Nov 25 , 2024 Palm Beach Zoo Mourns the Loss of Beloved Two-toed Sloth, Wilbur. It is with great sadness that we announce the passing of Wilbur, our cherished Hoffman’s two-toed sloth. \n                                                                        “Wilbur has touched the hearts of many people over the past 22 years,” said Renee Bumpus, chief animal & conservation officer at Palm Beach Zoo & Conservation Society. “This loss has deeply affected all our staff, especially the animal professionals that cared for her. She was truly family.”\n                                                                        On Tuesday, November 12, the animal care team brought Wilbur to... Read More Posted by RP Web Admin at Monday , Nov 25 , 2024 Friday , Nov 1 , 2024 This Holiday Season Give the Perfect Gift From Palm Beach Zoo Palm Beach Zoo has your gift list covered this holiday season. Surprise your loved ones with a wild adventure all year long with an annual membership, an incredible up-close animal experience with their favorite animal, or a night under the stars with Zoo Light tickets for a holiday spectacular like no other. Want more? Give the gift that keeps on giving with an annual membership. Each gift supports Palm Beach Zoo’s wildlife saving and conservation efforts. There’s so much to... Read More at Friday , Nov 1 , 2024 Tuesday , Oct 1 , 2024 Fall for Palm Beach Zoo this October Enjoy unique seasonal activities and experiences with our first-ever fall-inspired event: Fall For Palm Beach Zoo! From October 1 through October 31, the Zoo is offering an exciting range of special daily animal activities, photo opportunities, a new fall lunch menu and much more. All of the fall-themed fun is included in the regular admission price. No additional ticket purchase is required. From bears bobbing for apples to tigers tearing up hay bales, you’re in for some rare expe... Read More at Tuesday , Oct 1 , 2024 Wednesday , Sep 25 , 2024 Black and White Lemurs Make Zoo History Palm Beach Zoo & Conservation Society has welcomed a new fluffy family of primates. Six black-and-white ruffed lemurs (four five-month-old babies and their parents) are now living on one of Palm Beach Zoo’s specialized primate islands along the west side of the Zoo.\n                                                                        For the first time in this Zoo’s history, a family of black-and-white lemurs can call Palm Beach Zoo their home. This family of lemurs was recommended to Palm Beach Zoo by the Lemur Species Survival Plan®&nb... Read More Posted by RP Web Admin at Wednesday , Sep 25 , 2024 Sunday , Sep 1 , 2024 ZOO MORE GOOD WITH A PALM BEACH ZOO MEMBERSHIP Have you thought about becoming a member of Palm Beach Zoo & Conservation Society?\n                                                                        Zoo membership opens the door to a wildlife connection like no other. With an annual membership, you can visit our beautiful 23-acre park as many times as you want for an entire year. As a member, you’ll also enjoy some WILDLY amazing perks. Plus, a range of membership levels is available to ensure the right fit for everyone.\n                                                                        Zoo Member Benefits\n                                                                        \n                                                                        UNLIMITED daytime admission to Palm Beach Zoo & Conservati... Read More at Sunday , Sep 1 , 2024 Wednesday , Jul 31 , 2024 Flamingoals For Flamingos In Florida Famous for their bright pink feathers, flamingos are one of the world’s most fascinating and flamboyant birds. Their vibrant plumage makes them a truly amazing sight to behold, especially when they are seen in large flocks in which thousands of flamingos come together. \n                                                                        We have not seen a sea of pink on our Florida shores since the 19th century, when the plume trade annihilated flamingo and other wading bird populations in South Florida. Despite legislation to protect them, the des... Read More at Wednesday , Jul 31 , 2024 Monday , Jul 1 , 2024 Meet Our New Capybara Palm Beach Zoo & Conservation Society is thrilled to announce the arrival of a new fan favorite, capybara. Iyari (e-yar-e), a ten-month-old female capybara from the San Diego Zoo Wildlife Alliance is currently visible to guests in the Zoo’s Tropics of the Americas section.\n                                                                        Iyari's journey to South Florida began with a recommendation from the Association of Zoos and Aquariums (AZA) a professional organization that holds zoos and aquariums to the gold standard of animal care and conservat... Read More at Monday , Jul 1 , 2024 Thursday , Jun 13 , 2024 A Name Has Been Chosen! The public has spoken. After several weeks of online and in-person voting, resulting in over one thousand votes, the Zoo's baby sloth officially has a name. Fern!\n                                                                        Two-toed sloth mother, Wilbur, and her baby continue to thrive as they reach milestone after milestone. The only thing that was missing was a name. After five names were chosen by the zoologists who care for the sloth family, we let our loyal fans and supporters make the final selection. The names chosen for the selection process we... Read More Posted by RP Web Admin at Thursday , Jun 13 , 2024 Friday , May 31 , 2024 CORAL REEF CONSERVATION: WHY IT MATTERS The health of coral reefs around the world is under serious threat. Recent data released by scientists at the National Oceanic and Atmospheric Administration (NOAA) confirms that the world is experiencing its fourth global event of coral bleaching. \n                                                                        \"From February 2023 to April 2024, significant coral bleaching has been documented in both the Northern and Southern Hemispheres of each major ocean basin,\" said Derek Manzello, PhD, NOAA Coral Reef Watch (CRW) Coordinator.\n                                                                        The affected reefs... Read More at Friday , May 31 , 2024 Monday , May 6 , 2024 BIG CAT MONTH AT PALM BEACH ZOO Our big cats are a big part of our work here at the Zoo, which is why we are shining a spotlight on these majestic felines this May. Palm Beach Zoo is home to a number of big cat species, including cougars, jaguars, panthers, servals and tigers. Many of our big cats are endangered and some (like Malayan tigers) are facing possible extinction in the wild.\n                                                                        Palm Beach Zoo & Conservation Society not only provides a safe haven for these threatened species, but it also endeavors to spark a connecti... Read More Posted by RP Web Admin at Monday , May 6 , 2024 Thursday , May 2 , 2024 Palm Beach Zoo & Conservation Society Has Been Selected as a Finalist for the 2024 Hospitality & Tourism Organization of the Year! In a community filled with world-class attractions and tourism destinations, Palm Beach Zoo & Conservation Society has been voted as one of the best.\n                                                                        Each year, the Chamber of Commerce of the Palm Beaches acknowledges the accomplishments of businesses and the impact they make on our community. On May 1st, Palm Beach Zoo was selected as a finalist for the 2024 Hospitality & Tourism Organization of the Year by the Chamber. It is a privilege to be selected by such an established and respected in... Read More Posted by RP Web Admin at Thursday , May 2 , 2024 Tuesday , Apr 30 , 2024 A Note On Our Lorikeet Unfortunately, we have the sad news that one of our parrots, a lorikeet named Catherine, is missing. After an extensive, internal investigation, we believe Catherine may have been taken from our Lorikeet Loft. We notified the police in hopes that our bird will be found and returned.\n                                                                        For Palm Beach Zoo, the safety of our guests, staff, and the animals in our care is the highest priority. We utilize new technology and enhanced expertise to implement safety measures across the Zoo.\n                                                                        We have 24/7 ... Read More Posted by RP Web Admin at Tuesday , Apr 30 , 2024 Thursday , Feb 1 , 2024 Two-toed Sloth Gives Birth to Her First Baby Palm Beach Zoo & Conservation Society is excited to announce the birth of a Hoffman's two-toed sloth. Both mom and baby are healthy and thriving.  The baby will depend on its mother for a few months and our veterinary and animal staff have been carefully monitoring mom and baby 24 hours a day.\n                                                                        At approximately 4 AM on January 23, Wilbur, the mother, gave birth inside her specially designed climate-controlled habitat. Guests may have noticed Wilbur (mom) had been moved into a new living s... Read More Posted by RP Web Admin at Thursday , Feb 1 , 2024 Wildlife-saving conservation in motion!   Palm Beach Zoo & Conservation Society Announces Opening of   the Candace S. & William H. Hamm III Everglades Conservation Center The new Everglades Center at the Zoo informs, encourages and empowers  children and their families to act on behalf of Florida’s wildlife and wild places.    \n                                                                        According to Palm Beach Zoo CEO and President Margo McKnight, “The Everglades Center inspires our community to save our Florida wildlife and wild places for those we love, both animal and human.  In keeping with our creative and engaging environments, stepping into the Everglades Center transports our gu... Read More Posted by RP Web Admin Conservation Florida Panther Friday , Apr 14 , 2023 PALM BEACH ZOO AWARDED ITS SEVENTH CONSECUTIVE PRESTIGIOUS ACCREDITATION WITH NOTABLE MENTIONS FROM THE ASSOCIATION OF ZOOS AND AQUARIUMS Palm Beach Zoo & Conservation Society President and CEO Margo McKnight announced today that Palm Beach Zoo has been granted its seventh consecutive accreditation by the Association of Zoos and Aquariums (AZA). The AZA is internationally recognized as the gold standard of zoos and aquariums for animal wellbeing, wildlife conservation, education, science; and recreation. It represents 238 of the very best zoos and aquariums, out of approximately 2800 animal exhibitors in the United States.\n                                                                        Acco... Read More Posted by RP Web Admin at Friday , Apr 14 , 2023 Palm Beach Zoo Welcomes Queensland Koala Ellin Palm Beach Zoo & Conservation Society is excited to welcome Ellin, a female Queensland koala, to the Zoo family. Ellin is two years old and was born at Columbus Zoo and Aquarium in Ohio to mom Katy and dad Thoar. Her name means “wish” in indigenous Australian.\n                                                                        \n                                                                        \t\t\t\t\t\t“Everyone adores Ellin! She is a remarkable animal that helps us invite guests to protect animals in the wild,” said Chief Animal & Conservation Officer Renee ... Read More Palm Beach Zoo Staff Deployed to Help with Hurricane Ian Recovery Members of the Palm Beach Zoo & Conservation Society team were deployed on Friday through Zoological Disaster Response, Rescue, and Recovery (ZDR3), the largest zoological disaster response organization in the United States. The Zoo team lent their skills to The Lemur Conservation Foundation in Myakka City, FL, located inland from Sarasota.\n                                                                        \n                                                                        In the aftermath of Hurricane Ian, flooding and downed trees were the top priority for the center, which includes three large wooded areas wh... Read More Hurricane Recovery ZDR3 Our Coral Reef Next Door One of the largest barrier reefs exists off the coast of Florida. Florida's Coral Reef stretches almost 350 miles from the Dry Tortugas to the St. Lucie Inlet. It is home to more than 40 species of corals that are living beings and responsible for building and maintaining the reef structure. The reef is an important asset which protects the Florida coast, is home to abundant sea life, and it is a key feature of snorkling, diving, fishing and ocean-loving tourism f... Read More Conservation Coral Dive Team Endangered  Red-Crowned Crane Born at Palm Beach Zoo WEST PALM BEACH, FLA - May 20, 2022 - To celebrate Endangered Species Day today, Palm Beach Zoo & Conservation Society has a fitting announcement. Statuesque red-crowned crane parents Akai (mom) and Yuki (dad) hatched a baby chick in the late morning of Wednesday, May 4. After 35 days of incubation, the young one made a grand entry inside the habitat as a surprise delight for guests passing by.\n                                                                        \n                                                                        \t\t\t\t\t\tThe Zoo’s avian zoologists have appropriatel... Read More Baby Animals Conservation Palm Beach Zoo Three African Crested Porcupettes Born at  Palm Beach Zoo WEST PALM BEACH - February 23, 2022 - For fans of baby animals, Palm Beach Zoo & Conservation Society will get right to the point! One of the Zoo's newest residents, Cleo the African crested porcupine, gave birth to three baby porcupines, or \"porcupettes,\" in the early hours of February 3, 2022.\n                                                                        \n                                                                        The three babies are healthy, with two of the littermates spending time with mom and dad, Priscilla, in their outfitted night house to give the new family private bonding time ... Read More animals Baby Animals Porcupines Palm Beach Zoo & Conservation Society Announces Groundbreaking of the Candace S. & William H. Hamm III Education & Conservation Center to Inspire Visitors with the Florida Panther Story WEST PALM BEACH, FL - January 11, 2022 - In an intimate family ceremony at Palm Beach Zoo & Conservation Society the day after Thanksgiving, three generations of the Hamm family took up the golden shovels and broke ground on the Candace S. & William H. Hamm III Education & Conservation Center.\n                                                                        \n                                                                        \t\t\t\t\t\tCandace Hamm, her daughter, Alexia Hamm Ryan; and granddaughters Theodora and Alexandra Ryan, marked the festive occasion with custom Zoo hardhat... Read More Palm Beach Zoo’s Holiday Spectacular, Zoo Lights Presented by FPL SolarNow, Returns for Select Evenings Starting November 19  Tickets Now on Sale! WHAT: Zoo Lights presented by FPL SolarNow \n                                                                        \n                                                                        WHERE: Palm Beach Zoo & Conservation Society\n                                                                        \n                                                                        WHEN: 6:00 PM - 9:00 PM, Select evenings beginning November  \n                                                                        \n                                                                        WEST PALM BEACH, November 5, 2021 – Prepare for illumination! Zoo Lights presented by Florida Power & Light Company, FPL SolarNow will flip on the switch November 19 and remain lit on select nights through January 2, 2022, at Palm Beach Zoo & Conserv... Read More Zoo Event Zoo Lights Pumpkinpalooza at Palm Beach Zoo Palm Beach Zoo & Conservation Society is celebrating the spooky season by delighting the animals with some extra special treats. Pumpkinpalooza at Palm Beach Zoo is Thursday, October 28 through Sunday, October 31, 2021. The Zoo is inviting the community to come out in costume and celebrate the season, while the animals receive the treats.  \n                                                                        \n                                                                        From tortoises and bears to alligators and squirrel monkeys, ani... Read More Spotted in Mayan Plaza How does a zoo safely arrange a “marriage” between Fiona and Zooka, two powerful and dangerous animals?\n                                                                        \n                                                                        Very carefully. \n                                                                        \n                                                                        By all accounts, expert consultants from other zoos and reproductive organizations noted that it seemed the right time to put them together. After many meetings through mesh called “howdies” and “go” signs from the animals, the jaguars were brought together. \n                                                                        \n                                                                        A hair-raising fight ensued. Our betrothed jaguar couple Fiona and ... Read More Perfect Day at the Zoo Tips for a Perfect Day at the Zoo\n                                                                        Whether you are a local enjoying a little staycation, or you are visiting from far and wide, here are some tips straight from our zoologists and staff for turning your trip to the zoo into the perfect day!\n                                                                        Find the Perfect Ticket\n                                                                        Make sure to buy your tickets on our website so you can find the ideal option for you! Visit www.palmbeachzoo.org/tickets to explore our different ticket and membership options.\n                                                                        You can also go to www.palmbeachzoo.org/general-i... Read More Palm Beach Zoo Honors the Life of Oldest Sloth Palm Beach Zoo & Conservation Society celebrates the life of Tootsie, a 46-year-old Hoffman’s two-toed sloth, who passed away due to natural causes.   She was surrendered to Lincoln Park Zoo in 1976 by a private citizen making her the oldest sloth currently in managed care. Her longevity is due to the exceptional nutrition and veterinary care she received over her lifetime. The median life expectancy in the wild for a sloth is 15 years and Tootsie far surpassed this milest... Read More Long Life Sloth Koalafied Cuteness! Palm Beach Zoo Announces Exciting Animal Addition WEST PALM BEACH, FL – April 14, 2021 - What has short greyish fur, a boopable nose and the cutest ears you have ever seen? The answer is the latest addition to Palm Beach Zoo’s animal family. Sydney, aptly named after the largest city in Australia, is a two-year-old Queensland koala who has made his way to his new home in West Palm Beach! Sydney is a special new addition, as he is the nephew of both former Zoo koala residents, Oz and Katherine.\n                                                                        \n                                                                        Sydney was born at Z... Read More animals Conservation Koala Palm Beach Zoo Teams Up With Top Country Artists for   “All Together For Animals” Virtual Benefit Concert Proceeds will benefit animal care and conservation at Palm Beach Zoo \n                                                                        \t\t\t\t\t\t\n                                                                        \t\t\t\t\t\n                                                                        \t\t\t\t\n                                                                        \t\t\t\n                                                                        \t\t\t\n                                                                        \t\t\n                                                                        \t\n                                                                        \n                                                                        \n                                                                        \n                                                                        \t\n                                                                        \t\t\n                                                                        \t\t\t\n                                                                        \t\t\t\n                                                                        \t\t\t\t\n                                                                        \t\t\t\t\t\n                                                                        \t\t\t\t\t\t\n                                                                        \t\t\t\t\t\tWEST PALM BEACH, FL – March 24,2021 - Palm Beach Zoo & Conservation Society and the Association of Zoos and Aquariums (AZA) announced an interactive virtual music benefit concert – “ALL TOGETHER FOR ANIMALS.” This a... Read More Conservation Man Walking 200 Miles to Save Florida Panthers Visits Palm Beach Zoo WEST PALM BEACH, FL - February 9, 2021 - Steve Fugate crisscrossed the U.S. eight times and his latest mission is to bring attention to the plight of the Florida panther. Palm Beach Zoo & Conservation Society has invited Fugate to stop by on his walk to meet resident Florida panther Sassy.  \n                                                                        \n                                                                        “I am so VERY excited to come and visit Sassy. Though I once saw a Florida panther in the wild, I've never had the privilege of seeing a real one up ... Read More Conservation Florida Panther Palm Beach Zoo Overjoyed at Birth of Squirrel Monkey The Palm Beach Zoo & Conservation Society family of animal residents has grown by one tiny new life. On October 8, Luna, a 12-year-old squirrel monkey, gave birth to a healthy baby in the wee hours of the morning. This is the first squirrel monkey birth at the Zoo since 2011 and the first for this troop.\n                                                                        \n                                                                        “The animal care team has been diligently observing Luna and her baby over these crucial first days, and we are pleased to report that mother and baby are doing well. The troop has... Read More Baby Monkey Fall in Love with the Zoo! Palm Beach Zoo & Conservation Society Announces Boo 2020 and Zoo Attraction Openings WEST PALM BEACH - October 8, 2020 - Fall in Florida is a great time to get outdoors and connect with nature and your family at Palm Beach Zoo & Conservation Society. Both animals and humans will enjoy special fall treats this season and the reopening of several Zoo attractions.\n                                                                        \n                                                                        Boo 2020\n                                                                        \n                                                                        Grab your masks (facial coverings), and put on your costume! On October 30 and 31, the Zoo will feature a daytime, not-so-scary, socially-distanced Halloween event, Boo 2020! A DJ will be playing family-... Read More Boo at the Zoo Malayan Tigers Palm Beach Zoo Rare Malayan Tiger Cub Trio Makes their Habitat Debut at Palm Beach Zoo Starting September 8! WEST PALM BEACH, FL - September 6, 2020 - Starting September 8, the three Malayan tiger cubs born at Palm Beach Zoo & Conservation Society will be prowling and playing in their tropical tiger habitat each day with their mom, Api. The cubs are now just over three months old and ready to explore.\n                                                                        \n                                                                        The tigers have been living in a specialized behind-the-scenes area of the habitat specifically designed for a growing family including comfortable dens, outside yards and cameras for keeping a cl... Read More Malayan Tigers Palm Beach Zoo Tiger Cubs Palm Beach Zoo Announces Gender of Rare Malayan Tiger Cubs West Palm Beach, FL - July 13, 2020 - Palm Beach Zoo & Conservation Society is excited to announce, ‘It’s a boy, a girl, and a girl!’ The gender of the Malayan tiger cubs was officially confirmed by the Zoo’s director of animal health, Dr. Kathleen Woodie during the trio’s first medical check-up last week.\n                                                                        \n                                                                        “We were able to give the cubs their first vaccinations and weigh them.  I am happy to report they are healthy and thriving,” said Woodie... Read More Cubs Malayan Tigers Palm Beach Zoo Celebrates Malayan Tiger Cubs' One Month Birthday Milestones WEST PALM BEACH, FL - June 8, 2020 - The three Malayan tiger cubs born at Palm Beach Zoo & Conservation Society on May 12, turn one-month-old this week, a key milestone in their development.\n                                                                        \n                                                                        \t\t\t“The first month of life is very important for the growth of healthy tigers,” said Palm Beach Zoo Director of Animal Care, Dr. Kathleen Woodie. “Api is a great mother, doing everything she is supposed to in nursing and caring for the cubs. They are growing and develo... Read More Malayan Tigers Tiger Cubs Welcome Back, Palm Beach Zoo Members! Members Only Week is Here. WEST PALM BEACH, FL - May 21, 2020 - On behalf of Oz the Queensland koala, Valentina the Chilean flamingo and Wilbur the local celebrity sloth, Palm Beach Zoo & Conservation Society invites its Zoo members to a members only pre-opening week June 1-4 from 9 AM - 5 PM.\n                                                                        \n                                                                        “We are beyond grateful for the support of our loyal Zoo members, so we are thanking them in a meaningful way,” said Margo McKnight, president and CEO of Palm Beach Zoo. “It is time to get back outdoors wit... Read More Members Roars Heard Throughout the Kingdom as Palm Beach Zoo Announces the Birth of Three Malayan Tiger Cubs WEST PALM BEACH, FL – May 14, 2020 – Palm Beach Zoo & Conservation Society is thrilled to announce that beloved Malayan tiger Api, gave birth to three healthy cubs. Api and her mate Kadar, are part of the Association of Zoo and Aquarium’s (AZA’s) Malayan Tiger Species Survival Plan® (SSP). The SSP® is a cooperative reproduction program that serves as an important backup population for critically endangered Malayan tigers in the wild.\n                                                                        \n                                                                        In April, the Zoo anno... Read More Malayan Tigers Tiger Cubs Page 2 » IN THIS SECTION Zoo News Our Sponsors View all sponsors Link to Homepage 1301 Summit Boulevard West Palm Beach, Florida 33405-3035 (561) 547-9453 (WILD) Quick Links Home Hours & Admission Directions Visitor Code of Conduct Contact Us Terms and Conditions Home Hours & Admission Directions Visitor Code of Conduct Contact Us Terms and Conditions Palm Beach Zoo & Conservation Society is a 501(c)(3) non-profit organization and relies on your support to continue providing extraordinary animal care and saving wildlife in wild places. All donations to the Palm Beach Zoo are tax-exempt. Memphis Web Design by Speak . Sitemap . Facebook Twitter YouTube Pinterest Instagram Buy Tickets"
    },
    {
      "url": "https://business.palmbeaches.org/list/member/palm-beach-zoo-conservation-society-749",
      "text": "Palm Beach Zoo & Conservation Society | ATTRACTIONS - Chamber of Commerce of the Palm Beaches. Member Single Post. Join Us Member Login Membership Member Benefits Membership Levels Sponsorship Packages Advertising Opportunities Chamber Trustees New Member Signup Events Chamber Event Calendar Signature Events Power Networking After-Hours Community Calendar About Board of Directors Chamber Staff Purpose PBC Built Campaign Brand Standards Contact Programs Chamber Committees Ambassadors Women’s Leadership YPOP Leadership West Palm Beach Chamber Trustees Seminars & Workshops Executive Mentorship Newsroom Chamber News Business Watch Photo Gallery Join Newsletter Resources Business Directory Chamber Guide Ribbon Cuttings Advocacy Government Affairs Leadership PAC Member Board Community Calendar Press Releases Job Board Exclusive Deals Member Login Visit Chamber Calendar Signature Events Chamber News Newsroom August 13, 2025 Chamber Launches New Signature... All News Amplify your reach. Join the Chamber today! Directory Palm Beach Zoo & Conservation Society Category Share Categories ATTRACTIONS 1301 Summit Blvd. West Palm Beach FL 33405 (561) 533-0887 Send Email Learn More Hours: 9am-5pm, 7 days a week.  Closed Thanksgiving and Christmas Day Driving Directions: I-95 exit 68 Southern Boulevard, Travel East to Parker Avenue, Turn Right onto Parker Avenue, Turn Right onto Summit Boulevard, Travel 1 block and arrive About Us The mission of Palm Beach Zoo & Conservation Society is to inspire people to act on behalf of wildlife and the natural world. By visiting Palm Beach Zoo & Conservation Society guests are saving animals in the wild.  A portion of each admission contributes to effective work that protects the wild counterparts of the animals on Zoo grounds.  The Zoo’s ultimate goal is to be joined by our community in protecting and restoring wildlife in wild places. We accomplish this by inviting everyone to connect with animals and learn about actions that can be taken to reduce the threats wild animals face in the wild. Wildlife Saving Actions for some simple actions you can take to save wildlife. Palm Beach Zoo staff is saving animals in the wild! We are using our expertise and knowledge to protect wildlife around the world and in our own community. Our wildlife-saving programs are powered by reputable partners, assessed by measurable outcomes, and utilize our staff expertise. Four local long-term Palm Beach Zoo conservation programs include: Florida's Coral Reef Florida Wildlife Corridor: Protecting Florida Panther Swallow-tailed Kites and Snail Kite Monitoring Highlights 23 acres of shaded pathways Feed the Lorikeets Rare and endangered animals around every corner Nose to whisker animal experiences Saving Animals in the Wild Rep/Contact Info View Personal Bio Kathleen Breland × Kathleen D. Breland joined the Palm Beach Zoo in July 2009 as Chief Financial Officer. After a 20-year career with national homebuilder/developer Centex Homes holding positions as Controller, VP of Finance, Division President and VP of Operations prior to coming to the Zoo, Kathleen was ready to give back and has found a rewarding home at the Zoo. During her time at the Zoo, Kathleen took on the additional role of COO for several years and served as the Zoo’s Interim CEO. Kathleen is a Professional Fellow with the Association of Zoo’s & Aquariums where she serves on the Business Operations Committee.  She is a registered licensed CPA in the state of Illinois and holds a Bachelor of Business Administration in Accounting from the University of Houston. Close Kathleen Breland Chief Financial Officer Send an Email Karen  Carr × Close Karen  Carr Chief Development Officer Send an Email Naki Carter × Close Naki Carter Director of Marketing & Communications Send an Email Stacey Cohen × Close Stacey Cohen Executive Administrative Assistant Send an Email Casey Coy × Close Casey Coy Chief Operating & Security Officer Send an Email Christine DeMichael × Close Christine DeMichael Marketing Director Send an Email Allyson Levin × Close Allyson Levin Manager, Corporate & Foundation Relations Send an Email Gwen Lovett × Close Gwen Lovett Animal Operations & Records Manager Send an Email View Personal Bio Margo McKnight × Margo McKnight is the new President and Chief Executive Officer of the Palm Beach Zoo and Conservation Society.  Previously, she served as the Senior Vice President of Conservation, Science and Research at the Florida Aquarium, where she created the ground-breaking coral conservation collaboration with the National Aquarium of Cuba as well as designed the organization’s Center for Conservation at Apollo Beach, which focuses on shark, sea turtle and coral conservation.  Prior to that, she served as the Executive Director of the Wildlands Network conservation organization.  Margo graduated from the University of South Florida. Close Margo McKnight President & CEO Napoleon Rossi × Close Napoleon Rossi Director of Guest Experience Send an Email Laurie V. Steele × Close Laurie V. Steele Catering & Events Coordinator Send an Email Mike Terrell × Close Mike Terrell Curator of Program and Animal Wellness Send an Email Kathy Woodie × Close Kathy Woodie Director of Animal Health Send an Email Laurie Zelnia × Close Laurie Zelnia Director of Catering & Events Send an Email Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel Built for Business Sign up for news, events, and more. Subscribe 401 North Flagler Drive West Palm Beach, FL 33401 chamber@palmbeaches.org 561.833.3711 Facebook X-twitter Youtube Linkedin Instagram © 2025 Chamber of Commerce of the Palm Beaches.  All Rights Reserved. Privacy Policy Sitemap Join Our Newsletter Join Our Email List Email (required) * First Name Last Name Select list(s) to subscribe to Chamber Update Example: Yes, I would like to receive emails from CCPB. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: . You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact Heading Sub heading List items Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum. Ribbon Cuttings Preparation Ribbon Cutting time availabilities Monday- Thursday 9:00a.m, 12:00a.m. or 5:30p.m. at host location or area location. (Palm Beach County, FL) 1st Friday of the month 1:00p.m. after the Ambassador meeting. Pictures are always better with a banner, or sign and designated area to set up for photography. Identify the best place for the picture in advance to ensure a smooth event. The Chamber of Commerce Membership Services Associate will arrive 20 minutes before the start of the event with a camera, ribbon, and scissors. They will assist in choosing the best position for the photo, if necessary. The person selected to cut the ribbon will be directed and assisted as to where to stand during the picture and how to handle the scissors. Ambassadors of the Chamber of Commerce will hold the ribbon as the ribbon is cut. Ambassadors meet and greet your guests. Photographer will prompt you when to cut the ribbon, after several photos taken of the group are posed and ready. We look forward to a great event! Possible Participants: The Chamber Ambassadors can be invited to participate. Additional committees can be included as appropriate. Company staff including owner, CEO, CFO, COO, management, staff and invited guests. Food/Refreshments- Optional. Your event will be better attended with refreshment provided. The food preference and the theme for your Ribbon Cutting Ceremony is entirely up to you. Photos will be placed on the Chamber website, launched on the Chamber’s social media platforms and forwarded to the Ribbon Cutting host. For the Membership Services Associate: Please state if there are any special driving instructions, parking instructions, and if there are any special requests. Please submit the Ribbon Cutting Request Form one month in advance. Ribbon Cutting Request Form"
    },
    {
      "url": "https://www.wptv.com/news/region-c-palm-beach-county/west-palm-beach/meet-the-new-leader-of-the-palm-beach-zoo",
      "text": "Meet the new leader of the Palm Beach Zoo Watch Now Menu Local National Weather Sports Traffic Watch Now Watch Now Close × Live Watch Alerts Search site Go Weather Interactive Radar Daily Forecast Hurricane Survival Guide Hourly Forecast Live Interactive VIPIR Hurricane Map Weather Cams News Local News WPTV Investigates Real Estate News Politics State National News World News Crime Education Protecting Paradise Your Health Matters Traffic Gas Prices Gas Availability Airports Entertainment WPTV Schedule, Other TV Listings Movies Life Finding Florida Shining A Light Underdog Pets Family Food News Sports Panthers Dolphins College Sports FAU Hurricanes Gators Seminoles Cognizant Classic Football Baseball Basketball Surfing Blog Recreation Sports Money Money Headlines Dont Waste Your Money Recalls Marketplace Sunshine Spotlight Home Experts In the Know Videos WPTV Livestream Player WPTV on Youtube About Us Advertise Contact Us WPTV Schedule, Other TV Listings Contests Jobs Staff Bios WHDT, South Florida's 9 How to Watch WPTV 24/7 Support Sign In Newsletters Sign Out Manage Emails Apps Careers Search WPTV5 wptv WPTV UC0bCUnP5RrkJZUtd3bBz6Kw @wptv5 1 WX Alerts 1 Closings/Delays Treasure Coast Okeechobee Indian River St. Lucie Martin Palm Beach County North PBC Central PBC South PBC The Glades Broward Miami-Dade More + Quick Links + Treasure Coast Okeechobee Indian River St. Lucie Martin Palm Beach County North PBC Central PBC South PBC The Glades Broward Miami-Dade News Palm Beach County Region C Palm Beach County West Palm Beach Actions Facebook Tweet Email Meet the new leader of the Palm Beach Zoo Prev Next New CEO-director Margot McKnight says her experience working with animals for almost 30 years and leadership roles at the Florida Aquarium and Bush Gardens Tampa Bay prepared her for this role, conservation. By: Alanna Quillen Posted and last updated There's a new captain at the helm at the Palm Beach Zoo. Tuesday marked day two on the job for the new CEO and director, Margot McKnight. The Miami-native brings more than 37 years of experience working with wildlife. At The Florida Aquarium, McKnight created a ground-breaking coral conservation collaboration with the National Aquarium of Cuba. Prior to that, she served as the Executive Director of the Wildlands Network conservation organization. McKnight also served as Executive Director of the Brevard Zoo from 1998 to 2004, where she created an internationally-recognized conservation program, enabled her zoo to be the first in the U.S. to create a “kayak through animal habitats” experience and designed themed classrooms for Title 1 schools. McKnight also has held numerous positions at Busch Gardens Tampa Bay. McKnight said she wants to implement similar programs to the Palm Beach Zoo. \"The important role of a zoo nowadays is to really connect people with wild things and nature. We're becoming so disconnected to real life, and we're really connected to our electronics,\" she said. \"So real priority is to get more people to come out and spend time in this beautiful zoo and connect with animals...The zoo is already in a great place, we're just going to make it better.\" In the past three years, the zoo has faced many challenges. In April 2016, an endangered Malayan tiger attacked and killed zookeeper Stacey Konwiser. In October 2017, two bush dogs drowned in their enclosure after an investigation concluded a worker accidentally left the water running while filling a pool in the dogs' habitat. The previous CEO, Andrew Aiken, resigned in October after a six-year tenure. McKnight said she believes her experience has prepped her for this new leadership role. \"I've done all sorts of jobs, from teaching kids to designing habitats to running the entire institution. And throughout those years, things happen and tragedies strike. And what I've learned over time, it really galvanizes the people that are there and gets a stronger base and gets them to go to destinations that they really could not have gone before,\" she said. \"We need to move forward and recognize what has happened -- and memorialize that -- but also keep moving forward, not letting that stop us.\" McKnight added, \"There's new challenges that we're facing as a business as well as a conservation organization. Making sure we have everything in place that is going to make a safe and successful is what we're looking at as a high priority.\" She said creating innovative experiences unique to the zoo is one of her main goals. \"This staff is already very strong. So creating experiences where humans and animals can come safely together and have these intimate experiences is what we're going to be working on,\" she said. On the flip side, McKnight said a huge challenge ahead for animal conservation efforts is battling the extinction crisis. \"We're losing wild places and wildlife at dramatically fast paces. And our role is to help stop that,\" she said. \"So one of the roles is to get people to care and to love them, and fall and love with them -- so that when they leave here, they are empowered to do something about it.\" One way to address the crisis, she said, is by implementing more conservation programs at the zoo. McKnight said over the next few months, she will be looking over the staff expertise, on the board and within the community -- and then see which projects can make the most impact from a conservation standpoint. \"We would love as time goes on, to get the community involved in looking around and saying, 'How can this zoo make an impact locally on important conservation measures as well as internationally,\" she said. We asked McKnight if she had a wishlist on any animals or new exhibits she would like to implement at the zoo. \"So, what's important about what we do new here, is to make sure it's something that the guests are really inspired by. Also, what animals can we actually take care of in these amazing habitats where they can just thrive, and then, how can we connect animals and the people to conservation out in the real world? Those are the three pieces of what kind of amazing animals we'll bring into the community.\" The zoo conducted a nationwide search in the fall following the previous CEO's resignation. McKnight also has a recommendation from famous animal expert and Director Emeritus of the Columbus Zoo and Aquarium, Jack Hanna. “Margo brings a wealth of design knowledge that enriches the lives of animals in zoological care and elevates the guest experience,\" he said in a statement. Copyright 2018 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Sign up for the South Florida Sports Headlines Newsletter and receive up to date information. now signed up to receive the South Florida Sports Headlines Newsletter. Click here to manage all Newsletters At WPTV, It Starts with Listening Weather Traffic News Money Sports Entertainment Life Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WPTV5 wptv WPTV UC0bCUnP5RrkJZUtd3bBz6Kw @wptv5 © 2025 Scripps Media, Inc Give Light and the People Will Find Their Own Way"
    },
    {
      "url": "https://primetimepbc.org/palm-beach-zoo/",
      "text": "Palm Beach Zoo - Prime Time Palm Beach County Skip to content Donate Subscribe to Newsletter Search Search About Us Mission and Vision Annual Reports 2023-2024 Impact Contact Us Board of Directors Funders Partners Staff Careers What We Offer Children and Youth High-Quality Afterschool and Summer Programs Matter Expanded Learning Opportunities Expanded Learning Opportunities – STEAM Expanded Learning Opportunities: Grades 6-8 Community Empowerment Program Teen Advisory Council Meetings The OST Professional Register Trainings Events Offerings Schedule an ELO Scholarships Continuing Education Units Financial Incentives: ACHIEVE OST Career Advising & Onboarding OST Registry Membership The OST Program Attract Job Candidates & Retain Staff New To Prime Time? Learn more about the Quality Improvement System QIS Participants Your Quality Advisor Learn About Well-being and Life Skills Initiative Middle School Initiative STEAM Martin County Quality Improvement Initiative The OST Field Publications NEW: The Future of Youth: Development: Building Systems and Strengthening Programs SIX YEAR TRENDS IN CUSTOMER SATISFACTION IMPACT AND INTEREST IN DEGREE PATHWAYS News & Resources News and Highlights Quick Links Prime Time Portal Blog - Our Story Sign Up for Our Weekly E-newsletter Branding Guidelines Palm Beach Zoo Hands-On Learning Activities The Palm Beach Zoo and Conservation Society’s Going Wild for STEAM is a high-quality, interdisciplinary enrichment program that provides children and youth with dynamic, hands-on learning. Rock Art (All Ages) Grades K-2: Nature in My Backyard Let's Play I Spy Motion Commotion Animal Coats Butterfly Match Up Animal Charades Animal Olympics What's for dinner Wildlife Who is Who Grades 3-5: Discover Wildlife Native or Not Discovery Detectives Living or Nonliving Animal Adaptation Backbone or No Backbone Producers and Consumers Backyard Birding Backyard Biodiversity Animal Grouping Project Grades 6-8: Discover Food Webs Food Web Crosswords Puzzle Florida Wildlife Investigation Invasive Species News Biodiversity Dichotomous Candy Key Food Web Vocabulary Challenge Symbiotic Relationships Rainforest Vocabulary Challenge Primate Research Project Contact Palm Beach Zoo & Conservation Society 1301 Summit Boulevard West Palm Beach, FL 33405 education@palmbeachzoo.org (561) 533-0887 ext. 240 www.palmbeachzoo.org © Copyright 2019; Prime Time Palm Beach County, Inc. - All rights reserved. SMS Privacy Policy | Privacy Policy | Terms of Use Contributions Statement Scroll To Top // Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://leadiq.com/c/palm-beach-zoo--conservation-society/5a1d98f7230000540087908c",
      "text": "Palm Beach Zoo & Conservation Society Company Overview, Contact Details & Competitors | LeadIQ Learn more at LeadIQ.com Start free Insights Similar companies Tech Stack Media & News Email Format FAQ Insights Strong Conservation Focus The Palm Beach Zoo & Conservation Society demonstrates a deep commitment to wildlife protection and habitat preservation through diverse programs including endangered species propagation and conservation medicine, making it an ideal partner for organizations aligned with environmental sustainability and conservation efforts. Recent Expansion and Funding The zoo's recent $2.3 million financing boost and ongoing grants highlight active growth and increased capacity for conservation projects, presenting opportunities for sponsors and partners looking to support or leverage impactful conservation initiatives. Educational Engagement With dynamic programs like summer camps, overnight experiences, and virtual wildlife activities, the zoo appeals to families, schools, and youth organizations, opening avenues for educational product partnerships, sponsorships, or branded experiences. Technology Adoption Utilizing advanced tech such as Microsoft Clarity, Google Analytics, and Cloudflare CDN illustrates a modern approach to visitor engagement and data analytics, indicating potential for technology partnerships or digital marketing collaborations. Diverse Visitor Offerings The zooâs attractions including animal exhibits, rides, performances, and seasonal events attract a wide demographic, providing opportunities for brands seeking event sponsorships, merchandise collaborations, or experiential marketing connected to wildlife and family activities. Similar companies to Palm Beach Zoo & Conservation Society Clearwater Marine Aquarium $10M $50M Zoo Miami Central Florida Zoo & Botanical Gardens $10M $50M Brevard Zoo $10M $50M Lion Country Safari $10M $50M Explore similar companies Palm Beach Zoo & Conservation Society Tech Stack Palm Beach Zoo & Conservation Society uses 8 technology products and services including Microsoft Clarity, Cloudflare CDN, Modernizr, and more. Explore Palm Beach Zoo & Conservation Society 's tech stack below. Microsoft Clarity Analytics Cloudflare CDN Content Delivery Network Modernizr Javascript Libraries Envoy Load Balancers HTTP/3 Web & Portal Technology Google Analytics Web Analytics Microsoft IIS Web Servers Facebook Widgets Media & News Palm Beach Zoo Inc. receives financing of $2.3M. The Palm Beach Zoo raised $2.3 million to support its conservation efforts and animal care at a gala featuring more than 350 guests at the zoo. Mar 20, 2025 | floridapolitics.com Palm Beach Zoo Inc. launches Malayan tiger. Palm Beach Zoo has unveiled its newest Malayan tiger as part of the zoo's expansion of its tiger conservatory Feb 13, 2025 | floridaheadline.com Palm Beach Zoo Inc. received financing of $55K in grant on Aug 21st '23. Zoo receives $55,000 grant from Tito's for coral reef initiative. Sep 21, 2023 | palmbeach.floridaweekly.com Palm Beach Zoo Inc. launches Kids Free Summer. Palm Beach Zoo & Conservation Society announces the extension of its wildly popular Kids Free Summer. Jul 29, 2023 | www.aroundwellington.com Palm Beach Zoo Inc. partners with Florida Power & Light Company. The Palm Beach Zoo & Conservation Society, in conjunction with long-time Zoo sponsor Florida Power & Light Company, have generously provided funding for the solar-powered GSM-GPS transmitters needed to continue this conservation effort. Apr 04, 2023 | www.arcinst.org Palm Beach Zoo Inc. launched Wild About Wildlife Virtual Summer Camp program on Jun 20th '20. To help bring the summer camp experience home and complement at-home activities, Manatee Lagoon, Loggerhead Marinelife Center, Lion Country Safari, and the Palm Beach Zoo & Conservation Society have partnered to unveil a Wild About Wildlife Virtual Summer Camp program. May 28, 2020 | www.stuartmagazine.com Palm Beach Zoo Inc. launches Malayan tiger Api. Palm Beach Zoo & Conservation Society is thrilled to announce that beloved Malayan tiger Api, gave birth to three healthy cubs. May 13, 2020 | www.aza.org Palm Beach Zoo & Conservation Society 's Email Address Formats Palm Beach Zoo & Conservation Society uses at least 1 format(s): Palm Beach Zoo & Conservation Society Email Formats Example Percentage FLast@palmbeachzoo.org JDoe@palmbeachzoo.org 95% First@palmbeachzoo.org John@palmbeachzoo.org 2% First.Last@palmbeachzoo.org John.Doe@palmbeachzoo.org 2% FirstLast@palmbeachzoo.org JohnDoe@palmbeachzoo.org 1% See more formats Frequently Asked Questions Where is Palm Beach Zoo & Conservation Society 's headquarters located? Palm Beach Zoo & Conservation Society 's main headquarters is located at 1301 Summit Blvd, West Palm Beach, FL 33405, US . The company has employees across 1 continents, including North America . What is Palm Beach Zoo & Conservation Society 's phone number? You can contact Palm Beach Zoo & Conservation Society 's main corporate office by phone at +1-561-533-**** . For more prospecting data, LeadIQ has access to up-to-date and accurate contact information within our platform. Find, capture, and sync contact data to your CRM and sales tools in one click. What is Palm Beach Zoo & Conservation Society 's official website and social media links? Palm Beach Zoo & Conservation Society 's official website is palmbeachzoo.org and has social profiles on LinkedIn . How much revenue does Palm Beach Zoo & Conservation Society generate? As of August 2025 , Palm Beach Zoo & Conservation Society 's annual revenue reached $35M . What is Palm Beach Zoo & Conservation Society 's SIC code NAICS code ? Palm Beach Zoo & Conservation Society 's SIC code is 8422 - Arboreta and Botanical or Zoological Gardens NAICS code is 54162 - Environmental Consulting Services . How many employees does Palm Beach Zoo & Conservation Society have currently? As of August 2025 , Palm Beach Zoo & Conservation Society has approximately 88 employees across 1 continents, including North America . Key team members include Chief Marketing And Technology Officer: A. J. Chief Operating Officer: C. C. Chief Animal Conservation Officer: B. R. . Explore Palm Beach Zoo & Conservation Society 's employee directory with LeadIQ. What industry does Palm Beach Zoo & Conservation Society belong to? Palm Beach Zoo & Conservation Society operates in the Environmental Services industry. What technology does Palm Beach Zoo & Conservation Society use? Palm Beach Zoo & Conservation Society 's tech stack includes Microsoft Clarity Cloudflare CDN Modernizr Envoy HTTP/3 Google Analytics Microsoft IIS Facebook . What is Palm Beach Zoo & Conservation Society 's email format? Palm Beach Zoo & Conservation Society 's email format typically follows the pattern of . Find more Palm Beach Zoo & Conservation Society email formats with LeadIQ. When was Palm Beach Zoo & Conservation Society founded? Palm Beach Zoo & Conservation Society was founded in 1969 . Palm Beach Zoo & Conservation Society Environmental Services United States 51-200 Employees The Palm Beach Zoo & Conservation Society is a non-profit zoological organization located at Dreher Park in West Palm Beach. The Zoo houses over 700 animals within 23-acres of lush tropical habitat. Its mission is to inspire people to act on behalf of wildlife and the natural world  \r\n\r\nIn addition to exciting animals from all over the world living in natural habitats, the Zoo features a colorful carousel, children's train ride, an interactive water play fountain, a full service restaurant, daily performances of the \"Wings Over Water\" bird show, and many other programs and events throughout each day.\r\n\r\nThe zoo offers a dynamic Summer Zoo Camp Program, a \"Night Owls\" Overnight Program, Field Trips, Outreach Programs, and a variety of special events such as \"Winter in July\", \"Boo at the Zoo\" and \"Festival por los Animales.\" Zoo memberships provide free admission year-round. \r\n\r\nThe Zoological Society of the Palm Beaches exists to protect wildlife and wildlife habitat, and to inspire others to value and conserve the natural world.  We advance our conservation mission through programs in field research, endangered species propagation, education, health and wellness, and conservation medicine.  Our sustainable and responsible business practices and local, national and global partnerships enable the Palm Beach Zoo to support global conservation, species survival, and habitat preservation. Sign up for free to view info Email Format Employee directory Company Overview Headquarters 1301 Summit Blvd, West Palm Beach, FL 33405, US Phone number +1-561-533-**** Website palmbeachzoo.org SIC Code 8422 - Arboreta and Botanical or Zoological Gardens NAICS Code 54162 - Environmental Consulting Services Founded 1969 Employees 51-200 Media & News Palm Beach Zoo Inc. receives financing of $2.3M. Mar 20, 2025 | floridapolitics.com Palm Beach Zoo Inc. launches Malayan tiger. Feb 13, 2025 | floridaheadline.com Palm Beach Zoo Inc. received financing of $55K in grant on Aug 21st '23. Sep 21, 2023 | palmbeach.floridaweekly.com Read more news Funding & Financials $10M $50M Palm Beach Zoo & Conservation Society 's revenue is in the range of $10M $50M Funding & Financials $10M $50M Palm Beach Zoo & Conservation Society 's revenue is in the range of $10M $50M Company Leadership A. J. Chief Marketing And Technology Officer Mobile Phone Email C. C. Chief Operating Officer Mobile Phone Email B. R. Chief Animal Conservation Officer Mobile Phone Email K. C. Chief Development Officer Mobile Phone Email C. L. Interim Chief Executive Officer Mobile Phone Email Employee Directory B. D. Publisher & Editor-In-Chief Mobile Phone Email G. F. Director, Senior Director, Vice President Mobile Phone Email T. S. Human Resources Director Mobile Phone Email J. W. Director Of Facilities And Grounds Mobile Phone Email K. C. Director Of Conservation Engagement & Learning Mobile Phone Email Go to Employee Directory Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    }
  ]
}