{
  "fuentes": [
    {
      "url": "https://panthernational.com/golf/",
      "email": "england@panthernational.com"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://panthervalleygolf.com/contact-and-directions/",
      "email": "info@panthervalleygolf.com"
    },
    {
      "url": "https://panthervalleygolf.com/contact-and-directions/",
      "email": "vineet@panthervalleygolf.com"
    },
    {
      "url": "https://panthernational.com/google/",
      "email": "england@panthernational.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/panther-run-golf-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/panther-run-golf-club/",
      "email": "info@naplesgolfguy.com"
    }
  ],
  "mails": [
    "dpylinski@sevenoaksgolf.com",
    "england@panthernational.com",
    "info@naplesgolfguy.com",
    "info@panthervalleygolf.com",
    "matt@naplesgolfguy.com",
    "vineet@panthervalleygolf.com"
  ],
  "nombre_sitio": "pantherrungolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://panthernational.com/golf/",
      "text": "PANTHER NATIONAL - Championship Golf Skip to the content ABOUT Media GOLF AMBASSADORS REAL ESTATE Signature Estates Custom Estates Completed / Under Construction LIFESTYLE MEMBERSHIP BROCHURE CONTACT ABOUT Media GOLF AMBASSADORS REAL ESTATE Signature Estates Custom Estates Completed / Under Construction LIFESTYLE MEMBERSHIP BROCHURE CONTACT ABOUT Media GOLF AMBASSADORS REAL ESTATE Signature Estates Custom Estates Completed / Under Construction LIFESTYLE MEMBERSHIP BROCHURE CONTACT A Lifestyle Few Experience A NEW GENERATION OF GOLF 18-HOLE CHAMPIONSHIP GOLF COURSE The Panther National championship golf course—designed by the legendary Jack Nicklaus and Justin Thomas making his design debut—features steep elevation changes and dramatic vistas. The 18-hole course can play 8,000 yards from the longest tees all the way down to 4,500 yards. This rare diversity in length allows the picturesque course to be a “major tournament” test for the expert golfer while always presenting a very playable, enjoyable course for all members. “YOU WON’T FIND ANY GOLF COURSE THAT’S EVEN REMOTELY CLOSE TO IT IN ALL SOUTH FLORIDA.” – JACK NICKLAUS, Course Designer “PANTHER NATIONAL IS DESTINED TO BE ONE OF THE TOP PRIVATE COURSES IN FLORIDA.” JUSTIN THOMAS, Course Designer SHORT COURSE – “PANTHER9” This Par-3, nine-hole golf oasis is both incredibly beautiful and challenging. Holes vary in range from 90 to 150 yards and feature the approach shots players will encounter on the championship course. This incredible course includes an island green inspired by the famous 17th hole at TPC Sawgrass. Make up your own match, play closest to the pin, or simply have fun working on your approach and short game. 18-HOLE CHAMPIONSHIP GOLF COURSE 18-HOLE CHAMPIONSHIP GOLF COURSE 18-HOLE CHAMPIONSHIP GOLF COURSE 18-HOLE CHAMPIONSHIP GOLF COURSE 18-HOLE CHAMPIONSHIP GOLF COURSE 18-HOLE CHAMPIONSHIP GOLF COURSE 18-HOLE CHAMPIONSHIP GOLF COURSE 18-HOLE CHAMPIONSHIP GOLF COURSE 18-HOLE CHAMPIONSHIP GOLF COURSE A LEGENDARY PAIRING JACK NICKLAUS & JUSTIN THOMAS, COURSE DESIGNERS Jack Nicklaus is widely considered the greatest golfer of all time and one of the finest golf course designers in the world. During his professional career from 1962 to 2005, he won 117 professional tournaments, including a record-breaking 18 major championships. Additionally, Nicklaus has designed over 300 golf courses, showcasing his expertise in course design and architecture. Justin Thomas is an American professional golfer who consistently ranks in the top 10 worldwide and competes on the PGA Tour. Since 2015, Thomas has achieved at least one PGA tournament victory each year, including two major golf championships: the PGA Championship in 2017 and again in 2022. Play Video about Jack Nicklaus and Justin Thomas - Panther National Golf Course Designers PANTHER NATIONAL GOLF EXPERIENCE PERFORMANCE TRAINING CENTER Featuring three bays, a golf fitting center, a putting laboratory, and a café, the Center will be a comprehensive facility dedicated to enhancing golfers’ skills. Equipped with the latest technology and staffed by experienced instructors, the Center will provide golfers with opportunities to refine their swings and will be seamlessly integrated into the elite World Class Practice Area. PUTTING COURSE – “THE CUB” Inspired by the Himalayas Putting Course at St. Andrews, Panther National’s nearly one-acre Nicklaus-designed putting course is the perfect place to gather pre- or post-round, settle bets, have fun with family, or train to enhance your putting skills. You will find every putt you can imagine, and some you couldn’t dream of. PRACTICE AREA The Panther National Practice Area is a world-class facility designed to elevate your golf game with a focus on Full Swing and Distance Wedges. Golfers can warm up in style while improving their skills. The range features target greens with trinity zoysia, giving a clear view of shot reactions. This setup mimics different length par threes for enhanced practice. Each target green matches PGA Tour average shot distances, providing a realistic training environment. A 27-yard-wide US Open fairway runs through the center, helping players build on-course confidence. SHORT GAME PRACTICE AREA The Short Game Training Area offers uniquely shaped green and bunkers. This setup helps golfers refine their wedge distances, pitches, and chip shots, essential at Panther National and top courses worldwide. Panther National Clubhouse Panther National Clubhouse Panther National Clubhouse Panther National Clubhouse Panther National Clubhouse MEET THE TEAM DOMINIK SENN Founder & President Dominik Senn is the founder of Panther National as well as Founder & President of 4sports & Entertainment. Born in Zurich, Switzerland, he specializes in investment, management, and consulting—offering an elite level of expertise, influence, access, and insights across the global sports landscape. His vision for Panther National addresses the void in the market for a new, modern, lifestyle-driven golf community that redefines luxury living. “As a former skier, I think very much in landforms. With Panther National, I wanted to create something very special with Jack and Justin. So we have moved almost three million cubic yards of earth to shape a championship course with a links style. We blended dramatic holes with lakes and the look of the neighboring nature preserve. Players can expect the best possible golf experience.” – DOMINIK SENN TOM DYER Director of Golf A highly accomplished golf professional, Tom has garnered accolades including recognition as SECPGA’s “Teacher of the Year,” “Merchandiser of the Year,” and “Golf Professional of the Year,” he has honed his teaching expertise alongside esteemed mentors including Bob Toski, Hank Haney, and David Leadbetter. Tom’s leadership has fostered the success of several Assistant Pros who have gone on to become Head Pros and Directors of Golf. Tom’s expertise helps create an exceptional golf experience for the members of Panther National. DAN FORE Director of Agronomy With nearly four decades in golf agronomy, Dan Fore brings unmatched experience to Panther National. Before joining our team, he played a key role at Greg Norman Design , contributing to the design, construction, and establishment of 22 golf courses across the U.S., Caribbean, Europe, and Mexico. His exceptional resume also includes work at prestigious clubs such as Jupiter Hills Club, Medalist Golf Club and Wade Hampton Golf Club . At Panther National, Dan leverages his extensive knowledge to ensure exceptional quality remains the standard. ADAM SCHAFER Head Golf Professional JAKE LAMORE Director of Outside Operations & Caddie Master PANTHER NATIONAL AMBASSADORS The Panther National Ambassadors program stands as a beacon of excellence, embodying the essence of quality, dedication, and a distinctive lifestyle synonymous with Panther National. learn more Sign up below to access insider information on the offerings at Panther National, or to begin planning your discovery visit to experience Panther National in person. \" * \" indicates required fields Name * First Last Email * Phone * Comments This field is for validation purposes and should be left unchanged. A new community of uncommon luxury, Panther National’s modern estates provide access to championship golf, World-class amenities, and unparalleled service—all surrounded by the highlights of Palm Beach County. Panther National Golf Shop +1 561.769.4211 Panther National Corporate Office +1 561.225.1763 england@panthernational.com ALL PURCHASERS ACKNOWLEDGE THAT THEY HAVE NOT RELIED ON ANY VERBAL REPRESENTATIONS AND THAT THE ONLY REPRESENTATIONS MADE BY SELLER ARE SET FORTH IN THE APPLICABLE PURCHASE AGREEMENT. ALL DIMENSIONS, FEATURES, AND SPECIFICATIONS ARE APPROXIMATE AND SUBJECT TO CHANGE WITHOUT NOTICE. All images and designs depicted herein are artist’s conceptual renderings, which are based upon preliminary development plans, and are subject to change without notice. All such materials are not to scale and are shown solely for illustrative purposes. Renderings depict proposed views, which are not identical from each lot or home. No guarantees or representations whatsoever are made that existing or future views of the project and surrounding areas depicted by artist’s conceptual renderings or otherwise described herein, will be provided or, if provided, will be as depicted herein or that such views will not be obstructed in the future. Privacy Policy | Terms of Use"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 54° Thu 09/11 clear sky 73°/53° Fri 09/12 clear sky 72°/52° Sat 09/13 overcast clouds 71°/55° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://panthervalleygolf.com/contact-and-directions/",
      "text": "Contact Panther Valley Golf Club | Directions & Inquiries Skip to content Golf About Panther Valley Course Meet the Staff Golf Shop Online Golf Shop Golf Academy and Programs Junior Program Etiquette Guest Information Golf Outing Packages Membership Dining Lunch Menu Dress Code Dinner Menu Children’s Selection Dessert Menu Banquets Catering Menus Weddings Business Meeting Photos Golf Outings Events Upcoming Events Member Groups & Meetups Swim Complex Contact and Directions Golf About Panther Valley Course Meet the Staff Golf Shop Online Golf Shop Golf Academy and Programs Junior Program Etiquette Guest Information Golf Outing Packages Membership Dining Lunch Menu Dress Code Dinner Menu Children’s Selection Dessert Menu Banquets Catering Menus Weddings Business Meeting Photos Golf Outings Events Upcoming Events Member Groups & Meetups Swim Complex Contact and Directions Member Login Golf About Panther Valley Course Meet the Staff Golf Shop Online Golf Shop Golf Academy and Programs Junior Program Etiquette Guest Information Golf Outing Packages Membership Dining Lunch Menu Dress Code Dinner Menu Children’s Selection Dessert Menu Banquets Catering Menus Weddings Business Meeting Photos Golf Outings Events Upcoming Events Member Groups & Meetups Swim Complex Contact and Directions Contact and Directions Contact Information Panther Valley Golf & Country Club One Forest Drive Hackettstown NJ. 07840 Clubhouse : 908-850-0800 Golf Shop : 908-852-6120 info@panthervalleygolf.com Directions Conveniently Located Minutes From Route 80 From New York City / East: Follow Interstate 80 West to Exit 19. Turn left at the traffic light. The entrance to Panther Valley will be on your right about 1/2 mile. Proceed to the Security Gatehouse. After the gate take the second right into the Country Club Driveway. From Pennsylvania/ West: Follow Interstate 80 East to Exit 19. Turn left at the traffic light. The entrance to Panther Valley will be on your right about 1/2 mile. Proceed to the Security Gatehouse. After the gate take the second right into the Country Club Driveway. From Phillipsburg area: Take Route 57 East, at the last traffic light turn left onto Mountain Ave, stay on Mountain Ave through several traffic lights to the intersection of Rte 46, turn left onto (Route 46 West). At second light turn right onto (Route 517 North), stay on Route 517 approximately 4 miles. At traffic light make a left into Panther Valley and proceed to Security Gate, after passing thru the gate take the second right into the Country Club Driveway. Get Directions One Forest Drive Hackettstown NJ. 07840 Panther Valley Golf & Country Club Call Us Now: Clubhouse : 908-850-0800 Golf Shop: 908-852-6120 Useful Links About Panther Valley Course Meet the Staff Golf Shop Guest Information Instruction Junior Program Etiquette Privacy Policy Terms and Conditions Panther Valley Golf One Forest Drive, Hackettstown NJ. 07840 info@panthervalleygolf.com Clubhouse: 908-850-0800 Golf Shop: 908-852-6120 © Panther Valley Golf & Country Club Copyright © 2025 Panther Valley Golf Country Club | Powered by Panther Valley Golf Country Club About Panther Valley Banquet Halls & Venues Banquet Menus Bar & Grill Highlights Blogs Business Meetings Catering Menus Children’s Selection Contact and Directions Corporate Events & Meetings Course Overview Dessert Menu Dinner Menu Dress Code Etiquette Events gform Golf Acadmey and Programs Golf Instruction Golf Outing Golf Outing Packages Golf Outings Golf Shop Guest Info & Etiquette Guest Information Home Junior Golf Programs Junior Program Lunch Menu Meet the Staff Member Groups & Meetups Membership Membership Types and Benefits Photos privacy and policy Restaurant and Menus Rooms Schedule a Tour Special Dining Events Swim Complex Terms and Conditions Testimonials ThankYou The Course Upcoming Events Weddings Weddings & Celebrations"
    },
    {
      "url": "https://panthernational.com/google/",
      "text": "PANTHER NATIONAL - A lifestyle few experience Skip to the content ABOUT Media GOLF AMBASSADORS REAL ESTATE Signature Estates Custom Estates Completed / Under Construction LIFESTYLE MEMBERSHIP BROCHURE CONTACT ABOUT Media GOLF AMBASSADORS REAL ESTATE Signature Estates Custom Estates Completed / Under Construction LIFESTYLE MEMBERSHIP BROCHURE CONTACT ABOUT Media GOLF AMBASSADORS REAL ESTATE Signature Estates Custom Estates Completed / Under Construction LIFESTYLE MEMBERSHIP BROCHURE CONTACT 18-HOLE CHAMPIONSHIP GOLF COURSE A Lifestyle Few Experience THE VISION OF PANTHER NATIONAL Panther National Estates The Verbier Artist's Conceptual Rendering Panther National Estates The Gstaad Artist's Conceptual Rendering \"Panther National is a world and a way of life tailored to those who expect the best.\" Dominik Senn , Panther National Founder A Lifestyle Few Experience The first-of-its kind ultra-modern golf and lifestyle community, redefining premium living. THE ESTATES The environmental modern architecture of Max Strang, custom built for luxury designed around you. CHAMPIONSHIP GOLF A visionary 18-hole championship course and 9-hole short course designed by Jack Nicklaus and Justin Thomas. WELLNESS & LIFESTYLE A private oasis of athletic club facilities and premier service, set among idyllic nature with quiet walking and biking trails. A CLASS OF OUR OWN 18-HOLE CHAMPIONSHIP COURSE & TRAINING FACILITY DESIGNED\nBY JACK NICKLAUS & JUSTIN THOMAS COMING FALL 2023 the art of optimal living THE ESTATES Our private enclave of estates and custom home sites features the world-renowned architecture and interior design of Max Strang. Selecting from elevated palettes and design options, create your own distinct residence of modern elegance and contemporary luxury. HALF-ACRE THIRD-ACRE Willstrong Construction | STRANG DESIGN LUCERNE THIRD-ACRE Willstrong Construction | STRANG DESIGN BASEL HALF-ACRE THIRD-ACRE Willstrong Construction | STRANG DESIGN PONTRESINA HALF-ACRE Willstrong Construction | STRANG DESIGN ZERMATT PALM BEACH COUNTY IS THE ULTIMATE SUNNY PLAYGROUND, A HOTSPOT OF CHIC SHOPPING AND LAIDBACK CULTURE, WHERE LIVING WELL IS TAKEN SERIOUSLY. The Estates Experience Unparalleled Living Be among the first to learn about our select initial offering and how you can join the family of owners at Panther National. \" * \" indicates required fields Name * First Last Email * Phone * How did you hear about us? * - Select - Google Referral Broker LinkedIn Instagram Links TV Golf Magazine Golf.com Palm Beach Illustrated Luxury Home Magazine Modern Luxury Magazine Hamptons Magazine New York Post MLS Business Traveler Haven Magazine Executive Golfer Robb Report Palm Beach Daily Florida Golf Association Metropolitan Golf Association Golf Association of Philadelphia Chicago District Golf Association WSJ / Mansion Global NetJets Direct Mail Phone This field is for validation purposes and should be left unchanged. AREA HIGHLIGHTS INSPIRATION SURROUNDS YOU Palm Beach County is the ultimate sunny playground, with an array of world-class amenities to explore. EXECUTIVE AIR  TRAVEL Private air travel is minutes away at North Palm Beach. BEACHES & MARINA Fun on the water awaits along 47 miles of coast. WORLD-CLASS  SHOPPING Worth Avenue and Royal Poinciana Plaza allure. TOP PRIVATE  SCHOOLS Nationally-ranked private schools dot the area. POLO &  EQUESTRIAN Prestigious events cultivate a lively social scene. ARTS &  CULTURE A busy calendar spans Broadway to marquee artists. PANTHER NATIONAL WORLD CLASS TEAM ESTATES Max Strang is the Founder and Director of the Miami-based architecture and design firm [STRANG] Design. Panther National—for whom [STRANG] Design has developed the blueprints for both the custom estates and the main buildings of the golf club—is the firm’s largest and most ambitious project to date. CHAMPIONSHIP GOLF 18-hole championship course & training facility designed by Jack Nicklaus & Justin Thomas. Nicklaus heads Nicklaus Design, one of the world's largest golf course design and construction companies—and is the co-designer of the golf experience at Panther National alongside Justin Thomas SALES & MARKETING IMI Worldwide Properties is an innovative and integrated real estate brokerage firm focused on new and emerging luxury real estate opportunities. For over 30 years, its has helped create some of the most recognized luxury real estate communities around the world, guided by CEO and co-founder Mike Collins. DEVELOPMENT WillStrong is a world-class construction and development joint venture that brings together two leading forces in South Florida real estate: construction powerhouse Willoughby and veteran developer CMA Ventures & Land. MEDIA Follow us for the latest news. 13 Mar NEWS Justin Thomas designed a replica of the famous island green at TPC Sawgrass at his golf course in Florida 19 Feb NEWS Panther National named as one of the Top 5 Residential Courses in America 3 Feb NEWS The 12 Best Private Golf Clubs in the U.S., From California to South Carolina A new community of uncommon luxury, Panther National’s modern estates provide access to championship golf, World-class amenities, and unparalleled service—all surrounded by the highlights of Palm Beach County. Panther National Golf Shop +1 561.769.4211 Panther National Corporate Office +1 561.225.1763 england@panthernational.com ALL PURCHASERS ACKNOWLEDGE THAT THEY HAVE NOT RELIED ON ANY VERBAL REPRESENTATIONS AND THAT THE ONLY REPRESENTATIONS MADE BY SELLER ARE SET FORTH IN THE APPLICABLE PURCHASE AGREEMENT. ALL DIMENSIONS, FEATURES, AND SPECIFICATIONS ARE APPROXIMATE AND SUBJECT TO CHANGE WITHOUT NOTICE. All images and designs depicted herein are artist’s conceptual renderings, which are based upon preliminary development plans, and are subject to change without notice. All such materials are not to scale and are shown solely for illustrative purposes. Renderings depict proposed views, which are not identical from each lot or home. No guarantees or representations whatsoever are made that existing or future views of the project and surrounding areas depicted by artist’s conceptual renderings or otherwise described herein, will be provided or, if provided, will be as depicted herein or that such views will not be obstructed in the future. Privacy Policy | Terms of Use"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/panther-run-golf-club/",
      "text": "Panther Run Golf Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Naples Golf Communities Panther Run Golf Club Panther Run Golf Club features an 18-hole championship golf course in Ave Maria, Florida. In addition to the course, they have a driving range and clubhouse. The Club was formerly known as The Golf Club at Del Webb and is located 30 miles east of Naples. Additionally, the course features 6 sets of tee allowing a pleasurable golf experience for all levels of golfers. Wide-open fairways with large greens, the club was named as a 2010 Top 50 course for women by Golf Digest. Also, residents will enjoy a resort-style pool, lap pool, tennis courts, bocce ball courts, and a state-of-the-art fitness center. Furthermore, this is a 55+ golf community that offers an active lifestyle. Single-family homes and attached villas are spread throughout the community. Membership in the club is optional. The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities. Contact us today for more information. Location: Naples Club Type: Private Membership Type: Bundled Real Estate Single Family: $415,000 – $950,000 View Homes for Sale Condos: $289,900 – $500,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Southwest Florida. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Memberships 600 Is a Golf Membership Required? No Is a Social Membership Required? Yes Non-Resident Memberships Available? No Membership Fees Golf Fees: $25,000 Golf Dues: N/A Social Fee: N/A Social Dues: N/A In bundled golf communities, the Golf or Social membership is included with the purchase of your home. Additionally, there are annual recurring fees associated with the property, as well as one-time fees due at the time of purchase. Potential Fees Include: Master HOA Fee (Annual) Neighborhood HOA Fee (Annual) Food and Beverage Minimum (Annual) Assessments (Annual) Capital Contribution Fee (one-time) Transfer Fee (one-time) Application Fee (one-time) These fees vary by neighborhood within the community. Please feel free to contact us for additional information. Golf Course Information Opened 2007 Architect Gordon Lewis Number of Courses Number of Courses \t1 (18 Holes) Caddies Available No Practice Range Yes Own Your Own Cart Yes Course Ratings / Scorecards Par: 72 Holes: 18 Yards Rating Slope Tee 1 7527 76.4 138 Tee 2 6706 72.7 130 Tee 3 6206 70.1 125 Tee 4 5729 68.2 118 Ladies Tees: Tee 4 5729 73.2 126 Tee 5 5235 70.4 120 Tee 6 4710 67.5 114 Amenities Non-Gated Golf Community One Golf Course Driving Range Clubhouse Tennis Pickleball Bocce Resort-style Pool Lap Pool Fitness Center Where is Panther Run Golf Club Located Panther Run Golf Club 6005 Anthem Parkway Ave Maria, FL 34142 239.304.2835 Visit Club Website Back to Naples Golf Communities Note: We make every effort to make sure our information for this Golf Club: Panther Run Golf Club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    }
  ]
}