{
  "fuentes": [
    {
      "url": "https://members.greaterpasco.com/list/member/pasco-county-fair-association-inc-12371",
      "email": "office@greaterpasco.com"
    },
    {
      "url": "https://rprresources.com/about-us/",
      "email": "donnabennett6123@yahoo.com"
    },
    {
      "url": "https://rprresources.com/about-us/",
      "email": "info@rprresources.com"
    },
    {
      "url": "https://www.pascocountyfair.com/contact.aspx",
      "email": "office@pascocountyfair.com"
    },
    {
      "url": "https://nebraskafairs.org/fairs.php?fairid=51",
      "email": "keithcoag@yahoo.com"
    },
    {
      "url": "https://www.pascocountyfair.com/p/general-information/fair-board",
      "email": "office@pascocountyfair.com"
    },
    {
      "url": "https://www.pascocountyfair.com/p/general-information/fair-board",
      "email": "poultry@pascocountyfair.com"
    }
  ],
  "mails": [
    "donnabennett6123@yahoo.com",
    "info@rprresources.com",
    "keithcoag@yahoo.com",
    "office@greaterpasco.com",
    "office@pascocountyfair.com",
    "poultry@pascocountyfair.com"
  ],
  "nombre_sitio": "pascocountyfair.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://members.greaterpasco.com/list/member/pasco-county-fair-association-inc-12371",
      "text": "Pasco County Fair Association, Inc. Skip to content Menu Directory Members Membership Benefits Elite Members Member to Member Deals Member Map Member Login About Us About Us Staff Board of Directors Ambassadors Young Professionals Contact Us Info Request What’s New Hot Deals News Releases Job Postings Events 2025 Glow Gala Installation Banquet Chamber Events Sponsorship Opportunities Community Events Explore Dining Shopping Lodging Entertainment Member Login Pasco County Fair Association, Inc. 36722 State Road 52 Dade City FL 33525 (352) 567-6678 Send Email Visit Website Hours: Monday - Friday 8:30am to 5:00pm About Us Associations Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Greater Pasco Chamber of Commerce | Site by GrowthZone The Greater Pasco Chamber of Commerce, Inc. phone number (727) 842-7651 map and address 16703 Early Riser Ave Land O' Lakes, FL 34638 email office@GreaterPasco.com facebook © 2025 Greater Pasco Chamber of Commerce. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://rprresources.com/about-us/",
      "text": "About Us | Re/Max Marketing Specialists 352-686-0540 info@rprresources.com Home Services Available Properties Tenant Resources Owner Resources Portal Login Tenant Portal Login Owner Portal Login About Us Contact Select Page Home Services Available Properties Tenant Resources Owner Resources Portal Login Tenant Portal Login Owner Portal Login About Us Contact RE/MAX Marketing Specialists The Property Management Division here at RE/MAX Marketing Specialists/RPR Resources is a truly specialized group. We are all Licensed Real Estate Agents with broad and extensive industry experience that helps us guide you as a landlord and our client. We are 100% dedicated to the care and management of what is likely to be one of your most important investments. Our licensed Real Estate Agents are full time property managers. We offer management services for both residential and commercial properties. Other companies might claim to be property managers, but only here at RE/MAX Marketing Specialists/RPR Resources Property Management have we truly built a winning combination from management-only experience coupled with the extensive resources of a recognized and respected name in the Tampa Bay real estate market. RE/MAX Marketing Specialists/RPR Resources has three offices to serve you Spring Hill, Brooksville, and Trinity. Our service areas cover all of Hillsborough, Pasco, Hernando, and Pinellas counties. Our Property Managers Donna Collins My name is Donna Collins and I am a licensed Realtor that specializes in residential property management since 2000. I am a Florida native that understands managing your own rental property can be difficult. This is why I have devoted myself exclusively to the leasing and management of residential properties. I and my team, which consists of a full time assistant and a repair coordinator, strive for the highest standard of excellence. I take immense pride in providing excellent and professional service to all my clients. I have an in-depth knowledge of the Greater Tampa Bay area, including Pasco and Hernando counties. My goal is to make your experience with property management to be stress free. If you are considering purchasing a home as an investment, why not give me a call first? I will be able to answer your questions about property management as well as give you a FREE rental analysis. My cell phone is (352)279-1966 and email is donnarentsandsells@gmail.com . I look forward to speaking with you. Lisa Heberlein Lisa is a positive thinker, someone who always strives to achieve the best whether it’s in her tennis / golf game, daily life or career. She knows that when it comes times to rent, buy, or sell a home, you want to do it with the confidence and experience of working with a pro. That’s precisely why Lisa is committed to providing you with the best possible service when you decide to rent, buy or sell. So when only the best will do, look to The SERVICE ACE Team in Real Estate. specializes in representing my clients in the rentals, purchases and sales of single-family residences and income property within the cities of Palm Harbor, Oldsmar, Ozona, Safety Harbor, Clearwater, Tampa, Dunedin, Clearwater Beach, Trinity, New Port Richey, Port Richey, Tarpon Springs and surrounding areas . Service in Real Estate over 22 years. Karen M. Mulrooney Karen M Mulrooney PA has been a full-service Realtor since 2004.   As a full-service Realtor Karen added Rental services for her customers who purchased investment homes.  Majority of Karen’s business is Selling but she so enjoys helping her customers find a good tenant match for their investment property.   Karen will ensure she takes the time to assure both tenant and landlord are satisfied.  Karen will ensure that your investment property asset is taken care of in the best possible way.  Karen has many years of experience in many aspects of renting out property.  Karen understands the work involved in ensuring the rental process runs smoothly.  The vetting of tenants can be time consuming, and so can maintaining the property.  Karen will find a suitable tenant for the property, which will include vetting the references and credit profile of the prospective tenant with all the necessary systems such as credit bureau information, pet screening, property management system, the necessary training, and many  years’ experience.    You will feel comfortable having Karen handle your large investment.  If you are looking to buy and then rent Karen will help you with both. Shampi Bedi Having lived in the Hernando County area for more than 32 years I have a great working knowledge of the Hernando, Pasco and Citrus County real estate markets. I am a Broker Associate and bring to Re/Max Marketing Specialists over 30 years of experience. Top Producers list since 1989 Strong sales and negotiation skills Member of National Association of REALTORS Member of Hernando County Association of REALTORS Experienced in commercial and residential real estate, both for buyers and sellers. Multilingual – English, Hindi as well as Punjabi Donna Bennett Property Manager and Sales with over 30 years of experience in Hernando county and surrounding areas.  Experienced in all aspects of the real estate including sales, property management, commercial, and storage units.  I specialize in Property Management, selling, and helping buyers find their American dream of home buying. I would love to property Manage your home or I can just find you a tenant.  We do background and credit checks for all our properties. Let my decades of experience, knowledge, and commitment bring you the results you expect and deserve! Cell Phone: 352-279-1874 Email: donnabennett6123@yahoo.com Terry Haehel Buying or selling real estate can be a major life event.  Whether it is your home, business or vacant land it can be an overwhelming experience to navigate alone. Please allow me to be a partner with you on this transaction, I have the experience and resources to ensure a great result.  Do not hesitate to call me at 352-406-6104. Allow me to introduce myself. After spending many years in retail management, it came time to get involved in another career that gave me the flexibility that Real Estate allows you. Made the change back in early 1999 and have never regretted it. There is nothing more fulfilling then helping someone purchase a home be it their first or their fifth. Listing properties and getting them sold for the owners has the same effect and feeling. Approx. 14 years ago, I added Property Management to my Real Estate business. So, I can help you with most of your Real Estate endeavors. Please feel free to contact me with any of your questions you might have. You can reach on my cell phone at 352-279-0989 or email me at SteveAlmeida21@hotmail.com Thank you Steve Almeida Pet Screening Application RE/MAX Marketing Specialists Spring Hill - 3377 Mariner Blvd, Spring Hill, FL 34609 Trinity - 8915 Mitchell Blvd, Trinity, FL 34655 Brooksville - 315 Howell Ave, Brooksville, FL 34601 Privacy Policy - Terms and Conditions"
    },
    {
      "url": "https://www.pascocountyfair.com/contact.aspx",
      "text": "Contact skip to main content Search Website Search Area Weather Maps & Hours 79th Annual Pasco County Fair - Feb. 16 - 22, 2026 General Information Advance Wristbands for 2025  > Annual Fair Passes Ticket Info,  Hours ------Daily Schedule -for 2026 Coming Soon Guest Relations & Fair Tips Fairgrounds Map Fair Board & Committees Preferred Hotel Hampton Inn - Dade City/Zephyrhills Become A Member Building Rental Information Volunteers Pasco County Fair Association (PCFA) By-Laws Sponsors History Get Updates Entertainment Free Daily Entertainment 2026 -  updates daily 2025 Big Rock Amusements Ride List Music Concerts -2026 Keep Watching Here Demo Derby  Smash Up  - 2025 Rodeo ---Click red box at top of website to purchase tickets Agri-Shows 2026 Beef 2026 Youth Dairy Show 2025 Youth Goat Show 2025 plant show 2026 Small Animal Barn 2026 (Poultry/Rabbit) Swine 2026 . FFA/4H Agri- Exhibits Ethics Training  Information coming soon Agri Competitions ' Non-Agri Competitions Collura  Cottage Home Arts 2025 Community Exhibits 2025 Art Show & Youth Exhibits 2025 Pasco Showcase of Talent 2025 sponsored by: Lowman Law Firm Karaoke Contest 2025 Schedule 2025 Daily Fair Schedule - Event Calendar Pasco County Fair  > Other Beef Swine Plants Dairy Rabbit Goat Small Animal Barn Pageants All Winners Photo Gallery Tri-Fold / Fair Information & Schedule 2025 Pasco Showcase of Talent 2023 Skip Navigation Links Home > Contact Contact Pasco County Fair Assoc. 36722 C.R.  52 Dade City, Fl 33525 office@pascocountyfair.com Phone: (352) 567-6678 Fax:  (352) 523-1807 View Larger Map Pasco County Fair FAIRGROUNDS: 36722 County Road 52   Dade City, Florida 33525 OFFICE: (352) 567-6678 EMAIL: office@pascocountyfair.com Home | General Information | Entertainment | Agri-Shows 2026 | Non-Agri Competitions | Schedule | Contact | Site Map | Privacy, Terms & Cookies Copyright ©2025, Pasco County Fair Association, Inc.. All Rights Reserved. powered by Back to Top My Account Log Out Log In Search Search 79th Annual Pasco County Fair - Feb. 16 - 22, 2026 Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://nebraskafairs.org/fairs.php?fairid=51",
      "text": "Nebraska Association of Fair Managers | Nebraska County Fairs Login I am: Please Choose a Member Fair an Associate Vendor a Past NAFM President the NAFM Password: Forgot Password? Home Fairs Vendors Events Forms Newsletter Links About Contact Return to All Fairs Keith County Fair Location: Ogallala Dates: Jul 31 - Aug 3, 2024 Website: http://keithcountyfair.com Email: keithcoag@yahoo.com Address: 1000 West 5th Ogallala NE 69153 Phone: (308) 284-6952 President: David Baltzell 1712 West 5th Street Ogallala NE 69153 Phone: (308) 289-2605 Secretary: MaKenzi Spurgin 780 Rd East R South Paxton NE 69155 Phone: (308) 289-1304 Fair Manager: Myrna Spurgin 798 Rd East R So Paxton NE 69155 Phone: (308) 289-2121 Return to All Fairs Home | Fairs | Vendors | Events | Forms | Newsletter | Links | About | Contact © Copyright 2025 Nebraska Association of Fair Managers"
    },
    {
      "url": "https://www.pascocountyfair.com/p/general-information/fair-board",
      "text": "Fair Board & Committees skip to main content Search Website Search Area Weather Maps & Hours 79th Annual Pasco County Fair - Feb. 16 - 22, 2026 General Information Advance Wristbands for 2025  > Annual Fair Passes Ticket Info,  Hours ------Daily Schedule -for 2026 Coming Soon Guest Relations & Fair Tips Fairgrounds Map Fair Board & Committees Preferred Hotel Hampton Inn - Dade City/Zephyrhills Become A Member Building Rental Information Volunteers Pasco County Fair Association (PCFA) By-Laws Sponsors History Get Updates Entertainment Free Daily Entertainment 2026 -  updates daily 2025 Big Rock Amusements Ride List Music Concerts -2026 Keep Watching Here Demo Derby  Smash Up  - 2025 Rodeo ---Click red box at top of website to purchase tickets Agri-Shows 2026 Beef 2026 Youth Dairy Show 2025 Youth Goat Show 2025 plant show 2026 Small Animal Barn 2026 (Poultry/Rabbit) Swine 2026 . FFA/4H Agri- Exhibits Ethics Training  Information coming soon Agri Competitions ' Non-Agri Competitions Collura  Cottage Home Arts 2025 Community Exhibits 2025 Art Show & Youth Exhibits 2025 Pasco Showcase of Talent 2025 sponsored by: Lowman Law Firm Karaoke Contest 2025 Schedule 2025 Daily Fair Schedule - Event Calendar Pasco County Fair  > Other Beef Swine Plants Dairy Rabbit Goat Small Animal Barn Pageants All Winners Photo Gallery Tri-Fold / Fair Information & Schedule 2025 Pasco Showcase of Talent 2023 Home > General Information > Fair Board & Committees Fair Board & Committees The Pasco County Fair Association is indeed a 501(c)(3) non-profit organization . This designation means it's a tax-exempt, non-profit organization recognized by the Internal Revenue Service. Donations to the Pasco County Fair Association are tax-deductible. The association operates the Pasco County Fair in Dade City, Florida . The Pasco County Fair Association board of directors holds its monthly meetings on the second Thursday of each month at 6:00 PM . The meetings take place at the fairgrounds.  The board is elected at the annual membership meeting in April. OFFICERS President: Kevin Corrigan Vice President: Donna Blommel Secretary: Marybeth Lumbra Treasurer: Julie Cotton General Manager : Kevin Corrigan DIRECTORS Donna Blommel Clark Converse Kevin Corrigan Julie Cotton Charles Fraley Phil Geiger Jeanie Germain Michael Gulvin Wayne Howard Krista Jones Dolores Lanigan Marybeth Lumbra Neil Mathis Billy Reid Dusty Rowland Chuck Sheets Tracy J. Thompson Jim A. Ward David Zummo DIRECTORS EMERITUS Elaine Enfield Harold Sample Rich Hetherton James Harper Earl Singletary EX-OFFICIO DIRECTOR Commissioner Ron Oakley 2025- 2026 Annual Fair Committee Tracy J. Thompson, Chairman Wayne Howard Mary Beth Lumbra Jim A. Ward David Zummo Budget & Finance: Phil Geiger, Chair Julie Cotton Jeanie Germain Michael Gulvin Jim Ward Sponsorships: Jeanie Germain, Chair Building & Grounds : Charley Fraley, Chair Dolores Lanigan Michael Gulvin Billy Reed Dusty Rowland 2025-2026 Ag Committee D onna Blommel – Chairman/ Plant Committee Neil Mathis – Beef Committee Jared Castro – Hog Committee Ashley Oakley – Small Animal Committee Jennifer Casler – Goat Committee Tammy Hanlon – Dairy Committee 2025-2026  Beef Committee Roger McKendree, Chairman Ben Barthle, Vice Chairman Tammy Hanlon, Treasurer Courtney Ritter, Secretary Albert Austrino Mark Barthlne Dennis Butler Strait Butler David Castle Dr. Brian Dillard Will Douglas Gary Henry Cody Green Neil Mathis Brock McKendree Terry Pinkston Chad Sasser Earl Singletary 2025-2026 Plant Committee Donna Blommel, Chairwomen Jessie Reagan, Vice-Chairwoman Morgan Blommel David Greim Stephen Herrmann 2025-2026 Hog Committee Kris Browning, Chairman Jarod Castro, Co-Chairman Tamara Davidson, Secretary Brian Cullum, Treasurer Jamie Bingham Matt Carter Hannah Davidson Jessie Gaskin Emile Lorenzo Limoges Brittany Maddox Manuel Molina, Jr. Justin Rollins 2025-2026 Small Animal Committee Ashley Oakley, Barn Chairwoman Kathy Kessler, Selena Springer, Vice-Chairman Sandra Gonzalez Hannah Gillette, Rabbit Secretary Faye Geiger Krisit Dorough, Poultry Secretary, Karen Gillette Brittney Martin, Treasurer Marc Mitchel 2025-2026 Dairy Committee Tammy Hanlon, Chair Brock McKendree, Co-Chair Courtney Ritter, Secretary Tim Carter, Treasurer Robin Carter Bailey McKendree Connie Schvetzof Georgia Madagan Dr. Chet Taylor, Vet Warren Lowery, Dairy Inspector 2025-2026 Goat Committee Jennifer Casler, Chair Sami Ray Downs, Co-chair Karen Gillett Olivia McCracken, Fundraising RaeAnna Casler Alpha Lewis Hannah Gillette 2025-2026   Miss Heart/Miss Pasco/Baby Pageant Committee Krista Jones, Director Jenny Blommel Treena Boyette Sherri Holland 2025-2026  Rodeo Committee Krista Jones, Chair Jenny Blommel Rose Hartzner Sherri Holland Heather Mathis Teghan Sheets Pasco Showcase of Talent Teresa Yoho, Chair Wayne Howard Tracy J. Thompson David Zummo 20 25-2026 Art Committee Diana Murcar, Chairman Kim Seymour – Co-Chair Michelle Vasko – Co - Chair Rachel Warren – Co - Chair Gail Williamson – Co - Chair Patsy Geiger – Co-Chair Ava Larkin Bill Steen Ruth Steen Sarah Steen Judy Steen Collura Cottage: Rachael & Ken Woodard -Co-Chairs Community Exhibit s: Marybeth Lumbra Demo Derby : Charles Fraley Higgins Hall: (Vendors) Chuck Sheets Kevin Corrigan, Advisor Volunteers Marybeth Lumbra of Transcript Pasco County Fair FAIRGROUNDS: 36722 County Road 52   Dade City, Florida 33525 OFFICE: (352) 567-6678 EMAIL: office@pascocountyfair.com Home | General Information | Entertainment | Agri-Shows 2026 | Non-Agri Competitions | Schedule | Contact | Site Map | Privacy, Terms & Cookies Copyright ©2025, Pasco County Fair Association, Inc.. All Rights Reserved. powered by Back to Top My Account Log Out Log In Search Search 79th Annual Pasco County Fair - Feb. 16 - 22, 2026 Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    }
  ]
}