{
  "fuentes": [
    {
      "url": "https://www.newsherald.com/story/entertainment/dining/2015/07/30/pull-up-chair-at-patches/33760496007/",
      "email": "jwaddy@pcnh.com"
    },
    {
      "url": "https://patch.com/contact-us",
      "email": "contributors@patch.com"
    },
    {
      "url": "https://patch.com/contact-us",
      "email": "correctionrequests@patch.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "alex@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "amanda@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "andrew@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "dan@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "dylan@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "john@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "keith@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "matt@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "paige@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "pat@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "reilly@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "sean@patch-development.com"
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "email": "seth@patch-development.com"
    },
    {
      "url": "https://lifewave.globalewallet.com/public/ContactUs.aspx",
      "email": "lifewave@globalewallet.com"
    },
    {
      "url": "https://www.vitaminpatches.uk/contact-us",
      "email": "info@abhealthandwellbeing.com"
    },
    {
      "url": "https://patch.com/users/patchstaff",
      "email": "national@patch.com"
    },
    {
      "url": "https://patch.com/users/patchstaff",
      "email": "sproutteammanager@patch.com"
    },
    {
      "url": "https://www.patches.co/us/info/contact-us",
      "email": "info@gs-jj.com"
    },
    {
      "url": "https://www.patches.co/us/info/contact-us",
      "email": "info@gs-jj.com"
    }
  ],
  "mails": [
    "alex@patch-development.com",
    "amanda@patch-development.com",
    "andrew@patch-development.com",
    "contributors@patch.com",
    "correctionrequests@patch.com",
    "dan@patch-development.com",
    "dylan@patch-development.com",
    "info@abhealthandwellbeing.com",
    "info@gs-jj.com",
    "john@patch-development.com",
    "jwaddy@pcnh.com",
    "keith@patch-development.com",
    "lifewave@globalewallet.com",
    "matt@patch-development.com",
    "national@patch.com",
    "paige@patch-development.com",
    "pat@patch-development.com",
    "reilly@patch-development.com",
    "sean@patch-development.com",
    "seth@patch-development.com",
    "sproutteammanager@patch.com"
  ],
  "nombre_sitio": "patchespub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.newsherald.com/story/entertainment/dining/2015/07/30/pull-up-chair-at-patches/33760496007/",
      "text": "Pull up a chair at Patches News Sports Entertainment Opinion Advertise Obituaries eNewspaper Legals DINING Pull up a chair at Patches Jan Waddy jwaddy@pcnh.com PANAMA CITY BEACH — I drive by Patches Pub & Grill on Thomas Drive every time I turn left to head toward St. Andrews State Park, but I had never stopped until Tuesday. Usually the tables outside in front of the patio bar are filled with people, sometimes listening to live music, but I arrived just before 11 a.m. when Vince Greiner, aka “Pub Ambassador,” and his wife, co-owner Cindy Greiner, were finishing morning preparations. We walked past the inside bar and took our seats at one of the high-top barrel tables. “We have 60 seats inside, and we opened the tiki bar on the patio one year ago — adding an additional 100 seats,” Vince said. “It’s fun. We always have great local music. ... Sometimes people will come here and spend three to four hours.” Cindy was quick to add that Patches, which has wooden highchairs and a kids’ menu, is family-friendly. “We have a lot of families off the beach and a ton who come for baseball,” Cindy said. “Even the Bar Bingo is family-friendly.” Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Patches initially opened in 1994, but the couple took it over two and a half years ago and hired head chef Craig Miller, formerly of 30 Degree Blue. “His menu really changed it into a family-style pub,” Vince added. The couple, originally from Michigan, had vacationed at the beach while living in Georgia and decided to relocate to Florida full-time in 2010. “We decided to buy the place as a hobby, but it grew,” Vince said. “We bought this with six employees. Now we have 32 people for the volume in the summertime.” Patches has become a hot spot with regulars, as well as visitors who come in and play shuffleboard. “When it started out, the very first patch was a Girl Scout patch and it turned into a military theme,” said Vince, “a former Army guy,” who pointed out the patches hanging on the wall. “We are just carrying on the tradition. Almost every day someone will bring in a patch or send one to us. Now military, police and fire department — everybody’s together, and we put them wherever space is left. We have patches from at least 25 different countries.” Every Tuesday is military day, with 15 percent off for all active duty and retired. Patches’ bars only serve beer and wine. The house beer is Patches Red Diver Ale, brewed by Miller — “the Navy guys really like that one,” Vince added. But it’s the food that has put Patches on the map. “His thing that got us up and running was his secret recipe for dry rubs,” Vince said. They keep the recipe in a safe. Patches proudly displays its 2013 Peoples Choice Free For All Style and the 2014 second place Free For All Style awards from the Aaron Rich Invitational Chicken Wing Championship and Panama City Living magazine’s 2014 Reader’s Choice Award for Best Chicken Wings, as well as an award for the “most original” chili in the St. Andrew Bay Center’s fourth annual Chili Cook Off. This year’s Best of Bay Reader’s Choice Awards for The News Herald garnered Patches three No. 3 spots for Sports Bar, Wings and Hamburger. “Garden and Gun magazine named us best hamburger in Panama City and Panama City Beach in Fall 2014,” Cindy added. In addition to the award-winning Dry Rubbed wings, Patches also has Spicy Teriyaki, Sweet Heat, Naked, Buffalo, BBQ and Dragon’s Breath — “That’s our hottest one; every place has to have one. I can eat about three of those,” Vince said. “We average about 100 pounds of wings a day, which for a little place is quite a few wings. That will increase in football season.” Patches’ signature burger is a Double Bacon Egg & Cheeseburger with two 5-ounce patties, Provolone cheese, bacon, fried egg and garlic basil aioli. Per Vince’s suggestion, I went with the Ragin’ Cajun — thinly sliced smoked Cajun Turkey Breast topped with bacon, smoked gouda cheese, sundried tomatoes and Creole mustard on a Pretzel Roll. “The turkey is rubbed with the same dry rub we use for the wings, and then smoked on the porch,” Vince said. The sandwich, served hot, was good — a nice change served with the Signature Pasta Salad. When I first saw the shredded Monterey jack/cheddar blend sprinkled on top of the pasta, I wasn’t sure I would like it. But it was a surprisingly addictive creamy mix of Southwest flavors with a little Cajun flare — onions and green onions, celery, sundried tomatoes, black beans, more shredded Monterey jack/cheddar blend, macaroni pasta and Cajun seasoning. It was a lot of food, especially for $8.99, and I ended up finishing the salad and taking the other half of the sandwich to-go. I would order what I had again, but not before I try a few other things on the menu, including the thin-crust pizza. Other things that caught my attention: The House Smoked Tuna Dip appetizer made with tuna smoked on the Patio Bar with hickory chips and served with fresh flash fried tortilla chips, jalapenos and pico on the side and the Pickle Chips (which I prefer over spears) — dusted in-house with secret seasoning and fried, then served with homemade Southwest Ranch for dipping. The Greiners admit their favorite is the Pub Reuben, as well as the Friday Chef special of pan-seared 6-ounce ahi tuna steak served over Asian noodles with seaweed salad and wasabi. “It brings people here; it’s off the charts,” Vince said. Desserts, all made in-house, include Patches Signature Oreo/Peanut Butter Pie, Bread Pudding and Patches Key Lime Tart. By the time I left at noon, tables and bar stools were filling up with families and regulars. “Locals come in that have been coming for years and all have their seat at the bar, and the bartender has their drink waiting for them. We treat everybody like a local or like a regular,” said Vince, who is finding this to be a sweet life. “I get to golf year-round and go to the beach year-round. It’s laid back on the east end of the beach and the Grand Lagoon has a nice homey local feel. I drive my golf cart to work.” What: Sports bar and family restaurant Where: 4723 Thomas Drive, Panama City Beach Hours: 11 a.m. to midnight daily year-round Details or to-go orders: 850-233-8879, PatchesPub@gmail.com or PatchesPub.com PATCHES PUB & GRILL Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.newsherald.com. All rights reserved."
    },
    {
      "url": "https://patch.com/contact-us",
      "text": "Contact Patch Skip to main content Post See all communities Promote on Patch See All Communities Regional Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District Of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas US Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Patch Help Center Have questions? Get answers. Everything you need to know, in one place. Helpful links Find what you're looking for in the topics below: Create a post Edit a post Manage your account Update email preferences Contact your editor Post an article FAQs Take a look at these common questions Patch users ask: How do I post on Patch? If you don't already have a Patch account and would like to post, follow the steps below: 1. Go to https://patch.com/register or click \"Sign up\" in the top right corner of Patch.com . 2. Enter your town or zip code and select your nearest Patch site from the drop-down menu that appears, then enter your email address and click \"Find your community.\" 3. Enter your first and last name, then create a password and click \"Create profile.\" 4. You will be sent a verification email to ensure you're a real person. Click the link in your email to complete setting up your account. 5. Congrats! You are now able to post events and classifieds. Still having trouble? Reach out to us at support@patch.com and we'll help you get started. How do I edit a post? If you haven't already created an account, click here to learn how. Once you have an account, you can post one of the following things on Patch: • Event • Classified • Article • Business Listing If you need to edit or remove any of your posts or replies, follow these steps: 1. Click the three dots in the bottom right corner of your post. 2. To delete your post, select \"Delete\" , confirm your choice, and you are done. 3. To edit your post, select \"Edit\" and you will have the option to edit the language of your post and to add an image if you want, simply click on the image icon that says \"Add image.\" 4. Then select \"Update\" , and your post will be updated. Reach out to support@patch.com with any questions! How do I manage/delete my account? Update your profile settings here or navigate to your user menu in the top right corner of the page and select \"Edit profile\" under \"Manage.\" To delete your account, you will need to contact support@patch.com . How do I manage/update my email preferences? Update your email preferences here or navigate to your user menu in the top right corner of the page and select \"Email subscription\" under \"Manage.\" How do I contact my local editor? To contact your local editor, navigate to the mail icon in the footer on Patch.com or the Patch App. How do I post an article myself? If you are looking to contribute in a more formal or traditional way, you have the option to complete one additional verification step in order to post a press release, column, op-ed, letter to the editor or obituary in the form of an article . When you publish an article on Patch, it will be labeled as \"Neighbor News\" and will show up in the Neighbor News section of your home community. If your local Patch editor sees fit, they can also choose to share it with nearby communities or include it in an email to readers. Patch also welcomes vetted contributors interested in sharing their expertise and reporting on their communities more deeply and regularly. To apply, fill out this form or email contributors@patch.com with a link to your Patch profile, some examples of your work and a few sentences on why you'd like to contribute. How do I \"Follow\" another community outside of my home community? Stay in the know about what's happening where you grew up, where your family lives or somewhere you'd love to visit. Subscribe to your community whether you live there or not. Don't see your question here? See more FAQs here . More ways to contact Patch Employment opportunities Advertise with Patch Alert us to a correction Submit a news tip Have another question? Click on the button below to submit a support request: Contact Us Find out what’s happening in your community on the Patch app Communities Across Our Network | Everything Local Banning-Beaumont, CA Livermore, CA Murrieta, CA Temecula, CA Fairfield, CT Greenwich, CT Milford, CT Joliet, IL Oak Lawn, IL Plainfield, IL Bel Air, MD Concord, NH Nashua, NH Brick, NJ Middletown, NJ Ocean City, NJ Toms River, NJ Doylestown, PA Marple Newtown, PA View All Communities Corporate Info About Patch Careers Partnerships Advertise on Patch Support FAQs Contact Patch Community Guidelines Posting Instructions Terms of Use Privacy Policy © 2025 Patch Media. All Rights Reserved."
    },
    {
      "url": "https://www.patch-development.com/about-us",
      "text": "About Us — Patch Development 0 Skip to Content About Us What We Do Projects Media Contact Open Menu Close Menu About Us What We Do Projects Media Contact Open Menu Close Menu About Us What We Do Projects Media Contact ABOUT US GREAT PARTNERSHIPS ARE BUILT ON TRUST. Founded in 2019, Patch Development is a premier commercial real estate development firm. Specializing in land development, built-to-suit projects, site selection, and consulting with a keen focus on market analysis, we are more than developers, we are architects of trust. Our approach, grounded in transparency and a commitment to simplicity, has led us to become the developer and general partner for over 4 million square feet of properties valued at half a billion dollars. With a leadership team boasting a combined 150 years of experience, we bring knowledge and trust to every project, forging lasting partnerships in the process. Pat Chittenden Founder/ CEO Patrick founded Patch Development in 2019 with a vision to move towards a truly local and community presence. He focuses on those community relationships and finding the most valued long term opportunities. Prior to creating Patch, Pat co-founded Ambrose Property Group and was responsible for development and construction of industrial, office, and mixed-use projects.  He graduated from Indiana University - Bloomington. Born and raised in Indianapolis, Pat now resides in Westfield with his wife, Jackie, two daughters, Sloan and Quinn and son, Lou. When not in the office, he spends his time on the golf course, in the gym or at the lake. pat@patch-development.com Andrew Greenwood VP of Development/General Counsel Guiding Patch's projects with executive, ownership, and senior legal counsel skills, Andrew, an Indiana University alumnus with a Jurisprudence Doctorate from Hofstra, oversees legal aspects and diverse projects. He treasures family moments, coaching youth sports, and reading. andrew@patch-development.com Keith Hoener CFO At Patch, Keith manages investment, financing, and institutional partnerships, with expertise in real estate spanning acquisition, development, construction, and management. An Indiana University – Bloomington graduate, Keith resides in Fishers, enjoying family sports, golf, and outdoor activities. keith@patch-development.com Alex Chittenden Development Manager Leading Patch’s construction team, Alex draws on 10 years in the construction and development industry. His managerial experience spans warehouse distribution, retail, restaurants, healthcare, and office projects. A University of Louisville graduate, Alex lives in Westfield, enjoying time with his wife Laura, grilling, outdoor activities, and golf. alex@patch-development.com Seth Anderson Development Manager Seth is responsible for the planning and execution of development projects. After graduating with a Construction Management degree from Purdue, Seth worked for Pepper Construction for 17 years. During his time with Pepper he worked as a Project Manager and Superintendent in Healthcare, Retail, Industrial, Advanced Manufacturing, Higher Ed, and K-12 markets. Outside of work, Seth enjoys outdoor activities, snowboarding, and running with his wife and 3 children. seth@patch-development.com Paige Gaddis Controller Bringing over 24 years of real estate accounting experience, Paige served as Treasurer at Browning Investments and Controller at the F C Tucker Company. A CPA with a BA from Indiana University and an MBA from Butler University, Paige resides in Carmel, balancing family, kids' sports, travel, reading, and DIY projects. paige@patch-development.com REILLY MARTIN Marketing and Office Manager Reilly is responsible for managing Patch’s Marketing including social media platforms, website updates, photography, & materials for presentations, proposals, and events. She also manages office duties and coordinates all Charity Events/Golf Outings. Prior to Patch, Reilly played soccer at the University of Michigan and received her B.S. in Psychology with a minor in Nutrition. In her free time, she enjoys fitness, and spending time with her husband Grant along with her 6-year-old Labrador Retriever named Honey! reilly@patch-development.com sean busch Development Manager Sean is responsible for the underwriting, coordination, and execution of development projects at Patch.  His previous experience includes underwriting and originating debt and equity for the construction and acquisition of industrial, multifamily, retail, and office properties.  Sean received his B.S. in Finance from the Ohio State University, where he was a member of the Golf team. A resident of Carmel, Sean enjoys playing golf and basketball, and spending time outdoors. sean@patch-development.com Dylan lee Development Manager At Patch, Dylan oversees the execution of development projects. His previous experience includes sales, management and acquisition of residential and commercial properties. A Denison University Graduate and Carmel resident, Dylan enjoys golf, fitness and the outdoors. dylan@patch-development.com Matt Deahl Director of Capital Markets & Equity Driving Patch's growth and management of capital partnerships, Matt brings 15 years of experience in underwriting and sales. As a Broker, he closed $500 million in commercial real estate transactions. A DePauw University graduate and Carmel resident, Matt loves walks, bike rides, sports, and family time with his wife and three children. matt@patch-development.com Dan bennett Property Management Dan is responsible for overseeing and managing daily operations at all of Patch’s properties. As most of his time is spent out in the field, he handles the day-to-day tasks to keep our projects running seamlessly. In his free time, Dan enjoys watching basketball and spending time with his family! dan@patch-development.com jOHN COHOAT VP of Development John’s responsibilities include oversight of development and leasing, and working directly with a team of Development Managers to design, build and deliver projects. John also works with local municipalities to implement new projects, manages key broker relationships, and monitors market conditions. Prior to Patch, he worked at Browning as a Senior VP for 12 years. john@patch-development.com amanda lumpkin Staff Accountant Amanda attended Ball State University where she received a Bachelor’s degree in Special Education. She also received an Associate’s degree in Accounting. She has 13 years’ experience in construction accounting, as she worked for a multi-family builder during that time. Amanda resides in Fishers with her husband Scott of 17 years and their son Alec. Amanda enjoys walking, hot yoga, reading, going to activities that her son is involved in, as well as family vacations. amanda@patch-development.com WHAT WE DO Services Sectors PROJECTS Industrial Mixed-Use Commercial ABOUT US MEDIA CONTACT"
    },
    {
      "url": "https://lifewave.globalewallet.com/public/ContactUs.aspx",
      "text": "lifewave.globalewallet.com drop English 中文（简） 中文（繁） Español Slovenčina Português Italiano 한국어 Polski Français Deutsch Magyar 日本語 Русский हिन्दी Indonesian Nederlands Norsk Svenska čeština Dansk Thai Vietnamese Home Support English eWallet Features Support Please correct the following errors and try again Contact Us Frequently Asked Questions Please visit our Frequently asked questions before you contact our customer support to find information to most of the eWallet related questions. Email us Send us an email to Lifewave@globalewallet.com and our online support team will get back to you as soon as possible. Need to talk to someone? For eWallet related questions Call: 1-866-844-5682 . We are happy to assist you with any account access issues you may be having. For all other issues we highly recommend using the live chat option Customer Support is opened 24 hours from Sunday 9:30 pm EST until Friday 10:00 pm EST Current Time is EST Address Lifewave 9775 Businesspark Ave San Diego, CA 92131, US Refund Policy Close Terms Privacy Privacy Shield Mobile App © Lifewave Software platform powered by This website uses cookies. By continuing to use this website, you consent to the use of cookies. Learn More"
    },
    {
      "url": "https://www.vitaminpatches.uk/contact-us",
      "text": "Get in Touch with Us - Contact Vitamin Patches UK Today top of page Subscribe to Vitamin Patches for 10% OFF! Shop now! HOME ABOUT US TRAINING SHOP FAQs BLOG CONTACT US More Use tab to navigate through the menu items. Log In Contact Have a question about our Vitamin Patches or want to learn more about our products and services? Contact our team of vitamin patch experts today. We're here to help answer your questions and provide you with the information you need to support your health and wellbeing. Fill out our contact form or reach out to us directly via phone or email. We look forward to hearing from you! North East Office (Main) Metropolitan House,Long Rigg Road, Swalwell Gateshead NE16 3AS International Office Singapore 111 North Bridge Road, #21-01 Peninsula Plaza, Singapore 179098. Tel: 6336 8866 0333 335 0044 info@abhealthandwellbeing.com First Name Last Name Email Message Thanks for submitting! Send Company About Us ​ Vitamin Patches Shop ​ Traini ng FA Qs ​ Bl og ​ Contact Us ​ Legal Terms and Conditions ​ Privacy Policy ​ Disclaimer Join our Affiliate Program SIGN UP © 2025 VITAMIN PATCHES BY AB HEALTH & WELLNESS LTD.  Company Number 11727558. All rights reserved. Terms and Conditions bottom of page"
    },
    {
      "url": "https://patch.com/users/patchstaff",
      "text": "Patch User Profile for Patch Staff Skip to main content Across America Subscribe Post Advertise National News Community Corner Crime & Safety Politics & Government Schools Traffic & Transit Obituaries Personal Finance Best Of Arts & Entertainment Business & Tech Health & Wellness Home & Garden Sports Travel Kids & Family Pets Restaurants & Bars See all communities Advertise Promote on Patch State Edition US National Edition Top National News See All Communities Patch Staff , Patch Staff Across America Patch Staff helps bring you the latest news in your neighborhood. Email your tips at PatchStaff@Patch.com. Posting Activity Articles Across America | News | 6d Locals Are Making Weekend Plans — Is Your Event Listed? Patch readers are searching for things to do this fall. Post your September or October event in quickly and affordably. Patch Staff , Patch Staff Across America | News | Sep 2 Got An Event? Locals Are Already Booking Calendars Labor Day is the perfect time to make your fall festival, concert, or class the one people see — starting at just 25¢/day. Patch Staff , Patch Staff Across America | News | Aug 19 Got An Event To Share? We've Got The Crowd For You! If you’ve got something happening in town, we’ll help you get it seen. Patch Staff , Patch Staff Across America | News | Aug 13 Let Locals Know You're Open For Business The summer slowdown is over — now's the time to remind people what your business is about! Patch Staff , Patch Staff Across America | News | Aug 1 Is Your Business Ready for the Fall Rush? Thousands of locals are plugging back in. Put your business in front of them now. Patch Staff , Patch Staff Across America | News | Jul 31 Get Ahead of the Rush — Post Your Fall Event Now Back-to-school is around the corner, and calendars are about to fill fast. Make sure your event grabs everyone's attention. Patch Staff , Patch Staff Across America | News | Jul 24 Make the Most Of Summer Around Town — Before It's Too Late If you're hosting a summer event, now’s the time to put it in front of your town. Patch Staff , Patch Staff Across America | News | Apr 11 Apple Moved Patch Emails — Here’s How to Fix It In 10 Seconds! Here are the quick and easy ways to make sure you're seeing Patch emails after Apple's latest changes. Patch Staff , Patch Staff Across America | News | Nov 2023 A Short Note on Changes to Patch Community Interactions You may have noticed some changes in how you can interact on our platform, particularly the removal of Neighbor Posts and Replies. Patch Staff , Patch Staff Across America | News | Nov 2023 Patch Expands Local News Coverage Thanks To T-Mobile Spotlighting town traditions, star students & local leaders is possible thanks to a brand partner that values community connections. Patch Staff , Patch Staff Wallingford, CT | News | Jun 2023 Wallingford Police Blotter: May 7 Through May 17, 2023 Recent arrests by the Wallingford Police Department. All charges are allegations and not convictions. Patch Staff , Patch Staff Across New Jersey, NJ | News | Apr 2023 Statement Regarding Jan. 29, 2022 Post About Senator Raymond Lesniak Statement from Patch regarding the Jan. 29, 2022 post about Senator Raymond Lesniak. Patch Staff , Patch Staff Across America | News | Feb 2023 New American Funding Becomes Exclusive Mortgage Provider for Patch Partnership will highlight New American Funding in over 1,200 markets nationwide. Patch Staff , Patch Staff Center Moriches-Eastport, NY | News | Apr 2022 🌱 Get Center Moriches News Quickly With Patch's Daily Roundup Want to know the most important things happening in Center Moriches each day? Just look for the 🌱 in your daily newsletter from Patch. Patch Staff , Patch Staff Shirley-Mastic, NY | News | Apr 2022 🌱Get Your Shirley-Mastic News Quickly With Patch's Daily Roundup Want to know the most important things happening in Shirley-Mastic each day? Just look for the 🌱 in your daily newsletter from Patch. Patch Staff , Patch Staff East Hampton, NY | News | Apr 2022 🌱 Get Your East Hampton News Quickly With Patch's Daily Roundup Want to know the most important things happening in East Hampton each day? Just look for the 🌱 in your daily newsletter from Patch. Patch Staff , Patch Staff Sachem, NY | News | Apr 2022 🌱 Get Your Sachem News Quickly With Patch's Daily Roundup Want to know the most important things happening in Sachem each day? Just look for the 🌱 in your daily newsletter from Patch. Patch Staff , Patch Staff Patchogue, NY | News | Apr 2022 🌱 Get Your Patchogue News Quickly With Patch's Daily Roundup Want to know the most important things happening in Patchogue each day? Just look for the 🌱 in your daily newsletter from Patch. Patch Staff , Patch Staff Westhampton-Hampton Bays, NY | News | Apr 2022 🌱 Get Your Westhampton News Quickly With Patch's Daily Roundup Want to know the most important things happening in Westhampton each day? Just look for the 🌱 in your daily newsletter from Patch. Patch Staff , Patch Staff Southampton, NY | News | Apr 2022 🌱 Get Your Southampton News Quickly With Patch's Daily Roundup Want to know the most important things happening in Southampton each day? Just look for the 🌱 in your daily newsletter from Patch. Patch Staff , Patch Staff Read more Find out what’s happening in your community on the Patch app Corporate Info About Patch Careers Partnerships Advertise on Patch Support FAQs Contact Patch Community Guidelines Posting Instructions Terms of Use Privacy Policy © 2025 Patch Media. All Rights Reserved."
    },
    {
      "url": "https://www.patches.co/us/info/contact-us",
      "text": "Contact Us | Custom Patches - Patches Co. Patches Co. GS-JJ.com BPS.com Tel: CALL US 1-866-573-4920 Email: E-MAIL US Info@GS-JJ.com 100% Quality Guarantee | Free Shipping and Design Service Quote Now Custom Patches Products Embroidered Patches HOT Printed Patches Woven Patches PVC Patches POPULAR Chenille Patches Leather Patches 3D Embroidered Patches Full Color Flex Patches One Color Flex Patches Sequin Patches Woven Labels Denim Patches Printed Care Labels NEW Metal Patches NEW Full Embroidered + Full Printed Patches NEW Tatami Fabric Silicone Patches NEW Heat Transfer Patches NEW 3D Silicone Patches NEW Flock Patches NEW Styles By Population Military Patches HOT Police Patches HOT Tactical Patches POPULAR EMS Patches POPULAR Flag Patches Morale Patches Fire Department Patches HOT By Theme Sports Patches Martial Arts Patches Airsoft Patches HOT Motorcycle Patches NEW Clothes Patches Hat Patches POPULAR Shirt Patches POPULAR Uniform Patches POPULAR General Patches Iron On Patches NEW Blank Patches NEW Velcro Patches NEW Sew On Patches POPULAR By Purpose Logo Patches POPULAR Name Patches Fashion Patches Bullion Patches Letterman Patches Funny Patches User Guide Patches Backing Instructions How to Choose Patches Backing Patches Washing Instructions Sign in en AMERICA United States English United States Español Brasil Português Canada English EUROPE Deutschland Deutsch Italia italiano España español United Kingdom English Ireland English Ireland Gaeilge Nederland Nederlands Belgium Nederlands Belgium Français norge Norsk Portugal Português Danmark Dansk Österreich Deutsch Switzerland Deutsch Switzerland Français ASIA PACIFIC Australia English New Zealand English Singapore English $ USD USD EUR GBP CAD AUD CHF NOK DKK MXN NZD SGD CNY 0 $0.00 en AMERICA United States English United States Español Brasil Português Canada English EUROPE Deutschland Deutsch Italia italiano España español United Kingdom English Ireland English Ireland Gaeilge Nederland Nederlands Belgium Nederlands Belgium Français norge Norsk Portugal Português Danmark Dansk Österreich Deutsch Switzerland Deutsch Switzerland Français ASIA PACIFIC Australia English New Zealand English Singapore English | $ USD USD EUR GBP CAD AUD CHF NOK DKK MXN NZD SGD CNY Sign in or Join Free Contact Us We're Always Happy to Help. Let's Get in Touch. First Name * Last Name * E-mail * Phone * Subject * Message * submit Submission Successful Chinesetea Co. looks forward to your tasting and comments! submit Address: 20812 Carrey Road, Walnut, CA 91789 Telephone: 1-866-573-4920 Email: Info@GS-JJ.com Patches Types Embroidered Patches 3D Embroidered Patches Chenille Patches PVC Patches Printed Patches Woven Patches Leather Patches Full Color Flex Patches One Color Flex Patches Sequin Patches Denim Patches Woven Labels Metal Patches Printed Care Labels Full Embroidered + Full Printed Patches Tatami Fabric Silicone Patches Heat Transfer Patches 3D Silicone Patches Flock Patches About About Us Contact Us FAQ Terms and Conditions Privacy Policy Influencer Program Thread Color Sign Up for Our Weekly Newsletter Copyright © 2025 All Rights Reserved Patches Co. Sign in Quick Sign In via Email Code * Email: * Password: √ Remember Me Forgot Password? Sign in Create Your Account or Log in with Google By sign in. I agree to the Patches.co Privacy Policy and Term & Conditions . Feedback How was your experience with Patches Co.? Very bad Poor Average Good Awesome Not good at all Very Good"
    }
  ]
}