{
  "fuentes": [
    {
      "url": "https://www.pavilion-furniture.com/contact-us/",
      "email": "info@pavilionfurniture.comfor"
    },
    {
      "url": "https://www.pavilionenergy.com/en/contact-us",
      "email": "info@pavilionenergy.com"
    },
    {
      "url": "https://floridadancevacations.com/events/dance-mix-pavilion-grille-boca-raton/",
      "email": "myrmarw@aol.com"
    },
    {
      "url": "https://pavilionconstruction.com/our-team/",
      "email": "ajax-loader@2x.gif"
    },
    {
      "url": "https://pavilionconstruction.com/our-team/",
      "email": "info@pavilionconstruction.com"
    },
    {
      "url": "https://www.pavilionsolar.com/contact",
      "email": "abernhard@pavilionsolar.com"
    },
    {
      "url": "https://www.pavilionsolar.com/contact",
      "email": "info@pavilionsolar.com"
    },
    {
      "url": "https://www.pavilionsolar.com/contact",
      "email": "installers@pavilionsolar.com"
    },
    {
      "url": "https://www.pavilionsolar.com/contact",
      "email": "media@pavilionsolar.com"
    },
    {
      "url": "https://www.pavilionsolar.com/contact",
      "email": "reservations@pavilionsolar.com"
    },
    {
      "url": "https://www.logovisual.com/product/visual-thinking-solutions/visual-thinking-products/whiteboard-process-tool-kits/team-board/",
      "email": "sales@logovisual.com"
    },
    {
      "url": "https://www.partyslate.com/venues/pavillion-grille",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://pavilionrecruitment.com/contact-us/",
      "email": "contactus@pavilionrecruitment.com"
    },
    {
      "url": "http://www.pavilioninv.com/sub/our-team.php",
      "email": "hsshin@pavilioninv.com"
    },
    {
      "url": "https://www.davidelvis.com/events/pavilion-grille-1",
      "email": "davidmorin@bellsouth.net"
    },
    {
      "url": "https://houseofpavilion.com/about-us/",
      "email": "pavilion-ministries-logo-@600w-300x272.png"
    },
    {
      "url": "https://houseofpavilion.com/about-us/",
      "email": "pavilion-ministries-logo-@600w.png"
    },
    {
      "url": "https://www.washingtonpavilion.org/about/contact-us/",
      "email": "info@washingtonpavilion.org"
    }
  ],
  "mails": [
    "abernhard@pavilionsolar.com",
    "ajax-loader@2x.gif",
    "contact@partyslate.com",
    "contactus@pavilionrecruitment.com",
    "davidmorin@bellsouth.net",
    "hsshin@pavilioninv.com",
    "info@pavilionconstruction.com",
    "info@pavilionenergy.com",
    "info@pavilionfurniture.comfor",
    "info@pavilionsolar.com",
    "info@washingtonpavilion.org",
    "installers@pavilionsolar.com",
    "media@pavilionsolar.com",
    "myrmarw@aol.com",
    "pavilion-ministries-logo-@600w-300x272.png",
    "pavilion-ministries-logo-@600w.png",
    "reservations@pavilionsolar.com",
    "sales@logovisual.com"
  ],
  "nombre_sitio": "paviliongrille.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pavilion-furniture.com/contact-us/",
      "text": "Contact Us - Pavilion Furniture Skip to content Products Menu Toggle Col One Menu Toggle Dining and Side Seating Arm Chairs Armless Chairs Bar and Counter Stools Benches Lounge Seating Lounge Chairs Loveseats Sofas Chaise Lounges Daybeds Ottomans Rockers Modular Lounge Col Three Menu Toggle Tables Side Tables Coffee Tables Console Tables Dining Tables Communal Tables Bar Tables Umbrella Tables Service Carts Col Four Menu Toggle Accessories Tailored Protective Covers Parasol Bases Collections Menu Toggle Col One Menu Toggle Biscayne Bleau Brickell Carlyle Cavo Crandon Downtown Eastside Col Two Menu Toggle Kendall Lirio Luma Marina Morningside Olympia Palmera Pinecrest Col Three Menu Toggle Salita Sandcastle Southpoint Tequesta Tides Verdena Vesio Wynwood Finishes Menu Toggle Col One Menu Toggle Frames Slings Fabrics Ecowood Table Tops Specialty Finishes Resources Menu Toggle Our Resources Menu Toggle Image Gallery Brochures Spec Sheets Finish Downloads Care & Maintenance Warranty Spacer About Us Menu Toggle Col One Menu Toggle About Our Story Premium Design Designers Where to Buy Careers Contact Us Spacer Inspiration Menu Toggle Col One Menu Toggle Our Inspiration Lookbook In the News Spacer Main Menu Contact Us We are here to help you reimagine your space with premium, durable and timeless outdoor furniture. For help with your project, please get in touch with us using the form below. For existing orders, shipping, or replacement parts, please contact Customer Resources at 305.823.3480 or email [email protected] For all other inquiries, please let us know how we can help using this form. Please enable JavaScript in your browser to complete this form. First Name * Last Name * Email Address * Company Phone Country Select Country Afghanistan Aland Islands Albania Algeria Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Chinese Taipei Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cote d'Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palestinian Territory, Occupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Republic of Palau Reunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay US Virgin Islands Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe State Select State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming City ZIP / Postal Code Message SUBMIT Warranty Care & Maintenance Careers Privacy Policy Legal Statement Warranty Care & Maintenance Careers Privacy Policy Legal Statement Follow Us Instagram Linkedin-in Hear From us Email Address Sign Up © 2024 PAVILION ® REG. U.S. PAT. & TM. OFF. Products Menu Toggle Col One Menu Toggle Dining and Side Seating Arm Chairs Armless Chairs Bar and Counter Stools Benches Lounge Seating Lounge Chairs Loveseats Sofas Chaise Lounges Daybeds Ottomans Rockers Modular Lounge Col Three Menu Toggle Tables Side Tables Coffee Tables Console Tables Dining Tables Communal Tables Bar Tables Umbrella Tables Service Carts Col Four Menu Toggle Accessories Tailored Protective Covers Parasol Bases Collections Menu Toggle Col One Menu Toggle Biscayne Bleau Brickell Carlyle Cavo Crandon Downtown Eastside Col Two Menu Toggle Kendall Lirio Luma Marina Morningside Olympia Palmera Pinecrest Col Three Menu Toggle Salita Sandcastle Southpoint Tequesta Tides Verdena Vesio Wynwood Finishes Menu Toggle Col One Menu Toggle Frames Slings Fabrics Ecowood Table Tops Specialty Finishes Resources Menu Toggle Our Resources Menu Toggle Image Gallery Brochures Spec Sheets Finish Downloads Care & Maintenance Warranty Spacer About Us Menu Toggle Col One Menu Toggle About Our Story Premium Design Designers Where to Buy Careers Contact Us Spacer Inspiration Menu Toggle Col One Menu Toggle Our Inspiration Lookbook In the News Spacer Products Menu Toggle Col One Menu Toggle Dining and Side Seating Arm Chairs Armless Chairs Bar and Counter Stools Benches Lounge Seating Lounge Chairs Loveseats Sofas Chaise Lounges Daybeds Ottomans Rockers Modular Lounge Col Three Menu Toggle Tables Side Tables Coffee Tables Console Tables Dining Tables Communal Tables Bar Tables Umbrella Tables Service Carts Col Four Menu Toggle Accessories Tailored Protective Covers Parasol Bases Collections Menu Toggle Col One Menu Toggle Biscayne Bleau Brickell Carlyle Cavo Crandon Downtown Eastside Col Two Menu Toggle Kendall Lirio Luma Marina Morningside Olympia Palmera Pinecrest Col Three Menu Toggle Salita Sandcastle Southpoint Tequesta Tides Verdena Vesio Wynwood Finishes Menu Toggle Col One Menu Toggle Frames Slings Fabrics Ecowood Table Tops Specialty Finishes Resources Menu Toggle Our Resources Menu Toggle Image Gallery Brochures Spec Sheets Finish Downloads Care & Maintenance Warranty Spacer About Us Menu Toggle Col One Menu Toggle About Our Story Premium Design Designers Where to Buy Careers Contact Us Spacer Inspiration Menu Toggle Col One Menu Toggle Our Inspiration Lookbook In the News Spacer Start typing and press enter to search Search... Scroll to Top"
    },
    {
      "url": "https://www.pavilionenergy.com/en/contact-us",
      "text": "Contact Us | Pavilion Energy Skip to main content Energy Financial Solutions by Main Corporate Website About Us Our Vision Our Brand Our Story What We Do LNG Trading, Shipping & Operations Downstream Markets in Asia & Europe Marine Fuel Energy Financial Solutions Future Energy Role of Natural Gas The SGE Methodology Sustainability Sustainability Reports Corporate Social Responsibility Media Press Releases Speeches Career Life at Pavilion Energy Career Opportunities Contact Us English Español Show search Buscar X Contact Us Get in touch with Pavilion Energy via the contact form below. Reach Out to Us Today Pavilion Energy Pte. Ltd. 12 Marina Boulevard, #37-02 Marina Bay Financial Centre Tower 3 Singapore 018982 Tel +65 6228 8100 Fax +65 6225 1000 info@pavilionenergy.com Pavilion Energy S.A.U. Torre de Cristal, Planta 21 (Sur) Paseo de la Castellana 259C 28046 Madrid Tel +34 810 810 200 Fax +34 810 810 201 info@pavilionenergy.com Field with * is mandatory Salutation - Select - Mr. Mrs. Ms. First Name Last Name Email Contact No. Subject - Select - Business opportunities Gas marketing and distribution General enquiries HR enquiries Media enquiries Message Privacy Policy We're committed to your privacy. By clicking \"Submit\", you agree to and understand the terms stated within the Privacy Policy. Useful links Our Milestones Press Releases Career Opportunities Whistleblowing Contact Us info@pavilionenergy.com Pavilion Energy Group Offices Follow us Follow us in Footer menu Privacy Notices Legal & Terms of Use © Copyright 2020 Pavilion Energy."
    },
    {
      "url": "https://floridadancevacations.com/events/dance-mix-pavilion-grille-boca-raton/",
      "text": "Tuesday/Friday/Saturday Dance Mix - Pavilion Grille - Boca Raton - Florida Dance Vacations Florida Dance Vacations Navigation Accommodations Attractions Instructors News & Deals Contact Social Dance Calendar Accommodations Attractions Instructors News & Deals Contact Social Dance Calendar Tuesday/Friday/Saturday Dance Mix – Pavilion Grille – Boca Raton Call us at 561-912-0000 or 954-214-1924 We are located in a Four Story Airy Indoor Atrium! All tables, chairs, railings and counters are sanitized repeatedly. PLEASE COME OUT AND SUPPORT US AND OUR MUSICIANS Dinner from 6 pm and Music from 7:30 pm – Saturday music begins at 8:00 pm View our entertainment on our website: www.paviliongrille.com/calendar Event Details Dance Style Swing/Hustle/Party Mix Start time 7:30 pm End time 10:00 pm Share Venue Details Phone 561-912-0000 Email paviliongrille@gmail.com Website paviliongrille.com/ Venue Pavilion Grille Address 301 Yamata Rd City Boca Raton Click For Directions Click For Directions |||:: 301 Yamato Rd, Boca Raton, Fl 33431 Share this with a friend! Facebook Twitter Email Comments 4 Marshall Wisset March 21, 2023 at 7:20 pm When will Uptown Express appear agsin at the pavillion grill Reply Post Author Diane Hurwit April 2, 2023 at 5:14 pm Thank you for your question. FloridaDanceVacations.com does not organize any dances. It is a comprehensive information portal which posts the variety of social dances by all organizers throughout South Florida. If you have a question about a specific dance or venue, contact the organizer/host or venue directly. To find a complete listing of venues, visit http://www.FloridaDanceVacations.com Reply Lynda March 31, 2023 at 9:40 pm What night in May /“2: will u have dNcing and music? Reply Post Author Diane Hurwit April 2, 2023 at 5:15 pm Thank you for your question. FloridaDanceVacations.com does not organize any dances. It is a comprehensive information portal which posts the variety of social dances by all organizers throughout South Florida. If you have a question about a specific dance or venue, contact the organizer/host or venue directly. To find a complete listing of venues, visit http://www.FloridaDanceVacations.com Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Sponsors Social Find us online at these social media channels. Copyright © 2020 Beach Vacation Rentals. Website Accessibility Statement. Crafted by Onward Send to Email Address Your Name Your Email Address Cancel Post was not sent - check your email addresses! Email check failed, please try again Sorry, your blog cannot share posts by email."
    },
    {
      "url": "https://pavilionconstruction.com/our-team/",
      "text": "Team – Pavilion Construction Company Services Affordable Housing Culture & Core Values Team History Careers Experience Contact Company Services Affordable Housing Culture & Core Values Team History Careers Experience Contact Team Hailey Day 2024-01-29T09:26:08-08:00 Team One of Pavilion’s secrets to success lies within our people, with whom we believe make all the difference. Our Pavilion family is comprised of experienced, quality construction professionals. Adam Mannelin Caitlin Britch 2024-03-14T11:08:21-07:00 Adam Mannelin Development Associate Adam Mariam Caitlin Britch 2024-02-02T10:11:40-08:00 Adam Mariam Project Manager Alexa Carvalhal AJ Fresquez 2025-02-20T14:07:10-08:00 Alexa Carvalhal Project Accountant Andrew Guess Caitlin Britch 2024-02-02T10:13:48-08:00 Andrew Guess General Counsel Art Castro Caitlin Britch 2024-02-02T10:14:26-08:00 Art Castro Assistant Superintendent Austin Dusenbery Caitlin Britch 2024-02-02T10:14:46-08:00 Austin Dusenbery Project Engineer Austin Powell Caitlin Britch 2024-02-02T10:15:11-08:00 Austin Powell Assistant Superintendent Brandon Griffin Caitlin Britch 2024-06-17T10:59:08-07:00 Brandon Griffin Assistant Superintendent Brian Gerritz Hailey Day 2024-02-02T10:16:15-08:00 Brian Gerritz President & Co-Founder Brynna Faris Caitlin Britch 2024-07-25T12:46:05-07:00 Brynna Faris Paralegal Caden Wakefield Caitlin Britch 2025-05-06T07:52:34-07:00 Caden Wakefield President - Texas Calvy Yue Caitlin Britch 2025-05-05T06:49:27-07:00 Calvy Yue Project Accountant Manager Carlos Conroy Caitlin Britch 2024-02-02T10:18:23-08:00 Carlos Conroy Vice President of Construction Carlos Gutierrez Caitlin Britch 2024-09-11T09:21:00-07:00 Carlos Gutierrez Superintendent Chris Canaday Caitlin Britch 2024-02-02T10:19:48-08:00 Chris Canaday Superintendent Chris Thatcher Caitlin Britch 2024-02-02T10:20:20-08:00 Chris Thatcher Assistant Superintendent Chris Tuggle Caitlin Britch 2025-05-20T08:14:23-07:00 Chris Tuggle Project Manager Clayton Griffin Caitlin Britch 2025-05-20T08:12:25-07:00 Clayton Griffin Director of Operations - New Mexico Daniel Nevarez Caitlin Britch 2024-11-04T09:45:07-08:00 Daniel Nevarez Project Engineer David Bond Caitlin Britch 2025-03-05T08:35:34-08:00 David Bond Project Manager David Rose Caitlin Britch 2024-02-02T10:24:54-08:00 David Rose Senior Project Manager Derek Mannelin Hailey Day 2024-02-02T10:26:25-08:00 Derek Mannelin Chief Executive Officer & Co-Founder Eddie Dean Caitlin Britch 2024-02-02T10:27:22-08:00 Eddie Dean Assistant Superintendent Enrique Cruz AJ Fresquez 2025-04-07T12:19:23-07:00 Enrique Cruz Superintendent Erica Azez Caitlin Britch 2024-05-22T08:22:17-07:00 Erica Azez Project Accountant Gabe Trujillo Caitlin Britch 2025-04-07T13:51:18-07:00 Gabe Trujillo Vice President of Business Development & Strategic Growth Geraldine Samayoa Caitlin Britch 2025-05-21T07:08:11-07:00 Geraldine Samayoa Project Accountant Harold Jaquez Caitlin Britch 2025-01-23T10:45:48-08:00 Harold Jaquez Superintendent Ira Griffin Caitlin Britch 2025-01-15T10:47:25-08:00 Ira Griffin NM Regional President Ira Ward Caitlin Britch 2024-02-02T10:30:10-08:00 Ira Ward Superintendent Ireland Montano AJ Fresquez 2025-05-21T07:12:00-07:00 Ireland Montano Office Manager / Executive Assistant Ishmael Preer Caitlin Britch 2024-12-02T15:43:31-08:00 Ishmael Preer Project Engineer Jacob Nevarez Caitlin Britch 2025-01-06T10:12:04-08:00 Jacob Nevarez Senior Estimator Janel Schenk AJ Fresquez 2025-03-06T12:46:47-08:00 Janel Schenk Accounts Payable Specialist Jeff Higgins Caitlin Britch 2024-08-13T09:20:52-07:00 Jeff Higgins Superintendent Jerry Carley Caitlin Britch 2024-02-02T10:33:45-08:00 Jerry Carley Superintendent Jesse Davis Caitlin Britch 2024-10-16T15:42:26-07:00 Jesse Davis Director of Business Operations Jim Barkey Caitlin Britch 2024-08-02T08:47:19-07:00 Jim Barkey Superintendent Joel Odom Caitlin Britch 2024-02-02T10:34:36-08:00 Joel Odom Project Accountant Joey Dunaway Caitlin Britch 2025-02-19T12:08:16-08:00 Joey Dunaway Warranty Manager Johnathan Hanson AJ Fresquez 2025-06-13T09:10:26-07:00 Johnathan Hanson Staff Accountant Jolene Bowman Caitlin Britch 2024-02-14T14:44:34-08:00 Jolene Bowman Payroll & Benefits Accountant Jonathan Barrone Caitlin Britch 2024-02-02T10:35:40-08:00 Jonathan Barrone Project Engineer Jonathan Marsalis Caitlin Britch 2025-05-22T11:56:23-07:00 Jonathan Marsalis Superintendent Jose Rivera-Ortega Caitlin Britch 2025-01-23T10:46:51-08:00 Jose Rivera-Ortega Senior Project Manager Joseph Aguilar Caitlin Britch 2025-04-07T12:44:33-07:00 Joseph Aguilar Vice President of Construction Joseph Garibay Caitlin Britch 2024-11-26T15:41:50-08:00 Joseph Garibay Senior Project Engineer Josh Jones Caitlin Britch 2024-02-02T10:38:28-08:00 Josh Jones Project Manager Jovani Tarango Caitlin Britch 2025-01-23T10:46:30-08:00 Jovani Tarango Senior Project Engineer Juan Fabres Caitlin Britch 2024-02-02T10:39:19-08:00 Juan Fabres Estimator Juan Solano Caitlin Britch 2024-02-02T10:39:49-08:00 Juan Solano Assistant Superintendent Jubin Veera Caitlin Britch 2024-02-02T10:40:11-08:00 Jubin Veera Project Manager Justine Keller Caitlin Britch 2024-09-03T08:09:49-07:00 Justine Keller Project Accountant Karen Coffey Caitlin Britch 2024-10-07T13:12:52-07:00 Karen Coffey Controller Kelsey Killian Caitlin Britch 2024-02-02T10:41:24-08:00 Kelsey Killian Front Office Coordinator Kevin Freyer Caitlin Britch 2024-02-02T10:41:44-08:00 Kevin Freyer Project Manager Lidia Flores-Garcia Caitlin Britch 2024-06-05T12:37:41-07:00 Lidia Flores-Garcia Project Accountant Luke Yokoyama Caitlin Britch 2025-02-20T12:02:12-08:00 Luke Yokoyama AP Manager Marcy Comella Caitlin Britch 2025-07-09T10:05:12-07:00 Marcy Comella Assistant Controller Mario Sedillo Caitlin Britch 2025-06-04T10:55:51-07:00 Mario Sedillo Superintendent Matt Moses Caitlin Britch 2025-02-19T09:35:53-08:00 Matt Moses Estimator Michael Andrade Caitlin Britch 2024-12-02T15:37:31-08:00 Michael Andrade Project Manager Mike Pike AJ Fresquez 2025-03-06T09:52:05-08:00 Mike Pike Vice President of Construction Nathan Long Caitlin Britch 2024-02-02T10:46:49-08:00 Nathan Long Vice President of Construction Nathan Moore Caitlin Britch 2024-02-02T10:47:10-08:00 Nathan Moore Superintendent Nicci Roberts Caitlin Britch 2024-11-13T08:08:03-08:00 Nicci Roberts Office Manager Nicole Hoff Caitlin Britch 2024-02-02T10:48:07-08:00 Nicole Hoff Senior Payroll Accountant Paul Lamb Caitlin Britch 2024-02-02T10:49:06-08:00 Paul Lamb Vice President of Estimating & Purchasing Paul Neidert Caitlin Britch 2025-04-15T11:53:43-07:00 Paul Neidert Business Development Manager Rick Burkette Caitlin Britch 2025-06-30T11:51:58-07:00 Rick Burkette Vice President of Construction Robyn Benedetti Hailey Day 2025-06-30T12:02:51-07:00 Robyn Benedetti Human Resource Manager Roy Barrett Caitlin Britch 2024-06-17T08:14:49-07:00 Roy Barrett Assistant Superintendent Roy Fierro Caitlin Britch 2024-11-19T11:25:09-08:00 Roy Fierro Superintendent Soji Fasalojo Caitlin Britch 2024-02-02T10:51:50-08:00 Soji Fasalojo Project Engineer Stephanie Holpp Caitlin Britch 2024-02-02T10:52:41-08:00 Stephanie Holpp Project Accountant Thomas Straight Caitlin Britch 2024-11-18T12:43:40-08:00 Thomas Straight Vice President of New Construction Trevor Ensign Caitlin Britch 2024-07-09T13:32:07-07:00 Trevor Ensign Estimator Wes Wrye Caitlin Britch 2024-12-11T08:09:27-08:00 Wes Wrye Superintendent Adam Mannelin Caitlin Britch 2024-03-14T11:08:21-07:00 Adam Mannelin Development Associate Adam Mariam Caitlin Britch 2024-02-02T10:11:40-08:00 Adam Mariam Project Manager Alexa Carvalhal AJ Fresquez 2025-02-20T14:07:10-08:00 Alexa Carvalhal Project Accountant Andrew Guess Caitlin Britch 2024-02-02T10:13:48-08:00 Andrew Guess General Counsel Art Castro Caitlin Britch 2024-02-02T10:14:26-08:00 Art Castro Assistant Superintendent Austin Dusenbery Caitlin Britch 2024-02-02T10:14:46-08:00 Austin Dusenbery Project Engineer Austin Powell Caitlin Britch 2024-02-02T10:15:11-08:00 Austin Powell Assistant Superintendent Brandon Griffin Caitlin Britch 2024-06-17T10:59:08-07:00 Brandon Griffin Assistant Superintendent Brian Gerritz Hailey Day 2024-02-02T10:16:15-08:00 Brian Gerritz President & Co-Founder Brynna Faris Caitlin Britch 2024-07-25T12:46:05-07:00 Brynna Faris Paralegal Caden Wakefield Caitlin Britch 2025-05-06T07:52:34-07:00 Caden Wakefield President - Texas Calvy Yue Caitlin Britch 2025-05-05T06:49:27-07:00 Calvy Yue Project Accountant Manager Carlos Conroy Caitlin Britch 2024-02-02T10:18:23-08:00 Carlos Conroy Vice President of Construction Carlos Gutierrez Caitlin Britch 2024-09-11T09:21:00-07:00 Carlos Gutierrez Superintendent Chris Canaday Caitlin Britch 2024-02-02T10:19:48-08:00 Chris Canaday Superintendent Chris Thatcher Caitlin Britch 2024-02-02T10:20:20-08:00 Chris Thatcher Assistant Superintendent Chris Tuggle Caitlin Britch 2025-05-20T08:14:23-07:00 Chris Tuggle Project Manager Clayton Griffin Caitlin Britch 2025-05-20T08:12:25-07:00 Clayton Griffin Director of Operations - New Mexico Daniel Nevarez Caitlin Britch 2024-11-04T09:45:07-08:00 Daniel Nevarez Project Engineer David Bond Caitlin Britch 2025-03-05T08:35:34-08:00 David Bond Project Manager David Rose Caitlin Britch 2024-02-02T10:24:54-08:00 David Rose Senior Project Manager Derek Mannelin Hailey Day 2024-02-02T10:26:25-08:00 Derek Mannelin Chief Executive Officer & Co-Founder Eddie Dean Caitlin Britch 2024-02-02T10:27:22-08:00 Eddie Dean Assistant Superintendent Enrique Cruz AJ Fresquez 2025-04-07T12:19:23-07:00 Enrique Cruz Superintendent Erica Azez Caitlin Britch 2024-05-22T08:22:17-07:00 Erica Azez Project Accountant Gabe Trujillo Caitlin Britch 2025-04-07T13:51:18-07:00 Gabe Trujillo Vice President of Business Development & Strategic Growth Geraldine Samayoa Caitlin Britch 2025-05-21T07:08:11-07:00 Geraldine Samayoa Project Accountant Harold Jaquez Caitlin Britch 2025-01-23T10:45:48-08:00 Harold Jaquez Superintendent Ira Griffin Caitlin Britch 2025-01-15T10:47:25-08:00 Ira Griffin NM Regional President Ira Ward Caitlin Britch 2024-02-02T10:30:10-08:00 Ira Ward Superintendent Ireland Montano AJ Fresquez 2025-05-21T07:12:00-07:00 Ireland Montano Office Manager / Executive Assistant Ishmael Preer Caitlin Britch 2024-12-02T15:43:31-08:00 Ishmael Preer Project Engineer Jacob Nevarez Caitlin Britch 2025-01-06T10:12:04-08:00 Jacob Nevarez Senior Estimator Janel Schenk AJ Fresquez 2025-03-06T12:46:47-08:00 Janel Schenk Accounts Payable Specialist Jeff Higgins Caitlin Britch 2024-08-13T09:20:52-07:00 Jeff Higgins Superintendent Jerry Carley Caitlin Britch 2024-02-02T10:33:45-08:00 Jerry Carley Superintendent Jesse Davis Caitlin Britch 2024-10-16T15:42:26-07:00 Jesse Davis Director of Business Operations Jim Barkey Caitlin Britch 2024-08-02T08:47:19-07:00 Jim Barkey Superintendent Joel Odom Caitlin Britch 2024-02-02T10:34:36-08:00 Joel Odom Project Accountant Joey Dunaway Caitlin Britch 2025-02-19T12:08:16-08:00 Joey Dunaway Warranty Manager 1 2 Next Corporate Office 15455 SW Hallmark Dr, Suite 200 Lake Oswego, OR 97035 503.290.5005 info@pavilionconstruction.com ©2025 Pavilion Construction - All Rights Reserved"
    },
    {
      "url": "https://www.pavilionsolar.com/contact",
      "text": "Contact | Get in Touch Now — Pavilion Solar 0 Skip to Content Home Contact English RESERVE Open Menu Close Menu Open Menu Close Menu Home Contact English RESERVE Home Contact English Back RESERVE Contact us If you have any questions or comments, please don’t hesitate to reach out using the contact form. You can also reach us at the email addresses below Email General Inquiries - info@pavilionsolar.com Reservations - reservations@pavilionsolar.com Press Inquiries - media@pavilionsolar.com Installers - installers@pavilionsolar.com Name * First Name Last Name Email * Subject * Message * Thank you! Media Inquiries - media@pavilionsolar.com Other Inquiries - info@pavilionsolar.com Miami, FL USA Disclaimer: This website is not affiliated with, authorized, endorsed by, or in any way officially connected with Tesla Inc., Rivian Automotive, Inc or any of their subsidiaries or its affiliates. The official Tesla and Rivian websites can be found at www.tesla.com and www.rivian.com . The names \"Tesla\" and “Rivian” as well as related names, marks, emblems, and images are registered trademarks of their respective owners. The use of any trade name or trademark is for identification and reference purposes only and does not imply any association with the trademark holder or their brand. Terms and Conditions Privacy Policy Copyright 2025 Pavilion Solar USA, Inc"
    },
    {
      "url": "https://www.logovisual.com/product/visual-thinking-solutions/visual-thinking-products/whiteboard-process-tool-kits/team-board/",
      "text": "Team Board - Logovisual Ltd +44 (0) 1756 792300 +44 (0) 1756 792300 About Services Collaboration Spaces Products ThinkingWall® Dividers Large mobile dividing walls with whiteboard surface plus storage or AV screen. More Acoustics Mobile acoustic walls with whiteboard, storage, and space for an AV screen. More Originals Our original whole wall whiteboard and simple mobile freestanding unit. More Desks, Tables & Seating Whiteboard desks and whiteboard tables, plus collaboration area seating. More Custom Whiteboards Custom Printed Whiteboards Magnetic Drywipe Maps Custom Printed Portable Whiteboards Custom Shaped Whiteboards Magnetic Year Planner Whiteboard Magnetic UK Map Whiteboard Magnetic Overlays Printed Planning Whiteboards Mobile & Freestanding Whiteboards ThinkingWall® Freestander ThinkingWall® Acoustic Freestander ThinkingWall® Acoustic Curve ThinkingWall® Mobile Acoustic AV ThinkingWall® Mobile Acoustic Shelf ThinkingWall® AV Divider ThinkingWall® Divider ThinkingWall® Stor Wall Mounted Whiteboards ThinkingWall® Whole Wall Frameless Magnetic Whiteboards Custom Sized Frameless Whiteboards Custom Printed Magnetic Leaderboards Custom Printed Leaderboard Leaderboard Name Strips Whiteboard Magnetics Custom Magnets Standard Magnets MagNotes Visual Thinking Solutions Visual Thinking Products MagNotes & Sticky Notes AV Conferencing Tools Featured product ThinkingWall ® Divider View Featured product ThinkingWall ® Freestander View Projects News Shop Printed Whiteboards and Leaderboards Collaboration Tools AV Conferencing Tools Magnotes & Sticky Notes Magnets Pens Cleaning Visual Thinking Products Contact Search +44 (0) 1756 792300 Home | Shop | Visual Thinking Solutions | Visual Thinking Products | Whiteboard Process Tool Kits | Team Board Team Board £ 105.00 Lightweight double-sided magnetic dry wipe team board 800mm x 630mm. Supplied in professional carry case with hand and shoulder straps. (total weight: 2.75kg). Special Requirements Quantity Add to basket Category: Whiteboard Process Tool Kits Description Reviews (0) Product Description Lightweight double-sided magnetic dry wipe team board 800mm x 630mm. This is slightly broader but shorter than A1 size. Supplied in a professional carry case with hand and shoulder straps. (total weight: 2.75kg). Reviews There are no reviews yet. Be the first to review “Team Board” Cancel reply You must be logged in to post a review. You may also like Team Modeller Enquire now Hook-Up Portable Whiteboards Enquire now Custom Printed Portable Whiteboards Enquire now Logovisual have previously supplied whiteboard panels for our London office, so when we needed whiteboards for a room at our head office we got in touch. The end result looks good – many thanks. ADRIAN SHAH-CUNDY, VOLKER WESSELLS All looks fantastic thank you!! The guys were a pleasure to meet and it was all so hassle free. CHARLOTTE WALTERS, TUNGSTEN NETWORK Commissioned Logovisual to design and install a folding wall in one of our technology rooms. Both our company and the NHS Trust were absolutely delighted with the installation a first for all. PETER SALT, IMMERSIVE Clear and prompt communication throughout and a very smooth installation process. Nothing was too hard. Highly recommended! TRACEY COVE, STEVENS & COVE Excellent, high quality product, purchased after wise advice and installed quickly by friendly installers. Perfect product for our meeting room needs. MIA ELLIOTT, DIOCESE OF GUILDFORD The board looks great! And I’d like to say your installers were absolutely fantastic, so friendly, organised and cleaned up. JESS MARTIN, VAYNERMEDIA Logovisual really understood our brief and made some great suggestions to make our designs come to life. They helped us bring a child’s game from a small tin to a life size piece of experiential, for us to take in to store at John Lewis. Everyone loved it. Thank you guys. TAMARA SPURWAY, WILD & WOLF As a product, they really provide a varied functionality to aid in our brainstorming and project works. These mobile whiteboards have really been an excellent investment and are immensely popular with our staff. SEBASTIAN FRANCIS-JONES, C SPACE The whole process from start to finish was excellent and the final product was second to none. Highly recommend Logovisual and the team and will be using them again very soon for the next project. LYNNE BRODA, OXFORD CARTOGRAPHERS The install was fab the guys were excellent and we all love the wall, so much in fact we are thinking of future projects including them. Once again can’t thank you enough for a great thorough service. ZOE HARRIS, CBRE GLOBAL INVESTORS Logovisual had as I believed to be the simplest and hassle free job on the project, install of white boards. They were in and out within 3 hours, a job well done! THE PROJECT TEAM, OVERBURY PLC The product itself is superbly built and easy to manoeuvre around with the attached wheels. From the office team’s communication before our event to the delivery team’s installation and pickup I found everyone to be really helpful and very professional going out of their way to meet our deadlines. I would certainly recommend logovisual. SHAUN O’HARA, SAATCHI & SAATCHI WELLNESS We were looking for a new “canvas” to share information and encourage joint thinking. The Thinking Wall turned out to be the perfect solution. There’s room to be expansive and for things to have real impact. The service we received right from our first enquiry, to installation (very fast, very painless) has been excellent. STEPHEN CROWE, SCOTTISH FUNDING COUNCIL We were pleased with the high level of customer service, our order was dealt with quickly and efficiently and we are thrilled with the finished product. The custom whiteboards that are exactly as we had envisaged them. STEVE CROSTHWAITE, HOTSPUR PRIMARY SCHOOL Just wanted to thank you again for your help, had a small amount of feedback from our client: Whiteboards are superb. Even better than expected! LEE, IDEA UK DESIGN & MARKETING The products look amazing and your team were clean, tidy and considerate. MARTIN HASSALL-LEES, PLACES FOR PEOPLE Useful links Terms & Conditions Privacy Policy Artwork requirements Shop online Shop My account Basket Checkout UNIT 5B AIREDALE BUSINESS CENTRE MILLENNIUM ROAD SKIPTON BD23 2TZ +44 (0) 1756 792300 © Logovisual Ltd 2025 | Terms & Conditions | Privacy Policy | Website by PS Website Design We use cookies on this website, by continuing to browse the site you are agreeing to our use of cookies. Find out more ."
    },
    {
      "url": "https://www.partyslate.com/venues/pavillion-grille",
      "text": "Pavillion Grille | Boca Raton Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Pavillion Grille Find Venues / Florida / Boca Raton / Pavillion Grille Unclaimed Pavillion Grille 301 Yamato Rd, Boca Raton, FL 33431, USA Request info Favorite Owner hasn't claimed this business If you own this business, claim your profile to update information, add photos, and more. Claim Profile Overview Gallery 1 About Pavillion Grille Pavilion Grille in Boca Raton Florida is known for great Restaurant Food and Special Celebrations.\nThe perfect place for your Wedding, Bar/Bat MItzvah, Sweet Sixteen, Fund-raiser or Corporate Event or other Special Celebrations.\n\nPavilion Grille is one of South Florida’s favorite Restaurants and Destination Venues for Dining, Music and Special Celebrations. Pavilion Grille was rated “Best Food” on a Wedding Episode of hit TLC show “Four Weddings” and has many “Five Star Reviews” on Wedding and Special Occasion Websites. Please consider us for your next Special Celebration. Call us at 561-912-0000 to plan your private event.\nWe are located in a spectacular four story, airy indoor office building Atrium with tropical fountains, walls of windows, a canopy-covered 2,000 sq. ft. Dance floor and an amazing Lighting System and parking for 200 cars.\nWe are open for Lunch and Happy Hour Tuesday through Fridays and Dinner from Tuesday through Saturday.\nOur Lunch menu features a variety of Salads and Sandwiches and our amazing Hamburgers and a variety of Entrees.\nJoin us for Dinner in our Atrium Tuesdays, Fridays and Saturdays and some other nights of the week and listen and Dance to the best local bands for Oldies, Latin, Doo-Wop and Motown music.\nPlease check our Calendar in advance for our music schedule and to see if we are open due to all of our private parties!\nCome for Dinner and try our most sought after Sonoma Salad , Asian Salmon Salad and our Eggplant Rollatini. Dinner Entree favorites include our Orange Glazed Atlantic Salmon, our Chicken or Eggplant Parmigiana, our Sirloin Steak and Braised Lamb Shanks. Favorite Desserts include our Homemade Tiramisu, our Chocolate Fudge Cake and Double Chocolate Mousse Cake.\nBring a group to celebrate Birthdays, Anniversaries, Club or Singles Events and enjoy your Dinner in our Atrium or in our private Grille Room. Ask us for our special Banquet Buffet or Plated Dinner options.\nPlease check our calendar on www.paviliongrille.com for our Entertainment schedule and blackout dates due to being closed for private parties.\nVisit our photo and video gallery for photos and videos of our Restaurant and visit our Facebook photos and Pinterest for photos of Entertainment events and Party Decor. Pricing Packages Pavillion Grille hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Map 301 Yamato Rd, Boca Raton, FL 33431, USA Follow Us Visit Website Call If you own this business, claim your profile to update information, add photos, and more. Claim Profile Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://pavilionrecruitment.com/contact-us/",
      "text": "Contact Us - Pavilion Recruitment About us Meet the team Join our team Job search Specialisms Solutions Career advice Talk to us Contact Us You can contact us by phone and email, or request a callback from the team using the form below. Send us a message via the form below, or contact us Full name Phone number Email address Message I consent to the conditions. Email us 0203 764 2350 Follow us on LinkedIn Find us Brighton Office 1 Queen Square Brighton BN1 3FD United Kingdom Horsham Office Springfield House Horsham RH12 2RG United Kingdom Diversity Statement Click here to read our Diversity & Inclusion Policies View our D&I policies We are here to help. Looking for some specific advice or want to discuss your options? Get in touch with our expert team today. Contact us contactus@pavilionrecruitment.com +44 (0) 203 764 2350 For Employers About us Talk to us Specialisms Solutions Diversity & inclusion For Candidates Job search Career advice Specialisms Testimonials Insights & Updates General About Us Specialisms Testimonials Insights & Updates Diversity & inclusion Sign up to our newsletter for exclusive updates and industry insights. Your email Pavilion Recruitment Solutions Ltd 2025 Terms Privacy Policy Cookies"
    },
    {
      "url": "http://www.pavilioninv.com/sub/our-team.php",
      "text": "Pavilion About Us Our Team Notice Contact Us Insight About Us Our Team Notice Contact Us Insight OUR TEAM OUR TEAM Founder & Group Chairman Young-Gak (Ken) Yun Chairman, Pavilion Private Equity Seung-Ho Hur Founding Partner & CEO, Pavilion Private Equity Hyung-Jin (Bryan) Park CEO, Pavilion Advisors Young-Joon Hong, CPA (US) Co-Founder & Managing Partner, Pavilion Global Holdings Corp. & Pavilion Private Equity Board Director & Investment Committee Member, Marunouchi Innovation Partners John-Paul P. Yun Managing Director, Pavilion Private Equity Jinhwan Kim Executive Director, Pavilion Private Equity Christopher Won Kang Vice President, Pavilion Private Equity Martin Hyunsub Sim Senior Associate, Pavilion Private Equity Yeomyeong (Paul) Kim Associate, Pavilion Private Equity Sungmin Kim Associate, Pavilion Private Equity Connor Kunwoo Lee Analyst, Pavilion Private Equity Kevin Youngjoon Park Managing Director, Europe/MENA, Pavilion Private Equity Dr. J. Michael Zahrt Ph.D. Global Strategic Advisor, Pavilion Global Holdings Corp. Michael Pitsinos Managing Director, Europe/MENA, Pavilion Private Equity Dr. Ha-Sung (Howard) Chung Ph.D. Young-Gak (Ken) Yun Founder & Group Chairman Mr. Yun, Is Founder and Group Chairman of Pavilion Global Holdings Corp. (“Pavilion”) and Founding Chairman of Pavilion Private Equity, a strategic partnership between Pavilion and Mitsubishi Corporation. He is former Chairman of KTB Private Equity, Founder and former Group Chairman of KPMG Korea (Samjong KPMG), and former member of KPMG International Global Board of Directors. In 1990, Mr. Yun founded Samjong Corporation, which formed a partnership with Houlihan Lokey during the Asian financial crisis to play an active role in the extensive restructuring process of the Korean banking industry. Samjong subsequently became a member firm of KPMG in Korea. Over the span of twenty years of his leadership, Samjong grew into one of the largest professional services firms in Korea, employing over 2,700 professionals with over $300MM in annual revenue. Mr. Yun is the recipient of the Korean government’s “Silver & Bronze Tower Industrial Medal” from the Korean government, being the first recipient from the non-manufacturing sector. In 2009, he was recognized as the “Best Korean CEO” by the Korea Economic Daily Business, as well as one of the “Top 30 Korean Business Leaders” by the MK Economy News.  In 2010, he was awarded the “Talent Management Award” by The Korea Economic Daily. In 2011, Mr. Yun was awarded the “Forbes CSR Award”. In 2011 and 2012, Mr. Yun was selected as one of “The Most Powerful Business Leaders in Korea” by Fortune Magazine. Among his many directorships, advisory, honorary and benevolent activities, Mr. Yun served as the Honorary Consulate of Ukraine and St. Vincent and the Grenadines, member of the Accepting House Committee for the 17th President Myung-Bak Lee, Chairman of the University of Pennsylvania and Duke University Korean Alumni Association, Vice Chairman of the University of Chicago Korean Alumni Association, Board Director of SsangYong Motor Company, Board Director of the Seoul Philharmonic Orchestra, Chairman of The Seoul City Government Sharing Economy Promotion Committee, Senior Advisor of Fosun Group, Board Director of Institute of Global Management (IGM), CEO Professor of Graduate School of Business Ewha Women’s University, Advisory Council Member of Seoul National University Graduate School of Business, Member of the Financial Services Commission ‘Financial Hub Committee’, Member of the Internal  Evaluation Committee of The Ministry of Foreign Affairs and Trade, Board Director of The UN Global Compact Korea Association, Board Director of The Asia Society Korea, Board Chairman of Enactus Korea, Member of the World Economic Forum Global Agenda Council, Board Director of The Hope Institute, Board Director of Arumjigi Culture Keepers Foundation, Chairman of Pan-Impact Korea, Member of the Far East Asia Economic Development Committee for the Korean government, and Chairman of Seoul South Rotary Club. Mr. Yun is currently Honorary Life Member of the Board of Visitors of Duke Law School, Advisory Board Member of the Duke University Global Capital Markets Center, University of Pennsylvania Asia Leadership Committee Member, Senior Advisor of Barun Law, Board Director of Hanmi Pharmaceutical, Board Director of Sookmyung Women’s University, Chairman & Senior Partner of FRA Korea, Vice Chairman of The Platform For Tomorrow, Chairman of The Asia Future Institute. Mr. Yun has also established and serves as Chairman of the Board of MYSC (Merry Year Social Company), which helps social enterprises with management consulting and funding support. Mr. Yun earned BA in Economics from The University of Pennsylvania, an MBA from The University of Chicago, and a JD and LLM from Duke Law School. Mr. Yun is a certified public accountant and an attorney at law in the State of New York. Seung-Ho Hur Chairman, Pavilion Private Equity Mr. Hur joined Pavilion Private Equity (PPE) in 2023 after an illustrious career in the automotive industry spanning over thirty-five years.  Prior to joining PPE, Mr. Hur served as Chairman of the Board and Executive Vice Chairman & CEO of Daewon Kang Up Co., Ltd., Chairman of Jiangsu Daewon Asia Automobile Spring Co., Ltd., President of Daewon Asia Automotive Science & Technology Co., Ltd., and CEO of ContiTech Daewon Airspring Systems Co., Ltd.  Mr. Hur also served as Board Director of Daewon America, Inc., and Daewon India Autoparts Pvt Ltd. Daewon Kang Up was founded in 1946 by Mr. Hur’s grandfather and has become the leading automotive parts manufacturer supporting the growth of Korea’s automotive and industrial equipment industries. Mr. Hur received a BBA from Seoul National University and an MBA from George Washington University. Mr. Hur is also the recipient of the “Iron Tower Industrial Medal” from the Korean government. Hyung-Jin (Bryan) Park Founding Partner & CEO, Pavilion Private Equity Prior to joining Pavilion Private Equity, Mr. Park served as Senior Managing Director at KTB Private Equity, one of the oldest and largest private equity firms in Korea. He was the Division Head responsible for deal origination, structuring, funding, and portfolio company management.  Prior to joining KTB PE, Mr. Park served as Managing Director at ConneX Partners (current E-Eum Private Equity), a local private equity firm where he was responsible for deal sourcing, structuring, funding and managing three funds totaling $180 million. Mr. Park held various management positions at KPMG, PwC, AT Kearney, and Oliver Wyman. He has specialized in management consulting and PMI (Post Merger Integration) strategy for numerous projects involving financial restructuring. He has also held position at Korea Long Term Credit Bank, conducting treasury trading, fund administration, and credit analysis. Mr. Park received an MBA and a BA in German Literature from Seoul National University. Young-Joon Hong, CPA (US) CEO, Pavilion Advisors Prior to joining Pavilion Private Equity, Mr. Hong served as President for 4 years at The Code F & I, an investment advisory firm providing M & A advisory services. Prior to The Code F & I, Mr. Hong was a Managing Director at Connex Partners (current E-Eum Private Equity), a local middle market private equity firm where he was responsible for structuring, funding, and managing portfolio companies. Mr. Hong held various positions at Daegu Bank and Shinhan Investment Corporation, focusing on syndication and M & A. Mr. Hong spent 7 years at Ernst & Young Korea where he served as Manager of the transaction services M & A advisory team in charge of due diligence and valuation services. Mr. Hong received a BBA from Hanyang University. John-Paul P. Yun Co-Founder & Managing Partner, Pavilion Global Holdings Corp. & Pavilion Private Equity Board Director & Investment Committee Member, Marunouchi Innovation Partners Prior to joining Pavilion, Mr. Yun was a Vice President at PineStreet Group, a Seoul based private investment firm in charge of overseas business and deal origination. Prior to PineStreet, Mr. Yun was a Senior Analyst at Samjong Investment Advisory, the investment advisory arm of KPMG Korea, responsible for origination, fundraising, and  structuring of alternative investment portfolios. Prior to Samjong, Mr. Yun was as an Analyst at Mitsubishi Corporation responsible for North American steel projects and M & A activities in the Tokyo headquarters, and subsequently became an Associate for Mitsubishi International Corporation in New York City, responsible for principal/alternative investments and business development for the North American market. Prior to Mitsubishi, Mr. Yun was as an analyst at The Chart Group, a middle market private equity firm based in New York City. Mr. Yun also serves as Vice Chairman of the Silk Road Chamber of International Commerce Korea Chapter, and Senior Advisor of Afiniti (Korea), a US based AI and data analytics company. Mr. Yun received an MBA from MIT Sloan School of Management-Tsinghua University School of Economics and Management and a BA in International Business and Economics from Sophia University. Mr. Yun is fluent in Korean, English, French, Japanese, and conversant in Mandarin. Seukhoon Paul Choi Partner, Emerging Tech & Defense, Pavilion Global Holdings Corp. S. Paul Choi ( 최석훈 ) helps lead Pavilion’s emerging tech and defense practice and is an expert in defense, international security, and strategic advisory. His extensive background in policy, alliance management, and geopolitical risk uniquely positions Pavilion to capitalize on opportunities within the defense sector, offering a strategic advantage to both investors and portfolio companies. With over 15 years of experience in political-military affairs, international security, and strategy design, Mr. Choi served as an international relations expert at the United Nations Command / Republic of Korea-US Combined Forces Command, where he contributed to strategic initiatives, operational planning, and policy formulation. He has provided counsel to senior executives in finance, industry, government, and the militaries of South Korea, the United States, and other partner countries. At the Council on Foreign Relations and the RAND Corporation, he led research projects focused on evolving security dynamics and alliance management. Mr. Choi served as an officer in the ROK Army and on faculty at the Korea Military Academy. Mr. Choi also serves as Principal of StratWays Group, a Seoul-based strategic advisory that provides guidance on market expansion, business development, and partnerships within both commercial and defense-related sectors. He holds an MA in International Cooperation from Seoul National University and a BA in Philosophy, Politics & Economics from the University of Pennsylvania, with a PhD in War Studies from King’s College London expected in December 2024. Jinhwan Kim Managing Director, Pavilion Private Equity Prior to joining Pavilion Private Equity, Mr. Kim was a Senior Consultant at Ernst & Young Korea, where he has provided transaction advisory services including commercial & financial due diligence, and valuation services. Mr. Kim began his career as an Associate Consultant at Valtech consulting Korea, a branch of the Paris based management consulting firm, where he has conducted numerous corporate strategy consulting projects focusing on cost & performance improvement, commercial excellence, and new business development. Also Mr. Kim has provided BPR (Business Process Reengineering) advisory services to major government organizations, such as Ministry of Justice and Department of Public Health and Welfare. Mr. Kim received a BA in Economics from The University of Vermont. Mr. Kim is fluent in Korean and English. Christopher Won Kang Executive Director, Pavilion Private Equity Prior to joining Pavilion, Mr. Kang served as Investment Manager at Seoul-based real estate investment firm, Mastern Investment Management, where he focused on leading and managing extensive review processes for overseas infrastructure and real estate investment opportunities. Prior to Mastern Investment Management, Mr. Kang was a Manager at Hana Financial Investment, focusing on equity and debt investments for offshore real estate and infrastructure. As part of the Alternative Investment Division at Hana, Mr. Kang successfully closed over $380MN construction loan of hotels and office buildings in New York City. Prior to Hana Financial Investment, Mr. Kang was an Assistant Manager of the Alternative Investment Division at DB Financial Investment where he was responsible for origination, fundraising, and structuring of alternative investment portfolios. Mr. Kang received a BA in Economics from the University of California, Los Angeles (UCLA). He also served as Sergeant of The Republic of Korea Army Special Forces Special Operations Division (“Black Berets”). Mr. Kang is currently a Master Candidate of Energy and Environment Policy from Korea University Graduate School of Energy and Environment. Martin Hyunsub Sim Vice President, Pavilion Private Equity Before joining Pavilion Private Equity, Mr. Sim served as Senior Manager at Simone Investment, a Seoul-based private equity firm.  He was responsible for deal sourcing, fundraising, and managing portfolio companies.  Prior to joining Simone Investment, he worked as a Business Strategy Analyst at TMON where he specialized in setting out business strategies for new ventures.  He also started his career at Vancouver-based asset management firm, Euromerica Investment.  He provided his service as an Analyst for various commodities and assets for the company. He received a BA in Economics from Simon Fraser University, Burnaby Canada. Yeomyeong (Paul) Kim Senior Associate, Pavilion Private Equity Mr. Kim is a distinctive professional with a diverse background in intelligence, international trade, and advanced research in informatics and psycholinguistics. He began his career in public service and foreign trade in his early twenties and quickly distinguished himself through academic excellence and practical contributions to high-level negotiations, generating multimillion-dollar outcomes. He later pursued further education, earning a Master of Public Administration (MPA) from the Seoul National University (SNU) Graduate School of Public Administration. With a strong interest in international law and finance, Mr. Kim has served as a market analyst at Hana Financial Group and as a risk manager at December & Company, an AI-driven robo-advisory firm, before joining Pavilion Private Equity. Mr. Kim’s leadership and achievements have been formally recognized with a commendation from the Mayor of Seoul, underscoring his impact in both the public and private sectors. Sungmin Kim Associate, Pavilion Private Equity Prior to joining Pavilion Private Equity, Mr. Kim was an Assistant Manager at Pavilion Asset Management (current Kyobo AIM Asset Management). Mr. Kim was responsible for a variety of tasks in several divisions, including data center, hedge fund, and real estate finance. Mr. Kim graduated from School of International Liberal Studies, Waseda University. Mr. Kim is fluent in Korean and English. Connor Kunwoo Lee Associate, Pavilion Private Equity Mr. Lee joined Pavilion Private Equity in 2021. He is an Associate of the investment team at the firm. Prior to joining Pavilion, Mr. Lee worked as an investment team intern at Skylake Investment Co. and IMM Investment Corp. based in Seoul. Before that, he worked as an acquisition financing team intern at Yuanta Securities Korea based in Seoul. Mr. Lee received a BA in Economics from Sogang University with the highest honors. Kevin Youngjoon Park Analyst, Pavilion Private Equity Mr. Park joined Pavilion Private Equity in 2023 and now working as an analyst in the investment team. Prior to joining Pavilion, Mr. Park did an  internship at December & Company as a member of alternative investment team. December is an asset management company that manages portfolios through their AI engine. Prior to joining December, Mr. Park did an internship at KIMC, a start-up accelerator company in Hanoi. Dr. J. Michael Zahrt Ph.D. Managing Director, Europe/MENA, Pavilion Private Equity Based in Frankfurt, Dr. Zahrt has broad finance experience and specializes in acting for private equity sponsors, family offices, strategic clients and financial investors on leveraged finance acquisitions and refinancing. Dr. Zahrt´s areas of practice also include acting for corporates on acquisition financings, IPO facilities and general corporate financings. Prior to joining Pavilion, Dr. Zahrt worked for a major German law firm as co-head with a particular industry focus on technology, media and telecommunications. He studied law, Russian and history at Eberhard KarlsUniversity of Tübingen, Philipps University Marburg and at University of St. Gallen Executive School of Management, Technology and Law (ES-HSG). Dr. Zahrt is fluent in German, English, and Russian. Dr. Zahrt is also admitted to the German Bar. Michael Pitsinos Global Strategic Advisor, Pavilion Global Holdings Corp. Michael Pitsinos is an economist and entrepreneur based in New York City. With vast experience in enterprise management, banking, and hospitality, he provides strategic advisory services to investment groups in a broad range of industries including telecommunications, oil, hotel, and F & B. Michael currently serves as the global advisor for Pavilion Global Holdings Corp. headquartered in Seoul, Korea, and is a partner in the Grace Hospitality Group with offices in Los Angeles and New York. Michael previously served the Secretariat of the United Nations in the Department of Public Information, where he reported on the daily activities of the General Assembly and the Security Council. Michael also worked in corporate banking at Citibank and JP Morgan Chase before joining Bareburger, a sustainable and organic restaurant chain with franchises worldwide. Michael holds an MBA and BA. Dr. Ha-Sung (Howard) Chung Ph.D. Managing Director, Europe/MENA, Pavilion Private Equity Prior to joining Pavilion, Dr. Chung was an Attorney¬-at-Law with Freshfields Bruckhaus Deringer, a leading international law firm and founder and CEO of janolawAG, a leading legal technology firm in Germany. Dr. Chung advised multinational companies in M & A and other corporate finance transactions and successfully accompanied high tech startups from set up through growth phase and internationalizing to IPO. Dr. Chung studied philosophy, English literature, German literature, Chinese and law in Berlin, Freiburg and Tübingen, received PhD in law from University Tübingen and is admitted to the German Bar. Dr. Chung is fluent in German, Korean, English, French, and conversant in Mandarin. 이용약관 개인정보처리방침 주소 : 서울특별시 종로구 율곡로 6, A동 15층(중학동, 트윈 트리 빌딩) 이메일 : hsshin@pavilioninv.com Copyright © Pavilion Global Holdings Corp. All rights reserved. 02-3775-3050"
    },
    {
      "url": "https://www.davidelvis.com/events/pavilion-grille-1",
      "text": "Pavilion Grille - DavidElvis.com DavidElvis.com Home Events Biography Members Gallery Contact Us Music Player Song List Testimonials External Link External Link DavidElvis.com Home Events Biography Members Gallery Contact Us Music Player Song List Testimonials External Link External Link Home Events Pavilion Grille Pavilion Grille Sorry, registration has ended. (FRIDAY) Join us for a fun night of dancing music with David Morin Elvis, lot's of dancing space and great food. Date: 8/5/2022 08:00 PM Location 301 E Yamato Rd, Boca Raton, FL 33431\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t( Map ) More Info: 561-912-0000 DavidElvis.com Copyright © 2025 All rights reserved Home Events Biography Members Gallery Contact Us Music Player Song List Testimonials External Link External Link 954-805-2984 - AlwaysTCB DM Inc. davidmorin@bellsouth.net"
    },
    {
      "url": "https://houseofpavilion.com/about-us/",
      "text": "About Us - Pavilion Ministries Skip to content About Us Who We Are Our Beliefs Pastoral Staff Ministries Ministries & Outreach Every Child Matters Street Ministry Natural Hair Care Workshop Trauma Healing Group Just Say Know Drug Education Who Is Jesus? Online Giving Contact About Us Who We Are Our Beliefs Pastoral Staff Ministries Ministries & Outreach Every Child Matters Street Ministry Natural Hair Care Workshop Trauma Healing Group Just Say Know Drug Education Who Is Jesus? Online Giving Contact Facebook Instagram About Us The distinguishing characteristics of the Pavilion Church are based on four foundational truths found in Jesus’ prayer in John 17. Jesus breaks the prayer down into four integral categories: Relationships John 17: 1-5: God in Him, He in us—that we would know Him. Verse 5: \"And now, oh Father,\nglorify Me together with Yourself, with the glory which I had with You before the world was.\" Leadership John 17:6-10:  Jesus gave His leadership to His disciples through relationship. Verse 6: \"They were Yours, You gave them to me, and they have kept Your word.\" Truth John 17: 11-19: We are sanctified (consecrated, holy) by the truth (God's Word), as He shared it with the disciples. Verse 17: \"Sanctify them by Your truth. Your word is truth.\" Love John 17: 20-26: The world would believe, through the disciples' words and experience of walking with Jesus, the importance of the unity of love. Verses 23-25: \"I in them, and You in Me, that they may be made perfect in one, and that the world may know that You have sent Me, and have loved them as You have loved Me.\" We, as the Pavilion Church, believe that: Love is the first foundation—learning to love unconditionally as God loves us Truth is specific in the Word of God, as Jesus said in John 14:6, \"I am the way, the truth, and life. No one comes to the Father except through me.\" Leadership starts with family, our jobs, schools and other areas of influence Relationship is the fulfillment of love, truth and leadership. Relationships are the ultimate purpose of life. Our Beliefs are rooted in God’s Word: About the Bible, 2 Timothy 3:16 The 66 books of the Old and New Testaments are God’s Holy Word and are the complete and divine revelation of God to man revealing God’s plan for His people and how to live out that plan and they contain all things necessary for salvation. About God, Exodus 20:1-6 There is one God who is the creator, sustainer and sovereign ruler of all things visible and invisible The Godhead/Triune God eternally exists in three persons, distinguishable, yet inseparable – the Father, the Son and the Holy Spirit and are coequal and one God having the same nature and attributes In the Father is the unseen God; in the Son is God revealed, the form of God in man; in the Spirit is the indwelling God – God within us What God the Father has purposed, the Son has procured for us and which takes effect through the operation of the Holy Spirit About Jesus Christ, John 1:1-3 He is truly God and truly man, in whom the divine and human natures are perfectly and inseparably united He was born to a virgin woman, Mary, conceived by the power of the Holy Spirit By the shedding of His blood, He redeemed all who believe in Him, bearing all sin – past, present and future by His crucifixion on the cross He was buried and rose from the dead, being victorious over sin and death He is the only means for salvation, by faith believing that Jesus is the Son of God and that His death and resurrection provide the only means for forgiveness of sins, reconciliation with God, and obtaining eternal life He is seated in Heaven as our Great High Priest, Advocate and Mediator who intercedes with God for us He will return to judge all humanity, claim His church and establish a new kingdom About the Holy Spirit, John 14:15-17 He is one in being with the Father and the Son • He is the power of God dwelling in the human body and working in it what the Father and Son have for us He provides believers with the understanding of spiritual truths He guides believers spiritual growth into a deeper understanding of their identity in Christ, leading them to reach the fulfillment of God’s purpose for their lives About Salvation, 1 Peter 1:3-5 It is a gift from God and is received by grace through faith in the redeeming action of the death and resurrection of Jesus Christ It is obtained only through grace (also a gift of God), not by any action of self-effort It requires repentance – a willful change of mind and genuine sorrow for and confession of sins which the believer is made aware of through the operation of the Holy Spirit Repentance leads to regeneration, being born again, a new creature in Christ Justification is being washed clean of all our sins, “just as if I had never sinned”, bringing us into a relationship of peace and favor with God Sanctification is the ongoing process of being transformed toward spiritual maturity About Water Baptism, Acts 2:38 Baptism is administered by immersion in water in the name of the Father, Son and Holy Spirit It fulfills the command of Jesus in Matthew 28:19 It is an outward testimony of the washing away of sin and freedom from the power of sin It signifies the dying to self and the new birth in Jesus Christ About Baptism in the Holy Spirit, Acts 19:2-6 Baptism in the Holy Spirit is a real and distinct experience at, or subsequent to, salvation It can be evidenced by the speaking in other tongues as the Holy Spirit gives utterance It is the “promise of the Father” fulfilled on the Day of Pentecost, which empowers believers to become effective witnesses for the risen Christ It opens the door for us to enter into God’s supernatural realm of signs, wonders and miracles About Communion, Matthew 26:26-29 Christ instituted Communion at the last supper He ate with His disciples The bread represents His body being broken and that in Him we are made whole The wine represents the blood He shed for the forgiveness of our sins, “the new covenant in My blood” It can be partaken by those who have faith in Jesus Christ as their personal Lord and Savior It represents the greatest expression of God’s love for His people About the Gifts of the Holy Spirit, 1 Peter 4:10 The nine supernatural gifts of the Holy Spirit as listed in 1 Cor. 12-14. The five leadership ministries as given in Eph. 4:11-13 These gifts are operational in the church today and are necessary to equip God’s people for the work of the ministry About Divine Healing, Isaiah 53:5 Deliverance from sickness is provided for in the atonement when Jesus took on all our sicknesses and diseases through His death on the cross In answer to believing prayer, the healing of the physical body and deliverance from demonic oppression by God’s power in Jesus’ name is as valid today as it was in the early church About the Second Coming of Christ, Revelation 19:11-21, 20, 21:1-8 The rapture of the church will be accomplished when Christ returns, fulfilling His words in John 14:3 In that visible return, He will raise the dead, judge the world, separate the righteous from the wicked, bring peace to the nations and establish His millennial reign on earth and, eventually, His eternal kingdom About Satan, Ezekiel 28:12-18, Isaiah 14:12-14, Revelation 12:3-9 He was created by God as an angelic being, led by pride to rebel against God and was cast from heaven to earth with other angels (now demons) who rebelled with him He is the great adversary of God and humanity, working to oppose the will of God He is limited by the sovereign rule of God He will be vanquished at the end of time and be banished for eternity along with his demons into the Lake of Fire About Eternal Life, John 3:36 The soul exists for eternity, either in relationship with God or being separated from Him • Eternal relationship with God is given through Jesus Christ Everlasting life in Heaven with God is granted to the redeemed and everlasting punishment for the unredeemed About Marriage, Genesis 1:26-28 God ordained marriage to be the union of one man and one woman in covenant commitment for a lifetime It is God’s unique gift to reveal the union between Christ and His Church It provides the framework for the man and the woman for intimate companionship, the channel of sexual expression according to biblical standards and the means for procreation of the human race About the Church, Ephesians 1:22-23 We are the church, an assembly of professed believers in the Lord Jesus Christ, who is head over all things pertaining to it We, as the church, are called to serve Christ by reaching out to the lost, sharing the gospel/good news, meeting together in His name for baptism, communion, worship, praise, prayer, fellowship and discipleship As Christ came to serve, His church body exists to serve one another and the external communities in which they live and work Visit Us 1790.5 Cleveland Avenue, Columbus, OH 43211 Service Times Join us for Worship, Prayer and Praise every Thursday @ 7pm! Resources Give online Ministries & Outreach Who is Jesus? Pastor Sharon Stewart-Alexander Connect With Us Stay up to date with our latest news, ministry events, and more. Facebook Instagram Envelope © 2025 Pavilion Ministries. Website by Bryckroad Creative"
    },
    {
      "url": "https://www.washingtonpavilion.org/about/contact-us/",
      "text": "Contact Us - Washington Pavilion Skip to content The second floor of the Kirby Science Discovery Center is temporarily closed for renovation. All other floors are open — come join the fun! Learn More About About Services Newsroom Contact Us Careers Careers Volunteer Donate Donate Thirty by 30 Endowment Campaign Legacy Giving Program Thank You Events & Tickets Back Events & Tickets Broadway Shows BACK TO THE FUTURE: The Musical DR. SEUSS’ HOW THE GRINCH STOLE CHRISTMAS! THE MUSICAL MRS. DOUBTFIRE MOULIN ROUGE! The Musical Clue Meredith Willson’s THE MUSIC MAN Subscription Options Other Events Concert Comedy Family Holiday View All Events Events & Tickets Corporate & Group Discounts Ticket Safety and Buying Policy Digital Ticketing Digital Playbills October 14 - October 19 Buy Tickets December 23 - December 27 Buy Tickets January 30, 2026 - February 1, 2026 Buy Tickets Learn More About Subscriptions Plan Your Visit Back Plan Your Visit Plan Your Visit Everything you need to know before you go! See our rates, get directions, find parking and more. Learn More Hours Hours are subject to change. For the most up-to-date information, please contact the 3e Encore Guest Services at 605-367-6000. Become a Member Unlock a world of exclusive perks and unforgettable experiences as a Washington Pavilion member. Plan An Event Have an important event coming up? Hosting your special family or corporate event at the Washington Pavilion is the perfect way to go! Performing arts, visual arts, interactive science and educational opportunities — all under one roof. Learn More Attractions Back Attractions Attractions Visual Arts Center Eight spacious art galleries exhibit works from local creators and international art legends, as well as a focus on Northern Plains Tribal art. Kirby Science Discovery Center With more than 100 interactive, hands-on exhibits, the Kirby Science Discovery Center offers an incredible array of fun and educational activities for all ages, but especially for kids! Wells Fargo CineDome & Sweetman Planetarium The Washington Pavilion is home to one of the most advanced planetarium systems in the United States. The WP Café The Washington Pavilion’s café offers a quick business lunch during your workday, or refuel and savor a great-tasting, affordable meal during your museum exploration. Parlour Ice Cream Parlour features gourmet ice cream, fresh popcorn, candy and cold beverages on the 2nd floor of the Kirby Science Discovery Center. The Washington Pavilion is the region’s home for the arts, entertainment, and science. Attractions Programs Back Programs Programs Kid & Family Programs Join us for a variety of fun activities and demonstrations throughout our museums. Youth Camps and Classes Fun, educational activities for ages 3-18! Learn more about our year-round program offerings. Art for Adults Our educational programming isn't just for kids. Join us for grown-up fun! For Educators Planning a field trip or special event for your class? Look no further! We have numerous engaging and inspiring science exhibits, performances, art and science programs and large format films will help supplement your curriculum. Spotlight Theatre Company Spotlight Theatre Company provides outstanding learning, performance and outreach opportunities for young people ages 6-18 to excel in the performing arts. Graham Academy Preschool Our preschool program for ages 3-5 focuses on the whole child, including social, emotional, academic and creative learning. All of the Pavilion's unique resources are a part of our school day, making Graham Academy the ideal place for early learning Join us for an exciting new season from Spotlight Theatre Company, featuring six incredible youth theatre productions! Buy Subscription Washington Pavilion Contact Us First Name (Required) Last Name (Required) Email (Required) Phone How can we help you?* (Required) How can we help you?* Tickets Membership Plan an Event Sponsorship Camps & Classes Other Comments (Required) Promotional Emails Sign me up for promotional emails from the Washington Pavilion Comments This field is for validation purposes and should be left unchanged. Washington Pavilion 301 S Main Ave Sioux Falls, SD 57104 (605) 367-6000 info@washingtonpavilion.org Washington Pavilion 301 S. Main Ave. Sioux Falls, SD 57104 Contact Us (605) 367-6000 info@washingtonpavilion.org Stay Connected 3e Encore Washington Pavilion Orpheum Theater Center The Lodge Lallycooler Music Festival Alcove ©2025 Washington Pavilion. All rights reserved.\n                                                            | Privacy Policy | Ticket Policy Washington Pavilion Management, Inc. is a private, 501(c)3 not-for-profit organization. Washington Pavilion Management, Inc. takes no position on the performances, events and artworks presented, and does not endorse any views expressed. The statements, views, positions and opinions presented in content, materials and artworks are those of the authors, artists and event organizers."
    }
  ]
}