{
  "fuentes": [
    {
      "url": "https://www.tbnweekly.com/business/article_f173012e-459a-11e9-b905-6b8d1ebf4d75.html",
      "email": "editorial@tbnweekly.com"
    },
    {
      "url": "https://www.tbnweekly.com/business/article_f173012e-459a-11e9-b905-6b8d1ebf4d75.html",
      "email": "ester@localshops1.com"
    },
    {
      "url": "https://www.tbnweekly.com/business/article_f173012e-459a-11e9-b905-6b8d1ebf4d75.html",
      "email": "jessica@tampabaybeaches.com"
    },
    {
      "url": "https://www.tbnweekly.com/business/article_f173012e-459a-11e9-b905-6b8d1ebf4d75.html",
      "email": "mreddington@clearwaterflorida.org"
    },
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "email": "enquiries@displaysuk.co.uk"
    },
    {
      "url": "https://www.dartmoorbrewery.co.uk/pages/contact-us",
      "email": "ale@dartmoorbrewery.co.uk"
    },
    {
      "url": "https://www.bgsu.edu/recwell/wellness-connection/paws-team.html",
      "email": "joeyjo44@yahoo.com"
    },
    {
      "url": "https://www.bgsu.edu/recwell/wellness-connection/paws-team.html",
      "email": "pfh@bgsu.edu"
    },
    {
      "url": "https://www.bgsu.edu/recwell/wellness-connection/paws-team.html",
      "email": "recwell@bgsu.edu"
    },
    {
      "url": "https://www.bgsu.edu/recwell/wellness-connection/paws-team.html",
      "email": "wellness@bgsu.edu"
    },
    {
      "url": "https://getpubpass.com/blogs/behind-the-beer/q-a-with-pinellas-ale-works",
      "email": "pubpass-logo_2x_f24951e0-c930-4d87-8f84-025e211fcc48_110x@2x.png"
    },
    {
      "url": "https://www.pawschicago.org/about-us/leadership/professional-board",
      "email": "professionalboard@pawschicago.org"
    },
    {
      "url": "https://www.pawschicago.org/about-us/leadership/professional-board",
      "email": "professionalboard@pawschicago.org"
    }
  ],
  "mails": [
    "ale@dartmoorbrewery.co.uk",
    "editorial@tbnweekly.com",
    "enquiries@displaysuk.co.uk",
    "ester@localshops1.com",
    "jessica@tampabaybeaches.com",
    "joeyjo44@yahoo.com",
    "mreddington@clearwaterflorida.org",
    "pfh@bgsu.edu",
    "professionalboard@pawschicago.org",
    "pubpass-logo_2x_f24951e0-c930-4d87-8f84-025e211fcc48_110x@2x.png",
    "recwell@bgsu.edu",
    "wellness@bgsu.edu"
  ],
  "nombre_sitio": "pawbeer.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tbnweekly.com/business/article_f173012e-459a-11e9-b905-6b8d1ebf4d75.html",
      "text": "Pinellas Business Notebook: Arkane Aleworks named best small brewery in Florida | Business | tbnweekly.com Skip to main content You have permission to edit this article. Edit Close More Local News Business Schools Health Pets Outdoors Faith and Family Opinion Letters to the Editor Editorials Columnists Photo Galleries Announcements Anniversaries Engagements Weddings Obituaries Special Sections Summer Lifestyles Just for Women Fix It or Sell It Active Living Holiday Gift Guide Welcome Back Back to School Discover Pinellas Coastal Living Outdoor Living Just for Families Classifieds Place an Ad Local Events Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Home About Us Contact Us Advertise with Us! Personnel Pinellas County Crime, Crashes and Fires Beaches St. Pete Beach Madeira Beach Indian Rocks Beach Treasure Island Redington Beach Redington Shores Indian Shores Belleair Belleair Bluffs Belleair Beach Clearwater Safety Harbor Dunedin Largo Seminole St. Petersburg North County Dunedin Palm Harbor Pinellas Park Tarpon Springs Oldsmar Diversions Local Events Museums, Stage & Theater Movie News & Reviews Music & Concerts Classifieds Site search Search About Us Contact Us Personnel Advertise with Us! e-Edition Delivery Facebook Twitter Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout 88° Partly Cloudy Largo, FL (33778) Today Partly cloudy. A stray shower or thunderstorm is possible. Low 73F. Winds NE at 5 to 10 mph.. Tonight Partly cloudy. A stray shower or thunderstorm is possible. Low 73F. Winds NE at 5 to 10 mph. Updated: September 10, 2025 @ 4:04 pm Full Forecast Site search Search Menu Toggle navigation Home About Us Contact Us Advertise with Us! Personnel Pinellas County Crime, Crashes and Fires Beaches St. Pete Beach Madeira Beach Indian Rocks Beach Treasure Island Redington Beach Redington Shores Indian Shores Belleair Belleair Bluffs Belleair Beach Clearwater Safety Harbor Dunedin Largo Seminole St. Petersburg North County Dunedin Palm Harbor Pinellas Park Tarpon Springs Oldsmar Diversions Local Events Promote Your Event Museums, Stage & Theater Movie News & Reviews Music & Concerts Classifieds Pinellas Business Notebook: Arkane Aleworks named best small brewery in Florida Mar 13, 2019 Mar 13, 2019 Facebook Twitter WhatsApp SMS Email The crew at Arkane Aleworks celebrates winning the 2019 Best Small Brewery in Florida at the annual Best Florida Beer Championship in Tampa on March 3. Photo courtesy of ARKANE ALEWORKS Facebook Twitter WhatsApp SMS Email Print Copy article link Save LARGO — Arkane Aleworks captured the 2019 Best Small Brewery in Florida at the annual Best Florida Beer Championship in Tampa on March 3. The Largo brewery was awarded four medals for their beers, and this is the second consecutive year that Arkane has received the award after winning three gold medals in 2018. Arkane also earned the title of third best brewery overall at Cigar City Brewing's Hunahpu's Day. AchieveHERs to host Women Sharing Wisdom luncheon, panel discussion DUNEDIN — AchieveHERs, the business women’s networking group of the Clearwater Regional Chamber of Commerce, will host the next event in its Women Sharing Wisdom luncheon series Thursday, March 28, 11 a.m. to 1 p.m., at Bon Appetit Restaurant, 148 Marina Plaza, Dunedin. “Life Cycle Part II: Women and Transitions, That Was Then, This Is Now,” a panel presentation, is the second part of a series that digs deep into the issues that affect women in their professional and personal lives. Four dynamic women, at very different points in their journeys, will share perspectives and retrospectives on how they juggle priorities among self, career, home and that elusive state called “life balance.” When the path got tough, each called upon her concrete will to summon the courage to succeed. Panelists will include Christina Capri, vice president of commercial banking, Synovus; Ashley Lowery, president and CEO, Homeless Empowerment Program; Kathy Rabon, CFRE, CFRM, executive director, Suncoast Hospice Foundation; and Anna Leo Holder, MBA, vice president of Client Services, Frank Crum. Cost is $50 for members and $55 for nonmembers. To register, visit clearwaterflorida.org/achievehers . For information, email mreddington@clearwaterflorida.org or call 727-461-0011, ext. 229. LocalShops1 to present St. Pete Tiny Home Festival ST. PETERSBURG — LocalShops1’s second annual St. Pete Tiny Home Festival will be presented Saturday and Sunday, March 23-24, 10 a.m. to 6 p.m., at St. Petersburg College’s Allstate Center, 3200 34th St. S., St. Petersburg. For event information, visit www.tinyhomestpete.com . The festival will showcase model homes by professional builders, custom-made homes, “skoolies” and van conversions built by talented enthusiasts who travel the country showing off their creations. Altogether, more than 30 tiny structures and 50 local food trucks, mobile boutiques, artists, home-related businesses and restaurants are expected at the festival. In just its second year it has grown to be the largest tiny home festival anywhere on the U.S. Gulf Coast and second largest in the entire state of Florida. A special event feature is a lineup of two dozen leading experts in the tiny house movement giving practical advice on living green, decluttering your current residence and building your very own tiny home. Additional features include an environmentally conscious water station by Chart 411 and a wine and beer garden by the Skyway Marina District. The festival is a production of LocalShops1, and sponsored by Skyway Marina District, Chart 411, Historic Shed, Tiny House Advisor and Leaf Filter. Event tickets and marketing opportunities are available. Visit www.tinyhomestpete.com or email ester@localshops1.com for information. Robin Miller joins Creative Pinellas board of directors ST. PETE BEACH — Robin Miller, president and CEO of the Tampa Bay Beaches Chamber of Commerce, recently was appointed to the 2019 board of directors for Creative Pinellas. Creative Pinellas, a nonprofit local arts agency, holds a mission to sustain the creative communities that make Pinellas County a great place to live and experience culture. Miller has 11 years of experience with Pinellas County businesses. She brings with her the strong ability to build and grow organizations from the ground up. At the chamber, part of her job is to lead entire operations for financials, management, PR, sales, marketing, events, and government relations. For information, email Jessica Morrow at jessica@tampabaybeaches.com or visit TampaBayBeaches.com . Manager becomes owner of Clearwater auto repair shop CLEARWATER — Ice Cold Air Discount Auto Repair recently named Dennis McBride as the new franchise owner at the Clearwater location on Court Street. McBride has served as manager of several Pinellas County Ice Cold Air locations in the 10 years he has worked for the company. He has over 25 years of experience in the automotive industry. “I’ve been thinking about becoming an owner for a while now,” McBride said in a press release. “I just wanted it to be the right shop. I think this is one of the best locations in the company. It is certainly one with the longest history of serving our loyal customers.” The location has been an Ice Cold Air since the 1970s. American Freedom Distillery to take part in D-Day celebration ST. PETERSBURG — American Freedom Distillery, a St. Petersburg-based craft distillery of American-made premium spirits, was recently invited to the celebration of the 75th anniversary of D-Day and the Battle of Normandy. Team American Freedom, as the brand has named themselves for the event, will parachute into the historic drop zones of Normandy, along with an airdropped barrel of Horse Soldier Bourbon. The official D-Day anniversary jump will take place June 5. Team American Freedom will be the lead aircraft during the airborne operations on June 5, making them among the first to land in the drop zone locations. To prepare, the team is holding practice parachute jumps in North Florida in the town of Palatka using the historic C-47 Tico Belle, the same plane that dropped the brave men into Normandy 75 years ago. The first practice jump will be held in March. “Our brand was founded by a team of former Special Forces members, so it’s an incredible honor to be invited to this celebration as a brand, but also as veterans and represent our country and brethren of past, present,” said Scott Neil, co-founder and former Green Beret. “This is a unique, once in a lifetime opportunity for us and it’s incredible to not only be invited to participate in the 75th anniversary, but to be the lead aircraft for the reenactment of airborne celebrations.” Fastow, Drake join Bizco Technologies CLEARWATER — Bizco Technologies recently welcomed Brandon Fastow, systems engineer; and Charles Drake, remote systems engineer, to the Clearwater team. Fastow and Drake bring over 20 combined years of experience in managed IT services. “I am excited to have the opportunity to join this dynamic and growing company and team,” said Drake. “I am looking forward to develop and maintain successful relationships with our all our clients that will streamline, secure, and improve their overall internal efficiency,” Fastow added. Bizco’s engineering team provides local clients with advanced network management and security solutions. This gives each client the ability to promptly address technical concerns remotely, or on-site. To submit business news, email editorial@TBNweekly.com . Submissions also may be faxed to 727-397-5900, dropped off at the office or mailed to Tampa Bay Newspapers, 9911 Seminole Blvd., Seminole, FL 33772. Please include contact information on all submissions. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Tags Arkane Aleworks Achievehers Tiny Home Festival American Freedom Distillery Latest News We Belong Here reveals lineup for inaugural Tampa Bay festival Around town: Belleair news briefs Around town: Beaches news briefs Around town: Clearwater news briefs Around town: Largo news briefs Most Popular Articles Images Articles Pinellas beach renourishment continues Pinellas Suncoast fire chief takes on challenges Pedestrian killed in US-19 crash Family sells Bay Pines Marina after more than 50 years Loyal customers bankrolled their favorite restaurant’s resurrection Pinellas school district, teachers at odds over raises Tarpon Springs Sponge Docks Craft Festival continues to grow Around Town: South Pinellas news briefs Music Scene: Upcoming concerts and musical performances around Tampa Bay St. Petersburg’s Obama Main Library is reopening this month Images This week's edition Palm Harbor, Safety Harbor & Oldsmar Beacon To view our latest e-Edition click the image on the left. St. Petersburg Beacon | West To view our latest e-Edition click the image on the left. St. Petersburg Beacon To view our latest e-Edition click the image on the left. Dunedin & Clearwater Beacon To view our latest e-Edition click the image on the left. Seminole & Beach Beacon To view our latest e-Edition click the image on the left. Belleair & Largo Bee To view our latest e-Edition click the image on the left. Special Sections Retirement Living To view our latest e-Edition click the image on the left. High School Football Season Preview To view our latest e-Edition click the image on the left. Just for Families To view our latest e-Edition click the image on the left. Upcoming Events Stocks Market Data by TradingView Sections Home Pinellas County Beaches Greater Belleair Largo Seminole North County More Local Content Diversions Local Events Announcements Obituaries Opinion Multimedia Online Features Services Submission Forms Classifieds Place an Ad Promote Your Event Search Weather Legal Notices Contact Information tbnweekly.com 12945 Seminole Blvd. Largo, FL 33778 Phone: 727-322-6900 Email: webmaster@tbnweekly.com Follow Us Facebook Twitter × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 TBNweekly 12945 Seminole Blvd., Largo, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital ."
    },
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "text": "Staff Photo Boards For Schools & Business This site is best viewed with javascript enabled. For help enabling javascript please click here . search close Search Quote ( 0 ) Checkout 0 item s £ 0.00 Home Products Exhibition Stands Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays See all Outdoor Displays Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers See all Display Cases Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases See all Exhibition & Display Boards for Hire or Rent Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire See all Leaflet, Brochure, Menu & Card Holders Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders See all Banner Stands Pull Up Roller Banners Double Sided Pull Up Banner Stands Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays See all Counters & Plinths Portable Counters & Workstations Promotion / Demonstration Counters Lectern Test Category Pedestals See all Noticeboards & Whiteboards Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards See all Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Lightboxes Dibond Signs See all Display Boards Folding Display Boards Folding Screen Room Dividers Panel and Pole Display Boards Display Board Accessories See all Specialist Displays Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture See all Perspex Cut To Size Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size See all About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Quote ( 0 ) 50,000+ products in stock 1,000 stock product lines with over 50,000 products in stock Custom made displays Rapid delivery on custom made Perspex acrylic displays Next day delivery Next day delivery on many products if ordered by mid day UK Manufacturer Many of our products are made in our own UK factory Cutting edge technology Experts in printed acrylic panels - any size, any shape menu close Products Exhibition Stands Back All Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays Extra Wide & Linked Banner Stands Outdoor Displays Back All Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers Outdoor Display Counters Outdoor Custom Printed Chairs Display Cases Back All Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Glass Display Cases Bespoke Acrylic Display Cases Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases Exhibition & Display Boards for Hire or Rent Back All Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire Exhibition Counters for Hire Banner Stands for Hire Leaflet, Brochure, Menu & Card Holders Back All Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders Rotating Brochure Holders Greeting Card Displays Business Card Holders Banner Stands Back All Pull Up Roller Banners Double Sided Pull Up Banner Stands Replaceable Cassette Roller Banners Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays Banner Stand Accessories Tension Banner Stands Counters & Plinths Back All Portable Counters & Workstations Promotion / Demonstration Counters Lectern Media Cabinets Test Test category for acrylic pedestals Test Category Pedestals Noticeboards & Whiteboards Back All Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards Freestanding / Mobile Noticeboards Whiteboards Glass Noticeboards Flipcharts & Easles Outdoor Noticeboards Acrylic Noticeboards Pinnable Noticeboards Write On Glassboards Signage & Perspex Frames Back All Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Staff Photo Boards Lightboxes Dibond Signs Printed Foamex Signs Site Safety Signs Snap Frames Sign Fittings & Accessories Hoarding Panels Acrylic Awards and Trophies Acrylic Noticeboards Printed Correx Signs Retail & Point Of Sale Printed Plywood and Wood Display Boards Back All Folding Display Boards Folding Screen Room Dividers Aluminium & Graphic Folding Display Boards Panel and Pole Display Boards Office Screens Display Board Accessories Specialist Displays Back All Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture Educational Furniture & Displays Social Distancing Screens Printed Outdoor Garden Art Garden Mirrors, Outdoor Mirrors & Illusion Mirrors Acrylic Photo Prints Shed, Playhouse, Greenhouse Windows Eco Lawn Edging From Recycled Plastic Decorative Garden Wall Panels Garden Structures, Gazebos, Arbours & Swings Garden Ornaments & Planters Acrylic Photo Prints Perspex Acrylic Splashbacks Perspex Cut To Size Back All Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size Perspex Acrylic Grey 9981 Cut To Size Perspex Acrylic Yellow 260 Cut To Size Perspex Acrylic Red 4415 Cut To Size Perspex Acrylic Orange 363 Cut To Size Perspex Acrylic Red 431 Cut To Size Perspex Acrylic Red 433 Cut To Size Perspex Acrylic Violet 886 Cut To Size Perspex Acrylic Green 6T81 Cut To Size Perspex Acrylic Green 650 Cut To Size Perspex Acrylic Blue 727 Cut To Size Perspex Acrylic Blue 750 Cut To Size Perspex Acrylic Blue 744 Cut To Size Perspex Acrylic Clear Frost S2 000 Perspex Acrylic Glass Look 6T21 Cut To Size Perspex Acrylic Silver Mirror Perspex Acrylic Blue Mirror 2069 Perspex Acrylic Purple Mirror 102 About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Home Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Staff Photo Boards For Schools & Business Staff Photo Boards For Schools & Business £ 36.30 ex. VAT £ inc.VAT Options Colour: Black Back Panel White Back Panel Clear Back Panel Clear Frost Back Panel Coloured Back Panel 2: 2: Qty Add to basket Get a quote Staff Photo Notice Boards - Perspex Acrylic Staff photo notice boards, or \"Meet The Team\" boards are a perfect way of letting people know who's who in a school, NHS Wards, general office and commercial workplace, recreation centres, reception areas, etc. Each clear pocket allows a small photo of a relevent member of staff. Options available include: choice of back acrylic colour, the number of photo pockets. We also offer a secure, tamper proof version, please click here for further details. NEW! We can now offer staff boards with your name and logo printed directlty to the top of the display - call for details. Features and Benefits: Please double click on the above images of our acrylic staff photo boards to zoom into a more detailed view Staff photo boards provide a professioal looking wall mounted display panel for quick reference of staff / team members Choice of black, white, clear or clear frost 5mm thick acrylic back panel with polished edges. Corners are rounded with no sharp edges Clear acrylic photo pockets allow staff photos to be changed quickly and easily Supplied with 4 polished sign fittings to give that floating effect off a wall Each photo pocket size is 75mm high x 50mm wide Header panel pocket is 260mm wide x 50mm high Please see the table below for our standard sized staff photo boards. We also manufacture custom sized boards if you require different sized pockets or different quantities of pockets - please call us on 01202 480104 for further details. Staff photo board prices are detailed in the drop down menu at the top of the page. Manufactured to order in our factory in Christchurch, Dorset, UK. Please allow 5 working days for delivery Please see our stand off fittings instructions by clicking here Looking for a a more secure staff photo board which can't be tampered with? Check out our Secure Staff Photo Boards ! Looking for a staff photo board with a different coloured back panel? We have a range of colours available other than our standard colours listed! Please contact us for a quote. Looking for a staff photo board with bespoke printing and branding to suit your business? With state of the art printers, we are able to fully print or brand these staff boards with your logos and messages! If this is something you are interested in, contact us for a quote! Code Photo Pockets Frame Size Width x Height (mm) SB10 10 430mm x 325mm SB20 20 430mm x 515mm SB30 30 500mm x 610mm SB40 40 640mm x 610mm SB50 50 780mm x 610mm SB60 60 780mm x 705mm SB65 65 800mm x 740mm SB70 70 780mm x 800mm SB80 80 780mm x 895mm SB100 100 780mm x 1085mm SB120 120 920mm x 1085mm SB140 140 1060mm x 1085mm SB160 160 1200mm x 1090mm Displays UK provide daily deliveries to most towns and cities in the UK including: Christchurch, Poole, Bournemouth, Swanage, Dorchester, Ferndown, Shaftesbury Sherborne Sturminster Newton Swanage Weymouth Ringwood New Forest Fordingbridge Salisbury Thank you for visiting our website Product Code: 64674569876345 Specification Code 64674569876345 Style Staff Photo Board Location Wall Mounted Weight 10.000 Kg Secured by sagePay Pay with PayPal Pay with Mastercard Pay with Visa × Items Quick basket Newsletter Signup Submit Exhibition Stands Outdoor Displays Display Cases Exhibition & Display Boards for Hire or Rent Leaflet, Brochure, Menu & Card Holders Banner Stands Counters & Plinths Noticeboards & Whiteboards Signage & Perspex Frames Display Boards Specialist Displays Perspex Cut To Size Displays (UK) Limited Displays UK are located in Christchurch, on the Hampshire / Dorset border. We are a proper 'bricks and mortar' manufacturing business not just another internet retailer. Read more… Head Office Units 16-18, 12 Airfield Road, Off Airfield Way, Christchurch, Dorset, BH23 3TG Tel: 01202 480104 Email: [email protected] Connect with us DISQ Display Innovation Service Quality Displays (UK) Limited registered in England and Wales with company number 8896740 and registered address Bank Court, Manor Road, Verwood, Dorset, BH31 6DY. VAT number GB980855382 © Displays (UK) Limited 2025 / Website by Adido / Terms & Conditions / Privacy / Sitemap"
    },
    {
      "url": "https://www.dartmoorbrewery.co.uk/pages/contact-us",
      "text": "Contact Dartmoor Brewery Skip to content Free UK Delivery over £40 icon-X \"Close\" icon-X Close menu HOME BUY ONLINE ABOUT US NEWS TRADE CONTACT US SPECIAL EDITION BEERS DARTMOOR BEER FINDER GIFT CARDS Log in instagram Instagram Facebook twitter Twitter Cart icon-X Close cart Order note Subtotal £0.00 Shipping, taxes, and discount codes calculated at checkout. Check out Your cart is currently empty. icon-hamburger Site navigation BEERS GIFTS JAIL ALE account Log in icon-search Search icon-cart Cart Search Search ARE YOU OVER THE AGE OF 18? We have to ask - it's the law 🍺🍺 By entering, you confirm you’re over 18 and agree to our Terms of Use . No Yes Sorry, we're not for you just yet Sorry, the content of this store can't be seen by a younger audience. We'd love you to come back when you're older. Oops, I entered incorrectly BREWED ON DARTMOOR CONTACT US We’d love to hear from you! Whether you have a question, feedback, or just want to say hello, our team is here to help. Our Details Address: Dartmoor Brewery Station Road Princetown Devon PL20 6QX Phone: 01822 890789 Email: ale@dartmoorbrewery.co.uk Get in Touch Feel free to reach out to us using the contact form below, or drop us a line via email or phone. We’ll get back to you as soon as possible. Name Email Message Send Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. NEWS ABOUT US GIFT PACKS TRADE POLYPINS & MINI CASKS CONTACT US TERMS AND CONDITIONS DELIVERY INFORMATION CHARITY SUPPORT GREEN CREDENTIALS What's Brewing What's Brewing Stay in the loop with all things Dartmoor Brewery — think latest beers, specials and product drops. Only the best stuff! Over 18's only! Enter your email Subscribe icon-email Subscribe instagram Instagram Facebook twitter Twitter Dartmoor Brewery Station Road Princetown Devon PL20 6QX 01822 890789 ale@dartmoorbrewery.co.uk Registered in England, No. 02909638 Website Development by Epicure Creative American Express Diners Club Discover Maestro Mastercard PayPal Shop Pay Union Pay Visa © 2025 Dartmoor Brewery Powered by Shopify icon-X \"Close (esc)\" icon-chevron-left icon-X icon-chevron icon-X Contact Dartmoor Brewery"
    },
    {
      "url": "https://www.bgsu.edu/recwell/wellness-connection/paws-team.html",
      "text": "BGSU PAWS Therapy Dog Team Skip to main content Toggle high contrast We use cookies to provide you with the best experience and to help improve our website. View Privacy Statement Understood PAWS Therapy Dog Team Skip To BGSU Site Navigation Student Wellness Presentations Wellness Ambassadors Well-Being Programs PAWS Therapy Dog Team Mental Well-Being Sexual and Reproductive Health Access Information Sexual Health Sexual Health Education and HIV/STI Testing Alcohol Education Green Dot Cargo Bike Special Events Student Wellness Network Spring Break Checklist Sexual Assault Awareness Month 5K and Dog Walk Stall Talk Clean Air Policy Resources Safe Communities of Wood County About Top Hits Home Membership Fitness Passes Aquatics Intramural Sign-Ups Club Sports Employment Student Employment Practicum Positions and Internships Graduate Assistantships Student Employee Board Student Employee Awards Additional Resources The RecWell Wire - Blog BGSU Events Calendar General Information Staff Directory Parking Comments Social Media Rules and Regulations Perry Field House 801 N. Mercer Road, BG, OH 43403 P: 419.372.9900, F: 419.372.8044 Student Recreation Center 1411 Ridge Street, BG, OH 43403 P: 419.372.2000, F: 419.372.8454 Membership Programs Fitness Group X Schedule #MOVE4YOURMOOD Older Adult Fitness Personal Training Assessments and Services Falcon Fitness Staff Aquatics Aquatics Home Learn to Swim First Aid and CPR Certification Lifeguarding Certification Intramurals and Club Sports Intramural Sports Intramural Fields Club Sports Climbing Wall Climbing Wall Home Team Building Student Employment Undergraduate Employment Opportunities Graduate Assistantships Awards Student Employee Board Well-Being Programs Well-Being Home Well-Being Coaching Move for your Mood Mindfulness Strive for Five Well-Being Room Martial Arts Studio Youth Activities Youth and Family Summer Programming Birthday Parties Learn to Swim Office of Health and Wellness Health and Wellness Home Presentations Wellness Ambassadors PAWS Team Therapy Dogs Sexual Health Education and HIV Testing Alcohol Education Cargo Bike Student Wellness Network Special Events Mental Well-Being Program Policies Services General Services Fitness Assessments Personal Training FREE and Confidential HIV Testing Wellness Presentations Certifications Adult and Pediatric First Aid/CPR/AED Courses Lifeguard Training Courses Event Planning SRC Facility Rentals PFH Facility Rentals Outdoor Recreation Space Rentals Birthday Parties Team Building Employment Student Employment Graduate Assistantships Practicum Positions and Internships Student Employee Awards Facilities Student Recreation Center (SRC) SRC Home Hours Memberships Directions/Parking Pools Facility Rentals Climbing Wall Martial Arts Studio Perry Field House (PFH) PFH Home Hours Directions/Parking Facility Rentals Outdoor Recreation Spaces Intramural Fields Sand Volleyball Court Facility Rentals Facility Policies Partners Intercollegaite Athletics Home Page Calendar Staff Directory Tickets Shop Donate BGSU Cares Home Caught Caring Sexual Violence Prevention Alcohol Abuse Prevention Drug Abuse Prevention Suicide Intervention Offices and Departments Community Well-Being Counseling Center Diversity and Inclusion Health and Human Services Education and Human Development Division of Student Engagement and Success Falcon Health Center Safe Communities - Traffic Safety Home Seat Belt Usage Distracted Driving Impaired Driving Motorcycle Awareness Senior Citizen Safety Commercial Vehicle Awareness Pedestrian Safety Contact General Contacts Staff Comments BGSU Campus Calendar Policies Email RecWell Programs Aquatics Club Sports Employment Faculty and Staff Wellness Fitness Intramural Sports Student Wellness Youth and Family Perry Field House 801 N. Mercer Road, BG, OH 43403 P: 419.372.9900, F: 419.372.8044 pfh@bgsu.edu Student Recreation Center 1411 Ridge Street, BG, OH 43403 P: 419.372.2000, F: 419.372.8454 recwell@bgsu.edu Give My BGSU Email Exit\n\t\tNavigation Toggle high contrast Request a Therapy Dogs Visit ⮕ Open to students, faculty and staff. Become a PAWS Event Volunteer ⮕ Open to students, faculty, and staff. Become a PAWS Lead Volunteer ⮕ Open to students, faculty, and staff, who have previously volunteered with us at least 3 times. Join the PAWS Therapy Dog Team ⮕ Open to handlers and their dogs. BGSU PAWS Team BGSU Recreation and Wellness Student Wellness PAWS Therapy Dog Team The BGSU PAWS Team is a dedicated group of campus and community volunteers and certified therapy dogs. The team hosts events on BGSU campuses throughout the year and is also available by request. This program is part of the Office of Health & Wellness at BGSU and offers programing to support the BGSU community in all aspects of well-being. View our WBGU The Journal episode for an in-depth overview of the organization along with a few of our dogs and humans! Positive impacts of animal therapy: Reduced stress and anxiety Decreased feelings of loneliness, pain and fatigue Increased feelings of safety Decreased risk for cardiovascular disease Increased physical exercise PAWS stands for P artners in A chieving W ellness for S tudents, staff and faculty. All PAWS dogs are certified by the Alliance of Therapy Dogs . Certified therapy dogs must be friendly, patient, confident, gentle and at ease in all situations. PAWS Team Events Student Wellness Presentations Wellness Ambassadors Well-Being Programs PAWS Therapy Dog Team Mental Well-Being Sexual and Reproductive Health Access Information Sexual Health Sexual Health Education and HIV/STI Testing Alcohol Education Green Dot Cargo Bike Special Events Student Wellness Network Spring Break Checklist Sexual Assault Awareness Month 5K and Dog Walk Stall Talk Clean Air Policy Resources Safe Communities of Wood County Contact Us 214 Student Recreation Center 1411 Ridge Street Bowling Green, OH 43403 Phone: 419.372.9355 (WELL) Fax: 419.372.9454 wellness@bgsu.edu Attention BGSU Students ➔ Friends of the BGSU PAWS Team is a student-led organization made up by our Lead Volunteers. We meet once a month and focus on assisting the therapy dogs and their owners who visit campus, student volunteers, and campus partners. As a PAWS Lead Volunteer you get the opportunity to help staff events, run our social media accounts, and fundraise for the program. This is an integral role within the program which helps us improve the wellness of the BGSU community through our therapy dog program. Meet the Therapy Dogs Archie Breed: Portuguese Water Dog Birthdate: 9/16/2020 Family: Ron Z. Major: Doctor of Veterinary Medicine (D.V.M.) Clinical specialty, Residency in Neurological Conditioning & Training of my handler. Wellness Practices: Going for daily walks or runs with an occasional swim. I stick to a well-balanced diet and have 3 meals a day. Fun Fact: My breed was originally developed in the 1930s by Dr. Bensaude in Portugal. I only respond to Portuguese commands. Barli Breed: Bernedoodle Birthdate: 7/31/2021 Family: Jeffrey Major: Master of Science in Nutrition (Bulking) Wellness Practices: Relaxing! He loves to take naps with dad. Fun Fact: Barli weighs 146 lbs. Bella Breed: Australian Shepard Birthdate: 3/18/2021 Family: Krista H. Major: Physical Fitness and Toyology Wellness Practices: chasing golf balls, always playing with toys and trying to get her dog sister, Mya Mae to chase her in the yard. Bennington (a.k.a. Benny) George Breed: Newfoundland Birthdate: 01/17/2017 Family: Carol T. Major: Bachelor of Science in Public Relations. I am also a certified reading instructor and boat captain. Wellness Practices: I enjoy swimming, exploring for dropped food and lost toys on walks.  I also sing in a choir and I’m on the water polo team at Poco’s daycare. Fun Fact: My initials are B.G. and I am 165lbs. Check me out at the Wood County District Public Library helping with the PAWS Reading Program. Blaze Breed: Labrador Retriever Birthdate: 7/4/2017 Family: Laurie G. Major: Children/Teen Therapist Wellness Practices: gets plenty of sleep, exercises regularly. Fun Fact: gets along with everyone, loves to come to work with family. Bubbles Breed: Greyhound Birthdate: 07/30/2016 Family: Kim & Emily Social Media: Instagram – bubbles.therapy.dog Major: Bachelor of Arts in Relaxation with a concentration in 45mph Couch Potato Wellness Practices: I take extra naps and do lots of doggy yoga. Fun Fact: I am a retired racing greyhound. Check me out at the Wood County District Public Library with Paws for Reading. Cooper Breed: American Bulldog Mix Birthdate: 5/21/2021 Family: Roy and Angela Y. Major: Purveyor of Smiles Wellness Practices: Allowing people to give him pats. Dash Breed: Welsh Terrier Birthdate: 12/13/2014 Family: Sue S. Major: Dashing Wellness Practices: I like to eat, sleep, run around, greet neighbors, eat and sleep. Fun Fact: I am a Welsh Terrier, and 20 pounds of pure energy! I’m pretty smart and very stubborn, but my mom is the top dog in our house. My real name is Czar Dashing Bandit, but everyone just calls me Dash. My favorite thing to do is run with teenage boys. Dubh Breed: Border Collie Birthdate: 1/23/2021 Family: Pat Major: Masters in PE Wellness Practices: Playing outside! He loves to play frisbee as often as possible! Fun Fact: Dubh's name is Irish for the word black Gordie Breed: Labrador Retriever Birthdate: 3/3/2018 Family: Debbie V. Major: Social Worker with a Minor in Napping Wellness Practices: Gordie likes to go for walks and eats a healthy diet. He loves carrots and apples! Grace Breed: Golden Retriever Birthdate: 3/12/16 Family: Danielle Sidebottom, Kevin, Connor and Hope Major: Paw-sitive Psychology and Leisure Studies Wellness Practices: Boat rides, long naps, getting plenty of pets, and her monthly trips to the dog beauty parlor for a little pampering and beautification. Joey Breed: Parti Yorkie Birthdate: 04/04/2020 Family: Sue R. Social Media: Email - joeyjo44@yahoo.com Major: Bachelor of Art in It’s a Dog Life Wellness Practices: Although I love my treats, I limit them each day. I also do my daily exercise of chasing the ball to stay fit. Fun Fact: My first therapy visit was at BGSU in March 2022! Mack Breed: Saint Bernard Birthdate: 3/18/2021 Family: Sara D. Major: Bachelor of Arts in Mindfulness Wellness Practices: I enjoy nightly walks in the woods, snuggling my humans (especially my kids!), and enjoying the outdoors - snow, rain, or sun!! Millie Breed: Golden Retriever Birthdate: 06/21/21 Family: Carrie and Roger Social Media: goldengirlmillie.e Major: French and Philosophy Wellness Practices: Stuffie deconstruction and sleeping in! Fun Fact: Has two golden retriever brothers and she is the only one brave enough to swim! Mocha Breed: Chocolate Lab Mix Birthdate: 03/05/2019 Family: Joe & Bonnie F. Major: Bachelor of Science in Playing Wellness Practices: I go to annual visits to the vet. I eat lots of carrots and apple snacks. An apple a day keeps the vet away. And I remind my family repeatedly until I get my daily walk. Fun Fact: I love car rides and walks. My favorite time of day is mealtime, and an hour before, I start begging for my food. Oreo Breed: Chihuahua Mix Birthdate: August 19th Family: Chris & Garry W. Social Media: None. It’s a work in progress. Major: Pursuing his Master of Arts in Behavior Wellness Practices: I practice meditation. I may look asleep, but I am actually deep in thought. Fun Fact: I have a stroller decorated with Christmas lights in which I sometimes get to ride. Roger Breed: Golden Retriever Birthdate: 04/10/2014 Family: Carrie C. Major: Masters in Snoozing Wellness Practices: Lots of rest and leisurely strolls Fun Fact: I hate swimming and retrieving. Rosie Breed: Red Labrador Retriever Birthdate: 2014 Family: Jacquelyn R. Major: Making people happy Wellness Practices: Napping, snacking, and taking long walks Fun Fact: Rosie has had numerous litters of puppies! Schatzi Breed: German Shepherd Birthdate: 03/23/2023 Family: Emilio, Sarah, and my feline sisters Callie and Tippy Major: Psychpawlogy with a minor in Trickonometry Wellness Practices: I enjoy living in the moment, chillin' with my peeps, and running. Fun Fact: I see myself as a life long learner and would like to one day earn my dogtorate. Sochi Breed: Boykin Spaniel Birthdate: April 15th Family: Jean K. Major: Bachelor of Arts in Cuteness Wellness Practices: I take lots of naps! Fun Fact: I get VERY excited about chipmunks and sticks. I also know my right paw from my left paw. Willy Breed: Golden Retriever Birthdate: 12/05/2021 Family: Jim and Vicki Major: Tail Wagging and Napping Wellness Practices: Playing with my toys and running Fun Fact: I like to sing and my dad is Daniel the Golden Retriever Winner Sporting Dogs 2021. Classroom Hero Award Winner PAWS Team Advisory Group Member Profiles Jean Kitchen and Sochi received the Classroom Hero of the Month Award from BCAN/BCSN ! Congratulations to our own, Jean and Sochi for receiving the Buckeye Community Arts Network/Buckey Cable Sports Network Classroom Hero of the Month Award for November! We are so proud to have this amazing team as part of BGSU PAWS! Thank you for all you do, Jean & Sochi. Learn more about their award on the BSCN Classroom Heroes Website . Lex Blanton I grew up in the dog industry apprenticing under various nationally recognized trainers and participating in AKC & UKC junior handling events since early childhood. I have been competitive in dog shows for 15 years, putting numerous show & sport titles on both my dogs and client dogs. I have been employed as a professional trainer for 9 years, working with good manners clients, service dogs, therapy dogs, detection dogs, aggression cases, and more. I am a Certified Professional Dog Trainer - Knowledge & Skills Assessed through the CCPDT, a Zoom Room Certified Master Trainer, an IAABC behavior consultant, a Fear Free Certified Animal Trainer, a certified AKC Family Dog Evaluator, an ATD Therapy Dog Tester/Observer, and an active member of the Pet Professional Guild. At Zoom Room, we don't train dogs, we train the people who love them! We offer AKC S.T.A.R. Puppy, Obedience, Rally, Agility, Scent Work, Urban Herding, Flyball, Therapy Dog, Tricks, and Canine Conditioning classes in Perrysburg, OH. Zoom Room dog training classes are specially designed to encourage dogs to build confidence and success as they master new behaviors in a simple, step-by-step process. Our classes have skills-based graduation requirements to keep learning at your own pace. Every class is also offered multiple times each week so you can come as many or as few times as you want each week for additional instruction and practice. Cheryl Kubista I am the owner and Master trainer here at Talk Dog Toledo, LLC training facility.  I have been training dogs for the last 18 years here in the Toledo, OH area.  After completing a 4-week intense training program, I opened my own training company 2005. I have completed additional training over the years to further my skills.  I work with dogs of all ages, all breeds and all types of issues.  I offer private lessons, group classes and board and train options for clients. My group classes start with puppy kindergarten and go all the way up to therapy dog and service dog skills.  I work with my clients to make sure that they can achieve their dog training goals! I am also an AKC and CGC evaluator, an Alliance of Therapy Dogs tester and observer and a field rep for Paws with a Cause. I am a professional member of the IACP as well as the APDT. In Loving Memory Murphy , bichon frise, served as a therapy dog for over 17 years. In addition to supporting the BGSU community, Murphy also visited libraries, hospitals, nursing homes, and many other locations in the community. ~March 2005 – October 2023 Faith , a miniature American Shepard, was an amazing dog who loved spreading joy to others. She was born March 17th, 2013. Faith served as a medical service dog for 8 years prior to becoming a therapy dog. She knew over 130 commands and could read a command on a paper and then do the command. ~March 2013-April 2022 Brady was known around campus for his love of belly rubs. Brady loved to swim and go duck hunting. Brady had 7 titles including AKC Canine Good Citizenship Advanced. He started as a therapy dog in 2015 and did nearly 1000 visits. ~03/01/2012 – 05/16/2022 Updated: 08/05/2025 02:01PM Bowling Green State University Bowling Green, Ohio 43403-0001 419-372-2531 Make A Gift Accessibility including events Academics A-Z Links Campus Directory Consumer Information Employment Faculty/Staff Firelands Libraries Media Resources Nondiscrimination Parents and Families Students Technology Support Title IX Resources Toggle High Contrast SEE IT. HEAR IT. REPORT IT. It is the responsibility of each person within the university community to take action when an issue or concern arises. Report concerns or information of alleged misconduct"
    },
    {
      "url": "https://getpubpass.com/blogs/behind-the-beer/q-a-with-pinellas-ale-works",
      "text": "Q&A WITH PINELLAS ALE WORKS – PubPass Skip to content Home The Book Denver Des Moines Jacksonville Kansas City Madison Milwaukee Minneapolis/St. Paul New Orleans Northern Colorado Orlando Phoenix South Florida St Louis Tampa/St. Pete Washington D.C. The App About the App Participating Cities Frequently Asked Questions Download on the App Store Download on Google Play Gift a Subscription Merch PubPass Deer Shirt PubPass Tank Top PubPass Woman's Tank Top PubPass Bottle Opener PubPass Ceramic Mug PubPass Silicone Pint Glass PubPass Collapsable Dog Dish PubPass Sun Glasses PubPass Embroidered Deer Hat Home The Book The App Merch Account Cart Your cart is empty Home Home The Book Denver Des Moines Jacksonville Kansas City Madison Milwaukee Minneapolis/St. Paul New Orleans Northern Colorado Orlando Phoenix South Florida St Louis Tampa/St. Pete Washington D.C. The App About the App Participating Cities Frequently Asked Questions Download on the App Store Download on Google Play Gift a Subscription Merch PubPass Deer Shirt PubPass Tank Top PubPass Woman's Tank Top PubPass Bottle Opener PubPass Ceramic Mug PubPass Silicone Pint Glass PubPass Collapsable Dog Dish PubPass Sun Glasses PubPass Embroidered Deer Hat Now reading: Q&A WITH PINELLAS ALE WORKS Share Prev Next February 24, 2021 Q&A WITH PINELLAS ALE WORKS When it comes to award-winning beers and a die-hard love for dogs, it is hard to find a place that does it better than Pinellas Ale Works (PAW). As its initials would suggest, PAW is one of the most dog-friendly breweries in St. Pete with a dual mission of brewing doggone good beer and giving back to the community by hosting weekly and monthly events benefiting Pinellas County animal related charities. Read more on their taproom, beers and events on their website . Q. WHAT'S YOUR NAME? A. Michelle Appleyard Q. WHAT IS YOUR TITLE? A. Taproom Manager Q. HOW DID YOU COME UP WITH THE NAME OF YOUR BREWERY? A: During the build out, the owner always brought his dog, Jim to work with him. Jim was known as the \"brew dog\". We always knew we wanted to encompass our furry best friends into the brewery because there really isn't anything better than drinking beer and petting dogs! We decided on the name Pinellas Ale Works but, many just know us as 'PAW'. A place where dogs are always welcome and the beer is always flowing. Q. WHAT BEER/BRANDS INSPIRED YOU IN CREATING YOUR OWN BRAND? A. There is so much amazing beer out there! A few of our favorites that sparked our interest in opening up Pinellas Ale Works are Sierra Nevada and Cigar City. Q. WHAT IS YOUR BREWERY MOST KNOWN FOR? A. We are known for our wide variety of beer. We have over 40 taps of craft beer brewed on location. Try our GABF Silver Medal Winner Milk Bone Sweet Stout or our refreshingly hazy Puppy Love New England Style IPA. Q. THE ALIENS HAVE FINALLY HAD ENOUGH, YOU GET ONE LAST ITEM FROM YOUR BREWERY'S MENU BEFORE THEY EVAPORATE EARTH. WHAT IS IT? A. Our Shrimp and Risotto Bites! Wild caught gulf shrimp, Arborio rice, breaded and fried with honey habanero aioli. So delicious! and pairs great with our 'Off The Leash' American IPA. Q. WHAT BEERS ARE IN YOUR FRIDGE RIGHT NOW? A. We've got a great selection of beers to go including our Schwarzhound Black Lager, Puppy Love NESIPA, Milk Bone Sweet Stout, Pucker Pup Blood Orange Berliner, Price's Horchata Cinnamon and Vanilla Rice Ale, Fetch Session IPA, Thrill Hill Double IPA, Sit Amber Ale, Doberman Brown Ale, Piddle Pilsner, Harold's Lager and our Off The Leash American IPA. Q. WHAT IS YOUR GUILTY PLEASURE BEER(S)? A. Stouts! We love our Chocolate Covered Raspberry Stout and our Peanut Butter Pup. Q. WHAT DID YOU DO BEFORE YOU GOT INTO BEER? A. The owner, Dennis, was big into racing Motor Cross before his start in beer. He's still races and also owns bicycle's business back in his home town of New York. Q&A WITH CENTER ICE BREWING Q&A WITH LIQUID MECHANICS BREWING PubPass - Discover Better At PubPass, our guiding principle is Discover Better. We’re always on the lookout for places worth celebrating — and people worth sharing them with. Have a story to share? Tell us at hello@getpubpass.com Learn More About PubPass Become a Partner Location Charities FAQ Information Privacy Policy Terms of Use Join Our Mailing List Press Blog - Behind the Beer News © PubPass Powered by Shopify American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa"
    },
    {
      "url": "https://www.pawschicago.org/about-us/leadership/professional-board",
      "text": "Professional Board | PAWS Chicago Professional Board | PAWS Chicago Facebook Twitter Instagram Sign up Shop Home Our Work How To Help Events & Dog Training News & Resources No Kill Mission About Us Pet Adoption Pets Available Adopt a Cat Adopt a Dog Adoption Process Why Adopt Adoption Centers Adoption Events A Pet's Journey Through PAWS Ongoing Training & Support Recently Adopted Pets PAWS Alumni Spay/Neuter Lifesaving Impact Benefits of Spay/Neuter Lurie Clinic Feral Cats (TNR) Importance of Early Spay/Neuter Community Engagement PAWS for Life Outreach 360 at CACC Community Cats PAWS Chicago Magazine Crisis Support Giving Up Your Pet Crisis Foster Care Disaster Response Medical Center Volunteer Become a Volunteer Volunteer Opportunities Junior Volunteers Volunteers of the Month Volunteers of the Year Donate Your Giving Saves Lives Lifeline Monthly Giving Program Tributes and Memorials Corporate Giving Guardian Angel Other Ways to Give Create Your Own (CYO) Fundraiser Program Foster Become a Foster Resources for Fosters Become a Foster Parent Pets Available for Fostering Internships Fundraising Events 5K Walk/Run Animal Magnetism Beach Party Golf TEAM PAWS Chicago Fur Ball Community Events Pet Loss HEAL Support Group Junior Rescuers Youth Tours Dog Training Classes Meet the Trainers Training Center  FAQs News & Features PAWS Chicago News Animal Welfare For Your Pet PAWS Chicago Magazine For People Who Love Pets All About Dogs Doggy Basics Getting Started - A Guide for Bringing Home a New Dog Preparing Your Dog for a Change in the Family Understanding Dog Behavior Medical Care for Your Dog Providing for Your Dog Should Something Happen To You How Dogs Age Protocols Return to Routine All About Cats Kitty Basics Getting Started - A Guide for Bringing Home a New Cat Preparing Your Cat for a Change in the Family Understanding Cat Behavior Medical Care for Your Cat Providing for Your Cat Should Something Happen To You Cat Resources Two is Better than One Resources Chicago Area Animal Shelters Vet Care Partners Finding Your Lost Pet Helping a Stray or Lost Animal Coping with Pet Loss Hazardous Items for Pets About No Kill History of Sheltering The No Kill Revolution Defining No Kill No Kill Gold Standard The No Kill Model The Foundation - Community Engagement The Four Pillars A Model No Kill Community Building a No Kill Chicago Community Results to Date Animal Care & Control Results PAWS Chicago's Progression No Kill Policy Recommendations The Story Our History Timelines & Milestones Mission & Values Watch Our Story Results Adoption Program Spay/Neuter Data Community Engagement Financial Health and Sustainability Leadership Board of Directors Development Board Professional Board Media Center PAWS in the Media Media Archive Video Archive Close Menu Menu DONATE ADOPT Home Page About Us Professional Board Professional Board Joining forces to save lives. Professionals Making an Impact All Board of Directors Development Board Professional Board The PAWS Chicago Professional Board is a group of professionals, emerging in their careers in and around the Chicagoland area, who are passionate about saving homeless pets by way of their social and professional networks. Tasked with raising funds and awareness for PAWS Chicago’s life-saving work, Professional Board members are role models in the community and a lifeline to thousands of homeless pets. As advocates committed to PAWS Chicago’s No Kill mission, the Professional Board helps homeless animals through volunteering, fostering, planning the Board’s annual fundraising events, and engaging others to support our great organization. Raising Awareness & Providing Support Events Join the Board Meet the Professional Board Raising Awareness & Providing Support PAWS Chicago is one of the nation’s largest No Kill animal shelters, guaranteeing life to the nearly 6,000 homeless animals it rescues each year. The goal of making Chicago a No Kill city is only possible through the help of the animal-loving community, as our work is 100% reliant on the support of our community. Professional Board members are true ambassadors of PAWS Chicago and homeless animals, raising awareness by way of their social and professional networks. They serve as PAWS Chicago representatives at signature events each year by volunteering, fostering, planning the board’s annual fundraising events, and engaging others to support our great organization. In order to provide the vital support PAWS Chicago needs to continue their lifesaving programs, board members are asked to complete specific Board Requirements during each year of membership, including General, Program, Fundraising and Event Requirements. The Professional Board welcomes prospective members to any of their meetings. Locations vary but all meetings start with a networking hour at 5:30pm, meeting at 6:30pm, and follows with an optional post meeting social at 7:30pm. Our 2025-2026 dates are: Thursday, August 21, 2025 (deadline to RSVP is Sunday, August 17) Tuesday, September 30, 2025 (deadline to RSVP is Sunday, September 28) Thursday, November 19, 2025 (deadline to RSVP is Sunday, November 16) Wednesday, January 14, 2026 (deadline to RSVP is Sunday, January 11) Thursday, February 26, 2026 (deadline to RSVP is Sunday, February 22) Wednesday, May 6, 2026 (deadline to RSVP is Sunday, May 3) If you would like to attend a meeting as a guest, please email professionalboard@pawschicago.org for more information. Back to top Events Each year, the Professional Board hosts or takes part in several PAWS Chicago fundraising events, adoption events and lifesaving programs. Check them out: Animal Magnetism (April 10, 2026) Golf O pen (June 8, 2026) Beach Party (July 17, 2025) PAWS Chicago 5K (September 13, 2025) TEAM PAWS Chicago (year round) Nan & Wayne Kocourek Medical Center Days (September - April) Many more events! Back to top Join the Board The PAWS Chicago Professional Board is pleased to accept new members on an ongoing basis! Prior to joining the Professional Board, please review our annual Board Requirements . To begin the application process, download and complete the Professional Board Application . Once completed, send an email with the application and your resume and a PAWS Chicago representative will follow-up with you shortly. Prospective members are invited to upcoming meetings, social events and some volunteer opportunities. If you would like to learn more about upcoming events and be included on our guest list, please send an email to professionalboard@pawschicago.org .  If you have additional questions and would like to set up a time to talk with our Leadership Team members or staff lead, please email us at professionalboard@pawschicago.org . Back to top Meet the Professional Board Professional Board Executive Leadership Team Danielle Kroloff Alyssa Gregory Ryan Foreman Professional Board Members Nozi Afzali Amanda Antonini Taylor Atkins Sarah Atkinson Alison Baird Brooke Bandy Nicole Becker Patrick Beisell Kelly Bershader Beth Blackman Bethany Boggess Emma Boyer Elise Braun Jassica Brown Tiffani Caldwell Thomas Carlon Emily Caruso Michael Chester Camille Conlan Colleen Coyle Julianne Dailey Amy Davis Cameron Davis Cathy Davis Erich Deicke Claire Demos Natalie Dickson Ally Dinkle Lauren Easterday Morgan Eisenstein Chris Evans Emma Ewing Kristina Ferran Christine Filarski Amanda Ford Ryan Foreman Leah Frydman Tommy Garrett Charlie Gers Alyssa Gregory Cynthia Hamilton Kat Haney Emily Harkins-Widen Liam Heffernan Meredith Hein Brady Heller Griffin Herdegen Kiki Heron Jess Hout Sean Hwang Brittany Keegan Jennifer Keegan Matthew Kelly Madeline Kliebhan Annabelle Kline Jeremy Knapp Emily Kosmin Elizabeth Kostelny Danielle Kroloff Paige Krueger Catherine Kurtz Alonso Lam Catherine Lanchak Meghan Ledin Jacob Lending Kat Levitt Matthew Lewis Jack Lian Kyle Lindberg Amelia (Amy) Litterski Jessica Loftus Kristin Lordahl Brian Lucido Melissa MacNeur Mark Madden Catie Manganelli Jessica McKune Kelli Michaelis Nicole Minadeo Ashley Moody Mary Kate Napleton Alexandra (Ally) Neumann Riley O'Gara Caitríona Pagni Jeffery Pandolfino Pratik Patel Holly Pearson Alyssa Peer Patricia Pelaez Tess Perica Tyler Peterson Michelle Phanthongphay Katherine Racanelli Page Redding Dr. Lynessa Rico Katherine Riley Cassie Ringer Alexis Rosales Caroline Rothstein Sloane Rubin Nicholas Rubnitz Maya Rudolph Ellie Ryan John Ryle Taylor Sabres Linda Sancen Claudia Saric Clare Scheller Abbi Schutter Sunil Sekhri Ritu Shah Sriya Siems Madeline (Maddy) Simpson Adam Swantz Claire Thomas Deborah Tschiltsch Nick Velicka Irina Voloshina Deirdre Walsh Levi Warner Lavanga Wijekoon Domanique Woods Olivia Woolley Contact Us ProfessionalBoard@pawschicago.org Contact Us Careers Sitemap Privacy Policy Adopt a Pet Pippen Fasseas Adoption Center 1997 N. Clybourn Ave Chicago,\n                    \n                    \n                        IL\n                    \n                    \n                        60614\n                    \n                    \n                        - Map it 773-935-7297 (PAWS) Monday–Friday: noon–7 p.m. Saturday–Sunday: 11.a.m.–5 p.m. SCHEDULE AN ADOPTION APPOINTMENT: Learn about our in-person adoption process at pawschicago.org/adopt Medical Center & Lurie Clinic 3516 W. 26th Street Chicago,\n                    \n                    \n                        IL\n                    \n                    \n                        60623\n                    \n                    \n                        - Map it 773-521-7729 (SPAY) Visit PawsChicago.org/clinic to make an appointment today. Blazer Building Training Center 1933 N. Marcey Street Chicago,\n                    \n                    \n                        IL\n                    \n                    \n                        60614\n                    \n                    \n                        - Map it Please visit PawsChicago.org/training for the most up-to-date information on our virtual and in-person training classes. Englewood Outreach Program Offers programs and resources for neighborhood pet owners. Pet owners in Englewood and Back of the Yards may call 773-217-9113 for more information. Copyright 2025 Follow us: Facebook Twitter Instagram"
    }
  ]
}