{
  "fuentes": [
    {
      "url": "https://www.partyslate.com/venues/lake-ida-east-park",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://www.eastlakefoundation.org/about-us/team/",
      "email": "info@eastlakefoundation.org"
    },
    {
      "url": "https://www.nrpa.org/about-national-recreation-and-park-association/leadership/board-of-directors/",
      "email": "leadership@nrpa.org"
    },
    {
      "url": "https://www.nrpa.org/about-national-recreation-and-park-association/leadership/board-of-directors/",
      "email": "press@nrpa.org"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "agarcia2@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "akrebs@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "bhernandez@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "cstakermann@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "dhartman@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "jmay@pbcgov.org"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "kkrueger@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "mfrancois@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "mastergardener@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "mstoller@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "nbaum@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "pcrippen@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "rlucas@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "theun@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "amatute@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "amcknight1@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "ameszaros@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "casuaje@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "clongley@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "cmmartin@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "csmith5@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "ddevries@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "dgonzalez@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "dtreccioli@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "ebroullo@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "emarois@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "jalamillo@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "jcurtis2@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "jroberts1@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "jsookram@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "lleatherwood@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "mallman@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "mjerrett@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "mlorenzo@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "mpowell@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "mvanweelden@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "nguay@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "pkujundzic@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "rrice@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "wcameron@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "email": "yrodriguez@pbc.gov"
    },
    {
      "url": "https://www.idaireland.com/contact-us",
      "email": "idaireland@ida.ie"
    },
    {
      "url": "https://www.idaireland.com/contact-us",
      "email": "streamline-icon-maze-strategy@48x48.svg"
    },
    {
      "url": "https://discover.pbc.gov/communityservices/humanservices/Pages/Contact-Us.aspx",
      "email": "cwilkins@pbcgov.org"
    },
    {
      "url": "https://discover.pbc.gov/communityservices/humanservices/Pages/Contact-Us.aspx",
      "email": "mbond@pbc.gov"
    },
    {
      "url": "https://discover.pbc.gov/communityservices/humanservices/Pages/Contact-Us.aspx",
      "email": "rhultgre@pbcgov.org"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "customerservice@encorepack.com"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "sales@encorepack.com"
    },
    {
      "url": "https://discover.pbc.gov/countycommissioners/pages/staff.aspx",
      "email": "bcc-allcommissioners@pbc.gov"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "asset-1@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "cservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "tkramer@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "you@domain.com"
    },
    {
      "url": "https://idahodunesrv.com/contact-us/",
      "email": "reservations@idahodunesrv.com"
    },
    {
      "url": "https://www.palmbeachschools.org/",
      "email": "valerie.crenshaw@palmbeachschools.org"
    }
  ],
  "mails": [
    "agarcia2@pbc.gov",
    "akrebs@pbc.gov",
    "amatute@pbc.gov",
    "amcknight1@pbc.gov",
    "ameszaros@pbc.gov",
    "asset-1@2x.png",
    "bcc-allcommissioners@pbc.gov",
    "bhernandez@pbc.gov",
    "casuaje@pbc.gov",
    "clongley@pbc.gov",
    "cmmartin@pbc.gov",
    "contact@partyslate.com",
    "cservice@thisistheplace.org",
    "csmith5@pbc.gov",
    "cstakermann@pbc.gov",
    "customerservice@encorepack.com",
    "customerservice@thisistheplace.org",
    "cwilkins@pbcgov.org",
    "ddevries@pbc.gov",
    "dgonzalez@pbc.gov",
    "dhartman@pbc.gov",
    "dtreccioli@pbc.gov",
    "ebroullo@pbc.gov",
    "emarois@pbc.gov",
    "idaireland@ida.ie",
    "info@eastlakefoundation.org",
    "jalamillo@pbc.gov",
    "jcurtis2@pbc.gov",
    "jmay@pbcgov.org",
    "jroberts1@pbc.gov",
    "jsookram@pbc.gov",
    "kkrueger@pbc.gov",
    "leadership@nrpa.org",
    "lleatherwood@pbc.gov",
    "mallman@pbc.gov",
    "mastergardener@pbc.gov",
    "mbond@pbc.gov",
    "mfrancois@pbc.gov",
    "mjerrett@pbc.gov",
    "mlorenzo@pbc.gov",
    "mpowell@pbc.gov",
    "mstoller@pbc.gov",
    "mvanweelden@pbc.gov",
    "nbaum@pbc.gov",
    "nguay@pbc.gov",
    "pcrippen@pbc.gov",
    "pkujundzic@pbc.gov",
    "press@nrpa.org",
    "reservations@idahodunesrv.com",
    "rhultgre@pbcgov.org",
    "rlucas@pbc.gov",
    "rrice@pbc.gov",
    "sales@encorepack.com",
    "streamline-icon-maze-strategy@48x48.svg",
    "theun@pbc.gov",
    "tkramer@thisistheplace.org",
    "valerie.crenshaw@palmbeachschools.org",
    "wcameron@pbc.gov",
    "you@domain.com",
    "yrodriguez@pbc.gov"
  ],
  "nombre_sitio": "pbc.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.partyslate.com/venues/lake-ida-east-park",
      "text": "Lake Ida East Park | Delray Beach Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Lake Ida East Park Find Venues / Florida / Delray Beach / Lake Ida East Park Unclaimed Lake Ida East Park 950 NW 9th St, Delray Beach, FL 33444, USA Max Seated 100 Max Standing 100 Request info Favorite Owner hasn't claimed this business If you own this business, claim your profile to update information, add photos, and more. Claim Profile Overview Gallery 0 About Lake Ida East Park Weddings:\n\nYour Palm Beach County park system offers many beautiful outdoor locations for your special occasion.\n\nGeneral rules for beach or open grass ceremonies:\n- There will be no extra charge for a wedding ceremony, nor will a permit be issued for a beach or open grass area. Please note this activity does not provide exclusive access to any area and must not compromise the use of a reserved area by any permit holder.\n- Wedding ceremonies held on the beach or open grass area must be small intimate gatherings consisting of the bridal party, official and a few guests.\n- No equipment such as chairs, structures, sound equipment, etc. are permitted to be set up on the beach or open grass area for the ceremony. Hand-held umbrellas are allowed.\n- Small wedding ceremonies may take place on the beach or an open grass area prior to 8:30am or after 5:00pm and within park operational hours, (sunrise to sunset). These ceremonies may have a maximum duration of twenty minutes.\n- If your ceremony includes a professional photographer, a daily or annual permit​ is required.\n- Requests for permits to conduct larger wedding ceremonies and/or a reception will be accommodated at rental facilities​ only. If unavailable, an alternate date or location would need to be considered for permitting. The request will follow all general policies and guidelines for the permitted facility/area.\n- Alcoholic beverage consumption is allowed at reserved pavilions as long as you have a departmental authorized permit.\n- The sale of alcoholic beverages, food, merchandise and services is not permitted. Event Spaces 1 100 max seated • 100 max standing 4 Lake Ida East Park 100 Seated 100 Standing Outdoor Pricing Packages Lake Ida East Park hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Amenities A/V Equipment Coat Check Handicap Accessible Kosher Kitchen Media Room Pet Friendly Pool Street Parking Valet Parking WiFi Windows Dance Floor Breakout Rooms Map 950 NW 9th St, Delray Beach, FL 33444, USA Follow Us Visit Website Call If you own this business, claim your profile to update information, add photos, and more. Claim Profile Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://www.eastlakefoundation.org/about-us/team/",
      "text": "Team - East Lake Foundation Skip to content (404) 373-4351 info@eastlakefoundation.org News East Lake News East Lake Media Coverage Newsletters Events FAQs Contact Donate Our Neighborhood 30 Voices Neighborhood Map Resident Stories History & Legacy Community Data Our Programs Mixed-Income Housing Cradle-to-College and Career Education Community Wellness Economic Vitality Our Impact Get Involved Events Volunteer Donate Sponsor an Event About Us Mission & Approach Team Board of Directors Partners Donors Strategic Plan Annual Reports Careers Toggle Navigation Our Team The East Lake Foundation's  success has been driven by a purposeful team of professionals passionately working toward our shared goals. Ilham Askia President & CEO Ilham Askia serves as the President & CEO of the East Lake Foundation where she is responsible for leading the Foundation’s strategic vision and ongoing work with East Lake Initiative partners to ensure progress towards the Foundation’s… Read More Ilham Askia President & CEO Ilham Askia serves as the President & CEO of the East Lake Foundation where she is responsible for leading the Foundation’s strategic vision and ongoing work with East Lake Initiative partners to ensure progress towards the Foundation’s mission. The East Lake Foundation was established in 1995 to revitalize the East Lake neighborhood in Atlanta, GA by generating new opportunities for families living there and creating a vibrant community where all residents thrive. The Foundation’s goal is to support programming that addresses mixed-income housing, cradle-to-college education, community wellness, and economic vitality. Askia is a seasoned nonprofit leader with a deep commitment to advancing social justice and equity.As Co-Founder and former Executive Director of Gideon’s Promise, a national, nonprofit public defender organization whose mission is to transform the criminal legal system by building a movement of public defenders who provide equal justice for marginalized communities, Askia spent 15 years changing the culture of indigent defense representation in America. Before her role as Executive Director, she served as Program Director, where she worked with and helped to recruit new public defenders, as well as develop relationships with public defender offices throughout the Southeast. Prior to her work with Gideon’s Promise, she served as an educator. Her career began in early childhood education as a Teach for America Fellow in the District of Columbia Public Schools and then she later taught and facilitated teacher training in the charter school system before moving to Georgia. She served as a first-grade teacher, chaired the First Grade Team, and wrote Math curriculum for Fulton County Schools. During her tenure in education, her students were routine examples of the effects of over-policing in marginalized communities, the school-to-prison pipeline, as well as the negative outcomes derived from legal representation provided by poorly trained public defenders with overwhelming caseloads. The latter being a lesson she learned earlier in life when both her father and brother were sentenced to prison. Askia has been featured by media outlets that include Essence , Black Enterprise , Atlanta Magazine , Share International Magazine , Atlanta’s NPR, and the legal podcast Service Roads: Conversations on the Law and Social Justice. Under her leadership, Gideon’s Promise was also the subject of award winning, HBO Documentary, Gideon’s Army . She regularly speaks at law schools, community organizations and national criminal justice conferences to discuss the critical role of public defenders in the legal system. Notably, Askia has been a speaker at the SMART on Crime Innovations Conference, National Association for Public Defense Conference, Kentucky Department of Public Advocacy Annual Conference, Social Justice Community Foundations, Federal Defenders Conference, National Association for the Advancement of Colored People Legal Defense Fund Capital Training Conference, Public Defender Service for District of Columbia, Mercer Law Review Conference, and Southern Christian Leadership Conference Summit. She has been honored with the Southern Center for Human Right’s Gideon’s Award, Women’s National Basketball Association (WNBA) Inspiring Woman Award, the Atlanta Hawks Most Notable Atlantan, and Atlanta Magazine’s Women Making a Mark Award. Askia holds a bachelor’s degree from Cornell University in City/Urban, Community, and Regional Planning, and a master’s degree in Elementary Education and Teaching from Trinity Washington University. She currently serves as a committee member of Leadership Atlanta, a post she has held since 2017, and serves on the Board of Directors for the Society of International Business Fellows (SIBF), which she joined in January 2021. She also serves on the Charles R. Drew Charter School Board and the National Head Start HSN Board. She resides in Atlanta, Georgia with husband Jonathan and children Aaliyah and Lucas. Meisha White Director of Finance and Operations Meisha White was named the East Lake Foundation’s Director of Finance and Operations in 2019. In her role, she is responsible for the overall financial management of the organization, its financial reporting, budgeting, audit, tax, and investment… Read More Meisha White Director of Finance and Operations Meisha White was named the East Lake Foundation’s Director of Finance and Operations in 2019. In her role, she is responsible for the overall financial management of the organization, its financial reporting, budgeting, audit, tax, and investment management. She also oversees the foundation’s Human Resources and Information Technology functions. Meisha comes with many years of accounting and management experience, holding senior roles in companies ranging from manufacturing to nonprofits. Before joining the team, she served as Director of Finance and Accounting with the City of Atlanta where she oversaw the administration of agency grant funds and successfully led the city’s distribution of labor costs through its ERP system. She has been recognized as a school Star Volunteer and is a two-time recipient of the Leadership Award. She has fulfilled the role as Treasurer for both the PTA board and her local Toastmasters club. She previously served as a reading mentor for Everybody Wins Atlanta, a program dedicated to enhancing children’s literacy skills. Upon relocating to Atlanta from North Carolina, she developed a love for tennis and competes regularly in singles and doubles matches. When not playing tennis, she is either watching tennis, running, or watching football. She and her husband have two daughters. Kivatah Castilla Director of Development Sharon Hall-Thomas Operations and Special Initiatives Manager Sharon Hall-Thomas is Operations and Special Initiatives Manager for the Foundation. Before joining the Foundation in 2000 as Executive Assistant, she served as an administrative assistant for the law firm of Rubin, Winter, Rapoport and Hall. She… Read More Sharon Hall-Thomas Operations and Special Initiatives Manager Sharon Hall-Thomas is Operations and Special Initiatives Manager for the Foundation. Before joining the Foundation in 2000 as Executive Assistant, she served as an administrative assistant for the law firm of Rubin, Winter, Rapoport and Hall. She also worked as an administrative assistant for the Child Support Enforcement Agency, acting as liaison between the agency and the court system. She attended Georgia State University and volunteers regularly at Charles R. Drew Charter School in East Lake. Jennifer W. McCrary, Ed.D. Director of Outreach and Engagement Jennifer is an experienced workforce and community engagement professional who is passionate about people who want to improve themselves through personal and professional transformation. Her leadership and commitment has been nurtured through her… Read More Jennifer W. McCrary, Ed.D. Director of Outreach and Engagement Jennifer is an experienced workforce and community engagement professional who is passionate about people who want to improve themselves through personal and professional transformation. Her leadership and commitment has been nurtured through her work experience in higher education and non-profit leadership. She has always been a guiding force in her personal and professional relationships. Her optimistic and encouraging spirit has made her a positive agent of change. Jennifer has over 20 years of experience in higher education, workforce development, and community redevelopment where she seeks to help transform and impact the lives of others. Jennifer has been with the East Lake Foundation for the last 14 years moving the mission forward. She serves as a community board member for the East Lake Family YMCA, The Marcell Anderson Foundation, United Way VIP – Class of 2012, Legacy of Pearls Foundation, and recipient of proclamations from DeKalb County Commissioners (2017) and the State of Georgia (2022) for her commitment to community development. Jennifer is a native Atlantan, and a proud product of the Atlanta Public School System and University System of Georgia. She holds a Bachelor of Science in Education from the University of Georgia, a Master of Arts and Doctorate in Education from Clark Atlanta University. Karis Williams Wealth Builds Program Manager Karis Williams serves as the Wealth Builds Program Manager.  In this role, she is responsible for leading the Foundation's economic vitality initiative for youth, by focusing on strategic… Read More Karis Williams Wealth Builds Program Manager Karis Williams serves as the Wealth Builds Program Manager.  In this role, she is responsible for leading the Foundation's economic vitality initiative for youth, by focusing on strategic partnerships and engaging families to advance our work in closing the wealth gap. With a background in non-profit organizations, program management, social policy, and human rights advocacy, Karis has worked with several organizations focused on anti-human trafficking, gender rights, migrant rights, and privacy rights. Previously, she served as Project Director at YELLS Inc., supporting Latinx families through youth programming and community development. As Program Manager for The Freedom Challenge, she championed efforts to break cycles of poverty and exploitation, empowering women (survivors of human trafficking) through education, vocational training, and micro-saving programs to build resilience for future generations. Holding a Doctorate in International Affairs from Johns Hopkins University and a Masters in Global Affairs from Florida International University, Karis is dedicated to advancing sustainable economic opportunities for the community through her work at the East Lake Foundation. Norma V. Nyhoff Development Manager, Grants & Annual Fund Norma V. Nyhoff ( she/her) is the Development Manager, Grants & Annual Fund for the East Lake Foundation. She collaborates with foundation, corporate, and individual donors to share the Foundation’s impact and sustain and grow its… Read More Norma V. Nyhoff Development Manager, Grants & Annual Fund Norma V. Nyhoff ( she/her) is the Development Manager, Grants & Annual Fund for the East Lake Foundation. She collaborates with foundation, corporate, and individual donors to share the Foundation’s impact and sustain and grow its mission. A passionate nonprofit development professional, Norma has most recently worked with CHRIS 180 and Nicholas House. She has worked in development, education, and advocacy supporting domestic workers’ rights, anti-racism and allyship, families experiencing homelessness, women’s rights, mental health services, and the LGBTQ+ community. Norma is an Atlanta native who was born at Piedmont Hospital and attended Holy Innocents’ Episcopal School. She graduated from Carleton College with a Political Science/International Relations degree and lives with her partner and dogs in Ormewood Park. Tywonia Orum Senior Program Manager Tywonia Orum serves as the Senior Program Manager, leading the Resident and Community Support Program efforts in The Villages of East Lake. After 11 years of working with State Farm, Tywonia decided to transition into a career that would allow… Read More Tywonia Orum Senior Program Manager Tywonia Orum serves as the Senior Program Manager, leading the Resident and Community Support Program efforts in The Villages of East Lake. After 11 years of working with State Farm, Tywonia decided to transition into a career that would allow her to work with families and communities in a different way. Although not a stranger to humanitarian work, she decided to leave the corporate sector and follow her passion. She worked for several years with the Atlanta Housing Authority where she worked with special programs such as the family reunification and the disabled. Her service continued with The Housing Authority of DeKalb supporting families with housing stabilization. She served as executive assistant for the International Institute of Deaf Services, Inc. for more than 15 years and also worked with National Alliance of Black Interpreters, Inc. (NAOBI). She commutes to Birmingham weekly; where she has been a staff/contract interpreter for the deaf since 1997. Most recently, Tywonia was a Pathway Coach with The Center for Working Families where she worked with families to connect them with employment, job readiness supports, career coaching and other social supports. Tywonia holds a Bachelor of Arts in Counseling from Samford University and brings a variety of career development training and housing experience to the families in The Villages of East Lake. Wigasi Brant Program Coordinator Resident and Community Support Program Wigasi Brant (he/him) believes his gifts only manifests excellence when he is in service to others. Wigasi’s decision to pursue a career in Community Development is directly connected to the story of his own beginnings. As the son of a… Read More Wigasi Brant Program Coordinator Resident and Community Support Program Wigasi Brant (he/him) believes his gifts only manifests excellence when he is in service to others. Wigasi’s decision to pursue a career in Community Development is directly connected to the story of his own beginnings. As the son of a teenage single mother from the inner city of Newark, NJ, his passion for finding or creating opportunities to provide life-enhancing possibilities to individuals who, in some cases, would otherwise be overlooked and/or passed over is deeply personal. Wigasi brings with him to the East Lake community a background which combines a myriad of experience including Talent Acquisition, Performing Arts, and Community Service. During his HR career, Wigasi teamed with globally recognized brands such as Delta, Amazon, and Rivian where he worked in various Talent Acquisition capacities. While at Delta, he was awarded Boston’s PIC Achiever Award and Ohio’s SWORHIB Awards; both are recognitions for high impact on the reduction of unemployment and commitment to the delivery of opportunities for underserved persons. A creative and lover of the performing arts, Wigasi can been in seen numerous Film/TV productions and has performed on stages both local to Atlanta and across the country. He has worked alongside greats such as Cicely Tyson, Blair Underwood and Queen Latifah to name a few. A service driven individual, Wigasi uses his performing arts background to introduce recovering addicts, formerly & currently incarcerated individuals, and folks who have been impacted by housing instability, to the therapeutic value of the performing arts and then produces shows using only that community. He is currently teaching Acting and producing theatre with justice involved inmates, who are currently incarcerated at Burress State Prison. Wigasi holds a BA from Morehouse College and an MFA from the University of Illinois Champaign-Urbana. He is also a member of Alpha Phi Alpha Fraternity, Inc. STAY CONNECTED THROUGH EMAIL First Name (Required) Last Name (Required) Email (Required) Copyright © 2025 East Lake Foundation. All rights reserved. Legal / Privacy Site Map Our Neighborhood Our Programs Get Involved About Us News Events FAQs Contact Donate facebook Instagram linkedin twitter Our Neighborhood 30 Voices Neighborhood Map Resident Stories History & Legacy Community Data Our Programs Mixed-Income Housing Cradle-to-College and Career Education Community Wellness Economic Vitality Our Impact Get Involved Events Volunteer Donate Sponsor an Event About Us Mission & Approach Team Board of Directors Partners Donors Strategic Plan Annual Reports Careers Toggle Navigation Our Neighborhood 30 Voices Neighborhood Map Resident Stories History & Legacy Community Data Our Programs Mixed-Income Housing Cradle-to-College and Career Education Community Wellness Economic Vitality Our Impact Get Involved Events Volunteer Donate Sponsor an Event About Us Mission & Approach Team Board of Directors Partners Donors Strategic Plan Annual Reports Careers (404) 373-4351 info@eastlakefoundation.org News East Lake News East Lake Media Coverage Newsletters Events FAQs Contact facebook Instagram linkedin twitter Donate"
    },
    {
      "url": "https://www.nrpa.org/about-national-recreation-and-park-association/leadership/board-of-directors/",
      "text": "NRPA Board of Directors, Leadership Biographies | National Recreation and Park Association The National Recreation and Parks Association ☰ MENU About Join Connect Shop Login Donate Our Work Grant and Fundraising Resources Strategic Plan 2025-2029 Our Three Pillars Health and Well-Being Equity Environmental Resilience Advocacy Legislative Platform The Land and Water Conservation Fund (LWCF) Take Action Park Champion™ Initiative Community Project Funding Is Essential for Park Projects NRPA Awards About NRPA's Awards Innovation Awards Spotlight Awards Scholarships and Fellowships 30 Under 30 Robert W Crawford Hall of Fame National Gold Medal Award Scholarships and Fellowships Parks Build Community Building a Movement Parks and Recreation Is Essential NRPA Partnerships Initiatives How to Partner Aquatics Playgrounds Urban Parks Success Stories Volunteer with NRPA Coronavirus Disease 2019 (COVID-19) NRPA's annual Parks for Pollinators BioBlitz, held each year in September, is a great way to educate your community about pollinators, gain knowledge about local species and make your parks more sustainable. Plus, you could win one of three $1,000 prizes or prize packs just for participating. Careers Start Your Career Grow Your Career Career Center Post a Job Find a Job \" A Choice Career: Parks and Recreation \" is a powerful, interview-driven video that highlights real people and real stories, showcasing the diverse opportunities in the field. Education Certification Certified Park and Recreation Professional (CPRP) Certification Become a CPRP Renew Your CPRP Certification CPRP Exam CPRP Prep Materials and Resources CPRP Registry CPRP Frequently Asked Questions Certified Playground Safety Inspector (CPSI) Certification Become a CPSI CPSI Course Calendar Renew Your CPSI Certification Become a CPSI Instructor Host a CPSI Course CPSI Prep Materials and Resources CPSI Registry CPSI Recertification Policy FAQs Certified Park and Recreation Executive (CPRE) Certification Become a CPRE Renew Your CPRE Certification CPRE Exam CPRE Prep Materials and Resources CPRE Registry CPRE Frequently Asked Questions Aquatic Facility Operator (AFO) Certification Become an AFO AFO Course Calendar Renew Your AFO Certification Become an AFO Instructor Host an AFO Course AFO Prep Materials and Resources AFO Registry CAPRA Agency Accreditation NRPA Digital Badges CPRP and CPRE Eligibility Requirements Becoming a Certified Park and Recreation Professional (CPRP) will not only keep your expertise fresh, but also help you achieve greater health, resilience and equity outcomes in your community. Conference & Events NRPA Annual Conference Exhibit at the Conference Park and Recreation Month Park and Recreation Month Toolkit Proclaim July as Park and Recreation Month In Your Community Park and Recreation Professionals Day Family Health & Fitness Day National Mentoring Month Earth Month Mental Health Awareness Month Industry Calendar Learn more about the 2025 NRPA Annual Conference, taking place September 16-18, 2025 in Orlando! Publications & Research Parks & Recreation Magazine Read the Ezine Stay Connected Advertising Open Space Blog & Podcast NRPA Research Reports NRPA Park Metrics NRPA Park Pulse Surveys NRPA Parks Snapshot Surveys Journals NRPA Facility Market Reports Evaluation Resource Hub Park and Recreation Stories: Your story starts here Best Practice Resources Parks and Recreation Is Essential Data and Mapping Resource Library Press Room Email Newsletters Open Space Radio is NRPA's monthly podcast that shares inspiring and engaging stories about community, connection, and the impact of local parks and recreation. Profile Home About Leadership and Governance Board of Directors and Leadership Biographies Board of Directors and Leadership Biographies A board of directors governs the National Recreation and Park Association. The board is responsible for the formulation of policies that control and direct the affairs of the association. Board members serve two- or three-year terms. Officers of the board are elected annually or appointed by the board chair. Board members are representative of the NRPA membership, which includes professional and advocate leaders in the park, recreation, and conservation movement; park and recreation agencies and organizations representing the public, private, voluntary, commercial, and industrial sectors; firms supplying park and recreation products and services; and individuals and civic groups interested in the park, recreation, and conservation field. Updated as of October 8, 2024 Officers and Executive Committee Open or Close Chair: Jesús Aguirre, CPRE Waterloo Greenway (Austin, TX) Jesús Aguirre has more than 25 years of experience in public and non-profit leadership in public education and in the park and recreation field. He is passionate about creating vibrant and inclusive public spaces that help diverse communities thrive. Jesús has served at all levels of the public K-12 education systems, including as a middle school science teacher, a public charter school co-founder and co-director, a school district level administrator, and ultimately as chief state school officer for the District of Columbia. As the leader of the parks and recreation departments in the District of Columbia and in Seattle, Jesús led both agencies to develop new strategic visions and plans to better serve all residents. As part of the team in Washington DC, he led an effort to successfully achieve national accreditation for the department. In Seattle, Jesús was charged with initial implementation of new park district to infuse much-needed funding to improved service to community member, in addition to leading several initiatives to increase efficiency, access, equity, and sustainability in the park system. Recently, Jesús served as the CEO of Waterloo Greenway, a nonprofit organization that operates and maintains a 35-acre urban park system in downtown Austin, Texas. In that role, he led the vision, strategy and execution of the organization's mission to connect people, nature and culture, overseeing the fundraising, partnerships, programming and operations of the park. Jesús currently serves as chair of the board for the National Recreation and Parks Association (NRPA) and the chair of the board of the Children and Nature Network (C&NN) and is a member of the American Academy for Park and Recreation Administration. Jesús has an MBA from Arizona State University and a bachelor's degree from the University of Texas at Austin. He is an avid park user and a Certified Parks and Recreation Executive (CPRE). Open or Close Chair Elect: Joshua Medeiros, Ed.D., CPRE City of Bristol Parks, Recreation, Youth and Community Services (Bristol, CT) Dr. Joshua T. Medeiros serves as the superintendent of Parks, Recreation, Youth and Community Services for the City of Bristol, Connecticut and as an adjunct professor in the Department of Recreation, Tourism and Sport Management at Southern Connecticut State University in New Haven, Connecticut. Medeiros has an earned doctorate degree in educational leadership and a master’s degree in parks and recreation administration. Medeiros is a faculty member of the NRPA Directors School and is a practitioner representative on the Council on Accreditation of Parks, Recreation, Tourism and Related Professions. Medeiros is a Certified Parks and Recreation Executive (CPRE) and is an award winner of both his state and national park and recreation associations. He is a passionate, collaborative and engaging leader with executive level experience across several municipalities, a proven track record of excellence in administering multimillion-dollar department budgets, providing top-tier customer service to the public, managing all aspects of large-scale capital improvement projects, and developing master and strategic plans to guide long-range planning. Open or Close Treasurer: Susie Kuruvilla, CPA, CPRP Gurnee Park District (Gurnee, IL) Susie Kuruvilla entered the park district world in 1997 as the superintendent of business services for Gurnee Park District in Illinois. In 2006, she was promoted as the executive director. Kuruvilla is a certified public accountant and has worked in the private sector and in a municipality previously. In 2010, the district won the National Gold Medal Award under Kuruvilla’s leadership. The district also achieved the Distinguished Accreditation Agency Award from the Illinois Association of Park Districts (IAPD) in 2010 and 2015. In 2013, Kuruvilla led the acquisition of a 75,000-square-foot Gold’s Gym facility and converted it into a park district-owned fitness facility named FitNation. Kuruvilla spearheaded a movement in Gurnee, named “GO Gurnee,” inspired by the message delivered by former U.S. Surgeon General, Dr. Vivek Murthy, at the 2015 NRPA Annual Conference. GO Gurnee encourages people to walk 30 minutes each day. The movement became so successful that it has been modeled in 25 other communities throughout Lake County in the past three years through a partnership with the Lake County Health Department. Under Kuruvilla’s leadership, the Gurnee Park District has thrived financially while maintaining the standard of excellence in customer service. Kuruvilla has served on various boards and committees and made many contributions to the field of parks and recreation over the past 20 years. She has served on the finance committees for IAPD, as well as the Park District Risk Management Agency (PDRMA). She currently serves as the chairperson for the PDRMA Health Benefits Committee and recently joined the board of directors for HR Source, a human resources (HR) association that provides HR-related consultation for public and private organizations including many park districts. Kuruvilla is an active member on the Joint Legislative Committee led by IAPD. Kuruvilla is a member of the local Exchange Club and Healthy Community Healthy Youth, a local organization focused on the health and well-being of young adults in the community. At a national level, Kuruvilla has served as a judge for the National Gold Medal Award for the past five years finishing her term as head judge in 2019. Kuruvilla has accomplished much during her tenure in the field. She has excelled at balancing work and play and aspires to give back to the parks and recreation field at a local, state and national level. She holds a strong desire to impact lives by expanding parks and recreational opportunities and improving quality of life for all. Open or Close Secretary: Philip Wu, M.D. (retired) Kaiser Permanente Northwest Region (Portland, OR) Dr. Philip Wu, a retired pediatric obesity specialist from Kaiser Permanente Northwest Region, has been a pediatrician with Kaiser since 1997. His special interests include obesity prevention in children and promoting healthy living for families. He is currently working on broadening the scope of healthcare to include collaboration with community organizations/businesses in addressing healthcare disparities. Dr. Wu serves on several community boards, including the Northwest Health Foundation, Oregon Oral Health Coalition, Outside In, The Intertwine Alliance and Oregon Environmental Council. He has an interest in transportation as a “social determinant” and has participated on the transportation committee of the Westside Economic Alliance, the Washington County Transportation Futures Study project and Oregon Department of Transportation’s Transportation Options Policy Advisory Committee. He recently concluded two years of service on Metro’s Equity Strategy Advisory Committee. He received a bachelor’s degree from Stanford University and completed his residency at Madigan Army Medical Center in Tacoma, Washington. Dr. Wu and his partner enjoy walking, hiking and simply being in nature. Open or Close At Large: Tiffany White-LaPierre Independent Contractor (Redlands, CA) Tiffany White-LaPierre is a CPRE with nearly 20 years of experience in the park and recreation industry. Her career spans across the country, having lent her talents to organizations in Illinois, Florida, California and Texas. She has held roles specializing in recreation programming, facility operations, special events, day/overnight camps, afterschool programs, teen programs, membership/guest services, arts and media, and consulting. An advocate for continuing education and service to the profession, White-LaPierre earned a Bachelor of Science in recreation, sport and tourism; Master of Science in sport management; Master of Arts in management; and is earning her doctorate in education, specializing in workplace learning, training and instructional design. She has served on numerous boards and committees on the local, state and national levels, including the NRPA National Certification Board, Women in Parks and Recreation Board, National Association of Park Foundations Board, Texas Recreation and Park Society Marketing and Communications Committee, and the Central Illinois Council for Leisure Experiences Board. White-LaPierre currently resides in Redlands, California, about 50 miles east of Los Angeles. Open or Close President and CEO: Kristine Stratton, Ex Officio National Recreation and Park Association (Ashburn, VA) Kristine Stratton is the president and chief executive officer of the National Recreation and Park Association (NRPA). In her role, she is responsible for the nearly $20 million national organization that works to ensure that all people have access to parks for health, conservation and recreation. NRPA is the national voice for the protection and creation of local parks, harnessing the passion and power of its more than 60,000 members and the millions of individuals they serve. NRPA partners with foundations, federal agencies and corporations that recognize the critical role of parks in creating healthy and sustainable communities. The organization grants millions of dollars each year to its members to implement programs that have measurable objectives, such as increasing equitable park access, reducing obesity, increasing physical activity, saving wildlife, connecting children to nature and implementing green infrastructure in communities nationwide. Access to quality parks and recreation is a critical component to an individual’s success and to strong communities, and NRPA focuses on underserved communities to give everyone access to a great park. A staunch advocate for environmental conservation and equity issues, Stratton believes strongly in NRPA’s mission. Before coming to NRPA, Stratton was the senior vice president of operations at Earthjustice, a nonprofit public interest organization dedicated to litigating environmental issues. Prior to that, she served as the executive director of Waterkeeper Alliance in New York, New York, and before that she was vice president of operations at the Conservation Law Foundation in Boston, Massachusetts. She also served in several administrative and senior management roles at WGBH Educational Foundation, a public broadcasting station, in Boston, Massachusetts. Stratton holds a Master of Arts degree in environmental policy and planning from Tufts University and a Bachelor of Science degree in business administration from Boston University. Directors Open or Close Kathy Abbott Boston Harbor Now (Boston, MA) Kathy Abbott is the first president and CEO of Boston Harbor Now, an organization that partners with public agencies, community leaders, businesses and other nonprofits to realize Boston Harbor’s potential to benefit the city and region. Upon assuming this role, Abbott has come full circle since beginning her career in college on the Harbor Islands as a park ranger to currently leading Boston Harbor Now. She is responsible for working with the board and staff to create a welcoming and resilient harbor that benefits everyone in the Greater Boston region. Abbott has a history of leading change through public and nonprofit organizations, including advancing statewide park planning, management and land conservation, educating students and impacting resource-based economies in primarily developing countries through applied environmental studies, creating a new national park through a first-of-its-kind public-private partnership in Boston Harbor, creating and managing a statewide park system, increasing funding for public parks in Massachusetts, and growing the impact of the only year-round botanic garden in New England. She asserts that she has never done this work alone and credits great teams and collaborations for her success. Abbott has worked locally and globally and volunteered nationally to advance the interests of urban parks as the co-chair of the City Parks Alliance. Her experience as an executive and entrepreneur in government and nonprofits uniquely qualifies her to build upon the successes of the current waterfront renaissance. Her proudest accomplishments have come as a volunteer working with kids throughout her career, as a former foster mother and now as a proud mom of a 30-year-old daughter. In 2016, she was named one of Boston’s Power 50 by the Boston Business Journal , and in 2018, was named one of the 100 Most Influential People in Boston by Boston Magazine . She received her degrees from the Stockbridge School of Agriculture at University of Massachusetts Amherst and Harvard University. Open or Close Jesús Aguirre, CPRE Waterloo Greenway (Austin, TX) Jesús Aguirre has more than 25 years of experience in public and non-profit leadership in public education and in the park and recreation field. He is passionate about creating vibrant and inclusive public spaces that help diverse communities thrive. Jesús has served at all levels of the public K-12 education systems, including as a middle school science teacher, a public charter school co-founder and co-director, a school district level administrator, and ultimately as chief state school officer for the District of Columbia. As the leader of the parks and recreation departments in the District of Columbia and in Seattle, Jesús led both agencies to develop new strategic visions and plans to better serve all residents. As part of the team in Washington DC, he led an effort to successfully achieve national accreditation for the department. In Seattle, Jesús was charged with initial implementation of new park district to infuse much-needed funding to improved service to community member, in addition to leading several initiatives to increase efficiency, access, equity, and sustainability in the park system. Recently, Jesús served as the CEO of Waterloo Greenway, a nonprofit organization that operates and maintains a 35-acre urban park system in downtown Austin, Texas. In that role, he led the vision, strategy and execution of the organization's mission to connect people, nature and culture, overseeing the fundraising, partnerships, programming and operations of the park. Jesús currently serves as chair of the board for the National Recreation and Parks Association (NRPA) and the chair of the board of the Children and Nature Network (C&NN) and is a member of the American Academy for Park and Recreation Administration. Jesús has an MBA from Arizona State University and a bachelor's degree from the University of Texas at Austin. He is an avid park user and a Certified Parks and Recreation Executive (CPRE). Open or Close Samuel Assefa Director, Governor's Office of Planning and Research (Sacramento, CA) Samuel Assefa serves as the director of California’s Governor’s Office of Planning and Research (OPR), appointed by Governor Gavin Newsom in September 2021. OPR is the state’s primary comprehensive planning agency, providing policy guidance to state agencies and local governments, with a focus on land use, community development, climate resilience and economic development. Under Assefa’s leadership, OPR has tripled its programs and initiatives in just two years, managing an annual budget of $1.5 billion across various divisions, including the California Strategic Growth Council, Office of Community Partnership and Strategic Communications, California Volunteers, Governor’s Military Council, and the Integrated Climate Adaptation and Resiliency Program, among others. Assefa also chairs the California Strategic Growth Council, comprising seven state agency secretaries working to promote climate-smart communities and infrastructure development. He was recently appointed to the California Military Council by Governor Newsom, tasked with enhancing collaboration between local governments and the U.S. military on land use, climate resilience and statewide energy policies. Prior to his role at OPR, Assefa served as the director of the Seattle Office of Planning and Community Development from 2016 to 2021. His extensive career includes positions such as senior urban designer for City of Boulder, director of land use and planning for Chicago’s Department of Planning and Development, deputy chief of staff for Economic and Physical Development for former Chicago Mayor Richard M. Daley, and director of special projects for the San Francisco Planning Department. Throughout his career, Assefa has been actively involved in civic and design organizations. He was inducted into Lambda Alpha International in 2006 and has served as a board member of the American Institute of Architects, the Graham Foundation and more. He is also a founding member of the Center for Art and Public Life at California College of the Arts, where he served as an adjunct professor of architecture. Additionally, he is a member of the Mayor’s Institute on City Design Resource Team. Assefa frequently shares his expertise as a speaker at various forums and conferences, including the Urban Land Institute, CityAge, the American Planning Association, and international symposiums, like the Toronto Tall Buildings Symposium and the Organisation for Economic Co-operation and Development. He has lectured at prestigious universities, including Harvard Graduate School of Design, Massachusetts Institute of Technology (MIT) Department of Urban Studies, and Cornell Department of City and Regional Planning. Assefa holds a Master of City Planning from MIT and a Bachelor of Arts in architecture from the University of Illinois at Chicago. Open or Close Rick Atkins Director, City of Round Rock Parks and Recreation (Round Rock, TX) Rick Atkins is the director of the parks and recreation department with the City of Round Rock. He attended Texas Tech University and received a bachelor’s degree in exercise and sports science. Atkins joined the City of Round Rock in 1995 as a recreation supervisor. He served in several leadership positions until 2001, when he was selected as the department’s first assistant director. In February 2005, he was promoted to director of the parks and recreation department. During his 18-year tenure as director, he has supervised and spearheaded more than $125 million in capital improvement projects. Many of the projects have received national and statewide recognition. In addition, the City of Round Rock has acquired more than 1,300 acres of parkland, an asset in growing the city’s recreation program and economic development efforts. In 2023, the community awarded the department with $150 million in bond funding for a series of new projects toward continuous community. Under the direction of Atkins, the parks and recreation department has been awarded CAPRA accreditation by NRPA. The City of Round Rock has been reaccredited three consecutive times. In addition, his team was awarded the National Gold Medal Award for Excellence in Park and Recreation Management. The Gold Medal Award is the highest national honor in the park and recreation industry. Atkins has instilled in his department the importance of maintaining a strong connection with NRPA and the Texas Recreation and Park Society (TRAPS). His team regularly attends NRPA conferences and training and is actively involved within both organizations. Team members serve on the Conference Program Committee and as CAPRA Visitors. A current member of the team is serving as the president of TRAPS. The department understands the value of involvement and the importance of NRPA’s Three Pillars, making these a focal point for its purpose to the City of Round Rock. Atkins has a strong track record and commitment to the field of parks and recreation. The community benefits from his commitment and will continue to see and feel the advantages of that commitment for future generations. Open or Close Anthony-Paul \"AP\" Diaz Superintendent, Seattle Parks and Recreation (Seattle, WA) Anthony-Paul \"AP\" Diaz is the 26th superintendent of Seattle Parks and Recreation since the city's founding in 1869. He manages a department of 2,000 staff and more than 500 parks, lake and ocean shorelines, environmental coastal lands, and seascapes with an operating and capital budget of $760 million. Diaz is committed to equipping others for success and empowering people and organizations to maximize their potential while amplifying the narrative that parks and open spaces are essential civic infrastructure that is fundamental to the vitality and vibrancy of a city. He is a proud proponent of parks and open spaces changing the trajectory of cities throughout the world in service of equity, innovation, climate action, resiliency and advancing healthy lifestyles in a world of competing challenges and constant change. He is an instructor in transformational leadership and cultural diversity and thrives in areas where he can make a mark or help others make theirs. Diaz is framed in wanderlust, law, music, parks, carts, cultural venues, equity, sport and the pursuit of happiness. He is passionate about life, people and place making. He studied diplomacy and international politics at Georgetown University's School of Foreign Service in Washington, D.C., graduating with a Bachelor of Science in foreign service. He also has a Juris Doctorate from Loyola Law School in Los Angeles. Diaz has served as past chair of Parks & Recreation magazine's Editorial Advisory Board, is a member of World Urban Parks and an instructor at NRPA's Directors School. Open or Close Jose Felix Diaz Ballard Partners (Miami, FL) Jose Felix Diaz is an executive vice-president at Ballard Partners in Miami. He is a government attorney who specializes in complex matters involving federal, state and local government approvals for clients ranging from individuals, nonprofit organizations and entities throughout South Florida and beyond. Diaz has also been a Florida state representative and serves as a board member and ambassador for various nonprofit groups including the South Florida National Parks Trust and the Zoo Miami Foundation. He has received numerous awards for his leadership and service. Diaz holds a bachelor’s degree in political science from the University of Miami, a juris doctorate from Columbia Law School and a certificate in energy planning and policy from the University of Idaho. Open or Close Lakita Frazier Women in Parks and Recreation (Columbia, SC) Lakita Frazier is the CEO of Women in Parks and Recreation. Previously she served as executive director of the Richland County Recreation Commission. She is a Certified Parks and Recreation Professional (CPRP) with more than 20 years of experience in recreation program planning, staff development, capital project implementation and strategic planning. During her time as the director of Parks and Recreation for the City of Suffolk (Virginia) Department of Parks and Recreation, the agency thrived achieving national accreditation and received several local, state and national awards for facilities and programs. Under her leadership, Frazier planned and implemented $25 million capital projects increasing the park system’s facilities by 45 percent. Frazier’s work has been recognized on the state and national level where she has served as president of the Virginia Recreation and Parks Society and a Diversity Scholar for the National Recreation and Parks Association. Frazier was recently selected as fellow for the American Academy for Parks and Recreation Administration and is a regent for the National Revenue Management and Development School. In addition to her work with mentoring young professionals, Frazier serves on the advisory committee for GP RED, which is a nonprofit organization whose goal is to fully recognize and expand research, education and resource development activities for community “quality of life” agencies. The Virginia native currently holds the chair seat for the National Recreation and Parks Ethnic Minority Society and is past chair of the National Recreation and Parks Association’s Leadership Development Network. She also founded the Women in Parks and Recreation Facebook group, which boasts more than 7,000 members after less than a year of recruitment. Frazier attended Norfolk State University where she earned her bachelor's degree in social work. She is finishing a master's degree in public administration from Liberty University. She lives in Richland County, South Carolina, with her three children. Open or Close Christian Gabriel, FASLA, PLA Public Nature Projects (Washington, D.C.) Both a fellow of the American Society of Landscape Architects and a distinguished alumnus of the University of Massachusetts Amherst, Christian brings 20 years of global expertise as an award-winning designer and major public builder. Trained in design, arts, ecology and anthropology; his built work, design research, and enacted public policy bridges future parks, civic infrastructure, urban ecology and nature-based systems. Delivering work under challenging jurisdictional, operational, economic, physical, and political conditions, Christian has completed dozens of celebrated projects. Unique amongst his peers, Christian has authored and implemented design policy, designed innovative capital projects, and developed inventive approaches to re-envisioning and managing large real estate portfolios and park systems. Christian has served as the first National Design Director for Landscape Architecture at the United States General Services Administration (GSA), as a senior designer at both the New York City design studios of Ken Smith and Thomas Balsley, and as the Deputy Director of a major urban parks agency. Christian has played a leading role in shaping progressive federal design policies and in developing both the 'National Disaster Resilience' and the 'Rebuild By Design' competitions for the United States federal government. In addition to directing Public Nature Projects, Christian is a founding board member of the Ian McHarg Center for Ecology and Urbanism at the University of Pennsylvania. Christian has made the creation of immersive environments, functional excellence, climate responsiveness, and environmental performance, a cornerstone of his career. Open or Close Phil Ginsburg San Francisco Recreation and Park (San Francisco, CA) Since 2009, Phil Ginsburg has been the general manager of the San Francisco Recreation and Park Department, which oversees 4,000 acres of open space and more than 225 parks in the city. Ginburgs’ focus has been equitable park access. In 2018, San Francisco became the first city in the country where 100 percent of residents live within a 10-minute walk of a park. In 2019, Ginsburg was appointed to the California State Park and Recreation Commission by Governor Gavin Newsom. Recently, he was unanimously confirmed by California State Senate to second term on the commission where he serves as vice chair. Ginsburg serves as a national board member on the City Parks Alliance, a national urban parks advocacy organization; sits on the Parks Recovery Task Force for NRPA; and is a founding co-chair of San Francisco Children and Nature. He has been selected as a 2023 Fellow to Academy of Parks and Recreation Administrative Professionals. Ginsburg also coaches the mighty Bayview United Soccer Club, San Francisco’s first free public soccer club for Bayview youth. Open or Close Monica Hobbs Vinluan Robert Wood Johnson Foundation (Ashburn, VA) Monica Hobbs Vinluan joined the Robert Wood Johnson Foundation (RWJF) in 2015 as a senior program officer. She has been a passionate, professional advocate for health promotion and a distinguished government relations professional on a variety of health and well-being issues for two decades. Through her work at the foundation, Vinluan strives to ensure that all children in the United States have a healthy start. She views her role as “bringing new strategies and approaches to helping make sure all children get the nutritious foods and drinks they need to learn, grow and thrive.” Previously, Vinluan served as director of the Healthier Communities Initiatives for the YMCA of the USA, which catalyzed community- and state-level leadership teams to put in place strategies and policies that enabled people to make healthy choices. The Healthier Communities Initiatives — funded by the Centers for Disease Control and Prevention, RWJF and a host of other funders — created nearly 250 community teams and enacted 39,000 policy changes in advocating for physical activity, healthy eating and health equity policy strategies. Vinluan’s experience also includes serving as a senior policy associate with the National Recreation and Park Association. She has worked with the National Women’s Law Center, the Institute for Women’s Policy Research, the National Association of Child Advocates and in the office of former U.S. Senator Charles Robb of Virginia. Vinluan earned her Juris Doctorate at the American University Washington College of Law and her Bachelor of Arts in political science from Virginia Polytechnic Institute and State University (Virginia Tech). She was the recipient of the Sandra P. Grasso Scholarship for her commitment to advancing social justice and feminism, and also was honored for her work in opening the Women’s Center at Virginia Tech. Born in Virginia, Vinluan currently resides there with her husband and two children. She enjoys “just about any out-of-doors activities,” including hiking, camping and attending her children’s numerous sports activities. Open or Close Sean Johnson Director, City of University Park Parks and Recreation (University Park, TX) Sean Johnson, director of parks and recreation for City of University Park, is a transformational park and recreation professional with more than 25 years of progressive experience in municipal parks and recreation. His extensive experience, his work with elected officials to implement community-driven initiatives, and his openness to challenges have given individuals the confidence to pursue their passion. Johnson’s leadership and executive-level management skills have given him the opportunity to serve in large and small communities, working to bridge the gap between ideas and tangible action. In 2020, he was inducted as a fellow of the American Academy for Park and Recreation Administration. Prior to this appointment in 2020, Johnson served as managing director of parks, recreation and library services for City of Lancaster, Texas, and led them through CAPRA accreditation. He began his park and recreation career with the City of Dallas Park and Recreation Department as a summer youth leader. Upon attaining his Bachelor of Science from Texas Tech University, he began working full time, excelling and advancing to an executive-level manager. Johnson has served on various boards and committees on the national, state and local level, advocating for the preservation and development of parks and recreation, trails, and open spaces. These include the National Recreation and Park Ethnic Minority Society, the Texas Recreation and Park Society, the Dallas Park and Recreation Board, and the National Forum for Black Public Administrators North Texas Chapter. Johnson’s passion for parks and his commitment to improving the quality of life for the communities he serves has led him to support various initiatives and help secure more than $600 million in funding for parkland development, recreational facilities and programs. Open or Close Susie Kuruvilla, CPA, CPRP Gurnee Park District (Gurnee, IL) Susie Kuruvilla entered the park district world in 1997 as the superintendent of business services for Gurnee Park District in Illinois. In 2006, she was promoted as the executive director. Kuruvilla is a certified public accountant and has worked in the private sector and in a municipality previously. In 2010, the district won the National Gold Medal Award under Kuruvilla’s leadership. The district also achieved the Distinguished Accreditation Agency Award from the Illinois Association of Park Districts (IAPD) in 2010 and 2015. In 2013, Kuruvilla led the acquisition of a 75,000-square-foot Gold’s Gym facility and converted it into a park district-owned fitness facility named FitNation. Kuruvilla spearheaded a movement in Gurnee, named “GO Gurnee,” inspired by the message delivered by former U.S. Surgeon General, Dr. Vivek Murthy, at the 2015 NRPA Annual Conference. GO Gurnee encourages people to walk 30 minutes each day. The movement became so successful that it has been modeled in 25 other communities throughout Lake County in the past three years through a partnership with the Lake County Health Department. Under Kuruvilla’s leadership, the Gurnee Park District has thrived financially while maintaining the standard of excellence in customer service. Kuruvilla has served on various boards and committees and made many contributions to the field of parks and recreation over the past 20 years. She has served on the finance committees for IAPD, as well as the Park District Risk Management Agency (PDRMA). She currently serves as the chairperson for the PDRMA Health Benefits Committee and recently joined the board of directors for HR Source, a human resources (HR) association that provides HR-related consultation for public and private organizations including many park districts. Kuruvilla is an active member on the Joint Legislative Committee led by IAPD. Kuruvilla is a member of the local Exchange Club and Healthy Community Healthy Youth, a local organization focused on the health and well-being of young adults in the community. At a national level, Kuruvilla has served as a judge for the National Gold Medal Award for the past five years finishing her term as head judge in 2019. Kuruvilla has accomplished much during her tenure in the field. She has excelled at balancing work and play and aspires to give back to the parks and recreation field at a local, state and national level. She holds a strong desire to impact lives by expanding parks and recreational opportunities and improving quality of life for all. Open or Close Mollie Marsh-Heine Natural Resources Defense Council (Louisville, CO) Mollie Marsh-Heine is the chief development officer for Natural Resources Defense Council. Originally from Tennessee, Marsh-Heine attended high school, college and graduate school in Colorado. She received her undergraduate degree from the University of Colorado in 1993, followed by a master’s in business administration in 1999. Part of Marsh-Heine’s college experience included a year and a half at the University of Dar es Salaam in Tanzania. From an early age, Marsh-Heine has been drawn to the nonprofit world — working as an outdoor educator with the Denver Public Schools, Outward Bound instructor, youth intervention specialist, child advocate, outdoor education director, and eventually moving into more challenging leadership roles. From 1999 to 2004, Marsh-Heine worked for the Colorado Chapter of The Nature Conservancy (TNC) as director of operations, followed by three and a half years as the executive director for The Dairy Center for the Arts, a multi-disciplinary arts center in Boulder, Colorado. Her true passion stayed in environmental work, and she returned to TNC as director of philanthropy to lead their fundraising efforts for the continent of Africa. Her tenure with TNC culminated in a promotion to partner with the CEO and various vice presidents of The Nature Conservancy as a senior principal gifts officer — working with donors at the highest levels of philanthropy in complex and sophisticated donor engagement. Marsh-Heine then continued her path as a philanthropy professional and passionate environmentalist in her role as senior vice president of development with Earthjustice before joining Natural Resources Defense Council. When not trying to save the planet, Marsh-Heine lives in the foothills of Boulder County, Colorado, with her partner Seth, their children and Scout the Airedale Terrier. She enjoys just about every outdoor sport there is, live music, theater and art, wine and laughter with friends, and time with her family. Open or Close Joshua Medeiros, Ed.D., CPRE City of Bristol Parks, Recreation, Youth and Community Services (Bristol, CT) Dr. Joshua T. Medeiros serves as the superintendent of Parks, Recreation, Youth and Community Services for the City of Bristol, Connecticut and as an adjunct professor in the Department of Recreation, Tourism and Sport Management at Southern Connecticut State University in New Haven, Connecticut. Medeiros has an earned doctorate degree in educational leadership and a master’s degree in parks and recreation administration. Medeiros is a faculty member of the NRPA Directors School and is a practitioner representative on the Council on Accreditation of Parks, Recreation, Tourism and Related Professions. Medeiros is a Certified Parks and Recreation Executive (CPRE) and is an award winner of both his state and national park and recreation associations. He is a passionate, collaborative and engaging leader with executive level experience across several municipalities, a proven track record of excellence in administering multimillion-dollar department budgets, providing top-tier customer service to the public, managing all aspects of large-scale capital improvement projects, and developing master and strategic plans to guide long-range planning. Open or Close Kathryn Ott Lovell Present and CEO, Philadelphia Visitor Center Corporation (Philadelphia, PA) Kathryn Ott Lovell is president and CEO of the Philadelphia Visitor Center Corporation. She joined the corporation in July 2023, bringing significant leadership experience and service to the City of Philadelphia, most recently serving as the commissioner of Philadelphia Parks and Recreation (PPR) since 2016. As PPR commissioner, Ott Lovell instituted the department’s first strategic plan, which established a renewed vision and set in motion a powerful trajectory toward an equitable and exceptional park and recreation system that connects people to each other, enriching experiences and the natural world. She has led innovative initiatives to activate Philadelphia’s parks and engage residents and visitors citywide, including Enhanced PlayStreets, Swim Philly, The Oval+, Parks on Tap and the Philadelphia International Unity Cup soccer tournament. Ott Lovell also has spearheaded ambitious park projects, including the transformation of FDR Park and the reimagining of the Benjamin Franklin Parkway. Prior to joining Philadelphia Parks and Recreation, Ott Lovell served as executive director of the Fairmount Park Conservancy, where she elevated the organization’s profile and ushered in a dramatic shift in its strategic vision, building a host of new programs, executing high-profile projects and securing funding from an array of local and national funders. She also served as chief advancement officer for Mural Arts Philadelphia for six years, during a time of significant growth and programmatic shifts for the organization. Open or Close Stephanie Milewski, RLA, ASLA Stephanie Milewski’s career has focused on outdoor recreation – designing spaces for people to enjoy the outdoors, reconnect to nature, and improve their quality of life. Ms. Milewski has been engaged in Landscape Architecture starting with her earliest professional experience through an internship with Longwood Gardens after graduating with a Bachelor of Landscape Architecture from Penn State University. Since then, her twenty-six-year career has spanned both the public and private sector. She spent nearly 8 years as the Trail Manager and Environmental Program Officer for the Lackawanna Heritage Valley National and State Heritage Area before returning to consulting. Ms. Milewski is currently a Senior Project Manager at Herbert, Rowland & Grubic, Inc. (HRG), specializing in outdoor recreation projects that enhance the health, prosperity, and enjoyment of people throughout Pennsylvania. HRG is an employee-owned, full-service civil engineering and related services firm that assists with the planning, design, and management of communities that like Ms. Milewski, is driven by a “people first” strategy to improving spaces. Ms. Milewski’s passion for creating awareness of the outdoors, expanding and improving trails, and promoting the importance of bicycling/pedestrian accessibility is evident in her service to several organizations and non-profits. She proudly serves as the President of the Pennsylvania-Delaware Chapter of the American Society of Landscape Architects; a member of the Lackawanna Luzerne MPO Transportation Advisory Committee; as former chair and current planning committee member of the NEPA Trails Forum; as past Board of Directors’ Vice President for the North Pocono Trails Association; and as a founding member and past board member with the Anthracite Bicycling Coalition. Her volunteer involvement ranges from grassroot associations to established 501(c) 3 organizations. When not investing her time into enhancing the communities she serves, Ms. Milewski can be found camping, hiking, and biking with her husband, twin sons, and energetic rescue dogs. Open or Close Ben Page Director, Des Moines Park and Recreation Department (Des Moines, IA) Ben Page is a park and recreation professional skilled in departmental leadership who has contributedpositively to quality-of -life enhancements within small and large communities. Page genuinely believes that all communities benefit from park and recreation services and that these investments are essential. Page was named director of the Des Moines Park and Recreation Department in November 2012. He is responsible for a $15 million operating budget and a six year, more than $50 million capital improvement program; 60 full-time and more than 300 part-time employees; multiple contracts, leases and operating agreements to provide privatized service; 77 parks and open spaces; more than 4,000 acres of park and open space land; 69 miles of paved trails; three golf courses; aquatics centers and a beach; a marina; community recreation centers; sports complexes; performing arts amphitheaters; a world-class artists’ sculpture park; a riverwalk; a AAA baseball stadium; a zoological park; a botanical center; citywide streetscapes; cemeteries; a skating plaza; and recreational programming. The department was recognized in 2023 with the American Academy for Park and Recreation Administration’s Gold Medal, an award given annually to only four cities, divided into four population categories that demonstrate excellence in long-range planning, resource management and innovative approaches to delivering superb park and recreation services with fiscally sound business practices. Prior to his appointment as director, he served as the assistant director in Des Moines for six years, and prior to that as the director of park and recreation in Manchester, Iowa, for six years. He has been a member of NRPA and the Iowa Park and Recreation Association (IPRA) since 2001 and has served in many capacities for IPRA, including as president of the association from 2009 to 2011. Page received the highest honor from IPRA, the Slattery/Trueblood Professional Award, in 2015. He also was recognized in 2013 by the Business Record of Des Moines as a 40 under 40 award recipient for career achievements, community involvement and civic activities. Open or Close John Prue, CPRP Navy Region Mid-Atlantic (Kenosha, WI) John Prue, CPRP, is the Morale, Welfare and Recreation (MWR) program analyst for Navy Region Mid-Atlantic. In direct support of the fleet readiness director (N92), Prue conducts analytical and evaluative duties to assess the overall effectiveness of MWR programs at 14 installations and nine annex sites across a nine-state area. Previously, Prue served as the installation program director for the MWR Department at Naval Station Great Lakes. As the chief administrator for the commanding officer, he assured a comprehensive quality-of-life program for more than 25,000 Navy personnel, their family members, retirees and other eligible patrons. He had management oversight of an organization that employed approximately 365 team members and had more than 20 different facilities and programs that included general recreation, sports and fitness, community activities, child and youth services, a lodging/hospitality program, entertainment clubs, restaurants and other revenue-producing business activities. In 2012, Prue’s MWR team won the coveted National Gold Medal Award and was the first-ever military installation to win this award. Under his leadership, the MWR team consistently held the Commander Navy Installations Command (CNIC) Five-Star Accreditation, which exemplifies the highest standards of MWR operations and management. In September 2020, Prue retired from Naval Station Great Lakes after 34 years of service. In 2017, Prue served as a special assistant to the Department of Defense (DoD) Warrior Games, supporting the coordination, planning and sponsorship for a nine-day Paralympic-style adaptive sports competition in City of Chicago. The DoD Warrior Games played host to 265 wounded warriors from all branches of the armed services, including athletes from the United Kingdom and Australia. Prue has been an active member of NRPA and the Armed Forces Recreation Network, speaking at numerous conferences, contributing to Parks & Recreation magazine, serving on the Conference Program Committee for eight years and as the committee chairperson in 2020. He also is an elected member of the American Academy for Park and Recreation Administration, serving as one of 125 practitioners and educators throughout the country who enhance the practice of park and recreation administration and broader public understanding of the importance of parks and recreation. Prue holds a bachelor’s degree in recreation administration from the University of Wisconsin-La Crosse and a master’s degree in management from Webster University, St. Louis, Missouri. He has received numerous individual awards to date, including the Department of the Navy’s Meritorious Civilian Service Award in 2020 and in 2003 for his outstanding contributions to the Navy mission. In addition, he received the Armed Forces Recreation Society Fellow Award in 1993 and the Executive Fellow Award in 2008 for his achievements in improving the quality of life for active-duty personnel and their family members. Upon his retirement from the MWR director position, he received the Navy MWR Lifetime Achievement Award for his years of services at Naval Station Great Lakes and support to the overall Navy MWR mission. Open or Close Arnold L. Randall Forest Preserve District of Cook County (Chicago, IL) Arnold L. Randall is the general superintendent of the Forest Preserve District of Cook County (Forest Preserves) and is responsible for the day-to-day management of one of the nation’s oldest and largest forest preserve systems. He was appointed to this position by Forest Preserves President Toni Preckwinkle in December 2010. During Randall’s tenure, the Forest Preserves has made notable strides in becoming a more transparent, accountable and strategic government agency, with an increased focus on restoring and protecting Cook County’s most precious natural areas. Key accomplishments include the ambitious Next Century Conservation Plan; a multi-year Centennial celebration to bring new and diverse audiences to the preserves; developing and launching strategic plans for camping, recreation, trails and habitat restoration; creating an independent advisory Conservation and Policy Council comprised of civic and business leaders; and opening five new campgrounds that re-establish the legacy of camping in the preserves. Randall previously served as director of the Office of Civic Engagement at the University of Chicago, where he helped plan and coordinate major public projects undertaken by the University, working as a liaison between the University and the city, neighbors and other concerned parties. He was a key part of the Chicago 2016 Olympic Bid Committee’s community outreach team and previously worked as commissioner of the City of Chicago’s Department of Planning and Development, where he directed the department’s leadership responsibilities for promoting economic development in Chicago by helping new and existing businesses meet their goals for growth while creating new jobs for city residents. In addition, Randall served in a number of roles with the Chicago Park District between 1995 and 2007, including director of legislative and community affairs, director of planning and development, and lakefront area and southeast region manager. Highlights of his tenure included leading the district’s efforts to coordinate and host an urban parks summit featuring representatives from the 25 most populated cities in the United States, which resulted in an urban parks federal agenda; overseeing the park district’s capital improvement plan, including the initial planning and community workshops for the development of Northerly Island; and managing the operation of 126 park locations on the south side of Chicago. Randall holds a Bachelor of Arts degree in political science from the University of Illinois at Chicago and attended the University of Chicago’s School of Social Service Administration. Randall has been active in numerous civic and professional organizations, including Chicago Community Development Commission (serving as the chairman), Chicago Wilderness (serving as the chairman), The Chicago Plan Commission, Commission on Chicago Landmarks, the Public Buildings Commission, the Woodlawn Children’s Promise Community, Woodlawn New Communities Program, American City Planning Directors’ Council, American Planning Association, Illinois Parks and Recreation Association, NRPA, the South East Chicago Commission Executive Committee, the Harper Court Foundation Board, and the 53rd Street TIFAdvisory Board. Open or Close Breece Robertson One Tree Planted (Santa Fe, NM) Breece Robertson combines geospatial technology and storytelling to inspire, activate, educate and engage people to protect our planet. She is a noteworthy leader in the conservation and parks field with more than two decades of experience. She currently holds the position of Chief Impact Officer at One Tree Planted. Previously, she served as director of partnerships and strategy at the Center for Geospatial Solutions at the Lincoln Institute of Land Policy, engaging in geospatial initiatives to connect partner ecosystems and guides game-changing geospatial innovations to fill critical gaps and improve upon legacy methodologies to meet ambitious land, water, climate and equity goals. She also created and led the geographic information system (GIS), research and planning unit at The Trust for Public Land and built strategic initiatives, like ParkScore, ParkServe and Greenprinting. In 2006, she was awarded the Esri Special Achievement in GIS award and in 2012, the Making a Difference award. She authored a book, Protecting the Places We Love, which was published in April 2021 by Esri Press. When she’s not protecting places, she’s exploring and enjoying them. Open or Close Shonnda Smith Executive Director, Parks and Public Services (Mobile, AL) Shonnda Smith is the executive director of Parks and Public Services for the City of Mobile. Shonnda is responsible for ensuring smooth operational delivery of department initiatives spanning the directorate which includes Accreditation and Compliance, Events, Parks and Recreation, Public Services, and Strategic Initiatives. Prior to this role, Shonnda served as deputy executive director of Public Works after making her debut in the Parks and Recreation Department as its director in 2019. Shonnda quickly developed a reputation for being a visionary and an agent of change. Through her transformational leadership, Shonnda has revamped programming and policies, while promoting employee empowerment through professional development. Shonnda serves on the Board of the Mobile Arts Council, is vice-chair of the Bishop State College Foundation, and holds seats on the Program Committee and Magazine Editorial Board of the National Recreation Parks Association (NRPA). Open or Close Hashim Taylor, CPRE Director, City of Cedar Rapids Parks and Recreation (Cedar Rapids, Iowa) Hashim Taylor assumed the role of Director of Parks and Recreation for the City of Cedar Rapids in January 2022. Originally from Alexandria, Virginia, Hashim brings over a decade of comprehensive experience in Parks and Recreation, with a distinguished career encompassing various professional and managerial positions in major cities, including Virginia Beach, Norfolk, Woodbridge and Alexandria. Prior to his appointment in Cedar Rapids, Hashim served as the Recreation Program Manager for Prince William County Virginia's Department of Parks, Recreation, and Tourism. As Director, Hashim is responsible for overseeing all aspects of Parks and Recreation operations, including Parks, Recreation, Golf, Forestry, and the ReLeaf Cedar Rapids plan. His tenure has been marked by a commitment to expanding programming for diverse populations, enhancing operational efficiency in facilities, and integrating the city's \"Culture of Commitment\" into the Parks and Recreation Strategic Plan. Hashim has been instrumental in several key initiatives, such as the Greenway Parks Plan update, the development of the Westside Library Park Project, the Community Gardens in Parks plan, and the Dual-Use Intergenerational Feasibility Study. Under his leadership, Cedar Rapids has seen the addition of new facilities including the Ellis Golf Course Clubhouse and Event Center, Jones Lodge, Hughes Park, a second Rollin' Recmobile, Riverside Skatepark, a 12th Avenue dog park, a pickleball complex with ten courts, and Jones Park dog park. Hashim holds a Bachelor of Science in Parks, Recreation, and Tourism from Old Dominion University and a Master of Business Administration from Regent University. He is a Certified Parks and Recreation Professional (CPRP) and has served as Treasurer for the Virginia Recreation and Park Society's Northern Service Area. His professional development includes graduating from The National Association of Counties (NACo) High-Performance Leadership Academy and completing the two-year National Parks and Recreation Association Director School program. In 2022, Taylor was honored as a \"30 Under 30\" recipient by the National Park and Recreation Association. Open or Close Linden Weiswerda Linden Weiswerda is a Data Insights Analyst with the Minneapolis Park and Recreation Board. His work in local park operations and programming brings a data-informed approach to projects focused on sustainability, equity, and recreation. He is most proud of having developed a framework that uses community data to equitably allocate more than $10 million in annual capital improvement program funds. He has also led efforts to analyze and then reduce the agency’s carbon footprint by 37% in just 5 years. Linden is a LEED Green Associate and has previously worked at the Trust for Public Land and the Minnesota Department of Health’s Climate and Health Program. He also served as chair of the Open Space and Recreation Commission for the City of Golden Valley, MN. Linden holds a Master’s of Urban and Regional Planning from the Humphrey School of Public Affairs, and a Bachelor’s from Washington University in St. Louis. He is currently completing an Advanced Certificate in Applied Urban Science and Informatics from New York University. In addition to his professional accomplishments, Linden’s passion for soccer, both as a lifelong player and youth coach, reflects his broader commitment to teamwork and to providing high quality recreation experiences for all. He enjoys park maps almost as much as his 5-year-old daughter and knows almost as much about park wildlife as his 6-year-old son; soon he will be welcoming a third child with his partner Hannah, a teacher in Hopkins Public Schools. Open or Close Tiffany White-LaPierre Independent Contractor (Redlands, CA) Tiffany White-LaPierre is a CPRE with nearly 20 years of experience in the park and recreation industry. Her career spans across the country, having lent her talents to organizations in Illinois, Florida, California and Texas. She has held roles specializing in recreation programming, facility operations, special events, day/overnight camps, afterschool programs, teen programs, membership/guest services, arts and media, and consulting. An advocate for continuing education and service to the profession, White-LaPierre earned a Bachelor of Science in recreation, sport and tourism; Master of Science in sport management; Master of Arts in management; and is earning her doctorate in education, specializing in workplace learning, training and instructional design. She has served on numerous boards and committees on the local, state and national levels, including the NRPA National Certification Board, Women in Parks and Recreation Board, National Association of Park Foundations Board, Texas Recreation and Park Society Marketing and Communications Committee, and the Central Illinois Council for Leisure Experiences Board. White-LaPierre currently resides in Redlands, California, about 50 miles east of Los Angeles. Open or Close Philip Wu, M.D. (retired) Kaiser Permanente Northwest Region (Portland, OR) Dr. Philip Wu, a retired pediatric obesity specialist from Kaiser Permanente Northwest Region, has been a pediatrician with Kaiser since 1997. His special interests include obesity prevention in children and promoting healthy living for families. He is currently working on broadening the scope of healthcare to include collaboration with community organizations/businesses in addressing healthcare disparities. Dr. Wu serves on several community boards, including the Northwest Health Foundation, Oregon Oral Health Coalition, Outside In, The Intertwine Alliance and Oregon Environmental Council. He has an interest in transportation as a “social determinant” and has participated on the transportation committee of the Westside Economic Alliance, the Washington County Transportation Futures Study project and Oregon Department of Transportation’s Transportation Options Policy Advisory Committee. He recently concluded two years of service on Metro’s Equity Strategy Advisory Committee. He received a bachelor’s degree from Stanford University and completed his residency at Madigan Army Medical Center in Tacoma, Washington. Dr. Wu and his partner enjoy walking, hiking and simply being in nature. Life Trustees Open or Close View List Beverly D. Chrisman Lexington, SC *Anne S. Close Fort Mill, SC James H. Evans New York, NY Rosemary Hall Evans Sugar Hill, NH Earl T. Groves Gastonia, NC Charles E. Hartsoe, Ph.D. Richmond, VA Kathryn A. Porter Mendham, NJ Perry J. Segura New Iberia, LA R. Dean Tice Round Hill, VA Eugene A. Young, CPRP Baton Rouge, LA * deceased NRPA Senior Staff Open or Close Chief Operating and Financial Operator: Candice L. Carnage Candice L. Carnage joined NRPA in September 2022 as Chief Operating and Financial Officer. Previously she worked at The Bronx Defenders, leveraging her love for numbers and problem solving into the Chief Operating Officer role for the $50 million legal organization that redefined public defense and pioneered the holistic defense model. She is a versatile, high-energy executive with more than 25 years nonprofit experience, who leads organizations through change and challenge to support their mission including the Innocence Project, Ms. Foundation for Women, and Amnesty International, USA. Her additional background with Deloitte and Touché and Bad Boy Worldwide Entertainment after graduating from Columbia Business School solidify her background as a music lover who is also an accountant. She is thrilled to take on the new role of Chief Operating and  Financial Officer at NRPA. Open or Close Chief Communications and Engagement Officer: Clarissa García Clarissa García joined NRPA in January 2023 in the role of Chief Communications and Engagement Officer. She comes to the organization from the American Hear t Association (AHA) where she spent 18 years in a variety of roles. Most recently Clarissa led patient awareness and education campaigns overseeing the marketing and communications strategy, in addition to overall program development. These efforts resulted in improved diagnosis and treatment for patients and their families. In her early years at AHA, Clarissa led the organization’s national grassroots advocacy program building campaigns that led to the successful passage of federal legislation benefitting heart and stroke patients. Clarissa lives in the Memphis, Tennessee, area with her husband, two kids and their golden retriever. Open or Close Chief Education & Equity Officer: Autumn Saxton-Ross Autumn Saxton-Ross, PhD, a DC resident and mom of two, will join the National Recreation and Park Association in September as Vice President of Education & Chief Equity Officer, after having served as Mid-Atlantic Regional Director and Equity, Inclusion and Diversity Lead for NatureBridge. In that role she oversaw programs at Prince William Forest and Shenandoah National Parks in Virginia. NatureBridge is the largest residential environmental education partner of the National Park Service, and its mission is to connect young people to the wonder and science of the natural world, igniting self-discovery, and inspiring stewardship of the planet. Through its overnight, hands on programs, NatureBridge connects children to themselves and others. In her previous position as the Program Director for Place-based Initiatives at the National Collaborative for Health Equity, she worked to encourage the use of policy and environmental change as a solution to health inequities, focusing on communities of color. She managed the Kellogg funded PLACE MATTERS initiative – a national learning laboratory that builds the capacity of local leaders to identify and address the social, economic, and environmental conditions that shape health, opportunities and resources and promotes innovative strategies to address those conditions in order to create a national health equity movement. Previously, she has been the Physical Activity, Nutrition and Obesity (PANO) Specialist for the DC Department of Health and the Assistant Director for Health in Parks for Washington Parks & People. In those positions, she focused on environmental and policy approaches to healthy eating and active living and promoting the natural connection between parks, recreation and health. Prior to receiving her doctorate, she was the Health and Wellness Coordinator for both Montgomery County and DC Recreation departments, taught Women’s Health for Howard University and was an Elementary Physical Education and Health teacher for DC Public Schools. With degrees in sociology, health education, and exercise science, her research, academic and professional interests are on the social and physical environment and their influences on physical activity, opportunity and resources, specifically in Black and urban populations, and the health benefits of parks and green spaces. Her life’s work is improving the health of communities through engagement, activity, education, exposure and opportunity, truly believing that a healthy life is lived better outdoors. Open or Close VP of Membership and Certification: Julie Boland, CPRE Julie Boland joined NRPA in 2008 and serves as the Vice President of Membership and Certification.  In this role, Boland develops and oversees the association’s membership and certification initiatives. She received her Bachelors of Science in Forestry from Purdue University and has been working in the field of parks and recreation since 2000. Prior to her time with NRPA, she served as the Parks Director for the City of Crown Point, Indiana. She is a Certified Park and Recreation Executive (CPRE) from the National Recreation and Park Association and a Certified Association Executive (CAE) from the American Society of Association Executives. Open or Close Chief Partnerships Officer: Kellie May Kellie May joined NRPA in 2010 and serves as the Vice President of Programs and Partnerships. In her role, May oversees the strategic direction of NRPA’s philanthropic programs and initiatives, including working to establish new relationships with partners and donors. Previously, she served as NRPA’s Director of Health and Wellness and has a demonstrated background in helping local park and recreation agencies implement strategies to improve healthy eating and increase physical activity. Prior to joining NRPA, May worked at SHAPE America, previously the American Alliance for Health, Physical Education, Recreation and Dance where she worked to increase physical activity for young children. She has more than ten years of experience managing health and physical activity programs and has a Master’s degree from George Washington University. Open or Close Chief Research and Impact Officer Dr. Garrett Warfield joined NRPA in fall 2024 as our Chief Research and Impact Officer. He has over 20 years’ experience in applied research and program evaluation in the social sector. Most recently, Garrett was the Chief Research Officer for the $200 million/year renowned workforce development enterprise, Year Up United. There, he spent 10 years building from scratch a research and evaluation department and dozens of research partnerships to build evidence for impactful workforce programming and expand skills-first hiring practices nationally. Prior to Year Up United, Garrett led impact measurement and was an all-around data nerd for many diverse programs focused on gun-crime intervention, prison-based mental health care and community work release, veteran combat trauma response and care, and strengthening parent-child relationships. Garrett holds a B.A. in psychology and statistical methods from Boston University, an M.Sc. in criminology with forensic psychology from Middlesex University in England, and a Ph.D. in criminology and justice policy from Northeastern University. He volunteers and serves as an advisor to multiple local and national organizations, including The Possible Zone and Results for America. Do You Have a Question for the NRPA Board? If you have a question for the NRPA Board of Directors, please feel free to submit your question . News Stories Contact Us Members of the media with inquiries or interview requests should contact NRPA's Press Team at press@nrpa.org . Related The Insider’s Guide to the 2025 NRPA Annual Conference — Episode 171 Listen Now Free Food Program is Eradicating Health Disparities Read More National Recreation and Park Association (NRPA) 22377 Belmont Ridge Rd Ashburn, VA 20148-4501 PH: 800.626.NRPA (6772) Contact Us Press Inquiries Privacy Policy Terms and Conditions Parks & Recreation 2025 Playground Guide The Playground Guide features ASTM and U.S. CPSC standards updates, as well as maintenance strategies for lasting play spaces. Learn More Connect With Us X Close"
    },
    {
      "url": "https://discover.pbc.gov/coextension/pages/staff-directory.aspx",
      "text": "Cooperative Extension\r\n            \r\n            \r\n            Staff Directory You may be trying to access this site from a secured browser on the server. Please enable scripts and reload this page. Skip to main content ADJUST FONT SIZE: RESET Jobs Links Departments Contact Us It looks like your browser does not have JavaScript enabled. Please turn on JavaScript and try again. Cooperative Extension Menu Cooperative Extension Home Program Areas Agriculture Environmental Horticulture Family & Consumer Sciences 4-H Youth Master Gardener Volunteers Mounts Botanical Garden About Us Staff Directory Currently selected Events Calendar Staff Directory Page Content ​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ ​​​​​General Information: ​​​ Hours: Monday - Friday 8AM - 5PM​ ​559 ​​N Military Trail​ West Palm Beach, FL 33413 Phone: 561-233-1700 ​​ Fax: 561-233-1768 ​ 2976 State Road 15 Belle Glade, FL 33430 Phone: 561-996-1655 ​ Fax: 561-996-4831 ​​ ​​​​​​​​​​​​​ Page Content 1 Agriculture Cesar Asuaje Job Title: Agent - Agriculture/Farm Labor Education Phone: 561-233-1727 Fax: Email: casuaje@pbc.gov Matthew VanWeelden Job Title: Agent - Sugarcane, Rice & Sod (Belle Glade) Phone: 561-993-1579 Fax: Email: mvanweelden@pbc.gov Anna Meszaros Job Title: Agent - Vegetables and Tropical Fruit Phone: 561-233-1718 Fax: Email: ameszaros@pbc.gov Jenna Curtis Job Title: Agent - Agriculture Safety (Belle Glade) Phone: 561-996-1657 Fax: Email: jcurtis2@pbc.gov Environmental Horticulture John Roberts Job Title: Agent - Commercial Horticulture Phone: 561-233-1713 Fax: Email: jroberts1@pbc.gov Emily Marois Job Title: Agent - Urban Horticulture Agent Phone: 561-233-1758 Fax: Email: emarois@pbc.gov Kara Krueger Job Title: Environmental Horticulture Agent Phone: 561-233-1748 Fax: Email: Kkrueger@pbc.gov Candace Smith Job Title: Secretary Phone: 561-233-1759 Fax: Email: csmith5@pbc.gov Master Gardener Volunteer Help Desk Job Title: Phone: 561-233-1750 Fax: Email: MasterGardener@pbc.gov Mounts Botanical Garden James May Job Title: Garden Director Phone: 561-233-1756 Fax: Email: Jmay@pbcgov.org Debbie Treccioli Job Title: Garden Administrative Assistant Phone: 561-233-1733 Fax: Email: dtreccioli@pbc.gov Misty Stoller Job Title: Director of Marketing & Commerce Phone: 561-233-1756 Fax: Email: Mstoller@pbc.gov April Krebs Job Title: Special Projects Manager- Adult Programming & Tours Phone: 561-233-1775 Fax: Email: Akrebs@pbc.gov Rachel Lucas Job Title: Membership Programs Manager Phone: 561-233-1755 Fax: Email: RLucas@pbc.gov Cristina Stakermann Job Title: Digital Marketing Specialist Phone: 561-233-1796 Fax: Email: Cstakermann@pbc.gov Aynari Garcia Job Title: Education Assistant Phone: 561-233-1766 Fax: Email: Agarcia2@pbc.gov Mark Jerrett Job Title: Gift Shop/Nursery Retail Manager Phone: 561-233-1778 Fax: Email: mjerrett@pbc.gov Palmer Crippen Job Title: Horticulturist Phone: 561-233-1789 Fax: Email: PCrippen@pbc.gov Family and Consumer Sciences Cyndi Longley Job Title: Agent - Family and Consumer Sciences Phone: 561-233-1744 Fax: Email: clongley@pbc.gov Danielle Navarro Job Title: Agent- EFNEP Program Phone: 561-233-1773 Fax: Email: ddevries@pbc.gov Yesenia Rodriguez Job Title: Agent - Family and Consumer Sciences Phone: 561-233-1740 Fax: Email: yrodriguez@pbc.gov Andrea Matute Job Title: EFNEP Secretary Phone: 561-233-1724 Fax: Email: amatute@pbc.gov Nancy Baum Job Title: EFNEP Secretary Phone: 561 233-1724 Fax: Email: Nbaum@pbc.gov Joyce Sookram Job Title: EFNEP Program Assistant Phone: 561-233-1746 Fax: Email: jsookram@pbc.gov Jessica Alamillo Job Title: EFNEP Program Assistant Phone: 561-233-1780 Fax: Email: jalamillo@pbc.gov Patricia Kujundzic Job Title: ENFEP Program Assistant Phone: 561-233-1787 Fax: Email: pkujundzic@pbc.gov Marie Francois Job Title: EFNEP Program Educator Phone: 561 222-1787 Fax: Email: MFrancois@pbc.gov Michele Powell Job Title: FNP Nutrition Educator Phone: 561-233-1728 Fax: Email: mpowell@pbc.gov Waneshia Cameron Job Title: FNP Nutrition Educator Phone: 561-233-1728 Fax: Email: wcameron@pbc.gov Lurene Leatherwood Job Title: FCS Secretary Phone: 561-233-1741 Fax: Email: lleatherwood@pbc.gov Carolyn Martino Job Title: Clerk Typist Phone: 561-233-1793 Fax: Email: cmmartin@pbc.gov 4-H Youth Noelle Guay Job Title: Agent - 4-H Youth Development Phone: 561-233-1726 Fax: Email: nguay@pbc.gov Daniel Gonzalez Job Title: Agent - 4-H Youth Development (Belle Glade) Phone: 561-996-1656 Fax: Email: dgonzalez@pbc.gov Maivette Lorenzo Job Title: 4-H Program Assistant Phone: 561-233-1794 Fax: Email: mlorenzo@pbc.gov Barbara Hernandez Job Title: Program Assistant Phone: 561-233-1792 Fax: Email: Bhernandez@pbc.gov Ann Hartman Job Title: Ag/4H Program Assistant (Belle Glade) Phone: 561-996-1655 Fax: Email: Dhartman@pbc.gov Niki Heun Job Title: Program Assistant Phone: 561-233-1791 Fax: Email: Theun@pbc.gov Administration Ronald W. Rice Job Title: Extension Director Phone: 561-233-1711 Fax: Email: rrice@pbc.gov Elinor Broullon Job Title: Administrative Secretary Phone: 561-233-1712 Fax: Email: ebroullo@pbc.gov Melissa Allman Job Title: Secretary Phone: 561-233-1714 Fax: Email: mallman@pbc.gov Amy McKnight Job Title: Graphics Designer Phone: 561-233-1745 Fax: Email: amcknight1@pbc.gov Page Content 2 PBC Mission Statement To drive a continuous improvement culture of excellence that achieves a measurably high level of public satisfaction. Read More Site Directory PBC.GOV Government Residents Business Things To\r\n                                                Do Online\r\n                                                Services Departments Jobs Contact\r\n                                                Us Useful Links PBC\r\n                                                Business Opportunities Volunteer\r\n                                                Opportunities Links Publications Stay\r\n                                                Connected! Web Site Disclaimer District Locator BCC\r\n                                                Meetings Sign In Accessibility Statement Home Links Jobs Contact Us © Copyright Palm Beach County, FL."
    },
    {
      "url": "https://www.idaireland.com/contact-us",
      "text": "IDA Ireland Contact Information | Contact Us | IDA Address Location | IDA Ireland Skip to main content Menu Why Ireland Why Ireland Talent Find and nurture the people you need to make your business thrive here in Ireland Ireland's Economy An enduring location for investment Infrastructure Resilient and flexible infrastructure to support your business Quality of Life Work and life. Balanced. Featured Success Story Dublin site is a regional hub for product development Dublin is such a hub for big tech companies that you might think ‘if we come to Dublin, we’re going to be competing with all of them, we won't be able to get good staff’. But I think the opposite is true. Because we’ve got such a base of well recognised brands in Dublin, that actually brings qualified people from all over Europe here. Jon Ross VP of Product, Messaging, Zendesk Read more about Zendesk Explore Your Sector Explore Your Sector Engineering Come to the place for growing numbers of industrial engineering and technology companies Media Tap into a source of storytellers, makers and creators in media, digital, gaming and more Green Economy Set up in a sustainable location for investment that supports your environmental goals MedTech Be part of one of Europe’s largest MedTech exporters and a global centre of excellence BioPharma: Why Invest in Ireland Align with the world's third largest pharmaceuticals exporter – a proven path into Europe Business Services Avail of high quality IT, superb infrastructure and talent to serve major markets Technology See why the world’s leading names in tech choose Ireland as a strategic base Financial Services Join a thriving international financial services hub serving every major global economy Featured Success Story Company set up European HQ in Cork in 2022 Cork has become the global hub of choice for international headquarters of technology companies, home to over 100 technology companies. With over 40,000 students across Cork’s two universities, NetApp’s decision to base its international headquarters in Cork provides access to a talent pool that is truly worthy of supporting the robust and evolving technology market. As well as being a part of the vibrant emerging business scene in Cork, NetApp’s hybrid working model means there are opportunities for technical and non-technical candidates across Ireland. Debra McCowan Executive Vice President, Chief Human Resources Officer, NetApp Read more about NetApp Success Stories Scale With IDA Scale With IDA Grants & Supports Supporting your investment in Ireland Land and Expand A place to grow and scale your business internationally? People Your partner on your investment journey Here to Help You You’re in good hands Funding Programmes & Incentives Supporting your investment in Ireland Innovation Invent. Transform. Disrupt. IDA Ireland Service Directory Your guide for dedicated professional services in Ireland Properties A range of property solutions to fit your business needs Latest News Get in touch 한국 India Brasil Italia España 日本 Deutschland 中国 France Ireland Search... Search Home Contact Us The First Step on Your Journey Here to Guide You At IDA Ireland, we pride ourselves on helping our clients make the connections they need to grow their business from Ireland. Dedicated, responsive, professional. Everything you need to make the right investment decision. Find your local office Work with us Connect with us today Topic --Select-- Expanding into Ireland Scale your Irish-Based Multinational Research & Development in Ireland European Headquarters Other query First Name Surname Email Address Country --Select-- Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Columbia Comoros Congo Cook Islands Costa Rica Cote d'Ivoire Croatia Cuba Curaçao Cyprus Czech Democratic Republic of Congo Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands Federal Republic of Somalia Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia (Federated States of) Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory, Occupied Panama Papua New Guinea, Independent State of Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Republic of Moldova Réunion Romania Russia Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands South Africa South Georgia and South Sandwich Islands South Sudan Spain Sri Lanka St. Maarten (Dutch Part) Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu U.S. Virgin Islands UAE Uganda Ukraine United Kingdom United States Minor Outlying Islands United States of America Uruguay Uzbekistan Vanuatu Vatican Venezuela, Bolivarian Republic of Vietnam Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Company/Institute Company Size --Select-- Small enterprise (10 to 49 employees globally) Medium-sized enterprise (50 to 299 employees globally) Large enterprise (300 employees or more globally) Company sector --Select-- Tech Financial Services Biopharma MedTech Engineering Media Business Services Green Economy Message hiddennobot IDA Ireland - Dublin 2 IDA Ireland Three Park Place\r\nHatch Street Upper Dublin 2 D02 FX65 View IDA Ireland - Dublin 2 on Map +353 1 603 4000 idaireland@ida.ie IDA Ireland Global Offices With a team of over 250 people in Ireland and overseas, we work to make every FDI investment in Ireland a success. Connect with our industry experts to discover the best solution for your company in Ireland. Find IDA near you IDA Ireland Regional Offices Jump to region Border Dublin Mid East Mid West Midlands South East South West West Border Contacts Michelle Conaghan Regional Business Development Manager IDA Ireland Finisklin Business & Technology Park\r\nF91 RHH9 Sligo View IDA Ireland - Sligo on Map (opens in a new tab) +353 71 9159710 Email idaireland@ida.ie Michelle Conaghan Regional Business Development Manager IDA Ireland Co-Lab Building\r\nATU\r\nPort Road \r\nLetterkenny\r\nF92 C5XK Donegal View IDA Ireland - Donegal on Map (opens in a new tab) +353 74 9169810 Email idaireland@ida.ie James Boyle Regional Business Development Manager Finnabair Business and Technology Park Dundalk View IDA Ireland - Dundalk on Map (opens in a new tab) +353 49 436 8820 Email idaireland@ida.ie Dublin Contacts Conor Simpson Dublin Regional Manager IDA Ireland Three Park Place\r\nHatch Street Upper Dublin View Head Office on Map (opens in a new tab) +353 1 603 4000 Email idaireland@ida.ie Mid East Contacts Conor Simpson Regional Business Development Manager IDA Ireland Three Park Place\r\nHatch Street Upper Dublin 2 View IDA Ireland - Dublin 2 on Map (opens in a new tab) +353 1 603 4000 Email idaireland@ida.ie Mid West Contacts Regional Business Development Manager Roselawn House National Technology Park Limerick View IDA Ireland - Limerick on Map (opens in a new tab) +353 061 200513 Email idaireland@ida.ie Midlands Contacts Carole Green Midlands Regional Manager IDA Ireland Athlone Business & Technology Park\r\nGarrycastle\r\nDublin Rd Athlone View Midlands Office on Map (opens in a new tab) +353 90 6471500 Email idaireland@ida.ie South East Contacts Brian McGee Regional Manager IDA Ireland South East Regional Office\r\nIDA Industrial Park Cork Road View South East Office on Map (opens in a new tab) Email idaireland@ida.ie Fiona Lonergan Regional Business Development Executive IDA Ireland South East Regional Office\r\nIDA Industrial Park Cork Road View South East Office on Map (opens in a new tab) +353 51 333 055 Email idaireland@ida.ie South West Contacts Patrick Doyle Regional Business Development Manager IDA Ireland Industry House\r\nRossa Avenue Bishopstown View South West Office on Map (opens in a new tab) +353 21 4948300 Email idaireland@ida.ie West Contacts Ricky Conneely Regional Business Development Manager IDA Ireland Mervue Business Park Galway View West Office on Map (opens in a new tab) +353 91 865300 Email idaireland@ida.ie About IDA Ireland HTML Site Map Accessibility Annual Reports Corporate Governance Careers at IDA Ireland FAQ Adapt Intelligently: A Strategy for Sustainable Growth and Innovation 2025-29 Information Compliance Legal Our History Privacy Sign up for our ezine Submit By clicking subscribe you are confirming that you agree to our Terms and Conditions . Copyright IDA Ireland 2025 ©"
    },
    {
      "url": "https://discover.pbc.gov/communityservices/humanservices/Pages/Contact-Us.aspx",
      "text": "Community Services - Human Services\r\n            \r\n            \r\n            Contact Us You may be trying to access this site from a secured browser on the server. Please enable scripts and reload this page. Skip to main content ADJUST FONT SIZE: RESET Jobs Links Departments Contact Us It looks like your browser does not have JavaScript enabled. Please turn on JavaScript and try again. Community Services - Human Services Menu Community Services - Human Services Home Community Services Human Services Services Homeless Homeless Services Homeless Outreach Form Homeless and Housing Alliance Royal Palm Lakes Funding Opportunities ESG NOFO’s CoC NOFO’s FAQs Contact Us Currently selected Contact Us Page Content ​​​​ ​North County Office (Service area: North side of Forest Hill Boulevard to the Martin County line) Address: 1440 Martin Luther King Blvd., Riviera Beach, FL 33404 Phone: 561-694-7450 Monday-Friday (8 a.m. to 5 p.m.) South County Office (The South side of Forest Hill Blvd. to the Broward County Line) 225 South Congress Avenue Delray Beach, FL 33444 Phone: 561-274-1130 Monday-Friday (8 a.m. to 5 p.m.) West County Office (20 mile bend west covering Belle Glade, Pahokee, South Bay) Address: 38754 State Road 80 Belle Glade, FL​ 33430-5616 Phone: 561-996-1630 Monday to Friday (8 a.m. to 5 p.m.) Homeless Services Kim Parnett, Casework Supervisor Monday-Friday (8 a.m. to 5 p.m.) 1250 Southwinds Drive Lantana, FL 33462 Monday-Friday (8 a.m. to 5 p.m.) Senator Philip D. Lewis Center 1000 45th Street, West Palm Beach, FL 33407 Phone: 561-904-7900 Veterans Services Help Numbers ​ VA Benefits ​800-824-1000 Life Insurance 800-669-8477 VA Education Benefits 888- 442-4551 Debt Management Center 800-827-0648 Mammography Hotline 888-492-7844 Device For the Deaf (TDD) 800-829-4833 CHAMPV A 800-733-8387 Headstones & Markers 800-697-6947 Persian Gulf Help Line 800-749-8387 Persian Gulf Help Line ( TDD ) 800-829-4833 Records 561-233-5160 Zoning 561-233-5200 ​ Important Numbers ​​ Homeless Services Access: ​To access Homeless Services call Senator Philip D. Lewis Center at 561-904-7900. PBC Palm Tran: 561-841-4200 Palm Tran CONNECTION: 561-649-9838 Area Agency on Aging's Elder Helpline: 1-866-684-5885 Contact Us ​ Wendy Tippett Director of Human Services 810 Datura Street West Palm Beach, FL 33401 Phone: 561-355-4775 E-Mail Us Homeless and Housing Alliance ​Maria Bond Human Services Program Manager 810 Datura Street West Palm Beach, FL 33401 Phone: 561-355-4779 E-Mail Us ​ Veterans Services ​ Rohn Hultgren Veteran Service Officer 5217 Northlake Blvd Palm Beach Gardens, FL 33418 Phone: 561- 276-1272 E-M​ail Us ​ \r\n   ​ National Service Officer Numbers ​ American Legion ​800-944-2039 AMVETS 800-452-5700 DAV 515-284-4658 PYA 800- 795-3602 VFW 800- 795-3602 VVA 800-410-7584 Page Content 1 Page Content 2 PBC Mission Statement To drive a continuous improvement culture of excellence that achieves a measurably high level of public satisfaction. Read More Site Directory PBC.GOV Government Residents Business Things To\r\n                                                Do Online\r\n                                                Services Departments Jobs Contact\r\n                                                Us Useful Links PBC\r\n                                                Business Opportunities Volunteer\r\n                                                Opportunities Links Publications Stay\r\n                                                Connected! Web Site Disclaimer District Locator BCC\r\n                                                Meetings Sign In Accessibility Statement Home Links Jobs Contact Us © Copyright Palm Beach County, FL."
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "text": "Encore Packaging LLC -Contact Us! Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal/Privacy Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Thank you for sending us a message! We will get back to you shortly Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Do you consent to our Privacy Policy / Terms of Use and Standard Terms and Conditions of Sale ? Yes Logout Please check in later. This feature coming soon! (847) 735-8105 Call Us | Email Us | Log-In Products News Special Offers Events About Us Strapping Stretch Strapping and Accessories Kits Battery Tools and Accessories Tensioners Pneumatic Tools Sealers Accessories Sealless Tools Cutters Strapping Trucks Strap Dispensers Edge Protectors Strapping Coils Buckles Pre-Cuts Seals Combination Tools Material Dispensers & Holders Storage Solutions Peanut Dispensers Kraft Paper Dispensers Bubble, Foam, Poly and Corrugated Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stretch Film Dispensers Honeycomb Paper Dispensers Slide Cutters Utility Knives & Cutters Replacement Blades Retractable T-Style Hook Style Sliding Accessories Specialty Tape Dispensers Table-Top Rubber Bands Standard Moving Pallet Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Strapping Stretch Strapping and Accessories Eco-Friendly Kits For Woven Polyester For Polypropylene For Polyester For Steel For Woven Cord Battery Tools and Accessories For Polypropylene For Polyester For Cord Strapping Tensioners For Polypropylene For Polyester For Cord For Steel For Stainless Steel Pneumatic Tools For Cord For Steel Sealers For Polypropylene For Polyester For Steel Accessories Sealless Tools For Steel Cutters For Steel and Poly For Steel Strapping Trucks Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Steel or Poly Strap Dispensers For Steel For Cord For Poly For Steel or Poly For Poly and Steel Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Poly Edge Protectors Standard Duty Heavy Duty Strapping Coils Buckles For Cord For Poly For Stainless Steel Pre-Cuts Seals For Poly For Steel Combination Tools For Steel For Stainless Steel Material Dispensers & Holders Storage Solutions Trays Mobile Hooks Carton Stands Peanut Dispensers Kraft Paper Dispensers Wall Mountable Table/Wall Mountable Floor Unit Accessory Table Mountable Bench Mountable Table/Bench Mountable Mobile Units Battery Powered Bubble, Foam, Poly and Corrugated Dispensers Wall/Table Mount Mobile Dispensers Battery Powered Horizontal Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stationary Mobile Stretch Film Dispensers Honeycomb Paper Dispensers Table/Wall Mountable Slide Cutters Wall/Table Mount Mobile Dispensers Battery Powered Utility Knives & Cutters Replacement Blades Retractable Light Duty Standard Duty Heavy Duty T-Style Light Duty Standard Duty Hook Style Standard Duty Heavy Duty Sliding Standard Duty Accessories Specialty Standard Duty Heavy Duty Tape Dispensers Replacement Blades & Wiper Plates Hand-Held Table-Top Rubber Bands Standard Large Moving Pallet Phone: 847-735-8105 Fax: 847-735-8297 Email: customerservice [at] encorepack sales [at] encorepack Headquarters: Encore Packaging LLC 201 Park Ave Lake Villa, IL 60046 Remit Payment to: P.O. Box 595 Winnetka, IL 60093 Ask An Agent Our Customer Service Agents are ready to help! (847) 735-8105 Email Home Contact Site Map Catalog Legal encorepack.mx"
    },
    {
      "url": "https://discover.pbc.gov/countycommissioners/pages/staff.aspx",
      "text": "County Commissioners\r\n            \r\n            \r\n            BCC Staff You may be trying to access this site from a secured browser on the server. Please enable scripts and reload this page. Skip to main content ADJUST FONT SIZE: RESET Jobs Links Departments Contact Us It looks like your browser does not have JavaScript enabled. Please turn on JavaScript and try again. County Commissioners Menu County Commissioners BCC Home BCC Staff Currently selected BCC Meeting Agendas Briefs Find Your District Districts District 1 Biography City Watch News Archive Newsletter Videos District 2 District 2 Alerts Biography City Watch Videos News Archive Newsletter test District 3 Biography City Watch Videos News Archive Newsletter Boletín Informativo District 4 Newsletter Videos Biography City Watch News Archive District 5 Biography Videos News Archive Newsletter District 6 Biography Cities/Municipalities News Archive Newsletters Meeting Request Videos District 7 Biography City Watch News Archive Newsletter Videos High School Scholarships Database County Administrator BCC Meeting Videos BCC Meeting Dates BCC Staff Page Content ​​​​​​​​​​​​​ District 1 - Commissioner Maria G. Marino - Mayor 561-355-2201 • 561-624-6547 (NE Cty) Elicia Sanders - County Commission Chief of Staff IV Melissa Santoro - County Commission Assistant Chief of Staff II Sandrea Bhoorasingh - County Commission Assistant Chief of Staff I District 2 - Commissioner Gregg K. Weiss 561-355-2202 Niels Heimeriks - County Commission Chief of Staff V Virginia Savietto - County Commission Assistant  Chief of Staff V Jana Panarites - County Commission Assistant Chief of Staff II District 3 - C OMMISSIONER Joel G. Flores 561-355-2203 Vivian Rodriguez - County Commission Chief of Staff I Dianni Mendez - County Commission Assistant Chief of Staff I Yaneli Mata - County Commission Assistant Chief of Staff I District 4 - Commissioner Marci Woodward 561-355-2204 • 561-276-1220 (South Cty) Caitlin Joyce - County Commission Chief of Staff V Christian Wright - County Commission Assistant Chief of Staff III Nicole Wood - County Commission Assistant Chief of Staff I D ISTRICT 5 - C OMMISSIONER Maria Sachs 561-355-2205 • 561-276-1310 (South Cty) Janet Arguelles - County Commission Chief of Staff V Ed Sol - County Commission Assistant Chief of Staff II Anna Marie Suhar - County Commission Assistant Chief of Staff I D ISTRICT 6 - C OMMISSIONER Sara Baxter - Vice Mayor 561-355-2206 Jon Carter - County Commission Chief of Staff III Sasha Lopez - County Commission Assistant Chief of Staff II Kayla West - County Commission Assistant Chief of Staff II District 7 - C OMMISSIONER Bobby Powell Jr. 561-355-2207 • 561-276-1350 (South Cty) Diane Andre - County Commission Chief of Staff I Malcolm Sommons -  County Commission Assistant Chief of Staff I​​ Theresa Lawrence - County Commission Assistant Chief of Staff I Ana Silva - Department Coordinator Joey Etienne - Administrative Assistant​​​​​​​ I​​ Page Content 1 BCC Directory BCC Home BCC Staff BCC Agendas BCC Briefs E-mail BCC Find Your District Zoning Commission Hearings & Meetings District 1 - Maria G. Marino District 2 - Gregg K. Weiss District 3 - Joel G. Flores District 4 - Marci Woodward District 5 - Maria Sachs District 6 - Sara Baxter District 7 - Bobby Powell Jr. County Administrator - Joseph Abruzzo​ Compliance Details javascript:if (typeof CalloutManager !== 'undefined' && Boolean(CalloutManager) && Boolean(CalloutManager.closeAll)) CalloutManager.closeAll(); commonShowModalDialog('{SiteUrl}'+ \r\n            '/_layouts/15/itemexpiration.aspx' \r\n            +'?ID={ItemId}&List={ListId}', 'center:1;dialogHeight:500px;dialogWidth:500px;resizable:yes;status:no;location:no;menubar:no;help:no', function GotoPageAfterClose(pageid){if(pageid == 'hold') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ \r\n            '/_layouts/15/hold.aspx' \r\n            +'?ID={ItemId}&List={ListId}');  return false;} if(pageid == 'audit') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+\r\n            '/_layouts/15/Reporting.aspx'\r\n            +'?Category=Auditing&backtype=item&ID={ItemId}&List={ListId}'); return false;} if(pageid == 'config') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+\r\n            '/_layouts/15/expirationconfig.aspx'\r\n            +'?ID={ItemId}&List={ListId}'); return false;}}, null); 0x0 0x1 ContentType 0x01 898 Document Set Version History /_layouts/15/images/versions.gif?rev=40 javascript:SP.UI.ModalDialog.ShowPopupDialog('{SiteUrl}'+ \r\n                '/_layouts/15/DocSetVersions.aspx'\r\n                + '?List={ListId}&ID={ItemId}') 0x0 0x0 ContentType 0x0120D520 330 Send To other location /_layouts/15/images/sendOtherLoc.gif?rev=40 javascript:GoToPage('{SiteUrl}' +\r\n                '/_layouts/15/docsetsend.aspx' \r\n                + '?List={ListId}&ID={ItemId}') 0x0 0x0 ContentType 0x0120D520 350 District Maps All Districts District 1 District 2 District 3 District 4 District 5 District 6 District 7 Page Content 2 PBC Mission Statement To drive a continuous improvement culture of excellence that achieves a measurably high level of public satisfaction. Read More Site Directory PBC.GOV Government Residents Business Things To\r\n                                                Do Online\r\n                                                Services Departments Jobs Contact\r\n                                                Us Useful Links PBC\r\n                                                Business Opportunities Volunteer\r\n                                                Opportunities Links Publications Stay\r\n                                                Connected! Web Site Disclaimer District Locator BCC\r\n                                                Meetings Sign In Accessibility Statement Home Links Jobs Contact Us © Copyright Palm Beach County, FL."
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "text": "Contact Us | This Is The Place Heritage Park Annual Pass Menu Annual Pass Menu Connect With Us Contact us via the form below and our team will respond within 48 hours. Support Form (#8) Contact First Name Last Name Email Department - Select Department - Dining Events Media / Press General Admission Weddings Corporate Groups Phone/Mobile Subject Description Submit Form Contact Info customerservice@thisistheplace.org 801-582-1847 Address 2601 E. Sunnyside Avenue Salt Lake City, Utah 84108 THIS IS THE PLACE VISIT TODAY! 2601 EAST SUNNYSIDE AVENUE, SALT LAKE CITY, UT, 84108 801-582-1847 cservice@thisistheplace.org Press Inquiries: Tresha Kramer- tkramer@thisistheplace.org Footer Subscription Form Newsletter Subscribe Follow Us About Hours & Admission Contact Us Terms & Conditions Blog Home Today’s Fun Summer Season Winter Season Plan Your Visit Activities Bonus Events Utah Trail Rides Childrens Parties Pioneer Trades Shopping Gift Shop Food Brigham’s Donuts Huntsman Grill General Info Hours & Admission Annual Pass Contact Us About Directions Partners & Sponsors Support The Park Heritage Village The Village The Pioneer Center Monuments Pioneers of 1847 Monument Statuary Walk The Mormon Battalion National Pony Express Walk of Pioneer Faiths Pioneer Children’s Memorial Building Rentals Weddings & Receptions Corporate Events Family Reunions Pricing Catering Bartenders Buildings The Garden Place Rental Pine Valley Chapel Rental Atkin Home Rental Brigham Young Farmhouse Kimball Home Rental Pioneer Center Rental Pack Home Rental Plaza Rental Ottinger Hall Rental Pioneer Pavilion Rental Emigration Room at the Pioneer Center Miller Pavilion Rental Education School Field Trips Blog"
    },
    {
      "url": "https://idahodunesrv.com/contact-us/",
      "text": "Contact Us - Idaho Dunes RV Skip to content Direct access to the St. Anthony Idaho Sand Dunes Location Email Us 208-624-3275 Direct access to the St. Anthony Idaho Sand Dunes Location Email Us 208-624-3275 Reservations Reservations Campground Map Local Attractions Galleries Contact Us FAQ Meet the Team Rules Jobs Fallen Duner VP Racing Fuel Get in touch with us Want to get in touch? We’d love to hear from you. Here’s how you can reach us… Contact Information Idaho Dunes RV 1695 E 500 Rd N St Anthony, ID 83445 Tel: 208-624-3275 Email: reservations@idahodunesrv.com Learn More! Google Maps Frequently asked Questions CampGround Rules Meet our Team Have a question or comment? Please fill out the form below and a knowledgeable Idaho Dunes RV representative will reply to you shortly. Your Name (required) Your Email (required) Your Phone (optional) I am interested in learning more about (optional): Idaho Dunes RV General Campsite Info On Site Amenities Campground Rules Cancellation Policies BLM OHV Rules and Regulations Sand Dune Insight and Tips Seasonal Weather Info Local Attractions On Site Helicopter Tours UTV Trail Tours Nearby River Floats White Water Rafting Day Trips to Yellowstone National Park Day Trips to Jackson WY Lakeside Lodge and Resort Other Your Message (optional) Frequently asked Questions How do I get to Idaho Dunes RV Park? Directions from the South (Idaho Falls) Take SR20 heading East toward Rigby/Yellowstone (approx. 29 miles) Take exit 337 (North Rexburg exit) Turn left on N. Salem Rd and travel 7.5 miles Turn left at 500 North (Red Flashing 4 Way) and travel 1/4 mile Follow signs for Egin Lakes access At fork stay right on 500N (go over the RR tracks) and travel 1 mile Idaho Dunes RV Park entrance will be on the right. Store/Office is at end of dirt road on the left. Directions from the North (Yellowstone) Take SR20 heading West toward Rexburg Take Exit 337 (North Rexburg exit) Turn right at N Salem Rd and travel 7.5 miles Turn left at 500 North (Red Flashing 4 Way) and travel 1/4 mile Follow signs for Egin Lakes access At fork stay right on 500N (go over the RR tracks) and travel 1 mile Idaho Dunes RV Park entrance will be on the right. Store/Office is at end of dirt road on the left. How many campsites are there and how are they configured? We have 24 “Standard Full Hook-Up” sites (Water, 50-amp power and sewer, sites 1-24) Pull through. 20-22’ wide X 70’ long. Sites include a concrete patio. Sites 2/3, 4/5, 6/7, 8/9, 10/11, 14/15, 16/17, 18/19, 20/21, 22/23 are configured to share a patio with the neighboring site. We have 32 “Standard Partial Hook-Up” sites (Water and 50-amp power, sites 25-56) Pull through. 25-35’ wide X 70’ long. These sites are configured traditionally at a 45-degree angle all facing the same direction. We have 3 “Premium Partial Hook-Up” sites (Water and 50-amp power, sites 57-59) Head in. 26’ wide X 65’ long. These sites are configured traditionally all facing the same direction. We have 10 “Premium Full Hook-Up” sites (Water, 50-amp power and sewer, sites 60-69) Head in. 26’ wide X 65’ long. These sites are configured traditionally all facing the same direction. We have 25 acres of dry camping (no hook-ups ) Dry camping is always a first come first serve basis. How far is it to St. Anthony Sand Dunes Recreation Area? STATE CITY DISTANCE TIME ID Idaho Falls 40 0.5 ID Pocatello 90 1.2 UT Salt Lake City 250 3.5 MT Helena 275 3.9 MT Billings 300 4.2 ID Boise 325 4.6 WY Casper 350 5.0 WA Spokane 500 7.1 UT St. George 550 7.8 CO Denver 600 8.5 SD Rapid City 600 8.5 NV Las Vegas 675 9.6 ND Bismark 725 10.3 OR Portland 750 10.7 WA Seattle 800 11.4 CA San Francisco 875 12.5 CA Riverside 900 12.8 AZ Phoenix 900 12.8 CA Los Angeles 940 13.5 CA San Diego 1000 14.2 How big are the dunes compared to Glamis? The St. Anthony Sand Dunes cover over 10,000 acres with massive contiguous sand dunes. Osborne Overlook to China Wall in Glamis is approximately 13 miles, in direct comparison Idaho Dunes RV Park to the end of the biggest dunes near “Devils Dune” is approximately 12 miles. The infamous Choke Cherry Hill is steeper than China Wall and a significantly more difficult climb. How close is the campground to the dunes? Immediate access from your campsite to the dunes. Ride your ATV directly from the camp. IDRV is the nearest private campground to the big dunes. What amenities can be found at Idaho Dunes RV Park? Fully Stocked General Store Showers Toilets 69 Hook Up Spots 25 Acre Dry Camping Kids Playground Direct Dune Access Picnic Area On Site Seasonal RV Storage What else can I do while visiting Idaho? Yellowstone National Park Jackson Hole, WY Grand Teton National Park Yellowstone Bear World Fly Fishing Mountain Biking Photography Wildlife Viewing River Rafting Is it possible to make reservations for tent and dry camping on-line? Dry camping sites are always on a first come first serve basis. No reservations are required to camp in this area. Can we reserve a specific dry camping area? Dry camping is on a first come first serve basis and no reservations for a specific area can be provided. We're coming in with a large group and want to be together, can we reserve a group area ahead of time? At this time, we have not assigned specific group areas for camping. Groups for dry camping will on a first come first serve basis only. Is there a dump station at the park and is there a fee to dump? Use of our dump station is reserved for partial hook-up guests only. Our septic system has limited capacity and will not handle high volume dry camping dump volumes. We do not allow non-patrons use of our dump station. What is your reservation policy? Deposit policy: Reservations must be paid in full at time of booking without exception. Cancellation policy: There are no refunds under any circumstance. There are no adjustments for late arrivals or early departures. We will accommodate a one-time rescheduling of your reservation if notified at least 7 days prior to your reservation arrival date. Check-In Upon Arrival: Please check in at the Idaho Dunes RV Store immediately upon arrival. All registered guests will be issued a registration permit and receipt to affix to the window of your vehicle. Permits must be affixed in front windshield in clear view. Late Arrivals: Late arrivals must check in at the Idaho Dunes RV Store before 10:00 AM. Failure to self-register will result in a 20% registration surcharge. How late can I get to Idaho Dunes RV Park on my day of arrival? In consideration of our other campers please arrive prior to 10pm. If this is not possible please call ahead and provide advanced notice of late arrival. What time is check-out? Check out time is 11:00 AM What if I want to spend more time at the park the day we check-out? You are more than welcome to enjoy the dunes the day of check-out. Please see the manager at least one day prior to your check out date for arrangements. Are there shower facilities? The park has four (4) private showers/restrooms available 24 hours a day. There is a nominal fee for taking showers. Showers take quarters only. Showers are for Idaho Dunes RV Park guests only. Can I rent camping trailers on-site? We always recommend https://tetonar.com/rv-rentals/ for trailer rentals. Does the park allow pets? Pets are welcome. Please keep pets on a leash no longer than 10ft. Please clean-up after your pet. Is there a play area for the kids? Idaho Dunes RV has the largest three-story playground in the area for children under 10. All children must be supervised by an adult. Seating for adults is available in the immediate area to watch the kids play. Do you still have the kids track? Idaho Dunes RV does not have a designated area for youth riders on the property at this time. Please take the kids to the dune area to ride ATV’s. How can I stay up to date with what is going on at Idaho Dunes RV Park? Please visit www.idahodunesrv.com for general campground info. For the most up to the minute information on events and activities please visit our Facebook Fan Page at www.facebook.com/idahodunesrv Do you sell food on-site? Idaho Dunes RV Park may have outside food vendors on-site during special events and some holiday periods. Dates and availability will vary. Please contact us at 208-624-3275 for more information. Can we have camp fires in the park? Camp fires are allowed in the steel barrels provided. For your safety please do not dig below ground fire pits anywhere on the property. Smudge Pots are strictly prohibited and must not be used anywhere on the property. If we plan to dry camp will it be possible to fill up with water when we arrive? Water is available to all guests staying at the RV Park. Do you sell fuel on-site? VP Racing 110 Octane Fuel is sold on-site. 5-gallon pails and 54-gallon drums are typically in stock in limited quantities. Pre-ordering of VP 110 fuel is available with 20 days advance notice at https://idahodunesrv.com/vp-racing-fuel-pre-order/ Are there any Hotels/Motels nearby? Hotel accommodations can be found in both Rexburg, ID and St. Anthony, ID. Both cities are about 10 minutes away. Are picnic tables available at each camp site? Idaho Dunes RV Park does not offer picnic tables at each site. We recommend that guests bring their own tables and chairs as required. Can I place a tent on a full or partial hook-up camp site? A tent may occupy a full or partial hook-up camp site but must pay the specific rate for the type of site being occupied. Additional tents may be added for the nightly rate for tent camping. Tents must not extend beyond the physical site, infringe on the adjoining camp sites, or hinder interior roads. A maximum of 2 additional tents per hook-up site will be allowed. Does the campground offer FREE High Speed Internet YES. Idaho Dunes RV has a FREE Wi-Fi Hot Spot located near the general store with excellent connection speeds and coverage. We have installed a dedicated data line to support guests need for internet connectivity while at the campground. Our Wi-Fi is not accessible to the entire 50 acre campground but full-hook up sites are within close enough proximity to get excellent connectivity. Can I run a generator in camp? Generators can be run from 7:00 AM to Midnight in our dry camping area only. All generators must be turned off by 12:00 AM. Should you have needs that require power 24 hours per day please book an appropriate hook-up camping site. CAMPGROUND RULES Welcome to Idaho Dunes RV! Please make your party aware of the following rules and policies: Any violation of these rules may be cause for your immediate removal from the facility without a refund. No riding in camp except to access the dunes. Speed limit in camp is 5 MPH. No Music after 10:00 PM (Absolutely No Noise After Midnight Including Generators) No fireworks or smudge pots on property. All pets must be on a leash and cleaned up after. Dripping or draining of grey or black water will result in a $100 fine. Please check in at office prior to setting up camp. If arriving after hours please check in promptly at 9:00 AM the following day. Maximum of 10 people allowed per site. Limit of 1 “Extra Vehicle” allowed per site. Only 1 “Camping Unit” allowed per site. Extra vehicles staying overnight in sites will be allowed at an additional cost of $10.00 per night. All vehicles and equipment must fit within the site and not overflow onto roadways or into neighboring camps. All vehicles entering the Idaho Dunes RV gate must be registered and properly displaying registration tags. This includes RV’s, cars, and trucks. Lost, missing or stolen registration documentation will not be reissued. Individual named on the site is responsible for all parties. Do not move or alter orange safety cones in any way. Campfires are allowed in above ground burn barrels only. Absolutely no digging or below ground firepits on property. Please make children aware that power, water and communication lines are running below ground. The Idaho Dunes RV dump station is primarily reserved for partial hook-up site guests. If our septic system does have capacity, dry camping guests may pay a $10.00 dump fee to utilize the dump. Please check in with office before dumping. Dumpsters are provided for household garbage only. Any child 16 and under must be directly supervised by an adult at all times. Playground area is for children 10 and under. Children must be supervised by an adult at all times. No parking of vehicles on concrete patios in full hook-up sites. Check-In is after 1:00 PM, Check-Out is before 11:00 AM. Do not trespass on neighboring farms or properties. Please drive carefully. You are personally responsible for any damage to Idaho Dunes RV or other guests property. Idaho Dunes RV reserves the right to refuse service to anyone. Please be aware that you are on private property. We simply ask that you treat our facility as if we were all camping at your home. Ride safe and have a blast at Idaho Dunes RV! Meet the Team Mike McGroarty Owner Mike McGroarty has been an off-road, aviation, and outdoor enthusiast his entire life.  At the age of 15, Mike earned the rank of Eagle Scout in the Boy Scouts of America and by that time had over 300 nights of wilderness camping experience.  His love for the outdoors turned into a passion for off-roading as soon as his first job earned him enough income to purchase his first sport ATV.  This first ATV started an addiction for rock crawling, trail riding and sand duning that still occupies 100% of Mike’s interest to this day. Garrett McGroarty Manager Garrett McGroarty was born into the “Idaho Dunes Way of Life”.  At 3 years old, Garrett started his off-road passion on a Kawasaki KFX 50.  Garrett has logged more trail miles between Idaho Dunes RV and West Yellowstone than anyone in the area.  At a young age, Garrett developed a passion for helicopters and aviation.  Before graduating from high school, Garrett earned both his private helicopter license (PPL-H) and commercial helicopter license (CPL-H).  With advanced pilot training from the best instructors in the industry at Helisafe in Southern California, Garrett has mastered the Robinson R44 Raven II helicopters flight systems and emergency procedures.  If you have questions about the campground, dunes, local area, trail rides, or helicopter tours Garrett is your best bet to get the answers you are looking for. Colter Canon Chief Security Officer Colter Canon is Idaho Dunes RV’s Chief Security Officer. By day Colter serves Fremont County Idaho as a Sherriff’s Deputy as well as South Fremont Highschool as the School Resource Officer (SRO). Colter and his team go out of their way to ensure Idaho Dunes RV’s guests experience a safe but enjoyable atmosphere. “We understand everyone in camp is on vacation and wants to have a great time and let their hair down. We also understand that some people visiting the campground like to sleep. Its our job to make sure everyone can have the experience they are looking for within reason…” Colter Canon Google Contact Instagram Facebook Camping at St Anthony Dunes Phone: 208-624-3275 Email: reservations@idahodunesrv.com Location: 1695 E 500 Rd N, St Anthony, ID 83445 Copyright 2025 © Idaho Dunes Site Built by Moranton Media || Terms and Conditions || Privacy Policy || Reservations Campground Map Local Attractions Galleries Contact Us FAQ Meet the Team Rules Jobs Fallen Duner VP Racing Fuel Location Email Us 208-624-3275 Login Username or email address * Required Password * Required Remember me Log in Lost your password? This site uses cookies to offer you a better browsing experience. By browsing this website, you agree to our use of cookies. More info Accept"
    },
    {
      "url": "https://www.palmbeachschools.org/",
      "text": "Home - Palm Beach County School District Skip To Main Content menu-trigger-container Close Menu Search Search Clear Search mobile-main-nav About Us Accreditation Engagement Review Final Reports Accreditation's Impact on Stakeholders Cognia Website (opens in new window/tab) Department Quality Surveys (DQS) (opens in new window/tab) School Effectiveness Questionnaire (SEQ) (opens in new window/tab) Doing Business with the District (opens in new window/tab) Honoring Our Veterans News Stories 2024 Stories 2023 Stories Archived News 2014-2022 Newsletters Our District Non-Discrimination Statement Website Accessibility Statement Regional Offices Central Region Office Glades Region Office North Region Office South Region Office Reports and Publications Student Enrollment Projections and Reports Five-Year Capital Plan Superintendent Annual Reports Tests/Survey Reports Wellness Promotion Policy Annual Report Archives (opens in new window/tab) Department Quality Surveys (DQS) Financial Reports FLDOE School Improvement Plans (opens in new window/tab) Inspector General Reports Performance Evaluation State Plans Additional Resources School Grading Strategic Plan 2022-2027 Strategic Plan Development Strategic Plan in Action (Calendar) 2016 Penny Sales Tax Why a Sales Tax? 2016 Facility Condition Assessment Report One County One Penny Project List Project Updates 2024 Referendum Students & Parents Alphabetical List of Resources District Parent Information Exceptional Student Education (ESE) Find My School Resource Directory School Boundary Maps (opens in new window/tab) School Library Media Center Resources & Objection Process & Form (opens in new window/tab) Student Registration Transportation Welcome Center Instructional Materials School Board Board Advisory Committees Independent Referendum Oversight Committee (IROC) Ethics Training for Advisory Board Members Audit Committee Construction Oversight Review Committee (CORC) Finance Committee Independent Sales Surtax Oversight Committee (ISSOC) Technology Advisory Committee (TAC) Board Meetings Watch the Board Meeting Live (opens in new window/tab) Board Meeting Agendas (opens in new window/tab) Recorded Board Meetings Board Meeting Photos (opens in new window/tab) Addressing the Board Meeting Attendance Rules Request Board Proclamation (opens in new window/tab) Request Board Recognition (opens in new window/tab) Board Policies (opens in new window/tab) District Legal Notices Legal Notices Archive Legislative Platform Lobbyist Policy (opens in new window/tab) Lobbyist Registration Form (opens in new window/tab) List of Current Registered Lobbyists FLDOE - Education Laws and Legislation (opens in new window/tab) Public Records Requests Public Records Custodian School Board District Legal Notices (opens in new window/tab) Board Meetings Board Member District Map (opens in new window/tab) Find My Public Official - PDF (opens in new window/tab) Find My Public Official - Excel (opens in new window/tab) Board Meeting Agendas: 2007 - Present (opens in new window/tab) Board Meeting Agendas: 2005 - 2007 (opens in new window/tab) Board Policies (BoardDocs) (opens in new window/tab) Schools by Board Member District (opens in new window/tab) Palm Beach County Commission Districts Map (opens in new window/tab) School Board Member Redistricting Information School Board's Statement of its Organization and Operation (opens in new window/tab) Superintendent Organization Chart (opens in new window/tab) Superintendent Biography of the Superintendent Burke at Work (opens in new window/tab) Organization Chart (opens in new window/tab) Superintendent Annual Report 2023-2024 (opens in new window/tab) Strategic Plan 2022-2027 Former Superintendents Careers Alphabetical List of Resources Apply Now Career Resources Certification Collective Bargaining Agreements Hiring Events (opens in new window/tab) Job Areas and Resources Job Descriptions New Hire Benefits Retiree Benefits Salary Schedules Substitute Teaching (opens in new window/tab) Schools Elementary Schools Middle Schools High Schools Adult Education Alternative Education Regional Offices & Resources Find My School (opens in new window/tab) Schools & Principals List District Adult & Community Education (opens in new window/tab) Bell Times (opens in new window/tab) Business Partners (opens in new window/tab) District Calendar (opens in new window/tab) District Directory (opens in new window/tab) District Forms (opens in new window/tab) Find My School (opens in new window/tab) Library Information (opens in new window/tab) Media Relations School Police (opens in new window/tab) Transcript Requests/Student Records (opens in new window/tab) Reports & Publications (opens in new window/tab) Student Internships (opens in new window/tab) The Education Network (T.E.N.) Volunteers mobile-district-nav Elementary Schools Middle Schools High Schools Adult Education Alternative Education Regional Offices & Resources Find My School (opens in new window/tab) Schools & Principals List header-container header-top-container info-bar nav-main About Us Accreditation Doing Business with the District (opens in new window/tab) Honoring Our Veterans News Stories Our District Regional Offices Reports and Publications Strategic Plan 2022-2027 2016 Penny Sales Tax 2024 Referendum Students & Parents Alphabetical List of Resources District Parent Information Exceptional Student Education (ESE) Find My School Resource Directory School Boundary Maps (opens in new window/tab) School Library Media Center Resources & Objection Process & Form (opens in new window/tab) Student Registration Transportation Welcome Center Instructional Materials School Board Board Advisory Committees Board Meetings Board Policies (opens in new window/tab) District Legal Notices Legislative Platform Public Records Requests School Board Superintendent Organization Chart (opens in new window/tab) Superintendent Careers Alphabetical List of Resources Apply Now Career Resources Certification Collective Bargaining Agreements Hiring Events (opens in new window/tab) Job Areas and Resources Job Descriptions New Hire Benefits Retiree Benefits Salary Schedules Substitute Teaching (opens in new window/tab) Schools Elementary Schools Middle Schools High Schools Adult Education Alternative Education Regional Offices & Resources Find My School (opens in new window/tab) Schools & Principals List District Adult & Community Education (opens in new window/tab) Bell Times (opens in new window/tab) Business Partners (opens in new window/tab) District Calendar (opens in new window/tab) District Directory (opens in new window/tab) District Forms (opens in new window/tab) Find My School (opens in new window/tab) Library Information (opens in new window/tab) Media Relations School Police (opens in new window/tab) Transcript Requests/Student Records (opens in new window/tab) Reports & Publications (opens in new window/tab) Student Internships (opens in new window/tab) The Education Network (T.E.N.) Volunteers rss-icon menu-trigger-container Menu sing-in-nav Sign In (opens in new window/tab) header-middle-container logo-container logo-image logo-title The School District of Palm Beach County Educate. Affirm. Inspire. right-container site-search District Home Search Clear Search right-bottom-container translate--links translate-container translate-trigger Translate google-translate-holder sing-in-nav Sign In (opens in new window/tab) header-bottom-container icons-nav Departments Calendars Employment District Legal Notices (opens in new window/tab) Meeting Videos (opens in new window/tab) Adult &  Community Ed. K-12 Student  Registration Choice/Career  Programs In This Section Breadcrumb Home Home hero-banner pause play The District honors the memory of those who tragically lost their lives on September 11, 2001 . One conversation can save a life. Let’s spread hope and remind each other that help is always available. Caring First Resources Meet with representatives from public and private colleges and universities - More Information Visit our Interested in Teaching with SDPBC page View the FY24 Wellness Promotion Policy Annual Report < > Important Items Career Opportunities (opens in new window/tab) We’d love to invite you to apply for a job in Palm Beach County School District! Family Resources (opens in new window/tab) Whether you're new to the District or returning, find information on registration, transportation, health requirements, and more. Thank a Teacher (opens in new window/tab) Have you ever wanted to thank a special teacher for the impact they've made on your life? Here's your chance! Back to School 2025 (opens in new window/tab) This webpage features useful information for both students and parents. Announcements Showcase of Schools Tuesday, October 28, 2025 4:00-8:00 p.m. South Florida Fairgrounds - Expo Center This event features more than 125 elementary, middle, and high schools offering Choice and in-house programs. The Choice application period, opens on November 3, 2025, for the 2026–2027 school year. How to Request Student Records To order a high school transcript electronically, visit Parchment . First, create an account, then place the order. Records questions related to active students, student transfers, or students who have left the district within the last three years should contact the student’s current school , or the school they were most recently enrolled in. For all other student records requests, visit the Student Records Requests web page. How to Register to Do Business with SDPBC Register for FREE on Palm Beach Schools Bidnet Direct Headlines Safety message with Officer Wilburn and K-9 Leo (opens in new window/tab) Walking or biking to school? School Police Officer Michelle Wilburn and her K-9 partner, Leo, have some helpful tips to keep you safe. Behind the Badge with Officer Dupuis at Christa McAuliffe Middle (opens in new window/tab) Behind the Badge spotlights the incredible people of the Palm Beach County School Police Department like Officer Dupuis at Christa McAuliffe Middle. S.D. Spady Elementary Celebrates New Learning Space (opens in new window/tab) S.D. Spady Elementary has an incredible learning space thanks to a generous donation from the Betty Harman Warner Reading and Emerging Leaders Fund! Seminole Ridge Habitat for Humanity Home (opens in new window/tab) The School District celebrates the dedication of the Ramsey Family Home built by students from the Weitz Construction Academy at Seminole Ridge Community High School. More Quick Links Adult & Community Education Bullying & Department of Children and Families (DCF) Abuse Hotline CareerSource Palm Beach County Learner Pathways (opens in new window/tab) CARES - Centralized Complaint Assessment & Referral Evaluation System Caring First (opens in new window/tab) Doing Business with the District FortifyFL (opens in new window/tab) Public Records (opens in new window/tab) Reproductive Health and Disease Education School Choice SIS Parent Gateway (opens in new window/tab) Volunteer in Our Schools What Not to Bring to School SDPBC At a Glance An A-Rated School District FL Department of Education 95.9% Graduation Rate 335 Choice & Career Programs 192 Countries Represented 10th Largest District in the U.S. 32.8 Million Meals School Food Service 171,261 Students in District-operated schools 22,801 Total employees SDPBC Upcoming Events Sep 11 Construction Oversight and Review Committee (CORC) Meeting 9 : 00 AM - 11 : 30 AM Read More about Construction Oversight and Review Committee (CORC) Meeting Sep 12 Forms Review Committee (FRC) 8 : 30 AM - 11 : 00 AM Read More about  Forms Review Committee (FRC) Sep 12 PBA Collective Bargaining Session 1 1 : 15 PM - 4 : 05 PM Read More about PBA Collective Bargaining Session 1 Sep 16 CTA Bargaining Session #2 1 : 30 PM - 4 : 20 PM Read More about CTA Bargaining Session #2 Sep 17 TAC - Technology Advisory Committee 9 : 00 AM - 10 : 30 AM Read More about TAC - Technology Advisory Committee Sep 17 Closed Sessions 3 : 00 PM - 5 : 00 PM Read More about Closed Sessions Sep 17 Regular Board Meeting 5 : 00 PM - 7 : 30 PM Read More about Regular Board Meeting Sep 18 District Diversity & Equity Ad Hoc Subcommittee 9 : 00 AM - 10 : 00 AM Read More about District Diversity & Equity Ad Hoc Subcommittee Sep 18 DISTRICT DIVERSITY AND EQUITY COMMITTEE 10 : 00 AM - 12 : 00 PM Read More about DISTRICT DIVERSITY AND EQUITY COMMITTEE Sep 19 Audit Committee Mtg 9 : 00 AM - 10 : 30 AM Read More about Audit Committee Mtg Sep 23 School Holiday *Fall Holiday* all day Read More about School Holiday *Fall Holiday* Sep 23 PBA Collective Bargaining Session #2 2 : 00 PM - 4 : 00 PM Read More about PBA Collective Bargaining Session #2 Sep 30 CTA Bargaining Session #3 11 : 30 AM - 3 : 20 PM Read More about CTA Bargaining Session #3 Oct 2 School Holiday *Fall Holiday* all day Read More about School Holiday *Fall Holiday* Oct 2 PBA Collective Bargaining Session #3 12 : 00 PM - 2 : 00 PM Read More about PBA Collective Bargaining Session #3 Oct 7 PBA Collective Bargaining Session #4 11 : 00 AM - 2 : 00 PM Read More about PBA Collective Bargaining Session #4 Oct 8 Closed Sessions/Workshop/Special Meetings 2 : 00 PM - 6 : 30 PM Read More about Closed Sessions/Workshop/Special Meetings Oct 9 Construction Oversight and Review Committee (CORC) Meeting 9 : 00 AM - 11 : 45 AM Read More about Construction Oversight and Review Committee (CORC) Meeting Oct 13 Academic Advisory Committee 5 : 45 PM - 7 : 15 PM Read More about Academic Advisory Committee Oct 15 Closed Sessions 3 : 00 PM - 5 : 00 PM Read More about Closed Sessions View Calendar Visit Us 3300 Forest Hill Boulevard West Palm Beach FL 33406 Get Directions (opens in new window/tab) Contact Us Phone: (561) 434-8000 Important District Contacts (opens in new window/tab) Site Map Email Us (opens in new window/tab) About Us (opens in new window/tab) Certification Information (opens in new window/tab) District Legal Notices Employee & Student Sign In (opens in new window/tab) Parent SIS Gateway Sign In (opens in new window/tab) Webmaster Login Accessibility (opens in new window/tab) Non-Discrimination Public Records Facebook (opens in new window/tab) Twitter (opens in new window/tab) YouTube (opens in new window/tab) Instagram (opens in new window/tab) NOTICE: Under Florida law, email addresses are public record. If you do not want your email addresses released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. To report waste, fraud, corruption, or abuse, please call the Inspector General Hotline: (855) 561-1010. Questions or Feedback? | Privacy Policy Copyright © 2024 Finalsite - all rights reserved. Powered by Finalsite"
    }
  ]
}