{
  "fuentes": [
    {
      "url": "https://www.milb.com/myrtle-beach/ballpark/front-office",
      "email": "tchapman@myrtlebeachpelicans.com"
    },
    {
      "url": "https://pelicanhill.com/contact/",
      "email": "reservations@pelicanhill.com"
    },
    {
      "url": "https://pelicanflightschool.com/contact",
      "email": "admissions@pelicanflighttraining.com"
    },
    {
      "url": "https://pelicanflightschool.com/contact",
      "email": "marketing@pelicanflighttraining.com"
    },
    {
      "url": "https://www.linkedin.com/company/pelicanalmc",
      "email": "info@thepelicanlanding.com"
    },
    {
      "url": "https://www.linkedin.com/company/pelicanalmc",
      "email": "ninfo@thepelicanlanding.com"
    },
    {
      "url": "https://elderwise.com/communities/pelican-landing-sebastian-fl/",
      "email": "asset-2@2x-150x45.png"
    },
    {
      "url": "https://elderwise.com/communities/pelican-landing-sebastian-fl/",
      "email": "asset-2@2x-250x74.png"
    },
    {
      "url": "https://elderwise.com/communities/pelican-landing-sebastian-fl/",
      "email": "asset-2@2x-300x89.png"
    },
    {
      "url": "https://elderwise.com/communities/pelican-landing-sebastian-fl/",
      "email": "asset-2@2x.png"
    },
    {
      "url": "https://www.pelicanslanding.com.au/contact/",
      "email": "functions@pelicanslanding.com.au"
    },
    {
      "url": "https://www.pelicanslanding.com.au/contact/",
      "email": "info@pelicanslanding.com.au"
    },
    {
      "url": "https://pelicanhill.com/",
      "email": "reservations@pelicanhill.com"
    },
    {
      "url": "https://pelicanslandingresort.com/contact",
      "email": "info@pelicanslandingresort.com"
    },
    {
      "url": "https://thedyrt.com/camping/florida/pelicans-landing-resort",
      "email": "fordovallogo@2x.png"
    },
    {
      "url": "https://thedyrt.com/camping/florida/pelicans-landing-resort",
      "email": "fordovallogo@3x.png"
    },
    {
      "url": "https://thedyrt.com/camping/florida/pelicans-landing-resort",
      "email": "info@pelicanslandingresort.com"
    }
  ],
  "mails": [
    "admissions@pelicanflighttraining.com",
    "asset-2@2x-150x45.png",
    "asset-2@2x-250x74.png",
    "asset-2@2x-300x89.png",
    "asset-2@2x.png",
    "fordovallogo@2x.png",
    "fordovallogo@3x.png",
    "functions@pelicanslanding.com.au",
    "info@pelicanslanding.com.au",
    "info@pelicanslandingresort.com",
    "info@thepelicanlanding.com",
    "marketing@pelicanflighttraining.com",
    "ninfo@thepelicanlanding.com",
    "reservations@pelicanhill.com",
    "tchapman@myrtlebeachpelicans.com"
  ],
  "nombre_sitio": "pelicanslandingresort.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.milb.com/myrtle-beach/ballpark/front-office",
      "text": "Pelicans Front Office | Pelicans Globe icon Login icon Recap icon Search icon Tickets icon Tickets & Promotions Single Game Tickets Playoffs Season Memberships Flex Books Weekly Promotions Promotional Calendar Military & First Responder Tickets Ticket Info & More Accessing Your Digital Tickets Know Before You Go Group Tickets Group Experiences Luxury Suites Sun Cruiser Beach Party Picnics Birthday Parties Team Party Community Organization of the Night Shop Pirate Logo Collection Obvious Shirts Collection Palmetto State Collection Pelicanos de Myrtle Beach Personalized Marquee Messages Cameo Message from Splash Schedule Schedule Schedule (Save or Print) Pocket Schedule Game-by-game Results Team Roster Field Staff Fan Zone Watch Video Stream Live Road to the Show All-Time Roster Pelicans Cheer Team Cubs prospects Media Information Stats & Scores Scoreboard Individual Stats Cubs affiliates Team Stats MiLB Stats Transactions Standings … Events Community News Club Info Watch on Bally Sports Live Edit Profile Log Out Tickets Schedule Shop Single-A Affiliate The Official Site of the Myrtle Beach Pelicans Myrtle Beach Pelicans Tickets & Promotions Single Game Tickets Playoffs Season Memberships Flex Books Weekly Promotions Promotional Calendar Military & First Responder Tickets Ticket Info & More Accessing Your Digital Tickets Know Before You Go Group Tickets Group Experiences Luxury Suites Sun Cruiser Beach Party Picnics Birthday Parties Team Party Community Organization of the Night Shop Pirate Logo Collection Obvious Shirts Collection Palmetto State Collection Pelicanos de Myrtle Beach Personalized Marquee Messages Cameo Message from Splash Schedule Schedule Schedule (Save or Print) Pocket Schedule Game-by-game Results Team Roster Field Staff Fan Zone Watch Video Stream Live Road to the Show All-Time Roster Pelicans Cheer Team Cubs prospects Media Information Stats & Scores Scoreboard Individual Stats Cubs affiliates Team Stats MiLB Stats Transactions Standings Events Hit Like A Pelican! Mar. 29: Pickle Fest Oct. 4: Mac & Cheese Fest Host Your Event at the Ballpark Community Digital Content Kids Activities Personalized Marquee Messages Donation Requests Pelicans Newsletter Honoring & Supporting Our Military Community Appearances Mascot Appearances Organizations We Support Speakers Program News News Home MiLB.com News Club Info Contact Us Front Office Directions & Parking Seating Map Facts & Figures Ballpark Policies Tour Info Franchise History Sponsorship Information Employment Opportunities Watch on Bally Sports Live Myrtle Beach Pelicans Front Office Staff Pelicans Ballpark 1251 21st Avenue North Myrtle Beach, South Carolina 29577 Tickets / Box Office: 843-918-6000 Front Office: 843-918-6002 Pro Shop: 843-918-6008 Email: [email protected] Front Office Hours January - September: Monday - Friday: 9AM - 5PM October - December: Monday - Thursday: 9 AM - 5 PM Box Office / Pro Shop Hours In Season: Monday - Friday 10 AM - 5 PM Game Day: Monday - Friday 10 AM - end of game, Saturday - Sunday 12 PM - end of game Off-Season: Monday - Thursday 10 AM - 5 PM Executive Team Chuck Greenberg, Chairman and Managing Partner Chuck Greenberg, Chairman and Managing Partner For more than two decades, Myrtle Beach Pelicans Chairman and Managing Partner, Chuck Greenberg, has built his reputation as an innovative franchise owner and operator, corporate and sports attorney, dealmaker, advisor, and expert on the business and economics of major professional sports. Chuck's involvement with the Pelicans began on May 31, 2006, when his ownership group finalized the purchase of the franchise from Capitol Broadcasting Company. He subsequently spearheaded an effort to enhance TicketReturn.Com Field at Pelicans Ballpark in Myrtle Beach and make it among the most fan-friendly venues in Minor League Baseball. Within his first two years as Team President and Managing Partner, Chuck's group invested nearly $2.5 million to enhance the Pelicans' home ballpark, including the installation of a state-of-the-art, 550-sq. ft. video board, a new Outfield Reserved Bleacher Seating section, and the opening of Pelicans Beach, which was subsequently dubbed \"the only baseball-front beach in America.\" The Major League-quality video board was the largest in the Carolina League at the time of installation and ranks among the largest in all of Minor League Baseball. In addition to his role as Pelicans' Chairman & Managing Partner, he currently holds the same title with the State College (Pa.) Spikes, the Class-A Short Season affiliate of the St. Louis Cardinals. He is also the General Partner and CEO of the Frisco RoughRiders, the Double-A affiliate of the Texas Rangers, a team that he purchased along with RoughRiders President and co-General Partner Scott Sonju in 2014. In November 2009, Chuck announced the formation of Greenberg Sports Group (GSG), which provides management, consulting and marketing services to the sports industry across the country. GSG also manages the overall operations of Pelicans, RoughRiders, and Spikes. Well respected across baseball, Chuck has the distinguished honor of serving on the Minor League Baseball Board of Trustees, a position to which he was elected to in December 2007. The 12-person Board has exclusive power to determine policies and to enact rules and regulations for Minor League Baseball and its member clubs. Among Chuck's leadership roles in the industry, he has helped to launch Minor League Baseball's \"Project Brand\" initiative, which was announced at the 2012 Baseball Winter Meetings. \"Project Brand\" is a transformational new national marketing program designed to attract major national sponsors by creating one cohesive brand encompassing all 160 member clubs. Previously, he served on the inaugural Board of Directors of the Baseball Internet Rights Company (BIRCO), which holds the digital media rights of its member Minor League Baseball clubs and leagues and partners in a strategic venture with Major League Baseball Advanced Media (MLBAM). Chuck is also a co-Chair of Minor League Baseball's Diversity Committee, where he was tapped for a leadership position by Minor League Baseball President Pat O'Conner, in part for his success in attracting substantial minority investment to his ownership groups. Chuck is the former Managing Partner & CEO of the Texas Rangers, a role he assumed in 2010 after his group of investors (Rangers Baseball Express, LLC), which included Baseball Hall of Famer Nolan Ryan, acquired the Major League Baseball franchise from Tom Hicks and Hicks Sports Group. His tenure as Rangers' Managing Partner & CEO was highlighted by the club winning the American League Pennant and reaching first World Series in the history of the franchise. Off the field, Chuck spearheaded the development of an enhanced senior management staff, overhauled the fan experience at Globe Life Park in Arlington, constructed and installed a new state-of-the-art video board, game entertainment control room, and technological overhaul of Globe Life Park, and helped re-establish a sense of trust and excitement between the franchise and community. He was also the architect of a lucrative and landmark deal with Fox Sports Southwest that has since changed the landscape of regional television rights deals throughout the sports industry. Chuck's professional baseball career began in October 2001, when he led an ownership group that purchased the Double-A Eastern League's Altoona Curve. During his time as the Curve's President & Managing Partner (2002-08), the club set numerous single-game and season attendance records, continually reinvested private money into capital improvement projects at Blair County Ballpark, and helped the franchise gain national stature as one of the most creative and innovative teams in professional sports. The Curve won the prestigious Larry MacPhail Promotional Award in 2004, the 2006 Baseball America Freitas Award as the top Double-A franchise, and added the highest honor bestowed annually upon a Minor League Baseball club, the John H. Johnson President's Trophy, in 2006. Altoona became only the 11th franchise to receive all three major awards, and was the first team to accomplish the feat in less than three years. The Pittsburgh native had a long and successful career as a corporate and sports attorney, and currently serves as counsel with the globally-based law firm Reed Smith LLP. Prior to joining Reed Smith in 2010, Chuck was a Partner in the Pennsylvania-based law firm Pepper Hamilton, LLP, which he joined in 1998. He headed the firm's sports practice and was a member of its Executive Committee. Throughout his career, he has lent his expertise to the acquisition and sale of more than two dozen franchises in baseball, football, basketball, hockey, soccer and lacrosse. Among his work in the sports industry, Chuck was instrumental in helping put together the deal that landed a group led by National Hockey League Hall of Famer Mario Lemieux and renowned businessman Ron Burkle ownership of the bankrupt Pittsburgh Penguins in 1999 and saved the franchise for Pittsburgh and Western Pennsylvania. In 2007, he represented Lemieux, Burkle and the Penguins in successful negotiations with the Commonwealth of Pennsylvania, the City of Pittsburgh and Allegheny County which resulted in a deal to build a brand-new, state-of-the-art arena in downtown Pittsburgh and secure the future of the Penguins in Pittsburgh for at least another 30 years. Chuck has been featured in numerous articles and has made frequent television and radio appearances concerning the business and economics of sports, particularly regarding sports franchises and facilities. He has also been a frequent speaker and panelist at the annual National Sports Forum and Baseball Winter Meetings. In 2008, he was named to the Sports Business Research Advisory Board at Penn State University, representing team owners in the work of the Center for Sports Business Research, which focuses on the development of first-rate academic and applied empirical research in the sports industry while helping to define educational opportunities for students looking to start careers in sports business. He also serves on the board of directors of the Mario Lemieux Foundation and also served on the executive committee of the Mario Lemieux Celebrity Golf Invitational, which was held for nearly 20 years. Chuck graduated from Upper St. Clair High School in Pittsburgh in 1978 and four years later received his B.A. from Tufts University in Massachusetts. In 1985, he graduated from the University of Michigan Law School. Chuck makes his home in Westlake, Texas. He has adult sons (Jeff, Jack and Ben). Email Chuck Ryan Moore, President Ryan Moore, President Ryan Moore first joined the Pelicans organization in 2008 as a Ticket Sales Representative. In 2015 Ryan rejoined the Myrtle Beach Pelicans as the Vice President of Business Operations before being promoted to General Manager in 2018. He was elevated to President in 2020. Ryan previously served as the General Manager of the Jupiter Hammerheads, the Miami Marlins Class A-Advanced affiliate. He also worked as the Assistant General Manager of Roger Dean Stadium, the Spring Training location for the St. Louis Cardinals and the Miami Marlins. From 2010-2014 Ryan worked for the Gwinnett Braves, the Atlanta Braves Triple-A affiliate, overseeing their ticket sales efforts. Originally a Connecticut native, Ryan has spent the past 15 years living in the Southeast. Upon his return to Myrtle Beach Ryan became involved with Habitat for Humanity and currently serves on their board. He is also an alum of Leadership Grand Strand 37. A 2006 graduate of Elon University, Moore earned a degree in Sports Management. During his time at Elon, he completed internships with the Greensboro Coliseum and Elon University's Athletic Department. Moore resides in Myrtle Beach with his wife Alexandra, son Austin, and their two dogs, Cooper and Charlie. Phone: 843-918-6000 Email Ryan Kristin Call, General Manager Kristin Call, General Manager Kristin moved to South Carolina to join the Pelicans organization in October of 2013 as the Senior Director of Marketing. She was promoted to Assistant General Manager in 2019, then to Associate General Manager in 2020. She was elevated to General Manager in December of 2021. For her efforts on the Grand Strand, she earned the Carolina League’s Female Executive of the Year award in 2015 and 2019, and was named the Minor League Executive of the Year by Baseball American in 2022. A leader in the Pelicans marketing efforts, Call helped Myrtle Beach set several attendance records and create some of the most creative promotions in all of Minor League Baseball. Kristin's career in the minors began with the West Virginia Power in 2006 as an intern. Prior to the 2007 season she was hired full time as the Director of Promotions. Over the course of her eight years with the Power her roles included Director of Marketing and finally Assistant General Manager, Marketing. She was also recognized as the 2012 South Atlantic League Female Executive of the Year. A highlight of her time with the Power was the team's creation and execution of a healthy lifestyle program in which they promoted the importance of healthy living to over 20,000 kids including appearances at over 100 schools. Kristin is originally from Barboursville, WV and a graduate of Cabell Midland High School. In 2002 she entered West Virginia State University on a 4-year academic and volleyball scholarship and in 2006 graduated Magna Cum Laude with a B.S. in Communications and a focus in Public Relations. During her time in WV, Kristin was also an assistant coach for Charleston Catholic High School's Varsity Volleyball team. During her eight year stint the team enjoyed seven State Tournament appearances and captured two State Titles. Call is also proud to serve her community through involvement with the Myrtle Beach Area Chamber of Commerce, and as the assistant coach for the Myrtle Beach High School Varsity Volleyball team. Phone: 843-918-6018 Email Kristin Ticketing & Sponsorship Sales Ryan Cannella, Assistant General Manager Ryan Cannella, Assistant General Manager--Ticket and Sponsorship Sales Ryan Cannella joined the Pelicans in 2015 as an Account Executive before being promoted to Director of Sales in 2018 and AGM in 2022. In his current role Ryan oversees all outbound ticket and sponsorship sales efforts, leading the team to break records in both categories. He previously spent time with both the Major League Baseball Players Alumni Association and Goodyear Ballpark, Spring Training home of the Cincinnati Reds and the Cleveland Guardians. Ryan is originally from Woodland Park, CO and a graduate of the University Colorado Colorado Springs where he earned a Business Degree with an emphasis in Sport Management. In his free time he enjoys golfing, aspiring to be a professional pit-master, and following the Baltimore Orioles and Ravens. He resides in Myrtle Beach with his wife Sarah, son Cal, dogs Remi and Tucker, and slightly above average weight cat Oscar. Phone: 843-918-6003 Email Ryan Todd Chapman, Director of Ticket Sales Todd Chapman, Director of Ticket Sales Todd Chapman joined the Pelicans in 2013 as a Ticket Sales Intern before being brought on full time for the 2014 season as the Sports & Tourism Sales Manager. He specializes in working with local and travel sports organizations on specialty events, group outings, and fundraising. He also works with large groups traveling to Myrtle Beach for conferences and conventions. A native of South Haven, MI Todd was a 2012 Graduate of Davenport University in Grand Rapids, MI where he majored in Sports Management. He is an alum of Leadership Grand Strand Class 40. He is also an avid golfer (the best on staff) and enjoys listening to music, going to the beach, and watching movies in his free time. Phone: 843-918-6023 Email Todd Shannon Barbee, Box Office Manager Shannon Barbee, Box Office Manager Shannon joined the Pelicans family for the 2010 and 2011 season as the Pelicans Box Office Intern before she was promoted to Box Office Manager in 2012. Prior to joining the Pelicans in 2010, Shannon was a front office intern for the Vermont Lake Monsters (short-season A-Washington Nationals). Shannon is from Du Bois, Pennsylvania where she graduated from Du Bois Area High School and was part of their women's volleyball team and swim team. She then attended Lock Haven University of Pennsylvania and graduated in 2009 with a bachelor's degree in Sport Administration with a minor in coaching. While at LHU, she swam all (4) years on their women's swim team. Shannon resides in Myrtle Beach with her husband Blake, son Owen, and all their pets...mostly cats. Shannon enjoys tarp pulls, printing tickets, the beach, rocking chairs, the hot sunshine, playing \"tourist\" (people watching), and is married into the NC State Wolfpack world. You won't see her very often around the ballpark, so swing by the Box Office to say \"hello\"! Phone: 843-918-6005 Email Shannon Josh Perritt, Box Office Assistant Josh Perritt, Box Office Assistant Josh is a senior at Coastal Carolina University, set to graduate in May. He has a strong passion for sports management and event planning. Josh is eager to join the Myrtle Beach Pelicans organization, where he looks forward to gaining meaningful experience and contributing to the sports industry. Phone: 843-918-6026 Email Josh Connor Hodge, Ticket Sales Manager Connor Hodge, Ticket Sales Manager Connor studied at Newberry College in South Carolina, where he played collegiate baseball for four years as a relief pitcher for the Wolves. He graduated with a Bachelor of Science in Sports Management with honors. He started an internship with the Pelicans in May of 2024 as an Inside Sales Representative and was later hired for a full-time position as Ticket Sales Manager. In his free time, Connor enjoys trying to golf, reading, working out, and watching his favorite sports teams win games once in a while. Phone: 843-918-6014 Email Connor Austin Perry, Ticket Sales Manager Austin Perry, Ticket Sales Manager Austin is originally from Estill Springs, TN. He graduated in 2023 from the University of Tennessee with a Bachelor's Degree in Marketing. He spent the 2024 seasons with the Gwinnett Stripers as a Ticket Sales Intern. Outside of work, he enjoys listening to/playing music, cheering on the Vols, Braves and Titans, and spending time with his dog, Strider. Phone: 843-918-6079 Email Austin Matthew Rosga, Inside Sales Representative Matthew Rosga, Inside Sales Representative Matthew is from Bishop, California and attended Cornerstone University in Grand Rapids, Michigan where he played baseball for 5 years. Matthew majored in Communications with a minor in Sport Management and is currently pursuing a master’s degree. In his free time, Matthew enjoys golfing, fishing, playing video games, working out, and watching movies. Phone: 843-918-6017 Email Matthew Dylan Starnes, Inside Sales Representative Dylan Starnes, Inside Sales Representative Dylan will attending his junior year in the fall at High Point University in High Point, NC. As a lifelong Myrtle Beach native, he graduated from Myrtle Beach High School in June of 2023. Dylan Is actively pursuing a B.A. in Sport Management. He is also an avid golfer who played throughout high school. Dylan is interning with the Pelicans for the summer to expand his knowledge of the industry and to make career lasting connections. His favorite baseball team is the New York Yankees. Phone: 843-918-6028 Email Dylan Peter Brady, Partnership Services Coordinator Peter Brady, Partnership Services Coordinator Peter returns to the Myrtle Beach Pelicans for a second season in 2025. He is a native of Myrtle Beach, attending Carolina Forest High School where he played football for all four years. He graduated in 2022 with his Bachelor’s from Emmanuel College - Boston with a major in Sport Management, and proceeded to move to Washington, D.C. in order to finish his Master’s at Georgetown University’s Sports Industry Management program. Prior to joining the Pelicans, he interned in Minneapolis with the Institute for Athletes, or IFA, a full-scale athlete representation agency as a football operations and marketing intern. In this position, he performed market research for future contract negotiations, marketing services for prospective NIL clientele, and NFL draft preparation research. He also worked within Emmanuel College’s athletic department as the Assistant to the Women’s Head Basketball Coach and Athletic Director. While here, he worked on recruiting efforts, alumni relations, and marketing for the department. Phone: 843-918-6004 Email Peter Fan Engagement & Marketing Hunter Horenstein, Assistant General Manager Hunter Horenstein, Assistant General Manager--Fan Engagement Hunter Horenstein returned to the Pelicans in May 2018 as Director of Fan Engagement after previously spending the 2016 season in Myrtle Beach as a community relations assistant. He was promoted to Assistant General Manager in January 2023. Hunter began his career in 2012 with the San Rafael Pacifics (Pacific Association of Professional Baseball) in the club’s inaugural season assisting with media and community relations efforts. In 2014 he was named Assistant GM of the Sonoma Stompers within the same league, and helped bring professional baseball back to Sonoma County for the first time since 2002. Hunter worked for the Erie SeaWolves (AA affiliate, Detroit Tigers) in 2017 as the team’s Community Engagement Manager, focusing on group and ticket fundraiser sales while also helping manage community programming and in-game entertainment. His previous experience also includes the collegiate level, with the Palm Spring Power (Southern California Collegiate Baseball League) and Long Beach State University Dirtbags. For the Pelicans, Hunter oversees social media, promotions, and in-game entertainment. Within the community, he serves on the Board of Directors for the Grand Strand Miracle Leagues, an organization dedicated to providing those with special needs the opportunity to participate in sports and recreational activities, and represents the Pelicans on the City of Myrtle Beach Military Appreciation Committee. Hunter grew up in Long Beach, Calif., and graduated from Dominican University of California with a degree in Communications and Media Studies. He resides in Myrtle Beach with his dog, Scooby. Phone: 843-918-6022 Email Hunter Kaitlyn Piston, Social Media Assistant Kaitlyn Piston, Social Media Assistant Kaitlyn attended University of Mary Washington and played collegiate volleyball during her time there as a Business Marketing major. In addition to playing volleyball, she ran the social media accounts for UMW Volleyball, UMW Baseball, and UMW Men's Basketball, as well as being the Marketing Coordinator for UMW Campus Recreation. After Kaitlyn graduated from college in May of 2024, she was a content creator for the Appalachian League and was also sent to the MLB Draft Combine to cover Appalachian League players and staff attending. Kaitlyn grew up in Virginia Beach, Virginia with two older brothers and a twin sister. Email Kaitlyn Ryan Rosenthal, Promotions Assistant Ryan Rosenthal, Promotions Assistant Ryan is a native of Myrtle Beach, South Carolina, and a proud graduate of Socastee High School. Throughout his four years in high school, Ryan was deeply involved in theater and technical design, where he honed his skills in creativity, problem-solving, and behind-the-scenes production. His passion for entertainment and event coordination led him to the Myrtle Beach Pelicans, where he began working as a Game Promotions employee during his junior year of high school. Over the past four years, Ryan has become an integral part of the Pelicans’ game day experience, consistently bringing enthusiasm, dedication, and a positive attitude to his role. His commitment to his work was recognized in 2024 when he was honored as the Pelicans Employee of the Year, an achievement that reflects his hard work, reliability, and passion for sports. Now, in his fifth year with the Pelicans, Ryan is excited to take the next step in his career as the Promotions & Fan Engagement Assistant. He is eager to contribute even more to the team’s success and help bring unforgettable experiences to Pelicans fans. Grateful for the opportunity, Ryan is thrilled to continue his journey with the organization and looks forward to the growth and challenges ahead. Phone: 843-918-6012 Email Ryan Brooke Belflower, Marketing & Sponsorship Assistant Brooke Belflower, Marketing & Sponsorship Activation Assistant Brooke Belflower graduated from Avila University with a Sports Communications degree in 2024. She was a five-year collegiate softball player, starting at Bryan College and finishing her career at Avila University. Native to Tunnel Hill, Georgia, Brooke loves living by the beach! She is super excited to be a part of the Pelicans organization and can't wait to gain valuable experience in the sports industry! Phone: 843-918-6007 Email Brooke Production Luke Moehle, Media Relations/Broadcaster Luke Moehle, Media Relations/Broadcaster Luke Moehle enters his first season as the Media Relations/Broadcasters for the Pelicans in 2025. Moehle, 24, served as the Broadcaster and Media Relations assistant for the Frisco RoughRiders, the Class Double-A affiliate of the Texas Rangers last season. A native of Kansas City, Missouri, Luke graduated from the University of Missouri in 2022, earning a degree in Sports Radio/Television Broadcast Journalism and a second degree in Sport Management while spending two seasons as part of the baseball program. Moehle also provided play-by-play of Missouri Tiger football, basketball, volleyball and soccer through the campus radio station, KCOU 88.1. Prior to his start in Minor League Baseball, Moehle spent a summer in Orleans, Massachusetts as the \"Voice of the Firebirds\" of the Cape Cod Baseball League before joining the Kansas City Royals Media Relations department in 2023. In his free time, Luke enjoys golfing, listening to country music and hanging out with his wife, Mati, and their Golden Retriever, Chesney. Bret Shellgren, Video Production Assistant Bret Shellgren, Video Production Assistant Bret is a passionate filmmaker and baseball enthusiast from Washington State. Growing up, he spent much of his time on the baseball field, honing his skills and developing a deep love for the game. This passion led him to play college baseball at George Fox University in Oregon, where he also pursued his studies in film, graduating in 2024. After two years of playing, he made the decision to shift his focus toward his academic and creative pursuits. Rather than continuing his athletic career, he took on a new role behind the scenes, running the team's media operations and gaining invaluable experience in sports production. During a summer, Bret expanded his media expertise by working for the Tacoma Rainiers, a minor league baseball team, further blending his two passions: film and baseball. His work in the sports media world sparked a desire to merge these interests professionally. In 2025, Bret took the next step in his career by joining the Myrtle Beach Pelicans, a Minor League Baseball team. With a unique background combining film production and a lifelong love for the game, Bret is excited to bring compelling visual stories to life, capturing the energy of baseball while continuing to develop his craft in sports media. Email Bret Tom Tricoli, Video Production Assistant Tom Tricoli, Video Production Assistant Tom is in his first season with the Myrtle Beach Pelicans as a Video Production Assistant. After spending the 2024 MiLB season with the Hudson Valley Renegades, he completed his bachelor's degree in media studies and production, at Marist University. Originally from New Jersey, Tom is an avid New Jersey Devils fan. When he's not at the ballpark, you can often find him at the movie theaters watching the newest releases! Email Tom Gwenna Gentle, Video Production Assistant Gwenna Gentle, Video Production Assistant Gwenna is a 2024 Syracuse University graduate with a Master's in TV, Radio, Film, and Sports Media. While at Syracuse, she was a creative video intern for the university's football team and a member of the women's lacrosse team. Gwenna will be a Video Production Assistant for the 2025 season. She is excited to enhance her video production skills, as well as being involved in the sports industry. Email Gwenna Ballpark Operations & Merchandise Dan Bailey, Director of Retail & Ballpark Operations Dan Bailey, Director of Retail and Ballpark Operations Dan is a 2005 graduate of Coastal Carolina University with a degree in Health Promotions. 2021 is Dan's 14th year with the club and first as the Director of Retail and Ballpark Operations. He was the Merchandise Manager from 2009-2020, and prior to that Dan worked as a gameday employee in the Pelicans Pro Shop in 2008 and spent time with his little girls as a stay-at-home dad. Dan and his wife Amanda are the proud parents of three daughters, Mia, Paige, and Maryn. Dan is originally from Cary, North Carolina. Dan is an avid hockey fan and a huge supporter of the Carolina Hurricanes. Phone: 843-918-6008 Email Dan Shay Huber, Retail Assistant Shay Huber, Retail Assistant Shay graduated from Appalachian State University with a degree in Marketing in May of 2024. As a lifelong sports fan, Shay grew up going to minor league games with her family. She is so excited to contribute her skills to the Pelicans and gain valuable experience in the sports industry. Call Shay: 843-918-6008 Email Shay Jordan Barr, Sports Turf Manager Jordan Barr, Sports Turf Manager Jordan Barr joined the Pelicans’ Front Office staff in 2021. His career working in professional baseball began with the Lancaster Barnstormers in 2009, serving as the team’s batboy during his high school years. Jordan attended Penn State University, where he earned a Bachelor’s degree majoring in Turfgrass Science. Jordan’s industry service time as a turfgrass professional has allowed him to excel in various assistantships and head groundskeeping opportunities across collegiate and professional levels. Additionally, Barr achieved the Eagle Scout rank. During his free time, Jordan enjoys catching up with his friends, supporting local culture, riding his bike to the beach, and listening to music. Phone: 843-918-6006 Email Jordan Jason Bliven, Visiting Clubhouse Manager & Ballpark Operations Assistant Jason Bliven, Visiting Clubhouse Manager & Ballpark Operations Assistant Jason Bliven joined the Pelicans as a Stadium Operations Assistant in 2022. He graduated from UNC Wilmington in 2020 where he started his career in baseball working with the Seahawks. While there the team won two Conference Championships and produced 22 MLB draft picks including five current MLB players. Jason grew up on the Outer Banks where he played basketball, baseball, and mainly golf growing up. While after college he mainly worked in the restaurant industry, helping to open an Australian themed restaurant. Email Jason GW Roehner, Operations Assistant GW Roehner, Operations Assistant GW Roehner is currently a Graduate Student at the University of Florida, pursuing a Masters Degree in Sports Management. He graduated from the University of North Carolina at Chapel Hill in 2024, with a Bachelor's Degree in Sport Administration. While at UNC, he worked as a Varsity Manager for UNC Men’s Basketball, a Marketing Intern for UNC Athletics, and was on the Student Advisory Committee for the UNC Sports and Entertainment Summit. He also interned for Elon Athletics as an Events and Facility Management intern. Originally from Leland, NC, GW spends his free time golfing, fishing, playing basketball with friends, or hanging out with his dogs. Email GW Food & Beverage Brad Leininger, Director of Food & Beverage Brad Leininger, Director of Food & Beverage Brad joined the Pelicans in 2009 as the Director of Food and Beverage. A 1991 graduate of York College of Pennsylvania, Brad got his start at Harrisburg Pa. Farm Show Complex and Harrisburg Senators minor league baseball stadium. In 1997, Brad moved to Rock Hill, SC where he was named the Assistant Food & Beverage Manager for the Charlotte Knights (AAA). After a year and a half, Brad was promoted to GM and spent a total of seven years at the old Knights Stadium. In 2005, he needed a change and had a major role in opening the New Bobcats Arena in Charlotte, as Concessions Manager with Levy Restaurants. Since then Brad has dabbled in the F&B industry with CEC Entertainment as Assistant Manager at Chuck E Cheese and a Manager with Sodexo Corporate Services division. In his career, Brad has worked at numerous sporting facilities such as spring training for the Cardinals and SF Giants, The \"Linc\" in Philly, Cleveland Browns, Nashville Predators, and St. Louis University Arena. In what spare time Brad has, he enjoys spending time with his family, golfing and sleeping. Phone: 843-918-6035 Email Brad Tiffany Sharp, Chef Tiffany Sharp, Chef Tiffany relocated to Myrtle Beach from South Jersey in 2013, and joined the Myrtle Beach Pelicans in 2017! She has been in the food industry for 18 years, playing both front and back of the house positions. She became a graduate of the Academy of Culinary Arts in Atlantic County, N.J. after deciding the kitchen was where she enjoyed working. She misses the city life of Philadelphia (go Phillies and Flyers!), but living a few miles from the beach has been a pretty nice trade-off. In her free time she likes to center herself through yoga, which forces her mind and body to settle and relax. Collecting cookbooks has almost become a bad habit, with ethnic food being the most recent interest. She enjoys days off running around with her fiance, Chris, checking out events and avoiding house and yard work, and coming home to their spoiled cat, Chloe. Nick Angiolini, Food and Beverage Assistant Nick Angiolini, Food and Beverage Assistant Nick is from Boise, ID. He is currently studying business management at Coastal Carolina University and will be graduating in May 2025. Nick enjoys golfing and watching Formula One. Email Nick Zach Levy, Food and Beverage Assistant Administration & Finance Anne Frost, Director of Finance Anne Frost, Director of Finance Anne Frost has been with the Myrtle Beach Pelicans since 1999, the inaugural season. She grew up a military brat, living in Italy, Hawaii and Northern Virginia. She is a 1986 graduate of George Mason University with a BS in Finance and Real Estate Development and spent her time working in banking, auditing, and shopping mall development. She currently lives in Carolina Forest with her husband David (\"Frosty\"), and stubborn cat Gus. Her son Zachary graduated from University of South Carolina and works in IT on Daniel Island. Her son Jakob plays college baseball and attends school at the College of Charleston. She is proud to have the cutest, craziest granddoggy ever, Darcy - who also hails as the reigning champ of the \"Pelicans fastest dog\" contest! Anne enjoys her free time hitting the road to cheer on Jake as a pitcher for Cougar baseball, checking out new breweries with Frosty, and loves camping, hiking, rafting, biking, skiing, and other outdoor adventures!  She is a fan of Green Bay Packer, Gamecock, and Badger football games, with no real allegiance to any one team for baseball except the one her kid plays for! Phone: 843-918-6011 Email Anne Beth Freitas, Office Manager/Administrative Assistant Beth Freitas, Office Manager/Administrative Assistant Beth is the club's Office Manager/Administrative Assistant. Before starting with the Pelicans, Beth was in the staffing industry for over ten years. When away from her desk, Beth spends as much time as possible with her husband Eric and her dog, Bella. Beth and Eric enjoy their weekends on the water relaxing on their boat. She is an avid Gamecock and Citadel Bulldog fan. Beth also loves to travel and has visited Europe and several Caribbean Islands but her favorite vacation spot is Hawaii. Phone: 843-918-6077 Email Beth Jessica Adissi, Team Services Assistant Jessica Adissi, Team Services Assistant Jessica is from Leesburg, Virginia. She is a junior sport and entertainment major at the University of South Carolina. She is interning with the Pelicans this summer with multiple departments such as sales, marketing, and operations. She looks forward to a great summer and season! Email Jessica Terms of Use Privacy Policy Do Not Sell My Personal Data Advertise on Our Digital Platforms Copyright © Minor League Baseball. Minor League Baseball trademarks and copyrights are the property of Minor League Baseball. All Rights Reserved"
    },
    {
      "url": "https://pelicanhill.com/contact/",
      "text": "Contact Us - The Resort at Pelican Hill The Resort at Pelican Hill MENU Close Search Close Search for: Home Exclusive Offers Bungalows Villas Extended Stay Program Cabanas Dining Upcoming Events Pelican Picnic Pelican Grill Coliseum Pool & Grill In-Room Dining Great Room Villa Pool Caffè & Market Spa Treatment Menu The Salon Fitness & Wellness Packages Spa Amenities Golf Book A Tee Time Golf Rates & Fees Gold Membership Meetings & Events Executive Meetings One Day Weddings Grand Wedding Weekends Wedding Venues Experiences Upcoming Events Crystal Cove Area Activities Resort Our Story Resort Map Coliseum Pool Gallery The Shops at Pelican Hill Sustainability Resort Information & Policies Postcards from Pelican Hill® Activities Calendar Gift Cards Extended Stay Program Shops Book Your Stay (888) 507-6427 Facebook Pinterest Instagram (888) 507-6427 BOOK YOUR STAY Close BOOK YOUR STAY Check In 12 September Check Out 15 September 2 Adults 1 2 3 4 5 6 7 8 0 Children 0 1 2 3 4 5 6 CHECK AVAILABILITY (888) 507-6427 Pelican Get in Touch With Us We’d be happy to assist you with any questions or concerns regarding your visit. \" * \" indicates required fields Please select the nature of your inquiry. * —– Room Reservations Spa Bookings Conference Room Inquiries Wedding Inquiries Donation Requests Marketing & PR Gift Cards Groups Extended Stay Golf Groups Golf Membership Other Name * First Last Email * Enter Email Confirm Email What is the size of your group? * 16+ Less than 12 For information on Gift Cards, please visit this link . For donation requests and information, please visit this link . For more information on golf memberships please use this form . To submit a request for proposal for your next meeting or conference please use this form . Phone For us to better assist you, please input the best number for us to reach out. This field is hidden when viewing the form Address Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Comments * Communicate with me via: Email Phone CAPTCHA Name This field is for validation purposes and should be left unchanged. Δ Address: 22701 Pelican Hill Road South Newport Coast, CA 92657 DIRECTIONS > Phone Number: 888.507.6427 Join Marriott Bonvoy. Create your Marriott Bonvoy account now to start earning points toward free hotel nights and other rewards. Sign up today and take advantage of exclusive rates for members. Sign up Exclusive Offers Newsletter Facebook Pinterest Instagram Resort Map Information & Policies Contact Us Careers Photography Policy Press Room PHONE: (888) 507-6427 INTERNATIONAL: 001.949.612.0332 22701 Pelican Hill Road South Newport Coast, CA 92657 CURRENT WEATHER 64 ° Clear © 2025 The Resort at Pelican Hill, All Rights Reserved. Accessibility Privacy Policy Social Media Agreement Drone Policy We use cookies on our website. By continuing to use this site, you agree to our cookie policy. Accept"
    },
    {
      "url": "https://pelicanflightschool.com/contact",
      "text": "Contact Pelican Flight Training ✈ Get in Touch Today About About Us Pelican History Our Team Aircrafts Our Alumni's Accreditation Reviews Admissions Admissions International Students Pilot Demand Minimum Requirements U.S. Students Flight Training Pilot Training How to Become a Commercial Pilot? Pilot Training Programs & Courses Student Information Student Info STUDENT SERVICES LOCATION STUDENT LIFE Online Scheduling Useful Links Student Accommodation Contact Us Login Online Scheduling Blog Articles News +1 (305) 877-9069 APPLY NOW Send us a message To contact us online, please complete this form below. We will be in touch with you soon. Name Country Citizenship * Aaland Islands Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegowina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Cook Islands Costa Rica Cote D'Ivoire Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France France, Metropolitan French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guinea Guinea-bissau Guyana Haiti Heard and Mc Donald Islands Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kiribati Kuwait Kyrgyzstan Lao Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northern Mariana Islands Norway Oman Pakistan Palau Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Kitts and Nevis Saint Lucia Saint Vincent and Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Seychelles Sierra Leone Singapore Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia South Africa South Georgia/Sandwich South Korea Spain Sri Lanka St. Helena St. Pierre and Miquelon Sudan Suriname Svalbard/Jan Mayen Islands Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Vatican City State (Holy See) Venezuela Viet Nam Virgin Islands (British) Virgin Islands (U.S.) Wallis and Futuna Islands Western Sahara Yemen Yugoslavia Zaire Zambia Zimbabwe Email: * Phone: * Message: SUBMIT Pelican Flight Training 1601 SW 75th Ave, Pembroke Pines, FL 33023 +1 (305) 877-9069 - Whatsapp Admissions +1 (954) 966-9750 - Front Desk +1 (786) 881-8517 admissions@pelicanflighttraining.com marketing@pelicanflighttraining.com FAA Flight training programs FROM ZERO TO AIRLINE PILOT Commercial Pilot License in 10-15 months / Price $83,950 – Pay after visa approval FAA 141 approved & ACCSC accredited 35+ years of experience Get Commercial Pilot License based on 2 types of training visas M1/F1: M1 Visa programs – Flexible course combinations F1 Visa program – Train, work, and build hours in the USA Learn more Start Flying Foreign Pilot Conversion build 1500 hours of flight experience Convert your ICAO / EASA license to FAA and take CFIs courses. Get paid to fly and earn back up $54,000 as a certified flight instructor, , and continue building the required hours for airline pilot training at our FAA approved pilot training school. Join US regional airline for 1 year and be sponsored for the Type Rating Learn more Start Flying Become a CFI and build your flight expirience Build 1500 hours airline hiring minimums. Get paid to fly and earn back up $54,000 Join US regional airline for 1 year and be sponsored for the Type Rating FAA 141 approved & ACCSC accredited Visa option: F1 – train, work, and gain experience in the USA Learn more Start Flying FROM PPL HOLDERS Commercial Pilot License in 10-15 months / Price $58,207 – pay after visa approval Get Commercial Pilot License based on F1 Visa FAA 141 approved & ACCSC accredited F1 Visa – Train, work, and build 1,500 hours in the USA M1 Visa – Flexible training, return home after completion Multi-Engine Add-on and Instructor Ratings available Learn more Start Flying All Programs airlane and helicopter programs FAA part 141 & ACCSC accredited Since 1985 – 35+ years of excellence From zero experience to airline career airplane & helicopter courses for all Levels International student visa options (M1/F1) Learn more Start Flying Need help? Get free consultation with our school officer about your aviation career and find the best path to your goals. Ask on WhatsApp Explore Our Flight School – Watch the Video Welcome to Pelican Flight Training , Florida's premier flight school offering one of the best training programs for pilots from around the world. We offer a structured program that will take you all the way from private pilot rank to ATP and airline readiness. In this video, you'll learn what makes our flight school so special — the passion, the professionalism, and the world-class fleet of aircraft used for training. From your first flight to becoming a professional pilot, we will be with you every step of the way. Take a look right now and see why training at Pelican isn't just about learning — it's about transformation. Start Flying 2000+ Airplane Private Pilot Certifications 1500+ Airplane Commercial Pilot Certifications 1500+ Airplane Multi-Engine Pilot Certifications 1000+ Airplane Flight Instructor Certifications What Our Students Say ★★★★★ Louis Student I attended Pelican Flight Training at North Perry Airport in Pembroke Pines, Florida, starting in November 2021, and I also worked at the school afterward as a Flight Instructor. Throughout my training and teaching, the school played a crucial role in helping me achieve my goals. The instructors and the training standards they uphold their students to are very professional. I met fantastic people and learned a lot from the experience as well as my peers. Camilo Student I attended PFT as an international student F-1, and everything was pretty quick and easy. The staff from this school is beyond outstanding. I’m very thankful to Oleksandra and Anna, they’re very clear and extremely helpful at anytime. Instructors are very cool and good, facilities are fine, they provide you with advices and choices to do everything right. Overall very nice environment. Robert Student Pelican Flight Training is the best school around. I’ve tried other schools but Pelican is the most Professional my personal opinion. The atmosphere is so positive, the instructors are all so nice and friendly and I just passed my instrument Rating at Pelican and my instructor Adrian was TERRIFIC! And I am so looking forward to going back to start my commercial with them. More reviews on Google Maps → Pelican students life Request More Information Want to become a pilot? Get a free consultation today! Fill out the form and get a free PDF guide: ‘Your First Steps to an Airline Career’ ! We will be happy to personally assist you in making decision for your future airline career by providing you with all the information you might need and providing answers to all of your questions.  Please complete the form, and we will be in touch with you soon. Program Airplane Helicopter Type of Training Do you speak English Yes No Training programs Private Pilot Instrument Rating Commercial Pilot Multi Engine Certified Flight Instructor CFI Instrument Multi Engine Instructor Professional Diploma Program \"A\" About About us Our Fleet How to Choose Our Graduates U.S. Students International Students Admissions Pilot's Career Student Services Contacts Contact us Make a Payment Privacy Policy Terms of Service Sitemap +1 (305) 877-9069 +1 (786) 881-8517 admissions@pelicanflighttraining.com 1601 SW 75th Ave, Pembroke Pines, FL 33023 © 1986-2025 Pelican Flight Training. LANGUAGES ✈ Application Form Personal information Additional Information Choose the courses Flight experience Upload documents Personal information Contacts Address next Additional information Citizenship Marital Status Married Single Can you read, speak and understand English? Yes No Do You Hold an FAA Pilot Certificate ? Yes No Do You Hold an FAA Medical Certificate ? Yes No When Would You Like to Start Training? next Choose the courses Airline Private Instrument Commercial SEL Commercial MEL Certified Flight Instructor Certified Flight Instructor  IR Certified Flight Instructor  ME Convertion to FAA Other Helicopter Private Instrument Commercial SEL Commercial MEL Certified Flight Instructor Certified Flight Instructor  IR Certified Flight Instructor  ME Convertion to FAA Other next YOUR Flight experience Private Certified Flight Instructor Instrument Certified Flight Instructor IR Commercial SEL Certified Flight Instructor ME Commercial MEL Are they FAA? Yes No Previous Flight Experience Total PIC Solo VFR IFR Cross Country Complex Single Engine Multi Engine Dual Given Total flight hours next Upload documents Copy of Passport Add photos from your computer or drag them to this area High School Diploma or higher level of education Add photos from your computer or drag them to this area Resume in English Add photos from your computer or drag them to this area Copy of your last page of the logbook Add photos from your computer or drag them to this area Proof of funds which indicates you have sufficient money to pay for all of your training and living expenses while in the United States. Add photos from your computer or drag them to this area SUBMIT"
    },
    {
      "url": "https://www.linkedin.com/company/pelicanalmc",
      "text": "Pelican Landing Assisted Living & Memory Care | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Pelican Landing Assisted Living & Memory Care Hospitals and Health Care Sebastian, Florida 612 followers Pelican Landing is a thoughtfully designed senior living residence offering a charming setting for seniors on the coast. Follow Discover all 24 employees Report this company About us Nestled in the heart of Sebastian, Florida, home of Pelican Island, the first designated wildlife refuge in the United States, Pelican Landing Assisted Living and Memory Care offers a charming and comfortable setting for its residents. Providing quality senior living in this coastal community, Pelican Landing is less than one mile from the Sebastian River Medical Center and minutes from shopping, parks and the beautiful Intra coastal Waterway. In this quaint corner of the sunshine state, Pelican Landing serves Sebastian seniors with friendly, compassionate caregivers who not only ensure their safety but also make sure their golden years are their happiest.\n\nContact Us\n\nPelican Landing Assisted\nLiving and Memory Care\n13085 US Hwy 1\nSebastian, FL 32958\n\ninfo@thepelicanlanding.com\n\n(772) 581-0366\n\nOr visit us online: thepelicanlanding.com Website https://thepelicanlanding.com/ External link for Pelican Landing Assisted Living & Memory Care Industry Hospitals and Health Care Company size 51-200 employees Headquarters Sebastian, Florida Type Privately Held Specialties Memory Care, Senior Living, Alzheimer's Care, Dementia Care, Senior Care, Elder Care, assisted living, respite care, and Dementia Care Locations Primary 13085 US Highway 1 Sebastian, Florida 32958, US Get directions Employees at Pelican Landing Assisted Living & Memory Care Danielle Eury, LPN, CDP, CADDCT Resident Wellness Director Janna Smith Compassionate Caregiver and Dedicated Professional with 20+ Years of Experience in Healthcare and Retail Zoe McKinney Certified Nursing Assistant at Pelican landing assisted living and memory care Christine Heaton, CDP, ALF Core Certified , VDTF Senior Memory Care Director at Pelican Landing Assisted Living See all employees Updates Pelican Landing Assisted Living & Memory Care 612 followers 2d Report this post Chef Manny fired up the grill for another afternoon well spent. 🍖🎶\nHis weekly cooking demo featured barbecue ribs fresh off the grill, with residents relaxing outdoors, enjoying music, and chatting with the Executive Chef over refreshments. 11 Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 3d Report this post Our residents set off on a global adventure without ever leaving home! 🌍✈️ \n\nOur Annual Delicious Destinations Event brought the tastes of Japan, Italy, and Puerto Rico to life. Each stop featured something special: seafood risotto with limoncello, California rolls with sake, and rice pudding with piña coladas.\n\nWe collected passport stamps at every station before heading to the dining room for live music with local favorite, Fred Cavese. Keith even joined in! A big congratulations to Bob Ragnone, who filled his passport and took home the prize at the drawing! 🥳 +4 6 Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 4d Report this post “I am compassionate about the residents, my job, and everything I do.”  💙 \n\nMelissa Henn, Housekeeper at Pelican Landing, lives her core value Compassion with quiet strength and everyday intention. Whether she’s lending a hand or sharing a kind word, her presence brings comfort and care to those around her. “Compassion is what drives me,” Melissa says. “It’s how I approach my work and the people I serve.”\n\nHer director shares, “Melissa’s compassion shines through every interaction. She makes a lasting difference in the lives of our residents and team.”\n\nCongratulations, Melissa! Thank you for showing that The Difference is Our People. 7 1 Comment Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 4d Report this post Continuing with the birthday celebrations at Pelican Landing! After honoring Keith, we also had the joy of surprising Denise, our Business Office Manager. She walked into balloons and signs of love and appreciation, a reminder of how valued she is in our community. Happy Birthday, Denise, and thank you for all you do every day! 💙✨ …more 9 Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 5d Report this post We love celebrating birthdays at Pelican Landing! 🎉🎂\n\nMost recently, Keith enjoyed a special luncheon in his honor, complete with a gift bag full of his favorite things. To top it off, our Resident Ambassador made sure to capture the moment with a birthday photo. Happy Birthday, Keith! 17 Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 1w Report this post Creativity was flowing at Pelican Landing as we worked on our colorful fish art projects! With Daisy’s guidance, each person added their own unique touch, turning every piece into something special. Thanks again, Daisy! 🎨🐟 +1 10 Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 1w Report this post Another \"Whimsical Moment\" at Pelican Landing! Mark and Jimi had a blast practicing new songs together, and their music added such a special touch everyone's day. We think they sounded amazing! 🎶 5 Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 1w Report this post Our monthly Town Hall at Pelican Landing is more than just a meeting. This is a chance for residents and team members to come together, share updates, ask questions, and talk through ideas that make our community stronger! 💬\n\nThis month’s gathering was extra sweet with Coke floats for everyone to enjoy, followed by a raffle full of fun prizes. These Town Halls are a great way to stay connected, involved, and engaged (while also adding a little fun to the mix!). 6 Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 2w Report this post At Pelican Landing, residents don’t just participate in activities... they help lead them! Kay shared insights from a book on Tai Chi, reminding us how movement and mindfulness support our well-being. It was a beautiful way to begin exercise together, guided by knowledge AND friendship. 🌿 5 Like Comment Share Pelican Landing Assisted Living & Memory Care 612 followers 2w Report this post Celebrating the associates who make Pelican Landing feel like home! 🎉\n\nThis month, we're recognizing Lynn McElfresh, Valeia Flores Gomes, Cherrise Livingston, Hugues Mareus, Jacqueline Monterosso-Olsen, Caitlin Davis, Marciel Norton, Daniela Sanches, and Hailey Shaw. To each of you, thank you for your hard work and dedication.\n\nWe’re grateful for the pride and care you bring to every shift! 6 Like Comment Share Join now to see what you are missing Find people you know at Pelican Landing Assisted Living & Memory Care Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Sylvan Crossings Assisted Living and Memory Care Hospitals and Health Care Madison, WI Benchmark Senior Living Hospitals and Health Care Waltham, MA MEMORY CARE OF NAPLES Hospitals and Health Care Naples, Florida Pelican Garden Hospitals and Health Care Sebastian, Florida The Dementia Guide Hospitals and Health Care Cumming, GA The Brennity at Tradition Senior Living Port Saint Lucie, Florida Assisted Living Locators of San Francisco Nursing Homes and Residential Care Facilities San Francisco, California Arete Assisted Living Facility Hospitals and Health Care Γέρακας, Αττική Provo Assisted Living - Provo's Premier Assisted Living Facility Hospitals and Health Care Provo, UT Jacobs Tender Loving Care Assisted Living Facility Home Health Care Services Plantation, Florida Show more similar pages Show fewer similar pages LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Pelican Landing Assisted Living & Memory Care Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://elderwise.com/communities/pelican-landing-sebastian-fl/",
      "text": "Pelican Landing - Sebastian, FL • ElderWise Skip to content Main Menu Home Modifications Mobility Brands Technology Finance & Legal Health & Lifestyle Medical Alerts Pelican Landing – Sebastian, FL 13085 US Hwy 1 , Sebastian, FL 32958 Pelican Landing is a local, award-winning Assisted Living and Memory Care community. Built in 2015 and opening its doors in April 2016,  this community provides casual, coastal living in a warm, comfortable environment. The warmth is felt when walking through the front door. Future residents are surrounded by coastal colors and seasonal scents that recreate the feeling of going to grandpa and grandma’s home. Pelican Landing is the only Assisted Living Community in Indian River County to provide certified dementia and memory care trained staff. The leadership team at Pelican Landing seeks out and trains staff members to provide exceptional care to each and every resident. Caring for seniors is viewed as a calling, not just a job. Pelican landing is located in the city of Sebastian. It is a Small, fishing village located near the Indian River lagoon and one of the fastest growing areas in the state of Florida. Details You Should Know Care Types Provided Assisted Living, Memory Care, Respite Care Pricing Tier Moderate Location Type Suburban Apartments Furnished No License Assisted Living Facility #12820 View Inspection Report Capacity 89 Total (63 in Assisted Living, 26 in Memory Care) Pets Yes General Information Pelican Landing is an Assisted Living and Memory Care community located in the fishing community of Sebastian, Florida, on the edge of the Indian River Lagoon. This warm, welcoming community is decorated in welcoming  blues, greens and golds- the colors associated with a beach-side setting. The grounds are adorned with an assortment of local plants that provide a welcoming first-impression. Residents enter through the front door into an inviting atmosphere with an easy to follow layout. The gathering  area, such as the dining and community room, are located centrally, for easy access, with the resident apartments located discreetly off to the sides. The community is two stories, quiet and well-constructed. Residents are encouraged to participate in activities such as gardening, a variety of clubs and community outings. The staff is well-trained and encouraged to approach caring for seniors as a calling and an opportunity to learn and serve. All of the staff members have special training for dementia and memory care and The Director of Wellness is a Certified Memory Care Practitioner.  The Executive Director, Dana Ryder, is passionate about caring for the residents. He strives to lead by example as reflected in the core value that he chose for himself, which is ‘genuine’. The physical building and the staff, when put together, create a warm-hug, cookies-and-milk type of feeling for the residents. It feels like coming home. Pelican Landing also offers several outdoor areas for their residents to enjoy, including a large, open, covered porch complete with comfortable, relaxing armchairs. Outdoor areas are designated for activities such as stand up gardening. There is also a pagoda available to the residents for relaxation and lighted walkways allow the residents to enjoy the outdoors at night as well as during the day. Residents in Memory Care enjoy a courtyard as a centerpoint of the community with all of the resident apartments surrounding. This encourages the Memory Care residents to be out, engaged and active. Pelican Landing strives for competent, compassionate caregiving that encourages both the residents and the employees to enjoy their experience together. They offer a home-like, enjoyable environment that encourages their residents to feel comfortable and content. Pricing & Financials Community Fee $2500- one-time, non-refundable fee Assisted Living Studio: Pricing varies by care level. Starting at $3,100/month for assisted living and $5,636/month for memory care One Bedroom: Contact community for more information Lease Terms Month-to-month Pet Fee $500 Pet Fee, one-time, non-refundable fee. Pets are allowed in Assisted Living only *All prices listed above are \"starting at\" monthly estimates. Monthly resident fees may be higher depending on the level of care required. Community Details Dining : Residents at Pelican Landing are offered a wide variety of choices when it comes to dining. The residents in Assisted Living are welcomed into a restaurant-style dining room, complete with servers and several options to choose from on a daily basis. They resource local produce and even serve seafood from their own backyard, as they are positioned right on the Indian River Lagoon. The kitchen staff offers over 30 different lunch and dinner options each week and they are open to adding the resident’s own recipes into the rotation as well. All dietary restrictions will be followed for residents in Memory Care. Residents are also welcome to invite their family or friends for special gatherings, which can be catered by the Pelican Landing staff. Care Services/Staffing : The staff at Pelican Landing is encouraged to look at caregiving as a calling and a gift, an opportunity to help others,  not just a job. Pelican Landing takes a very pro-active and involved approach to staffing their caregivers and staff. The potential employees go through a series of interviews, starting with a large group interview. Once they pass the group interview, they have a one-on-one with a department head and then on to an interview with the Executive Director. The three-part interview process allow associates to come in for the right reasons. It provides an opportunity to learn, grow and understand all aspects of caregiving. Pelican Landing closely follows all State Regulations when staffing. Room Features : Assisted Living: Kitchenette Emergency call buttons/cords Cable TV Local and long-distance phone service Water, sewer, garbage Housekeeping Ceiling Fans Air Conditioning/Heating Unfurnished Studio and One Bedroom 250 – 525 sq. feet Memory Care Unfurnished Private Studio, 250 sq. feet Community Amenities & Activities Amenities : Nurse on-site 24 hours a day Beautician onsite (extra cost) Housekeeping services Laundry and linen service Local transportation Located close to local, waterfront restaurants Local beach access Activities : The activities at Pelican Landing are varied and research-based. In Memory Care they offer a program called INTO (It’s Never Too Late. It is a computer based program that can be utilized by residents to access information on travel, art, music, TV shows, puzzles, spirituality, military information, positive activities, exercise programs, etc. Families and residents can use it together to assist in reminiscence therapy. In Assisted Living they offer groups, games,  baking classes, exercise classes and community outings to sporting events, concerts and festivals, museums, art galleries, historical attractions,etc. Pelican Landing offers speech, physical and occupational therapy services on-site. Location Pelican Landing Assisted Living and Memory Care is located in the small, fishing village of Sebastian, Florida. It is located on Highway 1 and within a  couple of blocks of the Indian River Lagoon, local beach access and several waterfront restaurants. Pelican Island, the first wildlife refuge designated in the United States, is located in Sebastian. Within a short drive of the community are Sebastian River Medical Center, Home Depot, Walmart, gas stations, banks and a variety of restaurants. Local attractions Parks, Beaches & Trails: Sebastian Inlet State Park and Hammock Trail South Beach Community Park Vero Beach Fitness Trail Terrapin Nature Park Shopping: Shopping is nearby, plentiful and varied. The Village Square, a local mall, provides a variety of choices, but there are also places like Home Depot, Walmart, small local shops and supermarkets. Things to do: Pelican Island Environmental Learning Center McKee Botanical Garden St. Sebastian River State Park McLarty Treasure Museum Nearest hospitals & doctors Sebastian River Medical Center 13695 US-1 Sebastian, FL 32958 Palm Bay Hospital 1425 Malabar Road NE Palm Bay, FL 32907 Indian River Medical Center 1000 36th Street Vero Beach, FL 32960 Nearest places of worship St. Sebastian Catholic Church 13075 US-1 Sebastian, FL 32958 Roseland United Methodist Church 12962 Roseland Rd Roseland, FL 32957 Community Baptist Church 12534 Roseland Road Sebastian, FL 32958 Community FAQ Does Pelican Landing require a long-term contract? No, Pelican Landing does not require a long-term contract. They offer their residents a month-to-month contract. What types of health assessments are performed routinely? All of the residents at Pelican Landing are evaluated before moving in, at move-in and then again within 30 days of moving in. If there is not a change of condition, evaluations are performed every 90 days going forward. If there is a change of condition, the resident will be re-evaluated and the family will be contacted. A new/ updated plan of service will be drafted at that time. What types of community events does Pelican Landing offer? The residents at Pelican Landing will have the opportunity to participate in community events including but not limited to golf tournaments, concerts, museums, dining out, theater, festivals and historical attractions. Are the apartments furnished at Pelican Landing? No, the apartments are not furnished. Residents are able to bring their familiar items, furniture and keepsakes with them to Pelican Landing. Is there a licensed nurse on staff at all times? Yes, a licensed nurse and highly trained staff are on-site 24 hrs per day, 7 days per week. Is Pelican Landing  able to accommodate a special diet? Yes, please ask the staff ways the chef can meet your individual needs. Are pets allowed at Pelican Landing? Yes, pets are allowed in Assisted Living and a $500 non-refundable deposit is required. Request Additional Info Phone: (772) 581-0366 Website: http://thepelicanlanding.com/ Post navigation ← Previous Post Next Post → Recent Posts Do You Need an Expensive Medical Alert System? Senior Hobbies and Their Surprising Health Benefits How To Stay Mobile For Longer As You Age How To Prepare Your Home For Welcoming A Parent With Mobility Issues The Best Community Classes and Activities for Seniors Gadgets to Help with Independent Living Tips for Helping an Elderly Loved One Stay Mobile and Happy Is It Worth Buying A Medical Alert System? Issues and How to Avoid Them Do Brain Training Games Help With Cognition? Which Is Better, Life Alert or Medical Alert? Quick Links Home Modifications Mobility Brand Reviews Technology Finance & Legal Health & Lifestyle Medical Alerts Communities Stairlift Installation in California Copyright © 2021 ElderWise"
    },
    {
      "url": "https://www.pelicanslanding.com.au/contact/",
      "text": "Contact |  Pelican’s Landing Privacy Policy Jobs About Restaurant Functions What’s On Contact About Restaurant Functions What’s On Contact Contact Get in touch Keen to book a table? Looking for a great function package? Want to learn more about our menus? Get in touch with us below. We’ll be right with you. On the Waterfront 1 Syme Street Williamstown, Melbourne (03) 9397 0155 info@pelicanslanding.com.au Pelican’s on Facebook Pelican’s on Instagram Launch Google Maps Name * First Last Phone Number Email * Message * Join our mailing list? Yes please! All content Copyright 2016 Pelicans Landing. Site by Megawatt Media"
    },
    {
      "url": "https://pelicanhill.com/",
      "text": "5 Star Luxury Resort in Newport Beach, CA - The Resort at Pelican Hill The Resort at Pelican Hill MENU Close Search Close Search for: Home Exclusive Offers Bungalows Villas Extended Stay Program Cabanas Dining Upcoming Events Pelican Picnic Pelican Grill Coliseum Pool & Grill In-Room Dining Great Room Villa Pool Caffè & Market Spa Treatment Menu The Salon Fitness & Wellness Packages Spa Amenities Golf Book A Tee Time Golf Rates & Fees Gold Membership Meetings & Events Executive Meetings One Day Weddings Grand Wedding Weekends Wedding Venues Experiences Upcoming Events Crystal Cove Area Activities Resort Our Story Resort Map Coliseum Pool Gallery The Shops at Pelican Hill Sustainability Resort Information & Policies Postcards from Pelican Hill® Activities Calendar Gift Cards Extended Stay Program Shops Book Your Stay (888) 507-6427 Facebook Pinterest Instagram (888) 507-6427 BOOK YOUR STAY Close BOOK YOUR STAY Check In 12 September Check Out 15 September 2 Adults 1 2 3 4 5 6 7 8 0 Children 0 1 2 3 4 5 6 CHECK AVAILABILITY (888) 507-6427 Pelican Summer Lingers Longer on Newport Coast. Give yourself a golden getaway with savings starting at 15% on 2 or more nights. book offer At a Glance Perched upon 504 acres of unrivaled coastal beauty in Newport Beach, Pelican Hill ® is set apart as a world unto itself. Offering a sanctuary of seclusion, a feast for the senses, and a retreat for family and friends. 22701 Pelican Hill Road South Newport Coast, CA 92657 Accommodations Bungalow Guest rooms & Suites or 2, 3, & 4 Bedroom Villas to choose from Dining 5 dining outlets – Restaurants, bars, cafe’s and in-room dining Oceanview Golf 36 World-Class holes designed to take your breath away. The Spa Luxury spa treatments, Acqua Colonnades, Fitness and Wellness activities Event Venues For meetings, conferences, lavish weddings & celebrations. Coliseum Pool One of the most strikingly unique pools found anywhere. Wrapped in Summer’s Extended Embrace Discover our upcoming seasonal experiences only at Pelican Hill ® upcoming events view calendar sunset strolls Delight in Every Bite Savor the joy of lingering over a leisurely meal at Coliseum Pool and Grill or Pelican Grill, where dazzling vistas enhance your dining experience. As the extended days of summer sunshine transition into autumn, the gentle breeze and golden landscape provide the perfect backdrop for delicious dishes like sweet corn capelletti or snake river farms wagyu filet paired with a glass of fine wine. explore dining Gather & graze Pelican Picnic Savor an afternoon al fresco with a Mediterranean inspired picnic including seasonal sandwiches, salads, fresh fruit, and homemade spreads. Guests keep the branded cooler backpack and deluxe picnic blanket. learn more beyond the resort The Resort at Pelican Hill ® is ideally positioned to encourage exploration in both directions. Guests can enjoy Crystal Cove state beach and the convenience of a shuttle that includes towels and beach toys or venture to Newport Harbor for an afternoon exploring in an electric Duffy boat. Stroll Balboa Island and its charming collection of local boutiques and eateries on Marine Ave. Head south to Laguna to discover an authentic local art scene that features festivals, performances, and exhibits throughout the year. learn more plan your stay Discover our best rates, designed just for you. Book directly and enjoy our exclusive daily packages. browse exclusive offers our accommodations Italian Essence, Newport Beach Style Our private, residential-style Bungalows and Villas offer ample space to spread out and are casually elegant, with an attentive staff there to anticipate your needs at every turn and provide an exceptional level of care. Resort amenities are designed with you in mind, providing all the comforts of home with the activities and relaxation of an ultra luxury vacation away. Bungalows learn more Villas LEARN MORE AROUND THE RESORT Delight in our lavish resort facilities for the duration of your stay. relax at the spa Find Your Peace Amongst the bustle of the season, we invite you to discover our new spa packages that combine the very best facial and body treatments to refresh and recharge when you need it the most. pamper yourself oceanview golf 36 world-class holes designed to take your breath away. With the Ocean North and Ocean South Courses, Tom Fazio’s vision has been brought to life in its purest form. Our 36 holes of championship golf weave their way through stunning terrain and breathtaking vistas, with every lie, every shot and every hole designed to perfectly complement the natural landscape. memberships & rates play legendary THE COLISEUM POOL One of the most strikingly unique pools found anywhere. Overlooking endless sea and coastal backdrops, guests gather daily to see and be seen, immerse themselves, relax under the Southern California sun, and wile away the days pampered by pool attendants in ultra-luxurious private cabanas. splash around view menus DINE DELICIOUSLY Enjoy every meal with a side of breathtaking ocean views. view resort dining view menus Getting Here Pelican Hill ® is perched upon the coastline, just south of Newport Beach. The Resort is a 15-minute drive from Orange County’s John Wayne Airport and a 45-minute drive from Los Angeles International Airport. 22701 Pelican Hill Road South (map) Newport Coast, CA 92657 (888) 507-6427 DIRECTIONS FROM: Los Angeles International Airport › Long Beach Airport › John Wayne/Orange County Airport › Join Marriott Bonvoy. Create your Marriott Bonvoy account now to start earning points toward free hotel nights and other rewards. Sign up today and take advantage of exclusive rates for members. Sign up Exclusive Offers Newsletter Facebook Pinterest Instagram Resort Map Information & Policies Contact Us Careers Photography Policy Press Room PHONE: (888) 507-6427 INTERNATIONAL: 001.949.612.0332 22701 Pelican Hill Road South Newport Coast, CA 92657 CURRENT WEATHER 72 ° Clouds © 2025 The Resort at Pelican Hill, All Rights Reserved. Accessibility Privacy Policy Social Media Agreement Drone Policy We use cookies on our website. By continuing to use this site, you agree to our cookie policy. Accept"
    },
    {
      "url": "https://pelicanslandingresort.com/contact",
      "text": "Contact 3 — Pelican's Landing Resort and RV Park  55+ 0 Skip to Content Pelican's Landing Resort and RV Park  55+ Home Cottages Amenities RV Park Reservations Rates & Policies About Sebastian Photo Hub Contact Open Menu Close Menu Pelican's Landing Resort and RV Park  55+ Home Cottages Amenities RV Park Reservations Rates & Policies About Sebastian Photo Hub Contact Open Menu Close Menu Home Cottages Amenities RV Park Reservations Rates & Policies About Sebastian Photo Hub Contact Phone P: (772) 589-5188 Email info@pelicanslandingresort.com Address Pelican's Landing Resort 11330 South Indian River Drive Sebastian, Florida 32958 Directions Get in Touch Name * First Name Last Name Email * Phone (###) ### #### Subject Message Thank you!"
    },
    {
      "url": "https://thedyrt.com/camping/florida/pelicans-landing-resort",
      "text": "Pelicans Landing Resort Camping | Sebastian, Florida Find Camping Create a Dyrt Alert Unlock PRO Benefits List Your Property More Join Sign In Find Camping More Review a Campground Add a Location Gift Cards Contests Magazine Advertise About Us Press Careers Support Near Me Open in App Find Camping Create a Dyrt Alert Unlock PRO Benefits List Your Property Camping Florida Sebastian, FL Pelicans Landing Resort Contact Campground Photos Location Site Types Features Reviews Contact Get the App View Photos Roads Buildings Nature Facilities Unlock Planning Tools in App Save Add Review Share Location Established Camping Pelicans Landing Resort 1 Review Do you own or manage this property? Claim Your Listing CAMPER SUMMARY PRESENTED BY Pelicans Landing Resort is near Sebastian, Florida, featuring flat terrain typical of the region. Temperatures range from the mid-60s in winter to the high 80s in summer. Campers can explore the nearby Sebastian Inlet State Park and the Indian River Lagoon, both offering opportunities for outdoor activities. Suggest an Edit Location Pelicans Landing Resort is located in Florida Directions From jct I-95 & CR 512: Go 3/4 mi NE on CR 512. Then 1/4 mi S on Indian River Dr. Copy Directions Address 11330 S Indian River Dr Sebastian , FL 32958 Copy Address Coordinates 27.80060802 N 80.46022718 W Copy Coordinates Open in Google Maps The Dyrt Alerts Get reservations at sold-out campgrounds. Learn More Presented by Detours Nearby LOCAL FAVORITES PRESENTED BY McCarthy Ranch Preserve 49 min away Bohemian Freedom Ranch 1 hr 9 min away Drive Time Presented by from Sebastian 40 min from Port St. Lucie 1 hr 23 min from Orlando 1 hr 44 min from Sebring Try Drive Time in App Access Drive-In Park next to your site Boat-In Sites accessible by watercraft. Connectivity Presented by T-Mobile is introducing T-Satellite to extend coverage in the outdoors Learn More T-Mobile 5G Excellent Coverage Verizon 5G Excellent Coverage AT&T 5G Good Coverage Site Types Tent Sites RV Sites Features For Campers ADA Access Trash Picnic Table Phone Service Reservable WiFi Showers Drinking Water Electric Hookups Toilets Alcohol Pets Fires For Vehicles Sanitary Dump Sewer Hookups Water Hookups 50 Amp Hookups Big Rig Friendly Contact General Info +17725895188 Visit Website info@pelicanslandingresort.com 2025 Detourist Giveaway Presented by Review Campgrounds. Win Prizes. Enter to Win Enter to Win Reviews Add Review 5 Stars 4 Stars 3 Stars 2 Stars 1 Star 100% 0% 0% 0% 0% 5.0 out of 5 1 Review John R. Legend Reviewed Jul. 25, 2021 Gorgeous hidden little RV park!!! This place is a gem. Mostly full time residents, but a couple beautiful water front sites. Clubhouse, friendly people, and a dock! Month of Visit July (13) View All Share Report Showing results 1- 1 of 1 reviews For information regarding reservations, contact this campground directly. The Dyrt Alerts Get reservations at sold-out campgrounds. Learn More Presented by Contact General Info +17725895188 Visit Website info@pelicanslandingresort.com Detours Nearby LOCAL FAVORITES PRESENTED BY McCarthy Ranch Preserve 49 min away Bohemian Freedom Ranch 1 hr 9 min away Drive Time Presented by from Sebastian 40 min from Port St. Lucie 1 hr 23 min from Orlando 1 hr 44 min from Sebring Try Drive Time in App Find popular camping nearby Whispering Palms Resort Sebastian , Florida 2 Reviews 9 Photos Donald MacDonald Campground Sebastian , Florida 9 Reviews 19 Photos Vero Beach Kamp Sebastian , Florida 15 Reviews 58 Photos Sebastian Inlet State Park Campground Sebastian , Florida 37 Reviews 86 Photos Breezeway Trailer Park & RV Park Grant , Florida 1 Review 6 Photos Long Point Park Campground Grant , Florida 35 Reviews 139 Photos Instant Book Vero Beach Equestrian Club Sebastian , Florida 1 Review 9 Photos 10% off Encore Sunshine Travel Fellsmere , Florida 6 Reviews 28 Photos Camelot RV Park Malabar , Florida 2 Reviews 1 Photo Tanglewood Village Co-Op 55+ Vero Beach , Florida 2 Reviews 10 Photos Frequently Asked Questions Does Pelicans Landing Resort have RV hookups? According to TheDyrt.com, Pelicans Landing Resort has 50 amp electric hookups, water hookups and sewer hookups. What is the elevation of Pelicans Landing Resort? Pelicans Landing Resort is located at 4 feet. What is the max vehicle length at Pelicans Landing Resort? Pelicans Landing Resort allows vehicles up to 50 feet. Are fires allowed at Pelicans Landing Resort? Yes, according to campers on TheDyrt.com, fires are allowed at Pelicans Landing Resort, although make sure to check current fire restrictions in the area. Does Pelicans Landing Resort have wifi? Yes, according to campers on TheDyrt.com, Pelicans Landing Resort does have wifi. Is there cell phone reception at Pelicans Landing Resort? According to campers on TheDyrt.com, there is good coverage for AT&T, excellent coverage for T-Mobile, and excellent coverage for Verizon. Keep Exploring Popular camping destinations near Sebastian, FL Cocoa Beach, FL (38 miles) Cape Canaveral, FL (42 miles) Port St. Lucie, FL (35 miles) Merritt Island, FL (35 miles) Vero Beach, FL (11 miles) Fort Pierce, FL (26 miles) Palm Bay, FL (17 miles) Jensen Beach, FL (41 miles) Got the top ranked camping app? Download The Dyrt app now 4.8 129k ratings Explore Review a Campground Add a Location Gift Cards Contests Magazine Meet The Dyrt List Your Property Advertise About Us Press Careers Support The Dyrt is the only camping app that has it all: State and National Park campgrounds, RV parks, glamping, and free campsites. © 2025 The Dyrt, Inc | All rights reserved Contest Rules Privacy Policy Terms of Use"
    }
  ]
}