{
  "fuentes": [
    {
      "url": "https://the-perch.co.uk/",
      "email": "events@the-perch.co.uk"
    },
    {
      "url": "https://the-perch.co.uk/",
      "email": "info@the-perch.co.uk"
    },
    {
      "url": "https://thevendry.com/venue/21462/perch-los-angeles-ca",
      "email": "events@perchla.com"
    },
    {
      "url": "https://thevendry.com/venue/21462/perch-los-angeles-ca",
      "email": "mecca.hayes@citrusmgt.com"
    },
    {
      "url": "https://perchpartners.com/",
      "email": "adiamond@perchpartners.com"
    },
    {
      "url": "https://perchpartners.com/",
      "email": "perchinfo@perchpartners.com"
    },
    {
      "url": "https://piafkitchen.com/the-perch-rooftop-patio/",
      "email": "nerdstuds-logo-white-rgb-526px@72ppi-300x159.png"
    },
    {
      "url": "https://piafkitchen.com/the-perch-rooftop-patio/",
      "email": "nerdstuds-logo-white-rgb-526px@72ppi-300x159.png.webp"
    },
    {
      "url": "https://piafkitchen.com/the-perch-rooftop-patio/",
      "email": "nerdstuds-logo-white-rgb-526px@72ppi.png"
    },
    {
      "url": "https://piafkitchen.com/the-perch-rooftop-patio/",
      "email": "nerdstuds-logo-white-rgb-526px@72ppi.png.webp"
    },
    {
      "url": "https://www.perch360.com/contact/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://www.perchla.com/perch-contact",
      "email": "hr@citrusmgt.com"
    },
    {
      "url": "https://www.perchla.com/perch-contact",
      "email": "info@perchla.com"
    }
  ],
  "mails": [
    "adiamond@perchpartners.com",
    "events@perchla.com",
    "events@the-perch.co.uk",
    "hr@citrusmgt.com",
    "info@perchla.com",
    "info@the-perch.co.uk",
    "logo@2x.png",
    "mecca.hayes@citrusmgt.com",
    "nerdstuds-logo-white-rgb-526px@72ppi-300x159.png",
    "nerdstuds-logo-white-rgb-526px@72ppi-300x159.png.webp",
    "nerdstuds-logo-white-rgb-526px@72ppi.png",
    "nerdstuds-logo-white-rgb-526px@72ppi.png.webp",
    "perchinfo@perchpartners.com"
  ],
  "nombre_sitio": "perch360.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://the-perch.co.uk/",
      "text": "The Perch Oxford - Pub, Restaurant and Wedding Venue on Oxford's Port Meadow home about menus drinks occasions events reviews gallery contact Book Online Weddings at The Perch Buy a Perch Gift Voucher A historic riverside pub & restaurant in Oxford We serve proper British pub food inspired by modern and traditional recipes… …and a rotating selection of local and regional real ales, craft beers, stouts, and ciders. Perfect for a well earned pint or glass of wine after a walk on Port Meadow… …always warmly welcoming to families with muddy boots, children and dogs. While away a summer’s afternoon in our lovely sunlit garden (while the weather lasts). A picture perfect setting for weddings , celebrations and events. We are open for business as usual whilst Botley Road in Oxford is closed to traffic at the railway bridge. Please download our directions map to find out how you can reach us by car, foot or bike. About The Perch, Binsey, Oxford An Oxford institution as old as the university. The Perch is one of Oxford’s oldest pubs. We’re just a few minutes walk from the Isis (Oxford’s stretch of the Thames) and Port Meadow, a historic common stretching from Jericho to Wolvercote. In the summer, our garden is the envy of the whole city, and our 17th century plaster-rubble building with its traditional thatched roof will charm even the most seasoned pub-goers. There’s been a pub on our site for at least 800 years. In those 800 years, we’ve been a favourite of some of Britain’s best poets and authors, a frequent haunt of Inspector Morse, and even an influential venue on the British Jazz scene. In Spring 2015, we conducted a full scale renovation to bring a traditional pub into the modern world, and ensure we’ll be around for the next 800 years. We provide a refuge for everyone who loves great food and drink – whether they’re thirsty students, hungry walkers, exploring families, muddy dogs, adventurous visitors or wedding parties . Our Menus A traditional approach with seasonal variations that bring something extra to the table. Our food has a classic British farmhouse focus allowing seasonality and quality of ingredients to lead our menus…home baked breads, pies, puddings & casseroles, river & sea fish, summer salads, potted meats & terrines, homemade chutneys, pickles & preserves, hedgerow desserts and a very fine Ploughman’s…You get the idea. We’re proud of our suppliers and the food we make, so if you want to know anything about anything on the menu, just ask. We love it when you leave knowing more than when you arrived. Main Menu Sunday Lunch Menu Children's Menu Desserts Menu Vegan Menu Gluten Free Menu Dairy Free Menu Shed Bar Menu Please note that we are currently not accepting cash, only payments by card are accepted. Thank you. Our Drinks Something to quench every thirst – whatever the weather. We update our drinks selection as often as we update the menus, so there’s always something new to suit the season. Whether you’re after a nice chilled cider from our garden’s shed bar during the summer, or a hearty winter ale to pep you up by the fire after a winter walk on Port Meadow. We take good drinks just as seriously as we take good food. We work closely with breweries of all sizes to bring you a magnificent and ever-changing selection of ales, ciders, and perrys. We also offer an extensive list of quality English wines to complement our menus, as well as a full bevy of soft drinks and hot beverages. We’re proud to say we probably have the best selection of English wines in the county. Wine Menu Occasions and Parties The Perch provides the perfect venue for any event, with room for up to 200 guests. Our newly refurbished dining room is the epitome of traditional style and in the summer our garden makes a fabulous outdoor venue – and we even have a marquee if you’re not so willing to trust the Great British weather - perfect for weddings or special birthdays and anniversaries. Hosting your event at the Perch also gives you access to our bespoke party menus. To find out more, please call us on 01865 728 891 or email us at any time. Events at The Perch We’ve had a lot going on for the past 800 years, and we can’t think of any reason to stop now. In the summer, we host our annual Beer and Cider festival as well as outdoor movie nights and music festivals. Our events reflect the seasons, just like our menu. And we also host special nights dedicated to intriguing new dishes and ingredients. Because we love great food, and love sharing it with you. We pack a lot in because we don’t like to see a second of good sunlight (or moonlight) wasted. And let’s face it. It’s England. We know we aren’t going to get many. Remember to keep an eye on our Instagram feed . Some of our events are spur of the moment and we might not post them here. Reviews Some glowing words from customers and the local press... \"If you seeking a pub with a buzz and/or want to tick off a classic Oxford experience, you’ll have a grand old time here. It’s hard to think of a better located pub in the county...\" Muddy Stilettos Review. Read the full review... \"I would recommend the pub for a leisurely weekend meal or as a place to celebrate a special occasion. Make the most of the summer weather and book a table while it’s sunny!\" Vegan Eats Oxford Review. Read the full review... \"Always a great place to pop in for a drink, The Perch is also a justifiably popular place to eat...Wonderland indeed!\" Oxford Times Review. Read the full review... \"All in all, we had an amazing time: the food was amazing, the atmosphere great, and the staff really friendly...I would highly recommend the Perch, it's a really lovely place!\" That Oxford Girl Review. Read the full review... \"Personally, I think the Perch is the kind of pub everyone wishes was their local down the road from where they live. It’s spacious, relaxing, has a lovely garden/interior, plus a decent menu and selection of drinks. What more could one want from a local pub?\" Oxfordable Review. \"Overall I would recommend The Perch to anyone visiting Oxford. Being so close to the city, it was a lovely excuse to retreat to a cosy pub will a welcoming village feel. I really wish there were more places like it so close to my city centre....\" Emily's Recipes and Reviews. Read the full review... \"...the sort of place you could only wish was your local. With a garden to die for and a great British menu there’s more than one reason why you should visit The Perch...\" The Foodaholic Review. Read the full review... \"...the menu at The Perch was one of the more inspiring I’ve seen recently, packed with dishes a bit different from the norm...\" Eat with Ellen Review. Read the full review... \"The Perch has friendly service and delightful food, what more can one ask for?\" Concierge Angel Review. Read the full review... \"The Perch Inn has history, atmosphere and arguably some of the finest food in Oxford\" Yours Magazine Review. \"We loved our trip to the Perch...We will definitely be heading back...\" The Weekend Tourist Review. \"I would highly recommend the menu to all vegans, the chef at The Perch has definitely succeeded in creating fabulous dishes.\" Veggie Eye, Vegan Menu Review. \"If you’re in need of some fish and chips and a pint of ale, you’ll be hard-pressed to find better.\" - One of the Top 10 Places to Eat out in Oxford Country & Town House Magazine. Read the full feature... \"Head chef Craig Thomson has got the formula absolutely spot on...cooked to absolute perfection...the relaxed atmosphere inside the pub is incredibly inviting...a very well-presented, well-managed and well-executed gastropub.\" OX HC Magazine Review. Featured on list of \"15 British Pubs Where You’ll Have The Best Night Of Your Life\" Buzzfeed and Visit britain. See the full list... \"The most picturesque pub in Oxford...the food is divine.\" The Lux Insider Review. \"The beer garden here is the perfect place to sprawl out in the sunshine...Book in advance if the forecast is good.\" The Sunday Times - The best places to have Sunday lunch. \"This country eatery now offers a stunning menu and beautiful surroundings... It’s magnificent ...The Perch is now a treasure of a pub.\" Oxford Mail Review. Read the whole review... \"The Perch in Binsey Lane has it all. Family-friendly with a lovely garden. Newly developed terrace for grown-up eating. Cosy feeling inside for gastropubbing with friends or having a quiet drink in front of the fire. A lovely walk on the doorstep, but parking outside if you can’t be bothered to walk across Port Meadow. Dog-friendly too. Since the pub was taken over last year and reopened in the Spring, the food is far superior –  less fussy, more local-friendly, lots of easy-eating options without going down market.\" Muddy Stilettos Review. \"Miraculously this was my first time coming to The Perch, drawn out to Binsey by the Irregular Folk Summer Sessions Weekender; it won’t be my last visit.\" Daily Info Review. Read the whole review... \"Good food, in robust British style is of primary appeal to punters. They flock across Port Meadow at weekends for scrummy burgers served from the Shed Bar in the lovely garden or the much wider range of dishes offered inside or outside on the covered and heated (when necessary) terrace. Flavoursome British food in a lovely setting famous for centuries.\" Oxford Times Review. Read the whole review... \"One of the best places to have Sunday lunch\" “Fabulous food in a fabulous setting” “Excellent food - Excellent service” “Well worth the visit” \"Best dinner in Oxford\" “Hidden gem of a pub” \"Excellent food, service and atmosphere.” “Great Food!” “Fabulous Sunday lunch” “A tranquil spot, serving excellent food in a lovely setting” “Magical pub!” “Excellent riverside venue” “Great location, great service” “Simply Outstanding” Customer reviews from Our Trip Advisor Page... Gallery Take a look around our newly refurbished dining room and our world-famous garden. There’s always a warm welcome at the Perch – whether the warmth comes from the sun or the fireplace. Contact Us The Perch Inn, Binsey, Oxford, OX2 0NG Telephone: 01865 728891 Email: info@the-perch.co.uk Please note that we are open for business as usual whilst Botley Road in Oxford is closed to traffic at the railway bridge. Please download our directions map to find out how you can reach us by car, foot or bike. Download our Directions Map Please note that we are currently not accepting cash, only payments by card are accepted. Thank you. Reserve a Table Online Opening Times: Pub: Monday to Sunday - 11am until 10pm Kitchen: Monday to Sunday - 12noon until 9pm Shed Bar: Saturday & Sunday only & Bank Holidays (Weather and staff permitting) – 11am until 7pm Please check Instagram for updates to confirm if the shed bar is open. The Perch Binsey Lane, Oxford OX2 0NG 01865 728891 © 2025 The Perch | Privacy Policy Website by Hello Design"
    },
    {
      "url": "https://thevendry.com/venue/21462/perch-los-angeles-ca",
      "text": "Perch - French Restaurant in Los Angeles, CA | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels Perch Restaurant 448 S Hill St, Los Angeles, CA 90013, USA Downtown Perch 448 S Hill St, Los Angeles, CA 90013, USA Downtown Request Pricing Cuisine Type French # of Spaces 4 Capacity Max Seated: 200 Max Standing: 325 The ambiance at Perch LA is unique at every turn. As you arrive to the 15th floor restaurant, bar & lounge you are greeted by beautiful antique-inspired furniture, plush lounge couches and incredibly detailed woodwork, which will transport you to French inspired restaurants of old. You can choose to enjoy the fresh, intimate indoor bohemian ambiance or be seated at one of the outside patios with ornate fireplaces, lush landscaping, breathtaking views of the Downtown L.A. skyline and a direct view to the stars above.\n\nIf you are in search of a more intimate lounge experience, simply move on up to the 16th floor rooftop lounge with ornate furniture and cozy fire pits to enjoy delicious cocktails, great music and an unparalleled 360 degree view of Downtown L.A. Show more Show more Request Pricing 448 South Hill Street, Los Angeles, CA Show on the map Spaces 16th Floor Rooftop Max Seated: 90 Max Standing: 150 15th Floor Max Seated: 200 Max Standing: 325 Bar 13 Max Seated: 100 Max Standing: 130 5th Street Patio Max Seated: 28 Max Standing: 30 16th Floor Rooftop Max Seated: 90 Max Standing: 150 15th Floor Max Seated: 200 Max Standing: 325 Bar 13 Max Seated: 100 Max Standing: 130 5th Street Patio Max Seated: 28 Max Standing: 30 Press Hotels Above Par Los Angeles’ Best Restaurants and Bars With Picture-Perfect Views Apr 30, 2024 Time Out The 16 Best Rooftop Bars For Sweeping Views Of L.A. Mar 20, 2024 Secret Los Angeles Best Restaurants For An Unforgettable And Delicious Easter Brunch Mar 13, 2024 Secret Los Angeles 10 Exquisite Rooftop Restaurants In Los Angeles With Unbeatable Views Feb 29, 2024 Hotels Above Par Los Angeles’ Best Restaurants and Bars With Picture-Perfect Views Apr 30, 2024 Time Out The 16 Best Rooftop Bars For Sweeping Views Of L.A. Mar 20, 2024 Secret Los Angeles Best Restaurants For An Unforgettable And Delicious Easter Brunch Mar 13, 2024 Secret Los Angeles 10 Exquisite Rooftop Restaurants In Los Angeles With Unbeatable Views Feb 29, 2024 Thrillist Fill Up on Burritos, Bagels, and More at the Best Brunch Spots in Los Angeles Sep 6, 2023 Secret Los Angeles 21 Of The Best Rooftop Bars in Los Angeles To Sip In Style Aug 1, 2023 PaperCity Magazine Our Ultimate Guide to Exploring Los Angeles — The Best Shops, Private Clubs, Restaurants, and Where to Rest Your Weary Head Apr 4, 2023 The Vendry Memo The Best Los Angeles Rooftop Venues in 2023 Mar 24, 2023 The Infatuation The Best LA Bars For Big Groups Feb 28, 2023 The Infatuation The Private Dining Directory - Los Angeles - The Infatuation Nov 21, 2022 Thrillist 21 Essential French Restaurants You Need to Try in LA Apr 22, 2022 Secret Los Angeles Best Restaurants For An Unforgettable And Delicious Easter Brunch Apr 11, 2022 Thrillist Dine Outside at LA’s Best Outdoor Restaurants Right Now Feb 18, 2022 Show more Do you work for Perch ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Los Angeles for Your Event Los Angeles Event Spaces Los Angeles Public Spaces Los Angeles Bars / Clubs Los Angeles Stadiums Los Angeles Restaurants Los Angeles Hotels Los Angeles Museums / Galleries Los Angeles Convention Centers Los Angeles Coworking Spaces Los Angeles Raw Spaces Los Angeles Performance Spaces Los Angeles Banquet Halls Los Angeles Breweries / Distilleries Los Angeles Vineyards Los Angeles Private Group Activites Los Angeles Meeting Spaces Los Angeles Movie Theaters Los Angeles Historic Buildings Los Angeles Golf Courses Los Angeles Private Clubs Los Angeles Photo Studios Los Angeles Piers Los Angeles Private Kitchens Los Angeles Aquariums / Zoos Los Angeles Private Mansions Los Angeles Private Homes Los Angeles Event Spaces Los Angeles Public Spaces Los Angeles Bars / Clubs Los Angeles Stadiums Los Angeles Restaurants Los Angeles Hotels Los Angeles Museums / Galleries Los Angeles Convention Centers Los Angeles Coworking Spaces Los Angeles Raw Spaces Los Angeles Performance Spaces Los Angeles Banquet Halls Los Angeles Breweries / Distilleries Los Angeles Vineyards Los Angeles Private Group Activites Los Angeles Meeting Spaces Los Angeles Movie Theaters Los Angeles Historic Buildings Los Angeles Golf Courses Los Angeles Private Clubs Los Angeles Photo Studios Los Angeles Piers Los Angeles Private Kitchens Los Angeles Aquariums / Zoos Los Angeles Private Mansions Los Angeles Private Homes"
    },
    {
      "url": "https://perchpartners.com/",
      "text": "Perch Partners 0 Skip to Content Home Leadership Say Hello Open Menu Close Menu Home Leadership Say Hello Open Menu Close Menu Home Leadership Say Hello We grow companies, cultures, and leaders. A strategy-first transformation firm trusted by leadership teams, boards, and investors. We architect and execute growth — from brand to product to customer experience to reputation. We deliver impact across every variable of the brand equation. Built for today’s business reality. We embed with companies at pivotal moments to unlock their next chapter, and work side-by-side with leadership teams ready to reimagine what’s possible. Rather than offering advice from the sidelines, we partner from within — building strategy, brand, operating models, and leadership capacity alongside our clients. We engage at critical inflection points: Executive transitions AI-driven product launches Category definition and repositioning Full-funnel marketing overhauls Board and investor narrative alignment Culture and operating model transformation Our mission is to align with your aspirations. Core Services Business Strategy & Growth Architecture We architect the conditions for growth — from category definition and GTM prioritization to pricing, packaging, and monetization models. Deep strength in consumer, digital health, beauty, and tech. Brand Strategy & Identity Breakthrough positioning, iconic creative platforms, and emotionally resonant brand systems — across all stakeholder groups. Full-Funnel Marketing Strategy Modern marketing engines from awareness to long-term retention. Channel-agnostic, results-obsessed, fluent in both brand and growth. Creative & Content Studio Original, high-impact content — brand films, product launches, thought leadership, influencer campaigns — crafted to drive performance. Modern PR & Thought Leadership PR built for distributed influence. Strategic media, executive visibility, agenda-setting narratives, and event-based activations. AI-Forward Business Transformation Designing AI-optimized brand narratives, evolving product offerings for AI-native users, restructuring workflows, and deploying practical AI across marketing and ops. Interim Executive Leadership Perch operating partners step into C-level roles to drive transformative growth and mentor in-house leadership for sustained success. Org & Operating Model Design Aligning teams to strategy — goal clarity, accountability structures, talent hiring, operating rhythms — building the infrastructure for scaled performance. Industries we serve Perch works with high-growth and middle-market companies across: Consumer products Digital Health Beauty Technology Marketplace business Aerospace & mobility AI & emerging technologies Sports entertainment Contact Us"
    },
    {
      "url": "https://piafkitchen.com/the-perch-rooftop-patio/",
      "text": "Chic Rooftop Bar & Patio | The Perch at PIAF Skip to content Piaf Kitchen – Wine – Bar Chez Fabien Bistro Main Street Bakery Piaf Kitchen – Wine – Bar Chez Fabien Bistro Main Street Bakery Sister Restaurants Facebook Instagram Yelp Celebrate Mom with our special Mother's Day Brunch! Join us May 11th | 10:00 AM – 3:00 PM. Menu Dinner Happy Hour Wine List Beers Cocktails About The Perch Live Music Wine Room Events Contact Menu Dinner Happy Hour Wine List Beers Cocktails About The Perch Live Music Wine Room Events Contact Order Online Make a Reservation A Vivacious Rooftop Bar & Patio, Welcome to The Perch Our rooftop bar & patio is the ideal spot to unwind and spend time with loved ones and friends. Join us upstairs on The Perch for a posh, decadent, sexy, and surprising rooftop bar and patio experience! Enjoy delicious fare from a robust a la carte menu, one of our signature ice cream goblets, or just come for cocktails and conversation. Reserve a Table Gallery If you haven’t been here yet, you need to come like yesterday! Food, drinks, ambiance, service and everything is top notch! We had Christian and he was great! Make sure to check out the rooftop! Perfect for date night, girls dinner, first date, everything! The drinks are super cute! And do yourself a favor and get the mushroom ravioli! - Lucy W. Had a great dinner with friends. There are two areas of the restaurant. The first floor is inside seating along with a bar. Atmosphere on first floor was quiet and nicely done. Service was excellent and attentive. Mains were Mushroom Ravioli with Shrimp and Scallops and Shrimp. Everything tasted great and was cooked perfectly. - Errol O. We hosted a large event with approximately 50 people in attendance on their rooftop patio. Their service was amazing and their staff was on top of everything. Really great group to work with and an amazing atmosphere. Yasmine, Fabian, Monti, and Caleb were just a few of the wonderful people who made our event a great success. Highly recommend! - Matt K. I like the patio/terrace. Great menu selection of Mediterranean cuisine that is well done. Great wine selection from what I could see,  but try the spicy margarita, I hear it is real interesting.  Funky music before the live music at 7 pm. Never heard jazz versions of Billy Idol's \"Dancing with myself\" and \"Eyes without a face\", pretty cool. - Texas Outdoorsman We stumbled upon this restaurant by pure luck-as it didn't appear in any searches.  Ah-MAY-zing!!!  Wow!  Seriously!!!  We sat on the upstairs patio overlooking the main st at dusk...there was live music and the food was absolutely Delicious!!!  We had the Brussels Sprouts, Braised Cauliflower and Falafel.  A+++++++ - March S. Great place! The food they offer is so different from the standard offered in Texas.  The falafel was very tasty.  Flat bread with prosciutto and figs is my favorite.  Dessert… creme brûlée with rose water….  OMG… be sure to try.  All of this blend with a glass of good merlot and great saxophone music… this is my new favorite place in Grapevine. - Vanya A. Live Music Current Month No Events Reserve A Table Please note that this request form does not guarantee a reservation for the Perch. Once submitted, we will contact you to verify availability and take care of all the details needed to make your special occasion run smoothly. Reserve a Table Stay up-to-date on what’s happening at Piaf. First Name Last Name Email Sign Up Follow Us @piafgrapevine Facebook Instagram Yelp © 2022 PIAF Kitchen. All Rights Reserved. Orders & Reservations Reserve a Table Reserve a Private Room Order Online Buy a Gift Card Due to limited seatings, we reserve the right to cancel reservations after 15 minutes of a no-show. Restaurant Hours Monday: Closed Tuesday: 4pm-9pm Wednesday: 4pm-9pm Thursday: 4pm-9pm Friday: 4pm-10pm Saturday: 4pm-10pm Sunday: Closed Contact Info (817) 527-6898 129 S. Main St. Suite 130 Grapevine, TX 76051 We’re hiring Bartenders & Servers! Apply Now Creatively Designed & Developed Make A Reservation Reserve a Table Reserve a Private Room \" * \" indicates required fields Name * First Name Last Name Email * Phone What is the special occasion? * Number of Guest? * Date of Event * MM slash DD slash YYYY Time of Event * Hours : Minutes AM PM AM/PM Choose Your Menu * 3 Course Menu at $69.00++ per person 3 Course Menu at $89.00++ per person Message / Comments / Special Requests Please note that this request form does not guarantee a reservation for our private room. Once submitted, we will contact you to verify availabilty and take care of all the details needed to make your special occasion run smoothly. Δ Sister Restaurants Piaf Kitchen – Wine – Bar Chez Fabien Bistro Main Street Bakery Piaf Kitchen – Wine – Bar Chez Fabien Bistro Main Street Bakery Menu Dinner Happy Hour Wine List Beers Cocktails About The Perch Live Music Wine Room Events Contact Reserve a Table Reserve a Private Room Facebook Instagram Yelp Make A Reservation Reserve a Private Room Reserve a Table First Name Last Name Email Phone What is the special occasion? Number of Guests? Date of Event Time of Event Choose Your Menu 3 Course Menu at $69.00++ per person 3 Course Menu at $89.00++ per person Message / Comments / Special Requests Please note that this request form does not guarantee a reservation for our private room. Once submitted, we will contact you to verify availability and take care of all the details needed to make your special occasion run smoothly. Request a Private Room Savor Love at Piaf This Valentine’s Day Piaf loves you and so does our love-themed menu! From heart-shaped bites to dishes made with care, we’re serving up romance on a plate. Come taste the love! Experience the romance with choices like Lobster Ravioli, Harissa Chicken, Sumac Lemon Butter Redfish, and more. End the night on a sweet note with a heart-shaped flourless chocolate cake or our signature Date Night dessert. Make this Valentine’s Day unforgettable—we can’t wait to toast to love with you! Reservations are strongly recommended. Reserve Your Spot X"
    },
    {
      "url": "https://www.perch360.com/contact/",
      "text": "Contact Perch 360 located in Punta Gorda, Florida About Menus Photos Contact Perch 360 PERCH 360 at the Wyvern Hotel Contact Get in touch! PERCH 360 at the Wyvern Hotel 101 E. Retta Esplanade Punta Gorda, Florida 33950 941.639.7700 Notice: JavaScript is required for this content. Visit Perch 360 Contact PERCH 360 at the Wyvern Hotel 101 E. Retta Esplanade Punta Gorda, Florida 33950 Local: 941.639.7700 Connect Hours Monday – Thursday 11 am – 9 pm Friday 11 am – 10 pm Saturday 8 am – 10 pm Sunday 8 am – 9 pm Breakfast: Saturday – Sunday 8 am – 11:30 am Lunch Hours: 12 pm – 10 pm Roof Top Hours: Bar Closes at 9 pm Sunday-Thursday Bar Closes at 10 pm Friday and Saturday 88 Keys will open if there is inclement weather on the rooftop. Affiliations Site by 2K Web Group"
    },
    {
      "url": "https://www.perchla.com/perch-contact",
      "text": "Perch Contacts — Perch LA 0 Skip to Content Perch LA Delivery Menu Gallery Events Contact Reservations Open Menu Close Menu Perch LA Delivery Menu Gallery Events Contact Reservations Open Menu Close Menu Delivery Menu Gallery Events Contact Reservations Contact Our Location: 448 S. Hill Street Los Angeles CA 90013 Locate us on Google Maps Phone: 213-802-1770 Email: info@perchla.com Links: Corporate Sales View Calendar View Prix Fix Menus Press Jobs Hours of Operation: PICK UP / DELIVERY HOURS Every day 3:00 pm to 10:00 pm Friday Lunch 11:30 am to 3:00 pm Sat + Sun Brunch Reservations 10:00 am - 3:30 pm Happy Hour Mon to Thu 4:00p-6:00p Friday 3:00p-6:00p Dinner Service Monday-Wednesday Reservations 4:00pm - 1:00am Thursday-Friday Reservations 4:00pm - 2:00am Saturday Reservations 4:30pm - 2:00am Sunday Reservations 4:30pm - 1:00am Site Map: Home Reservations Our Tale Menu 16th Fl Bar Music Events Calendar Gallery Information Press Gift Cards Jobs For all other questions, please call us direct (213) 802-1770 or email us at info@perchla.com . Accessibility Statement Perch strives to ensure that its digital services are accessible to people with disabilities. Perch has invested significant resources to help ensure access for all users, including people with disabilities, with the strong belief that every person has the right to live with dignity, equality, comfort, and independence. Digital accessibility is not just a target we aim to achieve, but an ongoing commitment that we carry in every aspect of our digital service delivery. We recognize that this requires continuous monitoring, improvement, and adaptation. In the sections below, we elaborate on the various efforts that have been undertaken to address our progress in ensuring digital accessibility for all. A key element of our accessibility initiative is our engagement with a third-party accessibility consulting organization UserWay to help bring the website into conformance. We use industry standard accessibility methods and tools to accomplish this, in accordance with the relevant version of Web Content Accessibility Guidelines (WCAG) as set forth by the World Wide Web Consortium (W3C) , the internet’s main international standards-setting organization. As part of our steadfast commitment to enhancing and addressing accessibility challenges, we use developers who are experts in digital accessibility. Our approach to accessibility includes both manual accessibility auditing and automated scans. perchla.com makes available the UserWay Website Accessibility Widget that is powered by a dedicated accessibility server. The Widget offers user-triggered enhancements that allow visitors to improve the accessibility of the site. These features will, when selected, increase font size, pause animations, change color contrast, and more. People can choose combinations that suit their needs, as per WCAG Level AAA . The site has enabled Automated Remediation Technology (ART) for all visitors, whether they use assistive technology or not. ART does not detect Assistive Technology usage; rather, it improves accessibility for all site visitors regardless of ability by deploying remediation capabilities such as (not a complete list): Images and other non-text elements have alternative text associated with them when required; Keyboard navigation is improved with aids such as focus indication and skip links Please Contact Us We are here to assist you and make your experience as smooth and inclusive as possible. If you encounter any digital accessibility issues with our products or services, or need information related to digital accessibility, we want to hear from you! Also, we appreciate and welcome feedback, and we are always ready to embrace suggestions for enhancing our digital accessibility efforts. Contact Information: Perch Email: info@perchla.com We take accessibility seriously and will get back to you shortly. ROOFTOP GARDEN VIP TABLE EXPERIENCE View Details Garden VIP Table 2 to 8 Guests VIP TABLE LINK Private Table VIP Experience 2 to 20 guests PRIVATE TABLE LINK Please note that refunds are not available. Cancellations made within 24 hours will be converted to a gift card for the full prepaid amount. RESERVATIONS HOME | OUR TALE | MENU | GALLERY | EVENTS | CONTACT | PRESS INSTAGRAM | FACEBOOK | X TWITTER | EVENTS | GIFT CARDS LOCATION Pershing Square Downtown LA 448 S. Hill Street Los Angeles CA 90013 (213) 802-1770 LINKS Event Request Link View Menu View Happy Hour View Live Music and Djs View Events View Press Gift Cards Voicemail Log R-Guidelines PERCH LA HOURS Friday Lunch 11:30pm - 3:00pm Sat and Sun Brunch 10:00am - 3:30pm Happy Hour 4:00pm - 6:00pm (Mon-Fri) Dinner Service (15th Floor) Main Dining Room & Outdoor Patios Monday           4:00 pm - 1:00 am Tuesday          4:00 pm - 1:00 am Wednesday   4:00 pm - 1:00 am Thursday        4:00 pm - 1:30 am Friday               4:00 pm - 1:30 am Saturday        4:30 pm - 1:30 am Sunday           4:30 pm - 1:00 am Perch’s Sister Restaurant Mrs. Fish Located 15 Floors Below Perch! MrsFish.com The restaurant charges a 20% auto-gratuity on all food and beverage items for parties and groups of 7 or larger and prepaid VIP and Holiday special menus. The full amount of the gratuity is distributed to employees in the chain of service to the guests. *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of food borne illness. © Perch LA 2025"
    }
  ]
}