{
  "fuentes": [
    {
      "url": "https://nairngolfclub.co.uk/contact/",
      "email": "bmanager@nairngolfclub.co.uk"
    },
    {
      "url": "https://nairngolfclub.co.uk/contact/",
      "email": "teachingpro@nairngolfclub.co.uk"
    },
    {
      "url": "https://nairngolfclub.co.uk/contact/",
      "email": "bookings@nairngolfclub.co.uk"
    },
    {
      "url": "https://nairngolfclub.co.uk/contact/",
      "email": "gm@nairngolfclub.co.uk"
    },
    {
      "url": "https://nairngolfclub.co.uk/contact/",
      "email": "golfops@nairngolfclub.co.uk"
    },
    {
      "url": "https://nairngolfclub.co.uk/contact/",
      "email": "membership@nairngolfclub.co.uk"
    },
    {
      "url": "https://nairngolfclub.co.uk/contact/",
      "email": "proshop@nairngolfclub.co.uk"
    },
    {
      "url": "https://www.pgaresort.com/about/",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://www.pgaresort.com/resort-accessibility",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://www.pgaresort.com/careers",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://www.pgaresort.com/gatherings/meetings/partners",
      "email": "erin@a2.events"
    },
    {
      "url": "https://www.pgaresort.com/gatherings/meetings/partners",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://www.pgaresort.com/privacy-policy",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://www.pgaresort.com/activities/overview/banyan-buddies",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://www.pgaresort.com/about/faq",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://www.pgaresort.com/covid-safety",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://www.pgaresort.com/membership/",
      "email": "reservations@pgaresort.com"
    },
    {
      "url": "https://traveldreamsmagazine.com/pga-national-resort-announces-new-club-manager-and-director-of-agronomy/",
      "email": "membership@pgaresort.com"
    },
    {
      "url": "https://pgaresort.com/about/contact",
      "email": "reservations@pgaresort.com"
    }
  ],
  "mails": [
    "bmanager@nairngolfclub.co.uk",
    "bookings@nairngolfclub.co.uk",
    "erin@a2.events",
    "gm@nairngolfclub.co.uk",
    "golfops@nairngolfclub.co.uk",
    "membership@nairngolfclub.co.uk",
    "membership@pgaresort.com",
    "proshop@nairngolfclub.co.uk",
    "reservations@pgaresort.com",
    "teachingpro@nairngolfclub.co.uk"
  ],
  "nombre_sitio": "pgaresort.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://nairngolfclub.co.uk/contact/",
      "text": "Contact - Nairn Golf Club Skip to content Member Login Visitors Book A Tee Time The Championship Course The Cameron Course The Club The History of Nairn Golf Club News The Bothy & Icehouse Dining Open Competitions Membership Contact Contact Us Contact Us Address Nairn Golf Club Seabank Road Nairn IV12 4HB Open location on google maps Office Emma Sadler – Bookings Secretary Telephone Ext 1 +44 (0)1667 453208 Email bookings@nairngolfclub.co.uk Paul Mills – General Manager Email gm@nairngolfclub.co.uk Kiefer Brown – Golf & Membership Manager Telephone Ext 3 +44 (0)1667 453208 Email membership@nairngolfclub.co.uk Professional Shop Craig Goodwin – PGA Golf Ops Professional Telephone Ext 7 +44 (0)1667 453208 Email golfops@nairngolfclub.co.uk Michael McAllan – PGA Retail Professional Telephone Ext 2 +44 (0)1667 453208 Email proshop@nairngolfclub.co.uk Murray Urquhart – Development Professional Email TeachingPro@nairngolfclub.co.uk Food & Beverage Tracey Botting – F&B Manager Telephone Ext 4 +44 (0)1667 453208 Email F&BManager@nairngolfclub.co.uk Enquiry Form © 2025 Nairn Golf Club | developed by 18Players Visitors The Club The Cameron Course Contact The Bothy & Icehouse The Championship Course Heritage proshop@nairngolfclub.co.uk +44 (0)1667 453208 Nairn Golf Club, Seabank Road, Nairn, IV12 4HB"
    },
    {
      "url": "https://www.pgaresort.com/about/",
      "text": "About Us | Luxury Golf and Spa Resort | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS About PGA National Resort Ninety-nine holes of championship golf on six courses, including the famed Champion course — home to the popular PGA TOUR’s Cognizant Classic — as well as a state-of-the-art Sports & Racquet Club featuring 16 tennis courts and a 40,000-square-foot spa with the exclusive Waters of the World outdoor mineral pools. Following a $100 million transformation, we thoughtfully reimagined luxury, from interior and exterior designs to all-new restaurants, activities, and amenities—experience legendary moments only at PGA National Resort. PGA National Members Club Enjoy full country club privileges with luxury resort benefits in the heart of Palm Beach Gardens. As a member of PGA National, you can stay, play, and live the PGA lifestyle, 365 days a year. View Memberships Getting Here & Around We’re conveniently located just north of West Palm Beach, and within an hour of three international airports. Download Map PDF Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://www.pgaresort.com/resort-accessibility",
      "text": "ADA Resort Accessibility | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS Because Every Guest Should Feel at Home We are currently undertaking efforts to enhance the accessibility and usability of our website, using the WCAG standards and guidelines. If you are using screen-reader software and are having trouble accessing the information and/or functionality of the website, please contact us at [email protected] so that we can provide appropriate auxiliary aids and services. Our compliant-ADA resort in Palm Beach is committed to making our facilities, amenities, and services accessible to guests with disabilities. Below is a description of many of the accessible features of the hotel in its public and guest room spaces. Public Areas Accessible public entrance Accessible route from accessible public entrance to registration area Accessible route from accessible public entrance to accessible guestrooms Accessible route from hotel’s accessible public entrance to restaurant Accessible route from hotel’s accessible public entrance to the meeting room/ballroom area Accessible route from hotel’s accessible public entrance to fitness center Accessible route from hotel’s accessible public entrance to spa Accessible registration desk Accessible concierge desk Accessible public restrooms Accessible parking spaces for cars in self-parking facility Accessible parking spaces for vans in self-parking facility Accessible restaurant Accessible fitness center Accessible swimming pool Accessible guest rooms with mobility features have doorways that provide 32” of clear width Hotel’s valet parking accepts vehicles specially outfitted for wheelchair users Hotel has a TTY for guest use Guestrooms & Suites All of our accessible guestrooms and suites are equipped with an emergency visual fire/smoke alarm, along with standard accessible communication functions and features. Every ADA-Accessible Guestroom and Suite includes: Accessible guest rooms with mobility features have doorways that provide 32” of clear width Accessible toilet with grab bars Grab bars in stand-up shower or bathtub Roll-in shower Accessible closet Accessible sink that is wheelchair accessible Wider bathroom door Accessible thermostat control panel Televisions with closed captioning or closed-captioning decoders provided Visual alarms Visual doorbell or door knock indicator Phone with flashing light when ringing Outlets within 4 feet of phone Other Guestroom and Suite features: Simmons Beautyrest® Black NAPA Recharge mattresses, complete with a luxury bedding package Separate workspace/desk All guestrooms and suites are smoke-free All guestrooms and suites have a balcony or terrace The resort is pet friendly and also recognizes service dogs; non-service dog rooms require an applicable pet cleaning fee and do need to meet size restrictions Additionally, the following features are available upon request: Guest room near elevator TTY telephone Indicator light, lamp flash and/or bed shaker for the door, phone and/or alarm clock Toilet seat riser with or without arms Transfer tub seat Complimentary parking or complimentary valet parking with disability parking permit Pool lifts If you need any assistance or have any questions about accessibility features of the hotel, or if you need assistance with reserving a room, please call or email [email protected] . VIEW ACCESSIBLE ACCOMMODATIONS Key Areas Accessible routes to key areas of the resort include: Accessible self-parking for cars and vans is located in front of main entrance of resort Complimentary valet parking, including vehicles specifically outfitted for wheelchair users, with disability parking permit Main entrance and lobby are wheelchair/mobility device accessible with full valet and bell service Wheelchair/mobility device accessible registration and concierge desk located in the main lobby The registration area, accessible guestrooms, restaurants, convention facilities, fitness center and spa include accessible routes from the public entrance Standard routes to the following areas are wheelchair/mobility device accessible: Guestrooms Restaurants & Lounges The Spa at PGA National Golf Pro Shop Resort pool (lower level) Convention facilities Public restrooms Golf course staging area Golf courses Champion Driving Range Fazio Driving Range David Leadbetter Golf Academy David Pelz Golf School Outdoor exit to The Sports & Racquet Club Tennis courts Croquet courts iSTYLE Boutique Pro Shop Members Clubhouse Standard routes to all restaurants are wheelchair/mobility device accessible. Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://www.pgaresort.com/careers",
      "text": "Palm Beach Employment & Careers | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS Careers at PGA National Resort PGA National Resort has long been a place of legendary moments. Here at this Palm Beach destination, luxury is always the standard, golf is never considered just a game, and the two create an enviable lifestyle in a setting that embraces the best Florida offers. When you arrive, you will feel what draws people to PGA National: world-renowned activities and attractions combined with great food and friends, a desirable year-round climate that lends itself to a dynamic way of life, and surroundings that are as inspiring as they are warm and welcoming. Our Palm Beach Employment Opportunities Join our team of dedicated, hospitality-oriented professionals who have a lot of fun while providing exceptional customer service. We offer great perks to all professionals — including medical, dental, vision, life and short-term disability — plus, we provide a 401(k), paid time off, and more to full-time (non-seasonal) professionals. Open Positions at PGA National Open Positions at Salamander Collection Please complete and submit an employment application online. Should you require help with your resume, consider using the best resume writing services assistance. PGA National Resort is an Equal Opportunity Employer Minorities / Females / Veterans / Individuals with Disabilities / Sexual Orientation / Gender Identity Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://www.pgaresort.com/gatherings/meetings/partners",
      "text": "Preferred Meeting & Event Vendors | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS Preferred Partners Preferred Partners For all of us at PGA National Resort, your wedding, meeting, or special occasion means personal service provided by our certified Palm Beach event planners, wedding experts, award-winning culinary team, and trusted network of local vendors. A2 Events A2 Events is a boutique event production & destination management company. Since 2013, A2 events have been known for their ability to deliver incredible events that exceed clients’ expectations, achieve their outcomes & maximize budgets. The team has decades of combined experience in event logistics to luxury travel. Erin Branham, CSEP President A2 Events 561-255-5308 [email protected] View Website Encore As a global leader in event planning and A/V technology, Encore is the exclusive onsite event provider for PGA National Resort. They have the end-to-end solution — from creative to production to technology — for in-person, virtual or hybrid events, no matter the size, no matter the venue. With imagination and skill, the latest technology, and a passion for excellence, they transform events into immersive collaborative experiences that deliver real results. Nathan Roemer Director, Event Technology 561-623-4943 [email protected] View Website ETHOS | Destination + Event Management Company ETHOS is a Destination + Event Management Company that helps planners stay ahead of increasing demands while supporting the people and places that make the experiences we create possible. We call it Purposeful Planning and it’s how we ensure a return for both company and community long after your meeting or event has ended. Joe Fijol, DMCP 407-256-2540 [email protected] View Website PGA Florist | Palm Beach Gardens PGA Florist is your Local Palm Beach Gardens Florist Shop. Mr. Adrian Oprita, Owner Le Jardin Florist & Gifts 561-627-8118 [email protected] View Website Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://www.pgaresort.com/privacy-policy",
      "text": "Privacy Policy | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS Privacy Policy Last updated: February 12, 2024 Table of Contents Overview and Scope Information We Collect Use of Information Sharing of Information Your Choices Cookies and Tracking External Links and Features Children Security Changes to this Policy Contact Additional Information for EEA and UK Residents 1. Overview and Scope This Privacy Policy (“ Policy ”) applies to Salamander Hospitality, LLC, and its affiliates (“ Salamander Hospitality ”, “ we ”, “ us ”, “ our ”). In this Policy, we describe the information, including personal information, that we collect about you, and our use and disclosure of that information. This Policy applies to information that we collect about you from the following sources: Online: through our websites, mobile versions of our website, and our mobile applications (collectively, our “ Sites ”). Offline:  when you interact with us (e.g., such as by contacting our call center, posting to our social media pages, and as described below). At a Property that We Manage: We manage hotel properties as listed in the footer of our website. This Policy applies to the information that you provide to any property that we manage, such as when you make a reservation to stay at one of our properties, whether you make that reservation in person or online, and any other actions with the particular property. In this Policy, we refer to the actions that we provide as our “ Services .” Please note that depending upon your relationship with us and your interaction with a property that we manage, there may be circumstances in which the use of your personal information is subject to an additional policy (e.g., if you enter a property-specific promotion)., your information may be governed by this Policy as well as a policy pertaining to the property’s use of your information. For users in the United States: Use of our Services and any dispute over privacy is subject to this Policy and our Terms of Use, available at https://www.salamanderhotels.com/terms including its applicable terms governing limitations on damages and the resolution of disputes. We may offer promotions or co-branded offerings; in some circumstances, those data collections will be governed by an additional or different privacy policy. If you have any questions about the treatment of your personal information, please contact us at [email protected] . 2. Information We Collect We collect information, including personal information, about you from a variety of sources, including, information that we collect directly from users of our Services (for example, visitors to our Sites, guests at properties that we manage, and persons who otherwise contact us); information that we collect from other persons; and information that we collect automatically when you use our Services. Information That We Collect Directly From You : We collect identifying information, financial information, demographic information, purchase history, and other information described below. The type of information, including personal information, that we collect from you depends on your interaction with us. We collect information from you when you take the following actions: Make a Reservation/Purchase/Stay at One of Our Managed Properties :  We manage certain hotel properties (listed at the bottom of our Sites). If you make a reservation or complete a transaction at one of these properties, we will receive your contact information, payment information, including guest credit and debit card number or other payment information, information regarding your reservation, information about your intended stay, and any other information that you choose to provide to us (this may include information about hobbies, dining reservations, activities in which you participate at the property). Please note that we may retain information about you even if you cancel your reservation. Sign Up for Email Marketing From Salamander Hospitality : We collect your name and email address if you sign up to request email advertising from us. When you join our email marketing list, we may send communications to you about any of the properties that we manage. If we cease managing a specific property, please note that Salamander Hospitality – not the property – maintains the email contact list. Please note that the properties that we manage also may maintain their own email marketing lists. If you sign up with a specific property to receive email about that property, your email will be added to the specific property database as well as to our corporate database. Please see information below regarding opting out of email either from the specific property or from Salamander Hospitality. Posts to our Services or Our Social Media Pages : You may post, or grant us permission to post, photos, reviews, ideas, or other content to our Services, as indicated, and on our social media pages. Regarding social media, a platform’s privacy policy may also govern collection of personal information. Contact Customer Service : We collect information about you when you contact our customer service department, whether by phone, mail, or email. This includes your name, contact number, and scope of your inquiry. Calls to our call center may be recorded for quality assurance and training purposes; we will obtain your consent (which may be inferred) where required by law. We do not typically associate these recordings with the personal information we collect about you. Participate in Promotions, Marketing, and Surveys : We may offer promotions and other marketing materials. Additional policies may govern such promotions. We may also provide users with surveys to better understand our customers, which may request contact information as well as household information (e.g., income, age, marital status, members of household, etc.). Information We Collect About You From Other Persons : We collect information about you from other persons as follows: Guests : We may collect information about you if another guest books a reservation or makes a purchase for you or on your behalf. Persons Making Reservations on Your Behalf : This includes employers, conference group managers, travel agents and other guests (e.g., other members of your household). Our Other Properties and Affiliates : We may collect information about you from our affiliates and from the properties that we manage (e.g., if a guest books a stay in-person at a hotel, rather than online or over the phone, that property will provide their booking information to us). Your Friends : We may collect information about you if your friends purchase a gift or product for you. Social Media : If you post information on our social media pages, we collect the information that you post. We also may obtain information about you through your social media pages that you have made public if you mention us in a post. If so, the platform’s privacy policy may also govern collection of personal information. We do not typically associate your social media information with the personal information we collect about you. Non-Affiliated Providers : We may obtain information about prospective customers from a non-affiliated source, such as data analytics firms and marketing and social media providers, for purposes of reaching new customers, where permitted by applicable law. We may also purchase demographic information from non-affiliated sources. Service Providers : We collect information about you from entities who provide services or perform functions on our behalf. For example, we may collect demographic information and viewing history from data analytics providers, internet service providers, and social media platforms. Please also see below regarding information we collect automatically. Information We Collect Automatically : We automatically collect information about you when you use our Services (usage information). We collect this information from our service providers and vendors, which may include operating systems and platforms, internet service providers, data analytics providers, and social media providers. The type of information that we collect varies depending on the settings of your web browser or device, but it may include the pages you view on our Sites; the date and time you access our Sites; how long you use our Services; the type of web browser you are using (for example, Firefox or Chrome); the type of device you are using (for example, whether you are using a mobile device); and your Internet Protocol address; device ID; your location information (collected, e.g., through our analytics providers such as Google or directly through our Sites; see the section below titled Cookies and Tracking). We do not typically associate this information with the personal information that we collect about you. The foregoing information may be required to enter into a contract with you (such as to reserve a room) or provide services (such as resort services) at your request, and failure to provide any information may result in our inability to provide requested services or products. 3. Use of Information We use your information, including personal information, for the following purposes: Transactional Purposes : to provide our services to you, such as to facilitate your hotel reservation; to establish and update your account; and for other transactional purposes. Customer Service/Communications : to provide you with a personalized experience on our Sites; for technical support to answer your inquiries; to provide details about upcoming events, our properties, or other services that we think may be of interest to you. Marketing/Advertising : for marketing purposes, including to provide you with special offers, promotions, news, and newsletters; to contact you about offers we think may interest you, including promotions/events offered by the hotels that we manage; to administer contests, promotions, and other offers; and for other marketing, advertising, and promotional purposes. Our communications may include information about our management company and any property that we manage. Our marketing communications with you may include communications via postal mail, email, and social media. We, and our service providers, also use your information to determine the success of our advertising campaigns, regardless of the marketing and advertising channel. Administration : for administrative purposes, including to manage our inventory; to help us better understand how our customers access and use our Sites, including the pages viewed, ad impressions clicked, or other Site activity; to maintain security and operability of our Sites (including for debugging purposes); to provide reports to prospective partners, service providers, regulators, and others; to implement and maintain security, anti-piracy, fraud prevention, and other services designed to protect you and us; to enforce this Policy, our Terms of Service, and other policies. Research and Development/Analytics : for research and development purposes, including to improve our Services, products, and customer experience; to understand what parts of our Sites are most popular or to improve upon our Sites; to understand demographics of users who visit our Sites and stay at our properties; and for other research and analytical purposes. Legal compliance : to comply with applicable legal or regulatory obligations, including to respond to a subpoena, warrant, court order, or other legal process; to cooperate with an investigation or request, whether formal or informal, from law enforcement or other governmental authority. Protection of us and others : where we believe it is necessary to protect us and others, including, without limitation to detect, prevent, and respond to fraud, security incidents, potential threats to the safety or legal rights of any person or entity, violations of our Terms of Use, or other issues where we believe it is appropriate to protect us and others. Auditing, Reporting, and Other Internal Operations : To conduct financial, tax and accounting audits; audits and assessments of our operations, privacy, security, financial controls, risk, and compliance with legal obligations; our general business, accounting, record-keeping, and legal functions, and to maintain appropriate business records and enforce company policies and procedures. Business Transfers and Transactions . To plan and carry out acquisitions, mergers, business transactions such as an investment or financing, transfers of some or all of our assets or the assets of one of our corporate relatives to another legal entity, bankruptcy proceedings, sale of a business or a similar transfer of assets. 4. Sharing of Information We share your information with the following entities: Corporate Relatives . We may share your information with any current or future parent company, affiliate, subsidiary or division. Service Providers . We share your information with our service providers or others who perform functions on our behalf. For example, we share your information with service providers who host our Sites, coordinate mailings, analyze aggregate information about our customers, assist us in detecting and deterring fraud, security incidents, or other unlawful activity, and for other business purposes as described above in how we use your information. We also permit service providers to collect information about you online through cookies and other tracking tools; please see the Cookies and Tracking and Analytics Providers/Advertisers sections below. Hotels We Manage . We manage certain hotel properties (listed at the bottom of our website). We will provide your information to the particular property at which you are making a reservation. Please see the particular hotel’s website privacy notice for information about how that property will use your information. Carefully Selected Partners . If you choose to enter a joint promotion, then we will share your contact information (and other information that you provide to us in connection with that promotion) with the other party. The promotions may be subject to an additional or different privacy policy. Site Users . We may share your information with other users of our Sites. For example, if you post a review, pictures, or other content on our Sites, the contents of your post (including any pictures that you post) as well as other information, such as your username, may be available to all visitors to our Sites. Analytics Providers/Advertisers . As set forth above, we share information with analytics providers and advertisers to assist us in implementing and evaluating relevant advertising. Often the information that we share is collected from you through cookies and other tracking technologies on our Sites. We also may disclose certain information (such as your email address) to data analytics firms and marketing and social media providers, which may use it to target advertising to you. See the section entitled Your Choices, Opt Out of Interest-Based Advertising below. We may also share your information in the following ways: Business Transfers and Transactions . We may share your information with another entity if we or any of our current or future corporate relatives are acquired by or merged with another legal entity, in connection with a business transaction (such as an investment or financing), if we transfer some or all of our assets or the assets of one of our corporate relatives to another legal entity, as part of a bankruptcy proceeding, or as part of a sale of a business or a similar transfer of assets. In Response to Legal Process . We share your information to law enforcement, regulators, and other persons when we believe it is appropriate to comply with the law or a regulatory requirement; to comply with governmental, administrative, or judicial process or other similar requirement or order, such as a subpoena or court order; to cooperate with law enforcement or other governmental investigations (without necessarily requiring the law enforcement or government agency requesting the information to formally serve us with a subpoena); or in connection with litigation in which we are involved. We also reserve the right to report to appropriate law enforcement or governmental agencies any activities that we believe are in violation of applicable laws, rules, or regulations without providing notice. To Protect Us and Others . We share your information where we believe it is necessary to prevent or investigate a possible crime, such as fraud or identity theft; to enforce a contract; to protect the legal rights, Site, or safety of you, us, our corporate relatives, and their respective employees, clients, partners, agents, other users, or the public in general; to enforce our [ Terms of Use ] or this Policy; and to monitor and remediate security issues. Aggregate and De-Identified Information . We may disclose aggregate and de-identified information about our customers for marketing, advertising, research, or other purposes. Other Disclosures . We may disclose your information in other ways not described above when we either provide you with notice, obtain your consent, or are otherwise permitted by applicable law. 5. Your Choices You have certain choices regarding the personal information we collect about you. For example, you may: Request to Modify Content You Have Posted . You may request to modify content that you have posted to our Sites (including our social media sites) by emailing us at [email protected] and specifying the content (such as comments or reviews) that you would like modified or deleted. In some cases, we may not be able to remove your content. If this is the case, we will let you know if we are unable to do so and why. Even if we are able to anonymize or make your content or information no longer visible, there is no way to ensure complete or comprehensive removal of your content from the Internet because other persons may have archives of our web pages. We therefore cannot prevent such information from being used in a manner that may violate this Privacy Policy, the law, or your personal privacy. Opt Out of Promotional Email Communications . You may opt out of promotional emails by clicking on the unsubscribe link in the email, or by emailing us at [email protected] , and explaining the email that you would like to unsubscribe from. Please note that opting out of an email from a particular hotel will opt you out of our entire database; the reverse also is true:  if you opt-out of receiving emails from Salamander Hospitality, we also will opt you out of receiving emails from the individual properties. Opt Out of Interest-Based Advertising . We use service providers such as Google's AdSense and AdWords to help us provide advertisements to you that are tailored to you based on interests that you have expressed on our Site or elsewhere (“ Interest-Based Ads ”). Any advertisements served by Google, Inc., and affiliated companies may be controlled using cookies. These cookies allow Google to display ads based on your visits to this Site. Any tracking done by Google through cookies and other mechanisms is subject to Google's own privacy policies. You may decide to disable Google cookies by clicking on: https://myadcenter.google.com/. You can visit My Ad Center to manage the Google ads you see and opt out of Interest-Based Ads delivered by Google. You also may opt out of receiving Interest-Based Ads from many non-affiliated ad networks, such as those provided by members of the Network Advertising Initiative (“ NAI ”) and the Digital Advertising Alliance (“ DAA ”). For more information regarding Interest-Based Ads by NAI members and DAA members, including how to opt out of Interest-Based Ads provided by NAI and DAA members, please visit their respective websites: optout.networkadvertising.org and optout.aboutads.info . Please note that opting out of participating ad networks does not mean that you will not see any advertisements; you will continue to receive advertisements on other websites and from companies that do not participate in the above programs. Even if you opt out of interest-based ads, you may still see ads based on factors such as your general location derived from your IP address, your browser type and recent, previous searches related to your current search. Certain of our Sites also may use Facebook advertising, including Facebook Custom Audience. As set forth above and in the Cookies and Tracking section below, we may disclose certain information (such as your email address) to Facebook Custom Audiences (for more information on Facebook Custom Audiences click here ) so that we can better target ads and content to you and others with similar interests on non-affiliated websites or media (“ Custom Audiences ”). We may also work with other ad networks and marketing platforms that enable us and other participants to target ads to Custom Audiences submitted by us and others. You may also control how Facebook and other entities display certain ads to you, as explained further in their respective privacy policies or by using the opt-outs described in this paragraph. Please note that even if you opt out of receiving marketing communications from us, we may still send you communications about your account or any products or services you have purchased from us and we will still respond to your inquiries and requests for information. 6. Cookies and Tracking We and our service providers use cookies and other mechanisms to track information about your use of our Services. We do not typically associate this information with the personal information that we collect about you nor do we attempt to identify you as a natural person through this information. Cookies . We or our service providers may use cookies to track visitor activity on our Sites. A cookie is a text file that a website transfers to your device for record-keeping purposes. We or our service providers may use cookies to track user activities on our Services, such as the web pages you view and time you spend on our Sites. The help section on most browsers will tell you how to prevent your computer from accepting new cookies, how to have the browser notify you when you receive a new cookie, or how to disable cookies altogether. Visitors to our Sites who disable cookies may not be able to browse certain areas of the Services. Pixel Tags . Pixel tags (also known as clear GIFs or web beacons) are tiny graphics with a unique identifier, similar in functionality to cookies, which are embedded invisibly on web pages. We or our service providers may use pixel tags, in connection with our Services to perform functions like tracking the activities of visitors to our Services, helping us manage content, and compiling statistics about usage of our Services. We or our service providers may also use pixel tags in emails to help us track email response rates, identify when our emails are viewed, and track whether our emails are forwarded. Cross-Device Tracking . We and our service providers may use the information we collect from users within our Services and on other non-affiliated websites and services to help us and other entities identify other devices used (e.g., a mobile phone, tablet, other computer, etc.) to interact or engage with us or the Services. Customer Lists . Subject to applicable law, we and our service providers may disclose certain customer list information (such as name, email address and other contact information, which in most cases is hashed when it is shared) with data analytics firms and marketing and social media providers to target ads and content to a site or app user and others with similar interests. In some cases, these entities may help us to enhance our customer lists with additional demographic or other information, so we can better target our advertising and marketing campaigns. Embedded Scripts . We may use embedded scripts, which is code designed to collect information about how visitors interact with a website, such as the website which linked them to one of our Sites. Analytics . We use service providers, such as Google Analytics, to evaluate the use of our Sites. We or our service providers use automated devices and applications to evaluate use of Services. We use these tools to help us improve our services, performance, and user experiences. These entities may use cookies and other tracking technologies, such as pixel tags or local storage objects (LSOs), to perform their services. To learn more about Google’s privacy practices, please review Google’s privacy policy at https://policies.google.com/technologies/partner-sites . You can also download the Google Analytics Opt-out Browser Add-on to prevent their data from being used by Google Analytics at https://tools.google.com/dlpage/gaoptout . Do Not Track . Our Services do not respond to Do Not Track signals. You may disable certain tracking as discussed in this section (e.g., by disabling cookies). 7. External Links and Features Our Sites (and apps) contain links to other entities’ websites and applications. Any access to and use of such website and applications are not governed by this Policy. Instead, your use of these websites or applications is governed by their own privacy policies, and not this Policy. We are not responsible for the information practices of such websites or applications: please read the relevant entity’s privacy policies for more information. 8. Children Our Services are for general audiences and are not targeted to persons under the age of eighteen (18) years of age. We do not knowingly collect any personal information from persons under 18, and we will delete any personal information collected that we later know to be from such a person. If you believe someone under 18 has disclosed personal information to us, please contact us at [email protected] and specify the customer and information you believe to be from such person. 9. Security We have taken steps to help protect the information we collect from you, including personal information, from loss, misuse, unauthorized access, disclosure, alteration, and destruction. However, no data security measures can guarantee 100% security. Please note that we cannot guarantee the security of any information we have collected from you, including personal information, and your use of our Services indicates understanding and acceptance of this risk. We encourage all users to take steps to protect their accounts by, among other things, choosing a strong password that nobody else knows or can easily guess and keeping log-in and password information private. We are not responsible for any lost, stolen, or compromised passwords or for any activity on any account via unauthorized password activity. 10. Changes to this Policy This Policy will be updated from time to time. Changes will go into effect when posted. If we make any changes to this Policy that materially affect our practices regarding our use of the information that we previously collected, we will endeavor to provide users with notice, such as by posting prominent notice on our Sites. We will post any updated Policy to our Sites. 11. Contact For any questions or concerns regarding this Policy or our privacy practices, please contact us using the information provided below: Email: [email protected] Phone: 540-687-3710 12. Additional Information for EEA and UK Residents The controller of your personal information is Salamander Hospitality, LLC. 100 West Washington Street, Middleburg, VA 20118. Your Rights We would like to make sure you are fully aware of your data protection rights under the EEA and UK General Data Protection Regulations (“GDPR”) or other applicable data protection law. EEA and UK residents are entitled to the following, subject to specific conditions and limitations as set out in GDPR: The right to access : You have the right to request that we provide additional information about the processing of your personal information, and copies of your personal information. The right to rectification : You have the right to request that we correct any information you believe is inaccurate. You also have the right to request we complete the information you believe is incomplete. The right to erasure : You have the right to request that we erase your personal information, such as where you have withdrawn your consent, where you object to processing based on legitimate interests due to your particular situation and we have no overriding legitimate grounds (see below), or where your personal information is unlawfully processed. The right to restrict processing : You have the right to request that we restrict the processing of your personal information so that it is merely stored and not otherwise processed, under certain conditions such as: you contest the accuracy of the personal information (we will restrict processing until we have taken sufficient steps to correct or verify its accuracy); the processing is unlawful but you do not want us to erase the personal information; we no longer need your personal information for the purposes of the processing, but you require such personal information for the establishment, exercise or defense of legal claims; or you have objected to processing justified on legitimate interest grounds (see below), pending verification as to whether we have compelling legitimate grounds to continue processing. Where your personal information is subject to restriction, we will only process it with your consent or for the establishment, exercise, or defense of legal claims. · The right to object to processing based on legitimate interest : Where we are relying upon our legitimate interests to process personal information, you have the right to object to that processing based on grounds related to your particular situation. If you object, we must stop that processing unless we can demonstrate compelling legitimate grounds for the processing that override your interests, rights and freedoms, or we need to process the personal information for the establishment, exercise or defense of legal claims. Where we rely upon legitimate interest as a legal basis for processing, we believe that we can demonstrate such compelling legitimate grounds, but we will consider each case on an individual basis. · The right to object to processing for direct marketing purposes : You have the right to object at any time to processing of your personal information for direct marketing, including profiling related to direct marketing. The right to data portability : Where we are relying (as the legal basis for processing) upon your consent, or the fact that the processing is necessary to perform a contract to which you are party or to take steps at your request prior to entering a contract, and the personal information is processed by automated means, you have the right to request that we transfer the information that we have collected to another organization where this is technically feasible, or directly to you. Right to withdraw consent : In the event your personal information is processed on the basis of your consent, you have the right to withdraw consent at any time, without affecting the lawfulness of processing based on consent before its withdrawal. You also have the right to lodge a complaint with the supervisory authority, in particular the authority in the place of your habitual residence, place of work or place of alleged infringement, if you consider that the processing of your personal information infringes applicable law. If you would like to exercise any of these rights (other than your right to lodge a complaint, for which you can directly contact the data protection supervisory authority), please contact us at our email: [email protected] , or write to us at: 100 West Washington Street, Middleburg, VA 20118. Our UK representative is Stavros Antonis, and may be contacted at [email protected] . Our EEA representative is Stavros Antonis, and may be contacted at [email protected] . International Data Transfers By choosing to interact with us, your personal information will be transferred to us where we operate, which is the United States, a country with data protection laws that are not as protective as those of the EEA or UK. [In order to protect your information, we abide by the data importer obligations set forth in European Commission-approved Standard Contractual Clauses and their UK equivalent. You may obtain a copy of these by contacting us as indicated here .] [In certain circumstances, courts, law enforcement agencies, regulatory agencies or security authorities in those other countries may be entitled to access your personal information.] Retention of Your Information Our general approach is to only retain personal information for as long as is required to satisfy the purpose for which it was collected by us or provided by you, including for the duration of the applicable statute of limitations. For example, we retain records in order to resolve queries or disputes regarding our Services, or bring or defend claims which we think may arise from time to time during the relevant statute of limitations. In certain cases, legal or regulatory obligations require us to retain specific records for a set period of time, including following the termination of any contract with you or your employer (e.g., under applicable tax law). Legal Bases for Processing Your Personal Information All processing (i.e. use) of your personal information is justified by a condition (called “legal basis”) for processing. Processing will be justified on one of the following bases: Contract Performance: the processing is necessary to perform a contract with you or take steps to enter into a contract at your request, such as providing requested services; Compliance with Law: the processing is necessary for us to comply with a relevant EEA or UK legal obligation, such as accounting for our sales of products; Legitimate Interests: the processing is in our legitimate interests, subject to your interests and fundamental rights; or Consent: you have consented to the processing, for those situations where we may rely on your consent to justify our processing of your personal information. We use your personal information for the following purposes, relying on the following legal bases: Transactional Purposes : to provide our services to you, such as to facilitate your hotel reservation; to establish and update your account; for technical support to answer your inquiries; and for other transactional purposes. The legal basis for this processing is Contract Performance. Customer Communications : to provide you with a personalized experience on our Sites; to provide details about upcoming events, our properties, or other services that we think may be of interest to you. The legal basis for this processing is our Legitimate Interests in improving your experience on our Sites and promoting our activities, in order to increase your engagement and our sales. Marketing/Advertising : for marketing purposes, including to provide you with special offers, promotions, news, and newsletters; to contact you about offers we think may interest you, including promotions/events offered by the hotels that we manage; to administer contests, promotions, and other offers; and for other marketing, advertising, and promotional purposes. Our communications may include information about our management company and any property that we manage. Our marketing communications with you may include communications via postal mail, email, and social media. We, and our service providers, also use your information to determine the success of our advertising campaigns, regardless of the marketing and advertising channel. The legal basis for this processing is your consent, where we have obtained and rely on your consent to market to you. If we have not obtained your consent, our legal basis is our Legitimate Interests in improving your experience on our Sites and promoting our activities, in order to increase your engagement and our sales. Administration : for administrative purposes, including to manage our inventory; to help us better understand how our customers access and use our Sites, including the pages viewed, ad impressions clicked, or other Site activity; to maintain security and operability of our Sites (including for debugging purposes); to provide reports to prospective partners, service providers, regulators, and others; to implement and maintain security, anti-piracy, fraud prevention, and other services designed to protect you and us; to enforce this Policy, our Terms of Service, and other policies. The legal basis for this processing is our Legitimate Interests in operating our Sites and Services efficiently, and in protecting our reputation, sales, rights and business prospects. Research and Development/Analytics : for research and development purposes, including to improve our Services, products, and customer experience; to understand what parts of our Sites are most popular or to improve upon our Sites; to understand demographics of users who visit our Sites and stay at our properties; and for other research and analytical purposes. The legal basis for this processing is our Legitimate Interests in improving our Sites and Services in order to increase our sales. Legal compliance : to comply with applicable legal or regulatory obligations, including to respond to a subpoena, warrant, court order, or other legal process; to cooperate with an investigation or request, whether formal or informal, from law enforcement or other governmental authority. The legal basis for this processing is our Legitimate Interests in complying with our legal obligations in order to protect our reputation and avoid the costs of non-compliance. Protection of us and others : where we believe it is necessary to protect us and others, including, without limitation to detect, prevent, and respond to fraud, security incidents, potential threats to the safety or legal rights of any person or entity, violations of our Terms of Use, or other issues where we believe it is appropriate to protect us and others. The legal basis for this processing is our Legitimate Interests in protecting our reputation and business activities. Auditing and Reporting : To conduct financial, tax and accounting audits; audits and assessments of our operations, privacy, security, financial controls, risk, and compliance with legal obligations. The legal basis for this processing is our Legitimate Interests in complying with our legal obligations in order to protect our reputation and avoid the costs of non-compliance. Other Internal Operations : For general business, accounting, record-keeping, and legal functions, and to maintain appropriate business records and enforce company policies and procedures. The legal basis for this processing is our Legitimate Interests in operating our business efficiently, and in protecting our reputation, sales, rights and business prospects. Business Transfers and Transactions . To plan and carry out acquisitions, mergers, business transactions such as an investment or financing, transfers of some or all of our assets or the assets of one of our corporate relatives to another legal entity, bankruptcy proceedings, sale of a business or a similar transfer of assets. The legal basis for this processing is our Legitimate Interests in maximizing operational efficiencies and the interests of our stakeholders. Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://www.pgaresort.com/activities/overview/banyan-buddies",
      "text": "Banyan Buddies Kids Club | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS Back to Activities PGA NATIONAL RESORT Banyan Buddies Kids Club Life Is Better With A Buddy! Parents must reserve to have their children attend any of the sessions offered through the website by calling 561.627.6393 or emailing their request to [email protected] Details Banyan Buddies Kids Club - Ages 4-13 Friday - Sunday: FULL DAY: 9am - 5pm | $125 per child MORNING: 9am - 1pm | $90 per child PARTIAL DAY: 1pm - 5pm | $75 per child Friday & Saturday: KIDS NIGHT OUT: 6pm - 10pm | $95 per child ALL SESSIONS INCLUDE SNACKS, DRINKS, ARTS & CRAFTS. MORNING & FULL DAY SESSIONS INCLUDE LUNCH. All sessions are for drop off care only. Please make your reservations at least 24 hours in advance to allow for staffing needs. Club Members receive a 20% discount on all session pricing listed above. For inquiries regarding children under the age of 4 or requests for additional hours, please contact [email protected] . Location Banyan Buddies 400 Ave of the Champions, Palm Beach Gardens, FL 33418, USA General questions Does my child need to bring anything? Children are encouraged to bring bathing suit, a change of dry clothes, and sunscreen. No outside food will be allowed. What is your cancellation policy? Reservations must be cancelled 6 hours in advance of session to refund payment. What age do my kids have to be to participate? Children must be completely toilet trained, age 4 to age 13. What is your staff to child ratio? Our ratio is one staff to five children. How can I register my child? Parents must reserve to have their children attend any of the sessions offered through the website or by emailing their request to [email protected] . Please make your reservations 24 hours in advance to allow for staffing needs. Payments are made through the member card/ room number/ credit card and are subject to a 100% no-show cancellation fee. Each child must have a signed Child Information Form with a mobile phone contact available when the child is in session. Please notify if your child has any allergies or medical conditions that we need to be aware of. Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://www.pgaresort.com/about/faq",
      "text": "Where is PGA National | Resort FAQ | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS FAQs for PGA National From “Where is PGA National Resort?” to queries about guest amenities, wedding ceremonies, and catering packages, find the answers to our most frequently asked questions. Check out our photo gallery to see what your Palm Beach event could look like. General Information Is there a minimum age to check in at PGA National Resort? Yes, the minimum age to check in at the hotel is 18 years old. How can I cancel or modify an existing reservation I made online at PGA National Resort? To cancel or modify existing reservations that were originally made on our pgaresort.com website, follow these steps: Click on the “Check Rates” button at the top of our website. This will bring you directly into the booking engine. Once you’re in the booking engine, scroll to the bottom of the page, where you’ll see a grey footer bar, and on the bottom right, click “Modify/Cancel Reservation.” A popup should appear where you’ll be able to plug in your confirmation number and make necessary changes. For reservations made through our call center, please call this number: 800.863.2819 and a dedicated reservation agency will assist in modifying or canceling your reservation. For reservations made through Expedia.com , Booking.com , Priceline, Orbitz, TripAdvisor or other third party sites, you will need to contact that site directly to make adjustments or cancel your reservation. When is Check-in time? Check-in time is 4:00 PM. You may make a request for an earlier check-in; however, we cannot guarantee your accommodations will be available. To guarantee an early arrival, you may wish to make arrangements to purchase accommodations for the previous night. When is Check-out time? Check-out time is 11:00 AM. Should you require a later check-out time, please contact the Front Desk and they can advise of the corresponding fees. How can I make a reservation? To make a reservation, please contact our Reservations Department at 1.800.863.2819, check the availability of your preferred date here reservations , or take advantage of our current offers and packages . What is your cancellation policy? The cancellation policy is specific to the rate (or special offer) and how you booked. Please carefully check the cancellation policy, which can be found on your reservation confirmation. What's the weather like? Here in the Sunshine State of Florida, we enjoy a tropical climate year-round. If it starts to rain, don’t worry: It should probably end in about 20 minutes. Please visit The Weather Network website to get current information on weather in Palm Beach Gardens . Are pets allowed? At PGA National Resort, we welcome dogs and service dogs alike. If you would like to bring your four-legged friend with you, a $150 non-refundable fee will be charged. Please note: Dogs must meet size restrictions and cannot be left in your room alone. If a dog is in the room, your room attendant will not enter, so you may need to make alternate arrangements for room cleaning. What is the closest airport to PGA National Resort? The closest airport is Palm Beach International Airport; however, other nearby airports include Fort Lauderdale International Airport and Miami International Airport. For additional directions, view Getting Here . Amenities How many rooms do you have at PGA National Resort? There are 339 guestrooms and 21 cottages. Is room service available? In-room dining is available daily: Breakfast: 7:00 am – 11:30 am All Day Menu: 11:30 am – 9 pm Is it possible to rent a car at PGA National Resort? There is no car rental service available at the property; however, please talk to our Front Desk staff should you wish to rent a car and they will be happy to assist. Is there bottled water in the rooms? Yes, there are 2 complimentary bottles of water in your room. Additional water is available for purchase at The MKT. Do you offer babysitting services? We do not have babysitting services at this time. Opens in new window PDF Download Word Download Excel Download PowerPoint Download Document Download Are daily housekeeping services available? We are committed to ensuring a comfortable and clean stay for all our guests. As part of our enhanced services, housekeeping is provided daily and upon departure. Turndown Service is available upon request and is performed between 6:00 PM and 9:00 PM. Please notify the front desk by 9:00 PM if you would like turndown service. For additional housekeeping needs or questions, our Guest Services staff are available to assist. What are the parking fees? Self Parking is $24 overnight, per night, per reservation. Valet Parking is $46 per night, per reservation Opens in new window PDF Download Word Download Excel Download PowerPoint Download Document Download Do you offer a regular transportation shuttle between the Resort and the golf courses? Shuttle service is available by request only. Is there a Kid's Club on property? Yes, we offer a vibrant and interactive kids' club, filled with exciting games, creative crafts, and endless laughter, ensuring an unforgettable vacation for your little ones. Please email [email protected] to make a reservation. Do you offer a daily newspaper in rooms or in the lobby? We do not offer a daily newspaper at this time. Meeting and Venue Why should I plan my meeting at PGA National Resort? PGA Resort offers top-notch conference facilities and services in a stunning location. Our award-winning meeting facilities are located in Palm Beach Gardens, Florida, which has ideal temperatures and conditions all year round. To entertain conference and event attendees, we also offer a variety of amenities such as golf outings, spa services, and more . How large are PGA National Resort’s meeting and event spaces? How many event attendees can the resort accommodate? We have a variety of event spaces ranging in size from 180 square feet to almost 10,000 square feet. With that variety and flexibility, we can accommodate groups from 10 to almost 1,200, depending on your preferred layout and setup. For more specific information about each meeting space, please review our Capacity Chart . Does PGA National Resort offer outdoor meeting space? Yes. We offer a variety of outdoor event facilities perfect for coffee breaks, cocktail hours, evening receptions, or team-building events. Our outdoor facilities offer full setups for musical entertainment, though we do ask that music be played at reasonable levels and conclude by 10:00 PM. A service fee of $3.50 per person will be added for all outdoor events, and the resort reserves the right to relocate any event indoors should the weather warrant. Where can I see photos of meetings in Palm Beach or at PGA National Resort? Check out our photo gallery to see what your Palm Beach event could look like. What type of event planning and coordination services does PGA National Resort provide? We employ a full Conference Services Team to assist you in planning and executing your events at PGA National Resort. Our team has decades of experience in the hospitality industry and is prepared to help you every step of the way. Does PGA National Resort have a network of preferred event vendors? Yes. Our preferred partners offer services ranging from transportation to security, décor, and more. More information about our preferred Palm Beach meeting vendors can be found here . Do you offer any group specials and packages? Yes. We offer a variety of specials and packages for groups. From complimentary rounds of golf and spa treatments to sunset cruises and exciting giveaways, our packages provide you and your guests with plenty of extra perks. Our current Palm Beach meeting deals can be found on our Group Specials & Packages page . Does PGA National Resort offer on-site catering? Yes. We offer catering for events small and large. You can choose from prepared menu selections or work with our Executive Chef to create a custom menu for your event. No alcoholic beverages or food may be brought to the resort from outside sources or catering providers. When do I need to select the menu for my event? Menu selections are due to our catering team four weeks prior to the event and meal guarantees are required three business days before your event. Should attendance exceed the guarantee (plus standard overset provided by our catering team), a $10.00 per person fee will apply plus a 24% additional charge above the meal price. Do you cater to dietary restrictions? Yes. The Catering Team at PGA National Resort will provide a limited number of special dietary meals as indicated (vegetarian, vegan, gluten-free, allergy-sensitive, etc.) for all events. If additional dietary restrictions apply, please advise your Catering & Conference Service Manager before your event. Wedding What is the best time of year to have a wedding in Palm Beach? Palm Beach is a beautiful destination wedding location all year round. Whether you’d like a spring wedding in April or May, a summer soiree in July or August, or a wedding around the holiday season in November and December, PGA National Resort will give you the wedding of your dreams. If I book my PGA National wedding ceremony and reception outside, is there an indoor backup space in case of inclement weather? To alleviate any concerns about weather, all of our outdoor functions are reserved with a backup indoor facility. This is an important question for all of the locations you are exploring as possible wedding sites — a last-minute shower can really “dampen” your affair! Read more about our wedding venues and facilities to see which area is the best fit for your event. Where can I see photos of weddings in Palm Beach or at PGA National Resort? Check out our photo gallery to see what your PGA National wedding could look like. For more photos and inspiration, download our wedding brochure . Will PGA National Resort coordinate our ceremony? A wedding planner is required and will work with your PGA National Resort Wedding Specialist to assist with the ceremony rehearsal and be present for the official ceremony to organize your guests and bridal party. Will you be present for our function? Yes, along with your wedding planner, we will have a team ready to oversee all the details of your wedding day. At your reception, your Catering Specialist will introduce you to your Banquet Manager, who will serve as your contact for the evening. Can we use bird seed, rice, or rose petals at our outdoor ceremony? Only biodegradable bird seed or rose petals may be used. Are there multiple events/weddings scheduled on property for any given date? Yes, we are able to service multiple events on the resort property on any given day or evening. However, if exclusivity is what you desire, speak with us about options for exclusive use. What is the average cost of weddings at PGA National Resort in Palm Beach? We have a variety of wedding packages available to fit any budget. Our Wedding Specialists are happy to work with your budget to create your dream wedding. Please contact us here to learn more. Opens in new window PDF Download Word Download Excel Download PowerPoint Download Document Download Can I make changes to the existing PGA National wedding packages? We have assembled wedding packages that offer culinary creativity and are paired with a recommended location. However, this event is your event and we are prepared to custom design a culinary experience that is as unique and individual as you wish. May I upgrade the wedding packages by adding additional food items, upgrading the bar, or adding specialty drinks or desserts? Yes, personalizing your wedding package with a number of unique experiences is a wonderful way to be creative with your event. Please contact your Catering Specialist for additional prices, ideas, and availability. Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://www.pgaresort.com/covid-safety",
      "text": "Covid Safety | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS OUR COMMITMENT TO WELL-BEING The safety and well-being of our community, guests, members, and service professionals is always our top priority. We encourage you to read our comprehensive safety protocols below. HEALTH & SAFETY PROTOCOLS We encourage you to review the US Centers for Disease Control’s website for the latest information about COVID-19. Below are the comprehensive protocols and procedures we have put in place. COVID TESTING LOCATIONS For international travelers that require a negative COVID-19 test for travel, please view the Pinellas County COVID-19 testing site website for convenient, nearby testing locations. FACE COVERING POLICY We have made the following changes to our COVID-19 protocols: All service professionals are required to wear masks and social distance. Unvaccinated guests are encouraged to still wear masks and practice social distancing. Thank you for your mutual commitment to the health of our community. GUESTS & SERVICE PROFESSIONALS HEALTH The health and safety of our guests and service professionals is our primary objective. Surface Areas Throughout our hotels and resorts, Salamander increased its already-rigorous cleaning protocols. Surfaces are thoroughly treated with hospital-grade disinfectants and cleanings are conducted with increased frequency. Guest Contact All medical advice, including that from the CDC and WHO, states that direct, person-to-person contact is the primary way COVID-19 spreads. To help prevent the risk of transmission in this way, Salamander implemented the following protocols: Placed signage in its lobbies reminding unvaccinated guests to maintain physical distancing protocols (at least six feet) Masks and gloves are readily available for hotel guests Installed additional hand-sanitizing stations at the entrances to our hotels and resorts, near the front desk, at elevator banks, and entering fitness and meeting spaces. Physical Distancing Guests are advised to practice physical distancing by standing at least six feet away from other groups of people not traveling with them while in lines or moving around the property. All resort outlets will comply with local or state-mandated occupancy limits. Hand Sanitizer Hand sanitizer dispensers, touchless whenever possible, are placed at key guest and service professional entrances and contact areas such as driveways, reception areas, hotel lobbies, restaurant entrances, meeting and event spaces, elevator landings, pools, spa, and exercise areas. Hand sanitizer is provided in public areas and throughout the back of the house for service professionals. Public Area Signage Health and hygiene reminders are posted throughout the property, including physical distancing. Back-of-the-House Signage Signage is posted throughout the property reminding service professionals of the proper way to wear, handle and dispose of masks, use gloves (in positions deemed appropriate by medical experts), how to wash hands and sneeze, and avoid touching their faces. Service Professional & Guest Health Concerns Our service professionals are given clear instructions on how to respond swiftly and report all presumed cases of COVID-19 on property, and they will be ready to provide support to our guests. Service professionals are instructed to stay home if they do not feel well and told to contact a manager if they notice a coworker or guest with a cough, shortness of breath, or other known symptoms of COVID-19. Service professionals and guests who exhibit any of the symptoms of COVID-19 while at the property will be instructed to immediately make this information known to managers and hotel security respectively. THE GUEST EXPERIENCE Guest Arrival Appropriate signage is prominently displayed, which outlines proper mask usage, request to use hand sanitizer, and current physical distancing practices for unvaccinated guests throughout the property. Guest Arrival via Valet, Taxi, or Ride Share Guests requesting bell service will be assisted and the bell cart sanitized after each guest is assisted. SERVICE PROFESSIONAL RESPONSIBILITIES The role Salamander service professionals play is vital for an effective sanitation, health, and hygiene program. Hand Washing Proper hygiene and frequent handwashing with soap are vital in helping to combat the spread of the virus. All Salamander service professionals are instructed to wash their hands for 20 seconds or use sanitizer when a sink is not available every 60 minutes and after any of the following activities: using the restroom, sneezing, touching the face, blowing the nose, cleaning, sweeping, mopping, smoking, eating, drinking, entering, going on and returning from break, and before or after starting a shift. COVID-19 Training All service professionals have received training on COVID-19 safety and sanitation protocols with more comprehensive training for our teams with frequent guest contact, including housekeeping, food and beverage, public area departments, hotel operations, and security. Personal Protective Equipment (PPE) Appropriate PPE is worn by all service professionals and in adherence to state or local regulations and guidance. Training on how to properly use and dispose of all PPE is mandatory. CLEANING PRODUCTS AND PROTOCOLS Our hotels and resorts will use cleaning products and protocols which meet CDC/EPA guidelines and are approved for use and effective against viruses, bacteria, and other airborne and bloodborne pathogens. We have worked closely with our vendors, distribution partners, and suppliers to ensure an uninterrupted supply of these cleaning supplies and necessary PPE. Public Spaces and Communal Areas The frequency of cleaning and sanitizing is increased in all public spaces with an emphasis on frequent-contact surfaces including, but not limited to, front desk check-in counters, bell desks, door handles, public bathrooms, room keys and locks, ATMs, and stair handrails, gym equipment, dining surfaces, and seating areas. Guest Rooms Industry-leading cleaning and sanitizing protocols are used to clean guest rooms, with particular attention paid to high-touch items including television remote controls, toilet seats and handles, door and furniture handles, water faucet handles, nightstands, telephones, in-room control panels, light switches, temperature control panels, alarm clocks, luggage racks, and flooring. Laundry All bed linen and laundry are changed daily and continue to be washed at a high temperature and in accordance with CDC guidelines. Back of the House The frequency of cleaning and sanitization is increased in high-traffic, back-of-house areas with an emphasis on service professional dining rooms, service professional entrances, uniform rooms, service professional restrooms, loading docks, offices, kitchens, security scanning podiums, and training classrooms. Room Recovery Protocol In the event of a presumptive case of COVID-19, the guest’s room will be removed from service and quarantined. The guest will only be returned to service after undergoing an enhanced sanitization protocol. Air Filter and HVAC Cleaning: Air filter replacement and HVAC system cleaning will be increased, and fresh air exchange maximized. PHYSICAL DISTANCING Throughout each hotel and resort, we meet or exceed state and local health authority guidelines on proper physical distancing. Queuing Any area where guests or service professionals need to queue is clearly marked for appropriate physical distancing. This includes check-in, check-out, and casual dining. MEETING & EVENTS SERVICE PROTOCOLS Cleaning & Sanitizing Protocols Enhanced cleaning protocols with increased frequency, focusing on high traffic and frequently touched surfaces. All shared equipment and meeting amenities are to be sanitized after each use with hospital-grade sanitizing chemicals. All linen, including underlays, is to be replaced after each use. Polycom, computers, and AV equipment will be wiped down and UV sanitized after each use HVAC filters will be changed with greater frequency Registration • Customized floor plans and seating capacities will be created for each individual event • Hand sanitizer dispensers will be conveniently placed near self-service beverage stations along with tissue boxes and sanitizing wipes • Linen (when used) will be laundered following each event or linen-less tables will be used • Open-air venues will be offered for meeting breakouts and coffee breaks Food and Beverage • Banquet and catering menus have been modified to offer creative alternatives to self-service buffets, butler passed drinks and hors d’oeuvres • Buffet service will feature action stations accompanied by single service composed dishes and pre-packaged grab and go options. • Coffee and other break items to be attended and served by a server and/or have small cocktail napkins available for self-service coffee and tea • Condiments to be served in single-serve or sanitized individual containers • Queuing monitored by supervisors • All menus are single-use and disposed of following the event Physical Distancing & PPE Protocol • Staff members are required to wear masks for every event. • Signage reinforcing social distancing for non-vaccinated guests will be placed throughout the meeting areas • Staggered breaks, meals, and arrival departure times will be coordinated to avoid crossover. • Seating capacities and floor plans to be reviewed on an event-by-event basis to ensure appropriate physical distancing that follows State and Local guidelines • Enhanced conferencing technology to be made available to broadcast into adjacent meeting rooms Outside Vendors • Adherence to hotel policies and procedures will be required by all vendors, PPE, cleanliness, and sanitization requirements. Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://www.pgaresort.com/membership/",
      "text": "Golf Club Membership Rates & Fees | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS Membership at PGA National Members Club A Luxury Lifestyle. Exclusively Yours. BECOME A MEMBER Located in the center of a bustling residential neighborhood, PGA National Members Club has served as the social epicenter of the Palm Beach Gardens community for over four decades. PGA National is steeped in rich golf tradition, having hosted a litany of the world’s most prestigious golf events including the Ryder Cup, PGA Championship, Senior PGA Championship, and at present, the PGA TOUR’s famed Cognizant Classic. Today, the Members Club exemplifies the luxurious South Florida lifestyle that has attracted residents to our area for years. It offers exclusive access to world-class golf, exceptional amenities, and most importantly, a haven for members seeking community, fellowship, and unrivaled lifestyle experiences. With 99 holes of championship golf, the Members Club provides endless opportunities for both spirited competition and relaxed social play. At the heart of it all, the Members Clubhouse hosts an engaging year-round calendar of private events and experiences exclusively for Members, creating meaningful connections and an inviting club lifestyle. Visit PGA Members Club Website Memberships are available for residents and non-residents of the PGA National Resort community.  Both families and individuals are welcome. Golf Membership For those looking for the ultimate South Florida club lifestyle experience, we’re proud to offer the exclusive Golf Membership, which includes access to all PGA National golf courses, lifestyle amenities and a robust year-round calendar of events. Junior Executive (Under 40) Experience the pinnacle of South Florida’s club lifestyle with our exclusive Junior Executive Membership. Enjoy access to all PGA National golf courses, premier amenities, and a vibrant year-round social calendar. Tailored for the next generation of golf enthusiasts, our Junior Executive Membership is available for those under 40. Resort Social Membership Resort Social Members enjoy access to the fitness center, Membership Clubhouse, resort pool and amenities, croquet and all dining outlets. With sixteen Har-Tru tennis courts (eleven lit for night play), twelve pickleball courts and one pop tennis court, you can enjoy exhilarating matches day or night. Sports Membership Unleash your passion with tennis, croquet, fitness and other lifestyle activities with our Sports Membership. Sports Members enjoy access to all of PGA National’s amenities and social events including limited golf access, ideal for casual players and those just beginning their golf journey. The PGA National Lifestyle, In Their Words “ The Sports and Racquet Club delivers on its promise to meet all fitness needs for PGA members. With state-of-the-art facilities, diverse classes, and exceptional staff, it's an ideal destination for staying active and healthy. “ This was by far the best July 4th event we have ever had. From the festive decorations to the many activities for all ages, it was a wonderful celebration and incredible to see so many young families participating. We're truly grateful for the creativity and enthusiasm that has elevated our Members Club experience. “ The updated fitness center, daily classes, and relaxing amenities like the sauna and jacuzzi make every visit rewarding. The staff, trainers, and physical therapists are always available with expert guidance. “ Awesome night—so well planned. We loved everything from the food to the events. “ The 16 tennis courts and 12 pickleball courts, plus vibrant leagues and clinics, make SRC a dream for racquet sports enthusiasts. The professional coaching team creates opportunities for every skill level. “ Between the Wednesday night Mix n' Mingle, monthly specialty dinners, and memorable holiday celebrations, members are now enjoying a true club experience. We're most appreciative of everything you've brought to our community. / Note: These testimonials were collected directly from member communications and personal feedback. Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    },
    {
      "url": "https://traveldreamsmagazine.com/pga-national-resort-announces-new-club-manager-and-director-of-agronomy/",
      "text": "PGA National Resort Announces New Club Manager and Director of Agronomy - Travel Dreams Magazine Skip to content Travel Dreams Magazine A travel magazine dedicated to living the dream Home About Us Dream Destinations Dream Golf Dream Jobs Dream Specials Contact Us Home About Us Dream Destinations Dream Golf Dream Jobs Dream Specials Contact Us Home About Us Dream Destinations Dream Golf Dream Jobs Dream Specials Contact Us Home About Us Dream Destinations Dream Golf Dream Jobs Dream Specials Contact Us Search PGA National Resort Announces New Club Manager and Director of Agronomy Posted by Tim Cotroneo on April 15, 2024 (PALM BEACH GARDENS, Fla.) – PGA National Resort – South Florida’s world-class golf, pickleball, vacation, culinary, family, weddings, corporate and group events, and spa destination now showcasing the stunning results of its recent $100 million transformation – announces Cody Sherrill as the new Club Manager for its exclusive, family-friendly Members Club . Sherrill comes to PGA National Resort from Silverado Resort in Napa Valley where he was Director of Club Operations. Originally from Colorado, Sherrill fell in love with the game of golf at an early age working at Rollingstone Ranch Golf Club in Steamboat Springs when he was only 12 years old. He holds a Bachelor of Science degree in business management from the University of Denver. Sherrill launched his professional career 15 years ago with Troon, working as the company’s director of operations – a position in which he supported all Troon clubs in sales and growth initiatives. Sherrill has also worked at several of Troon’s top golf clubs including Brookwater Golf & Country Club in Queensland, Australia as well as Troon North Golf Club in Scottsdale, AZ. He also served as interim general manager at multiple new clubs transitioning into the Troon portfolio. Additionally, PGA National Resort has announced Keith Einwag as Director of Agronomy for its world-class array of championship golf courses. Einwag started with Troon in 2000 at Innisbrook in Palm Harbor, FL where he helped host 11 PGA Tour events at the 72-hole facility. He was awarded Troon’s “Superintendent of the Year” in 2002. He spent five years at the Classic Club in Palm Desert, CA followed by five years in Bluffton, SC at Belfair, a 36-hole facility which hosted the PGA Club Championship in 2019. Einwag also oversaw the complete renovation of both courses while at Belfair. He was born in Pittsburgh, but was raised in Sarasota. “We are thrilled both Cody and Keith have joined our exceptional golf team here at PGA National Resort,” says Joseph Fisher, Managing Director. “Both gentlemen will help showcase our incredible championship golf courses and wide array of resort amenities as we continue our quest to provide our members and guests the finest golf experience in the U.S.” Located in the center of the celebrated resort and thriving Palm Beach Gardens residential community, Sherrill will oversee the PGA National Resort Members Club which exemplifies the fun, active and youthful lifestyle of the coveted South Florida area. Members enjoy access to 99 holes of exceptional golf including the mighty Champion Course with its famous Bear Trap to a duo of bold and innovative new Andy Staples-designed layouts, The Match and The Staple courses. The Champion Course was the site of the PGA Tour’s Honda Classic since 2007 and is now the host venue of the Cognizant Classic in the Palm Beaches. The legendary South Florida destination is also showcasing its new Member Club clubhouse featuring stylish, sleek spaces and modern touches throughout, including a bit of mystique with a unique “speakeasy” style poker room hidden behind a bookcase. An open and airy “Activity Room” is ideal for card players and camaraderie along with multiple private meeting areas ideal for members to host celebrations and professional meetings. Splendid new dining and bar areas are additionally highlighted. The Members Club clubhouse fits seamlessly with the stunning results of PGA National Resort’s transformation touching every aspect of the property. A nostalgic vibe was brought to the 339 resort guest rooms, 21 private 1,200-square-foot Serena & Lily-designed luxury cottages and common areas, and a focus on superb dining where guests are guided by their palate throughout the day. Among the six exciting culinary concepts are three signature restaurants: The Butcher’s Club, spearheaded by celebrated Michelin Star Chef Jeremy Ford, is Palm Beach’s modern steakhouse, is a seductive and timeless shared-plate culinary destination brimming with elegant, confident swagger. Honeybelle with its fresh Mediterranean cuisine with a Southern touch helmed by multiple James Beard Award nominee Chef Lindsay Autry. Set in a vintage, beachy Palm Beach-style eatery, Honeybelle embraces its tropical surroundings. Sushi by Bou, a modern lounge-inspired culinary concept known for reimagining the omakase experience, is the latest restaurant to open at PGA National Resort. Memberships are available for families and individuals as well as residents and non-residents of the community. PGA National Members Club offers a variety of membership options including the Golf Membership, Sports Membership, Racquets Membership, Fit & Social Membership and Estate Membership tailored to individual interests. Special “ Summer Memberships ” are offered as well. For more information call 561.273.2920 or email membership@pgaresort.com . For more information about PGA National Resort: visit http://www.pgaresort.com or call 800.863.2819. Categories: Dream Golf , Florida Tags: PGA National Resort Categories Articles Budapest Dream Destinations Africa Alaska Alberta Anguilla Antigua Argentina Arizona Aruba Australia Austria Bahamas Baja Bali Banda Islands Banff Barbados Barbuda Belgium Belize Bermuda Bonaire Boston Botswana British Columbia British Virgin Islands Cabo San Lucas California Canada Canary Islands Cancun Canmore Capri Chicago Chile Colorado Columbia Connecticutt Costa Rica Cozumel Crete Croatia Curacao Delaware Denmark Dominica Dominican Republic Ecuador England Fiji finland Florida Florida Keys France Galapagos Georgia Germany Granada Grand Cayman Greece Grenada Harbour Island Hawaii Hilton Head Holland Hungary Ibiza Iceland Idaho Illinois India Indiana Indonesia Ireland Isla Mujeres Italy Ixtapa Jamaica Japan Kauai Kentuck Kenya Key West Korea Lake Como Lake Tahoe Las Vegas London Los Cabos Louisiana Mackinac Island Maine Malaysia Maldives Mallorca Manzanillo Marrakech Martinique Massachusetts Maui Mazatlan Mexico Michigan Minneapolis Minnesota Mississippi Missouri Monaco Montana Morroco Mykonos Napa Valley Nashville Nayarit Nevada Nevis New Hampshire New Mexico New York New York City New Zealand North Carolina Norway Ohio Oregon Palm Springs Panama Paris Patagonia Pennsylvania Peru Phuket Portland portugal Prague Puerto Rico Puerto Vallarta Punta Cana Punta Mita Qatar Rhode Island Rhodes Riviera Maya Riviera Nayarit Saba Saint Lucia San Jose Santorini Scotland Seattle Seychelles Shanhai Sicily Singapore South Africa South Caicos South Carolina Spain Sri Lanka St. Augustine St. Barths St. Croix St. Eustatius St. John St. Kitts St. Lucia St. Maarten St. Thomas Sweden Switzerland Syros Tenerife Tennessee Texas Thailand Toronto Tulum Turkey Turks and Caicos Tuscany US Virgin Islands USVI Utah Vancouver Venice Vermont Viet Nam Vietnam Virginia Washington Washington DC West Virginia Wisconsin Wyoming Dream Golf Alabama Anguilla Arizona Austria Bahamas Baja Barbados Bermuda Britain Cabo San Lucas California Cambodia Cancun China Colorado Costa Rica Cyprus Dominican Republic Dubai England Finland Florida France Georgia Grand Cayman Hawaii Hilton Head Iceland Idaho Illinois Indiana Ireland Italy Golf Jamaica Japan Kauai Kentucky La Paz Lake Tahoe Las Vegas Los Cabos Malaysia Maldives Maui Mauritius Mazatlan Mexico Michigan Minneapolis Minnesota Mississippi Missouri Montana Napa Valley Nayarit Nebraska Neuvo Vallarta Nevada Nevis New Hampshire New Jersey New York North Carolina Norway Nova Scotia Ohio Oklahoma Oman Oregon Palm Springs Panama Pennsylvania Portugal Puerto Rico Puerto Vallarta Qatar Rhode Island Riviera Maya Riviera Nayarit Scotland Singapore South Carolina Spain St. Augustine St. Barths Switzerland Tennessee Texas Tokyo Turkey Tuscany USVI Utah Vermont Vietnam Virginia Washington West Virginia Wisconsin Dream Jobs Anguilla Argentina Arizona Barbados California Dominica Dominican Republic England Florida France Georgia Grand Cayman Grenada Hawaii Idaho Illinois Italy Londo Los Cabos Maldives Morocco North Carolina Oklahoma Pennsylvania Peru Phuket Puerto Rico Punta Cana South Carolina Spice Island St. Barths Tahiti Texas Turks and Caicos USVI Virginia Zimbabwe Dream Specials Featured Jamaica St. Barths Sandals New Over Water Bungalows Authentic Watches Sandals Summer Savings Check out Orbitz Best Travel Deals Edwin Watts Best Golf Brands at Best Prices Virgin Atlantic Airways Book Now Sandals Resorts Sensational Summer Sale Sandals Resorts Sensational Summer Sale 5 Night Caribbean Cruises on Princess Cruises for just $374, only at CruiseDirect! EXCLUSIVE: Up to $1,000 to Spend Onboard & 10% Off Shore Excursions - Limited Inventory! Kiwi.com Kiwi.com – Book Cheap Flights! Home About Us Dream Destinations Dream Golf Dream Jobs Dream Specials Contact Us Home About Us Dream Destinations Dream Golf Dream Jobs Dream Specials Contact Us Copyright © 2024 · All Rights Reserved · Travel Dreams Magazine A travel magazine dedicated to living the dream All rights reserved"
    },
    {
      "url": "https://pgaresort.com/about/contact",
      "text": "Plan Your Next Golf Vacation | Contact Us | PGA National Resort Skip to main content We have updated our Terms of Service and Privacy Policy , which you agree to accept by continuing to use this site. Click the links to review. PGA National Resort PGA National Resort Logo Welcome Gallery Resort Map Amenities & Hours FAQ Happenings Membership Offers BOOK Menu Accommodations Overview guestrooms Suites Cottages Vacation Homes Book a Room Activities Overview Event Calendar Resort Pool Itineraries Racquet Sports Kids Club Area Attractions Golf Overview Courses The Champion The Palmer The Fazio The Estate The Match The Staple Golf Group membership Golf Packages Instruction Club fitting Now Available: Gold Golf Dining Overview The Butcher's Club Honeybelle Sushi by Boū Birdie’s Diner Join Us for Dinner Spa Overview Appointments Treatments Spa Membership Program The Spa Pools Specials and Promotions Skincare & Products Spa Specials Gatherings Meetings Overview Meeting Venues Group Offer Preferred Partners Virtual Tour Meetings RFP Catering Weddings & Special Events Overview Venues Request for Proposal Packages Photo Tour Seasonal Offer Membership Overview Members Club Website Membership Inquiry GIFT CARDS Contact Us Welcome to PGA National Resort, we are excited to share updates with you on exclusive offers, curated experience and culinary events. First Name* First Name* Last Name* Last Name* City City State Please make a selection Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Marianas Islands Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Virgin Islands Washington West Virginia Wisconsin Wyoming State Zip Code* Zip Code* Country* Country* Please make a selection Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, Democratic Republic of the Congo Cook Islands Costa Rica Cote D'Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and Mcdonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kosovo Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, the Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory, Occupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Barthelemy Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Serbia and Montenegro Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.s. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Email* Email* Phone Phone Arrival Date(if applicable) Arrival Date Preferred Method of Contact Method of Contact Choose one Phone Email Reason for Contact* Reason for Contact* Please make a selection Reservation Inquiries Guest Service Request Guest Feedback Golf & Tee Times Spa Inquiries Donation Request Sales & Events Membership Inquiry Request Copy of Receipt Comments Comments Sign up to receive our exclusive internet-only specials and offers By checking this box, you are consenting to the terms of our Privacy Policy * This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reach Us 400 Avenue of the Champions Palm Beach Gardens, FL 33418 800.863.2819 Facebook YouTube Instagram PGA National About Us Resort Accessibility Press Room Directions Contact Careers Gift Cards Privacy Terms of Use Awards Modify Reservation Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Innisbrook Tampa Bay, FL Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC"
    }
  ]
}