{
  "fuentes": [
    {
      "url": "https://www.themiamigroup.com/who-we-are",
      "email": "info@themiamigroup.com"
    },
    {
      "url": "https://www.bpublic.com/united-states/miami/food-dining/pil%C3%B3n-miami",
      "email": "admin@pilonmiami.com"
    },
    {
      "url": "https://www.bpublic.com/united-states/miami/food-dining/pil%C3%B3n-miami",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.myempireenergy.com/contact",
      "email": "sales@myempireenergy.com"
    },
    {
      "url": "https://miamihurricanes.com/staff-directory/",
      "email": "283cd2e68307483ea054556005168696@sentry.wmt.dev"
    },
    {
      "url": "https://www.puravidamiami.com/contact-us",
      "email": "orders@puravidamiami.com"
    },
    {
      "url": "https://www.headquartertoyota.com/contactus.aspx",
      "email": "flags@2x.png"
    }
  ],
  "mails": [
    "283cd2e68307483ea054556005168696@sentry.wmt.dev",
    "admin@pilonmiami.com",
    "flags@2x.png",
    "info@themiamigroup.com",
    "name@yoursite.com",
    "orders@puravidamiami.com",
    "sales@myempireenergy.com"
  ],
  "nombre_sitio": "pilonmiami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.themiamigroup.com/who-we-are",
      "text": "Who We Are | The Miami Group top of page HOME WHAT WE DO WHO WE ARE CONTACT ARTICLES BUSINESS CERTIFICATIONS More Use tab to navigate through the menu items. About The Miami Group Our Mission: To help businesses reach their next level of excellence Our History Millie Herrera, MBA, founded and leads The Miami Group & Associates, Inc, a boutique management and business consulting firm headquartered in Miami, Florida. The Miami Group was born in 2000 as a business and public affairs consulting firm. Initially, all three founders had full time jobs in the corporate, law and government sectors and ran the company on a part time basis. Within the first year, two of the founders amicably left the company to continue their professional careers, and Millie remained as sole owner and president. ​ Our Expertise The Miami Group provides strategic planning and marketing strategies consulting, business certification, IT business analysis & project management, and corporate development to achieve organizational excellence for our Clients. ​ What makes us unique is the depth and breadth of our expertise. Throughout our company's history, we have served small to medium and corporate clients in diverse industries, from banking and insurance corporations, to food importers, IT services providers, wholesale distributors, attorneys, global fruit distributors, non-profit organizations, international purchasing agents of oil and mining exploration machinery, construction trades and manufacturing, to name a few. ​ We partner with our Clients to identify their challenges and goals, create strategies for success, and put in place actionable, measurable objectives and processes to arrive at higher levels of operational excellence and profit. ​ We collaborate with other professional experts to create the best teams possible with the right expertise for each Client and project. ​ Our Commitment We are results driven and provide our Clients the best possible personalized, reliable and trusted services to exceed their expectations in all we do. HOME WHAT WE DO WHO WE ARE CONTACT ARTICLES BUSINESS CERTIFICATIONS More Use tab to navigate through the menu items. The Miami Group & Associates, Inc. 2222 Ponce de Leon Blvd Coral Gables, FL 33134 +1-305-972-4162 info@themiamigroup.com © Copyright The Miami Group & Associates, Inc. All Rights Reserved. bottom of page"
    },
    {
      "url": "https://www.bpublic.com/united-states/miami/food-dining/pil%C3%B3n-miami",
      "text": "Pilón Miami - Food & Dining - Professional (817) 754-9099 Contact Login Members - Get Listed Today Home Search Directory How It Works Latest News Home Search Directory How It Works Latest News Home United States Of America Florida Miami Food & Dining Pilón Miami Pilón Miami LIKE Food & Dining Miami, Florida, 33186 Show Phone Number Call: +1 305-414-8141 Write a Review Overview Specialties (1) Get Directions View On Larger Map Contact Information Company Name Pilón Miami Visit Website https://www.pilonmiami.com/ Online Social Profiles Phone Number Show Phone Number Call: +1 305-414-8141 Location 12750 Southwest 128th Street Suite 106 Miami , Florida , 33186 United States Company Details Hours of Operation Monday 12–10 PM Tuesday 12–10 PM Wednesday 12–10 PM Thursday 12–10 PM Friday 12 PM–3 AM Saturday 12 PM–3 AM Sunday 11 AM–10 PM Accepted Forms of Payments Visa, Mastercard, American Express, Discover, Cash About Pilón Miami Description: Pilón Miami is a restaurant that offers a Latin American fusion along with traditional pizzas like the Napoletana. Our concept marks the spirit of the cultural diversity that Miami has. We want to honor our Hispanic roots and at the same time celebrate the union of different cultures and traditions. For more information, please contact us with the details below: Contact Email: admin@pilonmiami.com × Map View Get Directions Cancel Pilón Miami Specialties Latin American Food Join Our Newsletter Click to Subscribe We make your business everyone's business! Online visibility is good. It translates into more customers, more business, and more profits. bPUBLIC provides everything you need to connect with customers in your community looking for the kinds of products and services offered by your business. Establish your online presence, launch online ad campaigns, manage your reputation, and get your business found. Get more customers: The bPUBLIC Business Directory delivers actively searching prospects! Website How It Works Get Listed Search Browse Categories Browse Locations Support Member Login Contact Us Get Listed Today! © 2025 bPUBLIC All Rights Reserved Terms of Use Privacy Policy × Member Login Register New Account Member Login * Email Address * Password Forgot Password? Click to Reset Password Don't Have an Account? Get Listed Today Create New Account Enter Email and Create Password * Enter Email * Confirm Email * Create Password * Confirm Password By creating an account, you agree to our terms & conditions Did Someone Refer You? Enter Referral ID Below The security check was not completed successfully. × Join Our Newsletter The security check was not completed successfully."
    },
    {
      "url": "https://www.myempireenergy.com/contact",
      "text": "Contact | Reach Out Today — Trusted Power Solutions 0 Skip to Content Home Services Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Service Area Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Open Menu Close Menu Home Services Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Service Area Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Open Menu Close Menu Home Folder: Services Back Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Folder: Service Area Back Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Contact Us If you’re interested in learning more about the potential savings solar can do for your home, fill out the information below and we’ll contact you! \"By providing your phone number and/or email, you consent to receive automated and non-automated marketing calls, texts, and account-related updates from Empire Energy (401)-336-6798 . Consent is not a condition of purchase. Message & data rates may apply. Reply STOP to opt out.\" Name * First Name Last Name Email * Message * Phone (###) ### #### Thank you! Or you can email us at: Sales@MyEmpireEnergy.com Contact us About us Services Reviews (401)-336-6798 Support@MyEmpireEnergy.com Address 1007 Waterman Ave. East Providence, RI 02914 Company Follow us!"
    },
    {
      "url": "https://miamihurricanes.com/staff-directory/",
      "text": "University of Miami Athletics – Official Athletics Website Open Menu Sports Men's Sports Baseball Tickets Schedule Roster icon-twitter icon-facebook icon-instagram Basketball Tickets Schedule Roster icon-twitter icon-facebook icon-instagram Cross Country Schedule Roster icon-twitter icon-facebook icon-instagram Diving Schedule Roster icon-twitter icon-facebook icon-instagram Football Tickets Schedule Roster icon-twitter icon-facebook icon-instagram Tennis Schedule Roster icon-twitter icon-facebook icon-instagram Track and Field Schedule Roster icon-twitter icon-facebook icon-instagram Women's Sports Basketball Tickets Schedule Roster icon-twitter icon-facebook icon-instagram Cross Country Schedule Roster icon-twitter icon-facebook icon-instagram Golf Schedule Roster icon-twitter icon-facebook icon-instagram Rowing Schedule Roster icon-twitter icon-facebook icon-instagram Soccer Schedule Roster icon-twitter icon-facebook icon-instagram Swimming and Diving Schedule Roster icon-twitter icon-facebook icon-instagram Tennis Schedule Roster icon-twitter icon-facebook icon-instagram Track and Field Schedule Roster icon-twitter icon-facebook icon-instagram Volleyball Schedule Roster icon-twitter icon-facebook icon-instagram Tickets Buy Now Single Game Season Group Parking Football Football Suites Men's Basketball Women's Basketball Baseball Explore Ticket Options Single Game Season Group Parking Football Men's Basketball Women's Basketball Baseball Manage My Tickets Single Game Season Group Parking Account Login How To Transfer & Download Tickets SeatGeek: Buy or Sell Tickets Student Tickets Season Tickets: ALL-IN-1 User Guide Commencement Hurricane Club Shop Trending Now SALE ITEMS! adidas Game-Used Jerseys & More Team-Issued Gear Hurricanes Team Store By Product Category Men's Women's T-Shirts Sweatshirts By Color Black Gray Green Orange White Inside the U About 100 Student-Athlete Stories Annual Report Athletic Care Athletics Communications Community Compliance Corporate Partnerships Facilities Facility Reservation Application History Internships Mission Statement Performance, Health, & Wellness Recruiting Student-Athlete Development Staff Directory Student-Athlete Handbook Title IX: UM Sexual Misconduct Policy Together 4 Her University of Miami UM Sports Hall of Fame & Museum Fan Central Fan Central 5050 Raffle Hurricanes Team Store All Sports Schedule Apple TV Behind the U Podcast Storm Sessions Podcast Email Subscription Hometown Heroes Hurricanes Magazine Mobile App Sebastian the Ibis Spirit Squad Wallpapers UHealth Fan Zone NIL Name, Image & Likeness NIL at The U Miami NIL Guidelines NCAA NIL Policy NCAA Third Party Guidance Miami Marketplace Video Our Videos All Sports Football Baseball Men's Basketball Women's Basketball YouTube Tik Tok ACC Network U100 Stories Search Search Open Search Profile Sign in Tickets Account Team Store Account Email Newsletter Contact Us Staff Directory . . . . . . . . . Name Title Executive Staff Dan Radakovich Vice President / Director of Athletics Brian Baptiste Senior Deputy Director of Athletics Jason Layton Chief Revenue Officer Rachelle Paul Deputy Director of Athletics / Senior Woman Administrator Brian Campbell Assistant Vice President / Athletics Development Shirelle Jackson Executive Associate AD / Student-Athlete Development & Strategic Initiatives Dan Raben Executive Associate AD / Strategic Athlete Services & Compliance Matthew Smale Senior Executive Associate AD / Business Strategy and Capital Projects Carter Toole Executive Associate AD, Strategic Communications/Chief of Staff Office of the Vice President / Director of Athletics Carter Toole Executive Associate AD, Strategic Communications/Chief of Staff Betty Pina Executive Assistant Academic Services David Wyman Senior Associate AD / Academic Services Jessica Lopez Associate AD / Director of Football Academics & Executive Operations Stephanie Shuey Assistant AD / Lead Learning Specialist Chrissy Steffen Assistant AD / Olympic Sports Blake Postma Assistant Director / Academic Advising - Football London Wood Assistant Director, Academic Engagement & Campus Relations Alexis Abruzzo Academic Advisor Josh Holmes Academic Advisor Michael Imeokparia Assistant Director, Mentor Coordinator Avery Gawel Learning Specialist / Tutor Coordinator Megan Whalen Learning Specialist/Tutor Coordinator Latrice Hunter Senior Administrative Assistant Athletic Care Vinny Scavo Senior Associate AD / Athletic Training Dr. Lee Kaplan Medical Director Adam Bennett Associate Athletic Trainer (Head Football Trainer) Karl Rennalls Senior Associate Athletic Trainer - Soccer/Olympic Sports Supervisor Julia Rapicavoli Director of Rehabilitation/Associate Athletic Trainer Adriana Logan Associate Athletic Trainer - Women's Basketball and Golf Mark Armour II Associate Athletic Trainer - Men's Basketball Isabella Galvan Assistant Athletic Trainer - Football/Rowing Danielle Bryant Assistant Athletic Trainer - Football Rob Cao Assistant Athletic Trainer - Men's & Women's Tennis Sebastian Flores Assistant Athletic Trainer - Rowing Emily Hahn Assistant Athletic Trainer - Football Bryan Hicks Assistant Athletic Trainer - Football Amber Kingsley Assistant Athletic Trainer - Volleyball Celyna Noland Assistant Athletic Trainer - Track & Field/Cross Country Julian  Rivera Assistant Athletic Trainer - Baseball/Physical Therapist Allison Ross Assistant Athletic Trainer - Track & Field / Cross Country Leyla Brborich Athletic Training Fellow - Men's & Women's Tennis/Cheer & Dance Micaela Martinez Athletic Training Fellow - Swim & Dive Evelyn Columbie Insurance/Billing Coordinator Vanessa Escobar Medical Assistant Peter Galasso Director of Football Rehabilitation and Return to Sport Tommy Otley Lead Physical Therapist and Sports Scientist - Basketball Dr. Michael Baraga Team Physician Dr. Jennifer Berezanskaya Team Physician Dr. Thomas Best Team Physician Dr. Lucas De Virgilio Team Physician Dr. Stephen Henry Team Physician Dr. Jennifer Horawski Team Physician Dr. Julianne Muñoz Co-Team Physician Dr. Kristopher Paultre Team Physician Dr. Michael Rizzo Team Physician Ignacio Alejandro Gaunaurd Collaborator Bianca Galassini Physical Therapy Resident Derrik Kerns Physical Therapy Resident Morgan Garris Physical Therapy Resident David Payne Physical Therapy Resident Athletic Communications Carter Toole Executive Associate AD, Strategic Communications/Chief of Staff Camron Ghorbi Associate AD / Communications (Football, Swim & Dive) Evan Roberts Associate AD / Communications (Men's Basketball, Golf, Track & Field/Cross Country) Megan Barnes Assistant Vice President / Digital & Brand Strategy Kyle Stopperan Assistant AD / Creative Services Emily Collins Director of Graphic Design James Knable Associate Director / Communications (Baseball, Secondary Football) Macy Parmer Assistant Director / Communications (Volleyball, Men's Tennis, Women's Tennis) Christy Cabrera Chirinos Senior Editor Chris Beltran Manager, Digital Strategy Hope Brown Manager, Digital Strategy Grace Schinsing Manager / Digital Strategy Joe Williams Manager / Creative Video & Content John Cobb Video/Content Production Specialist Sam Prusynski Video/Content Production Specialist Business Office Matthew Smale Senior Executive Associate AD / Business Strategy and Capital Projects John Cantalupo Associate Athletic Director, Business Operations Bryanna Acero Director, Travel Operations Lindsey Bonner Associate Director, Business Operations Jason Franko Associate Director, Business Operations and Legal Affairs Ali Golden Assistant Director / Business Operations Jeff Molino Assistant Director, Business Operations Laura Edwards Analyst, Business Operations & Accounting Rob Mendez Anthony Travel Hunter Eriksson Anthony Travel Compliance Dan Raben Executive Associate AD / Strategic Athlete Services & Compliance Sarah McFall Associate AD / Compliance Nicholas Muniz Director / Compliance Samuel Raycraft Associate Director, Compliance/Monitoring Consumer Marketing Taylor Lynn Director / Revenue Generation, Marketing & Analytics Alecia Behrens Manager / Consumer Marketing Daniel Contreras Manager / Consumer Marketing Cameron McKhann Manager / Data & Analytics Development Brian Campbell Assistant Vice President / Athletics Development Amy C. Ferguson Senior Associate AD / Principal Giving Rick Remmert Senior Associate AD / Alumni Programs Danny Plasencia Associate AD / Development Nicole Tugg Associate AD / Development Jessica Green Director / Alumni Programs & Executive Director, M Club Adam Jensen Director / Development Daniel Romanach Director / Development Demi Rafuls Associate Director / Development Initiatives Crystal Demps Senior Administrative Assistant Equipment Bryan Gossett Director of Football Equipment Operations Arielle Scavo Assistant AD, Equipment Operations (Head Olympic) Samuel Rosenzweig Associate Director, Equipment Operations Dakota Jordan Assistant Director, Equipment Operations (Football) Ryan Corman Assistant Director, Equipment Operations Jamison Walker Assistant Director, Equipment Operations Facilities, Events & Operations Tom Ponietowicz Associate AD / Facilities, Events & Operations Anthony Conrath Associate AD / Facilities & Operations Lesli Alvarado-Diosdado Director / Facilities, Events & Operations Brandon Thomas Associate Director / Facilities & Operations Nehemiah Peete Assistant Director / Facilities, Events & Operations Anna Shafer Assistant Director / Facilities, Events & Operations Chris Vann Assistant Director / Facilities, Events & Operations Alicia Simpson Receptionist Human Resources Nate Taylor Senior Manager / Human Resources Hurricane Club & Premium Sales Kayla Blake Grimes Assistant Vice President, Hurricane Club & Premium Sales Cameron  Osburn Director of Golden Canes Alexandra Stein Director of Premium Service Taylor Kelly Director, Membership Service Shane Moreland Premium Account Executive Caymen Bishop Premium Account Executive Daniella Bernasconi Premium Account Executive Haley Cioni Manager of Membership Service Justin Feist Manager of Membership Service Hurricanes Global Partnerships Chris Maragno Senior Vice President / Global Partnerships Alex  Elorriaga Vice President / Global Partnerships Andrew Papaefthemiou Senior Director, Partnership Sales Kirk Massey Director / Creative Services Humberto Miranda Director / Corporate Partnerships Eddie Alexander Sr. Manager / Corporate Partnerships Kailey MacBain Manager / Partnership Marketing Quinton Standifer Manager / Partnership Marketing Brooke Schwartz Manager, Partnership Strategy Noah Cowen Creative Specialist Information Technology Ray Lopez Assistant AD / Information Technology Josh Collins Systems Administrator Pablo Moreira Senior Desktop Support Specialist Marketing & Event Experience Rob Roselli Associate AD, Marketing and In-Game Experience Marlon Clarke Director / Marketing & Event Experience Megan Siebersma Manager / In-Stadium Production Cecilia Esteban Spirit Coordinator & Cheerleading Head Coach Taylor Norton Assistant Director / Marketing & Event Experience Daniel Toll Assistant Director, Marketing & Production Services Ticket Sales Kyle Brant Assistant Vice President, Ticket Sales Zachery McCready Senior Sales Executive Amanda Lawrence Senior Sales Executive Zyan Thomas Senior Sales Executive Performance, Health & Wellness Luis Feigenbaum Senior Associate AD / Performance, Health and Wellness Dr. Eric Goldstein Sports Psychologist Camila Betancourt Assistant Director / Mental Health Khara Vassell Sports Psychology / Mental Health Fellow Maryellen Carrigan Director of Olympic Sports Nutrition Spencer Simons Assistant Olympic Sports Dietitian Production Services Drew Thomas Associate AD / Production Services Brad Canfield Director / Production Services Daniel Moreno Director / Production Services Samuel Hitchcock Associate Director / Production Services Jonathan Solano Video Producer Sports Science Eric Renaghan Executive Director / Human Performance Fabian Moncayo Director / Sports Science Ian Keith Assistant Sports Scientist (Olympic Sports) Kyle Bellamy Sports Science/Football Nutrition Strength & Conditioning Caitlin Smith Head Olympic Strength & Conditioning Coach - Track & Field, Cross Country Ervin Young Associate Strength & Conditioning Coach - Football Brianne Brown Director of Sports Performance - Women's Basketball Colin Corcoran Assistant Strength & Conditioning Coach - Volleyball, Golf, Dive Victor Ishmael Assistant Strength & Conditioning Coach - Football Rodney Prince Defensive Analyst Elijah Perales Assistant Strength & Conditioning Coach Zack Zillner Director of Sports Performance - Men's Basketball Nick Tulloch Assistant Strength & Conditioning Coach - Football Houston Owens Assistant Strength & Conditioning Coach - Football Nick Soto Assistant Strength & Conditioning Coach - Baseball Jacari Riggins Olympic Coaching Assistant - Cheer, Dance, Rowing, Swim Student-Athlete Development Jessica Hurley Associate Director / Student-Athlete Development Shirelle Jackson Executive Associate AD / Student-Athlete Development & Strategic Initiatives LaToya Farris Associate AD / Student-Athlete Development, Belonging & Inclusion Ticket Operations Nate Miller Assistant Vice President / Ticket Operations & Revenue Generation David Atkins Director / Ticket Operations & Revenue Generation Jackie Lopez Manager / Ticket Operations UM Sports Hall of Fame John Routh Executive Director, UM Sports Hall of Fame Baseball J.D. Arteaga Head Coach Laz Gutierrez Assistant Coach / Pitching / Mental Skills Chris Dominguez Assistant Coach Jonathan Anderson Assistant Coach / Recruiting Coordinator Jarrod Saltalamacchia Director of Program Development Brandon Brewer Director of Player Development Robert \"G.M.\" McDaniel Director of Baseball Operations Nick Soto Assistant Strength & Conditioning Coach - Baseball Julian  Rivera Assistant Athletic Trainer - Baseball/Physical Therapist Jack Olszewski Director of Baseball Analytics Eddie Mestre Baseball Analytics Liliana  Macias Administrative Assistant Men's Basketball Jai Lucas Head Coach Erik Pastrana Associate Coach Charlton Young Associate Coach Andrew Moran Assistant Coach / Director of Player Development Russell Springmann Assistant Coach Jeff Dyer Director of Basketball Operations Zack Zillner Director of Sports Performance - Men's Basketball LJ Rose Director of Player Personnel Riley Welch Special Assistant to the Head Coach Luke Testani Video Coordinator Dame Wall Assistant Director, Player Development Mark Armour II Associate Athletic Trainer - Men's Basketball Camryn Brown Assistant Director of Basketball Administration Aydin Melamed Graduate Assistant CJ Fredrick Graduate Assistant Joe Allen Graduate Assistant Bill Courtney Jr. Graduate Assistant Sebrina Beyer Chief of Staff Women's Basketball Tricia Cullop Head Coach Fitzroy Anthony Associate Head Coach Jessie Ivey Associate Head Coach Danielle Page Assistant Coach Murriel Page Assistant Coach Lonnette Hall Director of Basketball and Recruiting Operations Brianne Brown Director of Sports Performance - Women's Basketball Adriana Logan Associate Athletic Trainer - Women's Basketball and Golf Football Mario Cristobal Head Coach Shannon Dawson Offensive Coordinator / Quarterbacks Coach Corey Hetherman Defensive Coordinator / Linebackers Coach Alex Mirabal Assistant Head Coach / Offensive Line Coach Kevin Beard Wide Receivers Coach Zac Etheridge Defensive Pass Game Coordinator / Defensive Backs Coach Will Harris Safeties Coach Damione Lewis Defensive Tackles Coach Matt Merritt Running Backs Coach Jason Taylor Defensive Line Coach Cody Woodiel Tight Ends Coach Danny Kalter Special Teams Coordinator Mike Cassano Senior Analyst / Offense Max Drisko Senior Analyst / Offense Landon Hoefer Senior Analyst / Offense Brett Holinka Senior Analyst / Defense Juan Navarro Jr. Senior Analyst / Defense Todd Stroud Senior Analyst / Defense Jack Clark Analyst / Offense Nate Crutchfield Senior Offensive Analyst Danny Hajjar Analyst / Offense Cody Orgeron Analyst / Offense Donovan Varner Analyst / Offense Will Vlachos Analyst / Offense Jordan Huxtable Analyst / Defense Terry Jefferson Analyst / Defense Parker Orgeron Analyst / Defense Ferras Isa Analyst / Special Teams Clay James Analyst / Special Teams Victor Ishmael Assistant Strength & Conditioning Coach - Football Rodney Prince Defensive Analyst Houston Owens Assistant Strength & Conditioning Coach (Football) Dennis Smith Executive Director / Football Stephen Field Executive Director / Football Recruiting Brandon LeBlanc Director / Football Operations Jorge Baez Director / Player Development Roland Smith Director / High School Relations Steven Schrum Director / Player Personnel (Defense) Adam Bennett Associate Athletic Trainer (Head Football Trainer) Bryan Hicks Assistant Athletic Trainer - Football Eric Renaghan Executive Director / Human Performance Katie Kassel Director / Football Nutrition Fabian Moncayo Director / Sports Science Mackenzie Rizzi Senior Director / Football Recruiting Administration Tia Joseph Senior Director / Recruiting Operations Adam Curry Assistant Director / Football Operations Justin Fitzpatrick Football Creative Director Bailey Marasch Senior Graphic Designer Eli Heatley Associate Director / Creative Services, Head of Photography Kyle Carter Assistant Director, Football Creative Video MIkayla Oliveira Assistant Director / Graphic Design & Photography Zach Schabbel Director / Football Video Alejandro Benites Assistant Director / Football Video Maxx Rodriguez Assistant Director of Football Video Golf Janice Olivencia Head Coach Jim Garren Assistant Coach Colin Corcoran Assistant Strength & Conditioning Coach - Volleyball, Golf, Dive Rowing James Mulcahy Head Coach Nicholas D'Imperio Assistant Coach / International Recruiting Coordinator Michelle Etchebaster Assistant Coach / Novice and Walk-On Coordinator Victoria McGee Assistant Coach / Recruiting Coordinator Paul Mokha Assistant Coach / Director of Equipment Maydelissa Pinell Assistant Coach / Director of Operations Jacari Riggins Olympic Coaching Assistant - Cheer, Dance, Rowing, Swim Néstor Noguera Graduate Student Intern Soccer Juan Cediel Assistant Coach Ken Masuhr Head Coach Kelly Keelan Associate Head Coach Peter-John Falloon Assistant Coach Hannah Bernick Director of Operations Karl Rennalls Senior Associate Athletic Trainer - Soccer/Olympic Sports Supervisor Swimming & Diving Andy Kershaw Head Swimming Coach Dario di Fazio Head Diving Coach Zach Hinsley Associate Head Swimming Coach Rio Ramirez Assistant Diving Coach Liberty Williams Assistant Swimming Coach Colin Corcoran Assistant Strength & Conditioning Coach - Volleyball, Golf, Dive Liberty Williams Assistant Swimming Coach Jacari Riggins Olympic Coaching Assistant - Cheer, Dance, Rowing, Swim Men's Tennis Paige Yaroshuk-Tews Director of Men's and Women's Tennis/Head Women's Tennis Coach Alex Santos Head Coach Paige Yaroshuk-Tews Associate Head Coach Filip Vittek Assistant Coach Macy Parmer Assistant Director / Communications (Volleyball, Men's Tennis, Women's Tennis) Rob Cao Assistant Athletic Trainer - Men's & Women's Tennis Elijah Perales Assistant Strength & Conditioning Coach Leyla Brborich Athletic Training Fellow - Men's & Women's Tennis/Cheer & Dance Women's Tennis Paige Yaroshuk-Tews Director of Men's and Women's Tennis/Head Women's Tennis Coach Alex Santos Associate Head Coach Alexa Noel Assistant Coach Diana Khodan Director of Operations Elijah Perales Assistant Strength & Conditioning Coach Rob Cao Assistant Athletic Trainer - Men's & Women's Tennis Leyla Brborich Athletic Training Fellow - Men's & Women's Tennis/Cheer & Dance Macy Parmer Assistant Director / Communications (Volleyball, Men's Tennis, Women's Tennis) Track & Field/Cross Country Amy Deem Director of Track & Field / Cross Country Cory Young Associate Head Coach (Throws) Jason Martin Assistant Coach (Sprints & Horizontal Jumps) Alex Bloom Assistant Coach (Vertical Jumps & Combined Events) Jeremy Wilk Assistant Coach (Distance) Jarius Cooper Assistant Coach (Sprints & Hurdles) Damon Griffiths Assistant Coach (Recruiting and Operations Coordinator) Caitlin Smith Head Olympic Strength & Conditioning Coach - Track & Field, Cross Country Milton Ingraham Administrative Assistant Volleyball Jose \"Keno\" Gandara Head Coach Leandro Vissotto Associate Head Coach Taylor van der Biezen Assistant Coach/Recruiting Coordinator Natalia \"Gaby\" Huaroto-Luque Director of Operations Eric Johnson Assistant Coach Amber Kingsley Assistant Athletic Trainer - Volleyball Alexis Abruzzo Academic Advisor Colin Corcoran Assistant Strength & Conditioning Coach - Volleyball, Golf, Dive Macy Parmer Assistant Director / Communications (Volleyball, Men's Tennis, Women's Tennis) © University of Miami 2025. All rights reserved ACC Network FAQs / Employment / Internships / Media Requests / Mission Statement / Privacy Policy / Terms of Service / Sponsorship Opportunities / Download Our App Powered by Skip To Main Content"
    },
    {
      "url": "https://www.puravidamiami.com/contact-us",
      "text": "CONTACT US | Get in Touch Today — PURA VIDA MIAMI 0 Skip to Content MENUS LOCATIONS REWARDS CATERING CAREERS OUR MISSION SHOP ORDER ONLINE Open Menu Close Menu ORDER ONLINE MENUS LOCATIONS REWARDS CATERING CAREERS OUR MISSION SHOP Open Menu Close Menu MENUS LOCATIONS REWARDS CATERING CAREERS OUR MISSION SHOP ORDER ONLINE contact us For any questions OR feedback, please reach out to orders@puravidamiami.com Join our newsletter Sign up for exclusive promos, new menu drops, store openings & more Email Address SIGN UP We respect your privacy Thank you! xo ABOUT US LOCATIONS & HOURS REWARDs  program NUTRITION PRESS SUPPORT Contact FAQ GIFT CARDS LEGAL POLICIES PURA VIDA MIAMI 2025"
    },
    {
      "url": "https://www.headquartertoyota.com/contactus.aspx",
      "text": "Contact Us | Headquarter Toyota | Hialeah FL | Near Miami Headquarter Toyota Español Sales 305-407-2832 Service 305-712-6905 Parts 305-712-6900 Body Shop 305-407-2832 5895 NW 167th St. Hialeah, FL 33015 Saved Service Map Contact Saved Español Headquarter Toyota Saved Sales Service Parts Map New Search Inventory New Specials Safety Sense Pre-Order Schedule Test Drive Car Exchange Program Vehicle Comparison Used Search Inventory Certified Pre-Owned Vehicles Toyota Certified Program Overview Vehicles Under 25k Instant Cash Offer Research Research 2024 Toyota Tacoma 2025 Toyota Tundra 2024 Toyota Camry 2025 Toyota Grand Highlander 2025 Toyota RAV4 2025 Toyota Corolla Specials New Specials Used Vehicle Specials Manufacturer Incentives Service & Parts Coupons Toyota Military Rebate Toyota College Rebate Careers Buy Online Buy Online How It Works Finance You Work, You Drive Get Pre-Approved Finance Center Financing at Headquarter Toyota Value Your Trade Protect your Vehicle Service & Parts Service & Parts Schedule Service Service & Parts Coupons Service and Parts Financing Order Parts Body Shop Shop for Tires Why Service at Headquarter Toyota About Us About Us Contact Us Hours & Directions Client Testimonials Careers Toyota VIP Lounge Apprentice Program Virtual Tour Why Buy From Us JD Power Award Winner Awards Accessibility for All Careers Toyota Rent a Car Research Research 2025 Toyota Corolla 2025 Toyota Grand Highlander 2025 Toyota Tundra Home New Search Inventory New Specials Safety Sense Pre-Order Schedule Test Drive Car Exchange Program Vehicle Comparison Used Search Inventory Certified Pre-Owned Vehicles Toyota Certified Program Overview Vehicles Under 25k Instant Cash Offer Research Research 2024 Toyota Tacoma 2025 Toyota Tundra 2024 Toyota Camry 2025 Toyota Grand Highlander 2025 Toyota RAV4 2025 Toyota Corolla Specials New Specials Used Vehicle Specials Manufacturer Incentives Service & Parts Coupons Toyota Military Rebate Toyota College Rebate Careers Buy Online Buy Online How It Works Finance You Work, You Drive Get Pre-Approved Finance Center Financing at Headquarter Toyota Value Your Trade Protect your Vehicle Service & Parts Service & Parts Schedule Service Service & Parts Coupons Service and Parts Financing Order Parts Body Shop Shop for Tires Why Service at Headquarter Toyota About Us About Us Contact Us Hours & Directions Client Testimonials Careers Toyota VIP Lounge Apprentice Program Virtual Tour Why Buy From Us JD Power Award Winner Awards Accessibility for All Careers Toyota Rent a Car Research Research 2025 Toyota Corolla 2025 Toyota Grand Highlander 2025 Toyota Tundra Contact Us Fill out the form below and we'll contact you shortly. * Contact Name: *First Name *Last Name *E-Mail Address *Phone Comments: I agree to receive communications by text message from Headquarter Toyota about my inquiry. You may opt-out by replying STOP or reply HELP for more information. Message frequency varies. Message and data rates may apply. You may review our Privacy Policy to understand how your data is used. Let's Talk *Required Fields Phone Sales: 305-407-2832 Service: 305-712-6905 Parts: 305-712-6900 Body Shop: 305-423-4523 Address Headquarter Toyota 5895 NW 167th St. Hialeah, FL 33015 Hours and Directions Total Suggested Retail Price (SRP) The SRP reflects suggested retail pricing and includes factory-installed options, distributor-installed features, and predelivery service charges or handling charges. SRP is subject to change at any time without notice. Taxes, title, license, dealer-installed accessories, and service fees are not included. The final sale price will vary based on these factors. New Car Disclaimer Fees All advertised prices from Headquarter Toyota exclude tax, title, license, registration, and the following fees: $1,094 predelivery service charge, $54.75 electronic registration filing fee, and a Third party $13 private tag agency fee. Prices also do not include any optional accessories selected by the customer. Used Car Disclaimer Fees All advertised prices from Headquarter Toyota exclude tax, title, license, registration, and the following fees: $1,094 predelivery service charge, $54.75 electronic registration filing fee, and a Third party $13 private tag agency fee. Prices also do not include any optional accessories selected by the customer. Dealer-Installed Options Dealer-installed accessories refer to items added to the vehicle by Headquarter Toyota prior to sale. These may differ from additional optional items chosen by the customer after purchase. Dealer-installed options are not included in the advertised price unless otherwise stated. Advertised Pricing Vehicle images and accessories may vary by model. Pricing is subject to change without notice due to possible errors or omissions. Some new vehicle pricing may reflect manufacturer incentives that are time-sensitive and may require buyer qualification or financing through the manufacturer’s preferred lender. College Graduate and Military rebates are not included in the advertised price. Information regarding manufacturer incentives and vehicle features is provided by third-party sources and is accurate to the best of our knowledge at the time of publication. Please reach out to Headquarter Toyota via phone or email for complete incentive eligibility and vehicle availability. Prices do not include: Sales tax or other applicable taxes Title, registration, or license fees Government fees Tag agency/electronic registration filing fees $1,094 predelivery service charge All MPG estimates are based on EPA ratings and are for comparison purposes only. Actual mileage may vary depending on driving habits, conditions, and vehicle maintenance (especially on hybrid models). Selling Price The final selling price may vary based on vehicle color, installed accessories, and available manufacturer incentives at the time of sale. Prices can change without notice due to updates or corrections. College Graduate and Military rebates are not reflected in the listed pricing. Incentive and vehicle information is provided by third parties and is considered accurate as of publication. Please confirm availability and qualifications with Headquarter Toyota directly. All displayed information is compiled from sources believed to be reliable. However, no guarantee is made regarding completeness or accuracy. MPG ratings are estimates only, and real-world performance will vary. Copyrighted content provided by third parties may not be reproduced or redistributed without written permission. × Disclaimer New 2025 Toyota Corolla LE, Model: 1852. VIN: 5YFB4MDEXSP255435 (excludes Hybrid and Hatch). Price excludes tax, title, tags, registration, dealer documentation fee of $899, $199 electronic fees, $54.75 electronic registration, and $13 private tag agency fee (these charges represent costs and profit to the dealer for items such as inspecting, cleaning, and adjusting vehicles, and preparing documents related to the sale or lease), $695 acquisition fee and inception charges, and not including dealer added options if applicable. For well-qualified lessees with approved credit thru Southeast Toyota Finance. Not all lessees will qualify for this payment amount. Closed-end lease on New 2025 Toyota Corolla LE. Adding options increases payment. $89 per month for 36 months. $7,500 cash due at signing plus first month payment. No security deposit required. Monthly payments do not include applicable taxes. Lessee pays the remainder of maintenance after Toyota Care expires. Excess wear and use and $0.18 per mile over 12,000 miles per year. Disposition fee of $350 due at lease end. May not be combined with any other offers. Available on new in-stock Toyota vehicles only. Maximum contract is 36 months. Offer expires 1/31/2025. Close × Disclaimer *No down payment required. If you do not qualify for the offer, the amount and percentage of any down payment vary based on your credit qualification. **Payments may be deferred for the first 90 days through SETF with approved credit. Interest accrues from inceptions/contract date. **0% APR for 60 monthly payments of $16.67 for every $1,000 ­financed, and no down payment required if qualified for advertised offer. If you do not qualify for the offer, the amount and percentage of any down payment vary based on your credit qualification. APR offer example new 2024 Toyota BZ4X 2WD Limited with a TSRP of $43,0701. Must take delivery from dealer in stock inventory. Images for display purposes only. Offers may not be combined with certain other offers see dealer for details. Price excludes tax, title, tags, registration, dealer documentation fee of $899, $199 electronic fees, $54.75 electronic registration, and $13 private tag agency fee (these charges represent costs and profit to the dealer for items such as inspecting, cleaning, and adjusting vehicles, and preparing documents related to the sale or lease), acquisition fee and inception charges, and not including dealer added options if applicable. Must take delivery by 2/3/2025. Close Copyright © 2025 by DealerOn | Sitemap | Privacy | Safety Recalls & Service Campaigns | Hours | Headquarter Toyota | 5895 NW 167th St., Hialeah, FL 33015 | Sales: 305-407-2832 Cookie Consent: By continuing to use this site you agree to our use of cookies. Accept Learn More"
    }
  ]
}