{
  "fuentes": [
    {
      "url": "https://www.pilotrestaurant.com/",
      "email": "we@pilotrestaurant.com"
    }
  ],
  "mails": [
    "we@pilotrestaurant.com"
  ],
  "nombre_sitio": "pilothousemarina.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pilotrestaurant.com/",
      "text": "Pilot Restaurant | Discover Culinary Delight 0 Pilot is a restaurant that is truly us. It is inspired by our experiences, the people we have met and worked with and nostalgic dishes from times past. Most of all it is about our love for food, fun and great hospitality. Hosting a 24 seat dining room and small outdoor area we are located at the back of the local shops in Ainslie, Canberra. We are open Wednesday - Sunday evenings and Saturday and Sunday Lunch. We offer a range of tasting menus with seasonal additions, and you have the option to pair beverages or we welcome you to a selection of drinks from our all Australian beverage list. On Sundays we also offer a selection à la carte snacks for walk ins. This is suited those who just want to catchup, have a light meal, or want to give Pilot a taste test. The full drinks list including by the glass, bottles, cocktails and non alcoholic drinks are available too. If you would like to come for a drink and a snack on a Sunday with a larger group send us and email and we can see if we have space available for you. Thursday nights we also offer BYO with all the proceeds going to our chosen organisation for the month. If you are looking for somewhere to stay our friends have a cute apartment near by. During spring / summer you can grab a drink at that other place before or after your reservation. What to Expect Make a Reservation Newsletter and Events Further Information Groups and Functions WHAT TO EAT We offer a range of tasting menus to suit any time or occasion. Most dietary requests can be catered for, just leave a note in the last page of the booking process. You will notice that we do not offer a sample menu, this is so guests can experience a enjoyable loss of control. However if this is something that sounds completely terrifying send us through an email and we will happily share it with you. For private events we are happy to work on a bespoke menu for an added cost. Lunch Menu $120pp 1 snack / 2 courses / 1 dessert (Available for all lunch services, 1.5 -2hrs) Pilot Menu $160pp 4 snacks / 3 courses / 2 desserts / A little something to take home (Available everyday and time, 2hrs) Extended Menu $205pp 6 snacks / 4 courses / 2 desserts / A little something to take home (Available Wednesday, Thursday, Sunday anytime and Friday and Saturday from 8pm, 2.5hrs) Unfortunately we are unable to cater to any dietary requirements on the extended menu. WHAT TO DRINK This is a curated selection of beverages to company the tasting menu. Thoughtful and interesting we suggest you give these a try, however we have a full wine and beverage list available too. Pricing of pairings is dependant on what menu you are booked in for and is shown below. Oh and everything is Australian grown and made. In House A seasonal matching of house made teas, tinctures, tonics and sodas. $60 Lunch Pairing, $75 Pilot Pairing, $90 Extended Pairing Home Grown An adventurous representation of the exciting world of Australian wine, apera, beer and other beverages. Nothing boring here. $100 Lunch Pairing, $130 Pilot Pairing, $150 Extended Pairing The Best Of Both A selection of the best of the in house and home grown pairings for those that wish for a lower abv, are driving or simply just want to try it all. Lunch Pairing $90, Pilot Pairing $105, Extended Pairing $125 Gift Vouchers Stay Close Looking for a career in the industry? Get in touch. Enquiries / Media Name * First Name Last Name Email * Phone * (###) ### #### Notes / Comments * Thank you for reaching out! Our office hours at Wednesday - Saturday 1pm - 4pm. We will respond as soon as we can. Pilot Location On Ngunnawal and Ngambri Country 1 Wakefield Gardens, Ainslie Shops That Other Place In the front courtyard of Pilot Restaurant. Opening September 25th 1 Wakefield Gardens, Ainslie Shops Pilot Hours Thursday — Sunday Dinner from 6pm Saturday — Sunday Lunch from 12pm Office hours are 1pm - 4pm Thursday - Sunday Contact Although we try our best we are not always able to take reservations and enquiries over the phone during service hours (outside office hours) as we need to attend to our guests in the restaurant. we@pilotrestaurant.com (02) 6257 4334 Monthly Newsletter Once a month we will share the goings on of the restaurant, insights to the industry, and the cool fun things and people we appreciate in Canberra First Name Last Name Email Address Sign Up We respect your privacy. Thank you!"
    }
  ]
}