{
  "fuentes": [
    {
      "url": "https://www.custompin.ca/contact-us",
      "email": "info@custompin.ca"
    },
    {
      "url": "https://www.trufcu.com/access/find-us/contact-us",
      "email": "trufcu@trufcu.com"
    },
    {
      "url": "https://www.claphamchasers.co.uk/contactus",
      "email": "cycling.chasers@outlook.com"
    },
    {
      "url": "https://leadiq.com/c/pin-chasers/5a1d9cb22300005e008c74bb/email-format",
      "email": "john@pinchasers.net"
    },
    {
      "url": "https://leadiq.com/c/pin-chasers/5a1d9cb22300005e008c74bb/email-format",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/pin-chasers/5a1d9cb22300005e008c74bb/email-format",
      "email": "sales@leadiq.com"
    }
  ],
  "mails": [
    "cycling.chasers@outlook.com",
    "info@custompin.ca",
    "john@pinchasers.net",
    "name@company.com",
    "sales@leadiq.com",
    "trufcu@trufcu.com"
  ],
  "nombre_sitio": "pinchasers.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.custompin.ca/contact-us",
      "text": "Contact Custom Pins Canada | Get in Touch Now info@custompin.ca Free Mock-Ups Free Shipping Lowest Prices Fastest Shipping 10 Minimum +1 226 225 9909 About us Services Custom Lapel Pins Custom Enamel Pins Custom Challenge Coins Custom Baseball Pins Custom Hat Pins Reviews Contact us Get a FREE Quote Phone No. +1 226 225 9909 Get a FREE Quote HAVE QUESTIONS? Let's Talk About Your Custom Pin Queries Send your questions our way, and we'll provide the answers you need. Submit Your Inquiries and Get Instant Response Not feeling confident about your design, or are budget constraints an obstacle? Don't worry. Talk to our expert consultants, and you will gain clarity along with a roadmap to achieve your desired outcome. Simply fill in the form below with your details and a comprehensive message, and a customer support representative will get back to you promptly. Name* Email* Phone No* Message * Loading... {{ text }} DROP US A LINE info@custompin.ca REACH OUT TO US +1 226 225 9909 With our 24-hour service, we are available round the clock. STAY CONNECTED ON SOCIAL HANDLES Facebook Instagram Pinterest TikTok Acknowledged By Canada's Leading Names Whether it's a small business or a renowned national organization, everyone loves us for providing exceptional services. Our commitment to excellence has earned us the title of the best custom pin factory in Canada. Ready to Make Your Mark with A Custom Pin Badge? Get a FREE Quote Connect With Us CustomPin.ca specialises in creating bespoke pins and badges tailored for every occasion. Work closely with our skilled artisans to design high-quality, memorable pieces that stand out and capture your vision. Phone No. +1 226 225 9909 Email info@custompin.ca Quick Links Home About us Reviews Contact us Get A Quote Blog Sitemap Services Custom Lapel Pins Custom Enamel Pins Custom Challenge Coins Custom Baseball Pins Custom Hat Pins Safe & Secure Checkout Connect With Us Facebook Instagram Pinterest TikTok © 2018 - 2025 Custom Pin CA. All Rights Reserved. Made with by Software Brainiacs © 2025 - Custom Pin CA. All Rights Reserved Privacy Policy | Terms & Conditions"
    },
    {
      "url": "https://www.trufcu.com/access/find-us/contact-us",
      "text": "Contact Us | TruChoice Federal Credit Union Skip to main content Open Search What can we help you find? Search: Search When autocomplete results are available use up and down arrows to review and enter to select. Close Search Learn Learn About Us ‹ Back About Us Careers Scholarships Events Membership Financial Wellness ‹ Back Financial Wellness Blog Calculators About Credit Back Spend & Save Spend & Save Checking ‹ Back Checking Simple Checking InCheck Account Savings ‹ Back Savings Savings & Club Accounts Money Market Accounts Certificates IRA Services ‹ Back Services Round Up Back Borrow Borrow Credit Cards ‹ Back Credit Cards Traditional Credit Card TruHero Credit Card Cash Back Rewards Credit Card Loans ‹ Back Loans Home Loans Home Equity Loans Car Loans Personal Loans Credit Builder Loans Services ‹ Back Services Skip a Payment Loan Insurance Back Access Access Find Us ‹ Back Find Us Contact Us Hours, Branches & ATMs Tools ‹ Back Tools Routing Number & Wire Transfer Info Rates Anytime, Anywhere ‹ Back Anytime, Anywhere Move Money Banking On the Go Back Routing # 211288307 Login Contact Us Have questions? Want to learn more about being a TruChoice member? Need help with your account or online banking? We’re happy to help! And there are plenty of ways to reach us. Text or call our Contact Center 207.772.0808 or 800.639.5550 Available Monday – Friday, 8:30 a.m. to 5:00 p.m. Report lost/stolen credit and debit cards 24/7 Hotlines From within the U.S.: 1.888.241.2510 From outside the U.S.: 1.909.941.1398 Submit an online form Fill out our handy contact form . Send us an email trufcu@trufcu.com Email isn’t secure, so please don’t email us your account numbers, PIN or Social Security number. If you need to share sensitive information with us, contact us by phone; email us your name and phone number requesting a call back; or send us a secure message from within online banking. Contact us immediately if you ever suspect fraud or receive suspicious emails, text messages, or phone calls about your TruChoice accounts. Visit a branch Sending something in the mail? Make sure to use our mailing address instead of the branch address! + Expand All Accordions Biddeford 6 Barra Road Open Monday – Friday, 8:30 a.m. to 5:00 pm (closed Noon to 1:00 pm) 207.772.0808 Buxton 779 Narragansett Trail Open Monday - Friday, 8:30 a.m. to 5:00 p.m. 207.772.0808 Portland 272 Park Avenue Open Monday - Friday, 8:30 a.m. to 5:00 p.m. 207.772.0808 Drop a note in the mail P.O. Box 10659, Portland, Maine 04104 You can even fax us 207.772.8683 Contact Us Online * Indicates Required Name * Email * Phone Questions/Comments * We make your goals our goals About us Careers Scholarships Membership Find us Contact us Hours Branches ATMs Tools Rates Website Accessibility Privacy Policy Patriot Act Sitemap Join now Routing # 211288307 Facebook Instagram Linkedin Copyright © TruChoice Credit Union Funds in your accounts at TruChoice are insured to at least $250,000 by the National Credit Union Administration (NCUA) and are backed by the full faith and credit of the United States Government. TruChoice provides additional share insurance covering an additional $250,000. Certain IRAs are insured up to $250,000. Copies of the NCUA brochure \"Your Insured Funds\" are available at each TruChoice office and are also available by mail upon request. TruChoice Federal Credit Union • PO Box 10659, Portland, ME 04104 • Toll-free: 1.800.639.5550 • Email: trufcu@trufcu.com © 2006-2024 TruChoice Federal Credit Union Cash Back Rewards Credit Card! Put money back in your pocket with our limited time promotional rate of 2.5% cash back on everything* you buy with our new Cash Back Rewards Card! Earn more InCheck Earn high yield interest on your checking account with just 12 debit card transactions a month and eStatement enrollment. Learn More Save Up Certificate Grow your savings in a safe and reliable way with a competitive interest rate and the security of a fixed term. Learn More Car Loan Buying a new car, a used car, or want to refinance your current loan? We're celebrating 70 years with rates as low as 4.70% APR*! Learn More Cash Back Rewards Credit Card! Put money back in your pocket with our limited time promotional rate of 2.5% cash back on everything* you buy with our new Cash Back Rewards Card! Earn more Cash Back Rewards Credit Card! Put money back in your pocket with our limited time promotional rate of 2.5% cash back on everything* you buy with our new Cash Back Rewards Card! Earn more"
    },
    {
      "url": "https://www.claphamchasers.co.uk/contactus",
      "text": "Clapham Chasers - Contact Us Menu Log in Home Membership JOIN US! Join Clapham Chasers Privacy Notice Membership Renewals England Athletics Affiliation Club Kit Shop Triathlon Join British Triathlon Novice Triathlon Programme Swim Swim Sessions Swimming Coaches Swimming FAQ Cycle Getting Started Intro Rides Group Riding Saturday Group Ride Midweek Intervals Build Up to Brighton Seasonal Rides Zwift Routes Meet the Team Run Team 10K Runners Programme Summer Race Calendar 2025 Disciplines Insurance About us Committee Club Benefits Club Constitution & Rules Welfare & Welfare Officers Code of Conduct for Members Code of Conduct for Coaches & Leaders Volunteering and paid coach policy Contact Us Health & Safety Communications Site map Remember me Forgot password Log in Remember me Forgot password Home Membership JOIN US! Join Clapham Chasers Privacy Notice Membership Renewals England Athletics Affiliation Club Kit Shop Triathlon Join British Triathlon Novice Triathlon Programme Swim Swim Sessions Swimming Coaches Swimming FAQ Cycle Getting Started Intro Rides Group Riding Saturday Group Ride Midweek Intervals Build Up to Brighton Seasonal Rides Zwift Routes Meet the Team Run Team 10K Runners Programme Summer Race Calendar 2025 Disciplines Insurance About us Committee Club Benefits Club Constitution & Rules Welfare & Welfare Officers Code of Conduct for Members Code of Conduct for Coaches & Leaders Volunteering and paid coach policy Contact Us Health & Safety Communications Site map Contact us As a volunteer club we monitor these emails regularly but not daily. We try to respond to most emails within 7 days of receipt . Thank you for your patience. Main Club Contact Joe Spraggins (Chair) info.chasers@gmail.com Please use this for general enquiries about the club (for joining and sessions see below) Memberships Contact Rob Ellis: memberships.chasers@gmail.com This is only for membership enquiries Session Specific Contacts Running Sessions (Ellie Andrews & Eddie Rolls): running.chasers@gmail.com Bike Sessions / Intro Rides (Adrian Brammer): Cycling.Chasers@gmail.com Swimming Sessions (Philippa Rice): swim.chasers@gmail.com Head of Triathlon Contact Phil Ratliff: triathlon.chasers@gmail.com Triathlon sessions, novice programmes, racing and triathletes joining etc Club Secretary Zoe Aarons: secretary.chasers@gmail.com Governing body affiliations, subscriptions and formal communications Club Treasurer Ann Brennan: treasurer.chasers@gmail.com This is only for payment enquiries/issues Club Communications Officer Roxi Sweeney: comms.chasers@gmail.com Welfare Officers Jesus Pascual: welfare.chasers@gmail.com Facebook Group (awaiting approva l): PLEASE do not email us enquiring about your approval. We get a lot of requests to join from members and non-members and it can take a while to sort through the approvals. Thanks for your patience. About us Site map Membership Club benefits Club Kit Club policies Club constitution and rules Committee Code of conduct for members for coaches and leaders Volunteering Health & Safety Welfare #RunAndTalk Mental Health Champions Contact us General enquiries: info.chasers@gmail.com Find the right email from our contact list Follow us © 2023 Clapham Chasers Powered by Wild Apricot Membership Software Powered by Wild Apricot Membership Software"
    },
    {
      "url": "https://leadiq.com/c/pin-chasers/5a1d9cb22300005e008c74bb/email-format",
      "text": "Pin Chasers Email Formats & Email Address Examples | LeadIQ Learn more at LeadIQ.com Start free Most Common Email Formats at Pin Chasers The most accurate and popular Pin Chasers 's email format is  (ex. ). Pin Chasers also uses as email structures. Pin Chasers uses up to 1 different email patterns. Pin Chasers Email Formats Example Percentage FLast@pinchasers.net JDoe@pinchasers.net 45% First@pinchasers.net John@pinchasers.net 5% FirstLast@pinchasers.net JohnDoe@pinchasers.net 5% FLast@pinchasers.net JDoe@pinchasers.net 45% Frequently Asked Questions What does Pin Chasers do? Pin Chasers was founded in 1958 . The company's main headquarters is located in 4847 N. Armenia Ave., Tampa, FL 33603, US operates in the Recreational Facilities industry , along with similar companies like Boardwalk Bowl Splitsville Luxury Lanes Kings Dining & Entertainment . You can visit pinchasers.net contact Pin Chasers 's headquarters by phone at +1-727-397-**** . Explore Pin Chasers 's company overview page for more information. What is Pin Chasers 's email address format? Pin Chasers 's email format typically follows the pattern of FLast@pinchasers.net; this email format is used 45% of the time. Other contacts within LeadIQ's database had email formats such as First@pinchasers.net FirstLast@pinchasers.net . Looking for more contact data? Unlock accurate emails and phone numbers from millions of profiles verified in real-time. How many employees does Pin Chasers have currently? Pin Chasers has approximately 51 employees as of 1958 . Key team members to contact include Ceo: A. P. Owner: N. H. Accounting Manager: B. M. . For more team information and contact data, explore Pin Chasers 's employee directory with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Pin Chasers Email Format Recreational Facilities United States 51-200 Employees Pin Chasers is Bowling, Food, and Fun! In business, for over 50 years, we offer Tampa Bay's best bowling and entertainment for family and friends. Whether you seek casual bowling, glow or cosmic bowling, birthday parties or just a great night with friends or a date, Pin Chasers is the choice. At Pin Chasers you will enjoy a personalized experience with customizable scoring entertainment, automated bumpers for children, delicious food including burgers, salads, sandwiches and pizza, web-based reservations, all of your favorite sodas, beer, and spirits, and the best values in bowling today. The use of bowling shoes and bowling balls is always complimentary at Pin Chasers and even a pair of new socks if you need them. Sign up for free to view info Company overview Employee directory Verify Pin Chasers email addresses Verify Email Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    }
  ]
}