{
  "fuentes": [
    {
      "url": "https://www.pinellas-park.com/529/District-Special-Events",
      "email": "dreeves@pinellas-park.com"
    },
    {
      "url": "https://parkwayengland.com/contact-us/",
      "email": "info@parkwayengland.com"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "olszakj@pcsb.org"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "cpf.oruneu@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "nenovnr@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "neonhtur@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "nhfgvaf@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "nthvynew@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "nxrew@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "nyyras@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "obapuvq@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "objyvaxb@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "obngjevtugq@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "oebqvry@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "oevpxznaw@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "onvyrlxv@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "orabvgx@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "orpxjvgui@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "ortnwr@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "ovfubssp@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "oynaxfq@cpfo.bet"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "email": "yrroer@cpfo.bet"
    },
    {
      "url": "https://hedrickbrothers.com/contact-us/",
      "email": "info@hedrickbrothers.com"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.pinellas-park.com/653/Join-Our-Team",
      "email": "recruiter@pinellas-park.com"
    },
    {
      "url": "https://www.pinellas-park.com/Faq.aspx?QID=165",
      "email": "events@pinellas-park.com"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "customerservice@encorepack.com"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "sales@encorepack.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "app-promo-phones@2x.png",
    "beatrice.malle@skanem.com",
    "cpf.oruneu@cpfo.bet",
    "customerservice@encorepack.com",
    "dreeves@pinellas-park.com",
    "events@pinellas-park.com",
    "info.nairobi@skanem.com",
    "info@hedrickbrothers.com",
    "info@parkwayengland.com",
    "jane@skanem.ke",
    "nenovnr@cpfo.bet",
    "neonhtur@cpfo.bet",
    "nhfgvaf@cpfo.bet",
    "njogu@skanem.com",
    "nthvynew@cpfo.bet",
    "nxrew@cpfo.bet",
    "nyyras@cpfo.bet",
    "obapuvq@cpfo.bet",
    "objyvaxb@cpfo.bet",
    "obngjevtugq@cpfo.bet",
    "oebqvry@cpfo.bet",
    "oevpxznaw@cpfo.bet",
    "olive.kunihira@skanem.com",
    "olszakj@pcsb.org",
    "onvyrlxv@cpfo.bet",
    "orabvgx@cpfo.bet",
    "orpxjvgui@cpfo.bet",
    "ortnwr@cpfo.bet",
    "ovfubssp@cpfo.bet",
    "oynaxfq@cpfo.bet",
    "recruiter@pinellas-park.com",
    "sachen.gudka@skanem.com",
    "sales@encorepack.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "yrroer@cpfo.bet"
  ],
  "nombre_sitio": "pinellas-park.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pinellas-park.com/529/District-Special-Events",
      "text": "District Special Events | Pinellas Park, FL Skip to Main Content Departments City Government Projects Online Services How Do I... Search Home Departments Community Development Planning & Development Services Community Redevelopment Agency (CRA) Community Redevelopment District District Special Events District Special Events The Community Redevelopment District is the site of numerous special events each year.  These events bring hundreds of thousands of people to the downtown area and generate interest in the District. The CRA Police Unit co-hosts several community events including: Citizens Police Academy National Night Out Operation Medicine Cabinet “Treat Trail” at the Shoppes at Park Place, where businesses play host to safe, family-friendly Halloween celebrations. Each month the Pinellas Park Fire Fighters host Movies in the Park at England Brothers Park. Country in the Park England Brothers Park is also the location for the City’s annual Country in the Park festival and trade show, a free event held each March that includes musical performances by nationally-known and local musicians, arts and crafts, pony rides, a car show, children’s activities and much more. On the evening preceding Country in the Park, the Firefighters host the annual Chili Blaze, a chili cook-off to benefit the Muscular Dystrophy Association. This event also offers live music, over 50 different chili teams competing for the \"Chili Champion's\" trophy, and a large fireworks display. Pinellas Country Fair & Rodeo The City now also participates in hosting the annual Pinellas Country Fair at England Brothers Park, complete with its very own Rodeo. Pinellas Park Performing Arts Center The Pinellas Park Performing Arts Center, hosts a full season of sold-out concerts; for additional information, see the monthly calendar on the City of Pinellas Park home page. In addition, the Center hosts regular performances by the Pinellas Park Civic Orchestra and Matinee Opera Players. Holiday Parade The City's historic downtown, located along the Park Boulevard corridor, is the site of the annual December Holiday Parade, a community favorite. Pinellas Arts Village Beginning in 2015, the downtown also became the site of a new and growing Pinellas Arts Village, which offers the Fourth Saturday Art Walk during January-November, and a special Holiday Art Walk in December, as well as individual shows and events hosted by resident artists and creative businesses. Contact Us Community Redevelopment Agency Email Physical Address View Map 6051 78th Avenue North Pinellas Park , FL 33781 6051 78th Avenue North  Pinellas Park FL 33781 Directions Mailing Address P.O. Box 1100 Pinellas Park , FL 33780 Phone: 727-369-5631 Budgets & Reports Creative District District Special Events Priorities & Recent Accomplishments More Accomplishments Programs for CRA Businesses & Homeowners Contact Us Community Development 6051 78th Avenue N Pinellas Park, FL 33781 Phone: 727-369-5840 Staff Directory Quick Links Click & Fix Veterans’ Preference Information Privacy Policy /QuickLinks.aspx Site Links Website Accessibility Copyright Notices Sitemap ADA Assistance /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://parkwayengland.com/contact-us/",
      "text": "Parkway England - Contact Parkway England – Get in Touch Home About us Careers Contact GET IN TOUCH Contact Parkway 22 Fareham Ind Park Standard Way Fareham Hampshire PO16 8XJ +44 (0)238 064 1780 info@parkwayengland.com Instagram Linkedin © 2023 Parkway England - All rights reserved. Parkway  22 Fareham Ind Park  Standard Way  Fareham  Hampshire  PO16 8XJ Designed by Felix&Friends -->"
    },
    {
      "url": "https://www.pcsb.org/domain/10663",
      "text": "Staff Directory / Staff Email Please ensure Javascript is enabled for purposes of website accessibility Skip to Main Content District Home Select a School... Select a School Anona Elementary (es) Azalea Elementary (es) Azalea Middle (ms) Bardmoor Elementary (es) Bauder Elementary (es) Bay Point Elementary Magnet (es) Bay Point Middle (ms) Bay Vista Fundamental (es) Bayside High (ea) Bear Creek Elementary (es) Belcher Elementary (es) Belleair Elementary (es) Blanton Elementary (es) Boca Ciega High (hs) Brooker Creek Elementary (es) Calvin Hunsinger School (ec) Campbell Park Elementary (es) Carwise Middle (ms) Chi Chi Rodriguez Academy (ea) Clearview Adult Education Center (ct) Clearwater Adult Education Center (ct) Clearwater Fundamental (ms) Clearwater High (hs) Community Countryside High (hs) Cross Bayou Elementary (es) Curlew Creek Elementary (es) Curtis Fundamental Elementary (es) Cypress Woods Elementary (es) Disston Academy (ea) Douglas L. Jamerson, Jr. Elementary (es) Dunedin Elementary (es) Dunedin Highland Middle (ms) Dunedin High (hs) East Lake High (hs) East Lake Middle School (ms) Eisenhower Elementary (es) Elisa Nelson Elementary (es) Fairmount Park Elementary (es) Families Forest Lakes Elementary (es) Frontier Elementary (es) Fuguitt Elementary (es) Garrison-Jones Elementary (es) Gibbs High (hs) Gulf Beaches Elementary Magnet School (es) Gulfport Montessori Elementary (es) High Point Elementary (es) Highland Lakes Elementary (es) Hollins High (hs) J. Hop Times James B. Sanderlin K-8 (es)(ms) John Hopkins Middle School (ms) John M. Sexton Elementary (es) Kings Highway Elementary Magnet School (es) Lake St. George Elementary (es) Lakeview Fundamental (es) Lakewood Community School (ct) Lakewood Elementary (es) Lakewood High (hs) Largo High (hs) Largo Middle (ms) Lealman Avenue Elementary (es) Lealman Innovation Academy (ea) Leila G. Davis Elementary (es) Lynch Elementary (es) Marjorie Kinnan Rawlings Elementary (es) Madeira Beach Fundamental K-8 (es)(ms) Manatee Messenger Mangrove Bay Middle School Maximo Elementary (es) McMullen Booth Elementary IB World School (es) Meadowlawn Middle (ms) Melrose Elementary (es) Midtown Academy (es) Mildred Helms Elementary (es) Morgan Fitzgerald Middle (ms) Mount Vernon Elementary (es) New Heights Elementary (es) Newsroom Nina Harris Exceptional  Student Education Center (ec) North Shore Elementary (es) Northeast High (hs) Northwest Elementary (es) Oak Grove Middle (ms) Oakhurst Elementary (es) Oldsmar Elementary (es) Orange Grove Elementary (es) Osceola Fundamental High (hs) Osceola Middle (ms) Ozona Elementary (es) Palm Harbor Middle (ms) Palm Harbor University High (hs) Pasadena Fundamental (es) Paul B. Stephens School (EC) PCS TV 14 Performing Arts Perkins Elementary (es) Pinellas Central Elementary (es) Pinellas Gulf Coast Academy (ea) Pinellas High Innovation (ea) Pinellas Park Elementary (es) Pinellas Park High (hs) Pinellas Park Middle (ms) Pinellas Secondary School (ea) Pinellas Technical College Clearwater (ct) Pinellas Technical College - St. Petersburg Campus (ct) Pinellas Technical College(ct) Pinellas Virtual School (es)(ea)(ms)(hs) Plumb Elementary (es) Ponce de Leon Elementary (es) Registration2 Richard L. Sanders School (ec) Richard O. Jacobson Technical High School at Seminole (hs) Ridgecrest Elementary (es) Safety Harbor Elementary (es) Safety Harbor Middle (ms) San Jose Elementary (es) Sandy Lane Elementary (es) Sawgrass Lake Elementary (es) Seminole Elementary (es) Seminole High (hs) Seminole Middle School (ms) Seventy-Fourth St. Elementary (es) Shore Acres Elementary (es) Skycrest Elementary (es) Skyview Elementary (es) Southern Oak Elementary (es) Spartan News Network St. Petersburg High (hs) Starkey Elementary (es) Stavros Institute Students Sunset Hills Elementary (es) Sutherland Elementary (es) Tarpon Springs Elementary (es) Tarpon Springs Fundamental (es) Tarpon Springs High (hs) Tarpon Springs Middle (ms) Thurgood Marshall Fundamental (ms) Tomlinson Adult Learning Center (ct) Tyrone Middle (ms) Walsingham Oaks K-8 School (es) (ms) Westgate Elementary (es) Woodlawn Elementary (es) Sign In Search Our Site Pinellas Park High School Home of the Patriots Achieving Excellence Home About Us \" School Information Administration/Guidance Student Breakdown Bell Schedule Guidance New Student Registration Our Mission and Vision School Administration School Financial Reports Staff Directory Academics \" Extended Learning Program Registration - 24-25 School Year Classic Learning Test PPHS Curriculum Guide Dual Enrollment, Advanced Placement, and Industry Certifications Summer Bridge and Credit Recovery PERT Junior Night Programs \" Special Programs First Responders Criminal Justice Academy AVID Coast Guard JROTC Athletics \" Summer Practice Information General Athletic Information Purchase Athletic Event E-Tickets Watch Live - NFHSnetwork Forms Zach Martin Act Information Student Accident Insurance Fall Sports Winter Sports Spring Sports Hall of Fame Clubs and Activities \" Class of 2025 Clubs & Activities Homecoming Performing and Visual Arts Student Accident Insurance Student Government Yearbook Get Engaged \" Resources \" Bright Futures Information Building Data Bullying/Harassment Reporting College and Career Center Dress Code Florida KidCare Food Bank Get Involved Library Media Center Meal Info New Students SAC School Threat or Suicide Tip School-Based Health Clinic Technology Help Title I Information Transcript Requests Uniform Statewide Assessment Calendar Junior Night Summer Program Information Lockers Surveys Alumni \" Pinellas Park High Grads Give Calendar Pinellas Park High (hs) Staff Email Staff Directory Page Navigation Staff Email Pinellas Park High Staff Directory You can search by name, or use the \"Locations\" drop-down to filter by job title. Name: Title: Location: Search Showing results for \"Professor named Smith at Elementary School\" START OVER Julia Aguilar Joshua Aker Faith Allen Emily Arabia Emily Arbaugh Shawn Austin Kimberly Bailey Genisis Barber Valerie Beckwith Erjola Begaj Officer Harold Behar Kristine Benoit Chris Bishoff Dyllon Blanks Diane Boatwright David Bonchi Korey Bowlin Lisa Breana Joseph Brickman Laura Brodie 1 2 3 4 5 6 7 8 9 We weren't able to find anything that matched your search criteria. Please try a new search. Address 6305 118th Ave. N, Largo, FL 33773-3729 Phone (727) 538-7410 Fax 727-507-6174 facebook twitter youtube instagram pinterest linked in flickr vimeo Site Map Back to Top Site Map Back to Top You can add a copyright statement or legal disclaimer in this area if necessary. Questions or Feedback? | Web Community Manager Privacy Policy (Updated) | Copyright © 2025 Finalsite - all rights reserved. CLOSE CLOSE"
    },
    {
      "url": "https://hedrickbrothers.com/contact-us/",
      "text": "Contact Hedrick Brothers Construction: Reach Out and Connect with Us Linked In Facebook Instagram Search 561-689-8880 About Company Safety Community Recognition Leadership Culture Services Commercial Luxury Residential Exquisite Residences Prestigious Condominiums Legacy Historic / Landmark Homes Equestrian Estates Development News Trade Partners Click Here To Prequalify Careers Contact Us Get In Touch info@hedrickbrothers.com Hedrick Brothers Construction – Corporate Headquarters 2200 Centrepark West Drive West Palm Beach, FL 33409 P: 561-689-8880 Hedrick Brothers Construction - Miami Office 6161 NE 3rd Avenue, Suite 2 Miami, FL 33137 P: 561-689-8880 Hedrick Brothers Construction – Space Coast Office 1002 East New Haven Avenue, Second Floor Melbourne, FL 32901 P: 561-689-8880 Hedrick Brothers Construction – Central Florida Office 174 West Comstock Avenue, Second Floor Winter Park, FL 32789 P: 561-689-8880 Name * First Last Email * Phone Message CAPTCHA Comments This field is for validation purposes and should be left unchanged. Δ Let’s Build Something Extraordinary Together. Contact Us Company Safety Community Recognition Leadership Culture Careers Services Development Environmental Luxury Residential Gallery Commercial Portfolio News Trade Partners Privacy Policy Accessibility Facebook LinkedIn Instagram Copyright © 2024 Hedrick Brothers Construction Co., Inc. CGC013137. All Rights Reserved. Scroll to Top"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.pinellas-park.com/653/Join-Our-Team",
      "text": "Join Our Team | Pinellas Park, FL Skip to Main Content Departments City Government Projects Online Services How Do I... Search Home Departments Police Your Police Join Our Team Join Our Team The City of Pinellas Park is an Equal Opportunity Employer The Pinellas Park Police Department has an authorized strength of 106 full time police officers. The Recruiting Unit is responsible for the recruitment and background investigation of all candidates who request consideration for employment as police officers. In addition to our own in house investigators, the agency also utilizes the services of Police Applicant Screening Services (PASS) to conduct preliminary background investigations on all potential police candidates. The completion of the PASS process is necessary to be considered for employment as a police officer with the Pinellas Park Police Department. For more information on the PASS process and to link directly to their website, please click the link above. Equal Employment Opportunity The City of Pinellas Park is an equal opportunity employer. EOT VERIFICATION PROCESS The Exemption From Training (EOT) process provided by PASS is for out-of-state officers, federal officers and previously certified Florida officers with a four year or more break-in-service pursuant to section 943.131(2a), Florida Statutes and Rule 11B-35.009(3) or (4), Florida Administrative Code. The EOT allows a former officer to be exempt from having to complete the full basic recruit academy. For more information about the EOT process please click HERE . Contact Us Benson Dimaculangan Professional Standards Detective Phone: 727-369-7828 Benefits 10 Holidays Per Year 100 Hours of Paid Vacation (Additional Hours Accrue With Longevity) 16 Hrs Personal Leave 12 Hour Shifts with alternating weekends off 96 Hours Paid Sick Leave Per Year Credit Union Membership Deferred Compensation Available (457 Program) Dental Coverage Available Direct Payroll Deposit 3 Year Deferred Retirement Option Program ( DROP ) Employee Assistance Program Funeral / Bereavement Leave Health Insurance at Low Cost to Employee in-House Fitness Center Life Insurance Available Long Term Disability Option Military Leave Paid Jury Duty Paid Training Programs Pension Plan Spouse and Dependent Dental Coverage Available Spouse and Dependent Health Coverage Available Supplemental Life Insurance Available Take-Home Vehicle (Surrounding Counties) Uniforms and Equipment Provided Qualifications Be at least 19 years of age Be a citizen of the United States Be a high school graduate or its equivalent Be in good physical condition as determined by a physician's examination and successfully pass analysis for controlled substances Be of good moral character. Have completed at least 30 hours at an accredited college, be in good standing (not on probation) during your last attendance, and have an overall GPA of at least 2.0 (on a 4 point scale) Never have received a dishonorable discharge from any of the Armed Forces of the United States Not have been convicted of any felony or of a misdemeanor involving perjury or false statement Possess a valid driver's license Selection Process As a candidate for the position of a police officer, you will be expected to successfully complete and or pass the following: Background Investigation Completion of the Pass Process Meet Agency Approved Drug and Tobacco Policy Oral Board Interview Oral Interview Patrol Ride-Along Evaluation Physical Examination Polygraph Examination Psychological Examination Salary Starting Salary $65,545.22 $30 Per Month Additional for a 2-Year College Degree $80 Per Month Additional for a 4-Year College Degree Advanced Training Incentive Pay Overtime Pay Secondary Employment Details (Available to Supplement Officers' Salaries) Court Standby Pay Additional Information For additional information on the selection process or to learn more about the job opportunities at the Pinellas Park Police Department, please contact us at Pinellas Park Police Department Recruiting Unit. Attention to: Detective B. Dimaculangan 7700 59 Street N Pinellas Park, FL 33781 Phone: 727-369-7828 Fax: 727-369-5703 Email: recruiter@pinellas-park.com Chief Adam Geissenberger Chief Adam Geissenberger Executive Staff Our Philosophy Accreditation Internal Affairs Records Join Our Team Honor Guard Investigation Division Criminal Investigation Section Cold Case Files Special Investigations Unit Public Information Unit Operations Division Patrol Special Operations K - 9 Traffic Unit Traffic Homicide Cold Cases Services Division Community Compliance Report a Violation FAQs Helpful Links Community Compliance Staff Directory Community Policing Unit Community Policing Unit Crime Prevention SWAT Youth Services Training Unit Staff Directory Officer Of The Year Contact Us Police Department 7700 59th Street Pinellas Park, FL 33781 Phone: 727-369-7864 Quick Links Click & Fix Veterans’ Preference Information Privacy Policy /QuickLinks.aspx Site Links Website Accessibility Copyright Notices Sitemap ADA Assistance /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.pinellas-park.com/Faq.aspx?QID=165",
      "text": "FAQs • *Who do I talk to about renting England Brothers Park Skip to Main Content Departments City Government Projects Online Services How Do I... Search Home FAQs *Who do I talk to about renting England Brothers Park or the events going on at EBP? For inquiries about events or rentals at England Brothers Park, email events@pinellas-park.com .  You can also call during the M-F workweek at 727-369-5735. Parks Show All Answers 1. What's the best way to report a maintenance or repair issue at a park? See.Click.Fix allows for convenient reporting at any time, any day of the week. Everyone in the community can see what issues have been reported, minimizing duplicate reports for the same issues and allowing the Parks Maintenance team to more easily track recurring issues. You can also call our Public Works office between 8 am - 5 pm Monday-Friday at 727-369-5850.  If you encounter an issue of serious safety concern at one of the parks during the evening or weekend, please call our police department at 727-369-7864; they have the ability to reach the appropriate Public Works team to address the issue. (Please note that the dispatcher answering the phone may ask for the park address since the dispatch office covers multiple areas in Pinellas County.) 2. How do I rent a park pavilion? Use the CivicRec online reservation software to view availability and rent a park pavilion up to 1 year in advance. Half-day and full-day rates are available. If you prefer to make payment by cash or check, or need in-person assistance navigating the software, you can visit any recreation center. 3. *Who do I talk to about renting England Brothers Park or the events going on at EBP? For inquiries about events or rentals at England Brothers Park, email events@pinellas-park.com .  You can also call during the M-F workweek at 727-369-5735. Module Search Enter Search Terms All Categories Accounting Building Development - Permitting Building Development - Plans & Contractors Community Compliance Community Development - Zoning Community Planning - Community Rating System (CRS) Fire Department Garbage Collection Human Resources Library Parks Police Reclaimed Water Recycling Risk Management Utility Accounts Yard Waste Categories All Categories Accounting Building Development - Permitting Building Development - Plans & Contractors Community Compliance Community Development - Zoning Community Planning - Community Rating System (CRS) Fire Department Garbage Collection Human Resources Library Parks Police Reclaimed Water Recycling Risk Management Utility Accounts Yard Waste Live Edit Contact Us City of Pinellas Park 5141 - 78th Avenue North Pinellas Park, FL 33781 Telephone: 727-369-0700 Quick Links Click & Fix Veterans’ Preference Information Privacy Policy /QuickLinks.aspx Site Links Website Accessibility Copyright Notices Sitemap ADA Assistance /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "text": "Encore Packaging LLC -Contact Us! Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal/Privacy Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Thank you for sending us a message! We will get back to you shortly Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Do you consent to our Privacy Policy / Terms of Use and Standard Terms and Conditions of Sale ? Yes Logout Please check in later. This feature coming soon! (847) 735-8105 Call Us | Email Us | Log-In Products News Special Offers Events About Us Strapping Stretch Strapping and Accessories Kits Battery Tools and Accessories Tensioners Pneumatic Tools Sealers Accessories Sealless Tools Cutters Strapping Trucks Strap Dispensers Edge Protectors Strapping Coils Buckles Pre-Cuts Seals Combination Tools Material Dispensers & Holders Storage Solutions Peanut Dispensers Kraft Paper Dispensers Bubble, Foam, Poly and Corrugated Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stretch Film Dispensers Honeycomb Paper Dispensers Slide Cutters Utility Knives & Cutters Replacement Blades Retractable T-Style Hook Style Sliding Accessories Specialty Tape Dispensers Table-Top Rubber Bands Standard Moving Pallet Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Strapping Stretch Strapping and Accessories Eco-Friendly Kits For Woven Polyester For Polypropylene For Polyester For Steel For Woven Cord Battery Tools and Accessories For Polypropylene For Polyester For Cord Strapping Tensioners For Polypropylene For Polyester For Cord For Steel For Stainless Steel Pneumatic Tools For Cord For Steel Sealers For Polypropylene For Polyester For Steel Accessories Sealless Tools For Steel Cutters For Steel and Poly For Steel Strapping Trucks Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Steel or Poly Strap Dispensers For Steel For Cord For Poly For Steel or Poly For Poly and Steel Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Poly Edge Protectors Standard Duty Heavy Duty Strapping Coils Buckles For Cord For Poly For Stainless Steel Pre-Cuts Seals For Poly For Steel Combination Tools For Steel For Stainless Steel Material Dispensers & Holders Storage Solutions Trays Mobile Hooks Carton Stands Peanut Dispensers Kraft Paper Dispensers Wall Mountable Table/Wall Mountable Floor Unit Accessory Table Mountable Bench Mountable Table/Bench Mountable Mobile Units Battery Powered Bubble, Foam, Poly and Corrugated Dispensers Wall/Table Mount Mobile Dispensers Battery Powered Horizontal Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stationary Mobile Stretch Film Dispensers Honeycomb Paper Dispensers Table/Wall Mountable Slide Cutters Wall/Table Mount Mobile Dispensers Battery Powered Utility Knives & Cutters Replacement Blades Retractable Light Duty Standard Duty Heavy Duty T-Style Light Duty Standard Duty Hook Style Standard Duty Heavy Duty Sliding Standard Duty Accessories Specialty Standard Duty Heavy Duty Tape Dispensers Replacement Blades & Wiper Plates Hand-Held Table-Top Rubber Bands Standard Large Moving Pallet Phone: 847-735-8105 Fax: 847-735-8297 Email: customerservice [at] encorepack sales [at] encorepack Headquarters: Encore Packaging LLC 201 Park Ave Lake Villa, IL 60046 Remit Payment to: P.O. Box 595 Winnetka, IL 60093 Ask An Agent Our Customer Service Agents are ready to help! (847) 735-8105 Email Home Contact Site Map Catalog Legal encorepack.mx"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    }
  ]
}