{
  "fuentes": [
    {
      "url": "https://thebullpub.co.uk/contact-us/",
      "email": "contact@thebullpub.co.uk"
    },
    {
      "url": "https://www.id-interactive.fr/guide-formats-tailles-images-publicitaires-sociaux-conseils/",
      "email": "contact@id-interactive.fr"
    },
    {
      "url": "https://www.id-interactive.fr/guide-formats-tailles-images-publicitaires-sociaux-conseils/",
      "email": "dpo@id-interactive.fr"
    },
    {
      "url": "https://www.id-interactive.fr/guide-formats-tailles-images-publicitaires-sociaux-conseils/",
      "email": "rgaa@id-interactive.fr"
    },
    {
      "url": "https://www.thepunteroxford.co.uk/contactus",
      "email": "reservations@thepunteroxford.co.uk"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "aron_loh@pub.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "chee_enqing@caas.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "carl_loh@nea.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "effendy_samat@nea.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "fareena_abdul_rahim@nea.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "hafiz_mohd_noor@nea.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "haja_mohiunuddin@nea.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "hashim_abdul_majid@pub.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "ivan_ho@caas.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "julia_zhu@mpa.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "koh_cheok_chye@mpa.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "kadie_tan@pub.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "nea_vo@nea.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "neo_teck_heng@pub.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "patrick_lim@nea.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "phuong_hanh_nguyen@pub.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "samson_han@lta.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "tan_yew_jin@pub.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "terence_koah@lta.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "yeo_yan_ling@pub.gov.sg"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "email": "nea_eepc@nea.gov.sg"
    },
    {
      "url": "https://www.pubpeople.com/who-we-are",
      "email": "martin.cartwright@pubpeople.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.pubpeople.com/contact-us",
      "email": "martin.cartwright@pubpeople.com"
    }
  ],
  "mails": [
    "aron_loh@pub.gov.sg",
    "carl_loh@nea.gov.sg",
    "chee_enqing@caas.gov.sg",
    "contact@id-interactive.fr",
    "contact@thebullpub.co.uk",
    "dpo@id-interactive.fr",
    "effendy_samat@nea.gov.sg",
    "fareena_abdul_rahim@nea.gov.sg",
    "hafiz_mohd_noor@nea.gov.sg",
    "haja_mohiunuddin@nea.gov.sg",
    "hashim_abdul_majid@pub.gov.sg",
    "info@reception-plus.de",
    "ivan_ho@caas.gov.sg",
    "julia_zhu@mpa.gov.sg",
    "kadie_tan@pub.gov.sg",
    "koh_cheok_chye@mpa.gov.sg",
    "martin.cartwright@pubpeople.com",
    "nea_eepc@nea.gov.sg",
    "nea_vo@nea.gov.sg",
    "neo_teck_heng@pub.gov.sg",
    "patrick_lim@nea.gov.sg",
    "phuong_hanh_nguyen@pub.gov.sg",
    "reservations@thepunteroxford.co.uk",
    "rgaa@id-interactive.fr",
    "sales@finewineliquors.com",
    "samson_han@lta.gov.sg",
    "tan_yew_jin@pub.gov.sg",
    "terence_koah@lta.gov.sg",
    "yeo_yan_ling@pub.gov.sg"
  ],
  "nombre_sitio": "pinside.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://thebullpub.co.uk/contact-us/",
      "text": "Contact Us – The Bull Pub Skip to content Main Menu Home Drinks Diary Events Menu Toggle Bullfest 2024 About History Contact Us Opening Times Opening Times Reserve A Table CONTACT US To reserve a table, enquire about our food vendors or find out more about opening times, please do not hesitate to get in touch using the form below! Hungry / Thirsty? Come visit us! Telephone 01279 777307 Email contact@thebullpub.co.uk Have Feedback? We always love to hear feedback. If you have any suggestions or complaints, please get in touch and let us know Current Opening Hours Monday – Thursday 5-11pm Friday 4-11pm (currently not open Friday lunchtimes at present) Saturday & Sunday 12-11pm Copyright © 2025 The Bull Pub | Credits Powered by The Bull Pub"
    },
    {
      "url": "https://www.id-interactive.fr/guide-formats-tailles-images-publicitaires-sociaux-conseils/",
      "text": "Les formats et tailles publicitaires des réseaux sociaux | ID Interactive Ouvrir le menu Guide formats publicitaires et tailles sur les réseaux sociaux (Facebook, Instagram, LinkedIn, Pinterest, Twitter) 11.03.2021 Création de site & UX/UI Aller au contenu Les visuels sur les réseaux sociaux sont très importants, mais chaque réseau social a ses spécificités et ses règles à respecter ce qui ne facilite pas toujours la tâche. Les tailles des images et vidéos dans vos publications sont différentes selon la plateforme que vous utilisez. Il en est de même pour les social ads où l’on retrouve de nombreux formats, tailles et emplacements différents. Avec les social ads , les réseaux sociaux offrent aux entreprises et aux marques de nombreuses opportunités : gain de visibilité et notoriété, facilitation des conversions, génération de prospects … Ces publicités permettent de cibler votre audience et de capter leur attention avec des visuels dynamiques et esthétiques. Comme pour les visuels de vos publications, de nombreux formats existent pour les publicités sur les réseaux sociaux. Envie de tout savoir sur ces formats social ads ? Ne cherchez plus, cet article est fait pour vous ! Alors mettez vite cette page dans vos favoris pour gagner du temps et suivez ce guide lors de la création de vos visuels publicitaires à destination de vos campagnes sur les réseaux sociaux. Vous n’avez pas le temps de gérer vos campagnes social ads et de les optimiser ? Gagnez du temps et boostez vos performances en passant par une agence. ID Interactive vous accompagne dans la création et la diffusion de vos social ads. Besoin d’en savoir plus ? Contactez-nous en demandant votre devis gratuit en stratégie marketing digital , nous vous répondrons dans les 48h. Les tailles des images et formats publicités Facebook Les images publicitaires et les formats pub dans le flux Facebook Le flux Facebook, aussi appelé le fil d’actualités, présente les actualités et publications des ami(e)s, des pages, des groupes et des annonceurs. Les images publicitaires dans ce flux Facebook permettent d’attirer les visiteurs sur un site web ou une application avec un ou plusieurs visuels attrayants. Ce format est idéal si vous souhaitez présenter vos produits, vos services ou votre marque. Voici quelques recommandations dans la conception de vos visuels et de votre publicité sur le flux Facebook Un fichier au format JPG ou PNG Une résolution d’au moins 1200 x 628 pixels ou 1080 x 1080 pixels si vous intégrez un lien 125 caractères pour le texte principal, 40 caractères pour le titre et 30 caractères pour la description. Taille de fichier maximale : 30 Mo Les vidéos publicitaires dans le fil d’actualité Facebook Grâce au son et au mouvement d’une vidéo, présentez vos produits, vos services ou votre marque et attirez les internautes efficacement sur le fil d’actualités Facebook. Ce format publicitaire vous permet d’importer votre propre vidéo ou d’en créer une facilement grâce au gestionnaire de publicité et le kit de création vidéo proposé par le réseau social. Si vous souhaitez importer votre propre vidéo, nous vous conseillons d’éviter les bandes horizontales ou verticales sur votre vidéo. Voici les exigences de la plateforme pour vos vidéos publicitaires dans le flux Facebook : La plupart des types de fichiers vidéo peuvent être pris en charge. Nous vous recommandons toutefois d’utiliser une compression H.264. Format de la vidéo : 9:16 à 16:9; 4:5 pour les vidéos verticales Taille maximale du fichier : 4 Go Durée de la vidéo : de 1 seconde à 240 minutes. Nous vous conseillons de faire une vidéo courte d’environ 30 secondes. Texte principal : 125 caractères, titre : 25 caractères, description : 20 caractères Le format carrousel pour votre publicité sur Facebook La publicité Facebook carrousel est un format polyvalent qui permet d’afficher des images ou vidéos (entre 2 et 10) de plusieurs produits dans une seule publicité. L’utilisateur Facebook peut passer d’une diapositive à une autre et être redirigé vers une page de destination comme votre site internet par exemple (l’URL est obligatoire). Chaque image peut avoir son propre lien. Voici des recommandations pour les visuels de vos carrousels Facebook : Type de Fichier : JPG ou PNG pour vos images Taille maximum du fichier : 30 Mo pour les images et 4 Go pour les vidéos Format de l’image : 1080 x 1080 pixels Durée maximum de la vidéo : 240 minutes Titre : 25 caractères, description : 20 caractères, texte principal : 125 caractères La publicité Facebook et les formats pub sur la colonne de droite Facebook propose un emplacement pour vos publicités sur la colonne de droite. Un format qui est uniquement affiché sur les ordinateurs. Avec ce format visuel vous pouvez présenter vos produits, vos services ou votre marque avec un visuel dynamique et attrayant. Les recommandations liées à ce format publicitaire sur Facebook : Type de fichier : JPG ou PNG Résolution de l’image d’au moins 1080 x 1080 pixels Taille minimale : 254 x 133 pixels Titre : 40 caractères En raison de la taille d’affichage, n’ajoutez pas de texte sur les images La publicité sur la Marketplace Facebook Connaissez-vous Facebook Marketplace ? Cette fonctionnalité mise en place par Facebook permet aux utilisateurs de Facebook d’acheter et de vendre des objets (sur le même principe que d’autres plateformes comme eBay par exemple). Ce format publicitaire sur la marketplace Facebook est placé stratégiquement au-dessus des personnes qui souhaitent acheter des choses, afin qu’elles soient plus attentives à votre publicité. Ce format publicitaire est idéal si vous souhaitez présenter vos produits de manière attrayante et encourager les internautes à obtenir plus d’informations et les acheter. Voici les exigences liées à ce format publicitaire sur la Marketplace Facebook : Format de l’image : JPG ou PNG Résolution du visuel d’au moins 1080 x 1080 pixels Recommandations sur le texte : titre : 40 caractères, description : 30 caractères, texte principal : 125 caractères Taille maximale du fichier : 30 Mo La publicité Facebook dans les Instant articles Sur Facebook les éditeurs de médias peuvent diffuser facilement et rapidement leurs articles auprès de leurs audiences avec les Instant Articles. Via des applications mobiles ou de messagerie, Instant Articles Facebook propose un format publicitaire optimisé pour les appareils mobiles. Les éditeurs approuvés ont la possibilité de choisir de placer ou non des publicités au sein de leurs Instant Articles. En choisissant ce format publicitaire, vous pourrez gagner en visibilité auprès des personnes de votre audience qui consulteront ces articles. Voici les recommandations de conception de vos visuels pour ce format publicitaire : Type de fichier : JPG ou PNG Format de l’image d’au moins 1080 x 1080 pixels Recommandations liées au texte : Texte principal de 125 caractères, Titre de 40 caractères et Description de 30 caractères Exigence technique liée à la taille du fichier : 30 Mo La publicité Facebook dans les stories Ce format publicitaire Facebook permet de donner de la vie aux entreprises avec un format immersif. Grâce aux stories, vous pourrez utiliser un mélange d’images fixes et de vidéos courtes. Avec ces publicités verticales en plein écran vous pourrez aussi ajouter des stickers, émojis ainsi que d’autres éléments créatifs. Ce format publicitaire apparait entre les stories Facebook organiques (non publicitaires). Voici quelques informations concernant ce format publicitaire : Les images sont visibles pendant 5 secondes, les vidéos quant à elles durent jusqu’à 15 secondes (jusqu’à ce que l’internaute fasse glisser la story). Gardez une zone de sécurité (1080x1420) pour le titre, nous vous conseillons donc de ne pas placer de texte ou de logo en bas et en haut (au risque qu’ils soient masqués par votre profil ou la description) Taille optimale : 1080x1920 dans un format JPG ou PNG pour les images et une compression H.264 pour les vidéos Concernant le contenu textuel : texte principal avec 125 caractères, titre avec 40 caractères Taille maximale pour l’image : 30 Mo, pour une vidéo : 4 Go Le format pub dans les collections Facebook Avec ce format publicitaire, incitez vos cibles à l’achat de vos produits ou services avec une présentation dynamique de ce que vous proposez. Les collections Facebook permettent de faciliter la découverte, la navigation et l’achat de vos produits et de vos services sur mobile. Les publicités des collections Facebook incluent généralement une image ou une vidéo de couverture suivie de plusieurs images de produits. Une vitrine instantanée à utiliser si vous disposez d’un catalogue comprenant au minimum quatre produits. Quelques renseignements techniques sur le format publicitaire des collections Facebook : Nombre de caractères pour le titre : 25 et pour le texte principal : 90 Taille recommandée du visuel : 600x600 pixels L’image ou la vidéo qui s’affiche en couverture correspond au premier élément média de votre Instant Experience. La publicité Facebook avec Messenger ads Ce format publicitaire permet de cibler ou de recibler des personnes qui ont déjà eu une conversation avec votre entreprise sur Messenger. Votre publicité sera affichée entre les conversations de l’internaute sur son écran d’accueil de l’application Messenger. Voici quelques exigences techniques concernant ce format publicitaire Messenger ads : Type de fichier : JPG ou PNG Résolution recommandée 1200 x 628 pixels (9:16 à 16:9) Texte principal de 125 caractères, titre : 25 caractères, description : 30 caractères Les tailles des images et formats publicités Instagram La publicité Instagram dans les stories Tout comme celles sur Facebook, les publicités dans les stories Instagram permettront à votre entreprise de lui donner vie en utilisant un format immersif avec des éléments créatifs comme des stickers, des émojis … Elles aussi apparaissent entre les stories Instagram organiques. Cet affichage vertical en plein écran peut être composé d’une vidéo ou d’une image fixe. Découvrez les informations techniques relatives à l’affichage des publicités dans les stories Instagram : Type de fichier : JPG ou PNG, concernant la vidéo nous vous recommandons la compression H.264. Durée d’affichage maximale de l’image : 5 secondes & durée maximale d’une vidéo : 120 secondes Format de l’image / vidéo optimal : 1080 x 1920 pixels (largeur minimale : 500 pixels) N’insérez pas de textes, de logos ou d’autres éléments créatifs importants en haut et en bas de votre visuel publicitaire. Nombre de caractères pour le texte principal : 125 caractères Taille de fichier maximale : 30 Mo Le format publicitaire Instagram dans le fil d’actualité et explorer Le fil Instagram comprend la liste des photos et vidéos d’annonceurs et des comptes où l’utilisateur est abonné. Ce fil constamment mis à jour, permet aux entreprises d’utiliser un ou plusieurs visuels pour présenter leurs produits ou services. Ce format publicitaire est le plus courant sur ce réseau social. Vous pouvez choisir un visuel vidéo, une image ou bien un carrousel d’images (jusqu’à 10 images). Explorer sur Instagram est un espace découverte où la plateforme propose à ses utilisateurs des contenus susceptibles de les intéresser (en fonction de leurs centres d’intérêts). Comme sur le fil Instagram, les entreprises peuvent aussi afficher des publicités entre les résultats organiques. Voici les exigences techniques liées à ces deux formats publicitaires sur le fil Instagram: Type de fichier d’image : JPG ou PNG Taille du visuel recommandée : 1080 x 1080 pixels (taille minimale 400 x 500 pixels) Recommandations liées au texte : texte principal : 125 caractères, titre : 40 caractères, nombre maximal de hashtags : 30 Taille maximale du fichier image : 30 Mo Durée de la vidéo de 1 seconde à 120 secondes (son facultatif) Les tailles des images et formats publicités LinkedIn Le format publicitaire Text ads sur LinkedIn Text ads correspond à un format de publicité textuelle qui apparait en haut de la page ou sur la colonne de droite du fil d’actualités LinkedIn. Ce format publicitaire a pour objectif d’augmenter la visibilité d’une entreprise auprès d’une audience cible en les dirigeant vers un site internet ou une landing page spécifique. Ce format est très simple à utiliser puisque ces seuls exigences sont les suivantes : Titre de 25 caractères Description de 75 caractères Une image au format de 100 x 100 pixels. Le format publicitaire dans le fil d’actualités LinkedIn Comme sur les réseaux sociaux précédents, il existe un fil d’actualités sur LinkedIn qui permet aux utilisateurs d’avoir les dernières actualités de leur réseau. Entre les publications organiques il est possible pour les entreprises d’afficher des formats publicitaires avec une seule image, une vidéo ou un carrousel d’images publicitaires. Voici quelques informations concernant ce format de publicité sur LinkedIn : Limitez le texte sur votre visuel Il est nécessaire d’indiquer un texte d’introduction qui correspond au texte de la publication Le texte de la publication est composé d’un titre et d’une description Le carrousel d’image permet d’insérer jusqu’à 10 images sur une seule publicité. Format pour les images : GIF, PNG ou JPG, pour les vidéos : MP4 La durée de la vidéo doit être entre 3 secondes et 30 minutes. Nous vous recommandons une durée de 15 secondes. Dimensions à privilégier : une largeur minimale de 480 pixels et maximale de 1080 pixels et une hauteur comprise entre 360 et 1080 pixels.(Nous vous recommandons la taille suivante : 1200 x 627 pixels) Taille du fichier pour la vidéo : entre 75 Ko et 200 Mo Les Dynamics ads sur LinkedIn Cet affichage publicitaire permet d’afficher une publicité dynamiquement selon le profil de la personne ciblée et de son activité sur son profil LinkedIn. Ce format est idéal pour les entreprises qui souhaitent diffuser des messages personnalisés et cibler plusieurs personnes en même temps. Il existe trois types de formats Dynamics ads : Follower ad : ce format est destiné à inciter les personnes ciblées à s’abonner à votre page entreprise en fonction des données présentent sur leurs profils. Spotlight ad : ici vous pourrez cibler automatiquement les personnes en fonction des données de leurs profils et les inviter à souscrire à vos services ou vos offres. Job ad : ce type de publicité permet de cibler automatiquement les personnes sur LinkedIn recherchant des offres d’emplois. Le format publicitaire des Sponsored InMail sur LinkedIn InMail correspond à l’interface de messagerie interne au réseau social LinkedIn. Il est possible pour les entreprises de diffuser de la publicité sur ce support avec le format Sponsored InMail. Ce format permet d’envoyer des messages personnalisés directement dans la messagerie LinkedIn de l’audience ciblée. Un format pertinent à utiliser si vous souhaitez booster les inscriptions à un évènement, générer des conversions par des offres ciblées ou encore promouvoir des contenus comme un livre blanc ou une infographie. Les tailles des images et formats publicités Pinterest Le format publicitaire standard et carrousel sur Pinterest La photo publicitaire est le format le plus courant sur le réseau social Pinterest. Celui-ci est affiché sur l’accueil du réseau social Pinterest, composé des contenus susceptibles d'intéresser l’internaute, et la page de recherche. Voici quelques renseignements sur les aspects techniques de votre visuel : Choisissez un format PNG ou JPG Taille maximale du fichier : 20 Mo Taille optimale de l’image : 1000 x 1500 pixels Vous pourrez saisir jusqu’à 100 caractères sur votre publicité. Selon les appareils, les 40 premiers caractères seront affichés sur la page d’accueil des utilisateurs Pinterest. Pour la description vous pouvez saisir jusqu’à 500 caractères. Lors de la consultation de l’épingle sur la page d’accueil ou la page de recherche seul l’image sera affichée. Nombre de visuels pour le carrousel : 2 à 5 images Le format vidéo pour vos publicités Pinterest Il est aussi possible pour les entreprises de faire des publicités au format vidéo sur Pinterest. Ce type de publicité qui est aussi affiché sur la page d’accueil et de recherche de Pinterest demande quelques exigences techniques : Type de fichier possible : MP4, MOV, M4V, H.264, H.265 Taille de fichier maximale : 2 Go Durée de la vidéo : 4 secondes à 15 minutes Privilégiez une vidéo au format carré ou vertical (2:3, 9:16) Vous pouvez saisir jusqu’à 100 caractères pour le titre (les 40 premiers seront affichés sur la page d’accueil), 500 caractères pour la description (non affichée sur la page d’accueil). Les collections pour vos publicités Pinterest Voici les caractéristiques à prendre en compte pour l’élaboration de vos publicités Pinterest avec le format collection : Création principale au format image statique et créations secondaires en PNG ou JPEG. MP4, MOV, H265 ou M4V pour les vidéos Taille maximale du fichier : 10 Mo pour les images et 2 Go pour les vidéos Nombre de créations : 1 principale et 3 créations secondaires minimum, 24 maximum. Le visuel doit être carré ou vertical (2:3). Si l’image utilise un autre rapport largeur / hauteur, celle-ci sera recentrée. Durée des vidéos : 4 secondes à 15 minutes Les tailles des images et formats publicités Twitter Le tweet, GIF et image sponsorisés sur Twitter Avec ce format publicitaire, touchez le plus grand nombre de personnes et engagez vos abonnés. Votre Tweet doit au maximum faire 280 caractères ou 257 si vous utilisez un lien (réduction de 23 caractères par lien). Vous avez la possibilité d’ajouter ou non une image à ce tweet sponsorisé. Voici les caractéristiques techniques de l’image : Largeur minimale : 600 pixels. Nous vous recommandons d’utiliser des grandes images avec 1200 pixels pour la largeur par exemple. La hauteur ne doit pas être supérieure à la largeur, l’image sera sinon ramenée au format carré. Format de l’image : PNG, JPG ou GIF Le format publicitaire de la question sponsorisée sur Twitter Engagez votre audience et obtenez de précieuses informations en ajoutant des questions interactives à vos publicités. Vous avez la possibilité avec ce format de sponsoriser une question avec uniquement du texte, une image ou une vidéo. Voici les exigences liées à ce format : Vous pouvez ajouter 2 à 4 réponses personnalisées Pour chaque réponse vous pouvez saisir 25 caractères La durée de la question sponsorisée : de 5 minutes à 7 jours Les GIF ne sont pas pour le moment pris en charge pour le format des questions sponsorisées La vidéo sponsorisée pour votre publicité sur Twitter Avec ce format publicitaire Twitter, développez le storytelling de votre marque dans le fil d’actualités. La vidéo sponsorisée est le format publicitaire qui a le plus fait ses preuves sur le réseau social Twitter. Les vidéos sponsorisées sont lues automatiquement dans le fil d’un utilisateur Twitter, si sa durée est inférieure à 60 secondes elle sera d’ailleurs lue en boucle. Voici les exigences techniques liées à la vidéo : Taille du fichier vidéo : 1 Go maximum Durée de la vidéo recommandée : 15 secondes ou moins Durée maximum 2 minutes et 20 secondes Type de fichier : MP4 ou MOV Taille recommandée pour la vidéo : 1200 x 1200 pixels (1:1 ou 9:16) Quelques bonnes pratiques pour vos publicités sur les réseaux sociaux Vous souhaitez utiliser la vidéo pour vos publicités ? Nous vous recommandons d’intégrer des sous-titres à vos vidéos. En effet, la majorité des internautes sont sur mobile et n’ont pas le son d’activé. L’utilisation des sous-titres pour vos vidéos permettra à vos cibles de mieux comprendre votre message lorsqu’ils ont le son désactivé et de capter leur attention. Les réseaux sociaux privilégient l’expérience utilisateur, ne placez donc pas trop de texte dans votre visuel et soyez concis. Un visuel sans texte produit plus d’impact. Montrez des personnes utilisant vos produits pour vos visuels publicitaires. Cela favorisera l’identification et l’attractivité de votre publicité. Si vous créez un ensemble de publicité dans une seule campagne, conservez une cohérence visuelle. Grâce à cela vos cibles pourront plus facilement vous reconnaitre. N’hésitez pas à offrir une expérience à vos utilisateurs avec les panoramas, les photos ou vidéos 360. Une expérience interactive pour vos publicités qui peut être utilisée sur le réseau social Facebook par exemple. Grâce à cet article vous avez désormais toutes les informations techniques pour réaliser correctement vos visuels publicitaires à destination des réseaux sociaux. Nos autres articles 08.07.2025 Création de site & UX/UI Loi sur l'accessibilité numérique : ce qui change depuis le 28 juin 2025 25.06.2025 Création de site & UX/UI Étude de cas : Accompagner la transformation digitale d'une PME industrielle 18.06.2025 Création de site & UX/UI Comment réaliser un catalogue raisonné en ligne d'un artiste sous la forme d’une WebApp JavaScript ? Et si on échangeait sur votre projet de site e-commerce s i t e e - c o m m e r c e Contacter notre équipe Contact Télephone : 02 97 69 07 43 Du lundi au vendredi de 9h à 13h et de 14h à 18h ID Interactive Parc d'activités Doaren Molac, n°14 56610 ARRADON (Vannes - Morbihan - Bretagne) Ressources Nos solutions par métiers Programme partenaire Informations Plan du site Données personnelles Gestion des cookies Mentions légales Conformité RGAA Facebook Linkedin Instagram"
    },
    {
      "url": "https://www.thepunteroxford.co.uk/contactus",
      "text": "Contact Us — The Punter Pub Oxford 0 Skip to Content Home Menu & Wine BOOK A TABLE Open Menu Close Menu Home Menu & Wine BOOK A TABLE Open Menu Close Menu Home Menu & Wine BOOK A TABLE How To Get In Touch With Us For parties of six or more, we recommend making reservation with us, and although we do our best to answer the phones during our busy service hours - we ask that you send us an email detailing your enquiry and we will get back to you at the earliest opportunity. Alternatively for walk-ins, we seat parties on a first come, first served basis, and will always do our best to find you a table. For enquiries please send us a message via the email link below: reservations@thepunteroxford.co.uk Sometimes some email clients don’t like the link we’ve provided above so if your having problems emailing us ? Don’t worry. Just give us a call on: 01865 248832 We look forward to hearing from you ! The Punter Oxford  | 7 South Street | OX2 0BE reservations@thepunteroxford.co.uk | 01865 248832 The Bar Sunday–Thursday 12pm–10:30pm Friday–Saturday 12pm–11pm The Kitchen Monday–Friday 12pm–2.30pm & 5:30pm–8:30pm Saturday & Sunday 12pm–8.30pm"
    },
    {
      "url": "https://www.edma.gov.sg/ContactUs.aspx",
      "text": "NEA | Contact Us Emissions Data Monitoring and Analysis System > Contact Us Contact Us Have a question? If you need to get in touch with us, you can call us from Monday - Friday : 8:30 am - 5:30 pm. Alternatively, you may email to the respective departments and we'll reply to you shortly. Skip to main I would like to enquire on: Energy Conservation Act For enquiries or feedback on matters relating to the ECA: Industry Sector Please contact the Energy Efficiency Promotion Centre (EEPC) at nea_eepc@nea.gov.sg . Alternatively, you may contact the ECA account officer for further clarification. You may also visit the EEPC website at https://www.nea.gov.sg/our-services/climate-change-energy-efficiency/energy-efficiency/industrial-sector/mandatory-energy-management-practices-for-existing-industrial-facilities for more information. Transport Sector Please contact your relevant agency. CAAS CHEE_Enqing@caas.gov.sg or Ivan_HO@caas.gov.sg LTA Samson_HAN@lta.gov.sg or Terence_KOAH@lta.gov.sg MPA KOH_Cheok_Chye@mpa.gov.sg or Julia_ZHU@mpa.gov.sg For enquires or feedback on matters relating to the EEOA: For matters related to EEOA NV and EEOA RC, please contact Verification Office (VO) at NEA_VO@nea.gov.sg . You may also visit the following websites for more information: EEOA NV website ( https://go.gov.sg/eeoa-nv ) EEOA RC website ( https://go.gov.sg/eeoa-rc ) Water Efficiency Management Plan For enquiries or feedback on matters relating to\r\n                    the Water Efficiency Management Practices under the Public Utilities (Water Supply)\r\n                    Regulations: Industry Sector Please contact the relevant officer for your sub sector. Sub Sector Officer Email Contact Number Air Conditioning Supply, Electronics, Precision Engineering, Wafer Fabrication Ms. Phuong Hanh Phuong_Hanh_NGUYEN@pub.gov.sg 6380 9860 Biomedical Manufacturing, Food Manufacturing, Poultry, Semiconductors Ms. Kadie Tan Kadie_TAN@pub.gov.sg 6380 9860 Printing, Power Generation, Manufacturing (Others), Waste Management Mr. Tan Yew Jin Tan_yew_jin@pub.gov.sg 6380 9862 Chemicals, Petrochemicals, Refineries, Water Management Mr. Neo Teck Heng Neo_teck_heng@pub.gov.sg 6380 9861 Aerospace, Laundry, Transport Engineering Mr. Aron Loh Aron_LOH@pub.gov.sg 6380 9864 Non-Industry Sector Please contact the relevant officer for your sub sector. Sub Sector Officer Email Contact Number Data Centre Ms. Kadie Tan Kadie_TAN@pub.gov.sg 6380 9860 Country Club, Concrete Batching Plant, Dormitory, Government (Office), Government (Sports & Recreation), Government Premises, Hotel, Hospital, Industrial Building, Institution/School, Mixed Development, Office, Sports & Recreation (Non-Government), Meetings, Incentives, Conferencing and Exhibitions, Retail, Warehouse, Place of Interest, Religious, Others Mr. Hashim Bin Abdul Majid Hashim_abdul_majid@pub.gov.sg 6380 9863 Ms. Yeo Yan Ling YEO_Yan_Ling@pub.gov.sg 6380 9894 Transport Sector Please contact the relevant officer for your sub sector. Sub Sector Officer Email Contact Number Airport Ms. Kadie Tan Kadie_TAN@pub.gov.sg 6380 9860 Land, Sea Mr. Aron Loh Aron_LOH@pub.gov.sg 6380 9864 You may also visit PUB’s website at https://www.pub.gov.sg/savewater/atwork/managementplan for\r\n                    more information. Carbon Pricing Act For enquiries or feedback on matters relating to Carbon Pricing Act: For detailed information and contact details on Measurement and Reporting of GHG Emissions, please visit the NEA website at https://www.nea.gov.sg/our-services/climate-change-energy-efficiency/climate-change/carbon-tax/measurement-and-reporting-requirements-for-greenhouse-gas-emissions . Please contact the following officer for matters relating to Notice of Assessment and Carbon Credit Registry. Officer Email Contact Number Mr Patrick Lim Patrick_lim@nea.gov.sg 6731 9047 SO2 Emissions Reporting For enquiries or feedback on matters relating to SO2 Emissions Reporting: Please contact the following NEA-PCD officers should you need any clarification on non-technical issues. Officer Email Ms Fareena Abdul Rahim Fareena_ABDUL_RAHIM@nea.gov.sg Mr Effendy Samat Effendy_SAMAT@nea.gov.sg Mr Hafiz Mohd Noor Hafiz_Mohd_Noor@nea.gov.sg Mr Carl Loh Carl_LOH@nea.gov.sg Mr Haja Haja_MOHIUNUDDIN@nea.gov.sg Report Vulnerability Privacy Statement Term of Use Rate this Service This site is most compatible with Google Chrome version 79 and above, and Microsoft Edge Chromium Version 85. Please disable pop-up blocker for site access. © 2025, Government of Singapore"
    },
    {
      "url": "https://www.pubpeople.com/who-we-are",
      "text": "Who we are - The Pub People Company We are excited to announce the re-opening of the Hand & Heart in Nottingham following a major refurbishment! We are proud to announce the completion of the £1.6m refurbishment of The Dukeries Lodge in Edwinstowe We have completed the acquisition of our latest freehold - the Cross Keys in Belper - significant investment to follow Work with us Application Form Run your own pub Operations & Support Training Pub Vacancies Who we are ESG Investments in our pubs Who we work with Our Pubs Selling Your Pub Get in touch Giving Feedback Work with us Application Form Run your own pub Operations & Support Training Pub Vacancies Who we are ESG Investments in our pubs Who we work with Our Pubs Selling Your Pub Get in touch Giving Feedback The Pub People Company owns and operates pubs in the East Midlands The Pub People Company have been operating pubs in the East Midlands since 1993. All of our pubs are run by people who are self employed and want the support of a head office and business development function. Our pubs are established and are well invested to compete effectively in their local markets. Where we can, local microbrewers and food suppliers are used extensively. We have pubs in city centres, canal side locations but most often in local communities and neighbourhoods Pub People was Established over 30 years Ago The Company was formed in 1993, changing its name to Pub People in 1999. Initially the business focused on temporary holding contracts. This developed into permanent leases, some of which were then purchased as freeholds. Significantly, the originators invested into the Company infrastructure which enabled the growth to be steady and controlled, taking advantage of opportunities but also able to weather harder times such as the smoking ban, the financial crisis of 2008 and more recently COVID 19. Since the pandemic the ownership of Pub People has changed with the private equity firm, Downing, buying a majority share. This has resulted in a rapid growth phase as a number of new freehold pubs have been identified for acquisition and further investment is earmarked to exploit potential within the existing estate. Our Values Safe and friendly We are passionately committed to providing a safe and friendly work place for all head office and pub based staff, where they feel challenged but empowered to “do the right thing” for the Company. We would like all our customers to experience a safe, friendly and time in our pubs enjoying consistently high quality food and drink at a fair price,  in surroundings that are maintained to the best standards. Our suppliers In terms of our suppliers, we value them highly and want to develop long term sustainable relationships based upon a negotiated price – quality – service ratio Optimize profit Our business ethos seeks to optimize profit and manage finances professionally and accurately alongside compliance with the law at all levels Whilst sometimes we don't get it right, it is very important to us that our customers, our staff and our suppliers are treated in a courteous and friendly manner in every situation. Like many things we were told along time ago, the old adage “the customer is always right” rings hollow today. The relationship between the pub staff, customers and others who come into contact with the pub from time to time can be very fluid and fast moving. Whilst It is important that difficult and volatile situations are handled with care and sensitivity. We want all our customers to feel welcome in the pubs and appreciate the friendly atmosphere everyone is challenged to generate. We will respond to and investigate comments and correspondence about individual pubs in an honest way. Where there are shortcomings on our behalf then we will be generous with our apology and compensation.  If our we feel our teams at the pub need our support, then it is important that we are seen to back them up. Meet the Team Julie Centracchio Chief Financial Officer Andrew Crawford Managing Director Dave McKie Operations Director Vast Experience within a Small Organisation Quite simply, if you have experience in running pubs, we will make you better. If you have never operated a pub, we will teach you how! At the Pub People, you will be able to use your own ideas and thoughts to make your pub the best around. We will support you through our infrastructure and look to develop your pub over a long period of years so that it becomes an established local business, you can be proud of. Get in touch Fill in the form and our team will be in touch Notice: JavaScript is required for this content. martin.cartwright@pubpeople.com 01773 510863 Terms & Conditions Cookie Policy Privacy Policy 15 Maisies Way, South Normanton, Alfreton, Derbyshire, DE55 2DS © 2025 The Pub People Company"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * Surname E-Mail Datenschutz E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.pubpeople.com/contact-us",
      "text": "Contact us - The Pub People Company We are excited to announce the re-opening of the Hand & Heart in Nottingham following a major refurbishment! We are proud to announce the completion of the £1.6m refurbishment of The Dukeries Lodge in Edwinstowe We have completed the acquisition of our latest freehold - the Cross Keys in Belper - significant investment to follow Work with us Application Form Run your own pub Operations & Support Training Pub Vacancies Who we are ESG Investments in our pubs Who we work with Our Pubs Selling Your Pub Get in touch Giving Feedback Work with us Application Form Run your own pub Operations & Support Training Pub Vacancies Who we are ESG Investments in our pubs Who we work with Our Pubs Selling Your Pub Get in touch Giving Feedback Key Contact Numbers and Emails Make contact direct in the following ways: Tel: 01773 510863 Email: martin.cartwright@pubpeople.com Get in touch Fill in the form below and our team will be in touch as soon as possible. Notice: JavaScript is required for this content. Give us a call 01773 510863 Need to visit? 5 Maisies Way, South Normanton, Alfreton DE55 2DS Email our team martin.cartwright@pubpeople.com Connect with us Follow on Instagram thepubpeople martin.cartwright@pubpeople.com 01773 510863 Terms & Conditions Cookie Policy Privacy Policy 15 Maisies Way, South Normanton, Alfreton, Derbyshire, DE55 2DS © 2025 The Pub People Company"
    }
  ]
}