{
  "fuentes": [
    {
      "url": "https://pkstaug.com/about-us/",
      "email": "shannonsmith@pkstaug.com"
    },
    {
      "url": "https://www.wickes.co.uk/contactus?msockid=13fa7485074167fa0b0a629c0638669b",
      "email": "complaint.info@financial-ombudsman.org.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus?msockid=13fa7485074167fa0b0a629c0638669b",
      "email": "customer.relations@wickes.co.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus?msockid=13fa7485074167fa0b0a629c0638669b",
      "email": "wickes@clarioncomms.co.uk"
    },
    {
      "url": "https://casago.com/st-augustine/restaurants/prohibition-kitchen/",
      "email": "info@pkstaug.com"
    },
    {
      "url": "https://www.yahoo.com/lifestyle/prohibition-grille-doing-kitchen-nightmares-134500557.html",
      "email": "u003ebillhimself@yahoo.com"
    },
    {
      "url": "https://www.tampabay.com/life-culture/food/2021/03/10/prohibition-kitchen-and-tap-opens-in-dunedin/",
      "email": "hfreund@tampabay.com"
    },
    {
      "url": "https://www.pkstaug.com/about-us/private-occasions/",
      "email": "occasions@rrstaug.com"
    },
    {
      "url": "https://www.caltekappliancerepair.com/contact",
      "email": "service@caltekappliance.com"
    },
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "email": "info@theeddyskitchen.com"
    },
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "email": "info@theeddyskitchen.com"
    },
    {
      "url": "https://www.pghschools.org/staff/staff/staff-home",
      "email": "epugh1@pghschools.org"
    },
    {
      "url": "https://www.pghschools.org/staff/staff/staff-home",
      "email": "user@pghschools.org"
    },
    {
      "url": "https://www.pkstaug.com/contact-us/",
      "email": "info@pkstaug.com"
    },
    {
      "url": "https://prohibitioncorpus.com/about-us",
      "email": "help@prohibitioncorpus.com"
    }
  ],
  "mails": [
    "complaint.info@financial-ombudsman.org.uk",
    "customer.relations@wickes.co.uk",
    "epugh1@pghschools.org",
    "help@prohibitioncorpus.com",
    "hfreund@tampabay.com",
    "info@pkstaug.com",
    "info@theeddyskitchen.com",
    "occasions@rrstaug.com",
    "service@caltekappliance.com",
    "shannonsmith@pkstaug.com",
    "u003ebillhimself@yahoo.com",
    "user@pghschools.org",
    "wickes@clarioncomms.co.uk"
  ],
  "nombre_sitio": "pkstaug.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://pkstaug.com/about-us/",
      "text": "About Us – Prohibition Kitchen Scroll Top 119 St George St, St. Augustine, FL 32084 (904) 209-5704 Social-facebook Instagram Menu Close Our Menus Food Menu Drink Menu Music Calendar Shop Gallery About Us Private Occasions Press Contact Us Our Menus Food Menu Drink Menu Music Calendar Shop Gallery About Us Private Occasions Press Contact Us VISIT US our history about us st. george street • st. augustine, forida welcome! Deep in the heart of America’s oldest city , a vintage gastropub and lounge has been born.  Invoking the spirit of Bartolo, who on this very spot created “Genovar Theater”, the social epicenter of Flagler’s prohibition era… we offer you an escape into the clandestine, mysterious, and yes, illegal world of flapper dresses, speakeasies, moonshine, and swing.  Sashay in and let your senses be seduced.  Our Chef’s seasonally inspired techniques using local ingredients put the exclamation point on your rendezvous back in time… experience the Prohibition Kitchen. view our menus traditions Our restaurant Prohibition Kitchen is serving up music and style on St. George Street. This 1920s and Prohibition-era themed pub offers generous portions of locally-sourced bar food, craft cocktails, and live music every night. Prohibition Kitchen’s two-level seating area is outfitted in a vintage industrial style. Restaurant-goers may dine on the first floor in intimate booths for speakeasy vibes, or enjoy a meal on the balcony level overlooking the stage and bar area. Boasting the longest bar in the city, Prohibition Kitchen is an ode to fellowship and booze. The building has been artfully renovated using reclaimed materials from the original colonial structure, like the 400-year-old heart of pine ceiling boards, which were used to create the bar and booth tables at Prohibition Kitchen. meet the team At Prohibition Kitchen, we believe that the key to a truly exceptional dining experience lies in the hands and hearts of our dedicated and passionate team members. Our restaurant is not just a place to savor exquisite cuisine; it’s a haven where you can connect with the talented individuals who craft, serve, and elevate your culinary journey. Shannon Smith General Manager EMAIL shannon Elly Bar Manager EMAIL Elly Serving unique dishes with stylish cocktails and craft beer while hosting live music. OUR MENUS | MUSIC CALENDAR | SHOP | GALLERY | ABOUT PRIVATE OCCASIONS | PRESS | CONTACT US 119 ST GEORGE ST. ST. AUGUSTINE, FL 32084 DINNER HOURS: MON – SUN: 11:00AM – 10:00PM LATE NIGHT MENU: FRI – SAT: 10:00PM – 1:00AM explore our sister companies 2023 © Copyrights Prohibition Kitchen | Managed by Meerkat Media Group – Portfolio Rights By Copyright."
    },
    {
      "url": "https://www.wickes.co.uk/contactus?msockid=13fa7485074167fa0b0a629c0638669b",
      "text": "Get In Touch | Wickes.co.uk Online 0 Rapid Delivery within 3 hours* Skip to content Skip to navigation menu Sign-in / Register Track my order Project list Wickes Wickes Ideas & Advice Store Locator Basket Basket 0 Basket Basket 0 back to top Kitchens Wickes Bespoke Kitchens View all Ranges Kitchen Offers Kitchen Brochure Kitchen Finance View all Wickes Bespoke Kitchens Wickes Lifestyle Kitchens Shaker Kitchen Slab Kitchen J-pull Kitchen Kitchen Samples View More View all Wickes Lifestyle Kitchens Cabinets Kitchen Units Appliance Doors Decorative Panels Plinths & Cornices View More View all Cabinets Worktops & Upstands Laminate Worktops Solid Wood Worktops Splashbacks Upstands View all Worktops & Upstands Taps All Kitchen Taps Kitchen Mixer Taps Kitchen Monobloc Taps Boiling Water Taps View all Taps Sinks All Kitchen Sinks Ceramic Sinks Granite & Composite Sinks Stainless Steel Sinks View More View all Sinks Home Office Fitted Home Office Fitted Home Workspaces Home Office Design & Installation View all Home Office Accessories Cabinet Handles & Knobs Kitchen Lighting Kitchen Paint Kitchen Radiators View More View all Accessories Appliances Ovens Hobs Cooker Hoods Fridges & Freezers View More View all Appliances Design & Installation Kitchen Design & Installation Kitchen Ideas & Advice Tiling Ideas & Advice Flooring Ideas & Advice View all Design & Installation Bathrooms Wickes Bespoke Bathrooms View all Suites Bathroom Offers Book a Free Design Appointment Bathroom Finance View More View all Wickes Bespoke Bathrooms Bathroom Suites Cairo Scandi Miami Bathrooms Brochure View More View all Bathroom Suites Showers & Enclosures Showers Shower Accessories Shower Enclosures Shower Panels View More View all Showers & Enclosures Baths & Accessories All Baths Bath Panels Shower Baths Straight Baths View all Baths & Accessories Basins All Basins Cloakroom Basins Vanity Units Pedestal Basins View all Basins Furniture & Cabinets Cabinets & Storage Fitted Bathroom Furniture Modular Bathroom Furniture Vanity Units View all Furniture & Cabinets Toilets & Accessories All Toilets Back to Wall Toilets Toilet Seats Toilet Units View all Toilets & Accessories Taps All Bathroom Taps Bath Taps Basin Taps Tap Washers & Repairs View all Taps Accessories Bathroom Mirrors Bathroom Tiles Toilet Seats Towel Radiators View all Accessories Design & Installation Bathroom Design & Installation Bathroom Ideas & Advice Tiling Ideas & Advice Flooring Ideas & Advice View all Design & Installation Gardens & Landscaping Fencing & Gates Fence Panels Fence Posts Fencing Accessories Gates & Metal Railings View More View all Fencing & Gates Garden Maintenance Compost, Topsoil & Bark Lawn Seed & Feeds Compost Bins & Buckets Weed Membrane View More View all Garden Maintenance Garden Decor Trellis & Screening Sleepers & Raised Beds Edging & Logrolls Garden Planters View More View all Garden Decor Garden Tools Leaf Blowers Grass & Hedge Trimmers Garden Power Tools Garden Hand Tools View More View all Garden Tools Sheds Wooden Sheds Plastic Sheds Storage Boxes Greenhouses View More View all Sheds Paving & Walling Paving Slabs Block Paving Outdoor Tiles Wall Bricks View More View all Paving & Walling Decking Timber Deckboards Decking Joists & Supports Composite Decking Decking Tiles View More View all Decking Garden Watering Hose Pipes Water Butts Pressure Washers Watering Accessories View More View all Garden Watering Garden Supplies Plant Food Weedkiller Growing Accessories Weeding & Clearing View More View all Garden Supplies Garden Autumn Essentials Garden Tidy Firewood & Firelighters Patio Heaters Garden Furniture & BBQ Covers View More View all Garden Autumn Essentials Building Materials Timber Treated Sawn Planed Square Edge Treated Sawn C16 CLS Studwork View More View all Timber Sheet Materials Plywood Sheets MDF Sheets OSB Sheets Loft Boards View More View all Sheet Materials Cement & Aggregates Ballast & Sub Base Cement Sand Gravel View More View all Cement & Aggregates Plaster & Plasterboard Plasterboard Plaster Coving Plastering Adhesives View More View all Plaster & Plasterboard Insulation Loft Insulation Insulation Board Cavity Wall Insulation Insulation Foil View More View all Insulation Roofing PVC Corrugated Sheets Bitumen Sheets Roof Felt Roof Tiles View More View all Roofing Nails & Screws Screws Sealants Fixings Nails View More View all Nails & Screws Guttering & Drainage Round Line Guttering Square Line Guttering Soil Pipes & Fittings Channel Drainage View More View all Guttering & Drainage Bricks & Lintels Blocks Bricks Block Paving Concrete Lintels View More View all Bricks & Lintels Building Supplies Builders Metalwork Damp Proofing Protective Sheeting Fascias & Soffits View More View all Building Supplies Doors & Windows Internal Doors White Doors Oak Veneer Doors Pine Doors Glazed Internal Doors View More View all Internal Doors External Doors Front & Back Doors Exterior French Doors Bifold Patio Doors Garage Doors View More View all External Doors Hardware Door Handles Door Locks & Latches Door Hinges Door Knobs View More View all Hardware Windows uPVC Windows Roof Windows Velux Windows Window Security View More View all Windows Trending Internal Doors Cottage Internal Doors Black Internal Doors 1930s Internal Doors Grey Internal Doors View all Trending Internal Doors Window Accessories Window Sills Window Handles Curtain Poles Window Blinds View More View all Window Accessories Security Door Locks & Latches Door Bolts Padlocks Security Alarms View More View all Security Bedroom Furniture & Fitted Sliding Doors Sliding Wardrobe Doors Modular Wardrobes Click Fitted Furniture Bedroom Furniture View all Bedroom Furniture & Fitted Sliding Doors Fire Safety & Alarms Fire Doors Smoke Alarms Fire Door Hinges Carbon Monoxide Detectors View More View all Fire Safety & Alarms Conservatories Lean To Conservatories Edwardian Conservatories Solid roof Conservatories Victorian Conservatories View all Conservatories Flooring & Tiling Flooring by Type Laminate Flooring Luxury Vinyl Flooring Parquet & Herringbone Solid Wood Flooring View More View all Flooring by Type Laminate by Colour Grey Brown White Beige View More View all Laminate by Colour Flooring Accessories Underlay Skirting Boards Adhesives & Sealants Flooring Tools View More View all Flooring Accessories Price per m2 Flooring Offers Under £15m2 £15 to £20 per m2 £21 to £34 per m2 View all Price per m2 Flooring Samples Laminate Samples Luxury Vinyl Samples Engineered Wood Samples Solid Wood Samples View all Flooring Samples Tiles by Type Bathroom Tiles Kitchen Tiles Floor Tiles Wall Tiles View all Tiles by Type Tiles by Colour Grey White Mosaic Patterned View all Tiles by Colour Tile Accessories Tile Adhesives Tile Grout Tiling Tools Tile Trims View all Tile Accessories Tile Samples Ceramic Samples Porcelain Samples Boutique Samples View all Tile Samples Installation Services Tiling Ideas & Advice Tiling Services Flooring Ideas & Advice Flooring Services View all Installation Services Painting & Decorating Interior Paint Wall & Ceiling Paint Bathroom Paint Paint Mixing Kitchen Paint View More View all Interior Paint Brand Dulux Wickes Crown Cuprinol View More View all Brand Paint by Type Emulsion Trade Paint Metal Paint Undercoats & Primers View More View all Paint by Type Decorating Tools Paint Rollers & Trays Paint Brushes Dust Sheets Abrasive & Sanding Tools View More View all Decorating Tools Exterior Paint Masonry Paint Shed & Fence Paint Garden Furniture Paint Decking Paint View More View all Exterior Paint Wood Treatment Interior Wood Paint Varnish Wood Stain Wood Preservatives & Treatment View More View all Wood Treatment Wallpaper Bedroom & Living Room Wallpaper Decorative Wallpaper Lining Paper Wallpaper Paste & Tools View More View all Wallpaper Mouldings Wall Panelling Beading Architrave Decorative Mouldings View More View all Mouldings Shelving & Storage Storage Boxes Shelves Shelf Brackets Freestanding Shelves View More View all Shelving & Storage Samples Paint Visualiser Dulux Tester Pots Wickes Tester Pots Crown Tester Pots View More View all Samples Electrical & Lighting Interior Lights Ceiling Lights Downlights LED Tubes & Battens Spotlights View all Interior Lights Outdoor Lights Wall Lights Low Voltage Garden Lights Work Lights Security Lights View all Outdoor Lights Light Bulbs All Light Bulbs GU10 Light Bulbs Decorative Bulbs B22 Light Bulbs View all Light Bulbs Electrical Cable EV Charging Extension Leads Portable Heaters View all Electrical Switches & Sockets Dimmer Switches Indoor Sockets Indoor Switches Outdoor Switches & Sockets View all Switches & Sockets Smart Home Smart Appliances Smart Heating Smart Lighting Smart Security View all Smart Home Security & Alarms Home Security Alarms Safes & Key Safes Security Lights Safes View all Security & Alarms Portable Heating & Cooling Portable Heaters Smart Heaters Cooling Fans View all Portable Heating & Cooling Ventilation & Ducting Dehumidifiers Ducting, Vents & Airbricks Fans & Air Conditioning Extractor Fans View all Ventilation & Ducting Heating & Plumbing Plumbing Copper Pipes & Fittings Plastic Pipe & Fittings Plumbing Tools & Accessories Waste Pipes & Fittings View all Plumbing Radiators Designer Radiators Double Panel Radiators Single Panel Radiators Towel Radiators View More View all Radiators Central Heating Boilers & Boiler Packs Heating Controls Central Heating Treatment Smart Heating View all Central Heating Fires & Surrounds Coal & Logs Gas Fires Electric Fires Fire Suites View all Fires & Surrounds Portable Heating Portable Heaters Smart Heaters View all Portable Heating Tools & Workwear Power Tools Cordless Drills Power Saws Sanders Nail Guns View More View all Power Tools Hand Tools Brickworking Tools Hand Saws Plastering Tools Woodworking Tools View More View all Hand Tools Workwear & Safety Trousers & Shorts Footwear Work Gloves Dust Masks View More View all Workwear & Safety Power Tool Accessories Drill Bits Sanding Accessories Angle Grinder Discs Batteries & Chargers View More View all Power Tool Accessories Tool Storage Tool Storage Systems Tool Boxes Tool Bags Tool Chests View More View all Tool Storage Ladders & Platforms Step Ladders Extension Ladders Combination Ladders Loft Ladders View More View all Ladders & Platforms Construction & Landscaping Landscaping Tools Workbenches Wheelbarrows Cement Mixers View More View all Construction & Landscaping Cleaning Supplies Vacuum Cleaners Cleaning Tools Car & Window Cleaning Cleaning Fluids View More View all Cleaning Supplies Measuring Levelling Tools Spirit Levels Laser Measuring Tools Detectors Tape Measures View More View all Measuring Levelling Tools Equipment Motoring Hot Glue Guns Work Lights Generators View More View all Equipment Renewables & Energy Wickes Solar Why choose Wickes solar? Advantages of solar? Solar panel installation Book a free quote View all Wickes Solar Renewable Energy Products Solar Panels Air Source Heat Pumps EV Charging Stations View all Renewable Energy Products Energy Efficiency Energy Efficient Home Energy Ratings How To Improve Your Home’s EPC Rating Lighting View all Energy Efficiency Energy Saving Advice Insulation Heating Lighting Draught Proofing View all Energy Saving Advice Helpful Guides Solar PV Buying Guide Heat Pump Buying Guide How To Insulate A Loft Upcycling Furniture View all Helpful Guides Wickes Solar Solar Energy Advantages of solar View all Solar Energy Wickes Solar Why choose Wickes solar? Solar panel installation View all Wickes Solar Get a Free No Obligation Quote Solar finance Solar Panel Price Estimator View all Get a Free No Obligation Quote Help & Advice How do solar panels work? Solar energy- advantages & disadvantages Solar panel myth busting View all Help & Advice Offers The Big Event The Big Timber Event The Big Tiles Event The Big Flooring Event The Big Doors Event View all The Big Event Latest Offers The Big Kitchens Event The Big Loft Event The Big Gardens Event Building Materials Offers View More View all Latest Offers Clearance Tiles Kitchens Bathrooms Gardens View all Clearance Log In / Register Track Order Ideas & Advice Project list Home Get In Touch Get In Touch - We're Here to Help Whether you’re interested in a new Kitchen or Bathroom, want to talk about products, need help with an order or anything in between we’re here to help. Please choose which drop down option accurately describes your query and use the contact details set out within the drop down box or complete the Contact form below. Track your order Use our handy tool to see the status of your order. You can track its location whilst it is on its way to you - with or without a Wickes account. To track your Wickes kitchen, bathroom or home office order, please complete our contact form; selecting 'Kitchen & bathroom'. Scroll down, it's just below. With our handy order tracking tool you can see: The date your order will be delivered The delivery carrier Where each part of your order will be delivered from When your Click & Collect order is ready to collect from your local store We're unable to offer live order tracking just yet, but we'll send you a text the day before your delivery with further details on when you can expect your order to arrive. Contact our customer service team When getting in touch with us, we need to confirm we’re talking to the right person. We’ll ask you a few questions to confirm you’re the person that paid for the order. If you’d like someone else to speak on your behalf, please ensure they’ve all the information necessary to pass our required Data Protection checks. Any conversation about order amendments, including refund requests, must be with the person that paid for the order. We are open: Monday - Saturday: 8am - 6pm Sunday: 10am - 5pm Here's some hints to help you choose the best way to contact us for your enquiry: Complete our Contact Form, scroll down, it's just below. We aim to respond to all enquiries within 48 hours. If you've received a damaged delivery or a faulty product, we'll ask you to email us some photos Use Live Chat - click ‘Chat’ on the bottom right of this page If you're unsure about what you've ordered If you've a question about our stock If you're asking about a delivery that's due today You can also call us on 0330 123 4123 If there's a queue you'll be given the option to ask for a call back. We’ll call you back when it's your turn. Contact our designed kitchen and bathroom team Wickes kitchen, bathroom or home office enquiries For enquiries about a Wickes kitchen, bathroom or home office order, please complete our contact form; selecting 'Kitchen & bathroom' as your reason for contacting us. Scroll down, it's just below. If you’d like to talk, call us on 0344 892 2721 . If you’d prefer to use Live Chat - click ‘Chat’ on the bottom right of this page. When getting in touch with us, we need to confirm we’re talking to the right person. We’ll ask you a few questions to confirm you’re the person that paid for the order. If you’d like someone else to speak on your behalf, please ensure they’ve all the information necessary to pass our required Data Protection checks. Any conversation about order amendments, including refund requests, must be with the person that paid for the order. We’re open: Monday - Friday 8am - 6pm Saturday - 8am - 4pm To book a design appointment Whether you're looking for a new kitchen, bathroom or home office; our Design Consultants have the knowledge and expertise to help you plan your space perfectly. Complete our online form Call us on: 0800 011 3031 We’re open: Monday - Friday: 9am - 8pm Saturday & Sunday: 9am - 5:30pm Community programme and charity requests We support charities and local communities in two ways: Nationally, we’re proud to be supporting The Brain Tumour Charity as our corporate charity partner.  This means we’re unable to offer monetary support to other causes. Locally, we support  the community through our Wickes Community Programme by providing products to help local charities and not for profit community groups. To apply for a product donation just head in to your local store and speak to the manager. Terms and conditions Press and media Please contact the press office at Clarion Communications on (0)20 7479 0910 or email wickes@clarioncomms.co.uk . Please note, these contact details are for media enquiries only. Complaints Our Commitment We’re dedicated to providing a professional and valued service to our customers and partners. We strive to handle customer complaints promptly and fairly. Contacting Us If you're unhappy with something, the fastest way to reach us is through our online chat service. If you'd prefer to talk, call us at 0330 123 4123 : Choose option 1 for a Wickes kitchen, bathroom or home office complaint. Choose option 3 for all other complaints. To escalate your concern, use the contact form below. Select the relevant order type and choose \"Something went wrong and I want to raise a complaint.\" We will acknowledge your complaint within 48 hours and forward it to the appropriate team. Further information might be needed to fully investigate your complaint. Alternatively, you can write to us at our registered address: Complaints Team Wickes Building Supplies Limited Vision House 19 Colonial Way Watford WD24 4JL To help us respond to you as quickly as possible, please include: Your name and address A contact phone number and email Your order number Details of your complaint with supporting photos Actions you’d like us to consider In the event that the customer services team is unable to resolve your complaint, or if you’re unhappy with the outcome, you can escalate your complaint by emailing customer.relations@wickes.co.uk , who will acknowledge your complaint within 48 hours and send it to the appropriate team. Resolution We aim to resolve your complaint at the first point of contact. Once the investigation is complete, you will be informed of the outcome. If you remain unhappy with the outcome, you can refer the decision to The Furniture and Home Improvement Ombudsman . They will review your case and may request further information from you or from us. Their decision will be binding upon us. For more information, visit fhio.org . Complaints relating to financial agreements If your complaint relates to the lender, it will be forwarded to them within five days of receipt. We will inform you once it has been sent. If the complaint is partially about the lender's actions, that part will be sent to the lender to investigate, while we will investigate the part related to the sale of the financial product and service. We will conduct a thorough and independent investigation and agree on a suitable outcome with you. Once our investigation is complete, we will inform you of the outcome. If you’re unhappy with the outcome, you can refer your complaint to the Financial Ombudsman Service . They can be contacted at: Phone: 0800 023 4567 Email: complaint.info@financial-ombudsman.org.uk Mail: Financial Ombudsman Service, Exchange Tower, London E14 9SR Contact form Required Field Reason for contacting us Order & support enquiries How can we help? To place a new order To cancel my order and request a refund Was your order placed online or in store? Online Store Product or stock availability information Order delivery or collection To view or track the status of your order, click here . Was your order placed online or in store? Online Store Select one of the below to provide more detail about your query Enquiry about my delivery Enquiry about my click & collect order My delivery is late My delivery has failed My delivery had items missing, damaged, or an incorrect quantity Please select an option To make a product guarantee claim What is the reason for your claim? Damaged product Product fault I have an enquiry not related to a specific order Something went wrong and I want to raise a complaint Wickes installed project How can we help? Make an existing order enquiry Does your order include a premium solid surface worktop? Yes No Book or amend a delivery date Does your order include a premium solid surface worktop? Yes No Make a product guarantee claim Does your order include a premium solid surface worktop? Yes No What is the reason for your claim? Damaged product Product fault Make an Installation workmanship guarantee claim Does your order include a premium solid surface worktop? Yes No Something went wrong and I want to raise a complaint Bespoke kitchens & bathrooms How can we help? Make an existing order enquiry Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No Book or amend a delivery date Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No Make a product guarantee claim Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No What is the reason for your claim? Damaged product Product fault Something went wrong and I want to raise a complaint Personal information First Name Last Name Email Phone Number Postcode Additional information Please help us to resolve your enquiry as quickly as possible by providing us with photos of the product showing any visible damage or fault, your order number (if known) and any other relevant details in the fields available. Order Number Attachments Add image or document Enquiry max 2500 characters ( 2500 characters left ) Sorry, something has gone wrong when trying to send your form. Please try submitting your form again or contact our customer service team on 0330 123 4123. Submit Please enter a valid email address Thank you for signing up for emails Ways to Pay About Wickes Careers at Wickes Company History Community Programme Responsible Business CALM Wickes Corporate PLC Help & Support Get In Touch Store Locator Accessibility Rate & Review FAQs Share Your Feedback Sitemap Our Policies Returns & Refunds Security Online Modern Slavery Corporate Governance Privacy Policy Cookie Policy Your cookie settings Terms & Conditions Our Services Payments Track My Order Delivery Information Click & Collect TradePro Membership Free Design Appointment Copyright © 2025 Wickes.co.uk Wickes Building Supplies Limited, Vision House, 19 Colonial Way, Watford, WD24 4JL Company Registration No. 1840419 VAT No. 336725881"
    },
    {
      "url": "https://casago.com/st-augustine/restaurants/prohibition-kitchen/",
      "text": "Prohibition Kitchen - Casago St. Augustine Casago St. Augustine Vacation Rentals Property Management Things To Do Events Franchise Casago St. Augustine Restaurants Prohibition Kitchen Back to Things To Do About Reviews Tickets Hours & Location Contact Prohibition Kitchen Written by www.casago.com’s Local Expert About There's a lot to love about Prohibition Kitchen! First off, this vintage restaurant transports you back in time. Throughout the restaurant, you'll find that they've spared no effort and cost in the details. Even your food will come on what looks like a sheet of newspaper! Secondly, they have an expansive (and delicious) menu! There is undoubtedly something for everyone. They even have a special dietary menu that caters to food sensitivities. This includes dairy-free, gluten-free, and vegan options! Of course, given the name, you can guess that their bar menu is pretty great. You'd be right. There must be at least 100 different liquors stocked. Additionally, the beer menu and wine menus add dozens of options to the count. Thirdly, this is a restaurant that cares about quality and local businesses. As stated on their menu, their chefs strive to use the finest local farmers, fishermen, butchers, and bakers to craft their dishes. Furthermore, they also hold their service standards high. Reviews are raving, and it's easy to see why. Lastly, this place is a social hot spot and a lounge. If you're looking for a lively place to kick back with your group, this is it. The restaurant itself is spacious, so there are plenty of seats; however, it does get busy, so expect a short wait. We recommend these dishes from Prohibition Kitchen: Small Plates & Snacks Some popular starters include the signature German-style pretzel, PK Poutine, and Crispy Wings. If you had to choose one, we recommend going with the PK Poutine for its unique factor. Also, it's an easy finger food to share, though it may get a little messy. A generous plate of fries is topped with smoked cheddar mornay, pork belly, sour cream, and chives! Hand-spun Milkshakes We like to call these big kid milkshakes, and they are very popular at PK. These aren't just any milkshakes; they're infused with alcohol! There are a few different flavors to choose from that include bourbon, rum, and whiskey. PK Signature Burger Another choice we recommend because of its originality is the PK Signature Burger. Their 1/2 lb house blend patty includes short rib, brisket, and sirloin. It's served on a fresh brioche bun and topped with smoked bacon and red onion jam, fried egg, and red dragon cheese. It may sound a little questionable at first, but these chefs know what they're doing. Just go for it! Relive the speakeasy days without breaking the law at Prohibition Kitchen. The vibe, food, and drinks are worth celebrating on your Florida vacation. Local Tips Takeout ends at 9:30PM. Offer Dairy-free, Gluten-free, and Vegan options. Live music every night! Reviews 0/5 (0) No Reviews Leave a Review Submit Review Location & Hours Prohibition Kitchen 119 Saint George St. , St. Augustine, FL 32084 Monday 12PM - 10PM Tuesday Closed Wednesday 12PM - 10PM Thursday 12PM - 10PM Friday 12PM - 10PM Saturday 12PM - 10PM Sunday 12PM - 10PM Contact Email: info@pkstaug.com Website: https://pkstaug.com/ Restaurant: 904-209-5704 Casago Around the World Santa Barbara Phoenix Scottsdale Tucson Sedona Park City Big Bear Arcata – Trinidad Carpinteria La Paz Los Cabos Playa del Carmen Loreto Puerto Vallarta Riviera Nayarit Rocky Point San Carlos Guadalajara Ensenada Anchorage Atlanta Austin Boston Cedar Rapids Charleston Chicago Colorado Springs Dallas Denver Flagstaff Fort Lauderdale Honolulu Houston Indianapolis Jacksonville Las Vegas Long Beach Los Angeles Miami New Orleans New York Newport Beach Orlando Palm Springs Philadelphia Raleigh San Antonio San Diego San Jose Washington DC Sign Up For Updates Interested in: Help Managing My Property Help Finding A Rental Other Subscribe Quick Links Casago Help and FAQ About Casago Promotions/Discounts Affiliates Reviews Casago Careers Privacy Policy Apps Terms and Conditions Contact Contact Us USA & Canada: (877) 276-5745 En Mexico: (638) 383-0700 15475 N Greenway Hayden Loop #B2 Scottsdale, AZ 85260 Let's Get Social Copyright Casago 2021 | All Rights Reserved"
    },
    {
      "url": "https://www.yahoo.com/lifestyle/prohibition-grille-doing-kitchen-nightmares-134500557.html",
      "text": "How Prohibition Grille Is Doing After Kitchen Nightmares Search query Search the web Skip to main News Finance Sports More -1 Manage your account Help Add or switch accounts Sign out Search the web Advertisement Advertisement Return to Homepage Don't Miss: Swift wedding in Sweden? Secret habits of tidy people Budget protein tips Swift & Kelce wedding venues Garage sale bestsellers Plane chimes: what they mean How to drive around cyclists Kate Middleton's blazer Should kids detox? 8 best Amazon fall basics How Prohibition Grille Is Doing After Kitchen Nightmares Jennifer Mashuga Mon, November 27, 2023 at 1:45 PM UTC 6 min read Gordon Ramsay smirking - DFree/Shutterstock When Gordon Ramsay gets to Everett, Washington to check out Prohibition Grille in Season 5, he was surprised to see advertisements for learning belly dancing after he walked in. After being greeted by the owner, Darlene 'Rishi' Brown, he learned that the advertisements were for her side business, Rishi's Egypt Belly Dance Company. When Ramsay asked how she went from 30 years of belly dancing to opening a restaurant, she laughed and told him that she spontaneously decided while having a drink one afternoon. She was a bit more blunt with The Herald. \"I opened it with $10,000 and no restaurant experience. A month after we opened the economy crashed.\" Viewers will remember Rishi as the inexperienced restaurant owner who had no idea what the meaning of 'Soup of the Day' was, or that calling food fresh didn't just mean it hadn't been frozen. She also regularly performed with her belly dancing troupe during dinner, which confused and annoyed customers. The restaurant's staff thought Rishi was nice and meant well, but was naive and had no idea how to run a restaurant. She put all her trust in Chef Rocky, even though the servers claimed he spent most of his time on his phone or outside smoking. Prohibition Grille's problems were mild when compared to other \"Kitchen Nightmares\" horror stories of kitchens infested with critters , but Ramsay realized quickly that he needed to help educate and empower Rishi so she wouldn't lose her restaurant. Read more: The Untold Truth Of Hell's Kitchen What Happened To Prohibition Grille On Kitchen Nightmares? Chef Rocky and Candace - Fox/Amazon When Gordon Ramsay asks Rishi about the style of food they serve, her response of gourmet Southern, fine dining, and a steakhouse/dinner-house theme baffles him, but not quite as much as when she informs him that Prohibition Grille doesn't even have a grill. In response to this, Ramsay takes duct tape and blocks out the word 'Grille' on the sign before the dinner rush. Advertisement Advertisement Advertisement Advertisement Ramsay is astonished to discover a multitude of kitchen problems, such as cooked and raw food next to each other, and old food being simply reheated and re-served days later. He also notices food is constantly being sent back to the kitchen because it's undercooked, or guests just don't like it. Most of Prohibition Grille's staff are restaurant industry veterans and they express their frustration to Ramsay. One tells him that she and Rocky started at the restaurant at the same time, and he was once very passionate about his job. But over the last few years, he began to put in minimal effort, and he told Rishi that she doesn't pay him enough to do a better job. Ramsay is even more shocked to discover that the servers give Rocky 3% of their tips because he convinced Rishi this was normal. After a staff meeting without Rocky, Ramsay convinced Rishi she needed to take charge of her restaurant and stop letting Rocky drag it down. Thanks to Ramsay's help, Rishi finally found the strength to take bold steps to turn things around. Prohibition Grille After Kitchen Nightmares Rishi Adams - Fox/Amazon The \"Kitchen Nightmares\" episode ended with the restaurant remodeled into the Prohibition Gastropub, and Chef Ramsay introduced Tyler Palagi, a Northwest chef with 20 years of experience. Ramsay promises Rishi that when Palagi -- who's in the process of opening his restaurant, Radiator -- leaves, he'll train another chef to take his place. The menu has also been pared down so the small kitchen isn't overwhelmed, and Rishi has new business attire to wear, courtesy of Ramsay. Advertisement Advertisement Advertisement Advertisement Guests seemed to really be enjoying the makeover also, and the reviews became more positive. \"Can't get a meal like this anywhere else in Everett. It's a gem. If you live in Everett and want a fine dining experience this is a great choice,\" wrote one fan on Google shortly after the remodel. Seven months later, Season 6, Episode 10 featured Ramsay visiting to see how things were going. When he walked in the door he was pleased to see the place was busy, and after playing a joke on him, Rishi assured him there was no more belly dancing. She also told him proudly \"I've been working around the clock here since you left. Now I'm totally an owner here.\" Rishi is involved in all aspects of the business and has also hired a consulting chef to help. Things were going much better for the restaurant, and Everett's Mayor Ray Stephanson even proclaimed July 21 Prohibition Gastropub Appreciation Day at the end of the episode. Is Prohibition Grille On Kitchen Nightmares Still Open? Chef Ramsay asking about burnt cornbread in the pantry - Fox/Amazon Despite swearing that she would no longer have belly dancing in the restaurant, in 2015 she began occasionally having her Rishi Egypt dancers perform during dinner -- which she obviously kept quiet about to Gordon Ramsay. \"I didn't tell him, he didn't ask,\" Rishi Brown told The Herald . Prohibition Gastropub was doing well and lasted three years before it was sold to Brent Holland, who claimed he'd been pestering Brown to buy it for two years. In a 2016 Facebook post, the changing of hands was announced, and, despite Gordon Ramsay having changed the name due to the lack of a grill, Holland decided to add the word back in, this time calling it Prohibition Grille and Saloon. Advertisement Advertisement Advertisement Advertisement Less than a year later, that restaurant closed. James Abbott, who already owned another restaurant on the street, decided to buy it and turn it into a sophisticated fine dining establishment. Dinner prices were between $25 and $45 a plate, and Yelp reviews were outstanding. But Abbott's closed a few months into the pandemic. The newest venture, Flying Pig, opened in the spot in 2021 and is still going strong with a 4.3 out of 5 stars rating on Yelp. What's Next For Prohibition Grille And Rishi? Prohibition Grille remodeled into Prohibition Gastropub - Fox/Amazon After selling the Prohibition Gastropub to Brent Holland, Rishi Brown changed course. She continued promoting her other business, Rishi's Egypt Bellydance Company, with frequent posts on the company's Facebook page. It's unclear if the business is still going, as the last Instagram post, or social media post of any kind, was in September 2022. According to her LinkedIn page, Brown has been working in beverage development and as a restaurant manager for Tulalip Resort Casino since January 2017. Her Facebook page also says that she works for Anthony Brock Promotions. Anthony is her son, and her many posts about his band, the Anthony Brock Group, and their performances show a loyal and dedicated mother who is eager for the world to hear his music. Meanwhile, remember the chef whom Rishi had fired? Rocky opened his own restaurant in 2013. Ole Soul Southern Creole was just three blocks from Prohibition. The restaurant seemed to be thriving when it suddenly closed in 2017, with a Facebook post claiming it was due to a medical emergency. Read the original article on Mashed . Advertisement About Our Ads Solve the daily Crossword 20,388 people played the daily Crossword recently. Can you solve it faster than others? 20,388 people played the daily Crossword recently. Can you solve it faster than others? Crossword Play on Yahoo Advertisement Advertisement Advertisement Yahoo! Health Parenting Horoscopes Shopping Help Suggestions About Our Ads Site Map Follow us on © 2025 Yahoo. All rights reserved."
    },
    {
      "url": "https://www.tampabay.com/life-culture/food/2021/03/10/prohibition-kitchen-and-tap-opens-in-dunedin/",
      "text": "Prohibition Kitchen and Tap opens in Dunedin Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Life & Culture / Food Prohibition Kitchen and Tap opens in Dunedin The “Southern comfort gastropub” opened Tuesday inside the beleaguered Whiskey Cartel space. Prohibition Kitchen and Tap, a new Southern-inspired gastropub, opened Tuesday at 1600 Main St. in Dunedin. [ Courtesy of Prohibition Kitchen and Tap ] By Helen Freund Times staff Published | Updated Helen Freund Food and Dining Critic MORE FOR YOU British pub The Moon Under Water finally has a new home • Food New Italian restaurant coming to Carrollwood, from Cooper’s Hawk group • Food Advertisement Hungry Harry’s celebrates 40 years of Land O’ Lakes barbecue • Food Lucky Tigre has moved to a new restaurant space in Old West Tampa • Food Tampa’s Olive Tree restaurant is already good. Now, it’s about to get big. • Food Food historian, author and USF librarian Andrew Huse left a legacy of loving Tampa • Life & Culture This Florida Italian restaurant celebrates 25 years of creating community • Florida In Dunedin, MockFusion creates bar atmosphere minus the alcohol • Bars & Breweries Temple Terrace bets big on boozy pickleball complex • Bars & Breweries ‘Prices are just too high’: Florida newspaper asks people why they’re not dining out • Florida Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.pkstaug.com/about-us/private-occasions/",
      "text": "Private Occasions – Prohibition Kitchen Scroll Top 119 St George St, St. Augustine, FL 32084 (904) 209-5704 Social-facebook Instagram Menu Close Our Menus Food Menu Drink Menu Music Calendar Shop Gallery About Us Private Occasions Press Contact Us Our Menus Food Menu Drink Menu Music Calendar Shop Gallery About Us Private Occasions Press Contact Us VISIT US creating lasting memories private occasions Welcome to prohibition kitchen Prohibition Kitchen is pleased to offer private occasions, Mezzanine reservations, and VIP area reservations for a room rate fee based upon availability. The perfect spot for a private occasion, after party, wedding rehearsal luncheon, dinner, cocktail hour or group gathering; Prohibition Kitchen’s industrial step back in time invokes a speakeasy ambiance for guests to enjoy including lite bites, our enticing menu, and refreshment packages. mezzanine reservations Mezzanine reservations (located on the second level of Prohibition Kitchen) can host anywhere from 35 guests seated, to 85 guests maximum with standing room. Mezzanine reservations require a refreshment package, a minimum requirement of 30 guests, and two hour time period. Mezzanine reservations are based upon availability and must be arranged two weeks in advance from the occasion date. vip area Our VIP area consists of 2 areas located to the left side of the stage, and offers the best seat in the house. Each VIP area can host up to 15 guests (30 guests total), zero wait time, a two hour block period, and a dedicated server for your party for a room rate fee. Refreshments and dining are not included. * Reservations must be made 72 hours in advance to hold the VIP Area. For availability and more information regarding our Prohibition Kitchen occasions, please contact our Event Coordinator below: call email Serving unique dishes with stylish cocktails and craft beer while hosting live music. OUR MENUS | MUSIC CALENDAR | SHOP | GALLERY | ABOUT PRIVATE OCCASIONS | PRESS | CONTACT US 119 ST GEORGE ST. ST. AUGUSTINE, FL 32084 DINNER HOURS: MON – SUN: 11:00AM – 10:00PM LATE NIGHT MENU: FRI – SAT: 10:00PM – 1:00AM explore our sister companies 2023 © Copyrights Prohibition Kitchen | Managed by Meerkat Media Group – Portfolio Rights By Copyright."
    },
    {
      "url": "https://www.caltekappliancerepair.com/contact",
      "text": "Reach Out to CalTeK: Atlanta's Trusted Appliance Repair | Contact Info & Form Maker Software Home About Services Testimonials FAQS Contact Open menu Maker Software Contact us Name Email Address Phone Number Address What do you need serviced today? Send Contact Information Hours: M-F 8:00 am - 5:00 pm Phone: 678-702-7494 Email: service@caltekappliance.com Services We offer a wide range of appliance repair services, including: Refrigerator Repair Dishwasher Repair Washer Repair Dryer Repair Microwave Repair Oven Repair Stove Repair and more! Footer Contact Us (678) 702-7494 service@caltekappliance.com Hours Monday - Friday: 8am - 5pm Weekends: Closed © 2025 CalTeK Appliance Repair LLC. All Rights Reserved."
    },
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "text": "Contact | Eddy's Kitchen top of page Home Contact About us Catering Blog More Use tab to navigate through the menu items. ORDER NOW OR SCHEDULE! Contact Us Address 525 Somerset St. North Plainfield, NJ 07060 Contact 908-205-0531 Opening Hours Mon - Fri 6:30 am – 2:00 pm info@TheEddysKitchen.com Saturday 6:30 am – 2:00 pm ​Sunday Closed First Name Last Name Email Message Send Thanks for submitting! info@theeddyskitchen.com ©2023 by Eddy's Kitchen. bottom of page"
    },
    {
      "url": "https://www.pghschools.org/staff/staff/staff-home",
      "text": "Staff Home Skip To Main Content Toggle Close Container Close Site Search Search Clear Search Triggers Container Wrapper Toggle Find It Fast Container - Mobile Student & Families Toggle Schools Container - Mobile Schools Mobile Main Nav About 2025-2026 School Year (opens in new window/tab) Budget & Finance Board of Directors (opens in new window/tab) Careers (opens in new window/tab) Comprehensive Plan Contacting the District (opens in new window/tab) Delays and Closures Directory District Vision and Mission (opens in new window/tab) District Data Enrollment (opens in new window/tab) ESSER Funds (opens in new window/tab) Future-Ready Facilities Plan Facts at a Glance (opens in new window/tab) Find a School (opens in new window/tab) Get The Facts Policies (opens in new window/tab) Student Voice (opens in new window/tab) Strategic Plan (opens in new window/tab) Superintendent of Schools (opens in new window/tab) Calendar Academics Arts Education (opens in new window/tab) Assessment Career and Technical Education (CTE) (opens in new window/tab) Course Catalogs (opens in new window/tab) Early Childhood Programs (opens in new window/tab) Early Intervention (opens in new window/tab) English Language Arts (opens in new window/tab) Grading Guidelines (opens in new window/tab) Gifted and Talented (opens in new window/tab) Health & Physical Education (opens in new window/tab) Mathematics (opens in new window/tab) Out-of-School Time (opens in new window/tab) Positive Behavior Interventions & Supports (PBIS) (opens in new window/tab) Magnet Programs (opens in new window/tab) PSE (Special Education) Restorative Practices (opens in new window/tab) Science (opens in new window/tab) Student Envoy (opens in new window/tab) Social Emotional Learning (SEL) (opens in new window/tab) Social Studies (opens in new window/tab) Online Academy (opens in new window/tab) World Languages (opens in new window/tab) Community Alumni (opens in new window/tab) Business Opportunities Buspatrol Community Schools (opens in new window/tab) FERPA (opens in new window/tab) Family, Youth and Community Engagement (opens in new window/tab) FACE Coordinators (opens in new window/tab) Feedback Flyer Distribution (opens in new window/tab) Forms Get Involved (opens in new window/tab) Immigrant Families LGBTQ Newsroom Parent Advisory Council (opens in new window/tab) Parent and Family Engagement Policy (opens in new window/tab) Parent Schools Community Councils (PSCC) (opens in new window/tab) Partner Policies (opens in new window/tab) Public Hearing Procedures (opens in new window/tab) Quality H2O (opens in new window/tab) Respiratory Viruses Right to Know Requests (opens in new window/tab) Surplus Properties (opens in new window/tab) Title I (opens in new window/tab) Use of School Facilities (opens in new window/tab) Volunteering (opens in new window/tab) Wellness (opens in new window/tab) Campaigns Departments Athletics (opens in new window/tab) Budget & Finance (opens in new window/tab) Covid Compensatory Services (CCS) (opens in new window/tab) Data, Research, Evaluation & Assessment (opens in new window/tab) English Language Development ELD (opens in new window/tab) Food Services (opens in new window/tab) Health Services (opens in new window/tab) Library Services (opens in new window/tab) Student Support Services (opens in new window/tab) Office of Charter Schools (opens in new window/tab) The Office Of Equity PSE (Special Education) (opens in new window/tab) School Controller (opens in new window/tab) Transportation (opens in new window/tab) Office of Technology Directory Central Office Organization Chart Student Supports City Connections Code of Conduct (opens in new window/tab) College Resources (opens in new window/tab) Cyber Safety (opens in new window/tab) Early College High School (opens in new window/tab) Graduation Hearing and Deaf Services (opens in new window/tab) Housing Instability / Homelessness (opens in new window/tab) Naviance (opens in new window/tab) School Safety (opens in new window/tab) Section 504 Transcripts (opens in new window/tab) The Pittsburgh Promise (opens in new window/tab) Translation and Interpretation Support (opens in new window/tab) Scholarship Information (opens in new window/tab) Virtual Calming Room Work Permits (opens in new window/tab) Staff (opens in new window/tab) Desktop Main Nav About 2025-2026 School Year (opens in new window/tab) Budget & Finance Board of Directors (opens in new window/tab) Careers (opens in new window/tab) Comprehensive Plan Contacting the District (opens in new window/tab) Delays and Closures Directory District Vision and Mission (opens in new window/tab) District Data Enrollment (opens in new window/tab) ESSER Funds (opens in new window/tab) Future-Ready Facilities Plan Facts at a Glance (opens in new window/tab) Find a School (opens in new window/tab) Get The Facts Policies (opens in new window/tab) Student Voice (opens in new window/tab) Strategic Plan (opens in new window/tab) Superintendent of Schools (opens in new window/tab) Calendar Academics Arts Education (opens in new window/tab) Assessment Career and Technical Education (CTE) (opens in new window/tab) Course Catalogs (opens in new window/tab) Early Childhood Programs (opens in new window/tab) Early Intervention (opens in new window/tab) English Language Arts (opens in new window/tab) Grading Guidelines (opens in new window/tab) Gifted and Talented (opens in new window/tab) Health & Physical Education (opens in new window/tab) Mathematics (opens in new window/tab) Out-of-School Time (opens in new window/tab) Positive Behavior Interventions & Supports (PBIS) (opens in new window/tab) Magnet Programs (opens in new window/tab) PSE (Special Education) Restorative Practices (opens in new window/tab) Science (opens in new window/tab) Student Envoy (opens in new window/tab) Social Emotional Learning (SEL) (opens in new window/tab) Social Studies (opens in new window/tab) Online Academy (opens in new window/tab) World Languages (opens in new window/tab) Community Alumni (opens in new window/tab) Business Opportunities Buspatrol Community Schools (opens in new window/tab) FERPA (opens in new window/tab) Family, Youth and Community Engagement (opens in new window/tab) FACE Coordinators (opens in new window/tab) Feedback Flyer Distribution (opens in new window/tab) Forms Get Involved (opens in new window/tab) Immigrant Families LGBTQ Newsroom Parent Advisory Council (opens in new window/tab) Parent and Family Engagement Policy (opens in new window/tab) Parent Schools Community Councils (PSCC) (opens in new window/tab) Partner Policies (opens in new window/tab) Public Hearing Procedures (opens in new window/tab) Quality H2O (opens in new window/tab) Respiratory Viruses Right to Know Requests (opens in new window/tab) Surplus Properties (opens in new window/tab) Title I (opens in new window/tab) Use of School Facilities (opens in new window/tab) Volunteering (opens in new window/tab) Wellness (opens in new window/tab) Campaigns Departments Athletics (opens in new window/tab) Budget & Finance (opens in new window/tab) Covid Compensatory Services (CCS) (opens in new window/tab) Data, Research, Evaluation & Assessment (opens in new window/tab) English Language Development ELD (opens in new window/tab) Food Services (opens in new window/tab) Health Services (opens in new window/tab) Library Services (opens in new window/tab) Student Support Services (opens in new window/tab) Office of Charter Schools (opens in new window/tab) The Office Of Equity PSE (Special Education) (opens in new window/tab) School Controller (opens in new window/tab) Transportation (opens in new window/tab) Office of Technology Directory Central Office Organization Chart Student Supports City Connections Code of Conduct (opens in new window/tab) College Resources (opens in new window/tab) Cyber Safety (opens in new window/tab) Early College High School (opens in new window/tab) Graduation Hearing and Deaf Services (opens in new window/tab) Housing Instability / Homelessness (opens in new window/tab) Naviance (opens in new window/tab) School Safety (opens in new window/tab) Section 504 Transcripts (opens in new window/tab) The Pittsburgh Promise (opens in new window/tab) Translation and Interpretation Support (opens in new window/tab) Scholarship Information (opens in new window/tab) Virtual Calming Room Work Permits (opens in new window/tab) Staff (opens in new window/tab) Header Holder Header Logo Header Right Column Translate Toggle Find It Fast Container Quick Links Toggle Schools Container Schools Toggle Menu Container Menu Canvas Menus Containers Find It Fast Canvas Close Canvas BTN - Container Close Canvas Quick Links 2025-2026 SY CLEVER athletics Menus TRANSPORTATION FORMS Desktop Navs Wrapper QUICKLINKS Bus Patrol Board Docs Delays and Closures Enroll Future Ready Facilities Plan Find a School (School Search) Home Access Center (HAC) Immigrant Families KDKA In Your Neighborhood McKinney-Vento PPS Love Requests for Proposals (RFP's) We are PPS Podcast Popular Links Careers Directory Feedback News Room Strategic Plan Superintendent Challenge Coin Student Supports COVID Compensatory Services Hearing and Deaf Services Homeless Assistance Out-of-School Time School Safety Summer Program Opportunities Summer Reading 2025 Translation and Interpretation LGBTQ Code of Conduct QUICKLINKS Quicklinks Bus Patrol Board Docs Delays and Closures Enroll Future Ready Facilities Plan Find a School (School Search) Home Access Center (HAC) Immigrant Families KDKA In Your Neighborhood McKinney-Vento PPS Love Requests for Proposals (RFP's) We are PPS Podcast Popular Links Popular Links Careers Directory Feedback News Room Strategic Plan Superintendent Challenge Coin ACADEMICS Supports COVID Compensatory Services Hearing and Deaf Services Homeless Assistance Out-of-School Time School Safety Summer Program Opportunities Summer Reading 2025 Translation and Interpretation LGBTQ Code of Conduct District Canvas Close Canvas BTN - Container Close PITTSBURGH PUBLIC SCHOOLS PreK-5 PreK-8 6-8 6-12 9-12 Early Childhood SPECIAL SCHOOLS PreK-5 PreK-5 - Nav Allegheny PreK-5 Arsenal PreK-5 Banksville K-5 Beechwood PreK-5 Concord K-5 Dilworth PreK-5 Faison K-5 Fulton PreK-5 Grandview PreK-5 Liberty K-5 Lincoln PreK-5 Linden PreK-5 Miller PreK-5 Minadeo PreK-5 Montessori PreK-5 Phillips K-5 Roosevelt K-5 Spring Hill K-5 Weil PreK-5 West Liberty PreK-5 Westwood PreK-5 Whittier K-5 Woolslair PreK-5 PreK-8 PreK-8 - Nav Arlington PreK-8 Brookline PreK-8 Carmalt PreK-8 Colfax K-8 Greenfield PreK-8 King PreK-8 Langley PreK-8 Manchester PreK-8 Mifflin PreK-8 Morrow PreK-8 Sunnyside PreK-8 6-8 6-8 - Nav Allegheny 6-8 Arsenal 6-8 Classical 6-8 Schiller 6-8 South Brook 6-8 South Hills 6-8 Sterrett 6-8 6-12 6-8 - Nav CAPA 6-12 Milliones 6-12 Obama 6-12 Westinghouse Academy 6-12 Science And Technology Academy 9-12 9-12 - Nav Allderdice High School Brashear High School Carrick High School Perry High School Early Childhood Early - Nav Allderdice Early Headstart Allegheny Early Childhood Arlington Early Childhood Arsenal Early Childhood Beechwood Early Childhood Brashear Early Headstart Brookline Early Childhood Carmalt Early Childhood Carnegie Science Center Early Childhood Chartiers Early Childhood Childrens Museum Early Childhood Concord Early Childhood Conroy Early Childhood Crescent Early Childhood/Early Headstart Dilworth Early Childhood Fulton Early Childhood Grandview Early Childhood Greenfield Early Childhood King Early Childhood Langley Early Childhood Lincoln Early Childhood Linden Early Childhood Manchester Early Childhood Mifflin Early Childhood Miller Early Childhood Milliones Early Childhood Minadeo Early Childhood Montessori Early Childhood Morrow Early Childhood Northview Heights Early Childhood Center Obama Early Childhood Roosevelt Early Childhood Science & Technology Academy Early Childhood Spring Garden Early Childhood Sunnyside Early Childhood Weil Early Childhood West Liberty Early Childhood Westinghouse Early Headstart Westwood Early Childhood Woolslair Early Childhood SPECIAL SCHOOLS Special - Nav Clayton Academy Conroy Gifted Center Pittsburgh Bridges Academy Online Academy Pioneer Student Achievement Center PITTSBURGH PUBLIC SCHOOLS PreK-5 Allegheny PreK-5 Arsenal PreK-5 Banksville K-5 Beechwood PreK-5 Concord K-5 Dilworth PreK-5 Faison K-5 Fulton PreK-5 Grandview PreK-5 Liberty K-5 Lincoln PreK-5 Linden PreK-5 Miller PreK-5 Minadeo PreK-5 Montessori PreK-5 Phillips K-5 Roosevelt K-5 Spring Hill K-5 Weil PreK-5 West Liberty PreK-5 Westwood PreK-5 Whittier K-5 Woolslair PreK-5 PreK-8 Arlington PreK-8 Brookline PreK-8 Carmalt PreK-8 Colfax K-8 Greenfield PreK-8 King PreK-8 Langley PreK-8 Manchester PreK-8 Mifflin PreK-8 Morrow PreK-8 Sunnyside PreK-8 6-8 Allegheny 6-8 Arsenal 6-8 Classical 6-8 Schiller 6-8 South Brook 6-8 South Hills 6-8 Sterrett 6-8 6-12 CAPA 6-12 Milliones 6-12 Obama 6-12 Westinghouse Academy 6-12 Science And Technology Academy 9-12 Allderdice High School Brashear High School Carrick High School Perry High School Early Childhood Allderdice Early Headstart Allegheny Early Childhood Arlington Early Childhood Arsenal Early Childhood Beechwood Early Childhood Brashear Early Headstart Brookline Early Childhood Carmalt Early Childhood Carnegie Science Center Early Childhood Chartiers Early Childhood Childrens Museum Early Childhood Concord Early Childhood Conroy Early Childhood Crescent Early Childhood/Early Headstart Dilworth Early Childhood Fulton Early Childhood Grandview Early Childhood Greenfield Early Childhood King Early Childhood Langley Early Childhood Lincoln Early Childhood Linden Early Childhood Manchester Early Childhood Mifflin Early Childhood Miller Early Childhood Milliones Early Childhood Minadeo Early Childhood Montessori Early Childhood Morrow Early Childhood Northview Heights Early Childhood Center Obama Early Childhood Roosevelt Early Childhood Science & Technology Academy Early Childhood Spring Garden Early Childhood Sunnyside Early Childhood Weil Early Childhood West Liberty Early Childhood Westinghouse Early Headstart Westwood Early Childhood Woolslair Early Childhood SPECIAL SCHOOLS Clayton Academy Conroy Gifted Center Pittsburgh Bridges Academy Online Academy Pioneer Student Achievement Center Find My School (opens in new window/tab) IN THIS SECTION Breadcrumb Home Staff Staff Home WELCOME PPS STAFF A quick access guide for current staff Scroll down to find quick links to MY PPS, Office 365, PPS services and systems, and contact support. Forgot Your Password? Click here Future-Ready Materials for Staff Login to My PPS View Department Pages, Staff Resources, Web Tools and Staff Announcements. Access Office 365 resources by clicking here or using the shortcuts below. Office 365 Shortcuts Use Office 365 to check your emails, create documents online, collaborate, and much more. You can also access all Office 365 apps by logging into My PPS above. Employee Tools *Formerly Hire Enterprise/SearchSoft Education Tools Employee Resources (HR, Payroll) PPS Communications Hub The PPS Experience Customer Service Standards Logos, Powerpoint Templates, Letterheads Click Here PPS Online Store Click Here Resources PPS School Marketing Workbook RFP Template PPS Mobile App Download in the App Store Click Here Download in the Google Play Console Click Here Support Requests Graphic Design Intake Form PPS District Website Page Request Form Media Policies and Guidelines 1006 News Media Relations Download News Media Relations Guidelines -AR 1001 School-Community Relations Download Operations of School District-owned Social Media Accounts -AR When contacted by the media, please follow these steps: Ask the reporter to provide: • Their name and contact information • The topic of interest • Their deadline for the story Let the reporter know that someone will follow up with them in a timely manner. Immediately contact Ebony Pugh, Director of Public Relations and Media Content, at 412-529-3616 or epugh1@pghschools.org to discuss next steps. If you prefer not to speak with the reporter, kindly refer them directly to Ebony Pugh and provide her contact information listed above. Central Office Support Directory Click Here Who Do I Contact for Help? PPS Support Email Email support@pghschools.org at any time to submit a support request or call 412-529-HELP (4357) during business hours: Monday-Friday 6:30-4:30 Let's Talk Submit a support ticket via Let's Talk at any time. Let's Talk has replaced our previous ticketing system. Forgot or Expired Password? PPS Users can now reset their passwords online. Click below and use your User ID (user@pghschools.org) to start the process. Address-container Facebook (opens in new window/tab) Twitter (opens in new window/tab) YouTube (opens in new window/tab) Vimeo 341 S. Bellefield Ave. Pittsburgh PA 15213 (412) 529-HELP (4357) The Pittsburgh Public School District is the largest of 43 school districts in Allegheny County and second largest in Pennsylvania. The District provides students, in PreK through Grade 12, a variety of options to help them succeed in school and prepare them for college, career, and life. Guardian Log-in Site Map Privacy Policy Accessibility FERPA Non-Discrimination Statement Editable Links Site Manager Powered by Finalsite"
    },
    {
      "url": "https://www.pkstaug.com/contact-us/",
      "text": "Contact Us – Prohibition Kitchen Scroll Top 119 St George St, St. Augustine, FL 32084 (904) 209-5704 Social-facebook Instagram Menu Close Our Menus Food Menu Drink Menu Music Calendar Shop Gallery About Us Private Occasions Press Contact Us Our Menus Food Menu Drink Menu Music Calendar Shop Gallery About Us Private Occasions Press Contact Us VISIT US questions? Contact us For general questions & inquiry, fill out the form and we will get back to you in 48 hours. **Got a question for our Entertainment Director?  Contact Sailor Jane at sailorjaneproductions@gmail.com.** Δ Address: 119 St George St, St. Augustine, FL 32084 Phone:  (904) 209-5704 Email: info@pkstaug.com Facebook Instagram Dinner Hours: MON - SUN: 11:30AM – 10:00PM Late Night Menu: FRI - SAT: 10:00PM - 1:00AM Takeout Hours: SUN - SAT: 12:00PM - 9:30PM Serving unique dishes with stylish cocktails and craft beer while hosting live music. OUR MENUS | MUSIC CALENDAR | SHOP | GALLERY | ABOUT PRIVATE OCCASIONS | PRESS | CONTACT US 119 ST GEORGE ST. ST. AUGUSTINE, FL 32084 DINNER HOURS: MON – SUN: 11:00AM – 10:00PM LATE NIGHT MENU: FRI – SAT: 10:00PM – 1:00AM explore our sister companies 2023 © Copyrights Prohibition Kitchen | Managed by Meerkat Media Group – Portfolio Rights By Copyright."
    },
    {
      "url": "https://prohibitioncorpus.com/about-us",
      "text": "About us Join Corpus Christi's only Private & Exclusive Cigar Lounge.\nCLICK HERE Home Memberships Member Profile Membership Process Member Bylaws & Agreement Membership Options Cigars & Accessories Cigar Menu Padre Island Cigar Co. Link to Cigar Store Food Menu Appetizers Pizza Gourmet Burgers Specialty Fries Finger Baskets Drink Menu Cocktails Liquor & Spirits Wine & Champagne Bottled Beer Draft Beers About About us Gallery Contact us Social More Home Memberships Member Profile Membership Process Member Bylaws & Agreement Membership Options Cigars & Accessories Cigar Menu Padre Island Cigar Co. Link to Cigar Store Food Menu Appetizers Pizza Gourmet Burgers Specialty Fries Finger Baskets Drink Menu Cocktails Liquor & Spirits Wine & Champagne Bottled Beer Draft Beers About About us Gallery Contact us Social Get in Touch Home Memberships Member Profile Membership Process Member Bylaws & Agreement Membership Options Cigars & Accessories Cigar Menu Padre Island Cigar Co. Link to Cigar Store Food Menu Appetizers Pizza Gourmet Burgers Specialty Fries Finger Baskets Drink Menu Cocktails Liquor & Spirits Wine & Champagne Bottled Beer Draft Beers About About us Gallery Contact us Social Get in Touch Corpus Christi’s only private & exclusive cigar lounge. About Us Our Kitchen Our Vision What do you get when you put two U.S. Marine Corps Vets from Corpus Christi & Las Vegas, with a former U.S. Navy Vet, who is from New York City? Prohibition Private Cigar Lounge (Members Only) Our Vision Our Kitchen Our Vision We believe in having a good time with friends, family, and colleagues. Our vision is to provide a welcoming, fun and timeless environment with Prohibition & speakeasy vibes. A place where business & pleasure meet while enjoying cigars, food, drinks, entertainment, and socializing with like-minded people. Our Kitchen Our Kitchen Our Kitchen Prohibition's kitchen & menu are provided by New York & Chicago Pizza Co. Mr. Domenic Catalano founded the company in 2011 in Cypress, TX and relocated to Corpus Christi in 2023. The recipes have been passed down for generations from Calabria, Italy, and are shared today with Prohibition & Retro. Kitchen & menu by: Copyright © 2025 prohibitioncorpus.com - All Rights Reserved. Powered by Home Link to Cigar Store Gallery Now accepting members. Join Corpus Christi's only private & exclusive cigar lounge. Learn More This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    }
  ]
}