{
  "query": "plantationoncrystalriver.com email",
  "fuentes": [
    {
      "url": "https://www.plantationoncrystalriver.com/",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.plantationoncrystalriver.com/",
      "email": "info@plantationoncrystalriver.com"
    },
    {
      "url": "https://www.plantationoncrystalriver.com/contact",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.plantationoncrystalriver.com/contact",
      "email": "info@plantationoncrystalriver.com"
    },
    {
      "url": "https://www.west82crystalriver.com/",
      "email": "catering@plantationoncrystalriver.com"
    },
    {
      "url": "https://www.west82crystalriver.com/",
      "email": "info@plantationoncrystalriver.com"
    }
  ],
  "mails": [
    "forms@tambourine.com",
    "catering@plantationoncrystalriver.com",
    "info@plantationoncrystalriver.com"
  ],
  "nombre_sitio": "plantationoncrystalriver.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://www.plantationoncrystalriver.com/",
      "text": "Plantation on Crystal River | Official Site Reservations: (352) 770-8779 RIVER CAM Logo Plantation on Crystal River Events CHECK AVAILABIILITY Accommodations Photos Packages & Offers Our Resort FAQ Upcoming Events Adventure Center Golf Dining West 82 Tiki Bar 19th Hole Maddie's Coffee Company Spa Meetings & Events Weddings Southern Hospitality With Florida Charm scroll down Swim With Crystal River Manatees Stay & Play Along Florida's Nature Coast Plantation Resort on Crystal River offers unforgettable experiences for all in Florida’s historic Capital of the Manatee. Guests will find a full-service resort with classic rooms, excellent dining, a lagoon-style pool, an Aveda spa, and a world-class, traditional golf course. Those seeking adventure can go fishing, scalloping, boating, and touring through natural landscapes with ease. Accessed by both road and air, Plantation Resort on Crystal River is surrounded by lush Florida nature and thriving wildlife, adding to an eco-friendly getaway that sets itself apart from any other. Authentic Adventure in Crystal River Rare Manatee Encounters The Adventure Center at Plantation Resort on Crystal River is the only place in the world where guests and visitors can swim with Crystal River manatees in a safe, organized setting. Go on a guided excursion beginning at the canals behind our resort and experience up-close encounters with these gentle marine mammals in the waters of Kings Bay. Dive In Boating Made Easy At Plantation Resort on Crystal River, guests are welcome to dock their boats on our private seawall completely free of charge. In addition to that, The Adventure Center offers special access to boat rentals, pontoon rentals, and sunset cruises, providing you with a simple way to explore out on the water with total independence. Discover Hear From Past Visitors Great place “The inn and people that worked there were outstanding. The rooms were very large and kept clean. Will definitely stay here again.” Mike H, TripAdvisor Excellent Captain and First Mate! “Went out scalloping last weekend with Captain Jeff and First Mate Mark via the dive shop and had an awesome adventure.” Kevin F, TripAdvisor This place is so special! “This place is a hidden gem! If you get the opportunity to spend a weekend here you will walk away with memories to last a lifetime!” Busy Mom, TripAdvisor Classic Accommodations Choose from 196 comfortable accommodations at Plantation Resort on Crystal River, many of which can connect to accommodate families and groups. Golf Villas offer the ideal option for homelike long-term stays, and 11 Junior Suites include an additional sleeper sofa, while all guest rooms feature king-size beds or double queens. Our Rooms Tee off on Our Traditional Florida Course Golfers at Plantation Resort on Crystal River can play 18 holes on original Florida greens designed by Mark Mahannah. Or, take advantage of personal instruction at the resort’s award-winning golf school. See Website Fresh Seafood & Local Ingredients With cool, comfortable indoor dining and an outdoor watering hole, guests can enjoy locally caught seafood and homegrown Florida ingredients at West 82 Sports Bar & Grill, the Tiki Bar, and the 19th Hole Sports Bar & Grill. Resort Dining Meetings Weddings One-of-a-Kind Gatherings Plantation Resort on Crystal River accommodates events of up to 300 guests with 50,000 square feet of meeting space and unique opportunities for group activities. Group Events Weddings on the Water From ceremony to reception, discover a magical wedding setting surrounded by dazzling marine features and lush Florida foliage. Tie the Knot Get Your Bearings Explore the premises of Plantation Resort on Crystal River and get a better look at the amenities and features of our property. Explore Amenities Gallery Explore It All view gallery email signup Stay in the Know Thank you for your interest. Hidden Field First Name Last Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. SIGN UP 9301 West Fort Island Trail Crystal River, FL , 34429 Hotel Direct: 352-795-4211 Reservations: (352) 770-8779 Contact Us FAQ Careers Area Activities Press facebook twitter instagram Privacy Policy Accessibility Sitemap Consent Preferences © Plantation on Crystal River  2025. All Rights Reserved. Resort Website Design By Tambourine"
    },
    {
      "url": "https://www.plantationoncrystalriver.com/contact",
      "text": "Contact Us | Plantation on Crystal River Reservations: (352) 770-8779 RIVER CAM Logo Plantation on Crystal River Events CHECK AVAILABIILITY Accommodations Photos Packages & Offers Our Resort FAQ Upcoming Events Adventure Center Golf Dining West 82 Tiki Bar 19th Hole Maddie's Coffee Company Spa Meetings & Events Weddings Contact Us scroll down Let’s Get In Touch Plantation Resort on Crystal River 9301 W Fort Island Trail Crystal River, FL 34429 (352) 795-4211 Thank you for your interest! Contact Our Team Use the form below to submit any questions you might have, and a member of our team will reach out to you shortly. First Name * Last Name * Email Address * Phone Number Message Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit email signup Stay in the Know Thank you for your interest. Hidden Field First Name Last Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. SIGN UP 9301 West Fort Island Trail Crystal River, FL , 34429 Hotel Direct: 352-795-4211 Reservations: (352) 770-8779 Contact Us FAQ Careers Area Activities Press facebook twitter instagram Privacy Policy Accessibility Sitemap Consent Preferences © Plantation on Crystal River  2025. All Rights Reserved. Resort Website Design By Tambourine"
    },
    {
      "url": "https://www.west82crystalriver.com/",
      "text": "Plantation on Crystal River West 82 | Official Site TAKE ME BACK TO THE HOTEL Menus Photos Events Contact Us Reserve Menu Reserve An Authentic Taste of Crystal River scroll down Dine on the Bounty of Florida's West Coast Sorry due to the recent storms we are closed now.  We hope to be reopened in the Sumner of 2025.  Please check back for updates. From sunrise to sunset, West 82° Bar & Grill offers an inspired menu of fresh seafood and local ingredients, alongside dazzling views of Florida wildlife and water canals. Take a seat in the bright veranda space and choose from a special selection of flavors harvested right from the source, or let us cook your own catch for the ultimate experience. Breakfast Daily 7:00AM – 11:00AM Lunch Monday - Saturday 11:00 AM – 2:00 PM Dinner Daily 5:00 PM – 9:00 PM Chef Corner Treat yourself to an exquisite culinary experience at West 82° prepared by our talented Chef, Maria Hilton. Indulge in her expertly crafted scallop recipes, including the mouthwatering Scallop Scampi and the delectable Scallop Gratin. Recipes Hear From Past Restaurant Guests “Great place for breakfast or lunch” “Breakfast buffet is fantastic with fresh choices. Lunch is fantastic. Very relaxing.” Mark W, TripAdvisor “Thank you for a great dining experience” “We ate here while staying at the Plantation in Crystal River. The food was delicious!!” Athenapuppy1, TripAdvisor “Excellent service and food!” “Couldn’t be happier with our choices, their grouper and cedar plank salmon were absolutely delicious!” Lucitta, TripAdvisor Seasonal Features Locally Sourced Weekly Features Seasonal Features Enjoy the freshest meals and menu selections throughout the entire year with exclusive seasonal features at West 82° Bar & Grill. From fall harvest specials and festive holiday favorites to every flavor in between, choose from inspired seasonal tastes made with Florida flair. Learn More Locally Sourced Whether you’re craving crispy gator bites, shrimp and grits, or chowder made with regional corn and crab, West 82° Bar & Grill is the go-to for local cuisine in Crystal River. From breakfast and bar bites to dinner plates, West 82° Bar & Grill offers classic taste and casual upscale ambiance around the clock. VIEW MENU Weekly Features It’s always a good idea to try something new, particularly when our talented culinary team is plating tasty creations at the restaurant every week. Whether you stop in for our breakfast buffet, lunch, drinks, or dinner and a little dessert, check out our flavorful weekly features and enjoy special selections for a limited time. Learn More You Catch, We'll Cook Cook your own catch at West 82° Bar & Grill! Bring in your own cleaned catch of the day - scallops or fish - and our chef will prepare it for you family-style in one of four ways for dinner. And if you prefer to have your fish for lunch, we’ll plate it up with some house-made chips and coleslaw. Learn More The Bar Drinks & Local Bites Connected directly to the lobby at Plantation on Crystal River, the bar at West 82° offers a classic indoor space for guests looking to unwind after a day of excitement. Enjoy sipping on a glass of wine, a chilled martini, or a cool whiskey cocktail, paired with light bites like smoked fish dip and shrimp fried golden brown. Learn More Overlooking Calm Florida Waterways Located at the back of the resort’s main building, West 82° Bar & Grill offers you picturesque views of palm trees and canals leading out to Kings Bay. Take in the natural landscapes from tall glass windows while you enjoy dinner by flickering candlelight, or a breakfast buffet to fuel your day. Gallery Explore It All view gallery Let's Start Planning Interested in reserving a group in our restaurant? We can host up to 25 people (based upon availability). Contact us for details by either calling West 82 Restaurant Manager or filling out the form below. For groups over 25 please reach out to our catering group sales department at catering@PlantationOnCrystalRiver.com or fill out the form on our meetings and events page. Thank you for your interest! Your Name * Your Email Address * Phone * Number of Guests * Date Time Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit 9301 West Fort Island Trail Crystal River, Florida , 34429 Phone: 352.795.4211 Ext (88311) © West 82°  2025. All Rights Reserved. Privacy Policy Accessibility Sitemap Consent Preferences facebook twitter instagram Website Design by Tambourine"
    }
  ]
}