{
  "fuentes": [
    {
      "url": "https://www.plantationadventurecenter.com/",
      "email": "info@plantationcrystalriver.com"
    },
    {
      "url": "https://www.indianlakeestatesinc.com/19th-hole-bar-and-grill/",
      "email": "ileuinfo@ilefl.com"
    },
    {
      "url": "https://www.indianlakeestatesinc.com/19th-hole-bar-and-grill/",
      "email": "office@ilefl.com"
    },
    {
      "url": "https://www.indianlakeestatesinc.com/19th-hole-bar-and-grill/",
      "email": "restmgr19@ilefl.com"
    },
    {
      "url": "https://www.plantationoncrystalriver.com/contact",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.plantationoncrystalriver.com/contact",
      "email": "info@plantationoncrystalriver.com"
    },
    {
      "url": "https://www.west82crystalriver.com/",
      "email": "catering@plantationoncrystalriver.com"
    },
    {
      "url": "https://www.west82crystalriver.com/",
      "email": "info@plantationoncrystalriver.com"
    }
  ],
  "mails": [
    "catering@plantationoncrystalriver.com",
    "forms@tambourine.com",
    "ileuinfo@ilefl.com",
    "info@plantationcrystalriver.com",
    "info@plantationoncrystalriver.com",
    "office@ilefl.com",
    "restmgr19@ilefl.com"
  ],
  "nombre_sitio": "plantationoncrystalriver.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.plantationadventurecenter.com/",
      "text": "Plantation On Crystal River Adventure Center | Official Site TAKE ME BACK TO THE HOTEL (352) 795-5797 Logo Plantation on Crystal River Adventure Center BOOK AN ADVENTURE Manatees & Tours Boating & Fishing Meet the Captains Scalloping Diving Rentals Redfish Classic Menu Call BOOK AN ADVENTURE Experience the Nature Coast Discover the Real Florida scroll down Welcome to the Adventure Center at Plantation Resort on Crystal River Endless Excitement Out on the Water At the Plantation Resort on Crystal River Adventure Center, guests and visitors can fully immerse themselves in the authentic thrill and adventure of Florida’s nature coast. From snorkeling and swimming with manatees to fishing, boating, kayaking, and paddleboarding, if you’re looking to get out on the water, this is the place for you. Swimming With Manatees Get ready for a guided Florida tour like no other. At the Plantation Resort on Crystal River Adventure Center, you can enjoy the unique opportunity to swim with manatees in a safe and protected setting - and you might even come face-to-face with a few! Learn More Boating & Boat Rentals Set out on the water and explore the Nature Coast with one-of-a-kind convenience. The Plantation Resort on Crystal River Adventure Center offers you direct access to guided boating trips, along with individual boat rentals for you to take out on your own. Learn More Fishing Charters Easily charter a boat through the Adventure Center and head out fishing with one of our captains for the day. You’ll find all the fishing equipment you need at our dockside shop, from hooks and lines to rods, reels, and lures. Learn More From Past Visitors “We rented paddleboards and swam with manatees!” “The Adventure Center is great...all the staff were super helpful, and made sure you had a great time!! The boat drivers are all master certified divers who know what they are doing. They spend time sharing information and are passionate about what they do.” Alishia M, TripAdvisor “I would recommend this to anyone.” “Our captain was patient, kind, funny, and very helpful with our very inexperienced group. The experience of swimming with the manatees was better than I would ever hope. Very professional, and the equipment was well taken care of.” William A, TripAdvisor “A great family getaway!” “Don’t go without renting a boat. Take it to the springs - swimming at Three Sisters is a must do!!  Swim with the manatees - the staff is wonderful and it was worth every dime. Kayaking - this is a must. We did some of this everyday!” Rachael P., TripAdvisor The Redfish Classic Tournament With our yearly Redfish Classic fishing tournament, we offer an engaging annual event centered around catching redfish and other prized species in the area, complete with a full weekend of fun and entertainment that’s open to all. Learn More Navigate The Waterways The Plantation Resort on Crystal River Adventure Center is located on the docks of the resort, placing it right beside the Kings Bay Estuary and near a scenic collection of freshwater springs that lead out to Crystal River itself. As Seen on TV The fishing is so great in our neck of the woods that Plantation Resort on Crystal River has been featured on Reel Time Florida Sportsman, Reel Animals with Captain Mike Anderson, Flats Class TV with Captain. CA Richardson, and Livin' the Dream with Captain Jimmy Nelson. Gallery Snapshots 9301 West Fort Island Trail Crystal River, Florida , 34429 Adventure Center: (352) 795-5797 Hotel: (352)795-4211 info@plantationcrystalriver.com Contact Us Privacy Policy Accessibility Sitemap Consent Preferences facebook twitter instagram Website Design by Tambourine © Plantation on Crystal River Adventure Center  2025. All Rights Reserved."
    },
    {
      "url": "https://www.indianlakeestatesinc.com/19th-hole-bar-and-grill/",
      "text": "19th Hole Bar and Grill - Indian Lake Estates Golf & Country Club Skip to primary navigation Skip to main content Facebook Book A Tee Time Pay Online Indian Lake Estates Golf & Country Club Home About Us Events Amenities Facility Information Clubhouse Ballroom Terrace Room & Dining Room Lake Front Pavilion Meeting Rooms Golf Tee Times 9-Hole Par 3 Course 18-Hole Course Memberships Pro Shop ILE Golf Associations ILE Utilities 19th Hole Bar and Grill Owner Resources Documents and Alerts Owner Requests Report a Concern or Feedback Contact 19th Hole Bar and Grill Welcome to the 19th Hole at Indian Lake Estates, FL, where great food meets a relaxed, friendly atmosphere! Whether you’re coming off the golf course or looking for a cozy spot to enjoy a delicious meal, we’ve got something for everyone. Our menu offers a variety of mouthwatering dishes, from juicy burgers and fresh salads to savory steaks and seafood. Kick back with your favorite drink from our fully stocked bar and unwind with beautiful views of the course. Looking for a great place to enjoy game day! Look no further. Our friendly staff and NFL package make game day special with a relaxed, fun atmosphere that’s perfect for sports fans and food lovers alike. Grab your friends, enjoy the game, and celebrate every touchdown with us! At 19th Hole, we pride ourselves on excellent service and a welcoming environment that feels like home. Join us for lunch, dinner, or drinks, and experience the perfect blend of comfort, flavor, and community. Catering for your event is available with advanced notice and planning. Please contact the Restaurant Manager, Andy Ross, at 863-692-2116 or email restmgr19@ilefl.com to schedule your event. Gift Certificates are available at the 19th Hole at amounts from $10 and up. Visit the 19th Hole Facebook page. HOURS MONDAY 11:00 am – 9:00 pm TUESDAY 11:00 am – 9:00 pm WEDNESDAY 11:00 am – 9:00 pm THURSDAY 11:00 am – 9:00 pm FRIDAY 11:00 am – 10:00 pm SATURDAY 11:00 am – 9:00 pm SUNDAY 11:00 am – 9:00 pm Kitchen is open until closing Drink Menu Food Menu Page Footer Contact Us Address : 7510 Red Grange Blvd, Indian Lake Estates, FL 33855 Email Office : office@ilefl.com Email ILE Utilities : ileuinfo@ilefl.com Phone, Pro Shop : 863-692-1514 Phone, Utilities : 863-692-2600 Phone, 19th Hole Restaurant : 863-692-2116 Phone, Admin Office : 863-692-1433 Join E-Club Copyright © 2025 Indian Lake Estates Golf & Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.plantationoncrystalriver.com/contact",
      "text": "Contact Us | Plantation on Crystal River Reservations: (352) 770-8779 RIVER CAM Logo Plantation on Crystal River Events CHECK AVAILABIILITY Accommodations Photos Packages & Offers Our Resort FAQ Upcoming Events Adventure Center Golf Dining West 82 Tiki Bar 19th Hole Maddie's Coffee Company Spa Meetings & Events Weddings Contact Us scroll down Let’s Get In Touch Plantation Resort on Crystal River 9301 W Fort Island Trail Crystal River, FL 34429 (352) 795-4211 Thank you for your interest! Contact Our Team Use the form below to submit any questions you might have, and a member of our team will reach out to you shortly. First Name * Last Name * Email Address * Phone Number Message Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit email signup Stay in the Know Thank you for your interest. Hidden Field First Name Last Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. SIGN UP 9301 West Fort Island Trail Crystal River, FL , 34429 Hotel Direct: 352-795-4211 Reservations: (352) 770-8779 Contact Us FAQ Careers Area Activities Press facebook twitter instagram Privacy Policy Accessibility Sitemap Consent Preferences © Plantation on Crystal River  2025. All Rights Reserved. Resort Website Design By Tambourine"
    },
    {
      "url": "https://www.west82crystalriver.com/",
      "text": "Plantation on Crystal River West 82 | Official Site TAKE ME BACK TO THE HOTEL Menus Photos Events Contact Us Reserve Menu Reserve An Authentic Taste of Crystal River scroll down Dine on the Bounty of Florida's West Coast Sorry due to the recent storms we are closed now.  We hope to be reopened in the Sumner of 2025.  Please check back for updates. From sunrise to sunset, West 82° Bar & Grill offers an inspired menu of fresh seafood and local ingredients, alongside dazzling views of Florida wildlife and water canals. Take a seat in the bright veranda space and choose from a special selection of flavors harvested right from the source, or let us cook your own catch for the ultimate experience. Breakfast Daily 7:00AM – 11:00AM Lunch Monday - Saturday 11:00 AM – 2:00 PM Dinner Daily 5:00 PM – 9:00 PM Chef Corner Treat yourself to an exquisite culinary experience at West 82° prepared by our talented Chef, Maria Hilton. Indulge in her expertly crafted scallop recipes, including the mouthwatering Scallop Scampi and the delectable Scallop Gratin. Recipes Hear From Past Restaurant Guests “Great place for breakfast or lunch” “Breakfast buffet is fantastic with fresh choices. Lunch is fantastic. Very relaxing.” Mark W, TripAdvisor “Thank you for a great dining experience” “We ate here while staying at the Plantation in Crystal River. The food was delicious!!” Athenapuppy1, TripAdvisor “Excellent service and food!” “Couldn’t be happier with our choices, their grouper and cedar plank salmon were absolutely delicious!” Lucitta, TripAdvisor Seasonal Features Locally Sourced Weekly Features Seasonal Features Enjoy the freshest meals and menu selections throughout the entire year with exclusive seasonal features at West 82° Bar & Grill. From fall harvest specials and festive holiday favorites to every flavor in between, choose from inspired seasonal tastes made with Florida flair. Learn More Locally Sourced Whether you’re craving crispy gator bites, shrimp and grits, or chowder made with regional corn and crab, West 82° Bar & Grill is the go-to for local cuisine in Crystal River. From breakfast and bar bites to dinner plates, West 82° Bar & Grill offers classic taste and casual upscale ambiance around the clock. VIEW MENU Weekly Features It’s always a good idea to try something new, particularly when our talented culinary team is plating tasty creations at the restaurant every week. Whether you stop in for our breakfast buffet, lunch, drinks, or dinner and a little dessert, check out our flavorful weekly features and enjoy special selections for a limited time. Learn More You Catch, We'll Cook Cook your own catch at West 82° Bar & Grill! Bring in your own cleaned catch of the day - scallops or fish - and our chef will prepare it for you family-style in one of four ways for dinner. And if you prefer to have your fish for lunch, we’ll plate it up with some house-made chips and coleslaw. Learn More The Bar Drinks & Local Bites Connected directly to the lobby at Plantation on Crystal River, the bar at West 82° offers a classic indoor space for guests looking to unwind after a day of excitement. Enjoy sipping on a glass of wine, a chilled martini, or a cool whiskey cocktail, paired with light bites like smoked fish dip and shrimp fried golden brown. Learn More Overlooking Calm Florida Waterways Located at the back of the resort’s main building, West 82° Bar & Grill offers you picturesque views of palm trees and canals leading out to Kings Bay. Take in the natural landscapes from tall glass windows while you enjoy dinner by flickering candlelight, or a breakfast buffet to fuel your day. Gallery Explore It All view gallery Let's Start Planning Interested in reserving a group in our restaurant? We can host up to 25 people (based upon availability). Contact us for details by either calling West 82 Restaurant Manager or filling out the form below. For groups over 25 please reach out to our catering group sales department at catering@PlantationOnCrystalRiver.com or fill out the form on our meetings and events page. Thank you for your interest! Your Name * Your Email Address * Phone * Number of Guests * Date Time Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit 9301 West Fort Island Trail Crystal River, Florida , 34429 Phone: 352.795.4211 Ext (88311) © West 82°  2025. All Rights Reserved. Privacy Policy Accessibility Sitemap Consent Preferences facebook twitter instagram Website Design by Tambourine"
    }
  ]
}