{
  "query": "playalindabrewingcompany.com email",
  "fuentes": [
    {
      "url": "https://leadiq.com/c/playalinda-brewing-company/5f1c6d4441a5ffb07a6dfa07",
      "email": "john@playalindabrewingcompany.com"
    },
    {
      "url": "https://leadiq.com/c/playalinda-brewing-company/5f1c6d4441a5ffb07a6dfa07",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/playalinda-brewing-company/5f1c6d4441a5ffb07a6dfa07",
      "email": "sales@leadiq.com"
    }
  ],
  "mails": [
    "john@playalindabrewingcompany.com",
    "name@company.com",
    "connect@mortarr.com",
    "sales@leadiq.com"
  ],
  "nombre_sitio": "playalindabrewingcompany.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://leadiq.com/c/playalinda-brewing-company/5f1c6d4441a5ffb07a6dfa07",
      "text": "Playalinda Brewing Company Company Overview, Contact Details & Competitors | LeadIQ Learn more at LeadIQ.com Start free Insights Similar companies Tech Stack Media & News Email Format FAQ Insights Community Engagement Playalinda Brewing Company's focus on locally-sourced ingredients and community partnerships presents opportunities to offer regional suppliers, local ingredient providers, and co-branding collaborations to enhance their authentic brewery experience. Event Partnerships Recent collaborations with local organizations and events like workshops, brunch menus, and food festivals indicate a willingness to partner for event sponsorships, merchandise, and experiential marketing opportunities. Diverse Revenue Streams With a revenue range of $10M to $50M and active engagement in food and beverage events, there is potential to upsell distribution services, packaging solutions, or franchise expansion support to grow their product reach. Digital Presence Growth Their utilization of multiple online platforms suggests a strategic digital footprint that can be expanded through targeted marketing services, e-commerce enhancements, and social media campaigns to increase brand visibility. Market Positioning Operating in a vibrant local food and beverage scene, Playalinda Brewing Company’s energetic brand and community involvement create sales opportunities for craft beverage supplies, event equipment, and local sponsorship deals aimed at leveraging their regional popularity. Similar companies to Playalinda Brewing Company Swamp Head Brewery Hell 'n Blazes Brewing Company Florida Beer Company $10M Explore similar companies Playalinda Brewing Company Tech Stack Playalinda Brewing Company uses 8 technology products and services including WordPress, Squarespace, Shopify, and more. Explore Playalinda Brewing Company 's tech stack below. WordPress Content Management System Squarespace Content Management System Shopify E-commerce Squarespace Commerce E-commerce jQuery Javascript Libraries Underscore.js Javascript Libraries reCAPTCHA Security Contact Form 7 Web Platform Extensions Media & News Playalindabrewingcompany partnered with The Seaside Succulent LLC on Sep 1st '24. Playalinda Brewing Company is partnering with The Seaside Succulent for a September Sips & Succulents Dinosaur Terrarium Workshop! Jul 11, 2024 | www.playalindabrewingcompany.com Playalindabrewingcompany partners with Ross Piper Designs. Playalinda Brewing Company has teamed up with Ross Piper to create the cyclist's dream brew! Aug 12, 2020 | www.rosspiperdesigns.com Playalindabrewingcompany partners with Tastee Donuts. Playalinda Brewing Company is partnering up with a local favorite, Tastee Donuts again this year for a special brunch item in June in observance of National Doughnut Day on June 7th. Jun 06, 2019 | www.playalindabrewingcompany.com Playalindabrewingcompany launches May Brunch Menu. Playalinda Brewing Company is excited to roll out its new May Brunch Menu. May 02, 2019 | www.playalindabrewingcompany.com Florida Today partners with Playalindabrewingcompany. FLORIDA TODAY is joining forces with Playalinda Brewing Company — Brix Project and four local chefs to bring you the Blended Burgers and Brews Bash. Jun 26, 2018 | www.floridatoday.com Playalinda Brewing Company 's Email Address Formats Playalinda Brewing Company uses at least 1 format(s): Playalinda Brewing Company Email Formats Example Percentage FLast@playalindabrewingcompany.com JDoe@playalindabrewingcompany.com 35% First@playalindabrewingcompany.com John@playalindabrewingcompany.com 15% FLast@playalindabrewingcompany.com JDoe@playalindabrewingcompany.com 35% First@playalindabrewingcompany.com John@playalindabrewingcompany.com 15% See more formats Frequently Asked Questions Where is Playalinda Brewing Company 's headquarters located? Playalinda Brewing Company 's main headquarters is located at 5220 S Washington Ave, Titusville, Florida, US . The company has employees across 1 continents, including North America . What is Playalinda Brewing Company 's official website and social media links? Playalinda Brewing Company 's official website is playalindabrewingcompany.com and has social profiles on LinkedIn . How much revenue does Playalinda Brewing Company generate? As of May 2025 , Playalinda Brewing Company 's annual revenue reached $15M . What is Playalinda Brewing Company 's SIC code NAICS code ? Playalinda Brewing Company 's SIC code is 2084 - Wines, Brandy, and Brandy Spirits NAICS code is 722 - Food Services and Drinking Places . How many employees does Playalinda Brewing Company have currently? As of May 2025 , Playalinda Brewing Company has approximately 51 employees across 1 continents, including North America . Key team members include Head Brewer: M. T. President/Co-Owner: B. S. Owner Principal: D. S. . Explore Playalinda Brewing Company 's employee directory with LeadIQ. What industry does Playalinda Brewing Company belong to? Playalinda Brewing Company operates in the Food and Beverage Services industry. What technology does Playalinda Brewing Company use? Playalinda Brewing Company 's tech stack includes WordPress Squarespace Shopify Squarespace Commerce jQuery Underscore.js reCAPTCHA Contact Form 7 . What is Playalinda Brewing Company 's email format? Playalinda Brewing Company 's email format typically follows the pattern of . Find more Playalinda Brewing Company email formats with LeadIQ. Playalinda Brewing Company Food and Beverage Services United States 51-200 Employees COME TOGETHER AND CELEBRATE GOOD TASTE.\n\nAt Playalinda Brewing Company, our goal is simple – To brew the highest quality beer possible, and craft taste experiences worth remembering. We place high priority on incorporating quality ingredients and locally-sourced materials in everything we do. This helps to engage us in an authentic way with our community, and cultivate a sense of pride in every member of our team. Sign up for free to view info Email Format Employee directory Company Overview Headquarters 5220 S Washington Ave, Titusville, Florida, US Website playalindabrewingcompany.com SIC Code 2084 - Wines, Brandy, and Brandy Spirits NAICS Code 722 - Food Services and Drinking Places Employees 51-200 Media & News Playalindabrewingcompany partnered with The Seaside Succulent LLC on Sep 1st '24. Jul 11, 2024 | www.playalindabrewingcompany.com Playalindabrewingcompany partners with Ross Piper Designs. Aug 12, 2020 | www.rosspiperdesigns.com Playalindabrewingcompany partners with Tastee Donuts. Jun 06, 2019 | www.playalindabrewingcompany.com Read more news Funding & Financials $10M $50M Playalinda Brewing Company 's revenue is in the range of $10M $50M Funding & Financials $10M $50M Playalinda Brewing Company 's revenue is in the range of $10M $50M Company Leadership M. T. Head Brewer Mobile Phone Email B. S. President/Co-Owner Mobile Phone Email D. S. Owner Principal Mobile Phone Email D. J. Financial Director Mobile Phone Email J. H. General Manager Mobile Phone Email Employee Directory K. H. General Manager Mobile Phone Email C. C. Manager/Server Mobile Phone Email N. H. Shift Leader Mobile Phone Email A. D. Bartender Mobile Phone Email R. L. Human Resources Generalist Mobile Phone Email Go to Employee Directory Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com © LeadIQ, Inc. All rights reserved."
    }
  ]
}