{
  "fuentes": [
    {
      "url": "https://playparadisecoast.com/naples-build-it-and-they-will-come/",
      "email": "jerale-baughn@sportsfacilities.com"
    },
    {
      "url": "https://playparadisecoast.com/contact/pcsc-team/",
      "email": "amoses@playparadisecoast.com"
    },
    {
      "url": "https://hotelguides.com/florida/paradise-coast-sports-complex-hotels.html",
      "email": "rewards@hotelguides.com"
    },
    {
      "url": "https://hotelguides.com/florida/paradise-coast-sports-complex-hotels.html",
      "email": "service@hotelguides.com"
    },
    {
      "url": "https://paradiseresort.com.au/contact",
      "email": "book@paradiseresort.com.au"
    },
    {
      "url": "https://paradiseresort.com.au/contact",
      "email": "hr@paradiseresort.com.au"
    },
    {
      "url": "https://paradiseresort.com.au/contact",
      "email": "newsletter@paradiseresort.com.au"
    },
    {
      "url": "https://naples.floridaweekly.com/articles/impact-of-colliers-paradise-coast-sports-complex-has-already-begun/",
      "email": "jdickerson@floridaweekly.com"
    },
    {
      "url": "https://www.theparadiseisle.com/contact-us.html",
      "email": "sales@theparadiseisle.com"
    },
    {
      "url": "https://www.forgottencoastathletics.com/about-us",
      "email": "info@forgottencoastathletics.com"
    },
    {
      "url": "https://www.naples2night.com/post/welcome-to-paradise-coast-sports-complex-your-gateway-to-unparalleled-branding-and-partnership-oppo",
      "email": "info@naples2night.com"
    },
    {
      "url": "https://www.naples2night.com/post/welcome-to-paradise-coast-sports-complex-your-gateway-to-unparalleled-branding-and-partnership-oppo",
      "email": "jwalters@playparadisecoast.com"
    },
    {
      "url": "https://paradisecooperative.org/contact-us/",
      "email": "community@paradisecooperative.org"
    },
    {
      "url": "https://paradisecooperative.org/contact-us/",
      "email": "schools@paradisecooperative.org"
    },
    {
      "url": "https://paradisecooperative.org/contact-us/",
      "email": "team@paradisecooperative.org"
    }
  ],
  "mails": [
    "amoses@playparadisecoast.com",
    "book@paradiseresort.com.au",
    "community@paradisecooperative.org",
    "hr@paradiseresort.com.au",
    "info@forgottencoastathletics.com",
    "info@naples2night.com",
    "jdickerson@floridaweekly.com",
    "jerale-baughn@sportsfacilities.com",
    "jwalters@playparadisecoast.com",
    "newsletter@paradiseresort.com.au",
    "rewards@hotelguides.com",
    "sales@theparadiseisle.com",
    "schools@paradisecooperative.org",
    "service@hotelguides.com",
    "team@paradisecooperative.org"
  ],
  "nombre_sitio": "playparadisecoast.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://playparadisecoast.com/naples-build-it-and-they-will-come/",
      "text": "Naples - Build it, and they will come | Paradise Coast Sports Complex Skip to content Home Explore PCSC Explore PCSC Collier County Complex Photo Gallery The Cove The Factory The Great Lawn & Lake Trail Custom Threads Park Map Complex Progress Spring/Summer Fan Guide Weather at PCSC Frequently Asked Questions Policies Privacy Policy For Locals The Cove Fuel Food Truck Live @ The Cove The Factory The Great Lawn & Lake Trail Movies In Paradise Game Of The Week at PCSC Custom Threads Collier County Open Play Field Use Local Programming Groups Paradise Club Rewards Calendar FC NAPLES PCSC News Schedule Event Plan a party at PCSC Suite packages at PCSC Event Tickets at PCSC Event broadcasts at PCSC Stadium Plan Trip Excursion Opportunities Connect Contact Us Latest News Current PCSC Newsletter PCSC In The News Visit our Partners PCSC Client Testimonials Our PCSC Team Apply At PCSC Home Explore PCSC Explore PCSC Collier County Complex Photo Gallery The Cove The Factory The Great Lawn & Lake Trail Custom Threads Park Map Complex Progress Spring/Summer Fan Guide Weather at PCSC Frequently Asked Questions Policies Privacy Policy For Locals The Cove Fuel Food Truck Live @ The Cove The Factory The Great Lawn & Lake Trail Movies In Paradise Game Of The Week at PCSC Custom Threads Collier County Open Play Field Use Local Programming Groups Paradise Club Rewards Calendar FC NAPLES PCSC News Schedule Event Plan a party at PCSC Suite packages at PCSC Event Tickets at PCSC Event broadcasts at PCSC Stadium Plan Trip Excursion Opportunities Connect Contact Us Latest News Current PCSC Newsletter PCSC In The News Visit our Partners PCSC Client Testimonials Our PCSC Team Apply At PCSC Facebook-square Twitter-square Instagram Youtube-square Sun Paradise Coast Sports Complex - Build it, and they will come Build it, and they will come. That was one of the signature lines in the Kevin Costner baseball movie “Field Of Dreams”, but it could also be applied to the sprawling, 175-acre Paradise Coast Sports Complex that is delivering countless experiences for athletes and fans alike in Collier County. Emerging from what was dense native forest land just off State Road 951 (Collier Boulevard for those newer to the area) by Exit 101 at I-75, Paradise Coast Sports Complex is the crown jewel in the City Gate development. Once City Gate is complete, it will house several hotels – including the Great Wolf Lodge set to begin construction in 2022 – as well as the massive, nearly 1-million-square-foot ULine distribution center. A complex for all seasons What makes Paradise Coast Sports Complex unique, not just to Collier County but all of Southwest Florida, is its sheer size and offerings for teams, tournaments and residents alike. At $150 million once complete, Paradise Coast Sports Complex currently includes five full-sized artificial turf fields capable of hosting soccer, football, lacrosse and field hockey – the most impressive of which is inside the 3,500-seat PCSC Stadium that sports a gigantic video board. The PCSC Stadium isn’t just for sports, either. Paradise Coast Sports Complex welcomed the Collier County Appreciation Concert featuring the Ben Allen Band in June 2020 to a near-sellout crowd that rocked out with Allen for over two hours before a massive fireworks show ended the evening. The flexibility of the complex was on full display that weekend, too, as Naples United – one of three semi-professional soccer teams in the city that call PCSC home – played a match inside the stadium less than 24 hours after revelers packed the stands and enjoyed a night of entertainment. In addition to Naples United, which competes in the National Premier Soccer League, the PCSC Stadium is home to United Premier Soccer League teams Naples City Football Club and the Azzurri Storm – which often plays doubleheaders on weekends in the spring and fall. Part of the allure of Paradise Coast Sports Complex to these teams is that PCSC Stadium also boasts locker room facilities for both teams and officials, and the covered main seating area offers suites for sponsors and guests. Any given night at Paradise Coast Sports Complex shows its multi-faceted capability. Soccer teams practicing on one field next to a set of football cheerleaders working through routines on another, with lacrosse players learning the intricacies of their sport on a third. One of Paradise Coast Sports Complex’s biggest partnerships has been with the Pop Warner football teams in the Peace River Conference, which comprises 19 youth football and cheer organizations from Naples through Lehigh Acres and up to Venice and Sarasota. The five Collier County Pop Warner teams played home games in 2020 and 2021, and PCSC also hosted regional events at the facility. Each of Collier County’s five Pop Warner organizations have between 250 and 300 cheerleaders and football players. Paradise Coast Sports Complex and Football University also enjoy a multi-year partnership that has FBU hosting six premier events at the complex throughout the year. Top Gun, which attracts more than 1,200 athletes annually for the four-day, invitation-only camp, is in July. And all-star teams from all over the country qualify to play for the right to be called the nation’s best at the FBU National Championship each December. During FBUNC week, 120 of the top student-athletes in their graduating class are chosen to play under the lights during the FBU Freshman All-American Bowl. And all that action can happen either under the sparkling blue skies that make the Paradise Coast famous, or under a state-of-the-art LED lighting system by Musco that can create near-daylight conditions. “We strive to make everyone feel welcome at Paradise Coast Sports Complex, and to give athletes, coaches, teams and fans that practice and play here a world-class experience,” PCSC interim general manager Adrian Moses said. “The vision of this complex is to support both Collier County as well as regional and national tournaments, and our staff works to offer a best-in-class venue. Our partners all share in this vision, and we are excited by the level of play they bring every time we open our gates to them.” More growth to come Ongoing construction of a new phase at Paradise Coast Sports Complex truly shows the magnitude. Five more full-sized multi-purpose fields will be paired with six baseball diamonds and five softball diamonds – all framed by a trio of lakes and plenty of parking. Those fields, all artificial turf like the ones in Phase One, will be fully transformable to accommodate different sports – including shortening baselines on the diamonds for different levels of baseball and softball. Don’t think Paradise Coast Sports Complex is about, well, just sports. The Cove beer and wine bar is set alongside a gorgeous lake that provides the kind of sunset views that make Southwest Florida famous. Live music entertains guests many nights, and food trucks – both the PCSC’s own “Fuel” truck and visiting vendors cooking up their delicious treats – makes every night unique at The Cove. “Sunset Saturdays is a new Naples tradition,” PCSC Cove-meister Jimbo Mann said. “It is set in The Cove, with one of our famous local reggae bands even make the palm trees sway. Come down and enjoy it!” Mann and his crew don’t just serve up great food and drink, as The Cove offers perhaps the most beautiful backdrop around to play on-site table tennis, cornhole or even giant Jenga. And if watching the big game at The Cove is more your thing, the PCSC Stadium’s giant video board has a twin – this one facing the Great Lawn and The Cove to broadcast sports on the biggest television in the county. Next to The Cove is another area completely unique to Collier County – The Factory. Stocked with equipment and challenges to test even the fittest of souls, The Factory is an open-air weight room and fitness facility that provides beautiful sunrises each morning to feed your soul while also testing and improving your physical well-being. “What’s unique about The Factory is that it’s the only outside gym facility in Naples!” Factory manager Aisha Denault-Sweet said. “I personally enjoy this facility because I’m able to watch the sunrise every morning. Not only am I really getting a great sweat out from a hard workout, but I’m also able to get a suntan while doing so. The members are fantastic, and everyone is always friendly/outgoing.” The Factory’s Movestrong obstacle course is perfect for ninja warrior-style training, and equipment is available for Spartan and Tough Mudder training as well. Want just a serene place to run and warm up before hitting the weights? The Factory offers that as well! Daily, monthly and annual membership options are available. Looking for a quiet, serene stroll? The lake next to The Cove has been expanded due to the Uline facility construction – with a wide, paved walkway winding around the one-mile lake’s edge the perfect spot to walk or run a few laps. Smaller concerts, community events and even drive-in movies have found the Great Lawn at Paradise Coast Sports Complex the perfect spot to congregate and enjoy the area’s fine weather. Poised for a huge 2022 Managed by Sports Facilities Companies, which operates similar venues throughout the country, Paradise Coast Sports Complex is poised to turn Collier County into a mecca of youth and amateur athletics. Building off the success of last year, 2022 is shaping up to be a gigantic time for Paradise Coast Sports Complex. Among the signature events on the calendar is a concert by the band Air Supply on March 26 at the PCSC Stadium – allowing “AirHeads” and fans of great 1980s music a chance to rock out under the stars. College lacrosse fans will have plenty to cheer about this spring, too, as Ohio State plays Harvard in a men’s game in the PCSC Stadium in late February, and the Yale women take on the Notre Dame women in mid-March. Jeff Walters, the complex’s business development manager, called the relationship with the county a “dual partnership.” “We’re in business with Collier County,” Walters said. “Collier County funded the project and we’ve been brought in to manage and program the facility.” Another facet of what makes Paradise Coast Sports Complex special is proximity to just about everything. The complex is on the way to Marco Island via SR 951, and exit 101 is just 27 miles south of Exit 128, which leads motorists to Southwest Florida International Airport. PCSC is also positioned right at the bend on I-75 heading to and from the Miami-Fort Lauderdale metroplex – allowing maximum airport flexibility for visiting teams and athletes as well as attracting competitors and visitors from the East coast. “This complex is a shining star, and we are eager for everyone in Collier County to come out and find out just how great it is,” Moses said. “As we expand and realize the full vision of what Paradise Coast Sports Complex can be, we can’t wait to host all the events coming our way.” Join Our Newsletter Subscribe Home Tournaments Explore the Park Plan Your Trip Apply at PCSC Contact Us © 2025 Paradise Coast Sports Complex. All Rights Reserved. Terms & Conditions."
    },
    {
      "url": "https://playparadisecoast.com/contact/pcsc-team/",
      "text": "Our Paradise Coast Sports Complex Team - Paradise Coast Sports Complex Skip to content Home Explore PCSC Explore PCSC Collier County Complex Photo Gallery The Cove The Factory The Great Lawn & Lake Trail Custom Threads Park Map Complex Progress Spring/Summer Fan Guide Weather at PCSC Frequently Asked Questions Policies Privacy Policy For Locals The Cove Fuel Food Truck Live @ The Cove The Factory The Great Lawn & Lake Trail Movies In Paradise Game Of The Week at PCSC Custom Threads Collier County Open Play Field Use Local Programming Groups Paradise Club Rewards Calendar FC NAPLES PCSC News Schedule Event Plan a party at PCSC Suite packages at PCSC Event Tickets at PCSC Event broadcasts at PCSC Stadium Plan Trip Excursion Opportunities Connect Contact Us Latest News Current PCSC Newsletter PCSC In The News Visit our Partners PCSC Client Testimonials Our PCSC Team Apply At PCSC Home Explore PCSC Explore PCSC Collier County Complex Photo Gallery The Cove The Factory The Great Lawn & Lake Trail Custom Threads Park Map Complex Progress Spring/Summer Fan Guide Weather at PCSC Frequently Asked Questions Policies Privacy Policy For Locals The Cove Fuel Food Truck Live @ The Cove The Factory The Great Lawn & Lake Trail Movies In Paradise Game Of The Week at PCSC Custom Threads Collier County Open Play Field Use Local Programming Groups Paradise Club Rewards Calendar FC NAPLES PCSC News Schedule Event Plan a party at PCSC Suite packages at PCSC Event Tickets at PCSC Event broadcasts at PCSC Stadium Plan Trip Excursion Opportunities Connect Contact Us Latest News Current PCSC Newsletter PCSC In The News Visit our Partners PCSC Client Testimonials Our PCSC Team Apply At PCSC Facebook-square Twitter-square Instagram Youtube-square Sun Our Paradise Coast Sports Complex Team Led by General Manager Adrian Moses, the Paradise Coast Sports Complex staff is committed to help make your event, party, game, tournament or showcase a success. Each staff member can be reached via e-mail by clicking their photo, and PCSC can be reached by calling (239) 252-4386. Adrian Moses General Manager | [email protected] Michael Lieberman Assistant General Manager Nicholas B. Donatelli Food & Beverage Director Jeff Walters Business Development Director Scott Cornwell Director of Operations J.P. Terrasi Marketing Manager Alicia Graffam Finance Manager Jason Baumgardner Tournament & Event Director Paola Mojica Retail Manager Aisha Denault-Sweet The Factory Manager Rene Valdes Food & Beverage Executive Chef John Morrison Operations Manager Lyric Feingold-Conaway Events Manager Jon Triaga Stadium Operations Manager Mackenzie White Food & Beverage Supervisor Brooke Chitwood F&B Event/Banquet Coordinator Robbie Griffin III Marketing Specialist Brett Szymanski Local Programming Coordinator Stefanie Bolinger Office Administrator Logan Luhowy Sports Coordinator Alison Settembrini Events Intern Olivia Long Events Intern Logan McDonald Events Intern Robbie Barnicoat Facility Operations Team Member Join Our Newsletter Subscribe Home Tournaments Explore the Park Plan Your Trip Apply at PCSC Contact Us © 2025 Paradise Coast Sports Complex. All Rights Reserved. Terms & Conditions."
    },
    {
      "url": "https://hotelguides.com/florida/paradise-coast-sports-complex-hotels.html",
      "text": "We use cookies to make our website easier for you to use. We do not track you when you leave. Accept 25 Hotels TRULY CLOSEST to Paradise Coast Sports Complex, Naples, FL | HotelGuides.com US Hotels Canada Hotels Other Countries Hotels near Attractions My Reservations Contact Us See Rates for Hotels near Paradise Coast Sports Complex Address Search Pet friendly hotels Pet Friendly Only Check in month Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec Check in day 01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Check in year 2020 2021 2022 Check in date Check out month Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec Check out day 01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Check out year 2020 2021 2022 Check out date Number of rooms 1 room 2 rooms 3 rooms 4 rooms 5 rooms 6 rooms 7 rooms 8 rooms 9 rooms 10+ rooms Number of adults 1 adult 2 adults 3 adults 4 adults 5 adults The hotels below are listed in order of their distance from Paradise Coast Sports Complex. Hotels > Sports Complexes > Florida Sports Complexes > Hotels near Paradise Coast Sports Complex Hotels near Paradise Coast Sports Complex – Naples, FL Address: 3940 City Gate Blvd North , Naples , FL 34117 Zoom in (+) to see interstate exits, restaurants, and other attractions near hotels. Enter your dates to see matching rates. 1 room 2 rooms 3 rooms 4 rooms 5 rooms 6 rooms 7 rooms 8 rooms 9 rooms 10+ 1 adult 2 adults 3 adults 4 adults 5 adults Cancel 1. Fairfield Inn & Suites by Marriott Naples - I-75, Exit 101 3808 White Lake Blvd, I-75, Exit 101, Naples, FL 34117 Call Us 0.8 mile 0.8 mile from Paradise Coast Sports Complex Enter Dates From $79 Check In 1500 Check Out 1100 Rated High Upper-midscale, smoke-free hotel Near Forest Glen Golf Course 4 floors, 109 rooms and suites Outdoor swimming pool open all year - exercise room Microwave and refrigerator in every room Free hot breakfast buffet Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 306 reviews Read Recent Reviews More Reviews \"Good, clean room. The bathroom needed upgrading and an exhaust fan, and the mirror was poorly placed. I didn't like having the coffee maker in the bathroom. Stay at this hotel. 2023-10-13 \" \"We had a wonderful stay and recommend this hotel. The front desk clerk was kind and helpful. 2023-06-28 \" \"The hotel was clean, and parking was great. 2023-05-08 \" < Hide 2. SpringHill Suites by Marriott Naples - I-75, Exit 101 3798 White Lake Blvd, I-75, Exit 101, Naples, FL 34117 Call Us 0.8 mile 0.8 mile from Paradise Coast Sports Complex Enter Dates From $209 Check In 1500 Check Out 1100 Rated High Upscale, smoke-free, all-suite hotel Near Forest Glen Golf Course 8 miles from downtown Naples 4 floors, 102 studio suites Outdoor swimming pool open in summer Exercise room Microwave and refrigerator in every suite Free hot breakfast buffet Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 291 reviews Read Recent Reviews More Reviews \"The hotel staff was professional and friendly, and provided great personal attention. Good choice. 2021-09-12 \" \"Good hotel stay. 2016-12-14 \" < Hide 3. Woodspring Suites Golden Gate Naples - I-75, Exit 101 3786 Whitelake Blvd, I-75, Exit 101, Naples, FL 34117 Call Us 0.8 mile 0.8 mile from Paradise Coast Sports Complex Enter Dates From $120 Check In 15 00 Check Out 11 00 Rated Low – Not Recommended Budget, smoke-free, all-suite, extended-stay hotel Near Forest Glen Golf Course 4 floors, 123 studio suites No swimming pool Kitchen in every suite Free WiFi Free parking - truck parking Pet friendly hotel More > - allows dogs up to 75 pounds only, 2 dogs per suite - $50 pet fee for each dog for 1st night - $10 fee for each dog for each night thereafter. - Oct 2020 < Less Note: Some WoodSpring Suites charge a weekly rate, even if you stay just one night. TripAdvisor Traveler Rating: Based on 24 reviews Read Recent Reviews More Reviews \"Good hotel. 2021-08-29 \" \"The hotel is OK if you're in a bind, but it was gross. The TV didn't work, and the bedspread didn't look clean. The bedsheets did, though. The clientele was sketchy. The staff was nice. Don't stay here. 2021-05-02 \" < Hide 4. Super 8 Motel Naples - I-75, Exit 101 3880 Tollgate Blvd, I-75, Exit 101, Naples, FL 34114 Call Us 0.8 mile 0.8 mile from Paradise Coast Sports Complex Enter Dates From $107 Check In 1600 Check Out 1100 Rated Average Cheap motel near Forest Glen Golf Course 2 floors, 91 rooms - no elevator Some smoking rooms Outdoor swimming pool open all year Microwave and refrigerator in every room Free continental breakfast Free WiFi Free parking - truck parking Pet friendly motel More > - $30 per night fee for each pet. - Aug 2021 < Less TripAdvisor Traveler Rating: Based on 451 reviews Read Recent Reviews More Reviews \"Nice motel. The room was clean and well-maintained, and the staff was friendly. 2021-12-09 \" \"The motel room was fine, but the remote registration and such were cumbersome. 2021-11-25 \" \"The motel wasn't fancy. There was trouble getting the fire alarm fixed. 2021-02-02 \" < Hide 5. Holiday Inn Express & Suites South Naples - I-75, Exit 101 3837 Tollgate Blvd, I-75, Exit 101, Naples, FL 34114 Call Us 1.0 mile 1.0 mile from Paradise Coast Sports Complex Enter Dates From $80 Check In 15 00 Check Out 11 00 Rated Average Upper-midscale, smoke-free hotel Near Forest Glen Golf Course 3 floors, 68 rooms and suites - elevator Outdoor swimming pool open all year - exercise room Microwave and refrigerator in every room Free hot breakfast buffet Free WiFi Free parking - truck parking Not pet friendly TripAdvisor Traveler Rating: Based on 68 reviews Read Recent Reviews More Reviews \"I had a bad stay at this hotel. Don't stay here. 2015-02-11 \" < Hide 6. La Quinta Inn & Suites Naples - I-75, Exit 101 185 Bedzel Circle, I-75, Exit 101, Naples, FL 34104 Call Us 1.1 miles 1.1 miles from Paradise Coast Sports Complex Enter Dates From $68 Check In 15 00 Check Out 12 00 Rated High Midscale, smoke-free hotel near Forest Glen Golf Course 6 miles northeast of downtown Naples 6.5 miles from Naples Airport 4 floors, 103 rooms and suites No shuttle to Naples Airport Heated outdoor swimming pool open in summer Exercise room Microwave and refrigerator in every room Free continental breakfast Free WiFi Free parking Park and fly not allowed Pet friendly hotel More > - allows up to 2 pets per room - no pet fee. - Jul 2021 < Less TripAdvisor Traveler Rating: Based on 649 reviews Read Recent Reviews More Reviews \"The hotel was calm and peaceful. Coffee and tea were always available. I enjoyed sitting in the sun by the pool. 2023-04-02 \" \"We've stayed at this hotel several times and appreciate being able to bring our cat. Definitely stay here. 2022-12-27 \" \"The hotel breakfast was just granola bars, fruit cups, and water. 2021-04-13 \" < Hide 7. Best Western Naples Plaza Hotel - I-75, Exit 107 6400 Dudley Drive, I-75, Exit 107, Naples, FL 34105 Call Us 5 miles 5 miles from Paradise Coast Sports Complex Enter Dates From $136 Check In 1500 Check Out 1100 Rated High Midscale, smoke-free hotel near I-75, Exit 107 Also near Vineyards 4 floors, 240 rooms and suites Heated outdoor swimming pool - 24-hour exercise room Free hot breakfast buffet Free WiFi Free parking - truck parking Not pet friendly TripAdvisor Traveler Rating: Based on 932 reviews Read Recent Reviews More Reviews \"Decent hotel room, but the bathroom fan was loud, and it came on automatically with the light. 2021-12-23 \" \"Comfortable hotel room and friendly personnel. Bring your own coffee. 2020-01-14 \" \"This hotel was an excellent place to stay. I loved the beds and multiple pillows. Nice amenities. The complimentary breakfast was OK. 2019-03-01 \" < Hide 8. Hawthorn Suites by Wyndham Naples - I-75, Exit 107 3557 Pine Ridge Road, I-75, Exit 107, Naples, FL 34109 Call Us 5 miles 5 miles from Paradise Coast Sports Complex Enter Dates From $229 Check In 1500 Check Out 1100 Rated Very High Midscale, smoke-free, all-suite, extended-stay hotel Near I-75, Exit 107, and The Vineyards 3 floors, 82 suites - elevator Heated outdoor swimming pool - exercise room Kitchen in every suite Free hot breakfast buffet Free WiFi Free parking Pet friendly hotel More > - $75 per stay pet fee. - Aug 2021 < Less TripAdvisor Traveler Rating: Based on 1458 reviews Read Recent Reviews More Reviews \"Close to restaurants and some stores. Easy interstate access. The hotel was outdated. 2021-03-11 \" \"Average accommodations. The hotel was outdated but clean. 2021-03-09 \" \"Great experience. The hotel and room were clean, and all the employees were kind and professional. There were many amenities to make one's stay comfortable. Shampoo was provided, but there was no hair conditioner. I enjoyed my stay and recommend it. 2021-02-23 \" < Hide 9. Home2 Suites by Hilton Pine Ridge Road Naples - I-75, Exit 107 3685 Kramer Drive, I-75, Exit 107, Naples, FL 34109 Call Us 5 miles 5 miles from Paradise Coast Sports Complex Enter Dates From $175 Check In 16 00 Check Out 11 00 Rated Very High Upper-midscale, smoke-free, all-suite, extended-stay hotel Near I-75, Exit 107 3 floors, 99 studio and 1-bedroom suites - elevator Outdoor swimming pool open all year - exercise room Kitchen in every suite Free continental breakfast Free WiFi Free parking Pet friendly hotel More > - $100 per stay pet fee. - May 2020 < Less TripAdvisor Traveler Rating: Based on 71 reviews Read Recent Reviews < Hide 10. WoodSpring Suites West Naples 2600 Tamiami Trail East, Naples, FL 34112 Call Us 7 miles 7 miles from Paradise Coast Sports Complex Enter Dates From $155 Check In 15 00 Check Out 11 00 Rated Average Budget, smoke-free, all-suite, extended-stay hotel Near Naples Bay 4 floors, 122 studio suites No swimming pool Kitchen in every suite Free WiFi Free parking Pet friendly hotel More > - allows dogs in 1st and 2nd floor suites only - $50 pet fee for each dog for 1st night - $10 fee for each dog for each night thereafter. - Oct 2020 < Less TripAdvisor Traveler Rating: Based on 24 reviews Read Recent Reviews < Hide 11. Staybridge Suites Naples 9401 Triangle Blvd, Naples, FL 34113 Call Us 7 miles 7 miles from Paradise Coast Sports Complex Enter Dates From $168 Check In 16 00 Check Out 11 00 Rated Very High Upscale, smoke-free, all-suite, extended-stay hotel 4 floors, 103 studio and 1-2 bedroom suites Outdoor swimming pool open all year - exercise room Poolside lounge Kitchen in every suite Free hot breakfast buffet Free WiFi Free parking Pet friendly hotel More > - allows pets up to 80 pounds, 2 pets per room - $75 pet fee if staying 7 nights or less - $150 pet fee if staying 8 nights or more. - Sep 2019 < Less TripAdvisor Traveler Rating: Based on 70 reviews Read Recent Reviews < Hide 12. Red Roof Plus+ Inn & Suites Naples 1925 Davis Blvd, Naples, FL 34104 Call Us 7 miles 7 miles from Paradise Coast Sports Complex Enter Dates From $68 Check In 15 00 Check Out 11 00 Rated Average Midscale, smoke-free motel 2 miles from Naples Airport No shuttle to Naples Airport Outdoor swimming pool open in summer Free WiFi Free parking - truck parking Free park and fly up to 7 nights only Pet friendly motel More > - no pet fee. - Feb 2017 < Less TripAdvisor Traveler Rating: Based on 704 reviews Read Recent Reviews More Reviews \"The motel wasn't bad, but I had a little trouble getting into the room, and I could smell marijuana from another room. 2022-11-06 \" \"Close to I-75, shops, and an IHOP. The hotel staff was welcoming and helpful. 2018-12-22 \" \"Good motel, and close to 5th Avenue. 2018-03-10 \" < Hide 13. Holiday Inn Express & Suites Naples 1785 Fifth Avenue South, Naples, FL 34102 Call Us 7 miles 7 miles from Paradise Coast Sports Complex Enter Dates From $120 Check In 16 00 Check Out 11 00 Rated Very High Upper-midscale, smoke-free hotel 2 miles from Naples Airport This hotel is near downtown Naples. 4 floors, 123 rooms and suites No shuttle to Naples Airport Outdoor swimming pool open in summer Exercise room Free hot breakfast buffet Free WiFi Free parking Park and fly not allowed Not pet friendly TripAdvisor Traveler Rating: Based on 869 reviews Read Recent Reviews More Reviews \"Great hotel stay. You have to try it. 2016-05-25 \" < Hide 14. La Quinta Inn & Suites Airport Naples 1555 Fifth Avenue South, Naples, FL 34102 Call Us 7 miles 7 miles from Paradise Coast Sports Complex Enter Dates From $68 Check In 15 00 Check Out 11 00 Rated Average Midscale, smoke-free hotel 2 miles from Naples Airport This hotel is near downtown Naples. 3 floors, 114 rooms and suites - elevator No shuttle to Naples Airport Outdoor swimming pool open in summer Exercise room Microwave and refrigerator in every room Free continental breakfast Free WiFi Free parking Park and fly not allowed Pet friendly hotel More > - no pet fee. - Jan 2017 < Less TripAdvisor Traveler Rating: Based on 892 reviews Read Recent Reviews More Reviews \"Hotel room was clean, and the employees were nice. A good experience. 2015-03-12 \" < Hide 15. Hyatt House 5th Avenue Naples 1345 5th Avenue South, Naples, FL 34102 Call Us 7 miles 7 miles from Paradise Coast Sports Complex Enter Dates From $176 Check In 15 00 Check Out 12 00 Rated Very High Upscale, smoke-free, all-suite, extended-stay hotel Located in downtown Naples 3 floors, 183 studio to 2-bedroom suites - elevator Free shuttle to local attractions Heated outdoor swimming pool - 24-hour exercise room Microwave and refrigerator in every room Free hot breakfast buffet Free WiFi Parking costs $12 per night Pet friendly hotel More > - allows pets up to 45 pounds, 2 pets per room - $175 pet fee if staying 7 nights or more - $75 pet fee if staying fewer than 7 nights. - Aug 2016 < Less TripAdvisor Traveler Rating: Based on 2447 reviews Read Recent Reviews More Reviews \"A horrible experience. Our whole stay was a mess. Don't stay at this hotel. 2019-10-05 \" < Hide 16. Bayfront Inn 5th Avenue Naples 1221 5th Avenue South, Naples, FL 34102 Call Us 7 miles 7 miles from Paradise Coast Sports Complex Enter Dates From $315 Check In 15 00 Check Out 11 00 Rated High Midscale, smoke-free, full-service, waterfront hotel 3 miles from Naples Airport 4 floors, 97 rooms and suites No shuttle to Naples Airport Free shuttle to other attractions within 5-mile radius Heated outdoor swimming pool open all year - exercise room Restaurant - lounge Free continental breakfast Free WiFi Free parking Park and fly not allowed Not pet friendly TripAdvisor Traveler Rating: Based on 1148 reviews Read Recent Reviews < Hide 17. Bellasera Resort Naples 221 9th Street South, Naples, FL 34102 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $153 Check In 15 00 Check Out 11 00 Rated Very High Upscale, smoke-free, full-service, all-suite hotel 3 miles from Naples Airport 3 floors, 100 studio to 3-bedroom suites - elevator Free shuttle to Naples Airport Free shuttle to other attractions within 3-mile radius Heated outdoor swimming pool open all year - exercise room Restaurant - lounge - room service Not pet friendly Note: This hotel charges a resort fee of $18 per night - includes parking and WiFi. TripAdvisor Traveler Rating: Based on 1811 reviews Read Recent Reviews < Hide 18. Charter Club Resort of Naples Bay 1000 10th Avenue South, Naples, FL 34102 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $265 Check In 1600 Check Out 1000 Upscale, smoke-free, downtown condos Steps from the beach 3.5 miles from Naples Airport 3 floors, 33 2-bedroom condos - no elevator No shuttle to Naples Airport Heated outdoor swimming pool open all year Tiki bar Free WiFi Free parking Park and fly not allowed Not pet friendly < Hide 19. Ramada Inn Naples 1100 Tamiami Trail North, Naples, FL 34102 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $83 Check In 1500 Check Out 1100 Rated High Midscale, smoke-free motel On Tamiami Trail North, US 41 Less than 1 mile from beach and Gulf of Mexico 6 miles from Naples Airport 2 floors, 137 rooms - no elevator Heated outdoor swimming pool - exercise room Microwave and refrigerator in every room Free hot breakfast buffet Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 1835 reviews Read Recent Reviews More Reviews \"The bathroom was really small. The motel staff was courteous and helpful. 2020-11-10 \" \"Great location and a good value. The motel was clean, and the entire staff was friendly and efficient. I recommend. 2015-04-13 \" < Hide 20. Cove Inn on Naples Bay 900 Broad Avenue South, Naples, FL 34102 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $110 Check In 15 00 Check Out 11 00 Rated Very High Midscale, smoke-free. downtown, waterfront motel 3 floors, 102 rooms - elevator Outdoor swimming pool Restaurant - poolside bar Restaurant open for breakfast only Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 946 reviews Read Recent Reviews More Reviews \"Everything about this hotel was excellent. 2018-09-17 \" < Hide 21. Best Western Inn & Suites Naples 2329 9th Street North, Naples, FL 34103 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $204 Check In 1500 Check Out 1100 Rated Very High Midscale, smoke-free hotel near Tamiami Trail North, US 41 Heated outdoor swimming pool open all year Microwave and refrigerator in every room Free continental breakfast Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 2571 reviews Read Recent Reviews < Hide 22. Inn on 5th Naples 699 5th Avenue South, Naples, FL 34102 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $324 Check In 16 00 Check Out 12 00 Rated Very High Upscale, smoke-free, downtown hotel 2 miles from Naples Pier 2 buildings - 3 floors, 119 rooms and suites - elevator Outdoor swimming pool open all year - exercise room Full-service spa Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 4267 reviews Read Recent Reviews < Hide 23. Courtyard by Marriott Hotel Naples 3250 Tamiami Trail North, Naples, FL 34103 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $88 Check In 1500 Check Out 1200 Rated High Upscale, smoke-free hotel 2 miles from beach On Tamiami Trail North - in downtown Naples 4 floors; 98 rooms, 4 suites Outdoor swimming pool - exercise room Restaurant - lounge Restaurant open for breakfast and dinner only Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 511 reviews Read Recent Reviews More Reviews \"There was no microwave in my hotel room. 2017-08-17 \" \"All the hotel employees were friendly. Easy checkout. 2015-07-21 \" < Hide 24. Hampton Inn Naples 3210 Tamiami Trail North, Naples, FL 34103 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $108 Check In 15 00 Check Out 12 00 Rated Average Upper-midscale, smoke-free hotel near Tamiami Trail North, US 41 4 floors, 107 rooms Outdoor swimming pool - exercise room Free hot breakfast buffet Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 895 reviews Read Recent Reviews More Reviews \"The hotel was OK. I went to the front desk for a shower cap, and wasn't greeted pleasantly. I was given 2 makeup remover packages in error. I asked for a bottle of water, and was charged $2 rather than being offered the free water on the side counter. I did appreciate the package of sanitary wipes at the entrance. Stay at another hotel. 2021-07-03 \" \"There was construction underway, so this hotel didn't meet my expectations. 2017-06-15 \" \"Less than 2 miles from the beach, in an area with multiple shopping and dining options. Clean, quiet hotel room. It was a little tight for 3 people with a cot, but a good value for the budget-conscious traveler. Breakfast was tasty and had many hot and cold selections. 2015-11-18 \" < Hide 25. Ritz-Carlton Naples Tiburon Golf Resort 2600 Tiburon Drive, Naples, FL 34109 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $1769 Check In 1600 Check Out 1100 Rated Very High Luxury, smoke-free, full-service, golf resort 4 miles from beach 6 floors, 295 rooms and suites Free shuttle to sister hotel at beach 2 heated outdoor swimming pools - fitness center 3 restaurants - lounge - room service Full-service spa - golf course Parking costs $20 per night Not pet friendly Note: This hotel charges a resort fee of $45 per night - includes WiFi. TripAdvisor Traveler Rating: Based on 1273 reviews Read Recent Reviews < Hide 26. Inn of Naples 4055 Tamiami Trail North, Naples, FL 34103 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $89 Check In 15 00 Check Out 12 00 Rated Very High Upscale, smoke-free hotel On Tamiami Trail North, US 41 2 miles from beach A Tapestry Collection by Hilton hotel 5 floors, 99 rooms and suites Outdoor swimming pool open all year - exercise room Restaurant - lounge Restaurant open for breakfast and dinner only Free WiFi Parking costs $3 per night Pet friendly hotel More > - allows up to 2 pets per room - $50 per stay pet fee - $100 maximum per stay pet fee. - Sep 2022 < Less TripAdvisor Traveler Rating: Based on 1520 reviews Read Recent Reviews < Hide 27. Residence Inn by Marriott Naples 4075 Tamiami Trail North, Naples, FL 34103 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $110 Check In 1500 Check Out 1200 Rated High Upscale, smoke-free, all-suite, extended-stay hotel On Tamiami Trail North, US 41 3 floors, 120 suites - elevator Heated outdoor swimming pool - exercise room Kitchen in every suite Free hot breakfast buffet Free WiFi Free parking Pet friendly hotel More > - allows up to 2 pets per room - $100 per stay pet fee. - Feb 2017 < Less TripAdvisor Traveler Rating: Based on 613 reviews Read Recent Reviews < Hide 28. Hilton Naples Hotel & Towers 5111 Tamiami Trail North, Naples, FL 34106 Call Us 8 miles 8 miles from Paradise Coast Sports Complex Enter Dates From $124 Check In 15 00 Check Out 12 00 Rated Very High Upper-upscale, smoke-free, full-service hotel On Tamiami Trail North, US 41 One-half mile from beach Free shuttle to beach Heated outdoor swimming pool - exercise room Restaurant - lounge - room service Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 2297 reviews Read Recent Reviews < Hide 29. Edgewater Beach Hotel Naples 1901 Gulfshore Blvd North, Naples, FL 34102 Call Us 9 miles 9 miles from Paradise Coast Sports Complex Enter Dates From $352 Check In 16 00 Check Out 11 00 Rated Very High Luxury, smoke-free, all-suite, full-service, oceanfront resort 2 heated outdoor swimming pools - exercise room Restaurant - lounge - room service Full-service spa Microwave and refrigerator in every room Valet parking only - $25 per night Pet friendly hotel More > - allows pets up to 30 pounds, 2 pets per room - $75 per night fee for each pet. - May 2018 < Less Note: This hotel charges a resort fee of $45 per night - includes WiFi. TripAdvisor Traveler Rating: Based on 1600 reviews Read Recent Reviews < Hide 30. Park Shore Resort Naples 600 Neapolitan Way, Naples, FL 34103 Call Us 9 miles 9 miles from Paradise Coast Sports Complex Enter Dates From $102 Check In 15 00 Check Out 11 00 Rated Very High Upscale, smoke-free condo hotel 1.5 miles from beach near Tamiami Trail 4 floors, 156 1-bedroom and 2-bedroom condos Outdoor swimming pool - exercise room Free WiFi Free parking Not pet friendly TripAdvisor Traveler Rating: Based on 553 reviews Read Recent Reviews < Hide ,FN;RSWFS-RSW,XV;RSWNS-RSW,WS;FLF20-RSW,OZ;03966-APF,HI;8597-APF,LQ;1047-APF,BW;10280-MIA,BH;NAPLH-RSW,HT;APFNP-RSW,WS;FLF17-APF,YZ;0467-RSW,RF;237-APF,HI;7697-RSW,LQ;7710-RSW,HY;NAPXN-RSW,YX;FL435-APF,WV;0615-RSW,WV;RSWCC-RSW,RA;0053-RSW,WV;APF38-RSW,BW;10151-RSW,NC;RSWIF-RSW,CY;RSWNP-RSW,HX;0147-RSW,RZ;RSWGR-RSW,UP;APFIN-RSW,RC;RSWNA-RSW,HH;48151-RSW,GD;RSWEB-RSW,WV;1272-RSW I liked the HotelGuides feature of being able to pick a hotel near the specific address where my meetings were located. - Noelle Hagan Why Book Here? Pay at hotel Live Agents Lowest price All Room Types Available Group Rates See more reasons Naples Info Naples Hotels and Reviews Naples Group Hotel Rates Nearby Attractions Hotels near Ave Maria University School of Law 6 miles NW Hotels near Naples Airport – APF 6 miles west Hotels near Naples Wedding Barn 7 miles east Hotels near Tin City 7 miles west Hotels near Downtown Naples 8 miles west Hotels near 5th Avenue Naples 8 miles west Hotels near NCH Baker Hospital Downtown 8 miles west Hotels near Tiburon Golf Club 8 miles NW Hotels near US 41 Naples 8 miles west Hotels near Naples Pier 9 miles west Hotels near Naples Grande Beach Resort 9 miles west Hotels near Oceanfront Naples 9 miles west Hotels near Mercato 10 miles NW Hotels near Vanderbilt Beach, Pelican Bay 10 miles NW Hotels near Shangri-La Springs 13 miles NW How Do We Order Hotels? We order the hotels on this page by how close they are to this attraction. Most of our competitors order these same hotels in other ways that make them more money. How Do We Define Motel? To us, motels are smaller lodgings that have rooms you can enter directly from the parking area. At hotels , on the other hand, you can enter your room only through a hall inside the building. Hotel Booking Tips Beware of non-refundable reservations that could cost you a lot of money if you change or cancel them. + Non-refundable reservations are a gamble that will usually save you less than $10. If you make a $90 non-refundable reservation instead of a $100 refundable booking, you are betting $90 to win $10. Would you do that in Las Vegas? - Don't assume you can cancel a non-refundable reservation without penalty if you notify the hotel weeks or even months in advance. + Often you cannot – because some hotels' profit strategy is to get paid more than once for the same room for the same night. - Always read cancellation policies carefully before you make a reservation. + When is the latest date and time you can cancel without penalty? - More > When you make a reservation, you will receive a confirmation email. Take a copy with you to the hotel. The earlier in the afternoon you check into a hotel, the more likely you will get a room or suite that matches your preferences. < Less Address: 3940 City Gate Blvd North, Naples, FL 34117 Hotels, Motels, Lodging, and Accommodations near Paradise Coast Sports Complex - Naples, Florida FL, USA © 2025 HotelGuides.com, Inc. All rights reserved. About Us | Terms of Use | Privacy Policy | Security | Contact Us Please allow HotelGuides to use your current location."
    },
    {
      "url": "https://paradiseresort.com.au/contact",
      "text": "Contact | Paradise Resort Gold Coast Book Now Stay All Rooms Standard Rooms Superior Rooms Deluxe Rooms Accessible Rooms Group Bookings Play Activities for Everyone Kids Club Birthday Parties Waterparks, Pool, Spa Ice Skating Pamper Parlour For Parents Eat All Dining Penguins Restaurant Christmas Day Plan Plan your Stay Getting Around FAQ's Tours, Tickets, Transfers Resort Tour Offers & Events Deals and Packages Vacay Your Way Halloween 2025 Christmas 2025 Live: Ice-Skating Show About About Paradise Resort Contact Us Lost Property Job Offers Blog Home Contact Get in touch... We’d love to chat! Reservations Hours: 8am - 5pm Daily Reception Hours: Open 24hours Email Us Reservations and General Enquiries book@paradiseresort.com.au Media and Marketing newsletter@paradiseresort.com.au Job Applications and Staff Enquiries hr@paradiseresort.com.au Call Us Within Australia 07 5691 0000 Within New Zealand 0800 424 828 Outside of Australia +61 07 5691 0000 Message Us Facebook @paradiseresortgc Instagram @paradiseresortgc Visit Us 122 Ferny Avenue, Surfers Paradise, Queensland, 4217 Australia Get Directions Did you forget something? There's nothing worse than getting home, unpacking and realising something’s missing.  As long as it's not a half-eaten sandwich there's a chance it might still be here.  Fill in the form, let us know what it is, and if it's found our team will help get it home to you. Follow Us On Socials PARADISERESORT Stay in Touch! 122 Ferny Avenue, Surfers Paradise Queensland, 4217, Australia book@paradiseresort.com.au Reservations & Enquires +61 07 5691 0000 Updates Job Offers Blog © Paradise Resort 2023 Privacy Policy Terms & Conditions Sitemap"
    },
    {
      "url": "https://naples.floridaweekly.com/articles/impact-of-colliers-paradise-coast-sports-complex-has-already-begun/",
      "text": "Impact of Collier’s Paradise Coast Sports Complex has already begun - Naples Florida Weekly Search for: Search Submit ▼ Log In Gift Subscriptions Naples Florida Weekly Naples Home News Top News Opinion Healthy Living News of the Weird Pet Tales Outdoors Business & Real Estate Business News Real Estate News The Motley Fool Networking Business Briefs On the Move A&E A&E News Cuisine What to Do, Where to Go Society Events Add Event Special Sections Marketplace Print Editions Business Directory Archives Choose Your Community Bonita Springs Charlotte County Fort Myers Key West Naples Palm Beach Florida Weekly Home About Us Advertising Solutions Newsstand Locations Subscribe Frequently Asked Questions Careers Contact Us Report Website Accessibility Problems Pay Your Advertising Invoice Public Notices Place View Obituaries Place An Obituary Log In Privacy Policy Florida Weekly Home Fort Myers Bonita Springs Charlotte County Key West Naples Palm Beach Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Select search type Places Events Search for Near Search Search Advanced Filters Sort by Distance Select Option Nearest Within 5 miles Within 10 miles Within 15 miles Within 20 miles Within 25 miles Within 30 miles Within 35 miles Within 40 miles Within 45 miles Within 50 miles More Search Search {\"hide_search_input\":\"\",\"hide_near_input\":\"\",\"show\":\"\",\"filters_pos\":\"\",\"input_size\":\"\",\"bar_flex_wrap\":\"\",\"bar_flex_wrap_md\":\"\",\"bar_flex_wrap_lg\":\"\",\"input_border\":\"\",\"input_border_opacity\":\"\",\"input_rounded_size\":\"\",\"btn_bg\":\"\",\"btn_rounded_size\":\"\",\"btn_rounded_size_md\":\"\",\"btn_rounded_size_lg\":\"\",\"bg\":\"\",\"mt\":\"\",\"mr\":\"\",\"mb\":3,\"ml\":\"\",\"pt\":\"\",\"pr\":\"\",\"pb\":\"\",\"pl\":\"\",\"border\":\"\",\"rounded\":\"\",\"rounded_size\":\"\",\"rounded_size_md\":\"\",\"rounded_size_lg\":\"\",\"shadow\":\"\",\"css_class\":\"\"} Thursday, September 11, 2025 Search Newsletter Events Photos Classifieds Subscribe Marketplace Home News Top News Opinion Healthy Living Pet Tales Home & Garden Business & Real Estate Business News Real Estate News The Motley Fool Networking Business Briefs On the Move A&E Arts and Entertainment News What to Do, Where to Go Outdoors Society Cuisine Events Add Event Special Sections Arts Preview – Act I Arts Preview – Act II Best Of 2025 Businesses of Distinction CBIA Parade of Homes 2025 Destination Guide Health Trends How-To Guide Hurricane Guide Newcomers Guide Key West Getaways Staycations & Getaways Tasting Notes Public Notices Place View Obituaries Place An Obituary Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Latest Places New Real Estate Favorite Cypress Woods Golf & Country Club New Dining Favorite Cafe Marquise New Real Estate Favorite Royal Palm Coast Realtors Association New Shopping Favorite Caloosahatchee Cannabis Company New Professional Directory Favorite Stilwell Enterprises & Restaurant Group View all Impact of Collier’s Paradise Coast Sports Complex has already begun By Staff on April 01, 2021 BY GLENN MILLER Florida Weekly Correspondent COURTESY PHOTO Another Florida magic kingdom is sprouting just off I-75’s Exit 101 in Collier County. This one has nothing to do with an anthropomorphic mouse or castles or make-believe of any kind. The Paradise Coast Sports Complex is a very real $100 million, multi-purpose venue for not only sports but cultural events as well. It is a joint venture between Collier County and Sports Force Parks, which also operates parks in Sandusky, Ohio and Vicksburg, Miss. At build-out it will comprise about 180 acres and more than 20 athletic fields centered around a 3,500-seat stadium with a full video scoreboard. The stadium is already open. Jeff Walters, the complex’s business development manager, called the relationship with the county a “dual partnership.” “We’re in business with Collier County,” Mr. Walters said. “Collier County funded the project and we’ve been brought in to construct and manage and program the facility.” Collier County commissioners unanimously voted in favor of $33 million in December for additional funding for the project’s second phase. The Paradise Coast Sports Complex is a $100 million, multi-purpose venue for not only sports but cultural events as well. COURTESY PHOTO Sports and arts groups are lining up to use the facility. Naples United Premier Soccer Team announced a partnership in December with the complex to play its 2021 season at the facility. Two months after the soccer club’s announcement, the United Arts Council of Collier County announced it would hold events at the Paradise Coast Sports Complex. “The impact has already begun,” said Liz Sanders, president of the Sports Council of Collier County and an hotelier who is area director of sales for Springhill Suites and related properties. That means hotels such as the ones Ms. Sanders represents will benefit. But that’s not all. “All the hotels in town are benefitting,” Ms. Sanders said. Naples United Soccer FC now calls Paradise Coast home. “It will be our home for the next three years,” said Naples United co-founder Veronica Docio. She said the club has been using the facility since January and it will be its home when the season starts in May. The club, which was founded in 2017, previously used high school stadiums. “No comparison,” Ms. Docio said of the upgrade from high school stadiums to the Paradise Coast Sports Complex. Naples FC director Enoch Showunmi agrees. “Shaping up to be one of the best sports facilities I’ve seen,” said Mr. Showunmi, who was born in England and has been in the U.S. for six years He sees the club’s new home as a place not only to improve the level of play, but build a passion for his sport in general as well as building the sport from the youth level on up. “We want to galvanize the community,” Mr. Showunmi said. The complex’s stadium has locker room facilities and the grandstand offers suites for sponsors and guests. Naples United, which plays in the Sunshine Conference of the National Premier Soccer League, is also offering camps and clinics for youth players at its new home. Ms. Docio said the club recently played a match at home against a Miami team. “They were a little bit jealous,” Ms. Docio said, One of the facility’s assets is its location right off the Interstate near where it bends east toward Miami and Fort Lauderdale. The Paradise Coast Sports Complex is also becoming a go-to destination for Pop Warner Football teams in the Peace River Conference, which comprises 19 youth football and cheer organizations from Naples through Lehigh Acres and up to Venice and Sarasota. Collier County’s five Pop Warner teams now call it their home field and played home games there in 2020 and will do the same in 2021. Jerry Craft, president of the Naples Hurricanes, said local Pop Warner organizers would like to have regional and national events at Paradise Coast. For the time being, there is a snag. “Not enough hotels,” Mr. Craft said. But there are plenty of young football players and cheerleaders in Pop Warner. Mr. Craft said each of Collier County’s five Pop Warner organizations have between 250 and 300 cheerleaders and football players. The complex’s economic potential intrigues Jack Wert, executive director of the county’s Tourist Development Council. “It increases our capability to grow our sports tourism,” Mr. Wert said. While Lee County has two Major League Baseball teams, the Boston Red Sox and Minnesota Twins, that call it home for spring training, a minor-league baseball team in the Fort Myers Mighty Mussels, a minor-league hockey team in the Florida Everblades and a Division 1 athletic program at Florida Gulf Coast University, the focus in Collier is amateur sports. That includes one of the nation’s premier pickleball facilities at East Naples Community Park, which features 64 courts and is only 9.7 miles away from Paradise Coast, according to Google Maps. The focus for Collier County is luring more regional and national amateur events to town. The new facility will help. “It is eventually going to bring us to the next level,” Mr. Wert said. The diversity of events that can be held there is a big asset, Mr. Wert believes. “The magic word is making everything multi-purpose,” Mr. Wert said. Then there is the magic of Collier County. The county’s TDC uses the slogan Paradise Coast to describe the region. “People want to be in Naples, Florida during the winter,” said Ms. Sanders. She envisions the new facility helping the county as “a true sports destination.” It’s a destination that is convenient to many potential visitors. The complex is close to Marco Island and exit 101 is just 27 miles south of Exit 128, which leads motorists to Southwest Florida International Airport. Much of the expansive 180-acre facility is already up and running. That includes 10 of what are called rectangular fields, ones suitable for football, lacrosse, soccer, field hockey and other sports. They can be converted from one sport to another quite easily, according to Mr. Walters. Each sports needs its own lines for specific purposes. “Then simply scrub those lines off over the weekend or after the event,” Mr. Walters said. Each field is what Paradise Coast officials refer to as “Olympic size.” A soccer pitch can be converted to American football or field hockey or lacrosse. Adjacent to the stadium is what is called Champions Plaza. Naming rights for various elements of the complex are up for bids. “Part of my job in business development is to find sponsors for many of the assets and locations in the park,” Mr. Walters said. “To be clear, Collier County retains the right to sell the naming rights for the entire facility but it’s a joint effort to sell the remainder of the inventory.” Plans to add six baseball diamonds and five softball fields should have those operating if not in 2022, by 2023. As with the “rectangular” multi-purpose fields, the baseball and softball fields will also have synthetic turf. “Everything will be turf from the pitcher’s mound to the batter’s box,” said Mitchell Sweet, the complex’s events coordinator. The fields will be full-sized with 90-foot baselines but can be converted to shorter distance for youth events. The amenities include what is called The Great Lawn, a venue for concerts. Cultural events are definitely in the mix at Paradise Coast. “I do want to continue to remind everybody we do seem to be considered a sports complex but we’re not,” Mr. Walters said. Music and art shows are in the mix at a venue Mr. Walters touts with enthusiasm. “There’s nothing like this in the entire country,” Mr. Walters said. Other possible additions moving forward are a golf course and children’s jungle gym. Staging 5K and 10K road races and other running events are possibilities. There are many potential uses. “I’d love to see a velodrome (an arena for track cycling),” Mr. Walters said. Anything seems possible. “I think the complex will be a shining star,” Ms. Sanders said. The Paradise Coast Sports Complex is open for anything — whether it’s football or a concert or soccer or an art show “We’re looking for business,” Mr. Walters said. “Let’s have an event. Let’s do a concert.” Right there off Exit 101 of I-75, where the Interstate bends and the future beckons and magic is happening. ¦ 3 responses to “Impact of Collier’s Paradise Coast Sports Complex has already begun” Cynthia Cromwell says: April 1, 2021 at 10:10 am Are there tours of the new facility planned for the future? I think that would be well attended as mant Collier residents have not seen it and don’t know much about it. Reply Joyce Vorbach says: April 1, 2021 at 11:27 am You can drive right to it and visit. There is a weekly newsletter of events for signup. Google it for the address. Several nights a week there are food truck events and there is a pub called The Cove. Live music is offered for special events and on Fridays and Saturdays. A country music Honky Tonk Sideshow is planned for this Saturday the 3rd. Reply Sam Stray says: March 6, 2022 at 9:31 am Quite a remarkable addition to Naples my home town, I call Paradise THANK YOU for this unique family complex! Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Current ye@r * Leave this field empty Δ Loading Contact Us! Click Here for Our Offices Home News Business Real Estate A&E Events Business Directory Past Print Editions Subscribe Newsletter Newsstands Website Accessibility Our Hometown DMCA Notices Newspaper website content management software and services If you have any problems, questions, or comments regarding www.FloridaWeekly.com , please contact our Webmaster .\nFor all other comments, please see our contact section . For more information on this site please read our Terms and Conditions , Privacy Policy , and Ad Choices . Copyright © 2007 - 2025  Florida Media Group LLC Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://www.theparadiseisle.com/contact-us.html",
      "text": "Contact Us | Paradise Isle Beach Resort, Udupi Toggle navigation About Us Rooms Offers Dining Events Spa Experiences Facilities Location Gallery Contact Us Book Now Close Check In Check Out Adults 1 2 3 4 5 Children 0 1 2 3 Promo Code Why Book Direct? 10% Off on Spa Sessions 10% Off on Food and Beverages (A la Carte) Complimentary Welcome Drinks Free Parking Swimming Pool Preferred Early Check-in and Late Check-out (Subject to Availability) Home > Contact Us Contact Paradise Isle Beach Resort, Udupi Location Paradise Isle Beach Resort, Udupi 46, Malpe, Karnataka - 576108Â | Map Phone +91 78 4780 0800 | Central Reservations +91 90 0844 4891 | Corporate Bookings Email sales@theparadiseisle.com Get in Touch with Us Name Email Phone How can we help? Â Submit Ã Paradise Isle Beach Resort, Udupi 46, Malpe, Karnataka - 576108 Get In Touch QUICK LINKS Home About Us Rooms Offers Dining Events Spa Experiences Facilities Location Gallery Contact Us Terms & Conditions Manage Booking GET IN TOUCH +91 78 4780 0800 | Central Reservations +91 90 0844 4891 | Corporate Bookings sales@theparadiseisle.com Sitemap Simplotel - Hotel Website Design & Booking Engine Continue your booking"
    },
    {
      "url": "https://www.forgottencoastathletics.com/about-us",
      "text": "About Us | Forgotten Coast Athletics | Port St. Joe top of page View Forgotten Coast Athletics MIssion Statement here . REGISTER HERE HOME ABOUT US Schedule Location Mission Statement WHAT WE OFFER All Star Cheerleading Rec Classes Private Lessons Afterschool Programs Summer Camps Birthday Parties REGISTRATION REGISTRATION TUITION & PAYMENTS REVIEWS CONTACT US More Use tab to navigate through the menu items. Meet the Staff Welcome to Forgotten Coast Athletics. FCA opened in the fall of 2018 in Port St. Joe, Florida. This is our sixth season of all-star cheerleading. Thank you for looking at our website. My name is Stephanie Petersen .  My husband Tim and I are from the Midwest. We have three children that love to cheer. Stephanie has coached cheerleading for 18 years. She loves sharing her passion of cheer. She is also the Head Port St. Joe High School Cheer Coach since 2019.  We would love to have you join our FCA family. Picture of all the staff at FCA Amanda, Myself, and Rainey FCA All-Star Director Amanda Chizmar , All-Star Director ​ My name is Coach Amanda and I come from Panama City, Fl as a former athlete and grew up in the competitive cheer world. With 15 years experience in my pocket as an athlete, I have also completed 6 years of gymnastics, and as well as 7 years of school cheer. My job is not only to teach tumbling and gymnastics but to teach guidance and different qualities to every one of my student that they can take with them throughout their lifetime. My passion lies in helping kids achieve their goals and teaching them about the anatomy behind the tumbling technique. I am so excited to be apart of FCA and watch this gym grow. ​ Coach at FCA Rainey Nobles ,  Gymnastics and Tumbling Lead Instructor, Head-Coach for Limited and Non-Travel Teams My name is Rainey Nobles and I am the Gymnastics and Tumbling Lead Instructor. I have lived in Port St Joe my whole life and have been with FCA since the 2019 season. I left briefly to graduate cosmetology school in Bradenton, FL and I am so excited to be back for another season at FCA! ​ Coach at FCA Lauren Lewis, Gymnastics Instructor My name is Coach Lauren. I am from Crawfordville Florida. Throughout my life I competed in competitive gymnastics, cheerleading. and softball along with several other sports. After competing tor several years and having terrific coaches that impacted my life, I knew coaching was something I wanted to do as well. I have coached competitive gymnastics for five years both xcel and compulsory gymnastics programs. I have a passion for coaching and watching kids achieve their goals and dreams. I am so excited to be apart of FCA. Coach at FCA Ted Galanos, Stunt and Tumbling Coach \n\n \n\nTed has cheered for the Georgia State University and the University of West Georgia. Ted has served on the UCA Staff for 7 years and leads highschool and collegiate camps. Ted has also performed with the Atlanta Jayhawks Stunt Team for 5 years! Ted specializes in Tumbling and Stunt anatomy. We are so glad to have him apart of the FCA Family! 305 3rd St Port St. Joe, FL 32456 info@forgottencoastathletics.com (850) 889-8765 Copyright © 2023 Forgotten Coast Athletics - All Rights Reserved. Subscribe to Our Newsletter! Submit Thanks for submitting! Menu Home About us What we offer Forms Tuition & Payments Reviews Contact us bottom of page"
    },
    {
      "url": "https://www.naples2night.com/post/welcome-to-paradise-coast-sports-complex-your-gateway-to-unparalleled-branding-and-partnership-oppo",
      "text": "Welcome to Paradise Coast Sports Complex: Your Gateway to Unparalleled Branding and Partnership Opportunities top of page Home Restaurants Steak Healthy Eating Pasta Seafood Pizza Sushi Hibachi Breakfast | Brunch Chicken Wings Mexican Food Sweets Things To Do Latest Stories Services Construction Realtors Alternative Medicine Events Submit Event Latest Stories More Use tab to navigate through the menu items. DIGITAL Magazine Advertise DIRECTORY: LIST YOUR BUSINESS HERE Log In All Stories Lifestyle Music Entertainment Real Estate Business Culinary Cover Stories Hotels Community Movie Theaters Nightlife Concerts Interviews Dancing Charities Search Welcome to Paradise Coast Sports Complex: Your Gateway to Unparalleled Branding and Partnership Opportunities naples2night Jul 5, 2024 2 min read Photo Credits | Naples 2Night Digital Magazine Located in the heart of sunny Naples, Florida, the Paradise Coast Sports Complex is more than just a premier destination for sports enthusiasts; it's a vibrant hub for community engagement and business growth. Today, we delve into the multifaceted branding and partnership opportunities that this sprawling 180-acre facility offers, presenting a unique chance for businesses to connect with a diverse and dynamic audience. A Premier Destination for Sports and Events Situated just half a mile north of I-75 off Collier Boulevard, Paradise Coast Sports Complex is a beacon for sports lovers and event-goers alike. Home to local sports clubs, traveling youth tournaments, collegiate events, semi-pro soccer, and a variety of cultural happenings, this venue attracts a wide range of visitors year-round. In 2023, the complex welcomed over 300,000 guests, and with ongoing development, this number is set to exceed 400,000 in 2024. Upon completion of all development phases, Paradise Coast anticipates hosting over 1 million visitors annually. Unmatched Facilities and Features Paradise Coast Sports Complex boasts a range of top-tier facilities designed to accommodate a variety of sports and events. Phases 1 through 3 have brought significant enhancements, including: Championship Stadium : Accommodates 5,000 to 6,000 spectators for sporting events and up to 8,000 for concerts. Eight Olympic Fields : Perfect for a wide range of sports activities. Amphitheater : A prime venue for cultural and community events. The Factory : An outdoor fitness center featuring a Ninja Warrior-style obstacle course. Fitness Trail : Encircles a scenic lake, offering a picturesque route for exercise. Professional-Style Sand Volleyball Courts : Six courts designed for serious play. The Cove : An outdoor beer and wine bar, ideal for relaxation and socializing. The Great Lawn : A versatile space used for cultural events and family gatherings. 40-Foot Jumbotron : Southwest Florida's largest outdoor television, perfect for showcasing your brand. Phase 4, starting soon, will add even more facilities, including the 10th Olympic field, six baseball diamonds, five softball diamonds, and additional amenities. High-Quality Exposure and Community Engagement With its diverse range of events and activities, Paradise Coast Sports Complex offers businesses unparalleled opportunities for exposure. Whether aiming to attract travelers or connect with local residents, partnering with the complex ensures your brand reaches a high-quality, high-volume audience. Multimedia and Real Estate Branding Opportunities The complex provides a variety of multimedia opportunities to showcase your brand, including the massive Jumbotron, strategically placed signage, and digital platforms. This exposure is not limited to event attendees; it extends to a wider audience through media coverage and online engagement. Join Us in Paradise The Paradise Coast Sports Complex is not just a venue; it's a community cornerstone where businesses can thrive through strategic partnerships. By engaging with the community, businesses can achieve several goals, including increased visibility, enhanced brand reputation, and stronger community ties. For more information on the incredible opportunities at Paradise Coast Sports Complex, check out our latest branding and partnership video. To discuss how we can grow together, please contact Jeff Walters, Business Development Director, at jwalters@playparadisecoast.com or call (239) 252-4382. Tags: Business Paradise Coast Sports Complex Business Recent Posts See All Vision and Waterfront Luxury: Inside the Story of The Perry Hotel Naples Biz Mindz Podcast Launches New Studio With Spotlight on Freedom Institute of Collier County Naples Hotels Offer Stunning Views of Gulf Coast Paradise Contact 5051 Castello Dr. Naples, FL 34103 info@naples2night.com 239-933-5133 Contact Us Terms and Conditions Privacy Policy Our Newsletter Subscribe to our FREE Digital Magazine. Receive the latest in Business, Entertainment and Community regarding Southwest Florida. Things to do in Naples Florida Email Submit Thanks for submitting! Menu Home About Events Contact Advertise EXCHANGE 3 Podcast ​ Follow us on Facebook Instagram Twitter © 2025 Naples 2Night, LLC. Website by Creative Partnership: GT Mediex Design & RC Marketing Group bottom of page"
    },
    {
      "url": "https://paradisecooperative.org/contact-us/",
      "text": "Contact Us About Our Story Our Team Education Programme Community Programme Projects Newsletter Year In Review Get Involved Overview What’s On Next Month’s Calendar Workshops & Events Sunday Volunteering Mindful Growing For Schools For Businesses Site Hire Join Our Team Donate Contact Contact Us Visit Donate CONTACT US GENERAL ENQUIRIES For general enquiries please email Eve, Head of Community Outreach, using the form below. \" * \" indicates required fields Name * Email * Message * Sign up to our newsletter Yes please No thanks I do not want my information to be used for direct marketing purposes. Click here Δ FOLLOW US Instagram Facebook X Vimeo EMAIL US Interested in partnering with us? Email Eve , our Head of Community Engagement at community@paradisecooperative.org . For Funders and Sponsors: To learn more about our impact, strategies, and funding opportunities, contact Lauren , our Director, at team@paradisecooperative.org . Schools Programme Enquiries: For enquiries regarding member schools availability, email Kate , our Head of Education, at schools@paradisecooperative.org . VISIT US How to Find Us SIGN UP TO OUR MAILING LIST Click Here to Subscribe to our Monthly Newsletter Copyright © Paradise Cooperative | Policies | Terms & privacy Menu We use cookies to make sure our website works as smoothly as our compost. These little files help us understand how you’re using our site, so we can keep improving and growing.\n\nBy continuing to explore our website, you're giving us the green light to use cookies.\n\nThanks for supporting our community and being part of the Paradise journey!\n\nFind out more in our Privacy Policy. Ok"
    }
  ]
}