{
  "fuentes": [
    {
      "url": "https://old.popstroke.com/contact/",
      "email": "info@old.popstroke.com"
    },
    {
      "url": "https://popstroke.com/careers/",
      "email": "hiring@popstroke.com"
    },
    {
      "url": "https://popstroke.com/about/",
      "email": "info@popstroke.com"
    },
    {
      "url": "https://popstroke.com/workatpopstroke/",
      "email": "hiring@popstroke.com"
    },
    {
      "url": "https://www.linkedin.com/company/popstroke-entertainment-group",
      "email": "brianna.alonso@popstroke.com"
    },
    {
      "url": "https://www.biography.com/musicians/michael-jackson",
      "email": "colin.mcevoy@hearst.com"
    },
    {
      "url": "https://www.biography.com/musicians/michael-jackson",
      "email": "editor@biography.com"
    },
    {
      "url": "https://popstroke.com/press/popstroke-announces-april-22nd-opening-date-for-sin-cities-elevated-mini/",
      "email": "dylana.silver-obrien@popstroke.com"
    },
    {
      "url": "https://surgetechak.com/contact/",
      "email": "sgoodwin@surgetechak.com"
    },
    {
      "url": "https://popstroke.com/corporate-teams/",
      "email": "party@popstroke.com"
    },
    {
      "url": "https://popstroke.com/private-events/",
      "email": "party@popstroke.com"
    }
  ],
  "mails": [
    "brianna.alonso@popstroke.com",
    "colin.mcevoy@hearst.com",
    "dylana.silver-obrien@popstroke.com",
    "editor@biography.com",
    "hiring@popstroke.com",
    "info@old.popstroke.com",
    "info@popstroke.com",
    "party@popstroke.com",
    "sgoodwin@surgetechak.com"
  ],
  "nombre_sitio": "popstroke.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://old.popstroke.com/contact/",
      "text": "Contact - Popstroke Skip to content Pop Stroke Lighthouse Cove Mini Golf SideMenu Locations Florida Delray Beach, FL Fort Myers, FL Sarasota, FL Port Saint Lucie, FL Orlando, FL (Waterford Lakes) Tampa / Wesley Chapel, FL Texas Houston / Katy, TX The Colony Arizona Glendale, AZ Scottsdale, AZ Alabama Tuscaloosa South Carolina Myrtle Beach Nevada Las Vegas, NV Future Locations Events & Parties Mobile App Online Gift Cards Work With Us News Our Partners About Port Saint Lucie, FL Menu Menu Events & Specials – Fort Myers Contact Us Full Name (required) Email Address (required) Zip Code Subject General Inquiry Press Corporate Events Schools & Camps Field Trips Comments/Questions Δ Phone PSL: (772) 800-6001 FM: (239) 323-4653 SRQ: (941) 500-9495 ORL - WL: (407) 530-3885 Email info@old.popstroke.com © Popstroke 2025 LOCATIONS Florida Delray Beach, FL Port Saint Lucie, FL Fort Myers, FL Sarasota, FL Orlando/Waterford Lakes, FL Tampa / Wesley Chapel, FL Texas Houston/Katy, TX Arizona Glendale, AZ Scottsdale, AZ Alabama Tuscaloosa, AL Events and Parties Private Events COMPANY About Our Partners Contact Us Work With Us News Loyalty Program Privacy Policy FOLLOW US! Join the Newsletter Email: Location Port Saint Lucie, FL Fort Myers, FL Sarasota, FL Waterford, FL Tampa / Wesley Chapel, FL Delray Beach, FL Houston Katy, TX Glendale, AZ Scottsdale, AZ Events Location Port Saint Lucie, FL Fort Myers, FL Sarasota, FL Waterford, FL Tampa Wesley Chapel, FL Delray Beach, FL Houston Katy, TX Glendale, AZ Scottsdale, AZ Jupiter Leave this field empty if you're human: Locations Florida Delray Beach, FL Fort Myers, FL Sarasota, FL Port Saint Lucie, FL Orlando, FL (Waterford Lakes) Tampa / Wesley Chapel, FL Texas Houston / Katy, TX The Colony Arizona Glendale, AZ Scottsdale, AZ Alabama Tuscaloosa South Carolina Myrtle Beach Nevada Las Vegas, NV Future Locations Events & Parties Mobile App Online Gift Cards Work With Us News Our Partners About"
    },
    {
      "url": "https://popstroke.com/careers/",
      "text": "Careers at PopStroke | Eat. Putt. Drink. Careers Help us build an experience people love. Working at PopStroke PopStroke provides a best-in-class experience for all ages with multiple 18-hole putting courses, full-service restaurant, bar, ice cream parlor, playground, and outdoor gaming. Our team focuses on providing our guests with fun, unique, outdoor entertainment. Medical, Dental and Vision insurance coverage for full-time team members Compensation that exceeds industry standards Complimentary golf for all employees and immediate family across all properties Discount on food and beverages at all properties 40% discount on TaylorMade golf clubs and gear, and 30% discount on selected TaylorMade apparel Time off on Christmas Day, reduced hours on Thanksgiving and Christmas Eve Paid time off and paid holidays for eligible positions Employee leagues and competitions Opportunities for growth and advancement across all properties Fun and diverse team environment What it takes Each position is to provide a best-in-class experience for our guests, working collaboratively to ensure we are always exceeding our guest expectations. Energy & enthusiasm Excellent communication, time management, and organization skills Availability to work various shifts, including evenings, weekends, and holidays Hospitality-focused and guest-centric Ability to work in a fast-paced, team environment Ability to demonstrate a high level of accountability and integrity Club Positions Caddie Share knowledge of the food menu and spirits/beer/wine. Serve our guests with outstanding attention to service and provide a memorable and fun experience. Pro Shop Attendant Welcome our guests on arrival and acquaint them with the property. Explain the venue, equip guests with tools to play, and answer questions. Serve beverages and ice cream at the golf counter. You are the first point of contact for helping us deliver memorable experiences. Clubhouse Associate Actively engage guests and strive to provide the highest quality of service by warmly greeting and seating guests, assisting with requests, and coordinating the flow of the restaurant. Assist with resetting tables and food & beverage service as needed. Assistant Caddie Support the restaurant and bar operations; ensure the cleanliness of food and beverage areas. Working collaboratively, ensure we always exceed our guests' expectations and uphold our food, health, safety, and sanitation principles. Event Coordinator Manage local outreach and partnerships to grow event sales. Book parties and events, coordinate with on-site managers to ensure proper event execution, interact with guests, and assist with social media channels. Kitchen Staff Ensure the highest quality of culinary services for our guests. Quickly, safely, and efficiently prepare food in accordance with our preparation and execution standards. Maintain a high degree of standards in cleanliness and sanitation. Groundskeeper Perform various indoor and outdoor tasks to help prepare the golf course and facilities for daily play. Maintain the appearance, cleanliness, and safety of the property. Golf Course Superintendent Oversee the maintenance of the golf course including clubhouse grounds and facilities to produce the best possible golf experience for our guests. Lead all grounds crew employees, and supervise all equipment maintenance and material supplies. Open Positions All locations Tuscaloosa, AL Glendale, AZ Scottsdale, AZ Delray Beach, FL Fort Myers, FL Lutz, FL Sarasota, FL Wesley Chapel, FL West Palm Beach, FL Winter Garden, FL Las Vegas, NV Myrtle Beach, SC Antioch, TN Austin, TX College Station, TX Katy, TX The Colony, TX Assistant Kitchen Manager Sarasota, FL Assistant Kitchen Manager Antioch, TN Assistant Manager College Station, TX Bartender Lutz, FL Bartender Delray Beach, FL Bartender Austin, TX Bartender Scottsdale, AZ Bartender (Open Interviews) The Colony, TX Busser/Runner Fort Myers, FL Busser/Runner Myrtle Beach, SC Busser/Runner Austin, TX Busser/Runner Scottsdale, AZ Busser/Runner (Open Interviews) The Colony, TX Cook Austin, TX Cook (Up to $23/hr) Scottsdale, AZ Dishwasher/Kitchen Steward Scottsdale, AZ Facilities/Maintenance Austin, TX Facilities/Maintenance Tuscaloosa, AL Facilities/Maintenance Fort Myers, FL Facilities/Porter Scottsdale, AZ Golf Associate Wesley Chapel, FL Golf Associate West Palm Beach, FL Golf Associate Austin, TX Golf Associate Las Vegas, NV Golf Associate Scottsdale, AZ Golf Associate (Open Interviews) The Colony, TX Host/Hostess Scottsdale, AZ Kitchen Manager Myrtle Beach, SC Kitchen Manager Antioch, TN Kitchen Manager (Austin) Austin, TX Kitchen Steward/Dishwasher Austin, TX Lead Line Cook Tuscaloosa, AL Line Cook Lutz, FL Line Cook West Palm Beach, FL Line Cook Winter Garden, FL Line Cook Myrtle Beach, SC Line Cook The Colony, TX Line Cook Glendale, AZ Local Marketing Coordinator Sarasota, FL Maintenance/Facilities Technician The Colony, TX Operations Manager College Station, TX Prep Cook Myrtle Beach, SC Prep Cook Scottsdale, AZ Prep Cook Austin, TX Sales Manager Katy, TX If you have any questions, feel free to email us at hiring@popstroke.com . Tap-in to fun. Sign up for offers & new openings. We may even send you some birthday goodies! Email Address Sign Up Locations Alabama Arizona Florida Nevada South Carolina Tennessee Texas Winter Garden @ Hamlin Tampa @ Wesley Chapel Sarasota Port St. Lucie Palm Beach Orlando @ Waterford Lakes Fort Myers Delray Beach Daytona Beach Tap-in Plan a Visit Food & Drinks Events & Parties Gift Cards Company About Our Partners Careers Press Room Privacy Policy PopStroke Greens Eat. Putt. Drink. © PopStroke 2025"
    },
    {
      "url": "https://popstroke.com/about/",
      "text": "About PopStroke | Eat. Putt. Drink. A bit about us In it for the good vibes. A mini golf oasis Welcome to PopStroke, where we've reinvented the classic pastime of mini golf into an extraordinary experience. Imagine a place where the charm of traditional mini golf meets innovative technology and custom-designed courses, where playful challenges unfold against the backdrop of beautifully designed landscapes. This is PopStroke — where the pure joy of mini golf extends beyond family outings and date nights to welcome guests of all skills and ages seeking a unique and memorable experience. PopStroke brings a new spin to mini golf where we swapped the windmills and waterfalls with next-generation technology and custom-designed courses. The PopStroke mobile app allows you to order drinks for on-course delivery effortlessly while keeping score electronically. PopStroke locations boast two 18-hole putting courses, jumbotrons, and large TVs all throughout the property, complemented by lively bars and a full-service scratch restaurant. Beyond the greens, PopStroke provides additional amenities, including an ice cream parlor, a playground, and an array of outdoor games like cornhole and foosball. Our history The story of PopStroke began long before our first venue opened its doors in 2019. Meet Greg Bartoli, a former Wall Street executive at JP Morgan turned entrepreneur. Greg's vision was to create a dynamic, interactive mini golf and entertainment experience that brought everyone together regardless of age, background, or skill level. In 2013, he founded JEM Capital, an investment firm specializing in leisure, hospitality, technology, and real estate — the seeds that would grow into the PopStroke experience. JEM Capital's journey included the establishment of Lighthouse Cove, which Greg founded in 2013 - a mini golf and sports-themed restaurant gem in Jupiter, Florida. Greg's children were 1, 3, and 5 years old at the time. He wanted to develop a place that could bring the entire family together, across generations, to enjoy not just golf but also a lively atmosphere with music, great food, a sports bar with an abundance of TVs, a playground, and ice cream (of course!). Lighthouse Cove became an instant success, which then led to three Lighthouse Cove venues across the state of Florida. The Lighthouse Cove brand served as the proof of concept for Greg's vision, establishing the groundwork for the evolution of PopStroke. The name itself is a testament to family and the love of the game — the name \"PopStroke\" pays homage to Greg's Dad, who was a scratch golfer, introduced Greg to the game of golf, and is affectionately known as \"PopPop\" by his grandchildren. The word PopStroke is also a term used in golf slang to describe a short putting backstroke with a quick follow through - which describes Greg's putting stroke in golf. Fast forward to March 2019, the first PopStroke venue opened in Port St. Lucie, Florida. With our signature 36 holes of elevated mini golf, a full-service bar and restaurant, an ice cream parlor, and an enclosed playground, PopStroke instantly became a beloved destination. Over time, we crafted our proprietary mobile app by adding another company Greg founded in 2019, Heard Technology, which allowed guests to keep score electronically, order drinks for course delivery, and place their restaurant orders from anywhere on the property. Since then, our brand has grown significantly, with Tiger Woods joining as an investor in 2020, and TaylorMade Golf Company as an equipment partner and investor in 2023. Our footprint has expanded, bringing the PopStroke experience to over a dozen new cities, including Las Vegas, Dallas, Nashville, and Austin. Bringing greens to life PopStroke Greens specializes in creating custom synthetic turf putting courses designed to fit any space. Building on the success of PopStroke's innovative venues, our professional team combines design and construction expertise to craft putting courses that are perfectly suited to your needs. Whether it's for a lively public area, a resort looking to offer something unique, or a private backyard getaway, we tailor every course to match your vision. At PopStroke Greens , we deliver fun, high-quality putting experiences for all ages. Our mission At PopStroke, our mission is clear: to craft an unparalleled and inclusive mini golf experience where innovation meets classic entertainment. We are dedicated to creating a space where indelible memories are cultivated for guests of all ages and skill levels. Join us at PopStroke and dive into the thrill of friendly competition, where every putt isn't just a stroke—it's a bold move in the battle for joy, laughter, and the pure delight of the game. Get in touch PopStroke Corporate Office (561) 203-7974 info@popstroke.com Tap-in to fun. Sign up for offers & new openings. We may even send you some birthday goodies! Email Address Sign Up Locations Alabama Arizona Florida Nevada South Carolina Tennessee Texas Winter Garden @ Hamlin Tampa @ Wesley Chapel Sarasota Port St. Lucie Palm Beach Orlando @ Waterford Lakes Fort Myers Delray Beach Daytona Beach Tap-in Plan a Visit Food & Drinks Events & Parties Gift Cards Company About Our Partners Careers Press Room Privacy Policy PopStroke Greens Eat. Putt. Drink. © PopStroke 2025"
    },
    {
      "url": "https://popstroke.com/workatpopstroke/",
      "text": "Careers at PopStroke | Eat. Putt. Drink. Careers Help us build an experience people love. Working at PopStroke PopStroke provides a best-in-class experience for all ages with multiple 18-hole putting courses, full-service restaurant, bar, ice cream parlor, playground, and outdoor gaming. Our team focuses on providing our guests with fun, unique, outdoor entertainment. Medical, Dental and Vision insurance coverage for full-time team members Compensation that exceeds industry standards Complimentary golf for all employees and immediate family across all properties Discount on food and beverages at all properties 40% discount on TaylorMade golf clubs and gear, and 30% discount on selected TaylorMade apparel Time off on Christmas Day, reduced hours on Thanksgiving and Christmas Eve Paid time off and paid holidays for eligible positions Employee leagues and competitions Opportunities for growth and advancement across all properties Fun and diverse team environment What it takes Each position is to provide a best-in-class experience for our guests, working collaboratively to ensure we are always exceeding our guest expectations. Energy & enthusiasm Excellent communication, time management, and organization skills Availability to work various shifts, including evenings, weekends, and holidays Hospitality-focused and guest-centric Ability to work in a fast-paced, team environment Ability to demonstrate a high level of accountability and integrity Club Positions Caddie Share knowledge of the food menu and spirits/beer/wine. Serve our guests with outstanding attention to service and provide a memorable and fun experience. Pro Shop Attendant Welcome our guests on arrival and acquaint them with the property. Explain the venue, equip guests with tools to play, and answer questions. Serve beverages and ice cream at the golf counter. You are the first point of contact for helping us deliver memorable experiences. Clubhouse Associate Actively engage guests and strive to provide the highest quality of service by warmly greeting and seating guests, assisting with requests, and coordinating the flow of the restaurant. Assist with resetting tables and food & beverage service as needed. Assistant Caddie Support the restaurant and bar operations; ensure the cleanliness of food and beverage areas. Working collaboratively, ensure we always exceed our guests' expectations and uphold our food, health, safety, and sanitation principles. Event Coordinator Manage local outreach and partnerships to grow event sales. Book parties and events, coordinate with on-site managers to ensure proper event execution, interact with guests, and assist with social media channels. Kitchen Staff Ensure the highest quality of culinary services for our guests. Quickly, safely, and efficiently prepare food in accordance with our preparation and execution standards. Maintain a high degree of standards in cleanliness and sanitation. Groundskeeper Perform various indoor and outdoor tasks to help prepare the golf course and facilities for daily play. Maintain the appearance, cleanliness, and safety of the property. Golf Course Superintendent Oversee the maintenance of the golf course including clubhouse grounds and facilities to produce the best possible golf experience for our guests. Lead all grounds crew employees, and supervise all equipment maintenance and material supplies. Open Positions All locations Tuscaloosa, AL Glendale, AZ Scottsdale, AZ Delray Beach, FL Fort Myers, FL Lutz, FL Sarasota, FL Wesley Chapel, FL West Palm Beach, FL Winter Garden, FL Las Vegas, NV Myrtle Beach, SC Antioch, TN Austin, TX College Station, TX Katy, TX The Colony, TX Assistant Kitchen Manager Sarasota, FL Assistant Kitchen Manager Antioch, TN Assistant Manager College Station, TX Bartender Lutz, FL Bartender Delray Beach, FL Bartender Austin, TX Bartender Scottsdale, AZ Bartender (Open Interviews) The Colony, TX Busser/Runner Fort Myers, FL Busser/Runner Myrtle Beach, SC Busser/Runner Austin, TX Busser/Runner Scottsdale, AZ Busser/Runner (Open Interviews) The Colony, TX Cook Austin, TX Cook (Up to $23/hr) Scottsdale, AZ Dishwasher/Kitchen Steward Scottsdale, AZ Facilities/Maintenance Austin, TX Facilities/Maintenance Tuscaloosa, AL Facilities/Maintenance Fort Myers, FL Facilities/Porter Scottsdale, AZ Golf Associate Wesley Chapel, FL Golf Associate West Palm Beach, FL Golf Associate Austin, TX Golf Associate Las Vegas, NV Golf Associate Scottsdale, AZ Golf Associate (Open Interviews) The Colony, TX Host/Hostess Scottsdale, AZ Kitchen Manager Myrtle Beach, SC Kitchen Manager Antioch, TN Kitchen Manager (Austin) Austin, TX Kitchen Steward/Dishwasher Austin, TX Lead Line Cook Tuscaloosa, AL Line Cook Lutz, FL Line Cook West Palm Beach, FL Line Cook Winter Garden, FL Line Cook Myrtle Beach, SC Line Cook The Colony, TX Line Cook Glendale, AZ Local Marketing Coordinator Sarasota, FL Maintenance/Facilities Technician The Colony, TX Operations Manager College Station, TX Prep Cook Myrtle Beach, SC Prep Cook Scottsdale, AZ Prep Cook Austin, TX Sales Manager Katy, TX If you have any questions, feel free to email us at hiring@popstroke.com . Tap-in to fun. Sign up for offers & new openings. We may even send you some birthday goodies! Email Address Sign Up Locations Alabama Arizona Florida Nevada South Carolina Tennessee Texas Winter Garden @ Hamlin Tampa @ Wesley Chapel Sarasota Port St. Lucie Palm Beach Orlando @ Waterford Lakes Fort Myers Delray Beach Daytona Beach Tap-in Plan a Visit Food & Drinks Events & Parties Gift Cards Company About Our Partners Careers Press Room Privacy Policy PopStroke Greens Eat. Putt. Drink. © PopStroke 2025"
    },
    {
      "url": "https://www.linkedin.com/company/popstroke-entertainment-group",
      "text": "PopStroke Entertainment Group | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now PopStroke Entertainment Group Entertainment Stuart, Florida 8,688 followers Reinventing mini golf with elevated courses, full-service dining & family-friendly fun. Follow Discover all 337 employees Report this company About us PopStroke is an experiential mini golf and casual dining concept merging a dynamic, technologically advanced, and friendly environment open to guests of all ages. Headquartered in Jupiter, Florida, and partnered with Tiger Woods and TaylorMade, PopStroke locations feature two 18-hole putting courses built entirely with synthetic turf, incorporating fairways, bunkers, and rough. PopStroke's unique amenities include multiple bars with various craft beers, cocktails and wine, on-course mobile app drink delivery, an ice cream parlor, a playground, and a full-service restaurant.  PopStroke delivers an unmatched guest experience through cutting-edge technology, providing an interactive and unique golf experience for guests of all skill levels. PopStroke offers various event packages for parties of all sizes and hosts competitive putting tournaments throughout the year, including weekly putting leagues. PopStroke has 13 locations across Florida, Texas, Arizona, Alabama, South Carolina, and Nevada, with 7 additional venues under development and expected to open by the end of 2024. Website http://www.popstroke.com External link for PopStroke Entertainment Group Industry Entertainment Company size 1,001-5,000 employees Headquarters Stuart, Florida Type Privately Held Locations Primary 451 SW Federal Hwy Stuart, Florida 34994, US Get directions Employees at PopStroke Entertainment Group Dan Reiner Product Leader Aaron Weyenberg Product design director Kelly Hansen Chief Marketing Officer @ PopStroke Entertainment Group | Hospitality Marketing Mark Rouleau General Counsel at PopStroke Entertainment Group See all employees Updates PopStroke Entertainment Group 8,688 followers 2w Edited Report this post Austin, we’re officially on the map! PopStroke opens at The Pitch on September 11th. This is our 19th location nationwide, our 5th in Texas, and our very first in ATX.\n\nThe new venue brings two 18-hole courses, quick-service dining by BarTenders, craft cocktails, ice cream and shakes, plus pickleball, sand volleyball, and an esports gaming area. It is all about creating a place where people can connect, compete, and have fun.\n\nAustin thrives on community and energy and we’re here to add to that spirit. Or as we like to say, to Keep Austin Mini Golfing 😎\n\n📍 Find us at The Pitch, 13000 Harris Ridge Blvd, Austin TX 78753 starting September 11th. \n\nRead the full release here: https://lnkd.in/esC7gTAM Tap-in to a Mini Golf Oasis popstroke.com 69 5 Comments Like Comment Share PopStroke Entertainment Group 8,688 followers 2w Edited Report this post Mini golf, reimagined. At PopStroke we’re using tech to completely rethink a pastime that hasn’t changed in decades. From the way you play to the way you order food, the experience will never be the same again. Thank you Orlando Tech News for coming out!\n\nCheck out the full story here: Orlando Tech News 1,859 followers 3w There is just something special for Gavin Hall about the \"impossible challenge.\" \n\nThe University of Central Florida alum has tackled a few of those in his career, which has seen him spend time with giants like Instagram and TED Talks. \n\nBut, for his latest mission, he turned to golf - to some raised eyebrows.\n\n“Startup life is more fun,” said Hall, who leads PopStroke Entertainment Group 's national effort. “No other restaurant has people constantly moving the way we do. What drew me was the concept of hospitality and experience. How good of an experience can you give someone by making technology invisible?\"\n\nIt was an enjoyable day getting to know Gavin and learn more about what he has helped build in Central Florida. \n\nCheck out the story to learn more about this UCF alum's career. Carol Ann Dykes Logue Rafael Caamaño, BBA, MBA Sheena Fowler Ashley McMullan Robert Torres Dylana Silver-O’Brien https://lnkd.in/gZ4Bj-BJ PopStroke Winter Garden's tech redefines mini-golf entertainment https://orlandotechnews.com 27 2 Comments Like Comment Share PopStroke Entertainment Group 8,688 followers 1mo Report this post Winter Garden, we’ve arrived.\n\nPopStroke #18 is now open at Hamlin Town Center, bringing our signature mix of playful competition, great food, and good vibes to the west side of Orlando.\n\nThis location debuts BarTenders, our brand new full-service restaurant and bar concept that's putting our chicken tenders and our sports bar game on the map.\n\nWe’ve also rolled out the latest round of tech upgrades, making your round of mini golf feel more interactive, immersive, and just plain fun from the first hole to the last.\n\nHuge thanks to our incredible team and the Winter Garden community for bringing this one to life. Let’s play! 309 18 Comments Like Comment Share PopStroke Entertainment Group 8,688 followers 1mo Edited Report this post Big news, y'all!  🤠 \n\nPopStroke is officially expanding its footprint in the Lone Star State with our newest location at The Pitch in Austin— marking another milestone in our continued growth across Texas.\n\nWe’ve taken over operations at this incredible community space in Northeast Austin and are adding our signature mix of elevated mini golf, casual dining, and tons of outdoor entertainment. This venue opens in September and builds on a strong local foundation, in collaboration with Karlin Real Estate and the original design team at Mark Odom Studio, Inc .\n\nWith Cedar Park breaking ground and Austin on deck, our momentum in the Lone Star State is well on its way!\n\nRead the full story here: https://lnkd.in/eZkCcqy4 Tap-in to a Mini Golf Oasis popstroke.com 105 11 Comments Like Comment Share PopStroke Entertainment Group 8,688 followers 1mo Report this post Big things on the horizon 👀⛳️ We're redefining the way we play!\n\nHuge thanks to Danny Klein for the feature—great breakdown of our new indoor-outdoor prototype in Nashville, TN.\n\n👉 Read more here Danny Klein Danny Klein is an Influencer VP Editorial Director, Food, Retail, & Hospitality I QSR and FSR magazines I PMQ I CStore Decisions I Club + Resort 1mo Feast your eyes on the new indoor-outdoor prototype of growing eatertainment brand PopStroke Entertainment Group . This store, headed to Nashville in early 2026, is the first venue for the brand to feature a blend of outdoor and indoor mini golf—18 holes outside and 36 inside—sitting on 5.4 acres with five 23-foot jumbotrons. The indoor mini golf, under 20-foot ceilings, will cover 52,000 square feet, outdoor 25,000, and there will be another 9,500 of building with indoor dining, private events, and bars spread across two floors. In addition to just being a dynamic space, it signals a vital moment in PopStroke's, which received an equity investment from Tiger Woods in 2019, growth trajectory. This will enable it to target markets like Denver, New York, and other cold-weather spots it couldn't before (the company is based in Jupiter, Florida). All on the road to 150–200 U.S. locations. The full story is here: https://lnkd.in/eiG_YmNf +1 83 5 Comments Like Comment Share PopStroke Entertainment Group 8,688 followers 3mo Report this post Fox and Friends will be broadcasting LIVE at PopStroke Palm Beach from 6-9 AM. Join us for FREE coffee, brunch beverages, continental breakfast & mini golf.  Plus, special guest interviews throughout the broadcast! Who's ready to hang out with Steve Doocy ?!🥂\n\n*Doors open at 5 am, Guests must be in place by 5:30* 50 Like Comment Share PopStroke Entertainment Group 8,688 followers 6mo Report this post Palm Beach’s Best-Kept Secret, Until Now!\nIf you know, you know. And if you don’t, let’s change that.\n\nThe Lounge at PopStroke Palm Beach is where laid-back luxury meets effortless hospitality. A rooftop escape with a sushi lounge, rooftop pool, and a setting designed for both business and leisure. Whether you're closing a deal or unwinding after a long day, this is the place to be.\n\nMembership perks include:\n✔ Rooftop pool & shower amenities-perfect for a midday reset or post-game refresh.\n✔ A sushi lounge & full bar-where every roll is crafted with precision, and every visit feels like a new favorite spot.\n✔ Exclusive perks & hospitality-dedicated concierge service, special event access, and thoughtful touches that elevate every experience.\n✔ Unlimited mini golf-because some of the best connections happen on the course.\n\nMemberships are now open. Inquire today and email Brianna.alonso@popstroke.com . +3 138 6 Comments Like Comment Share PopStroke Entertainment Group 8,688 followers 6mo Report this post What a weekend for The Palm Beaches and the Cognizant Classic! Our Founder & CEO, Greg Bartoli, joined the ESPN West Palm team for live coverage to talk all things sports, golf, and the exciting energy at PopStroke Palm Beach. Big thanks to Theo Dorsey for the conversation! Watch the full interview here: https://lnkd.in/eWMg2NEH 150 2 Comments Like Comment Share PopStroke Entertainment Group 8,688 followers 6mo Report this post The 2025 PopStroke Invitational in Palm Beach brought out 57 teams, an electric mix of athletes, content creators, and local competitors, for an unforgettable night of high-stakes putting with $160K on the line. The energy, talent, and excitement were unmatched, setting the stage for even bigger tournaments to come.\n\nA huge thank you to our presenting sponsors, TaylorMade Golf Company and Monster Energy , and to all our partners who helped bring this vision to life. We can’t wait to build on this momentum. See you on the greens next time! +6 127 2 Comments Like Comment Share PopStroke Entertainment Group 8,688 followers 7mo Edited Report this post Exciting news from Nashville! We're bringing our first-ever ALL-WEATHER venue to Music City, where guests can enjoy mini-golf indoors or outdoors, no matter the weather. This is a game-changer! We will open our doors in early 2026. See you soon, Nashville! 🤠 https://lnkd.in/eZsaA3_7 PopStroke Set To Launch Trailblazing Indoor-Outdoor Venue in Nashville popstroke.com 150 11 Comments Like Comment Share Join now to see what you are missing Find people you know at PopStroke Entertainment Group Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Puttshack Hospitality Chicago, Illinois Drive Shack Entertainment Dallas, Texas Topgolf Entertainment Providers Dallas, Texas Puttery Hospitality Dallas, Texas Five Iron Golf Entertainment Providers New York, New York Swingers - the crazy golf club Hospitality Chicken N Pickle Entertainment Providers North Kansas City, MO F1® Arcade Hospitality TaylorMade Golf Company Sporting Goods Manufacturing Carlsbad, California LIV Golf Spectator Sports London, England Show more similar pages Show fewer similar pages Browse jobs Manager jobs 1,880,925 open jobs Environmental Specialist jobs 10,936 open jobs Director Sponsorship Sales jobs 4,617 open jobs Director of Product Management jobs 14,985 open jobs Analyst jobs 694,057 open jobs Director jobs 1,220,357 open jobs Event Manager jobs 35,306 open jobs Marketing Manager jobs 106,879 open jobs Developer jobs 258,935 open jobs Event Marketing Manager jobs 10,684 open jobs Medical Specialist jobs 78,500 open jobs Marketing Director jobs 53,789 open jobs Regional Manager jobs 107,546 open jobs Sales Trainer jobs 48,605 open jobs Account Manager jobs 121,519 open jobs Sales Manager jobs 310,050 open jobs Chief Executive Officer jobs 169,557 open jobs Actor jobs 5,526 open jobs Support Manager jobs 272,962 open jobs Salesperson jobs 172,678 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Analyst jobs Head of Events jobs Intelligence Analyst jobs Java Specialist jobs Head of Operations jobs Event Manager jobs Head of Sales jobs Researcher jobs Principal Product Manager jobs Account Manager jobs Chief Product Officer jobs Project Manager jobs Director of Product Management jobs Marketing Specialist jobs Senior Product Manager jobs Relationship Manager jobs Advisor jobs Digital Marketing Specialist jobs Senior Director jobs Director jobs President jobs Marketing Coordinator jobs Copywriter jobs Product Design Manager jobs Technical Producer jobs Graduate jobs Front Desk Receptionist jobs Project Administrator jobs Real Estate Agent jobs Vice President Marketing jobs Administrator jobs Specialist jobs Information Technology Manager jobs Director of Regulatory Affairs jobs Chief Legal Officer jobs General Counsel jobs Vice President Brand Marketing jobs Head of Brand Marketing jobs Senior Vice President Marketing jobs Director of Strategic Partnerships jobs Director of Partnerships jobs Marketing Officer jobs Head of Public Affairs jobs Director of Business Development jobs Associate Vice President jobs Golf Instructor jobs Director of Housekeeping jobs Golf Coach jobs Independent Sales Representative jobs Marketing Director jobs Consultant jobs Vice President Human Resources jobs Area Sales Manager jobs Construction Project Manager jobs Vice President jobs Research Assistant jobs Human Resources Director jobs Head jobs Engineer jobs Director of Infrastructure jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at PopStroke Entertainment Group Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.biography.com/musicians/michael-jackson",
      "text": "Michael Jackson: Biography, Musician, Dancer Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Kathy Bates Almost Quit Emmy Nominee Owen Wilson Lainey Wilson Shohei Ohtani Famous Musicians Black History Michael Jackson Michael Jackson Michael Jackson was a multitalented singer and dancer who enjoyed a chart-topping career both with the Jackson 5 and as a solo artist. By Biography.com Editors and Colin McEvoy Updated: Apr 11, 2023 2:28 PM EDT KMazur // Getty Images We may earn commission from links on this page, but we only recommend products we back. Jump to: Who Was Michael Jackson? Quick Facts Early Life and Family The Jackson 5 Emerging Solo Career \"Thriller\" (1982) The Height of Stardom Continued Career Success and Abuse Allegations Career Decline and Criminal Charges Wives and Children Death Memorials and Legacy Quotes 1958-2009 Who Was Michael Jackson? Known as the “King of Pop,” Michael Jackson was a best-selling American singer, songwriter, and dancer. As a child, Jackson became the lead singer of his family’s popular Motown group, the Jackson 5 . He went on to a solo career of astonishing worldwide success, delivering No. 1 hits from the albums Off the Wall , Thriller , and Bad . Thriller remains one of the best-selling albums in history. In his later years, Jackson was dogged by allegations of child molestation. The 13-time Grammy Award winner died in 2009 at age 50 of a drug overdose just before launching a comeback tour. Quick Facts FULL NAME: Michael Joseph Jackson BORN: August 29, 1958 DIED: June 25, 2009 BIRTHPLACE: Gary, Indiana SPOUSES: Lisa Marie Presley (1994-1996) and Debbie Rowe (1996-2000) CHILDREN: Michael “Prince,” Paris , and Prince “Blanket” ASTROLOGICAL SIGN: Virgo Early Life and Family Getty Images Michael Jackson, pictured in 1970 as a pre-teen, began his professional singing career at age 5. Michael Joseph Jackson was born on August 29, 1958, in Gary, Indiana. He was the eighth of 10 children born to Joseph Jackson , a crane operator, and Katherine Jackson, a homemaker and a devout Jehovah’s Witness. Both of Jackson’s parents previously had musical aspirations themselves: Katherine played clarinet and piano and had aspired to be a country singer, while Joseph was a guitarist who performed in local R&B bands. They encouraged their children to pursue musical ambitions, and Jackson’s career in music began at the age of 5 under his father’s encouragement. Almost all of Jackson’s siblings made marks in the music industry, including Rebbie , Jackie, Tito, Jermaine , La Toya, Marlon, Randy, and Janet Jackson . (His brother Brandon, Marlon’s twin, died shortly after birth.) Joseph pushed his children hard to succeed, making them rehearse five hours a day after school, and was reportedly known to become violent with them . He was said to beat them with a belt buckle or electric kettle cord and to order them to break a branch off a tree if they got a dance step wrong so he could hit them with it. The Jackson 5 Getty Images The Jackson 5, seen performing around 1969, included brothers Tito Jackson, Marlon Jackson, Michael Jackson, Jackie Jackson, and Jermaine Jackson. Joseph molded his sons into a musical group in the early 1960s that would later become known as the Jackson 5. At first, the Jackson Family group consisted of Jackson’s older brothers Tito, Jermaine, and Jackie. Jackson joined his siblings when he was 5 years old and emerged as the group’s lead vocalist. He showed remarkable range and depth for such a young performer, impressing audiences with his ability to convey complex emotions. They officially became the Jackson 5 when older brother Marlon joined the group. Watch This Is It , the dramatic documentary with rare behind-the-scenes footage of Michael creating and preparing for his sold out shows that would have taken place in London's O2 Arena. Jackson and his brothers spent endless hours rehearsing and polishing their act. At first, the Jackson 5 played local gigs and built a strong following. They recorded one single on their own, “Big Boy,” with the B-side “You’ve Changed,” but the record failed to generate much interest. The group moved on to working as the opening act for R&B artists such as Gladys Knight and The Pips, James Brown , and Sam and Dave. Many of these performers were signed to the legendary Motown record label, and the Jackson 5 eventually caught the attention of Motown founder Berry Gordy . Impressed by the group, Gordy signed the group to his label in early 1969. Jackson and his brothers moved to Los Angeles, where they lived with Gordy and with Diana Ross of the Supremes as they got settled. The Jackson 5 made its first television appearance during the 1969 Miss Black American Pageant, performing a cover of “It’s Your Thing.” Their first album, Diana Ross Presents the Jackson 5 , hit the charts in December 1969, with the single “I Want You Back” reaching No. 1 on the Billboard Hot 100 chart shortly afterward. More chart-topping singles quickly followed, such as “ABC,”  “The Love You Save,”  and “I’ll Be There.” For several years, Jackson and the Jackson 5 maintained a busy tour and recording schedule, under the supervision of Gordy and his Motown staff. The group became so popular that it even had its own self-titled cartoon show, which ran from 1971 to 1972. Jackson also popularized the “robot dance” after using the move during a 1973 performance of the song “Dancing Machine” on The Mike Douglas Show . Despite the group’s great success, there was trouble brewing behind the scenes. Tensions mounted between Gordy and Joseph over the management of his children’s careers, with the Jacksons wanting more creative control over their material. The group officially severed ties with Motown in 1976, though Jermaine remained with the label to pursue his solo career. Now calling themselves the Jacksons, the group signed a new recording deal with Epic Records. By the release of its third album for the label, Destiny (1978) , the brothers had emerged as talented songwriters. Emerging Solo Career Getty Images Michael Jackson in 1979 Written by Michael Jackson, Himself Moonwalk: A Memoir Now 50% Off $14 at Amazon Jackson began his solo career while simultaneously performing with the Jackson 5. He released his debut solo album at age 13 with Got to Be There (1971), making the charts with the title track. He had his first solo No. 1 single with the title track from his sophomore album Ben (1972), which he recorded for the 1972 film of the same name about a killer rat. Jackson followed those albums with Music and Me (1973) and Forever, Michael (1975), the latter of which was his last album with Motown Records. As Jackson’s stardom rose, he tried his hand at acting, and the experience left its mark on his music, too. Jackson portrayed the Scarecrow in the Sidney Lumet–directed film The Wi z (1977), starring alongside Diana Ross and Nipsey Russell. While living in New York City to make the film, Jackson frequently visited the Studio 54 nightclub and was exposed to early hip-hop music, which contributed to his beatboxing in future songs like “Working Night and Day.” Jackson achieved his solo career breakthrough with Off the Wall (1979), his first album with Epic Records and his first produced by Quincy Jones , whom he met while working on The Wiz . An infectious blend of pop and funk, Off the Wall featured the Grammy Award–winning single “Don’t Stop ’Til You Get Enough,” along with such hits as “Rock with You,” “She’s Out of My Life,” and the title track. Critics felt the album moved Jackson from the pop music of his youth into a more complex sound, and some have called it one of the best pop albums ever made . Jackson was still performing with his brothers at this time, and the overwhelmingly positive response to Off the Wall helped the Jacksons as a group. Their album Triumph (1980) sold more than 1 million copies, and the brothers went on an extensive tour to support the recording. At the same time, Jackson continued exploring more ways to branch out on his own. In 1983, Jackson embarked on his final tour with his brothers to support the album Victory (1984). Jackson’s duet with Mick Jagger called “State of Shock” was the most successful single from the album. \"Thriller\" (1982) Getty Images Michael Jackson’s already successful career skyrocketed in the early 1980s after the release of Thriller . Jackson achieved unparalleled success with the release of his six solo album Thriller (1982), which as of August 2021 was still recognized by Guinness World Records as the best-selling album of all time, having sold 67 million copies worldwide and 34 million units in the United States alone. The album stayed on the charts for 80 weeks after its release, holding the No. 1 spot for 37 weeks, and generated seven Top 10 hits, including “Thriller,” “Billie Jean,” “Beat It,” “Human Nature,” “Wanna Be Startin’ Somethin’,” and “P.Y.T. (Pretty Young Thing).” The album garnered 12 Grammy Award nominations and notched eight wins, both records at the time. Jackson also filmed an elaborate music video was for the album’s title track. Directed by filmmaker John Landis, the 14-minute “Thriller” mini-movie features a horror plot that culminates with Jackson dancing with dozens of zombies in an abandoned city street. Following its debut on MTV on December 2, 1983, it was hailed as one of the greatest music videos of all time and became the first music video to be selected for the National Film Registry in 2009. On a 1983 television special honoring Motown, Jackson performed his No. 1 hit “Billie Jean” and debuted the moonwalk, which became one of his signature moves. The dance step, which R&B musician Jeffrey Daniel had taught him three years earlier , involves the dancer gliding backwards despite  bodily actions that suggest forward motion. The much-lauded dance performance further boosted sales for the already-successful Thriller album. The New York Times hailed Jackson as a “musical phenomenon,” writing: “In the world of pop music, there is Michael Jackson and there is everybody else.” The Height of Stardom Jackson signed a record-breaking $5 million promotional deal with PepsiCo in November 1983, launching the brand’s youth-targeted New Generation campaign. However, Jackson ended up filing a lawsuit against Pepsi when, during filming of a simulated concert for a commercial, pyrotechnics accidentally set Jackson’s hair on fire , resulting in second- and third-degree burns on his scalp. Jackson had surgery to repair his injuries and is believed to have begun experimenting with plastic surgery around this time. His face, especially his nose, would become dramatically altered in the coming years. In 1985, Jackson showed his altruistic side by working with Lionel Richie to co-write “We Are the World,” a charity single for the non-profit organization USA for Africa. A veritable who’s who of music stars participated in the project, including Ray Charles , Bob Dylan , Willie Nelson , Bruce Springsteen , and Tina Turner . It became one of the top-selling singles of all time and raised, by some accounts, more than $75 million for humanitarian aid to fight poverty in Africa. Five years after Thriller , Jackson released his highly-anticipated follow-up album Bad (1987). Although unable to duplicate the phenomenal sales of Thriller , Bad still reached the top of the charts and became the first album to feature five No. 1 hits with “I Just Can’t Stop Loving You,” “Bad,” “The Way You Make Me Feel,” “Man in the Mirror,” and “Dirty Diana.” Filmmaker Martin Scorsese directed the title track’s music video, which featured a then-unknown Wesley Snipes and involved an elaborate story about delinquent teenagers and gang violence. Jackson spent more than a year on the road, playing concerts to promote the album. In 1988, Jackson bought 2,700 acres of property in Los Olivos, California, for $17 million and had it converted into Neverland Ranch , a home and private amusement park that he owned until 2005. Named after the fantasy island from the Peter Pan story, it included a zoo, train, Ferris wheel, and 50-seat movie theater. Several exotic pets were kept at the ranch, including Jackson’s famous pet chimpanzee Bubbles. Around the late 1980s, rumors began swirling that Jackson was lightening the color of his skin to appear more white and sleeping in a special oxygen chamber to increase his lifespan. In 1993, Jackson agreed to a rare television interview with Oprah Winfrey to quell rumors. He explained that the change in his skin tone was the result of a skin condition known as vitiligo, and he opened up about the abuse he suffered from his father. Continued Career Success and Abuse Allegations Getty Images Michael Jackson performed the Super Bowl XXXVII halftime show in 1993. In 1991, Jackson released his eighth solo album Dangerous , his first without Quincy Jones in 16 years. The album marked a different direction for Jackson and mixed various genres, including R&B, funk, gospel, hip-hop, rock, industrial, and classical. It included the hit single “Black or White,” with an accompanying music video directed by Landis and featuring a cameo appearance by child star Macaulay Culkin . The final minutes of the video featured Jackson making sexual gesturing and violently damaging cars and buildings, which drew criticism from some viewers. Jackson issued an apology and edited the video to remove these elements. Jackson’s music continued to enjoy widespread popularity in the following years. In 1993, he performed at several important events, including the halftime show of Superbowl XXVII. However, 1993 also saw the first of several child molestation allegations against Jackson, when a 13-year-old boy claimed that the music star had fondled him. Jackson was known to have sleepovers with boys at his Neverland Ranch, but this was the first public charge of wrongdoing. The police searched the ranch, but said they found no evidence to support the claim. The following year, Jackson settled the case out of court with the boy’s family. In the 2003 television documentary Living with Michael Jackson, British journalist Martin Bashir spent several months with the singer, even getting him to discuss his relationships with children. Jackson admitted that he continued to have children sleep over at his ranch, even after the 1993 allegations and that sometimes he slept with the children in his bed. “Why can’t you share your bed? That’s the most loving thing to do, to share your bed with someone,” Jackson told Bashir. Career Decline and Criminal Charges Getty Images Michael Jackson faced many controversies in his life, including a 2005 criminal trial in which he was acquitted of all charges. Jackson’s musical career began to decline with the lukewarm reception to HIStory: Past, Present, and Future, Book I (1995). The two-disc album featured a greatest hits compilation on disc one and new material on disc two that included collaborations with Janet Jackson, The Notorious B.I.G. , Shaquille O’Neal , and Slash . HIStory was considered Jackson’s most personal album , with lyrics pertaining to his child abuse allegations and anger of his treatment by the media. The record spawned two hits, “You Are Not Alone” and his duet with sister Janet, “Scream.” The spaceship-themed video for the latter song cost a record-setting $7 million to produce and earned a Grammy Award for its slick effects. Another track from the album, “They Don’t Care About Us,” brought Jackson intense criticism for using an anti-Semitic term. In 2001, Jackson released Invincible , his final studio album prior to his death. It cost $30 million to produce, making it the most expensive album ever made . The album touched upon such topics as isolation, social issues, and Jackson’s continued objections to the media. Despite debuting at No. 1 on the Billboard charts, it received mixed reviews from critics. Invincible was released as Jackson was having legal issues with Sony over the rights to his master recordings , which escalated when Jackson called Sony Music Chairman Tommy Mottola a racist who exploits Black artists. By the turn of the century, Jackson was increasingly becoming known for his eccentricities, which included wearing a surgical mask in public. In 2002, Jackson made headlines when he seemed confused and disoriented on stage at the MTV Video Music Awards. In 2002, he received enormous criticism for dangling his baby son Blanket over a balcony while greeting fans in Berlin, Germany. In a later interview, Jackson explained that “We were waiting for thousands of fans down below, and they were chanting they wanted to see my child, so I was kind enough to let them see. I was doing something out of innocence.” In 2003, Jackson encountered more legal woes when he was arrested on charges related to incidents with a 13-year-old boy. He faced 10 counts in total, including lewd conduct with a minor, conspiracy to commit child abduction, false imprisonment, and extortion. The resulting 2005 trial was a media circus, with fans, detractors and camera crews surrounding the courthouse. More than 130 people testified, and Jackson’s accuser described via videotape how he had been given wine and molested. However, the jury found problems with his testimony, as well as that of his mother. Jackson was found not guilty of all charges on June 14, 2005. Wives and Children Getty Images Lisa Marie Presley and Michael Jackson pose for a photo at the Palace of Versailles on September 5, 1994, in France. In August 1994, Jackson announced that he had married Lisa Marie Presley , daughter of rock icon Elvis Presley . The union proved to be short-lived, as they divorced in 1996. Some thought that the marriage was a publicity ploy to restore Jackson’s image after child molestation allegations. Related Story Odd Couple: Lisa Marie Presley and Michael Jackson Later in 1996, Jackson wed nurse Debbie Rowe . Jackson and Rowe had two children through artificial insemination: son Michael Joseph Jackson Jr. , born in 1997 and known as Prince Jackson, and daughter Paris Michael Katherine Jackson , born in 1998. When Rowe and Jackson divorced in 1999, Michael received full custody of their two children. Jackson would go on to have a third child, Prince Michael Jackson II who went by “Blanket” and now “Bigi,” with an unknown surrogate in 2002. Death Getty Images Fans of Michael Jackson sit vigil at his star on the Hollywood Walk of Fame following the singer’s death on June 25, 2009, in Los Angeles, California. Jackson died on June 25, 2009, at the age of 50, after suffering a cardiac arrest in his Los Angeles home. CPR attempts failed, and he was rushed to the hospital, where he died later that morning. In February 2010, an official coroner’s report revealed Jackson’s cause of death was acute propofol intoxication, or a lethal overdose on a prescription drug cocktail including the sedatives midazolam, diazepam, and lidocaine. Aided by his personal physician Dr. Conrad Murray , Jackson had been taking sedative drugs to help him sleep at night. Murray told police that he believed Jackson had developed a particular addiction to propofol, which Jackson referred to as his “milk.” Murray reportedly administered propofol by IV in the evenings, in 50-milligram dosages, and was attempting to wean the pop star off the drug around the time of his death. A police investigation revealed that Murray was not licensed to prescribe most controlled drugs in the state of California. The steps he took to save Jackson also came under scrutiny, as evidence showed that the standard of care for administering propofol had not been met, and the recommended equipment for patient monitoring, precision dosing, and resuscitation had not been present. As a result, Jackson’s death was ruled a homicide. Murray was convicted of involuntary manslaughter on November 7, 2011, receiving a four-year maximum prison sentence. In 2013, the Jackson family launched a wrongful death lawsuit against AEG Live, the entertainment company that promoted Jackson’s planned comeback series in 2009. They believed that the company had failed to effectively protect the singer while he was under Murray’s care. Jackson family lawyers sought up to $1.5 billion—an estimation of what Jackson could have earned to that point—but in October 2013, a jury determined that AEG wasn’t responsible for the singer’s death. Memorials and Legacy Getty Images Jermaine Jackson speaks at his brother Michael’s public memorial service held at Staples Center on July 7, 2009, in Los Angeles. On July 7, 2009, a televised memorial was held for Jackson’s fans at the Staples Center in downtown Los Angeles. While 17,500 free tickets were issued to fans via lottery, an estimated 1 billion viewers watched the memorial on television or online. Jackson’s death resulted in an outpouring of public grief and sympathy. Memorials were erected around the world, including one at the arena where he was set to perform and another at his childhood home in Gary, Indiana. The Jackson family held a private funeral on September 3, 2009, at the Forest Lawn Memorial Park in Glendale, California, for immediate family members and 200 guests. Celebrity mourners included Jackson’s ex-wife Lisa Marie Presley and actor Elizabeth Taylor . Over the course of his career, Jackson had notched 38 Grammy Award nominations and 13 wins, including Album of the Year for Thriller , Record of the Year for “Beat It,” Song of the Year for “We Are The World,” and his first Grammy in 1980 for Best Male R&B Vocal Performance on “Don’t Stop ’Til You Get Enough.” Among his other awards and honors are the 1993 Grammy Legend Award, his 2001 induction to the Rock & Roll Hall of Fame, and The Recording Academy’s Lifetime Achievement Award. Michael Jackson's This Is It Shop at Amazon A documentary of Jackson’s preparations for his final tour, entitled This Is It , was released in October 2009. The film, which features a compilation of interviews, rehearsals, and backstage footage of its star, made $23 million in its opening weekend and went on to make $261 million worldwide. A handful of posthumous albums were released in the years after Jackson’s death. The first, Michael , was released in December 2010 amid controversy about whether the singer actually performed some of the tracks. Brother Randy was among those who questioned the authenticity of the recordings, but the Jackson estate later refuted the claims, according to The New York Times . The second album, Xscape ( 2014), featured R&B star and Jackson protege Usher performing the single “Love Never Felt So Good.” The album debuted at No. 2 on Billboard ’s Top 200 Album chart. Getty Images Michael Jackson rehearses for his planned shows in London at the Staples Center on June 23, 2009, in Los Angeles, California. Jackson died two days later at the age of 50. Since his death, Jackson has been profiled in multiple biographies and inspired the creation of two Cirque du Soleil shows. He was posthumously honored with the 2018 Elizabeth Taylor AIDS Foundation Legacy Award for Humanitarian Service, with children Paris and Prince Michael accepting on his behalf. Jackson’s debts have been settled thanks to his earlier investment in the Sony/ATV Music catalog, which includes the publishing rights for songs of industry heavyweights such as the Beatles , the Rolling Stones , and Taylor Swift . The Jackson estate sold its share of Sony/ATV in 2016 for $750 million, and two years later, the estate received another $287.5 million for its stake in EMI Music Publishing. Additionally, Jackson’s earning power lasted well past his final days. In October 2017, Forbes announced that Jackson had topped the publication’s list of top-earning dead celebrities for the fifth straight year, earning $75 million. Accusations of sexual abuse against Jackson resurfaced in early 2019 with the airing of Leaving Neverland at the Sundance Film Festival, followed by an HBO broadcast. The four-hour documentary explores the recollections of two men who describe how the pop star lured them into his orbit when they were boys, gaining the trust of their parents, before coercing them into sexual activities in hotel rooms and at his Neverland Ranch. The Jackson estate called the two accusers “serial perjurers” and launched a $100 million lawsuit against HBO. As of December 2020, the suit planned to go into arbitration . Quotes Being onstage is magic. There’s nothing like it. You feel the energy of everybody who’s out there. You feel it all over your body. Being an entertainer, you just can’t tell who is your friend. Being mobbed hurts. You feel like you’re spaghetti among thousands of hands. They’re just ripping you and pulling your hair. And you feel that any moment you’re gonna just break. I hate to take credit for the songs I’ve written. I feel that somewhere, someplace, it’s been done, and I’m just a courier bringing it into the world. I really believe that. I love what I do. I’m happy at what I do. It’s escapism. Why can’t you share your bed? That’s the most loving thing to do, to share your bed with someone. If you enter this world knowing you are loved and you leave this world knowing the same, then everything that happens in between can be dealt with. I always want to know what makes good performers fall to pieces. My father would rehearse with a belt in his hand. You couldn’t mess up. Magic is easy if you put your heart into it. I wouldn’t be happy doing just one kind of music or label ourselves. I like doing something for everybody... I don’t like our music to be labeled. Labels are like... racism. What I’m asking is whether this is still a country where a peculiar person such as Michael Jackson can get a fair shake and be considered innocent until proven guilty... or is this just a 21st century American barnyard where we all feel free to turn on the moonwalking rooster... and peck it to death? Crown Archetype Moonwalk: A Memoir by Michael Jackson Now 50% Off $14 at Amazon Legacy Recordings Thriller Vinyl Now 27% Off $16 at Amazon $23 at Target Funko POP! Rocks: Michael Jackson Collectable $15 at Amazon $15 at Walmart Legacy Recordings Bad Vinyl Now 14% Off $19 at Amazon Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Colin McEvoy Senior News Editor, Biography.com Colin McEvoy joined the Biography.com staff in 2023, and before that had spent 16 years as a journalist, writer, and communications professional. He is the author of two true crime books: Love Me or Else and Fatal Jealousy . He is also an avid film buff, reader, and lover of great stories. Advertisement - Continue Reading Below Black History How the Greensboro Four Began the Sit-In Movement 9 Memorable Super Bowl Halftime Shows Venus Williams How Serena and Venus Williams’ Father Pushed Them Advertisement - Continue Reading Below Hakeem Jeffries Toni Morrison Martin Luther King Jr. and James Baldwin Malia Obama How Althea Gibson Changed Tennis and Golf Forever Which Historical Figures Are on U.S. Money? Jackie Robinson How the First Black Woman FBI Agent Broke Barriers Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://popstroke.com/press/popstroke-announces-april-22nd-opening-date-for-sin-cities-elevated-mini/",
      "text": "PopStroke Announces April 22nd Opening Date For Sin Cities' Elevated Mini Golf And Entertainment Venue | Press | Eat. Putt. Drink. Apr 5, 2024 PopStroke Announces April 22nd Opening Date For Sin Cities' Elevated Mini Golf And Entertainment Venue share LAS VEGAS, NV: April 5, 2024: PopStroke Entertainment Group, the leading mini golf and entertainment brand, is excited to announce the opening of its thirteenth location in Las Vegas, Nevada. PopStroke will open to the public on Monday, April 22. This location marks the first venue in The Silver State. Located on South Las Vegas Blvd in Town Square, which features an array of retail, dining, and experiential venues, PopStroke is an elevated mini golf and entertainment experience that brings guests an entirely new way to play mini golf. PopStroke Las Vegas features a modern two-story building set on two uniquely designed 18-hole courses, which includes an open-air dining experience with climate control, an expansive outdoor beer garden, lively bars featuring craft beers and signature cocktails, a fully enclosed outdoor playground for the little ones, and oversized televisions and screens throughout the property, offering the perfect sports bar setting. Additionally, a private second-story balcony event space overlooking both courses will allow guests to host events of all sizes- including bachelor/bachelorette, kids' and adult birthday parties, and corporate events.\n\nPerfect for Southern Nevada residents and tourists alike, guests can enjoy plenty of fun for the entire family, including an ice cream parlor with custom signature milkshakes and outdoor games like ping pong, foosball, and corn hole. Like all PopStroke locations, guests can keep track of their scores from their mobile devices and order drinks for on-course delivery through the PopStroke App. \"As the dynamic hub of global entertainment, Las Vegas draws visitors from every corner of the world, embodying diversity and excitement like no other place on Earth,\" said PopStroke Founder and CEO Greg Bartoli. \"Our expansion into this iconic city celebrates our worldwide appeal and marks a thrilling chapter for PopStroke as we join the vibrant fabric of Las Vegas and its surrounding communities. We look forward to welcoming everyone to Popstroke, uniting people of all backgrounds and abilities for an unforgettable golf entertainment experience in the Entertainment Capital of the World.\" PopStroke Las Vegas is located at 6617 S Las Vegas Blvd. On Monday, April 22, at 9 am, PopStroke will host a ribbon-cutting ceremony alongside council members from Clark County and The Las Vegas Chamber of Commerce. The doors will open to the public on April 22 at noon. Regular business hours are Sunday through Thursday, 9 am-11 pm, and Friday through Saturday, 9 am-midnight. MEDIA INQUIRIES: The media is invited to the Ribbon-Cutting Ceremony on April 22 at 9 am. For all inquiries or to schedule a separate media tour with PopStroke's Founder and CEO, contact Dylana Silver-O'Brien at Dylana.silver-obrien@popstroke.com or (845) 325-3442. ABOUT POPSTROKE ENTERTAINMENT GROUP: PopStroke is an experiential golf and casual dining concept merging a dynamic, technologically advanced, competitive golf environment open to guests of all ages. Headquartered in Jupiter, Florida, and partnered with Tiger Woods and TaylorMade, PopStroke locations feature two 18-hole putting courses built entirely with synthetic turf, incorporating fairways, bunkers, and rough. PopStroke's unique amenities include multiple bars with various craft beers, cocktails, and wine, on-course mobile app drink delivery, an ice cream parlor, and a restaurant. PopStroke delivers an unmatched guest experience through cutting-edge technology, providing an interactive and unique golf experience for guests of all skill levels. PopStroke offers various event packages for parties of all sizes and hosts competitive putting tournaments throughout the year, including weekly putting leagues. PopStroke has 12 locations across Florida, Texas, Arizona, Alabama, and South Carolina, with seven additional venues under development and expected to open by the end of 2024. Tap-in to fun. Sign up for offers & new openings. We may even send you some birthday goodies! Email Address Sign Up Locations Alabama Arizona Florida Nevada South Carolina Tennessee Texas Winter Garden @ Hamlin Tampa @ Wesley Chapel Sarasota Port St. Lucie Palm Beach Orlando @ Waterford Lakes Fort Myers Delray Beach Daytona Beach Tap-in Plan a Visit Food & Drinks Events & Parties Gift Cards Company About Our Partners Careers Press Room Privacy Policy PopStroke Greens Eat. Putt. Drink. © PopStroke 2025"
    },
    {
      "url": "https://surgetechak.com/contact/",
      "text": "Get in Touch with Surge Tech - Contact Us Today Skip to content HOME MANAGED SERVICES NETWORK SUPPORT AND MONITORING Monitored Security Disaster Recovery HIPAA Compliance IT SERVICES Chief Information Officer Cloud Services VoIP Phone Services Training and Consulting CONTACT Contact Us Contact SurgeTechAK 2023-08-24T10:13:42-08:00 Get In Touch! Complete the form below and a representative from Surge Technologies will be in touch to discuss your organizational needs. Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Let's talk Phone 907-947-2744 Get In Touch Email sgoodwin@surgetechak.com Get In Touch Contact Info Anchorage Mobile: 907-947-2744 Email: mailto: sgoodwin@surgetechak.com Managed Services Network Support and Monitoring Monitored Security Disaster Recovery HIPAA Compliance IT Services CIO (Chief Information Officer) Cloud Services VoIP Phone Services Training and Consulting © Copyright | Surge Technologies of Alaska | All Rights Reserved | Anchorage Alaska Web Design by Bianca Frank Design Page load link Go to Top"
    },
    {
      "url": "https://popstroke.com/corporate-teams/",
      "text": "Events & Parties at PopStroke | PopStroke | Eat. Putt. Drink. PopStroke Delray Beach | Eat. Putt. Drink. Events & Parties Come party with us in Delray Beach PopStroke is the perfect event venue for unforgettable celebrations of all kinds. From corporate \noutings, birthday parties, team-building events, golf league gatherings, fantasy football drafts, \ngraduation parties, family reunions, and holiday celebrations, to casual get-togethers with friends, \nwe offer versatile private event spaces, group party packages, and 36 holes of mini golf that \neveryone will love. And if you happen to be planning a wedding welcome party, bachelor or \nbachelorette night, or rehearsal dinner, PopStroke is ready to make it a hole-in-one celebration. \nGreat food, craft drinks, and fun activities make every event at PopStroke a truly unique experience. Plan Event Leave the hosting to us. Corporate Events Whether you’re planning a small client outing, a team-building event, or a full venue buyout to celebrate your company’s success, PopStroke offers the ultimate corporate event experience. Our customizable event packages, premium amenities, and lively mini golf atmosphere make it easy to impress clients, boost employee morale, and host unforgettable business celebrations. From planning to execution, our team handles the details so you can focus on networking, team bonding, and celebrating your achievements. Birthday Parties Throw the ultimate birthday party at PopStroke, an unforgettable mini golf venue perfect for kids, teens, and adults. Whether you’re planning a child’s birthday celebration, a teen party, or a lively gathering for friends and family, our unique event space, fun activities, and delicious food options make PopStroke the go-to destination for birthday parties of all ages. Celebrate in style with a birthday experience everyone will love. Holiday Parties Let’s celebrate the season in style at PopStroke. From company holiday parties to festive gatherings with friends and family, our venues are the perfect setting for your seasonal celebration. Whether you’re planning for New Year’s, Friendsgiving, or any holiday in between, PopStroke delivers delicious food, private event spaces, seasonal drinks, and a lively atmosphere that make every party unforgettable. Grad Parties Whether you're tossing your cap for high school or college, our venues are the place to be for an epic graduation bash. With t wo challenging courses, all your favorite food, and a vibe that screams 'celebrate,' PopStroke is where memories are made. So why settle for ordinary when you can make it legendary? Let's toast to your next chapter. “Had the best experience hosting my son's birthday at PopStroke! The mini golf was great for all ages, playground was a hit with the kids, and everyone agreed they had the best burgers and ice cream. Perfect spot for family-friendly parties!” — Casey M. eat. putt. drink. Enhance your visit with a flavorful culinary experience at our full-service restaurant. Indulge in an array of fan-favorite dishes, all crafted in-house from scratch. Our menu caters to every palate, featuring shareable appetizers, burgers, wraps, fresh salads, tacos, and an ice cream parlor with custom milkshakes for a sweet finish. Embark on a mini-golf adventure at our oasis-like destination, featuring two meticulously designed 18-hole putting courses. Each course mirrors the challenge and excitement of a traditional golf setup, complete with synthetic fairways, tricky bunkers, and unpredictable rough patches—all played with just a putter in hand! Pop a seat at our lively sports bar scene, where you can catch the latest games while enjoying a diverse selection of craft beers, premium spirits, and expertly crafted cocktails. Order directly on our mobile app to get your drink delivered right to you on the course, ensuring you never miss a moment of the fun! Frequently Asked Questions What’s required for booking an event or party? Once we know the date and size of your event, a 50% deposit will be all you need to finalize your booking. How much does it cost? Event pricing varies based on location and package options. All packages include mini golf, food, and non-alcoholic beverages. Contact us and we will get you a quote as soon as possible. What makes our events unique? Whether you’re a seasoned mini-golf enthusiast or trying it for the first time, our exquisitely designed venues offer a unique event space suitable for groups of all sizes. Featuring 36 holes of elevated mini golf, lively bars, outdoor gaming areas, and private event spaces, PopStroke guarantees to make your party the talk-of-the-party. How many guests can I invite? Event bookings can range from a minimum of 12 guests to a full store buy out. If you have fewer than 12 guests, we welcome you to join us as a walk-in guest and will ensure you have a fantastic experience. Venue Location Port St. Lucie Fort Myers Sarasota Orlando @ Waterford Lakes Houston @ Katy Glendale Tampa @ Wesley Chapel Scottsdale Delray Beach Tuscaloosa Myrtle Beach Dallas @ The Colony Las Vegas College Station San Antonio Daytona Beach Palm Beach Winter Garden @ Hamlin Austin What are we celebrating? Adult Birthday Party Kids Birthday Party Corporate Event Summer Camp or Field Trip Social Event Other Event Date & Time Number of Guests Get Started Basics Your Phone Number Your Email Address Your full name Keep me updated on promotions, events, and more Submit 🎉 Get ready to party. What’ next? Send us your basic event info Our events team contacts you to finalize details Have a blast at your event Browse the menu The Experience Food & Drinks Events & Parties Delray Beach 1314 N Federal Hwy , Delray Beach , FL Sat Sun Mon Tue Wed Thu Fri 9am—12am (561) 800-4520 Get Directions Choose a Location Zip Code or City, State Change Location Plan a Visit Choose a Location Zip Code or City, State Delray Beach, FL Delray Beach, FL Change Sat Sun Mon Tue Wed Thu Fri 9am—12am 1314 N Federal Hwy , Delray Beach , FL (561) 800-4520 Sat Sun Mon Tue Wed Thu Fri 9am—12am Change The Experience Plan Event Tap-in to fun. Sign up for offers & new openings. We may even send you some birthday goodies! Email Address Sign Up Locations Alabama Arizona Florida Nevada South Carolina Tennessee Texas Winter Garden @ Hamlin Tampa @ Wesley Chapel Sarasota Port St. Lucie Palm Beach Orlando @ Waterford Lakes Fort Myers Delray Beach Daytona Beach Tap-in Plan a Visit Food & Drinks Events & Parties Gift Cards Company About Our Partners Careers Press Room Privacy Policy PopStroke Greens Eat. Putt. Drink. © PopStroke 2025"
    },
    {
      "url": "https://popstroke.com/private-events/",
      "text": "Events & Parties at PopStroke | PopStroke | Eat. Putt. Drink. PopStroke Delray Beach | Eat. Putt. Drink. Events & Parties Come party with us in Delray Beach PopStroke is the perfect event venue for unforgettable celebrations of all kinds. From corporate \noutings, birthday parties, team-building events, golf league gatherings, fantasy football drafts, \ngraduation parties, family reunions, and holiday celebrations, to casual get-togethers with friends, \nwe offer versatile private event spaces, group party packages, and 36 holes of mini golf that \neveryone will love. And if you happen to be planning a wedding welcome party, bachelor or \nbachelorette night, or rehearsal dinner, PopStroke is ready to make it a hole-in-one celebration. \nGreat food, craft drinks, and fun activities make every event at PopStroke a truly unique experience. Plan Event Leave the hosting to us. Corporate Events Whether you’re planning a small client outing, a team-building event, or a full venue buyout to celebrate your company’s success, PopStroke offers the ultimate corporate event experience. Our customizable event packages, premium amenities, and lively mini golf atmosphere make it easy to impress clients, boost employee morale, and host unforgettable business celebrations. From planning to execution, our team handles the details so you can focus on networking, team bonding, and celebrating your achievements. Birthday Parties Throw the ultimate birthday party at PopStroke, an unforgettable mini golf venue perfect for kids, teens, and adults. Whether you’re planning a child’s birthday celebration, a teen party, or a lively gathering for friends and family, our unique event space, fun activities, and delicious food options make PopStroke the go-to destination for birthday parties of all ages. Celebrate in style with a birthday experience everyone will love. Holiday Parties Let’s celebrate the season in style at PopStroke. From company holiday parties to festive gatherings with friends and family, our venues are the perfect setting for your seasonal celebration. Whether you’re planning for New Year’s, Friendsgiving, or any holiday in between, PopStroke delivers delicious food, private event spaces, seasonal drinks, and a lively atmosphere that make every party unforgettable. Grad Parties Whether you're tossing your cap for high school or college, our venues are the place to be for an epic graduation bash. With t wo challenging courses, all your favorite food, and a vibe that screams 'celebrate,' PopStroke is where memories are made. So why settle for ordinary when you can make it legendary? Let's toast to your next chapter. “Had the best experience hosting my son's birthday at PopStroke! The mini golf was great for all ages, playground was a hit with the kids, and everyone agreed they had the best burgers and ice cream. Perfect spot for family-friendly parties!” — Casey M. eat. putt. drink. Enhance your visit with a flavorful culinary experience at our full-service restaurant. Indulge in an array of fan-favorite dishes, all crafted in-house from scratch. Our menu caters to every palate, featuring shareable appetizers, burgers, wraps, fresh salads, tacos, and an ice cream parlor with custom milkshakes for a sweet finish. Embark on a mini-golf adventure at our oasis-like destination, featuring two meticulously designed 18-hole putting courses. Each course mirrors the challenge and excitement of a traditional golf setup, complete with synthetic fairways, tricky bunkers, and unpredictable rough patches—all played with just a putter in hand! Pop a seat at our lively sports bar scene, where you can catch the latest games while enjoying a diverse selection of craft beers, premium spirits, and expertly crafted cocktails. Order directly on our mobile app to get your drink delivered right to you on the course, ensuring you never miss a moment of the fun! Frequently Asked Questions What’s required for booking an event or party? Once we know the date and size of your event, a 50% deposit will be all you need to finalize your booking. How much does it cost? Event pricing varies based on location and package options. All packages include mini golf, food, and non-alcoholic beverages. Contact us and we will get you a quote as soon as possible. What makes our events unique? Whether you’re a seasoned mini-golf enthusiast or trying it for the first time, our exquisitely designed venues offer a unique event space suitable for groups of all sizes. Featuring 36 holes of elevated mini golf, lively bars, outdoor gaming areas, and private event spaces, PopStroke guarantees to make your party the talk-of-the-party. How many guests can I invite? Event bookings can range from a minimum of 12 guests to a full store buy out. If you have fewer than 12 guests, we welcome you to join us as a walk-in guest and will ensure you have a fantastic experience. Venue Location Port St. Lucie Fort Myers Sarasota Orlando @ Waterford Lakes Houston @ Katy Glendale Tampa @ Wesley Chapel Scottsdale Delray Beach Tuscaloosa Myrtle Beach Dallas @ The Colony Las Vegas College Station San Antonio Daytona Beach Palm Beach Winter Garden @ Hamlin Austin What are we celebrating? Adult Birthday Party Kids Birthday Party Corporate Event Summer Camp or Field Trip Social Event Other Event Date & Time Number of Guests Get Started Basics Your Phone Number Your Email Address Your full name Keep me updated on promotions, events, and more Submit 🎉 Get ready to party. What’ next? Send us your basic event info Our events team contacts you to finalize details Have a blast at your event Browse the menu The Experience Food & Drinks Events & Parties Delray Beach 1314 N Federal Hwy , Delray Beach , FL Sat Sun Mon Tue Wed Thu Fri 9am—12am (561) 800-4520 Get Directions Choose a Location Zip Code or City, State Change Location Plan a Visit Choose a Location Zip Code or City, State Delray Beach, FL Delray Beach, FL Change Sat Sun Mon Tue Wed Thu Fri 9am—12am 1314 N Federal Hwy , Delray Beach , FL (561) 800-4520 Sat Sun Mon Tue Wed Thu Fri 9am—12am Change The Experience Plan Event Tap-in to fun. Sign up for offers & new openings. We may even send you some birthday goodies! Email Address Sign Up Locations Alabama Arizona Florida Nevada South Carolina Tennessee Texas Winter Garden @ Hamlin Tampa @ Wesley Chapel Sarasota Port St. Lucie Palm Beach Orlando @ Waterford Lakes Fort Myers Delray Beach Daytona Beach Tap-in Plan a Visit Food & Drinks Events & Parties Gift Cards Company About Our Partners Careers Press Room Privacy Policy PopStroke Greens Eat. Putt. Drink. © PopStroke 2025"
    }
  ]
}