{
  "fuentes": [
    {
      "url": "https://www.ppines.com/1480/Pembroke-Pines-Art-Cultural-Center",
      "email": "aalli@ppines.com"
    },
    {
      "url": "https://www.ppines.com/Directory/Home/DepartmentListing?DID=9",
      "email": "recreation@ppines.com"
    },
    {
      "url": "https://www.artscalendar.com/venue/city-of-pembroke-pines-art-and-cultural-center/",
      "email": "lworley@ppines.com"
    },
    {
      "url": "https://www.ppines.com/344/Office-of-Communications",
      "email": "mwohlert@ppines.com"
    },
    {
      "url": "https://www.ppines.com/278/Recreation-Cultural-Arts",
      "email": "recreation@ppines.com"
    },
    {
      "url": "https://www.ppines.com/CivicSend/ViewMessage/message/64875",
      "email": "bspector@ppines.com"
    },
    {
      "url": "https://www.ppines.com/CivicSend/ViewMessage/message/64875",
      "email": "mwsmiles3@aol.com"
    },
    {
      "url": "https://www.ppines.com/1379/Current-Exhibitions",
      "email": "amohamed@ppines.com"
    },
    {
      "url": "https://www.ppines.com/facilities/facility/details/Pembroke-Pines-Art-Cultural-Center-54",
      "email": "lworley@ppines.com"
    },
    {
      "url": "https://www.ppines.com/162/City-Managers-Office",
      "email": "cdodge@ppines.com"
    },
    {
      "url": "https://www.artscalendar.com/event/26th-annual-art-music-festival-in-the-pines/",
      "email": "hbonkowski@ppines.com"
    }
  ],
  "mails": [
    "aalli@ppines.com",
    "amohamed@ppines.com",
    "bspector@ppines.com",
    "cdodge@ppines.com",
    "hbonkowski@ppines.com",
    "lworley@ppines.com",
    "mwohlert@ppines.com",
    "mwsmiles3@aol.com",
    "recreation@ppines.com"
  ],
  "nombre_sitio": "ppines.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ppines.com/1480/Pembroke-Pines-Art-Cultural-Center",
      "text": "Pembroke Pines Art & Cultural Center | Pembroke Pines, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government City Departments Business Opportunities Resident Resources How Do I…? Search Home City Departments Recreation & Cultural Arts Arts & Culture Pembroke Pines Art & Cultural Center Pembroke Pines Art & Cultural Center The Pembroke Pines Art and Cultural Center is located at 901 NW 129 th Avenue. We offer music, art and drama classes. Open enrollment & Facility Tours going on now. UPCOMING CLASSES/WORKSHOPS National Arts in Education Week The City of Pembroke Pines celebrates National Arts in Education Week, September 14 - 20, 2025! Friday 9/15 Art Garden  – Create paper flowers at Pembroke Pines Art and Cultural Center, 4-6pm . Join us in this FREE drop-in art activity and learn how to make paper flowers! Participants will be able to take their paper flowers home and contribute one flower to our \"Art Garden\" display. All supplies will be provided. No registration required , just show up! See full Flyer here! about undefined about undefined about undefined about undefined Piano and Art Lessons The City of Pembroke Pines offers affordable afterschool Art & Piano Classes for children ages 5-17 throughout the week! To get started, we will need your driver's license and your child's birth certificate. Contact Cultural Arts Coordinator, Aleyah Alli, for further assistance at aalli@ppines.com or call              954-743-1799! For access to our catalog, visit https://secure.rec1.com/FL/pembroke-pines-fl/catalog Registration for September Classes begin JULY 1! ** Thursday Teen Art Classes begin in September.** Note: The increase in class prices is in effect for October classes, onward. ¿Necesitas nuestra información en español? ¡Haga clic aquí! about undefined  about undefined  about undefined about undefined about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined Para acceder a nuestro catálogo, haga clic aquí: https://secure.rec1.com/FL/pembroke-pines-fl/catalog La inscripcion para las clases de Septiembre comienza el 1 de JULIO! **Las clases de los jueves para adolescentes comienzan en Septiembre.** Nota: El aumento en los precios de las clases esta vigente para las classes de Octubre en adelante. Musical Theatre Ensemble For dates, fees, and availability, please click here Version OptionsPembroke Pines Art & Cultural CenterHeadlineUPCOMING CLASSES/WORKSHOPS ! tt Version OptionsPembroke Pines Art & Cultural CenterHeadline Version OptionsPembroke Pines Art & Cultural CenterHeadlin Contact Us Aleyah Alli Cultural Arts Coordinator 954-743-1799 Email Aleyah Hours of Operation Monday: 1 pm to 6 pm Tuesday:  1 pm to 9 pm Wednesday: 1 pm to 9 pm Thursday:  1 pm to 6 pm Friday: 1 pm to 6 pm Saturday: 10 am to 3 pm Sunday: Closed Pembroke Pines Art & Cultural Center Studio 18 Art Complex About Us Resident Artists 8th Annual Student Art Competition Artist Highlights Workshops Classes Directions Current Exhibitions Resident Artist Application River of Grass ArtsPark Pembroke Pines Theater of Performing Arts (PPTOPA) Frank C. Ortis Art Gallery Cultural Booklet Public Art 9-11 Memorial Veterans Portrait Project National Arts in Education Week Agendas & Minutes City Commission, Code Compliance & Other Boards Watch Commission Meeting When Live Streaming Pines Web Services Building Permits/Inspections, Passports, Lien Searches, Utilities, Fire Inspections Careers Available Career Descriptions/Application Utilities Customer Service, Billing/Payment, Water Quality Reports City Alerts Emergency Situations or Critical Community Alerts Contact Us 601 City Center Way Pembroke Pines, FL 33025 Phone: 954-450-1060 Quick Links Pines Media Shop Local Demographics Location Chamber of Commerce /QuickLinks.aspx Site Links Home Contact Us Webmail Site Map Ethics Hotline /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.ppines.com/Directory/Home/DepartmentListing?DID=9",
      "text": "Pembroke Pines, FL Skip to Main Content ; Search: Go My Apps Activities Alert Center Archive Center Bid Postings Blog Calendar CivicMedia™ Document Center Facilities Form Center Frequently Asked Questions Job Opportunities News Flash Notify Me Photo Gallery RequestTracker Resource Directory Staff Directory View Full Website Sign In Recreation and Cultural Arts Recreation and Cultural Arts Physical Address: 601 City Center Way 3rd Floor Pembroke Pines, FL 33025 Phone: 954-392-2130 Email Recreation and Cultural Arts Christina Goulding Assistant City Manager/Director of Recreation and Cultural Arts Carol Toscano Campisi Assistant Director of Recreation Holly Bonkowski Assistant Director of Cultural Arts Jonathan Nasser Division Director of Recreation Meagan Cook Division Director of Park Operations Greg Groselle Aquatic Coordinator Thomas Joyce Recreation Supervisor Danelle Merk Assistant Aquatics Coordinator Amelia Mohamed Facility Manager Studio 18 Francie Novo Special Events Coordinator Renee Nunez Soccer Coordinator Lana Tropeano Assistant Special Events Coordinator"
    },
    {
      "url": "https://www.artscalendar.com/venue/city-of-pembroke-pines-art-and-cultural-center/",
      "text": "City Of Pembroke Pines Art and Cultural Center - ArtsCalendar.com English Arabic Chinese (Simplified) Chinese (Traditional) English French German Russian Spanish Vietnamese SUBMIT EVENT LOGIN LOGOUT MENU Home Events Explore The Causeway Grantees 2022/23 Innovation Grantees 2024 Innovation Grantees 2024 Regional Grantees Public Art Plans Dania Beach Public Art Plan Stories News (BAJA) Blogs OPPS Calls & Jobs in the Arts Find ARTISTS ORGANIZATIONS VENUES Home Events Explore The Causeway Grantees 2022/23 Innovation Grantees 2024 Innovation Grantees 2024 Regional Grantees Public Art Plans Dania Beach Public Art Plan Stories News (BAJA) Blogs OPPS Calls & Jobs in the Arts Find ARTISTS ORGANIZATIONS VENUES Venue Type Arena/Stadium Bar/Tavern Bookstore Business/Company Community Center Concert Hall Cultural District Dance Fairgrounds Film & Video Gallery Historic Building/Landmark Hotel/Inn Kids & Families Library Museum Music Nature Nightclub Online/Virtual Park/Garden Performing Arts Center Poetry & Literature Restaurant/Cafe School Shopping District Special Events Studio Theater Visual Art Winery State / Province FL City/Town Broadview Park Coconut Creek Cooper City Coral Springs Dania Dania Beach Davie Deerfield Beach Fort Lauderdale Hallandale Hallandale Beach Hillsboro Beach Hillsboro Pines Hollywood Lauderdale Lakes Lauderdale-by-the-Sea Lauderhill Lazy Lake Lighthouse Point Margate Miramar North Lauderdale Oakland Park Pembroke Pines Plantation Pompano Beach Southwest Ranches Sunrise Tamarac West Park Weston Wilton Manors Zip/Postal Code 33004 33008 33009 33019 33020 33021 33022 33023 33024 33025 33026 33027 33028 33029 33060 33061 33062 33063 33064 33065 33066 33067 33068 33069 33071 33072 33073 33074 33075 33076 33077 33081 33082 33083 33084 33093 33097 33301 33302 33303 33304 33305 33306 33307 33308 33309 33310 33311 33312 33313 33314 33315 33316 33317 33318 33319 33320 33321 33322 33323 33324 33325 33326 33327 33328 33329 33330 33331 33332 33334 33335 33336 33337 33338 33339 33340 33345 33346 33348 33349 33351 33355 33359 33388 33394 33441 33442 33443 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue City Of Pembroke Pines Art and Cultural Center Facebook Twitter Linkedin Print City Of Pembroke Pines Art and Cultural Center The New Pembroke Pines Art and Cultural Center , located at 901 NW 129 th Avenue, will be opening this fall. The new center will offer music, art and drama classes.  Open enrollment & Facility Tours begin Saturday, September 4th.  For more information, please contact Lisa Worley, Recreation Specialist at 954-986-5027.  Classes to start in October 2021. The New Pembroke Pines Art and Cultural Center , located at 901 NW 129 th Avenue, will be opening this fall. The new center will offer music, art and drama classes.  Open enrollment & Facility Tours begin Saturday, September 4th.  For more information, please contact Lisa Worley, Recreation Specialist at 954-986-5027.  Classes to start in October 2021. View less MORE ABOUT THIS VENUE Venue Type: Community Center ; Cultural District ; Kids & Families ; Music ; Special Events ; Visual Art LOCATION City Of Pembroke Pines Art and Cultural Center 901 NW 129th Ave, Pembroke Pines, FL View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette Accessibility Information Wheelchair Access PARKING INFO Free Parking. PUBLIC HOURS Business/Operations Mon-Fri: 10 AM to 6 PM Please visit https://www.ppines.com/1480/Pembroke-Pines-Art-Cultural-Center for class schedule information. PAST EVENTS Savor the Sounds Concert Series Presented by The City of Pembroke Pines: Art and Cultural Department at City Of Pembroke Pines Art and Cultural Center Nov 24, 2024 Accessibility Info Facebook Twitter Linkedin BUY TICKETS Contact information Email / Website / Facebook / Instagram / 901 NW 129th Ave, Pembroke Pines, FL 954-986-5027 Find A Local Venue Search by Keyword Venue Type Arena/Stadium Bar/Tavern Bookstore Business/Company Community Center Concert Hall Cultural District Dance Fairgrounds Film & Video Gallery Historic Building/Landmark Hotel/Inn Kids & Families Library Museum Music Nature Nightclub Online/Virtual Park/Garden Performing Arts Center Poetry & Literature Restaurant/Cafe School Shopping District Special Events Studio Theater Visual Art Winery State / Province FL City/Town Broadview Park Coconut Creek Cooper City Coral Springs Dania Dania Beach Davie Deerfield Beach Fort Lauderdale Hallandale Hallandale Beach Hillsboro Beach Hillsboro Pines Hollywood Lauderdale Lakes Lauderdale-by-the-Sea Lauderhill Lazy Lake Lighthouse Point Margate Miramar North Lauderdale Oakland Park Pembroke Pines Plantation Pompano Beach Southwest Ranches Sunrise Tamarac West Park Weston Wilton Manors Zip/Postal Code 33004 33008 33009 33019 33020 33021 33022 33023 33024 33025 33026 33027 33028 33029 33060 33061 33062 33063 33064 33065 33066 33067 33068 33069 33071 33072 33073 33074 33075 33076 33077 33081 33082 33083 33084 33093 33097 33301 33302 33303 33304 33305 33306 33307 33308 33309 33310 33311 33312 33313 33314 33315 33316 33317 33318 33319 33320 33321 33322 33323 33324 33325 33326 33327 33328 33329 33330 33331 33332 33334 33335 33336 33337 33338 33339 33340 33345 33346 33348 33349 33351 33355 33359 33388 33394 33441 33442 33443 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access Subscribe to our mailing list art in your inbox Signup Today. No Spam. Just Arts. subscribe PROUDLY BROUGHT TO YOU BY f FOLLOW US EVENTS: Classes | Comedy | Culinary | Culture | Dance | Fashion | Festivals | Free | Kids | Music | Theatre | Visual Arts DIRECTORIES Artists Organization Venues CALLS FOR ARTISTS SUBMIT Copyright 2025 Broward Cultural Division | Contact Us I Privacy Policy/Terms of Service { Powered by ARTSOPOLIS }"
    },
    {
      "url": "https://www.ppines.com/344/Office-of-Communications",
      "text": "Office of Communications | Pembroke Pines, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government City Departments Business Opportunities Resident Resources How Do I…? Search Home City Departments Office of Communications Office of Communications Everyone - residents and businesses alike - plays a valuable role in making Pembroke Pines a special place to live, work and play. Through our digital city newspaper and newsletter, digital signage, city television programming and social media on Facebook, Instagram, Twitter (X), LinkedIn and Next Door ( Social Media Policy Terms of Use about undefined  about undefined ), it's easy to keep in touch with what is happening throughout the City. Please note: Under Florida law, all content on the city's Social Media pages are subject to the public records law, Chapter 119, Florida Statutes . By becoming a fan of these pages, posting comments or messaging these pages, your information will be a matter of public record. The City of Pembroke Pines Public Communications Plan about undefined about undefined  about undefined  about undefined about undefined Discover all that we have to offer in Pembroke Pines - the big city with the hometown feel. Be sure to know what is happening in Pembroke Pines by reading City Connect, a digital newspaper published by the City of Pembroke Pines 6x a year for all residents and businesses. It's located on the City's website in both English and Spanish. City Connect shines a spotlight on activities, events and local issues in your own backyard. We're here for you, Pembroke Pines! City Connect Newsflash digital newsletter by the City of Pembroke Pines lets you know what's happening throughout the city in an easy digital format received via email. In our continuing effort to find new ways to communicate with residents, we believe these emails will be informative and useful. Please help us make it the best that it can be by sharing it with your family, friends, and neighbors. We hope you enjoy all upcoming emails which will feature important alerts, special event info, and so much more quickly and effectively. Please subscribe HERE To read past issues of Newsflash, please click below to the date desired. 2025 September 3, 2025 August 13, 2025 July 3, 2025 July 23, 2025 June 12, 2025 May 16, 2025 April 17, 2025 March 13, 2025 February 26, 2025 January 31, 2025 UPDATE January 30, 2025 2024 December 10, 2024 November 19, 2024 November 14, 2024 November 7, 2024 October 16, 2024 September 12, 2024 August 15, 2024 July 11, 2024 June 5, 2024 June 26, 2024 May 15, 2024 May 1, 2024 April 17, 2024 April 3, 2024 March 20, 2024 March 6, 2024 February 7, 2024 February 21, 2024 January 17, 2024 January 3, 2024 2023 HAPPY NEW YEAR There is more... In 2024 December 20, 2023 December 6,  2023 November 22, 2023 November 15, 2023 November 1, 2023 October 4, 2023 October 18, 2023 September 6, 2023 September 20, 2023 about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined August 16, 2023 about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined August 2, 2023 about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined July 19, 2023 about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined July 5, 2023 about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined June 21, 2023 about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined 1st Newsletter Make Pines Media - TV a habit! Tune into original programming that features stories relating to City departments, events and services. Residents with Comcast can view programming on Channel 78. Spotlight Current and past Commission Meeting Spotlight summaries. Read more... Contact Us Marianne Wohlert Div. Director/Office of Communications News Editor - City Connect/Newsflash 954-392-2076 Email (mwohlert@ppines.com) City Hall 601 City Center Way Pembroke Pines, FL 33025 Phone: (954) 450-1060 Business Hours: Monday through Thursday 7:00 a.m. to 6:00 p.m. (closed on Fridays) Pembroke Pines City Hall is located in the Charles F. Dodge City Center. Quick Links Pembroke Pines Media on YouTube OCTV Archives On YouTube View All Links /QuickLinks.aspx City Connect Pines Media TV Press Releases CodeRED Pines Pal Agendas & Minutes City Commission, Code Compliance & Other Boards Watch Commission Meeting When Live Streaming Pines Web Services Building Permits/Inspections, Passports, Lien Searches, Utilities, Fire Inspections Careers Available Career Descriptions/Application Utilities Customer Service, Billing/Payment, Water Quality Reports City Alerts Emergency Situations or Critical Community Alerts Contact Us 601 City Center Way Pembroke Pines, FL 33025 Phone: 954-450-1060 Quick Links Pines Media Shop Local Demographics Location Chamber of Commerce /QuickLinks.aspx Site Links Home Contact Us Webmail Site Map Ethics Hotline /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.ppines.com/278/Recreation-Cultural-Arts",
      "text": "Recreation & Cultural Arts | Pembroke Pines, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government City Departments Business Opportunities Resident Resources How Do I…? Search Home City Departments Recreation & Cultural Arts Recreation & Cultural Arts Purpose The City of Pembroke Pines Recreation and Cultural Arts Department is committed to enhancing the quality of life for our residents by offering a diverse and inclusive range of leisure and recreational programs. Our purpose is to provide enriching activities, engaging events, and well-maintained facilities that support community connection, personal well-being, and lifelong enjoyment. Know Before You Go: Park Updates & Closures Playground at Ashley Hale Park (NW 106 Terr & NW118 Place)  is closed until further notice due to protected owls in the area. We apologize for the inconvenienc e and thank you for your continued support. Dogs are not permitted in City parks except for the Craig Rupp K-9 Park and Steven L. Josias Dog Park. Recreation & Cultural ArtsHeadline about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined sion OptionsRecreation & Cultural ArtsHeadline about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined Version OptionsRecreation & Cultural ArtsHeadline about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined Version OptionsRecreation & Cultural ArtsHeadline about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined Student Volunteers about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined Version OptionsRecreation & Cultural ArtsHeadline about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined about undefined Version OptionsRecreation & Cultural ArtsHeadline about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefined about undefined  about undefined  about undefined  about undefined  about undefined  about undefined  about undefi about undefine about undefined  about unde Upcoming Events Thu, Sep 11 9/11 Ceremony 9/11 Ceremony Read On Sat, Sep 13 Studio Saturday: Fun with Fluid Art Studio Saturday: Fun with Fluid Art Read On Sat, Sep 20 Touch a Truck Touch a Truck Read On Fri, Sep 26 Wrapped* Wrapped* Read On View All Events /Calendar.aspx Contact Us Christina Goulding Assistant City Manager/Director 601 City Center Way, 3rd Floor Pembroke Pines, FL 33025 Ph: 954-392-2130 Email Hours:  Monday - Thursday 7 a.m. - 6 p.m. Staff Directory Quick Links Civic Rec Pembroke Lakes Golf & Racquet Club Pembroke Pines Theatre of Performing Arts Club Nineteen Restaurant & Banquet Hall Veterans Memorial View All Links /QuickLinks.aspx FAQs How do I reserve a pavilion? How do I register for a program, class or camp? How do I rent a field? View All FAQs /FAQ.aspx Arts & Culture Pembroke Pines Art & Cultural Center Studio 18 Art Complex About Us Resident Artists 8th Annual Student Art Competition Artist Highlights Workshops Classes Directions Current Exhibitions Resident Artist Application River of Grass ArtsPark Pembroke Pines Theater of Performing Arts (PPTOPA) Frank C. Ortis Art Gallery Cultural Booklet Public Art 9-11 Memorial Veterans Portrait Project National Arts in Education Week Athletics/Youth Sports Pools/Swim Lessons South Florida Aquatic Club Golf Pro Shop Rates Memberships Driving Range Scorecard Golf Instruction Hole Layouts Policies Book Online Calendar Directions Youth Sport Leagues Baseball Cheerleading Football Soccer Softball Soccer Tennis Pickleball Camp Information Parks & Facilities Parks Master Plan Rentals Banquet & Party Halls Field Rentals Park Pavilions Storage Lots Special Events Annual Events Taste of Pines Pines Day Independence Day Celebration Boo-Ville SnowFest Juneteenth Celebration Caribbean American Heritage Festival Hispanic Heritage Festival Pembroke Pines Festival of the Arts Special Needs Population Youth Advisory Board Volunteering Veterans Memorial Agendas & Minutes City Commission, Code Compliance & Other Boards Watch Commission Meeting When Live Streaming Pines Web Services Building Permits/Inspections, Passports, Lien Searches, Utilities, Fire Inspections Careers Available Career Descriptions/Application Utilities Customer Service, Billing/Payment, Water Quality Reports City Alerts Emergency Situations or Critical Community Alerts Contact Us 601 City Center Way Pembroke Pines, FL 33025 Phone: 954-450-1060 Quick Links Pines Media Shop Local Demographics Location Chamber of Commerce /QuickLinks.aspx Site Links Home Contact Us Webmail Site Map Ethics Hotline /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.ppines.com/CivicSend/ViewMessage/message/64875",
      "text": "Studio 18 Classes For Immediate Release Media Contact: Brian Spector 954-392-2082 bspector@ppines.com Pembroke Pines, FL (August 1, 2018) – Studio 18 in the Pines features a wide array of art classes and events. Put your creativity to the test and meet more people by attending the classes listed below. For additional information about Studio 18 in the Pines, please call 954.961.6067, visit www.ppines.com/studio18 or contact Amelia Mohamed at amohamed@ppines.com. Coffee & Create Unlimited Coffee…that’s right!  Come enjoy endless amounts of coffee, create a work of art and make new friends at the Coffee & Create class on Wednesday, October 10 th from 10 a.m. – 12 p.m. at Studio 18 in the Pines located at 1101 Poinciana Drive in Pembroke Pines.  Cost is $10 per student and materials are included. Registration begins on September 1 st and concludes on October 8 th .  Participants must be at least 18 years of age to take part and space is limited.  For more information, please call Amelia Mohamed at (954) 961-6067 Mosaic Tile with Alicia Let your passion run wild and produce mosaic art with Alicia.  As a student in this class you will cut glass and ceramics to create mosaic art. This art class is designed for both beginners and intermediate students.  Classes are limited to 10 students to allow maximum instructor/ student interaction in a comfortable and relaxed atmosphere.  Classes are offered on Tuesdays from 10:00 a.m. - 12:30 p.m. at Studio 18 in the Pines located at 1101 Poinciana Drive in Pembroke Pines.  The fee is $100 for Pembroke Pines residents, which includes 4 classes, with a $20 material fee.  Non-Residents of Pembroke Pines pay a fee of $125.  For additional information, please contact Alicia Rodriguez at (786) 543-2439 or aliciainmiami@hotmail.com. Life Drawing The Life Drawing class is held on the last Thursday of every month from 7 p.m.– 9 p.m. at Studio 18 in the Pines, located at 1101 Poinciana Drive in Pembroke Pines.  This is your opportunity to create your own art inspired by a live model.  A drawing board and easel is provided to you.  Don’t miss out on the Life Drawing Class.  No previous art experience is required.  The cost is $15 per person.  For further information, please call (954) 961-6067. Mixed Media & Visual Art Use your imagination and learn contemporary art on Tuesdays from 3:30 p.m. – 5:00 p.m. and Saturdays from 12:30 p.m. – 2:30 p.m.  These classes will begin with an introduction to the history of contemporary art.  Each student will design a piece of artwork incorporating the concepts and techniques discussed in class.  Classes are limited to 12 students.  Pembroke Pines residents pay a $100 class fee with an additional $20 material fee.  $125 for non-residents of Pembroke Pines with the same $20 material fee.  To schedule classes and for further information, please contact Marielle Plaisir at (786) 719-3175 or marielle.plaisir.art@gmail.com. Introduction to Oil Painting Learn to Oil Paint on Tuesdays or Saturdays at Studio 18 in the Pines from 10 a.m. –12:30 p.m.  The Mona Lisa is the most popular, visited and famous work of art in the entire world.  The Mona Lisa is an oil painting…perhaps you can produce the next!  No previous art experience is necessary.  The cost is $100 per person plus a $10 material fee for Pembroke Pines residents and $125 with the same $10 material fee for non-residents.  For additional information or to register, please contact Maria Wieder at mwsmiles3@aol.com or call (954) 649-4053. Share on Facebook Share on Twitter Share via Email Copyright © 2016 City of Pembroke Pines. All Rights Reserved. City Hall 601 City Center Way, Pembroke Pines, FL 33025 Powered by"
    },
    {
      "url": "https://www.ppines.com/1379/Current-Exhibitions",
      "text": "Current Exhibitions | Pembroke Pines, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government City Departments Business Opportunities Resident Resources How Do I…? Search Home City Departments Recreation & Cultural Arts Arts & Culture Studio 18 Art Complex Current Exhibitions Current Exhibitions Step into a world of vivid color and textured emotion as the Palette Knife Artists of Miami bring Florida’s wild beauty to life—one bold stroke at a time. Born of Earth and Sky features powerful paintings of mangroves, coral reefs (both thriving and bleached), birds, turtles, and butterflies—capturing the delicate balance of ecosystems we depend on. Through the expressive technique of palette knife painting, this exhibition blends art and advocacy, inviting viewers to connect with nature and reflect on what’s at risk in a rapidly changing climate. Don’t miss this immersive celebration of creativity, community, and environmental care. On view from August 15 through October 30. Contact Us Studio 18 Art Complex 1101 Poinciana Drive Pembroke Pines, FL 33025 Facility Manager Amelia Mohamed Office: 954-961-6067 Hours of Operation Monday-Friday: 8:30AM - 5:00PM Saturday: 10:00AM - 2:00PM Sunday:   Closed About Us Resident Artists 8th Annual Student Art Competition Artist Highlights Workshops Classes Directions Current Exhibitions Resident Artist Application Agendas & Minutes City Commission, Code Compliance & Other Boards Watch Commission Meeting When Live Streaming Pines Web Services Building Permits/Inspections, Passports, Lien Searches, Utilities, Fire Inspections Careers Available Career Descriptions/Application Utilities Customer Service, Billing/Payment, Water Quality Reports City Alerts Emergency Situations or Critical Community Alerts Contact Us 601 City Center Way Pembroke Pines, FL 33025 Phone: 954-450-1060 Quick Links Pines Media Shop Local Demographics Location Chamber of Commerce /QuickLinks.aspx Site Links Home Contact Us Webmail Site Map Ethics Hotline /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.ppines.com/facilities/facility/details/Pembroke-Pines-Art-Cultural-Center-54",
      "text": "Facilities • Pembroke Pines Art & Cultural Center Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government City Departments Business Opportunities Resident Resources How Do I…? Search Home Facilities Get Directions Google Bing Pembroke Pines Art & Cultural Center 901 NW 129th Avenue Pembroke Pines, FL 33027 Contact Susana Villegas 954-986-5027 Rating This facility has not yet been rated. Facilities Feature Overview View all facilities Pembroke Pines Art & Cultural Center 1 PP City Logo JPG 2 Other Link Pembroke Pines Art & Cultural Center Features Art Classes Drama Classes Music Classes The Pembroke Pines Art and Cultural Center , located at 901 NW 129 th Avenue, offers music, art and drama classes, as well as Spring Break and Summer Camps.  Open Enrollment & Facility Tours going on now.  For more information, please contact Susana Villegas, Recreation Specialist at 954-986-5027. ▲ Back to top Agendas & Minutes City Commission, Code Compliance & Other Boards Watch Commission Meeting When Live Streaming Pines Web Services Building Permits/Inspections, Passports, Lien Searches, Utilities, Fire Inspections Careers Available Career Descriptions/Application Utilities Customer Service, Billing/Payment, Water Quality Reports City Alerts Emergency Situations or Critical Community Alerts Contact Us 601 City Center Way Pembroke Pines, FL 33025 Phone: 954-450-1060 Quick Links Pines Media Shop Local Demographics Location Chamber of Commerce /QuickLinks.aspx Site Links Home Contact Us Webmail Site Map Ethics Hotline /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.ppines.com/162/City-Managers-Office",
      "text": "City Manager's Office | Pembroke Pines, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government City Departments Business Opportunities Resident Resources How Do I…? Search Home City Government City Manager's Office City Manager's Office City Manager Charles F. Dodge A municipal employee of the City of Pembroke Pines for nearly 50 years, Charles F. Dodge was appointed City Manager in 1989, at a time when the community not only began to double in population, but there was also an increase in demand for roads, parks, public safety and schools. Today, under his management, the City has grown to be Florida’s tenth largest municipality, with over 170,000 residents, and home to the largest municipally-owned Charter School System in Broward County. Mr. Dodge was hired by the City of Pembroke Pines in 1975 as the City’s first Community Services Director. Under his direction, the first senior citizen center in Broward County was opened in Pembroke Pines. It was also his vision that advanced the development of the City’s 50,000-square-foot Senior Complex which also includes residential apartments for senior citizens. He has held several department director positions, including Director of Code Enforcement, City Clerk, and Assistant City Manager. In 1998, Mr. Dodge opened the City’s Charter Schools, a school system with four elementary, two middle, and one high school, with a total student population of more than 5,900. Background Originally from Worcester, Massachusetts, Mr. Dodge has been a resident of Broward County since 1972. He received a Bachelor of Arts degree from St. Vincent de Paul Seminary in Boynton Beach, FL. He is married with four children and three grandchildren. Mr. Dodge is the recipient of numerous awards, and a member of various professional and community organizations. Contact Us Charles F. Dodge City Manager Email Ph: 954-450-1040 Staff Directory About Pembroke Pines City Attorney's Office City Clerk's Office Legal Ads / Postings Business Impact Estimates Open Government Public Records Request City Boards and Committees Affordable Housing Advisory Committee Arts & Culture Board Auditor Selection Committee Board of Adjustment Charter Elementary / Middle School Advisory Charter High School Board Charter Review Board Citizens Budget Advisory Board Diversity and Heritage Advisory Board Economic Development Board Education Advisory Board Environmental Advisory Board FSU Charter Elementary School Advisory Board Planning & Zoning Board Police & Fire Pension Board Social Media Committee Youth Advisory Board Budget Committee (Commissioner Castillo) City Charter and Code of Ordinances City Charter and Code of Ordinances Land Development Code City Elections Upcoming Elections Election Packet Municipal Qualifying Sample Ballot Municipal Election Polling Stations District Map Candidate Campaign Finance Reporting Florida Election Laws Links to other websites with important information on elections: Commission Meetings Agendas & Minutes Meeting Calendar Watch Meeting - Live Stream Youtube Pembroke Pines Channel HOA Contact Update Form Forms, Requests & Other Applications Boards & Committees Application For Businesses Application for At Home Family Day Care Lien Search Local Business Tax Receipt Garage Sale Application Lobbyist Information Permit Search Public Records Request Abandoned/Vacant Property Registration City Commission Mayor Angelo Castillo Vice Mayor Michael Hernandez Commissioner Thomas Good, Jr. Commissioner Maria Rodriguez Commissioner Jay D. Schwartz Pembroke Pines Representatives City Manager's Office City Wide Commission Map Pines Web Services Utilities (Citizens Self Service - CSS) Development HUB Passport Services Lien Search Fire Rescue Lobbyists Login Agendas & Minutes City Commission, Code Compliance & Other Boards Watch Commission Meeting When Live Streaming Pines Web Services Building Permits/Inspections, Passports, Lien Searches, Utilities, Fire Inspections Careers Available Career Descriptions/Application Utilities Customer Service, Billing/Payment, Water Quality Reports City Alerts Emergency Situations or Critical Community Alerts Contact Us 601 City Center Way Pembroke Pines, FL 33025 Phone: 954-450-1060 Quick Links Pines Media Shop Local Demographics Location Chamber of Commerce /QuickLinks.aspx Site Links Home Contact Us Webmail Site Map Ethics Hotline /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.artscalendar.com/event/26th-annual-art-music-festival-in-the-pines/",
      "text": "26th Annual Art & Music Festival in the Pines, The City of Pembroke Pines: Art and Cultural Department  at Charles F. Dodge City Center, Pembroke Pines FL, Festivals & Outdoor Events English Arabic Chinese (Simplified) Chinese (Traditional) English French German Russian Spanish Vietnamese SUBMIT EVENT LOGIN LOGOUT MENU Home Events Explore The Causeway Grantees 2022/23 Innovation Grantees 2024 Innovation Grantees 2024 Regional Grantees Public Art Plans Dania Beach Public Art Plan Stories News (BAJA) Blogs OPPS Calls & Jobs in the Arts Find ARTISTS ORGANIZATIONS VENUES Home Events Explore The Causeway Grantees 2022/23 Innovation Grantees 2024 Innovation Grantees 2024 Regional Grantees Public Art Plans Dania Beach Public Art Plan Stories News (BAJA) Blogs OPPS Calls & Jobs in the Arts Find ARTISTS ORGANIZATIONS VENUES Find An Event Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Broward Funded Classes & Workshops -- Talks -- Webinars -- Workshops for Artists -- Workshops for Arts Marketing -- Workshops for Funding Comedy Conventions & Meetings Culinary, Dining & Nightlife Culture Dance En español Fashion -- Fashion Show Festivals & Outdoor Events Free Fundraisers & Galas Green & Environmental Health & Science -- Fitness History Holiday Kids & Families -- Kid Culture Lectures & Readings LGBTQ+ Movies & Film Museums & Galleries -- Exhibition -- Gallery Opening Music -- Classical -- Concerts -- Country -- Electronica -- Folk -- Hip-Hop -- Jazz / Blues -- Latin -- Pop / Rock Online/Streaming Poetry & Literature Sports & Recreation Summer Camp -- Spring Break Camp Theatre Visual Arts Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK SEARCH RESET Advanced Filters Home Festivals & Outdoor Events 26th Annual Art & Music Festival in the Pines Accessibility Info Facebook Twitter Linkedin Print Please Note: This event has expired. 26th Annual Art & Music Festival in the Pines Presented by The City of Pembroke Pines: Art and Cultural Department at Charles F. Dodge City Center , Pembroke Pines FL Nov 02 - 03 2024 The City of Pembroke Pines invites you to the 26th Annual Art & Music Fest in the Pines held at the Charles F. Dodge City Center, 601 City Center Way, on Saturday, November 2 from 11AM to 8 PM and Sunday, November 3, from 12PM to 5PM. The City of Pembroke Pines Recreation and Cultural Arts Department will be hosting the 26th Annual Art & Music Fest in the Pines on Saturday, November 2nd, from 11 AM to 8 PM and Sunday, November 3rd from 12 to 5 PM at the Charles F. Dodge City Center . This family-friendly event is FREE and will feature live music by Bryant Del Toro Band, Joey Calderaio Band and a throwback to the 70s and 80s with The Rock Show . Enjoy free workshops at The Frank Art Gallery, curated art vendors, interactive ... view more » The City of Pembroke Pines Recreation and Cultural Arts Department will be hosting the 26th Annual Art & Music Fest in the Pines on Saturday, November 2nd, from 11 AM to 8 PM and Sunday, November 3rd from 12 to 5 PM at the Charles F. Dodge City Center . This family-friendly event is FREE and will feature live music by Bryant Del Toro Band, Joey Calderaio Band and a throwback to the 70s and 80s with The Rock Show . Enjoy free workshops at The Frank Art Gallery, curated art vendors, interactive performances, food trucks, a student art competition, and a kid’s zone. For more information about the event, please call 954-392-2122. This event was made possible through the official sponsorship of Jacobs. Thank you to our sponsors! Jacobs | Official Sponsor Memorial Healthcare System | Main Stage Sponsor Waste Pro | Awards Breakfast Sponsor SRS | Student Art Competition Sponsor CGA | Kids Art/Game Zone Sponsor Florida Blue | Workshop Sponsor Sports and Activities Directory | Friends of the Arts Space Coast Credit Union | Friends of the Arts WLRN | Friends of the Arts FHIA Remodeling | Friends of the Arts Menchie’s Pembroke Cobblestone | Friends of the Arts View less ADMISSION INFO RSVP by clicking here Website: https://www.ppines.com/artmusicfest INDIVIDUAL DATES & TIMES* Additional time info: Free event. * Event durations (if noted) are approximate. Please check with the presenting organization or venue to confirm start times and duration. LOCATION Charles F. Dodge City Center 601 City Center Way, Pembroke Pines, Pembroke Pines, FL View in Google Maps Accessibility Information: Currently, no accessibility information is available for this event. Connect with this Organization: DONATE MORE FROM The City of Pembroke Pines: Art and Cultural Department Studio Saturday: Fun with Fluid Art Presented by The City of Pembroke Pines: Art and Cultural Department at  Studio 18 Art Complex Sep 13, 2025 Facebook Twitter Linkedin BUY TICKETS CONNECT WITH The City of Pembroke Pines: Art and Cultural Department Email / Website / Facebook / Twitter / Instagram / MEMBER REVIEWS There are currently no reviews/comments for this event. Be the first to add a review/comment , and let folks know what you think! LATEST NEWS This Afrofuturistic Expressive Arts Tribute is a Celebration of Breast Cancer Warriors By Tracy Block, BAJA Pathways to Light exhibit at Pompano Beach Cultural Center explores grief and healing By Megan Fitzgerald, BAJA Liv Cook’s Painted Faces Feature at Gasper Arts Center By Doug Markowitz, Baja From Code to Compassion: Samuel López De Victoria’s Quest to Build Worlds that Heal By Nile Fortner, BAJA Broward arts society takes pride in progress of LGBTQ movement By Steve Rothaus, BAJA View all latest news » Subscribe to our mailing list Search for: Search art in your inbox Signup Today. No Spam. Just Arts. subscribe PROUDLY BROUGHT TO YOU BY f FOLLOW US EVENTS: Classes | Comedy | Culinary | Culture | Dance | Fashion | Festivals | Free | Kids | Music | Theatre | Visual Arts DIRECTORIES Artists Organization Venues CALLS FOR ARTISTS SUBMIT Copyright 2025 Broward Cultural Division | Contact Us I Privacy Policy/Terms of Service { Powered by ARTSOPOLIS }"
    }
  ]
}