{
  "fuentes": [
    {
      "url": "https://talesofthecocktail.org/holiday-bar-back-iconic-nyc-bar-revived/",
      "email": "info@talesofthecocktail.org"
    },
    {
      "url": "https://www.privilegemia.com/",
      "email": "antone@privilegemia.com"
    },
    {
      "url": "https://www.privilegemia.com/",
      "email": "info@privilegemia.com"
    },
    {
      "url": "https://www.privilegemia.com/private-events",
      "email": "info@privilegemia.com"
    },
    {
      "url": "https://www.lawinsider.com/dictionary/privilege-team",
      "email": "sales@lawinsider.com"
    },
    {
      "url": "https://www.qatarexec.com.qa/en/about/Privilege_Club.html",
      "email": "request@qatarexec.com.qa"
    },
    {
      "url": "https://www.mylocalservices.com/Privilege+Cocktail+Lounge-Miami+Beach-Florida-23326135.html",
      "email": "info@mylocalservices.com"
    }
  ],
  "mails": [
    "antone@privilegemia.com",
    "info@mylocalservices.com",
    "info@privilegemia.com",
    "info@talesofthecocktail.org",
    "request@qatarexec.com.qa",
    "sales@lawinsider.com"
  ],
  "nombre_sitio": "privilegemia.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://talesofthecocktail.org/holiday-bar-back-iconic-nyc-bar-revived/",
      "text": "Resurrecting a New York City Drinking Landmark - Tales of the Cocktail Foundation Skip to content About Our Mission Board of Directors Team Committees Tales of the Cocktail Foundation Code of Conduct 2023 Annual Report Tales of the Cocktail® Spirited Awards® Spirited Awards® Directory Spirited Awards® Archive Tales Catalyst Tales of the Cocktail TOTC Merch powered by Mover & Shaker Initiatives Cocktail Courier Beyond the Bar® Cocktail Apprentice Program® Philanthropy & Development Scholarship Program Grant Recipients Policy Initiative Virtual Cocktail Tour Past Initiatives Singapore x Tales Tales on Tour Contact Contact Us Privacy Policy Work with Tales Get Involved Partnerships Seminar Proposals TOTC Scholarship Stories Recent Behind the Bar Culture Destinations History Industry News In-Depth People Products Recipes Techniques Tours Wellness To search this site, enter a search term Events Partnerships Tales of the Cocktail Foundation Tales of the Cocktail Foundation platform seeks to act as a catalyst to Educate, Advance, and Support the global drinks industry and communities we touch. Resurrecting a New York City Drinking Landmark Posted on: Nov. 26, 2015 | Destinations | By: Alicia Kennedy Facebook Tweet LinkedIn Pin Email Every neighborhood in New York City is dying, they say. High-rise condo buildings and a homogenized landscape of national chains and personality-free restaurants have replaced mom-and-pop shops, neighborhood meeting places, and local dives . In the East Village, though, one such dive has gotten a new chance to be its old self. Holiday Cocktail Lounge , located at 75 St. Marks Place, was once, the story goes, the go-to bar for people like Allen Ginsburg, Iggy Pop, The Rolling Stones, and even the revolutionary Leon Trotsky. Its almost 100-year history began in 1919 when it opened as a speakeasy , and ever since, its clientele was a creative mishmash, a reflection of the neighborhood where it’s located. The 1983 Madonna hit “Holiday” is said to have been inspired by the place. “It has been part of the East Village’s social fabric for generations and a nexus for those who embrace iconoclastic creativity, artistic passion and boundless intellectualism and served as an antidote to everyday life,” says owner Robert Ehrlich, creator of the snack Pirate’s Booty, who spent three years renovating the bar. Michael Neff, the bar manager formerly of Ward III and The Rum House, is especially keen on the historical relevance of Holiday. “With so much of authentic New York disappearing, it was truly a privilege to rescue a bar with almost a century of history,” he says, noting that during the renovation they found a Prohibition-era tunnel in the bar that takes you across the street. The Long Island Iced Tea at Holiday Cocktail Lounge is made with tea from the nearby Porto Rico Importing Co. and remains true to the bar’s original lack of pretension. In creating a cocktail program at a place with such a storied history as a dive, Neff decided to take his inspiration from what is available in the neighborhood. This leads to a bespoke style behind the bar; if there’s a big pile of turmeric being sold down the block, he will figure out a way to work with it. They’re making a Long Island Iced Tea, but it’s infused with tea purchased at Porto Rico Importing Co. in the neighborhood. As a veteran of the craft cocktail scene who has seen its evolution, he believes there is a movement now toward simplicity. “We don’t want to be mixologists anymore. We just want to be bartenders,” he says. That’s why he’s focused on creating a menu that’s easily executable and “100 percent based in having a good time.” They’re working at a high level, but doing work that’s a bit cheeky from the standpoint of where cocktails are right now. Revamping an iconic bar puts a premium on authenticity, and there is nothing authentic to the old East Village about paying $12 for a cocktail. Everything was super cheap at the old Holiday, and though now everything about running a bar is more expensive, the history has to be honored. “I want to be accessible,” Neff says, which is why you can get a $35 glass of top-shelf whiskey or a $4 beer and shot combo. “You don’t have to spend all your money when you come in,” Neff assures. Holiday could have gone full-on kitsch in their reopening, but they’ve made the decision to look toward history and their neighbors for inspiration. It’s a bar working within a context , without hitting you over the head with it. Capturing the bar’s philosophy, Neff says of its storied history, “That New York is gone. How do we do things that can be infused with it?” The drink menu at Holiday Cocktail Lounge is “100 percent based in having a good time.” Recent Posts The New Orleans Spirits Competition 2025 “Spirits of the Year” Winners Announced at Tales of the Cocktail Tales Of The Cocktail Foundation Announces 2025 Spirited Awards® Winners Watch Live: Tales of the Cocktail 19th Annual Spirited Awards® ShakeStir’s Cocktail Courier and Tales of the Cocktail Foundation Announce Strategic Partnership to Celebrate the Art of Cocktails Celebrating Pride Month with Ramsey Musk Archives Archives Select Month July 2025 June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 December 2020 September 2020 August 2020 May 2020 April 2020 March 2020 February 2020 January 2020 October 2019 September 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 February 2015 Related Posts A Look Back at the Singapore x Tales Residency Spirited Awards Presents The SG Club Spirited Awards Presents ATLAS Subscribe to Our E-Newsletter Stay up-to-date with everything the Tales of the Cocktail Foundation does year-round. Name (Required) First Last Email (Required) Agree to Privacy Policy (Required) I have read and agree to the Privacy Policy By clicking submit below, you consent to allow TOTCF to store and process the personal information submitted above to provide you the content requested. By subscribing to this list, you certify that you are of legal age to consume alcohol as defined by the laws in your country of residence. Instagram This field is for validation purposes and should be left unchanged. Δ Our Mission Contact Us Blog Privacy Policy Code of Conduct Tales of the Cocktail® Spirited Awards® Cocktail Apprentice Program® Contact Us info@talesofthecocktail.org facebook-square Link to Facebook instagram-square Link to Instagram twitter-square Link to Twitter Copyright © 2025 Tales of the Cocktail Foundation. Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent To search this site, enter a search term Tales of the Cocktail Foundation Tales of the Cocktail Foundation platform seeks to act as a catalyst to Educate, Advance, and Support the global drinks industry and communities we touch. About Our Mission Board of Directors Team Committees Tales of the Cocktail Foundation Code of Conduct 2023 Annual Report Tales of the Cocktail® Spirited Awards® Spirited Awards® Directory Spirited Awards® Archive Tales Catalyst Tales of the Cocktail TOTC Merch powered by Mover & Shaker Initiatives Cocktail Courier Beyond the Bar® Cocktail Apprentice Program® Philanthropy & Development Scholarship Program Grant Recipients Policy Initiative Virtual Cocktail Tour Past Initiatives Singapore x Tales Tales on Tour Contact Contact Us Privacy Policy Work with Tales Get Involved Partnerships Seminar Proposals TOTC Scholarship Stories Recent Behind the Bar Culture Destinations History Industry News In-Depth People Products Recipes Techniques Tours Wellness"
    },
    {
      "url": "https://www.privilegemia.com/",
      "text": "Privilege Cocktail Lounge | Premium Cocktails in Historic South Beach top of page HOME ABOUT US MENU GALLERY PRIVATE EVENTS CONTACT More... Use tab to navigate through the menu items. HOME ABOUT US MENU GALLERY PRIVATE EVENTS CONTACT More... Use tab to navigate through the menu items. ABOUT Enjoy the Experience Nestled in the heart of Miami's historic South Beach, Privilege Cocktail Lounge is an upscale cocktail bar located in the lobby of the iconic Albion Hotel. Combining a welcoming ambiance with a world-class selection of spirits, we're proud to offer a welcoming experience for Miami-based professionals, visitors to Magic City and socialites alike. Whether you're looking to network, enjoy crafted cocktails or spend quality time with friends, Privilege Cocktail Lounge is the premier destination in South Beach. View Our Menu Join the club GET UPDATES ON SPECIAL EVENTS, LIMITED EDITION COCKTAILS & PROMOTIONS Subscribe Now Thanks for submitting! FOLLOW US ON INSTAGRAM CONTACT VISIT US 1650 James Avenue Miami Beach, FL 33139 (Located in the Albion Hotel) Phone: (305) 913-1025 ​ Open 2pm to 1am Daily PRIVATE EVENTS For private event inquiries, please contact: info@privilegemia.com PRESS For any media request, please contact: antone@privilegemia.com bottom of page"
    },
    {
      "url": "https://www.privilegemia.com/private-events",
      "text": "PRIVATE EVENTS | Privilege Lounge top of page HOME ABOUT US MENU GALLERY PRIVATE EVENTS CONTACT More... Use tab to navigate through the menu items. HOST YOUR EVENT AT PRIVILEGE COCKTAIL LOUNGE Privilege Cocktail Lounge is the perfect location for your next event! With our prime location in the heart of South Beach, Miami, Privilege Cocktail Lounge is an accessible, upscale cocktail lounge nestled in the lobby of the iconic Albion Hotel. ​ Furnished with velvet and leather, Privilege Cocktail Lounge exudes an upscale and chic ambiance, making it an ideal venue for intimate celebrations, corporate events, mixers and more.  Our bar is equipped with a projector and 3 TVs, perfect for screening presentations, sports games, and other media. W e love curating bespoke event packages to fit our clients' needs. From bespoke cocktails to customizing the lighting at our bar to suit your theme, we're here to help make your event unforgettable. ​ Ready to plan your event? Please fill out the event form by clicking the link below or email info@privilegemia.com with details on how we can make your private event a success . You'll recieve a response within 48 hours. EVENT FORM bottom of page"
    },
    {
      "url": "https://www.lawinsider.com/dictionary/privilege-team",
      "text": "Privilege Team Definition | Law Insider Schedule a Demo Sign In Sign Up Standard Templates Public Contracts Resources About Pricing Home Dictionary Privilege Team Privilege Team definition Privilege Team means a team comprised of one or more DoD attorneys and one or more intelligence or law enforcement personnel who have not taken part in, and, in the future , will not take part in, any domestic or foreign court, military commission, or combatant status tribunal proceedings involving the detainee. If required , the Privilege Team may include interpreters/translators, provided that such personnel meet these same criteria. View Source Based on 5 documents 5 Draft with AI Split View AI-Powered Contracts Draft, Review & Redline at the Speed of AI Get Started Schedule a Demo Related to Privilege Team Project Steering Committee means the committee referred to in Section I.A.1 of Schedule 2 to this Agreement. Project Team means Owner, Contractor, A/E and consultants, any separate Contractors employed by Owner, and others employed for the purpose of programming, design, and construction of the Project. The members of the Project Team will be designated in writing by Owner and may be modified from time to time in writing by Owner. Joint Steering Committee or “JSC” has the meaning set forth in Section 3.1. Project Managers means the individuals identified in Section 12 of this Agreement who are authorized by TriMet and Subrecipient respectively to send and receive communications regarding this Agreement. IEP team means a group of individuals described in Wis. Stat. § 115.78 that is responsible for evaluating the child to determine the child’s eligibility or continued eligibility for special education and related services and the educational needs of the child; developing, reviewing, or revising an IEP for the child; and determining the special education placement for the child. Related Definitions Project Steering Committee Project Team Joint Steering Committee Project Managers IEP team Tools to Draft Better Contracts About Us Plans & Pricing Email Sales Support Contract Standards Standards Hub oneNDA Template oneSaaS Template oneDPA Template Law Insider Community Join Community Public Contracts Search Contracts Clauses Dictionary Languages All contents of the lawinsider.com excluding publicly sourced documents are Copyright © 2013- 2025 Law Insider Inc. All rights reserved. Terms of Service • Privacy Policy Help Ukraine 🇺🇦"
    },
    {
      "url": "https://www.qatarexec.com.qa/en/about/Privilege_Club.html",
      "text": "Privilege Club Start your booking Fleet Gulfstream G700 Gulfstream G650ER Bombardier Global 5000 Airbus A319 CJ About Services The Executive Experience Privilege Club Environmental Awareness Safety & Security Media Library News Contact Search /content/qatarexec/global/en/search-results.html booking-widget-input Search Language EN English عربي 中文 Español Pусский Start your booking Search /content/qatarexec/global/en/search-results.html booking-widget-input Search Language EN English عربي 中文 Español Pусский Start your booking I'm flying roundtrip Roundtrip One-way Multiple destinations on the ,starting from ... to ... departing ... departing-link and returning returningDots ... booking-widget-input Search-booking-input Please select a different destination. Departure not found. Destination not found. Please check that the city or airport name was entered correctly, then select it from the list. - Departure city Departure city Departure not found. Please check that the city or airport name was entered correctly, then select it from the list. to Arrival city Arrival city Destination not found. Please check that the city or airport name was entered correctly, then select it from the list. on flight date - Departure city Departure city Departure not found. Please check that the city or airport name was entered correctly, then select it from the list. to Arrival city Arrival city Destination not found. Please check that the city or airport name was entered correctly, then select it from the list. on flight date - Departure city Departure city Departure not found. Please check that the city or airport name was entered correctly, then select it from the list. to Arrival city Arrival city Destination not found. Please check that the city or airport name was entered correctly, then select it from the list. on flight date - Departure city Departure city Departure not found. Please check that the city or airport name was entered correctly, then select it from the list. to Arrival city Arrival city Destination not found. Please check that the city or airport name was entered correctly, then select it from the list. on flight date - Departure city Departure city Departure not found. Please check that the city or airport name was entered correctly, then select it from the list. to Arrival city Arrival city Destination not found. Please check that the city or airport name was entered correctly, then select it from the list. on flight date - Departure city Departure city Departure not found. Please check that the city or airport name was entered correctly, then select it from the list. to Arrival city Arrival city Destination not found. Please check that the city or airport name was entered correctly, then select it from the list. on flight date + Add a flight Confirm Clear date selection Confirm true Please provide your contact information and we will be in touch within 24 hours. *Required information Name* Email* Phone country-code phone *I consent to having this website store my submitted information so they can respond to my enquiry. See our privacy policy to learn more about how we use data. *I consent to my personal data being processed for the purpose of receiving direct marketing communications and I acknowledge Qatar Executive’s privacy notice . Submit We have received your request and will be in touch within 24 hours.  If your enquiry is urgent please call (+974) 4022 1700 Something went wrong. Please try after sometime. We have received your request and will be in touch within 24 hours. fleet-return-page About Qatar Executive & Qatar Airways Privilege Club You can now collect & spend Avios with Qatar Executive. Book direct and unlock rewards as you fly in ultimate luxury, with every journey tailored to you. - Collect 4 Avios for every USD 1 spent. - Spend Avios on bookings. - Pool your Avios with friends and family. You can find further details about how to collect and spend Avios with us by checking the FAQs below. If you'd like to make a booking, please call +974 4022 1700 or select 'start your booking' to begin planning your trip. Avios Frequently Asked Questions How do I become a member of Privilege Club? You can enroll in Privilege Club online by visiting qatarairways.com. Please click here to become a member. What are the benefits of joining Privilege Club? As a member of Privilege Club, you get access to exclusive rewards and benefits that can elevate your experience with Qatar Airways. Collect Qpoints to elevate your tier; the higher your tier, the greater the benefits such as meet and greet services, extra baggage, lounge access worldwide and more. Collect and spend Avios, Qatar Airways’ preferred currency, to access rewards such as Qatar Airways flights, Upgrades, Qatar Duty Free and more. To learn more about Privilege Club member benefits, click here . How many Avios can I collect when flying with Qatar Executive? If you book and pay directly with Qatar Executive, you are eligible to earn four (4) Avios per one (1) US Dollar of the Charter Price. How can I earn Avios when flying with Qatar Executive? You must provide your Privilege Club Membership Number to the Qatar Executive sales team at the time of booking your Qatar Executive flight before the Aircraft Charter Agreement is issued. How can I spend Avios when booking with Qatar Executive? You can choose to pay Avios in part or full when booking a charter flight. Please get in touch with the Qatar Executive team directly for a formal quotation by emailing request@qatarexec.com.qa confirming your Privilege Club membership number, requested date of flight, destination and passenger details. How many Avios do I need to book a flight with Qatar Executive? Our pricing is dynamic and is based on aircraft type, routes, and flying hours amongst other details. Every quotation is tailored to our passengers and their unique requirements. Please get in touch with the Qatar Executive team directly for a formal quotation by emailing request@qatarexec.com.qa confirming your Privilege Club membership number, requested date of flight, destination and passenger details. How can I pool my Avios with friends and family to use for Qatar Executive charter flight? Upon requesting a quotation with the Qatar Executive team, please mention that the Avios to be paid will be pooled with friends and family. The relevant information will be captured via a Redemption Form along with consent of each member before a flight charter agreement is issued. How can I obtain a Privilege Club tier upgrade for myself or my family, once I have booked with Qatar Executive? If you book and pay for a charter flight, you will receive an allocation of one (1) Platinum Tier and three (3) Gold Tier memberships which can be gifted to any individuals nominated by you (the Charterer). The information of the nominees who will receive the gifted Tiers must be provided to the Qatar Executive sales team, within seven (7) days of the Effective Date of the Aircraft Charter Agreement. A Tier Gift Nomination Form will be provided to capture the relevant information. Tiers will be updated within seven (7) working days after the request is received by Qatar Airways Privilege Club. Can I claim missing Avios from bookings I have made in the past direct with Qatar Executive? Avios can be credited for any new Qatar Executive charters booked and paid for on/after 10 th October 2024. Please ensure that you provide your Privilege Club Membership Number to the Qatar Executive sales team at the time of booking your Qatar Executive charter flight and in any event, before your charter agreement is issued. Avios will be credited within seven (7) working days after journey completion (completion of the full trip). Fleet Gulfstream G700 Gulfstream G650ER Bombardier Global 5000 Airbus A319 CJ About Services The Executive Experience Privilege Club Environmental Awareness Safety & Security News Latest News Contact Contact us Careers Let's stay connected A proud member of Let's stay connected A proud member of © 2024 Qatar Executive. All Rights Reserved. Privacy notice Cookie policy Cookie Consent Terms of Service G-E3X0LETP50 We use strictly necessary cookies, to ensure our website runs smoothly, analytics cookies, to enhance your browsing experience, and marketing cookies, to present you with personalised content. By clicking “Accept all”, you consent to our use of such cookies. You can change your preferences by clicking “Cookie preferences” or at any time via the “Cookie consent” link at the bottom of each page. Cookie preferences Cookie preferences No thanks Accept all Strictly necessary cookies Strictly necessary cookies are required for the website to function properly. Without them this website could not work and therefore they cannot be turned off. Analytics cookies Analytics cookies enable us to track your online movements and optimise our website performance without storing your personal data. Strictly necessary cookies are required for the website to function properly. Without them this website could not work and therefore they cannot be turned off. Marketing cookies are placed by us and third-party partners to provide you with personalised content. Save selection"
    },
    {
      "url": "https://www.mylocalservices.com/Privilege+Cocktail+Lounge-Miami+Beach-Florida-23326135.html",
      "text": "Are You Human? - US Local Services Directory Home Add Business Business Forum Testimonials Promotion Log-in × Close Menu Log-in Home Add Business Business Forum Testimonials Promotion Search for near My Local Services › Verification Please verify you are human Your browsing behaviour suggests you are an automatic program downloading pages from this site (known as a robot ). Please tick to confirm you're not a robot and press 'Submit'. Home | About Us | Listing\n                Information | Add Your Business | Contact\n                Us | Terms and Conditions | FAQs | Privacy Policy Site Map | Reviews | Listings | Business Categories | Sign up\n                here and Advertise your Business for Life! © 2005-2025 My Local\n                    Services No data from this site may be used for telemarketing or any marketing purposes. Any infringement will be fully investigated."
    }
  ]
}