{
  "fuentes": [
    {
      "url": "https://proofbrewingco.com/collections",
      "email": "info@proofbrewingco.com"
    },
    {
      "url": "https://www.wtxl.com/community/totally-tallahassee/proof-brewing-company-a-beer-created-by-the-tallahassee-community",
      "email": "dana.lyons@wtxl.tv"
    },
    {
      "url": "https://www.wtxl.com/community/totally-tallahassee/proof-brewing-company-a-beer-created-by-the-tallahassee-community",
      "email": "abigail.serrano@scripps.com"
    },
    {
      "url": "https://www.wtxl.com/community/totally-tallahassee/proof-brewing-company-a-beer-created-by-the-tallahassee-community",
      "email": "abigail.serranow@scripps.com"
    },
    {
      "url": "https://www.wtxl.com/community/totally-tallahassee/proof-brewing-company-a-beer-created-by-the-tallahassee-community",
      "email": "veronika.vernachio@wtxl.tv"
    },
    {
      "url": "https://www.blockbrewingcompany.com/contact-us/",
      "email": "info@blockbrewingcompany.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "accounts.payable@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "events@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "grant@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "kim@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mic@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mike@parkwaybrewing.com"
    },
    {
      "url": "https://proofbrewingco.com/collections/store",
      "email": "info@proofbrewingco.com"
    },
    {
      "url": "https://tallahasseearts.org/business/proof-brewing-company/",
      "email": "info@proofbrewingco.com"
    },
    {
      "url": "https://tallahasseearts.org/business/proof-brewing-company/",
      "email": "info@tallahasseearts.org"
    },
    {
      "url": "https://proofbrewingco.com/pages/proof-at-fsu",
      "email": "info@proofbrewingco.com"
    },
    {
      "url": "https://www.rockinghambrewing.com/about-us",
      "email": "info@rockinghambrewing.com"
    },
    {
      "url": "https://www.rockinghambrewing.com/about-us",
      "email": "west@rockinghambrewing.com"
    },
    {
      "url": "https://www.tallahassee.com/story/news/money/2018/03/19/proof-brewing-relocating-former-coca-cola-building/437371002/",
      "email": "tlwaters@tallahassee.com"
    },
    {
      "url": "https://proofbrewingco.com/blogs/news/proof-earthly-labs",
      "email": "info@proofbrewingco.com"
    },
    {
      "url": "https://www.mhkbeer.com/about-us",
      "email": "info@mhkbeer.com"
    },
    {
      "url": "https://proofbrewingco.com/pages/about-us",
      "email": "info@proofbrewingco.com"
    },
    {
      "url": "https://proofbrewingco.com/pages/contact-us",
      "email": "angela@proofbrewingco.com"
    },
    {
      "url": "https://proofbrewingco.com/pages/contact-us",
      "email": "arin@proofbrewingco.com"
    },
    {
      "url": "https://proofbrewingco.com/pages/contact-us",
      "email": "byron@proofbrewingco.com"
    },
    {
      "url": "https://proofbrewingco.com/pages/contact-us",
      "email": "david@proofbrewingco.com"
    },
    {
      "url": "https://proofbrewingco.com/pages/contact-us",
      "email": "davo@proofbrewingco.com"
    },
    {
      "url": "https://proofbrewingco.com/pages/contact-us",
      "email": "info@proofbrewingco.com"
    },
    {
      "url": "https://proofbrewingco.com/",
      "email": "info@proofbrewingco.com"
    }
  ],
  "mails": [
    "abigail.serrano@scripps.com",
    "abigail.serranow@scripps.com",
    "accounts.payable@parkwaybrewing.com",
    "angela@proofbrewingco.com",
    "arin@proofbrewingco.com",
    "byron@proofbrewingco.com",
    "dana.lyons@wtxl.tv",
    "david@proofbrewingco.com",
    "davo@proofbrewingco.com",
    "events@parkwaybrewing.com",
    "grant@parkwaybrewing.com",
    "info@blockbrewingcompany.com",
    "info@mhkbeer.com",
    "info@proofbrewingco.com",
    "info@rockinghambrewing.com",
    "info@tallahasseearts.org",
    "kim@parkwaybrewing.com",
    "mic@parkwaybrewing.com",
    "mike@parkwaybrewing.com",
    "tlwaters@tallahassee.com",
    "veronika.vernachio@wtxl.tv",
    "west@rockinghambrewing.com"
  ],
  "nombre_sitio": "proofbrewingco.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://proofbrewingco.com/collections",
      "text": "Collections\n– Proof Brewing Company Skip to content Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Search Contact 850-577-0517 info@proofbrewingco.com Facebook Twitter Instagram YouTube Untappd Menu Search Cart Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Cart ( 0 ) Search All collections Merchandise & Apparel (Shipping, & Curbside) Gift Card (Shipping, & Curbside) Events (Tickets, Glassware) Newsletter Sign up for our weekly newsletter for beer releases, events, specials, and more! Email Subscribe Menu Search Store Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events About Us Contact Us Careers JoyFace Collective Contact info@proofbrewingco.com 850-577-0517 1320 South Monroe Street Tallahassee Florida 32301 United States Facebook Twitter Instagram YouTube Untappd Proof Brewing Company CAFE & BREWPUB HOURS WEDNESDAY - SATURDAY 10am – 10 pm SUNDAY 2 pm - 8 pm American Express Apple Pay Discover Mastercard Visa © 2025, Proof Brewing Company Close (esc) Holiday Gift Card Promo Purchase one $100 gift card and receive one $25 gift card FREE! Offer applies automatically to cart when BOTH items are added. Offer expires 12/31 at midnight. Shop Now Age verification Are you 21 or older? Yes No Search Search Main menu Home Brewpub ABOUT US Proof at FSU Curious Delta 9 Giftcards Added to cart"
    },
    {
      "url": "https://www.wtxl.com/community/totally-tallahassee/proof-brewing-company-a-beer-created-by-the-tallahassee-community",
      "text": "Proof Brewing Company, a beer created by the Tallahassee Community Watch Now Menu Local National Weather Sports Traffic Watch Now Watch Now Close × Live Watch Alerts Search site Go In Your Neighborhood Weather Daily Forecast Hourly Forecast Alerts Interactive Radar Hurricane Center Traffic National News Sports College Sports High School Sports Inside Seminole Football Inside Seminole Basketball Video Latest Video Watch ABC 27 News Watch Breaking News Live Submit a News Tip Station Info Apps Contact Us Fresh Start ABC 27 News Staff Advertise with Us Employment Contests Florida Lottery Community Our Town Entertainment TV Guide Lifestyle Sign In Newsletters Sign Out Manage Emails Apps Careers Search WTXLABC27 wtxlabc27 abc27 UCqU2iMFdzqfexHNfxTcPJzw/ 1 WX Alerts 1 Closings/Delays In Your Neighborhood Videos Submit Tip Fresh Start Contests Home Pros Legally Speaking Advertise with Us Neighbors Doing Good More + Quick Links + In Your Neighborhood Videos Submit Tip Fresh Start Contests Home Pros Legally Speaking Advertise with Us Neighbors Doing Good Actions Facebook Tweet Email Proof Brewing Company, a beer created by the Tallahassee Community Prev Next What started as a way to sip on specialty craft beer Tallahassee, has now grow to thousands of people gathering at this brewery every week. By: Veronika Vernachio Posted and last updated TALLAHASSEE, Fla. — What started as a way to sip on specialty craft beer Tallahassee, has now grow to thousands of people gathering at this brewery every week. \"We had been involved with craft beer in Atlanta and realized there was a demand and a need in Tallahassee for access to craft beer,\" Owner and Founder Byron Burroughs said. Him and his wife Angela Burroughs moved here in the mid 2000s for another project, but when that fell through, they opened their first store liquor loft and became retailers. \"Our main focus was to have the best craft import and specialty beer and hard to find beers in the state,\" Burroughs said. As he traveled looking for the best beer, he learned something very important. \"People were clamoring for Florida beer among anything else,\" Burroughs said. \"We quickly realized we were just brand building for all of these out of state brands to sell in Florida, when people really wanted Florida local beer.\" This realization turned into Proof Brewing Company. \"After doing that for a year, it was really well received by the city and we received the other missing thing in Tallahassee was a proper beer bar,\" Burroughs said. Critics questioned this and said because Tallahassee is a college town, it won't do well since students only like cheap beer. Burroughs didn't listen and proved everyone wrong. He says students are some of his biggest customers, with many having Proof beer be their first legal drink. With rows of beer ready on tap to a garden in the back, Burroughs said he's grateful to have the location everyone goes to today. \"We do call it our forever home at 1320 South Monroe, and we now have all the capacity we need, room to grow,\" Burroughs said. A vision Byron says wouldn't be possible with Tallahassee. This community made the brand Proof, one that is Totally Tallahassee. Copyright 2020 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Sign up for the Headlines Newsletter and receive up to date information. now signed up to receive the Headlines Newsletter. Click here to manage all Newsletters More News In Your Neighborhood News Sports First To Know Weather Community Features About Us Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WTXLABC27 wtxlabc27 abc27 UCqU2iMFdzqfexHNfxTcPJzw/ © 2025 Scripps Media, Inc Give Light and the People Will Find Their Own Way"
    },
    {
      "url": "https://www.blockbrewingcompany.com/contact-us/",
      "text": "Contact Us - Block Brewing Skip to content FACEBOOK INSTAGRAM Home About Block Brewing – Brighton Block Brewing – Howell Banquets & Catering Our Beers Mug Club Gift Cards Events News Employment Contact Contact Us Contact we would love to hear from you You can Get in touch with us by email, phone, mail or by filling out the form below how to reach us bLOCK BREWING - HOWELL, MI By Mail: 1140 S. Michigan Ave. Howell, MI 48843 Email: [email protected] Phone: (517) 540-0300 bLOCK BREWING - BRIGHTON, MI By Mail: 1840 South Old US 23 Brighton, MI 48114 Email: [email protected] Phone: (810) 206-3990 get in touch Send Brighton Hours Sun-Thurs: 11am to 10pm Fri & Sat: 11am to 11pm Howell Hours Sun-Thurs: 11am to 10pm Fri & Sat: 11am to 11pm catering or banquet inquiries Click for more info on catering or banquets 🚨🍻NOW   ON   TAP   AT   OUR   BRIGHTON  ... Open We're   kicking   off   American   Craft   Beer   Week  ... Open Happy   Mother's   Day   to   all   you   amazing  ... Open 🚨🍻Now   on   Tap   at   our   Brighton   Location:   TAN  ... Open Happy   Cinco   de   Mayo!! We've   got   some... Open May   The   4th   Be   With   You! Stop   into   the  ... Open Happy   Friday   Everyone,   we   made   it   to   the  ... Open Happy   Saturday!! We're   throwing   out... Open 🚨🍻NEW   BEER   ALERT   🚨🍻 ... Open It's   Flux   Friday!!!   Come   enjoy   this   beautiful... Open It's   a   beautiful   day   to   come   enjoy   a   brew   on  ... Open Hoppy   Easter!!   We're   throwing   out   some   new,  ... Open Happy   National   Beer   Day!! Come   celebrate  ... Open Something   Wicked   this   way   comes.   .   With  ... Open It's   a   slam   *Dunk*,   vote   Block   for   March  ... Open Load More This error message is only visible to WordPress admins Error: Access Token is not valid or has expired. Feed will not update. Contact us block brewing Howell Facebook 1140 S Michigan Ave Howell, MI 48843 (517) 540-0300 [email protected] block brewing Brighton Facebook 1840 South Old US 23 Brighton, MI 48114 (810) 206-3990 [email protected] Howell hours Sun-Thurs: 11am -10pm Fri & Sat: 11am - 11pm Brighton hours Sun-Thurs: 11am - 10pm Fri & Sat: 11am - 11pm quick links Our Brews Brighton Location Howell Location Mug Club Gift Cards Banquets & Catering Employment Block Brewing Company was founded on the concept of bringing together a simple love of craft beer and great food and we want to share that passion with you. Designed and powered by Brewing Sites | Privacy Policy"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "text": "Contact - Parkway Brewing Company Skip to content Parkway Brewing Company Home Brews Where to find Parkway Distribution Online Store About Us Our Team Our Story The Tasting Room On Tap This Week’s Live Music and Food Trucks Private Events Monthly Music & Food Truck Calendar Visiting Parkway Pilot Batch Online Store Beer Buzz Contact Facebook Twitter Instagram Contact Contact Have a specific question? See below for the right contact and we’d love to answer that question for you! Private Events: events@parkwaybrewing.com For music/talent bookings, food trucks, or anything tasting room related: No Phone Calls Please, All Music Booking by Email ONLY kim@parkwaybrewing.com For  sales and distribution: grant@parkwaybrewing.com mike@parkwaybrewing.com For brewing, and general manager: mike@parkwaybrewing.com For office manager: mic@parkwaybrewing.com For invoices: accounts.payable@parkwaybrewing.com Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to print (Opens in new window) Subscribe for Updates Search our Site Distinctive Beers Crafted With Care In The Heart Of The Blue Ridge parkwaybrewing.com 739 Kessler Mill Road Exit 141 on I-81, SALEM, VA 540-404-9810 kim@parkwaybrewing.com Facebook Twitter Instagram Brewery Hours Monday – 2pm to 8pm Tuesday – 2pm to 8pm Wednesday – 2pm to 9pm Thursday – 2pm to 9pm Friday – 12pm to 9pm Saturday – 12pm to 9pm Sunday – 12pm to 8pm Holiday Closures: Christmas Day, New Years Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day © 2025 Parkway Brewing Co. | Custom Wordpress Development by William Alexander"
    },
    {
      "url": "https://proofbrewingco.com/collections/store",
      "text": "Store\n– Proof Brewing Company Skip to content Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Search Contact 850-577-0517 info@proofbrewingco.com Facebook Twitter Instagram YouTube Untappd Menu Search Cart Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Cart ( 0 ) Search Store Sort by Featured Best selling Alphabetically, A-Z Alphabetically, Z-A Price, low to high Price, high to low Date, old to new Date, new to old Clear all Gift Cards from $10.00 Gift Cards Regular price $10.00 View details Unit price / per $10 $15 $20 $30 $40 $50 $60 $70 $80 $90 $100 $25 Amount: $10 $15 $20 $30 $40 $50 $60 $70 $80 $90 $100 $25 Quantity: Add to cart Newsletter Sign up for our weekly newsletter for beer releases, events, specials, and more! Email Subscribe Menu Search Store Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events About Us Contact Us Careers JoyFace Collective Contact info@proofbrewingco.com 850-577-0517 1320 South Monroe Street Tallahassee Florida 32301 United States Facebook Twitter Instagram YouTube Untappd Proof Brewing Company CAFE & BREWPUB HOURS WEDNESDAY - SATURDAY 10am – 10 pm SUNDAY 2 pm - 8 pm American Express Apple Pay Discover Mastercard Visa © 2025, Proof Brewing Company Close (esc) Holiday Gift Card Promo Purchase one $100 gift card and receive one $25 gift card FREE! Offer applies automatically to cart when BOTH items are added. Offer expires 12/31 at midnight. Shop Now Age verification Are you 21 or older? Yes No Search Search Main menu Home Brewpub ABOUT US Proof at FSU Curious Delta 9 Giftcards Added to cart"
    },
    {
      "url": "https://tallahasseearts.org/business/proof-brewing-company/",
      "text": "Proof Brewing Company English English French German Italian Portuguese Russian Spanish SUBMIT YOUR INFO LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. subscribe follow capture tweet watch connect access Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT SEARCH MENU EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates Select Category Bar/Club BIPOC Owned/Operated Hotel LGBTQIA+ Friendly Photography Restaurant -- American -- Bakery -- Bistro/Cafe -- Coffee House -- Deli -- Gastropub/Brewpub -- International -- Japanese -- Mexican -- Pizza -- Seafood -- Southern Shop for Local Art Select Location Adel Alapaha Albany Alford Apalachicola Arlington Ashford Baconton Bainbridge Barney Barwick Bascom Bellwood Berlin Black Blakely Bluffton Bonifay Boston Branford Brinson Bristol Brookfield Cairo Camilla Campbellton Carrabelle Cecil Chancellor Chattahoochee Chipley Chula Climax Coffee Springs Coleman Colquitt Columbia Cottondale Cottonwood Cowarts Crawfordville Cross City Cuthbert Cypress Damascus Day Dixie Doerun Dothan Eastpoint Ebro Edison Ellenton Enigma Five Points Fort Gaines Fort White Fountain Funston Geneva Gordon Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Hahira Hartford Havana Headland Highland City Horseshoe Beach Iron City Jakin Jasper Jennings Lake City Lake Park Lakeland Lamont Leary Lee Leesburg Lenox Live Oak Lloyd Lulu Lynn Haven Madison Malone Malvern Marianna Mayo Mc Alpin Meigs Mexico Beach Midway Monticello Morgan Morven Moultrie Nashville Naylor Newton Newville Noma Norman Park Ochlocknee Old Town Omega Panacea Panama City Panama City Beach Pansey Pelham Perry Pinetta Ponce de Leon Port Saint Joe Poulan Quincy Quitman Ray City Rebecca Rosemary Beach Saint Marks Sale City Samson Shellman Shorterville Slocomb Smithville Sneads Sopchoppy Sparks Statenville Steinhatchee Stockton Sumner Sycamore Sylvester Tallahassee Thomasville Tifton Trenton Ty Ty Valdosta Vernon Warwick Wausau Webb Wellborn Westville Wewahitchka Whigham White Springs Woodville Youngstown SEARCH Home Bar/Club ; Restaurant Proof Brewing Company Facebook Twitter Linkedin Proof Brewing Company Bar/Club ; Restaurant Comment Email / Website / Facebook / Twitter / Instagram / Primary address: 1320 South Monroe, Tallahassee, FL 32301 850-577-0517 Founded in 2007, Proof Brewing Co. is dedicated to brewing flavorful & unique styles of beer with a focus on quality and creativity. Proof Brewing Co. production brewery added a state of the art 20 barrel brew house, fully automated canning line, refined tasting room & outdoor beer garden in 2014. At this location we keg for distribution and will be canning our core beers and bottling limited releases. The tasting room features the full line of PBC brews, rotating guest taps and the entire ... view more » Founded in 2007, Proof Brewing Co. is dedicated to brewing flavorful & unique styles of beer with a focus on quality and creativity. Proof Brewing Co. production brewery added a state of the art 20 barrel brew house, fully automated canning line, refined tasting room & outdoor beer garden in 2014. At this location we keg for distribution and will be canning our core beers and bottling limited releases. The tasting room features the full line of PBC brews, rotating guest taps and the entire brewery operation is visible from the bar & seating areas. Guests can also relax on our covered beer garden patio area where you can enjoy live music, bocce ball, table tennis, and other entertaining outdoor activities. View less HOURS: Monday - Thursday: 4pm - Midnight Friday - Saturday: 11am - 1am Sunday: 11am - Midnight RESERVATIONS: Please email info@proofbrewingco.com to reserve table with 72 hour notice. LOCATION Address : 1320 South Monroe, Tallahassee, FL 32301 Full map and directions Nearby Events Movies in the Park: Wizard of Oz Presented by Tallahassee Downtown at Kleman Plaza Sep 10, 2025 Facebook Twitter Linkedin Pet Bingo Night Presented by Amicus Brewing Ventures at Amicus Brewing Ventures Sep 10, 2025 Facebook Twitter Linkedin A Songwriters Concert Evening of Original Music Presented by Tallahassee Chapter, Nashville Songwriters Association International at Challenger Learning Center of Tallahassee Sep 11, 2025 Accessibility Info Facebook Twitter Linkedin GET TICKETS Lunch with the Maestro! September 11 Presented by Tallahassee Symphony Orchestra at Governors Club Sep 11, 2025 Facebook Twitter Linkedin GET TICKETS Albert Castiglia Blues Band Presented by Mac Daddy Blues Productions at The American Legion Hall, Post 13 Sep 12, 2025 Facebook Twitter Linkedin GET TICKETS SHOW MORE COMMENTS Leave a comment Your email address will not be published. Required fields are marked * * Email address is required! * This is not email address! * Author name is required! * Comment content is required! Your name * Your email * Comment * You may use these HTML tags and attributes : <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <cite> <code> <del datetime=\"\"> <em> <i> <q cite=\"\"> <s> <strike> <strong> * Please check the box to prove you are not a robot FIND EATS, DRINKS & STAYS Search by Keyword Select Category Bar/Club BIPOC Owned/Operated Hotel LGBTQIA+ Friendly Photography Restaurant -- American -- Bakery -- Bistro/Cafe -- Coffee House -- Deli -- Gastropub/Brewpub -- International -- Japanese -- Mexican -- Pizza -- Seafood -- Southern Shop for Local Art Select Location Adel Alapaha Albany Alford Apalachicola Arlington Ashford Baconton Bainbridge Barney Barwick Bascom Bellwood Berlin Black Blakely Bluffton Bonifay Boston Branford Brinson Bristol Brookfield Cairo Camilla Campbellton Carrabelle Cecil Chancellor Chattahoochee Chipley Chula Climax Coffee Springs Coleman Colquitt Columbia Cottondale Cottonwood Cowarts Crawfordville Cross City Cuthbert Cypress Damascus Day Dixie Doerun Dothan Eastpoint Ebro Edison Ellenton Enigma Five Points Fort Gaines Fort White Fountain Funston Geneva Gordon Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Hahira Hartford Havana Headland Highland City Horseshoe Beach Iron City Jakin Jasper Jennings Lake City Lake Park Lakeland Lamont Leary Lee Leesburg Lenox Live Oak Lloyd Lulu Lynn Haven Madison Malone Malvern Marianna Mayo Mc Alpin Meigs Mexico Beach Midway Monticello Morgan Morven Moultrie Nashville Naylor Newton Newville Noma Norman Park Ochlocknee Old Town Omega Panacea Panama City Panama City Beach Pansey Pelham Perry Pinetta Ponce de Leon Port Saint Joe Poulan Quincy Quitman Ray City Rebecca Rosemary Beach Saint Marks Sale City Samson Shellman Shorterville Slocomb Smithville Sneads Sopchoppy Sparks Statenville Steinhatchee Stockton Sumner Sycamore Sylvester Tallahassee Thomasville Tifton Trenton Ty Ty Valdosta Vernon Warwick Wausau Webb Wellborn Westville Wewahitchka Whigham White Springs Woodville Youngstown SEARCH RESET OUR PARTNERS COCA's programs are sponsored in part by the City of Tallahassee, Leon County, the State of Florida, Department of State, Division of Cultural Affairs, Community Foundation of North Florida, Knight Foundation, National Endowment for the Arts, and the Tallahassee Community Redevelopment Agency. COCA, the Council on Culture & Arts, is a non-profit organization that serves as the facilitator and voice for the arts and cultural industry in Florida's capital area. COCA provides information and promotes the arts and culture to both citizens and visitors. ABOUT US DIRECTORIES CLASSIFIEDS PARTNERS CONTACT US 114 S DUVAL STREET TALLAHASSEE, FL 32301 LOCAL NUMBER: (850) 224-2500 EMAIL: info@tallahasseearts.org © Copyright 2025 - Council on Culture & Arts | Contact Us | Site Map | Privacy Policy Powered by ARTSOPOLIS The COCA office currently has adjusted office hours to 1 PM – 5 PM to accommodate pickup for Winterfest. These hours will be adjusted from Tuesday, February 11, through Friday, February 28 . Regular office hours will return on Monday, March 3. For questions, feel free to contact staff via phone or email. In addition, access to Railroad Avenue between Gaines Street & FAMU Way is down to one lane heading south. For access to the COCA office, please take Gaines Street as currently, the COCA office is not accessible off of FAMU Way."
    },
    {
      "url": "https://proofbrewingco.com/pages/proof-at-fsu",
      "text": "Proof at FSU\n– Proof Brewing Company Skip to content Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Search Contact 850-577-0517 info@proofbrewingco.com Facebook Twitter Instagram YouTube Untappd Menu Search Cart Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Cart ( 0 ) Search We're open! Proof at FSU is located on the ground floor of the brand-new FSU Student Union, serving a classic pub grille food menu and award-winning beer on draft, signature cocktails, and boutique wine. Open six days a week, offering lunch and dinner. Proof at FSU is an exciting, welcoming space to enjoy happy hour, Nole watch parties, and much more with friends and family. All ages welcome! Must be 21+ to drink alcohol. Please drink responsibly. Full menu Proof at FSU 75 N Woodward Ave. Tallahassee, Florida 32304 Sunday - Friday | 11AM - 10PM Saturday | 11AM - 9PM Hours may vary, follow us on social media for updates! Newsletter Sign up for our weekly newsletter for beer releases, events, specials, and more! Email Subscribe Menu Search Store Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events About Us Contact Us Careers JoyFace Collective Contact info@proofbrewingco.com 850-577-0517 1320 South Monroe Street Tallahassee Florida 32301 United States Facebook Twitter Instagram YouTube Untappd Proof Brewing Company CAFE & BREWPUB HOURS WEDNESDAY - SATURDAY 10am – 10 pm SUNDAY 2 pm - 8 pm American Express Apple Pay Discover Mastercard Visa © 2025, Proof Brewing Company Close (esc) Holiday Gift Card Promo Purchase one $100 gift card and receive one $25 gift card FREE! Offer applies automatically to cart when BOTH items are added. Offer expires 12/31 at midnight. Shop Now Age verification Are you 21 or older? Yes No Search Search Main menu Home Brewpub ABOUT US Proof at FSU Curious Delta 9 Giftcards Added to cart"
    },
    {
      "url": "https://www.rockinghambrewing.com/about-us",
      "text": "Who We Are | Rockingham Brewing Company | Rockingham Brewing Company Home Who We Are Visit Our Derry Taproom Taproom Info Current Offerings Order Beer To-Go in Derry Visit Our Newport Taproom Contact Us Purchase Gift Cards Home Who We Are Visit Our Derry Taproom Taproom Info Current Offerings Order Beer To-Go in Derry Visit Our Newport Taproom Contact Us Purchase Gift Cards Rockingham Brewing Company Trust the Pig. 1 Corporate Park Dr #1 Derry, NH 03038 USA 603.995.1543 Our Story Rob & Ali Leleszi first connected over a rousing game of beer pong in New York City in 2007. Early on,  it was clear that  they would go on to do great things together, but it took  six years to figure out what those things were. During that time, Rob cultivated his passion & skill for homebrewing and received an Associates Degree in Brewing Science from the Siebel Institute.  He then started an invaluable internship at Port Jeff Brewing Company in Long Island.  It was a long commute from Brooklyn, and even longer work hours, but Rob's love for brewing only grew. At the same time, Ali, who had always dreamed of owning her own      business, had become a self-professed beer snob and was reading up on the business side of brewing. It was then they decided to open up their own brewery and started scouting the perfect locale for their 10 barrel brew system.  They stopped when they found the blossoming town of Derry, NH, in Ali’s home state. Rockingham Brewing opened its doors in February of 2015.  About one month after opening, Rob and Ali hired their first full time employee, Remy, a Great Pyrenees mix rescue.   Since then, the team has grown into 10 hard-working & fun-loving individuals, who focus on brewing & sharing a well-rounded portfolio of beers, to ensure there is always an option for everyone to  enjoy.  They are all thrilled to be part of the growing local beer community in Rockingham County, NH. Rockingham Brewing Company - 1 Corporate Park Drive Unit #1 Derry, NH 03038      603.216.2324     info@rockinghambrewing.com   Wednesday-Friday 4-8p     Saturday 1-8p    Sunday 1-6p Rockingham West - 300 Sunapee Street Newport, NH 03773      west@rockinghambrewing.com                           Thursday-Friday 4-8p     Saturday 1-8p    Sunday 1-6p Follow us on facebook & Instagram"
    },
    {
      "url": "https://www.tallahassee.com/story/news/money/2018/03/19/proof-brewing-relocating-former-coca-cola-building/437371002/",
      "text": "Proof Brewing relocating to former Coca Cola building News Sports Entertainment Opinion Email Us Advertise Obituaries eNewspaper Legals MONEY Proof Brewing relocating to former Coca Cola building TaMaryn Waters Tallahassee Democrat Proof Brewing Company is leaving Railroad Square for a south-side property that allows Tallahassee's first and largest brewery to boost its production capacity fivefold. It's moving quarter of a mile away into the former Coca-Cola bottling plant at 1320 S. Monroe St. Built in 1948, the vacant facility allows Proof Brewing to expand production from 6,000 to 30,000 barrels per year and qualify for business incentives. Owners Byron Burroughs, 47, and Angela Burroughs, 42, opened the Railroad Square location in 2012. Renovations to the Coca-Cola building begin this month and are slated to be completed by year end or early 2019. Now, Proof Brewing is starting with a blank slate. Inside the gray-colored building on Monday, the couple stood in the cavernous space set to be the production floor. Fifteen kegs were loaded on the back of a bright red F1 1950, an appropriate throwback vehicle considering the building's soda-to-beer operation. This is where canning, brewing, aging and packaging of Proof's products will occur. They pointed out details of what's to come. “If you look at our location at Railroad Square, it’s very small. It’s about 7,500 square feet. This room itself is about 22,000 square feet,” Byron Burroughs said. “We’re completely pinned in at the Railroad Square location.” He said relocation plans were expected to happen once Proof hit its 10-year projection. But skyrocketing growth sliced that time by a third. It's too soon to know what will replace Proof at Railroad Square Art Park. \"We are currently in the process of looking into multiple options for how the building will be used after Proof relocates,\" said Lily Boynton Kaye, one of the park's owners. \"Although the exact usage is not yet determined, we have some exciting possibilities in mind and intend for there to continue to be an outdoor seating area, hopefully larger and with expanded options for both food and beverage.\" The South Monroe Street location is the second site where Coca-Cola once operated. It originally occupied a bottling plant in what is now the All Saints District. On March 1, Proof owners gained title of its new building from DoubleTree Hotel owner and entrepreneur J.T. Burnette in a $960,000 land swap. In exchange, Burnette received the Whiskey House bar and liquor store that sits on less than half an acre on West Tennessee Street. The 34,000 square-foot new brewery site will offer a tasting room; roll up doors will lead to the outside and onto a covered space surrounded by turf and a large decorative fenced-in area. Customers will sip year-round beers on draft, in addition to seasonal and pilot batch beer offerings. The tasting room's floor will be ground down to the raw concrete and resealed. The dim, dark interior will be transformed into an industrial fusion of modern decor. There also will be private dedicated event space that wasn’t possible at the Railroad Square site without reducing the beer garden. A full-service kitchen in the new space allows for catering and offering a new varied menu items produced by a local chef. “Everybody that we’re bringing on and everybody that we’re partnering with is local,” Angela Burroughs said. “We really want to support the town that’s given us so much support.” Proof’s redevelopment of an entire city block is the latest signal of change taking shape in “SoMo” along the South Monroe Street corridor leading to downtown and Cascades Park and steps away from Florida A&M University. From FAMU Way, the new brewery is across from landmark restaurant Shells Oyster Bar and Happy Motoring, a bar and food truck hub that opened less than two weeks ago. The Tallahassee-Leon County Office of Economic Vitality worked with Proof for a tax reimbursement package and other incentives. Under the code name \"Project Fox,\" staffers indicated Proof would receive a 70 percent reimbursement for development fees and an additional 70 percent reimbursement of the city property tax paid on the land, improvements and tangible personal property for seven years. In addition, the county will provide reimbursement of the property taxes equal to the amount reimbursed by the city for the Target Business Program, estimated at $97,400, according to reports from the Office of Economic Vitality. Officials said Proof's relocation will create 20 new jobs and falls under the area's light manufacturing category for business incentives. It's total $23 million economic impact  includes 102 direct and indirect jobs. OEV Director Al Latimer said Proof’s relocation is an example of a catalyst project in which companies are making investments near public infrastructure upgrades. “As a catalyst project,\" he said, \"they are serving as an additional motivator for others to capitalize on all of the positives of the public infrastructure and place making ... The amount of interest in properties on the south side is picking up.\" . Its canning operation began two years ago. Proof's expansion also allows for more packaged brands in cans. Although the beer is only sold in Tallahassee-based Publix stores, Byron Burroughs said Proof is the grocer's top selling craft beer in the state. Proof Brewing Co. poised for canning \"We think this is not only great for us but great for the city,” Byron Burroughs said. \"We’re so thankful to Tallahassee for being supportive of us and the entrepreneurial spirit and allowing us to grow at the rate we’ve been able to grow.\" Angela Burroughs jokingly said, \"I feel like it’s been 10 years of an overnight success,” as her hand landed on her husband's shoulder. They've been married for a dozen years. She remembers Proof's early roots in 2007 as a small boutique liquor store on Tennessee Street. Their daughter, Olivia, was born four years later. She spent countless nights nursing while finishing up payroll. \"She comes to work with us all of the time,” she said. “She’s been a team player ever since she was born.” Added her husband: “She’s going to learn how to brew better than I can.\" Contact TaMaryn Waters at tlwaters@tallahassee.com or follow @TaMarynWaters on Twitter. Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Licensing & Reprints Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.tallahassee.com. All rights reserved."
    },
    {
      "url": "https://proofbrewingco.com/blogs/news/proof-earthly-labs",
      "text": "Proof Brewing Co. Becomes First Craft Brewery In Florida To Implement \n– Proof Brewing Company Skip to content Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Search Contact 850-577-0517 info@proofbrewingco.com Facebook Twitter Instagram YouTube Untappd Menu Search Cart Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Cart ( 0 ) Search Carbon Footprint / CO2 / Earthly Labs Proof Brewing Co. Becomes First Craft Brewery In Florida To Implement Earthly Labs Technology To Capture And Reuse CO2 Emissions Proof Brewing Company has partnered with Earthly Labs , an Austin, TX based company, to become the first craft brewery in Florida to implement carbon capture technology to reduce carbon dioxide (CO2) emissions. Earthly Labs plug-and-play carbon capture technology called CiCi®, enables craft breweries like Proof Brewing Co. to capture more than 100,000 pounds of waste CO2 or more than 1,500 trees worth of CO2 from the brewing process each year and reuse it to carbonate and package beer. This is one way Proof Brewing Co. is recycling its waste, improving its environmental performance, and giving back to its community for Earth Day. “We are committed to improving our sustainability and carbon footprint for our local community and consumers,” said Founder Byron Burroughs. “This technology allows us to help our environment but also our commitment to innovation by brewing even better beer.” The Earthly Labs CiCi unit will be installed at Proof Brewing Co. in Tallahassee this summer. The CO2 will be used to carbonate beer distributed throughout Florida and available in Proof Brewpub. A special beer release will be made available in Summer celebrating the launch, and the public will be invited for the Earthly drop. “As a fellow Floridian, I am so proud to have Proof Brewing as our first Florida customer, using an Earthly Labs CO2 capture unit in my home state,” said CEO Amy George. “In addition to making great beer, better, Proof is leading the way for blue skies in the Sunshine State, reducing CO2 emissions every day.” Since the global pandemic, Earthly Labs has witnessed the effect of CO2 supply chain risk in some regions, including Florida, resulting in CO2 price spikes and surge or force majeure pricing. Earthly Labs technology allows breweries to supplement CO2 supply by capturing and using their own natural CO2, which has fewer hydrocarbons and other impurities. To learn visit earthlylabs.com/resources. For more information on Earthly Labs, contact Diana Crawford (email / phone) Diana Crawford dianacrawfordpr@gmail.com , 502-727-8881 About Proof Brewing Founded by Byron & Angela Burroughs in 2012, Proof Brewing Company prides itself on being an industry leader of innovative beers. Proof Brewing Co. produces big, bold, flavorful beers and remains committed to true artisanal brewing methods in an evolving industry. The brewery has received numerous awards and recognition from the world renowned Hunaphu’s Day, US Open Beer Championship, Best Florida Beer, Paste Magazine, and Wine Enthusiast. For more information, visit www.proofbrewingco.com, Facebook: PBCBeer, Twitter: proofbrewingco, and Instagram: proofbrewingco About Earthly Labs Earthly Labs’ mission is to avoid one billion metric tons of carbon dioxide emissions. The company’s carbon capture technology allows for energy-efficient capture, purification and reuse of carbon dioxide from small-scale sources. Earthly Labs’ solution includes patent-pending small footprint capture hardware “CiCi®” process control and monitoring software, and maintenance services. The new CO2 exchange program allows companies to capture and sell waste CO2 to create value. CiCi is the first platform available for the small craft brewing segment. Earthly Labs is a Public Benefit Corporation committed to using business as a force for good. To find out more, visit earthlylabs.com . Facebook Twitter Pinterest Older Post Newer Post Newsletter Sign up for our weekly newsletter for beer releases, events, specials, and more! Email Subscribe Menu Search Store Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events About Us Contact Us Careers JoyFace Collective Contact info@proofbrewingco.com 850-577-0517 1320 South Monroe Street Tallahassee Florida 32301 United States Facebook Twitter Instagram YouTube Untappd Proof Brewing Company CAFE & BREWPUB HOURS WEDNESDAY - SATURDAY 10am – 10 pm SUNDAY 2 pm - 8 pm American Express Apple Pay Discover Mastercard Visa © 2025, Proof Brewing Company Close (esc) Holiday Gift Card Promo Purchase one $100 gift card and receive one $25 gift card FREE! Offer applies automatically to cart when BOTH items are added. Offer expires 12/31 at midnight. Shop Now Age verification Are you 21 or older? Yes No Search Search Main menu Home Brewpub ABOUT US Proof at FSU Curious Delta 9 Giftcards Added to cart"
    },
    {
      "url": "https://www.mhkbeer.com/about-us",
      "text": "About Us - Manhattan Brewing Company Skip to main content We use cookies to improve site performance and your experience. View our privacy policy for more information OK Go Home About Us Beers MBC Lounge MBC Catering The Brew Deck Join Our Team Shop Wing Wars Contact Us Our Story About Us We're ready to share our beers with Manhattan. With nearly 20 years of collective experience in the craft beer industry, we're focused on brewing and serving high-quality craft beers in a family-friendly atmosphere in the heart of downtown Manhattan. This town is our home, and we want to bring the best possible beer experience and education to the wonderful people of Manhattan. We want to create a place for everyone to come out and have a good time with friends and cultivate a craft beer culture Manhattan can be proud of. Our Team The best and brightest Co-Owners Portraits by Killian Millner Adam Krebsbach Brewer A native of Norton, Kansas, who moved to Manhattan in 2006, Adam's unrelenting creative energy has resulted in a tasty variety of imaginative beers. A tinkerer at heart, Adam is the yin to Garrett's yang; for every traditional style brewed by Garrett, you'll find Adam experimenting with an array of unique ingredients into his beers to challenge and delight beer fans. Adam loves drinking American pale ales, robust porters and Belgian tripels. Garrett Paulman Brewer A professionally trained brewer from the renowned Siebel Institute of Technology in Chicago, Garrett also brings experience in facility management and quality control. Garrett started brewing in 2011 before making the leap to attend Siebel and \"turn pro\" in 2012. You will find Garrett drinking anything hoppy while laughing with friends, family and strangers at the bar. Although he's a Nebraska native, Garrett, his wife and two children are K-State fans in training. Jake Voegeli Sales & Marketing A former K-State football player from Wichita, Kansas, who bleeds purple with his wife and daughter, Jake's journey into craft beer began in college after committing himself to trying a new six pack each week. Jake loves to challenge his palate with hoppy IPAs, sours and barrel-aged stouts, but also loves a well-crafted, delicate pilsner or a traditional English brown ale. An experienced salesman and marketer both in the craft beer and spirits industries, you'll mostly see Jake up front slinging beers or chatting with guests about beer, K-State football, his favorite Ryan Bingham album or his daughter Chloe. Keep up to date with Manhattan Brewing Company on twitter Follow Manhattan Brewing Company on facebook See what's going on at Manhattan Brewing Company on instagram Manhattan Brewing Company,\n\t\t\t\t\t406 Poyntz Ave, Manhattan, KS  66502 785-775-0406 Powered By Merlin® | Privacy Policy | Terms of Use Scroll to top of page"
    },
    {
      "url": "https://proofbrewingco.com/pages/about-us",
      "text": "ABOUT US\n– Proof Brewing Company Skip to content Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Search Contact 850-577-0517 info@proofbrewingco.com Facebook Twitter Instagram YouTube Untappd Menu Search Cart Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Cart ( 0 ) Search ABOUT US Our Story Founded by Byron & Angela Burroughs in 2012, Proof Brewing Company prides itself on being an industry leader of innovative beers. Proof Brewing Co. produces big, bold, flavorful beers and remains committed to true artisanal brewing methods in an evolving industry. Tallahassee’s first craft production brewery featuring a 20-barrel brew house, refined tasting room & outdoor beer garden. The brewery has received numerous awards and recognition from the world renowned Hunaphu’s Day , World Beer Cup , Best Florida Beer , Paste Magazine and Wine Enthusiast . Newsletter Sign up for our weekly newsletter for beer releases, events, specials, and more! Email Subscribe Menu Search Store Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events About Us Contact Us Careers JoyFace Collective Contact info@proofbrewingco.com 850-577-0517 1320 South Monroe Street Tallahassee Florida 32301 United States Facebook Twitter Instagram YouTube Untappd Proof Brewing Company CAFE & BREWPUB HOURS WEDNESDAY - SATURDAY 10am – 10 pm SUNDAY 2 pm - 8 pm American Express Apple Pay Discover Mastercard Visa © 2025, Proof Brewing Company Close (esc) Holiday Gift Card Promo Purchase one $100 gift card and receive one $25 gift card FREE! Offer applies automatically to cart when BOTH items are added. Offer expires 12/31 at midnight. Shop Now Age verification Are you 21 or older? Yes No Search Search Main menu Home Brewpub ABOUT US Proof at FSU Curious Delta 9 Giftcards Added to cart"
    },
    {
      "url": "https://proofbrewingco.com/pages/contact-us",
      "text": "Contact Us\n– Proof Brewing Company Skip to content Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Search Contact 850-577-0517 info@proofbrewingco.com Facebook Twitter Instagram YouTube Untappd Menu Search Cart Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Cart ( 0 ) Search Contact Us Connect with us! 1320 South Monroe Street Tallahassee Florida 32301 United States BREWERY & TAPROOM (850) 577-0517 BYRON BURROUGHS - FOUNDER ANGELA BURROUGHS - FOUNDER ARIN BROWN - HEAD BREWER DAVID KANT-RAUCH - PRODUCTION MANAGER DAVE RODRIGUEZ - DIRECTOR OF SALES FOR GENERAL INQUIRIES info@proofbrewingco.com Send us an email! Name Email Phone Number Message Newsletter Sign up for our weekly newsletter for beer releases, events, specials, and more! Email Subscribe Menu Search Store Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events About Us Contact Us Careers JoyFace Collective Contact info@proofbrewingco.com 850-577-0517 1320 South Monroe Street Tallahassee Florida 32301 United States Facebook Twitter Instagram YouTube Untappd Proof Brewing Company CAFE & BREWPUB HOURS WEDNESDAY - SATURDAY 10am – 10 pm SUNDAY 2 pm - 8 pm American Express Apple Pay Discover Mastercard Visa © 2025, Proof Brewing Company Close (esc) Holiday Gift Card Promo Purchase one $100 gift card and receive one $25 gift card FREE! Offer applies automatically to cart when BOTH items are added. Offer expires 12/31 at midnight. Shop Now Age verification Are you 21 or older? Yes No Search Search Main menu Home Brewpub ABOUT US Proof at FSU Curious Delta 9 Giftcards Added to cart"
    },
    {
      "url": "https://proofbrewingco.com/",
      "text": "Proof Brewing Company Skip to content Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Search Contact 850-577-0517 info@proofbrewingco.com Facebook Twitter Instagram YouTube Untappd Menu Search Cart Home Brewpub Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events Table Reservation Request ABOUT US About Us Contact Careers Proof at FSU Proof at FSU Menu Curious Delta 9 Berry Lemonade Fizz Peach Fizz Mango Pineapple Fizz Lab Certificates Giftcards Log in Cart ( 0 ) Search Proof Brewpub Enjoy shareable plates and drinks in the modern, yet intimate tasting room, covered patio, or expansive beer garden. Brewpub Menu Events proof events Upcoming Events & Shows 🗓️ WEEKLY SPECIALS: Trivia Night w/ Nate!  Wednesday at 7:00pm Happy Hour – Wednesday to Friday 4pm – 6pm Wednesdays [All night] | $13 BIG Pretzel + Select Core Beer Combo LIVE MUSIC CALENDAR Friday 9/5 - Atticus Rones! 7pm Saturday 9/6 - One Eye JAK! 7pm Friday 9/12 - Flamingo Party! 7pm Saturday 9/20 - Jack & Gin! 7pm Saturday 9/27 - Elements! 6pm TRIVIA at the Brewpub Fire up the group chat and gather your friends! Trivia begins every Wednesday night at 7pm. Fun, food, drinks, and prizes! Free to play! Five rounds w/ Prizes! $20 gift cards awarded to round winners! Different themes each round! Hosted by DJ Nate Bragg! Kitchen closes at 9pm. FIND US 1320 South Monroe Street Tallahassee, FL 32301 info@proofbrewingco.com Brewpub: Wednesday - Saturday 10am – 10 pm Sunday 2 pm – 8 pm Get directions Newsletter Sign up for our weekly newsletter for beer releases, events, specials, and more! Email Subscribe Menu Search Store Visiting The Brewpub Draft & Drinks Brewpub Menu Private Events About Us Contact Us Careers JoyFace Collective Contact info@proofbrewingco.com 850-577-0517 1320 South Monroe Street Tallahassee Florida 32301 United States Facebook Twitter Instagram YouTube Untappd Proof Brewing Company CAFE & BREWPUB HOURS WEDNESDAY - SATURDAY 10am – 10 pm SUNDAY 2 pm - 8 pm American Express Apple Pay Discover Mastercard Visa © 2025, Proof Brewing Company Close (esc) Holiday Gift Card Promo Purchase one $100 gift card and receive one $25 gift card FREE! Offer applies automatically to cart when BOTH items are added. Offer expires 12/31 at midnight. Shop Now Age verification Are you 21 or older? Yes No Search Search Main menu Home Brewpub ABOUT US Proof at FSU Curious Delta 9 Giftcards Added to cart"
    }
  ]
}