{
  "fuentes": [
    {
      "url": "https://www.cateringbyprovisions.com/menus/",
      "email": "service@cateringbyprovisions.com"
    },
    {
      "url": "https://www.cateringbyprovisions.com/about-us/",
      "email": "service@cateringbyprovisions.com"
    },
    {
      "url": "https://www.cateringbyprovisions.com/",
      "email": "service@cateringbyprovisions.com"
    },
    {
      "url": "https://www.paulsprovisionscatering.com/",
      "email": "info@paulsprovisionscatering.com"
    },
    {
      "url": "https://www.rca.asn.au/contact-us",
      "email": "policy@rca.asn.au"
    },
    {
      "url": "https://www.rca.asn.au/contact-us",
      "email": "restncat@rca.asn.au"
    },
    {
      "url": "https://www.localprovisionsva.com/",
      "email": "leeann@localprovisionsva.com"
    },
    {
      "url": "https://www.cateringbyprovisions.com/contact/",
      "email": "service@cateringbyprovisions.com"
    },
    {
      "url": "http://yycpronto.com/contact",
      "email": "info@yycpronto.com"
    },
    {
      "url": "https://nolapicnic.com/",
      "email": "monica@nolapicnic.com"
    },
    {
      "url": "https://nolapicnic.com/",
      "email": "aron@wellmadedigital.com"
    },
    {
      "url": "https://nolapicnic.com/",
      "email": "heidi@nolapicnic.com"
    },
    {
      "url": "https://nolapicnic.com/",
      "email": "monica@nolapicnic.com"
    },
    {
      "url": "https://robertsonstavistock.co.uk/contact-us/",
      "email": "tavistockpizza@yahoo.com"
    }
  ],
  "mails": [
    "aron@wellmadedigital.com",
    "heidi@nolapicnic.com",
    "info@paulsprovisionscatering.com",
    "info@yycpronto.com",
    "leeann@localprovisionsva.com",
    "monica@nolapicnic.com",
    "policy@rca.asn.au",
    "restncat@rca.asn.au",
    "service@cateringbyprovisions.com",
    "tavistockpizza@yahoo.com"
  ],
  "nombre_sitio": "provisionsfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cateringbyprovisions.com/menus/",
      "text": "Provisions Catering  | Menus Catering Full Service Food Delivery Holiday Catering Vegan Specialties Menus Vegan Specialties Event Partners Gallery About Us Testimonials FAQs Contact Menus Full Service Menus Cocktail Buffet Menu View Menu Seated Plated Dinner Menu View Menu Stations Party Menu View Menu Luncheon Menu View Menu Kiddush Menu View Menu Holiday Menus Winter Holidays Menu View Menu Passover Menu View Menu Thanksgiving Menu View Menu High Holiday Menu View Menu Food Delivery Menu Full Menu View Menu Seasonal Menus Spring Garden Menu View Menu Summer Seasonal Menu View Menu Fall Features Menu View Menu Winter Seasons Menu View Menu Facebook Twitter LinkedIn Catering Full Service Food Delivery Corporate Holiday Catering Other Links Menus Event Partners Gallery FAQs Contact Us Terms & Conditions Give us a Call or Email us Your Event Details! Talk to a Provisions Catering representative to plan your next event or answer any questions you have! Or please email us the details of your event and a Provisions representative will contact you within 24-48 business hours. (301) 984-4411 service@cateringbyprovisions.com © Provisions Catering, LLC. All rights reserved. | 4947 Wyaconda Rd, Rockville, MD 20852 | service@cateringbyprovisions.com"
    },
    {
      "url": "https://www.cateringbyprovisions.com/about-us/",
      "text": "Provisions Catering  | About Us Catering Full Service Food Delivery Holiday Catering Vegan Specialties Menus Vegan Specialties Event Partners Gallery About Us Testimonials FAQs Contact About Us Provisions Catering is an off-premise catering company that has been serving the Maryland, Virginia, and DC area since 2000. Owner, Bunny Dwin, has been working in the catering field for more than 30 years. Impeccable service, attention to detail, quality ingredients and beautiful presentations are the hallmarks of all our catered events. Our mission is simple: to serve delicious, high- quality food with fresh, seasonal ingredients. Our staff is made up of professional chefs, account executives, managers and wait-staff. We pride ourselves on attention to detail and personal service. Provisions Catering is equipped to handle the most intimate gatherings to large corporate events over 500 people. Provisions Catering has been featured by Washingtonian Magazine as one of the area’s top catering companies and was also featured in Bethesda Magazine’s Best of Bethesda Issue. In addition to full-service catering, Provisions offers food delivery service. If you are planning your own event, our extensive menu includes breakfasts, lunches, dinners, desserts and hors d’oeuvres which can be delivered right to your door. We service all of the Metropolitan Washington, DC area, but will consider further event locations on an event by event basis. Read what others write on their thank you notes! Testimonials You’ve got Questions? We have answers! FAQs Facebook Twitter LinkedIn Catering Full Service Food Delivery Corporate Holiday Catering Other Links Menus Event Partners Gallery FAQs Contact Us Terms & Conditions Give us a Call or Email us Your Event Details! Talk to a Provisions Catering representative to plan your next event or answer any questions you have! Or please email us the details of your event and a Provisions representative will contact you within 24-48 business hours. (301) 984-4411 service@cateringbyprovisions.com © Provisions Catering, LLC. All rights reserved. | 4947 Wyaconda Rd, Rockville, MD 20852 | service@cateringbyprovisions.com"
    },
    {
      "url": "https://www.cateringbyprovisions.com/",
      "text": "Provisions Catering Catering Full Service Food Delivery Holiday Catering Vegan Specialties Menus Vegan Specialties Event Partners Gallery About Us Testimonials FAQs Contact Our 2025 High Holidays Menu is Ready to View! Orders due by Thursday September 11, 2025. Due to supply and demand, we encourage you to order before the deadline. Click Here for Menu & Ordering Instructions Impeccable Service We provide quality professionals combined with elegant style. Attention to Detail It's the little things that set us apart from the competition. Quality Ingredients Our locally sourced and expertly crafted cuisine don't disappoint. About Provisions Catering Provisions Catering is an off-premise catering company that has been serving the Maryland, Virginia, and DC area since 2000. Owner, Bunny Dwin, has been working in the catering field for more than 30 years. Our mission is simple: to serve delicious, high- quality food with fresh, seasonal ingredients. Our staff is made up of professional chefs, account executives, managers and wait-staff. We pride ourselves on attention to detail and personal service. Take a Seat at Our Table Provisions Catering is equipped to handle the most intimate gatherings to large corporate events over 500 people. Provisions Catering has been featured by Washingtonian Magazine as one of the area’s top catering companies and was also featured in Bethesda Magazine’s Best of Bethesda Issue. Our Award Winning Menus Cocktail Party Hors D'oeuvres that will keep your guests enthused and entertained. View Menu Plated Dinner After tasteful Hors D'oeuvres sit back, relax and be amazed. View Menu Luncheon A lunch buffet with sweet endings that you won't forget. View Menu Try our new S’mores Torte! Buttery chocolate graham cracker cake baked with mini marshmallows and topped with marshmallow fluff and chocolate pieces *it can be made gluten free* Follow Along provisionscateringdc Beautiful night @nmwaspecialevents @augustinebove Our creative culinary team is working overtime to Playing with 👻 #halloweenmenu🎃 Wedding Bells 🔔 Summertime soirée 🌝🩵 Stay 🆒! Load More... Follow on Instagram Facebook Twitter LinkedIn Catering Full Service Food Delivery Corporate Holiday Catering Other Links Menus Event Partners Gallery FAQs Contact Us Terms & Conditions Give us a Call or Email us Your Event Details! Talk to a Provisions Catering representative to plan your next event or answer any questions you have! Or please email us the details of your event and a Provisions representative will contact you within 24-48 business hours. (301) 984-4411 service@cateringbyprovisions.com © Provisions Catering, LLC. All rights reserved. | 4947 Wyaconda Rd, Rockville, MD 20852 | service@cateringbyprovisions.com"
    },
    {
      "url": "https://www.paulsprovisionscatering.com/",
      "text": "Paul's Provisions facebook instagram 200 Mill St #842, Milesburg, PA 16853 (814) 571-3811 200 Mill St #842, Milesburg, PA 16853 (814) 571-3811 Navbar Toggle About Menus Events facebook instagram About Menus Events About Menus Events About Paul's Provisions is a full service boutique catering company bringing Chef Paul Madrid's Contemporary American Cuisine to the Centre County Region. Located conveniently in State College, PA , Paul's Provisions offers an extensive selection of catering services with customizable menus and market pricing. Paul's Provisions is currently on the Penn State Preferred Caterers list and can be reached directly to personally tailor any event. Paul Madrid Owner/Chef The son of a United States Marine Corps Officer, Paul Madrid spent his formative years moving around the country and the world.  However, he regards L.A. as his “hometown” where he fondly remembers family meals with both his Mexican and American grandparents and his mother's home cooking.  The fresh foods and family recipes are what he credits with sparking his passion and love of food. After his academic studies at Penn State, Paul pursued apprenticeships in the culinary world which took him to Washington, DC.  It was there that he joined up with fellow restaurateurs and opened Town Hall and Sixth Engine.  Both restaurants received many accolades for their cuisine and atmosphere, including a feature on \"G. Garvin’s Road Trip\" and showcased recipes in cookbooks including \"Mac & Cheese by Ellen Brown\" for Paul’s signature goat mac n’ cheese dish. After his success in Washington, DC, Paul and his wife moved back to State College to raise their two sons and daughter in the beautiful family-oriented environment of Happy Valley.  He continues to bring his national and international expertise, as well as his precision and professionalism to State College through his catering company Paul’s Provisions. James Lanning Service & Beverage Director James Lanning began his career in the Marine Corps, stationed overseas multiple times for combat and humanitarian relief efforts.   After several years, he transitioned to the position of USMC recruiter in Austin, TX. James quickly recognized his passion for the restaurant industry and began bouncing in local bars at night.  After 3 short years he became a restaurant manager and retired from the USMC. Following his passion, he attended the Veteran’s Program at Cornell University to earn a certificate in entrepreneurship.  Currently he is continuing his postsecondary education at Penn State University while also working as the Service and Beverage Director of Paul’s Provisions and being a stay-at-home-dad to two wonderful and rambunctious boys.  His long-term goals include raising two valuable members of society while also owning a donut shop that serves tacos, burgers, pizza and craft beer. Menus We like to work with each client individually to make sure your event is \"catered\" t o you. That means our menus are flexible to your theme, favorite cuisines, style, and budget. Please see the sample menus and items we have created for our valued clients in the past. We look forward to creating your special event . Weddings Hors d'Oeuvres & Appetizers Buffets Boxed Meals Sandwiches Menu Select Weddings Hors d'Oeuvres & Appetizers Buffets Boxed Meals Sandwiches Paul's Provisions 200 Mill St #842, Milesburg, PA 16853 (814) 571-3811 Weddings } Print/Download Appetizers Shrimp Cocktail Shot Braised Pork Belly with Pickled Vegetables Steak Skewer with Bleu Cheese Vinaigrette Crab Balls with Remoulade Fried Chicken and Waffle Skewer Salad Arugula, Cauliflower, Pistachios, Golden Raisins, & Honey Ginger Vinaigrette Entrees Braised Boneless Beef Short Rib, Smashed Potatoes, Roasted Carrots, & Red Wine Jus Honey Glazed Salmon, Quinoa Basmati Pilaf, Grilled Broccolini, & Nam Nam Sauce Pan Roasted Chicken Breast, Potato \"Mac\" n Cheese, Roasted Green Beans, & Dijon Pan Sauce Crab Cakes, Roasted Corn Maque Choux, Arugula, Orzo, & Mustard Creme Fraiche Hors d'Oeuvres & Appetizers } Print/Download Fried Chicken & Waffle Skewers with Bacon Syrup Crab Balls with Remoulade Caprese Skewers with Pesto Gremolata - VT Shrimp Cocktail Shots with Sriracha Sauce Crostini with Boursin, Roast Beef, & Onion Jam Herbed Goat Cheese & Pepper Jelly on Cracker - VT Chicken Pot Pie Spoon Zucchini Cake with Yogurt Dill Sauce - VT Ham & Melon Skewer with Spiced Honey Hush Puppies with Gochugaru Butter - VT Mini Crab Cakes with Mustard Creme Fraiche Mini Beef Patty Melts Aegean Skewer with Oregano Viniagrette - VG Ham & Cheese Beignet with Honey Mustard Honey Hot Chicken Slider with Pickles Buffets } Print/Download Please contact us for current options for buffets. Boxed Meals } Print/Download Sandwich Box Sandwich, Choice of Side, & Cookie Chicken Tender Box 2 Tenders & Choice of Side(s) Continental Breakfast Box Muffin, Fruit Cup, Bevita Bar, & Bottle of OJ Taco Box 2 Tacos, Beans, Rice, Salsa, Guacamole, & Chips Afternoon Snack Box Cookie, Power Bar, Almonds, & Smoothie Sandwiches } Print/Download Too many to list!! Vegan, Vegetarian, Gluten Free, Pescatarian, and anything else you can think of. Give us a call and we can make it amazing!! Events As the premier caterer in Happy Valley, Paul's Provisions will take your event to the next level with our custom menus, artful presentation, and polished service. Catering unique and specialized events is our specialty and we will take your vision and create a complete guest experience. We have brought multiple kinds of functions to life – Corporate Luncheons, Black Tie Dinners, French Garden Weddings, Over the Top Tailgates, Intimate Dinner Parties, Coffee Breaks, Dessert Receptions, & many many more. During our events we like to showcase the abundance of local farmers and producers that Centre County has to offer. From farm to table produce to humanely raised animals, Paul's Provisions works with local purveyors to bring the region's best ingredients to your event. Please use the Event Request tab below to make an inquiry or we can be reached at info@paulsprovisionscatering.com Event Request Call Us: 814 571 3811 facebook instagram × Close leave this field blank First Name Last Name Email An error occurred. Success! Thank you for signing up. Send Powered by BentoBox"
    },
    {
      "url": "https://www.rca.asn.au/contact-us",
      "text": "Contact Us Become a R&CA member today. Learn more. Membership Join Us Gift Card Index Policy & Advocacy Submissions What We Do Media Webinars Media Enquiry 2025 Awards 2025 Awards for Excellence Tickets 2025 Awards for Excellence Finalists & Winners 2025 Awards for Excellence Photos 2024 Awards for Excellence Finalist & Winners Lists Training R&CA Courses Gold Licence Wine Spirit Education Trust Courses Supplier Directory Our Partners Partner with Us About Our Board The Sector Contact Us R&CA Store Member Login Member Login Member Login Become a Member Join Now 2025 Awards for Excellence Tickets 2025 Awards for Excellence Finalists & Winners 2025 Awards for Excellence Photos 2024 Awards for Excellence Finalists & Winners Lists About Us Policy & Advocacy What We Do Submissions Media Webinars Media Enquiry Our Board Partners Partner with Us Supplier Directory Restaurant Gift Card Directory Contact Us Training R&CA Courses Gold Licence Wine Spirit Education Trust Courses Contact Us Drop Us A Line If you have a question or need assistance, contact us via the enquiry form. Our team will get in touch with you within 1-3 business days. Support & Questions Email: restncat@rca.asn.au Press & Media Email: policy@rca.asn.au LinkedIn: @restcatering #rca Grow & Tell Twitter Facebook Instagram PO Address PO Box 121, Surry Hills NSW 2010 The Voice of Hospitality. Copyright © 2025 Restaurant & Catering Industry Association of Australia Inc. (R&CA). IR Support Member Resources Member Benefits 2025 Awards for Excellence Apply for a Gold Licence Media Policy & Advocacy Supplier Directory R&CA Store Contact Us Privacy Policy"
    },
    {
      "url": "https://www.localprovisionsva.com/",
      "text": "Restaurant | Local Provisions | Sterling top of page Local Provisions RESERVATIONS ORDER PICKUP OR DELIVERY BUY E-GIFT CARD Dinner Menu Catering Lunch Menu Brunch CAREERS Contact/Hours Large Party Inquiry Talk to Stebner's Link to our WaPo Review 46286 Cranston Street Sterling VA 20165 created with Wix.com bottom of page"
    },
    {
      "url": "https://www.cateringbyprovisions.com/contact/",
      "text": "Provisions Catering  | Contact Catering Full Service Food Delivery Holiday Catering Vegan Specialties Menus Vegan Specialties Event Partners Gallery About Us Testimonials FAQs Contact Contact Our menus are custom designed for each and every event we cater; therefore, we cannot provide a proposal without speaking with you first. When you call to speak with an account representative, or email us, having much of the following information in mind will be most helpful: Date of event Time of event Number of guests Event location (museum, home, office, religious site, etc.) Type of event (birthday, bar or bat mitzvah, wedding, baby shower, bridal shower, luncheon, dinner party, etc.) Social or corporate event Indoor or outdoor event Kitchen availability for food preparation Budget expectations per person Desired food type (American, Asian, French, Fusion, etc.) Desired service type (full service or food delivery) Contact Information Telephone: (301) 984 4411 Address: 4947 Wyaconda Rd, Rockville, MD 20852 Email: service@cateringbyprovisions.com A Provisions representative will reply to your email within 24-48 business hours. Facebook Twitter LinkedIn Catering Full Service Food Delivery Corporate Holiday Catering Other Links Menus Event Partners Gallery FAQs Contact Us Terms & Conditions Give us a Call or Email us Your Event Details! Talk to a Provisions Catering representative to plan your next event or answer any questions you have! Or please email us the details of your event and a Provisions representative will contact you within 24-48 business hours. (301) 984-4411 service@cateringbyprovisions.com © Provisions Catering, LLC. All rights reserved. | 4947 Wyaconda Rd, Rockville, MD 20852 | service@cateringbyprovisions.com"
    },
    {
      "url": "http://yycpronto.com/contact",
      "text": "CONTACT | PRONTO - Pizza & Pasta | Italian Restaurant & Catering PRONTO PIZZA - PASTA - PAGNOTTA MENU CATERING CONTACT US ORDER HERE Get in touch SEND info@yycpronto.com /yycpronto /prontoyyc /@prontoyyc Gulf Canada Square 401 9th Ave, SW 587-429-9910 5TH & 5TH 605 5th Ave, SW 403-993-9093 Pronto Pizza-Pasta Restaurantji Hours of operation On-site: Monday to friday - 11 AM to 2 PM Catering: Monday to Saturday - 9 AM to 8 PM Reviews Copyright © 2025 - Pronto Pizza & Pasta | By Nicolas Fracchia"
    },
    {
      "url": "https://nolapicnic.com/",
      "text": "Picnic Provisions & Whiskey » NOLA Skip to content Skip to footer Picnic Provisions & Whiskey About Menu Catering Team Contact Order Online \\’pik-(,)nik\\ – 1. Derived from pique-nique in France in 1692, a jolly meal together in an idyllic spot (away from distractions and demands, often outdoors) a meal to which everyone contributes something and everyone is welcome; associated with card playing, drinking and conversation; evolved by New Orleanians into crawfish boils and Saints tailgating damn near anywhere; from poboys for 2 at The Fly to family reunions in City Park and elegant tented affairs on the banks of Bayou St. John; attended by people who have a strong affinity for gingham and are likely to “skinny dip at night. OUR MENU CHICKEN THIGH PLATES 2 piece & 1 biscuit | 15 5 piece & 2 biscuits | 33 CHOOSE YOUR BATTER Crawfish Boil Seasoned -or- Homestyle Served with milliton dill pickles, lemony miso mayo & Crystal's Pepper Pulp -OR- Honey Mustard WHITE MEAT TENDER PLATES 3 piece & 1 biscuit | 12 5 piece & 2 biscuits | 19 CHOOSE YOUR BATTER Crawfish Boil Seasoned -or- Homestyle Served with milliton dill pickles, lemony miso mayo & Crystal's Pepper Pulp - OR - Honey Mustard What the HECK is Crawfish Boil Fried Chicken? We're glad you asked. We're known for our crispy, craveable Crawfish Boil Fried Chicken. No, we don't boil our chicken like a seafood boil (but that's an idea!). No, there isn't any crawfish or any seafood. Just our proprietary process & Louisiana crawfish boil style seasoning with chicken fried to a golden brown. This chicken packs a punch of classic New Orleans flavor in a one-of-a-kind way! CRAWFISH BOIL FRIED CHICKEN SANDWICH mirliton dill pickles, lemony miso mayo & Crystal's Pepper Pulp 11 CRAWFISH BOIL FRIED CHICKEN BISCUIT pimento cheese, Noni's kitchen pepper jelly & Crystal's Pepper Pulp 11 A LA CARTE Thigh 5 Tender 2.50 NOT CHICKEN PICNIC SMASH BURGER two patties with melted white American cheese, lettuce, B&B pickles, lemony miso mayo & whiskey onions 11 THE PICNIC SALAD mixed greens, blue cheese, bacon, cherry tomatoes, crumbled egg, house-smoked onions, crunchy croutons & honey mustard vinaigrette Add a thigh or two tenders 5 13 SMOKED PULLED PORK tangy chow chow, crispy onions & white BBQ sauce 11 BLACKED TUNA SALAD sliced tuna, spring mix, sugarcane slaw, cherry tomatoes, jalapeños, crispy onions & sugarcane vinaigrette 15 SHARES BOUDIN EGG ROLLS choice of white BBQ sauce or pepper jelly vinaigrette 9 PIMENTO CHEESE HUSHPUPPIES with Pepper Jelly vinaigrette 9 SWEETGRASS PIMENTO CHEESE with housemade lavash crackers 9 SIDES CAJUN POTATO SALAD sweet corn, chopped egg topped with crushed jalapeño Zapp's & crumbled bacon 4 BUTTERMILK BISCUIT with warm salted butter \r\nask for a side of Steen's cane syrup 1 3 BLACK BEAN & CORN SALAD red onion, cilantro & chili salsa vinaigrette served chilled 4 SUGARCANE SLAW cabbage, carrots, Steen's molasses vinaigrette, cilantro, mint & basil 4 CRISPY FINGERLING POTATOES crawfish boiled, smashed & fried, with lemony miso mayo 5 LIGHT SALAD mixed greens, slaw, cherry tomatoes, crispy onions, cane vinaigrette 4 CRINKLE CUT FRIES seasoned & served with miso mayo 4 THE SWEET LIFE CAMPFIRE S'MORES house-made brownie, caramel, chocolate crumble, graham crackers & marshmallow - toasted table side 8 PECAN BLONDIE house-made with caramelized pecans 3 CLASSIC BROWNIE house-made chocolate brownie 3 YOU MAKE ME SO HAPPY HOUR Tuesday - Friday 2 pm - 6 pm CHICKEN & CHAMPAGNE crawfish boiled nugget basket with fries & a split bottle of bubbly 10 COCKTAIL Picnic Old-Fashioned vodka gimlet whiskey ginger 6 BUBBLES Francois Montand Blanc de Blancs Le Grand Courtage Sparkling Brut Rose 5 BEER Michelob Ultra Urban South Paradise Park 2 SNACKY THINGS Sweetgrass Pimento Cheese Crawfish Boiled Nugget Basket & Fries 6 ORDER ONLINE CATERING Where y’at? We’ll bring the Picnic to your krewe. Contact us for catering options today! We also offer full or partial venue rentals for parties, rehearsal dinners, birthdays, corporate events and more. For questions, give us a call at (504) 266-2810 CATERING MENU MEET OUR TEAM TI MARTIN owner & co-founder LEARN MORE TI MARTIN owner & co-founder Restaurateur, entrepreneur, author and sought-after speaker, Ti Adelaide Martin is an outspoken champion for true hospitality in business, for her city and for the many causes she devotes herself to. Ti and her cousin Lally Brennan lead The Commander's Family of Restaurants that includes Commander’s Palace and SoBou in New Orleans, as well as Brennan’s of Houston. Ti also serves as Board Chair and Co-Founder for the New Orleans Culinary & Hospitality Institute (NOCHI). In 2016 she released a book and produced a documentary film about her mother. Commanding the Table: The Ella Brennan Story can be found on Netflix. CLOSE DARRYL REGINELLI owner & co-founder LEARN MORE DARRYL REGINELLI owner & co-founder Darryl Reginelli co-founded one of New Orleans’ most popular pizzerias 20 years ago, with 9 locations. Because Darryl has a background in fine dining, Reginelli’s Pizzeria is known for showcasing premium ingredients and respecting classical traditions. But with the founder’s penchant for fun, Darryl’s menus also exhibit a creative use of Louisiana ingredients. He has learned over the years how important it is for a restaurant to build an emotional connection to its neighborhood. CLOSE MONICA MUMPHREY general manager LEARN MORE MONICA MUMPHREY general manager Monica joined the Picnic Provisions & Whiskey team in 2020 after a successful career at Reginelli's Pizzeria. CLOSE When the three founders of Picnic Provisions & Whiskey set out to celebrate the joyful American picnic, they sprinkled it with the culinary magic of New Orleans. The team at Picnic Provisions & Whiskey is inspired by the five powerful words painted on the dining room wall: Picnic . This is the essence of our culinary and hospitality philosophy. Share . Without sharing, any meal—whether it be a picnic or elaborate tasting menu—is less memorable. Laugh . Life can be serious, and some restaurants take their food too seriously, but a meal without laughter is a missed opportunity. Yummy . Need we say more? Purpose . Purpose fuels one’s soul, and the hospitality we provide our guests is our purpose in life. WANT TO JOIN OUR TEAM? Apply using the form below. Questions? Contact Monica@nolapicnic.com Order Number First Name * Last Name * Email Address * Contact Number * Upload Resume (optional) Add Files Please upload your resume in PDF format. Tell us about your previous work experience. * What's your availability? How many hours per week are you interested in working? * Anything else you want to share? Fetching directions...... Reset directions Print directions CONTACT US 741 State Street New Orleans, LA 70118 (504) 266-2810 Sun., Tues – Thurs: 11 AM – 9 PM Fri – Sat: 11 AM – 10 PM Closed Mondays, y’all! Email Name Email Subject Message contact monica@nolapicnic.com careers and development monica@nolapicnic.com Picnic accessibility statement Picnic Provisions & Whiskey is committed to accessibility. It is our policy to ensure that everyone, including persons with disabilities, has full and equal access to our digital offerings. Conformance NolaPicnic.com strives to confirm to WCAG (Web Content Accessibility Guidelines) 2.1 Level AA. We are fully committed to monitoring our site to maintain this level of compliance. Distribution NolaPicnic.com distributes this policy to all personnel who work with web content including writers, editors, designers, and developers. Third party vendors We encourage our third-party vendors… online order and delivery providers, reservations and event management, social media and review sites, Google Maps, etc. to ensure any content or widgets used on the site is accessible and user-friendly since we cannot control the accessibility of the content they provide for our website. Feedback We welcome your feedback on your accessibility experience with the Picnic Provisions & Whiskey website. Email us if you have any questions or comments at this address: heidi@nolapicnic.com . We will respond to all feedback. Assistance If you need any assistance, please call us at … during our regular business hours and we will be happy to help you with anything on our site. copyright 2025 PICNIC PROVISIONS & WHISKEY designed by Wagstaff Digital About Menu Catering Team Contact Order Online"
    },
    {
      "url": "https://robertsonstavistock.co.uk/contact-us/",
      "text": "Contact Us | Get in Touch | Robertson's Restaurant Tavistock Home About Restaurant Takeaway Reviews Gallery Contact Us Call Now    Restaurant Menu Contact Us Contact Us Get in touch with us to book a table or order a takeaway Restaurant Takeaway Robertson’s Restaurant Get in Touch To book a table in our restaurant, please contact us by phone . We advise pre-booking in the evenings to avoid disappointment. If you’d like to enquire about our catering services, booking an event with us or want to know more about delivery to your workplace, you can reach us by phone or through the contact form below. If you would like to book a table or place an order, please call us Contact Details  01822 612117  tavistockpizza@yahoo.com  Mon-Sat: 12pm-9pm Sunday: 5pm-9pm Delivery: 5pm-9pm  4-8 Pepper St Tavistock PL19 0BD Follow Follow Robertson’s Restaurant in Tavistock is a fully licensed pizzeria, offering dine-in options, takeaway collection and pizza delivery services. Follow Follow Our Menus Restaurant Lunch Restaurant Evening Takeaway Lunch Takeaway Evening Our Specials Contact Us  01822 612117 } Mon-Sat: 12pm-9pm Sun: 5pm-9pm Delivery: 5pm-9pm  4-8 Pepper St Tavistock PL19 0BD Find Us Copyright Robertson’s Tavistock LLP © 2022 – All Rights Reserved. Registered in England and Wales | Company No: OC382297 Cookie Policy | Privacy Policy | Website Terms of Use Powered by DevonWebs We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok Privacy policy"
    }
  ]
}