{
  "fuentes": [
    {
      "url": "https://www.partyslate.com/venues/pub-52-gastro-kitchen-restaurant",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://communitynewspapers.com/south-miami-news/pub-52-in-south-miami-combines-entertainment-with-great-food-and-drink/",
      "email": "advertising@communitynewspapers.com"
    }
  ],
  "mails": [
    "advertising@communitynewspapers.com",
    "contact@partyslate.com"
  ],
  "nombre_sitio": "pub52.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.partyslate.com/venues/pub-52-gastro-kitchen-restaurant",
      "text": "Pub 52 Gastro + Kitchen Restaurant | South Miami Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Pub 52 Gastro + Kitchen Restaurant Find Venues / Florida / South Miami / Pub 52 Gastro + Kitchen Restaurant Unclaimed Pub 52 Gastro + Kitchen Restaurant 5829 SW 73rd St, South Miami, FL 33143, USA Request info Favorite Owner hasn't claimed this business If you own this business, claim your profile to update information, add photos, and more. Claim Profile Overview Gallery 1 About Pub 52 Gastro + Kitchen Restaurant Located in the heart of South Miami, Pub 52 Gastro + Kitchen is a great place for happy hour drinks, watching the big games, playing a game of pool or grabbing a bite with friends and family. With an array of hand-muddled cocktails, welcoming food & entertainment, we are the local hangout with the best weekly lineups with Karaoke Tuesdays, Ladies Night out Wednesdays, Live Bands Friday & Saturday, Brunch, and more!\n\nPicture the perfect local bar and Pub 52 Gastro + Kitchen instantly comes to mind. After all, it’s where all your friends and neighbors are going these days from South Miami, Coral Gables, Pinecrest, Kendall, and the Grove. The prices are right, staff is friendly, the vibe is easy, and the food is absolutely unmatched. There’s really something for everyone there. And something is happening just about every night of the week.\n\nPub 52 is also the local go-to venue for sensational social and corporate events. The professional and friendly crew at Pub 52 stand ready to host small to large scale functions like birthday parties, anniversaries, business meetings, large sport celebrations, corporate events & more. They provide a great experience and value for you and your guests, featuring a variety of options. Pricing Packages Pub 52 Gastro + Kitchen Restaurant hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote FAQs 2 What is the venue capacity? Pub 52's maximum capacity is 325 guests What is the best way to contact this venue? Please contact us today using the form on our website or by calling us at 786.500.0205 to book your next event. Map 5829 SW 73rd St, South Miami, FL 33143, USA Follow Us Visit Website Call If you own this business, claim your profile to update information, add photos, and more. Claim Profile Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://communitynewspapers.com/south-miami-news/pub-52-in-south-miami-combines-entertainment-with-great-food-and-drink/",
      "text": "PUB 52 in South Miami Combines Entertainment with Great Food and Drink | South Miami Community News# Sign in Publications Aventura Biscayne Bay Broward Community Newspapers Coral Gables Cutler Bay Doral Fort Lauderdale Kendall Miami-Dade Miami Beach Miami Gardens Miramar North Miami North Miami Beach Palmetto Bay Pinecrest South Dade South Miami Sunny Isles West Park Broward County Miami Community Newspaper Sponsored Content CNEWS TV CNEWS TV Media Kit Grant Miller Michael Miller Susan Miller Gloria Burns Oscar Musibay Willard Shepard Fara Sax Wilson Alvarez Categories Miami Cannabis News Automotive Car Reviews FIU Miami-Dade Community News Sports News Miami Community Newspaper Sponsored Content Newspaper Past Editions Aventura Biscayne Bay Broward Coral Gables Cutler Bay Doral Kendall Miami Beach Miami Gardens Miramar News Palmetto Bay Pinecrest South Miami Sunny Isles West Park Events Submit Event Community Events Photo Gallery Latin Builders Association Community News Legal Notices Place Legal Notices Broward County Legal Notices Miami-Dade County Legal Notices City Legal Notices City of Coral Gables City of Hialeah City of Homestead City of North Miami City of Sweetwater City of West Miami Miami-Dade College Town of Cutler Bay Town of Miami Lakes Village of Biscayne Park Village of Palmetto Bay Village of Pinecrest Inspire Health Articles Past Issues Contact About Us Contact Us Legal Notices Submit Press Release E-Newsletters Subscribe Miami-Dade Email Newsletters Broward County Email Newsletter Aventura Email Newsletter Biscayne Bay Tribune Email Newsletter Coral Gables Email Newsletter Cutler Bay Email Newsletter Doral Email Newsletter Kendall Email Newsletter Miami Beach Email Newsletter Palmetto Bay Email Newsletters Pinecrest Email Newsletter South Miami Email Newsletter Sunny Isles Email Newsletter West Park Email Newsletters Inspire Health Email Newsletter Chamber Spotlight Email Newsletter Subscribe Sign in Welcome! Log into your account your username your password Forgot your password? Password recovery Recover your password your email Search Ads: 305.669.7355 Legal Notices: 305.669.7031 Office: 305.669.7030 Facebook Instagram Linkedin Twitter Youtube Advertise  305.669.7355 Media Kit Pay Online Contact Advertise 305.669.7355 Legal Notices 305.669.7031 Office 305.669.7030 Request Info Submit a Press Release Legal Notices 305.669.7031 Events Submit Event View all Events Special Sections Reviews Facebook Instagram Linkedin Twitter Youtube Publications Aventura Biscayne Bay Broward Community Newspapers Coral Gables Cutler Bay Doral Fort Lauderdale Kendall Miami-Dade Miami Beach Miami Gardens Miramar North Miami North Miami Beach Palmetto Bay Pinecrest South Dade South Miami Sunny Isles West Park Broward County Miami Community Newspaper Sponsored Content CNEWS TV CNEWS TV Media Kit Grant Miller Michael Miller Susan Miller Gloria Burns Oscar Musibay Willard Shepard Fara Sax Wilson Alvarez Categories Miami Cannabis News Automotive Car Reviews FIU Miami-Dade Community News Sports News Miami Community Newspaper Sponsored Content Newspaper Past Editions Aventura Biscayne Bay Broward Coral Gables Cutler Bay Doral Kendall Miami Beach Miami Gardens Miramar News Palmetto Bay Pinecrest South Miami Sunny Isles West Park Events Submit Event Community Events Photo Gallery Latin Builders Association Community News Legal Notices Place Legal Notices Broward County Legal Notices Miami-Dade County Legal Notices City Legal Notices City of Coral Gables City of Hialeah City of Homestead City of North Miami City of Sweetwater City of West Miami Miami-Dade College Town of Cutler Bay Town of Miami Lakes Village of Biscayne Park Village of Palmetto Bay Village of Pinecrest Inspire Health Articles Past Issues Contact About Us Contact Us Legal Notices Submit Press Release E-Newsletters Subscribe Miami-Dade Email Newsletters Broward County Email Newsletter Aventura Email Newsletter Biscayne Bay Tribune Email Newsletter Coral Gables Email Newsletter Cutler Bay Email Newsletter Doral Email Newsletter Kendall Email Newsletter Miami Beach Email Newsletter Palmetto Bay Email Newsletters Pinecrest Email Newsletter South Miami Email Newsletter Sunny Isles Email Newsletter West Park Email Newsletters Inspire Health Email Newsletter Chamber Spotlight Email Newsletter Subscribe More Search Home South Miami Community News PUB 52 in South Miami Combines Entertainment with Great Food and Drink South Miami Community News PUB 52 in South Miami Combines Entertainment with Great Food and Drink By Christopher Pearson - September 14, 2018 Facebook Twitter Pinterest WhatsApp Miami-Dade native Becky Jaime beams as her gaze sweeps across the packed dining room of Pub 52 Gastro + Kitchen, South Miami’s new high-end gastropub. “Pub 52 is so much more than a restaurant…it’s a destination where local people can enjoy great food, socialize, dance and spend the entire afternoon or evening with family and friends,” explained Becky, the gastropub’s Director of Operations. “We’ve got something for everyone — co-workers coming for happy hour, families with children having dinner and friends out for a night” Rajiv Pandey, president of the Kanti Group Inc., a local hotel and restaurant company that owns the gastropub and other venues, says South Miami needed a place where neighborhood residents could dine and play in the same place. Pub 52 is the answer. The scratch kitchen, where everything is prepared fresh and by hand, serves up a wide selection of delicious fare ranging from the sig- nature #52 burger to Asian fusion-inspired miso salmon to fall-off-the-bone St. Louis ribs. And Pub 52’s chicken wings are unsurpassed, with more than ten house- made sauces from to choose. Once your palate has been satisfied, there is plenty of fun to be had at Pub 52. Live bands take the stage on Friday and Saturday nights and Wednes- day night is Ladies’ Night, complemented by a nine-foot screen. The bar is the longest in South Miami and known for its signature cocktails, 30 locally brewed beer taps and the area’s widest se- lection of bourbons. Happy Hour is Monday through Friday, 4-7 p.m. Sports fans can watch and follow all the games on more than 30 televi- sions, viewable in every direction. And there is al- ways action around the pool table and dance floor. Pub 52 is open daily for lunch and dinner and will soon offer brunch on Sundays and seasonal lunch specials. The spacious gastropub can accommo- date social and corporate gatherings as well as cater offsite events. Pub 52 is located at 5829 SW 73 Street in the heart of South Miami. For more information, visit www.pub52.com or call 786-500-0205. Connect To Your Customers & Grow Your Business Click Here Christopher Pearson Facebook Twitter Pinterest WhatsApp Previous article Florida Ethan Pribramsky Selected for  2018 POWER SHOWCASE World Classic Next article Social Group for All Seasons Christopher Pearson RELATED ARTICLES MORE FROM AUTHOR LaJamaTV Review: Between 2 Buns Finds Its Home in Kendall 35 Mules Welcomes Fourth Cohort of Startups Drivers Showcase High-Performance Cars for Charity Providing Blind Students Unique Experience Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. - Advertisement - Advertise  305.669.7355 Media Kit Pay Online Contact Legal Notices 305.669.7031 Events Special Sections Reviews Advertise Promote your business to the localized audience you want to reach with Miami's Community Newspapers.  Call 305.669.7355 or view our Media Kit. Company Request Information Case Study Media Kit Newsletter Advertising Social Media Advertising Video Podcasts Events Advertising Terms and Conditions Terms & Conditions Privacy Policy Cookie Policy Editorial Policy About Us ADA Compliance Policy Latest Miami News Grant Miller here at Greater Miami Chamber of Commerce Nonprofit NOVO Awards CNEWS TV September 10, 2025 0 Grant Miller here at Greater Miami Chamber of Commerce... Grant Miller here at the Ronald McDonald House Groundbreaking Ceremony for “Hope Has a New Home!” CNEWS TV September 10, 2025 0 Grant Miller here at the Ronald McDonald House Groundbreaking... Grant Miller Meets with Monica Matteo-Salinas for Miami Beach Commissioner, Group 1 CNEWS TV September 10, 2025 0 Grant Miller Meets with Monica Matteo-Salinas for Miami Beach... Follow us Facebook Instagram Linkedin Mail Twitter Youtube © 2023 Miami's Community Newspapers a Miller Publishing Company. 6796 SW 62nd Avenue South Miami, Florida 33143 (305) 669-7030"
    }
  ]
}