{
  "fuentes": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "email": "enquiries@displaysuk.co.uk"
    },
    {
      "url": "https://www.tavareschamber.com/list/member/puddle-jumpers-lakeside-grill-5182",
      "email": "director@tavareschamber.com"
    }
  ],
  "mails": [
    "director@tavareschamber.com",
    "enquiries@displaysuk.co.uk"
  ],
  "nombre_sitio": "puddlejumpersfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "text": "Staff Photo Boards For Schools & Business This site is best viewed with javascript enabled. For help enabling javascript please click here . search close Search Quote ( 0 ) Checkout 0 item s £ 0.00 Home Products Exhibition Stands Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays See all Outdoor Displays Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers See all Display Cases Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases See all Exhibition & Display Boards for Hire or Rent Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire See all Leaflet, Brochure, Menu & Card Holders Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders See all Banner Stands Pull Up Roller Banners Double Sided Pull Up Banner Stands Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays See all Counters & Plinths Portable Counters & Workstations Promotion / Demonstration Counters Lectern Test Category Pedestals See all Noticeboards & Whiteboards Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards See all Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Lightboxes Dibond Signs See all Display Boards Folding Display Boards Folding Screen Room Dividers Panel and Pole Display Boards Display Board Accessories See all Specialist Displays Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture See all Perspex Cut To Size Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size See all About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Quote ( 0 ) 50,000+ products in stock 1,000 stock product lines with over 50,000 products in stock Custom made displays Rapid delivery on custom made Perspex acrylic displays Next day delivery Next day delivery on many products if ordered by mid day UK Manufacturer Many of our products are made in our own UK factory Cutting edge technology Experts in printed acrylic panels - any size, any shape menu close Products Exhibition Stands Back All Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays Extra Wide & Linked Banner Stands Outdoor Displays Back All Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers Outdoor Display Counters Outdoor Custom Printed Chairs Display Cases Back All Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Glass Display Cases Bespoke Acrylic Display Cases Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases Exhibition & Display Boards for Hire or Rent Back All Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire Exhibition Counters for Hire Banner Stands for Hire Leaflet, Brochure, Menu & Card Holders Back All Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders Rotating Brochure Holders Greeting Card Displays Business Card Holders Banner Stands Back All Pull Up Roller Banners Double Sided Pull Up Banner Stands Replaceable Cassette Roller Banners Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays Banner Stand Accessories Tension Banner Stands Counters & Plinths Back All Portable Counters & Workstations Promotion / Demonstration Counters Lectern Media Cabinets Test Test category for acrylic pedestals Test Category Pedestals Noticeboards & Whiteboards Back All Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards Freestanding / Mobile Noticeboards Whiteboards Glass Noticeboards Flipcharts & Easles Outdoor Noticeboards Acrylic Noticeboards Pinnable Noticeboards Write On Glassboards Signage & Perspex Frames Back All Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Staff Photo Boards Lightboxes Dibond Signs Printed Foamex Signs Site Safety Signs Snap Frames Sign Fittings & Accessories Hoarding Panels Acrylic Awards and Trophies Acrylic Noticeboards Printed Correx Signs Retail & Point Of Sale Printed Plywood and Wood Display Boards Back All Folding Display Boards Folding Screen Room Dividers Aluminium & Graphic Folding Display Boards Panel and Pole Display Boards Office Screens Display Board Accessories Specialist Displays Back All Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture Educational Furniture & Displays Social Distancing Screens Printed Outdoor Garden Art Garden Mirrors, Outdoor Mirrors & Illusion Mirrors Acrylic Photo Prints Shed, Playhouse, Greenhouse Windows Eco Lawn Edging From Recycled Plastic Decorative Garden Wall Panels Garden Structures, Gazebos, Arbours & Swings Garden Ornaments & Planters Acrylic Photo Prints Perspex Acrylic Splashbacks Perspex Cut To Size Back All Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size Perspex Acrylic Grey 9981 Cut To Size Perspex Acrylic Yellow 260 Cut To Size Perspex Acrylic Red 4415 Cut To Size Perspex Acrylic Orange 363 Cut To Size Perspex Acrylic Red 431 Cut To Size Perspex Acrylic Red 433 Cut To Size Perspex Acrylic Violet 886 Cut To Size Perspex Acrylic Green 6T81 Cut To Size Perspex Acrylic Green 650 Cut To Size Perspex Acrylic Blue 727 Cut To Size Perspex Acrylic Blue 750 Cut To Size Perspex Acrylic Blue 744 Cut To Size Perspex Acrylic Clear Frost S2 000 Perspex Acrylic Glass Look 6T21 Cut To Size Perspex Acrylic Silver Mirror Perspex Acrylic Blue Mirror 2069 Perspex Acrylic Purple Mirror 102 About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Home Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Staff Photo Boards For Schools & Business Staff Photo Boards For Schools & Business £ 36.30 ex. VAT £ inc.VAT Options Colour: Black Back Panel White Back Panel Clear Back Panel Clear Frost Back Panel Coloured Back Panel 2: 2: Qty Add to basket Get a quote Staff Photo Notice Boards - Perspex Acrylic Staff photo notice boards, or \"Meet The Team\" boards are a perfect way of letting people know who's who in a school, NHS Wards, general office and commercial workplace, recreation centres, reception areas, etc. Each clear pocket allows a small photo of a relevent member of staff. Options available include: choice of back acrylic colour, the number of photo pockets. We also offer a secure, tamper proof version, please click here for further details. NEW! We can now offer staff boards with your name and logo printed directlty to the top of the display - call for details. Features and Benefits: Please double click on the above images of our acrylic staff photo boards to zoom into a more detailed view Staff photo boards provide a professioal looking wall mounted display panel for quick reference of staff / team members Choice of black, white, clear or clear frost 5mm thick acrylic back panel with polished edges. Corners are rounded with no sharp edges Clear acrylic photo pockets allow staff photos to be changed quickly and easily Supplied with 4 polished sign fittings to give that floating effect off a wall Each photo pocket size is 75mm high x 50mm wide Header panel pocket is 260mm wide x 50mm high Please see the table below for our standard sized staff photo boards. We also manufacture custom sized boards if you require different sized pockets or different quantities of pockets - please call us on 01202 480104 for further details. Staff photo board prices are detailed in the drop down menu at the top of the page. Manufactured to order in our factory in Christchurch, Dorset, UK. Please allow 5 working days for delivery Please see our stand off fittings instructions by clicking here Looking for a a more secure staff photo board which can't be tampered with? Check out our Secure Staff Photo Boards ! Looking for a staff photo board with a different coloured back panel? We have a range of colours available other than our standard colours listed! Please contact us for a quote. Looking for a staff photo board with bespoke printing and branding to suit your business? With state of the art printers, we are able to fully print or brand these staff boards with your logos and messages! If this is something you are interested in, contact us for a quote! Code Photo Pockets Frame Size Width x Height (mm) SB10 10 430mm x 325mm SB20 20 430mm x 515mm SB30 30 500mm x 610mm SB40 40 640mm x 610mm SB50 50 780mm x 610mm SB60 60 780mm x 705mm SB65 65 800mm x 740mm SB70 70 780mm x 800mm SB80 80 780mm x 895mm SB100 100 780mm x 1085mm SB120 120 920mm x 1085mm SB140 140 1060mm x 1085mm SB160 160 1200mm x 1090mm Displays UK provide daily deliveries to most towns and cities in the UK including: Christchurch, Poole, Bournemouth, Swanage, Dorchester, Ferndown, Shaftesbury Sherborne Sturminster Newton Swanage Weymouth Ringwood New Forest Fordingbridge Salisbury Thank you for visiting our website Product Code: 64674569876345 Specification Code 64674569876345 Style Staff Photo Board Location Wall Mounted Weight 10.000 Kg Secured by sagePay Pay with PayPal Pay with Mastercard Pay with Visa × Items Quick basket Newsletter Signup Submit Exhibition Stands Outdoor Displays Display Cases Exhibition & Display Boards for Hire or Rent Leaflet, Brochure, Menu & Card Holders Banner Stands Counters & Plinths Noticeboards & Whiteboards Signage & Perspex Frames Display Boards Specialist Displays Perspex Cut To Size Displays (UK) Limited Displays UK are located in Christchurch, on the Hampshire / Dorset border. We are a proper 'bricks and mortar' manufacturing business not just another internet retailer. Read more… Head Office Units 16-18, 12 Airfield Road, Off Airfield Way, Christchurch, Dorset, BH23 3TG Tel: 01202 480104 Email: [email protected] Connect with us DISQ Display Innovation Service Quality Displays (UK) Limited registered in England and Wales with company number 8896740 and registered address Bank Court, Manor Road, Verwood, Dorset, BH31 6DY. VAT number GB980855382 © Displays (UK) Limited 2025 / Website by Adido / Terms & Conditions / Privacy / Sitemap"
    },
    {
      "url": "https://www.tavareschamber.com/list/member/puddle-jumpers-lakeside-grill-5182",
      "text": "Puddle Jumpers Lakeside Grill | RESTAURANT - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Puddle Jumpers Lakeside Grill Categories RESTAURANT 111 West Ruby Street Tavares FL 32778 (352) 508-5862 PuddleJumpersLakeside.com#http://PuddleJumpersLakeside.com# About Us Casual lakeside dining at its finest.  Our primary goal is to offer our patrons a warm, welcoming atmosphere accompanied with personable and attentive service that highlights our extreme care for the food and drinks we serve. We have a fully stocked bar, fresh seafood and delicious traditional fares. Our friendly staff will ensure you have a great time! Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    }
  ]
}