{
  "query": "pusserspvb.com staff",
  "fuentes": [
    {
      "url": "https://pussers.com/pages/contact-us",
      "email": "customer-relations@pussers.com"
    },
    {
      "url": "https://pvhs.pvpusd.net/apps/staff/",
      "email": "c5f61698de794c77b320c0c92e8a80c6@pvpusd.net"
    },
    {
      "url": "https://pvhs.pvpusd.net/apps/pages/index.jsp?uREC_ID=458155&type=d&pREC_ID=staff",
      "email": "c5f61698de794c77b320c0c92e8a80c6@pvpusd.net"
    }
  ],
  "mails": [
    "c5f61698de794c77b320c0c92e8a80c6@pvpusd.net",
    "customer-relations@pussers.com"
  ],
  "nombre_sitio": "pusserspvb.com",
  "origen_extraccion": "Busqueda externa paso: staff",
  "textos_fuente": [
    {
      "url": "https://pussers.com/pages/contact-us",
      "text": "Contact Us\n – Pusser's British West Indies Skip to content Home 2025 Apparel/Accessory Poll Track My Order About Pusser's Contact Us BVI Restaurant Take-Out Pusser's British West Indies Home 2025 Apparel/Accessory Poll Track My Order About Pusser's Contact Us BVI Restaurant Take-Out More Account Other sign in options Sign in Orders Profile Account Other sign in options Sign in Orders Profile Total items in cart: 0 0 Your cart is empty Have an account? Log in to check out faster. Continue shopping Contact Us For all questions and inquiries about your order please email us at: customer-relations@pussers.com Please fill out the form below and a company representative will respond to you, typically within 24 hours. Name Email * Phone Comment Submit Footer menu 2025 Apparel/Accessory Poll Track My Order About Us Contact Us BVI Restaurant Take-Out © 2025 Pusser's British West Indies , Powered by Shopify Privacy policy Search Clear No products found. View all"
    },
    {
      "url": "https://pvhs.pvpusd.net/apps/staff/",
      "text": "Staff Directory | Palos Verdes High School Skip to main content Mobile Menu Academics Advanced Placement AP Capstone Summer Assignments Mission & Schoolwide Learning Outcomes CAASPP Information 2023 CAST Testing Activities Clearance AVID Competition Teams Course Handbook CSF Departments Dual Enrollment Honor Societies Library NHS PEIS PVIT Seal of Biliteracy Seal of Civic Engagement WASC Work Experience Arts Art History Ceramics Dance Digital Animation Drama Department Drawing & Painting Glass Blowing Music Department Photography Surfboard Shaping Live From 205 Open Orchard The Point The Triton Yearbook Tradewinds: Magazine Athletics Athletic Director's Message Sports News Athletic Data Athletic Clearance Process Athletics Handbook Complaint Procedures Concussion Awareness and Protocols CIF NCAA Eligibility NCAA & The College Bound Athlete PVHS Eligibility Participation Donations Sports Supplemental Insurance Info Activities Senior Activities: Class of 2026 Homecoming ASB ASB Forms Be the Change Clubs Human Rights Coalition FAQs About Life at PVHS Link Crew Principal's Advisory Council (PAC) Scholar Quiz Winter Formal Calendar 2025-2026 Official Student Calendar A/B Calendar Online A/B Calendar Activities Calendar Athletics Calendar Bell Schedules Classes Academic Departments College & Career Welcome to the PVHS College & Career Center COLLEGE ADMISSION COUNSELORS: Schedule your Visit with PVHS Sea Kings! MaiaLearning Schedule Appointment with Mrs. Lewis Student Athletes and NCAA RESOURCES for PARENTS & STUDENTS COMMUNITY COLLEGE RESOURCES! FINANCIAL AID & SCHOLARSHIP INFORMATION Researching Colleges + Building Your List College Admission Tests College Applications - Applying to College 9th Grade College Planning: Freshman 10th Grade College Planning: Sophomore 11th Grade College Planning: Junior 12th Grade College Planning: Senior College Admissions & Matriculation Counseling Counseling Department School Counselors Wellness Center (SAGE Therapists) Graduation Requirements Course Pathways Course Selection Out-of-District Courses Transcript Requests Seniors Juniors Sophomores Freshmen Incoming Freshmen MaiaLearning NCAA / NAIA Parents/Guardians Calendar of Events Resources Forms School Info Online Incident Reporting Form Alumni Attendance Bell Schedules Complaint Procedures Daily Bulletin Enrollment Health Office Homeless and Foster Youth Lookbook Maps & Directions Open House Videos Parent-Student Handbook Parking Photos PVHS Programs and Pathways Physical Exam Report Form Sea King Sunday Update PTSA School Accountability Report Card School Plan (SPSA) School Profile School Safety Plan School Site Council Sea King Seminar Lessons Student Store - UNDER CONSTRUCTION! COVID-19 Protocols Videos 2023-2024 Staff Links for Staff Staff | School Directory Staff | Counselors Trista Ramirez | Principal D.J. Hill I Associate Principal Kirk Takeyama | Associate Principal Brian Shapiro | Athletic Director Jama Maxfield | Activities Director Wellness PVPUSD Families Connected Alumni Alumni Alumni Highlights School Info Bond Measure CEEB Code: 052358 PVPUSD Search Instagram YouTube Twitter WeTip | Login Staff Search for people on this page School Administrators D.J. Hill Associate Principal x 43204 Jama Maxfield ASB Director x 43601 Trista Ramirez Principal Brian Shapiro Athletic Director x 43205 Kirk Takeyama Associate Principal x43252 Teachers Lauren Alimento Marine Biology Teacher x43612 Kristin Anderson Speech & Language Pathologist x 43292 Tecia Barton x 43708 Jeffrey Beaucar Teacher x43224 Hasmine Belmonte Special Education Teacher x 43627 Marisa Blachy Long Term Substitute (Spanish) x43244 Kelley Black-Zagala Special Education Teacher x43628 Will Boss Substitute (Salgado) / Freshman Football Coach Brian Bowles Social Studies Teacher x43607 Ashley Brockman Teacher Librarian x43234 Alex Broughton Math Teacher, Track & Field/Cross Country Coach x 43610 Amy Byrne x 43630 Gina Calescibetta x 43712 Emily Chen Math Teacher x43704 Laura Cortes Math Teacher x43606 Cynthia Damon Teacher x 43516 Anna Driver Teacher x43379 Leith Emery x43706 Britney Ewing Dance Teacher x43387 Jennifer Fleming Chemistry Teacher Ext 43227 Colm Gallagher Teacher 310-378-8471 ext 43706 Guy Gardner x 43625 Josh Genaur Math Teacher x43250 Melanie Gerling x 43629 Gabriella Gorven English Teacher x43615 Louis Harley x43611 Nathalie Hodjat Special Education Teacher x43719 Ashley Hughes Teacher x43228 Megan Jarrin Chemistry & Earth Science Teacher 310-378-8471 Ext: 43717 Matthew Jaurequi 43233 Rebecca Jessop Special Education Teacher x43223 Kristy Jimenez Photography & Animation Instructor. VAPA & PE Department Lead x 43231 Jennifer Kim Mathematics Teacher, Engineering Department Lead, PVIT x43514 Jihyun Kim Korean Teacher x43605 Allyson Klabe Special Education Lead x 43616 K. Kostrencich 310) 791-2931 x 43715 Marie Kuhn Science Teacher x 43613 Young Min Kwak Teacher x43716 Gailene Lancey World Language Teacher (Spanish) (310) 378-8471 x43702 Derek Larkins Center Back/Right Field x 43617 Lea Lewis English Department Chair & Teacher x 43623 Patrick Lynch x 43709 Kristin Lyons English Teacher x 43510 Julie Maemoto Science Teacher x 43614 Jackie Merida Special Education x43622 Paige Metcalfe x43701 Cynthia Mindicino English teacher, newspaper advisor x 43714 Angie Mogilefsky English Teacher x 43509 Alex Morales Educator x43609 Kelly Moriarty x43615 Julie Munoz x 43230 Kevin Neal Social Studies Teacher x43705 Kristen Nelson Counselor: I-MC x 43293 Leanne Nemeth x 43243 Jennifer Olson English teacher x 43515 Laura Palosaari Mathematics Teacher, Co-Department Chair x 43608 Shellie Parkinson x 43621 Chris Pekich x43221 Bill Peterman English Teacher x 43511 Casey Quesnell x 43804 Cecilia Remeta World Language Department Chair x 43631 Daniel Rho Teacher x 43248 Marissa Salgado x43229 Caroline Secrist x 43710 Nina Sinsombutcharoen Math Teacher x43707 MaryJo Soufl x 43626 Bryce Stoddart x 43711 Nicole Thompson x 43237 Christina Varela x 43282 Donna Wanner Mathematics Teacher x43703 James Warren x 43226 Nancy Wei Teacher x 43713 Chris Wilson x 43283 Other Employees Elizabeth Aviles School Psychologist x43214 Patty Camp ASB Financial Clerk/Student Store x 43211 Olivia Carrasquillo Associate Principal Secretary x43225 Jeanne Delorenzo Principal's Secretary x 43201 Laurie Foster Testing Center Aide x 43603 Kim Gill Counselor A-C x43246 Maher Harb Tech Aide x 43277 Allison Hardesty Student Support Specialist x43238 Teresa Hoffman Scholarship & Financial Aid Coordinator x 43347 Francesca (Ms. Cesca) Kagy Lauro Student Support Specialist x43238 Lisa Kastelan Attendance Clerk x 43202 Annie Kim Counselor D-H x43217 Shawn Kim Head Custodian x 43600 Joanne Lewis Director, College & Career Center x 43618 Geraldine Machi Counseling Secretary x 43238 Vicki Mancusi Accounting Clerk x 43240 Heather McGuire Nurse 43210 Karen Mills Registrar x 43208 Thomas Nunan Psychologist x43215 Keith Propst Athletics Assistant x 43206 Francesca Quinn Sub Desk/Attendance x43239 Meggan Robles Library Clerk x43376 Rachel Rule x43214 Heidi Shulman Counselor: S-Z x43220 Amanda Smith Counselor x43218 Shawn Taber Technology Aide 43277 Robert Watt School Resource Officer 43900 Rebeca Webster Administrative Aide I x43219 Jennifer Yoshitake Nurse's Office Clerk x 43209 Palos Verdes High School 600 Cloyden Road, Palos Verdes Estates, CA 90274-1869 Phone: (310) 378-8471 Fax: (310) 378-0311 All District programs, activities, and practices shall be free from unlawful discrimination, including discrimination against an individual or group based on race, color, ancestry, nationality, national origin, immigration status, ethnic group identification, ethnicity, age, religion, marital status, pregnancy, parental status, physical or mental disability, sex, sexual orientation, gender, gender identity, gender expression, or genetic information; a perception of one or more of such characteristics; or association with a person or group with one or more of these actual or perceived characteristics. Title IX Contact: Richard Licciardello, 310-378-9966 x 417 Section 504 Contact: Kristen Holm, 310-378-9966 x 444 Complaint Procedures Pest Management Plan Calendar Parent Portal Homework Directions"
    },
    {
      "url": "https://pvhs.pvpusd.net/apps/pages/index.jsp?uREC_ID=458155&type=d&pREC_ID=staff",
      "text": "Staff – Career Technical Education (CTE) – Palos Verdes High School Skip to main content Mobile Menu Academics Advanced Placement AP Capstone Summer Assignments Mission & Schoolwide Learning Outcomes CAASPP Information 2023 CAST Testing Activities Clearance AVID Competition Teams Course Handbook CSF Departments Dual Enrollment Honor Societies Library NHS PEIS PVIT Seal of Biliteracy Seal of Civic Engagement WASC Work Experience Arts Art History Ceramics Dance Digital Animation Drama Department Drawing & Painting Glass Blowing Music Department Photography Surfboard Shaping Live From 205 Open Orchard The Point The Triton Yearbook Tradewinds: Magazine Athletics Athletic Director's Message Sports News Athletic Data Athletic Clearance Process Athletics Handbook Complaint Procedures Concussion Awareness and Protocols CIF NCAA Eligibility NCAA & The College Bound Athlete PVHS Eligibility Participation Donations Sports Supplemental Insurance Info Activities Senior Activities: Class of 2026 Homecoming ASB ASB Forms Be the Change Clubs Human Rights Coalition FAQs About Life at PVHS Link Crew Principal's Advisory Council (PAC) Scholar Quiz Winter Formal Calendar 2025-2026 Official Student Calendar A/B Calendar Online A/B Calendar Activities Calendar Athletics Calendar Bell Schedules Classes Academic Departments College & Career Welcome to the PVHS College & Career Center COLLEGE ADMISSION COUNSELORS: Schedule your Visit with PVHS Sea Kings! MaiaLearning Schedule Appointment with Mrs. Lewis Student Athletes and NCAA RESOURCES for PARENTS & STUDENTS COMMUNITY COLLEGE RESOURCES! FINANCIAL AID & SCHOLARSHIP INFORMATION Researching Colleges + Building Your List College Admission Tests College Applications - Applying to College 9th Grade College Planning: Freshman 10th Grade College Planning: Sophomore 11th Grade College Planning: Junior 12th Grade College Planning: Senior College Admissions & Matriculation Counseling Counseling Department School Counselors Wellness Center (SAGE Therapists) Graduation Requirements Course Pathways Course Selection Out-of-District Courses Transcript Requests Seniors Juniors Sophomores Freshmen Incoming Freshmen MaiaLearning NCAA / NAIA Parents/Guardians Calendar of Events Resources Forms School Info Online Incident Reporting Form Alumni Attendance Bell Schedules Complaint Procedures Daily Bulletin Enrollment Health Office Homeless and Foster Youth Lookbook Maps & Directions Open House Videos Parent-Student Handbook Parking Photos PVHS Programs and Pathways Physical Exam Report Form Sea King Sunday Update PTSA School Accountability Report Card School Plan (SPSA) School Profile School Safety Plan School Site Council Sea King Seminar Lessons Student Store - UNDER CONSTRUCTION! COVID-19 Protocols Videos 2023-2024 Staff Links for Staff Staff | School Directory Staff | Counselors Trista Ramirez | Principal D.J. Hill I Associate Principal Kirk Takeyama | Associate Principal Brian Shapiro | Athletic Director Jama Maxfield | Activities Director Wellness PVPUSD Families Connected Alumni Alumni Alumni Highlights School Info Bond Measure CEEB Code: 052358 PVPUSD Search Instagram YouTube Twitter WeTip | Login Career Technical Education (CTE) » Staff Staff Leith Emery x43706 Colm Gallagher Teacher 310-378-8471 ext 43706 Kristy Jimenez Photography & Animation Instructor. VAPA & PE Department Lead x 43231 Allyson Klabe Special Education Lead x 43616 Cynthia Mindicino English teacher, newspaper advisor x 43714 Alex Morales Educator x43609 Kelly Moriarty x43615 Palos Verdes High School 600 Cloyden Road, Palos Verdes Estates, CA 90274-1869 Phone: (310) 378-8471 Fax: (310) 378-0311 All District programs, activities, and practices shall be free from unlawful discrimination, including discrimination against an individual or group based on race, color, ancestry, nationality, national origin, immigration status, ethnic group identification, ethnicity, age, religion, marital status, pregnancy, parental status, physical or mental disability, sex, sexual orientation, gender, gender identity, gender expression, or genetic information; a perception of one or more of such characteristics; or association with a person or group with one or more of these actual or perceived characteristics. Title IX Contact: Richard Licciardello, 310-378-9966 x 417 Section 504 Contact: Kristen Holm, 310-378-9966 x 444 Complaint Procedures Pest Management Plan Calendar Parent Portal Homework Directions"
    }
  ]
}