{
  "fuentes": [
    {
      "url": "https://www.shogunbcn.com/ContactUs.php",
      "email": "20shogunbcn@yahoo.com"
    },
    {
      "url": "https://www.shogunbcn.com/ContactUs.php",
      "email": "shogunbcn@yahoo.com"
    },
    {
      "url": "https://www.putnamlodge.com/accessibility",
      "email": "info@putnamlodge.com"
    },
    {
      "url": "https://1927.net.au/contact",
      "email": "tonyg@theharbouragency.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "http://ctsfoundation.org/our-team/",
      "email": "info@ctsfoundation.org"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.putnamlodge.com/privacy",
      "email": "info@meridianpursuit.com"
    },
    {
      "url": "https://www.texassteakout.ie/en/contactUs",
      "email": "reception@texassteakout.ie"
    },
    {
      "url": "https://www.19-27.co.uk/contact",
      "email": "jo@19-27.co.uk"
    },
    {
      "url": "https://business.winterpark.org/list/member/outback-steakhouse-winter-park-5102225",
      "email": "wpcc@winterpark.org"
    }
  ],
  "mails": [
    "20shogunbcn@yahoo.com",
    "info@ctsfoundation.org",
    "info@meridianpursuit.com",
    "info@putnamlodge.com",
    "info@reception-plus.de",
    "jo@19-27.co.uk",
    "reception@texassteakout.ie",
    "sales@finewineliquors.com",
    "shogunbcn@yahoo.com",
    "tonyg@theharbouragency.com",
    "wpcc@winterpark.org"
  ],
  "nombre_sitio": "putnamlodge.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.shogunbcn.com/ContactUs.php",
      "text": "SHOGUN HIBACHI & SUSHI JAPANESE STEAKHOUSE | CONTACT US HOME ORDER ONLINE MENU RESERVATIONS CAREERS ABOUT US CONTACT US CONTACT US Contact Information Address 1230 N. Central Expressway, \n                                    McKinney, TX 75070 Telephone (972) 369-1849 E-mail shogunbcn@yahoo.com Restaurant Hours Monday - Thursday 4:00PM - 9:30PM Friday - Saturday 11:30AM - 10:00PM Sunday 11:30AM - 9:30PM © 2010 SHOGUN Hibachi & Sushi Japanese Steak House. All rights reserved. HOME | MENU | SPECIALS | RESERVATIONS | CAREERS | ABOUT US | CONTACT US"
    },
    {
      "url": "https://www.putnamlodge.com/accessibility",
      "text": "Official Site: Historic Putnam Lodge | Book Today HOME ROOMS RV PARK 1927 STEAKHOUSE BOOK YOUR EVENT THINGS TO DO ACCESSIBILITY (352) 440-0414 putnamlodge@gmail.com If you expect to arrive after 9 PM, please let us know in advance so we can ensure a smooth check-in process. Book Your Stay If you expect to arrive after 9 PM, please let us know in advance so we can ensure a smooth check-in process. HOME ROOMS RV PARK 1927 STEAKHOUSE BOOK YOUR EVENT THINGS TO DO ACCESSIBILITY Putnam Lodge Accessibility Statement Updated: December 2024. General Putnam Lodge strives to ensure that its services are accessible to people with disabilities. Putnam Lodge has invested a significant amount of resources to help ensure that its website is made easier to use and more accessible for people with disabilities, with the strong belief that every person has the right to live with dignity, equality, comfort and independence. Accessibility on Putnamlodge.com Putnamlodge.com makes available the UserWay Website Accessibility Widget that is powered by a dedicated accessibility server. The software allows Putnamlodge.com to improve its compliance with the Web Content Accessibility Guidelines (WCAG 2.1). Enabling the Accessibility Menu The Putnamlodge.com accessibility menu can be enabled either by hitting the tab key when the page first loads or by clicking the accessibility menu icon that appears on the corner of the page. After triggering the accessibility menu, please wait a moment for the accessibility menu to load in its entirety. Disclaimer Putnam Lodge continues its efforts to constantly improve the accessibility of its site and services in the belief that it is our collective moral obligation to allow seamless, accessible and unhindered use also for those of us with disabilities. In an ongoing effort to continually improve and remediate accessibility issues, we also regularly scan Putnamlodge.com with UserWay's <a href=\"https://UserWay.org/scanner\" title=\"Free Website Accessibility Scanner\">Accessibility Scanner</a> to identify and fix every possible accessibility barrier on our site. Despite our efforts to make all pages and content on Putnamlodge.com fully accessible, some content may not have yet been fully adapted to the strictest accessibility standards. This may be a result of not having found or identified the most appropriate technological solution. Here For You If you are experiencing difficulty with any content on Putnamlodge.com or require assistance with any part of our site, please contact us during normal business hours as detailed below and we will be happy to assist. Contact Us If you wish to report an accessibility issue, have any questions or need assistance, please contact Putnam Lodge Customer Support as follows: Email: info@putnamlodge.com Phone: Phone: 3524400414 Putnam Lodge & Spa Upcoming Events September 9th - BMW Club (public invited) September 10th - Suwannee League of Cities November 8th - Porche Club (public invited) July 2026 -  Mann Family Reunion 15487 Northwest Highway 19, Cross City, FL 32628 putnamlodge@gmail.com | (352) 440-0414 All Rights Reserved | Putnam Lodge © 2025 Accessibility Privacy Share by:"
    },
    {
      "url": "https://1927.net.au/contact",
      "text": "1927 - Contact Home Tour Dates About Music Photos Video Music Videos Unfiltered Series Pangent Destination Afghanistan Weideman Files STORE TEAM27 Contact EPK Home Tour Dates About Music Photos Video Music Videos Unfiltered Series Pangent Destination Afghanistan Weideman Files STORE TEAM27 Contact EPK 1927 bOOKING ENQUIRIES For booking enquiries, please contact: Tony Grace Guarrura The Harbour Agency P:  02 9331 5888 E: tonyg@theharbouragency.com 1927 OFFICE For all other enquiries, please email our office via the contact form below. Name Email Message Webdesign by JET.STEELE.FOTO.GRAFIK        |        © 1927, 2024 Some images © Log out"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * Datenschutz Nachricht name Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "http://ctsfoundation.org/our-team/",
      "text": "Our Team - Chris T. Sullivan Foundation Have any questions? 813-321-7781 info@ctsfoundation.org Home About Our Team Current Projects We Support Contact Chris T. Sullivan Chris T. Sullivan, President Chris T. Sullivan founded Outback Steakhouse in 1988 with Bob Basham Tim Gannon, and Trudy Cooper and served as former Chairman and CEO of Outback Steakhouse, Inc. The company went public in 1991 and over the next 15 years Sullivan collaborated with the founders of Carrabba’s Italian Grill, Bonefish Grill, Fleming’s Prime Steakhouse and Roy’s Hawaiian Fusion to develop and operate over 1400 restaurants worldwide.  In 2007, with then CEO Bill Allen, the OSI Board of Directors and executive team, the company was sold to Bain Capital Partners, Catterton Partners and the Founders.  In 2012, the reconstructed company, Bloomin’ Brands, Inc. went public and Sullivan serves as a Director. He is currently a partner of MVP Holdings, Inc. which include Lee Roy Selmon’s Restaurants, Carmel Kitchen and Wine Bar, MenuPad, LLC, Chairman; ConSul Partners, LLC and numerous restaurant industry investments. Mr. Sullivan is a graduate of the University of Kentucky, with a B.S. degree in Business and Economics, and in 2000 he was inducted into the Hall of Distinguished Alumni. In 1997, Sullivan together with Bob Basham and Bob Merritt, founded Old Memorial Golf Club. Currently, Mr. Sullivan serves on the Executive Committee and Board of Directors of the Horatio Alger Association of Distinguished Americans and is active in numerous charitable organizations focusing on catastrophic diseases, PTSD and education. Alex Sullivan Alex Sullivan, Vice President Alex Sullivan is director of real estate for Metro Diner, a restaurant company out of Tampa, FL. He has led the real estate department as Metro Diner grew from 5 locations to over 70.  He is also a managing member of Shamrock Private Trust Company where he handles family office duties for the Sullivan family. Mr. Sullivan’s history started with WCI Communities as a member of their management training program from 2003-2004.  In 2004, Mr. Sullivan was a founding member of A&S Properties of Florida which was a home acquisition and refurbishing company.  While still operating A&S Properties in 2005, he founded Palmcrest Properties of Florida, a company specializing on land acquisition and entitlement.  In 2006, Mr. Sullivan became a partner in Palmcrest Homes, a residential real estate company.  In 2009, Mr. Sullivan left real estate to become a partner in Café Caturra in Richmond, VA.  He then became a founder and executive vice president of Carmel Café & Wine Bar. Mr. Sullivan is a graduate of College of Charleston with a Bachelor of Science in Business Administration.  He is also chairman of the board from National Pediatric Cancer Foundation, board member of Academy Prep of Tampa and a board member of the Chris T Sullivan Foundation. Aside from being a leader in the restaurant industry, Mr. Sullivan enjoys being a member of Old Memorial Golf Club, Palma Ceia Golf and Club and Ye Mystic Krewe of Gasparilla. Being philanthropic is also a big part of who he is as an individual. He is highly involved in the community and serves on the Board of Pediatric Cancer Foundation, is Chairman of Fashion for the Cure and serves on the Development Committee at Academy Prep. OUR LOCATION Chris T. Sullivan Foundation 1511 N. Westshore Boulevard Suite 750 Tampa, FL 33607 CONTACT US Have any questions? 813-321-7781 info@ctsfoundation.org TERMS OF USE Privacy Policy © CTS Foundation"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.putnamlodge.com/privacy",
      "text": "Official Site: Historic Putnam Lodge | Book Today HOME ROOMS RV PARK 1927 STEAKHOUSE BOOK YOUR EVENT THINGS TO DO ACCESSIBILITY (352) 440-0414 putnamlodge@gmail.com If you expect to arrive after 9 PM, please let us know in advance so we can ensure a smooth check-in process. Book Your Stay If you expect to arrive after 9 PM, please let us know in advance so we can ensure a smooth check-in process. HOME ROOMS RV PARK 1927 STEAKHOUSE BOOK YOUR EVENT THINGS TO DO ACCESSIBILITY Putnam Lodge Privacy Policy Introduction This Privacy Policy outlines Putnam Lodge (\" we \", \" our \" or \" the Company \") practices with respect to information collected from users who access our website at putnamlodge.com (\" Site \"), or otherwise share personal information with us (collectively: \" Users \"). Grounds for data collection Processing of your personal information (meaning, any information which may potentially allow your identification with reasonable means; hereinafter \" Personal Information \") is necessary for the performance of our contractual obligations towards you and providing you with our services, to protect our legitimate interests and for compliance with legal and financial regulatory obligations to which we are subject. When you use the Site, you consent to the collection, storage, use, disclosure and other uses of your Personal Information as described in this Privacy Policy. We encourage our Users to carefully read the Privacy Policy and use it to make informed decisions. What information we collect? We collect two types of data and information from Users. The first type of information is un-identified and non-identifiable information pertaining to a User(s), which may be made available or gathered via your use of the Site (“ Non-personal Information ”). We are not aware of the identity of a User from which the Non-personal Information was collected. Non-personal Information which is being collected may include your aggregated usage information and technical information transmitted by your device, including certain software and hardware information (e.g. the type of browser and operating system your device uses, language preference, access time, etc.) in order to enhance the functionality of our Site. We may also collect information on your activity on the Site (e.g. pages viewed, online browsing, clicks, actions, etc.). The second type of information Personal Information which is individually identifiable information, namely information that identifies an individual or may with reasonable effort identify an individual. Such information includes: Device Information: We collect Personal Information from your device. Such information includes geolocation data, IP address, unique identifiers (e.g. MAC address and UUID) and other information which relates to your activity through the Site Registration information: When you register to our Site you will be asked to provide us certain details such as: full name; e-mail or physical address, and other information. How do we receive information about you? We receive your Personal Information from various sources: When you voluntarily provide us your personal details in order to register on our Site; When you use or access our Site in connection with your use of our services; From third party providers, services and public registers (for example, traffic analytics vendors). What information we collect? We do not rent, sell, or share Users’ information with third parties except as described in this Privacy Policy. We may use the information for the following: Communicating with you – sending you notices regarding our services, providing you with technical information and responding to any customer service issue you may have; To communicate with you and to keep you informed of our latest updates and services; To serve you advertisements when you use our Site (see more under \"Advertisements\"); To market our websites and products (see more under \"Marketing\"); Conducting statistical and analytical purposes, intended to improve the Site In addition to the different uses listed above, we may transfer or disclose Personal Information to our subsidiaries, affiliated companies and subcontractors. In addition to the purposes listed in this Privacy Policy, we may share Personal Information with our trusted third party providers, who may be located in different jurisdictions across the world, for any of the following purposes: Hosting and operating our Site; Providing you with our services, including providing a personalized display of our Site; Storing and processing such information on our behalf; Serving you with advertisements and assist us in evaluating the success of our advertising campaigns and help us retarget any of our users; Providing you with marketing offers and promotional materials related to our Site and services; Performing research, technical diagnostics or analytics; We may also disclose information if we have good faith to believe that disclosure of such information is helpful or reasonably necessary to: (i) comply with any applicable law, regulation, legal process or governmental request; (ii) enforce our policies (including our Agreement), including investigations of potential violations thereof; (iii) investigate, detect, prevent, or take action regarding illegal activities or other wrongdoing, suspected fraud or security issues; (iv) to establish or exercise our rights to defend against legal claims; (v) prevent harm to the rights, property or safety of us, our users, yourself or any third party; or (vi) for the purpose of collaborating with law enforcement agencies and/or in case we find it necessary in order to enforce intellectual property or other legal rights. User Rights You may request to: Receive confirmation as to whether or not personal information concerning you is being processed, and access your stored personal information, together with supplementary information. Receive a copy of personal information you directly volunteer to us in a structured, commonly used and machine-readable format. Request rectification of your personal information that is in our control. Request erasure of your personal information. Object to the processing of personal information by us. Request to restrict processing of your personal information by us. Lodge a complaint with a supervisory authority. However, please note that these rights are not absolute, and may be subject to our own legitimate interests and regulatory requirements. If you wish to exercise any of the aforementioned rights, or receive more information, please contact our Data Protection Officer (“DPO”) using the details provided below: info@meridianpursuit.com . Retention We will retain your personal information for as long as necessary to provide our services, and as necessary to comply with our legal obligations, resolve disputes, and enforce our policies. Retention periods will be determined taking into account the type of information that is collected and the purpose for which it is collected, bearing in mind the requirements applicable to the situation and the need to destroy outdated, unused information at the earliest reasonable time. Under applicable regulations, we will keep records containing client personal data, account opening documents, communications and anything else as required by applicable laws and regulations. We may rectify, replenish or remove incomplete or inaccurate information, at any time and at our own discretion. Cookies We and our trusted partners use cookies and other technologies in our related services, including when you visit our Site or access our services. A \"cookie\" is a small piece of information that a website assign to your device while you are viewing a website. Cookies are very helpful and can be used for various different purposes. These purposes include allowing you to navigate between pages efficiently, enable automatic activation of certain features, remembering your preferences and making the interaction between you and our Services quicker and easier. Cookies are also used to help ensure that the advertisements you see are relevant to you and your interests and to compile statistical data on your use of our Services. The Site uses the following types of cookies: a. 'session cookies' which are stored only temporarily during a browsing session in order to allow normal use of the system and are deleted from your device when the browser is closed; b. 'persistent cookies ' which are read only by the Site, saved on your computer for a fixed period and are not deleted when the browser is closed. Such cookies are used where we need to know who you are for repeat visits, for example to allow us to store your preferences for the next sign-in; c. 'third party cookies' which are set by other online services who run content on the page you are viewing, for example by third party analytics companies who monitor and analyze our web access. Cookies do not contain any information that personally identifies you, but Personal Information that we store about you may be linked, by us, to the information stored in and obtained from cookies. You may remove the cookies by following the instructions of your device preferences; however, if you choose to disable cookies, some features of our Site may not operate properly and your online experience may be limited. We also use a tool called “Google Analytics” to collect information about your use of the Site. Google Analytics collects information such as how often users access the Site, what pages they visit when they do so, etc. We use the information we get from Google Analytics only to improve our Site and services. Google Analytics collects the IP address assigned to you on the date you visit sites, rather than your name or other identifying information. We do not combine the information collected through the use of Google Analytics with personally identifiable information. Google’s ability to use and share information collected by Google Analytics about your visits to this Site is restricted by the Google Analytics Terms of Use and the Google Privacy Policy . Third party collection of information Our policy only addresses the use and disclosure of information we collect from you. To the extent you disclose your information to other parties or sites throughout the internet, different rules may apply to their use or disclosure of the information you disclose to them. Accordingly, we encourage you to read the terms and conditions and privacy policy of each third party that you choose to disclose information to. This Privacy Policy does not apply to the practices of companies that we do not own or control, or to individuals whom we do not employ or manage, including any of the third parties which we may disclose information as set forth in this Privacy Policy. How do we safeguard your information? We take great care in implementing and maintaining the security of the Site and your information. W e employ industry standard procedures and policies to ensure the safety of the information we collect and retain, and prevent unauthorized use of any such information, and we require any third party to comply with similar security requirements, in accordance with this Privacy Policy] . Although we take reasonable steps to safeguard information, we cannot be responsible for the acts of those who gain unauthorized access or abuse our Site, and we make no warranty, express, implied or otherwise, that we will prevent such access. Transfer of data outside the EEA Please note that some data recipients may be located outside the EEA. In such cases we will transfer your data only to such countries as approved by the European Commission as providing adequate level of data protection, or enter into legal agreements ensuring an adequate level of data protection. Advertisements We may use a third-party advertising technology to serve advertisements when you access the Site. This technology uses your information with regards to your use of the Services to serve advertisements to you (e.g., by placing third-party cookies on your web browser). You may opt-out of many third-party ad networks, including those operated by members of the Network Advertising Initiative (\"NAI\") and the Digital Advertising Alliance (\"DAA\"). For more information about this practice by NAI and DAA members, and your choices regarding having this information used by these companies, including how to opt-out of third-party ad networks operated by NAI and DAA members, please visit their respective websites: http://optout.networkadvertising.org/#!/ and http://optout.aboutads.info/#!/ Marketing We may use your Personal Information, such as your name, email address, telephone number, etc. ourselves or by using our third party subcontractors for the purpose of providing you with promotional materials, concerning our services, which we believe may interest you. Out of respect to your right to privacy we provide you within such marketing materials with means to decline receiving further marketing offers from us. If you unsubscribe we will remove your email address or telephone number from our marketing distribution lists. Please note that even if you have unsubscribed from receiving marketing emails from us, we may send you other types of important e-mail communications without offering you the opportunity to opt out of receiving them. These may include customer service announcements or administrative notices. Corporate transaction We may share information in the event of a corporate transaction (e.g. sale of a substantial part of our business, merger, consolidation or asset sale). In the event of the above, the transferee or acquiring company will assume the rights and obligations as described in this Privacy Policy. Minors We understand the importance of protecting children’s privacy, especially in an online environment. The Site is not designed for or directed at children. Under no circumstances shall we allow use of our services by minors without prior consent or authorization by a parent or legal guardian. We do not knowingly collect Personal Information from minors. If a parent or guardian becomes aware that his or her child has provided us with Personal Information without their consent, he or she should contact us at info@meridianpursuit.com Updates or amendments to this Privacy Policy We reserve the right to periodically amend or revise the Privacy Policy; material changes will be effective immediately upon the display of the revised Privacy policy. The last revision will be reflected in the \"Last modified\" section. Your continued use of the Platform, following the notification of such amendments on our website, constitutes your acknowledgment and consent of such amendments to the Privacy Policy and your agreement to be bound by the terms of such amendments. How to contact us If you have any general questions about the Site or the information we collect about you and how we use it, you can contact us at info@meridianpursuit.com Last Modified 2024 Putnam Lodge & Spa Upcoming Events September 9th - BMW Club (public invited) September 10th - Suwannee League of Cities November 8th - Porche Club (public invited) July 2026 -  Mann Family Reunion 15487 Northwest Highway 19, Cross City, FL 32628 putnamlodge@gmail.com | (352) 440-0414 All Rights Reserved | Putnam Lodge © 2025 Accessibility Privacy Share by:"
    },
    {
      "url": "https://www.texassteakout.ie/en/contactUs",
      "text": "Contact Our Steakhouse | Texas Steakout 116 O Connell Street, Limerick, Ireland (061) 410 350 [email protected] Toggle Lang Book Now! Book Now! Home Gift Card Gift Card Contact Us Send a Message Thank you for your message! We will do our best to respond as soon as possible.Please provide us with your contact information and a detailed message so we can assist you more effectively. Our Location 116 O Connell Street, Limerick, Ireland Phone Number +353 (061) 410 350 Email [email protected] Name Email Contact Number Phone Message Send Message Go to Home Our Location 116 O Connell Street, Limerick, Ireland Phone Number +353 (061) 410 350 Email [email protected] Work With Us Go to Form Links HOME MENU GIFT CARD CONTACT US ABOUT Opening Hours Tuesday - Friday 4pm - 10pm Saturday 2pm - 10pm Sunday 1pm - 9pm"
    },
    {
      "url": "https://www.19-27.co.uk/contact",
      "text": "Contact — 1927 Home About Shows Film Audio Artist Support Creative Engagement Behind the Screens Animated Worlds Calendar Tour Dates Donate Contact Home About Shows Film Audio Artist Support Creative Engagement Behind the Screens Animated Worlds Calendar Tour Dates Donate Contact Join our Mailing List Sign up with your email address to receive news and updates. First Name Last Name Email Address Sign Up Thanks for making contact Thank you! Get in touch… We love to hear from people who enjoy 1927's work, and even those that don't (well, less so than those that do, but we all need a little constructive criticism now and then). For presentation, touring and collaboration contact: Jo Crowley,  Executive Producer: jo@19-27.co.uk To contact the creative team directly: creativeteam1927@gmail.com We're not on social media but we love engaging with you! Send us your thoughts musings, questions, comments about our work, your ideas, photos of your dogs, and tell us about films, music or stuff you think we'd dig! We're a bit slow to respond but we'll read everything! Contact us by mail: 1927, 72 Northdown Road, Margate, Kent,  CT9 2RL United Kingdom Privacy Policy 1927 is committed to protecting your personal information and being transparent about the information we hold on you, whether you are an audience member, participant, customer, a website visitor, part of our membership scheme, a potential sponsor and funder, a creative collaborator, freelancer or job applicant.  You can read our Privacy Policy here Social gallery If you want your work featured on this page, upload it to social media! Don’t forget to tag us & use the hashtag #1927theatre… View fullsize View fullsize View fullsize FOLLOW US RT @ StreetwiseOpera : \"With confident voices & a spirit of optimism the cast sang their hearts out, ending in unison with the word Respec… https://t.co/LPmKjwmqsD 3 Apr 2023, 10:25 am RT @ StreetwiseOpera : Proud to be featured on today's @ BBCBreakfast with a brilliant piece by @ NavtejJohal about our #ReSound project wit… https://t.co/0wWND1EIOz 28 Mar 2023, 12:02 pm Such a privilege to have been part of this! Massive thanks to @ StreetwiseOpera for inviting us to collaborate with… https://t.co/Q53rLUNh2g 27 Mar 2023, 8:33 pm RT @ StreetwiseOpera : Finally on the stage of the @ southbankcentre ’s Queen Elizabeth Hall 🤩 Some tickets for tonight’s #ReSound performan… https://t.co/DSQsZ4BtDD 26 Mar 2023, 2:27 pm Still some tickets left for this eve - come and join!!! https://t.co/AKCkWqceih 26 Mar 2023, 1:32 pm RT @ StreetwiseOpera : We use opera to inspire and empower people recovering from homelessness. Join us tomorrow for #ReSound at… https://t.co/dPwu1avj25 25 Mar 2023, 12:55 pm Super excited for this performance in London this weekend! Come and join us @ southbankcentre 7.30pm on Sunday👇 https://t.co/PcTHf3ZHTh 24 Mar 2023, 4:17 pm We're delighted to announce the recipients of our 2023 Bursaries for Artists:\n\n🔹 Adrian & Neelam Saredia-Brayley\n🔹… https://t.co/phsoIuRpOD 22 Mar 2023, 12:36 pm Have a look at the most recent animated short created by the brilliant Year5 #YoungAnimationLeaders at… https://t.co/SqrYmgNlcJ 7 Mar 2023, 4:08 pm It's day 3 of #ChildrensMentalHealthWeek & the fab 1927 Year 5 #YoungAnimationLeaders @ ArtDrapers have been cooking… https://t.co/NikNUG5mr7 8 Feb 2023, 2:44 pm Back to Top 1927 is the trading name for ‘1927 Productions Limited’ Registered in England & Wales Company Number   7555968 VAT 974 7579 52 Registered Office 1927, 72 Northdown Road, Margate, England, CT9 2RL, United Kingdom 1927 is a registered Charity. Charity Number 1194657 Follow us"
    },
    {
      "url": "https://business.winterpark.org/list/member/outback-steakhouse-winter-park-5102225",
      "text": "Business Directory Search Skip to content Join Now Member Login Upcoming Events Facebook Instagram LinkedIn YouTube About Us About Us Board of Directors Staff Trustees Blog Membership Join Now Member Directory Membership Benefits Member Onboarding Marketing Opportunities Events & Programs Signature Events Signature Series Leadership Winter Park Relaunch Youth Leaders Resources Winter Park  Prosperity Scorecard Meeting Room Rentals Job Board Member Discounts Leadership Development Visit Welcome Center Park Avenue Member Directory Relocation Guide Interactive Map Business Directory Search All Categories... Accountants-CPA Accounting & Tax Services Advertising & Marketing Advertising Agencies Aesthetic Services & Skin Care Air Conditioning & Heating Systems Air Conditioning Duct Systems - Cleaning Apartments Architects Art Galleries & Dealers Art Instruction & Schools Artists Arts & Cultural Organizations Arts Education Assisted Living Facility Association Management Attorneys Attractions & Tours Audio-Visual/Video Sales & Rentals Auto Body Repair & Painting Auto Dealers Auto Parts Auto Repair & Service Bakery Banks Banks - Commercial Lending Banquet/Meeting Facilities Barber Shop Beauty & Makeup Studio Beauty and Hair Salon Beauty Salon & Day Spa Beer/Wine/Spirits Distributors Beverages Blood Banks & Centers Boat Sales, Rentals & Storage Book Stores & Reading Rooms Botanical Garden Bowling Centers Brand Development Brewery & Tap Room Bridal Shops Building Materials Buses - Charter & Rental Business Brokers Business Consultants Business Counselor / Coach Business Development Business Services Cable Television Car Washing Casinos Caterer/Personal Chef Caterers Cellular Telephone Products & Services Child Care Centers & Pre-Schools Children & Family Services Chiropractors Chocolates Churches Civic Clubs & Organizations Cleaning - Residential & Commercial Clothing - Custom Clothing & Accessories Clothing & Accessories - Men Clothing & Accessories - Women Coffee College Admission Counseling Colleges & Universities Commerical Financing Services Computers - Managed Services Computers - Systems & Software Construction Construction Management Consultants Consultants - Management & Communications Contractors - General Contractors - Heavy & Highway Copy Machines & Office Equipment, Supplies & Services Counselors Crafts Credit Unions Cruises Dentists Designer Showroom Education - Private Schools Education - Public Schools Educational Programs Electrical Contractors Employee Benefits Employment - Temporary/Permanent Employment & Career Services Engineers Engineers - Civil Estate Planning Event Planning & Production Event Services Financial Planning Financial Services Fire Alarm & Sprinkler Systems Fitness Studio Flooring & Refinishing Flooring Contractors & Dealers Floral Design Florists Foodservice Distributor Funeral Homes Furniture Gifts Golf Courses - Private & Public Gourmet Foods Governmental Granite & Marble Graphic Design Health & Fitness Centers Health & Wellness Health Care Health Insurance Provider Health Organizations Hearing Aids Home Builders Home Furnishings & Decor Home Health Services Home Renovation & Design Home Theater Hospitals Hotels Human Resources / Professional Employer Organization Ice Cream & Frozen Desserts Individuals Insurance Interior Design & Decorating Internet Marketing Investment Advisory Investment Management IT Services and Consulting Jeweler Jewelry & Accessories Kitchen & Bath Designers / Remodeling Landscape  - Architects & Lighting Legal Services & Process Serving Libraries Liquor Sales Locksmiths Magazine Publishers Marble & Tile Marketing Martial Arts Medical Services Medical Spa Mental Health Services Mortgages Movie Theaters & Film Festivals Moving & Storage Museums Music Lessons Nail Salons Non-Profit Nursing Homes Nutritionist Optical - Retail Optometrists Painting Contractors Paving Contractors Payroll Service Performing Arts Perfumery Personal Training Pest Control/Prevention Pet Boarding & Care Pet Supplies, Grooming, Daycare Photography Physical Therapy Plastic Surgery Pool Contractors Portraiture Pressure Cleaning Printers Private Foundation Professional & Collegiate Sports Teams Promotional Products Property Management Public Relations Radio Stations Real Estate Real Estate - Appraisers Real Estate - Commercial Real Estate - Developers Real Estate - Management Real Estate Investment Refrigeration - Commercial Rehabilitation Center Restaurant Delivery Service Restaurants Roofing Contractors Seafood Security Systems Self Storage Senior Living Senior Services Shoes Shopping Centers Signs, Graphics & Displays Snack Foods Social Services Sporting Goods Technology Solutions Telecommunications Companies Telephone - Cabling, Installation & Sales Television Stations Tents & Event Rental Services Theatres Title Companies Tour Operators Toy Store Training - Leadership Transportation Travel Agencies & Bureaus Tree Service Urgent Care & Walk-in Clinics Veterinarians Video Production Services Waste Services Watch Sales & Service Water, Fire & Smoke Restoration Wealth Management Wedding & Event Planning Weight Loss & Nutrition Window Cleaning Window Treatments Windows & Doors Wine Bar Wine Retail Yoga go 0-9 A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Arts, Culture & Entertainment Arts & Cultural Organizations, Museums, Performing Arts, Art Galleries & Dealers, More... Automotive & Marine Auto Dealers, Auto Repair & Service, Car Washing, Boat Sales, Rentals & Storage, More... Business & Professional Services Event Services, Photography, Architects, Employment - Temporary/Permanent, More... Computers & Telecommunications IT Services and Consulting, Technology Solutions, Telecommunications Companies, Cellular Telephone Products & Services, More... Construction & Contractors Contractors - General, Construction Management, Construction, Home Builders, More... Consulting Consultants, Business Consultants, Consultants - Management & Communications, Business Counselor / Coach, More... Family, Community & Civic Organizations Non-Profit, Social Services, Private Foundation, Children & Family Services, More... Finance & Insurance Banks, Financial Planning, Insurance, Wealth Management, More... Funeral Homes Funeral Homes Government, Education & Individuals Individuals, Governmental, Education - Private Schools, Colleges & Universities, More... Health Care Health & Wellness, Health Care, Medical Spa, Dentists, More... Home & Garden Interior Design & Decorating, Roofing Contractors, Air Conditioning & Heating Systems, Pest Control/Prevention, More... Industrial Supplies & Services Refrigeration - Commercial, Marble & Tile, Granite & Marble Legal Attorneys, Legal Services & Process Serving, Title Companies, Estate Planning Lodging & Travel Hotels, Travel Agencies & Bureaus, Cruises, Tour Operators Manufacturing, Production & Wholesale Printers, Promotional Products, Liquor Sales Marketing & Media Marketing, Public Relations, Video Production Services, Advertising & Marketing, More... Personal Services & Care Aesthetic Services & Skin Care, Home Health Services, Cleaning - Residential & Commercial, Barber Shop, More... Pets & Veterinary Veterinarians, Pet Boarding & Care, Pet Supplies, Grooming, Daycare Public Utilities & Environment Waste Services, Cable Television Real Estate, Moving & Storage Real Estate, Real Estate - Commercial, Real Estate - Developers, Apartments, More... Religious Organizations Churches Restaurants, Food & Beverages Restaurants, Caterers, Ice Cream & Frozen Desserts, Coffee, More... Senior Living Senior Living, Senior Services, Nursing Homes, Assisted Living Facility Shopping & Specialty Retail Gifts, Clothing & Accessories - Women, Jeweler, Book Stores & Reading Rooms, More... Sports & Recreation Golf Courses - Private & Public, Bowling Centers, Sporting Goods, Martial Arts, More... Transportation Transportation, Buses - Charter & Rental Venues Banquet/Meeting Facilities Business Directory Events Calendar Member to Member Discounts Job Postings Contact Us © 2025 Winter Park Chamber of Commerce | Site by GrowthZone Membership Resources Member Member Login Member Member Benefits Member Onboarding Member Onboarding Member Card Member Directory Get in Touch Address & Map 151 W. Lyman Ave., Winter Park, FL 32789 Phone icon 407.644.8281 Envelope icon wpcc@winterpark.org Facebook Instagram LinkedIn YouTube © 2025 Winter Park Chamber of Commerce. All Rights Reserved. Site by GrowthZone"
    }
  ]
}