{
  "query": "putnamlodge.com contact",
  "fuentes": [
    {
      "url": "https://www.putnamlodge.com/accessibility",
      "email": "info@putnamlodge.com"
    },
    {
      "url": "https://www.putnamlodge.com/accessibility",
      "email": "info@putnamlodge.com"
    },
    {
      "url": "https://pmlodge.net/weddings/",
      "email": "marketing@pmlodge.net"
    },
    {
      "url": "https://putnamplace.com/contact-us/",
      "email": "info@putnamplace.com"
    }
  ],
  "mails": [
    "info@putnamplace.com",
    "info@putnamlodge.com",
    "marketing@pmlodge.net"
  ],
  "nombre_sitio": "putnamlodge.com",
  "origen_extraccion": "Busqueda externa paso: contact",
  "textos_fuente": [
    {
      "url": "https://www.putnamlodge.com/accessibility",
      "text": "Official Site: Historic Putnam Lodge | Book Today HOME ROOMS RV PARK 1927 STEAKHOUSE BOOK YOUR EVENT THINGS TO DO ACCESSIBILITY (352) 440-0414 putnamlodge@gmail.com If you expect to arrive after 9 PM, please let us know in advance so we can ensure a smooth check-in process. Book Your Stay If you expect to arrive after 9 PM, please let us know in advance so we can ensure a smooth check-in process. HOME ROOMS RV PARK 1927 STEAKHOUSE BOOK YOUR EVENT THINGS TO DO ACCESSIBILITY Putnam Lodge Accessibility Statement Updated: December 2024. General Putnam Lodge strives to ensure that its services are accessible to people with disabilities. Putnam Lodge has invested a significant amount of resources to help ensure that its website is made easier to use and more accessible for people with disabilities, with the strong belief that every person has the right to live with dignity, equality, comfort and independence. Accessibility on Putnamlodge.com Putnamlodge.com makes available the UserWay Website Accessibility Widget that is powered by a dedicated accessibility server. The software allows Putnamlodge.com to improve its compliance with the Web Content Accessibility Guidelines (WCAG 2.1). Enabling the Accessibility Menu The Putnamlodge.com accessibility menu can be enabled either by hitting the tab key when the page first loads or by clicking the accessibility menu icon that appears on the corner of the page. After triggering the accessibility menu, please wait a moment for the accessibility menu to load in its entirety. Disclaimer Putnam Lodge continues its efforts to constantly improve the accessibility of its site and services in the belief that it is our collective moral obligation to allow seamless, accessible and unhindered use also for those of us with disabilities. In an ongoing effort to continually improve and remediate accessibility issues, we also regularly scan Putnamlodge.com with UserWay's <a href=\"https://UserWay.org/scanner\" title=\"Free Website Accessibility Scanner\">Accessibility Scanner</a> to identify and fix every possible accessibility barrier on our site. Despite our efforts to make all pages and content on Putnamlodge.com fully accessible, some content may not have yet been fully adapted to the strictest accessibility standards. This may be a result of not having found or identified the most appropriate technological solution. Here For You If you are experiencing difficulty with any content on Putnamlodge.com or require assistance with any part of our site, please contact us during normal business hours as detailed below and we will be happy to assist. Contact Us If you wish to report an accessibility issue, have any questions or need assistance, please contact Putnam Lodge Customer Support as follows: Email: info@putnamlodge.com Phone: Phone: 3524400414 Putnam Lodge & Spa Upcoming Events September 9th - BMW Club (public invited) September 10th - Suwannee League of Cities November 8th - Porche Club (public invited) July 2026 -  Mann Family Reunion 15487 Northwest Highway 19, Cross City, FL 32628 putnamlodge@gmail.com | (352) 440-0414 All Rights Reserved | Putnam Lodge © 2025 Accessibility Privacy Share by:"
    },
    {
      "url": "https://www.putnamlodge.com/accessibility",
      "text": "Official Site: Historic Putnam Lodge | Book Today HOME ROOMS RV PARK 1927 STEAKHOUSE BOOK YOUR EVENT THINGS TO DO ACCESSIBILITY (352) 440-0414 putnamlodge@gmail.com If you expect to arrive after 9 PM, please let us know in advance so we can ensure a smooth check-in process. Book Your Stay If you expect to arrive after 9 PM, please let us know in advance so we can ensure a smooth check-in process. HOME ROOMS RV PARK 1927 STEAKHOUSE BOOK YOUR EVENT THINGS TO DO ACCESSIBILITY Putnam Lodge Accessibility Statement Updated: December 2024. General Putnam Lodge strives to ensure that its services are accessible to people with disabilities. Putnam Lodge has invested a significant amount of resources to help ensure that its website is made easier to use and more accessible for people with disabilities, with the strong belief that every person has the right to live with dignity, equality, comfort and independence. Accessibility on Putnamlodge.com Putnamlodge.com makes available the UserWay Website Accessibility Widget that is powered by a dedicated accessibility server. The software allows Putnamlodge.com to improve its compliance with the Web Content Accessibility Guidelines (WCAG 2.1). Enabling the Accessibility Menu The Putnamlodge.com accessibility menu can be enabled either by hitting the tab key when the page first loads or by clicking the accessibility menu icon that appears on the corner of the page. After triggering the accessibility menu, please wait a moment for the accessibility menu to load in its entirety. Disclaimer Putnam Lodge continues its efforts to constantly improve the accessibility of its site and services in the belief that it is our collective moral obligation to allow seamless, accessible and unhindered use also for those of us with disabilities. In an ongoing effort to continually improve and remediate accessibility issues, we also regularly scan Putnamlodge.com with UserWay's <a href=\"https://UserWay.org/scanner\" title=\"Free Website Accessibility Scanner\">Accessibility Scanner</a> to identify and fix every possible accessibility barrier on our site. Despite our efforts to make all pages and content on Putnamlodge.com fully accessible, some content may not have yet been fully adapted to the strictest accessibility standards. This may be a result of not having found or identified the most appropriate technological solution. Here For You If you are experiencing difficulty with any content on Putnamlodge.com or require assistance with any part of our site, please contact us during normal business hours as detailed below and we will be happy to assist. Contact Us If you wish to report an accessibility issue, have any questions or need assistance, please contact Putnam Lodge Customer Support as follows: Email: info@putnamlodge.com Phone: Phone: 3524400414 Putnam Lodge & Spa Upcoming Events September 9th - BMW Club (public invited) September 10th - Suwannee League of Cities November 8th - Porche Club (public invited) July 2026 -  Mann Family Reunion 15487 Northwest Highway 19, Cross City, FL 32628 putnamlodge@gmail.com | (352) 440-0414 All Rights Reserved | Putnam Lodge © 2025 Accessibility Privacy Share by:"
    },
    {
      "url": "https://pmlodge.net/weddings/",
      "text": "Weddings | Pere Marquette Lodge & Conference Center in Grafton Illinois Skip to content Facebook Instagram Follow us on Facebook and Instagram! (618) 786-2331 Book Online Accommodations Packages Restaurant Winery Weddings Groups Things To Do Events Gallery Directions More Pere Marquette State Park History Employment Newsletter Sign Up Accommodations Packages Restaurant Winery Weddings Groups Things To Do Events Gallery Directions More Pere Marquette State Park History Employment Newsletter Sign Up Facebook Instagram Follow us on Facebook and Instagram! (618) 786-2331 Book Online Accommodations Packages Restaurant Winery Weddings Groups Things To Do Events Gallery Directions More Pere Marquette State Park History Employment Newsletter Sign Up Accommodations Packages Restaurant Winery Weddings Groups Things To Do Events Gallery Directions More Pere Marquette State Park History Employment Newsletter Sign Up \"If I lived 100 times, every time I would get married at The Lodge. Best Wedding Ever!\" - Samantha Hediger Weddings Here's to love, laughter, and happily ever after! Perfect wedding venue just a short drive from St. Louis Located on 8,000 acres of State Park, just east of St Louis, Pere Marquette Lodge is a grand, historic building built in the 1930s. With it’s awe-inspiring Great Room and beautiful grounds, Pere Marquette offers a truly unparalleled site for your bridal luncheon, rehearsal dinner, wedding ceremony and/or reception. Whether you’re looking for a romantic ceremony, a ceremony surrounded by nature, or something completely different, our seasoned team is ready to help make your special day unforgettable! We are still getting rave reviews on the food and overall experience. It was a wonderful venue with amazing staff.” – Klunk/Travers Wedding Grand Ballroom Beautiful indoor wedding and reception space! 2,900 square feet of flexible venue space with an open atmosphere and river view to enhance your reception. The conference area can accommodate up to 250 guests and can be sectioned off to cater to smaller receptions. I had only praise from our daughter’s wedding guests about their stay and the flawless event. My daughter, Hanlynn, is a no drama person and she had her perfect day because of the professionals that work with you.” – Cruthis/Vahlkamp Wedding Great Room Say \"I do\" right in the heart of the lodge! This massive 5,300 square foot room embodies the character and ambiance of the Lodge. It features a 50ft ceiling, a massive fireplace, wood and limestone floors, and giant wood pillars. As a gorgeous ceremony location, the Great Room is the perfect place to start your journey together. *Restricitions apply to host events in our Great Room. Please ask our Sales Department for more information. The lodge was beautiful for the wedding. The reception room was outstanding.  The check-in desk, the house men, the food service people, & all the staff were always so helpful. I would definitely recommend Pere Marquette Lodge to anyone as a wedding venue.” – Joyce Primeau Our Outdoor Venue Perfect shaded outdoor wedding in the park! A beautifully shaded stretch of park land between the main Lodge and cabins makes for the perfect outdoor wedding venue. The deep greens are stunning in the spring and summer months and with autumn come the most beautiful oranges and reds. We absolutely loved having our wedding at the Lodge. The fireplace and chandelier lighting was romantic and created this perfect ambiance of an intimate gathering removed from the city without being too far away.\" - Willems/Emilio de la Fuente Wedding Name Email Phone Message Get Started Plan Your Wedding Fill out the form or call Colleen at (618) 786-2331 ext. 339 Facebook Instagram Contact Info +1(618)786-2331 [email protected] 13653 Lodge Blvd. Grafton, IL 62037 Helpful Links State Park History Directions Employment State Park History Directions Employment © 2025 PERE MARQUETTE LODGE | All Rights Reserved Website by JF.Digital"
    },
    {
      "url": "https://putnamplace.com/contact-us/",
      "text": "Contact Us - Putnam Place Home Calendar Media Gallery About Us The Bar The Patio Drink Menu Dress Code Downtown Legendary Shows Private Events Bachelorette Party Fundraisers Private Party Wedding Reception After-Party Contact Us Venue Specs Talent Booking Media Kit Privacy Policy Home Calendar Media Gallery About Us The Bar The Patio Drink Menu Dress Code Downtown Legendary Shows Private Events Bachelorette Party Fundraisers Private Party Wedding Reception After-Party Contact Us Venue Specs Talent Booking Media Kit Privacy Policy Home Calendar Media Gallery About Us The Bar The Patio Drink Menu Dress Code Downtown Legendary Shows Private Events Bachelorette Party Fundraisers Private Party Wedding Reception After-Party Contact Us Venue Specs Talent Booking Media Kit Privacy Policy Contact Us By using this form you agree with the storage and handling of your data by this website. LOCATION Address: 63 A Putnam Street, \nSaratoga Springs, NY Phone: (518) 886-9585 Email: info@putnamplace.com Empire Media Network © . All rights reserved. Instagram Facebook-f X-twitter Youtube"
    }
  ]
}