{
  "fuentes": [
    {
      "url": "https://www.edged.us/our-team",
      "email": "contact@edged.us"
    },
    {
      "url": "https://www.edged.us/our-team",
      "email": "sales@edgedenergy.com"
    },
    {
      "url": "https://puttingedge.com/index.php?amp=&amp=&id=51&option=com_content&task=view",
      "email": "putting-edge@2x-150x150.png"
    },
    {
      "url": "https://puttingedge.com/index.php?amp=&amp=&id=51&option=com_content&task=view",
      "email": "putting-edge@2x-300x300.png"
    },
    {
      "url": "https://puttingedge.com/index.php?amp=&amp=&id=51&option=com_content&task=view",
      "email": "info@puttingedge.com"
    },
    {
      "url": "https://www.puttingedge.com/group-booking/",
      "email": "putting-edge@2x-150x150.png"
    },
    {
      "url": "https://www.puttingedge.com/group-booking/",
      "email": "putting-edge@2x-300x300.png"
    },
    {
      "url": "https://www.puttingedge.com/group-booking/",
      "email": "info@puttingedge.com"
    },
    {
      "url": "https://thebeautyclinic.com/contact/",
      "email": "info@thebeautyclinic.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "bryan@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "rolando@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "andy@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "betsy@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "josh@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "sales@adimetal.com"
    },
    {
      "url": "https://www.puttingedge.com/golf-gala-bundle/",
      "email": "putting-edge@2x-150x150.png"
    },
    {
      "url": "https://www.puttingedge.com/golf-gala-bundle/",
      "email": "putting-edge@2x-300x300.png"
    },
    {
      "url": "https://www.puttingedge.com/golf-gala-bundle/",
      "email": "info@puttingedge.com"
    },
    {
      "url": "https://www.puttingedge.com/test-form/",
      "email": "putting-edge@2x-150x150.png"
    },
    {
      "url": "https://www.puttingedge.com/test-form/",
      "email": "putting-edge@2x-300x300.png"
    },
    {
      "url": "https://www.puttingedge.com/test-form/",
      "email": "info@puttingedge.com"
    },
    {
      "url": "https://www.puttingedge.com/test-form/",
      "email": "nepean@puttingedge.com"
    },
    {
      "url": "https://www.infoedge.in/About/BoardOfDirectors",
      "email": "investors@naukri.com"
    },
    {
      "url": "https://www.linkedin.com/company/edge-solutions-llc",
      "email": "tiff@techalpharetta.com"
    },
    {
      "url": "https://www.puttingedge.com/",
      "email": "putting-edge@2x-150x150.png"
    },
    {
      "url": "https://www.puttingedge.com/",
      "email": "putting-edge@2x-300x300.png"
    },
    {
      "url": "https://www.puttingedge.com/",
      "email": "info@puttingedge.com"
    },
    {
      "url": "https://officeedge.com/fort-lauderdale/contact/",
      "email": "ftl-info@officeedge.com"
    },
    {
      "url": "https://oceansedgeschool.com/",
      "email": "info@oceansedgeschool.com"
    },
    {
      "url": "https://thedoorfactoryfl.com/contact/",
      "email": "info@thedoorfactoryfl.com"
    },
    {
      "url": "https://kovacksecurities.com/ContactUs.html",
      "email": "info@kovacksecurities.com"
    },
    {
      "url": "https://www.puttingedge.com/locations/fort-lauderdale",
      "email": "putting-edge@2x-150x150.png"
    },
    {
      "url": "https://www.puttingedge.com/locations/fort-lauderdale",
      "email": "putting-edge@2x-300x300.png"
    },
    {
      "url": "https://www.puttingedge.com/locations/fort-lauderdale",
      "email": "events@xtremeactionpark.com"
    },
    {
      "url": "https://www.puttingedge.com/parties-events/",
      "email": "putting-edge@2x-150x150.png"
    },
    {
      "url": "https://www.puttingedge.com/parties-events/",
      "email": "putting-edge@2x-300x300.png"
    }
  ],
  "mails": [
    "andy@adimetal.com",
    "betsy@adimetal.com",
    "bryan@adimetal.com",
    "contact@edged.us",
    "events@xtremeactionpark.com",
    "ftl-info@officeedge.com",
    "info@kovacksecurities.com",
    "info@oceansedgeschool.com",
    "info@puttingedge.com",
    "info@thebeautyclinic.com",
    "info@thedoorfactoryfl.com",
    "investors@naukri.com",
    "josh@adimetal.com",
    "nepean@puttingedge.com",
    "putting-edge@2x-150x150.png",
    "putting-edge@2x-300x300.png",
    "rolando@adimetal.com",
    "sales@adimetal.com",
    "sales@edgedenergy.com",
    "tiff@techalpharetta.com"
  ],
  "nombre_sitio": "puttingedge.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.edged.us/our-team",
      "text": "Edged U.S. | Our Team Meet the leadership team Jakob Carnemark Founder https://www.linkedin.com/in/jakob-carnemark-b93b079/ A veteran entrepreneur and builder in the data center industry, Jake focuses on new approaches to improve infrastructure deployment for IT and sustainable energy. Jake has over 30 years of experience building and operating data centers and mission critical infrastructure for companies such as Skanska, IBM, Telus, Goldman Sachs and other industry leaders. As Founder and CEO of Endeavour, Jake is overseeing the rollout of a new generation of grid-interactive edge infrastructure. Bryant Farland Chief Executive Officer https://www.linkedin.com/in/bryant-farland-7a7065a/ Bryant is a senior executive with more than two decades of experience in the critical infrastructure industry. As CEO of Edged Data Centers, Bryant oversees the rapid North American rollout of the Edged sustainable data center platform and its supporting technologies. Bryant is a proven leader with experience across the full project lifecycle, from design to delivery to successful operations. Royce Thomas Chief Revenue Officer https://www.linkedin.com/in/roycethomas/ Royce is a leading sales expert in the digital infrastructure and telecommunications industry with more than 30 years of experience in global sales, business development and marketing. He is responsible for the overall customer experience and go-to-market strategy, including driving revenue growth, identifying strategic partnerships and building a world-class sales and customer service organization. He brings long-term, established relationships with the largest cloud and hyperscale customers and a proven ability to scale businesses, successfully implement new\nsystems and inspire top-performing teams. Mitch Fonseca Chief Operating Officer https://www.linkedin.com/in/mitchfonseca/ As Chief Operating Officer, Mitch is responsible for the overall design, construction and operation of the companyâs rapidly expanding North American portfolio. He is a seasoned industry leader with more than 15 years of experience successfully scaling organizations and delivering exceptional operations, planning and delivery of enterprise-class technology and telecommunications products and services for global Fortune 100 companies. Christine Wyatt-Townsley Chief Human Resources Officer https://www.linkedin.com/in/christinewyatttownsley/ Christine is a seasoned HR leader with over 20+ years of experience developing and leading people, culture programs and teams across diverse industries including critical infrastructure and technology. As the Chief Human Resources Officer at Edged, Christine is responsible for all aspects of HR. She is focused on building culture and teams that are inclusive, innovative, and high performing. John Callahan Chief Investment Officer https://www.linkedin.com/in/john-callahan-6bb20b2a/ John is the senior executive responsible for overseeing the companyâs investment strategy and driving continued financial growth. He has broad experience across the lifecycle of investments from originations to equity and debt financing, asset management, and disposition. Prior to joining Edged, John led the investment of billions of equity across various asset classes, including data centers, and started several real estate operating businesses. Scott Silverman Chief Financial Officer https://www.linkedin.com/in/scott-silverman-0414b43/ Scott is a top financial advisor with over 30 years of experience working in the design/build/finance industry. He has supported numerous multi-billion-dollar projects for mission critical infrastructure and brings deep expertise in strategic planning, technology, project controls, accounting, capital management and more. As Chief Financial Officer, Scott plays a pivotal role in driving the companyâs financial performance, managing risk and advancing strategic growth initiatives. Martin Triplett Chief of Staff https://www.linkedin.com/in/martintriplett/ Martin is a veteran industry expert with more than 25 years of experience working for leading data center and telecommunications providers. He has deep expertise in network and customer operations, IT and business processes, product management and global market expansion. As Chief of Staff, Martin plays a pivotal role in driving strategic initiatives, optimizing operations and creating cross-functional alignment. He is a key advisor to the executive team, ensuring seamless execution of the companyâs mission to deliver innovative IT infrastructure. Michael Green General Counsel https://www.linkedin.com/in/michael-green-04585826/ As General Counsel to Edged, Michael is responsible for overseeing all legal, compliance and regulatory matters and plays a critical role in helping the team meet its strategic objectives. Michael has more than a decade of experience advising on real estate investments, mergers and acquisitions, joint ventures, and debt and equity financings. Prior to joining Edged, Michael was in-house counsel for a multinational corporation with substantial private investment activity and a member of the mergers and acquisitions group at a leading international law firm. Marcie Kaplan Vice President & Head of Marketing https://www.linkedin.com/in/marcie-kaplan-890a433/ Marcie is a seasoned marketing leader with over 20 years of experience, including deep expertise in the rapidly evolving data center and technology industry. As Vice President and Head of Marketing, Marcie is responsible for driving innovative marketing growth strategies and overseeing key functions including demand generation, product marketing, content strategy, channel marketing and external communications to support the overarching go-to-market vision. Brittany Marley Vice President of Sales https://www.linkedin.com/in/brittany-marley-b37b756/ Brit is an experienced sales executive responsible for solving complex infrastructure requirements for hyperscale, cloud, and content clients. She provides technical expertise in AI, hybrid cloud, edge and subsea systems with an emphasis on sustainability and renewable energy. Brit brings more than 20 years of sales and business development experience to her work at Edged, having managed partnerships with many of the largest cloud and hyperscale clients in the industry. Julian Bastiani Vice President of Operations https://www.linkedin.com/in/julian-endeavour/ Julian is a seasoned operations and engineering leader with more than 15 years of experience successfully designing and executing mission critical logistics facilities. He brings proven expertise in project planning and a keen ability to integrate complex technology solutions and reliability initiatives. As the Director of Operations, Julian oversees the operational strategy and implementation for the companyâs fast growing sustainable data center portfolio, ensuring top-tier performance, energy efficiency and uptime. Frank Scandariato Vice President of Construction https://www.linkedin.com/in/frank-scandariato-92746831/ Frank is an industry veteran in mission critical infrastructure for large scale construction projects who is leading the rapid rollout of the Edged platform in North America. He has led the design and construction of multibillion dollar projects that span a multitude of industries. Frank brings to bear his formidable background in engineering, technology, and infrastructure design â as well as his extensive leadership and project management skills. A few examples of his projects include data centers for eBay, IBM, Royal Bank of Canada, Lenovo, and Telus, and airline terminals for John F. Kennedy International and Laguardia Airports. Joe Bush Vice President of Investments & Capital Formation https://www.linkedin.com/in/joe-bush-54b7aa44/ Joe is an investment professional with more than a decade of experience in infrastructure private equity and investment banking. He is focused on driving platform growth through capital formation, corporate development and strategic planning. Prior to joining Edged, Joe executed over $8 billion of equity investments in digital infrastructure and worked with power and utility clients on M&A transactions and strategic financings. Christian Dicker Senior Director of Sales https://www.linkedin.com/in/christiandicker/ Christian is a senior sales professional with 20+ years of sales and marketing experience in IT infrastructure. He has spent his career involved in many areas of IT, including data center infrastructure, site selection, deep network background, new market development, and business case development. He holds a unique background successfully supporting sales for hyperscale and Fortune 100 Enterprise. â Name Name Title A veteran entrepreneur and builder in the data center industry, Jake focuses on new approaches to improve infrastructure deployment for IT and sustainable energy. Jake has over 30 years of experience building and operating data centers and mission critical infrastructure for companies such as Skanska, IBM, Telus, Goldman Sacs and other industry leaders. As Founder and CEO of Endeavour, Jake is overseeing the rollout of a new generation of grid-interactive edge infrastructure. Start saving with green IT. We can help. contact@edged.us Cookies Privacy Legal Edged | Endeavour Legal Notice | Privacy Policy | Cookie Policy | Cookie Preferences Â© Copyright Edged, 2025. An Endeavour Company | Terms and Conditions | Privacy Policy | Acceptable Use Policy United states DATAÂ CENTERS Spain &Â PORTUGALÂ DATaÂ CENTERS Global DATAÂ CENTERS Language Locations North America Atlanta Chicago Columbus Dallas Des Moines Kansas City Phoenix Spain + Portugal Madrid-Getafe Barcelona Bilbao-Arasur Lisbon Global Consectetur Adipiscing Bilbao-Arasur Occaeact About Company Our Team Our Impact News Careers Sustainability Services Real-Time Monitoring Remote Hands Columbus Contact Language"
    },
    {
      "url": "https://puttingedge.com/index.php?amp=&amp=&id=51&option=com_content&task=view",
      "text": "Putting Edge - 18 Holes of Glow-In-The-Dark Golf Fun! Skip to content EN FR Opens at 11:00 am Fort Lauderdale, United States DIRECTIONS LOCATION DETAILS EN FR Locations Column 1 Ontario Nepean Scarborough Vaughan Whitby Nova Scotia Halifax Column 2 Quebec Montreal (Centre-Ville) Laval (Centropolis) Ville Saint-Laurent (Spheretech) United States Fort Lauderdale, FL Novi, MI Orlando, FL Parties & Events Birthday Parties Youth Group Events Celebrations Company Events About Glow In The Dark Mini Golf Arcade Make a Reservation Do Something far from ordinary Book Your Reservation Now Select Your Preferred Location * Select Your Preferred Location Nepean, Ontario Scarborough, Ontario Vaughan, Ontario Whitby, Ontario Halifax, Nova Scotia Montreal (Centre-Ville), Quebec Laval (Centropolis), Quebec Ville Saint-Laurent (Spheretech), Quebec Fort Lauderdale, United States Novi, United States Orlando, United States PERFECT FOR ANY OCCASION Date Night SOCIAL OUTINGS FAMILY FUN PARTIES & EVENTS HOW DO YOU ESCAPE THE ORDINARY? From the moment you enter one of our “Black lit” courses, you have left “the real world” and have entered a dizzying universe full of fun, imagination, and activity. You will be immersed in a kaleidoscope of dazzling “Glow-in-the-Dark” colors, images and sounds, rocking your senses in extraordinary and unbelievable ways. LET'S DO THIS! BOOK YOUR TEE TIME You can request your tee time online by clicking your desired location on the link below. Reservations are required to avoid long wait periods. Walk-ins are welcome, subject to availability. MAKE A RESERVATION Planning a large party? Please visit our Parties & Events page or call us directly. LOCATION, LOCATION, LOCATION! FIND A PUT T ING EDGE NEAR YOU Each Putting Edge venue features a unique glow-in-the-dark golf course , a glow-in-the-dark arcade and lobby featuring images and sounds, rocking your senses in unordinary, unbelievable ways. Remember At Put t ing Edge, the weather is guaranteed! FIND A PUTTING EDGE NEAR YOU Nepean, Ontario Scarborough, Ontario Vaughan, Ontario Whitby, Ontario Halifax, Nova Scotia Montreal (Centre-Ville), Quebec Laval (Centropolis), Quebec Ville Saint-Laurent (Spheretech), Quebec Fort Lauderdale, United States Novi, United States Orlando, United States Fort Lauderdale, United States Inside Xtreme Action Park, 5300 Powerline Rd, Fort Lauderdale, FL 33309 VIEW MAP Our Store Opens at 11:00 am Monday - Thursday 11:00 am - 10:00 pm Friday - Saturday 11:00 am - 12:00 am Sunday 11:00 am - 10:00 pm MAKE A RESERVATION PLAN A PARTY FAR FROM THE ORDINARY! Our party planners are committed to making sure every detail meets perfection – from finding the best date to facilitating all of your special requests. You focus on the fun, we’ll handle the rest. Birthday Parties Youth Group Events Celebrations Company Events AN EXPERIENCE LIKE NO OTHER! IT'S LIKE TRAVELLING TO ANOTHER PLANET FREQUENTLY ASKED QUESTIONS See our answers to frequently asked questions below. But keep in mind that one can never truly prepare for the unordinary. That would make things way too ordinary. Are all Putting Edge locations the same? Each course has a unique 18 hole golf course design with a variety of arcade games and furnishings. How long does it take to play? A round of mini golf will take approximately 45 minutes to play, however you should allow yourself extra time to enjoy our arcade games as well Is everyone required to pay the admission price to enter the golf course? Yes. Our admission policy intentionally promotes family visits by allowing a child 3 years and under to play for free when accompanied with a paid General Admission. An exception is for group leaders who are supervising their pre-booked event. Are you wheelchair accessible? Our Lobby, Arcade and Party Rooms are fully accessible. Unfortunately our multi-level golf course is not. Do You Serve Alcohol? Alcoholic beverages can be served during private events by most caterers. All Quebec locations sell alcohol. Is your game suitable for all ages? We recommend the game for ages 9 to 99. How many people can play together at the same time? In order to keep a consistent rate of play on the course, we allow a maximum of 4 players to play together on one hole. Larger groups would be separated into two or more groups who would be playing on consecutive holes on the course. As an example, a group of 6 players would be separated into 2 groups of 3 players. Each group would play on separate holes. Are reservations required? Can I book online? Yes. You can request a tee time by clicking the \"make a reservation\" link at the top of the page. Do you serve food and beverages? Some of our locations have an assortment of snacks, bottled soft drinks, and frozen beverages. For our Golf N’ Gala package guests may bring fully prepared food or order delivery. Please see our Group Event or Birthday Party page for more details. Do you host Private Facility Rentals or events outside of regular operating hours? Yes, we will close to the public so your group can have exclusive use of our facility. We will also open at any time for your private event. Please contact our event planners at info@puttingedge.com to discuss how we can make it an unforgettable experience for all. Locations Parties & Events Influencers Copyright © 2025 Putting Edge. Produced by CREATIVE ONE®"
    },
    {
      "url": "https://www.puttingedge.com/group-booking/",
      "text": "Group Booking - Putting Edge Skip to content EN FR Opens at 11:00 am Fort Lauderdale, United States DIRECTIONS LOCATION DETAILS EN FR Locations Column 1 Ontario Nepean Scarborough Vaughan Whitby Nova Scotia Halifax Column 2 Quebec Montreal (Centre-Ville) Laval (Centropolis) Ville Saint-Laurent (Spheretech) United States Fort Lauderdale, FL Novi, MI Orlando, FL Parties & Events Birthday Parties Youth Group Events Celebrations Company Events About Glow In The Dark Mini Golf Arcade Make a Reservation Reserve Your Group Event Get The Party Started Plan Something Extraordinary To get the ball rolling and obtain additional information, please fill out the form below giving us information about what your looking for and we will get back to you as soon as possible. Choose your location (Required) Select Location Centre-Ville (Montreal) Halifax Centropolis (Laval) Ottawa (Nepean) Oakville Vaughan Scarborough Spheretech (Ville St. Laurent) Whitby Novi Orlando Choose Package (Required) Golf Golf n’ Arcade Golf n’ Gala Choose Event Type Select Event Type Birthday Parties Youth Group Events Celebrations Company Events Tell us about your group (Required) Camp Church Corporate Group Daycare Fundraising Non-profit Sports Team Other Approximate number of guests (Required) 16-30 30-60 60-90 90+ Minimum of 25 guests required Potential event date (Required) MM slash DD slash YYYY Event start time (Required) Your Name First Last Your email address (Required) Your phone number (Required) * Please note, Event start times are requests only and not reserved. Your Event’s start time is not confirmed until a confirmation has been sent from your desired location and your deposit has been paid. FREQUENTLY ASKED QUESTIONS See our answers to frequently asked questions below. But keep in mind that one can never truly prepare for the unordinary. That would make things way too ordinary. Are all Putting Edge locations the same? Each course has a unique 18 hole golf course design with a variety of arcade games and furnishings. How long does it take to play? A round of mini golf will take approximately 45 minutes to play, however you should allow yourself extra time to enjoy our arcade games as well Is everyone required to pay the admission price to enter the golf course? Yes. Our admission policy intentionally promotes family visits by allowing a child 3 years and under to play for free when accompanied with a paid General Admission. An exception is for group leaders who are supervising their pre-booked event. Are you wheelchair accessible? Our Lobby, Arcade and Party Rooms are fully accessible. Unfortunately our multi-level golf course is not. Do You Serve Alcohol? Alcoholic beverages can be served during private events by most caterers. All Quebec locations sell alcohol. Is your game suitable for all ages? We recommend the game for ages 9 to 99. How many people can play together at the same time? In order to keep a consistent rate of play on the course, we allow a maximum of 4 players to play together on one hole. Larger groups would be separated into two or more groups who would be playing on consecutive holes on the course. As an example, a group of 6 players would be separated into 2 groups of 3 players. Each group would play on separate holes. Are reservations required? Can I book online? Yes. You can request a tee time by clicking the \"make a reservation\" link at the top of the page. Do you serve food and beverages? Some of our locations have an assortment of snacks, bottled soft drinks, and frozen beverages. For our Golf N’ Gala package guests may bring fully prepared food or order delivery. Please see our Group Event or Birthday Party page for more details. Do you host Private Facility Rentals or events outside of regular operating hours? Yes, we will close to the public so your group can have exclusive use of our facility. We will also open at any time for your private event. Please contact our event planners at info@puttingedge.com to discuss how we can make it an unforgettable experience for all. Locations Parties & Events Influencers Copyright © 2025 Putting Edge. Produced by CREATIVE ONE®"
    },
    {
      "url": "https://thebeautyclinic.com/contact/",
      "text": "Contact The Beauty Clinic – Get in Touch Skip to content Book a Consultation with Our Expert Now Home Treatments About Before and After Book an Appointment Testimonials Blog Ft. Lauderdale Office Miami Office Contact Home Treatments About Before and After Book an Appointment Testimonials Blog Ft. Lauderdale Office Miami Office Contact Home About Treatments Before & After Testimonials Book An Appointment Blog Shop Ft. Lauderdale Office Miami Office Contact info@thebeautyclinic.com Miami Office (305) 882 - 9439 18157 Biscayne Blvd, Aventura, FL 33160 Ft. Lauderdale Office (954) 719-7123 464 N. Federal Highway Ft. Lauderdale, FL 33301 Facebook Instagram Google Instagram Facebook Home About Treatments Toxins Fillers Sculptra PRF EZGel Biofiller Clear + Brilliant Laser SkinVive Before and After Testimonials Blog Contact Home About Treatments Toxins Fillers Sculptra PRF EZGel Biofiller Clear + Brilliant Laser SkinVive Before and After Testimonials Blog Contact Book Now Aventura Ft Lauderdale Facebook-f Instagram Home About Treatments Toxins Fillers Sculptra PRF EZGel Biofiller Clear + Brilliant Laser Skinvive Before and After Testimonials Blog Contact Book an Appointment My account Home About Treatments Toxins Fillers Sculptra PRF EZGel Biofiller Clear + Brilliant Laser Skinvive Before and After Testimonials Blog Contact Book an Appointment My account Book Now Aventura Ft Lauderdale Facebook-f Instagram Home Treatments About Before and After Book an Appointment Testimonials Blog Ft. Lauderdale Office Miami Office Contact Home Treatments About Before and After Book an Appointment Testimonials Blog Ft. Lauderdale Office Miami Office Contact Home About Treatments Before & After Testimonials Book An Appointment Blog Shop Ft. Lauderdale Office Miami Office Contact info@thebeautyclinic.com Miami Office (305) 882 - 9439 18157 Biscayne Blvd, Aventura, FL 33160 Ft. Lauderdale Office (954) 719-7123 464 N. Federal Highway Ft. Lauderdale, FL 33301 Facebook Instagram Google Contact Us We Are Here To Assist You We love HELPING OUR CLIENTS LOOK & FEEL THEIR BEST Feel free to contact us for more information First Name Last Name Phone Number Email Address MESSAGE Send Miami Office 01. Phone Number (305) 882-9439 02. Our Email info@thebeautyclinic.com 03. Our Address 18157 Biscayne Blvd Aventura, Florida 33160 Get Directions Ft. Lauderdale Office 01. Phone Number (954) 719-7123 02. Our Email info@thebeautyclinic.com 03. Our Address 464 N. Federal Highway\nFt. Lauderdale, FL 33301 Get Directions Yes, you can look natural with Botox and Fillers! We’ve helped thousands of people look refreshed and rejuvenated with injectables. Facebook-f Instagram Google Navigate Home Treatments About Before and After Book an Appointment Testimonials Blog Ft. Lauderdale Office Miami Office Contact Home Treatments About Before and After Book an Appointment Testimonials Blog Ft. Lauderdale Office Miami Office Contact Toxins Fillers Sculptra Clear + Brilliant Laser PRF EZGel Biofiller Toxins Fillers Sculptra Clear + Brilliant Laser PRF EZGel Biofiller Newsletter Email Subscribe Latest Posts Lip filler can instantly enhance your features—softer, more feminine, and effortlessly sexy. Read More » The goal? A fresher look without giving anything away. Read More » Don’t let the fear mongers keep you from looking your best. Read More » « Previous Next » Copyright © 2025 The Beauty Clinic . All rights reserved. Sitemap​ Made with ❤ by EYEBRANDIT"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "text": "Contact ADI Metal | Get in Touch with Our Team Search Skip To Content +1 954.523.6474 +1 954.779.7355 US Toll Free: 866.825.9271 Request a Quote +1 954.523.6474 sales@adimetal.com RFQ About Us Credit Application Testimonials Women Owned Business Team Catalog Aluminum Alloy Products 535 Cast Aluminum 1100 Alloy Aluminum 3003 Alloy Aluminum 5052 Alloy Aluminum 5083 Marine Grade Aluminum Alloy 5086 Marine Grade Aluminum Sheet, Plate & Extrusions 5454 Alloy Aluminum 5456 Alloy Aluminum 6005 Aluminum 6063 Architectural Aluminum 6463 Aluminum Bright Dip Anodized or Brushed Finish Pipe 6061 Structural Marine Grade Aluminum Stainless Steel Products Stainless Steel Sheets and Plate Stainless Polished Tubes Stainless Steel Round Tubes and Pipes Stainless Steel Square and Rectangular Tubes Stainless Steel Round Rods Aquamet 22 Boat Shafts Other Ferrous and Non-Ferrous Metals Armor Plate Brass Bronze Carbon Steel Copper Copper-Nickel Titanium Available Shapes and Forms Angles Flat and Square Bars Round Tubes and Pipes Square and Rectangular Tubes Round Rods Sheet and Plate Fittings, Flanges and Elbows Planks Gratings Moldings Hinges Channels Beams Tees Marine Grade Defense Profiles Tread Plate Perforated Flattened Expanded Armor Plate Zees Florida Industrial Metal Supplier Fort Lauderdale Industrial Metal Supplier Fort Lauderdale Aluminum Supplier Government Capability Statements Agencies Past Performances Resources Technical Information Resources FAQs Blog Statement of Liability – Disclaimer Contact Us Search Contact ADI Metal, INC. Home > Contact Us We’d be happy to help you with your metal needs, contact us! Hours: ADI Metal is open Monday to Friday 8:00 am – 3:30 pm U.S. Eastern Standard Time Address: ADI Metal, Inc. 2930 SW 2nd Ave. Fort Lauderdale, FL 33315 Toll Free: 866.825.9271 Phone: 954.523.6474 Fax: 954.779.7355 Email: sales@adimetal.com Website: www.adimetal.com Social Networks: View Large Map REQUEST INFORMATION We are conveniently located near the Fort Lauderdale International Airport and Port Everglades and many exporters. Close to major highways, such as 595, I-95, Federal Highway and State road 84 and 441. ADI Metals Professional & Knowledgeable Sales Team (Click on thumbnail to enlarge) Betsy McGee President betsy@adimetal.com Andy Rath General Manager andy@adimetal.com Rolando Diaz Export Manager Rolando@ADIMetal.com Josh Rivera Sales Consultant josh@adimetal.com Bryan Rath Sales Consultant Bryan@adimetal.com Aluminum Alloy Products 535 Cast Aluminum 1100 Alloy Aluminum 3003 Alloy Aluminum 5052 Alloy Aluminum 5083 Marine Grade Aluminum Alloy 5086 Marine Grade Aluminum Sheet, Plate & Extrusions 5454 Alloy Aluminum 5456 Alloy Aluminum 6005 Aluminum 6061 Structural Marine Grade Aluminum 6063 Architectural Aluminum 6463 Aluminum Bright Dip Anodized or Brushed Finish Pipe Stainless Steel Products Stainless Steel Sheets and Plate Stainless Polished Tubes Stainless Steel Round Tubes and Pipes Stainless Steel Square and Rectangular Tubes Stainless Steel Round Rods Aquamet 22 Boat Shafts Other Ferrous and Non-Ferrous Metals Armor Plate Brass Bronze Carbon Steel Copper Copper-Nickel Titanium Available Shapes and Forms Angles Flat and Square Bars Round Tubes and Pipes Square and Rectangular Tubes Round Rods Sheet and Plate Fittings, Flanges and Elbows Planks Gratings Moldings Hinges Channels Beams Tees Marine Grade Defense Profiles Tread Plate Perforated Flattened Expanded Armor Plate Zees ADI Metal, Inc. 2930 SW 2nd Ave. Fort Lauderdale, FL 33315 Phone: +1 954.523.6474 Tollfree: 866.825.9271 Fax: +1 954.779.7355 Email: sales@adimetal.com Contact Us Sitemap Terms of Service Privacy Policy © 2025 Aluminum Distributing, Inc. , All Rights Reserved  |  Site created by Thomas Marketing Services and powered by Navigator Platform"
    },
    {
      "url": "https://www.puttingedge.com/golf-gala-bundle/",
      "text": "Golf Gala Bundle - Putting Edge Skip to content EN FR Opens at 11:00 am Fort Lauderdale, United States DIRECTIONS LOCATION DETAILS EN FR Locations Column 1 Ontario Nepean Scarborough Vaughan Whitby Nova Scotia Halifax Column 2 Quebec Montreal (Centre-Ville) Laval (Centropolis) Ville Saint-Laurent (Spheretech) United States Fort Lauderdale, FL Novi, MI Orlando, FL Parties & Events Birthday Parties Youth Group Events Celebrations Company Events About Glow In The Dark Mini Golf Arcade Make a Reservation Golf Gala Bundle GOLF n’ GALA BUNDLE Enjoy a generous 2 hour party timeslot for play. Guests may bring in their own fully prepared food and non-alcoholic beverages (when scheduling food for delivery, have it arrive 1 hour into the party). For parties/groups under age 13, please provide 1 adult chaperone for every 4 kids. These chaperones will be accompanying them on the golf course. There is no fee for these chaperones. Please ensure all guests arrive 10 minutes early so we can get you started on time! FREQUENTLY ASKED QUESTIONS See our answers to frequently asked questions below. But keep in mind that one can never truly prepare for the unordinary. That would make things way too ordinary. Are all Putting Edge locations the same? Each course has a unique 18 hole golf course design with a variety of arcade games and furnishings. How long does it take to play? A round of mini golf will take approximately 45 minutes to play, however you should allow yourself extra time to enjoy our arcade games as well Is everyone required to pay the admission price to enter the golf course? Yes. Our admission policy intentionally promotes family visits by allowing a child 3 years and under to play for free when accompanied with a paid General Admission. An exception is for group leaders who are supervising their pre-booked event. Are you wheelchair accessible? Our Lobby, Arcade and Party Rooms are fully accessible. Unfortunately our multi-level golf course is not. Do You Serve Alcohol? Alcoholic beverages can be served during private events by most caterers. All Quebec locations sell alcohol. Is your game suitable for all ages? We recommend the game for ages 9 to 99. How many people can play together at the same time? In order to keep a consistent rate of play on the course, we allow a maximum of 4 players to play together on one hole. Larger groups would be separated into two or more groups who would be playing on consecutive holes on the course. As an example, a group of 6 players would be separated into 2 groups of 3 players. Each group would play on separate holes. Are reservations required? Can I book online? Yes. You can request a tee time by clicking the \"make a reservation\" link at the top of the page. Do you serve food and beverages? Some of our locations have an assortment of snacks, bottled soft drinks, and frozen beverages. For our Golf N’ Gala package guests may bring fully prepared food or order delivery. Please see our Group Event or Birthday Party page for more details. Do you host Private Facility Rentals or events outside of regular operating hours? Yes, we will close to the public so your group can have exclusive use of our facility. We will also open at any time for your private event. Please contact our event planners at info@puttingedge.com to discuss how we can make it an unforgettable experience for all. Locations Parties & Events Influencers Copyright © 2025 Putting Edge. Produced by CREATIVE ONE®"
    },
    {
      "url": "https://www.puttingedge.com/test-form/",
      "text": "Test Form - Putting Edge Skip to content EN FR Opens at 11:00 am Fort Lauderdale, United States DIRECTIONS LOCATION DETAILS EN FR Locations Column 1 Ontario Nepean Scarborough Vaughan Whitby Nova Scotia Halifax Column 2 Quebec Montreal (Centre-Ville) Laval (Centropolis) Ville Saint-Laurent (Spheretech) United States Fort Lauderdale, FL Novi, MI Orlando, FL Parties & Events Birthday Parties Youth Group Events Celebrations Company Events About Glow In The Dark Mini Golf Arcade Make a Reservation PLAN YOUR FUN IN ADVANCE Online tee-off time requests will be confirmed by the next day. *Need a tee-off time sooner? Call us at (613) 224-4887 . Tee-off Date (Required) MM slash DD slash YYYY Tee-off Time (Required) Number of Guests (Required) Name (Required) First Name Last Name Email (Required) Phone (Required) Note: Online tee-off time requests will be confirmed by the next day. If you need a time sooner, please call us at (613) 224-4887 . For groups of 16 or more people, please call us at (613) 224-4887 to reserve. * Please note, Tee-off times are requests only and not reserved. Your Tee-Off time is not confirmed until confirmation has been sent from your desired location. How Do You Escape The Ordinary? Use the arrows or dots or swipe to browse our far from ordinary photo and video gallery FREQUENTLY ASKED QUESTIONS See our answers to frequently asked questions below. But keep in mind that one can never truly prepare for the unordinary. That would make things way too ordinary. Are all Putting Edge locations the same? Each course has a unique 18 hole golf course design with a variety of arcade games and furnishings. How long does it take to play? A round of mini golf will take approximately 45 minutes to play, however you should allow yourself extra time to enjoy our arcade games as well Is everyone required to pay the admission price to enter the golf course? Yes. Our admission policy intentionally promotes family visits by allowing a child 3 years and under to play for free when accompanied with a paid General Admission. An exception is for group leaders who are supervising their pre-booked event. Are you wheelchair accessible? Our Lobby, Arcade and Party Rooms are fully accessible. Unfortunately our multi-level golf course is not. Do You Serve Alcohol? Alcoholic beverages can be served during private events by most caterers. All Quebec locations sell alcohol. Is your game suitable for all ages? We recommend the game for ages 9 to 99. How many people can play together at the same time? In order to keep a consistent rate of play on the course, we allow a maximum of 4 players to play together on one hole. Larger groups would be separated into two or more groups who would be playing on consecutive holes on the course. As an example, a group of 6 players would be separated into 2 groups of 3 players. Each group would play on separate holes. Are reservations required? Can I book online? Yes. You can request a tee time by clicking the \"make a reservation\" link at the top of the page. Do you serve food and beverages? Some of our locations have an assortment of snacks, bottled soft drinks, and frozen beverages. For our Golf N’ Gala package guests may bring fully prepared food or order delivery. Please see our Group Event or Birthday Party page for more details. Do you host Private Facility Rentals or events outside of regular operating hours? Yes, we will close to the public so your group can have exclusive use of our facility. We will also open at any time for your private event. Please contact our event planners at info@puttingedge.com to discuss how we can make it an unforgettable experience for all. Locations Parties & Events Influencers Copyright © 2025 Putting Edge. Produced by CREATIVE ONE®"
    },
    {
      "url": "https://www.infoedge.in/About/BoardOfDirectors",
      "text": "Info Edge (India) Limited ABOUT Overview Quick Facts/Milestones Vision, Mission & Values Board of Directors Management Team BUSINESSES Overview Recruitment Real Estate Matrimony Education Investee Companies Research CAREERS MEDIA Press Releases Media Contact INVESTOR RELATIONS Disclosures under Regulation 46(2) of The SEBI Listing Regulations Corporate Governance Audit Committee Board Familiarisation Programme Constitution of Board & Committees CSR Projects: Independent Social Impact Assessment Reports Corporate Social Responsibility Projects Corporate Social Responsibility Committee Code of Conduct Corporate Social Responsibility Policy Dividend Policy Nomination & Remuneration Committee Policy on Material Subsidiaries Related Party Transaction Policy Stakeholders' Relationship Committee Whistle Blower Policy Contact details of KMP for determining Materiality of Information or Event Policy on Preservation, Archival & Destruction of Documents Policy on Determining Materiality of Events/ Information Policy for Personal Investments and Engagment by Executive Leadership with other Entities Policy on Redressal of Investor Grievances Supplier Code of Conduct Sustainable Supply Chain Policy Anti-Bribery and Anti-Corruption Policy Environmental, Social and Governance Policy Health and Safety Policy Human Rights Policy Procurement Policy Corporate Presentations Financial Data Sheet Zomato Call Transcript Earnings Call Transcript Earnings Call Recording Investee Company Financial Results - Standalone & Consolidated Results - Consol & Subsidiary Companies Revenue Recognition Rules Summary Financials Investor Services Investor FAQs Investor Contact Sign up for Alerts Shareholder Satisfaction Survey Communication to Shareholders Tax on Dividend News & Events Announcements Corporate Presentations Naukri JobSpeak Press Releases Newspaper Publication Other Releases Reports & Fillings Annual Report AGM Filings MOA & AOA Quarterly Reports QIP Document 2020 Results - Standalone Company Shares Analysts Coverage Historic Share Price Share Chart Share Price Unpaid / Unclaimed Dividends Postal Ballot & Form Employees Stock Options Employees Stock Option Scheme ESOP Disclosure Annual Return Info Edge(India) Ltd. Subsidary Companies Amalgamation SECURITY & PRIVACY CONTACT Registered & Corporate Office Summons/Notices Grievances ABOUT ABOUT Quick Facts/Milestones Vision, Mission & Values Board of Directors Management Team BUSINESSES Overview Recruitment Real Estate Matrimony Education Investee Companies Research CAREERS MEDIA Press Releases Media Contact INVESTOR RELATIONS Financials Summary Financials Data Sheet Results - Standalone Company Results - Consol & Subsidiary Companies Zomato Call Transcript Earnings Call Transcript Earnings Call Recording Investee Company Financial Revenue Recognition Rules Corporate Presentations Shares Share Price Share Chart Historic Share Price Analysts Coverage Reports & Fillings Annual Report AGM Fillings MOA & AOA Quarterly Reports QIP Document 2020 Results - Standalone Company News & Events Press Releases Announcements Naukri JobSpeak Corporate Presentations Newspaper Publication Other Releases Corporate Governance Constitution of Board & Committees Audit Committee Stakeholders' Relationship Committee Nomination & Remuneration Committee Corporate Social Responsibility Projects CSR Projects: Independent Social Impact Assessment Reports Corporate Social Responsibility Committee Code of Conduct Dividend Policy Related Party Transaction Policy Policy on Material Subsidiaries Whistle Blower Policy Corporate Social Responsibility Policy Board Familiarisation Programme Contact details of KMP for determining Materiality of Information or Event Policy on Preservation, Archival & Destruction of Documents Policy on Determining Materiality of Events/ information Policy for Personal Investments and Engagment by Executive Leadership with other Entities Policy on Redressal of Investor Grievances Supplier Code of Conduct Sustainable Supply Chain Policy Anti-Bribery and Anti-Corruption Policy Environmental, Social and Governance Policy Health and Safety Policy Human Rights Policy Procurement Policy Investor Services Investor FAQs Investor Contact Sign up for Alerts Shareholder Satisfaction Survey Communication to Shareholders Unpaid / Unclaimed Dividends Postal Ballot & Form Employees Stock Options Employees Stock Option Scheme ESOP Disclosure Annual Return Info Edge (India) Ltd. Subsidiary Companies Amalgamation SECURITY & PRIVACY CONTACT Registered & Corporate Office Summons/Notices Grievances SEND TO A FRIEND Send to a Friend Print This Page Board of Directors Kapil Kapoor Chairman and Non-Executive Director Prior to joining Info Edge, Mr. Kapoor was the Global Chief Operating Officer for Timex Group USA, Inc. until May 2013. He was also Chairman and Managing director of the publicly held Timex Group India Limited from October 2000 onwards. Mr. Kapoor started his professional career in 1987 with Nestle India Limited. He later worked with Bausch & Lomb, where he was part of the startup team that launched RayBan sunglasses and the Bausch & Lomb vision care range in India. He subsequently went on to manage the overseas marketing territories of Russia, Ukraine and East Africa in addition to the SAARC region. In 1996, Mr. Kapoor relocated to Thailand as the Country Manager for Bausch & Lomb and Commercial Director for South East Asia and the SAARC region. He has a Bachelor of Arts degree in Economics from the University of Delhi and a Post Graduate Diploma in Management (PGDM) from the Indian Institute of Management (IIM), Ahmedabad. KAPIL KAPOOR IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Independent Director - Niyogin Fintech Limited Director - International Foundation for Research and Education Sanjeev Bikhchandani Promoter and Executive Vice-Chairman Mr. Bikhchandani’s work experience includes an advertising position at Lintas India Limited, a marketing position at HMM Limited (now known as Glaxo SmithKline), and a senior management position at CMYK Printech Private Limited (owner of The Pioneer newspaper). Along with his partner, Mr. Hitesh Oberoi, he won the Ernst and Young – Entrepreneur of the Year award in 2008 for Business Transformation. He also won the Dataquest Pathbreaker Award and the Teacher’s Achievement Award for Business in 2008. He is a frequent speaker on entrepreneurship at conferences and at business schools. He obtained a Bachelor of Arts degree in Economics from St. Stephen College, Delhi University in 1984 and a PGDM from IIM-Ahmedabad in 1989. SANJEEV BIKHCHANDANI IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Nominee Director - Eternal Limited (Formerly known as Zomato Limited) Director - Naukri Internet Services Limited Director - Government Emarketplace Director - Redstart Labs (India) Limited Director - CIIE Initiatives Director - Allcheckdeals India Private Limited Director - Makesense Technologies Limited Director - Jeevansathi Internet Services Private Limited Director - Startup Internet Services Limited Director - Calangute Advisory Services Private Limited Director - International Foundation for Research and Education Director - Smartweb Internet Services Limited Director - Startup Investments (Holding) Limited Director - Gujarat Foundation for Entrepreneurial Excellence Hitesh Oberoi Co-Promoter, Managing Director & CEO Mr. Oberoi’s prior experience includes a 4 year stint with Hindustan Unilever Limited where he last worked as a Regional Planning and Distribution Manager for its Ice Cream Division With almost 18 years of experience in the internet industry, he is part of various industry forums. He is a charter member of the TiE, New Delhi and also the past Chairman of IAMAI – The Internet and Mobile Association of India. He is also a Founder an on the Board of Trustees of Ashoka University. Along with his partner, Mr. Sanjeev Bikhchandani, he won the Ernst & Young – Entrepreneur of the Year award in 2008 for Business Transformation. He obtained a Bachelor of Technology degree in Computer Science from Indian Institute of Technology (IIT), Delhi in 1994 and an MBA from IIM, Bangalore in 1996. At IIM, he featured in the Director’s Merit List. HITESH OBEROI IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Director - Naukri Internet Services Limited Director - Allcheckdeals India Private Limited Director - Jeevansathi Internet Services Private Limited Director - International Foundation for Research and Education Director - Startup Investments (Holding) Limited Director - IIMB Innovations Chintan Thakkar Whole-time Director & CFO Mr. Thakkar is a Chartered Accountant by profession and has around two-and-a-half decades of experience in Finance, Consulting and Operations. His experience includes creating innovative business models, joint ventures, structuring of transactions, merger and acquisition integration, fund raising, capital structuring, licensing models and large deals ranging right from software licenses to real estate. Prior to joining Info Edge in 2014, he worked with Computer Associates. CHINTAN THAKKAR IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Director - Allcheckdeals India Private Limited Director - Makesense Technologies Limited Director - Sunrise Mentors Private Limited Director - Jeevansathi Internet Services Private Limited Director & CEO - Startup Investment (Holding) Limited Director - NewInc Internet Services Private Limited Director - Diphda Internet Services Limited Director - Smartweb Internet Services Limited Director - Startup Internet Services Limited Ashish Gupta Non-Executive, Independent Director and Chairman- Nomination and Remuneration Committee Mr. Ashish Gupta, a U.S. National, holds a bachelor’s degree in computer science from Indian Institute of Technology, Kanpur, where he was awarded the President’s Gold Medal and a doctorate from Stanford University, U.S.A in database technology. Mr. Gupta is a partner at Helion Venture Partners, investing in early stage companies in India and in the U.S. Mr. Gupta has been involved in several startups in the U.S. and in India as an investor and a board member. These include Daksh, now part of International Business Machines (IBM). He is also a co-founder of Tavant Technologies. Before working at Tavant Technologies, Mr. Gupta was at Amazon.com which he joined in 1998 with the acquisition of Junglee.com where Mr. Gupta was co-founder, vice president of engineering, and a board member. He has also worked at Oracle Corporation and at IBM’s Almaden Research Center. Mr. Gupta has published and presented numerous papers at international conferences as well as edited a book on “materialized views” published by Massachusetts Institute of Technology press. ASHISH GUPTA IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Independent Director - Indegene Limited Director - Cyllid Technologies Private Limited Director - Whatfix Private Limited Director - Urbanclap Technologies India Private Limited Director - Infrrd Inc Director - Webaroo Inc, USA Director - Atomiton Director - Livespace (Singapore) Director - Baffle inc Director - Workspot Ms. Geeta Mathur Non-Executive, Independent Director and Chairperson- Risk Management Committee and Corporate Social Responsibility Committee Ms. Geeta Mathur started her career with ICICI Bank, where she worked for over 10 years and represented ICICI Bank as nominee Director of ICICI on the Board of Eicher Motors, SIEL Ltd. and Rollaitainers Ltd. She also has served in various capacities in the large organizations like IBM, DCM Group, Emaar MGF. She transitioned to development sector and worked as CFO of Helpage India, one of the largest and oldest national level NPO, working for cause of elderly. She successfully transitioned to an oracle ERP package and introduced effective processes for cashflow management, budgeting etc. and was awarded for best presented and transparency in accounts during her tenure. At present she is associated with IPE Global, an international development consulting group providing technical assistance and solutions for equitable development and sustainable growth in developing countries, where she is engaged with them as a financial expert in project with CIFF and Government of Rajasthan in area of Women and Child nutrition and development. She also serves on advisory board of Saajha, a non-profit enabling greater parental engagement in Governmental schools to improve learning of children. Ms. Mathur is a Chartered Accountant and has done Graduation from Shri Ram College of Commerce, Delhi University. She has wide experience in finance with over 25 years of experience in banking, large corporate treasuries, investor relations and development sector and specializes in the area of project, corporate and structured finance, treasury, investor relations and strategic planning. GEETA MATHUR IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Independent Director - Healthcare Global Enterprises Limited Independent Director - Healthcare Global Enterprises Limited Independent Director - Travel Food Services Limited Additional  Director - Dixon Technologies (India) Limited Director - Novopor Advanced Science Private Limited Director - Hero Housing Finance Limited Director - IPE Global Centre for Knowledge and Development Director - Canara HSBC Life Insurance Company Limited Director - Ummeed Housing Finance Private Limited Limited Director - Sentiss Pharma Private Limited Limited Director - JSW One Platforms Limited Ms. Aruna Sundararajan Non-Executive, Independent Director and Chairperson- Stakeholder Relationship Committee Ms. Aruna Sundararajan is a retired officer of the Indian Administrative Service. She served as the Secretary to the Government of India in the Ministries of Steel, IT and Telecom; and retired as Chairperson of the Digital Communications Commission in July 2019. During her tenure, Ms. Sundararajan played a pioneering role in steering various important tech policies and initiatives; across the domains of telecom and hardware manufacturing, e-governance, digital payments, data protection, cyber security and tech startups. Post her retirement, Ms. Sundararajan serves on the Boards of leading companies including Delhivery and Bharat FIH, India’s National Bank of Infra Financing and Development (NabFID), Cochin international Airport and a neo-banking start-up called Digi Vriddhi. She is also an active member of various tech mentoring and angel financing initiatives. She has rich experience of over 30 (thirty) years in governance and public administration and over 15 (fifteen) years in technology and public policy. ARUNA SUNDARARAJAN IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Independent Director - Delhivery Limited Independent Director - L&T Technology Services Limited Director - Cochin International Airport Limited Director - Digivriddhi Technologies Private Limited Independent Director - National Bank for Financing Infrastructure and Development Independent Director - Kannur International Airport Limited Mr. Arindam Kumar Bhattacharya Non-Executive, Independent Director Mr. Arindam Kumar Bhattacharya was educated at the Indian Institute of Technology, Kharagpur, Indian Institute of Management, Ahmedabad, and Warwick Manufacturing Group, University of Warwick, UK where he completed Doctorate of Engineering. He started his career with the Eicher Group in India as a graduate engineer trainee, has over 30 (thirty) years of experience in the industry and consulting with focus on the industrial sector. He is a member of Confederation of Indian Industry's (CII) National Council, International Advisory Board of Oxford India Center of Sustainable Development, Oxford University, School of Global Policy and Strategy, University of California, San Diego and Munjal School for Global Manufacturing at the Indian Business School. He was the Senior Partner and Director of the Boston Consulting Group, India, and the co-leader of Bruce Henderson Institute, BCG's thought leadership institution. He led BCG India for 6 years. He was member of global leadership team of the Global Advantage, and was earlier member of the global leadership teams of Industrial Goods, Public Sector and Social Impact practices and co-leader of BCG's Global Advantage Initiative. As a BCG Fellow over the past three years he has focused his research on Globalization and has been writing and speaking extensively on the subject. He has led the BCG's growing engagement with Central and State Governments on both economic and on social sector topics like education and health, and consulted with organizations like World Food Programme, Save the Children, Gates Foundation and World Bank. Presently he holds Board membership in Bajaj Holdings & Investment Limited, Lemon Tree Hotels Limited, Fleur Hotels Private Limited and Bajaj Housing Finance Limited. ARINDAM BHATTACHARYA IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Independent Director - Bajaj Finance Limited Independent Director - Bajaj Holdings & Investment Limited Independent Director - Bajaj Housing Finance Limited Director - Arindam Advisory Services Private Limited Independent Director - Gaja Alternative Asset Management Limited Mr. Pawan Goyal Whole-time Director Mr. Pawan Goyal holds a bachelor’s degree in Computer Science from Indian Institute of Technology, Kanpur, and a doctorate from the University of Texas at Austin in computer networking. He has 25 plus years of industry experience in business, engineering, and research leadership roles. His general management experience spans Enterprise, OEM, SMB, and consumer businesses. His research and development experience spans broad range of computing: virtualization, cloud computing, networking, storage systems, operating systems, databases, etc. He has 30+ publications, and several patents in these areas. He has lead the conception, delivery and GTM of several 1.0 products. Prior to joining Info Edge in 2019, he worked with Adobe Systems. He has previously worked with Microsoft, Veritas, IBM, Ensim, and AT&T Labs. Presently he holds Board membership in Bulbul's Skill Development Foundation and Sunrise Mentors Private Limited. PAWAN GOYAL IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Director - Sunrise Mentors Private Limited Director - Bulbul’s Skill Development Foundation Mr. Sanjiv Sachar Non-Executive, Independent Director and Chairman- Audit Committee Mr. Sanjiv Sachar, is a Fellow member of the Institute of Chartered Accountants of India and holds a bachelor degree of Arts in Economics from Hindu College, University of Delhi. He has retired as the Senior Partner of Egon Zehnder in 2016, the world's largest privately held executive search firm. Mr. Sachar has set up the Egon Zehnder practice in India in 1995 and has played a key role in establishing the firm as a market leader in the executive search space across various industry segments. Over the course of his two decades at Egon Zehnder, Mr. Sachar has mentored senior executives across industry sectors that today are either Board members, CEOs or CFOs of large corporates in India and overseas. He has also been a co-founder of a Chartered Accountancy and Management Consulting firm, M/s. Sachar Vasudeva & Associates and co-founded an executive search firm, Direct Impact. He had started his corporate career in the finance function with SRF Nippondenso (now known as Denso), one of the world's largest manufacturer of starter motors. Post qualifying as a Chartered Accountant in 1982, Mr. Sanjiv started his career with the management consulting division of AF Ferguson (now part of Deloitte). He is the partner of the Delhi Chapter of Social Venture Partners, a global Philanthropic network.He is also the chief Mentor of Huddle, an incubator located in Gurgaon. Presently, he holds the Board membership in HDFC Bank Limited and KDDL Limited and is also the Designated Partner of Sachar & Sachar LLP. SANJIV SACHAR IS ALSO ON THE BOARD OF THE FOLLOWING COMPANIES: Independent Director - KDDL Limited Designated Partner - Sachar & Sachar LLP Senior Advisor India -  KPMG Assurance and Consulting Services LLP Corporate Office Info Edge (India) Limited B - 8, Sector - 132 Noida - 201304 India Phone: +91-120-4841100, +91-120-3082000 Fax: +91-120-3082095 E-mail: investors@naukri.com Registered Office Info Edge (India) Limited GF-12A, 94 Meghdoot Building, Nehru Place, New Delhi-110019 Other Office Info Edge (India) Limited A-88, Sector -2, Noida-201301 India Follow us on Working Hours 9:30 AM to 6 PM, Monday to Saturday, Except Holidays All rights reserved © 2015 Info Edge India Ltd., CIN No.: L74899DL1995PLC068021"
    },
    {
      "url": "https://www.linkedin.com/company/edge-solutions-llc",
      "text": "Edge Solutions LLC | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Join now Sign in Edge Solutions LLC Information Technology & Services Alpharetta, Georgia 2,569 followers Edge Solutions simplifies information technology by providing creative solutions in a multi-cloud world. Follow Discover all 84 employees Report this company About us Edge Solutions simplifies information technology by providing creative solutions in a multi-cloud world. We are experts in keeping your data secure, accessible, and compliant. By combining our deep engineering expertise for next generation technologies, with best-in-class consulting services, we help enterprises drive a cloud-adoption strategy to achieve business objectives. For more information, please visit www.edge-solutions.com. Website http://www.edge-solutions.com External link for Edge Solutions LLC Industry Information Technology & Services Company size 11-50 employees Headquarters Alpharetta, Georgia Type Privately Held Founded 2008 Specialties Data center management, server and storage virtualization, storage management, data protection information management, and asset and services contract management Locations Primary 11520 Davis Dr Suite 300 Alpharetta, Georgia 30009, US Get directions Employees at Edge Solutions LLC Alexander Theodore Chief Technology Officer Stephen W. Edge. NCP-MCI,SSCP A husband, a father, a son, a child of God. Who is also a Senior System Engineer specializing in Hyper-Converged Infrastructure, Data Protection and… Jack W. Parks Hilary Harris See all employees Updates Edge Solutions LLC 2,569 followers 1w Report this post We are proud to share that Edge Solutions has been named the # 1 in the Medium Category for the Atlanta Business Chronicle Best Place to Work in Atlanta!\n\nLast night, our team had the honor of attending the Best Places to Work Awards dinner, where we received this incredible recognition. What makes this award even more meaningful is that it’s based on confidential employee surveys, measuring trust in leadership, communication, team dynamics, and workplace culture.\n\nTo be recognized as the top workplace in Atlanta is a direct reflection of our people; their passion, collaboration, and commitment to building a culture where everyone can thrive.\n\nWe’re grateful to our amazing team for making Edge Solutions such a special place to work. This award belongs to each and every one of you! Julie Haley | Michael Haley | Darin DeHart | Jay Waggoner | Samantha Vince | Alexander Theodore | Glenn Bezanson | Eric Smotherman, CPA | Thomas Anderson | Chad Young #DreamTeam #BestPlacestoWork #AtlantaBestPlacestoWork #AtlantaBusinessChronicle #DesignYourEdge +2 107 11 Comments Like Comment Share Edge Solutions LLC 2,569 followers 2w Report this post ✨ Exciting Updates to the Edge Solutions Leadership Team!\n\nEdge Solutions believes that great companies are built by great people and that strong leadership is essential to delivering lasting value to our customers, partners, and team. Today, we are excited to announce a series of leadership transitions that reflect both our continued growth and our commitment to investing in the future of our organization.\n\n• Jay Waggoner has been named President of Edge Solutions\n• Thomas Anderson has been appointed Director of Sales\n• Chad Young has been appointed Vice President of Enterprise Strategy, Network & Security\n• Eric Smotherman, CPA has been promoted to Controller\n• Darin DeHart will transition into the role of Managing Director\n\nFor information and details about our organizational changes, please see the full post on our website: https://lnkd.in/dDpH3PBx These transitions represent a dynamic new chapter for Edge Solutions, and we’re confident that this team of leaders will help us continue to grow, innovate, and serve our clients with excellence.\n\nPlease join us in congratulating Darin, Jay, Thomas, Eric, and Chad on their well-earned new roles! Darin DeHart | Jay Waggoner | Thomas Anderson | Eric Smotherman, CPA | Chad Young | Julie Haley | Michael Haley | Alexander Theodore | Samantha Vince | Glenn Bezanson #Leadership #EdgeSolutions #Growth #TeamUpdate #PeopleFirst 176 19 Comments Like Comment Share Edge Solutions LLC 2,569 followers 1mo Report this post Cyber threats are evolving faster than ever—leaving no room for complacency. From compliance to prevention to response, services like penetration testing, compliance audits, and incident response planning are essential to protecting your organization’s data, reputation, and future.\n\nRead our latest blog to learn the key cybersecurity services every business needs: https://lnkd.in/ep57peG9 Julie Haley | Michael Haley | Darin DeHart | Jay Waggoner | Samantha Vince | Glenn Bezanson | Alexander Theodore | Bryan Copeland | Brent Holt | Jackie G. 43 Like Comment Share Edge Solutions LLC 2,569 followers 1mo Report this post We are excited to be a sponsor of Tech Alpharetta's upcoming TopGolf Classic in September! Tech Alpharetta 7,179 followers 1mo Reserve your bay or sponsor a contest hole to showcase your brand to the tech community at the Tech Alpharetta TopGolf Classic!  \n\nSign up here: https://bit.ly/3Q5TDe0 and reach out to tiff@techalpharetta.com for sponsorship questions. 29 1 Comment Like Comment Share Edge Solutions LLC 2,569 followers 2mo Report this post While at the WBENC National Conference this week, our team had the pleasure of hosting an exclusive dinner at Arnaud’s with some incredible women in Supplier Diversity. We enjoyed an evening full of great conversations, new connections and authentic New Orleans cuisine.\n \nThank you to everyone who joined us! #WBENC #SupplierDiversity #WomeninBusiness #EdgeSolutions Julie Haley | Michael Haley | Darin DeHart | Samantha Vince | Jay Waggoner | Glenn Bezanson | Alexander Theodore | Lisa Brabham | Conor D. 50 3 Comments Like Comment Share Edge Solutions LLC 2,569 followers 3mo Report this post We were excited to participate in Arctic Wolf's Partner JAM! Arctic Wolf focused on their latest platform enhancements, current cybersecurity landscape insights, effective sales approaches, and tools available to support partner success.\n\nThank you to Arctic Wolf for your partnership—we look forward to continued collaboration and shared growth ahead. #CyberSecurity #EdgeSolutions #ArcticWolf #PartnerEnablement #SecurityInsights Darin DeHart | Julie Haley | Michael Haley | Samantha Vince | Jay Waggoner | Alexander Theodore | Glenn Bezanson | Lisa Brabham | Jackie G. | Brent Holt | Bryan Copeland 33 Like Comment Share Edge Solutions LLC 2,569 followers 3mo Report this post Edge Solutions is excited to share that we will be moving our headquarters in Alpharetta to a larger location on Davis Drive starting August 1st!\n \nThis marks a significant milestone in our journey as we continue to grow, innovate, and deliver exceptional solutions to our clients and partners.\n \nOur new space is designed with collaboration, flexibility, and the future in mind—giving our team and partners the environment they need to do their best work and better serve our clients.\n \nFor more information, the full press release can be found below. We can’t wait to welcome our customers and partners to the new space this August! https://lnkd.in/grFp4Eid #EdgeSolutions #Growth #NewHQ #Innovation #PeopleFirst #WomenOwnedBusiness Julie Haley | Michael Haley | Darin DeHart | Samantha Vince | Jay Waggoner | Alexander Theodore | Glenn Bezanson | Lisa Brabham 387 50 Comments Like Comment Share Edge Solutions LLC 2,569 followers 3mo Report this post Thank you to all who attended our inaugural Edge Defend Cybersecurity Summit yesterday at the Hamilton Hotel in Alpharetta. \n \nThis event brought together cybersecurity leaders, practitioners, and experts for a full day of insightful keynotes, expert panels, and open dialogue on the evolving threat landscape and real-world strategies for building stronger security postures.\n \nOur sponsor expo provided a dedicated space for valuable networking and meaningful conversations between industry partners and attendees.\n \nThank you to our sponsors and speakers who made this event possible. We appreciate your time and partnership in making this event a success! #EdgeDefend #Cybersecurity #ITLeadership #CyberResilience #EdgeSolutions Julie Haley | Michael Haley | Darin DeHart | Samantha Vince | Glenn Bezanson | Jay Waggoner | Alexander Theodore | Lisa Brabham | Jackie G. | Brent Holt | Bryan Copeland Abnormal AI | Axonius | Cyber Crucible, Inc. | Expel | Palo Alto Networks | Red Canary | Seraphic Security | Tanium +3 56 2 Comments Like Comment Share Edge Solutions LLC 2,569 followers 3mo Report this post We have officially kicked off our inaugural Edge Defend Cybersecurity Summit! \n\nThank you to our sponsors for making this possible. Abnormal AI | Axonius | Cyber Crucible, Inc. | Expel | Palo Alto Networks | Red Canary Seraphic Security | Tanium Julie Haley | Michael Haley | Darin DeHart | Samantha Vince | Alexander Theodore | Glenn Bezanson | Lisa Brabham | Jay Waggoner | Jackie G. | Brent Holt | Bryan Copeland 86 1 Comment Like Comment Share Edge Solutions LLC 2,569 followers 3mo Report this post CRN®, a brand of The Channel Company , has recognized Edge Solutions on the 2025 CRN Solution Provider 500 list CRN®, a brand of The Channel Company, has recognized Edge Solutions on the 2025 CRN Solution Provider 500 list — marking our 13th consecutive year receiving this prestigious recognition.\n \nCRN’s annual Solution Provider 500 list recognizes North America’s largest solution providers by revenue and serves as a prominent benchmark of leading IT services companies. With a combined revenue of $548.9 billion, the companies on the list are key influencers propelling growth in the IT industry and the global technology channel. \n\nThank you to our staff, clients, and partners for making this possible! #SolutionProvider #Top500 Julie Haley | Michael Haley | Darin DeHart | Samantha Vince | Jay Waggoner | Glenn Bezanson | Lisa Brabham | Alexander Theodore 35 Like Comment Share Join now to see what you are missing Find people you know at Edge Solutions LLC Browse recommended jobs for you View all updates, news, and articles Join now Similar pages EDGE Solutions & Consulting Inc. IT Services and IT Consulting Agoura Hills, California Edge Human Resources Services Mountain View, CA Edge Solutions Pvt Ltd Construction Verinext IT Services and IT Consulting Blue Bell, PA EDGE Business Systems Business Supplies & Equipment Roswell, Georgia Expel Computer and Network Security Herndon, Virginia ivision IT Services and IT Consulting Atlanta, Georgia Edge Solutions Travel Management Company Leisure, Travel & Tourism Karachi, Sindh MOVE Technology Partners IT Services and IT Consulting St Petersburg, FL Cumberland Group Information Technology & Services Atlanta, GA Show more similar pages Show fewer similar pages Browse jobs Infrastructure Architect jobs 31,612 open jobs Manager jobs 1,880,925 open jobs Investor jobs 21,910 open jobs Information Technology Administrator jobs 27,693 open jobs Vice President jobs 235,270 open jobs Director of Product Management jobs 14,985 open jobs Enterprise Account Executive jobs 44,389 open jobs Senior Sales Executive jobs 58,764 open jobs Release Engineer jobs 16,720 open jobs Strategic Account Executive jobs 37,453 open jobs Sales Director jobs 83,949 open jobs Account Executive jobs 71,457 open jobs Partnerships Manager jobs 61,442 open jobs Sales Manager jobs 310,050 open jobs Director jobs 1,220,357 open jobs Engineer jobs 555,845 open jobs Sales Consultant jobs 91,260 open jobs Office Manager jobs 164,964 open jobs Partner jobs 644,825 open jobs Human Resources Specialist jobs 34,340 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Executive jobs Full Stack Engineer jobs Windows Administrator jobs Analyst jobs Android Developer jobs Account Executive jobs Account Manager jobs Marketing Manager jobs Talent Acquisition Manager jobs Data Engineer jobs Senior Project Manager jobs Enterprise Account Executive jobs Engineer jobs Area Sales Director jobs Project Manager jobs Enterprise Sales Director jobs Office Manager jobs Strategic Account Executive jobs Senior Solutions Engineer jobs Senior Solutions Architect jobs Senior Sales Engineer jobs Information Technology Architect jobs Sales Director jobs Head jobs Director jobs Solutions Engineer jobs Intern jobs Solutions Architect jobs Business Manager jobs Chief Information Security Officer jobs Chief Executive Officer jobs System Sales Engineer jobs Solutions Specialist jobs Principal Consultant jobs Channel Sales Manager jobs Sales Technician jobs Senior Director Information Technology jobs Head of Information Security jobs Business Development Executive jobs Sales Development Representative jobs Head of Information Technology jobs Chief Information Officer jobs Technology Officer jobs Specialist jobs Information Technology Manager jobs Vice President jobs Research Analyst jobs Researcher jobs Data Analyst jobs Marketing Specialist jobs Geospatial Analyst jobs Presales Manager jobs Player jobs Inside Sales Manager jobs Unity Developer jobs Engineering Manager jobs Talent Acquisition Coordinator jobs Talent Acquisition Recruiter jobs Internal Recruiter jobs Corporate Recruiter jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Edge Solutions LLC Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.puttingedge.com/",
      "text": "Putting Edge - 18 Holes of Glow-In-The-Dark Golf Fun! Skip to content EN FR Opens at 11:00 am Fort Lauderdale, United States DIRECTIONS LOCATION DETAILS EN FR Locations Column 1 Ontario Nepean Scarborough Vaughan Whitby Nova Scotia Halifax Column 2 Quebec Montreal (Centre-Ville) Laval (Centropolis) Ville Saint-Laurent (Spheretech) United States Fort Lauderdale, FL Novi, MI Orlando, FL Parties & Events Birthday Parties Youth Group Events Celebrations Company Events About Glow In The Dark Mini Golf Arcade Make a Reservation Do Something far from ordinary Book Your Reservation Now Select Your Preferred Location * Select Your Preferred Location Nepean, Ontario Scarborough, Ontario Vaughan, Ontario Whitby, Ontario Halifax, Nova Scotia Montreal (Centre-Ville), Quebec Laval (Centropolis), Quebec Ville Saint-Laurent (Spheretech), Quebec Fort Lauderdale, United States Novi, United States Orlando, United States PERFECT FOR ANY OCCASION Date Night SOCIAL OUTINGS FAMILY FUN PARTIES & EVENTS HOW DO YOU ESCAPE THE ORDINARY? From the moment you enter one of our “Black lit” courses, you have left “the real world” and have entered a dizzying universe full of fun, imagination, and activity. You will be immersed in a kaleidoscope of dazzling “Glow-in-the-Dark” colors, images and sounds, rocking your senses in extraordinary and unbelievable ways. LET'S DO THIS! BOOK YOUR TEE TIME You can request your tee time online by clicking your desired location on the link below. Reservations are required to avoid long wait periods. Walk-ins are welcome, subject to availability. MAKE A RESERVATION Planning a large party? Please visit our Parties & Events page or call us directly. LOCATION, LOCATION, LOCATION! FIND A PUT T ING EDGE NEAR YOU Each Putting Edge venue features a unique glow-in-the-dark golf course , a glow-in-the-dark arcade and lobby featuring images and sounds, rocking your senses in unordinary, unbelievable ways. Remember At Put t ing Edge, the weather is guaranteed! FIND A PUTTING EDGE NEAR YOU Nepean, Ontario Scarborough, Ontario Vaughan, Ontario Whitby, Ontario Halifax, Nova Scotia Montreal (Centre-Ville), Quebec Laval (Centropolis), Quebec Ville Saint-Laurent (Spheretech), Quebec Fort Lauderdale, United States Novi, United States Orlando, United States Fort Lauderdale, United States Inside Xtreme Action Park, 5300 Powerline Rd, Fort Lauderdale, FL 33309 VIEW MAP Our Store Opens at 11:00 am Monday - Thursday 11:00 am - 10:00 pm Friday - Saturday 11:00 am - 12:00 am Sunday 11:00 am - 10:00 pm MAKE A RESERVATION PLAN A PARTY FAR FROM THE ORDINARY! Our party planners are committed to making sure every detail meets perfection – from finding the best date to facilitating all of your special requests. You focus on the fun, we’ll handle the rest. Birthday Parties Youth Group Events Celebrations Company Events AN EXPERIENCE LIKE NO OTHER! IT'S LIKE TRAVELLING TO ANOTHER PLANET FREQUENTLY ASKED QUESTIONS See our answers to frequently asked questions below. But keep in mind that one can never truly prepare for the unordinary. That would make things way too ordinary. Are all Putting Edge locations the same? Each course has a unique 18 hole golf course design with a variety of arcade games and furnishings. How long does it take to play? A round of mini golf will take approximately 45 minutes to play, however you should allow yourself extra time to enjoy our arcade games as well Is everyone required to pay the admission price to enter the golf course? Yes. Our admission policy intentionally promotes family visits by allowing a child 3 years and under to play for free when accompanied with a paid General Admission. An exception is for group leaders who are supervising their pre-booked event. Are you wheelchair accessible? Our Lobby, Arcade and Party Rooms are fully accessible. Unfortunately our multi-level golf course is not. Do You Serve Alcohol? Alcoholic beverages can be served during private events by most caterers. All Quebec locations sell alcohol. Is your game suitable for all ages? We recommend the game for ages 9 to 99. How many people can play together at the same time? In order to keep a consistent rate of play on the course, we allow a maximum of 4 players to play together on one hole. Larger groups would be separated into two or more groups who would be playing on consecutive holes on the course. As an example, a group of 6 players would be separated into 2 groups of 3 players. Each group would play on separate holes. Are reservations required? Can I book online? Yes. You can request a tee time by clicking the \"make a reservation\" link at the top of the page. Do you serve food and beverages? Some of our locations have an assortment of snacks, bottled soft drinks, and frozen beverages. For our Golf N’ Gala package guests may bring fully prepared food or order delivery. Please see our Group Event or Birthday Party page for more details. Do you host Private Facility Rentals or events outside of regular operating hours? Yes, we will close to the public so your group can have exclusive use of our facility. We will also open at any time for your private event. Please contact our event planners at info@puttingedge.com to discuss how we can make it an unforgettable experience for all. Locations Parties & Events Influencers Copyright © 2025 Putting Edge. Produced by CREATIVE ONE®"
    },
    {
      "url": "https://officeedge.com/fort-lauderdale/contact/",
      "text": "Contact | Office Edge Skip to content English Español Locations 954-848-2800 All Locations Boca Raton 561.962.2900 Coral Gables​ 305.777.0200 Fort Lauderdale 954.848.2800 Miami Brickell 305.728.5200 Sunrise 954.838.7747 Company Home English English Español CONTACT US 954-848-2800 Services & Pricing Virtual Office Customized Virtual Office Plans Business Mailing Address Office Space Private Offices Privacy-Focused Coworking​ Meeting Rooms Conference Rooms & Offices Video Conferencing Receptionist & Administrative Live Virtual Receptionists Virtual Assistants Inbound Answering Service Legal Services Legal Assistant / Paralegal Business Formation Registered Agent Law Firm Support Bookkeeping Services Virtual Bookkeeping Outsourced Accounting Department Office & Area Our Office Nearby Amenities Local Licensing Fort Lauderdale Business Tax Broward County Business Tax State and Local Licensing About Fort Lauderdale About Broward County About Us Company Home All Locations Boca Raton 561.962.2900 2385 NW Executive Center Drive Suite 100 Boca Raton, FL 33431 Coral Gables​ 305.777.0200 4000 Ponce de Leon Boulevard Suite 470 Coral Gables, FL 33146 Fort Lauderdale 954.848.2800 500 East Broward Boulevard Suite 1710 Fort Lauderdale, FL 33394 Miami Brickell 305.728.5200 701 Brickell Avenue Suite 1550 Miami, FL 33131 Sunrise 954.838.7747 1580 Sawgrass Corporate Parkway Suite 130 Sunrise, FL 33323 English English Español Facebook LinkedIn Instagram YouTube Contact Us 954-848-2800 All Locations Boca Raton 561.962.2900 Coral Gables​ 305.777.0200 Fort Lauderdale 954.848.2800 Miami Brickell 305.728.5200 Sunrise 954.838.7747 Company Home English English Español CONTACT US 954-848-2800 Services & Pricing Virtual Office Customized Virtual Office Plans Business Mailing Address Office Space Private Offices Privacy-Focused Coworking​ Meeting Rooms Conference Rooms & Offices Video Conferencing Receptionist & Administrative Live Virtual Receptionists Virtual Assistants Inbound Answering Service Legal Services Legal Assistant / Paralegal Business Formation Registered Agent Law Firm Support Bookkeeping Services Virtual Bookkeeping Outsourced Accounting Department Office & Area Our Office Nearby Amenities Local Licensing Fort Lauderdale Business Tax Broward County Business Tax State and Local Licensing About Fort Lauderdale About Broward County About Us Company Home All Locations Boca Raton 561.962.2900 2385 NW Executive Center Drive Suite 100 Boca Raton, FL 33431 Coral Gables​ 305.777.0200 4000 Ponce de Leon Boulevard Suite 470 Coral Gables, FL 33146 Fort Lauderdale 954.848.2800 500 East Broward Boulevard Suite 1710 Fort Lauderdale, FL 33394 Miami Brickell 305.728.5200 701 Brickell Avenue Suite 1550 Miami, FL 33131 Sunrise 954.838.7747 1580 Sawgrass Corporate Parkway Suite 130 Sunrise, FL 33323 English English Español Facebook LinkedIn Instagram YouTube Contact Us Contact We're here to help. Drop us a line or send us a message. Phone Number (954) 848-2800 EMAIL FTL-info@officeedge.com Address 500 East Broward Boulevard Suite 1710 Fort Lauderdale, FL 33394 Contact Us - Fort Lauderdale Name * Last * Email * Phone * Message * I agree to the terms and conditions provided by the company. By providing my phone number, I agree to receive text messages from the business. * No Yes Submit If you are human, leave this field blank. Δ (954) 848-2800 FTL-info@officeedge.com Fort Lauderdale Services Virtual Office Plans Private Offices Video Conferencing Live Virtual Receptionists Legal Assistant / Paralegal Virtual Bookkeeping Fort Lauderdale Office Overview About the Office Contact Us Our Company Company Home Company Blog About Office Edge Our Locations Boca Raton Coral Gables Fort Lauderdale Miami Brickell Sunrise Contact Us 954-848-2800 Services & Pricing Virtual Office Customized Virtual Office Plans Business Mailing Address Office Space Private Offices Privacy-Focused Coworking​ Meeting Rooms Conference Rooms & Offices Video Conferencing Receptionist & Administrative Live Virtual Receptionists Virtual Assistants Inbound Answering Service Legal Services Legal Assistant / Paralegal Business Formation Registered Agent Law Firm Support Bookkeeping Services Virtual Bookkeeping Outsourced Accounting Department Our Office Nearby Amenities Local Licensing Fort Lauderdale Business Tax Broward County Business Tax State and Local Licensing About Fort Lauderdale About Broward County Hamburger Toggle Menu About Us Company Home All Locations Boca Raton 561.962.2900 2385 NW Executive Center Drive Suite 100 Boca Raton, FL 33431 Coral Gables​ 305.777.0200 4000 Ponce de Leon Boulevard Suite 470 Coral Gables, FL 33146 Fort Lauderdale 954.848.2800 500 East Broward Boulevard Suite 1710 Fort Lauderdale, FL 33394 Miami Brickell 305.728.5200 701 Brickell Avenue Suite 1550 Miami, FL 33131 Sunrise 954.838.7747 1580 Sawgrass Corporate Parkway Suite 130 Sunrise, FL 33323 English English Español Buy Annual, Get 1 Month Free. CALL NOW"
    },
    {
      "url": "https://oceansedgeschool.com/",
      "text": "Creative Biblical Leadership Studies Training, Christian Education Program & Pastoral Counseling Degree Fort Lauderdale FL, College/University For Business | Degrees In Worship Music - Ocean's Edge Skip to content About Mission & Vision History Beliefs Location Explore South Florida Frequently Asked Questions Visit Campus Apply Contact Us About Mission & Vision History Beliefs Location Explore South Florida Frequently Asked Questions Visit Campus Apply Contact Us About Mission & Vision History Beliefs Location Explore South Florida Frequently Asked Questions Visit Campus Apply Contact Us Ocean’s Edge School Kelsey Curran 2025-04-17T15:56:14-04:00 WE ARE A CHOSEN GENERATION Now Accepting Internship Applications for Summer and Fall 2025 ABOUT US The heart of Ocean’s Edge is to develop ministry leaders, musicians, producers, and pastors for a lifetime of ministry. Our learning environment combines personal mentoring and discipleship with leadership development, along with practical ministry training through Internships at Calvary Chapel Fort Lauderdale. Interns will have the opportunity to learn from experienced leaders and then put what they’ve learned into practice. 18 Years Operating FL Campus Location NEXT STEPS Visit Apply OCEAN’S EDGE 2401 W Cypress Creek Rd Fort Lauderdale, FL 33309 954-556-4242 Info@OceansEdgeSchool.com Job Opportunity Sitemap About Mission & Vision History & Beliefs Location Visit Visit Campus © Copyright . Ocean's Edge Page load link"
    },
    {
      "url": "https://thedoorfactoryfl.com/contact/",
      "text": "Get in Touch with The Door Factory: Contact Information Skip to content (954) 564-2834 990 Northwest 36th Street \nOakland Park, FL 33309 Menu Home About Residential Commercial Hurricane Impact Hardware Reviews Contact Menu Home About Residential Commercial Hurricane Impact Hardware Reviews Contact CONTACT CALL (954) 564-2834 Crafting Superior Doors Since ‘73 Free Estimates Available For the added convenience of our valued customers, The Door Factory offers free estimates on custom doors, stock doors, impact-rated doors and other products. Give us a call at (954) 564-2834 to find out more! Call (954) 564-2834 Email info@thedoorfactoryfl.com Connect with us Message Us Name * Phone * Email * Message * CAPTCHA URL This field is for validation purposes and should be left unchanged. South Florida’s Finest Doors & Hardware Mon - Fri: 8:00am to 4:00pm Sat: 9:00am to 12:00pm LOCATION 990 Northwest 36th Street Oakland Park, FL 33309 EMAIL US info@thedoorfactoryfl.com CALL US (954) 564-2834 Home About Residential Commercial Hurricane Impact Hardware Reviews Contact © 2020 - All Rights Reserved Website Design & Marketing by OMG National | Privacy Home About Residential Commercial Hurricane Impact Hardware Reviews Contact Close"
    },
    {
      "url": "https://kovacksecurities.com/ContactUs.html",
      "text": "Contact Us -  Kovack Securities, Inc. / Kovack Financial Companies You seem to have Javascript disabled. This website needs javascript in order to function properly! Home About Us About KSI Who We Are KSI In The News Kovack Advisors KSI Insurance Regulation Best Interest Form CRS Account Protection BCP Disclosure Products & Services Clearing Services Revenue Sharing Agreements Industry Affiliations Order Routing Information Privacy Notice CIP Notice Contact Information Account Access Client Account Access: Pershing Fidelity PortfolioOne Join Our Firm Contact Us Contact Information Careers InTouch Contact Us Corporate Headquarters: 6451 North Federal Highway Suite 1201 Fort Lauderdale, Florida 33308 800-711-4078 Phone: (954) 782-4771 Fax: (954) 943-7331 Email: info@kovacksecurities.com Copyright ©, Kovack Financial Companies. Member FINRA / SIPC 6451 North Federal Highway, Suite 1201 Fort Lauderdale, Florida 33308 Ph: (954) 782-4771 Fax: (954) 943-7331 Email: info@kovacksecurities.com 866-564-6574 | Privacy Notice | Contact Us Check the background on this investment firm at FINRA's BrokerCheck Form CRS"
    },
    {
      "url": "https://www.puttingedge.com/locations/fort-lauderdale",
      "text": "Fort Lauderdale - Putting Edge Skip to content EN FR Opens at 11:00 am Fort Lauderdale, United States DIRECTIONS LOCATION DETAILS EN FR Locations Column 1 Ontario Nepean Scarborough Vaughan Whitby Nova Scotia Halifax Column 2 Quebec Montreal (Centre-Ville) Laval (Centropolis) Ville Saint-Laurent (Spheretech) United States Fort Lauderdale, FL Novi, MI Orlando, FL Parties & Events Birthday Parties Youth Group Events Celebrations Company Events About Glow In The Dark Mini Golf Arcade Make a Reservation Fort Lauderdale NOW OPEN! WHEN WE ARE OPEN OUR REGULAR HOURS Monday - Thursday 11:00 am - 10:00 pm Friday - Saturday 11:00 am - 12:00 am Sunday 11:00 am - 10:00 pm Summer hours and school holidays: We open early for some school holidays. Please call for details. MAKE A RESERVATION VIEW MAP Admission Price $17 Paid Admission is required to enter the golf course. The last game can start one hour before close. Contact us to discuss your private event booking. All sales are final. ESCAPE THE ORDINARY? Use arrows or dots or swipe to browse our gallery of far from ordinary photos and videos PUT T ING EDGE FORT LAUDERDALE Inside Xtreme Action Park, 5300 Powerline Rd, Fort Lauderdale, FL 33309 (954) 491 6265 events@xtremeactionpark.com VIEW MAP Locations Parties & Events Influencers Copyright © 2025 Putting Edge. Produced by CREATIVE ONE®"
    },
    {
      "url": "https://www.puttingedge.com/parties-events/",
      "text": "Parties & Events - Putting Edge Skip to content EN FR Opens at 11:00 am Fort Lauderdale, United States DIRECTIONS LOCATION DETAILS EN FR Locations Column 1 Ontario Nepean Scarborough Vaughan Whitby Nova Scotia Halifax Column 2 Quebec Montreal (Centre-Ville) Laval (Centropolis) Ville Saint-Laurent (Spheretech) United States Fort Lauderdale, FL Novi, MI Orlando, FL Parties & Events Birthday Parties Youth Group Events Celebrations Company Events About Glow In The Dark Mini Golf Arcade Make a Reservation Group Events That Are Far From Ordinary PLAN A PARTY THAT GLOWS-IN-THE-DARK Are you looking to host a party that’s as wild and unforgettable as you are? You don’t need to look any further as we have all of your par-TEE bases covered. Whether it be for a birthday party , a holiday party or a company event , let Putting Edge take care of the fun for you, and we will open anytime for your pre-booked private event. To delight your guests and make life easier for you, we also have our ready-to-go party invites . PERFECT FOR ANY OCCASION BIRTHDAY PARTIES Planning the best birthday party for your kid is a seriously big deal. We are committed to making sure every detail is perfect. Learn More YOUTH GROUP EVENTS Whether it be a church group, sports team or gaming club, Putting Edge can help you plan your event. Learn More COMPANY EVENTS Hey HR rep, time to be a hero and book your next company event with us. It’s GLOW TIME! Learn More CELEBRATIONS Don’t fit into any other category? Don’t worry you don’t need a reason to get together and celebrate with family & friends. Learn More Locations Parties & Events Influencers Copyright © 2025 Putting Edge. Produced by CREATIVE ONE®"
    }
  ]
}