{
  "fuentes": [
    {
      "url": "https://www.pvconcerthall.com/contact",
      "email": "ampinfo@theamp.com"
    },
    {
      "url": "https://pontevedrarecorder.com/",
      "email": "news@pontevedrarecorder.com"
    },
    {
      "url": "https://www.perthconcerthall.com.au/about/team/",
      "email": "info@dlsgc.wa.gov.au"
    },
    {
      "url": "https://www.wedding-spot.com/venue/6329/ponte-vedra-concert-hall/",
      "email": "valet@2x.png"
    },
    {
      "url": "https://www.pvconcerthall.com/events/box-office-ticketing",
      "email": "ampinfo@theamp.com"
    },
    {
      "url": "https://www.pvconcerthall.com/connect/contact",
      "email": "ampinfo@theamp.com"
    },
    {
      "url": "https://www.pvconcerthall.com/privacy-policy",
      "email": "ampinfo@theamp.com"
    },
    {
      "url": "https://www.pvconcerthall.com/privacy-policy",
      "email": "ampinfo@theamp.com"
    },
    {
      "url": "https://www.sjcfl.us/sjc-cultural-events-inc-to-oversee-operation-and-management-of-st-augustine-amphitheatre-and-ponte-vedra-concert-hall/",
      "email": "tjarnagin@sjcfl.us"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "administrativedirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "communications@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "culturalengagement@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "innovationliaison@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "managingdirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "programcoordinator@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "sponsorship@communityartsmentorship.com"
    },
    {
      "url": "https://www.ticketmaster.com/ponte-vedra-concert-hall-tickets-ponte-vedra-beach/venue/279520",
      "email": "claimsinquiry@allianzassistance.com"
    }
  ],
  "mails": [
    "administrativedirector@communityartsmentorship.com",
    "ampinfo@theamp.com",
    "claimsinquiry@allianzassistance.com",
    "communications@communityartsmentorship.com",
    "culturalengagement@communityartsmentorship.com",
    "info@dlsgc.wa.gov.au",
    "innovationliaison@communityartsmentorship.com",
    "managingdirector@communityartsmentorship.com",
    "news@pontevedrarecorder.com",
    "programcoordinator@communityartsmentorship.com",
    "sponsorship@communityartsmentorship.com",
    "tjarnagin@sjcfl.us",
    "valet@2x.png"
  ],
  "nombre_sitio": "pvconcerthall.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pvconcerthall.com/contact",
      "text": "Contact Us | Ponte Vedra Concert Hall Skip to content Accessibility Buy Tickets Search Newsletter Signup St. Augustine Amphitheatre Menu Close Search Submit search Newsletter Signup St. Augustine Amphitheatre Events & Tickets Upcoming Events Box Office & Ticketing Digital Tickets Seating Map Visit Directions & Parking PVCH Guide Security & Policies Nearby Hotels Accessibility About About PVCH Archive Renovations News & Media Tech Packet Support Volunteer Friends of PVCH Partners & Sponsorships Connect Newsletter Signup News & Media Media Credentials Request Contact Us Careers Merch Search Search Submit search Home • Connect • Contact Us General Information Email: ampinfo@theamp.com Box Office: (904) 209-0399 Information: (904) 209-3746 Fax: (904) 209-3758 Mailing Address: 1340C A1A South St. Augustine, FL 32080 Events & Tickets Upcoming Events Box Office & Ticketing Seating Map Visit Directions & Parking PVCH Guide Security & Policies Nearby Hotels Accessibility About About PVCH Archive Renovations News & Media Tech Packet Support Volunteer Friends of PVCH Partners & Sponsorships Connect Newsletter Signup News & Media Media Credentials Request Contact Us Careers Merch Address Ponte Vedra Concert Hall 1050 A1A North Ponte Vedra Beach, Florida 32082 Box Office Phone: 904-209-0399 © 2025\t\t\t\t\t\tPonte Vedra Concert Hall. | Site Map | Terms & Conditions | Privacy Policy | Accessibility a carbon house experience Top"
    },
    {
      "url": "https://pontevedrarecorder.com/",
      "text": "Home - The Ponte Vedra Recorder Thursday, September 11, 2025 Rack Locations Clay Today 81 ° Mostly Clear Forecast Advanced search Toggle navigation Main menu Home News Sports Business In the Arts Lifestyles Nocatee One of Us Obituaries Pro Football Pick'em Contests+ E-Editions Legals Specials Agriculture Automotive Books Business Education & Careers Entertainment Food Gardening Green Living Health Home Improvement Kids & Family Lifestyle Money Matters Outdoors Pets Real estate Seniors Spanish Tech Travel Trivia, History & Games Subscribe Advanced search Primrose School fosters generosity In celebration of the back-to-school season, the children at Primrose School on Crosswater Parkway cheerfully donated more than 1,000 school supplies to St. Johns Cares. \n\n In addition to school  … Ponte Vedra High National Honor Society hosts sand art competition Ponte Vedra High School’s National Honor Society (NHS) hosted their annual Sand Art Competition on Wednesday, Sept. 3, at Mickler’s Landing Beach. \n\n Ponte Vedra hosts this event every year to  … River Garden celebrates 80 years River Garden Senior Services has provided a wide range of high-quality nonprofit senior care services in Northeast Florida for 80 years. As they celebrate this longevity, they are looking forward to  … NEWS United Way to host inaugural Putnam Jubilee United Way of St. Johns and Putnam Counties has announced The Putnam Jubilee, a first-of-its-kind celebration dedicated to community, connection and giving back. This special event will take place  … Rosh Hashanah Dinner set for Sept. 22 Chabad at the Beaches is inviting the entire community to usher in the Jewish New Year with warmth, tradition and togetherness. \n\n At 7 p.m. Monday, Sept. 22, the Aaron and Blanche Scharf Chabad  … The Recorder - September 11, 2025 View this issue Browse other issues 2025 Winner's Circle - Best of the Best 2025 View this issue Browse other issues The Register - August/September 2025 View this issue Browse other issues 2025 Hurricane Guide - June 5, 2025 FEATURES Kathy’s Gardening Guide: Bromeliads Tropical landscapes gain interest and color with the addition of bromeliads! These unique plants feature decorative leaves in red, green, purple, orange and yellow. Leaves may have stripes, spots or  … Ocean Palms brings sunshine to staff Ocean Palms celebrated Staff Appreciation Week with nothing but sunshine for its sun-sational staff. \n\n The sun rose with a breakfast from Chick-fil-a and coffee from Starbucks on Monday. The next  … Feel your best at Local Wellness Step into Local Wellness and discover not just an artfully designed space complete with cabanas and cozy seating, but a team of educated professionals dedicated to helping customers look and feel  … The legacy of Lady Di’s dress Bunny O’Neill knew she had a small window of opportunity to speak to Lady Diana, Princess of Wales, and she was determined to make the most of it. \n\n “We were at Christie’s Auction in June  … Brookdale celebrates Earth Day with first harvest Brookdale Southside, a Jacksonville senior living community, hosted a special event on April 22 in honor of Earth Day where the community celebrated its brand-new Garden Club. \n\n The Brookdale  … IN THE ARTS Cummer Museum updates hours of operation The Cummer Museum of Art & Gardens has updated its hours of operation, creating more opportunities for the community to experience its celebrated galleries and historic gardens. \n\n In addition  … Jacksonville Symphony to offer free community concerts The Jacksonville Symphony is hosting its annual free community concerts led by Assistant Conductor Nathaniel Efthimiou. These concerts feature exciting sneak peek into classical and pops favorites  … Unique WWII tribute to benefit Wolfson Children’s Hospital Long before his research was featured in The New Yorker, and long before he stood on stage at Carnegie Hall or led sold-out performances at the Kennedy Center, John Monsky was a Jacksonville kid with  … ‘Come From Away’ at Alhambra brings humanity and heart to the stage There were more than a few tears and discreetly passed tissues going around the audience as Alhambra Theatre & Dining brought the heart-wrenching story of “Come From Away” to life at its  … Jacksonville Symphony welcomes new assistant conductor Jacksonville Symphony’s newest assistant conductor, Na’Zir McFadden, has studied with some towering legends in the field, but it was a comment by the band leader at his boyhood church that  … More Local News Oasis Senior Advisors offer free service Oasis Senior Advisors is a free service that helps seniors and their families find senior living options. Their advisers work side-by-side with the families to help them figure out the type of care  … Dementia Caregiver Conference planned for January 10 The St. Johns County Dementia Care and Cure Initiative (DCCI) Task Force has announced it will hold a Dementia Caregiver Conference from 10 a.m. to noon Jan. 10, 2026, at River House, 179 Marine St.,  … Flagler College named one of nation’s best Flagler College has once again been recognized among the nation’s top undergraduate institutions by The Princeton Review. \n\n The college is profiled in the 2026 edition of “The Best 391  … Hispanic Chamber plans Hola Emprende Conference & Business Expo The First Coast Hispanic Chamber of Commerce (FCHCC) will present the Hola Emprende Conference and Business Expo on Sept. 19 and 20 at the Schultz Center in Jacksonville. \n\n The Hola Emprende  … Timucuan Parks Foundation hosts youth groups in its summer program Timucuan Parks Foundation (TPF) and its park partners, JaxParks and Florida State Parks, hosted multiple youth groups this summer at local wilderness parks and preserves as part of its Outdoor  … ONLY ON THE WEB COA’s River House announces September schedule The following programs will be held at COA’s River House, 179 Marine St., St. Augustine. Note: This list is not exhaustive. For anyone with questions, call 904-209-3655 (Monday-Thursday) or  … PLAYERS Community Senior Center announces September schedule The following programs will be held at COA’s THE PLAYERS Community Senior Center, 175 Landrum Lane, Ponte Vedra Beach. Note: This list is not exhaustive. Most activities are weekly. If you  … Ponte Vedra Branch Library announces September schedule Here are some September programs being offered at the Ponte Vedra Beach Branch Library, 101 Library Blvd., Ponte Vedra Beach. View the complete schedule at  … more web only postings NOCATEE HAPPENINGS Rise at Nocatee marks first anniversary Rise at Nocatee celebrated its first anniversary in style Aug. 21. There was catered food, live music, balloon bouquets and most importantly: people. \n\n About 70 attended the event at the 55-plus  … Meet the link’s newest team members When two key members of the team at the link announced that they would be moving on from their current positions, the iconic facility in Nocatee faced a critical challenge. \n\n Elaine Raby, director  … Circle of Creation: Small Business (Customer Relations) and EI + AI Community members gathered at the link in Nocatee on Wednesday, July 30, for the next session in the Circle of Creation series. \n\n Katy Keene, a marketing strategist, AI educator and founder of  … ONE OF US Suzanne Carlino Suzanne Carlino is the new head of the Ponte Vedra Beach Campus for The Bolles School. \n\n \n\n As the new head of the Ponte Vedra Beach Campus for The Bolles School, what will be your  … David J. Burch David J. Burch is managing partner for InLight Real Estate Partners. \n\n \n\n \n\n \n\n Tell us about your business or your organization. What is your position and what are your responsibilities? \n\n  … Pamela Lindor, M.D. Dr. Pamela Lindor has lived in Jacksonville since 2013. She is a pediatrician at the newly opened Bluebird Kids Health. \n\n Tell us about your business or your organization. What is your position,  … Diarmuid Graham Last spring, Diarmuid Graham, his wife and a friend opened a Graze Craze Charcuteries Boards & Boxes franchise in Ponte Vedra Beach. In addition, Graham is a successful pilot. \n\n \n\n How long  … Jayne G. Evans Jayne G. Evans is an active member of the community, volunteering with several key organizations. \n\n \n\n Tell me a little about yourself. \n\n My Ponte Vedra Beach story, as a fourth-generation  … SPORTS MaliVai Washington Youth Foundation named a Community Impact Hub The USTA Foundation recently announced that the MaliVai Washington Youth Foundation (MWYF) has been named one of its first Community Impact Hubs, a bold new initiative designed to leverage the power  … Sporting Jax loses to Dallas Trinity FC Sporting Jax fell to Dallas Trinity FC on Saturday, Sept. 6, 1-0. \n\n Dallas Trinity remains the only unbeaten team in the Gainbridge Super League. \n\n During the first half of the game, both teams  … St. Johns County high school football recap High school football was back in action on Friday, Sept. 5. The Creekside Knights were defeated at home by the Spruce Creek Hawks 27-13. Head coach Sean McIntyre has a young team with a lot to learn,  … Obituaries Charles “Chuck” Richard Ross Charles “Chuck” Richard Ross, of Fernandina Beach, FL, passed away peacefully on September 1, 2025, surrounded by his loving family. \n\n Born on March 9, 1941, in Westfield, New York, Chuck was  … Donald O. Brown Donald O. Brown, also known to many as “Don the Barber,” passed away peacefully at home on August 19, 2025, surrounded by his loving family. \n\n Born in Winston-Salem, NC, November 10, 1942, he  … Susanne Helena (Brouillard) Hord Susanne Helena (Brouillard) Hord, 79, passed away peacefully Wednesday, July 30, 2025, surrounded by her loving children, in her home overlooking her beloved Palm Valley Golf Course. “Sweet” Sue  … Margaret Mary “Peggy” Scrone Margaret Mary “Peggy” Scrone, lovingly known for her radiant spirit and unwavering faith, left this world peacefully on August 7, 2025, in Jacksonville, Florida, surrounded by her loved ones.  … Robert “Bob” Rooks Robert “Bob” Rooks, 78, of Baltimore, Maryland passed away on July 26, 2025 at his home in Ponte Vedra Beach, Florida. Bob is survived by his wife of 57 years, Geri, and his children: Robin,  … more obituaries Happy pills? The truth about depression medications and finding the right one SaveHealth reports on depression medications, emphasizing individual responses to treatments and the importance of combining meds with therapy for optimal outcomes. 95% of Americans hear therapy words daily. Here are the 9 we misuse most Thriveworks reports that 95% of Americans encounter therapy speak daily, yet many misuse terms like \"gaslighting\" and \"trauma.\" Debunking common myths about suicide Rula reports that suicide is a major issue in the U.S., with common myths debunked to promote awareness and support for those in need. The Fourth of July is one of the most dangerous times to drive Holidays are a time of celebration, but they also come with a heightened risk of car accidents. Increased travel, crowded roads, and alcohol use can all contribute to more dangerous driving conditions. Some holidays, like the Fourth of July, are particularly hazardous. Understanding how to reduce your risk and what to do if an accident happens can help keep you and your loved ones safe. From ski trails to hiking paths, extreme heat is reshaping recreation, and our attitudes Floodlight reports extreme heat is altering recreation, causing shorter ski seasons, and increasing climate change awareness among Americans. How Texas’ mid-decade redistricting could affect voters in one Houston community Votebeat reports mid-decade redistricting in Texas may disenfranchise voters in Houston's 18th District, complicating election and representation. Losing faith: Rural, religious campuses are among the most endangered The Hechinger Report reports that rural religious campuses are endangered, facing closures amid declining enrollment and financial struggles. This state's kindergarten vaccination rates decline as more parents claim exemptions Healthbeat reports Georgia's kindergarten vaccination rates have declined to 86.8%, with a rising exemption rate of 4.8%, raising outbreak concerns. AI teacher tools display racial bias when generating student behavior plans, study finds Chalkbeat reports a study reveals AI teacher assistants display racial bias, recommending harsher measures for Black-coded names compared to white-coded ones. African women are key to fighting climate change – these are the green skills they will need There’s a long list of green skills that women across Africa need so that they can get jobs and start businesses that help the world adapt to climate change. The top women's hairstyle in every state Hers reports that 51% of women value great hair over a vast wardrobe, highlighting a potential growth area for the hair care industry. Could your car be costing you extra on insurance? Way.com reports that despite a 17% drop in auto thefts in 2024, car insurance rates continue to rise due to economic and legal factors. Facebook 1102 A1A N, Unit 108 Ponte Vedra Beach, Florida 32082. news@pontevedrarecorder.com Sections News Sports Business In the Arts Lifestyles Nocatee One of Us Obituaries Pro Football Pick'em Contests+ E-Editions Legals Specials Subscribe Helpful links Home Contact us About us Subscribe Newsletter signup Get Social © Copyright 2025 The Ponte Vedra Recorder Powered by Creative Circle Media Solutions"
    },
    {
      "url": "https://www.perthconcerthall.com.au/about/team/",
      "text": "Perth Concert Hall | DLGSC Skip to main content × From 1 July 2025 DLGSC will be renamed the Department of Creative Industries, Tourism and Sport . Close menu Return to previous menu Main navigation The department About us Contact us Ministers Annual reports Regional WA Publications Strategy Policy Legislation Freedom of information Disability access and inclusion Public interest disclosure Child safeguarding News Media Events Careers Funding Gaming Community Trust Multicultural funding Regional funding Aboriginal funding Off-road vehicle grants Logo and acknowledgement Sport and recreation funding Active Regional Communities Grants Club Night Lights Program Community Recovery Grants Program Community Sporting and Recreation Facilities Fund KidSport North West Travel Subsidy Regional Athlete Travel Subsidy Scheme Regional Servicing Grants Sport and Recreation Events Funding Program WA Hiking Participation Grants Creative industries funding Arts key dates calendar Arts Projects for Individuals and Groups Arts Projects for Organisations Arts Short Notice Activity Program Contemporary Music Fund Public Regional Galleries Improvement Fund Regional Aboriginal Arts Development Local government For community My council Council elections Local Government Election Notices Call for nominations Induction for prospective candidates Cats and dogs Stop Puppy Farming Off-road vehicle areas Cemeteries and burials Caravan and camping grounds For local governments Support and advice Acts and regulations Council member training Compliance and governance Rates setting Local laws Boards and commissions Regional subsidiaries Strengthening local government Local government reforms Integrated planning and reporting Place Innovation Awards Activating Alfresco Rebate Program Supporting outdoor dining: guide for local governments Inquiries Sport and recreation Participation Organisation development People development Facility management Outdoor active recreation High performance Safety and integrity Research and policy Combat Sports Commission Gender diversity Sport and recreation funding Facilities funding KidSport Regional funding State sporting associations State Football Centre Every Club Starting a new club Managing a club Junior sport Education and training Recreation camps Bickley Ern Halliday Point Walter Quaranup Woodman Point Holiday camps Creative industries Creative industries funding Aboriginal arts and culture Regional arts Public art Research hub Cultural Infrastructure Toolkit Showcase Arts Activities in Regional Communities Arts Projects for Individuals and Groups Arts Projects for Organisations Arts Short Notice Activity Program Community Recovery Grants Public Regional Galleries Improvement Fund Regional Aboriginal Arts Development Regional Performing Arts Connecting to Country Contemporary Music Fund Creativity for Schools Creativity and Wellbeing for Young People PALS funding Regional Arts Venue Support Creative WA: A 10 year vision to grow and sustain our creative ecosystem Screen Industry Strategy State Arts and Culture Partnership Honours National Performing Arts Partnership State Cultural Treasures Aboriginal Cultural Centre Access and inclusion Aboriginal culture Aboriginal Cultural Centre Aboriginal history Family history General research Publications Right Wrongs '67 Referendum Gnarla Boodja Mili Mili Norman Tindale Collection Perth and Swan Orphanages and Missions Name Index Aboriginal Trackers of WA Index Aboriginal arts and culture Aboriginal funding Multicultural interests Multicultural events Harmony Week Resources and statistics Publications and policy Community grants Languages Funding forums Ethnic organisations Ethnic media Multicultural networks Education and training Migrant settlement Services and facilities Diversity training Leadership and governance Civics and citizenship Racing, gaming and liquor Liquor Liquor reforms Liquor applications Liquor licensing Training Find a licence Online lodgement guides Liquor Commission Protected Entertainment Precincts Banned Drinkers Register Approved managers Trading hours Advertised liquor applications Liquor restrictions Racing Racing applications Race fields Racing Penalties Appeal Tribunal Racing, gaming and wagering Gaming and Wagering Commission Gaming applications Casino Online portal Liquor legislation Racing and gaming legislation Liquor policies Racing and gaming policies Problem gambling Infrastructure Perth Film Studios Perth Concert Hall Perth Cultural Centre Sam Kerr Football Centre Australian Hockey Centre Funding facilities Community Sporting and Recreation Facilities Fund Club Night Lights Program Header navigation Accessibility About us Contact us Complaints Sign in Search Go to WA Government search Open navigation menu Search this website Main navigation The department About us Contact us Ministers Annual reports Regional WA Publications Strategy Policy Legislation Freedom of information Disability access and inclusion Public interest disclosure Child safeguarding News Media Events Careers Funding Gaming Community Trust Multicultural funding Regional funding Aboriginal funding Off-road vehicle grants Logo and acknowledgement Sport and recreation funding Active Regional Communities Grants Club Night Lights Program Community Recovery Grants Program Community Sporting and Recreation Facilities Fund KidSport North West Travel Subsidy Regional Athlete Travel Subsidy Scheme Regional Servicing Grants Sport and Recreation Events Funding Program WA Hiking Participation Grants Creative industries funding Arts key dates calendar Arts Projects for Individuals and Groups Arts Projects for Organisations Arts Short Notice Activity Program Contemporary Music Fund Public Regional Galleries Improvement Fund Regional Aboriginal Arts Development Local government For community My council Council elections Local Government Election Notices Call for nominations Induction for prospective candidates Cats and dogs Stop Puppy Farming Off-road vehicle areas Cemeteries and burials Caravan and camping grounds For local governments Support and advice Acts and regulations Council member training Compliance and governance Rates setting Local laws Boards and commissions Regional subsidiaries Strengthening local government Local government reforms Integrated planning and reporting Place Innovation Awards Activating Alfresco Rebate Program Supporting outdoor dining: guide for local governments Inquiries Sport and recreation Participation Organisation development People development Facility management Outdoor active recreation High performance Safety and integrity Research and policy Combat Sports Commission Gender diversity Sport and recreation funding Facilities funding KidSport Regional funding State sporting associations State Football Centre Every Club Starting a new club Managing a club Junior sport Education and training Recreation camps Bickley Ern Halliday Point Walter Quaranup Woodman Point Holiday camps Creative industries Creative industries funding Aboriginal arts and culture Regional arts Public art Research hub Cultural Infrastructure Toolkit Showcase Arts Activities in Regional Communities Arts Projects for Individuals and Groups Arts Projects for Organisations Arts Short Notice Activity Program Community Recovery Grants Public Regional Galleries Improvement Fund Regional Aboriginal Arts Development Regional Performing Arts Connecting to Country Contemporary Music Fund Creativity for Schools Creativity and Wellbeing for Young People PALS funding Regional Arts Venue Support Creative WA: A 10 year vision to grow and sustain our creative ecosystem Screen Industry Strategy State Arts and Culture Partnership Honours National Performing Arts Partnership State Cultural Treasures Aboriginal Cultural Centre Access and inclusion Aboriginal culture Aboriginal Cultural Centre Aboriginal history Family history General research Publications Right Wrongs '67 Referendum Gnarla Boodja Mili Mili Norman Tindale Collection Perth and Swan Orphanages and Missions Name Index Aboriginal Trackers of WA Index Aboriginal arts and culture Aboriginal funding Multicultural interests Multicultural events Harmony Week Resources and statistics Publications and policy Community grants Languages Funding forums Ethnic organisations Ethnic media Multicultural networks Education and training Migrant settlement Services and facilities Diversity training Leadership and governance Civics and citizenship Racing, gaming and liquor Liquor Liquor reforms Liquor applications Liquor licensing Training Find a licence Online lodgement guides Liquor Commission Protected Entertainment Precincts Banned Drinkers Register Approved managers Trading hours Advertised liquor applications Liquor restrictions Racing Racing applications Race fields Racing Penalties Appeal Tribunal Racing, gaming and wagering Gaming and Wagering Commission Gaming applications Casino Online portal Liquor legislation Racing and gaming legislation Liquor policies Racing and gaming policies Problem gambling Infrastructure Perth Film Studios Perth Concert Hall Perth Cultural Centre Sam Kerr Football Centre Australian Hockey Centre Funding facilities Community Sporting and Recreation Facilities Fund Club Night Lights Program Home Infrastructure Perth Concert Hall Perth Concert Hall redevelopment A new tempo for Perth’s home of music and entertainment. After half a century of unforgettable performances, the iconic heritage-listed Perth Concert Hall is undergoing a revitalisation — set to elevate the experience for artists, audiences, and the community for generations to come. The Perth Concert Hall redevelopment project will breathe new life into this iconic venue, celebrating its heritage status and enhancing its internal and external features. This revitalisation will preserve the Perth Concert Halls renowned acoustics and architecture, introduce redesigned and landscape forecourts, improve accessibility and refurbished facilities to create a more welcoming environment. The Perth Concert Hall is now a live construction site which is safely fenced off as demolition works to the southern forecourt are underway. Project background As part of the $1.7 billion Perth City Deal , $150.3 million has been allocated to the Perth Concert Hall redevelopment, comprising $134.3 million from the WA Government, $12 million from the Australian Government, and $4 million from the City of Perth. The investment will restore the much-loved heritage building’s architectural integrity, preserve its renowned acoustics, distinctive features and enhance the surrounding outdoor spaces. The improved facilities will allow for broader community engagement and equitable access. Artist’s impressions and fly through Architecture credited to WITH and OMA, animation credited to Panizzon Studio, music credited to the West Australian Symphony Orchestra. Detailed design The redevelopment of this historic building will introduce a range of enhancements designed to elevate the venue as a premier destination for the performing arts. What to expect from the redevelopment Improved accessibility Key features of the project include improved accessibility from street level as well as improved backstage facilities, which will support patrons, artists and production teams, ensuring seamless performances and a better overall experience for all. Auditorium seating and production features A complete replacement of seating will not only enhance comfort but also improve sightlines in the hall, making every concert an unforgettable occasion, while preserving the building’s world class acoustics. A new fully automated stage lift will streamline production logistics, making it easier to host a diverse array of performances. A new home for the West Australian Symphony Orchestra (WASO) This exciting project will realise a long-standing commitment to provide WASO with a home, co-locating the administrative and orchestral staff in the one location. Improved backstage facilities A full revitalisation of the backstage facilities will improve performer experience, ensuring the Perth Concert Hall retains its reputation as a desired performance venue into the future. Upgraded safety and compliance Safety and compliance upgrades will be prioritised, with significant improvements to the building fabric and systems throughout to ensure a safe and secure environment for all attendees. Revitalised social and event spaces Visitors will benefit from expansion of the level two foyer towards the river which will be home to new bar areas, providing convenient refreshment options and fostering a lively social atmosphere before and after performances. The addition of landscaped event spaces will create inviting outdoor areas for gatherings and festivals, enriching the cultural fabric of the precinct. Reinvigorating Perth's cultural landmark These improvements will activate the Perth Concert Hall, reinforcing its role as a vibrant cultural hub in the heart of Perth. As part of a broader initiative to enhance Western Australia’s arts infrastructure, this redevelopment marks a significant investment into the future of performing arts in Perth. Timeline Late 2024 Venue closes 2025 Contract award and construction commences 2026 Construction End 2027 Construction complete, testing and handover Early 2028 Official opening Who is involved The management order for the building was held by the City of Perth for 50 years. It has now returned to the State for ongoing care and control. The Perth Concert Hall project is governed by an inter-agency Steering Committee with the Department of Local Government, Sport and Cultural Industries (DLGSC) as the Chair. The Steering Committee has representation from the following WA Government agencies: Department of Local Government, Sport and Cultural Industries Department of Finance Department of Premier and Cabinet Department of Treasury Arts and Culture Trust As well as: Commonwealth Department of Infrastructure, Transport, Regional Development, Communications and the Arts Engagement process To help bring the Perth Concert Hall redevelopment to life, extensive collaboration with key stakeholders and surrounding organisations was undertaken to gather feedback and shape clear, achievable project goals. Throughout the delivery of the project, the stakeholders will continue to be engaged, to ensure the vision of the Perth Concert Hall is delivered. Some of the stakeholders have included: West Australian Symphony Orchestra (WASO) WA Venues and Events (WAVE) Arts and Culture Trust (ACT) Government agencies Perth Concert Hall neighbours Aboriginal Elders Perth Concert Hall users City of Perth (CoP) Next steps For the redevelopment to take place safely, the Perth Concert Hall and its forecourts are closed to the public during construction works. Demolition works are underway until July 2025. Main works are set to commence November 2025. Register your interest If you are interested in project updates, register your interest below. Exception occured while executing the controller. Check error logs for details. News Progress continues on Perth Concert Hall transformation 3 July 2025 Find out what’s happening and what’s to come in the redevelopment project Breaking ground raises curtain on concert hall refurbishment 20 May 2025 Preliminary works commenced in April for the $150.3 million transformation of the historic Perth Concert Hall Perth Concert Hall redevelopment on cue to commence 7 January 2025 The start of a new year has raised the curtain on redevelopment works that will transform Perth’s historic Perth Concert Hall. Redevelopment to allow iconic Perth Concert Hall to shine 26 September 2024 The $150.3 million redevelopment of the much-loved Perth Concert Hall is set to begin in early 2025, to restore the building's architectural legacy, preserve its renowned acoustics and enhance connections to the surrounding forecourts. Extra $97.6m to make Perth Concert Hall home of music in WA 13 March 2023 The Premier has announced an extra $97.6m in State Government funding towards the Perth Concert Hall redevelopment, while attending the opening of the WA Symphony Orchestra (WASO) 2023 classical season. Celebrating 50 years of our iconic Perth Concert Hall 27 January 2023 Perth Concert Hall celebrations to mark 50 years of performances at heritage-listed venue. World-renowned acoustics and brutalist architecture key features of 1,891 seat building. Golden ticket giveaway, exhibit and guided tours for venue-goers part of 50th birthday. Architect named for Perth Concert Hall redevelopment 10 March 2022 WITH Architecture Studio and OMA have been appointed as lead architects for the redevelopment of Western Australia's iconic Perth Concert Hall. More media statements Previous news item Next news item Page reviewed 20 May 2025 Acknowledgement of Country The Government of Western Australia acknowledges the traditional custodians of this land. We pay tribute and our respects to Elders past and present. Learn about Aboriginal history Connect with us Facebook Twitter Instagram YouTube LinkedIn Sign up for email newsletters Sign up for newsletters Have your say Help us improve our service or tell us what is working really well. Leave your feedback Footer navigation WA.gov.au Copyright Disclaimer Privacy About this website Sitemap © Department of Local Government, Sport and Cultural Industries, Government of Western Australia Back to top"
    },
    {
      "url": "https://www.wedding-spot.com/venue/6329/ponte-vedra-concert-hall/",
      "text": "Ponte Vedra Concert Hall | Venue - Ponte Vedra Beach, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Photo by: Pure Sugar Studios Photography Report Ponte Vedra Concert Hall 904-209-3746 CALL VENUE FAVORITE Venue highlights Valet parking Venue details Style: Banquet Hall/Restaurant, Event Center Guest capacity: Accommodates up to 880 guests Services: Ceremony / Reception Indoor VIEW OPTIONS Location: 1050 A1A North Ponte Vedra Beach, FL 32082 Description: The St. Johns County Cultural Events Division is proud to present its newest venue to the community: The Ponte Vedra Concert Hall, a multipurpose performing arts facility located in the heart of Ponte Vedra Beach. The large performance stage is the ideal venue for you to tie the knot with your loved one. On the stage the Ponte Vedra Concert Hall staff can create a beautiful ceremony arch draped with white fabric and flowers. While walking down the white aisle and onto the stage, you will truly feel like royalty.The aisle will be lined with shimmering candles, and your guests will shed tears of joy as you finally share your first kiss as a married couple. In the Ponte Vedra Concert Hall, you can customize the decor as you wish. Along with its classically elegant interior, the staff will be happy to help you make your wedding unique with various flowers, seating, and unlimited decorations. READ MORE Additional details Service Options Venue notes The rental fee is $2,150 for a ceremony and reception and includes 8 hours of event time including set up and clean up time. Additional hours can be arranged for a fee of $100/hr. Amenities and Restrictions Amenities - Bride's dressing area - Groom's dressing area - Podium and/or stage - No kitchen - Large parking lot - Dance floor available for an additional fee - Piano available for an additional fee Restrictions - General liability insurance required - Approved outside caterer allowed - Amplified music OK indoors only - Smoking outside only - Alcohol must be provided by venue - Music must end by 10:30PM Amenities - Bride's dressing area - Groom's dressing area - Podium and/or stage - No kitchen - Large parking lot - Dance floor available for an additional fee - Piano available for an additional fee Restrictions - General liability insurance required - Approved outside caterer allowed - Amplified music OK indoors only - Smoking outside only - Alcohol must be provided by venue - Music must end by 10:30PM Links Ponte Vedra Concert Hall 904-209-3746 CALL VENUE FAVORITE Venue Highlights Valet parking STARTING AT $3,899 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor only Max Indoor capacity: 880 Reception Indoor only Max Indoor capacity: 200 STARTING AT $3,899 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://www.pvconcerthall.com/events/box-office-ticketing",
      "text": "Box Office & Ticketing | Ponte Vedra Concert Hall Skip to content Accessibility Buy Tickets Search Newsletter Signup St. Augustine Amphitheatre Menu Close Search Submit search Newsletter Signup St. Augustine Amphitheatre Events & Tickets Upcoming Events Box Office & Ticketing Digital Tickets Seating Map Visit Directions & Parking PVCH Guide Security & Policies Nearby Hotels Accessibility About About PVCH Archive Renovations News & Media Tech Packet Support Volunteer Friends of PVCH Partners & Sponsorships Connect Newsletter Signup News & Media Media Credentials Request Contact Us Careers Merch Search Search Submit search Home • Events • Box Office & Ticketing Box Office & Ticketing AXS is the official ticketing partner for Ponte Vedra Concert Hall. Please see the list of frequently asked questions under \"AXS: Important Information & FAQs\" to learn more about the fan experience with AXS. Box Office Location & Hours Ponte Vedra Concert Hall Box Office is open: Monday - Sunday: 7:00 AM - 5:00 PM Please Note: Ponte Vedra Concert Hall Box Office accepts credit and debit card payments only. Merch Store & Kookaburra Outpost Ponte Vedra Concert Hall is pleased to announce the grand opening of its brand new merch store and Kookaburra Outpost, located inside the Box Office. To learn more, click here. AXS: Important Information & FAQs Tickets should only be purchased from PVConcertHall.com , in person at our box office, or via AXS . Please note that purchasing tickets from third-party sellers is done at the buyer’s own risk, as these tickets may not be valid for entry and cannot be verified. For more information, please see the list of frequently asked questions below to learn more about the fan experience with AXS. Where can I buy tickets? Tickets are available for purchase at PVConcertHall.com , AXS.com , or The St. Augustine Amphitheatre Box Office amidst renovation of Ponte Vedra Concert Hall. Please note: Purchasing tickets from any source other than PVConcertHall.com , one of our Box Office locations, or via AXS.com , is done at the buyer’s own risk. Tickets purchased through third-party sellers may not be valid for entry and cannot be verified. I have an issue with my order. Who should I reach out to for help? Please contact the original point of purchase: If you purchased your tickets online, please visit AXS Support . If you purchased your tickets at one of our on-site Box Office locations, please visit the point of purchase. Still having issues? Please contact: AmpInfo@TheAmp.com or call 904-209-3746. I can’t find my tickets. Who should I reach out to for help? If you can’t find your tickets, please contact the original point of purchase: If you purchased your tickets online at www.AXS.com, please visit AXS Support . If you purchased your tickets at one of our on-site Box Office locations, please visit the point of purchase. Still having issues? Please contact: AmpInfo@TheAmp.com or call 904-209-3746. My show has been canceled. What do I need to do? Refunds will be issued at the original point of purchase: If you purchased your tickets online, AXS will automatically issue your refund. If you purchased your tickets at one of our on-site Box Office locations, please visit the point of purchase and bring the following: Your tickets Proof of purchase Credit card used for purchase. Note: Refunds typically post to your account within 30 business days of the cancellation announcement. My show has been postponed or rescheduled. What do I need to do? Once the rescheduled date is announced, keep an eye on your inbox for next steps: If you purchased your tickets online, AXS will automatically issue your refund. If you purchased your tickets at one of our on-site Box Office locations, please visit the point of purchase and bring the following: Your tickets Proof of purchase Credit card used for purchase. Still having issues? Please contact: AmpInfo@TheAmp.com or call 904-209-3746. Getting Started with AXS AXS provides contactless, secure, and personalized ticket purchase and entry options for an enhanced live event experience. This transition will be seamless for fans, and we look forward to welcoming you back soon. How do I create an AXS account? Upon purchasing tickets, your AXS tickets will be automatically added to your existing AXS account. If you do not currently have an AXS account, you will be instructed to create one during your purchase. You can also create an account without purchasing tickets by going to AXS.com and enter some very basic account information. After completing the account information, you may buy, sell or manage any seats in your account. What is AXS Mobile ID? AXS Mobile ID is digital ticketing technology that provides the flexibility and convenience of safely and securely managing tickets online or in the AXS mobile app and is the preferred admission method for the venue. It eliminates paper tickets and allows you to enter the venue with your AXS Mobile ID and manage your tickets digitally. AXS Mobile ID gives you the ability to transfer, sell and buy seats through an official marketplace endorsed by the venue. Why did Ponte Vedra Concert Hall decide to use AXS Mobile ID? AXS Mobile ID allows for convenience, flexibility and security. Fans can manage tickets digitally, transfer or sell tickets when needed (if applicable), and remain assured that all tickets are authentic and secure. The move to AXS Mobile ID is designed to put tickets in the hands of fans, reduce ticket scalping from unauthorized resale sites & ensure that we know who is coming to the show. How do I get into the venue? AXS Mobile ID via the AXS app is the only form of entry, but if you don’t have access to a smartphone, you may use the credit card you used to purchase the tickets. Get the AXS app if you haven't already Open the App and sign in to see your tickets. Show the ticket in the App at the entrance and get them scanned to enter. Enjoy the event! Bought tickets for a group? Make sure everyone enters together OR transfer tickets to friends before the event & have them follow the steps above to enter the venue. What if my guests arrive at different times? Many fans find it best to TRANSFER the seats to their guests prior to the event. This way your guests will be able to enter when they arrive using their own AXS Mobile ID. How do I transfer tickets? A ticket transfer allows you to digitally give each guest in your party their own ticket via AXS Mobile ID. With seat transfers, you no longer need to worry about delivering the paper tickets to them in advance or meeting them outside of the gates to walk in together. There is no fee for transferring seats and you are allowed unlimited transfers. Your guests will need to create an AXS account to receive tickets. Guests can transfer the tickets back to you if they can’t attend or you can cancel the transfer if they have yet to set up their AXS account. If they already have an AXS account set up the tickets will go in their account automatically. Here's how it works: Click the Transfer button next to the event in your AXS account. Select the tickets to transfer and enter the recipient's information. On the review page, click the Transfer button to send the tickets. The recipient will get an email about the transfer, and they’ll need to create an AXS account (if they don’t have one yet) to complete the transfer. After that, the tickets will be theirs to use with the AXS app. How will I know if my transfer was successful? Review your transfer history within the AXS app by clicking on MY EVENTS and selecting TRANSFERRED. You may also review your transfers and purchase history at AXS.com . How do I accept transferred tickets? If you already have an AXS account, the tickets will be transferred to your account automatically. Otherwise, you’ll get an email letting you know you need to create an AXS account to claim the tickets. Just follow the simple steps to make the tickets officially yours. Once I have downloaded the AXS App and AXS account, do I have to accept the transfer every time? No. Once you have an account, seats transferred to you will be accepted by your account automatically (no need to accept them manually). Can seats be transferred to someone who doesn’t have an AXS account? Yes! They’ll just have to create an AXS account to claim their tickets. They’ll also need to get the AXS app. When it’s time for the event, they can open the app to show their tickets on their phone. Can I cancel a transfer? It depends. If your friend already has an AXS account, the tickets will be transferred instantaneously. Otherwise, you have until your friend creates an account to cancel the transfer. Remember, your friends can always transfer tickets back to you. Additional Ticketing FAQs Tickets should only be purchased from PVConcertHall.com , in person at our sister venue's box office, The St. Augustine Amphitheatre , during renovations, or via AXS . Plus, you'll avoid service fees! Please note, a valid ID is required for all credit and debit card transactions. The Box Office only processes in-person ticket sales and cannot accept phone or email orders. Be sure to keep an eye out for new show announcements and visit our Upcoming Events Page for updates! AXS AXS is the exclusive ticket provider for Ponte Vedra Concert Hall. Tickets purchased from other sources may not be valid. Ponte Vedra Concert Hall is unable to honor or replace invalid or counterfeit tickets. If you are subject to fraud, you may not have any recourse to refund your money. ADA Ticketing Accessible seating for those with disabilities is available for purchased online at AXS.com or at the St. Augustine Amphitheatre Box Office during renovation. Guests may purchase three companion tickets with each ADA ticket purchased. For Additional ADA information visit the Accessibility Page . Child Ticket Policy Admission for children varies per event, however, generally, children under two years of age are free if sitting on an adult’s lap. Be sure to check with the Box Office regarding specific events. Re-Entry Ponte Vedra Concert Hall has a no re-entry policy. For emergencies or special requests, please speak with a guest services representative prior to leaving the venue during an event. Refunds If an event is postponed, rescheduled or canceled, refunds are available at your point of purchase. If you purchased tickets at the venue Box Office and would like a refund for a postponed, rescheduled, or canceled event, you will need to bring the following items: Your tickets Proof of purchase Credit card used to purchase the tickets If your event was postponed, requested refunds will be processed upon announcement of new date. If your event was rescheduled, you have up to 30 days prior to the new date to request a refund. If you purchased tickets online via AXS, please follow AXS's Refund Guidelines available through their website. The venue Box Office is not able to provide refunds for tickets purchased directly via AXS. Ticket Scalping & Third-Party Ticket Sites Florida Law prohibits the reselling of tickets on Ponte Vedra Concert Hall property. Ticket scalpers and brokers are not recognized ticketing agents of Ponte Vedra Concert Hall and the validity of these tickets is not guaranteed. Purchasing tickets from any source other than PVConcertHall.com, AXS.com, or the venue Box Office is done so at the buyer's risk. Any concert attendee who, knowingly or unknowingly, gains entry using invalid tickets will be subject to eviction without compensation. Guests are welcome to purchase replacement tickets based upon availability. Ponte Vedra Concert Hall is not responsible for any tickets purchased by a third-party vendor. For further questions or more details, please contact us at AmpInfo@TheAmp.com or call 904-209-3746. Will Call Will Call will be located at the Box Office following venue renovations. Will Call tickets can be picked up approximately two hours before doors open on the day of the ticketed show. The person whose name is on the account must be present and show their photo ID in order to pick up tickets. The Box Office cannot release tickets to anyone whose name does not appear on the account, and cannot make name changes over the telephone. Events & Tickets Upcoming Events Box Office & Ticketing Seating Map Visit Directions & Parking PVCH Guide Security & Policies Nearby Hotels Accessibility About About PVCH Archive Renovations News & Media Tech Packet Support Volunteer Friends of PVCH Partners & Sponsorships Connect Newsletter Signup News & Media Media Credentials Request Contact Us Careers Merch Address Ponte Vedra Concert Hall 1050 A1A North Ponte Vedra Beach, Florida 32082 Box Office Phone: 904-209-0399 © 2025\t\t\t\t\t\tPonte Vedra Concert Hall. | Site Map | Terms & Conditions | Privacy Policy | Accessibility a carbon house experience Top"
    },
    {
      "url": "https://www.pvconcerthall.com/connect/contact",
      "text": "Contact Us | Ponte Vedra Concert Hall Skip to content Accessibility Buy Tickets Search Newsletter Signup St. Augustine Amphitheatre Menu Close Search Submit search Newsletter Signup St. Augustine Amphitheatre Events & Tickets Upcoming Events Box Office & Ticketing Digital Tickets Seating Map Visit Directions & Parking PVCH Guide Security & Policies Nearby Hotels Accessibility About About PVCH Archive Renovations News & Media Tech Packet Support Volunteer Friends of PVCH Partners & Sponsorships Connect Newsletter Signup News & Media Media Credentials Request Contact Us Careers Merch Search Search Submit search Home • Connect • Contact Us General Information Email: ampinfo@theamp.com Box Office: (904) 209-0399 Information: (904) 209-3746 Fax: (904) 209-3758 Mailing Address: 1340C A1A South St. Augustine, FL 32080 Events & Tickets Upcoming Events Box Office & Ticketing Seating Map Visit Directions & Parking PVCH Guide Security & Policies Nearby Hotels Accessibility About About PVCH Archive Renovations News & Media Tech Packet Support Volunteer Friends of PVCH Partners & Sponsorships Connect Newsletter Signup News & Media Media Credentials Request Contact Us Careers Merch Address Ponte Vedra Concert Hall 1050 A1A North Ponte Vedra Beach, Florida 32082 Box Office Phone: 904-209-0399 © 2025\t\t\t\t\t\tPonte Vedra Concert Hall. | Site Map | Terms & Conditions | Privacy Policy | Accessibility a carbon house experience Top"
    },
    {
      "url": "https://www.pvconcerthall.com/privacy-policy",
      "text": "Privacy Policy | Ponte Vedra Concert Hall Skip to content Accessibility Buy Tickets Search Newsletter Signup St. Augustine Amphitheatre Menu Close Search Submit search Newsletter Signup St. Augustine Amphitheatre Events & Tickets Upcoming Events Box Office & Ticketing Digital Tickets Seating Map Visit Directions & Parking PVCH Guide Security & Policies Nearby Hotels Accessibility About About PVCH Archive Renovations News & Media Tech Packet Support Volunteer Friends of PVCH Partners & Sponsorships Connect Newsletter Signup News & Media Media Credentials Request Contact Us Careers Merch Search Search Submit search Home • Privacy Policy PRIVACY POLICY Effective Date: March, 2023 SJC Cultural Events Inc (SJCCE) is committed to protecting the privacy and security of your personal information. This Privacy Policy describes how we collect, use, and disclose information when you use our website or services. Please read this Privacy Policy carefully. By visiting and using the Site, you agree that your use of our Site, and any dispute over privacy, is governed by this Privacy Policy. To comply with changes in technology and the adoption of new regulations and laws, we may need to change our Policy at some point in the future, in which case we’ll post the changes to this Privacy Policy on this website and update the Effective Date of the policy to reflect the date of the changes. By continuing to use the Site after we post any such changes, you accept the Privacy Policy as modified. DATA COLLECTION Personal Information : When you use our website or Services, we may collect personal information such as your name, email address, mailing address, phone number, and payment information, traffic source, and any notes Comments, Submissions, or testimonials you provide. Usage Information : We may collect information about how you use our website and services, such as your IP address, browser type, and operating system. Cookies : We use cookies and similar tracking technologies to track your activity on our website and improve your experience. You can control cookies through your browser settings. DATA USE We use your personal information to provide and improve our services, process payments, and communicate with you about your account or Services received. We may use your information to personalize your experience, analyze trends, and optimize our website and Services. We operate several domains, and you may therefore receive communications from any one of those domains. This could include, for instance, promotional emails promoting shows at our venues, and receiving emails such as newsletters from that venue list. SJCCE will still be the source of that communication. You may receive communications from the following domains: theamp.com pvconcerthall.com singoutloudfestival.com discoverfortmose.com staugfilmfest.com INFORMATION SHARING We may share your information with third-party service providers who help us operate our website and services. We may also share your information in response to legal requests or to protect our rights. HOW TO OPT-OUT OR DELETE YOUR INFORMATION You can request to opt out of communications from SJC Cultural Events Inc or to delete your information from our data at any time by calling (904) 209-3746. If you would like to update or correct any personal information in our records, you may email us at ampinfo@theamp.com . You may also make the following requests regarding your information: Requesting deletion of your information. Opting out from the sale of your information to third parties. Requesting disclosure of the personal information we have collected about you and the types of third parties with whom it has been shared. Requesting the portability of your information. Opting out from receiving marketing communications that we send you at any time. You can exercise this right by selecting the “unsubscribe” or “opt-out” link in the marketing emails we send you. Additionally, you may update your email preferences by changing the settings in your account. Requesting that we not sell your information, by clicking on the corresponding link on our website. ADVERTISER DISCLOSURES Google Analytics : We use Google Analytics Advertiser Features to optimize our business. Advertiser features include: Remarketing with Google Analytics Google Display Network Impression Reporting DoubleClick Platform integrations Google Analytics Demographics and Interest Reporting By enabling these Google Analytics Display features, we are required to notify our visitors by disclosing the use of these features and that we and third-party vendors use first-party cookies (such as the Google Analytics cookie) or other first-party identifiers, and third-party cookies (such as the DoubleClick cookie) or other third-party identifiers together to gather data about your activities on our Site. Among other uses, this allows us to contact you if you begin to fill out our check-out form but abandon it before completion with an email reminding you to complete your order. The “Remarketing” feature allows us to reach people who previously visited our Site and match the right audience with the right advertising message. Opt Out of Cookies :  You can opt out of Google’s use of cookies by visiting Google’s ad settings and/or you may opt out of a third-party vendor’s use of cookies by visiting the Network Advertising Initiative opt-out page. Facebook :  As advertisers on Facebook and through our Facebook page, we, (not Facebook) may collect content or information from a Facebook user and such information may be used in the same manner specified in this Privacy Policy. You consent to our collection of such information. We abide by Facebook’s Data Use Restrictions : Any ad data collected, received, or derived from our Facebook ad (“Facebook advertising data”) is only shared with someone acting on our behalf, such as our service provider. We are responsible for ensuring that our service providers protect any Facebook advertising data, or any other information obtained from us, limit our use of all of that information, and keep it confidential and secure. We do not use Facebook advertising data for any purpose (including retargeting, commingling data across multiple advertisers’ campaigns, or allowing piggybacking or redirecting with tags), except on an aggregate and anonymous basis (unless authorized by Facebook) and only to assess the performance and effectiveness of our Facebook advertising campaigns. We do not use Facebook advertising data, including the targeting criteria for a Facebook ad, to build, append to, edit, influence, or augment user profiles, including profiles associated with any mobile device identifier or other unique identifier that identifies any user, browser, computer or device. We do not transfer any Facebook advertising data (including anonymous, aggregate, or derived data) to any ad network, ad exchange, data broker or other advertising or monetization related service. DATA SECURITY AND BREACH NOTIFICATION We take the security of your personal information seriously and have implemented measures to protect it from unauthorized access, use, and disclosure. However, no method of transmission over the internet or electronic storage is 100% secure, and we cannot guarantee the absolute security of your information. In the event of a data breach involving your personal information, we will comply with the Florida data breach notification law (Florida Statutes §501.171). If we determine that a breach has occurred and that your personal information has been compromised, we will notify you in accordance with applicable law. You understand that your information (not including credit card information), may be transferred unencrypted and involve (a) transmissions over various networks; and (b) changes to conform and adapt to technical requirements of connecting networks or devices. Credit card information is always encrypted during transfer over networks. FLORIDA INFORMATION PROTECTION ACT (FIPA) We are also committed to complying with the Florida Information Protection Act (FIPA) (Florida Statutes Section 501.171). FIPA imposes requirements on entities that collect and store personal information of Florida residents, including requirements related to data security and breach notification. DATA RETENTION We will retain your information for as long as necessary to fulfill the purposes outlined in this Privacy Policy unless a longer retention period is required or permitted by law. YOUR RIGHTS You have the right to access, correct, or delete your personal information. You can contact us at ampinfo@theamp.com to exercise these rights. CHANGES TO PRIVACY POLICY We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page. SJC Cultural Events Inc, respects your right to privacy. CONTACT US If you have any questions regarding our Services, or these Terms, please contact as detailed below: SJC Cultural Events Inc 1340C A1A South St. Augustine, FL 32080 (904) 209-3746 AmpInfo@TheAmp.com Events & Tickets Upcoming Events Box Office & Ticketing Seating Map Visit Directions & Parking PVCH Guide Security & Policies Nearby Hotels Accessibility About About PVCH Archive Renovations News & Media Tech Packet Support Volunteer Friends of PVCH Partners & Sponsorships Connect Newsletter Signup News & Media Media Credentials Request Contact Us Careers Merch Address Ponte Vedra Concert Hall 1050 A1A North Ponte Vedra Beach, Florida 32082 Box Office Phone: 904-209-0399 © 2025\t\t\t\t\t\tPonte Vedra Concert Hall. | Site Map | Terms & Conditions | Privacy Policy | Accessibility a carbon house experience Top"
    },
    {
      "url": "https://www.sjcfl.us/sjc-cultural-events-inc-to-oversee-operation-and-management-of-st-augustine-amphitheatre-and-ponte-vedra-concert-hall/",
      "text": "SJC Cultural Events, Inc. to Oversee Operation and Management of St. Augustine Amphitheatre and Ponte Vedra Concert Hall - St. Johns County REQUEST A SERVICE STAY INFORMED NEWS AGENDAS/MINUTES Facebook Instagram Twitter Nextdoor Youtube Linkedin Search Menu Services & Information How Do I? Building Permits Land Development Code Water / Sewer Service SJC Strategic Plan Comprehensive Plan Development Review Manual Public Records iMap Development Tracker Public Library Fee Schedule Garbage Collection & Drop Off Locations Appointed Boards and Committees Coastal Projects County Service Directory Departments & Divisions Building Department Utility Department Growth Management Animal Control GIS Solid Waste GovTV Parks & Rec Social Services Planning and Zoning Emergency Management Beaches Department & Division Directory Your Government Constitutional Officers Board of County Commissioners Clerk of Courts Property Appraiser St. Johns County Sheriff Supervisor of Elections Tax Collector County Administration Appointed Boards and Committees Planning and Zoning Boards & Agencies Recreation Advisory Board A-Z Boards Directory Office of Performance and Transparency County Budget Public Records ADA / Civil Rights Act Your Government Business and Development Economic Development Building Department Transportation Development Development Tracker Online Permitting & Status Small Business Development Center Community and Destination Development Business and Development Contact Us SJC Connect – Public Property PRIDE – Private Property ADA Accomodations Holiday Schedule Contact Us Home News SJC Cultural Events, Inc. to Oversee Operation and Management of St. Augustine Amphitheatre and Ponte Vedra Concert Hall SJC Cultural Events, Inc. to Oversee Operation and Management of St. Augustine Amphitheatre and Ponte Vedra Concert Hall 20 September 2023 Category: SJC News Tags: 2023 St. Johns County Approves Partnership with SJC Cultural Events, Inc. for the St. Augustine Amphitheatre and Ponte Vedra Concert Hall Operation and Management At the St. Johns County Board of County Commissioners (BOCC) regular meeting on Sept. 19, the BOCC unanimously approved a public-private partnership with SJC Cultural Events, Inc. (SJCCE). Effective Oct. 1, 2023, SJCCE will oversee the operation and management of the St. Augustine Amphitheatre and Ponte Vedra Concert Hall . While the County will continue to retain the ownership or leasehold interests, including associated buildings, real estate, and further improvements, SJCCE will assume comprehensive operational duties. These responsibilities cover event management and promotion, supervising facility expenses, coordinating cultural series such as the Sing Out Loud Festival and the Fort Mose Jazz and Blues Series, and maintaining all facilities and equipment. SJC Cultural Events, Inc. is a 501(c)(3) nonprofit organization dedicated to providing authentic cultural programming for St. Johns County and live music enthusiasts globally. Just like SJCCE’s management and staff, the nonpaid Executive Board of Directors consists of dedicated St. Johns County residents and business professionals. These individuals bring their professional expertise to the table and have deep-rooted ties and a heartfelt commitment to the St. Johns County community. “It’s a landmark day for St. Johns County,” SJCCE Board Chairman Dylan Rumrell said. “Collaborating with the dedicated County and Amphitheatre teams to bring this vision to life has been an incredible journey. To our loyal fans of the St. Augustine Amphitheatre and Ponte Vedra Concert Hall: brace yourselves, for the best of what this team can offer is just around the corner. In the words of the legendary Frank Sinatra, ‘The best is yet to come!'” The St. Augustine Amphitheatre’s success is widely recognized. For two consecutive years, in 2022 and 2023, the industry-leading Pollstar Magazine ranked this venue as the top amphitheater in the United States based on ticket sales during the first six months of each year. In Fiscal Year 2023, to date, the Amphitheatre welcomed an impressive 262,663 guests across 75 events. Meanwhile, the Ponte Vedra Concert Hall has drawn in 34,075 attendees over 80 ticketed events. A significant upcoming renovation next spring is set to further enhance the Ponte Vedra Concert Hall’s appeal by adding balcony seating, boosting its overall capacity. “This new partnership provides the opportunity for greater mobility in signing performers, improving guest experiences like launching new restaurant options, elevated staff recruitment and retainment, as well as a higher degree of efficiency in daily operations of both facilities – all of which will positively impact tourism and our community,” Interim County Administrator Joy Andrews said. Andrews shared that the partnership calls for profits from ticket sales to be invested into planning more free shows for residents. In April 2022, the BOCC unanimously agreed to form the Amphitheatre and Concert Hall Advisory Committee. The BOCC tasked this committee with evaluating and suggesting improvements to existing programs. By September 2022, the Advisory Committee submitted a Report and Recommendation to the Board, highlighting the profound economic impact of cultural events and its potential for significant growth in subsequent years. A conservative estimate pegged the direct economic influence for Fiscal Year 2022 at more than $39 million. After receiving an unsolicited proposal from SJCCE in April 2023, the County issued a Request for Proposals (RFP) to invite more participants. On June 6, 2023, the BOCC unanimously decided to allow County staff to begin negotiations with SJCCE, aiming to define and finalize the terms and conditions of their partnership. Adhering to Florida’s public-private partnership statute, an independent review was conducted by outside counsel: Neville Wainio, CPAs and Bryant Miller Olive P.A. Their comprehensive evaluation of the SJCCE Business Plan, combined with a detailed analysis of the operational, financial, and organizational elements of the proposal, concluded that this public-private partnership is poised to deliver improved cost efficiency, enhanced community benefits, and a sustained commitment to delivering exceptional service to both residents and visitors. Gabriel “Gabe” Pellicer, now CEO/President of SJC Cultural Events, Inc., has been a vital force behind the St. Johns County Cultural Events Division for the past 15 years. Born and raised in St. Augustine, Pellicer joined the division soon after the significant renovation of the St. Augustine Amphitheatre in 2007. Throughout his tenure, he has taken on multiple roles, culminating in his most recent position as General Manager. Pellicer has been instrumental in positioning the St. Augustine Amphitheatre and Ponte Vedra Concert Hall as must-visit venues, attracting world-class artists and fostering community-focused events. With his extensive background and deep connections to the St. Augustine music scene, Pellicer’s leadership ensures continuity of the transition into the new public-private partnership with St. Johns County. “Growing up in St. Augustine, I’ve been deeply connected to our music scene. Watching the St. Augustine Amphitheatre and Ponte Vedra Concert Hall evolve over the past 15 years has been a personal journey,” Pellicer said. “Stepping into this new role, I’m grateful for the bonds formed amongst our team, County staff, and the Board of Directors. Today marks an emotionally profound and exhilarating moment for our team. Home is where the heart is; together, we’re committed to elevating our venues, continually reaching for the best version of ourselves.” Additional summary highlights of the partnership: This is St. Johns County’s inaugural public-private partnership. The contract is set to run through Sept. 30, 2050, with potential renewals in five-year increments upon mutual agreement. Annual audits will be presented to the St. Johns County Board of County Commissioners to ensure transparency. SJCCE will manage deferred maintenance projects, aiming for completion within the next three years. SJCCE will execute all capital improvement projects in coordination with the County. SJCCE commits to enriching flagship community events, such as the Sing Out Loud Festival and Fort Mose Jazz and Blues Series, while also exploring opportunities to introduce new cultural series to the community. SJCCE, Inc. will lead key operational tasks such as budgeting, asset management, and maintenance in collaboration with the County. St. Johns County will provide SJCCE annual funding: $750,000 for County facilities maintenance and $1.7 million for cultural series events. These amounts will be adjusted yearly based on the Consumer Price Index. SJCCE will also spearhead the previously approved Ponte Vedra Concert Hall project using allocated funds. The partnership between St. Johns County and SJC Cultural Events, Inc. paves the way for the continued growth and enrichment of the community. Both entities are united in their commitment to elevate cultural experiences for residents and visitors alike. Stay Informed on St. Johns County news and Sign up for our e-newsletters Share: Latest News Sep 10 Anastasia Island Branch Library Temporarily Closing for Renovations Beginning Sept. 15 Sep 10 SJC Northern Marsh Landing Entrance Closed Due to Emergency Water Main Repair Sep 10 UPDATE: Northern Marsh Landing Entrance Remains Closed for Water Main Repair Sep 08 St. Johns County Traffic Signal at U.S. 1 and Pine Island Road Fully Operational Sep 05 St. Johns County Commissioner Sarah Arnold Joins United Way of Florida Board of Governors Employee Connection Site Policies Contact Us Accessibility Copyright 2025"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "text": "OUR TEAM | CAMP top of page Home ABOUT OUR TEAM JOIN THE TEAM PROGRAMS TACT URBAN ARTS NORTHERN LIGHTS BLUEGRASS MUSIC CAMP GIRLS ROCK THE NORTH YOUTH MUSIC CAMPS RESIDENCIES CULTURAL FOUNDATIONS MUSIC IN SCHOOLS ARTS EXPLORATION TOUR SOA FIDDLE MENTORSHIP CURRICULUM DEVELOPMENT HIP HOP COLLABORATION MUSIC TEACHER MENTORSHIP CONTACT NEWS DOYLEFEST LINEUP AND TICKETS ABOUT GET INVOLVED GALLERY CONTACT PAST PERFORMERS DONATE Our Team. Rooted in the arts. Experts in various fields, working together to share their talents in communities across Saskatchewan. Eliza Doyle managingdirector@communityartsmentorship.com Co - Founder / Managing Director Eliza is a professional musician, songwriter and recording artist, teacher, community advocate, leader and is the co-founder behind Saskatchewan’s arts organization, C.A.M.P; Community Arts Mentorship Program. Her focus on fostering the arts while supporting local community capacity to deliver arts programming has been welcomed throughout communities in Saskatchewan. Offering services to remote and under-served communities presents new challenges, and all of CAMP programming serves to mitigate these obstacles. Familiar with the arts and music industry in Saskatchewan, she also aims to provide the opportunity and mentorship available to people with challenges in access due to location and lack of resources. Holly Rae Yuzicapi culturalengagement@communityartsmentorship.com Co - Founder / Cultural Consultant The co-founder of CAMP and a proud Dakota/Lakota from the Standing Buffalo Dakota Nation in Treaty 4 Territory, Saskatchewan.  Holly grew up in the beautiful Qu'Appelle valley.  Coming from a large family, Holly has been able to observe and learn from many generations of the Goodwill and Yuzicapi families.  The strength of her sense of identity was nurtured and shaped by her family and community.  Without realizing it at the time, Holly started doing cultural arts sharing from a young age which really is rooted in participating in powwow dancing and attending other cultural events on a regular basis.  She has evolved into an independent natural materials artist that loves to facilitate cultural arts engagement opportunities to all audiences.  Holly is proud of how she was raised and is very thankful for all that her family has taught her.  Respectfully representing the spirit and potential of those teachings is why Holly does the work that she does.  It is how she chooses to honour her family. LJ Tyson Kimbley innovationliaison@communityartsmentorship.com Innovation Liaison LJ Tyson is a singer-songwriter from Prince Albert, Saskatchewan. The has used his identity as inspiration for creating lyrics and melodies. LJ has had music played across Canada and beyond. His latest release Home On A Rainbow was critically acclaimed and awarded a prize from SOCAN TD Indigenous Songwriter Awards. LJ currently works as Innovation Liaison for Community Arts mentorship program, bringing music to remote and underserved communities. Steph Cameron administrativedirector@communityartsmentorship.com Administrative Director Saskatchewan-based artist Steph Cameron has gained recognition for her unique take on contemporary Americana music, lively instrumentation, and captivating lyrics. From her early days of busking, she has become an internationally touring professional recording artist. Her critically acclaimed debut album, Sad-Eyed Lonesome Lady, released on Pheromone Recordings in 2014, was nominated for the Polaris Music Prize and praised as the #1 Canadian album of that year by PopMatters, while No Depression called it \"a stunning debut.\" This success led her to join the Paquin Artist Agency and embark on national tours. Her expertise in performing is the real world experience CAMP participants benefit the most from . Zoe Slusar programcoordinator@communityartsmentorship.com Program Coordinator Zoe Slusar was the voice actress for Kid Goku in the English dubs of the Dragon Ball and Dragon Ball GT anime, done by Blue Water Studios. She also provided the voice of Sai Saici in Kidou Butouden G Gundam, as well as the video game Gundam: Battle Assault 2.\n\nZoe also voiced the character Jungo in the Flemish created series.\n\nZoe, also known by her stage name ZHE the Free, released her first rap EP album titled The Love EP in September 2020. This album charted #1 on 90.9 CJSW in Calgary, Alberta in November 2020. Mitchell Dureault programcoordinator@communityartsmentorship.com Program Coordinator Mitch Dureault is a seasoned professional music instructor and traditional musician, who comes from the Treaty 4 Territory of the southern Saskatchewan prairies. Currently sitting as a board member, and working instructor for C.A.M.P., Mitch is an advocate for the arts and has a strong focus on decolonizing his own music & teaching practices. He regularly draws from his B.A. in International Studies while working with and aiding organisations, communities, and schools in the development and implementation of equitable and continual art programming throughout the province. Mitch is also very passionate about the promotion and preservation of the local culture of Saskatchewan fiddling and has been making efforts to visit and interview as many fiddlers as possible from across the province for his Saskatchewan Fiddle History Project, a multi-year project in which he collects stories, tunes, and histories from these individuals in an attempt to preserve and document the ever evolving diverse intricacies of the provinces fiddling culture. Jille Shotton communications@communityartsmentorship.com sponsorship@communityartsmentorship.com​ Marketing and Communications Director\\ Sponsorship Jille Shotton joined the Community Arts Mentorship Program in 2024 as the Marketing and Communications Director, bringing a decade of experience in festival marketing, promotions, and community building within Saskatchewan's arts and culture sector. Her background includes managing marketing, communications, sponsorship, and onsite operations for events such as the Northern Lights Bluegrass & Old Time Music Festival, Winterruption, Ness Creek Music Festival, Fiddlyness, Shivering Strings and the Children's Festival of Saskatchewan. Jille is passionate about strengthening communities through the arts, having organized open jams, Bluegrass Brunch, radio shows, and various events and festivals. Her work focuses on creating inclusive, vibrant spaces where the community can connect and thrive. Lillanohna Naytowhowcon President LILI, an Indigenous singer, songwriter, and recording artist hailing from Sturgeon Lake First Nation in Saskatchewan, blends her passion for music and independent songwriting. She is actively engaged in community projects that celebrate and honour Indigenous culture through a fusion of traditional Cree songs, indie rock, folk, hip-hop, and dance music. In 2024, expect the release of her music under the esteemed blessed-street record label, marking a significant chapter in her musical journey. The album includes collaboration with recording artist Lancelot Knight in Six Underwater, showcasing her versatility. Proudly identifying as a nehiyaw iskwew, she seamlessly weaves her creative pursuits into a traditional lifestyle, contributing to a First Nation Healing Lodge under the guidance of elders and knowledge keepers. The past year has been a transformative period characterized by healing and growth, with her music echoing the spirit of loss, hope, and perseverance. Her vocal style is both distinctive and heartfelt, drawing inspiration from grassroots music festivals, independent artists, and the eclectic vibes of the city. A nomadic spirit with a touch of witchy charm, LILI invites all to partake in the enchantment of her melodies. Travis Beatty Board Member Travis Beatty is from Timber Bay, Saskatchewan and is instrumentalist. He has a studio in Saskatoon, Saskatchewan called Rez Rat Recording, and is passionate about helping community and youth in Saskatchewan. He joined the CAMP Sask Arts Board of Directors in October 2023, and we are very lucky to have him! JOIN THE MAILING LIST SIGN UP NOW Thanks to our supporting organizations Email: managingdirector@communityartsmentorship.com Tel: 306-774-5888 bottom of page"
    },
    {
      "url": "https://www.ticketmaster.com/ponte-vedra-concert-hall-tickets-ponte-vedra-beach/venue/279520",
      "text": "Ponte Vedra Concert Hall - Ponte Vedra Beach, FL | Tickets, 2025-2026 Event Schedule, Seating Chart Your browser is not supported. For the best experience, use any of these supported browsers: Chrome , Firefox , Safari , Edge . Skip to main content US United States selected, change country Hotels Sell Gift Cards Help VIP Ticketmaster Home page Concerts Sports Arts, Theater & Comedy Family Cities More Toggle search bar Search Search Sign In/Register Home Jacksonville, FL Ponte Vedra Concert Hall Tickets Ponte Vedra Concert Hall Tickets 1050 A1A North, Ponte Vedra Beach, FL 32082, US Get Directions (Opens in new tab) Events & Add-Ons Venue Details Seating Chart Discover More Related Links All Events and Add-Ons 13 Results All Events and Add-Ons 13 Results Filter by category All Categories Music Undefined Dates All Dates Dates. Change date range: All Dates September 18, 2025 Sep 18 Thursday 07:30 PM Thu 7:30 PM Open additional information for The Mountain Goats 9/18/25, 7:30 PM The Mountain Goats Find Tickets The Mountain Goats 9/18/25, 7:30 PM Lineup The Mountain Goats September 19, 2025 Sep 19 Friday 07:00 PM Fri 7:00 PM Open additional information for Maddox Batson 9/19/25, 7:00 PM Maddox Batson Find Tickets Maddox Batson 9/19/25, 7:00 PM Lineup Maddox Batson September 29, 2025 Sep 29 Monday 07:30 PM Mon 7:30 PM Open additional information for Melissa Etheridge 9/29/25, 7:30 PM Melissa Etheridge Find Tickets Melissa Etheridge 9/29/25, 7:30 PM Lineup Melissa Etheridge October 2, 2025 Oct 02 Thursday 07:30 PM Thu 7:30 PM Open additional information for Lyle Lovett and his Acoustic Group 10/2/25, 7:30 PM Lyle Lovett and his Acoustic Group Find Tickets Lyle Lovett and his Acoustic Group 10/2/25, 7:30 PM Lineup Lyle Lovett and his Acoustic Group October 12, 2025 Oct 12 Sunday 06:30 PM Sun 6:30 PM Open additional information for Everclear w/ Local H 10/12/25, 6:30 PM Everclear w/ Local H Find Tickets Everclear w/ Local H 10/12/25, 6:30 PM Lineup Everclear Local H October 13, 2025 Oct 13 Monday 08:00 PM Mon 8:00 PM Open additional information for Joss Stone 10/13/25, 8:00 PM Joss Stone Find Tickets Joss Stone 10/13/25, 8:00 PM Lineup Joss Stone October 18, 2025 Oct 18 Saturday 07:30 PM Sat 7:30 PM Open additional information for Trampled By Turtles 10/18/25, 7:30 PM Trampled By Turtles Find Tickets Trampled By Turtles 10/18/25, 7:30 PM Lineup Trampled By Turtles October 25, 2025 Oct 25 Saturday 08:00 PM Sat 8:00 PM Open additional information for Bryan Martin 10/25/25, 8:00 PM Bryan Martin Find Tickets Bryan Martin 10/25/25, 8:00 PM Lineup Bryan Martin November 2, 2025 Nov 02 Sunday 07:00 PM Sun 7:00 PM Open additional information for Hayes Carll 11/2/25, 7:00 PM Hayes Carll Find Tickets Hayes Carll 11/2/25, 7:00 PM Lineup Hayes Carll November 7, 2025 Nov 07 Friday 08:00 PM Fri 8:00 PM Open additional information for The Record Company 11/7/25, 8:00 PM The Record Company Find Tickets The Record Company 11/7/25, 8:00 PM Lineup The Record Company November 11, 2025 Nov 11 Tuesday 07:00 PM Tue 7:00 PM Open additional information for The Wallflowers 11/11/25, 7:00 PM The Wallflowers Find Tickets The Wallflowers 11/11/25, 7:00 PM Lineup The Wallflowers December 4, 2025 Dec 04 Thursday 07:30 PM Thu 7:30 PM Open additional information for The Dip 12/4/25, 7:30 PM The Dip Find Tickets The Dip 12/4/25, 7:30 PM Lineup The Dip December 13, 2025 Dec 13 Saturday 08:00 PM Sat 8:00 PM Open additional information for Shaun Cassidy 12/13/25, 8:00 PM Shaun Cassidy Find Tickets Shaun Cassidy 12/13/25, 8:00 PM Lineup Shaun Cassidy Advertisement Venue Details Ponte Vedra Concert Hall , 1050 A1A North, Ponte Vedra Beach, FL 32082, US Get Directions (Opens in new tab) What are the box office phone numbers? 904-209-0399 (Box Office) When is the box office open? Mon-Fri – 10:00am – 6:00pm Sat - 9:00am – 5:00pm Sun – Closed **Closed on all St Johns County Holidays **Closed from 1:00pm - 2:00pm everyday for lunch. **Open until 1 hour after event time on event days. What payment types are accepted? Cash, Local Checks, Visa, Mastercard, Discover, American Express What are the will call rules? Location: Ponte Vedra Concert Hall Box Office Opens: 2 hours before showtime What are the parking options at Ponte Vedra Concert Hall? Location: Venue Parking Lot Charge: $5.00 Is there accessible seating? This is an accessible venue What are the general rules of Ponte Vedra Concert Hall? Items NOT allowed: - NO Illegal or Un-Prescribed Drugs - NO Video Cameras - NO Personal Property that is a potential hazard to others. (ex. Chains, Wallet Chains, or Spiked jewelry) - NO Electronic Equipment Including Laptops Computers, IPads, Audio Recorders, and Tripods. - NO Strollers - NO Weapons of Any Kind (ex. Guns, Knives, Sticks, Fireworks, Mace, and/or Pepper Spray) - NO Skateboards, Skates, or Rollerblades - NO Umbrellas - NO Chairs - NO Backpacks (Purse backpacks, Diaper bag backpacks and diaper bags are permitted) - No Animals (except service animals to aid guests with disabilities) - No Coolers of Any Kind (Including Small Soft pack Coolers) - NO Gifts for the Band - NO Musical Instruments - No Cameras with Built-In Lenses longer than a couple of inches and/or detachable lenses/flash. - NO Outside Alcoholic beverages * Camera Policy: IT IS AT THE SOLE DISCRETION OF THE ARTIST IF SMALL HANDHELD CAMERAS WITH NO DETACHABLE LENSES ARE ALLOWED INSIDE VENUE. PLEASE CONTACT VENUE FOR MORE INFORMATION. * SMOKING POLICY: No Smoking in the Facility. Are children allowed? A ticket is not required for children two and under if the child remains in the lap of the accompanying parent or guardian. If a seat is desired for the child a ticket must be purchased at regular price. Seating chart Select the event to see the seating chart. Check availability above or on the event page. Ponte Vedra Concert Hall The Mountain Goats Maddox Batson Melissa Etheridge Lyle Lovett and his Acoustic Group Everclear Joss Stone Trampled By Turtles Hayes Carll The Record Company The Wallflowers The Dip Shaun Cassidy Bryan Martin The Mountain Goats This map doesn't reflect availability Discover More in Ponte Vedra Beach Concerts Theater Sports Family Comedy Rock Pop Hip-Hop/Rap Country R&B Latin Baseball Related Links Ponte Vedra Concert Hall   Twitter (Opens in new tab) Ponte Vedra Concert Hall   Facebook (Opens in new tab) Ticketmaster Logo Let's connect (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) Download Our Apps (Opens in new tab) (Opens in new tab) By continuing past this page, you agree to our terms of use Helpful Links Help/FAQ Sell My Account Contact Us Gift Cards Do Not Sell or Share My Personal Information Get Started on Ticketmaster Our Network Live Nation House of Blues Front Gate Tickets TicketWeb universe NFL NBA NHL About Us Ticketmaster Blog Ticketing Truths Ad Choices Careers Ticket Your Event Innovation Friends & Partners PayPal Allianz AWS Our Policies Privacy Policy Cookie Policy Manage my cookies and ad choices © 1999-2025 Ticketmaster. All rights reserved."
    }
  ]
}