{
  "fuentes": [
    {
      "url": "https://southernsonsvacationrentals.com/travel-spot-guide/pineapple-willys-restaurant/",
      "email": "joe@southernsonstn.com"
    },
    {
      "url": "https://southernsonsvacationrentals.com/travel-spot-guide/pineapple-willys-restaurant/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://www.staypineapple.com/leadership-team",
      "email": "dash@staypineapple.com"
    }
  ],
  "mails": [
    "dash@staypineapple.com",
    "joe@southernsonstn.com",
    "logo@2x.png"
  ],
  "nombre_sitio": "pwillys.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://southernsonsvacationrentals.com/travel-spot-guide/pineapple-willys-restaurant/",
      "text": "Pineapple Willy's Restaurant - Southern Sons Vacation Rentals Home About Us Listings Contact FAQ Home About Us Listings Contact FAQ Facebook Instagram Pinterest Book Now Panama City Beach, FL Pineapple Willy’s Restaurant Sip on refreshing tropical cocktails and enjoy beachfront fun at this iconic Tiki bar and grill. Photo by: Kim Croy Visit Link +1 850-235-0928 9875 S Thomas Dr, Panama City Beach, FL 32408, United States Some Places You Might Like Schooners Panama City Beach, FL Visit Link +1 850-235-3555 5121 Gulf Dr, Panama City, FL 32408, United States Laid-back waterfront bar & seafood spot offering sunset views, live music & late-night hours. Shell Island Cruises Panama City Beach, FL Visit Link +18502354004 http://www.shellislandcruises.com/ A boat tour to Shell Island lets you can soak up the sun, collect seashells, and spot playful dolphins. Gulf World Marine Park Panama City Beach, FL Visit Link +1 850-234-5271 15412 Front Beach Rd, Panama City Beach, FL 32413, United States Gulf World Marine Park is a dolphinarium located in Panama City Beach, Florida. Why You Should Choose (Business Name)? Luxury Amenities Prime Locations Spacious accommodations Stunning views Modern design Impeccable cleanliness Personalized experiences Excellent customer service Book Your Stay Search Property Ready for the best Home Rental Experience Book Your Stay Ready for the best Home Rental Experience Book Your Stay CONTACT INFO Knoxville, TN 37932 423.277.3075 Joe@southernsonstn.com Home About Us Listings Contact FAQ Home About Us Listings Contact FAQ JOIN OUR NEWSLETTER Subscribe our newsletter to get latest updates Email Subscribe Copyright © 2023 | Website made by Boostly Currency Facebook Instagram Pinterest Search Where to go? Blue Ridge Cosby Gatlinburg Morganton Panama City Beach Pigeon Forge Sevierville Walland Arrive Depart September 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 October 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 November 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 December 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 January 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 February 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 March 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 April 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 May 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 June 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 July 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 August 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Clear Done Guests 0 Adults 0 Children Pets Yes No Apply Advanced Size n. of bedrooms 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 n. of rooms 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Room Type Entire Home Private Room Price Min. $10.00 $20.00 $30.00 $40.00 $50.00 $60.00 $70.00 $80.00 $90.00 $100.00 $110.00 $120.00 $130.00 $140.00 $150.00 $160.00 Max. $50.00 $100.00 $125.00 $150.00 $160.00 $200.00 $250.00 $300.00 $400.00 $500.00 $600.00 $700.00 $800.00 $900.00 $1,000.00 $1,200.00 Amenities ac Air conditioning Alfresco dining Alfresco shower alfresco_dining alfresco_shower Arcade Game Arcade machine Baby safety gates Babysitter recommendations babysitter_recommendations Backyard Baking sheet baking_sheet Barbeque utensils Bathtub Bbq area BBQ Grill BBQ Utensils bbq_area Beach access Beach Essentials Beach Towels beach_access Bed Linens Blender Board games board_games Body Soap Body Soap Starter books Booster Seat for Toddler Bottled Water in Fridge upon arrival cable Carbon monoxide alarm Carbon Monoxide Detector Ceiling fan ceiling_fan Charcoal Grill Checkers Chess Child Dinnerware Children Books and Toys Children Books, Toys, and Games Children Dinnerware Children’s books and toys Children’s dinnerware Cleaning available during stay Cleaning before checkout Cleaning products cleaning_before_checkout cleaning_products Climbing wall climbing_wall Clothes drying rack clothes_drying_rack Clothing storage Coffee Beans Coffee Creamers Coffee Filters Coffee K-Cups Coffee maker coffee_maker Conditioner Conditioner Starter Cooking basics cooking_basics Crib Crock Pot Darts Decorated for Christmas Decorated for Fall Dining Area Dining table Disabled parking spot disabled_parking_spot Dish Soap Dish Soap Starter Dish Soap starter pack Dish Sponge Dish Television Dishes and silverware dishes_and_silverware Dishwasher Dishwasher pods Dishwashing Pods starter pack Dryer Drying rack for clothing Essentials Ethernet connection ethernet_connection Ev charger ev_charger Exercise equipment exercise_equipment Extra Pillows and Blankets Fire extinguisher Fire Pit fire_extinguisher Fireplace Fireplace guards fireplace_guards First aid kit first_aid_kit flat_smooth_pathway_to_front_door Free parking Free parking on premises Free street parking free_parking Freezer Fully Equipped Kitchen Fully Stocked Coffee Bar Game console game_console Gameroom Games console Garbage Bags Garden or backyard garden_or_backyard Gas Fire Pit Gas Grill Gas Oven Gas Stove Grilling Utensils gym Hair dryer Hair Dryers in each Bathroom hair_dryer hammock Hangers Heating High Chair Highchair Home theater home_step_free_access home_theater Hot Tub Hot water Hot water kettle hot_water hot_water_kettle Indoor fireplace Indoor Gas Fireplace Iron Keurig Keurig Coffe Maker Keurig coffee machine Keurig Coffee Maker Kid Games Kids toys and books Kitchen kitchenette Lake access lake_access Laptop Friendly Work Space Laptop friendly workspace Laundromat nearby laundromat_nearby Laundry Detergent starter Laundry Pod starter set Laundry Pods starter pack Life size games life_size_games Long term stays allowed long_term_stays_allowed Luggage dropoff allowed luggage_dropoff_allowed Microwave Mini fridge Mini golf mini_fridge mini_golf mosquito_net Nintendo Gaming Console Outdoor Decks and Seating Outdoor dining area Outdoor furniture Outdoor seating Outdoor Space and Seating outdoor_seating Outlet covers outlet_covers Oven Pack ’n play/Travel crib Pack and Play Travel Crib Pack n Play Travel Crib Path to entrance lit at night path_to_entrance_lit_at_night patio Patio or balcony Patio or belcony patio_or_belcony Ping Pong Table playground Playroomn pool Pool Table Porch Bed Swing Portable Fans Private entrance Private living room private_entrance private_living_room Record player record_player Refrigerator Resort access resort_access Room darkening shades room_darkening_shades sauna Shampoo Shower gel shower_gel Shuffle Board Smart lock Smoke alarm Smoke Detector Sound system sound_system Stair gates stair_gates Stove Street parking street_parking Sun loungers sun_loungers Swinging Porch Bed Swing Table corner guards table_corner_guards Theme room theme_room Toaster Trash compacter trash_compacter TV TV in Living Room TV on outdoor Patio TVs in each bedroom, living room, and gameroom TVs in every bedroom Two Gas Fireplaces Walking Trail around the Property Wall Mounted Connect Four Wall mounted Tic Tac Toe Wardrobe or closet wardrobe_or_closet Washing Machine waterfront Whiskey Barrel Arcade Game Wifi Wifi for Streaming Window guards window_guards Wine glasses wine_glasses Wireless internet wireless_internet Wood Burning Fire Pit Wood burning Firepit Yard Games More Reset Apply Filters Search × Login Remember me Forgot password? Log In × Register User registration is disabled in this website. × Forgot Password Please enter your username or email address. You will receive a link to create a new password via email. Submit Compare listings Compare Compare experiences Compare Close Pineapple Willy’s Restaurant Sleep up to  ,  Bedroom ,\n                             Bathroom In this home, you will find... Select Currency US Dollar USD - $ Canadian Dollar CAD - CA$ Euro EUR - € Pound Stirling GBP - £ Home About Us Listings Contact FAQ Book Now"
    },
    {
      "url": "https://www.staypineapple.com/leadership-team",
      "text": "Staypineapple Leadership Team A Hotel for Huskies just minutes from UW campus. Check out our serious style, colorful motif, and a range of upscale amenities. Close Skip to Content (Press Enter) Book Now Our Hotels Destinations New York City An Artful Hotel | Midtown With vibrant colors and the perfect touch of class, this centrally located boutique hotel in Midtown Manhattan is steps from Times Square, Madison Square Garden, Hudson Yards, and the Theater District. It's th... Chicago An Iconic Hotel | The Loop Back in the day this hotel was an office building-now all of the original office doors (complete with vintage knobs and mail slots) are the portals to our rooms. Here, the historic touches of a 19th Century bu... San Francisco An Elegant Hotel | Union Square Two parts glitz and glam, two parts elegant and comfortable-this jewel box hotel is a true gem. What's more, it's perfectly situated just minutes from famous Union Square, Moscone Center and endless shopping, ... Boston A Delightful Hotel | South End Thoughtfully located in Boston's historic South End neighborhood, Staypineapple Boston offers a fun, comfortable stay in the middle of one of America's oldest cities. Seattle The Maxwell Hotel | Seattle Center Just steps from the Space Needle and other top attractions, The Maxwell Hotel offers a colorful interior and all the modern conveniences. Hotel FIVE | Downtown Hotel FIVE’s fun and funky décor fits right in with the vibrant city around it. There’s no better jumping off point for exploration. Watertown Hotel | University District If open concept industrial is your speed, park yourself here. Concrete and wood accents anchor Watertown Hotel's modern décor and it's all just steps from the University of Washington campus. University Inn | University District If you're into Mid-Century mod, make this your home base. Just steps from the University of Washington, University Inn is known for 1960s-style groovy décor. Portland Hotel Rose | Downtown This colorful character may be a bit off-the-wall but it's splashy style fits perfectly in an anything-but-dull town. San Diego Hotel Z | Gaslamp Quarter Hotel Z is perfectly located in the historic Gaslamp Quarter, San Diego's epicenter for dining, shopping and entertainment. Get ready to have some fun. Why Pineapple The Pineapple Difference Our Story The Naked Experience Dog-Friendly Hotels EatDrink Pineapple Eat + Drink But First, Coffee Afternoon Delights Quick Bites & Bevvies Pineapple Hour Meet Pineapple Group Room Blocks Weddings, Parties & Celebrations Save Pineapple Special Offers Shoppineapple MENU Our Hotels Destinations New York City An Artful Hotel | Midtown With vibrant colors and the perfect touch of class, this centrally located boutique hotel in Midtown Manhattan is steps from Times Square, Madison Square Garden, Hudson Yards, and the Theater District. It's th... Chicago An Iconic Hotel | The Loop Back in the day this hotel was an office building-now all of the original office doors (complete with vintage knobs and mail slots) are the portals to our rooms. Here, the historic touches of a 19th Century bu... San Francisco An Elegant Hotel | Union Square Two parts glitz and glam, two parts elegant and comfortable-this jewel box hotel is a true gem. What's more, it's perfectly situated just minutes from famous Union Square, Moscone Center and endless shopping, ... Boston A Delightful Hotel | South End Thoughtfully located in Boston's historic South End neighborhood, Staypineapple Boston offers a fun, comfortable stay in the middle of one of America's oldest cities. Seattle The Maxwell Hotel | Seattle Center Just steps from the Space Needle and other top attractions, The Maxwell Hotel offers a colorful interior and all the modern conveniences. Hotel FIVE | Downtown Hotel FIVE’s fun and funky décor fits right in with the vibrant city around it. There’s no better jumping off point for exploration. Watertown Hotel | University District If open concept industrial is your speed, park yourself here. Concrete and wood accents anchor Watertown Hotel's modern décor and it's all just steps from the University of Washington campus. University Inn | University District If you're into Mid-Century mod, make this your home base. Just steps from the University of Washington, University Inn is known for 1960s-style groovy décor. Portland Hotel Rose | Downtown This colorful character may be a bit off-the-wall but it's splashy style fits perfectly in an anything-but-dull town. San Diego Hotel Z | Gaslamp Quarter Hotel Z is perfectly located in the historic Gaslamp Quarter, San Diego's epicenter for dining, shopping and entertainment. Get ready to have some fun. Why Pineapple The Pineapple Difference Our Story The Naked Experience Dog-Friendly Hotels EatDrink Pineapple Eat + Drink But First, Coffee Afternoon Delights Quick Bites & Bevvies Pineapple Hour Meet Pineapple Group Room Blocks Weddings, Parties & Celebrations Save Pineapple Special Offers Shoppineapple Our Story Locations Health + Wellness The Staypineapple Impact Leadership Team Media Careers Development Reservations Make a Reservation Manage Reservation Reservation Dates Choose Your Hotel Where are you headed? Select Reservation Dates Select Reservation Dates My dates are flexible Travelers 1 Adult 2 Adults 3 Adults 4 Adults 5 Adults 6 Adults 7 Adults 8 Adults 9 Adults 10 Adults 11 Adults 12 Adults 13 Adults 14 Adults 15 Adults 16 Adults 17 Adults 18 Adults 19 Adults 0 Kids 1 Kid 2 Kids 3 Kids 4 Kids 5 Kids 6 Kids 7 Kids 8 Kids 9 Kids 10 Kids 11 Kids 12 Kids 13 Kids 14 Kids 15 Kids 16 Kids 17 Kids 18 Kids 1 Room 2 Rooms 3 Rooms 4 Rooms 5 Rooms 6 Rooms 7 Rooms 0 Dogs 1 Dog* 2 Dogs* Special Codes Special Codes Group Code Promo Code Coupon Code IATA Code Best Rate Guaranteed New York City An Artful Hotel | Midtown Chicago An Iconic Hotel | The Loop San Francisco An Elegant Hotel | Union Square Boston A Delightful Hotel | South End Seattle The Maxwell Hotel | Seattle Center Hotel FIVE | Downtown Watertown Hotel | University District University Inn | University District Portland Hotel Rose | Downtown San Diego Hotel Z | Gaslamp Quarter Close Destinations Previous month Next month Close Datepicker E-mail Address Confirmation Number Close STAYPINEAPPLE LEADERSHIP All hotels endeavor to deliver great hospitality but we know that is really hard to do. Our voices will be the talk that backs up our walk. The purpose of having a shocking and clever attitude is to stand out amongst our competitors, but not scare people away. With witty banter and open arms, Staypineapple will create “Remember that one time when…” moments. Michelle Barnet Chief Pineapple Officer Michelle Barnet Chief Pineapple Officer College University of Nevada, Hospitality Business Management, BS Mascot Rebels Favorite fruit Truly is a pineapple Favorite Quote ”You'll see it when you believe it” – Dr. Wayne Dyer My thing After spending 20 ish years in both the business of Hospitality and the acquisition and development of Real Estate, combining them seemed like a great next step. Pineapple hospitality, its assets, its mission, but mostly its people are my pride and joy manifested. I am privileged to work with what I believe is a best in class group of hospitality professionals who know their stuff, but most importantly bring their hearts and integrity to the work of enhancing the pineapple vision every day. We are unified around the single idea that hotels aren't places ...they are experiences. From this \"core\" belief grows Pineapple each day.Without the love and support of my husband Steve and son Max none of the above would be possible. Oh and let's not forget the laughter and love that comes from our two furry family members Dash and Kiska the Pineapple huskies. Dina Belon President Mike Hirschler Chief Growth Officer Casey Dill Chief Financial Officer Bob Spear Chief Operating Officer Dina Belon President College Florida State University, B.S. Interior Design Mascot Seminoles Favorite fruit Key lime but just for the pie… Favorite Quote “Be the change you wish to see in the world” - Ghandi My thing I have been making waves for more than 20 years in the hospitality industry, bucking the traditional; focused on creating unique, extraordinary, and sustainable hotels. I began my career in design, transitioned into development and construction, evolved into engineering and operations, and eventually pulled it all together into a multidisciplinary hospitality leader. I am responsible for the people and the buildings at Pineapple Hospitality, making sure the stage is set for Pineapple’s amazing team to inspire out of the ordinary experiences.... really an Oscar-winning performance. I met my husband at work over 20 years ago and our favorite past time is architecture of all types, fat, skinny, tall short, old and new; we love them all. We have two beautiful rescue cats and a dog, Molly, Mookie, and Bella. We live on a \"hobby farm\" with plans to expand the four legged family, maybe a horse or a donkey in our future. Mike Hirschler Chief Growth Officer College Cornell University, School of Hotel Administration Mascot Big Red Bear Favorite fruit A Hazy IPA from Reuben’s Brews (with a hint of Pineapple) Favorite Quote “It takes 20 years to build a reputation and five minutes to ruin it. If you think about that, you’ll do things differently.” – Warren Buffett My thing A hotelier at heart since I was a young child, my passion is supporting the people who make it happen every day for our guests. During more than 20 years in the hospitality industry, my career has taken me across the United States with brands like Fairmont and Four Seasons. With a background in recruiting, learning and development and project management, I am excited to collaborate to build Staypineapple’s people leadership strategy. I am crazy about my community and believe we have a social responsibility to make an impact. My proudest accomplishment is partnering with the Pediatric Brain Tumor Research Fund to create the Run of Hope, the most successful grassroots fundraising event for Seattle Children’s Hospital. Like many in our business, when I get away…I like to get away! I love to travel to unique destinations, experience great restaurants and sample amazing wine. If you time it right, you might find me enjoying a craft beer at Reuben’s Brews in the Ballard neighborhood of Seattle with my partner, Starrla, and our rescue pup, Sadie. Casey Dill Chief Financial Officer College Central Washington University, Degree – Accounting, Minor – Computer Applications Mascot Wildcats Favorite fruit Banana – go to fruit for an athlete Favorite Quote “The difference between the impossible and the possible lies in a person’s determination.” – Tommy Lasorda My thing With over 24 years of accounting and finance experience, I joined Pineapple Hospitality in 2015 after holding accounting & finance roles in aerospace, software, manufacturing, and distribution industries. I have a passion for numbers, organization, and analytics which comes partly from being a self proclaimed baseball statistician. Washington native, born on Whidbey Island, raised in Kirkland, and proud CWU alumni. Financial statements, treasury & risk management, data analyzing, report preparing, budget developing, numbers guru - BY DAY. Husband, dad (of four amazing children), coach, mentor, board member, community volunteer, golfer, fisherman, and Northwest traveler - BY NIGHT / WEEKEND. Bob Spear Chief Operating Officer College University of Maryland Eastern Shore Mascot Golden Eagles Favorite fruit Watermelon Favorite Quote Never say never because limits, like fears, are often just illusions. -Michael Jordan My thing I am passionate about building teams and being a part of teams that come together to produce outstanding results. The selfless nature of wanting others to enjoy their time while staying at our wonderful Staypineapple hotels makes every day a fulfilling journey. Each and every day provides the opportunity to put a smile on someone’s face whether it be a guest who has traveled from afar or a team member who has earned a pat on the back. My 25 year career with Marriott provided me with the knowledge and passion for the industry that I brought with me to Pineapple Hospitality. Being able to work in a creative environment without limits or boundaries allows us to live and speak Pineapple. Truly hospitality redefined! Pineapple Hospitality has brought my wife, two daughters and our 10 year old boxer to the PNW. Randall Obrecht Vice President of People & Culture Robin Koetje Vice President of Information Technology Austin Gardner Vice President of Distribution and Development Casey Barks Vice President of Marketing Tony Ledesma Director of Finance Randall Obrecht Vice President of People & Culture College Mascot Favorite fruit Strawberries Favorite Quote “You miss 100% of the shots you don’t take” -Wayne Gretzky My thing I bring over 30 years of experience in hospitality food and beverage and operations. My career in the Seattle culinary scene has allowed me the opportunity to work with James Beard award-winning chefs, fulfill strategic leadership roles for restaurant corporations like Ruth Chris, Restaurants Unlimited, and Savor, and oversee McCaw Hall, a 3,000 seat performing arts hall. I moved into operations while working for Benchmark Hospitality as a General Manager for the historic Sorrento Hotel. I joined Pineapple Hospitality in the Fall of 2016, where I started in a food & beverage leadership role and then transitioned into Operations. I support the hotel teams in every way, being the liaison with Pineapple headquarters, providing answers on any topics as well as filling in at the hotels during key moments. I do my best to exemplify the spirit of Redefining Hospitality and assist in upholding expectations for our hotels by mentoring, training, and guiding the hotel teams in delivering upon those expectations. When I am not working in the world of Pineapple, I enjoy exploring new restaurants, playing tennis, and doing just about anything with my son. Robin Koetje Vice President of Information Technology College University of Washington Mascot Huskies Favorite fruit Grapes, because they are the most fun to eat, like candy or popcorn. Favorite Quote \"Sometimes I think the surest sign that intelligent life exists elsewhere in the universe is that none of it has tried to contact us.\" - Calvin from 'Calvin and Hobbes' My thing Technology in hospitality has been my thing since around 2000, right about when everyone thought technology was going to be the doom of us all with the Y2K glitch, which is likely not a coincidence.   I've enjoyed seeing IT grow and evolve in the industry, and I look forward to the exciting things we are going to be able to do as we continue to march through the 21st century.  Having been working in hotel management my whole career, I have been through a number of projects opening hotels, taking over ownership and management of hotels, and implementing new systems for properties and clients. I enjoy a good motorcycle ride on a curvy mountain road, crushing my kids playing video games on the Xbox or Nintendo Switch, and traveling with my wife and family to new places.  I play guitar poorly but passionately, and can bake a pretty darn good loaf of bread.  Love our Seattle sports teams and bleed purple for my Washington Huskies.  Go Dawgs! Austin Gardner Vice President of Distribution and Development College University of Wyoming Mascot Pistol Pete Favorite fruit Anything, as long as it’s in a cocktail! Favorite Quote Do not go where the path may lead, go instead where there is no path and leave a trail. - Ralph Waldo Emerson My thing Growing up on a Wyoming cattle ranch taught me the value of hard work, but I yearned for something more than hay bales and horseshoes. Even as a kid, I had a passion for adventure and travel, incessantly hounding my parents about our next road trip. It seems truly fitting that my childhood wanderlust would guide me toward a career in hospitality, where I've accumulated 13 years of experience in upscale sales and marketing. And I still made time to collect passport stamps from 24 countries along the way! Fast forward to today where I am thrilled to be looking for the next adventure with the Staypineapple team, redefining hospitality across the country. When I'm not working, you can catch me lounging poolside with my better half and our pint-sized pooch. And when we’re not relaxing? We're planning our next real estate investment move, or scheming a Shark Tank worthy side hustle. Casey Barks Vice President of Marketing College Northern Arizona University Mascot Go the Gorilla Favorite fruit PNW Cider (fermented apple juice is fruit, right?) Favorite Quote \"Your body is not a temple. It's an amusement park. Enjoy the ride.\" - Anthony Bourdain My thing As the product of a journalist mother, I grew up surrounded by the power of storytelling and the written word. During my college years, I spent my evenings serving tables in fine dining restaurants and my days taking communications and marketing courses at Northern Arizona University, with the hopes of one day combining these two passions into a career. 15 years and six cities later (San Francisco to Seattle to Austin to Vancouver to Salem to Bellevue), I now have the opportunity to share Staypineapple's fun and playful story with the world. When not writing press releases and creating social media strategies, you can find me with my amazing wife and adorable fur-baby discovering our next favorite Pacific Northwest adventure. Tony Ledesma Director of Finance College Washington State University Mascot Cougars Favorite fruit Watermelon Favorite Quote \"Every strike brings me closer to the next home run\" - Babe Ruth My thing I’ve lived in the Pacific Northwest my whole life and have been in the hotel industry since I was 18. I grew up in West Seattle and, after attending college in Pullman, I jumped right into my career with Staypineapple—where I’ve now been for over a decade. I genuinely love working with people and have a deep passion for numbers and data, and through digging into the details, whether it’s financial reporting, budgeting, or analytics, I’ve had the rewarding experience of contributing to and watching the company grow. When I’m not working, I love spending time outdoors and staying active—whether that’s walking, hiking, running, or golfing. I’m also a big sports fan (especially baseball), so you’ll often find me catching a Mariners game or out coaching our company softball team! Let's Get Social Instagram TikTok Facebook Twitter LinkedIn About Staypineapple Our Story Locations Health + Wellness The Staypineapple Impact Leadership Team Media Careers Development Connect JOIN THE CORE Contact Us ShopPineapple Tidbits - The Staypineapple Blog The Fine Print Guest Terms Flexible Cancellation Accessibility Privacy Policy Do Not Sell My Personal Information Site Security TripAdvisor TRAVELERS' CHOICE AWARD 2025 Winner STAYPINEAPPLE HOTELS 1-866-866-7977 [email protected] All rights reserved © 2025"
    }
  ]
}