{
  "fuentes": [
    {
      "url": "https://www.patquinns.com/our-people/",
      "email": "lisa@tsawwassensprings.ca"
    },
    {
      "url": "https://www.quinnsbarandrestaurant.com/",
      "email": "events@lacitacc.com"
    },
    {
      "url": "https://www.quinnsbayvillage.com/contact-us",
      "email": "manager@quinnsbayvillage.com"
    },
    {
      "url": "https://parkerandquinn.com/",
      "email": "info@ingoodcompany.com"
    }
  ],
  "mails": [
    "events@lacitacc.com",
    "info@ingoodcompany.com",
    "lisa@tsawwassensprings.ca",
    "manager@quinnsbayvillage.com"
  ],
  "nombre_sitio": "quinnsbarandrestaurant.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.patquinns.com/our-people/",
      "text": "Our People | Pat Quinn's Restaurant & Bar - Tsawwassen, BC Home Our Story Thanksgiving 2025 Thanksgiving Dinner Buffet 2025 Thanksgiving Turkey to Go 2025 Thanksgiving Plated Turkey Dinner Menus All Day Menu Weekend Brunch Happy Hour Desserts Bar Kids Wine Pre-Set Menu Order Now Reheating Instructions Quinn’s After Dark | Live Music Wine Up Wednesdays Prime Rib Sundays Trophy Room Guest Comments Our People Hours of Operation Reservations Gift Cards Gallery Contact Us 5133 Springs Blvd, Tsawwassen, BC V4M 0A6 (604) 948-1123 Instagram Facebook Happy Hour 2pm-6pm Daily Privacy Policy Our People The guiding inspiration for our team at Pat Quinn’s Restaurant & Bar is “Hospitality”. Our mission is to deliver a warm, graceful, hospitable experience with passion, creativity and innovation. Shaun Maclean Executive Chef Shaun is a native to south delta, growing up in Ladner.  He did his culinary apprenticship here in Tsawwassen through Beaches restaurant at the Coast Tsawwassen Inn. Following his red seal training, his career took him to the Fairmont Vancouver Airport, Cactus Club Cafe, Pan Pacific Hotel, The Westin Bayshore, and opening two locations with Kokomo, a plant based concept here in Vancouver.  Shaun looks forward to developing the menu here at Tsawwassen Springs and working with the team to create a great culture around the culinary program. Email: [email protected] Tom Kwan Food & Beverage Operations Manager Tom Kwan’s journey in the food and beverage industry began at just 16 years old, working in his family’s pizzeria. What started as a passion for cooking quickly evolved into a deeper commitment to hospitality when he stepped out of the kitchen and witnessed the joy and connection shared by guests in the dining room. From that moment, he knew his true calling was creating unforgettable guest experiences. With over 20 years in the F&B industry, Tom has honed his skills at esteemed establishments including Seasons in the Park, Century Plaza Hotel, and Hycroft. During his three years as a Rental Coordinator at Hycroft, he specialized in planning and executing weddings, refining his attention to detail and client care. In 2016, Tom joined Tsawwassen Springs, where he led the banquet division for five years, working closely with the Executive Chef to craft unique, personalized experiences for clients. His dedication to excellence and innovation paved the way for his current role as Food & Beverage Operations Manager. Today, Tom supports both the restaurant and banquet teams, consistently elevating the guest experience and ensuring every interaction reflects the highest standards of service and hospitality. Email: [email protected] Rodrigo Morales Executive Sous Chef Rodrigo is a seasoned culinary professional with over 30 years of experience, building a career shaped by his passion for food and his dedication to his family. A devoted husband and father, his professional journey is a testament to his adaptability and expertise. His culinary foundation is a rich blend of European techniques and strong Latin influences, honed through extensive international experience in Mexico, Chile, and now Canada. As a highly goal-oriented and entrepreneurial chef, Rodrigo has a proven track record of building unique concepts and successful brands. He excels at managing kitchen operations, meticulously controlling food and labor costs, and fostering consistency within his teams. His skills range from advanced kitchen management and menu development to the art of food plating and presentation. He has also made a significant impact as a Chef Instructor, where he mentored over 550 young chefs and developed a passion for personalized teaching. Throughout his career, Rodrigo has consistently demonstrated a commitment to excellence, whether leading large teams in a fine dining steakhouse in Mexico City or launching new, trendy restaurants in Vancouver. Email: [email protected] Lovepreet Gill Restaurant Manager Lovepreet Gill is eager to leverage his extensive hospitality management experience in new professional opportunities. Holding a Bachelor’s degree in Business and boasting 15 years of diverse, hands-on experience in the hotel and restaurant industry, Lovepreet has cultivated expertise in leadership, operations, finance and customer service. He has successfully managed teams in dynamic, high-pressure settings, including new openings, where he maximized profitability and trained staff in critical operational processes. His career includes international experience, such as overseeing operations and finance at the Radisson Hotel as a Controller in Ireland and managing front office teams in British Columbia, as well as leading restaurant chain openings in Ontario. Renowned for his exceptional interpersonal skills, Lovepreet excels at fostering positive relationships with guests, employees, and suppliers. His core competencies include customer service excellence, payroll management, inventory control, and talent acquisition, making him a valuable addition to the Tsawwassen Springs team. Dedicated to achieving operational excellence, Lovepreet is committed to delivering outstanding service and continually enhancing guest satisfaction Email: [email protected] Himanshu Bisht Restaurant Manager Himanshu Bisht is a seasoned hospitality professional with a rich background in global hospitality and tourism management. A graduate of Capilano University’s esteemed Global Hospitality & Tourism Management program, Himanshu has consistently demonstrated a passion for creating exceptional guest experiences. With over a decade of expertise in the hospitality industry, Himanshu has excelled in roles across food and beverage operations, event management, and customer service. In his last role at Wedgewood Hotel & Spa, he has been instrumental in ensuring quality control, training teams, managing inventories, and introducing innovative menu concepts. Himanshu’s diverse portfolio includes working with luxury properties like Spirit Ridge, the Unbound Collection by Hyatt, and Le Méridien. He has a proven track record in overseeing restaurant operations, coordinating large-scale events, and leading high-performing teams. His skills in problem-solving, effective communication, and team mentorship have consistently contributed to exceeding customer satisfaction and achieving business goals. Himanshu is adept at adapting to dynamic industry trends. His dedication to continuous learning and his ability to foster inclusive, guest-centric environments make him a valuable asset to any hospitality organization. Email: [email protected] Lisa Powers Restaurant Manager Lisa is thrilled to join the Management team at Tsawwassen Springs! She has been with our Pat Quinn’s team since May 2020 and has excelled at her job - always with a smile. Lisa was with The Keg Restaurants for 15 years working at the Burnaby, Granville Island and Guildford locations. She also took a one year working holiday to Australia with The Keg Restaurants. Prior to starting at Pat Quinn’s Restaurant & Bar, she worked 8 years at the Gateway Casino Kamloops, Parq Vancouver Casino and Great Canadian Gaming in Surrey. Lisa loves to travel and visit her two boys wherever they are working in BC and enjoys living in White Rock. Email: [email protected] Jill Presley Community Relations & Brand Specialist Jill joined the team at Tsawwassen Springs  in 2015 as the Assistant Director of Sales & Marketing, she worked in the Real Estate Sales Centre and helped them achieve a remarkable amount of sales. In June of 2018, Jill moved to the clubhouse where she now focuses on Marketing and Business Development. Jill has been in the hospitality industry for 20 years and holds her Hospitality Management Diploma. A high energy, creative personality, with a strong ability to execute independence of action and judgment. A strong team player with ability to establish and maintain effective working relationships at all levels of the organization. Jill is excited to help Tsawwassen Springs and Pat Quinn's Restaurant & Bar grow into a local landmark. Email: [email protected]"
    },
    {
      "url": "https://www.quinnsbarandrestaurant.com/",
      "text": "American Food, Sports Bar & Grill, Sunday Brunch and Lunch Daily | Quinn's Bar & Restaurant Titusville home Our Menus Limited Menu (Aug 1st thru Oct 1st) About Us Location home Our Menus Limited Menu (Aug 1st thru Oct 1st) About Us Location (321) 383-2582 777 Country Club Dr. Titusville, FL 32780 Facebook Instagram Quinn's Bar & Restaurant American Restaurant - Sports Bar Are you looking for an American Restaurant with hand made burgers, salads and chicken with great appetizers and a happy hour? Here at Quinn’s in the heart of Titusville, FL we have all that and more. We have sports on all our TV’s everyday (it’s Football season y’all), weekly karaoke nights, holiday theme nights, and a kids menu sure to have something they’ll eat; Quinn’s is a place for everyone, even the picky eaters! VIEW OUR FULL MENU Sunday Brunch NOTE: IN THE MONTH OF AUGUST & SEPTEMBER WE ARE PUTTING A HOLD ON OUR BRUNCH DUE TO GOLF COURSE MAINTENANCE THE ADMIN AND RESTAURANT CLOSE AT 2PM WITH A LIMITED “SUMMER MENU” Not only do we have sports and happy hour, we offer Last Sunday of the Month Brunch from 9:00 am till 1:00 pm. Our brunch buffet offers a range of delicious & traditional menu items. If you have been missing a place where you can get a traditional Sunday Brunch with the comfort food you expect to see make sure to come by and check out Quinn’s Sunday Brunch. View Brunch Menu Event Venue Wedding Venue & Catering Are you searching for a wedding venue in Titusville? We not only have a luxurious indoor venue, but we also have an outdoor terrace overlooking the green golf course for both indoor and outdoor events. Many weddings have an outdoor ceremony on the terrace with indoor dining and dancing with our moveable dance floor for many layout options for your reception or party. Same for business events, graduation parties, milestone birthday parties, milestone anniversary celebrations, retirement parties, holiday parties, or any fun or business-related gathering for that matter. Please contact events@lacitacc.com for more information Parties & Events Call Quinn's Restaurant — 321.383.2582 extension 4 Reservations — 321.383.2582 extension 2 Bar & Restaurant Hours Monday – Closed Tuesday – 11am – 2pm Wednesday  – 11am – 2pm Thursday – 11am – 2pm Friday – 11am – 2pm Saturday – 11am – 2pm Sunday – 11am – 2pm Our Location 777 Country Club Dr. Titusville, FL 32780 Website by Red Leaf Websites & Hosting"
    },
    {
      "url": "https://www.quinnsbayvillage.com/contact-us",
      "text": "Contact 1 — Quinn's Kitchen and Bar 0 Skip to Content Quinn's Kitchen and Bar Home Reservations Menus Dinner Menu Drink Menu Kid's Menu Specials Online Ordering Gift Cards Contact Us Gallery Open Menu Close Menu Quinn's Kitchen and Bar Home Reservations Menus Dinner Menu Drink Menu Kid's Menu Specials Online Ordering Gift Cards Contact Us Gallery Open Menu Close Menu Home Reservations Folder: Menus Back Dinner Menu Drink Menu Kid's Menu Specials Online Ordering Gift Cards Contact Us Gallery Contact us. manager@quinnsbayvillage.com (440) 455-1237 2257 Eaton Way Bay Village, OH 44140 Name * First Name Last Name Email * Message * Thank you! Contact 25517 Eaton Way Bay Village, OH 44140 manager@quinnsbayvillage.com (440)-455-1237 Make a Reservation ﻿ HOURS Tues-Thurs 4pm-9pm Fri-Sat 3:30pm-9pm Sunday 3:30pm-8pm"
    },
    {
      "url": "https://parkerandquinn.com/",
      "text": "Parker & Quinn - NYC New American Restaurant and Bar EXPERIENCES Menu Reservations PARTIES UNDER 20 GUESTS PARTIES OVER 20 GUESTS Events PARTIES UNDER 20 GUESTS PARTIES OVER 20 GUESTS Order Online Careers Gift Card Store Menu Menu HOURS OPEN DAILY KITCHEN HOURS Monday-Tuesday BREAKFAST 7am-10:45am LUNCH & DINNER 11:30am-10pm —– Wednesday-Friday BREAKFAST 7am-11am LUNCH & DINNER 11:30am-11pm —– Saturday & Sunday BRUNCH 8am-3pm DINNER 4pm-11pm (1opm on Sunday) BAR HOURS Daily until 11pm THE REFINERY EXPERIENCE Available Fridays & Saturdays DINNER & A VIEW $249 per couple plus tax/fees and gratuity includes: • 2 course meal with bottle of wine at Parker & Quinn • private escort to Refinery Rooftop or Winnie’s Jazz Bar for a reserved table with a cocktail each and a dessert to share —— SUPPER CLUB $95 per person plus tax/fees and gratuity includes: •three course meal at Winnie’s Jazz Bar for LIVE JAZZ •one bottle of wine per 2 guests •reserved seating BOOK AN EXPERIENCE visit us 64 W 39TH ST NEW YORK, NY 10018 RESERVATIONS OR CALL (212) 729.0277 EVENT INQUIRIES EVENT GALLERY VIRTUAL TOUR MENU & MORE ALL DAY BREAKFAST BRUNCH BEVERAGE KIDS MENU DESSERT THEATRE MENU ORDER DELIVERY OR TAKE-OUT or call (212) 729-0277 Simple delicious dishes grounded by classic techniques with a focus on healthy, natural and sustainable products. About Parker & Quinn Inherently New York, but with global appeal, Parker & Quinn is the signature restaurant of Refinery Hotel conveniently located steps away from Bryant Park in the heart of NYC’s Garment District. Parker & Quinn is operated by IGC Hospitality, the team behind other acclaimed NYC venues such as Park Avenue Tavern, Trademark Taste & Grind, Refinery Rooftop, and The Wilson. Serving breakfast, lunch, brunch, dinner, and cocktails in a nostalgic atmosphere, Parker & Quinn features classic design touches that span a century of New York City history, from the building’s early life as a working factory to a chic, present-day meeting place for fashionable locals and guests. Executive Chef Fernando Santiago takes a straightforward and rustic approach in his kitchen, relying on high-quality and locally-sourced ingredients to produce balanced, approachable American dishes. instagram A PART OF IGC HOSPITALITY VISIT IGCHOSPITALITY.COM TO SEE OUR OTHER VENUES © 2025 – Parker & Quinn Web Development by Once Interactive Quick Links About Venues Catering Consulting Videos Press Events Contact Us Other Links Reservations Shop Cart Terms & Conditions Privacy Policy Return Policy Accessibility Policy ADA Compliance Feedback Contact Info Parker & Quinn 64 W 39TH ST NEW YORK, NY 10018 Click here for inquiries Click here for events Click here for reservations Facebook Instagram LinkedIn YouTube OTHER VENUES Park Avenue Tavern Refinery Rooftop Bungalow Bar Winnie’s Jazz Bar The Wilson The Rockaway Hotel Margie’s Royalton Scroll to top Close Font Resize A- A+ Reset font size Readable Font Contrast Choose color black white green blue red orange yellow navi Underline links Clear cookies Images Greyscale Invert Colors Close Accessibility by WAH"
    }
  ]
}