{
  "fuentes": [
    {
      "url": "https://quinns.live/",
      "email": "info@quinns.live"
    },
    {
      "url": "https://www.quinnsltd.com/category/news/",
      "email": "enquiries@quinnsltd.com"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "chief.instrcutor@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "club.captain@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "nippers.manager@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "youth.coordinator@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "admin@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "chaplain@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "education@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "feedback@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "finance@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "house@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "info@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "lifesaving@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "marketing@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "member.protection@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "nipper.surfsports@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "president@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "senior.surfsports@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "surfsports@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "vicepresident@qmslsc.com.au"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "email": "youth@qmslsc.com.au"
    }
  ],
  "mails": [
    "admin@qmslsc.com.au",
    "chaplain@qmslsc.com.au",
    "chief.instrcutor@qmslsc.com.au",
    "club.captain@qmslsc.com.au",
    "education@qmslsc.com.au",
    "enquiries@quinnsltd.com",
    "feedback@qmslsc.com.au",
    "finance@qmslsc.com.au",
    "house@qmslsc.com.au",
    "info@qmslsc.com.au",
    "info@quinns.live",
    "lifesaving@qmslsc.com.au",
    "marketing@qmslsc.com.au",
    "member.protection@qmslsc.com.au",
    "nipper.surfsports@qmslsc.com.au",
    "nippers.manager@qmslsc.com.au",
    "president@qmslsc.com.au",
    "senior.surfsports@qmslsc.com.au",
    "surfsports@qmslsc.com.au",
    "vicepresident@qmslsc.com.au",
    "youth.coordinator@qmslsc.com.au",
    "youth@qmslsc.com.au"
  ],
  "nombre_sitio": "quinns.live",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://quinns.live/",
      "text": "Best Irish Pub & Grill in Seminole, FL | Quinn’s Live LLC 727-393-9510 Irish Pub & Grille & Live Music Hall 727-393-9510 Home About Quinns Our Menu Events Artists Celebrate Menu Home About Quinns Our Menu Artists Live Music Contact Us Mickey Great live music * Warm atmosphere Killer bartending * Awesome food whatever happens, be cool… Download Calendar (PDF) Upcoming Events menus Appetizers Irish Fare Specialty Drinks Irish Whiskeys Soup & Salad Dessert Americana Late Night Menu Seasonal Specials Next on Quinn's Stage September 10, 2025 Emma G Emma G LIVE in the Music Hall at Quinns!!! Events join our mailing list to hear about special events and promotions Please leave this field empty. Δ raise your hands move your feet lift your voice Quick Links Home About Quinns News/Blog Our Menu Live Music Artists Celebrate Contact Us 727-393-9510 13071 Park Blvd N, Seminole, FL 33776 Info@Quinns.Live Hours Mon-Wed 3pm-3am Thur-Sat 11am-3am Sun 11am-3am © 2025 - QUINN’S LIVE LLC - All Rights Reserved | Powered by RooSites Search Menu Categories Set your categories menu in Header builder -> Mobile -> Mobile menu element -> Show/Hide -> Choose menu Home About Quinns Our Menu Events Artists Celebrate Compare"
    },
    {
      "url": "https://www.quinnsltd.com/category/news/",
      "text": "News – Quinns M&E Specialists Home About Services Electrical Services Mechanical Services Specialist Services Planned Maintenance Services Project Management Building Contractors Case Studies News Contact Menu Menu LinkedIn Facebook News 2024 Year in Review It’s that time of year again when we like to reflect and take stock of what has happened over the last 12 months. This year was particularly poignant as the company celebrated its 20 th anniversary of providing M & E services in this wonderful part of the country. Products & Services In 2024 we continued to enhance the range of services on offer. Firstly, our move into the renewables market gained further momentum. In April, we achieved full industry accreditation for Air Source Heat Pump installations and obtained our first Boiler Upgrade Scheme Grant on behalf of one of our clients. Our Solar PV certification was successfully renewed and the engineers completed a number of Electric Vehicle Charger installations. The business is looking to grow its Renewables offering in 2025; with this in mind keep an eye out for the new Quinns Renewables website which will be going live in January! The Construction Team has also grown in size this year – the company now has a full range of disciplines to support our M & E projects and offer an office refurbishment service. However, its main thrust has been the move into providing a fully accredited Fire Stopping service and we welcomed some specialists in this area. 2025 promises to be an exciting time for this integral part of the business. Despite these new ventures, the core business remains the delivery of our M & E projects . This constant source of work on vital sites in and around the area is never taken for granted and the company remains committed to providing a fully accredited and compliant range of services to our loyal and valued client base. Employees It goes without saying that business could not perform as it does without our excellent team of engineers and office staff. This applies equally to our longer serving personnel and to those we have been delighted to welcome this year. In 2024, we welcomed seven new members to the team with two more due to start in January. This is a marked increase in staff numbers  from the same period last year which reflects our growth strategy. There is also a pool of sub-contractors who work with us all year round and remain an invaluable source of support for the business. Staff retention and welfare is at the heart of what we are looking to achieve. The directors continue to assess how we can build on the package and benefits we offer whilst embracing the recent legislation changes in employee rights. The annual Staff Appraisal system is also  embedded into the process where we have encouraged staff involvement in discussions over pay, training and career progression. The comprehensive Staff Handbook introduced in 2024 will be updated for next year and will include the revised Grading System and Pay Bands. It was also another strong year for our Apprentices. Four achieved full qualification in 2024, a fresh cohort should get over the line in 2025 and we were delighted to welcome two new starters back in September.  Our Apprentice Scheme remains an immense source of pride for the business. Kris and the directors would like to express a huge depth of gratitude to all the staff for their efforts and loyalty in 2024 and we look forward to our Christmas Drinks later this month. Challenges & Ambitions! The company did face some significant headwinds in 2024 which we worked hard to overcome. A new Government, changes to Employee rights, a run of bad luck with our fleet of vans, a couple of long-term absentees plus an ever increasing number of audits meant the business had to work even harder to achieve our aims. Despite all this, we have managed to take on more work than ever before, embarked on a huge re-piping project and still achieved deadlines to keep our clients on board. Challenges are of course part and parcel of running an SME but these will not stand in our way going forward. In 2025, the company is looking to continue its expansion and diversification and Kris will be making an exciting announcement in January concerning our ambitions for the New Year. This will include an internal restructure of the business designed to improve efficiencies and aimed at making sure we continue to deliver for our clients and cover all their M & E requirements- watch this space!! Summary It’s only when you take a step back and reflect on the year that we realise just how much has been achieved. We sincerely hope that all the groundwork put into our continuous improvement will bear fruit in 2025 and beyond. In the meantime, on behalf of our MD Kris Quinn, Quinns M & E would like to wish all our clients, suppliers and partners and stakeholders a wonderful Christmas, a prosperous New Year and a huge thank you for your unwavering support. https://www.quinnsltd.com/wp-content/uploads/2024/12/2024-year-in-review.png 400 800 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-12-05 14:04:00 2024-12-05 14:05:01 2024 Year in Review News Mid-Year Milestones: Expansion, Innovation and Sustainability It’s hard to believe that come the end of September we will be half-way through our financial year. Time has flown by so we’re taking a step back to reflect on the last 6 months. The company continues to grow – our headcount has risen by a further 15% and as a result so has our fleet of vans. We have added to our range of products and achieved a number of associated accreditations. On the construction side of the business, we have moved firmly into Fire Stopping as well as adding to the skill-set to cover all aspects of refurbishment and maintenance. The Mechanical Team is undertaking a large programme of re-piping as well as continuing to service our domestic and commercial client base. The team has also achieved MCS accreditation for the installation of Air Source Heat Pumps. The Electrical Team continues to work on a range of projects and has seen two of its apprentices move to full qualification, with the next cohort hot on their heels. Finally, Kris and his co-directors have worked hard to position Quinns for a full renewable energy offering. We have acquired our first fully electric vans, secured a consumer finance provider, renewed all the necessary qualifications, and we are due to launch our new renewables website imminently. Overall, we can be very proud of all that we have achieved over the last 6 months but as always, we could not have done it without the support of our incredibly loyal client base and stakeholders. Your custom, advice and guidance is never taken for granted as we strive to continue our aim of providing top quality and fully compliant service. https://www.quinnsltd.com/wp-content/uploads/2024/09/Untitled-design.png 400 800 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-09-26 10:07:33 2024-09-26 10:07:36 Mid-Year Milestones: Expansion, Innovation and Sustainability News Electric Heating vs. Conventional Wet System Heating: What’s Best for Your Home This Winter? As winter approaches and the days get shorter, many of us are turning our thoughts to keeping our homes warm and cosy. In the UK, where temperatures can drop significantly, choosing the right heating system is crucial for both comfort and cost-efficiency. Two popular options are electric heating and conventional wet system heating (often known as central heating). Each has its own set of pros and cons, and understanding these can help you make an informed decision for your home this winter. Electric Heating Pros Ease of Installation: Electric heaters are generally easier and quicker to install compared to wet system heating. There’s no need for extensive pipework or a boiler; plug-in heaters or wall-mounted units can be set up with minimal disruption. No Maintenance Costs: Electric heating systems require less maintenance. There are no boilers to service or radiators to bleed, which can save you time and money in the long run. Zone Heating: Electric heaters can be used to heat individual rooms or zones, which means you can target warmth where it’s needed most. This can be more efficient if you only use certain rooms frequently. Lower Initial Costs: The upfront cost of purchasing and installing electric heaters is generally lower than installing a conventional wet system heating setup. Cons Higher Running Costs: Electricity is often more expensive than gas, and electric heaters can be costly to run, particularly if used as the primary source of heating. This can lead to higher energy bills during the winter months. Limited Heat Distribution: Electric heaters may not provide the same level of consistent, whole-house warmth as a central heating system. They are often better suited for supplementary heating. Environmental Impact: Depending on how your electricity is generated, electric heating might have a larger carbon footprint compared to gas central heating. It’s worth considering the source of your electricity and looking into green energy options. Conventional Wet System Heating (Central Heating) Pros Cost-Effective Running Costs: Central heating systems that use gas are typically more cost-effective in terms of running costs compared to electric heaters. Gas prices are generally lower than electricity, which can result in lower bills. Whole-House Warmth: A well-designed central heating system provides consistent and even heating throughout your home. This can be especially beneficial during the colder months when maintaining a uniform temperature is important. Energy Efficiency: Modern condensing boilers are highly efficient and can significantly reduce energy consumption. Additionally, many systems are compatible with smart thermostats, allowing for better control and efficiency. Environmental Benefits: If you use a combination of a high-efficiency boiler and renewable energy sources, such as solar panels, your carbon footprint can be reduced compared to purely electric systems. Cons Higher Initial Costs: The installation of a central heating system, including the boiler, radiators, and pipework, can be expensive. This is a significant investment, though it can pay off over time with lower running costs. Maintenance Requirements: Central heating systems require regular maintenance to ensure they operate efficiently and safely. This includes servicing the boiler and checking for any issues with the radiators and pipework. Installation Disruption: Installing a new central heating system can be disruptive, especially if it involves extensive work such as fitting pipes and radiators throughout your home. Which Is Right for You? Choosing between electric heating and conventional wet system heating depends on various factors, including your budget, the size of your home, and your heating needs. If you’re looking for a lower initial cost and easy installation, electric heaters might be a good choice. However, if you’re concerned about running costs and want consistent, whole-house heating, a conventional wet system could be more beneficial in the long run. Before making a decision, consider getting a professional assessment of your home’s heating needs and energy efficiency. This can help you determine the most cost-effective and environmentally friendly option for your winter comfort. Ultimately, the goal is to stay warm and comfortable without breaking the bank or harming the environment. By weighing the pros and cons of each system, you can make an informed choice that suits your home and lifestyle this winter. Give Quinns a call to discuss how we can help keep you warm this winter. https://www.quinnsltd.com/wp-content/uploads/2024/09/winter-landscape-2995987_1280-e1726688033206.jpg 691 1280 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-09-19 09:14:58 2024-09-19 09:15:03 Electric Heating vs. Conventional Wet System Heating: What’s Best for Your Home This Winter? News Hints & Tips For Apprentices/School Leavers This time of year always brings to mind the many youngsters who are taking exams and making decisions regarding their future once they leave school. As a company, we have taken on in excess of 20 apprentices over the years which not only benefits the business but supports the future of our industry. We are very proud of the support and guidance we have given our trainees with many of them now fully qualified engineers and dedicated to delivering top quality service to our clients. We have also offered many work experience opportunities, and continue to do so, which shows our commitment to the construction sector and the younger generations in the local community. Therefore, I would like to set out some tips and guidance for those about to embark on the next stage of their lives with a particular emphasis on young people who are interested in the electrical and mechanical industries. I appreciate that it is many years since I was facing the very same scenario and that times have of course changed dramatically. However, many of the tips below are as relevant today as they have always been. I also want to reassure the younger generation that, although good grades from your exams are a great start, there are other areas we focus on when looking to recruit. So here goes with some pre-employment pointers.… When applying, be sure to demonstrate a keen interest in the industry you have chosen. Do your research and gain a basic understanding of what duties the apprenticeship you are applying for entails. Find out the potential courses available, what exams/qualifications you will need to take and how the training programmes work. For those in the local area, I recommend enrolling with either JTL or Salisbury College. This demonstrates that you have passed any aptitude tests and have already been approved for training. If called for interview make sure you are au-fait with the information in Point 1 and anticipate the basic skills you would need to progress within the company. This shows initiative and don’t be afraid to talk to somebody in the company for some hints and guidance before you turn up. Within this sector, you are definitely going to need to be able to drive. Assure your prospective employer that you are committed to your lessons and taking your test as soon as is practical. Present a well-prepared CV that lists your achievements, interests and relevant to the sector itself. By all means enlist the help of your parents, peers and online tips but keep it personal and composed by yourself. We would like to get to know the applicant behind the CV and cannot do this if a generic one is presented and written by somebody else. Turn up in plenty of time, make an effort with your appearance and be courteous to the interviewer. We appreciate that you may be nervous but try and be yourself and take your time with your answers. If you do secure your apprenticeship, I am assuming you will then want to impress in order to stay with the company once qualified. Do not rest on your laurels and bear the following in mind… When you are working with the engineers, don’t just stand and watch. Ask questions, show an interest, and offer to help when you can. Don’t worry about checking your understanding, don’t feel you are being a burden because all our engineers were once in your shoes. Take responsibility for your courses and exams- ensure you communicate with your college and the company and again ask for help and guidance where necessary. Keep your paperwork in order. If you are asked to complete paperwork to gain access to sites for example, do so promptly, tidily and without the need to be chased. Organising yourself at an early stage will make sure you continue this discipline throughout your career. Whilst I would never tell you how to spend or save your wages, think about setting aside an amount each week to invest in some of the tools you will need in the future. Again this demonstrates commitment and it is easier to do when you are living rent-free at home! Finally, and this should really be a given, treat your colleagues and the company with respect. Show good manners such as keeping your phone where it should be, look after company property, be punctual and be willing to help others. Above all, come to work with a positive attitude, enjoy it and I wish you every success as you embark on this exciting journey. KRIS QUINN, MD. K J QUINN SERVICES LTD. https://www.quinnsltd.com/wp-content/uploads/2024/05/solar-8499873_1280.jpg 356 800 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-05-15 14:11:26 2024-05-15 14:11:28 Hints & Tips For Apprentices/School Leavers News Derek Barclay enters 10th year at Quinns M&E We are delighted to announce that our Mechanical Director, Derek, is entering his 10th year at Quinns M&E. Back in 2015, the company provided electrical services only and Derek was brought in to start the mechanical arm so we could become a full M&E business. At the time, Derek was the sole mechanical engineer and was tasked with bringing in plumbing and heating work and, as the workload grew, finding and training new engineers. Wind the clock forward ten years and Derek’s division now accounts for 40% of the company’s revenue, as well as supporting the electrical and construction arms. His team has now grown to eight employees and over the years he has mentored apprentices from their first day at college through to full qualification. Above all, the secret to Derek’s success has been the quality of work produced by himself and his team. This quality is combined with a dedication to site safety and cleanliness. All this has resulted in a strong reputation for Derek and the company in the plumbing and heating sector. We wish Derek every success in his 10th year and are proud of all he has achieved. https://www.quinnsltd.com/wp-content/uploads/2024/02/Screenshot-2024-02-08-121831.jpg 345 804 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-02-08 12:21:04 2024-02-08 12:21:08 Derek Barclay enters 10th year at Quinns M&E News Choosing a Commercial Contractor for Your Business Choosing the right commercial contractor for your business can mean the difference between a successful project and one that fails to get off the ground. Where do you start? In this blog, we’ll look at some important factors to consider when choosing a commercial contractor for your business. Get recommendations Ask others in your industry if they can recommend a contractor. If they’ve hired contractors for similar projects, they’ll likely have some good contacts to share. They might also be able to warn of any contractors who were unreliable or didn’t provide a good service, so you’re aware of who to avoid. Ask for references, reviews and testimonials One of the most important things to do when choosing a commercial contractor for your business is to check reviews and testimonials. As well as checking their Google Business Profile and website, don’t hesitate to ask for client contact details so you can follow up. Think of relevant questions to ask past clients, for example, did the contractor work to budget, were their skills and experience suitable for the project, and did they show up on time, communicate clearly and complete the project on time and to a high standard? Check licensing, insurance and accreditation It’s equally important to check that any contractor you’re considering hiring is properly accredited, licensed and insured. Anyone who doesn’t hold a valid licence may not be qualified to carry out the work they’re promising. A contractor without the proper insurance might end up costing your business money in the event of an accident or unforeseen issues. Assess communication skills When hiring a commercial contractor you want somebody who communicates clearly. If a project runs over budget or behind schedule, you need to know promptly. Likewise, if a personal emergency prevents contractors from working, you need to be kept informed. Excellent communication starts with the very first contact with any commercial contractor — are they easy to reach via phone and/or email during business hours? If you can’t get hold of them now, things are unlikely to be any different should you hire them. Discuss the financial details Always make sure that you clearly outline your budget and provide it to potential commercial contractors. Anyone you’re planning to work with should provide a detailed estimate, with a breakdown of any associated costs for materials, labour, and other expenses. A contractor who is uncomfortable with financial details or gives a rough estimate without a breakdown isn’t somebody you want to work with. Conclusion As you can see, there are a number of important things to think about when choosing a commercial contractor for your business. Though it might be tempting to rush this stage, it’s important to spend time selecting the right contractor to prevent problems down the line. Looking for a reliable contractor for your commercial project? We’re always on hand to help! Our friendly team is happy to answer any questions you may have about choosing a contractor for your business. Get in touch here or call us on 01980 625449 today to chat with our experts. https://www.quinnsltd.com/wp-content/uploads/2024/02/pexels-life-of-pix-8092-1.jpg 3840 5760 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-02-01 08:39:09 2024-02-01 08:39:20 Choosing a Commercial Contractor for Your Business News , Uncategorised 2023: THE YEAR IN REVIEW 2023 has been another fantastically busy year here at Quinns M+E, and as the business enters its 20 th year, we reflect on our key highlights over the last 12 months. In a nutshell: We entered the renewables market following full industry accreditation for solar panel installation, and are completing formalities for final certifications in Battery Storage and Air Source Heat Pumps We announced the creation of our new Construction Team, which has enabled Quinns to offer a full Fire Stopping service as well as office refurbishment The team has grown by a huge 35% as we welcomed 5 new team members with 2 more due to start in January We held our first team event, introduced an annual staff appraisal scheme and enhanced HR support We have continued investing in upskilling our staff through training and accreditations and high-quality technology, standing us in good stead for 2024 and beyond To delve\ninto the details: Products/Services: 2023 has\nbeen a year of service expansion here at Quinns. We ventured\ninto the Renewables market, achieving full industry accreditation for Solar\nPanel Installation in April, and have since successfully completed a number of projects.\nWe are also currently completing formalities for final certifications in Battery\nStorage and Air Source Heat Pumps. The business has plans to grow its\nRenewables offering in 2024, including launching our new website which will assist\nour customers on their journey towards a sustainable future. The\nDirectors were also proud to announce the set-up of Quinns’ new Construction\nTeam in September. The recruitment of specialist plasterers and floor-layers\nhas enabled the business to offer a full Fire Stopping service as well as\noffice refurbishment. Despite\nthese new ventures, we never take for granted our core business of commercial\nM&E projects, which continues unabated. The company continues to ensure the\nprovision of the highest quality of service across the board. Employees: Of course,\nthe business could not perform as it is without our excellent team of engineers\nand office staff. In 2023, we\nwelcomed 5 new team members with 2 more due to start in January. This is a 35%\nincrease in staff numbers versus December 2022. In July, the\nDirectors hosted the first Team Event where we outlined the company vision and\nasked the staff for their ideas and feedback. The event was well received, and\nwe look forward to staging further events next year. The company\nenhanced the staff packages this year with the introduction of additional\nbenefits and support services. Each staff member now has a Life Insurance Policy\nequating to 3 x salary to add to the Private Healthcare scheme already in\nplace. An annual\nStaff Appraisal system has also been introduced where we have encouraged staff\ninvolvement in discussions about pay, training and career progression. We\nimplemented across the board pay increases, a new Grading system and a more\ngenerous holiday package commences in 2024. The company\nis working with an HR partner to ensure we are supporting our staff inside and\noutside of work as well as bringing in more automation to manage absence,\nperformance and staff documentation. Investment: To remain competitive,\nthe business needs to continue investing in updated equipment, vehicles, technology,\nas well as training and accreditations. This has\ninvolved new and slicker laptops for office staff, updates to the vehicles, and\nall-weather uniforms issued to all our engineers. One look at\nour Training and Qualifications matrix will show our commitment to ensuring that\nour engineers have the full range of updated skills. In particular, the\nConstruction Team have spent time upskilling in the last quarter, which holds\nus in good stead for next year. Summary: Looking\nback over the year, it’s clear just how much has been achieved. We sincerely\nhope that all the work put into our continuous improvement will bear fruit in\n2024 and beyond. In the meantime,\nour Managing Director, Kris Quinn, would like to thank our clients, suppliers\nand partners for their unwavering support. From all at Quinns we hope you have a\nwonderful Christmas and a prosperous New Year. https://www.quinnsltd.com/wp-content/uploads/2023/12/Screenshot-2023-12-17-141558.png 454 779 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2023-12-21 13:13:51 2023-12-22 13:47:28 2023: THE YEAR IN REVIEW News Quinns M&E successfully renews BAFE accreditation Quinns\nM&E is delighted to report the successful renewal of the company’s BAFE (British\nApprovals for Fire Equipment) accreditation this month. BAFE is the independent\nregistration body for Third Party Certificated fire safety organisations across\nthe UK. Quinns\nM&E\nhas been installing fire alarm and emergency lighting systems for many years\nand has a team with a vast knowledge of these systems working to BS5839 and\nBS5266. The\ncompany believes that the best way to demonstrate competence to its clients\nwithin this area is to maintain the highest recognised standard which is BAFE. The\nbusiness first achieved this accreditation in 2013 and is delighted to have its\ncertifications renewed following the successful audit. These\nvital accolades do not happen by accident. Quinns’ MD, Kris Quinn, would like\nto extend a special thanks to Darren Conn and Adam Quinn for all the\npreparatory work involved plus dealing with the Auditor over the two days. The\ncompany is also grateful to Scott Rumson from NSI for his guidance and support\nthroughout the process. https://www.quinnsltd.com/wp-content/uploads/2023/11/BAFE-logo.png 500 920 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2023-11-30 15:40:35 2023-12-22 13:47:33 Quinns M&E successfully renews BAFE accreditation News Blog: A week in the life of an SME Author: Patrick Harrington, Operations Manager Well, the shift\nfrom working at a large corporate to an SME continues to prove a huge\neye-opener. When things\nwent wrong at the Bank there was always a department to sort things out- a\nLloyds equivalent of Mr Benn appeared “as if by magic” and the problem was\nsolved! This occurred with minimal impact on my time, and I was able to crack\non with the day job. Yet, as I write this, we are only at mid-morning on Wednesday and already the following has happened this week: Two more of our vans have had faults reported and are in the garage- that is now a total of five currently off the road for various reasons. Our phone/internet provider has decided to remove the named contact from their files – they are now refusing to speak with us about our intermittent online reception. An engineer we were due to meet on site decided to turn up an hour early and then left before we arrived at the allotted time. An outbreak of chickenpox has caused havoc with childcare arrangements which in turn affects where our engineers can be. On the face of it none of the above are disastrous (unlike when we ran out of tea bags this morning and I had to hotfoot it to Tesco!), but all take time and resources to resolve. We are too few for any of us to walk past these problems and we all need to muck in accordingly. I am not complaining- I love the job and what it entails. I simply thought this entry would likely resonate with our fellow SMEs and open the eyes of others to the challenges faced when running businesses of this size. Let’s see what the rest of the week brings! https://www.quinnsltd.com/wp-content/uploads/2023/11/pexels-malte-luk-2244746.jpg 4000 6000 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2023-11-16 10:07:14 2023-12-22 13:47:38 Blog: A week in the life of an SME News Remembrance Day 2023 This\nweekend, the Quinns team joins the nation as we pay tribute to those who have\ngiven their lives in conflicts from World War I until the present day. This\ntime of year is particularly poignant here in Wiltshire which of course is home\nto so many people serving their country. At Quinns M&E,\nwe are privileged to carry out mechanical and electrical works for a number of\nmilitary and RAF sites. This has been a core part of our business for so many\nyears, and we continuously strive to provide the optimum level of service to ensure\nthese vital locations function as they should. Kris Quinn, Managing Director at\nQuinns, never takes this work for granted and consistently goes above and\nbeyond to ensure health and safety and adherence to MOD security is never\ncompromised. The company\nhas proudly employed ex-military personnel in the past and a few of our\ncolleagues have strong family army connections. Therefore, we are delighted to announce\nthat Quinns has committed to supporting a Military Resettlement Scheme. As a registered\nemployer, we will assist ex-servicemen and women as they transition from active\nservice to civilian employment within our sector. As we pay our respects to those who have paid the ultimate price for us, we at Quinns are fully aware of the debt we owe to the Armed Forces Community. Lest we forget. https://www.quinnsltd.com/wp-content/uploads/2023/11/pexels-pixabay-461284.jpg 4016 6016 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2023-11-09 10:09:06 2023-12-22 13:47:42 Remembrance Day 2023 Page 1 of 4 1 2 3 4 Follow us on Facebook Latest Projects Storage Facility Complex – BAM Nuttall 10th April 2019 - 3:04 pm Refurbishment Project – Mildren Construction 10th April 2019 - 2:54 pm Helios Project – ADT 30th March 2019 - 12:17 pm Ceal Project – Serco 30th March 2019 - 12:17 pm Categories News Personal Uncategorised Office Address 10800 West Pico Boulevard Los Angeles, USA Contact [email protected] 555-3587 347 Opening Hours: Mo-Fr: 8:00-19:00 Sa: 8:00-14:00 So: closed ABOUT US Quinns has been established since 2005 and we have grown to over 20 people. Our clients include large MoD establishments. We offer a range of m & e services including reactive, planned and installation work and are CompEx and BAFE accredited. We offer a full design service on projects up to £1 million. RECENT POSTS News 2024 Year in Review Read more https://www.quinnsltd.com/wp-content/uploads/2024/12/2024-year-in-review.png 400 800 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-12-05 14:04:00 2024-12-05 14:05:01 2024 Year in Review News Mid-Year Milestones: Expansion, Innovation and Sustainability Read more https://www.quinnsltd.com/wp-content/uploads/2024/09/Untitled-design.png 400 800 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-09-26 10:07:33 2024-09-26 10:07:36 Mid-Year Milestones: Expansion, Innovation and Sustainability News Electric Heating vs. Conventional Wet System Heating: What’s Best for Your Home This Winter? Read more https://www.quinnsltd.com/wp-content/uploads/2024/09/winter-landscape-2995987_1280-e1726688033206.jpg 691 1280 Chelsey Millman https://www.quinnsltd.com/wp-content/uploads/2025/01/Quinns_Logo_FINAL_Horizontal-copy-300x136.png Chelsey Millman 2024-09-19 09:14:58 2024-09-19 09:15:03 Electric Heating vs. Conventional Wet System Heating: What’s Best for Your Home This Winter? Page 1 of 12 1 2 3 › » LATEST PROJECTS Storage Facility Complex – BAM Nuttall Refurbishment Project – Mildren Construction Helios Project – ADT Ceal Project – Serco DSTL Porton – HS Area West Moors Fuel Depot GET IN TOUCH Quinns Ltd Unit 3, Mills Way The Boscombe Centre Amesbury Wiltshire SP4 7SD Tel 01980 625449 Email [email protected] Designed by An.X Ltd. Developed and managed by Guardian Angel PC Support Scroll to top"
    },
    {
      "url": "https://qmslsc.com.au/about-the-club/governance-and-strategy/board-management-team/",
      "text": "Board & Management Team - Quinns Mindarie Surf Life Saving Club 2 Quinns Road, Mindarie, WA 6030 Phone: (08) 9305 1870 Email: info@qmslsc.com.au Facebook: Messenger Chat MENU Home About The Club Club History Governance & Strategy Our Vision Our Strategy Organisational Structure Board & Management Team Club Constitution, By-Laws & Policies Annual Reports Our Sponsors Sponsorship & Fundraising Make A Donation Gym Facilities Image Gallery Membership Membership Renewal New Member Registration Members Handbook Member Notices SLS Hub Lifesaving Services Assets Patrolling Information Education & Training What’s On Club Calendar Club Events News Club News Instagram Facebook Surf Sports Woodside Nippers Youth, Seniors & Masters Online Shop Contact Us (08) 9305 1870 Board & Management Team Quinns Mindarie Surf Life Saving Club About The Club Governance & Strategy Board & Management Team THE TEAM BEHIND THE SCENES Board of Directors Whether you are a new member, existing member or rejoining member, the Board of Directors extends a warm welcome to you and hopes that your association with this Club will be long and rewarding. The current board includes: Club President Richard Lissett president@qmslsc.com.au Director of Lifesaving Vacant lifesaving@qmslsc.com.au Director of Finance Simon Brigham finance@qmslsc.com.au Director of Youth Lucas Stanfield youth@qmslsc.com.au Director of Education Jim Gail education@qmslsc.com.au Vice President Rachel Quirk vicepresident@qmslsc.com.au Director of Administration Vacant admin@qmslsc.com.au Director of Surf Sports Clare Harrington surfsports@qmslsc.com.au Director of House Washington Avila house@qmslsc.com.au Director of Marketing Karly George marketing@qmslsc.com.au 6 Core Values of QMSLSC Directors Impartial: We are apolitical and work in a manner that is frank, honest, timely and based on the best available evidence. Committed to Service: We are professional, objective, innovative and efficient, and work collaboratively to achieve the best results for the Club, our Members and the Community. Accountable: We are open and accountable to our Members and the Community within the framework of SLSA and SLSWA. Respectful: We respect all people, their rights and heritage. Ethical: We demonstrate leadership, are trustworthy, and act with Integrity in all that we do. Stewardship: We build our capability and knowledge of Surf Lifesaving to support the interests of our Members and the Community, now and into the future. Elected Officers The extend management team of the club includes the following elected officers: Club Captain Vacant Club.Captain@qmslsc.com.au Nippers Manager Jemma Davis (U6-U9) & Brad Fijac (U10=U13) Nippers.Manager@qmslsc.com.au Nipper Surf Sport Manager Tristan Hall nipper.surfsports@qmslsc.com.au Chief Instructor Kaitlin Jones Chief.Instrcutor@qmslsc.com.au Youth Coordinator Brady Fulcher Youth.Coordinator@qmslsc.com.au Senior Surf Sport Manager Lee Kemp senior.surfsports@qmslsc.com.au Club Administration & Member Support Club Administrator Catherine Maloney-Ross info@qmslsc.com.au Club Chaplain Emilia Musgrave chaplain@qmslsc.com.au MPIO Kristina Lemson member.protection@qmslsc.com.au Provide us feedback Club Feedback feedback@qmslsc.com.au Governance & Strategy Our Vision Our Strategy Organisational Structure Board & Management Team Club Constitution, By-Laws & Policies Annual Reports SITE LINKS Home Governance & Strategy Membership Lifesaving Services Surf Sports Club Calendar Make A Donation Online Shop Contact Us GROUPS Woodside Nippers Youth, Seniors & Masters MEMBERSHIP Membership Renewals New Member Registration Members Handbook Member Notices SLS Hub CONTACT INFO 2 Quinns Road, Mindarie, 6030, Western Australia (08) 9305 1870 info@qmslsc.com.au Completed by QMSLSC Copyright © 2023 QMSLSC Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Home About The Club Club History Governance & Strategy Our Vision Our Strategy Organisational Structure Board & Management Team Club Constitution, By-Laws & Policies Annual Reports Our Sponsors Sponsorship & Fundraising Make A Donation Gym Facilities Image Gallery Membership Membership Renewal New Member Registration Members Handbook Member Notices SLS Hub Lifesaving Services Assets Patrolling Information Education & Training What’s On Club Calendar Club Events News Club News Instagram Facebook Surf Sports Woodside Nippers Youth, Seniors & Masters Online Shop MENU"
    }
  ]
}