{
  "fuentes": [
    {
      "url": "https://tallahasseearts.org/organization/quincy-music-theatre/",
      "email": "info@tallahasseearts.org"
    },
    {
      "url": "https://tallahasseearts.org/organization/quincy-music-theatre/",
      "email": "qmt@tds.net"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    }
  ],
  "mails": [
    "info@scibpaints.com",
    "info@tallahasseearts.org",
    "qmt@tds.net",
    "tstuder@astrosecuritymonitoring.com"
  ],
  "nombre_sitio": "quincymusictheatre.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://tallahasseearts.org/organization/quincy-music-theatre/",
      "text": "Quincy Music Theatre English English French German Italian Portuguese Russian Spanish SUBMIT YOUR INFO LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. subscribe follow capture tweet watch connect access Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT SEARCH MENU EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates Organization Type Arts Council/Alliance Association/Club/Group/Guild Business/Retail Corporation Dance Diversity, Equity, & Inclusion -- BIPOC Owned/Operated -- LGBTQIA+ Friendly -- LGBTQIA+ Owned -- Persons with Disabilities Education Educational Environmental Faith Based/Religious Festivals/Markets Film/Video Food/Drink Foundation Gallery/Museum Government History/Heritage Kids/Family Library Literature/Poetry Media Music Nonprofit Retail School Special Events Sports/Outdoors Theatre Travel Visual Art/Fine Craft State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 SEARCH Advanced Filters Home Organization Quincy Music Theatre Comment Facebook Twitter Linkedin Print Quincy Music Theatre The Quincy Music Theater features top quality performances from musicians, actors, artists, choreographers, dancers, technical theater professionals, and directors throughout the Quincy / Gadsden and Tallahassee / Leon County Communities. Built in 1949, The Leaf Theater was one of Quincy’s two movie theatres. In the 1960′s, single-screen theatres gave way to multiplex cinemas and in 1980 the Leaf closed its doors and sat neglected downtown. In 1983, an enthusiastic theatre group in need of a permanent home began performing in churches and schools. That same year, a small group of local private citizens purchased the Leaf. Grants and private donations for restoration were secured and the neglected building was transformed into a grand entertainment facility once more! The Quincy Music Theater features top quality performances from musicians, actors, artists, choreographers, dancers, technical theater professionals, and directors throughout the Quincy / Gadsden and Tallahassee / Leon County Communities. Built in 1949, The Leaf Theater was one of Quincy’s two movie theatres. In the 1960′s, single-screen theatres gave way to multiplex cinemas and in 1980 the Leaf closed its doors and sat neglected downtown. In 1983, an enthusiastic theatre group in need of a permanent home began performing in churches and schools. That same year, a small group of local private citizens purchased the Leaf. Grants and private donations for restoration were secured and the neglected building was transformed into a grand entertainment facility once more! View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: Music ; Nonprofit ; Theatre UPCOMING EVENTS PAST EVENTS Chicago, the Musical Presented by Quincy Music Theatre at Quincy Music Theatre Oct 3 - Oct 12, 2025 Accessibility Info Facebook Twitter Linkedin GET TICKETS Merrily We Roll Along Presented by Quincy Music Theatre at Quincy Music Theatre Dec 5 - Dec 14, 2025 Accessibility Info Facebook Twitter Linkedin GET TICKETS Oliver! Presented by Quincy Music Theatre at Quincy Music Theatre Feb 27 - Mar 8, 2026 Accessibility Info Facebook Twitter Linkedin GET TICKETS Beautiful: The Carole King Musical Presented by Quincy Music Theatre at Quincy Music Theatre May 8 - May 17, 2026 Accessibility Info Facebook Twitter Linkedin GET TICKETS Be More Chill the Musical Presented by Quincy Music Theatre at Quincy Music Theatre Aug 1 - Aug 3, 2025 Accessibility Info Facebook Twitter Linkedin GET TICKETS Quincy Music Theatre's Summer Camp: Aladdin Jr. Presented by Quincy Music Theatre at Quincy Music Theatre Jun 3 - Jun 28, 2024 Accessibility Info Facebook Twitter Linkedin GET TICKETS Quincy Music Theatre presents Big Fish Presented by Quincy Music Theatre at Quincy Music Theatre Feb 23 - Mar 3, 2024 Accessibility Info Facebook Twitter Linkedin GET TICKETS Quincy Music Theatre presents The Addams Family Presented by Quincy Music Theatre at Quincy Music Theatre Oct 6 - Oct 15, 2023 Accessibility Info Facebook Twitter Linkedin GET TICKETS Hot Tamale Southern Soul Review with Scott Buchanan Sat, Aug 26 Presented by Quincy Music Theatre at Quincy Music Theatre Aug 26, 2023 Accessibility Info Facebook Twitter Linkedin GET TICKETS SHOW MORE Contact information Email / Website / Facebook / Instagram / Primary address: 118 East Washington Street, Quincy, FL 32351 (850) 875-9444 COMMENTS Leave a comment Your email address will not be published. Required fields are marked * * Email address is required! * This is not email address! * Author name is required! * Comment content is required! Your name * Your email * Comment * You may use these HTML tags and attributes : <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <cite> <code> <del datetime=\"\"> <em> <i> <q cite=\"\"> <s> <strike> <strong> * Please check the box to prove you are not a robot Find An Organization Search by Keyword Organization Type Arts Council/Alliance Association/Club/Group/Guild Business/Retail Corporation Dance Diversity, Equity, & Inclusion -- BIPOC Owned/Operated -- LGBTQIA+ Friendly -- LGBTQIA+ Owned -- Persons with Disabilities Education Educational Environmental Faith Based/Religious Festivals/Markets Film/Video Food/Drink Foundation Gallery/Museum Government History/Heritage Kids/Family Library Literature/Poetry Media Music Nonprofit Retail School Special Events Sports/Outdoors Theatre Travel Visual Art/Fine Craft State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 OUR PARTNERS COCA's programs are sponsored in part by the City of Tallahassee, Leon County, the State of Florida, Department of State, Division of Cultural Affairs, Community Foundation of North Florida, Knight Foundation, National Endowment for the Arts, and the Tallahassee Community Redevelopment Agency. COCA, the Council on Culture & Arts, is a non-profit organization that serves as the facilitator and voice for the arts and cultural industry in Florida's capital area. COCA provides information and promotes the arts and culture to both citizens and visitors. ABOUT US DIRECTORIES CLASSIFIEDS PARTNERS CONTACT US 114 S DUVAL STREET TALLAHASSEE, FL 32301 LOCAL NUMBER: (850) 224-2500 EMAIL: info@tallahasseearts.org © Copyright 2025 - Council on Culture & Arts | Contact Us | Site Map | Privacy Policy Powered by ARTSOPOLIS The COCA office currently has adjusted office hours to 1 PM – 5 PM to accommodate pickup for Winterfest. These hours will be adjusted from Tuesday, February 11, through Friday, February 28 . Regular office hours will return on Monday, March 3. For questions, feel free to contact staff via phone or email. In addition, access to Railroad Avenue between Gaines Street & FAMU Way is down to one lane heading south. For access to the COCA office, please take Gaines Street as currently, the COCA office is not accessible off of FAMU Way."
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    }
  ]
}