{
  "fuentes": [
    {
      "url": "https://freehandhotels.com/miami/rays-miami/",
      "email": "fb.fhmia@thefreehand.com"
    },
    {
      "url": "https://www.arayhospitality.com/",
      "email": "anna.mason@arayhospitality.com"
    },
    {
      "url": "https://www.arayhospitality.com/",
      "email": "dunny.wanstrath@arayhospitality.com"
    },
    {
      "url": "https://www.arayhospitality.com/",
      "email": "austin@arayhospitality.com"
    },
    {
      "url": "https://www.arayhospitality.com/",
      "email": "dunny.wanstrath@arayhospitality.com"
    },
    {
      "url": "https://www.arayhospitality.com/",
      "email": "katy.sanders@arayhospitality.com"
    },
    {
      "url": "https://www.arayhospitality.com/",
      "email": "roseann.siciliano@mlrose.com"
    },
    {
      "url": "https://www.arayhospitality.com/",
      "email": "tom.perry@arayhospitality.com"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "customercare@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "alvarezv@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "costar@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "craigk@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "customercare@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "director@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "fitosa@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "fowlerw@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "iturreym@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "jarraj@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "khalill@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "lauk@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "lopezly@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "millayl@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "programs@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "rodriguezj@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "shipleyje@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "stilesm@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "thompsonl@mdpls.org"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "breilly@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "djohnson@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "info@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "julie@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "kcanfield@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "kcoffey@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "khuckabee@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "kkrieg@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "mcook@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "mellard@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "mpicciotto@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "robconcannon@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "snewton@stingrayshockey.com"
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "email": "sshamlin@stingrayshockey.com"
    },
    {
      "url": "https://whatnowmia.com/authentic-hospitality-bringing-rays-hometown-bar-to-freehand-miami/",
      "email": "artboard-1@3x-1024x507-1-1.png"
    },
    {
      "url": "https://whatnowmia.com/authentic-hospitality-bringing-rays-hometown-bar-to-freehand-miami/",
      "email": "contact@whatnow.com"
    }
  ],
  "mails": [
    "alvarezv@mdpls.org",
    "anna.mason@arayhospitality.com",
    "artboard-1@3x-1024x507-1-1.png",
    "austin@arayhospitality.com",
    "breilly@stingrayshockey.com",
    "contact@whatnow.com",
    "costar@mdpls.org",
    "craigk@mdpls.org",
    "customercare@mdpls.org",
    "director@mdpls.org",
    "djohnson@stingrayshockey.com",
    "dunny.wanstrath@arayhospitality.com",
    "fb.fhmia@thefreehand.com",
    "fitosa@mdpls.org",
    "fowlerw@mdpls.org",
    "info@stingrayshockey.com",
    "iturreym@mdpls.org",
    "jarraj@mdpls.org",
    "julie@stingrayshockey.com",
    "katy.sanders@arayhospitality.com",
    "kcanfield@stingrayshockey.com",
    "kcoffey@stingrayshockey.com",
    "khalill@mdpls.org",
    "khuckabee@stingrayshockey.com",
    "kkrieg@stingrayshockey.com",
    "lauk@mdpls.org",
    "lopezly@mdpls.org",
    "mcook@stingrayshockey.com",
    "mellard@stingrayshockey.com",
    "millayl@mdpls.org",
    "mpicciotto@stingrayshockey.com",
    "programs@mdpls.org",
    "robconcannon@stingrayshockey.com",
    "rodriguezj@mdpls.org",
    "roseann.siciliano@mlrose.com",
    "shipleyje@mdpls.org",
    "snewton@stingrayshockey.com",
    "sshamlin@stingrayshockey.com",
    "stilesm@mdpls.org",
    "thompsonl@mdpls.org",
    "tom.perry@arayhospitality.com"
  ],
  "nombre_sitio": "raysbarnyc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://freehandhotels.com/miami/rays-miami/",
      "text": "Ray's Miami | Hometown bar serving bites, beers and cocktails Skip to content Toggle Navigation Freehand Freehand North America Chicago Los Angeles Miami New York Generator North America Miami New York Washington DC Generator Europe Amsterdam Barcelona Berlin Copenhagen Dublin Hamburg London Madrid Paris Rome Stockholm Venice Special Offers Eat & Drink Magazine MIAMI MENU Freehand Miami Photo Gallery Special Offers Rooms Eat & Drink ▼ Overview Broken Shaker Ray’s Events & Activities Miami City Guide Private Events Business at Freehand Group Bookings FAQs Accessibility Skip to Local Menu Skip to Book a Room Button Toggle Navigation DESTINATIONS North America North America Europe Chicago Los Angeles Miami New York Miami New York Washington DC Amsterdam Barcelona Berlin Copenhagen Dublin Hamburg London Madrid Paris Rome Stockholm Venice SPECIALS EAT & DRINK MAGAZINE Ray’s 2025-03-27T16:36:12-04:00 2727 Indian Creek Dr., Miami Beach, FL 33140 | For all inquiries please email fb.fhmia@thefreehand.com RAY'S HOMETOWN BAR MIAMI A HOMETOWN BAR SERVING BITES, BEERS AND COCKTAILS WITH A DISCO BALL AND POOL TABLE. Operated by Authentic Hospitality, Ray's joined Freehand Miami in December 2024 as a laid back watering hole for locals and out of towners alike. Inspired by the comforting familiarity of small town bars found across America, Ray's serves up a laid back of classic bar staples done well seven days a week. FOOD & BEVERAGE MENU MAKE A RESERVATION EXPERIENCE EXPERIENCE Hours of Operation Monday & Sunday: 5pm – 12am Tuesday to Thursday: 5pm – 2am Friday & Saturday: 5pm – 4am IN THE NEWS \"A vibe that's totally its own – where everyone feels at home\" – VOGUE, 2024 PLAN YOUR EVENT AT FREEHAND MIAMI PLANNING AN EVENT? OUR SALES TEAM IS READY TO ASSIST. Freehand Miami has several event spaces that are ideal for groups of 10 to 500. Our Secret Garden event space hosts cocktails for up to 150 or a dinner for up to 60. Broken Shaker and Ray's are both available for cocktail receptions, seated dinners, activations, film & photoshoots, all day meetings and more. Group bookings are also available. Contact our sales team for more information. PLAN YOUR EVENT RAY'S HOMETOWN BAR MIAMI 2727 INDIAN CREEK DR. MIAMI BEACH, FL 33140 786-476-7020 BOOK A ROOM Let's get SOCIAL Instagram Information CONTACT US JOBS HOTEL DEVELOPMENT PRESS Legal Stuff GENERAL TERMS BOOKING TERMS PRIVACY COOKIES POLICY ADA Social Our sister brand Subscribe Newsletter First Name * Last Name * E-Mail * All fields are required. Subscribe Page load link Skip to content Toggle Navigation Freehand Miami Photo Gallery Special Offers Rooms Eat & Drink ▼ Overview Broken Shaker Ray’s Events & Activities Miami City Guide Private Events Business at Freehand Group Bookings FAQs Accessibility Go to Top"
    },
    {
      "url": "https://www.arayhospitality.com/",
      "text": "A.Ray Hospitality | Passion for Hospitality top of page HOME Our Brands About Our People CONTACT News & Press More... Use tab to navigate through the menu items. NaShville's un-restaurant company with a passion for hospitality Our brands 02 Our Brands ABOUT Overview & Philosophy A.Ray Hospitality is Nashville’s “un-restaurant” company. We build brands that are resilient, approachable and timeless while creating experiences for our neighbors that blur the line between restaurant and bar. Each of our concepts represents a comfortable “third place” where our neighbors can unwind and socialize outside of the home or office. Our guests don’t need a special occasion or big plans to visit our restaurants. Our casual atmosphere, simple and delicious food, fresh drinks, and neighborly service make every day the perfect day to dine with us. We own Nashville’s greatest places to get out without getting fancy. Brand Focus We only create focused and memorable brands. The experiences we deliver connect with our guests on an emotional level. We achieve this by creating concepts that are familiar, timeless, comfortable, and visually stimulating with a culture that transcends generations. Our brands are simultaneously classic and innovative. Culture & Values Empathy + Action = Hospitality, and our passion is hospitality. We constantly strive to see our businesses through the eyes of our guests and our team members, but with each decision we make, we focus on finding the balance between the guest, the team, and the business. Our leadership believes in nurturing teams that are empowered to create their own destiny, measure their results, cultivate “A” players, and fully understand the implications of their actions. We are respectful yet direct, team oriented, results driven, and transparent. Together we celebrate our wins, examine our losses, and communicate openly on all levels. ​ Our FAMILY VALUES are at t he core of everything we do: Treat Everyone Like a Good Neighbor We surround ourselves with only the BEST to care for our guests, tea m and vendors as if we expect to see them again and again. ​ Play to Win We make things happen and search for solutions together. ​ Details Matter Relentless commitment to high-quality standards and systems. ​ Let's Goooo!!!!! We live for spreading joy and creating memories. We always look for ways to celebrate our wins, each other, and our guests. About Our People Our People​ Austin ray President & Founder austin@arayhospitality.com Austin Ray has been a Nashville-based restaurateur since 2003. Ray is the owner and founder of M.L.Rose Craft Beer and Burgers: an award-winning neighborhood pub concept with four locations in the greater Nashville area, and A.Ray Hospitality, a restaurant, consulting, and real estate holding company. He is also operating partner at Von Elrod's Beer Hall & Kitchen. He entered the hospitality scene at 23 years old as co-owner and developer of the posh nightclub Bar Twenty3 and 1200-person capacity music venue City Hall in 2003. Ray has a bachelor’s degree in Hospitality Administration from Boston University. In addition to regular giving at the community level through the Martha O’Bryan center and other organizations, Ray has been a regular mentor through Big Brothers Big Sisters since 2008. tom perry Chief Operating OfficeR tom.perry@arayhospitality.com Tom Perry has served as the Chief Operating Officer for A.Ray since September 2015. Growing up in small town in the Midwest, Perry developed a passion for people, development and the service industry. He honed this passion with studies at The Ohio State University as well as studying abroad. Joining Team A.Ray, Perry is able to capitalize on his corporate education and experience while reconnecting with his roots in the industry, working for independent, people-driven restaurants and bars. Prior to joining Team A.Ray, Perry held several corporate leadership positions in operations and training at some of the industry leaders such as Chili’s, Red Robin, O’Charley’s, Bar Louie and Aramark at the University of Tennessee. He has also supervised over 50 new restaurant openings for various brands throughout the Southeast. From serving as a board member for the Tennessee Chapter of Habitat for Humanity to being a certified disaster shelter manager for the American Red Cross, Perry believes in giving back. Dunny Wanstrath Chief Financial Officer Dunny.wanstrath@arayhospitality.com Dunny's breadth of experience in multiple functions and sectors combined with his ability to build relationships and interface with all stakeholders is a huge asset to the A.Ray Hospitality leadership team. His background in hospitality is extensive. As part of the in-house M&A group at Brinker International, he helped close over $800mm worth of franchises, including Chili's, On The Border, Macaroni Grill, and Maggiano's. He worked as a finance executive at EY London while simultaneously founding Lonestar Group, a multi-brand restaurant group. And back in the States, he was responsible for the restructuring and turnaround of Cornbread Ventures, a multi-brand, multi-state restaurant holding group. Dunny graduated from University of Arkansas with a degree in Business Administration and received his MBA from UT Dallas with a focus in finance and accounting. Dunny has served as CFO of A.Ray Hospitality since April 2022. katy sanders Marketing Director katy.sanders@arayhospitality.com Katy Sanders, a Tennessee native and University of Tennessee at Chattanooga alumna, holds a BS in Marketing. Her professional journey began at CraftWorks Restaurants & Breweries, Inc., where she started as a Marketing Coordinator and rose to the role of Brand Director for Rock Bottom Restaurant & Brewery, one of CraftWorks' flagship brands. In 2012, Sanders transitioned to the consumer packaged goods sector before ultimately returning to her roots in the restaurant industry. Currently serving as the Marketing Director for A.Ray Hospitality, she brings a wealth of experience and a passion for elevating brands to the team. Anna Mason VP of People Experience Anna.Mason@arayhospitality.com Anna Mason is the Director of Training at A.Ray Hospitality. Mason grew up in small town Virginia, getting to experience the history and culture of different areas of the state that sparked a lifelong love for learning. Picking up a part time job at Logan’s Roadhouse while finishing up her undergraduate education degree, led to combining her love of learning with a passion for teaching team members how to create a great guest experience. Prior to joining A.Ray Hospitality, Mason held various roles in corporate restaurants working in both operations and training, first for Logan’s Roadhouse, then CraftWorks Holdings, and finally as the Director of Shared Services at SPB Hospitality before joining the A.Ray team. Joining team A.Ray has allowed Mason to capitalize on the experience she gained from her time in the corporate restaurant world in developing training systems, while allowing her to have the honor of working for a company that is true to their culture. RoseAnn Siciliano Sr Director of Operations for M.L.Rose roseann.siciliano@mlrose.com After graduating from Cornell University, RoseAnn Siciliano began her career in NYC’s lively hospitality and musical entertainment scene, where she fostered her passion for culture and community. In 2013, RoseAnn moved to Nashville and started her A.Ray journey at the original M.L.Rose on 8th Ave in the Melrose neighborhood. She has since held multiple leadership positions within the company and plays a central role in opening new locations for the brand. RoseAnn was promoted to Director of Operations of M.L.Rose Craft Beer & Burgers in 2019. latest news View All News Food Notes: M.L.Rose taps Murfreesboro for eighth location A Collage of Familiar Faces,M.L.Rose Grows in Nashville M.L.Rose Craft Beer & Burgers to open Inglewood location M.L.ROSE CRAFT BEER & BURGERS TO OPEN IN GALLATIN CONTACT hello@arayhospitality.com Donation Requests 408 38th Ave N, Nashville, TN 37209 Team Member Suggestions Apply to Work with us CONTACT US Get In Touch Success! Message received. © 2022 A.Ray Hospitality | All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "text": "Contact Us - Miami-Dade Public Library System Skip to main content Skip to main content Skip to Navigation Skip to Footer Account Login Get a Library Card Open Now Account Login Get a Library Card Open Now Go Go Toggle navigation Quick Links Browse the Catalog Calendar of Events Digital Collections eBooks, eAudiobooks & More Get a Library Card Latest News Learning & Training Mobile Apps Mobile Printing Locations Alphabetical List Near You Open Now View Map (English) View Map (Spanish) Mobile Library Virtual Library Get Oriented Assistive Services & Technology Borrowing Browse the Catalog Calendar of Events Computers & Internet Fines & Fees Friends of the Miami-Dade Public Library Get a Library Card Holiday Schedule Make a Payment Mobile Apps Volunteer Explore 24/7 Library Community Resources Coworking Center Digital Collections eBooks, Audiobooks & More eGovernment Exhibitions at the Library Learning & Training Museum Pass Permanent Art Collection Staff Picks Special Collections Talking is Teaching: Early Literacy The Library for Children The Library for Teens The Vasari Project Virtual Exhibitions YOUmake Miami YOUmedia Miami Services Adult Learning Academy Ask A Librarian Braille & Talking Books Library Connections Home Library Services Digital Learn Drive-Up Wi-Fi Homework Help & Tutoring Program Interlibrary Loan Libraries @ Your Door Home Delivery Service Mobile Device Lending Program Mobile Printing Project L.E.A.D. Adult Literacy Reserving Space at the Library Social Services at the Library Storytime Express Early Literacy Kits Suggestions for Purchase U.S. Passport Services My Accounts Log In Items Out Requests Fines & Fees Freegal Music Hoopla Digital OverDrive/Libby Support the Library Friends of the Miami-Dade Public Library Donate Volunteer at the Library close Reset to\n\t\t\t\t\t\t\t\t\tstandard size Font size options Increase or decrease the font size for this website by clicking on the 'A's. Reset to default contrast Contrast options Choose a color combination to give the most comfortable\n\t\t\t\t\t\t\t\t\tcontrast. Contact Us If you need assistance with your library account or have any questions, please email our Customer Care team at customercare@mdpls.org or complete the form below. First Name* Last Name* Daytime Phone Email Which branch did you visit? Please choose... Allapattah Arcola Lakes Bay Harbor Islands California Club Coconut Grove Concord Connections Coral Gables Coral Reef Country Walk Culmer Overtown Doral Edison Center Fairlawn Golden Glades Hialeah Gardens Hispanic International Mall Jump Start Kendale Lakes Kendall Key Biscayne Lakes of the Meadow Lemon City Little River Main Library Miami Beach Regional Miami Lakes Miami Springs Mobile Services Model City Naranja North Central North Dade Regional North Shore Northeast Dade - Aventura Opa-locka Palm Springs North Palmetto Bay Pinecrest Shenandoah South Dade Regional South Miami South Shore Sunny Isles Beach Sunset Tamiami UHealth | Jackson Station Library Kiosk Virrick Park West Flagler West Kendall Regional Westchester Regional Westchester Health & Wellness Information Center Subject Please choose... Comments Suggestions More Information on Library Events More Information on Library Services Feedback on Website Other Message* × Thank you for your feedback! Submit Form * Required Fields This project has been funded under the provisions of the State Aid to Libraries Grant program, administered by the Florida Department of State’s Division of Library and Information Services. We encourage patrons to use the Ask‑a‑Librarian service when sending reference questions. To find information for a specific branch, please refer to the Library Locator . Can't find a title in the catalog? Request an item by submitting a Suggestion for Purchase . Miami-Dade Public Library System Public Records Custodian Leila Khalil 101 West Flagler Street Miami, FL 33130 305-375-5291 khalill@mdpls.org This information may also be found at the Customer Service Desk on the first floor of the MDPLS Main Library , 101 West Flagler Street, Miami, FL 33130. Library Director Name and Title Email Contact Phone Number Ray Baker Director E-mail 305‑375‑5026 Veronica Alvarez Departmental Administrative Coordinator E-mail 305‑375‑5026 Special Collections, Communications & Strategic Planning Name and Title Email Contact Phone Number Lydia Lopez Assistant Director E-mail 305-375-3555 Leila Khalil Chief, Library Marketing & Development Services E-mail 305-375-5291 Library Operations & Services Name and Title Email Contact Phone Number Rafael Costa Assistant Director E-mail 305‑375‑5183 Wil Fowler Operations Manager E-mail 305-375-3873 Julio Rodriguez Operations Manager E-mail 305‑375‑5271 Michele Stiles Operations Manager E-mail 305‑375‑5008 Jennifer Shipley Operations Manager E-mail 305-751-8687 Laura Millay Operations Manager, Collection Development & Technical Services E-mail 305-375-5179 Athanasia Fitos Operations Manager, Community Engagement E-mail 305-375-4540 Business Operations Name and Title Email Contact Phone Number Mike Iturrey Assistant Director E-mail 305‑375‑5044 Jessica Jarra Budget & Accounting Manager E-mail 305‑375‑5178 Kimberly Craig Chief, Library Contracts, Procurement & Materials Management E-mail 305-375-5576 Capital Construction & Facility Management Name and Title Email Contact Phone Number Lisa D’Andrea-Thompson Library Capital Programs Director E-mail 305-375-5106 Human Resources Name and Title Email Contact Phone Number Kelly Lau Chief, Human Resources E-mail 305‑375‑5010 Main Library 101 W. Flagler St., Miami, FL 33130 Service or Department Phone Number Additional Info General Information 305‑375‑2665 Children's Room 305‑375‑5021 Circulation 305-375-2665 Florida Room / Genealogy 305-375-5572 General Reference 1 st Floor 305‑375‑5231 General Reference 2 nd Floor 305‑375‑5575 Social Services 786-988-6816 TDD 305‑679‑7977 Miami-Dade Public Library System Public Records Custodian Leila Khalil 101 West Flagler Street Miami, FL 33130 305-375-5291 khalill@mdpls.org This information may also be found at the Customer Service Desk on the first floor of the MDPLS Main Library , 101 West Flagler Street, Miami, FL 33130. Download our Library App Facebook X Instagram Threads YouTube Sign Up for Library News Site Map Find a Branch About Us Contact Us/Customer Care Latest News Library Policies Get a Library Card Browse the Catalog Learning & Training eBooks, Audiobooks & More eGovernment © 2025 Miami‑Dade County. All rights reserved. Miami-Dade County Home Privacy Statement Disclaimer About the County ADA Notice Directory Jobs Privacy and cookie policy | Accessibility | Communico Connected content from Communico. © 2025."
    },
    {
      "url": "https://stingrayshockey.com/team/staff",
      "text": "South Carolina Stingrays | Front Office South Carolina Stingrays Tickets Single Game Tickets Full Season Tickets Weekender Plan Flex Plan Tickets Group Tickets Hospitality Areas Specialty Ticket Packages Birthday Parties My Account Manager Schedule Schedule & Promotions 2025-26 Printable Schedule 2025-26 Printable Promo Calendar Gameday Info Know Before You Go Game Day Fan Experiences FAQ Stingrays App Watch / Listen Game Notes Team News & Info News Roster Hockey Operations Standings Statistics Front Office Employment Affiliates Community Community Assist of the Game Community Initiatives and Programs Booster Association Partners NHL Street Cool Ray Corner Shop Contact Us Schedule Get Tickets Ticket Categories Single Game Tickets Full Season Tickets Weekender Plan Flex Plan Group Tickets Hospitality Areas Group Experiences Specialty Ticket Packages Birthday Parties Toggle Menu Schedule Tickets Single Game Tickets Full Season Tickets Weekender Plan Flex Plan Tickets Group Tickets Hospitality Areas Specialty Ticket Packages Birthday Parties My Account Manager Schedule Schedule & Promotions 2025-26 Printable Schedule 2025-26 Printable Promo Calendar Gameday Info Know Before You Go Game Day Fan Experiences FAQ Stingrays App Watch / Listen Game Notes Team News & Info News Roster Hockey Operations Standings Statistics Front Office Employment Affiliates Community Community Assist of the Game Community Initiatives and Programs Booster Association Partners NHL Street Cool Ray Corner Shop Contact Us Home Front Office Front Office Management Todd Halloran Principal Owner & Governor Todd became the majority owner of the Stingrays in April 2018 through his investment entity Halloran Sports Group LLC. Todd is a Senior Advisor at Freeman Spogli & Co., a Los Angeles and New York-based private equity firm with approximately $2 billion under management. Todd is also the CEO of Fox Hall Partners, an investment holding company with interests in sports teams, sports tech, health, and tech-enabled consumer product and service companies. Todd has worked with and served on the board of directors for a number of public and private companies and non-profit organizations. He currently serves on the boards of four private companies, the Charleston Metro Chamber of Commerce, the Charleston Regional Development Alliance, and The Community Fund. Todd currently splits his time mostly in Charleston and CT/NY. He and his family are passionate hockey fans. Todd grew up playing hockey in a skating family and has four children who all grew up playing the sport including one currently playing collegiate hockey. Rob Concannon President & Alternate Governor Rob Concannon is in his 16th season as the President of the South Carolina Stingrays. Born and raised in Dorchester, MA, just outside of Boston, Concannon has always been passionate about hockey. He played for the Stingrays from 1995 to 2000, was a member of the 1997 Kelly Cup Championship team, and was inducted into the Stingrays Hall of Fame in 2004. He skated in 350 games for the Stingrays and is currently seventh in all-time Stingrays points with 254 (120 goals, 134 assists). Prior to turning pro, Concannon was a Division III All-American in 1995 with Salem State College. In addition to the Stingrays, Concannon skated for the Saint John Flames and St. John Maple Leafs of the American Hockey League (AHL) and the Idaho Steelheads and Greenville Grrrowl of the ECHL during his eight-year professional hockey career. After retiring from hockey, Rob continued to dedicate his career to the sport. He became the Stingrays’ President and Alternate Governor in 2009 and was elected as head of the ECHL Rules Committee in 2013. Under his leadership, the Stingrays reached the Kelly Cup Finals in 2015, 2017, and 2021, and the Conference Finals in 2016. The team also increased revenue in Season Ticket Sales, Groups Sales, and Corporate Sales during nine straight seasons. In 2018 Concannon was named GM of the Year by the ECHL's coaches and General Managers. The Stingrays won the ECHL's Team Excellence Award for the first time in franchise history under his leadership at the conclusion of the 2018-2019 season. He is very active in the Charleston community working with the Ronald Mcdonald House, Charleston Youth Development Center, MUSC Children’s Hospital, the City of North Charleston, and numerous other organizations and nonprofits. Rob has called Charleston home for the last 29 years and lives downtown with his wife Keri and their twins, John Robert and Ella Loraine. In his free time, Rob likes to exercise and golf. Kerri White SVP Corporate Partnerships Kerri joined the Stingrays in May of 2023 and oversees all corporate partnership efforts. A veteran in professional sports, Kerri spent 16.5 years with the Arizona Diamondbacks corporate partnership team after stops with the Toledo Mud Hens Baseball Club and the Detroit Tigers. During her time with the D-backs, Kerri built marketing platforms with top national and local brands and was also a part of key signature promotions and events such as the Fry’s D-backs Rewards Program, the Bullpen Carts, and the MVP Corporate Partner Awards show. Kerri moved to the Charleston area from Phoenix in 2022 to be closer to family in the Boston, Massachusetts area where she was born and raised. When not at games or watching sports, Kerri can either be found traveling, visiting an ocean (Folly Beach is a favorite), listening to music or cooking. Sam Bays SVP Sales and Marketing Sam joined the Stingrays in March of 2022. In Sam’s 19 years in professional sports he has had stops in Oklahoma City as Vice President of Sales & Service for the Energy FC, in Phoenix as Vice President of Business Development for the Arizona Coyotes, and in Dallas as Director of Sales & Service for the Dallas Stars. Prior to starting his career in professional sports, Sam led the sales team for an international collectables distribution company for 10 years. Altogether he brings over 30 years of sales and service expertise to the Stingrays. Sam is originally from Dallas, Texas and has a Bachelors Degree in History from the University of Texas at Arlington. When he isn’t working, Sam is most likely listening to his collection of vinyl records or spending quality time with his wife Brandy and her three kids along with their dog Natalie. Julie Thoennes Office Manager Julie Thoennes enters her 32nd season with the Stingrays as Office Manager. She is the only member of the Stingrays organization that has been with the club since its inception in 1993. In addition to handling accounts receivable, accounts payable, payroll and the day-to-day responsibilities of the front office, she assists the team’s coaching staff with player operations which include worker’s compensation and immigration issues. She was inducted into the Stingrays Hockey Hall of Fame in 2011. Thoennes resides in Summerville with her husband Larry. They have three sons, Chasen, Charles and Greg. Ticket Sales Kyle Huckabee Director of Ticket Operations Kyle Huckabee joined the Stingrays in 2012 and serves as the team's Director of Ticket Operations, overseeing box office operations at the North Charleston Coliseum on game nights. Kyle previously served as the team's Ticket Sales Manager for three seasons and was a finalist for the 2014-15 ECHL Ticket Executive of the Year. A native of Charleston, South Carolina, Kyle received a Bachelor of Science Degree in Business Administration from the College of Charleston. He grew up in Summerville, South Carolina, and attended Stingrays hockey games for many years prior to working with the team. Kyle enjoys golfing around town in his free time and currently resides in Summerville with his wife Marcy and their son Aaron. His favorite sports teams are the USC Gamecocks, the Atlanta Braves, and of course, the Stingrays. Matt Ellard Senior Account Executive Matt joined the Stingrays in June of 2021. Originally from Tuscaloosa, Alabama, Matt is an avid sports fan and loves University of Alabama athletics, the Houston Astros, and the Pittsburgh Steelers and Penguins. While attending Shelton State Community College, Matt pitched for the Buccaneers and helped lead them to back-to-back NJCAA World Series Appearances. He then went on to graduate from the University of Alabama with a BA in Communication Studies. Matt, his wife Lauren, and their doodle, Finn, recently moved from Atlanta, Georgia to make their home in Charleston. When not cheering on the Stingrays, Matt can be found attending sporting events and concerts, golfing, and spending time with family and friends. Katie Coffey Account Executive This is Katie's third season with the Stingrays as an Account Executive after working at News 2. Katie attended East Carolina University where she studied Marketing with a minor in Political Science. While studying at ECU, she was a member of Alpha Xi Delta where she held the position of Campus Relations Director. Born and raised in the Charlotte area, Katie has always been a Carolina Hurricanes fan. When Katie isn't working, she enjoys pilates, hanging out with friends, and trying new cocktails for her Instagram page, Our Drink Diary! Alex Ostendorff Account Executive This is Alex’s first season with the South Carolina Stingrays as an Account Executive. Breaking into the sports industry has been a longtime goal of his, and he couldn’t be more excited to begin his journey with the team. Alex was born and raised in Greenville, South Carolina, and earned his Bachelor's degree in Marketing from the College of Charleston in the Spring of 2024. A lifelong sports fan, Alex is passionate about the energy and connection that sports bring to communities. In his free time, he enjoys playing golf, working out, exploring the Charleston area, and spending time with friends and family. Kaitlyn Krieg Account Executive This is Kaitlyn Krieg’s first season with the Stingrays as an Account Executive, joining the team in 2025. Born and raised in Denver, Colorado, Kaitlyn attended Wittenberg University, where she majored in Marketing and Communication. During her time there, she played on the collegiate soccer team, was a member of the Delta Gamma sorority, and served as the founding president of the National Society of Leadership and Success (NSLS) on campus. Since graduating, Kaitlyn has worked in marketing for small local businesses and most recently in member relations at The Longevity Club. She also recently earned her personal training certification and completed her second marathon in April. In her free time, Kaitlyn enjoys sunrise beach runs, surfing at Folly Beach, or simply relaxing by the water. When visiting home in Colorado, she loves skiing, hiking, and trail running in the mountains. Corporate Partnerships Mario Picciotto Director of Corporate Partnerships Mario is entering his seventh season with the Stingrays, and third as Business Development Manager after beginning his time with the team as an Account Executive. Originally from a small town in Pennsylvania, Mario has been an avid hockey fan and player since he was the age of 10. To continue to promote his love of the game and passion for sports, Mario achieved his Master's degree in Sports Management from Old Dominion University in 2019. At ODU, he gained experience working as a graduate assistant in Game Operations for all of the university's sports teams. He also spent four years working part-time as an Account Executive for the Norfolk Tides baseball team, a professional minor league baseball team in the Triple-A International League. Mario has made Charleston his home, joining his two sisters, parents and three nieces. He lives on James Island and enjoys golfing, lifting and spending family time at the beach. Don Johnson Corporate Activation Manager Don joins the Stingrays for his first season as the Corporate Partner Activation Manager. Born and raised in Randleman, North Carolina, Don grew up playing and coaching hockey. In an effort to further his future and pursue a career in hockey, Don attended North Carolina State University where he obtained his Bachelor of Science degree in Sport Management. After graduating, Don gained experience as a Production Coordinator at Oklahoma State University and as the Director of Gameday Operations at the Carolina Thunderbirds, a Federal Prospects Hockey League team based out of Winston-Salem, NC. When not watching sports, Don spends his time playing hockey and golf or lifting weights. Marketing and Communications Kathryn Canfield Manager of Marketing and Creative Services This is Kathryn’s second season with the Stingrays as the Manager of Marketing and Creative Services. Kathryn was born and raised in Portland, Oregon and moved to Charleston in August 2024 to be a part of the team. Kathryn went to school in McMinnville, Oregon at Linfield University where she earned her Bachelor's degree in the Spring of 2023 and her Master’s in Business and Sport Leadership in the Spring of 2024. During her time at Linfield, Kathryn discovered her passion for sports marketing and the dynamic and lively energy that comes with it. In her free time Kathryn loves to snowboard (which she won’t get much of here anymore), explore the Charleston area, and spending time with friends and family. Michael Cook Game Operations Director Michael Cook is entering his fifth season with the South Carolina Stingrays, where he serves as the Director of Game Operations. Originally from Lorton, Virginia, Michael is a lifelong hockey fan and proud Washington Capitals supporter. He studied Recreation and Sport Management at Coastal Carolina University, where he discovered his passion for video production and game entertainment while working with the Coastal Athletics Department. In his role with the Stingrays, Michael focuses on delivering a smooth, engaging game-night experience. Bringing together entertainment, energy, and attention to detail to create a show fans look forward to every night. Sara Newton Graphic Designer and Digital Production Manager Sara is excited to begin her first season with the South Carolina Stingrays as the Graphic Designer and Digital Production Manager. She holds a Bachelor’s degree in Musical Theatre from Christopher Newport University and hails from Fredericksburg, VA, where her enthusiasm for sports was ignited by frequent visits to Fredericksburg Nationals baseball games. With an extensive background in content creation and sports marketing, Sara’s experience includes serving as the Marketing Assistant and Videographer for the FredNats in 2024. Now transitioning from the diamond to the rink, she brings a fresh, innovative perspective to her role with the Stingrays. Outside of her professional pursuits, Sara enjoys exploring Charleston, soaking up the sun at the beach, and spending quality time with friends. Brendan Reilly Manager of Communications and Broadcasting. Brendan joins the Stingrays for his first season as the Manager of Communications and Broadcasting. Originally from Connecticut, Brendan has had a passion for sports his entire life. Brendan attended the University of Miami where he earned his degree in Broadcast Journalism while gaining experience calling Hurricanes football, basketball and baseball. After graduation, Brendan moved to Winston-Salem, NC where he broadcasted for the Carolina Thunderbirds of the Federal Prospects Hockey League and the Winston-Salem Dash, the High-A Affiliate of the Chicago White Sox. Brendan moved to Charleston in 2025 and spends his time golfing, hanging with friends, and traveling. Community and Merchandise Kelvin Jones Director of Retail Operations Kelvin is entering his third season with the South Carolina Stingrays and serves as the Director of Retail Operations. Originally from Atlanta, GA, Kelvin grew up a huge football and basketball fan. Kelvin graduated from Georgia Southern University in 2020 with a degree in Sports Management with a minor in Business. During his time at Georgia Southern he was heavily involved in the Eagles athletic department as he was a Recruiting Assistant for the football team and interned for the Athletic Marketing program. Kelvin then relocated to Florence, SC where he served two seasons as the Director of Operations for the Florence Flamingos. Kelvin currently lives in Summerville, SC. In his free time, he enjoys hanging with friends, watching sports and spending time with his wife, Hannah, and two cats, Milo and Boba. Sara Shamlin Community Relations & Game Day Promotions Manager This is Sara’s second season with the Stingrays as Community Relations Manager. Sara was raised on Florida’s Space Coast and is an avid sports fan. She moved to Charleston in 2023 to work as an intern with the Stingrays and has enjoyed learning about the team and the area. Sara has a Bachelor’s degree in Advertising and Public Relations from the University of Central Florida where she completed internships with the UCF Athletic Department working with the Basketball and Track and Field teams. She grew up regularly attending the Jacksonville Jaguar games and enjoys supporting her favorite professional teams. Sara currently lives in James Island and when not working enjoys going to Folly Beach, reading a good book or hanging out with friends. Join The Stingrays Front Office Team Employment Opportunities (Teamwork Online) Seasonal Employment Opportunities Contact The Stingrays The South Carolina Stingrays Office is located on Etna Street in North Charleston, just a short walk from the North Charleston Coliseum where the Stingrays play all home games. Our Front Office staff is available in person or via the phone from 9 a.m. to 5 p.m. Monday-Friday. Hours are subject to change and may vary on home game dates. Office Mailing Address: 5050 Etna St. Suite B North Charleston, SC 29418 Office Phone : (843) 744-2248 Email : info@stingrayshockey.com ECHL Network Teams ECHL Teams Adirondack Thunder Allen Americans Atlanta Gladiators Bloomington Bison Cincinnati Cyclones Florida Everblades Fort Wayne Komets Greensboro Gargoyles Greenville Swamp Rabbits Idaho Steelheads Indy Fuel Iowa Heartlanders Jacksonville Icemen Kalamazoo Wings Kansas City Mavericks Maine Mariners Norfolk Admirals Orlando Solar Bears Rapid City Rush Reading Royals Savannah Ghost Pirates South Carolina Stingrays Tahoe Knight Monsters Toledo Walleye Trois-Rivières Lions Tulsa Oilers Utah Grizzlies Wheeling Nailers Wichita Thunder Worcester Railers ECHL.com ECHL.com Tickets Schedule Scores Statistics Press Releases ECHL.TV ECHL Hall of Fame ECHL All Star Classic ECHL Kelly Cup Playoffs ECHL Store ECHL Careers ECHL Partners ECHL Partners AMI Graphics Athletic Knit Baron Championship Rings BFL Canada DASH Fairly Group HotelPlanner Howies Hockey Tape Inglasco Prolific 1 SponsorCX Sutton Special Risk TeamWork Online Warrior Stingrays Front Office 5050 Etna Street Suite B North Charleston,\n                        SC 29418 United States North Charleston Coliseum 5001 Coliseum Dr North Charleston,\n                        SC\n                        29418 United States Contact Privacy Policy Terms Your Privacy Choices © 2025 South Carolina Stingrays & ECHL"
    },
    {
      "url": "https://whatnowmia.com/authentic-hospitality-bringing-rays-hometown-bar-to-freehand-miami/",
      "text": "Authentic Hospitality Bringing Ray’s Hometown Bar to Freehand Miami Home News Restaurants Retail Real Estate Business Owners Get Coverage Join Accelerate Event Browse Partners Resource Guide Preferred Partners View Partner Directory Become a Partner Cities Atlanta Austin Boston Charleston Charlotte Chicago Columbus Dallas Denver Detroit Houston Jacksonville Las Vegas Los Angeles Memphis Miami Montreal Nashville New Orleans New York Orange County Orlando Philadelphia Phoenix Portland Sacramento San Antonio San Diego San Francisco Seattle Tampa Toronto Washington D.C. Atlanta Austin Boston Charleston Charlotte Chicago Columbus Dallas Denver Detroit Houston Jacksonville Las Vegas Los Angeles Memphis Montreal Miami Nashville New Orleans New York Orange County Orlando Philadelphia Phoenix Portland Sacramento San Antonio San Diego San Francisco Seattle Tampa Toronto Washington D.C. SUBSCRIBE TO NEWSLETTER SUBSCRIBE Search Home News Restaurants Retail Real Estate Business Owners Get Coverage Join Accelerate Event Browse Partners Resource Guide Preferred Partners View Partner Directory Become a Partner Cities Atlanta Austin Boston Charleston Charlotte Chicago Columbus Dallas Denver Detroit Houston Jacksonville Las Vegas Los Angeles Memphis Miami Montreal Nashville New Orleans New York Orange County Orlando Philadelphia Phoenix Portland Sacramento San Antonio San Diego San Francisco Seattle Tampa Toronto Washington D.C. Restaurants Authentic Hospitality Bringing Ray’s Hometown Bar to Freehand Miami Ray’s Hometown Bar will replace 27 Restaurant & Bar Published Date: November 22, 2024, 2:00 PM EST Written By Neil Cooney News Writer Share Photo: Official SHARE Last summer, the Miami New Times reported that Broken Shaker at the Freehand Miami , a beloved backyard hangout, had been sold, together with adjacent restaurant 27 Restaurant & Bar . Now operated by Generator Hotels and the New York -based Authentic Hospitality Group , the future of these two concepts—thrown briefly into doubt—has become clear. Follow-up reporting by the New Times explains that Broken Shaker is going through a makeover, but that Generator and Freehand Hotels CEO Alastair Thomann and Authentic Hospitality partner Matt Kliegman have “assured worried guests that although there [will] be some upgrades and changes made to the Broken Shaker, they aimed to keep the spirit intact and the bar open” back in July. 27 Restaurant & Bar Closed back in September, and it has now been revealed that it will be replaced by a new outpost of Authentic Hospitality’s Ray’s Hometown Bar . It will be the third location for Ray’s Bar, and its first outside New York. What Now reached out to Matt Kliegman to inquire about plans for the new Ray’s and the details on its menu. Kliegman declined to comment at this time. The retro-style bar is “ A friendly place to hang your hat !” It serves a selection of cocktails named for famous Rays: the Brooklyn menu features cocktails like the Ray’s Manhattan (In Brooklyn), with Great Jones Rye Whiskey, Carpano Antica Sweet Vermouth, and Agnostura; the Raymond Chandler, with Hendrick’s Gin, grapefruit, lemon, and soda; and the Carly Rae Jepsen, with Angel’s Envy Bourbon, Juliette Peach Liqueur, and Lemon. On the “Chow” side is a selection of appetizers, sandwiches, and desserts. You can keep up with Ray’s Bar news by following @raysbarnyc on Instagram. 2727 Indian Creek Dr, Miami Beach, FL 33140 Be the First to Know From new restaurant openings to exciting retail launches and real estate insights, be the first to know what’s happening in Miami Subscribe & Stay Ahead Share This Article Facebook Copy Link Print By Neil Cooney Follow: Neil Cooney is a freelance writer. He has received an MFA in Creative Writing from Syracuse University, and his work has been published in the Masters Review. Based in Nashville, he spends his free time cooking Korean food and studying chess. Previous Article New Cafe and Bakery Opening in Boca Raton Next Article New Dessert Shop Opening on Lincoln Road in Miami Beach Leave a Comment Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Other Relevant News Lynora’s Restaurant Plans Delray Beach Opening for Spring 2026 September 11, 2025 Neil Cooney Worthwyld Joining Fort Lauderdale’s Las Olas Restaurant Scene September 11, 2025 Neil Cooney Amar Sandwich Shop Joining Amar Mediterranean Kitchen & Bar in Delray Beach September 11, 2025 Neil Cooney Playa Bowls Looks to Be Headed to Doral September 11, 2025 Neil Cooney Bagatelle Miami River Opening This Fall September 11, 2025 Neil Cooney Dolce Bistro Opening with Pan-Caribbean Cuisine in Sunrise September 5, 2025 Neil Cooney Motek Taking Over Former Maty’s Space in Midtown Miami September 5, 2025 Neil Cooney Ready to Open, Grow, or Expand Your Business? What Now connects leading organizations across the restaurant, retail, and real estate industries nationwide, empowering you to grow, expand, and thrive in local markets. Let’s Talk! GOT A NEWS STORY/TIP? Something opening or closing in your neighborhood? Drop us a note: [email protected] Pre-Opening Checklist Our Partner Guide outlines every step in opening a restaurant — from concept creation to securing a lease to hiring your team, and everything in between. Download Now More From Miami Local News First Hot Yoga and Cold Plunge Studio Opening in Downtown Miami Riya Singh July 14, 2025 Local News After 40 Years, This Palm Beach Ice Cream Shop Is Saying Goodbye Twinkle Jha May 12, 2025 Local News Miami’s Ultimate Racing Event Returns – And It’s More Exciting Than Ever Midhun Hari April 28, 2025 Weekly Must Reads Miami Toma Boba Submits Paperwork for West Palm Beach Space Neil Cooney | September 5, 2025 Miami LM Restaurants Opening Lucky Lou’s Raw Bar in Deerfield Beach Neil Cooney | May 21, 2025 Miami Report Says This Florida City’s Homeowners Carry the Nation’s Heaviest Climate Burden Riya Singh | September 3, 2025 Miami Wild Rooster to Open with Smoked and Roasted Chicken and Ribs Neil Cooney | July 18, 2025 Popular News from Other Cities Phoenix Major Phoenix Builder Enters Chapter 11 Bankruptcy Proceedings Deepali Singla | September 8, 2025 San Francisco Fried Chicken Spot in San Francisco Closed Temporarily After Health Inspection Twinkle Jha | September 8, 2025 San Francisco Mexican Restaurant in San Francisco Ordered Closed Over Rodents and Sanitation Violations riya yadav | September 9, 2025 Philadelphia Thai Restaurant in Philadelphia Cited for Violations After Health Inspection riya yadav | September 8, 2025 Something opening or closing in your ‘hood? Drop us a Note: [email protected] © What Now Media Group 2025. All rights reserved. About Company Contact Copyright Privacy Policy Welcome Back! Sign in to your account Username or Email Address Password Remember me Lost your password?"
    }
  ]
}