{
  "fuentes": [
    {
      "url": "https://www.urbansplash.co.uk/contact",
      "email": "enquiries@urbansplash.co.uk"
    },
    {
      "url": "https://www.urbansplash.co.uk/contact",
      "email": "live@urbansplash.co.uk"
    },
    {
      "url": "https://www.urbansplash.co.uk/contact",
      "email": "space@urbansplash.co.uk"
    },
    {
      "url": "https://www.splashvalley.com/contact",
      "email": "info@kvpd.com"
    },
    {
      "url": "https://www.splashvalley.com/contact",
      "email": "guestservices@kvpd.com"
    },
    {
      "url": "https://www.splashvalley.com/contact",
      "email": "info@kvpd.com"
    },
    {
      "url": "https://www.splashvalley.com/contact",
      "email": "reservations@kvpd.com"
    },
    {
      "url": "https://www.realizebradenton.com/",
      "email": "info@realizebradenton.com"
    },
    {
      "url": "https://www.splashzonewaterpark.com/contact/",
      "email": "eleni@splashzonewaterpark.com"
    },
    {
      "url": "https://www.splashzonewaterpark.com/contact/",
      "email": "info@splashzonewaterpark.com"
    },
    {
      "url": "https://www.splashzonewaterpark.com/contact/",
      "email": "marie@splashzonewaterpark.com"
    },
    {
      "url": "https://www.splashzonewaterpark.com/contact/",
      "email": "marisa@splashzonewaterpark.com"
    },
    {
      "url": "https://www.splashzonewaterpark.com/contact/",
      "email": "roger@splashzonewaterpark.com"
    },
    {
      "url": "https://www.splashzonewaterpark.com/contact/",
      "email": "vicki@splashwaterpark.com"
    },
    {
      "url": "https://www.splashzonewaterpark.com/contact/",
      "email": "vicki@splashzonewaterpark.com"
    },
    {
      "url": "https://www.realizebradenton.com/about-us/",
      "email": "info@realizebradenton.com"
    },
    {
      "url": "https://www.splashdevonport.com.au/contact-us/get-in-touch",
      "email": "devonportcs@splashdevonport.com.au"
    },
    {
      "url": "https://www.realizebradenton.com/events/",
      "email": "info@realizebradenton.com"
    },
    {
      "url": "https://mysplashndash.com/contact/",
      "email": "info@mysplashndash.com"
    },
    {
      "url": "https://www.joonsquareusa.com/water-park/riverwalk-splash-park-manatee-fl",
      "email": "pio@cityofbradenton.com"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "bellen@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "israel@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "addisu@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "emily@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "eric@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "fiker@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "geta@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "gezahegn@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "henok@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "kaitlynn@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "megan@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "nardos@splash.org"
    }
  ],
  "mails": [
    "addisu@splash.org",
    "bellen@splash.org",
    "devonportcs@splashdevonport.com.au",
    "eleni@splashzonewaterpark.com",
    "emily@splash.org",
    "enquiries@urbansplash.co.uk",
    "eric@splash.org",
    "fiker@splash.org",
    "geta@splash.org",
    "gezahegn@splash.org",
    "guestservices@kvpd.com",
    "henok@splash.org",
    "info@kvpd.com",
    "info@mysplashndash.com",
    "info@realizebradenton.com",
    "info@splashzonewaterpark.com",
    "israel@splash.org",
    "kaitlynn@splash.org",
    "live@urbansplash.co.uk",
    "marie@splashzonewaterpark.com",
    "marisa@splashzonewaterpark.com",
    "megan@splash.org",
    "nardos@splash.org",
    "pio@cityofbradenton.com",
    "reservations@kvpd.com",
    "roger@splashzonewaterpark.com",
    "space@urbansplash.co.uk",
    "vicki@splashwaterpark.com",
    "vicki@splashzonewaterpark.com"
  ],
  "nombre_sitio": "realizebradenton.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.urbansplash.co.uk/contact",
      "text": "Get in touch | Urban Splash To increase security, speed and for a better experience when using our website, we recommend upgrading your browser Main Menu Residential Commercial Regeneration About us Contact Designers Blog Gallery Careers Resources Blog Urban Splash Newsplash - September 2025 09 Sept 2025 Flushed with pride, our toilets go global 08 Sept 2025 Making waves: how Royal William Yard is championing water safety with the RNLI 11 Aug 2025 Setting the pace for community at Beehive Mill 06 Aug 2025 Taking engagement to new heights 01 Aug 2025 Contact Urban Splash Timber Wharf 16-22 Worsley Street Castlefield Manchester M15 4LD +44 (0) 161 839 2999 enquiries@urbansplash.co.uk Contact US Follow US Suggested Searches Section 0 Results Found See all results Residential Commercial Regeneration About us Buy or Rent Any Manchester Leeds Salford Sheffield Birmingham Any Liverpool Plymouth Salford Manchester Sheffield Buy or Rent Buy or Rent Residential or Commercial Residential Commercial Buy or Rent Buy Rent Let or Buy Let Buy Location Any Manchester Leeds Salford Sheffield Birmingham Scheme Any Search all homes Enquiry Enquiry Enquiry Type General Commercial Residential First Name Last Name Email Phone Number Rent or Buy Select Rent or Buy Homes to rent Homes to buy Postcode Location Select Location Select Location Altrincham Birmingham Bradford Bristol Cambridge Leeds Manchester Milton Keynes Plymouth Salford Sheffield Stalybridge Swansea Walsall Windermere Scheme/Project Select Project Tell us more (optional) Min Budget Min Budget £400 £500 £600 £700 £800 £900 £1,000 £1,100 £1,200 £1,300 £1,400 £1,500 £1,600 £1,700 £1,800 £1,900 Max Budget Max Budget £500 £600 £700 £800 £900 £1,000 £1,100 £1,200 £1,300 £1,400 £1,500 £1,600 £1,700 £1,800 £1,900 £2,000 How many bedrooms do you need? Select Number 1 2 3 4 5 Where did you hear about us? Select an option Advertisement Hoarding Local knowledge Property website Referral Search engine Social Media Other What can we help you with? Keeping in touch * We'd like to send you details on events, news, homes and workspaces you might be interested in from Urban Splash and our partners. We promise not to spam you. Opt-in to keep in the loop. Opt in Opt out For more information, including how\nwe use your personal details, please see our Privacy Policy . submit Enquiry Type General Commercial Residential Company Name First Name Last Name Email Phone Number Postcode Buy or Let Select Buy or Let Commercial space to buy Commercial space to let Location Select Location Select Location Birmingham Bradford Liverpool Manchester North Shields Plymouth Salford Sheffield Stalybridge Swansea Scheme/Project Select Project Tell us more (optional) Type Select Type Type Select Type Office Retail Leisure Industrial Number of Employees Select Min 1 5 10 20 40 60 80 Number of Employees Select Max 5 10 20 40 60 80 100 Size (sq ft) Select Min 50 sq ft 250 sq ft 500 sq ft 1,000 sq ft 2,000 sq ft 4,000 sq ft 6,000 sq ft 8,000 sq ft Size (sq ft) Select Max 250 sq ft 500 sq ft 1,000 sq ft 2,000 sq ft 4,000 sq ft 6,000 sq ft 8,000 sq ft 10,000 sq ft Where did you hear about us? Select an option Advertisement Hoarding Local knowledge Property website Referral Search engine Social Media Other Message Keeping in touch * We'd like to send you details on events, news, homes and workspaces you might be interested in from Urban Splash and our partners. We promise not to spam you. Opt-in to keep in the loop. Opt in Opt out For more information, including how\nwe use your personal details, please see our Privacy Policy . submit Enquiry Type General Commercial Residential First Name Last Name Email Phone Number Message Keeping in touch * We'd like to send you details on events, news, homes and workspaces you might be interested in from Urban Splash and our partners. We promise not to spam you. Opt-in to keep in the loop. Opt in Opt out For more information, including how\nwe use your personal details, please see our Privacy Policy . submit Get on the list Get on the list Get the latest news on property development, placemaking, architecture, careers, new homes and workspaces straight into your inbox. First Name Last Name Email Subscribe For more information, including how we use your personal details,\nplease see our Privacy Policy . Get in touch Residential 0333 666 9999 live@urbansplash.co.uk Residential Enquiry Commercial 0333 666 0000 space@urbansplash.co.uk Commercial Enquiry General 0161 839 2999 enquiries@urbansplash.co.uk General Enquiry For queries on residential resales, please click here . Locations Head office Timber Wharf 16-22 Worsley Street Castlefield Manchester M15 4LD T: 0161 839 2999 Google Maps Offices Vanilla Factory 39 Fleet Street Liverpool L1 4AR T: 0151 708 9449 Google Maps Residential Sales & Lettings New Islington 15 Finders Quay Manchester M4 6AB T: 0161 850 0768 Google Maps Royal William Yard Residential Sales & Lettings Plymouth PL1 3RP T: 01752 260 617 Google Maps Residential Sales & Lettings Saxton The Avenue Richmond Hill Leeds LS9 8FR T: 0333 666 6000 Google Maps Residential Sales & Lettings Lakeshore Lakeshore Drive Crox Bottom Bristol BS13 7BD T: 0117 325 0308 Google Maps Residential Sales & Lettings Park HIll 2 South Street Sheffield S2 5PN T: 0333 666 6000 Google Maps Commercial Timber Wharf 16-22 Worsley Street Castlefield Manchester M15 4LD T: 0333 666 0000 Google Maps Urban Splash modular factory Clover Nook Road Cotes Park Industrial Estate Alfreton DE55 4RF T: 01773 304999 Google Maps Office locations Manchester Liverpool New Islington Royal William Yard Saxton Lakeshore Park Hill Urban Splash Commercial Urban Splash modular factory How can we help? Enquiry Type General Commercial Residential First Name Last Name Email Phone Number Message Keeping in touch * We'd like to send you details on events, news, homes and workspaces you might be interested in from Urban Splash and our partners. We promise not to spam you. Opt-in to keep in the loop. Opt in Opt out For more information, including how\nwe use your personal details, please see our Privacy Policy . submit Looking for something else? About About us Read more Regeneration Regeneration Read more Residential Residential homepage Read more Commercial Commercial homepage Read more FAQs FAQs Read more Get in touch Residential 0333 666 9999 live@urbansplash.co.uk Residential Enquiry Commercial 0333 666 0000 space@urbansplash.co.uk Commercial Enquiry General 0161 839 2999 enquiries@urbansplash.co.uk General Enquiry Stay connected Newsletter Be first in the queue! Get our latest news straight to your inbox. First Name Last Name Your email address Subscribe Follow US © 2025 Urban Splash Careers Modern Slavery Statement Privacy policy Press enquiries Urban Splash Residential Fund"
    },
    {
      "url": "https://www.splashvalley.com/contact",
      "text": "Contact Us | Splash Valley Aquatic Center | Kankakee Valley Park District Home Plan Your Visit Admission & Fees Season Passes Park Rules HoursÂ Of Operation & Daily Schedule Park Attractions UpcomingÂ Events Lessons & Programs Aquatic Programs Swim Lessons Swim Teams Parties & Rentals Birthday packages Private Rentals Group Rates & Packages About Us News & Updates KVPD Staff Directory Contact Us Employment Info Sponsorships & Advertising Contact Us Get In Touch With Us! Splash Valley Administration Office 1850 River Rd, Kankakee, IL 60901 guestservices@kvpd.com Splash Valley Administration Office 1850 River Road, Kankakee IL 60901 (815) 401 - 5977 Info@kvpd.com Â View The Complete Staff Directory >> Contact Form Fields marked with an asterisk (*) are required. First name * Last name * Email * Phone number* Message* Your Submission Has Been Received! If Required, Someone Will Be In Touch Soon. Please Call Us Directly If You Need A More Urgent Response. (815) 939 - 1946 Oops! Something went wrong while submitting the form. The KVPD Updated Program Guide Is Now Available! Check It Out! >> Online Registration >> Upcoming Events Check Back Soon For More Events! View All UpcomingÂ Events >> Plan Your Visit â Admission & Fees Season Passes Hours Of Operation Park Attractions Upcoming Events Lessons & Programs (Coming Soon) Aquatic Programs Swim Lessons Swim Teams Parties & Rentals Birthday Packages Private Rentals Group Rates & Packages About Us News & Updates KVPD Staff Directory Contact Us Employment Info Â©2021 Kankakee Valley Park District All Rights Reserved Web Development By"
    },
    {
      "url": "https://www.realizebradenton.com/",
      "text": "Home - Realize Bradenton Bringing People Together in Bradenton Florida Skip to content About Team Board Press Bradenton Public Market Our Vendors Schedule Market Newsletter Event/Programs BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Calendar Support Donate Our Sponsors RB Newsletter About Team Board Press Bradenton Public Market Our Vendors Schedule Market Newsletter Event/Programs BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Calendar Support Donate Our Sponsors RB Newsletter Donate About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home BAM!Fest BAM!Fest (Bradenton Art & Music Festival) transforms the Riverwalk into a dynamic, diverse, immersive art and music experience from bridge to bridge! Stay tuned for updates for BAM!Fest 2026. Bradenton Public Market Since 1979, the community has gathered on Saturdays on Old Main Street in Bradenton, Florida for the Market to enjoy fresh produce, local art, upbeat music, and each other. Support local farmers, artisans, and food producers at this free, outdoor, family-friendly event. The Market is held on Saturdays, October through May, from 9 am to 2 pm, on Old Main Street in downtown Bradenton. Music in the Park Music in the Park is a free, family-friendly music series featuring local musicians. These outdoor concerts are held on Fridays in the spring at the Bradenton Riverwalk Pavilion. The 2026 spring concerts will be held Fridays, April 11 – May 2 from 6 – 8 pm at the Bradenton Riverwalk Pavilion. Winter Wonderland Winter Wonderland is a magical seasonal celebration on Bradenton’s Old Main Street with fun for the entire family. Enjoy performances from local students, local vendors, and Santa! 2025 Winter Wonderland will be held Saturday, December 6th from 5 – 8 pm on Old Main Street, Bradenton. About Realize Bradenton Realize Bradenton is a Florida nonprofit that enhance the vibrancy of downtown Bradenton through community engagement, events, and the pursuit of insightful and innovative practices to increase social connectivity. Learn more about us . We ❤️ Our Sponsors Investors that support Realize Bradenton demonstrate their confidence in our impact and outstanding results. These businesses and individual donors are recognized as civic leaders and receive exceptional exposure within the community. Become A Sponsor P.O. Box 9114 Bradenton, FL 34206 Info@RealizeBradenton.com Voicemail: (941) 301-8445 Terms of Use Privacy Statement Site Map Facebook-f Instagram Youtube About Team Board News Contact Terms of Use Privacy Statement Site Map Bradenton Market Vendors Schedule Newsletter Sign-Up Vendor Application Events Calendar BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Support Donate Newsletter Sign-Up Sponsor Interest About Bradenton Market Events Support P.O. Box 9114 Bradenton, FL 34206 Info@RealizeBradenton.com Voicemail: (941) 301-8445 Terms of Use Privacy Statement Site Map Facebook-f Instagram Youtube About Team Board News Contact Terms of Use Privacy Statement Bradenton Market Vendors Schedule Newsletter Sign-Up Vendor Application Events Calendar Bradenton Blues Festival Music in the Park Start-Up Circle Walk Bradenton Walk Bradenton Support Donate Newsletter Sign-Up Sponsor Interest Form © Copyright 2023, all rights reserved   |  Realize Bradenton, Inc., a 501(C)(3) nonprofit organization |  EIN: 27-1330078 Developed with ❤ by Piper Creative Group"
    },
    {
      "url": "https://www.splashzonewaterpark.com/contact/",
      "text": "Contact Us | Splash Zone Water Park | Jersey Shore Water Park | Wildwood, NJ Skip to content (609) 729-5600 Facebook TripAdvisor Instagram YouTube Buy Tickets & Cabanas Season Pass Birthday Parties Search for: Plan Your Visit FlowBar Park Hours of Operation Pricing Cabana Rentals The Zone Grill Directions Tips & Info Weather Guarantee Park Map Attractions FlowRider What is FlowRider? Rules and Safety Responsibility Waiver Groups OLD Bday page Contact Group Sales Group Rates Corporate Fundraising Contact Employment Contact Home Contact Contact Us OFFICE: 609-729-5600 FAX: 609-523-2734 Frequently asked questions: Plan Your Visit Can’t find the answer? Please email the department you wish to speak with directly ( see department emails below). Via Email: DEPARTMENT EMAIL ADDRESSES: Aquatics: eleni@splashzonewaterpark.com Accounts Receivable: vicki@splashzonewaterpark.com Food & Beverage: marisa@splashzonewaterpark.com Front Gate Services: info@splashzonewaterpark.com Group Sales: roger@splashzonewaterpark.com Human Resources: vicki@splashzonewaterpark.com Marketing & Park Developement: marie@splashzonewaterpark.com We are located at: 3500 Boardwalk (Schellenger & the Boardwalk) Wildwood, NJ 08260 Directions Splash Zone Waterpark 3500 Boardwalk Wildwood, NJ 08260 (609) 729-5600 Contact Privacy Policy Sign up for savings Sign-up now for special offers, birthday greetings, coupons and more fun from Splash Zone! Sign Up Now © Splash Zone Waterpark, All Rights Reserved | Created by WDD Page load link Go to Top"
    },
    {
      "url": "https://www.realizebradenton.com/about-us/",
      "text": "About - Realize Bradenton Skip to content About Team Board Press Bradenton Public Market Our Vendors Schedule Market Newsletter Event/Programs BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Calendar Support Donate Our Sponsors RB Newsletter About Team Board Press Bradenton Public Market Our Vendors Schedule Market Newsletter Event/Programs BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Calendar Support Donate Our Sponsors RB Newsletter Donate About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home About Home » About Our Mission We enhance the vibrancy of downtown Bradenton through community engagement, events, and the pursuit of insightful and innovative practices to increase social connectivity. The Team We work hard to make a difference in our community every day, and strive to be great at what we do (while having fun at the same time). Heartfelt appreciation to sponsors, donors, volunteers, and partners, because they make our work possible. Meet our team . The Board Our board members apply multi-generations of experience, knowledge, tenacity, and dedication. We are also passionate about the Bradenton area and its future. Meet our Board members . Our History Realize Bradenton was founded in 2010 to implement elements from Bradenton’s 2009 Cultural Master Plan. Since its founding, Realize Bradenton’s accomplishments include: collecting community input for the development of the Riverwalk Park and the recent Riverwalk East expansion, growing the Bradenton Farmers’ Market (now known as the Bradenton Market ), creating the Bradenton Blues Festival, increasing public art, and the recent addition of the Start-Up Circle entrepreneur program. Press Releases Press Realize Bradenton Board News Annie Breitinger Joins Realize Bradenton Board Of Directors​ Read More... Andrea Knies June 9, 2025 Press Realize Bradenton Announces BAM!Fest BAM!Fest (Bradenton Art & Music Festival) will transform the Riverwalk on April 5, 2025 from 11 am – 7pm into a dynamic, diverse, immersive art and music experience from bridge to bridge! Read More... Andrea Knies February 20, 2025 Press Two New Members Join Realize Bradenton Board Toria Bartlett and James Furo join Board Read More... Andrea Knies January 10, 2024 See all of Realize Bradenton’s news releases… We ❤️ Our Sponsors Investors that support Realize Bradenton demonstrate their confidence in our impact and outstanding results. These businesses and individual donors are recognized as civic leaders and receive exceptional exposure within the community. Become A Sponsor P.O. Box 9114 Bradenton, FL 34206 Info@RealizeBradenton.com Voicemail: (941) 301-8445 Terms of Use Privacy Statement Site Map Facebook-f Instagram Youtube About Team Board News Contact Terms of Use Privacy Statement Site Map Bradenton Market Vendors Schedule Newsletter Sign-Up Vendor Application Events Calendar BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Support Donate Newsletter Sign-Up Sponsor Interest About Bradenton Market Events Support P.O. Box 9114 Bradenton, FL 34206 Info@RealizeBradenton.com Voicemail: (941) 301-8445 Terms of Use Privacy Statement Site Map Facebook-f Instagram Youtube About Team Board News Contact Terms of Use Privacy Statement Bradenton Market Vendors Schedule Newsletter Sign-Up Vendor Application Events Calendar Bradenton Blues Festival Music in the Park Start-Up Circle Walk Bradenton Walk Bradenton Support Donate Newsletter Sign-Up Sponsor Interest Form © Copyright 2023, all rights reserved   |  Realize Bradenton, Inc., a 501(C)(3) nonprofit organization |  EIN: 27-1330078 Developed with ❤ by Piper Creative Group"
    },
    {
      "url": "https://www.splashdevonport.com.au/contact-us/get-in-touch",
      "text": "Get In Touch - Splash Devonport Aquatic and Leisure Centre Skip to content Member Login News ⚠ Alerts Learn to Swim Expand GOswim Swimming Lessons School Holiday Program School Swimming Program Work With Us Swim Expand Aquatic Facilities Aqua Aerobics Lap Lane Availability Aquatic Supervision Aquatic Capacity Procedure Gym Expand Fitness Facilities Group Exercise Functional Training Personal Training Free Trial Allied Health Expand Exercise Physiology Join Venue Expand About Us Entry Fees Opening Hours Accessibility Conditions of Entry Venue Hire Kiosk Birthday Parties Ticket to Play Voucher Program Contact Expand Get In Touch Manage My Membership Getting Here Frequently Asked Questions Employment Search Join Now Search Toggle Menu Get In Touch Home Contact Get In Touch We are happy to assist you with all general enquiries, help or support. Please complete an enquiry form on this page or you can contact our friendly team directly. Contact Details (03) 64233007 devonportcs@splashdevonport.com.au 260 Steele Street Devonport Opening Hours November to March Monday to Thursday: 6:00am to 9:00pm Friday: 6:00am to 8:00pm Saturday: 8:00am to 6:00pm Sunday: 9:00am to 5:00pm April to October Monday to Thursday: 6:00am to 9:00pm Friday: 6:00am to 8:00pm Saturday: 8:00am to 5:00pm Sunday: 8:00am to 5:00pm Public holiday hours may vary. Closed Christmas Day, Boxing Day and Good Friday. Submit an Enquiry \" * \" indicates required fields Name * First Last Email * Phone * Post Code * Enquiry Type * General Enquiry New Membership Enquiry New Enrolment/Program Enquiry Member Enquiry/Request Feedback School/Corporate Bookings Venue Hire Events Message * How did you hear about us? - Select - Council News Source Local Advertising Local News Source School or Sports Club Search Engine (Google) Social Media (Facebook, Instagram) Streaming Service (YouTube, Spotify) Pop Up Event Word of Mouth Consent Opt in to our mailing list to receive the latest news, events and special offers Consent * Yes, I agree to Terms & Conditions and Privacy Policy * This field is hidden when viewing the form Venue Website This field is hidden when viewing the form Venue N/A Ascot Vale Leisure Centre Keilor East Leisure Centre Queens Park Swimming Pool X/Twitter This field is for validation purposes and should be left unchanged. Become a member Why not save on entry fees and become a member with us? View Memberships Contact Us (03) 64233007 devonportcs@splashdevonport.com.au 260 Steele Street Devonport Quick Links Learn to Swim Allied Health Swim Gym Venue Getting Here Get In Touch Subscribe Get the latest updates and offers in your inbox. \" * \" indicates required fields Subscribe Get the latest updates and offers to your inbox. Venue Name * Select Venue Keilor East Leisure Centre Ascot Vale Leisure Centre Queens Park Swimming Pool Name * First Last Email * This field is hidden when viewing the form URL URL This field is for validation purposes and should be left unchanged. © 2025 Splash Devonport Aquatic and Leisure Centre is proudly managed by Belgravia Leisure . Terms & Conditions Privacy Policy We Acknowledge, We Recognise, We Support Belgravia Leisure respectfully acknowledge and recognise Aboriginal and Torres Strait Islander peoples as Traditional Custodians of Country and pays respect to their cultures and Elders past and present. Belgravia Leisure proudly welcome, support and include all people into the facilities, programs, services and employment it offers to communities across Australia and New Zealand. Search for: Search Learn to Swim Toggle child menu Expand GOswim Swimming Lessons School Holiday Program School Swimming Program Work With Us Swim Toggle child menu Expand Aquatic Facilities Aqua Aerobics Lap Lane Availability Aquatic Supervision Aquatic Capacity Procedure Gym Toggle child menu Expand Fitness Facilities Group Exercise Functional Training Personal Training Free Trial Allied Health Toggle child menu Expand Exercise Physiology Join Venue Toggle child menu Expand About Us Entry Fees Opening Hours Accessibility Conditions of Entry Venue Hire Kiosk Birthday Parties Ticket to Play Voucher Program Contact Toggle child menu Expand Get In Touch Manage My Membership Getting Here Frequently Asked Questions Employment Join Now Toggle Menu Close Search for: Search"
    },
    {
      "url": "https://www.realizebradenton.com/events/",
      "text": "Events - Realize Bradenton Skip to content About Team Board Press Bradenton Public Market Our Vendors Schedule Market Newsletter Event/Programs BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Calendar Support Donate Our Sponsors RB Newsletter About Team Board Press Bradenton Public Market Our Vendors Schedule Market Newsletter Event/Programs BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Calendar Support Donate Our Sponsors RB Newsletter Donate About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home About Bradenton Public Market Events/Programs Support Home Events Home » Events BAM!Fest On Saturday, April 5, 2025 from 11 am – 7 pm BAM!Fest (Bradenton Art & Music Festival) will transform the Riverwalk into a dynamic, diverse, immersive art and music experience from bridge to bridge! Winter Wonderland Winter Wonderland transforms Bradenton’s Old Main Street into a seasonal celebration with fun for the entire family. Enjoy performances from local students, local vendors, and Santa. Join us on Saturday, December 14th from 5:00 – 8:30 pm on Old Main Street in Bradenton. Music in the Park Music in the Park is a free, family-friendly music series featuring local musicians. These outdoor concerts are held on Fridays in October and April at the Bradenton Riverwalk Pavilion. Start-Up Circle The Start-Up Circle is a free business and project planning course designed for aspiring and newly established entrepreneurs. Classes are taught by local experts and cover the basics of starting or bolstering an independent business – from licensing to financial literacy, market research to cash flow and more. Submit An Event Do you have an event that you would like to add to the calendar? Please submit it to our partner organization, Discover Bradenton, for consideration. Submit An Event We ❤️ Our Sponsors Investors that support Realize Bradenton demonstrate their confidence in our impact and outstanding results. These businesses and individual donors are recognized as civic leaders and receive exceptional exposure within the community. Become A Sponsor P.O. Box 9114 Bradenton, FL 34206 Info@RealizeBradenton.com Voicemail: (941) 301-8445 Terms of Use Privacy Statement Site Map Facebook-f Instagram Youtube About Team Board News Contact Terms of Use Privacy Statement Site Map Bradenton Market Vendors Schedule Newsletter Sign-Up Vendor Application Events Calendar BAM!Fest Music in the Park Winter Wonderland Start-Up Circle Support Donate Newsletter Sign-Up Sponsor Interest About Bradenton Market Events Support P.O. Box 9114 Bradenton, FL 34206 Info@RealizeBradenton.com Voicemail: (941) 301-8445 Terms of Use Privacy Statement Site Map Facebook-f Instagram Youtube About Team Board News Contact Terms of Use Privacy Statement Bradenton Market Vendors Schedule Newsletter Sign-Up Vendor Application Events Calendar Bradenton Blues Festival Music in the Park Start-Up Circle Walk Bradenton Walk Bradenton Support Donate Newsletter Sign-Up Sponsor Interest Form © Copyright 2023, all rights reserved   |  Realize Bradenton, Inc., a 501(C)(3) nonprofit organization |  EIN: 27-1330078 Developed with ❤ by Piper Creative Group"
    },
    {
      "url": "https://mysplashndash.com/contact/",
      "text": "Contact - Splash-N-Dash | Inflatable Water Park Skip to content Thank you for an EPIC 2025 Season! We will be back at Lake McSwain starting Saturday May 23, 2026! About Plan Your Visit Close Plan Your Visit Open Plan Your Visit Know Before Your go FAQs Park Hours Prices Splash Attack! Waiver New in 2025! Lil' Splash Season Passes Birthday's & Groups Rentals Cafe Contact Tickets & Season Passes MENU Contact us Get in touch Name Email Phone Message Send Message Contact Details Our team are happy to help. If you have a question, or would like to enquire about group bookings, please get in touch. (888) 554-0014 (Call) (209) 600-7814 (Text) info@mysplashndash.com 9090 Lake McClure Rd. Snelling, CA 95369 Operating Hours Our calendar of operating hours for the 2025 summer season. See enlarged calendar . 2025 Best in Lodging & Recreation Winner Buy Tickets & Season Passes TikTok Icon Instagram Icon Facebook Icon X Icon Contact (209) 600-7814 (Text) (888) 554-0014 (Call) info@mysplashndash.com 9090 Lake McClure Rd. Snelling, CA 95369 Hours Splash-n-Dash Park Operating Hours: We operate between the months of May and September. Click to see our 2025 Operating Calendar . Reel Deal Market & Cafe Hours: Click to see our hours of operation . Site About Visit Park Hours Prices Season Passes Birthday's & Groups Cabanas & Rentals Lil' Splash Splash Attack! Cafe Waiver FAQs Jobs Contact © 2025 Splasn-N-Dash | Inflatable Water Park – Website by New Vue & Pillarbox Digital Privacy Policy ABOUT Plan Your Visit Know Before You Go FAQS Park Hours PRICES Splash Attack! Waiver New in 2025! Lil' Splash Season Passes BIRTHDAY'S & GROUPS RENTALS CAFE CONTACT Tickets & Season Passes TikTok Icon Instagram Icon Facebook Icon X Icon Thank you for an epic 2025 season!! 2026 Season Pass Info More info We would like to extend our sincere gratitude to all of our guests who visited the park this season. Your presence truly brings the park to life, and we deeply appreciate your choice to spend your time with us. We will be back at Lake McSwain starting Saturday May 23, 2026. Check back with us in November as 2026 Season Passes will be Up To 40% Off!"
    },
    {
      "url": "https://www.joonsquareusa.com/water-park/riverwalk-splash-park-manatee-fl",
      "text": "Riverwalk Splash Park in Bradenton, Manatee -  Water Park | Joonsquare USA List Your Business Login Register Visit Explore Manatee FL Supermarket Zoo and Wildlife Sanctuary Museums Amusement Park Park Other Water Park Tourist Spot Adventure Park Store Login Register Explore Manatee FL Supermarket Zoo and Wildlife Sanctuary Museums Amusement Park Park More Water Park Tourist Spot Adventure Park Store List Your Business Social Links 0 0 Go Back Florida Manatee Water Park Riverwalk Splash Park Riverwalk Splash Park Bradenton, Manatee Share × Riverwalk Splash Park Share This Business Click Below to Share this Business with your Friends, Clients and other Contacts. Save × Please login to Save this business. Login Close × Please login to report this business. Login Close 09:00 AM - 06:00 PM Thursday Send Enquiry Call Map Location Review 3+ 3+ Like 434 Views You can search for other Businesses Near  Bradenton Water Park Tourist Spot Amusement Park Park Adventure Park Supermarket Museums Store Reviews about the Riverwalk Splash Park. Click To Review Upload Image Riverwalk Splash Park Contact Details: Address : 452 3rd Ave W, Bradenton, Manatee, Florida, USA, 34205 Phone No. : 9419329400 Email : Pio@cityofbradenton.com Official website : https://cityofbradenton.com/index.asp?SEC=1F7D127F-9209-4CBF-AB9B-C71E30CCD4CC#1E7F14F7-417D-4EE3-88A5-0135BC8443F7 Share this Business with others: Send Your Enquiry Get response from other Businesses Also. Feedback Send Enquiry Location Click Here to Search for more Water Park Near Bradenton × Working Hours Monday 09:00 AM - 06:00 PM Open Tuesday 09:00 AM - 06:00 PM Open Wednesday 09:00 AM - 06:00 PM Open Thursday 09:00 AM - 06:00 PM Open Friday 09:00 AM - 06:00 PM Open Saturday 09:00 AM - 06:00 PM Open Sunday 09:00 AM - 06:00 PM Open Water Park Near Bradenton DEFY Bradenton Amusement Park 0 374 TreeUmph! Adventure Course Adventure Park 0 313 Lil Duke One Stop Shop Four Fun LLC Amusement Park 0 368 × Riverwalk Splash Park Response Within 24 Hours. Get response from other Businesses Also × Riverwalk Splash Park Book Appointment Online in Advance. Select Appointment Date Choose Time Slot Choose Time Morning Slot 10:15 AM 10:30 AM 10:45 AM 11:00 AM 11:15 AM 11:30 AM 11:45 AM Afternoon Slot 12:00 PM 12:15 PM 12:30 PM 12:45 PM 01:00 PM 01:15 PM 02:00 PM 02:15 PM 02:30 PM 02:45 PM 03:00 PM 03:15 PM 03:30 PM 03:45 PM Evening Slot 04:15 PM 04:30 PM 04:45 PM 05:00 PM 05:15 PM 05:30 PM 05:45 PM Get Confirmation from Business on Mobile No. × Riverwalk Splash Park . Please Give Feedback. × Riverwalk Splash Park . Response In Only 30 minutes. --Select --- Voilence Harassment Spam Copyrighted browse by state Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa kansas Kentucky Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Louisiana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Company About Joonsquare Jobs Blogs Press Promote Business Online Publish a Business Terms & Conditions Reviews Content Guidelines Advertise with Joonsquare More Customer Support Privacy Policy Terms of Services FAQ Follow Us Facebook Twitter Youtube Copyright 2024 © All rights reserved by Joonsquare USA"
    },
    {
      "url": "https://splash.org/about-us",
      "text": "Splash | About Us Blog Contact Newsletter Signup f t Our Work Why Project WISE Water Sanitation Hygiene Menstrual Health Partners About Us Core Values Meet the Team Meet the Board Financials 501c3 Letter Careers Social Enterprises Where Nepal China India Ethiopia Cambodia Bangladesh Thailand Vietnam Impact Stories Our Impact Donate Donate Give Monthly: The Tap Give Annually: The Fountain Other Ways to Give Get Involved Blog Contact Newsletter Signup We clean water for kids. Splash is a social justice organization committed to the poor, an international development agency disciplined around urban economies, a social enterprise dedicated to putting ourselves out of business, and a safe water company focused on children. Put this odd combination together and exciting things are happening. Core Values We shift, we grow, we stumble, we pivot and we continually refine our work and scope—yet amidst the ever-moving landscape of international development, there are core values that act as constants for Splash. People People first. People second. People third. Quality Beautiful products that function and last. Honesty No drama, no surprises, no BS. Joy Kids at heart, seeing potential everywhere. Mistakes Make them, don’t repeat them. Meet the Team The Splash Team is international. We hire fun folks who continually impress us with their smarts, ingenuity and tenacity. We're collegial. We're rigorous. We work hard, play hard, and dream big. Really, really big. Addisu ShewaMoltot WASH Promotion & Partnership Manager Addis Ababa, Ethiopia Anna Lin Mitchell Chief Finance and Administration Officer Manchester-by-the-Sea, MA Bellen Moges Menstrual Health Program Manager Addis Ababa, Ethiopia Cameron Schupp Director, Development Operations & Donor Relations Washington, D.C. Carole Wanjau Executive Director - Africa Johnannesburg, South Africa Chris Nicoletti Chief Impact Officer Fort Collins, CO Christine Nyagode Regional Director, Finance & Operations Nairobi, Kenya Cudjoe Bennett Chief Program Officer Washington, D.C. Deepanita Biswas Consultant: Country Representative Kolkata, India Elias Alemu Sr. Officer, Finance & Operations Addis Ababa, Ethiopia Emily Cruz Director of Behavior Change Seattle, WA Enqubahrish Yibeltal Officer, Finance & Operations Addis Ababa, Ethiopia Eric Stowe Founder & Chief Executive Officer Seattle, WA Fiker Abebe Regional Director, Impact & MLE Addis Ababa, Ethiopia Gebeyehu Abebe Eshetie Programs Director Addis Ababa, Ethiopia Geta Tade Sr. Lead Driver & General Service Assistant Addis Ababa, Ethiopia Gezahegn Shibiru Senior O&M Officer Addis Ababa, Ethiopia Ginette Mballa Sr. Director, Finance & Operations Potomac, MD Henok Wolday Design & QA Manager Addis Ababa, Ethiopia Israel Yednekachew Regional Manager, Data Quality, Insights, & Reporting Addis Ababa, Ethiopia Kaitlynn Lagman Program Officer Seattle, WA Katrina Straker Chief Development Officer Baltimore, MD Kebebush Mekuria Cleaner Addis Ababa, Ethiopia Lauren Rymer Director, Philanthropy - US Atlanta, GA Martin Carter Consultant, Infrastructure and Operations Castle Cary, UK Megan Williams Senior Director of Programs Seattle, WA Mekonnen Addisu Regional Director Amhara, Ethiopia Nardos Nigusse Construction Supervision Officer Addis Ababa, Ethiopia Sandra Sottomano Global People & Culture Manager Bay Area, CA Tigist Bekele Senior People and Culture Manager Addis Ababa, Ethiopia Tigist Tesfaye Worota Sr. Manager, Finance & Operations Addis Ababa, Ethiopia Vika Dudaney Sr. Manager, Global FP&A Cambridge, MA Come work at Splash! Current Openings Meet the Board The Splash Board of Directors holds Splash accountable, verifies progress, collaborates on strategy, maintains standards, ensures quality, and works tirelessly on behalf of clean water for kids. Skye Yoden Board Chair Seattle, WA Eric Angula Board Secretary Nairobi, Kenya Sharon Cheramboss Board Member Nairobi, Kenya Paris Jones Board Member Khunapong Khunaraksa Board Member Sydney, Australia Chemu Lang'at Board Member Texas, USA Craig Sarsony Board Member Eric Stowe Founder & Chief Executive Officer Seattle, WA Financials 2022 2022 Audited Financial Statements 2022 990 2023 2023 Audited Financial Statements 2023 990 2024 2024 Audited Financial Statements 2024 990 Annual Report 501c3 Letter Splash International is a registered non-profit organization in the United States. Our tax ID/EIN is 56-2600599. All donations are tax-deductible where applicable. For information on our registration status in other countries, please contact us. 501c3 Letter (PDF) Want to get involved? Do More Do you want to make a difference? You can! Give kids access to clean safe drinking water. Donate Privacy | Cookies Privacy Policy Contact Facebook Twitter Instagram YouTube © 2025 SPLASH. ALL RIGHTS RESERVED."
    }
  ]
}