{
  "fuentes": [
    {
      "url": "https://reddsrestaurant.com/contact/",
      "email": "renee@reddsrestaurant.com"
    },
    {
      "url": "https://reddsrestaurant.com/contact/",
      "email": "park@reddsrestaurant.com"
    },
    {
      "url": "https://reddsrestaurant.com/contact/",
      "email": "renee@reddsrestaurant.com"
    },
    {
      "url": "https://www.redds.us/contact-us/",
      "email": "mary@reddsbiergarten.com"
    }
  ],
  "mails": [
    "mary@reddsbiergarten.com",
    "park@reddsrestaurant.com",
    "renee@reddsrestaurant.com"
  ],
  "nombre_sitio": "reddspub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://reddsrestaurant.com/contact/",
      "text": "Contact – Redds Meadowlands – Restaurant and Event Parking Skip to content Menus Happy Hour Private Events Metlife Park & Ride Contact Menus Happy Hour Private Events Metlife Park & Ride Contact Login / Register $ 0.00 0 Cart Contact Us Redd’s Restaurant & Biergarten 317 Washington Avenue Carlstadt, NJ 07072 Phone: 201-933-0015 Fax: 201-939-1204 For catering & events, please contact renee@reddsrestaurant.com For park & ride inquiries, please contact park@reddsrestaurant.com Connect with us! Facebook: www.facebook.com/reddsrestaurant Instagram: www.instagram/reddsrestaurant How to get here: Lincoln Tunnel Route 3 West to 120 North (just over Hackensack River bridge) take 120 North (stay in left lane) to 503 North Moonachie, under second overpass to REDD’S on the right. George Washington Bridge To 80 West to Route 17 South to 120 South (Paterson Plank Rd, Sports Complex exit) stay in left lane to 503 North Moonachie (just past the Hampton Inn on the left) go under overpass to REDD’s on the right. New Jersey Turnpike North/South Exit 16W after toll stay right, follow route 3 east sign, pass Sheraton on right, take 120 North, (stay in left lane) to 503 North Moonachie, under second overpass to REDD’s on right. Garden State Parkway North South Exit 153 to Route 3 East to 120 North East Rutherford Sports Complex exit, stay left to Sheraton Plaza Drive, pass Sheraton entrance, make right onto 120 North, (stay in left lane) to 503 North Moonachie, under second overpass to REDD’s on right. Redd’s Restaurant & Biergarten 317 Washington Ave Carlstadt NJ 07072 Open Everyday 11am – 2am We open at 9am on Football Sundays! Facebook Instagram Visit our sister locations: Redd’s Biergarten Newark The Roosevelt Copyright © 2025 Redd’s Restaurant Website by Spencer Pearce Creative"
    },
    {
      "url": "https://www.redds.us/contact-us/",
      "text": "Contact Us | Redds Biergarten Located in the Heart of Newark’s Arena Arts Center Home About Menus Private Events Press Contact Home About Menus Private Events Press Contact Contact Us LOCATION Redd’s Biergarten 220 Market Street 37 Edison Place Newark, NJ  07102 View Google Map Phone : (973) 877-6600 Check out our sister biergartens: Redd’s Meadowlands HOURS OPEN 7 DAYS A WEEK Open Sunday for all Prudential Center events! Hours of operation will be extended earlier or later based on Prudential Center events. Kitchen is ALWAYS OPEN after Prudential Center events conclude. Sunday: Open for all Prudential Center events and private parties Monday – Thursday: 11am – 2am Friday – Saturday: 11am – 3am Kitchen closes @ 10pm except on event days, open later and after event. Friday & Saturday: 11am-3am Kitchen closes @ 11pm RESERVATIONS RESERVATIONS ARE ACCEPTED ON NON-EVENT DAYS FOR GROUPS OF 15 OR MORE. Please email mary@reddsbiergarten.com to make your arrangements. OPEN SEATING – SELF SEATING “WILLKOMMEN FREUNDE” RECIPE FOR A “GUTE” TIME PLEASE SIT WHERE YOU LIKE, DON’T BE SHY, GRAB ANY TABLE MAKE FRIENDS NEARBY. TO ORDER SOMME GRUB IT’S SIMPLE YOU SEE, OUR FRIENDLY SERVER’S AND BARTENDERS WILL GREET YOU HAPPILY. YOU’LL THEN RECEIVE A BUZZER AND WHEN IT TURNS REDD, PLEASE GO TO THE PICK-UP WINDOW WHERE YOU WILL BE FED. FOR YOUR CONVENIENCE DURING EVENTS OUR CASHIER WINDOWS ARE ALSO OPEN TO TAKE YOUR FOOD ORDER’S SO YOU CAN EAT AND DRINK MERRILY. PROST! Redd's Biergarten Newark 220 Market Street | 37 Edison Place, Newark NJ 07102 973-877-6600 OPEN 7 DAYS A WEEK Open Sundays for Prudential Center events and private parties. Our kitchen is ALWAYS OPEN after Prudential Center events, and hours of operation will be extended earlier and later based on Prudential Center event times. Monday-Thursday: 11am - 2am Friday-Saturday: 11am-3am Sunday: open for Prudential Center events and private parties Kitchen closes at 10pm except on event days. Visit our sister locations: Redd's Meadowlands • Redd's Newark • The Roosevelt Copyright © 2025 Redd's Biergarten. All Rights reserved. Website by Spencer Pearce Creative ."
    }
  ]
}