{
  "fuentes": [
    {
      "url": "https://redlight.co/team",
      "email": "todd@redlight.co"
    },
    {
      "url": "https://redlightpb.com/events/stand-up-sundays-comedy-night-at-redlight/",
      "email": "info@redlightpb.com"
    },
    {
      "url": "https://redlightpb.com/events/dakota-dawkins-at-red-light-palm-beach/",
      "email": "info@redlightpb.com"
    },
    {
      "url": "https://redlightpb.com/",
      "email": "info@redlightpb.com"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "advising@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "careercenter@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "pantherscloset@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "pantherspantry@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "studentaccessibility@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "studentcounselingcenter@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "advising@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "bacheloradvising@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "careercenter@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "cashier@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "diast@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "faocent@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "international@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "pantherscloset@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "pantherspantry@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "ssstrio@pbsc.edu"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "email": "studentaccessibility@pbsc.edu"
    },
    {
      "url": "https://redlightpb.com/about-us/",
      "email": "info@redlightpb.com"
    },
    {
      "url": "https://www.jadespapga.com/contact-us",
      "email": "bobochow184@yahoo.com"
    },
    {
      "url": "https://redlightpb.com/contact/",
      "email": "info@redlightpb.com"
    },
    {
      "url": "https://www.gardensdermatology.com/red-light/",
      "email": "info@gardensdermatology.com"
    },
    {
      "url": "https://www.palmhouse.com/contact-us/",
      "email": "info@palmhouse.com"
    },
    {
      "url": "https://redlightpb.com/tv/",
      "email": "info@redlightpb.com"
    },
    {
      "url": "https://redlightpb.com/menu/",
      "email": "info@redlightpb.com"
    }
  ],
  "mails": [
    "advising@pbsc.edu",
    "bacheloradvising@pbsc.edu",
    "bobochow184@yahoo.com",
    "careercenter@pbsc.edu",
    "cashier@pbsc.edu",
    "diast@pbsc.edu",
    "faocent@pbsc.edu",
    "info@gardensdermatology.com",
    "info@palmhouse.com",
    "info@redlightpb.com",
    "international@pbsc.edu",
    "pantherscloset@pbsc.edu",
    "pantherspantry@pbsc.edu",
    "ssstrio@pbsc.edu",
    "studentaccessibility@pbsc.edu",
    "studentcounselingcenter@pbsc.edu",
    "todd@redlight.co"
  ],
  "nombre_sitio": "redlightpb.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://redlight.co/team",
      "text": "Team - Red Light Holland Hit enter to search or ESC to close Home Our Companies FarmCare SR Wholesale RadixMotion Happy Caps Red Light Farms Mush Room & More Utrecht MiniChamp BV Mushroom Farm Products Team Corporate Leadership Board of Directors Advisory Board Investors Company News Investor Deck Investor Deck Corporate Info March 2023 AGSM About Intro Core Business Media Contact TEAM CORPORATE LEADERSHIP Todd Shapiro Co-Founder, CEO & Director Todd Shapiro, after being a top rated Radio Show host & a brilliant Marketing Entrepreneur with over 20 years of experience, has recently moved on from mainstream media to concentrate his efforts on being the CEO of Red Light Holland. Shapiro also has an incredible history as one of North America's most professional & effective Brand Ambassadors and Influencers having worked with Canopy Growth, Samsung, Canada Goose, Canadian Tire & Boveda Inc. Todd Shapiro most recently was an Honorary Chair for the Road Hockey To Conquer Cancer for the Princess Margaret Cancer Foundation and is a supporter of CAMH and the Polar Bear Foundation. Todd currently sits on the Board of Directors for Red Light Holland, Datametrex and JamStacked as his experience, out of the box thinking and work ethic make him a valuable member to any team. Keith Li CFO Sarah Hashkes Chief Technology Innovation Officer Sarah Hashkes, CEO or Radix Motion (www.radixmotion.com) is utilizing her research in cognitive neuroscience, focused on psychedelics, embodiment and immersive technology to connect humans to their body and to each other. Sarah published the first paper on predictive coding and psychedelics back 2017. She tried VR for the first time after a visit to burning man and pivoted her research opening the first VR lab in the motor control department of Radboud university. Since completing her Masters she has been consulting and developing for many companies in the immersive field from pain management (Karuna Labs), bias training (Debias VR) and empathy driven learning (Facebook). She has opened her own company focused on increasing the bandwidth of human connection with immersive technology. Her prototype called Meu has been hailed as working towards realizing the work of Terence McKenna’s vision (https://gen.medium.com/most-vr-is-total-bullshit-81a08431df38) by Douglas Rushkoff and called \"Trippy and super compelling\" by Kent Bye (https://voicesofvr.com/780-invoking-psychedelic-embodiment-experiences-vr-radix-motion-meu/). Russell Peters Chief Creative Officer Russell Peters was recently named as one of Rolling Stone’s 50 Best Comics of All Time. He started doing stand-up at the age of nineteen at open mics in his native Toronto, and spent the next fifteen years honing his craft at clubs across Canada and the UK. In 2004, Peters gained critical and global recognition for his CTV “Comedy Now!” special and soon became the first comedian to sell-out Toronto’s Air Canada Centre in 2007. Peters went on to set attendance records at venues from Madison Square Garden to The Sydney Opera House to London’s O2 Arena – where he broke the UK attendance record for highest number of tickets sold for an individual comedy show. His subsequent tours were captured in his successful specials broadcast on Showtime and Comedy Central: Outsourced in 2006; Red, White and Brown in 2008; and, The Green Card Tour in 2010. In 2013, Peters became the first comedian to create a Netflix Original Comedy Special. Peters’ most recent tour, The Deported World Tour was seen by over 400,000 fans in 40 cities across 20 countries and culminated in with the stand- up Russell Peters Deported on Amazon Prime in January 2020. Peters has been awarded Gemini, Peabody, Emmy and Canadian Screen Awards for his hosting, producing and acting talents. His last TV series, The Indian Detective set a Canadian viewership record for Bell Media /CTV in 2017 and was released globally on Netflix. Peters resides in Las Vegas and Los Angeles. When not on tour he spends every day with his nine-year-old daughter, Crystianna and newborn son, Russell Santiago. He has a blue belt with three stripes in Jiu Jitsu and is an ardent DJ and hip-hop junkie who tries to get on the turntables for at least a few minutes every day. Troy DuFour Senior Vice President of Sales Troy DuFour brings over 24 years of commercial strategy and team leadership with major consumer-focused organizations across North America. Most recently, he served as the Vice President of Global Sales of the health and wellness company Delivra Health Brands. During his time with Delivra Health Brands, Troy led the sales team strategy to expand distribution Globally and increase in-store availability with North American retailers. Mr. DuFour led the sales group to define commercial strategy inclusive of category management, innovation, customer insights, trade marketing, sales planning, and P/L responsibilities. Prior to his career with Delivra Health Brands, Troy held senior positions with Red Bull Distributor – Powerbev Inc. for 14 years where he served as Vice President of Sales. Troy was hired as the first field sales manager within the Red Bull Distribution network across Canada, and he played an integral role in the launch and ultimate success of the Red Bull brand and it’s in-store excellence. Mr. Dufour also spent 6 years with Coca Cola Bottling where he managed some of the largest Canadian grocery and mass retailers. Troy has a BA in Business Administration and has continued to advance his educational development with Executive Educational programs at the Queens School of Business. He presently lives in Carlise, ON and enjoys, hockey, golf, and spending time with his family. BOARD OF DIRECTORS Brad J. Lamb Chairman of the Board of Directors Long considered Toronto’s top condominium broker, Brad J. Lamb is also one of the cities most prominent developers. He is a driving force behind Canada’s burgeoning real estate market. As CEO of Brad J. Lamb Realty Inc. and Lamb Development Corp Brad has 30 years of widespread industry experience. He is responsible for the marketing and sales campaigns of over 130 condominium projects across six major Canadian cities. Additionally, Brad’s team of sales experts have helped many thousands of consumers in the buying and selling of property. To date, Brad J. Lamb has been involved in the sale of over 29,000 properties for more than 8.5 Billion dollars. Since 2002, Lamb Development Corp has completed nineteen developments, some 3400 suites for over $1.3 Billion. Currently, Lamb Development Corp has three projects under construction, almost 800 suites for a value of $360 Million. Lamb Development Corp is in development on a further 15 projects in Toronto, Hamilton, Calgary and Edmonton with a value of $2.4 Billion. Binyomin Posen Director Mr. Binyomin Posen is a Senior Analyst at Plaza Capital Limited, where he focuses on corporate finance, capital markets and helping companies to go public. After three and a half years of studies overseas, he returned to complete his baccalaureate degree in Toronto. Upon graduating (on the Dean's List) he began his career as an analyst at a Toronto boutique investment bank where his role consisted of raising funds for IPOs and RTOs, business development for portfolio companies and client relations. Todd Shapiro Co-Founder, CEO & Director Todd Shapiro, after being a top rated Radio Show host & a brilliant Marketing Entrepreneur with over 20 years of experience, has recently moved on from mainstream media to concentrate his efforts on being the CEO of Red Light Holland. Shapiro also has an incredible history as one of North America's most professional & effective Brand Ambassadors and Influencers having worked with Canopy Growth, Samsung, Canada Goose, Canadian Tire & Boveda Inc. Todd Shapiro most recently was an Honorary Chair for the Road Hockey To Conquer Cancer for the Princess Margaret Cancer Foundation and is a supporter of CAMH and the Polar Bear Foundation. Todd currently sits on the Board of Directors for Red Light Holland, Datametrex and JamStacked as his experience, out of the box thinking and work ethic make him a valuable member to any team. Michael Galloro Director Michael Galloro, age 50, is an accomplished executive with over 29 years of hands-on experience in financial and transactional leadership. As the Managing Partner of ALOE Finance, a boutique transaction services firm, Mr. Galloro provides advisory services to small and mid-cap public companies across Canada and the US. His expertise spans mergers and acquisitions, financings, corporate structuring, and corporate governance, with a notable track record of quarterbacking public transactions. Mr. Galloro has successfully listed and transacted Capital Pool Companies, enabling emerging businesses to access public markets, and excels at collaborating with management to refine operational and corporate strategies. A Chartered Professional Accountant and Chartered Accountant, he earned his Honours Bachelor of Accounting from Brock University and began his career in the financial institutions practice at KPMG LLP. Outside of his professional achievements, Mr. Galloro is a dedicated family man with a passion for motor racing and automobiles. CREATIVE CONSULTANTS Karim Rashid Head of Design Karim Rashid is an Egyptian-born and Canadian-raised industrial designer. His designs include luxury goods, furniture, lighting, surface design, brand identity and packaging. Time magazine has described him as the \"most famous industrial designer in all the Americas\" and the \"Prince of Plastic”. Karim was named the Head Designer for The Wisdom Truffle, a figurine that will work through Red Light Holland's Augmented Reality to encourage people to leave their phone behind and instead recommend one goes for a \"walk\" or go outside to \"exercise\" and to \"live in the moment\". The Wisdom Truffle's intention is to highlight an iMicrodose lifestyle which promotes positivity, help put a smile on one's face and connect people to an enlightened community. Mingjing Huang Engineering Consultant Mingjing Huang, founder and principal at Essence Engineering. www.essenceengineering.com Creative and energetic awesome product architect with extensive experience in complete hardware product development cycle from design to manufacturing. Offering consulting services including hardware architecture, system and digital design for consumer electronic devices, as well as project management for hardware inclusive products. Excellent communicator and has a knack for clarifying and solving complex problems through integration of insights from disparate perspectives. Shipped products at greater than 1 million volumes for Cisco and Apple, created prototypes for the advance development groups at Lab126 and Nokia at small quantities, and architected BLE enabled wearables. Has a strong interest in user and value focused designs, and passionately believes in creating simple, artful, and delightful products. Bliss Francis Creative Consultant Freelance illustrator and graphic designer. ADVISORY BOARD Bruce Linton Chairman of Advisory Board Founder & former Chairman, CEO and Co-CEO of Canopy Growth Corporation (CGC) formerly Tweed Marijuana Incorporated, a cannabis company based in Smiths Falls, Ontario, Canada. Bruce founded Tweed in 2013 and renamed it Canopy Growth Corporation in 2015. Canopy Growth Corporation was the first cannabis company in North America to be listed on a major stock exchange (TSX-V in April 2014 and TSX in July 2016) and to be included on a major stock index (S&P/TSX Composite Index in March 2017). Bruce led CGC from a TSX-V listed start-up company with an $80 million market cap to a NYSE/TSX listed company (S&P/TSX60) including more than 30 M&A activities. Ranking number one on the TSX30 with a market cap of over $20 billion by the summer of 2019. Bruce’s experience as a founder, CEO, and board member across a diversity of sectors was a huge influence for the success of CGC. Earning market support for capital raises of over $6 billion in public capital markets and private placements, the company funded capacity growth and opened new markets, including a $5 billion CAD investment by Fortune 500 beverage company, Constellation Brands (NYSE:STZ). Bruce is Co-Founder and was Chairman and CEO of Canopy Rivers, Inc.(TSX:RIV). Notably, throughout his career, Bruce has been responsible for the acquisition and/or disposition of nearly $4 billion in business assets and has established regular engagement with the World Bank and Asia Development Bank. Currently he holds the positions of: Executive Chairman for Vireo Health International, Inc., Executive Chairman for Gage Cannabis Co., Co-Chairman for Martello Technologies Group, Co-Founder of Ruckify, Executive Chairman for Wolverine Partners Corp, Chairman and CEO of Collective Growth Corporation which IPO'd on the NASDAQ on May 1, 2020. He is also special advisor with Better Choice Company, Director with Mindmed and an active investor with Slang Worldwide Inc., and OG DNA Genetics Inc. Beginning his journey at Newbridge Networks Corporation, Bruce went on to be part of the establishing team at Crosskeys Systems Corporation, of which he was a key member for the NASDAQ/TSX IPO. He was GM and Re-Founder of computerland.ca, and Co-Founder of Webhancer Corp. Bruce has acted as CEO and Director at Clearford Water Systems, Inc., past Chairman of the Ottawa Community Loan Foundation, past Board Member and Treasurer of Canada World Youth, past member of the Board of Governors for Carleton University. The Honourable Tony Clement Senior Advisor The Honourable Tony Clement has had a long and distinguished career, spanning four decades, in politics, the law and business. He served in senior roles in Prime Minister Harper’s Cabinet (2006-2015) as Health Minister, Industry Minister and President of the Treasury Board. In those roles he was tasked with senior leadership responsibilities. He initiated the cost reductions and business transformations that allowed for the balancing of the federal budget; negotiated the deal with Chrysler, GM, auto sector unions and the US Government that saved the domestic auto sector. As Health Minister for Canada 2006-2008 he fashioned the first National Pandemic Plan working with the World Health Organization. He also created the Canadian Partnership Against Cancer and the Mental Health Commission. As Industry Minister he initiated Canada’s Digital Strategy and later Canada’s open data strategy as part of the worldwide Open Government Partnership. Prior to federal politics Tony Clement served in the cabinets of Ontario Premiers Mike Harris and Ernie Eves (1997-2003), taking leadership positions as Minister of Transportation, Minister of the Environment, Minister of Municipal Affairs and Housing and Minister of Health and Long-Term Care. During 2003 he was the frontline Health Minister during the SARS outbreak in Ontario. As a business entrepreneur Tony Clement has led IT companies, served on IT and health care boards and provided strategic advice both nationally and internationally. He continues to operate in international circles, with strong connections in the USA, UK, Europe, South America and Asia, including India. A practicing lawyer, he is able to analyze from legal, geopolitical and financial perspectives. Tony Clement lives in Muskoka, Ontario and his wife Lynne is a lawyer and successful author. He has three adult children. Graham Pechenik Senior Advisor Graham is a registered patent attorney, with degrees in Biochemistry and Cognitive Neuroscience. Graham gained over a decade of experience representing Fortune 500 companies in the agricultural, chemical, pharmaceutical, biotech, and technology industries before founding Calyx Law in 2016, the first intellectual property law boutique to focus on cannabis and psychedelics. At Calyx Law, Graham works with numerous public and private companies to develop IP strategies, protect IP through patent and trademark filings, and use IP to generate value and growth. Graham is also editor-at-large of Psilocybin Alpha, where he tracks patent filings and writes about patent issues in the psychedelics space. Graham is a strong supporter of the responsible use of psychedelics, having chosen his science majors after his first experiences with psilocybin mushrooms, and having benefited himself from microdosing. Mushrooms of all types are also center stage in Graham’s personal life, as he enjoys foraging for them, growing them, and teaching about them as a volunteer guide for the National Park Service. Glenn Cowan Advisor Glenn founded One 9 while serving as an Assaulter Officer in Canadian Special Operations Forces National Mission Unit. As a Squadron Commander, Glenn specialized in leadership, command and strategic planning. He successfully translated these skills with the creation of a venture capital fund that funds and scales businesses using precision military tactics. Having served on multiple combat deployments in Afghanistan, sensitive information operations in the Middle East, and Hostage Recovery operations in Africa he was a strategic planner and tactical commander. Glenn was often responsible for briefing Canada’s senior political and military leadership including the Prime Minister of Canada, Minister of National Defence and Chief of Defence Staff on tactical execution of strategically relevant and sensitive missions. He was decorated for “his outstanding professional competence, foresight and adaptability, as well as significant courage of conviction as the Commander of the Minister of National Defence’s Close Personal Protection Party, thus ensuring the safety of the Minister while under attack from Taliban forces.” Injuries sustained while in military service led Glenn to medically release from the Canadian Armed Forces, and during his transition to civilian life, he was opened to the positive benefits of psychedelics and microdosing. He is a staunch supporter of veteran charities. He is a graduate of McGill University, The Army Operations Course, The Special Operations Assaulter Course, Canadian Securities Course and Ivey’s Executive Leadership Program. Akwasi Owusu-Bempah Advisor DJ Saul Advisor DJ Saul is CEO of B&Y Ventures (focused on Khalifa Kush and Mistercap) — the core brands founded and owned by global superstar Wiz Khalifa. Prior to that role, DJ served as the CEO of ISL (a 2x AdAge Small Agency of The Year, acquired by WPP in 2016). He has worked with over 50 global Fortune 500 brands, with a focus on digital, experiential marketing, and emerging technology. DJ was a founding producer of the DC Tech Meetup (growing it to 20k members), is a member of the World Economic Forum’s Young Global Shapers, a member of NextGen Venture Partners (an active angel investor), and a three time Washingtonian \"Tech Titan.” He also serves as an advisor to multiple startups, companies, and non-profits. Tim Hunkele Advisor Tim Hunkele, Pittsburgh-born entrepreneur, is Co-Founder and COO of B&Y Ventures, a Wiz Khalifa company. Prior to B&Y Ventures, Tim Founded Hunk Digital, a consulting firm focused on online presence and brand growth, working with numerous high-profile clients. He served as Vice President of Taylor Gang, Wiz Khalifa’s record label, leading brand and revenue growth for artists including Wiz Khalifa, Juicy J and Ty Dolla $ign. He is the Co-Creator of Wiz Khalifa’s Weed Farm mobile app which launched in April 2017 and has become one of the top performing celebrity apps quickly grossing over $10M. Tim is an active angel investor and an Alphalab 15 Alumni. TRIP Quotes by TradingView Stay up to date with our latest developments. Visit Investor Center CONTACT Red Light Holland 1 Adelaide St. E., Suite 801 Toronto, Ontario, M5C 2V9 Telephone: (647) 204-7129 Email: todd@redlight.co NEWSLETTER Subscribe to our newsletter to stay up to date with our latest developments. Leave this field empty if you're human: © 2025 Red Light Holland. Privacy Policy Home Our Companies FarmCare SR Wholesale RadixMotion Happy Caps Red Light Farms Mush Room & More Utrecht MiniChamp BV Mushroom Farm Products Team Corporate Leadership Board of Directors Advisory Board Investors Company News Investor Deck Investor Deck Corporate Info March 2023 AGSM About Intro Core Business Media Contact This website uses cookies to ensure you get the best experience on our website. Details can be found in our Privacy Policy Read More ACCEPT ALL Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT Join Our Newsletter Leave this field empty if you're human: ×"
    },
    {
      "url": "https://redlightpb.com/events/stand-up-sundays-comedy-night-at-redlight/",
      "text": "Stand-Up Sunday's - Comedy Night At RedLight | Red Light of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search 561-293-3034 Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us More Search 561-293-3034 Stand-Up Sunday’s – Comedy Night At RedLight Stand-Up Sunday’s at Red Light Palm Beach LIVE! Stand-Up Comedy by the West Palm Beach Area’s Greatest Local Comics. Every Sunday Night – Doors Open @8pm – Show starts @8:30pm Make Reservations + Add to Google Calendar Tags: Live Comedy West Palm Beach , Live Stand Up Palm Beach , redlight events , stand up comedy , sundays , West Palm Beach Comedy Show Date Sep 14 2025 Time 8:00 pm Location Red Light Palm Beach 1000 North Congress Avenue West Palm Beach, Florida 33409, USA Next Event Josh Miles – Live at Red Light Palm Beach Date Sep 18 2025 Time 7:00 pm Share this event Red Light Of Palm Beach Red Light Of Palm Beach WE ARE A 21 AND UP VENUE 1000 North Congress Avenue West Palm Beach, Florida 33409 Thu-Sat: 7pm-11pm Sun: 8pm-11pm 561-293-3034 MAP & DIRECTIONS [+] © 2020 All Rights Reserved.  RedLightPB.com Red Light Palm Beach Is owned and operated by Monroe's of Palm Beach Facebook Instagram Mail Youtube"
    },
    {
      "url": "https://redlightpb.com/events/dakota-dawkins-at-red-light-palm-beach/",
      "text": "Dakota Dawkins at Red Light Palm Beach | Red Light of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search 561-293-3034 Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us More Search 561-293-3034 Dakota Dawkins at Red Light Palm Beach Dakota Dawkins Live at Red Light Palm Beach LIVE MUSIC Featuring: Dakota Dawkins 7pm – 10pm HEADLINER Dakota Dawkins Make Reservations + Add to Google Calendar Tags: Dakota Dawkins , Live Music , Palm Beach Events , Palm Beach Live Music , redlight events , West Palm Live Music Date Sep 20 2025 Time 7:00 pm Location Red Light Palm Beach 1000 North Congress Avenue West Palm Beach, Florida 33409, USA Organizer Dakota Dawkins Next Event Stand-Up Sunday’s – Comedy Night At RedLight Date Sep 21 2025 Time 8:00 pm Share this event Red Light Of Palm Beach Red Light Of Palm Beach WE ARE A 21 AND UP VENUE 1000 North Congress Avenue West Palm Beach, Florida 33409 Thu-Sat: 7pm-11pm Sun: 8pm-11pm 561-293-3034 MAP & DIRECTIONS [+] © 2020 All Rights Reserved.  RedLightPB.com Red Light Palm Beach Is owned and operated by Monroe's of Palm Beach Facebook Instagram Mail Youtube"
    },
    {
      "url": "https://redlightpb.com/",
      "text": "Home | Red Light of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search 561-293-3034 Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us More Search 561-293-3034 There's a Secret In Palm Beach Rumored to Offer Intimate Dining, Booze & Quite Possibly Live Entertainment. Oh? Tell Me More Hidden In Plain Sight Intimate, exclusive...and Away From Prying Eyes Reservervations - 21+ VIP Access to So Many Things Just Don't Tell Your Friends Reserve a Table Now - 21+ Make a reservation Tap to Reserve a Table - 21+ Steaks & Seafood There's Nothing Secret about Our Menu The Menu What Our Guests are saying Past Clients Are Our Best Advertisements Highly recommend! We were looking for a speak easy and came across this gem. The ambiance was perfectly set with the lighting, live jazz, craft cocktails, mouth watering food and our amazing server Talia. She delivered exceptional service, catering to all our needs with such fun energy. She recommended the pork belly which was incredible then had the stuffed pork chop and the halibut for dinner which was so delicious. After dinner Julian recommended the chocolate chip bread pudding and it was to die for. Definitely will be back soon! Kimberly Wolters May 27, 2021 So fancy. Friendly staff. Love this place. Anna Lepeley March 8, 2021 This is a great location for that individual or couple that seeks that VIP feel and high end dining experience. I went on a Sunday when they feature comedians. The comedians were great and I will definitely be going back. Josh Velez February 15, 2021 Bobby Mac's comedy night was a blast. Funny comedians, great food, laughed till it hurt. Sunday Night at Red Light is my new spot. Michael J DeSuno November 16, 2020 The comedy show on Sunday’s is amazing Michael Panzeca November 16, 2020 Awesome new concept! Not too many places like this around and def not any this cool in South Florida. Live jazzy music and low sexy lighting creates the perfect ambience to discreetly let loose and enjoy yourself in comfort. The food and menu selection was great and the service was superb! Ask for Gemma, she sure is a gem 💎 Love this place, will definitely be frequenting often 😍 Amanda Tulucci Uys October 14, 2020 Food was amazing as always and the service was nothing short of being perfect. Danny Rodriguez October 12, 2020 What an experience. Red light is exactly what it is, a speakeasy. A hidden gem in plain sight, one might wonder the shenanigans you’re off to. But you’re enjoying a cocktail (or two) and a meal. The food is on a different level. The ambience puts you right back in the 1920’s in the most wonderful way. Date night, girls night, guys night, or just a night - Red Light is a wonderful escape from reality. Matthew Smidowicz October 10, 2020 Amazing food and ambiance! Can’t wait to go back with my friends for pom margaritas and dinner. Also had wonderful live jazz music! Holly Shivery October 5, 2020 The Red Light Palm Beach was an amazing experience. The ambiance was sultry, sophisticated and totally relaxing. The dim lights and luxurious\ndecor created the perfect place to unwind and\nindulge the senses while waiting for the feast\nfit for a king. The magnificent Tomahawk steak\narrived with the chef who sliced it to perfection.\nOur waiter Kyle new exactly how I wanted it\nPittsburgh style, very impressive! The Mac and\nCheese side was stocked with chunks of fresh\nLobster, Outrageous!  My guest had Alaskan\nKing Crab legs that were tender and delicious.\nDuring our meal we enjoyed music by saxophonist\nScott St John, great guy very entertaining. The staff\nRepeatedly visited our table to fulfill our every\ndesire. Overall a magnificent experience!\nThanks Joe B and the entire staff.\n\nResponse from the owner\n4 hours ago\nThank you Louis for this AWESOME review. Hope to see you again, soon. Luigi Russo October 5, 2020 It’s sexy everything about it. Great date place. Food is wonderful I worked on Wall Street we went everywhere and ate everything and drank too.  The steaks are as good if not better especially the presentation that Lugers or Morton fun smoky drinks and you get treated like a rock star! Carol Lizza September 25, 2020 Love this place ! Great vibe !\nFood was sooooo good def recommend the lamb chops ! Management and our waitress were super friendly and professional! See you again soon 🙂 Jovany Gio Black September 24, 2020 Highly recommend! We were looking for a speak easy and came across this gem. The ambiance was perfectly set with the lighting, live jazz, craft cocktails, mouth watering food and our amazing server Talia. She delivered exceptional service, catering to all our needs with such fun energy. She recommended the pork belly which was incredible then had the stuffed pork chop and the halibut for dinner which was so delicious. After dinner Julian recommended the chocolate chip bread pudding and it was to die for. Definitely will be back soon! Kimberly Wolters May 27, 2021 So fancy. Friendly staff. Love this place. Anna Lepeley March 8, 2021 This is a great location for that individual or couple that seeks that VIP feel and high end dining experience. I went on a Sunday when they feature comedians. The comedians were great and I will definitely be going back. Josh Velez February 15, 2021 Bobby Mac's comedy night was a blast. Funny comedians, great food, laughed till it hurt. Sunday Night at Red Light is my new spot. Michael J DeSuno November 16, 2020 The comedy show on Sunday’s is amazing Michael Panzeca November 16, 2020 Awesome new concept! Not too many places like this around and def not any this cool in South Florida. Live jazzy music and low sexy lighting creates the perfect ambience to discreetly let loose and enjoy yourself in comfort. The food and menu selection was great and the service was superb! Ask for Gemma, she sure is a gem 💎 Love this place, will definitely be frequenting often 😍 Amanda Tulucci Uys October 14, 2020 Food was amazing as always and the service was nothing short of being perfect. Danny Rodriguez October 12, 2020 What an experience. Red light is exactly what it is, a speakeasy. A hidden gem in plain sight, one might wonder the shenanigans you’re off to. But you’re enjoying a cocktail (or two) and a meal. The food is on a different level. The ambience puts you right back in the 1920’s in the most wonderful way. Date night, girls night, guys night, or just a night - Red Light is a wonderful escape from reality. Matthew Smidowicz October 10, 2020 Amazing food and ambiance! Can’t wait to go back with my friends for pom margaritas and dinner. Also had wonderful live jazz music! Holly Shivery October 5, 2020 A Secret Entrance Access to Red Light of Palm Beach is granted via a SECRET CODED door. As our exclusive guest, you will also enjoy private parking in our secure members-only lot. Reserve Today to Get Your Code Red Light Of Palm Beach Red Light Of Palm Beach WE ARE A 21 AND UP VENUE 1000 North Congress Avenue West Palm Beach, Florida 33409 Thu-Sat: 7pm-11pm Sun: 8pm-11pm 561-293-3034 MAP & DIRECTIONS [+] © 2020 All Rights Reserved.  RedLightPB.com Red Light Palm Beach Is owned and operated by Monroe's of Palm Beach Facebook Instagram Mail Youtube"
    },
    {
      "url": "https://www.palmbeachstate.edu/contactus/default.aspx",
      "text": "Contactus | Contact Us at Palm Beach State College Skip to the main content VISIT PBSC APPLY NOW CONTACT Us MENU Form validation is not working properly. Please enable Javascript. Search VISIT PBSC APPLY NOW CONTACT Us Students Canvas Directory Faculty/Staff Start of Top Menu - Press Esc key to Close Search Admissions About Academics Community Student Life Support & Services Admission Requirements & Steps College Affordability Financial Aid & Scholarships Office of International Education Orientation Register for Classes About PBSC Campus Locations Campus Safety Contact Us District Board of Trustees Fast Facts Human Resources Institutional Research & Effectiveness (IRE) Office of the President Request More Information About PBSC Strategic Plan: Panther Strong 2026 Academic Calendar Career Pathways College Catalog/Student Handbook Continuing Education & Workforce Training Dual Enrollment & Early Admissions Honors College PBSC Online Search For Classes Art Galleries Athletics Corporate Education & Training Solutions Events Calendar Foundation for Palm Beach State College Theatres Athletics Events Calendar Clubs & Organizations Advising Bookstore Career Center Center for Student Accessibility Center for Student Well-being Library Military & Veteran Resources Panther's Voice Student Learning Center Testing Center Close Menu End of Top Menu Palm Beach State College Contactus Contact Us at Palm Beach State College ADMISSIONS ADMISSIONS FORMS & FAQs FINANCIAL AID IMPORTANT DATES & TIMES COLLEGE EVENTS CAREER PATHWAYS CAREER ASSESSMENTS Important Phone Numbers PBSC Campus Security: 561-868-3600 (All campuses) Community and Crisis Helpline: Call 211 General Enrollment & Financial Aid Questions 561-868-3000 or 1-866-576-7222 (toll-free) Student & Faculty Canvas General Support: 877-376-9392 Are you interested in learning more about attending Palm Beach State College? Someone will reach out to help guide you through the admissions process and answer\n                        any questions! Request Info We can be reached virtually through Qless Advising/Course Scheduling  |  Financial Aid  |  Veteran Services  |  Registration/Admissions \n                           |  Student Account Services Note: Available hours & wait times may vary and will be noted on the site. Please\n                              select the correct queue to avoid longer wait times. Get Help Now Services at PBSC ** Please visit the department website for campus-specific hours and contact information.\n                        ** Department Contact Information Department Website Main Phone Number Email Academic Advising palmbeachstate.edu/Advising 561-868-3000 Advising@pbsc.edu Academic Affairs palmbeachstate.edu/AcademicAffairs Admissions/Registration Office palmbeachstate.edu/Admissions palmbeachstate.edu/registration 561-868-3000 Bachelor's Program palmbeachstate.edu/Bachelors bacheloradvising@pbsc.edu Career Center palmbeachstate.edu/Career CareerCenter@pbsc.edu Center For Student Accessibility (Formerly Disability Support Services) palmbeachstate.edu/CSA 561-868-3734 StudentAccessibility@pbsc.edu Computer/IT Service Desk Support help.palmbeachstate.edu Students: 561-868-4000 Faculty/Staff: 561-868-3100 Counseling Center palmbeachstate.edu/CounselingCenter 561-868-3980 StudentCounselingCenter@pbsc.edu Financial Aid palmbeachstate.edu/FinancialAid 561-868-3000 faocent@pbsc.edu International Admissions palmbeachstate.edu/International 561-868-3029 international@pbsc.edu Library palmbeachstate.edu/Library Online Student Support 561-868-3303 onlinestudentsupport@pbsc.edu Panther's Closet palmbeachstate.edu/Panthers-Closet PanthersCloset@pbsc.edu Panther's Pantry palmbeachstate.edu/Panther-Pantry 561-868-3980 PanthersPantry@pbsc.edu Panther's Voice palmbeachstate.edu/student-life/Panthers-Voice Recruitment & Outreach palmbeachstate.edu/Recruitment 561-868-3000 Security palmbeachstate.edu/Security 561-868-3600 Student Account Services palmbeachstate.edu/finance/stuacctsrvs 561-868-3250 cashier@pbsc.edu Student Learning Center (SLC) palmbeachstate.edu/SLC 561-862-4485 Student Support Services (SSS) palmbeachstate.edu/student-development/TRiO/sss 561-868-3392 ssstrio@pbsc.edu Testing & Certification Center palmbeachstate.edu/Testing Veterans Services palmbeachstate.edu/VeteransServices Site Index Jobs Campuses & Maps Consumer Disclosures Economic Security Report Public Records Internet Privacy SACSCOC Accreditation Notice of Nondiscrimination Harassment Policy Title IX Download MyPBSC App 4200 Congress Avenue Lake Worth, FL 33461 561.868.3000 Translate the Site Web Accessibility Policy Download MyPBSC App 4200 Congress Avenue Lake Worth, FL 33461 561.868.3000 Translate the Site Web Accessibility Policy Site Index Jobs Campuses & Maps Consumer Disclosures Economic Security Report Public Records Internet Privacy SACSCOC Accreditation Notice of Nondiscrimination Harassment Policy Title IX © 2025 Palm Beach State College. All Rights Reserved. Tabbed navigation may not work if JavaScript is disabled JavaScript must be enabled in your browser in order to use some functions Feeds may not be working properly if JavaScript is not enabled Some functions may not work properly if Javascript isn't enabled Thumbnail photos will not show unless Javascript is enabled Photo gallery slideshow will not show unless Javascript is enabled JavaScript must be enabled in your browser in order to use some functions ©"
    },
    {
      "url": "https://redlightpb.com/about-us/",
      "text": "Red Light | West Palm Beach Speakeasy | About Us Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search 561-293-3034 Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us More Search 561-293-3034 The Secret Of Palm Beach Is Revealed Intimate and Exclusive Drinking, Dining & Entertainment About Red Light Palm Beach The Best Kept Secret in Palm Beach County O nce granted entry via a secret coded door, you’ll enter into a prohibition-era inspired bar where you’ll find a beautifully outfitted interior where every detail has been carefully considered. You’ll feel as if you’ve transported back to a different era as you explore the space, which is furnished with swanky chairs and fine details throughout. We take you back to a place in time where service was paramount and the bartenders knew your name and drink of choice before you are even seated. Red Light provides the perfect setting for a date, birthday party, special event, or a casual night with friends. We take great pride in our famous cuisine, which has been named as the “Best Fine Dining in Palm Beach County and West Palm Beach”. Our full menu is prepared fresh daily and made-to-order. Hand-cut steaks, fresh oysters, a fine selection of imported cheese, and in-house prepared sauces, are just a few of the amazing features you will find on our dinner menu. You can sip on an expertly crafted beverage while enjoying the sounds and atmosphere of times past. Each seasonal cocktail menu is the product of innovation, creativity, and care, boasting of fresh produce and house-made ingredients. Looking for a smoked Manhattan, cucumber martini, or French 75, look no further, Red Light has the spirits to enhance your night. Make a Reservation at Red Light Palm Beach Reservations Make Reservations - 21+ Red Light Palm Beach – Interior 8 Red Light Palm Beach – Interior 7 Red Light Palm Beach – Interior 5 Red Light Palm Beach – Interior 6 Red Light Palm Beach – Interior 4 Red Light Palm Beach – Interior 3 Red Light Palm Beach – Interior 2 Red Light Palm Beach – Interior 1 Red Light Palm Beach Palm Beach 75 Red Light Palm Beach Pom Rita Red Light Palm Beach Red Light Old Fashioned Highly recommend! We were looking for a speak easy and came across this gem. The ambiance was perfectly set with the lighting, live jazz, craft cocktails, mouth watering food and our amazing server Talia. She delivered exceptional service, catering to all our needs with such fun energy. She recommended the pork belly which was incredible then had the stuffed pork chop and the halibut for dinner which was so delicious. After dinner Julian recommended the chocolate chip bread pudding and it was to die for. Definitely will be back soon! Kimberly Wolters May 27, 2021 So fancy. Friendly staff. Love this place. Anna Lepeley March 8, 2021 This is a great location for that individual or couple that seeks that VIP feel and high end dining experience. I went on a Sunday when they feature comedians. The comedians were great and I will definitely be going back. Josh Velez February 15, 2021 Bobby Mac's comedy night was a blast. Funny comedians, great food, laughed till it hurt. Sunday Night at Red Light is my new spot. Michael J DeSuno November 16, 2020 The comedy show on Sunday’s is amazing Michael Panzeca November 16, 2020 Awesome new concept! Not too many places like this around and def not any this cool in South Florida. Live jazzy music and low sexy lighting creates the perfect ambience to discreetly let loose and enjoy yourself in comfort. The food and menu selection was great and the service was superb! Ask for Gemma, she sure is a gem 💎 Love this place, will definitely be frequenting often 😍 Amanda Tulucci Uys October 14, 2020 Food was amazing as always and the service was nothing short of being perfect. Danny Rodriguez October 12, 2020 What an experience. Red light is exactly what it is, a speakeasy. A hidden gem in plain sight, one might wonder the shenanigans you’re off to. But you’re enjoying a cocktail (or two) and a meal. The food is on a different level. The ambience puts you right back in the 1920’s in the most wonderful way. Date night, girls night, guys night, or just a night - Red Light is a wonderful escape from reality. Matthew Smidowicz October 10, 2020 Amazing food and ambiance! Can’t wait to go back with my friends for pom margaritas and dinner. Also had wonderful live jazz music! Holly Shivery October 5, 2020 The Red Light Palm Beach was an amazing experience. The ambiance was sultry, sophisticated and totally relaxing. The dim lights and luxurious\ndecor created the perfect place to unwind and\nindulge the senses while waiting for the feast\nfit for a king. The magnificent Tomahawk steak\narrived with the chef who sliced it to perfection.\nOur waiter Kyle new exactly how I wanted it\nPittsburgh style, very impressive! The Mac and\nCheese side was stocked with chunks of fresh\nLobster, Outrageous!  My guest had Alaskan\nKing Crab legs that were tender and delicious.\nDuring our meal we enjoyed music by saxophonist\nScott St John, great guy very entertaining. The staff\nRepeatedly visited our table to fulfill our every\ndesire. Overall a magnificent experience!\nThanks Joe B and the entire staff.\n\nResponse from the owner\n4 hours ago\nThank you Louis for this AWESOME review. Hope to see you again, soon. Luigi Russo October 5, 2020 It’s sexy everything about it. Great date place. Food is wonderful I worked on Wall Street we went everywhere and ate everything and drank too.  The steaks are as good if not better especially the presentation that Lugers or Morton fun smoky drinks and you get treated like a rock star! Carol Lizza September 25, 2020 Love this place ! Great vibe !\nFood was sooooo good def recommend the lamb chops ! Management and our waitress were super friendly and professional! See you again soon 🙂 Jovany Gio Black September 24, 2020 Red Light Of Palm Beach Red Light Of Palm Beach WE ARE A 21 AND UP VENUE 1000 North Congress Avenue West Palm Beach, Florida 33409 Thu-Sat: 7pm-11pm Sun: 8pm-11pm 561-293-3034 MAP & DIRECTIONS [+] © 2020 All Rights Reserved.  RedLightPB.com Red Light Palm Beach Is owned and operated by Monroe's of Palm Beach Facebook Instagram Mail Youtube"
    },
    {
      "url": "https://www.jadespapga.com/contact-us",
      "text": "Contact Jade Spa – Schedule Massage & Body Treatments Schedule An Appointment 561-475-6614 Home About Us Services View All Services Skincare Services Facials Anti-Aging Facials Beauty and Skincare Repair Kits Body Slimming Treatments Wax Services Laser Services Lash Services Contact Us Home About Us Services View All Services Skincare Services Facials Anti-Aging Facials Beauty and Skincare Repair Kits Body Slimming Treatments Wax Services Laser Services Lash Services Contact Us 561-475-6614 bobochow184@yahoo.com Request a Quote Contact Us Contact Us Home › Contact Us Leave Us A Message Contact Us First Name: * Last Name: * Email: * Phone Number: * Message: Schedule an Appointment Schedule An Appointment First Name: * Last Name: * Email: * Phone Number: * I Am Looking For: * Skincare Services Body Slimming Treatments Wax Services Laser Services Lash Services Other How we can help you?: * Skincare Services: Facial Nails Service MASSAGE SPA SERVICE: * Swedish Massage Couple Massage Deep-tissue massage Four Hands Massage Hot Stone Massage Combo Massage Foot Massage Body Scrub Jade Head Spa Additional Information: 9910 Fl A1A-Alt #707 Palm Beach Gardens, FL 33410 561-475-6614 bobochow184@yahoo.com Mon to Sat: 9:30 AM - 8:00 PM Sunday - By Appointment Only Home About Us Services Contact Us Accessibility Statement Cookie Policy Copyright © 2025 Jade Spa. All Rights Reserved. Site by By using our website, you agree to the use of cookies as described in our Cookie Policy Accept"
    },
    {
      "url": "https://redlightpb.com/contact/",
      "text": "Contact | Red Light of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search 561-293-3034 Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us More Search 561-293-3034 Feedback or Questions? Contact Red Light Palm Beach The staff & management of Red Light LOVE to hear feedback and will try to answer any questions our guests might have. Red Light of Palm Beach Address: 1000 North Congress Avenue West Palm Beach, Florida 33409, USA Phone: 561-293-3034 We're CLOSED at the moment, but you may still book a reservation for a future date. Red Light Palm Beach Hours: Monday - Wednesday Closed Thursday - Saturday 7:00 PM — 11:00 PM Sunday 8:00 PM — 11:00 PM Facebook Instagram Youtube Your Name * Your Email Address * Your Contact Phone # Questions or Comments * CAPTCHA Δ This iframe contains the logic required to handle Ajax powered Gravity Forms. Directions and Map 1000 North Congress Avenue West Palm Beach, Florida 33409 Tap To Open GoogleMaps Red Light Of Palm Beach Red Light Of Palm Beach WE ARE A 21 AND UP VENUE 1000 North Congress Avenue West Palm Beach, Florida 33409 Thu-Sat: 7pm-11pm Sun: 8pm-11pm 561-293-3034 MAP & DIRECTIONS [+] © 2020 All Rights Reserved.  RedLightPB.com Red Light Palm Beach Is owned and operated by Monroe's of Palm Beach Facebook Instagram Mail Youtube"
    },
    {
      "url": "https://www.gardensdermatology.com/red-light/",
      "text": "Red Light | Dermatologist In Palm Beach Gardens, FL | Gardens Dermatology & Cosmetic Surgery Center Meet Our Providers Our Services Medical Services Acne Actinic Keratosis/Pre-Skin Cancer Athletes Foot Birth-Marks Blu Light Therapy Cold Sores Contact Dermatitis / Allergy Ear Piercing Eczema Folliculitis Hair Loss Hemangiomas Hyperpigmentation Lichen Simplex Chronicus Moles Nail Disease Psoriasis Rashes Rosacea Seborrheic Dermatitis/Dandruff Seborrheic Keratoses Skin Cancer Tinea Versicolor Vitiligo Warts Wrinkles Surgical Services Esthetic Services Injectables & Cosmetic Fillers BOTOX® Cosmetic Dysport® Daxxify Juvederm Family of Fillers Restylane Family of Fillers Cosmetic Lasers Gentlelase Laser Hair Reduction Light Treatments Intense Pulse Light (IPL) Ear Piercing Plastic Surgery Esthetician Services Facials And Peels Microneedling Microneedling with Exosomes Hair Loss Solutions Patient Center Patient Portal New Patients Established Patients Maps and Directions Insurance Information Patient Satisfaction Survey Patient Education Cosmetics Hair Loss Infections & Infestations Precancers & Skin Cancers Skin Care Skin Conditions Skin Growths News & Events Blog Careers Contact Us Gardens Dermatology & Cosmetic Surgery Center Javascript must be enabled for the correct page display About Careers Shop Online Rewards Programs Alle Rewards Aspire Rewards Gardens Dermatology shop rewards Blu Light Therapy Hair Loss Solutions SkinCeuticals Before & After Gallery Plastic Surgery MedSpa Skincare Photos Patients Patient Portal Online Bill pay Contact Join Our Email List CALL NOW (561) 776-7041 About Careers Shop Online Rewards Programs Alle Rewards Aspire Rewards Gardens Dermatology shop rewards Blu Light Therapy Hair Loss Solutions SkinCeuticals Before & After Gallery Plastic Surgery MedSpa Skincare Photos Patients Patient Portal Online Bill pay Contact Join Our Email List Book Online Shop Skincare Your home for skin. Meet Our Providers Our Services Medical Services Acne Actinic Keratosis/Pre-Skin Cancer Athletes Foot Birth-Marks Blu Light Therapy Cold Sores Contact Dermatitis / Allergy Ear Piercing Eczema Folliculitis Hair Loss Hemangiomas Hyperpigmentation Lichen Simplex Chronicus Moles Nail Disease Psoriasis Rashes Rosacea Seborrheic Dermatitis/Dandruff Seborrheic Keratoses Skin Cancer Tinea Versicolor Vitiligo Warts Wrinkles Surgical Services Esthetic Services Injectables & Cosmetic Fillers BOTOX® Cosmetic Dysport® Daxxify Juvederm Family of Fillers Restylane Family of Fillers Cosmetic Lasers Gentlelase Laser Hair Reduction Light Treatments Intense Pulse Light (IPL) Ear Piercing Plastic Surgery Esthetician Services Facials And Peels Microneedling Microneedling with Exosomes Hair Loss Solutions Patient Center Patient Portal New Patients Established Patients Maps and Directions Insurance Information Patient Satisfaction Survey Patient Education Cosmetics Hair Loss Infections & Infestations Precancers & Skin Cancers Skin Care Skin Conditions Skin Growths News & Events Blog Careers Contact Us Call now (561) 776-7041 Contact Us Online Bill Pay Shop Online Search Search Gardens Dermatology & MedSpa in Palm Beach > Red Light Red Light Lasers and Lights Treatments Intense Pulse Light (IPL) Gentlelase Laser Hair Reduction Red Light Blue Light LED Red Light Therapy has\nemerged as a powerful tool in medical esthetician services, particularly for\nits anti-aging benefits. The process involves exposing the skin to low-level\nred light wavelengths, which are believed to penetrate the skin and stimulate\ncellular activity. This stimulation prompts an increase in collagen\nproduction, the essential protein responsible for maintaining skin elasticity\nand firmness. As a result, LED Red Light Therapy is an effective non-invasive treatment for reducing the appearance of fine\nlines and wrinkles, promoting a more youthful complexion. During an LED Red Light Therapy session,\nGardens Dermatology & Cosmetic Surgery Center patients lie down comfortably as\nthe esthetician positions the LED device at an optimal distance from the skin.\nThe treatment is painless and requires no downtime, making it a convenient\noption for those seeking anti-aging benefits without the commitment of\nrecovery periods. The therapeutic light penetrates the skin's surface,\nreaching the underlying layers and triggering biological responses that\nenhance the skin's natural processes. This process not only aids in reducing\nvisible signs of aging but also contributes to improved skin tone and texture. The outcomes of LED Red Light Therapy are often\nnotable, with many clients experiencing a visible reduction in fine lines,\nwrinkles, and overall skin rejuvenation. The collagen-boosting effects\ncontribute to a smoother and more youthful complexion over time. While\nimmediate results can be observed, a series of sessions is typically\nrecommended for optimal and long-lasting outcomes. LED Red Light Therapy stands\nout in esthetician services as a non-invasive, safe, and effective method for\ncombating signs of aging, offering clients a holistic approach to achieving a\nmore youthful and radiant appearance. Our Location Find us on the map -- mi Address 11030 RCA Center Dr., Suite 3015 Palm Beach Gardens, FL 33410-4276 Contact Information (561) 776-7041 (561) 776-7043 Hours of Operation Monday 8:30 AM - 5:00 PM Tuesday 8:30 AM - 5:00 PM Wednesday 8:30 AM - 5:00 PM Thursday 8:30 AM - 5:00 PM Friday 8:30 AM - 5:00 PM Saturday Closed Sunday Closed Monday 8:30 AM - 5:00 PM Tuesday 8:30 AM - 5:00 PM Wednesday 8:30 AM - 5:00 PM Thursday 8:30 AM - 5:00 PM Friday 8:30 AM - 5:00 PM Saturday Closed Sunday Closed Online Bill pay Patient Portal Shop Skincare Careers Hair Loss Solutions CoolSculpting Copyright © 2025 MH Sub I, LLC dba Officite Admin Log In Site Map"
    },
    {
      "url": "https://www.palmhouse.com/contact-us/",
      "text": "Contact Palm House | Reach Us for Bookings & Inquiries Rooms Palm King Rooms Signature King Rooms Grand Double Queen Room Premier King Rooms Summer Escape This season, enjoy Palm Beach at its most peaceful with our exclusive Summer Escape Package. Read More Suites Junior Suites Premier Bedroom Suites Premier Two Bedroom Suites Royal Palm Two Bedroom Suite Flagler One Bedroom Suite Presidential Suite Suite Life Reserve two nights or more in our luxury suites to receive up to 30% off. Reserve Food & Drink Dining Room Book a Table Menus Weekend Brunch Brunch is served in the Dining Room on Saturdays and Sundays from 10:30am - 3:00pm. View Menu Things to do Pool, Beach & Leisure Shopping Arts & Culture Water Adventures Family & Wildlife Experiences Golf & Parks Entertainment & Events Urban Exploration Nightlife & Evening Spa & Wellness Pool, Beach & Leisure Unwind by the pool or beach or take a leisurely bike ride along the scenic Lake Trail. Read more Meetings & Events Event Spaces Exclusive Use Get in Touch Nestled in the heart of Palm Beach, our event spaces are the perfect setting for impactful meetings and unforgettable events. Inquire Now Weddings & Celebrations Weddings Celebrations Palm House Weddings With lush gardens, inspiring spaces and impeccable service, our luxurious hotel will ensure your special day is as effortless as it is extraordinary. Inquire Now Offers Fall Escape Package Suite Life FL GA Resident Rate Honeymooner's Package Stay More Save More Advance Purchase AAA/AARP Rate Stay More Save More Stay with us for more than 4 consecutive nights and receive up to 20% off your room or suite. Blackout dates apply. Reserve Contact Us EN IT BOOK A ROOM BOOK A TABLE Arrival 05 September 2024 Find a reservation Departure 05 September 2024 No. of Guests 2 SPACER TEXT Adults 2 Children 0 Number of Rooms 1 SPACER TEXT Rooms 1 Promo code Book Now Book A Table a table at The Dining Room Palm King Rooms Signature King Rooms Grand Double Queen Room Premier King Rooms Summer Escape This season, enjoy Palm Beach at its most peaceful with our exclusive Summer Escape Package. Read More Junior Suites Premier Bedroom Suites Premier Two Bedroom Suites Royal Palm Two Bedroom Suite Flagler One Bedroom Suite Presidential Suite Suite Life Reserve two nights or more in our luxury suites to receive up to 30% off. Reserve Dining Room Book a Table Menus Weekend Brunch Brunch is served in the Dining Room on Saturdays and Sundays from 10:30am - 3:00pm. View Menu Pool, Beach & Leisure Shopping Arts & Culture Water Adventures Family & Wildlife Experiences Golf & Parks Entertainment & Events Urban Exploration Nightlife & Evening Spa & Wellness Pool, Beach & Leisure Unwind by the pool or beach or take a leisurely bike ride along the scenic Lake Trail. Read more Event Spaces Exclusive Use Get in Touch Nestled in the heart of Palm Beach, our event spaces are the perfect setting for impactful meetings and unforgettable events. Inquire Now Weddings Celebrations Palm House Weddings With lush gardens, inspiring spaces and impeccable service, our luxurious hotel will ensure your special day is as effortless as it is extraordinary. Inquire Now Fall Escape Package Suite Life FL GA Resident Rate Honeymooner's Package Stay More Save More Advance Purchase AAA/AARP Rate Stay More Save More Stay with us for more than 4 consecutive nights and receive up to 20% off your room or suite. Blackout dates apply. Reserve Rooms Suites Food & Drink Things to do Meetings & Events Weddings & Celebrations Offers Contact Us Book Now Rooms Suites Food & Drink Things to do Meetings & Events Weddings & Celebrations Offers Book Now Book Now EN IT Opening 27th November 2024 I would like to: Book a Room Book A Table  Dining Room } Number of Adults Number of Children Summary Adults 2 Children 0 Number of Rooms Number of Rooms Rooms 1 Check Availability Check Availability Contact Us Get in touch Palm House 160 Royal Palm Way, Palm Beach, Florida 33480, United States Tel: +1 561-858-1600 Connect With Us @palmhousehotel_ Palm House 160 Royal Palm Way, Palm Beach, Florida 33480, United States Tel: +1 561-858-1600 E: info@palmhouse.com Our Hotel About Us Concierge & Services FAQS Press & Media Press Awards Keep In Touch Contact Us Careers Newsletter sign up Legal Privacy Policy & Cookies Terms & Conditions Accessibility Statement Our Collection Chewton Glen Cliveden House The Lygon Arms The Mayfair Townhouse 11 Cadogan Gardens The Chelsea Townhouse Hotel Excelsior Venice Lido Resort Gran Marbella Resort & Beach Club © Palm House 2025 Website by 80 DAYS close Register interest By ticking the box you confirm that you would like to sign up to receive email updates from Palm House. Send"
    },
    {
      "url": "https://redlightpb.com/tv/",
      "text": "tv | Red Light of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search 561-293-3034 Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us More Search 561-293-3034 Home tv tv Red Light Of Palm Beach Red Light Of Palm Beach WE ARE A 21 AND UP VENUE 1000 North Congress Avenue West Palm Beach, Florida 33409 Thu-Sat: 7pm-11pm Sun: 8pm-11pm 561-293-3034 MAP & DIRECTIONS [+] © 2020 All Rights Reserved.  RedLightPB.com Red Light Palm Beach Is owned and operated by Monroe's of Palm Beach Facebook Instagram Mail Youtube"
    },
    {
      "url": "https://redlightpb.com/menu/",
      "text": "Menu | Red Light of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us Search 561-293-3034 Red Light Of Palm Beach Red Light Of Palm Beach Home Reservations Events Menus Dining Menu Cocktail Menu Wine & Spirits Menu About Us Find us More Search 561-293-3034 The Menu at Red Light of Palm Beach Quality dining is simply a devotion to seasonal, local produce and meticulous care in bringing it to life on the plate. At Red Light, the emphasis is on our fantastic dining menu and a truly social experience that extends beyond your expectations. Make Reservations Starters Steak Bruschetta 15 Peruvian Garlic & Herb Sauce, Aged \nManchego, Ciabatta Crostini Smoked Burrata Prosciutto 16 Sourdough Crostini, Cherry Tomatoes Charcuterie Board 27 Artisanal Cheeses, Selected Meats, Accoutrements Crab Cake Stack 21 Lump crab, avocado, mustard sauce, \nparmesan crisp Baked Brie 13 Cranberry Sauce, Ciabatta Crostini Philly Cheesesteak Eggrolls 14 Sweet & Spicy Chili Sauce, Honey Mustard Chicken Empanada 15 Avocado Aioli, Pico de Gallo Marinaded Pork Belly 16 Sweet Potato, Grape & Red Wine Reduction Ahi Tuna Tacos 16 Tuna Tartare, Avocado, Spicy Citrus Aioli Salads Heirloom Tomato Caprese 15 Mozzarella, Basil Pesto, Heirloom Tomatoes, Olive Oil, with Aged Balsamic Vinegar Iceberg Lettuce 12 Apple-Smoked Bacon Crumbles, Tomato, Blue Cheese Dressing Caesar Salad 11 Parmesan, Garlic Croutons, Anchovy-Garlic Dressing Make Reservations Entrees All Beef is Hand Selected & Hand Cut For Red Light Palm Beach Hand-Cut Filet Mignon 42 Chairman Reserve Center Cut Tenderloin Roasted Bone Marrow Chicken Souvlaki 24 Greek Salad, Tzatziki Sauce, Jasmine Rice, Pita Bread Cajun Seabass 38 Roasted Potatoes, Arugula Salad, Caper Vinaigrette Dressing Stuffed Pork Chop 32 Italian Sausage, Fresh Mozzarella, Spinach, Garlic Mashed Potatoes Eggplant Rollatini 26 Pan Fried Eggplant, Spiced Ricotta Cheese, Tomato Sauce, Garden Basil Rare Cold Red Center Med - Rare Warm Red Center Medium Pink Throughout Med - Well Slightly Pink Center Sides Creamed Spinach 12 Glazed Carrots 9 Parmesan Truffle Fries 12 Lime Roasted Corn 9 Crispy Brussel Sprouts 12 Mac & Cheese 13 Desserts Fried Cheesecake 12 Triple Layer Chocolate Cake 12 Key Lime Pie 12 Make Reservations * There is a risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood or have immune disorders you are at higher risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure, consult a physician. A $5 Entertainment Service Charge Has Been added To All Items. Red Light Of Palm Beach Red Light Of Palm Beach WE ARE A 21 AND UP VENUE 1000 North Congress Avenue West Palm Beach, Florida 33409 Thu-Sat: 7pm-11pm Sun: 8pm-11pm 561-293-3034 MAP & DIRECTIONS [+] © 2020 All Rights Reserved.  RedLightPB.com Red Light Palm Beach Is owned and operated by Monroe's of Palm Beach Facebook Instagram Mail Youtube"
    }
  ]
}