{
  "fuentes": [
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "3-col-bg@2x.jpg"
    },
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "bg-3@2x.jpg"
    },
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "content-image-overlay@2x.png"
    },
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "dynamix-logo-white@2x.png"
    },
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "map_marker@2x.png"
    },
    {
      "url": "https://www.carolina.renfestinfo.com/contact-us",
      "email": "reception@renfestinfo.com"
    },
    {
      "url": "https://www.carolina.renfestinfo.com/contact-us",
      "email": "tickets@renfestinfo.com"
    },
    {
      "url": "https://hotspotsmagazine.com/2025/02/23/the-florida-renaissance-festival-brings-patrons-back-in-time-again/",
      "email": "info@hotspots.lgbt"
    },
    {
      "url": "https://www.texrenfest.com/additional-options",
      "email": "3-col-bg@2x.jpg"
    },
    {
      "url": "https://www.texrenfest.com/additional-options",
      "email": "bg-3@2x.jpg"
    },
    {
      "url": "https://www.texrenfest.com/additional-options",
      "email": "content-image-overlay@2x.png"
    },
    {
      "url": "https://www.texrenfest.com/additional-options",
      "email": "dynamix-logo-white@2x.png"
    },
    {
      "url": "https://www.texrenfest.com/additional-options",
      "email": "map_marker@2x.png"
    },
    {
      "url": "https://www.linkedin.com/company/florida-renaissance-festival",
      "email": "christina@ren-fest.com"
    },
    {
      "url": "https://de.linkedin.com/company/florida-renaissance-festival",
      "email": "christina@ren-fest.com"
    },
    {
      "url": "https://www.texrenfest.com/news/introducing-the-tex-ren-fest-wedding-team",
      "email": "3-col-bg@2x.jpg"
    },
    {
      "url": "https://www.texrenfest.com/news/introducing-the-tex-ren-fest-wedding-team",
      "email": "bg-3@2x.jpg"
    },
    {
      "url": "https://www.texrenfest.com/news/introducing-the-tex-ren-fest-wedding-team",
      "email": "content-image-overlay@2x.png"
    },
    {
      "url": "https://www.texrenfest.com/news/introducing-the-tex-ren-fest-wedding-team",
      "email": "dynamix-logo-white@2x.png"
    },
    {
      "url": "https://www.texrenfest.com/news/introducing-the-tex-ren-fest-wedding-team",
      "email": "map_marker@2x.png"
    },
    {
      "url": "https://variety.com/2025/tv/obituaries-people-news/george-coulam-dead-ren-faire-1236406162/",
      "email": "obits@variety.com"
    },
    {
      "url": "https://www.fox26houston.com/news/todd-mission-death-investigation-texas-renaissance-festival-king-george-home",
      "email": "fox26houstonnews@foxtv.com"
    },
    {
      "url": "https://rennfest.com/phone-mailing-info/",
      "email": "carolyn@rennfest.com"
    },
    {
      "url": "https://rennfest.com/phone-mailing-info/",
      "email": "carolyn@rennfest.com"
    },
    {
      "url": "https://rennfest.com/phone-mailing-info/",
      "email": "info@rennfest.com"
    },
    {
      "url": "https://renfair.com/socal/join-us/",
      "email": "rpfmarketplace@renfair.com"
    },
    {
      "url": "https://bayarearenfest.com/",
      "email": "digitaldash@digitalarchitects.org"
    }
  ],
  "mails": [
    "3-col-bg@2x.jpg",
    "bg-3@2x.jpg",
    "carolyn@rennfest.com",
    "christina@ren-fest.com",
    "content-image-overlay@2x.png",
    "digitaldash@digitalarchitects.org",
    "dynamix-logo-white@2x.png",
    "fox26houstonnews@foxtv.com",
    "info@hotspots.lgbt",
    "info@rennfest.com",
    "map_marker@2x.png",
    "obits@variety.com",
    "reception@renfestinfo.com",
    "rpfmarketplace@renfair.com",
    "tickets@renfestinfo.com"
  ],
  "nombre_sitio": "ren-fest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.texrenfest.com/contact-us",
      "text": "Contact Us | Texas Renaissance Festival The Kingdom Directions, Parking, & Maps Themed Weekends Lockers Accessibility FAQ Lost and Found Newsletter Sign-Up Contact TRF Things To Do & Entertainment Entertainment Schedule Performers For Lords & Ladies (21+) For Families Guided Tours Survival Guide for Newbies Speak like a TRF Pro Where to Stay Camping at TRF Campground Map Campground Rules & FAQs Camping Passes Guilds Lodging Weddings & Events Weddings @ TRF Parties & Events Contact Weddings & Events Shops, Food, & Drinks Dragonslayer Gift Shop Shoppes Food & Drink Get Involved Become A Sponsor Cast Auditions For our Cast For our Vendors TRF Careers Media Media Pass Request Press Kit & Releases Podcast Tickets General Ticket Info Parking Passes Group Tickets Info Stay & Play Ticket Info Season Tickets Info Campground Ticket Info Liability Waiver Yes, We Donate Join us this year for our 51st Anniversary! Days Hrs Min Sec Sign Up For Our Newsletter Skip to main content Skip to footer Texas Renaissance Festival 21778 Farm to Market 1774 Todd Mission, Texas 77363 Varied The Kingdom Directions, Parking, & Maps Themed Weekends Lockers Accessibility FAQ Lost and Found Newsletter Sign-Up Contact TRF Things To Do & Entertainment Entertainment Schedule Performers For Lords & Ladies (21+) For Families Guided Tours Survival Guide for Newbies Speak like a TRF Pro Where to Stay Camping at TRF Campground Map Campground Rules & FAQs Camping Passes Guilds Lodging Weddings & Events Weddings @ TRF Parties & Events Contact Weddings & Events Shops, Food, & Drinks Dragonslayer Gift Shop Shoppes Food & Drink Get Involved Become A Sponsor Cast Auditions For our Cast For our Vendors TRF Careers Media Media Pass Request Press Kit & Releases Podcast Tickets General Ticket Info Parking Passes Group Tickets Info Stay & Play Ticket Info Season Tickets Info Campground Ticket Info Liability Waiver Yes, We Donate Information Contact Us Contact Name * Email * Choose your recipient * Select General Careers Message Submit Hidden website input Departments General Information & Management [email protected] Entertainment [email protected] Marketing / Public Relations [email protected] Group Sales / Group Events [email protected] Artists / Merchants / Food [email protected] Weddings and Events [email protected] Camping [email protected] Ticketing [email protected] Lost and Found [email protected] Bookkeeping [email protected] Newsletter Signup Want to be notified when an article is published? Enter your email address to be the first to know. Contact Email * Submit Hidden website input Facebook X (Twitter) YouTube Instagram Yelp Menu Contact Purchase Tickets Jobs Blog Media Terms and Conditions Refund Policy Information 281-356-2178 [email protected] Office Hours: 8 am - 5 pm Monday - Friday Festival Hours: 9 am - 8 pm (No Entry After 7 PM) Saturday, Sunday, Thanksgiving Friday Oct. 11 - Nov. 30, 2025 Location 21778 Farm to Market 1774 Todd Mission, TX 77363 Get Directions Thank You To Our Gold Level Sponsors Privacy Policy © 2025 Texas Renaissance Festival all rights reserved. Site Design By: Dynamix Web Design X Unsupported Browser You can use your current browser on Texrenfest.com but some functionality may not work fully. Texrenfest.com works best with the latest versions of Chrome , Firefox , or Microsoft Edge."
    },
    {
      "url": "https://www.carolina.renfestinfo.com/contact-us",
      "text": "Contact Us — Carolina Renaissance Festival 0 Skip to Content Home Tickets! Buy Tickets! Ticket Prices and Info The Hops! PubCrawl NEW!  VIP Joust Seating Season Passes Discounts for Groups Discounts for Organizations Coupons and Promotions Passport To History Engage and Win Plan Your Visit! Fast Facts Driving Directions Uber, Lyft and Taxis 2025 Village Map 2025 Entertainment Schedule Hotels in Lake Norman Hotels in Concord Hotels in North Charlotte Shows! Shop! Marketplace Listing Become a Vendor Play! Feast! Events! Special Event Weekends Weddings and Romance Private Parties Birthdays Learn More! About Us Contact Us Lost and Found! About Jousting About Falconry About Mermaids See More! Photo Gallery Video Gallery Employment! Festival Job Opportunities Job Faire Performer Auditions Performer Proposals Work for a Vendor Vendor Proposals Fundraising! Volunteer Fundraising Community Outreach Sponsorships! Español! Buy Tickets! Open Menu Close Menu Home Tickets! Buy Tickets! Ticket Prices and Info The Hops! PubCrawl NEW!  VIP Joust Seating Season Passes Discounts for Groups Discounts for Organizations Coupons and Promotions Passport To History Engage and Win Plan Your Visit! Fast Facts Driving Directions Uber, Lyft and Taxis 2025 Village Map 2025 Entertainment Schedule Hotels in Lake Norman Hotels in Concord Hotels in North Charlotte Shows! Shop! Marketplace Listing Become a Vendor Play! Feast! Events! Special Event Weekends Weddings and Romance Private Parties Birthdays Learn More! About Us Contact Us Lost and Found! About Jousting About Falconry About Mermaids See More! Photo Gallery Video Gallery Employment! Festival Job Opportunities Job Faire Performer Auditions Performer Proposals Work for a Vendor Vendor Proposals Fundraising! Volunteer Fundraising Community Outreach Sponsorships! Español! Buy Tickets! Open Menu Close Menu Home Folder: Tickets! Back Buy Tickets! Ticket Prices and Info The Hops! PubCrawl NEW!  VIP Joust Seating Season Passes Discounts for Groups Discounts for Organizations Coupons and Promotions Passport To History Engage and Win Folder: Plan Your Visit! Back Fast Facts Driving Directions Uber, Lyft and Taxis 2025 Village Map 2025 Entertainment Schedule Hotels in Lake Norman Hotels in Concord Hotels in North Charlotte Shows! Folder: Shop! Back Marketplace Listing Become a Vendor Play! Feast! Folder: Events! Back Special Event Weekends Weddings and Romance Private Parties Birthdays Folder: Learn More! Back About Us Contact Us Lost and Found! About Jousting About Falconry About Mermaids Folder: See More! Back Photo Gallery Video Gallery Folder: Employment! Back Festival Job Opportunities Job Faire Performer Auditions Performer Proposals Work for a Vendor Vendor Proposals Folder: Fundraising! Back Volunteer Fundraising Community Outreach Sponsorships! Español! Buy Tickets! Slide 1 Slide 1 (current slide) Slide 2 Slide 2 (current slide) Slide 3 Slide 3 (current slide) Slide 4 Slide 4 (current slide) Slide 5 Slide 5 (current slide) Slide 6 Slide 6 (current slide) Slide 7 Slide 7 (current slide) Slide 8 Slide 8 (current slide) Slide 9 Slide 9 (current slide) Slide 10 Slide 10 (current slide) Slide 11 Slide 11 (current slide) Do you have unanswered questions about the Festival? Complete the form to contact us and learn more! Name * First Name Last Name Email * Related Department * Click to select Tickets Advertising, Sponsorships, Press & Media Artisan Marketplace Games & Rides Food & Beverage Employment Weddings & Events Entertainment General Inquiry Subject * Message * Thank you!  Your submission has been sent.  Huzzah! Thank Thee To Our Valued Sponsors: Carolina Renaissance Festival: Saturdays & Sundays October 4th - November 23rd, 2025 Free Parking *  9:30 AM - 5:30 PM Open Rain or Shine * No Pets Please 16445 Poplar Tent Road Huntersville, NC 28078 (704) 896-5555 Helpful Links: Contact Us Press & Media Info for Performing Cast Lost & Found Connect & Win with Social! Connect & Win with email! Sign up below to receive our News of the Realm email newsletter which will include a limited available one-time-use discount coupon with promo code, news, and free ticket opportunities! Worried about being spammed?? Don’t fret! By order of Her Majesty only a limited number of newsletters are sent seasonally each year! Huzzah! First Name Last Name Email Address Sign Up We respect your privacy. Thank you!"
    },
    {
      "url": "https://hotspotsmagazine.com/2025/02/23/the-florida-renaissance-festival-brings-patrons-back-in-time-again/",
      "text": "The Florida Renaissance Festival Brings Patrons Back in Time Again | Hotspots Magazine Facebook Instagram Twitter Magazine South Florida: Current Issue Magazine Archives: 2024 Magazine Archives: 2023 Magazine Archives: 2022 Magazine Archives: 2021 Magazine Archives: 2020 Magazine Archives: 2019 What’s Hot South Florida’s Hot Entertainment Hotspots Hotties Hot Advice Hot Beats Hot Bodies Hot Eats Women Press Play Women’s Events Must See Must Read Must Watch Women’s History Month Articles Feature Stories Deep Inside Hollywood Discover Gay FL Queens We Love DJs We Love Photos TV Happening Out Television Network The Bobby Blair Show The FayWhat?! Show Queer News Tonight Queer God Squad Events About Hotspots! Events Monthly Events Art Gallery Opening Reception Pride Skate Nights Art Walk Wilton Manors Artists Showcase Annual Events Stonewall Pride Parade & Festival Black History Month Events The Cookout: Black History Month Pride On The Drive Women’s History Month HOTtopics: Town Hall Series (Quarterly) July 4th Fireworks Cruise PrideFête: An LGBTQ Caribbean Festival The South Florida Men’s Wellness Conference Taste of the Island Art HOTspots Art About HOTspots Art Art Walk Wilton Manors Sculpture Walk Art Gallery with Dennis Dean Classifieds About Join Us Contact Us Advertise Search 77.8 F Fort Lauderdale Advertise with Us Contact Us Facebook Instagram Twitter Sign in Welcome! Log into your account your username your password Forgot your password? Get help Privacy Policy Password recovery Recover your password your email A password will be e-mailed to you. Magazine South Florida: Current Issue Magazine Archives: 2024 Magazine Archives: 2023 Magazine Archives: 2022 Magazine Archives: 2021 Magazine Archives: 2020 Magazine Archives: 2019 What’s Hot South Florida’s Hot Entertainment Hotspots Hotties Hot Advice Hot Beats Hot Bodies Hot Eats Women Press Play Women’s Events Must See Must Read Must Watch Women’s History Month Articles Feature Stories Deep Inside Hollywood Discover Gay FL Queens We Love DJs We Love Photos Hot Shots PHOTOS: The 25th Annual Black Fort Lauderdale Festival at The Manor Hot Shots PHOTOS – PrideFête: An LGBTQ+ Caribbean Festival 2025 Hot Shots PHOTOS: 10th Annual FlockFest Beach Party Hot Shots PHOTOS: Lez Chic Monthly Brunch: May 2025 Hot Shots PHOTOS – Wilton Manors Stonewall Pride Parade & Street Festival 2025… TV Happening Out Television Network The Bobby Blair Show The FayWhat?! Show Queer News Tonight Queer God Squad Events About Hotspots! Events Monthly Events Art Gallery Opening Reception Pride Skate Nights Art Walk Wilton Manors Artists Showcase Annual Events Stonewall Pride Parade & Festival Black History Month Events The Cookout: Black History Month Pride On The Drive Women’s History Month HOTtopics: Town Hall Series (Quarterly) July 4th Fireworks Cruise PrideFête: An LGBTQ Caribbean Festival The South Florida Men’s Wellness Conference Taste of the Island Art HOTspots Art About HOTspots Art Art Walk Wilton Manors Sculpture Walk Art Gallery with Dennis Dean Classifieds About Join Us Contact Us Advertise Hotspots Magazine Home Features The Florida Renaissance Festival Brings Patrons Back in Time Again Features The Florida Renaissance Festival Brings Patrons Back in Time Again By Hotspots Magazine - February 23, 2025 464 Facebook Twitter Pinterest WhatsApp Advertisement All kings, queens, court ladies, knights, squires, jesters, and villagers are invited to the 33 rd annual Florida Renaissance Festival with six more weekends running through Mar. 23 at Quiet Waters Park in Deerfield Beach. Enter the gates of the kingdom as an elegant courtier, rebellious outlaw, or valiant knight, and dress the part with period attire such as tunics, broad-brimmed hats, puffy-sleeved shirts, lacy gowns, petticoats, cloaks, or aprons. Costumes are not required—but thousands wear historical clothing each year to immerse themselves into the true spirit of the Renaissance period where imaginations run wild and there’s fun for the entire family. The Florida Renaissance Festival is produced by nationally acclaimed Bobby Rodriguez Productions , a creator of entertaining and cultural experiences for adults and children alike. “For more than 30 years this festival has been a very unique event,” said Rodriguez. “It is one of the most anticipated happenings in South Florida, and each year it gets better with new and different activities and entertainment.” Guests can explore artisan markets, savor delicious foods, and immerse themselves in a world of merriment, shock, and surprise in any of the eight themed memorable weekends. What’s Old is New in 2025… Loud Mime Show – It’s an oxymoron, but this 2023 winner of the Carny Carnage Award at the Sideshow Hootenanny is a tongue in cheek comedy featuring superb juggling, death defying stunts, and a performer that grandma warned you about! The Hurdy Gurdy Guy – Dating back nearly a thousand years, Hurdy Gurdy is a form of entertainment not much seen in the U.S., until now. The star, Harry, plays music from the 12 th century to the present in a style learned from teachers in France and England. The headliner presents a unique sound you won’t want to miss, and he will answer questions to educate the audience about his unique instrument. Clan Tynker Circus – A troupe of brothers and sisters perform a stunning array of acts in this award-winning Vaudeville-style circus. Set to a live musical landscape, audiences will enjoy an amazing menagerie of entertainment that includes magic tricks, stilt walking, juggling skills, unicycling, sword swallowing, fire eating and more! The show also features an array of dangerous stunts, and a spectacular fire finale you won’t want to miss. Gaêlica – An international Celtic folk and world music trio, formed by Daniela Padrón (fiddle and vocals), also features Gabriel Figueira (bagpipes, woodwinds, percussion, vocals), and Rubén Gutiérrez (guitars, percussion, vocals). These entertainers have released five studio albums, were nominated for a Latin Grammy Award, and won five Pepsi Music Awards, including Best Folk Album. They have performed in the U.S., Europe, and Latin America captivating audiences with original compositions and traditional tunes. Krewes Korner – Raise the Jolly Roger, cannonball coming! This buccaneer is a professional Pirate impersonator with more than 15 years of experience. Feel as if you’re aboard a fantastic pirate ship in the high seas as this pirate brings history to life before your eyes. Edged Feather Experiences – Features Crystal “Cryss” Stacey a master class falconer and wildlife educator who has been training birds of prey for more than a decade, presenting more than 1,000 educational programs in nine states. Her birds are trained to fly totally untethered and prepared to show their unique natural behaviors and vastly different personalities! Piper Jones Band – This lyrical, high-energy duo base their music on the beautiful sounds of Highland bagpipes, accompanied by the unique percussion chords of the bouzouki. While featuring traditional tunes from Ireland, Scotland, and the inter-Celtic world, the duo features songs and audience interaction as they perform instrumental compositions and historical dance music in a unique and authentic style. The Flaming Ginger, Jon Norton – This fast-paced, family-friendly fire danger comedy show will thrill the audience and keep you on the edge of your seats! Be amazed as Norton juggles fire while riding seven-foot unicycles and quips non-stop jokes along the way. The Byrne Brothers – From Donegal, Ireland these brothers are a multi award-winning family band taking the Irish American scene by storm! The band consists of Luca on accordion, Finn on banjo, mandolin, and guitar, Dempsey on bodhran and whistle, and their father Tommy on uilleann pipes, fiddle, guitar, and grade 1 bagpiper. Enjoy their electrifying and high-energy performance that showcases modern traditional Irish music and world-class Irish dancing. There will also be a new activity called the Gear Garden Gem Mining Co . where guests can find rare and breathtaking gems in our one-of-a-kind gem mining area. Guests will purchase a 5 or 10-pound bag and have an opportunity to pan for hidden treasures they get to bring home. A special key will help identify the gems and more details about each one. *For those that have frequented the Festival in the past, the Biergarten is now known as The Gear Garden featuring an all-new pub, stage, soda booth, and the Gear Garden Gem Mining Co . Florida Renaissance Festival 2025 Themed Weekends Weekend Four: Feb. 22-23 – Peg Legs and Polly’s – Part of the Ship, Part of the Crew Weekend Five: March 1-2 – Marketplace Mayhem – Shopeth ‘till you Dropeth! Weekend Six: March 8-9 – Gears and Gadgets – The Lost Inventions of DaVinci Weekend Seven: March 15-16 – Gaelic Legends: Tales of the Blarney Stone Weekend Eight: March 22-23 – Enchanted Extravaganza: Characters on the Loose Admission to the festival is $37 for adults, and $15 for children (kids under 5 years old are free). Kids 11 and under get in free of charge for the first weekend only but still must pay the county park fee of $1.50. Purchase a 2025 Season Pass Perk online and save 50% off a single day admission ticket. Season pass perks include a special commemorative pin in celebration of the 33 rd annual festival, $12 VIP parking, express lane for entrance and express lanes at all major pubs, VIP seating for at the joust arena, access to an exclusive VIP rest area, special gifts and discount food coupons that can be picked up at the box office – plus much more! VIP parking will be available for purchase Online and In-Person. Guests MUST show their Season Pass purchase. Separately, we offer a $3 active military and senior discount, they cannot be combined. For tickets and more information visit: www.ren-fest.com . Hotspots Magazine See Full Bio Facebook Twitter Pinterest WhatsApp Previous article LGBTQ Arts Funding Devastated With 32 Million DeSantis Cut Including 2.5 Million In Broward Next article Laverne Cox Stands Strong: “I Refuse to Be a Victim” Hotspots Magazine RELATED ARTICLES MORE FROM AUTHOR Queer News Tonight Trans Flag Creator Monica Helms Plans to Flee U.S. Amid Rising Persecution Queer News Tonight Compass Earns Triple Nod at Nonprofit Awards Queer News Tonight LGBTQ+ Pilgrims Make Historic Jubilee Walk at Vatican Queer News Tonight Meet the 10 Wealthiest Out LGBTQ+ Billionaires Queer News Tonight Breathing While Black & Trans Launches in Miami, Uplifting Voices and Stories Queer News Tonight Palm Springs Lost White Party Now The Dinah. What Does It Mean For Big LGBTQ Events? Advertisement ABOUT US © HOTspots Happening Out - Non-Profit (501c3) LGBTQ+ Media Network  \r\n2025 - Privacy Policy - Hotspots Magazine Contact us: info@hotspots.lgbt FOLLOW US Facebook Instagram Twitter © Hotspots! - Copyright 2024 - By 7Elements Web Design This website uses cookies to ensure you get the best experience on our website. Yes, I accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT MORE STORIES BOSFL Pool Party Returns to Grand Resort, September 13 Happening Out Television Network - September 10, 2025 Go to mobile version"
    },
    {
      "url": "https://www.texrenfest.com/additional-options",
      "text": "Enchanting Entertainment, Adventures & Attractions | Texas Renaissance Festival The Kingdom Directions, Parking, & Maps Themed Weekends Lockers Accessibility FAQ Lost and Found Newsletter Sign-Up Contact TRF Things To Do & Entertainment Entertainment Schedule Performers For Lords & Ladies (21+) For Families Guided Tours Survival Guide for Newbies Speak like a TRF Pro Where to Stay Camping at TRF Campground Map Campground Rules & FAQs Camping Passes Guilds Lodging Weddings & Events Weddings @ TRF Parties & Events Contact Weddings & Events Shops, Food, & Drinks Dragonslayer Gift Shop Shoppes Food & Drink Get Involved Become A Sponsor Cast Auditions For our Cast For our Vendors TRF Careers Media Media Pass Request Press Kit & Releases Podcast Tickets General Ticket Info Parking Passes Group Tickets Info Stay & Play Ticket Info Season Tickets Info Campground Ticket Info Liability Waiver Yes, We Donate Join us this year for our 51st Anniversary! Days Hrs Min Sec Sign Up For Our Newsletter Skip to main content Skip to footer Texas Renaissance Festival 21778 Farm to Market 1774 Todd Mission, Texas 77363 Varied The Kingdom Directions, Parking, & Maps Themed Weekends Lockers Accessibility FAQ Lost and Found Newsletter Sign-Up Contact TRF Things To Do & Entertainment Entertainment Schedule Performers For Lords & Ladies (21+) For Families Guided Tours Survival Guide for Newbies Speak like a TRF Pro Where to Stay Camping at TRF Campground Map Campground Rules & FAQs Camping Passes Guilds Lodging Weddings & Events Weddings @ TRF Parties & Events Contact Weddings & Events Shops, Food, & Drinks Dragonslayer Gift Shop Shoppes Food & Drink Get Involved Become A Sponsor Cast Auditions For our Cast For our Vendors TRF Careers Media Media Pass Request Press Kit & Releases Podcast Tickets General Ticket Info Parking Passes Group Tickets Info Stay & Play Ticket Info Season Tickets Info Campground Ticket Info Liability Waiver Yes, We Donate Join Us this year for our 51st Annual Texas Renaissance  Festival! Tickets On Sale Now! Weekends, October 11th through November 30th and Thanksgiving Friday Huzzah and welcome to the Texas Renaissance Festival, a grand spectacle that transports visitors to an era of chivalry, merriment, and enchantment. Nestled in the heart of Texas, we are the largest and most acclaimed Renaissance-themed attraction in the United States. Whether one is donned in period garb or simply a curious spectator in one's favorite tee shirt and jeans, the Texas Renaissance Festival promises an unforgettable journey into the magic and splendor of the Renaissance era. 2025 Dates: Weekends, October 11th through November 30th and Thanksgiving Friday Oct 11-12 Oct 18-19 Oct 25-26 Nov 1-2 Nov 8-9 Nov 15-16 Nov 22-23 Nov 28-30 Oktoberfest 1001 Dreams All Hallows Eve Pirate Adventure Heroes and Villains Barbarian Invasion Highland Fling Celtic Christmas Prev Next Themed Weekends Oktoberfest Journey back in time to old Bavaria as the King and Queen open the Festival season with a celebration of the best of the wurst (and the bier )! Show off your lederhosen in our daily costume contest or participate in our bratwurst eating contest! October 11 (Saturday) and 12 (Sunday) 1001 Dreams Faeries, elves and other fanciful creatures bring enchantment to the lanes of New Market Village. Show off your magical finery in the fantasy costume contest or test your endurance in the fiery dragon-wing eating contest. October 18 (Saturday) and 19 (Sunday) All Hallows Eve Ghoulies and ghosties arrive for some scary good when the Kingdom welcomes the Transylvanian court. Enter our Halloween costume contest or the Kettle Korn eating contest for a chance to win some \"spook-tacular\" prizes. October 25 (Saturday) and 26 (Sunday) Pirate Adventure Avast, Ye Hearties! Heave to and come ashore for the most piratical party on the seven seas. Show off your best buccaneer frock in the Best Dressed Pirate contest and try your luck at the Fish-N-Chips eating contest. November 1 (Saturday) and November 2 (Sunday) Heroes and Villains The mightiest heroes and heroines clash with the darkest of villains and vixens from history and legend. Show off your alter ego in the Heroes and Villains costume contest. If your superpower is eating, accept the challenge of winning the gyro eating contest. November 8 (Saturday) and 9 (Sunday) Barbarian Invasion Join the Great Horde and feast, drink, and plunder your way through the village during this barbaric rumpus.  Are you the worst dressed barbarian around? Prove it by joining our costume contest! November 15 (Saturday) and 16 (Sunday) Highland Fling Lads and lassies- the pipes are calling you to a celebration of the joys of Scotland. Witness the thrill of the Highland games, show of your Scotish finery in the Bonnie Knees contest, and see if you have the misneach (courage) to participate in the haggis eating contest. November 22 (Saturday) and 23 (Sunday) Celtic Christmas Father Christmas, Mother Christmas, and all the Christmas elves welcome children of all ages to our final three-day celebration of the coming Yule-tide season. The Kingdom is transformed into a Christmas wonderland and holiday music fills the lanes. Find the perfect gifts for everyone on your list in our over 400 shoppes. There's also a holiday costume contest and the pumpkin pie eating contest to add to your Christmas cheer. Father Christmas will be available for kids of all ages during the final three-day weekend. He will be up front near the festival entrance on Friday, Saturday and Sunday on Celtic Christmas weekend throughout the day. Visitors can choose to sit on Father Christmas' lap, or near him. Whichever makes you more comfortable. November 28 (Friday), 29 (Saturday), and 30 (Sunday) 70 Acres of Land 200+ Acres of Camping Facilities 500,000+ Guests Annually 1974 Since 21 Stages 400+ On-Site Shops Nation's Largest Entertainment Families Friends Groups Weddings Entertainment Enchanting Entertainment Thrill to the charge of knights jousting on their mighty steeds. Fall under the spell of magic and merriment. Laugh and be amazed at the clowns, jugglers, acrobats, and magicians performing on stages throughout the village. Watch with excitement as birds of prey soar through the air. Stay to dark and delight in the fire show and Royal Fireworks every festival evening! The Texas Renaissance Festival is proud to host world renowned performers on the many stages located throughout the festival. - Fun for Kids & Families The Texas Renaissance Festival is a magical place for family fun and entertainment. Try your skills at the archery, axe throwing or Jacob's ladder. Take a ride on the swings in the Enchanted Forest or take a spin on the DaVinci Flying Machines. After you've taken in the Fire Whip Show or the Great Rondini, get yourself a turkey leg and a lemonade while you walk around and browse the shoppes. Lots of neat shops, awesome performances, and good food/drinks. I've been to a few renaissance festivals and I would say this was one of my favorites for sure. -Nathan Wiles Friends I love coming to the faire with friends, and making new friends. TRF is my second home and my faire family is amazing! -Chip Ware, Houston Groups Experience an exciting group outing like no other. Groups will enjoy strolling the cobblestone paths of our authentic 55-acre 16th century village, visiting more than 400 shoppes featuring unique arts and crafts, foods from many cultures, games of skill, and a variety of human-powered rides. In addition, hundreds of costumed characters are there to entertain your party with over 200 performances daily. Each of our eight themed weekends brings a new adventure for your group, offering unique programs, activities, and more! This was the first event in nearly six years where I did not have to raise one finger to help. From the time we walked into the area Maw and Pa greeted us with the delicious food and hospitality. Out of the blue, the cast of characters from Alice in Wonderland and Peter Pan descended into our area to liven our group up which we felt was over the top and much appreciated by everyone. -Toby Lee, HARC Fairy Tale Weddings The King and Queen invite you to have your fairy tale wedding at the Texas Renaissance Festival . Create the royal wedding of your dreams in 16th century-style within the walls of our charming English Village. Get swept away with one of our exclusive wedding packages designed to enhance the romance and magic of your wedding day! The atmosphere was most enjoyable, when everything is put together I can't think of another service that out does the Texas renaissance festival weddings. It was a perfect day. -Marcus Moreno Newsletter Signup Want to be notified when an article is published? Enter your email address to be the first to know. Contact Email * Submit Hidden website input Facebook X (Twitter) YouTube Instagram Yelp Menu Contact Purchase Tickets Jobs Blog Media Terms and Conditions Refund Policy Information 281-356-2178 [email protected] Office Hours: 8 am - 5 pm Monday - Friday Festival Hours: 9 am - 8 pm (No Entry After 7 PM) Saturday, Sunday, Thanksgiving Friday Oct. 11 - Nov. 30, 2025 Location 21778 Farm to Market 1774 Todd Mission, TX 77363 Get Directions Thank You To Our Gold Level Sponsors Privacy Policy © 2025 Texas Renaissance Festival all rights reserved. Site Design By: Dynamix Web Design X Unsupported Browser You can use your current browser on Texrenfest.com but some functionality may not work fully. Texrenfest.com works best with the latest versions of Chrome , Firefox , or Microsoft Edge."
    },
    {
      "url": "https://www.linkedin.com/company/florida-renaissance-festival",
      "text": "Florida Renaissance Festival | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Florida Renaissance Festival Entertainment Providers Ft. Lauderdale, FL 336 followers Come Experience the Wonders of Imagination! Follow Discover all 25 employees Report this company About us Celebrating 500 years of fun in a single day!  The Florida Renaissance Festival is an event the whole family can enjoy—featuring live performances, reenactments, jousting, games, an artisan village, and more!\n\nHeld annually since 1991, the festival typically runs between the months of February and March and is open on weekends, from 10 a.m. to sunset, in Quiet Waters Park in Deerfield Beach, FL.\n\nTickets can be pre-ordered or purchased at the gate.  All major credit cards accepted, and ATMs are available on site.\n\nThe Florida Renaissance Festival is produced by the nationally award-winning Bobby Rodriguez Productions, operating in South Florida since 1981.  For more information, visit www.ren-fest.com. Website http://www.ren-fest.com External link for Florida Renaissance Festival Industry Entertainment Providers Company size 2-10 employees Headquarters Ft. Lauderdale, FL Type Privately Held Founded 1992 Locations Primary FESTIVAL HEADQUARTERS 800 NW 57th PL Ft. Lauderdale, FL 33309, US Get directions 401 S Powerline Rd Deerfield Beach, Florida 33442, US Get directions Employees at Florida Renaissance Festival Bobby Rodriguez Certified Festival & Events Executive (CFEE) Patti Amor Office Manager at New Design Dental Assoicates Dave Kaiser Entertainment Staff at Colorado Renaisance Aaron Grinnell Artist, Innovator, Team Lead, Coach, Specialist See all employees Updates Florida Renaissance Festival 336 followers 2mo Report this post We're #hiring a new Administrative Associate in Fort Lauderdale, Florida. Apply today or share this post with your network. Administrative Associate Florida Renaissance Festival, Fort Lauderdale, FL 3 1 Comment Like Comment Share Florida Renaissance Festival 336 followers 2mo Edited Report this post We’re Growing – Join Our Team! 🎉 \n\nThe Florida Renaissance Festival is expanding, and we’re on the lookout for talented professionals to join our Administrative team.\nIf you want to be part of a fast-paced, dynamic, and fun company, we want to hear from you!\n\n📌 Apply now and become a part of our exciting journey: https://lnkd.in/eu8RYDUd #NowHiring #JobsEvent #SouthFloridaJobs #EventJobs #AdministrativeJobs #JoinOurTeam #hiring #career Administrative Associate Florida Renaissance Festival, Fort Lauderdale, FL Like Comment Share Florida Renaissance Festival 336 followers 2mo Report this post We’re Growing – Join Our Team! 🎉 \n\nThe Florida Renaissance Festival is expanding, and we’re on the lookout for talented professionals to join our Administrative team. If you want to be part of a fast-paced, dynamic, and fun company, we want to hear from you!\n\n📌 Apply now and become a part of our exciting journey: https://lnkd.in/e652Q4Nk #NowHiring #JobsEvent #SouthFloridaJobs #EventJobs #AdministrativeJobs #JoinOurTeam #hiring #career Administrative Associate Florida Renaissance Festival, Fort Lauderdale, FL 1 Like Comment Share Florida Renaissance Festival 336 followers 2mo Edited Report this post 🎉 Congratulations, Kelly-Christina Santi, M.S.M. !🎉\n\nWe are incredibly proud to share that our Administrative Director, Christina, has been honored with the prestigious 2025 Emerging Leader Award from Greater Miami Festivals and Events Association ! 🏆\nThis award is a testament to her outstanding dedication, talent, and impact in the industry and at the Florida Renaissance Festival . She consistently brings excellence, innovation, and heart to everything she does, and we are thrilled to see that recognized on such a distinguished platform.\n\nPlease join us in celebrating this amazing achievement and congratulating Christina on this well-deserved honor!\n\nPhoto Credits: MasterWing Creative Agency #GMFEA #EventsConference #FlaRF #AwardWinner #Congratulations #Leadership #Excellence #ProudMoment #FloridaRenaissanceFestival 15 4 Comments Like Comment Share Florida Renaissance Festival 336 followers 2mo Edited Report this post We’re Growing – Join Our Team! 🎉 \n\nThe Florida Renaissance Festival is expanding, and we’re on the lookout for talented professionals to join our Administrative team.\nIf you want to be part of a fast-paced, dynamic, and fun company, we want to hear from you!\n\n📌 Apply now and become a part of our exciting journey: https://lnkd.in/eXv-9R44 You may also send your resume to christina@ren-fest.com . #NowHiring #JobsEvent #SouthFloridaJobs #EventJobs #AdministrativeJobs #JoinOurTeam #hiring #career Florida Renaissance Festival Jobs and Careers indeed.com 9 1 Comment Like Comment Share Florida Renaissance Festival 336 followers 5mo Report this post We’re thrilled to share that the Florida Renaissance Festival has been awarded “Most Onsite Sales” by our amazing platform and application partner, Eventeny ! 🏆✨\n \nThis recognition celebrates the incredible support from everyone who steps into our world each season. Thank you to Eventeny for being our trusted platform and application partner, and for helping us bring this festival to life!\n \nHere’s to more seasons of enchantment, creativity, and community! 💫 #wondersofimagination #eventeny #beyondthecastlegates #whereadventurefindsyou #flarf2025 26 3 Comments Like Comment Share Florida Renaissance Festival 336 followers 5mo Report this post 🏆✨ A standing ovation for our 2025 Florida Renaissance Festival Award Winners! ✨🏆\n\nThese honors highlighted those who excelled — from mouthwatering bites and unforgettable artistry to magnetic personalities and behind-the-scenes heroes. These incredible individuals brought magic to life and made this season truly legendary. 🙌\n\nTo all the participants who took part in this year’s festival — your presence, passion, and craft made the realm shine brighter. Thank you to all the patrons who took the time to vote. We thank thee most heartily!\n\n🏆 Best Original Product\nWinner: Oveja Negra Design\n\n🍽️ Top Taste Award\nWinner: Smoke Stacks House of BBQ\n\n📣 Best Hawking Award\nWinner: Ricardo Garcia\n\n⚔️ Best Demonstration Award\nWinner: The Ottoman Empire\n\n🎨 Best Booth Set-Up Award\nWinner: Antoine Birdsong Originals\n\n👑 Premier Character Award\nWinner: Carol Black\n\n🛡️ Loyalty Award\nWinner: Jon Angell\n\n🌟 Best Overall Vendor Award\nWinner: A New World Henna\n\n🎭 Patron’s Favorite Vendor Award\nWinner: Historical Glassworks\n\n🧰 Unsung Hero Award\nWinner: Willie Rodriguez +5 11 4 Comments Like Comment Share Florida Renaissance Festival 336 followers 11mo Report this post The Florida Renaissance Festival is looking for a team of dedicated and skilled individuals to join our Art Department for the upcoming 2025 season! You will help us craft a unique and unforgettable experience for all guests who pass through our castle gates.\n \nIf you’re an artist/painter, stage designer, carpenter, have prop experience, seamstress/seamster, have experience working in stagecraft or other similar theater skills, and are interested in getting involved in the Florida Renaissance Festival, now is your chance!\n \nTHESE ARE PAID POSITIONS\n \nApply to the link below with your skill set/preferred position, contact information, and resumé or list of professional experience. https://shorturl.at/iRjFt Dates Needed: \nJanuary 7th, 2025 - January 31st, 2025\nMarch 24th, 2025 - April 4th, 2025\n \nHaving a team of like-minded individuals with a vast array of design capabilities allows us to fabricate spectacular projects and provide a more crafted experience to our guests. The Florida Renaissance Festival is preparing for its 33rd anniversary season, and it is our goal to present our guests with a village filled with magic, fantasy, and imagination.\n \nPlease, come be a part of our festival family!\n \nComment below or DM us with any questions or concerns! #jobapplication #southfloridaart #flarf2025 #FestivalFun #whereadventurefindsyou #renaissance #festivalfun #southflorida #jobapplications #southfloridaartists #callingallartists #renaissancefestival #enchantedmoments #familyfun #wondersofimagination #beyondthecastlegates 7 Like Comment Share Florida Renaissance Festival 336 followers 12mo Report this post Become Part of The Magic...\nThe Florida Renaissance Festival is now seeking actors, performers, and characters interested in becoming a member of our 2025 festival entertainment cast!\n\nIf you’re an aspiring entertainer looking to get involved with the festival (be one of our roaming street characters, part of The Royal Court, or a member of our beloved village promenade), this is your chance to shine!\n \nCLICK LINK TO APPLY NOW - https://shorturl.at/DBnvX Requirements For Application Submission\n\t• First & Last Name\n\t• Phone Number\n\t• Email Address\n\t• Photo/Headshot\n\t• Current Acting Résumé/Portfolio\n\nRequirements For Audition\n\t• Two One-minute Monologues (Any Genres)\n\t• 16 Bars of Any Song (You Will Be Signing Acapella)\n\nActors Must have Weekend Availability and flexible schedules. Only actors 16 or older will be considered without a parent accompanying them.\n\nIt’s important to us that you commit to the process - the dates of the event being: \nFebruary 1st through March 23rd, 2025, (weekends only)\nLocated at Quiet Waters Park in Deerfield Beach, FL.\n\nThe Florida Renaissance Festival is preparing for its 33rd season, and inside it, is a village filled with loving and talented people that help to create a world of magic. Please, come be a part of our festival family! Don’t miss out on this amazing opportunity to be part of something truly extraordinary! 3 Like Comment Share Join now to see what you are missing Find people you know at Florida Renaissance Festival Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Arc Broward Individual and Family Services Sunrise, FL Space Coast Credit Union Banking Melbourne, FL VISUAL ADJECTIVES SEEDS INC Broadcast Media Production and Distribution Delray Beach, Florida Lady of the Lakes Renaissance Faire Civic and Social Organizations The Original Renaissance Pleasure Faire Entertainment Providers Irwindale, California Rotary Club Of Fort Lauderdale Civic and Social Organizations Fort Lauderdale, Florida Greater Miami Festivals and Events Association Events Services North Miami, Florida Blue Pack Marketing Advertising Services Clayton, North Carolina Periodic Vending Solutions, Inc. Facilities Services City of Boca Raton Economic Development Government Administration Boca Raton, Florida Show more similar pages Show fewer similar pages Browse jobs Account Executive jobs 71,457 open jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Florida Renaissance Festival Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://de.linkedin.com/company/florida-renaissance-festival",
      "text": "Florida Renaissance Festival | LinkedIn Weiter zum Hauptinhalt LinkedIn Artikel Personen E-Learning Jobs Spiele Mitglied werden Einloggen Florida Renaissance Festival Entertainment-Anbieter Ft. Lauderdale, FL 336 Follower:innen Come Experience the Wonders of Imagination! Folgen alle 25 Mitarbeiter:innen anzeigen Dieses Unternehmen melden Info Celebrating 500 years of fun in a single day!  The Florida Renaissance Festival is an event the whole family can enjoy—featuring live performances, reenactments, jousting, games, an artisan village, and more!\n\nHeld annually since 1991, the festival typically runs between the months of February and March and is open on weekends, from 10 a.m. to sunset, in Quiet Waters Park in Deerfield Beach, FL.\n\nTickets can be pre-ordered or purchased at the gate.  All major credit cards accepted, and ATMs are available on site.\n\nThe Florida Renaissance Festival is produced by the nationally award-winning Bobby Rodriguez Productions, operating in South Florida since 1981.  For more information, visit www.ren-fest.com. Website http://www.ren-fest.com Externer Link zu Florida Renaissance Festival Branche Entertainment-Anbieter Größe 2–10 Beschäftigte Hauptsitz Ft. Lauderdale, FL Art Privatunternehmen Gegründet 1992 Orte Primär FESTIVAL HEADQUARTERS 800 NW 57th PL Ft. Lauderdale, FL 33309, US Wegbeschreibung 401 S Powerline Rd Deerfield Beach, Florida 33442, US Wegbeschreibung Beschäftigte von Florida Renaissance Festival Bobby Rodriguez Certified Festival & Events Executive (CFEE) Patti Amor Office Manager at New Design Dental Assoicates Dave Kaiser Entertainment Staff at Colorado Renaisance Aaron Grinnell Artist, Innovator, Team Lead, Coach, Specialist Alle Beschäftigten anzeigen Updates Florida Renaissance Festival 336 Follower:innen 2 Monate Diesen Beitrag melden We're #hiring a new Administrative Associate in Fort Lauderdale, Florida. Apply today or share this post with your network. Administrative Associate Florida Renaissance Festival, Fort Lauderdale, Florida, Vereinigte Staaten von Amerika 3 1 Kommentar Gefällt mir Kommentieren Teilen Florida Renaissance Festival 336 Follower:innen 2 Monate Bearbeitet Diesen Beitrag melden We’re Growing – Join Our Team! 🎉 \n\nThe Florida Renaissance Festival is expanding, and we’re on the lookout for talented professionals to join our Administrative team.\nIf you want to be part of a fast-paced, dynamic, and fun company, we want to hear from you!\n\n📌 Apply now and become a part of our exciting journey: https://lnkd.in/eu8RYDUd #NowHiring #JobsEvent #SouthFloridaJobs #EventJobs #AdministrativeJobs #JoinOurTeam #hiring #career Administrative Associate Florida Renaissance Festival, Fort Lauderdale, Florida, Vereinigte Staaten von Amerika Gefällt mir Kommentieren Teilen Florida Renaissance Festival 336 Follower:innen 2 Monate Diesen Beitrag melden We’re Growing – Join Our Team! 🎉 \n\nThe Florida Renaissance Festival is expanding, and we’re on the lookout for talented professionals to join our Administrative team. If you want to be part of a fast-paced, dynamic, and fun company, we want to hear from you!\n\n📌 Apply now and become a part of our exciting journey: https://lnkd.in/e652Q4Nk #NowHiring #JobsEvent #SouthFloridaJobs #EventJobs #AdministrativeJobs #JoinOurTeam #hiring #career Administrative Associate Florida Renaissance Festival, Fort Lauderdale, Florida, Vereinigte Staaten von Amerika 1 Gefällt mir Kommentieren Teilen Florida Renaissance Festival 336 Follower:innen 2 Monate Bearbeitet Diesen Beitrag melden 🎉 Congratulations, Kelly-Christina Santi, M.S.M. !🎉\n\nWe are incredibly proud to share that our Administrative Director, Christina, has been honored with the prestigious 2025 Emerging Leader Award from Greater Miami Festivals and Events Association ! 🏆\nThis award is a testament to her outstanding dedication, talent, and impact in the industry and at the Florida Renaissance Festival . She consistently brings excellence, innovation, and heart to everything she does, and we are thrilled to see that recognized on such a distinguished platform.\n\nPlease join us in celebrating this amazing achievement and congratulating Christina on this well-deserved honor!\n\nPhoto Credits: MasterWing Creative Agency #GMFEA #EventsConference #FlaRF #AwardWinner #Congratulations #Leadership #Excellence #ProudMoment #FloridaRenaissanceFestival 15 4 Kommentare Gefällt mir Kommentieren Teilen Florida Renaissance Festival 336 Follower:innen 2 Monate Bearbeitet Diesen Beitrag melden We’re Growing – Join Our Team! 🎉 \n\nThe Florida Renaissance Festival is expanding, and we’re on the lookout for talented professionals to join our Administrative team.\nIf you want to be part of a fast-paced, dynamic, and fun company, we want to hear from you!\n\n📌 Apply now and become a part of our exciting journey: https://lnkd.in/eXv-9R44 You may also send your resume to christina@ren-fest.com . #NowHiring #JobsEvent #SouthFloridaJobs #EventJobs #AdministrativeJobs #JoinOurTeam #hiring #career Florida Renaissance Festival Jobs and Careers indeed.com 9 1 Kommentar Gefällt mir Kommentieren Teilen Florida Renaissance Festival 336 Follower:innen 5 Monate Diesen Beitrag melden We’re thrilled to share that the Florida Renaissance Festival has been awarded “Most Onsite Sales” by our amazing platform and application partner, Eventeny ! 🏆✨\n \nThis recognition celebrates the incredible support from everyone who steps into our world each season. Thank you to Eventeny for being our trusted platform and application partner, and for helping us bring this festival to life!\n \nHere’s to more seasons of enchantment, creativity, and community! 💫 #wondersofimagination #eventeny #beyondthecastlegates #whereadventurefindsyou #flarf2025 26 3 Kommentare Gefällt mir Kommentieren Teilen Florida Renaissance Festival 336 Follower:innen 5 Monate Diesen Beitrag melden 🏆✨ A standing ovation for our 2025 Florida Renaissance Festival Award Winners! ✨🏆\n\nThese honors highlighted those who excelled — from mouthwatering bites and unforgettable artistry to magnetic personalities and behind-the-scenes heroes. These incredible individuals brought magic to life and made this season truly legendary. 🙌\n\nTo all the participants who took part in this year’s festival — your presence, passion, and craft made the realm shine brighter. Thank you to all the patrons who took the time to vote. We thank thee most heartily!\n\n🏆 Best Original Product\nWinner: Oveja Negra Design\n\n🍽️ Top Taste Award\nWinner: Smoke Stacks House of BBQ\n\n📣 Best Hawking Award\nWinner: Ricardo Garcia\n\n⚔️ Best Demonstration Award\nWinner: The Ottoman Empire\n\n🎨 Best Booth Set-Up Award\nWinner: Antoine Birdsong Originals\n\n👑 Premier Character Award\nWinner: Carol Black\n\n🛡️ Loyalty Award\nWinner: Jon Angell\n\n🌟 Best Overall Vendor Award\nWinner: A New World Henna\n\n🎭 Patron’s Favorite Vendor Award\nWinner: Historical Glassworks\n\n🧰 Unsung Hero Award\nWinner: Willie Rodriguez +5 11 4 Kommentare Gefällt mir Kommentieren Teilen Florida Renaissance Festival 336 Follower:innen 11 Monate Diesen Beitrag melden The Florida Renaissance Festival is looking for a team of dedicated and skilled individuals to join our Art Department for the upcoming 2025 season! You will help us craft a unique and unforgettable experience for all guests who pass through our castle gates.\n \nIf you’re an artist/painter, stage designer, carpenter, have prop experience, seamstress/seamster, have experience working in stagecraft or other similar theater skills, and are interested in getting involved in the Florida Renaissance Festival, now is your chance!\n \nTHESE ARE PAID POSITIONS\n \nApply to the link below with your skill set/preferred position, contact information, and resumé or list of professional experience. https://shorturl.at/iRjFt Dates Needed: \nJanuary 7th, 2025 - January 31st, 2025\nMarch 24th, 2025 - April 4th, 2025\n \nHaving a team of like-minded individuals with a vast array of design capabilities allows us to fabricate spectacular projects and provide a more crafted experience to our guests. The Florida Renaissance Festival is preparing for its 33rd anniversary season, and it is our goal to present our guests with a village filled with magic, fantasy, and imagination.\n \nPlease, come be a part of our festival family!\n \nComment below or DM us with any questions or concerns! #jobapplication #southfloridaart #flarf2025 #FestivalFun #whereadventurefindsyou #renaissance #festivalfun #southflorida #jobapplications #southfloridaartists #callingallartists #renaissancefestival #enchantedmoments #familyfun #wondersofimagination #beyondthecastlegates 7 Gefällt mir Kommentieren Teilen Florida Renaissance Festival 336 Follower:innen 12 Monate Diesen Beitrag melden Become Part of The Magic...\nThe Florida Renaissance Festival is now seeking actors, performers, and characters interested in becoming a member of our 2025 festival entertainment cast!\n\nIf you’re an aspiring entertainer looking to get involved with the festival (be one of our roaming street characters, part of The Royal Court, or a member of our beloved village promenade), this is your chance to shine!\n \nCLICK LINK TO APPLY NOW - https://shorturl.at/DBnvX Requirements For Application Submission\n\t• First & Last Name\n\t• Phone Number\n\t• Email Address\n\t• Photo/Headshot\n\t• Current Acting Résumé/Portfolio\n\nRequirements For Audition\n\t• Two One-minute Monologues (Any Genres)\n\t• 16 Bars of Any Song (You Will Be Signing Acapella)\n\nActors Must have Weekend Availability and flexible schedules. Only actors 16 or older will be considered without a parent accompanying them.\n\nIt’s important to us that you commit to the process - the dates of the event being: \nFebruary 1st through March 23rd, 2025, (weekends only)\nLocated at Quiet Waters Park in Deerfield Beach, FL.\n\nThe Florida Renaissance Festival is preparing for its 33rd season, and inside it, is a village filled with loving and talented people that help to create a world of magic. Please, come be a part of our festival family! Don’t miss out on this amazing opportunity to be part of something truly extraordinary! 3 Gefällt mir Kommentieren Teilen Einfach anmelden, damit Sie nichts verpassen. Personen von Florida Renaissance Festival finden, die Sie kennen Persönliche Jobempfehlungen erhalten Alle Updates, News und Artikel anzeigen Jetzt anmelden Ähnliche Seiten Arc Broward Individual- und Familiendienstleistungen Sunrise, FL Space Coast Credit Union Bankwesen Melbourne, FL VISUAL ADJECTIVES SEEDS INC Produktion und Verbreitung von Rundfunkmedien Delray Beach, Florida Lady of the Lakes Renaissance Faire Zivilgesellschaftliche und soziale Organisationen The Original Renaissance Pleasure Faire Entertainment-Anbieter Irwindale, California Rotary Club Of Fort Lauderdale Zivilgesellschaftliche und soziale Organisationen Fort Lauderdale, Florida Greater Miami Festivals and Events Association Veranstaltungsdienste North Miami, Florida Blue Pack Marketing Werbedienstleistungen Clayton, North Carolina Periodic Vending Solutions, Inc. Gebäudeservices City of Boca Raton Economic Development Regierungsverwaltung Boca Raton, Florida Mehr ähnliche Seiten anzeigen Weniger ähnliche Seiten anzeigen LinkedIn © 2025 Info Barrierefreiheit Nutzervereinbarung Datenschutzrichtlinie Cookie-Richtlinie Copyright-Richtlinie Markenrichtlinine Einstellungen für Nichtmitglieder Community-Richtlinien العربية (Arabisch) বাংলা (Bengali) Čeština (Tschechisch) Dansk (Dänisch) Deutsch Ελανεκα (Griechisch) English (Englisch) Español (Spanisch) فارسی (Persisch) Suomi (Finnisch) Français (Französisch) हिंदी (Hindi) Magyar (Ungarisch) Bahasa Indonesia (Indonesisch) Italiano (Italienisch) עברית (Hebräisch) 日本語 (Japanisch) 한국어 (Koreanisch) मराठी (Marathi) Bahasa Malaysia (Malaysisch) Nederlands (Niederländisch) Norsk (Norwegisch) ਪੰਜਾਬੀ (Punjabi) Polski (Polnisch) Português (Portugiesisch) Română (Rumänisch) Русский (Russisch) Svenska (Schwedisch) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Türkisch) Українська (Ukrainisch) Tiếng Việt (Vietnamesisch) 简体中文 (Chinesisch vereinfacht) 正體中文 (Chinesisch traditionell) Sprache Zustimmen und LinkedIn beitreten Wenn Sie auf „Weiter“ klicken, um Mitglied zu werden oder sich einzuloggen, stimmen Sie der Nutzervereinbarung , der Datenschutzrichtlinie und der Cookie-Richtlinie von LinkedIn zu. Loggen Sie sich ein, um zu sehen, wen Sie bereits bei Florida Renaissance Festival kennen. Einloggen Schön, dass Sie wieder da sind E-Mail-Adresse/Telefon Passwort Einblenden Passwort vergessen? Einloggen oder Wenn Sie auf „Weiter“ klicken, um Mitglied zu werden oder sich einzuloggen, stimmen Sie der Nutzervereinbarung , der Datenschutzrichtlinie und der Cookie-Richtlinie von LinkedIn zu. Neu bei LinkedIn? Mitglied werden oder Neu bei LinkedIn? Mitglied werden Wenn Sie auf „Weiter“ klicken, um Mitglied zu werden oder sich einzuloggen, stimmen Sie der Nutzervereinbarung , der Datenschutzrichtlinie und der Cookie-Richtlinie von LinkedIn zu."
    },
    {
      "url": "https://www.texrenfest.com/news/introducing-the-tex-ren-fest-wedding-team",
      "text": "Introducing the Tex Ren Fest Wedding Team | Texas Renaissance Festival The Kingdom Directions, Parking, & Maps Themed Weekends Lockers Accessibility FAQ Lost and Found Newsletter Sign-Up Contact TRF Things To Do & Entertainment Entertainment Schedule Performers For Lords & Ladies (21+) For Families Guided Tours Survival Guide for Newbies Speak like a TRF Pro Where to Stay Camping at TRF Campground Map Campground Rules & FAQs Camping Passes Guilds Lodging Weddings & Events Weddings @ TRF Parties & Events Contact Weddings & Events Shops, Food, & Drinks Dragonslayer Gift Shop Shoppes Food & Drink Get Involved Become A Sponsor Cast Auditions For our Cast For our Vendors TRF Careers Media Media Pass Request Press Kit & Releases Podcast Tickets General Ticket Info Parking Passes Group Tickets Info Stay & Play Ticket Info Season Tickets Info Campground Ticket Info Liability Waiver Yes, We Donate Join us this year for our 51st Anniversary! Days Hrs Min Sec Sign Up For Our Newsletter Skip to main content Skip to footer Texas Renaissance Festival 21778 Farm to Market 1774 Todd Mission, Texas 77363 Varied The Kingdom Directions, Parking, & Maps Themed Weekends Lockers Accessibility FAQ Lost and Found Newsletter Sign-Up Contact TRF Things To Do & Entertainment Entertainment Schedule Performers For Lords & Ladies (21+) For Families Guided Tours Survival Guide for Newbies Speak like a TRF Pro Where to Stay Camping at TRF Campground Map Campground Rules & FAQs Camping Passes Guilds Lodging Weddings & Events Weddings @ TRF Parties & Events Contact Weddings & Events Shops, Food, & Drinks Dragonslayer Gift Shop Shoppes Food & Drink Get Involved Become A Sponsor Cast Auditions For our Cast For our Vendors TRF Careers Media Media Pass Request Press Kit & Releases Podcast Tickets General Ticket Info Parking Passes Group Tickets Info Stay & Play Ticket Info Season Tickets Info Campground Ticket Info Liability Waiver Yes, We Donate Introducing the Tex Ren Fest Wedding Team August 29, 2019 #Weddings Facebook Twitter LinkedIn Planning 60-70 weddings during a festival season (19 days) can be a very stressful job. The hours put in are way beyond the average 40 hour work week. As the Texas Renaissance Wedding Coordinator, I am fortunate to have a wonderful staff that helps make dreams into a reality. I'd like to introduce the team that I have the pleasure of working with, because I couldn't make these weddings come true for our couples without them. Valyssa Brauner : I have been on the Renaissance wedding team for seven years. I am a Sam Houston State University student studying Family and Consumer Sciences. My goal is to pursue a career as an event planner. I am currently working in the Texas Ren Fest office helping to plan all of the weddings and group events. I will be taking time off from the festival this season to enjoy my senior year in college. My hobbies include being out on the lake, adventuring to new places, camping and watching movies/TV. I'm the proud daughter of a brave police officer and a beautiful, smart event planner. Susan Maddox has served on our Texas Renaissance wedding staff for two seasons. She works full-time as a literacy specialist in Klein ISD and as an adjunct professor of English at Tomball college. For Susan, personal fitness is essential. She teaches water aerobics, Zumba and Body Pump. She absolutely loves planning special ceremonies and taking part in weddings to make every person feel loved at the Texas Renaissance Festival. New to the TRF Wedding Team but not new to the Faire are: Valea Brauner : I have been an actress on the German Court for four years, but decided to take a break from acting this season. Instead, I will be helping the wedding team this season as much as my schedule will allow. I will be a sophomore next year at Magnolia High School, and my dream is to one day be a sign language interpreter. I am on the varsity swim team and in choir. I enjoy going to our lake house, hanging out with friends and family, and pretty much everything with water. Oh, did I mention I love to sleep? Andrew Wilson : This will mark my 7th year at TRF.  I have been on the Royal Guard all six years. I worked my way up to core company and then group leader. I've lost track of how many weddings I've been in! Hobbies include anything costume related, fairs, and cosplay. I am an avid outdoor enthusiast enjoying hiking, kayaking and camping. We are all passionate and enjoy what we do. We want to make sure the day is exactly what the couple has envisioned. During those stressful times, you may catch us acting silly and having fun! The special events team has some exciting plans for 2020 that we can't wait to share with you in the near future! Related Articles About Office Winter Hours December 23 to January 15 Read More Experiences and Stories Texas Renaissance Festival Water is Safe Read More About The Texas Renaissance Festival Finds Their Knights Read More Entertainment Texas Renaissance Festival Tickets are Now On Sale During Our Medieval Meltdown! Read More Entertainment The Best Shows in Houston are Actually in the Village of New Market! Read More Newsletter Signup Want to be notified when an article is published? Enter your email address to be the first to know. Contact Email * Submit Hidden website input Facebook X (Twitter) YouTube Instagram Yelp Menu Contact Purchase Tickets Jobs Blog Media Terms and Conditions Refund Policy Information 281-356-2178 [email protected] Office Hours: 8 am - 5 pm Monday - Friday Festival Hours: 9 am - 8 pm (No Entry After 7 PM) Saturday, Sunday, Thanksgiving Friday Oct. 11 - Nov. 30, 2025 Location 21778 Farm to Market 1774 Todd Mission, TX 77363 Get Directions Thank You To Our Gold Level Sponsors Privacy Policy © 2025 Texas Renaissance Festival all rights reserved. Site Design By: Dynamix Web Design X Unsupported Browser You can use your current browser on Texrenfest.com but some functionality may not work fully. Texrenfest.com works best with the latest versions of Chrome , Firefox , or Microsoft Edge."
    },
    {
      "url": "https://variety.com/2025/tv/obituaries-people-news/george-coulam-dead-ren-faire-1236406162/",
      "text": "George Coulam Dead: 'Ren Faire' Star, Renaissance Fest Founder Was 87 George Coulam Dead: 'Ren Faire' Star, Renaissance Fest Founder Was 87 Plus Icon Film Plus Icon TV Plus Icon What To Watch Plus Icon Music Plus Icon Docs Plus Icon Digital & Gaming Plus Icon Global Plus Icon Awards Circuit Plus Icon Video Plus Icon What To Hear Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Got a Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Variety Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Variety Plus Icon Read Next: CBS Reveals Fall Release Dates For ‘The Young and the Restless,’ ‘Beyond the Gates’ and More (TV News Roundup) Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Home TV Obituaries May 21, 2025 2:29pm PT George Coulam, ‘Ren Faire’ Docuseries Subject and Founder of Texas Renaissance Festival, Dies at 87 By J. Kim Murphy Plus Icon J. Kim Murphy jkimmurphy Latest Tyler Perry Accuser Derek Dixon Details Sexual Assault Allegations in TV Interview: ‘I Thought It Would Stop … and It Didn’t’ 1 day ago Brooklyn Horror Film Festival Unveils 2025 Lineup: Zombie Drag Queens, Two World Premieres and an Ernest Dickerson Tribute 2 days ago Michael Caine Coming Out of Retirement at 92 Years Old for Vin Diesel’s ‘Last Witch Hunter 2’ at Lionsgate 3 days ago See All HBO George Coulam , the founder and longstanding owner of the Texas Renaissance Festival whose eclectic lifestyle and hunt for a successor were documented in the 2024 HBO docuseries “ Ren Faire ,” was found dead in his home in Todd Mission, Texas on Wednesday morning. He was 87. An investigation remains ongoing and a cause of death is not known at this time. The Todd Mission Police Department was dispatched to Coulam’s residence, adjacent to the Renaissance Festival’s premises, on Wednesday morning. The Grimes County Sheriff’s Office and Texas Rangers were present for assistance. Coulam was pronounced dead by authorities upon arrival. Related Stories How Angelina Jolie’s Health Journey Inspired Alice Winocour’s Paris Ensemble ‘Couture': ‘It Was Quite Healing in Many Ways’ Kaitlyn Dever, Meghann Fahy and Issa Rae Among Through Her Lens Jurors “To our Texas Renaissance family and friends, we are deeply saddened by the loss of George Coulam, founder of the Texas Renaissance Festival,” the Texas Renaissance Festival wrote in a statement on social media. “For more than 50 years, he built a community that has become a cherished tradition for generations of performers, staff and guests. At this time, we ask for respect and privacy for Mr. Coulam’s family and the extended Texas Renaissance Festival family as they grieve.” Popular on Variety Coulam’s death comes less than two weeks after a Grimes County District court ordered the Texas Renaissance Festival must be sold, ending a nearly two-year civil case. In the decision, Judge Gary W. Chaney of the 506th state District Court, also ordered that Coulam must pay over $23 million in damages to cover attorney’s fees and money lost by the fest’s buyer. The suit alleged that a group of RW Lands Inc., says Texas Stargate, Inc., Royal Campground, Inc., and Texas RF, Inc. agreed to purchase the Festival, property and assets from Coulam for $60 million. The plaintiff claimed that Coulam and his associates did not provide required documents for the sale and that the original owners failed to close the transaction by its agreed-upon date. Coulam denied the allegations. Coulam founded the Texas Renaissance Festival in 1974 and has overseen its growth into the largest such gathering in the United States. Along with the court order to sell, Coulam also lost office as the mayor of the fest’s premises, Todd Mission, in early May. He had been the only mayor of the town since its 1982 incorporation until losing re-election this year, with city council member Stephen Mensing sworn in. The operations of the Texas Renaissance Festival, infamous among locals, were documented in the 2024 HBO docuseries “Ren Faire,” which followed Coulam’s less-than-motivated search for a successor to lead the festival, and the surrounding business affiliates vying to take over operations. The three-episode run also included details of Coulam’s dedicated online dating pursuits and his unforgiving temperament around his staff. The series’ events concluded prior to the emergence of the recent civil lawsuit against Coulam that reached an end in early May. “Functionally, he actually is a king. He’s created a real-life fiefdom,” series director and executive producer Lance Oppenheim told Variety in an interview before the series premiered. “The first thing he said to me was ‘I used to play the king, but now I’m a horny old man. I want to find someone that can take care of the festival.’ These were the things just flowing out of him. He was maybe looking for an outlet — somebody that he has no control over. He doesn’t have any friends that he doesn’t employ.” Coulam faced other legal troubles in recent years, including allegations of sexual harassment and wrongful termination. The festival settled a 2021 lawsuit filed by a former employee, who claimed that Coulam made her sift through “sugar daddy” websites to facilitate his romantic life. Read More About: George Coulam, Ren Faire Jump to Comments More from Variety Trump Reacts to Shooting of MAGA Influencer Charlie Kirk: ‘God Bless Him!’ ‘Barrio Triste’ Director Stillz on the Personal History Behind His Found Footage Crime Epic and How Making Bad Bunny’s Music Videos Fuels His Creativity — TIFF Quinta Brunson, Disney TV’s Craig Erwich, John Stamos Join Variety Entertainment and Technology Summit Programming PlayStation-Backed Indian Gaming Studio Casts Film Stars for Narrative Adventure ‘Mukti’ (EXCLUSIVE) Italy’s the Open Reel Snags Brazilian Drama ‘Dolores’ Ahead of San Sebastián Film Fest World Premiere, Debuts Trailer (EXCLUSIVE) ‘Sound of Freedom’ Distributor Angel Studios Closes Deal to Become Publicly Traded Company Valued at $1.6 Billion JavaScript is required to load the comments. Loading comments... Most Popular Matthew Dowd Fired From MSNBC for Charlie Kirk Comments Glen Powell Says Chris Pratt in ‘Guardians of the Galaxy’ Changed Hollywood Leading Men: You Can Be ‘Sillier’ and Not Just ‘Brooding’ Like Robert… ‘Superman’ Sequel ‘Man of Tomorrow’ Is the Story of Superman and Lex Luthor Teaming Up Against a ‘Much Bigger Threat’; Filming Eyes April 2026… Daniel Day-Lewis Speaks Out on Ending Acting Retirement After Eight Years: I Felt ‘Hollowed Out’ but ‘I Never Stopped Loving the Work… Audible’s ‘Harry Potter’ Series Expands Cast With Keira Knightley, Kit Harington, James McAvoy, Simon Pegg and More Joaquin Phoenix, Nicola Coughlan and More Join 3,900 Industry Names Pledging Not to Work With Israeli Film Institutions 'Complicit in War Crimes' Charlie Kirk Dies at 31 After Being Shot at Campus Appearance Jezebel Adds Editor’s Note to Article About Hiring ‘Witches to Curse Charlie Kirk’ Published Two Days Before He Was Assassinated Polly Holliday, Who Played Flo on ‘Alice,' Dies at 88 Jimmy Kimmel on Charlie Kirk’s Shooting Death: Can We Stop ‘Angry Finger Pointing’ and ‘Agree It’s Horrible and Monstrous to Shoot Another Human… Must Read Film COVER | Channing Tatum's 'Roofman' Reinvention By Andrew Wallenstein 1 week Film Venice Film Festival Reviews Film Cooper Hoffman on ‘The Long Walk,’ Coming of Age After 'Licorice Pizza' TV ‘SNL’ Adds Five: Meet the New Cast Members Film E. Jean Carroll Hopes Her Explosive Telluride Doc Will ‘Finish Off’ Donald Trump Sign Up for Variety Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Variety Confidential A Variety and iHeartRadio Podcast More From Our Brands Rolling Stone Jerry Seinfeld Claims ‘Free Palestine’ Movement Doesn’t Say What It Means in Controversial KKK Comparison Robb Report This $6.5 Million Waterfront N.J. Home is Just an Hour by Boat from N.Y.C. Sportico Sporticast 483: The Rising Cost vs. Convenience of Sports Streaming WWD Longtime Bulgari Executive, Heir Francesco Trapani Dies at 68 TVLine Hannibal Creator Wants Zendaya to Play Clarice Starling in a Potential Silence of the Lambs-Themed Revival Variety About Us Advertise Media Kit Careers Legal Terms of Use Privacy Policy California Privacy Rights Privacy Preferences AdChoices Your Privacy Choices Accessibility Magazine Customer Service Back Issues Subscribe Help More Newsletters Archives Events Luminate Connect Instagram Twitter YouTube Facebook LinkedIn Variety The Business of Entertainment Subscribe Today Have a News Tip? Let us know Variety Close the menu Expand the sub menu Film News Reviews Podcasts Box Office Events Columns Trailers Expand the sub menu TV News Reviews Podcasts Ratings Pilot Scorecard Columns Trailers Expand the sub menu What To Watch Lists & Features Expand the sub menu Music News Album Reviews Concert Reviews Hitmakers Music For Screens Grammys Expand the sub menu Docs Lists & Features Expand the sub menu Tech Features Global VIP+ Tech Expand the sub menu Global News Asia Markets & Festivals Features Expand the sub menu Awards Circuit News Film Predictions TV Predictions Video Artisans Columns Awards Circuit Podcast Expand the sub menu Video Popular Cover Shoots - Behind the Scenes Actors on Actors Power of Women Events Artisans Expand the sub menu What to Hear Lists & Features Expand the sub menu More Coverage Obituaries - submit obituaries to obits@variety.com Photos Podcasts Scene Voices Theater Expand the sub menu More Variety Live Media Summits Vscore Luminate - Film & TV Variety Archives Variety500 Industry Executives Have a News Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Alerts and Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Follow Us Got a Tip? Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Advertise About Contact Us Variety is a part of Penske Media Corporation. © 2025 Variety Media, LLC. All Rights Reserved. Icon Link Plus Icon ad"
    },
    {
      "url": "https://www.fox26houston.com/news/todd-mission-death-investigation-texas-renaissance-festival-king-george-home",
      "text": "Texas Renaissance Festival founder ‘King George’ dies at Todd Mission home | FOX 26 Houston Live News Weather Morning News Sports Uploads Tell 26 More Watch Live Expand / Collapse search ☰ Search site Watch Live FOX 26 on FOX LOCAL Newscasts & Replays LiveNOW from FOX YouTube FOX Soul News Local Texas National World You Decide Money FOX News Sunday Sullivan's Smart Sense Border Watch Regional News Dallas News - FOX 4 News Austin News - FOX 7 Austin Morning News Making the Grade Dr. Viviana Coles Finding Families Health Matters Pets Submit Your Legal Questions to Chris Tritico Here Your Legal Questions FOX Family Feast Weather Live Radar Live Houston-area webcams Tropical Weather JD's Hurricane Gear Test Mondays with Mike ERCOT News Traffic Weather App Pump Patrol FOX Weather Sports Astros Texans Rockets College Sports Dynamo Dash Roughnecks Friday Football Fever Player of the Week World Cup FOX 26 Shows Isiah Factor Uncensored The Nightcap The News Edge Chattin' With Chelsea What's Your Point? What's Your Point? Overtime Texas: The Issue Is Bayou City Buzz Houston Live and Local Texas Live and Local FOX 26 Originals Caroline & Rashi Allison's Cooking Diary Breaking Bond FOX 26 Crime Files FOX 26 in Focus FOX Faceoff Dollar$ & $en$e Foodies and Friends Pet Pawcast Lunch for the Soul The Missing TELL 26 Entertainment The Drop Backstage OL The Backstage Experience FOX PRIMETIME SHOWS Contests The Now with Cris About Us Meet the FOX 26 Team WATCH FOX 26 ON FOX LOCAL What's On FOX Email Newsletter Jobs at FOX 26 & My20 Internship Opportunities Mobile App Contests KRIV/KTXH FCC Public File Closed Captioning FCC Applications Contact Us HTX-tra Air Quality Alert until THU 6:45 PM CDT, Inland Brazoria County, Inland Galveston County, Inland Harris County, Galveston Island Texas Renaissance Festival founder ‘King George’ dies at Todd Mission home By FOX 26 Digital and Leslie DelasBour Updated May 21, 2025 5:56pm CDT Todd Mission FOX 26 Houston Share Copy Link Email Facebook Twitter LinkedIn Reddit Texas Renaissance Festival founder found dead in his home George Coulam, also known as \"King George,\" was found dead on Wednesday in his Todd Mission home. His death is under investigation. The Brief Texas Renaissance Festival founder George \"King George\" Coulam has died at his home in Todd Mission, officials confirm. His cause of death is not known at this time. Coulam was the founder and longtime owner of the festival. He previously served as mayor of Todd Mission for more than 40 years. TODD MISSION, Texas - Texas Renaissance Festival founder George \"King George\" Coulam has died, authorities confirm. Death investigation at King George’s home What we know: According to the Todd Mission city manager, police were called to Coulam's home at about 9 a.m. on Wednesday. He was found deceased in his home. The cause of Coulam's death is under investigation by the Texas Rangers, Todd Mission Police, and the Grimes County Sheriff's Office. Officials say there is no suspected danger to the public. What we don't know: Coulam's cause of death is not known at this time. Who is King George? Dig deeper: Coulam is the founder and longtime owner of the Texas Renaissance Festival. He started the Texas Renaissance Festival in 1974, and it has grown into the largest of its kind in the United States. In addition to being the festival's leader, Coulam served as mayor of Todd Mission for more than four decades, but lost the most recent election on May 3. In 2024, the HBO docuseries \"Ren Faire\" focused on the festival's succession and Coulam’s eventual retirement, highlighting the tension between his desire to find a romantic partner and his need to choose a successor. It also highlighted Coulam’s strict leadership style. There have been ongoing legal disputes and potential sales of the festival, with a recent judge's order in early May mandating the sale of Coulam’s properties, including the festival. ‘He built a community’ Texas Renaissance Festival founder ‘King George’ found dead in his home According to the Todd Mission city manager, George \"King George\" Coulam was pronounced dead in his home on Wednesday. FOX 26's Leslie DelasBour spoke to community members who knew him well. What they're saying: Niki Marshall is a former member of the performance company with the Texas Renaissance Festival. She says not all of her memories of George's leadership are positive, but the TRF community will keep the festival going. \"The only thing that I could say for him is that he did hire some pretty cool people to be in that space,\" said Marshall. \"He gave us the direction that we needed, and I got the opportunity to really make a difference. And it wasn’t just for me, it was for the patrons that we performed for every day.\" Organizers of the Texas Renaissance Festival sent the following statement to FOX 26: \"We are deeply saddened by the loss of George Coulam, founder of the Texas Renaissance Festival. For more than 50 years, he built a community that has become a cherished tradition for generations of performers, staff, and guests. At this time, we ask for respect and privacy for Mr. Coulam’s family and the extended Texas Renaissance Festival family as they grieve. As this is a deeply personal matter, we are not offering additional comments at this time.\" Todd Mission City Manager Neal Wendele made the following statement: \"Mr. Coulam, a visionary leader, founded the Texas Renaissance Festival in 1974, transforming a remote area into a cultural destination. His visionary leadership led to the incorporation of Todd Mission in 1982, where he served as the first and only mayor until May 8, 2025, shaping our community’s unique identity. The City of Todd Mission offers its deepest condolences to Mr. Coulam’s family and friends. We request privacy for those affected and will provide updates as appropriate.\" The Source: The information in this article was gathered from sources, the Grimes County Sheriff's Office, and the Texas Renaissance Festival. Todd Mission Grimes County Latest News Elected officials, political leaders in Harris County react to Charlie Kirk deadly shooting From DMs to Drugs: How social media fuels teen addiction Muggy air to return to Houston on Thursday Dallas beheading: Victim identified, suspect charged with capital murder New 2025 State Fair of Texas Foods Download FOX LOCAL for Free Trending Harris County crime: Family seeking justice after Marine veteran found shot to death Wells Fargo customer gets $8,000 back he lost to fraudsters after FOX 26 asks questions Brazoria County inventor says major retailer copied his design Man sentenced to nearly 60 years for death of Nassau Bay police sergeant 'In what world we decided to just hate the children': Judge Hidalgo leaves commissioners court Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . ENTER TO WIN Houston St. Jude Dream Home Giveaway: How to buy tickets For $100, you can enter to win a brand-new house while making a difference in the lives of children battling serious diseases. Watch Live FOX 26 on FOX LOCAL Newscasts & Replays LiveNOW from FOX YouTube FOX Soul News Local Texas National World You Decide Money FOX News Sunday Sullivan's Smart Sense Border Watch Regional News Dallas News - FOX 4 News Austin News - FOX 7 Austin Morning News Making the Grade Dr. Viviana Coles Finding Families Health Matters Pets Submit Your Legal Questions to Chris Tritico Here Your Legal Questions FOX Family Feast Weather Live Radar Live Houston-area webcams Tropical Weather JD's Hurricane Gear Test Mondays with Mike ERCOT News Traffic Weather App Pump Patrol FOX Weather Sports Astros Texans Rockets College Sports Dynamo Dash Roughnecks Friday Football Fever Player of the Week World Cup FOX 26 Shows Isiah Factor Uncensored The Nightcap The News Edge Chattin' With Chelsea What's Your Point? What's Your Point? Overtime Texas: The Issue Is Bayou City Buzz Houston Live and Local Texas Live and Local FOX 26 Originals Caroline & Rashi Allison's Cooking Diary Breaking Bond FOX 26 Crime Files FOX 26 in Focus FOX Faceoff Dollar$ & $en$e Foodies and Friends Pet Pawcast Lunch for the Soul The Missing TELL 26 Entertainment The Drop Backstage OL The Backstage Experience FOX PRIMETIME SHOWS Contests The Now with Cris About Us Meet the FOX 26 Team WATCH FOX 26 ON FOX LOCAL What's On FOX Email Newsletter Jobs at FOX 26 & My20 Internship Opportunities Mobile App Contests KRIV/KTXH FCC Public File Closed Captioning FCC Applications Contact Us HTX-tra facebook twitter instagram email New Privacy Policy Updated Terms of Use Your Privacy Choices KRIV/KTXH FCC Public File EEO Public File Closed Captioning About Us Jobs at FOX 26 & My20 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://rennfest.com/phone-mailing-info/",
      "text": "Maryland Renaissance Festival – Contact Us Skip to content Menu Home General Info Dates, Times & Directions Costume Rentals Food At The Faire Artisans Local Accommodations Phone & Mailing Info Wedding Information FAQS Vendor Applications Employment Applications Privacy Policy Entertainment This Year’s Story Line Our Entertainment Schedule Special Events Stage, Street Acts & Royal Court Events Musicians & Dancers Acting Company Auditions Entertainment Support Staff Map Of The Village Photos Photo Contest Winners 2025 photo contest entry form Drone Regulations and Policy Media Media Photos Storyline 2025 season release Crafts Entertainment Special Events Tickets Contact Phone & Mailing Info Festival Phone Numbers Toll Free: (800) 296-7304 Annapolis: (410) 266-7304 Fax: (410) 573-1508 Festival Email General: info@rennfest.com Entertainment questions? Contact Carolyn Spedden at carolyn@rennfest.com Festival Mailing Address Maryland Renaissance Festival P.O. Box 315 Crownsville, MD 21032-0315 Festival Shipping Address Maryland Renaissance Festival 1821 Crownsville Road Annapolis, MD 21401 Please Note: There is no postal service to the Shipping Address. Please send all mail to the Mailing Address. Maryland Renaissance Festival Mailing Address: P.O. Box 315 Crownsville, MD 21032 GPS Locator: 1821 Crownsville Road Annapolis MD, 21401 Phone: Toll Free: (800) 296-7304 Local: (410) 266-7304 Email: info@rennfest.com Home Tickets Dates, Times & Directions Entertainment Map Of The Village FAQS Privacy Policy Special Events ©  2025, Maryland Renaissance Festival. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://renfair.com/socal/join-us/",
      "text": "Work at the Faire - Join Us! - The Original Renaissance Pleasure Faire Saturdays & Sundays - April 5 - May 18, 2025 Only minutes from Pasadena Santa Fe Dam Recreation Area 15501 E. Arrow Highway • Irwindale, CA 10 a.m. - 7 p.m. • Ph: 626.969.4750 Get Tickets Directions and Weather FAQs The Faire Back The Faire Map of the Faire Artisans, Games, and Rides Entertainment/Stage Schedule Food Pub Crawl Queen’s College Tea With the Queen Theme Weekends and Pub Crawl Work at the Faire Photos, Videos and Press Contact Us Visit Another Faire Back Southern California Bristol New York All Rights Reserved © 2016 Get Tickets Directions and Weather FAQs The Faire The Faire Map of the Faire Artisans, Games, and Rides Entertainment/Stage Schedule Food Pub Crawl Queen’s College Tea With the Queen Theme Weekends and Pub Crawl Work at the Faire Photos, Videos and Press Contact Us Visit Another Faire Southern California Bristol New York Join Us! Home » Join Us! Work at the Faire! Work at the Faire and become part of the team that creates a magical escape for our audience. JOB FAIR March 1 from 11 a.m. until 1 p.m. at our business office 5027 Irwindale Ave, Suite 200 Irwindale, CA 91706 The March 1st Job Fair is for individuals looking to join our Security, Grounds, Traffic/Parking, Box Office, and Merchandise teams. March 15 from 11 a.m. until 1 p.m. at the Faire inside the Santa Fe Dam Recreation Area March 22 from 11 a.m. until 1 p.m. at the Faire inside the Santa Fe Dam Recreation Area All departments except Entertainment are hiring at the March 15 and 22 job fairs. Click Here to download the job application! Positions begin at minimum wage ($16.78) but will go up based on skill level and position hired for. Audition to be part of the Entertainment cast Seeking improv actors, singers, and dancers! Open Auditions are on March 8, 2025. Please use this form to secure an audition time. Video auditions are also accepted at rpfauditions@gmail.com . Please prepare: A headshot or clear photo of your face A theatrical resume One 45-second monologue 16 bars any song acapella Optionally, a showcase of skills such as movement, dance, instruments, etc. no longer than three minutes. Background information: The Renaissance Pleasure Faire (RPF) has a variety of opportunities for people with a wide range of performance experience and skills. RPF encourages performers of all ethnicities and backgrounds to audition. Please note: The Renaissance Pleasure Faire is a high-sensory environment where our cast and audience experience musket, cannon and black powder fire multiple times a day. As RPF is an outdoor venue, you will experience extreme weather conditions as well as long hours outdoors interacting with large crowds. The above statement is not meant to intimidate you or to scare you away, however there are folks who simply cannot participate in high-sensory environments. Please know your limitations. At RPF, we can work with limitations however we are unable to work with “I can’t”. Age requirements: In order to be a member of the Entertainment Cast you must be at least 16 years of age by the beginning of the Faire season (April 5, 2025). You must be at least 21 years old to be cast in Pub Crawl. Families with younger children are encouraged to audition as a group – children younger than 16 may be on cast if a parent is also on cast. Compensation: There are some paid positions available for experienced performers, but most of those have already been cast. Currently, positions available within entertainment are for volunteers . *We also assist with internship positions, independent study credits, and required community service hours for students that qualify. If you have any further questions about auditions, please contact us at rpfauditions@gmail.com Become a Vendor (Exhibitor) at the Faire Download the Full-Season Vendor Application Here The Renaissance Pleasure Faire is a well-established Elizabethan-era Faire. Vendors with handmade crafts or period games, rides, and activities that complement our 16th-century theme are welcome to apply. Booth Design – Applicants should send detailed sketches of the booth design including measurements. The rendering of the booth must include frontal and side views, as well as roofline treatments. It is also recommended that you provide space requirements/requests for the back of the booth. Please submit the application with photos or drawings of your booth design and photos of your product to rpfmarketplace@renfair.com . Contact our Marketplace Team at that same address with any further questions about bringing your original works and wares to the Renaissance Pleasure Faire Marketplace. The Renaissance Pleasure Faire Marketplace Office juries year-round on an “until filled” basis. Approved applications received after the Marketplace has been filled will be placed on a waiting list if so requested by the exhibitor. EVERYONE CAN JOIN US! As a guest, enhance your visit by DRESSING the part and SPEAKING the language! Copyright All Rights Reserved © 2016 Home Tickets Directions and Weather The Faire Theme Weekends FAQs Work at the Faire Photos, Videos and Press Contact Us Code of Conduct Privacy Policy Contact Us We're not around right now. But you can send us an email and we'll get back to you, asap. Not readable? Change text. I consent to The Original Renaissance Pleasure Faire collecting my details through this form. Send"
    },
    {
      "url": "https://bayarearenfest.com/",
      "text": "Bay Area Renaissance Festival | 2025 Tickets on sale now Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Weekends February 15th - March 30th BUY TICKETS DAILY EVENTS 2025 BAY AREA RENAISSANCE FESTIVAL 10AM - 6PM RAIN OR SHINE! February 15TH - March 30th MAIN ENTRANCE 12838 Auton Rd., Dade City, FL 33525 Creating a Unique 16th Century Experience Join the Villagers of Folkstone as they invite one and all to the magical 16th Century European village featuring 15 stages of exciting entertainment including: musicians, magicians, jugglers and jousting. Over 100 artisans will fill the Festival marketplace to display and sell their handcrafted goods for a truly fabulous and endless shopping experience. Patrons will interact with memorable characters and enjoy full-contact live armored jousting, 7 theme weekends, and fabulous food fit for royalty! Experience the magic as your adventure begins here! Thrill to the charge of knights jousting on their mighty steeds. Fall under the spell of the faery court. Laugh and be amazed at the clowns, jugglers, acrobats, and magicians performing on stages throughout the village or watch with excitement as birds of prey soar through the air. BUY TICKETS DAILY EVENTS OUR SPONSORS Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Subscribe Email Phone Number By providing your phone number, you agree to receive recurring automated marketing text messages (e.g. cart reminders) from this company and third parties acting on its behalf. Consent is not a condition to obtain goods or services. Msg & data rates may apply. Msg frequency varies. Reply HELP for help and STOP to cancel. You also agree to the Terms of Service and Privacy Policy . First Name Last Name Thanks for joining our mailing list You've been successfully subscribed - thanks! Sign Up"
    }
  ]
}