{
  "fuentes": [
    {
      "url": "https://staging.renningers.net/mt-dora/explore-the-market-3/",
      "email": "doraantcenter@renningers.com"
    },
    {
      "url": "https://staging.renningers.net/mt-dora/explore-the-market-3/",
      "email": "dorafleamkt@renningers.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://rennell.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "molly.harris@cfisd.net"
    },
    {
      "url": "https://rennell.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "chelsea.stone@cfisd.net"
    },
    {
      "url": "https://renningers.net/mt-dora/",
      "email": "doraantcenter@renningers.com"
    },
    {
      "url": "https://renningers.net/mt-dora/",
      "email": "dorafleamkt@renningers.com"
    },
    {
      "url": "https://renningers.net/mt-dora/",
      "email": "qed4@aol.com"
    },
    {
      "url": "https://pointmatch.floridarevenue.com/Help/ContactUs.aspx",
      "email": "dorpto@floridarevenue.com"
    },
    {
      "url": "https://pointmatch.floridarevenue.com/Help/ContactUs.aspx",
      "email": "local-govt-unit@floridarevenue.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "bloomingdale@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "brandon@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "carrollwood@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "landolakes@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "lutz@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "newtampa@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "seminoleheights@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "southtampa@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "lakeland@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "plantcity@patch.com"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "email": "tiffany.razzano@patch.com"
    },
    {
      "url": "https://renningers.net/mt-dora/contact/",
      "email": "doraantcenter@renningers.com"
    },
    {
      "url": "https://renningers.net/mt-dora/contact/",
      "email": "dorafleamkt@renningers.com"
    },
    {
      "url": "https://renningers.net/mt-dora/contact/",
      "email": "matthewlord@renningers.com"
    },
    {
      "url": "https://renningers.net/events/guitars-cars/",
      "email": "doraantcenter@renningers.com"
    },
    {
      "url": "https://renningers.net/events/guitars-cars/",
      "email": "info@lcmsm.com"
    },
    {
      "url": "https://renningers.net/events/guitars-cars/",
      "email": "terre1423@yahoo.com"
    },
    {
      "url": "https://renningers.net/mt-dora/explore-the-market-3/",
      "email": "doraantcenter@renningers.com"
    },
    {
      "url": "https://renningers.net/mt-dora/explore-the-market-3/",
      "email": "dorafleamkt@renningers.com"
    },
    {
      "url": "https://twinroofingco.com/about-us/",
      "email": "xxxxx@twinroofingco.com"
    },
    {
      "url": "https://www.astramarkets.com/contactus",
      "email": "amcare@astracom.com.sa"
    },
    {
      "url": "https://selectflorida.org/export-from-florida/trade-offices/",
      "email": "alejandra.henao@selectflorida.org"
    },
    {
      "url": "https://selectflorida.org/export-from-florida/trade-offices/",
      "email": "diana.mroue@selectflorida.org"
    },
    {
      "url": "https://selectflorida.org/export-from-florida/trade-offices/",
      "email": "john.diep@selectflorida.org"
    },
    {
      "url": "https://selectflorida.org/export-from-florida/trade-offices/",
      "email": "joseph.bell@selectflorida.org"
    },
    {
      "url": "https://selectflorida.org/export-from-florida/trade-offices/",
      "email": "roy.alaimo@selectflorida.org"
    },
    {
      "url": "https://selectflorida.org/export-from-florida/trade-offices/",
      "email": "roy.alaimo@selectflorida.org"
    },
    {
      "url": "https://www.mountdora.com/list/member/renninger-s-twin-markets-402",
      "email": "admin@mountdora.com"
    },
    {
      "url": "https://staging.renningers.net/mt-dora/",
      "email": "doraantcenter@renningers.com"
    },
    {
      "url": "https://staging.renningers.net/mt-dora/",
      "email": "dorafleamkt@renningers.com"
    }
  ],
  "mails": [
    "admin@mountdora.com",
    "alejandra.henao@selectflorida.org",
    "amcare@astracom.com.sa",
    "bloomingdale@patch.com",
    "brandon@patch.com",
    "carrollwood@patch.com",
    "chelsea.stone@cfisd.net",
    "diana.mroue@selectflorida.org",
    "doraantcenter@renningers.com",
    "dorafleamkt@renningers.com",
    "dorpto@floridarevenue.com",
    "info@lcmsm.com",
    "john.diep@selectflorida.org",
    "joseph.bell@selectflorida.org",
    "lakeland@patch.com",
    "landolakes@patch.com",
    "local-govt-unit@floridarevenue.com",
    "lutz@patch.com",
    "matthewlord@renningers.com",
    "molly.harris@cfisd.net",
    "newtampa@patch.com",
    "plantcity@patch.com",
    "qed4@aol.com",
    "roy.alaimo@selectflorida.org",
    "sales@finewineliquors.com",
    "seminoleheights@patch.com",
    "southtampa@patch.com",
    "terre1423@yahoo.com",
    "tiffany.razzano@patch.com",
    "xxxxx@twinroofingco.com"
  ],
  "nombre_sitio": "renningers.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://staging.renningers.net/mt-dora/explore-the-market-3/",
      "text": "Explore the Market - Renninger's Promotions Skip to content Kutztown, PA Adamstown, PA Mt. Dora, FL Melbourne, FL Kutztown, PA Adamstown, PA Mt. Dora, FL Kutztown, PA Adamstown, PA Register Login Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Mt. Dora Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Contact/Directions Special Events Contact Us Exploring Renninger's Market in Mt. Dora Located on 117 acres of scenic, rolling land in beautiful Lake County, the heart of Central Florida; amid spreading oaks, garlands of Spanish moss waving gently from their branches, you will find Renninger’s Twin Markets in Mt. Dora. Two large buildings and a number of open-air shopping areas house a wide variety of dealers from produce stands, clothing shops, and oddity vendors, to high-quality antiques and collectibles. Renninger’s Twin Markets are also home to a large number of special events including antique fairs and extravaganzas, Cars and Guitars shows and swap meets, vintage garden shows, and much, much more. There’s always something to see or do here, so clear your schedule and spend your day or weekend with us. Flea and Farmer's Market Open Every Saturday and Sunday: 8 am to 4 pm Renninger’s Flea and Farmer’s Market in Mount Dora is home to hundreds of dealers that sell just about anything you could imagine. Shoppers can find products from fresh produce, clothing, crafts, fresh meats, pets and pet supplies, foliage, collectibles, jewelry, and a whole lot more. In addition to our air-conditioned, indoor building (housing over 100 booths), our outdoor pavilions house over 400 spaces, and you can find even more dealers in our open-air spaces! Indoor Antique Center Open Every Friday: 10 am to 4 pm Open Every Saturday & Sunday: 9 am to 5 pm If you’ve been searching for a place to browse and shop high-quality antiques and collectibles, look no further. In our 40,000 square foot, air-conditioned building, you’ll find over 180 antique booths staffed by their friendly and helpful owners. Consignment Area In The Indoor Antique Center Open Friday: 10 am to 4 pm Saturdays & Sundays: 9 am to 5 pm A section of the enclosed building now includes consignment cases, filled with fine antiques and collectibles for sale by dealers from Central Florida. A number of shop owners inside our building are included in some of these cases. We introduced the concept of a consignment area to Renninger’s for several reasons. One reason is to alert customers to the variety and quality of antiques available in the center. Another reason is to give dealers a place to give their collectibles additional exposure. And don’t forget those dealers who are ready to retire but don’t want to leave the business completely. This concept fills a void for these dealers. Street of Shops Open Every Friday: 10 am to 4 pm Saturday & Sundays: 9 am to 5 pm Outside of the indoor antique center, you will find the Street of Shops. A series of small buildings line paths and walkways full of wonderful antiques and merchandise. Renninger’s Florida Twin Markets 20651 US-441 Mount Dora, FL 32757 Flea and Farmer’s Market Hours Saturday and Sunday: 8 AM to 4 PM (Flea and Farmer’s Market Not open on Fridays) Contact by Phone or E-mail (352)-383-3141 | E-mail Antique Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 | E-mail Consignment Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 (Ask for Matthew) Note about Antique Center and Consignment Hours: On Fridays, many booths in the enclosed building are not staffed, as well as a number of buildings in the Street of Shops. On Saturdays and Sundays, all booths, consignment areas, the Stable, and the Street of Shops are open. Connect With Us On Facebook Renninger’s is a family-owned business. Explore The Markets News Explore The Market Kutztown Adamstown Mt. Dora Melbourne Become A Vendor Kutztown Adamstown Mt. Dora Melbourne Vendors Kutztown Vendors Adamstown Vendors Mt. Dora Vendors Melbourne Vendors Special Events Contact CONNECT WITH US Kutztown, PA Adamstown, PA Mt. Dora, FL Melbourne, FL Kutztown, PA Adamstown, PA Mt. Dora, FL Kutztown, PA Adamstown, PA Join Our E-mail List! Sign up to recieve news, event reminders, and updates from your favorite markets! We won't fill your inbox with junk. Sign Up Now!"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://rennell.cfisd.net/our-school/faculty-staff/administrative-team",
      "text": "Administrative Team - Rennell Elementary School Skip To Main Content Close Menu Search Clear Search Our School About Us General Information History Attendance Boundary Map (opens in new window/tab) Residential Code Listing (opens in new window/tab) School Ratings (opens in new window/tab) Faculty & Staff Administrative Team Staff Emails (opens in new window/tab) PTO Volunteers (VIPS) Contact Us Academics Academics Homepage Library Resources (opens in new window/tab) HORIZONS Gifted & Talented (opens in new window/tab) Course Descriptions (opens in new window/tab) Home Access Center (HAC) (opens in new window/tab) Schoology (opens in new window/tab) Parents & Students Resources Quick Reference Guide School Cash Online Community Flyers (opens in new window/tab) SchoolMessenger Code of Student Conduct/Student Handbook (opens in new window/tab) Conduct on School Premises (opens in new window/tab) Bringing Out the Best Program (opens in new window/tab) Request a Language Interpreter (opens in new window/tab) Back-to-School Information School Supplies Community Programs Community Programs Club Rewind (Before & After School Program) (opens in new window/tab) Summer Camps (opens in new window/tab) Schedules Newsletters Dr. Aker's Top 3 News & Announcements Calendar Quick Links Bell Schedules Menus Buses Parent Portal (opens in new window/tab) Tipline SchoolCash Online (opens in new window/tab) Facebook (opens in new window/tab) Twitter (opens in new window/tab) District Schools Elementary schools Adam Elementary School Andre' Elementary School Ault Elementary School Bane Elementary School Bang Elementary School Birkes Elementary School Black Elementary School Brosnahan Elementary School Byrd Elementary School Copeland Elementary School Danish Elementary School Duryea Elementary School Emery Elementary School Emmott Elementary School Farney Elementary School Fiest Elementary School Francone Elementary School Frazier Elementary School Gleason Elementary School Hairgrove Elementary School Hamilton Elementary School Hancock Elementary School Hemmenway Elementary School Holbrook Elementary School Holmsley Elementary School Hoover Elementary (PK-2) School Horne Elementary School Jowell Elementary (3-5) School Kirk Elementary School Keith Elementary School Lamkin Elementary School Lee Elementary School Lieder Elementary School Lowery Elementary School McGown Elementary School Matzke Elementary School McFee Elementary School Metcalf Elementary School Millsap Elementary School Moore Elementary School Owens Elementary School Pope Elementary School Post Elementary School Postma Elementary School Reed Elementary School Rennell Elementary School M. Robinson Elementary School A. Robison Elementary School Sampson Elementary School Sheridan Elementary School Swenke Elementary School Tipps Elementary School Walker Elementary School Warner Elementary School Wells Elementary School Willbern Elementary School Wilson Elementary School Woodard Elementary School Yeager Elementary School Middle Schools Anthony Middle School Aragon Middle School Arnold Middle School Bleyl Middle School Campbell Middle School Cook Middle School Dean Middle School Goodson Middle School Hamilton Middle School Hopper Middle School Kahla Middle School Labay Middle School Rowe Middle School Salyards Middle School Smith Middle School Spillane Middle School Sprague Middle School Thornton Middle School Truitt Middle School Watkins Middle School High Schools Bridgeland High School Cy-Fair High School Cypress Creek High School Cypress Falls High School Cypress Lakes High School Cypress Park High School Cypress Ranch High School Cypress Ridge High School Cypress Springs High School Cypress Woods High School Jersey Village High School Langham Creek High School Special Campuses ALC East ALC West Brautigam Center Carlton Center Carpenter Center Open Menu Logo Image Logo Title Rennell Elementary School Quick Links Bell Schedules Menus Buses Parent Portal (opens in new window/tab) Tipline SchoolCash Online (opens in new window/tab) Open Search Search Clear Search Close Search Our School About Us Faculty & Staff PTO Volunteers (VIPS) Contact Us Academics Academics Homepage Library Resources (opens in new window/tab) HORIZONS Gifted & Talented (opens in new window/tab) Course Descriptions (opens in new window/tab) Home Access Center (HAC) (opens in new window/tab) Schoology (opens in new window/tab) Parents & Students Resources Back-to-School Information Community Programs Schedules Newsletters Dr. Aker's Top 3 News & Announcements Calendar About Us Faculty & Staff PTO Volunteers (VIPS) Contact Us In This Section About Us General Information History Attendance Boundary Map (opens in new window/tab) Residential Code Listing (opens in new window/tab) School Ratings (opens in new window/tab) Faculty & Staff Administrative Team Staff Emails (opens in new window/tab) PTO Volunteers (VIPS) Contact Us Home > Our School > Faculty & Staff > Administrative Team Administrative Team Staff Emails (opens in new window/tab) Administrative Team Renell Admin Team Front Row, L-R: Molly Harris- Assistant Principal, Meredith Akers- Principal, Chelsea Stone- Assistant Principal Back Row, L-R: Cherise Garcia-Counselor, Jenise Galey- School Nurse, Kelsey Marchand- Math/Science I.S, Miracle Spells-Counselor , Erika Mahoney-Testing Coordinator, Carmen Walker- R/LA I.S, Jessica McKnight-Secretary Name Title Phone Michele Bickham Principal (281) 213-1540 Chelsea Stone Assistant Principal (281) 213-1531 Molly Harris Assistant Principal (281) 213-1531 Logo Image Logo Title Rennell Elementary School 19500 Tuckerton Blvd. Cypress TX 77433 281-213-1550 Facebook (opens in new window/tab) Twitter (opens in new window/tab) Privacy Policy Site Map Accessibility Powered by Finalsite"
    },
    {
      "url": "https://renningers.net/mt-dora/",
      "text": "Renningers Promotions Facebook-f Twitter Instagram Pinterest Youtube Envelope Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Menu Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Facebook-f Icon-twitter-x Instagram Pinterest Youtube Envelope Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Menu Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Explore The Markets Click Here Become A Vendor Click Here Check Out Our Vendors Click Here 14 September Renninger's Mt. Dora Sunday Guitars and Cars Renninger's Mt. Dora | View Detail 19 September Renninger's Mt. Dora Friday Autumn Yard Sale Renninger's Mt. Dora | View Detail 04 October Renninger's Mt. Dora Saturday Fall in the Field Renninger's Mt. Dora | View Detail 11 October Renninger's Mt. Dora Saturday Florida Military Collectors Show Renninger's Mt. Dora | View Detail 01 November Renninger's Mt. Dora Saturday Florida Cannabis Festival 6th Annual Renninger's Mt. Dora | View Detail 09 November Renninger's Mt. Dora Sunday Guitars and Cars Renninger's Mt. Dora | View Detail 14 September 8:00 am - 3:00 pm Renninger's Mt. Dora Guitars and Cars Second Sunday of September, November, January, March, and May\r\n\r\n8 AM to 3 PM\r\nAdmission $2 (8 AM to 1 PM)\r\n\r\nGuitars (Big Al's Lake County Musicians Swapmeet)\r\nBuy-Sell- ... View Detail 19 September 8:00 am - 4:00 pm Renninger's Mt. Dora Autumn Yard Sale Don't miss Renninger's Autumn Yard Sale. Clean out your unwanted items and sell them in this show.Free Admission - Free Parking - Pet FriendlySame price ... View Detail 04 October Renninger's Mt. Dora Fall in the Field Fall is here!\r\n\r\nCome shop a selection of vendors featuring items for Fall.\r\nAntiques, collectibles, vintage items, and crafts.\r\nKids painting and craft area.\r\nPick a pumpkin from Julie ... View Detail 11 October 9:00 am - 3:00 pm Renninger's Mt. Dora Florida Military Collectors Show The Florida Military Collectors’ show is a one-day event on Saturday, from 9:00 AM to 3:00 PM. It is one of the largest all-military collectibles ... View Detail 01 November 10:00 am - 5:00 pm Renninger's Mt. Dora Florida Cannabis Festival 6th Annual We're back inMount Dora November 1-2, 2025Get your tickets at floridacannafest.com\r\n 200+ Vendors 30+ Food TrucksLive Music From 2 Stages TBA Sponsored Areas Patient & Veteran Lounges Florida Cannabis Awards Informational Discussion ... View Detail 09 November 8:00 am - 3:00 pm Renninger's Mt. Dora Guitars and Cars Second Sunday of September, November, January, March, and May\r\n\r\n8 AM to 3 PM\r\nAdmission $2 (8 AM to 1 PM)\r\n\r\nGuitars (Big Al's Lake County Musicians Swapmeet)\r\nBuy-Sell- ... View Detail Renninger’s Florida Twin Markets 20651 US-441 Mount Dora, FL 32757 Flea and Farmer’s Market Hours Saturday and Sunday: 8 AM to 4 PM (Flea and Farmer’s Market Not open on Fridays) Contact by Phone or E-mail (352)-383-3141 | E-mail Antique Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 | E-mail Consignment Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 (Ask for Matthew) Note about Antique Center and Consignment Hours: On Fridays, many booths in the enclosed building are not staffed, as well as a number of buildings in the Street of Shops. On Saturdays and Sundays, all booths, consignment areas, the Stable, and the Street of Shops are open. -Connect With Us On Facebook Facebook-f Icon-twitter-x Instagram Pinterest Youtube Envelope News Kutztown Adamstown Mt. Dora Melbourne Home Special Events Renninger's Guide Social Media Contact Us Explore the Markets Kutztown Adamstown Mt. Dora Melbourne Become a vendor Kutztown Adamstown Mt. Dora Melbourne"
    },
    {
      "url": "https://pointmatch.floridarevenue.com/Help/ContactUs.aspx",
      "text": "Contact Us Florida Department of Revenue Address/Jurisdiction Database Home Child Support Property Taxes Site Access Alerts & Notifications Log In Register Forgot Password Address Database Address Lookup Master Address List Downloads Change Log Files Request a Correction List of Approved Forwarding Agents General Information Communications Services Tax\r\n                            Rate Table Discretionary Sales Surtax\r\n                            Rate Table Local-Option\r\n                            Tourist Development Tax Rate Table County & Place Codes Fire Codes Police Codes Help User Guide Contact Us Revenue Auditors Semi-Annual Master Address List Build 8/15/2025 Notice:  Due to required maintenance, some functions in the PointMatch Address/Jurisdictional system will not be available from 5:00 PM EST, Wednesday, September 3, 2025, through 8:00 AM EST, Saturday, October 4, 2025. Any projects submitted will be denied unless prior authorization was received from the Local Government Unit. We apologize for any inconvenience this may cause. Discretionary Sales Surtax Rate Table 1/8/2025 The Discretionary Sales Surtax Rate Table was updated on January 7, 2025, to correct the surtax rates for the counties of Hamilton, Marion, Martin, and Seminole. If you downloaded this table or used the address lookup between January 1, 2025, and January 7, 2025, to check the surtax rates for an address in these counties, please update your information. Contact Us If you have questions or need assistance using this system, contact the Local Government\r\n                Unit. Florida Department of Revenue Local Government Unit Phone: 850-717-6630 Email: Local-Govt-Unit@floridarevenue.com Mail to: Florida Department of Revenue Local Government Unit PO Box 6530 Tallahassee, FL 32314-6530 Overnight Delivery: Florida Department of Revenue Local Government Unit Mail Stop 1-4400 5050 W Tennessee St Tallahassee, FL 32399-0161 Local and State Contacts for Property Tax Information Florida\r\n                    Property Appraisers Florida\r\n                    Tax Collectors Department of Revenue Property Tax Administration 850-717-6570 Email: DORPTO@floridarevenue.com [ Questions\r\n                    and Answers | Report\r\n                        Technical Problems | Help\r\n                            with Downloading Files | Privacy\r\n                                Notice ] ©2025\r\n                    Florida Department of Revenue"
    },
    {
      "url": "https://patch.com/florida/lakeland/publix-founders-dream-becomes-nations-largest-employee-owned-company",
      "text": "Publix Founder's Dream Becomes Nation's Largest Employee-Owned Company | Lakeland, FL Patch Skip to main content Lakeland, FL Subscribe News Feed Events Local Businesses Classifieds Post Advertise Nearby Plant City News Bloomingdale-Riverview News Brandon News New Tampa News Temple Terrace News Seminole Heights News Tampa News Lutz News Land O' Lakes News Carrollwood-Northdale News Local News Community Corner Crime & Safety Politics & Government Schools Traffic & Transit Obituaries Personal Finance Neighbor News Best Of Seasonal & Holidays Weather Arts & Entertainment Business & Tech Health & Wellness Home & Garden Sports Travel Kids & Family Pets Restaurants & Bars Real Estate Events Local Businesses Classifieds See all communities Advertise Promote on Patch In partnership with Nearby Communities Plant City, FL Bloomingdale-Riverview, FL Brandon, FL New Tampa, FL Temple Terrace, FL Seminole Heights, FL Tampa, FL Lutz, FL Land O' Lakes, FL Carrollwood-Northdale, FL State Edition Florida National Edition Top National News See All Communities In partnership with Business & Tech Nation's Largest Employee-Owned Company Was Started By A 23-Year-Old Piggly Wiggly Manager From cashiers and baggers to top executives, all 240,000 Publix employees have a stake in the company's success. D'Ann Lawrence White , Patch Staff Posted Wed, Mar  15, 2023 at 9:50 am ET A convoy of Publix delivery trucks with American flags on each cab window were the first vehicles to arrive on Pine Island once its only bridge to the mainland was repaired after being destroyed by Hurricane Ian. (Photo courtesy Jon Demoya) LAKELAND, FL — It was one of those unscripted moments that the Lakeland-based Publix Super Markets chain couldn't dream of duplicating with a slick marketing campaign or millions of dollars in advertising. For 12 days, the 9,000-plus residents of Pine Island had been cut off from the rest of the world after Hurricane Ian made landfall on Sept. 29, 2022. The accompanying hurricane-force winds and storm surge tore a path of destruction across the 17-mile-long, 2-mile-wide island, knocking out all communications as well as the island dwellers' only access to the mainland, a causeway and bridge that buckled under the massive force of the hurricane's waves. Find out what's happening in Lakeland for free with the latest updates from Patch. Subscribe The shelves of the five grocery stores on the island, including the Publix Super Market at Calusa Cay, were nearly bare when Gov. Ron DeSantis announced the Florida Department of Transportation had completed temporary repairs to the bridge three days ahead of schedule. His announcement was followed by a scene that gave the desperate island residents goosebumps as they lined up along the island's main road, eagerly awaiting the first vehicle to cross the bridge, bringing aid. Find out what's happening in Lakeland for free with the latest updates from Patch. Subscribe That vehicle was a semi-tractor-trailer truck with a familiar green and white logo and an American flag attached to the cab window. It was followed by a convoy of identical trucks. Pine Island residents cheered and applauded as the Publix Super Markets delivery trucks arrived with a supply of fresh produce, meat, milk and other essentials. The moment, captured in a photo by Pine Island resident Jon Demoya, encapsulated the impact the grocery store chain and its visionary founder, George W. Jenkins, has had on the state of Florida through its employment opportunities and community giving campaigns. One Man's Dream Jenkins' dream of providing communities with quality food and service began as a boy in Harris, Georgia, working in his father's general store. Hoping to make his fortune in Florida, Jenkins headed to Tampa in 1925 at the age of 17 and landed a job as a stock clerk in a Piggly Wiggly grocery store. Even at that young age, he displayed a worth ethic and commitment that impressed his bosses. He was quickly promoted to manager of the Tampa store and then was transferred to the grocery store chain's largest store in Winter Haven, where he worked as the manager from 1926 to 1930. Jenkins was only 22 years old when the stock market crashed in October 1929 paving the way for the Great Depression. Despite the crippled economy, Jenkins decided to quit his job and strike out on his own. A year later, on Sept. 6, 1930, he opened the first Publix Food Store in Winter Haven, followed by a second store across town five years later. Publix George W. Jenkins opened his first Publix in Winter Haven on on Sept. 6, 1930, eventually moving the company headquarters to Lakeland. Jenkins, however, had greater aspirations. He dreamed of creating what he called a modern \"food palace\" of marble, glass and stucco with unheard-of innovations at that time like air conditioning, fluorescent lights and doors that opened automatically with the help of \"electronic eyes.\" He closed the two Winter Haven grocery stores and opened the first Publix Super Market on Nov. 8, 1940. Decades later, economists and marketing gurus would study Jenkins' business model to figure out the secret to his success at a time when businesses across the country were shuttering their doors. Publix George W. Jenkins, the founder of Publix Super Markets, takes a customer's groceries to their car. Publix George W. Jenkins dreamed of creating what he called a modern \"food palace\" of marble, glass and stucco with unheard-of innovations at that time like air conditioning, fluorescent lights and doors that opened automatically with the help of \"electronic eyes.\" Jenkins, known as \"Mr. George\" to those who worked for him, could have told them the answer in four words: \"Treat employees like family.\" It was a philosophy he never wavered from as Publix Super Markets sprang up across the Southeast. Every cashier, bagger, meat cutter and baker employed by Publix had a personal stake in the company's success. \"Our founder believed associates should be company owners. It’s one of the greatest benefits of working at Publix,\" said Publix Director of Communications Maria Brous. \"He wanted his associates to share in his vision for the growth of Publix.\" Jenkins offered stock to all of the store's associates, saying, \"It’s just common sense that if you own a part of a company, then you’re going to give it your best.” Publix George W. Jenkins, called \"Mr. George\" by his employees, turned a dream into the largest employee-owned company in the United States. National Accolades Today, Publix Super Markets Inc. is the largest employee-owned company in the United States. The company is owned by 240,000 people — including grocery baggers, truck drivers, cake decorators and stock clerks — who work at 1,331 grocery stores, 10 distribution center, 10 manufacturing facilities, 11 cooking schools and the company's flagship campus-like headquarters in Lakeland. It's become one of the 10 largest-volume supermarket chains in the country with retail sales reaching $48 billion in 2021. It's also earned the company a slew of accolades. Publix has been named to Fortune's list of 100 Best Companies to Work For from 1998 to 2022, earning the magazine's recognition as one of the \"Great Place to Work Legends.\" Fortune also listed Publix as one of the Best Workplaces in Retail , Best Workplaces for Women , Best Workplaces for Millenials , Most Important Private Companies and Best Big Companies to Work For. Meanwhile, on Feb. 27, Forbes magazine once again included Publix on its America’s Best Large Employer s list. Publix also has made Forbes' America's Best Employers for New Grads , Best Employers for Veterans and Best Employers for Diversity. Other honors include Best Companies for Diversity by Women's Choice Award , the No. 1 spot on Newsweek magazine's America’s Best Customer Service in Supermarkets list in 2021 and was voted the South's Best Grocery Store by Southern Living readers. Giving Back Brous said the company is especially proud to be included on Fortune's list of the World's Most Admired Companies in 2020, 2022 and again this year. \"George Jenkins believed in giving,\" she said. \"From the day he opened his first Publix, he made sure his associates, customers and community were taken care of. In 1966, Mr. George established the ( Publix Super Market Charities ) foundation with the vision it would continue giving long after he was gone.\" In 2021, Publix launched its Feeding More Together register campaign, allowing customers to donate at the register to provide nonperishable items for local food banks. Publix then matches customer donations with the purchase of fresh produce from Southeastern farmers and donates it to Feeding America member food banks. This campaign has provided more than 232 million meals to people facing hunger since launching two years ago. \"For decades, Publix has worked to take care of its neighbors and communities, and helping alleviate hunger is at the heart of the company’s charitable efforts,\" Brous said. “Since 1930, we’ve remained true to the philosophies and principles set forth by our founder, our associates go above and beyond to take care of our customers and communities every day.” In September, Publix Super Markets Charities announced a $5.65 million donation to 328 food banks and other nonprofit organizations focused on hunger alleviation. To further those efforts, the company has donated an additional $3.85 million to 22 Feeding America member food banks to purchase and equip a mobile food pantry where people in need can \"shop\" for free. With these contributions, Publix Super Markets Charities donated a total of $9.5 million in 2022 to support hunger relief organizations. And the company has pledged a total of $23 million to support hunger alleviation by the end of 2023. This includes a Publix commitment to provide more than 10 million pounds of produce to stock 20 of the mobile pantries in their first year of operation. “As Americans continue to face hunger, we wanted to do more to help get much-needed meals onto the plates of our neighbors,” said Publix CEO Todd Jones. “In conjunction with Publix Super Markets Charities, we’re proud to extend our commitment to helping alleviate hunger through these donations. We remain dedicated to doing good together to provide nourishing meals for people in need in our communities.” “This donation will be instrumental for so many people who face hunger every day,” said Feeding America CEO Claire Babineaux-Fontenot. “Access to nutrition is a foundational need for everyone to be successful. We’re grateful to both Publix and Publix Super Markets Charities for their continued partnership and commitment to help alleviate hunger.” In addition to hunger alleviation efforts, the company is committed to being good stewards of the environment. In 2021, Publix announced plans to support the removal of nuisance trees and plants in the Florida Everglades through projects with the National Audubon Society and the National Park Foundation. Long before the affordable housing crisis, Publix Charities supported efforts to provide housing for families in need. Publix began supporting Habitat for Humanity affiliates more than 30 years ago, with the first contribution going to Habitat for Humanity of East Polk County. Since 2014, the company has donated more than $33 million to housing programs, including building homes and supporting programs such as emergency shelters and transitional housing for those in need. “We’re committed to helping people in our communities build hope by putting roofs over their heads,” said Publix Charities Executive Director Kelly Williams-Puccio. “George Jenkins believed that a home gives individuals and families safety, independence and hope.\" On Dec. 8, the company donated $5 million to support more than 240 nonprofit housing programs throughout the Southeast, including 126 Habitat for Humanity affiliates. Most recently, on Feb. 27, Publix hosted its inaugural hunger summit last week, bringing together executives from 35 Feeding America member food banks in the company’s operating area, as well as state and federal officials, to discuss how they can build on previous successes and feed more people in need. \"With more than 7 million people in the Southeast being food insecure, Publix continues to work toward alleviating hunger,\" Jones said. “Our summit provided an opportunity to build stronger connections and, together, find better ways to accomplish a united purpose — feeding even more people in need in the communities we serve.\" During the summit, representatives from Publix Super Markets Charities announced a special $4 million grant opportunity available to select food banks in Publix’s operating area to fund non-recurring, capacity-building projects. This grant opportunity is in addition to the company's annual hunger alleviation donations. It will bring the organization's total contributions to help alleviate hunger to more than $46 million since 2015. Publix At the end of 2001, Publix broke ground on a new corporate office building in Lakeland that would create office space for approximately 1,200 associates. The 325,000-square-foot building was completed in 2002. While most corporate departments relocated to this new facility, several still occupy the original headquarters building. Get more local news delivered straight to your inbox. Sign up for free Patch newsletters and alerts. Related: Town Traditions Patch Exclusives Share More from Lakeland Politics & Government | 17h 9/11's Shadow: Are We Free, or Under Illusion? Lessons for All Americans-Critical Look @ John-Nisha Whitehead Politics & Government | 1d Survey Finds Married Women with Children Happier than Those Who Focus on Career-See Survey Results Politics & Government | 2d Manufactured Housing Association for Regulatory Reform (MHARR) Submits Amendments to Address Key Bottlenecks Featured Events + Add your event Featured Classifieds + Add your classified Featured Businesses + Promote your business Latest News Nearby Lakeland, FL News 🌱 Patch AM: Help shape Lakeland's new 101-acre park Across Florida, FL News 'Heinous Attack': FL Reacts After Conservative Activist Charlie Kirk Fatally Shot Across Florida, FL News 3 Arrested In Shooting Of FSU Linebacker Tampa, FL News Peak Hurricane Season In FL: See Latest Forecast For Potential Storms Lakeland, FL News 🌱 Patch AM: Lakeland's Hendrix shines in high school sports poll Find out what’s happening in your community on the Patch app Corporate Info About Patch Careers Partnerships Advertise on Patch Support FAQs Contact Patch Community Guidelines Posting Instructions Terms of Use Privacy Policy © 2025 Patch Media. All Rights Reserved."
    },
    {
      "url": "https://renningers.net/mt-dora/contact/",
      "text": "Renningers Promotions Facebook-f Twitter Instagram Pinterest Youtube Envelope Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Menu Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Facebook-f Icon-twitter-x Instagram Pinterest Youtube Envelope Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Menu Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Contact/Directions Renninger’s Florida Twin Markets 20651 US-441 Mount Dora, FL 32757 Flea and Farmer’s Market Hours Saturday and Sunday: 8 am to 4 pm Contact by Phone or E-mail (352)-383-3141 | E-mail Antique Center Hours Friday: 10 am to 4 pm Saturday and Sunday: 9 am to 5 pm Contact by Phone or E-mail (352)-383-8393 | E-mail Consignment Center Hours Friday: 10 am to 4 pm Saturday and Sunday: 9 am to 5 pm Contact by Phone or E-mail (352)-383-8393 (ask for Matthew) | E-mail Directions Renninger’s Florida Twin Markets 20651 US-441 Mount Dora, FL 32757 Flea and Farmer’s Market Hours Saturday and Sunday: 8 AM to 4 PM (Flea and Farmer’s Market Not open on Fridays) Contact by Phone or E-mail (352)-383-3141 | E-mail Antique Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 | E-mail Consignment Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 (Ask for Matthew) Note about Antique Center and Consignment Hours: On Fridays, many booths in the enclosed building are not staffed, as well as a number of buildings in the Street of Shops. On Saturdays and Sundays, all booths, consignment areas, the Stable, and the Street of Shops are open. -Connect With Us On Facebook Facebook-f Icon-twitter-x Instagram Pinterest Youtube Envelope News Kutztown Adamstown Mt. Dora Melbourne Home Special Events Renninger's Guide Social Media Contact Us Explore the Markets Kutztown Adamstown Mt. Dora Melbourne Become a vendor Kutztown Adamstown Mt. Dora Melbourne"
    },
    {
      "url": "https://renningers.net/events/guitars-cars/",
      "text": "Renningers Promotions Facebook-f Twitter Instagram Pinterest Youtube Envelope Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Menu Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Facebook-f Icon-twitter-x Instagram Pinterest Youtube Envelope Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Menu Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Home Events Guitars & Cars Organizer Renninger's Mt. Dora Phone 352-383-8393 Email doraantcenter@renningers.com Website http://mtdora.renningers.net Location Renninger's Mt. Dora Category Mt. Dora Events Date Sep 12 2021 Expired! Time 8:00 am - 3:00 pm Cost $2.00 Guitars & Cars Renninger’s Florida Twin Markets, on Rt. 441 in Mount Dora, Florida, is proud to bring you GUITARS & CARS – a union of the Lake County Musician’s Swap Meet AND the Lake County Classic Car & Cycle Swap Meet, Car Show and Cruise-in. Just $2 (per person) gains you admission to TWO Swap Meets for the Price of ONE, on the second Sunday of every month from 8 am until 1 pm. Children under 14 are ALWAYS admitted FREE!. Children must be accompanied by an adult at all times. There is ample FREE parking for the general public with a reserved Disabled Parking Area close to the gate. There are also two ATMs close by. Our food vendors offer a full breakfast and lunch menu. And after you visit “Guitars & Cars”, don’t forget to stop into either the Farmers & Flea Market or the Antiques Center. Admission to BOTH is free. ABOUT the Lake County Musician’s Swap Meet Central Florida’s Premier Event for Music Lovers and Musicians. Established in 2009, it is the longest-running event of it’s kind in the southeast. The Musician’s Swap Meet brings together dealers, collectors, musicians and the general public for an afternoon of fun with a little business on the side where everyone can buy, sell or trade musical instruments and equipment and play a little music. The MUSIC LOVER’S Jam is on hiatus for July and August due to the extreme heat and will return in September. If you have any questions about the Musician’s Swap Meet or just want more information, please contact “Big Al” Kalka at 352.735.0025 or email info@LCMSM.com ABOUT the Lake County Classic Car & Cycle Swap Meet, Car Show and Cruise-in Since 2003, The Lake County Classic Car & Cycle Swap Meet, Car Show and Cruise-in has offered the car and cycle enthusiast everything they could want, combined into one event. From parts to car and cycle sales, to a competitive show and an all-day cruise-in. Show your car or cycle. Show registration from 8am until 11am. Trophies given out at Noon Cruise in and visit for a while or stay for the whole day. Check out the Parts Midway or sell your vehicle in the Car Corral. Around 1pm watch the Car CruiseAround travel through both markets. If you have any questions about the Car & Cycle Show or just want more information, please contact Terre Renninger at 352.383.8393 or email terre1423@yahoo.com Share this event + Add to Google Calendar + iCal / Outlook export The event is finished. Tags: antiques cars , cars , concerts , guitars , music , musical instruments , swap meet , vintage cars Facebook-f Icon-twitter-x Instagram Pinterest Youtube Envelope News Kutztown Adamstown Mt. Dora Melbourne Home Special Events Renninger's Guide Social Media Contact Us Explore the Markets Kutztown Adamstown Mt. Dora Melbourne Become a vendor Kutztown Adamstown Mt. Dora Melbourne"
    },
    {
      "url": "https://renningers.net/mt-dora/explore-the-market-3/",
      "text": "Renningers Promotions Facebook-f Twitter Instagram Pinterest Youtube Envelope Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Menu Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Facebook-f Icon-twitter-x Instagram Pinterest Youtube Envelope Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Menu Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Farmer’s Market Vendors Antique Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Adamstown Events Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Antique Center Vendors Flea and Farmer’s Market Vendors Special Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Special Events Contact/Directions Consignment Vendor Portal Special Events Kutztown Events Adamstown Events Mt. Dora Events Melbourne Events All Events Social Media Contact Us Explore the Market Located on 117 acres of scenic, rolling land in beautiful Lake County, the heart of Central Florida; amid spreading oaks, garlands of Spanish moss waving gently from their branches, you will find Renninger’s Twin Markets in Mt. Dora. Two large buildings and a number of open-air shopping areas house a wide variety of dealers from produce stands, clothing shops, and oddity vendors, to high-quality antiques and collectibles. Renninger’s Twin Markets are also home to a large number of special events including antique fairs and extravaganzas, Cars and Guitars shows and swap meets, vintage garden shows, and much, much more. There’s always something to see or do here, so clear your schedule and spend your day or weekend with us. Mt. Dora Flea and Farmer’s Market Open Every Saturday and Sunday: 8 am to 4 pm https://renningers.net/wp-content/uploads/2021/10/mtdora-farmers-flea-facebook-video.mp4 Renninger’s Flea and Farmer’s Market in Mount Dora is home to hundreds of dealers that sell just about anything you could imagine. Shoppers can find products from fresh produce, clothing, crafts, fresh meats, pets and pet supplies, foliage, collectibles, jewelry, and a whole lot more. In addition to our air-conditioned, indoor building (housing over 100 booths), our outdoor pavilions house over 400 spaces, and you can find even more dealers in our open-air spaces! Indoor Antique Center Open Every Friday: 10 am to 4 pm Open Every Saturday & Sunday: 9 am to 5 pm If you’ve been searching for a place to browse and shop high-quality antiques and collectibles, look no further. In our 40,000 square foot, air-conditioned building, you’ll find over 180 antique booths staffed by their friendly and helpful owners. https://renningers.net/wp-content/uploads/2023/11/mt-dora-com-3-28-24.mp4 Consignment Area in the Indoor Antique Center Open Friday: 10 am to 4 pm Saturdays & Sundays: 9 am to 5 pm A section of the enclosed building now includes consignment cases, filled with fine antiques and collectibles for sale by dealers from Central Florida. A number of shop owners inside our building are included in some of these cases. We introduced the concept of a consignment area to Renninger’s for several reasons. One reason is to alert customers to the variety and quality of antiques available in the center. Another reason is to give dealers a place to give their collectibles additional exposure. And don’t forget those dealers who are ready to retire but don’t want to leave the business completely. This concept fills a void for these dealers. Street of Shops Open every Friday: 10 am to 4 pm Saturday & Sundays: 9 am to 5 pm Outside of the indoor antique center, you will find the Street of Shops. A series of small buildings line paths and walkways full of wonderful antiques and merchandise. Renninger’s Florida Twin Markets 20651 US-441 Mount Dora, FL 32757 Flea and Farmer’s Market Hours Saturday and Sunday: 8 AM to 4 PM (Flea and Farmer’s Market Not open on Fridays) Contact by Phone or E-mail (352)-383-3141 | E-mail Antique Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 | E-mail Consignment Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 (Ask for Matthew) Note about Antique Center and Consignment Hours: On Fridays, many booths in the enclosed building are not staffed, as well as a number of buildings in the Street of Shops. On Saturdays and Sundays, all booths, consignment areas, the Stable, and the Street of Shops are open. -Connect With Us On Facebook Facebook-f Icon-twitter-x Instagram Pinterest Youtube Envelope News Kutztown Adamstown Mt. Dora Melbourne Home Special Events Renninger's Guide Social Media Contact Us Explore the Markets Kutztown Adamstown Mt. Dora Melbourne Become a vendor Kutztown Adamstown Mt. Dora Melbourne"
    },
    {
      "url": "https://twinroofingco.com/about-us/",
      "text": "About Us | Twin Roofing & Contracting - Florida, Oklahoma, & Arizona Emergency Roofing? Call Today.  | (877) 216-2228 GET YOUR FREE QUOTE Home Services Residential Roofing Commercial Roofing Locations Florida Oklahoma Arizona Project Gallery About Us Blog Contact Us Menu Call: (877) 216-2228 | Email: xxxxx@twinroofingco.com TWIN ROOFING & CONTRACTING, INC. ABOUT TWIN ROOFING RESIDENTIAL, COMMERCIAL, & EMERGENCY ROOFING WHY CHOOSE TWIN ROOFING What makes Twin Roofing different? By working with Twin Roofing, you have a direct point of contact that will manage the project from start to finish, who will always be a phone call away to answer any questions. Twin Roofing is a storm restoration roofing company that focuses on repairing & replacing roof systems that have been damaged by hurricanes, hail storms, winds, and other extreme weather conditions. Our focus is on restoring your roof through high-quality workmanship, as well as helping you through the insurance claims process by working directly with your insurance company. Through industry experience and a highly trained crew, Twin Roofing can manage any roofing project. We have experience in complex roofing systems in Florida, Arizona, and Oklahoma and can handle both residential & commercial roofs. We guarantee to maintain the integrity and value or your property, using industry-standard materials. 15 YEARS OF EXPERIENCE 5000 SHINGLES INSTALLED Facebook Twitter Pinterest linkedin Telegram RESIDENTIAL, COMMERCIAL, & EMERGENCY ROOFING WHY CHOOSE TWIN ROOFING What makes Twin Roofing different? By working with Twin Roofing, you have a direct point of contact that will manage the project from start to finish, who will always be a phone call away to answer any questions. Twin Roofing is a storm restoration roofing company that focuses on repairing & replacing roof systems that have been damaged by hurricanes, hail storms, winds, and other extreme weather conditions. Our focus is on restoring your roof through high-quality workmanship, as well as helping you through the insurance claims process by working directly with your insurance company. Through industry experience and a highly trained crew, Twin Roofing can manage any roofing project. We have experience in complex roofing systems in Florida, Arizona, and Oklahoma and can handle both residential & commercial roofs. We guarantee to maintain the integrity and value or your property, using industry-standard materials. 15 YEARS OF EXPERIENCE 5000 SHINGLES INSTALLED Facebook Twitter Pinterest linkedin Telegram CLIENT TESTIMONIALS Fantastic Service. Professional from start to finish. Blake handled my entire Insurance claim. He made sure the damage to my property was properly allocated for and settled correctly. Once the Insurance issued the money Blake and his team delivered the highest quality of workmanship and customer service in a timely manner when installing my roof. I would highly recommend Blake and Twin Roofing and Contracting! It was a pleasure working with them from start to finish. Steve Lingo Naples, Florida Blake worked closely with our Insurance Adjuster to make sure all damaged was identified and covered in the repairs. They started the job when they said they would, the crew was very fast, efficient, and did a great job cleaning up when they were finished. I would definitely use them again! Brain Ellithorp Oklahoma City, Oklahoma It went very well! They worked very well with my Insurance company and my new roof looks great! I would recommend Blake and Twin Roofing and Contracting! Five Stars! Nancy Nuttally Phoenix, Arizona BLAKE ZIENTKOWSKI Twin Roofing owner & CEO Blake Zientkowski has over 15 years of experience in the storm restoration roofing industry and is dedicated to giving each customer one-on-one, customer service focused experience. The Twin Roofing Difference is Our Process Twin Roofing is not your typical roofing company. We focus on helping those with roof damage from storms by providing a hands-on, customer service focused experience. We understand that filing an insurance claim after a disaster is not an easy process, so our experts are here to make sure your roof repair is handled in a timely and professional manner. Damage Identification After a storm, if you find damage to your roof or home’s exterior like broken shingles, broken windows, or interior leaks – this indicates more serious damage, as well as the need for a more serious inspection by one of our professionals. Free Inspection When damage is identified, contact Twin Roofing as soon as possible. We will schedule a free, no-obligation inspection of your property where we will identify the damage and see if you are eligible to file an insurance claim. File Insurance Claim Your Twin Roofing Project Manager will begin the process of helping you file your insurance claim. We’ll help you work with the insurance company to guarantee they have the proper information & documentation needed for the claim. Settlement & Project Commencement You will receive a claim number and be contacted by the insurance company. Your project manager will work directly with the insurance company to facilitate the claim and commence the roofing project, ensuring the claim is properly settled. Find Your Location We offer our services to Florida, Arizona, and Oklahoma. Get Started What to Do After a Storm Do you have damage to your roof after a storm? Read more Contact Twin Roofing Twin Roofing specializes in roof repairs & restoration from storm damage. Start Today Twin Roofing & Contracting, Inc. | Privacy Policy | Image Use Facebook Twitter Pinterest linkedin Telegram Twin Roofing & Contracting, Inc. | RGB Web Design | Privacy Policy | Image Use Home Services Residential Roofing Commercial Roofing Locations Florida Oklahoma Arizona Project Gallery About Us Blog Contact Us Scroll To Top"
    },
    {
      "url": "https://www.astramarkets.com/contactus",
      "text": "Contact Us | Astra Markets top of page HOME LE JARDIN ASTRALICIOUS ASTRALICIOUS MENU Offers ASTRA STARS STARS Gifts RECIPES CAREERS ABOUT US BRANCHES ASTRA BAKERY ASTRA BUTCHERY ASTRA PATISSERIE MORE CONTACT US Terms and conditions Privacy Policy RightRequest More Use tab to navigate through the menu items. CONTACT US Please feel free to contact us at any of our Supermarket branches, at our head office, via email or by completing the contact form below Branches: Astra Markets Olaya: T: +966 569629158 Astra Markets Sultana: T: +966 569628934 ​ Astra Markets Military City: T: +966 569629245 ​ Astra Markets Al Qadisia T: +966 569629284 ​ Astra Markets at Astra Farms: T: +966 569629297 ​ Astra Markets Tabuk Garden Village: T: +966 569628957 ​ Astra Markets Almasef: T: +966 569629241 ​ Astra Petrol Station: T: +966 569629787 ​ Astra Station / Mini Market: T: +966 569629787 ​ Astra Wholesales Cold Store T: +966 569629894 Head Office Astra Food Company - Commercial P.O.Box 1483, Tabuk 71431 Kingdom of Saudi Arabia ​ T: +966 14 423 2888 F: +966 14 422 0388 E: amcare@astracom.com.sa ​ ​ Contact Form Thank you! We will let you know whenever we publish a new booklet Send Our Branches Our branches are conveniently distributed across TABUK, for a complete list of our locations, please click the tab below LOCATIONS © 2024 by Astra Food Co. / Astra Markets Privacy Policy Terms & conditions bottom of page"
    },
    {
      "url": "https://selectflorida.org/export-from-florida/trade-offices/",
      "text": "Florida’s Trade Offices Can Help You Expand Globally Grow Your Business in Florida Contact the Business Development Team Business Climate Workforce and Talent Development Major Industries Infrastructure Regions Quality of Life Buildings and Site Search Export From Florida Trade Offices Trade Grants Certificates of Free Sale Good Manufacturing Practices Certificates Research and Reports For International Companies SelectFlorida’s International Offices International Investment Resources Research and Reports News & Resources News Events About Our Board Archived Reports Toggle Navigation Button Toggle Navigation Button Bring your Business to Florida Why Florida Contact the Business Development Team Business Climate Workforce and Talent Development Florida’s Major Industries Infrastructure Quality of Life Buildings and Site Search Regions Industries Aviation & Aerospace Cleantech Defense and Homeland Security Financial and Professional Services Headquarters Information Technology Life Sciences Logistics and Distribution Manufacturing News & Resources News & Stories Events Archived Reports Export From Florida Trade Offices Trade Grants Certificates of Free Sale Research and Reports Trade & FDI Events For International Companies SelectFlorida’s International Offices International Investment Resources About Our Board Careers Our Offices Contact Us Follow Us Linkedin X Florida Trade Offices Get in touch with one of our six trade offices. Home / Export From Florida / Trade Offices Need export assistance in Florida? Florida’s six trade offices can help your business expand abroad with market research, selecting target markets, assessing market readiness and more. SelectFlorida has a statewide network of trade professionals who provide free export counseling to small and medium-sized companies interested in expanding globally. Services include evaluation of a company’s market readiness, selecting target markets for its products or services, market research, information on channels of distribution in target markets and introductions to our International Offices. View our six offices below and contact your local trade representative to learn more. Jacksonville/Northeast Miami-Dade/Southwest Orlando/Central Florida Pensacola/Northwest/Tallahassee Tampa Bay West Palm Beach/Southeast Jacksonville/Northeast Jacksonville/Northeast The Jacksonville/Northeast office serves the following counties: Alachua, Baker, Bradford, Clay, Columbia, Dixie, Duval, Flagler, Gilchrist, Hamilton, Lafayette, Levy, Madison, Nassau, Putnam, St. Johns, Suwannee, Taylor and Union. Roy Alaimo, Regional Manager International Trade & Development 3 Independent Drive Jacksonville, FL 32202 Phone: (904) 652-6419 Email: roy.alaimo@selectflorida.org Miami-Dade/Southwest Miami-Dade/Southwest The Miami-Dade and Southwest Florida office serves the following counties: Collier, Glades, Hendry, Lee, Miami-Dade and Monroe. Alejandra Henao, Director International Trade & Development 201 Alhambra Circle, Suite 610 Coral Gables, FL 33134 Phone: (305) 808-3670 Email: Alejandra.Henao@SelectFlorida.org Orlando/Central Florida Orlando/Central Florida The Orlando/Central Florida office serves the following counties: Brevard, Highlands, Lake, Marion, Orange, Osceola, Polk, Seminole, Sumter and Volusia. Joseph Bell, Director International Trade & Development 800 N. Magnolia Avenue, Suite 1100 Orlando, FL 32803 Phone: (305) 240-9717 Email: Joseph.Bell@SelectFlorida.org Pensacola/Northwest/Tallahassee Pensacola/Northwest/Tallahassee The Pensacola/Northwest/Tallahassee office serves the following counties: Bay, Calhoun, Escambia, Franklin, Gadsden, Gulf, Holmes, Jackson, Jefferson, Leon, Liberty, Okaloosa, Santa Rosa, Wakulla, Walton and Washington. Roy Alaimo Regional Manager International Trade & Development 3 Independent Drive Jacksonville, Florida, 32202 Phone: 904.652.6419 Email: Roy.Alaimo@SelectFlorida.org Tampa Bay Tampa Bay The Tampa Bay office serves the following counties: Charlotte, Citrus, Desoto, Hardee, Hernando, Hillsborough, Manatee, Pasco, Pinellas and Sarasota. Diana Mroue, Regional Manager International Trade Development 201 N. Franklin Street, Suite 201 Tampa, FL 33602 Phone: (407)318-6781 Email: Diana.Mroue@SelectFlorida.org West Palm Beach/Southeast West Palm Beach/Southeast The West Palm Beach/Southeast office serves the following counties: Broward, Indian River, Martin, Okeechobee, Palm Beach and St. Lucie. John Diep, Director International Trade & Development 310 Evernia Street West Palm Beach, FL 33401 Phone: (561) 832-8339 Email: John.Diep@SelectFlorida.org 201 Alhambra Circle, Suite 610\nCoral Gables, Florida 33134 Phone: 305-808-3660 Fax: 305-808-3586 Grow Your Business in Florida Export from Florida For International Companies News & Resources About Follow Us Linkedin X © 2025, SelectFlorida, All Rights Reserved | Privacy Policy Search Search"
    },
    {
      "url": "https://www.mountdora.com/list/member/renninger-s-twin-markets-402",
      "text": "Renninger's Twin Markets | Antiques - publicLayout - Mount Dora Area Chamber of Commerce, FL ; Go Pages Members Categories Quicklinks Events Sales Achievement Luncheon Member Login Contact Us Join Toggle navigation Go Pages Members Categories Quicklinks Events Sales Achievement Luncheon Member Login Contact Us Join Home Business Directory Visiting Here Visitor Map - Your Virtual Guide To Downtown & Uptown Mount Dora Welcome Visitors Guide Page Hot Deals Living Here Local Resources Information Job Postings Mount Dora History Hot Deals Partner News About the Chamber Who We Are Why Join the Chamber Join Now Historic Train Depot Chamber Professional Affiliations Business Resources Partner 2 Partner Discounts Events Chamber Event Calendar Community Event Calendar Major Events & Festivals Chamber Annual Events Buy Tickets Here Renninger's Twin Markets Categories Antiques 20651 US Hwy 441 Mount Dora FL 32757 (352) 383-8393 (352) 383-7870 Visit Website Hours: Antique: Friday 10-4 Saturday & Sunday 9-5 Flea Market: Saturday & Sunday 8-4 About Us Renningers Flea Market and Antique Center is the perfect place to visit for a weekend adventure. Our two markets are sure to have something for every one with over 800 vendors here every weekend. Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Building Business. Building Community. Mount Dora Area Chamber of Commerce 341 Alexander St., Mount Dora, FL 32757 352. 383.2165 admin@mountdora.com © Copyright 2025 Mount Dora Area Chamber of Commerce. All Rights Reserved. Site provided by GrowthZone - powered by ChamberMaster software."
    },
    {
      "url": "https://staging.renningers.net/mt-dora/",
      "text": "Mt. Dora - Renninger's Promotions Skip to content Kutztown, PA Adamstown, PA Mt. Dora, FL Melbourne, FL Kutztown, PA Adamstown, PA Mt. Dora, FL Kutztown, PA Adamstown, PA Register Login Home Kutztown Kutztown Explore the Market Become a Vendor Kutztown Vendors Kutztown Events Extravaganza Places to Stay Contact/Directions Adamstown Adamstown Explore the Market Become a Vendor Adamstown Vendors Special Sunday Places to Stay Contact/Directions Mt. Dora Mt. Dora Explore the Market Become a Vendor Mt. Dora Vendors Mt. Dora Events Extravaganza Places to Stay Contact/Directions Melbourne Melbourne Explore the Market Become a Vendor Melbourne Vendors Contact/Directions Special Events Contact Us Explore The Markets Click Here Become A Vendor Click Here Check Out Our Vendors Click Here Upcoming Events Guitars and Cars September 14, 2025 8:00AM - 3:00PM Renninger's Mt. Dora Autumn Yard Sale September 19, 2025 8:00AM - 4:00PM September 20, 2025 8:00AM - 4:00PM September 21, 2025 8:00AM - 4:00PM Renninger's Mt. Dora Fall in the Field October 4, 2025 - October 5, 2025 - Renninger's Mt. Dora Florida Military Collectors' Show October 11, 2025 9:00AM - 3:00PM Renninger's Mt. Dora Florida Cannabis Festival: 6th Annual November 1, 2025 10:00AM - 5:00PM November 2, 2025 10:00AM - 5:00PM Renninger's Mt. Dora Guitars and Cars November 9, 2025 8:00AM - 3:00PM Renninger's Mt. Dora Antique and Collectors' Extravaganza November 14, 2025 8:00AM - 5:00PM November 15, 2025 8:00AM - 5:00PM November 16, 2025 8:00AM - 5:00PM Renninger's Mt. Dora Christmas at the Market December 6, 2025 9:00AM - 5:00PM December 7, 2025 9:00AM - 5:00PM Renninger's Mt. Dora Renninger’s Florida Twin Markets 20651 US-441 Mount Dora, FL 32757 Flea and Farmer’s Market Hours Saturday and Sunday: 8 AM to 4 PM (Flea and Farmer’s Market Not open on Fridays) Contact by Phone or E-mail (352)-383-3141 | E-mail Antique Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 | E-mail Consignment Center Hours Friday: 10 AM to 4 PM Saturday and Sunday: 9 AM to 5 PM Contact by Phone or E-mail (352)-383-8393 (Ask for Matthew) Note about Antique Center and Consignment Hours: On Fridays, many booths in the enclosed building are not staffed, as well as a number of buildings in the Street of Shops. On Saturdays and Sundays, all booths, consignment areas, the Stable, and the Street of Shops are open. Connect With Us On Facebook Renninger’s is a family-owned business. Explore The Markets News Explore The Market Kutztown Adamstown Mt. Dora Melbourne Become A Vendor Kutztown Adamstown Mt. Dora Melbourne Vendors Kutztown Vendors Adamstown Vendors Mt. Dora Vendors Melbourne Vendors Special Events Contact CONNECT WITH US Kutztown, PA Adamstown, PA Mt. Dora, FL Melbourne, FL Kutztown, PA Adamstown, PA Mt. Dora, FL Kutztown, PA Adamstown, PA Join Our E-mail List! Sign up to recieve news, event reminders, and updates from your favorite markets! We won't fill your inbox with junk. Sign Up Now!"
    }
  ]
}