{
  "fuentes": [
    {
      "url": "https://richtergroup.net/wired/about-us/",
      "email": "info@richtergroup.net"
    },
    {
      "url": "https://www.bookeventz.com/banquets/orlando/fl33896/rhythm-smooth-event-venue",
      "email": "info@bookeventz.com"
    },
    {
      "url": "https://business.seminolebusiness.org/list/member/rhythm-smooth-20218",
      "email": "info@seminolebusiness.org"
    },
    {
      "url": "http://www.smooth-events.com/Contact-us",
      "email": "info@smooth-events.com"
    },
    {
      "url": "https://www.sherburnaeroclub.com/meet-the-team",
      "email": "flightdesk@sherburnaeroclub.com"
    },
    {
      "url": "https://www.sewickleyquarter.com/contact-us",
      "email": "inquiry@sewickleyquarter.com"
    },
    {
      "url": "https://www.sewickleyquarter.com/contact-us",
      "email": "inquiry@sewickleyquarter.com"
    },
    {
      "url": "https://www.sewickleyquarter.com/contact-us",
      "email": "nquiry@sewickleyquarter.com"
    },
    {
      "url": "https://rhythmandsmooth.club/contact/",
      "email": "info@rhythmandsmooth.club"
    },
    {
      "url": "https://rhythmandsmooth.club/plan-your-event/",
      "email": "info@rhythmandsmooth.club"
    }
  ],
  "mails": [
    "flightdesk@sherburnaeroclub.com",
    "info@bookeventz.com",
    "info@rhythmandsmooth.club",
    "info@richtergroup.net",
    "info@seminolebusiness.org",
    "info@smooth-events.com",
    "inquiry@sewickleyquarter.com",
    "nquiry@sewickleyquarter.com"
  ],
  "nombre_sitio": "rhythmandsmooth.club",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://richtergroup.net/wired/about-us/",
      "text": "ABOUT US | Richter Entertainment Group HOME VENUES EVENTS TOURING ARTISTS IRONSTONE FRUITYARD ABOUT US SPONSORSHIPS Select Page ABOUT US Richter Entertainment Group is an independently owned live entertainment company that has been producing events internationally since the early 1990s. REG is a full service concert promoter, venue operator, tour, festival and special event producer. We deliver extraordinary events from intimate to large and loud, while ensuring effective, cutting edge, turn key service to our clients. If you can dream it, we will deliver it. Larry Richter Larry Richter is the founder and owner of Richter Entertainment Group (REG), a company that has played a significant role in the music and entertainment industry for over 30 years. His journey in the business began with a band in the ’70s and later expanded to promoting shows for the University of California, Santa Barbara in 1986 and 1987. It was during this time that REG was established as a management company, initially handling Common Sense and other artists. Larry’s career progressed as he took on various roles, from managing the Santa Barbara Bowl to working with Bill Silva Presents in the late 1980s. In 1991, Larry embarked on an international touring career, serving as a Tour Manager, Tour Accountant, and Tour Director for a diverse range of acts including Nirvana, Bon Jovi, Prince, Eric Clapton, Steve Martin, and Miley Cyrus. His involvement in the music industry continued, and REG evolved to produce and promote tours for artists such as Van Morrison and Paula Deen. In 1994, Richter Entertainment Group expanded its scope to include the Special Event space. Since then, the company has been designing and producing a wide array of events, from corporate functions like the Super Bowl to award show parties, private gatherings, and fundraisers. These events have ranged in size from intimate settings with 100 guests to large-scale productions hosting up to 40,000 attendees. REG collaborates with major corporations including FedEx, Coca-Cola, Hard Rock Hotels, and organizations like the American Diabetes Society. Larry Richter’s contributions to the industry go beyond his extensive experience. He brings to the team a wealth of relationships, innovative solutions, and a deep understanding of the entertainment business. Throughout his career, Larry has been instrumental in shaping and executing world-class concerts, tours, and events across the globe, leaving a lasting impact on the music and entertainment landscape. Larry brings extensive relationships, innovative solutions and a wealth of experience to the team. Articles about Larry: Touring Nirvana To Bon Jovi, A Talk With Larry Richter (Part I) Touring Nirvana To Bon Jovi, A Talk With Larry Richter (Part 2) Michael Richter Venue Production, Corporate Program Management, Touring Production Michael Richter has toured internationally and nationally as the production manager or lighting director with artists such as Van Morrison, Sammy Hagar, Brian Setzer Orchestra, REO Speedwagon, Melissa Etheridge, John Denver, Robert Cray Band, Kenny Loggins, Harry Belafonte, Huey Lewis and the News and Peabo Bryson. He has also served as the production manager for the Ironstone Amphitheare, Cox Arena at San Diego State University, the Coors Amphitheater in San Diego, Bill Silva presents, AEG inc., & Viejas Entertainment productions. In addition Michael works for Sound Image and is responsible for helping manage the companies touring division, i.e. production manager/tour account rep/tour support from their home base for the large roster of national touring acts that are on the road. Colleen Kennedy Colleen Kennedy has 35 years experience at the heart of the music/events business in Northern California.  She has worked with REG since 2005, as REG’s Box Office Queen at Ironstone and all other REG shows.  Colleen’s start in music/events was with Bill Graham Presents from 1980-1992.  She was the head of the Box Office for Bill Graham from ’85 until ’92. In addition to her extensive box office experience, Colleen has provided production and operation services on many major special events, festivals and stadium size concerts, such as: Nike Women’s Marathon, The Oracle Convention, Metallica, Dave Mathews, Outside Lands, Stone Soul Picnic and countless others. Billy Cohen Billy Cohen has 30 years of event marketing, publicity, promo, artist and event booking, event production and operations, and artist management experience.  Billy has worked with REG since 2005.  He is head of REG marketing, publicity and promo.  He also assists with Box Office and other show day operations.  Cohen started his career in NYC, and moved to Nor Cal after being personally hired by Bill Graham in 1990.  He has been a talent buyer for nine different nightclubs, and has provided talent buying services, production and operation services on special events and festivals, such as: Nike Women’s Marathon, The Bay To Breakers, Stone Soul Picnic and others. Jay Sheehan Ops Director A 30 year resident of San Diego, Jay Sheehan oversees the production management and stage management areas for the School of Theatre, Television and Film at San Diego State University. Additionally, Jay created and leads the Certificate in Entertainment Management Program for the School. As the faculty production manager, Jay oversees all aspects of production for all main stage and student productions. When he isn’t teaching, Jay also serves as the Logistics Coordinator for the Presidents campus wide Arts Alive SDSU initiative, promoting the visual and performing arts on campus. A published author, Jay has written the first book on production management in the USA. Along with Co-author, Cary Gillett, the two celebrated the release of The Production Managers Toolkit, on Routledge Press in September of 2016. Jay also serves as the National Production Manager for Young Arts, dedicated to help identify and support the next generation of artists in the literary, performing, visual and design arts. In this capacity, Jay oversees productions in Miami, and the Presidential Scholars program at the Kennedy Center in Washington D.C. Jay is an Equity stage manager, having spent 8 years at the Old Globe Theatre. Jay’s other jaunts around San Diego have found him as the Director of Production and Operations for the San Diego Symphony and Director of Operations for House of Blues, overseeing the 20,000 seat Coors Amphitheatre in Chula Vista. Jay is also owner of Cue One Productions and is a freelance special event manager who client list includes the NFL Super Bowls in Houston and Minneapolis, Major League Baseballs All Star Game and many non-profit charity concert events in and around the United States. Steve Allen Production Steve Allen brings 26 years of experience to REG where he has had oversight of all production items since 2014. Originally from Fresno, CA, Steve has held progressing production positions within the industry. Most notably, Steve provides production support for REG’s festival partner with the Warren Hill’s Jazz and SOL festivals in Cancun and Cabo San Lucas. Steve has been the touring stage manager for Moody Blues and REO Speedwagon, Touring Production Manager for Rob Zombie and Slayer.He has served as Production Manager for the Fillmore Auditorium Denverand for Bill Graham Presents and Live Nation Colorado. Additionally, Stevehas served as a Guest Speaker for Fresno State University and San Diego State University in Theatre and Production Management. Search for: Recent Posts Midland  with special guest Desure – 9/12/25 – Viejas Casino Train – 9/12/25 – Ironstone Three Dog Night & The Little River Band – 9/14/25 – The Fruit Yard Ringo Starr – 9/21/25 – Ironstone Midland – 9/26/25 – Hobb’s Grove Contact US Richter Entertainment Group 1314 E. Las Olas Blvd. Ft. Lauderdale, FL 33301 954-501-2011 For questions, band submissions and other communications the best way to contact us is via email: info@richtergroup.net Search Search for: News & Reviews RSS Error: A feed could not be found at `https://ironstoneamphitheatre.net/wired/category/news/feed/`; the status code is `503` and content-type is `text/html` Get The Latest News and Events REG Mailing list Your e-mail address is only used to send you our newsletter and information about the activities of Richter Entertainment Group. You can always use the unsubscribe link included in the newsletter. Email Address* FIRSTNAME* LASTNAME* ZIPCODE* Text Us for Pre-Sale Codes Click the link below to join our Text list and receive a test when pre-sale begins with a code! Https://my.community.com/regevents : ABOUT US Facebook X RSS Powered by CountryWired Inc close"
    },
    {
      "url": "https://www.bookeventz.com/banquets/orlando/fl33896/rhythm-smooth-event-venue",
      "text": "Rhythm & Smooth Event Venue Banquet Orlando | Banquet Hall - 30% Off Select City Destination Wedding USA Atlanta Austin Chicago Cincinnati Denver Las Vegas Los Angeles New Orleans New York Orlando Portland Sacramento San Diego San Francisco St. Louis Croatia Dubrovnik Split Zagreb France Bordeaux Lille Lyon Metz Nantes Nice Paris Rennes Strasbourg Toulouse Greece Athens India Agra Ahmedabad Aligarh Amritsar Bangalore Bhopal Bhubaneswar Chandigarh Chennai Coimbatore Dehradun Delhi NCR Destination Wedding Digha Faridabad Gandhinagar Ghaziabad Goa Gurgaon Guwahati Gwalior Hyderabad Indore Jabalpur Jaipur Jalandhar Jhansi Jodhpur Kanpur Kochi Kolkata Kota Kozhikode Lucknow Ludhiana Mangalore Mathura Meerut Mumbai Mussoorie Mysore Nagpur Nashik Noida Patiala Patna Puducherry Pune Raipur Rajkot Ranchi Shimla Shirdi Siliguri Surat Udaipur Ujjain Vadodara Varanasi Vijayawada Vishakhapatnam Indonesia Bali Bandung Jakarta Italy Bari Florence Genoa Naples Ravenna Rome Trieste Turin Venice Netherlands Amsterdam Singapore Singapore Thailand Bangkok Turkey Antalya Cappadocia Istanbul United Arab Emirates Abu Dhabi Dubai Fujairah Sharjah United Kingdom Aberdeen Belfast Brighton Cardiff Coventry Edinburgh Glasgow London Newcastle upon Tyne Plymouth Portsmouth Southampton York Venues By Type banquet halls in Orlando wedding venues in Orlando birthday party halls in Orlando 5 Star Banquet Halls in Orlando By Area Alachua Championsgate Howey In The Hills Maitland Melbourne Ocala Port Orange St. Augustine By Occasion Engagement Cocktail Party Conference Seminar Exhibition Kitty Party Convention Blog Invites Wedding Birthday party Corporate Ideas wedding birthday party corporate party Corporate build event microwebsite corporate event services List with us Home > Orlando > Banquets > FL33896 > Rhythm & Smooth Event Venue Rhythm & Smooth Event Venue FL33896, Orlando FL33896 4.1 Edit this Listing! Updated On: 4 Apr 2020 View Contact 50 - 150 Persons About Photos Pricing Address Reviews About Rhythm & Smooth Event Venue How to reach Rhythm & Smooth Event Venue : Rhythm & Smooth Event Venue is located in FL33896 and its closest landmark is 3950 S US Hwy 17 92 #2000, Casselberry , making it extremely easy to reach. Rhythm & Smooth Event Venue Highlights Capacity Minimum Capacity 50 Maximum Capacity 150 floating 150 theatre 100 cluster 50 Landmark: 3950 S US Hwy 17 92 #2000, Casselberry Menu Minimum Type Price / Plate Amenities Great for small parties Budget friendly Check Venue Availability & Book Rhythm & Smooth Event Venue Instantly Check Availability Venue Rhythm & Smooth Event Venue Availability (Morning) (Evening) Rhythm & Smooth Event Venue Pricing Taxes Applicable Rhythm & Smooth Event Venue Rates Rhythm & Smooth Event Venue Prices vary from Rs. 0 to Rs. 0. . But this also depends on the minimum guarantee given for Rhythm & Smooth Event Venue Booking. Hope all your queries regarding the banquet rates are answered by now. Book Rhythm & Smooth Event Venue FL33896 with BookEventZ to avail best discounted rates. Found an error in the information ? Help us rectify it. Report error Unlock Rhythm & Smooth Event Venue Discounted Price by BookEventz Date Occasion Unlock Deal Rating Distribution 0 5 0 Reviews 4 0 Reviews 3 0 Reviews 2 0 Reviews 1 0 Reviews Rhythm & Smooth Event Venue Reviews and Ratings Write a Review your time is important Schedule your visit to ensure manager is available when you reach Date Time Schedule Recce Rhythm & Smooth Event Venue Address Rhythm & Smooth Event Venue Location FAQ about Rhythm & Smooth Event Venue What is the starting menu price per person at Rhythm & Smooth Event Venue FL33896 Orlando ? The starting price per person is 0 for veg menu. The prices are kept reasonable keeping in mind your needs and budget. Taxes would be charged extra. Where exactly is Rhythm & Smooth Event Venue FL33896 Orlando located? The nearest landmark to reach there is  3950 S US Hwy 17 92 #2000, Casselberry. Its exact address is FL 32707 What is the seating & floating capacity of the Rhythm & Smooth Event Venue FL33896 Orlando ? It has a seating capacity of 100 and floating capacity of 150 What types of occasions can be celebrated at Rhythm & Smooth Event Venue FL33896 Orlando ? ✔ Birthday parties ✔ Weddings ✔ Birthday celebrations ✔ Engagement functions ✔ Corporate events ✔ Cocktail parties ✔ Small get-togethers How much will it cost to book for 100 people ? For Veg 0 Which forms of payment are accepted by Rhythm & Smooth Event Venue FL33896 Orlando ? ✔ Net Banking ✔ UPI ✔ Cash ✔ Debit/ Credit Cards ✔ Cheque/ DD How many people recommend Rhythm & Smooth Event Venue FL33896 Orlando & and what are the reviews of the Rhythm & Smooth Event Venue FL33896 Orlando Rhythm & Smooth Event Venue has recommended by 90% of people. Is liquor allowed? No, liquor is not allowed What is the timing of operations ? It starts at 7 AM to 12 midnight to hold any functions. The Sales Office is open from 10:30 AM to 8 PM. Are there changing rooms available ? No, there are no changing rooms available. However, there is enough accommodation available in nearby locations which we can help with. Will I get a separate dining area at\n                                            Rhythm & Smooth Event Venue\n                                          ? No, you will not get a separate dining area at Is there any cost chargeable for kids ? No cost is chargeable on food for kids aged below 6 years while half price is charged for kids aged between 6- 12 years of age. Is late night music allowed at Rhythm & Smooth Event Venue\n                                          ? No not allowed to have late night music. Is outside food/catering allowed at \n                                            Rhythm & Smooth Event Venue\n                                          ? No,\n                                                Rhythm & Smooth Event Venue does not allow outside caterers.. What is the booking amount required at \n                                            Rhythm & Smooth Event Venue? We charge  25%  to book the venue. Remaining amount is to be paid 7 days before the event. Ask A Question? Did not find what you were looking for ? Name +91 Get Expert's Call Back Frequent Searches Leading To This Page Rhythm & Smooth Event Venue for weddings Rhythm & Smooth Event Venue party hall FL33896 Rhythm & Smooth Event Venue function hall FL33896 Rhythm & Smooth Event Venue Photos Rhythm & Smooth Event Venue Menu Rhythm & Smooth Event Venue Reviews Rhythm & Smooth Event Venue FL33896 Address Rhythm & Smooth Event Venue FL33896 Contact Number Related Search Banquet Halls in localities of By Occasion By Type Of Venue By Popular Banquet Halls in By Blogs By Vendors Wedding Hotels in Ahmedabad Restaurants with Party Halls in Ahmedabad Best Party Lounges in Ahmedabad Wedding Lawns in  Ahmedabad Wedding Resorts in Ahmedabad 5 Star Wedding Hotels in Ahmedabad Cocktail Party Venues in Ahmedabad Seminar Venues in Ahmedabad 18th Birthday Party Venues in Ahmedabad Engagement Venues In Ahmedabad Bachelor Night Venues in  Ahmedabad Wedding Venues in Ahmedabad Corporate Event Venues in Ahmedabad Conference Halls In  Ahmedabad Annual Meet Venues In Ahmedabad Convention Halls In Ahmedabad About BOOKEVENTZ India's Largest Event Booking Portal About Us Team Contact Us FAQ Create Event Website List With Us Media Add Your Venue Feedback Real Events Offers Corporate Offerings Jobs Testimonial Blog +91 99 675 81110 info@bookeventz.com Banquet Halls by City Atlanta Austin Chicago Cincinnati Denver Las Vegas Los Angeles New Orleans New York Orlando Portland Sacramento San Diego San Francisco St. Louis Banquet by Area Alachua Championsgate Howey In The Hills Maitland Melbourne Ocala Port Orange St. Augustine Banquet by Venue Hotel Restaurant Lounge Resort Party Lawns 5 Star Hotel Training/Boardroom Banquet by Occasion Engagement Cocktail Party Annual Meet Naming Ceremony Conference Product Launch Mehendi Ceremony Wedding Anniversary Seminar Birthday Party First Birthday Party Wedding Baby Shower Corporate Event Terms Of Services Policies Get Final Price"
    },
    {
      "url": "https://business.seminolebusiness.org/list/member/rhythm-smooth-20218",
      "text": "Rhythm & Smooth | Conference Centers & Meeting Space - Seminole County Chamber Skip to content Join Why Join Member Benefits Apply Now Events Chamber Calendar Community Calendar Directory Full Directory Membership Map Restaurants Government & Education Non-profits Health Care Meeting Facilities Banking & Finance Our Groups Ambassadors Area Councils Chamber Committees Your Savings News Community News Chamber News Expert Advice Government News About Us Board Staff Trustees Other programs ChamberCast Certificate of Origin I’m Here! Chamber Crush Jobs Privacy Policy Contact Us Rhythm & Smooth Categories Conference Centers & Meeting Space 3950 South HWY 17-92 Suite 2000 Casselberry FL 32707 (407) 339-3301 Visit Website About Us Event venue Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Seminole County Chamber | Site by GrowthZone Privacy Policy Contact Us 407.708.4600 1055 AAA Drive, Suite 153, Heathrow, FL 32746 info@seminolebusiness.org © Seminole County Chamber.  All Rights Reserved. Site by GrowthZone Scroll To Top"
    },
    {
      "url": "http://www.smooth-events.com/Contact-us",
      "text": "Events Management | Exhibition organisers | Communications 0208 241 2249 info@smooth-events.com menu Home About Services Thinktank Events Testimonials Contact Us Cookie Policy Privacy Policy Contact Us * All Fields Are Required Submit We pride ourselves on our ability to build successful partnerships with our clients.  If you have any questions or are just starting to plan your next event and would like some advice please feel free to call us. You can also contact us using the form to your left or the links below. We look forward to working with you. 0208 241 2249 info@smooth-events.com Thinktank Our specialist division creates issue led events to inform policy and social change. Find Out More Services We provide a total event management solution through our tailored services. Find Out More Contact us Get in touch to discuss your next event or idea.  We look forward to hearing from you. Find Out More Smooth Events provides outstanding event management, brings experience and foresight to event planning, and serves as a strong client advocate in dealing with venues and vendors. These things were particularly important to us since we were planning the event from overseas.  The Smooth Events team are extremely professional, as well as friendly and a joy to work with. Our event would not have been the same without them. I would recommend them to anyone. Kristen Yarincik - Program Manager  - Census of Marine Life and the Consortium for Ocean Leadership With impeccable customer service standards, superb attention to detail and an unbeatable work ethic, Smooth Events are always our first choice. Whether we need a full event solution for a major client or registration services for one of our own events, we never hesitate to recommend them. And, on top of this, they are great people to work with. Keith Rodgers  - CEO, Webster Buchanan Research \"Multi-country Payroll and National Strategies conference You and your team were magnificent, truly magnificent.  They leapt right in and saved the day.  We all thank you for doing more than a job – much, much more than just a job. You and your great group put your hearts, heads and soul into making our dream work. Women in the world are in a better place and some of us who were working side by side with you are very grateful indeed. Jill Sheffield - President Emeritus, Family Care International We entrusted Smooth Events with two important conferences, two awards presentation events and a series of debate events over a period of less than twelve months - and they came up trumps every time.  In particular we decided to hold a Summer Conference in London at very short notice and relied on their expertise to make it all come together at top speed. Smooth responded to testing briefs – very tight schedules, a demanding audience sector, budget constraints – with a refreshingly positive and ‘can-do’ attitude. Colin Forbes  - Director of Communications, NHS Centre for Involvement Thank you so much for ensuring our first regional EYP conference and exhibition was a success; we have received a number of positive and inspiring comments from our delegates and exhibitors. This was a reflection on the dedicated hard work and support you gave us; we were impressed with your professional yet personal approach to our practitioners and the commitment you showed to us throughout the planning of the event. You ensured that every detail was accounted for and the day ran without a single problem and….smoothly! Kirsty Stickley - Training Co-ordinator, EECU on behalf of Hampshire, East and West Sussex, Surrey, Brighton and Hove and Portsmouth CC I can say no more than the conference was delivered by Smooth Events without a hitch, in a manner, and with a style, that impressed everyone from the venue staff and on-site contractors down to single-day delegates and various international dignitaries who turned up on the day with little (if any) advanced notice. I have personally organized or been on the organizing committee of half-a-dozen international scientific conferences/conventions and I have never worked with a more talented and professional event management team or one who was more committed to ensuring the success of the event for their client. Professor Norman MacLeod  - Keeper of Palaeontology - keeper of Palaeontology Natural History Museum About Us Our dedicated and highly experienced team works with clients to define and develop their events; providing the skills and resources to reach out and engage with key stakeholders, maximise delegate and sponsorship revenues and, of course, deliver exceptional project & logistics management.  We can provide any of our services independently; creating a bespoke service based on your needs, or manage the entire event from conception to delivery…smoothly. Quick Links Home About Services Thinktank Events Testimonials Contact Us Cookie Policy Privacy Policy Get in Touch * All Fields Are Required Submit © Copyright 2025 Smooth Events All Rights Reserved Website designed by IO Studios"
    },
    {
      "url": "https://www.sherburnaeroclub.com/meet-the-team",
      "text": "Meet The Sherburn Team | Staff & Board Members Pilot Info RNP IAP Weather Cam VFR PPR Inbound PPR Book Out Members Login Register ​ 01977 682 674 ​​​   | flightdesk@sherburnaeroclub.com | Contact Form 122.610   | The Aerodrome, New Lennerton Lane, Sherburn in Elmet, LS25 6JE Opening Hours Our Summer operating hours are: Monday to Sunday - 9am - 7.30pm Opening hours will be reviewed and may be subject to change. Any changes will be notified to the Members in advance. Outside these times please email: flightdesk@sherburnaeroclub.com Menu Home (current) About Us About SAC Memberships Club Board & Team Our Fleet Recruitment Flight Sim Group Our Business Friends Club & Airfield Visitor Information Weather & Webcam Engineering Local Community Airfield Prices Food & Drink Aircraft Shares/Sales Items for Sale Photo Gallery News & Events (current) Flight Training Learn to Fly Private Pilot PPL e-Exams FRTOL Course Pilot Medicals Price List Experience Flights View All Experiences PA28 - 30 mins PA28 - 60 mins C150 - 30 mins C150 - 60 mins C152 Aerobatic - 45 mins Yorkshire Coast - 90 mins Dambusters - 75 mins Yorkshire Dales - 90 mins Meet the Team The Board of Directors The Board of Directors are responsible for the financial, health & safety, human resources and managerial aspects of the club. Members of the board are voted on at the Annual General Meeting. Appointment to the board is a rolling process to assure some continuity from one year to the next. Directors of the club are unpaid volunteers. The board members take on specific oversight of various aspects of the club as well as the general responsibilities in running one of the most successful flying clubs in the UK. James Pearson Pilot Development and Touring James Perkins Strategic Initiatives Jim Trueman Deputy Chairman Kate Howe Admin, Membership and Compliance Ken Brown Site Infrastructure Ray Castlehow Site Maintenance Robert McLaughlin Community Liaison and Promotions Simon Cook Chairman, Operations and Finance Steve Hallas Board Advisor Airfield Team The team at Sherburn are always here to help and make you feel welcome, whether you are visiting us just to have a look around, take a look at our training and club facilities or flying in from another airfield.  Our team are on hand whatever your needs. Dave Salt Airfield Line Supervisor Paul Moss Head of Flight Training Operations Team Abi Atkin Operations Assistant Charlotte Tomlinson Operations Assistant Faye Ward Operations Team Leader Jack Endersby Operations Assistant Josh Reynolds Operations Assistant Sam Leonard Operations Assistant Ground Crew Ben Hacker Ground Crew Bradley Piggin Ground Crew Fraser Mitchell Ground Crew Giles Eagin Ground Crew Jack Roden Ground Crew James Whitaker Ground Crew John Crossland Ground Maintenance and Ground Crew Lyndon Sandie Ground Crew Thomas Calpin Ground Crew Tony Nolan Ground Crew Flying Instructors Alastair Breckon Flight Instructor Chris Herd Flight Instructor Glenn Moody Flight Instructor James Fletcher Flight Instructor Jason Gilmour Flight Instructor Jonathan Furness Flight Instructor Louis Rehor Flight Instructor Pete Barber Flight Instructor Peter Atkinson Flight Instructor Salvador Moya Flight Instructor Steve Osborne Flight Instructor Vernon Guppy Flight Instructor Want to work with us? Check out our Recruitment page Contact Us ​ Call: 01977 682 674 ​​​ Email: flightdesk@sherburnaeroclub.com Sherburn Radio: 122.610 The Aerodrome, New Lennerton Lane, Sherburn in Elmet, LS25 6JE Opening Hours Our Summer operating hours are: Monday to Sunday - 9am - 7.30pm Opening hours will be reviewed and may be subject to change. Any changes will be notified to the Members in advance. Outside these times please email: flightdesk@sherburnaeroclub.com © Copyright - Sherburn Aero Club Ltd  | Blog | Terms & Privacy | Contact Us |  Website by CJS Web Your experience on this site will be improved by allowing cookies. Allow cookies"
    },
    {
      "url": "https://www.sewickleyquarter.com/contact-us",
      "text": "contact us | Get in Touch Today — Sewickley Quarter 0 Skip to Content weddings our story restaurant contact us Open Menu Close Menu weddings our story restaurant contact us Open Menu Close Menu weddings our story restaurant contact us Sewickley Quarter we can’t wait to celebrate you. PLEASE PROVIDE A FEW DETAILS TO BOOK A TOUR WITH US. INQUIRY@SEWICKLEYQUARTER.COM (412) 420 - 7819 545 BEAVER STREET SEWICKLEY, PA 15143 Name * First Name Last Name Email * Phone * (###) ### #### Event Date * MM DD YYYY Event type * Wedding Rehearsal Dinner Bridal Shower Baby Shower Birthday Party Corporate Event Other Est. guest count * How did you hear about us? Instagram Google Burgh Brides Word of Mouth Referral Tell us More! * Thanks again for inquiring with us. Please refer to the wedding and private event packages. During wedding and event weekends, all emails will be answered when we return to the office on the following Tuesday. Inquire Grand Intimacy With Quintessential Charm Beautifully situated and rich in history, Sewickley Quarter is a romantic French Quarter-inspired wedding venue grown from the notion that love and passion combined with intimacy and romance lend itself to the fairytale wedding of your dreams. OUR STORY WEDDINGS RESTAURANT 545 Beaver St., Sewickley, PA 15143 Tel: 412.420.7819 i nquiry@sewickleyquarter.com BRAND & WEB | FORE FOLK"
    },
    {
      "url": "https://rhythmandsmooth.club/contact/",
      "text": "Contact Us – Rhythm & Smooth Venue Weddings Events Ballroom Dance Center Gallery Contact Us Plan Your Event Menu Contact Us 3950 S. US HWY 17-92 SUITE 2000 CASSELBERRY, FL 32707 Phone: 407-339-3301 Email: info@rhythmandsmooth.club Visit our Plan Your Event Page to inquire about a specific date and event you would like to plan or call us now for pricing specific to your event. Considering a gala, dance or concert? Consider the ballroom at Rhythm & Smooth. Wedding receptions fare well in this setting, but romantic endeavors are not the only option for this venue. Kick-off bashes, welcoming parties, appreciation dinners and dances as well as business social hours are in full swing at Rhythm & Smooth. Maps were disabled by the visitor on this site. Menu Weddings Events Ballroom Dance Center Gallery Contact Us Plan Your Event Venue Address 3950 S. US HWY 17-92 SUITE 2000 CASSELBERRY, FL 32707 (407) 339-3301 info@rhythmandsmooth.club View our Pinterest for more pictures and decor ideas! Rhythm & Smooth Facebook Leave us a Wedding Wire Review Leave us a Google Review Our Site is Secure © Copyright 2017 - Rhythm & Smooth Venue Facebook Scroll to top"
    },
    {
      "url": "https://rhythmandsmooth.club/plan-your-event/",
      "text": "Plan Your Event – Rhythm & Smooth Venue Weddings Events Ballroom Dance Center Gallery Contact Us Plan Your Event Menu Plan Your Event Rhythm & Smooth offers flexible vendor policies, easy set up and a great open floor plan to make your special event a success. Open 7 days a week for events and ballroom dancing. For more information please call: 407-339-3301 or email: info@rhythmandsmooth.club Select a date & event type We will contact you to complete your event reservation. Name * Event Date * E-Mail * Phone: * Event Type * Wedding Ceremony and Reception Wedding Ceremony Wedding Reception Bridal Shower Baby Shower Birthday Sweet Sixteen Quinceanera Bat or Bar Mitzvah Vow Renewal Wedding Anniversary Celebration Family Event Business Conference Business Dinner Seminar Team Building Event Trade Show Networking Event VIP Event Award Ceremony Board Meeting Incentive Event Fundraiser Other Dates are Flexible Inquire by Phone Prefer to make your reservation via phone? Give us a call! Our Phone number is 407-339-3301. Previous Next 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Menu Weddings Events Ballroom Dance Center Gallery Contact Us Plan Your Event Venue Address 3950 S. US HWY 17-92 SUITE 2000 CASSELBERRY, FL 32707 (407) 339-3301 info@rhythmandsmooth.club View our Pinterest for more pictures and decor ideas! Rhythm & Smooth Facebook Leave us a Wedding Wire Review Leave us a Google Review Our Site is Secure © Copyright 2017 - Rhythm & Smooth Venue Facebook Scroll to top"
    }
  ]
}