{
  "fuentes": [
    {
      "url": "https://tampamagazines.com/directory-restaurants/listing/ricks-on-the-river/",
      "email": "logo_darkmode@2x.png"
    },
    {
      "url": "https://www.ricksnorthaustin.com/contact/",
      "email": "sales.ricksaustin@nightlifehospitality.com"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "email": "teachertraining@theriveryogadenver.com"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "email": "retreats@theriveryogadenver.com"
    },
    {
      "url": "http://www.riversorg.com/content/our-team",
      "email": "diane@riversorg.com"
    },
    {
      "url": "http://www.riversorg.com/content/our-team",
      "email": "marilyn@riversorg.com"
    },
    {
      "url": "http://www.riversorg.com/content/our-team",
      "email": "terry@riversorg.com"
    }
  ],
  "mails": [
    "diane@riversorg.com",
    "logo_darkmode@2x.png",
    "marilyn@riversorg.com",
    "retreats@theriveryogadenver.com",
    "sales.ricksaustin@nightlifehospitality.com",
    "teachertraining@theriveryogadenver.com",
    "terry@riversorg.com"
  ],
  "nombre_sitio": "ricksontheriver.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://tampamagazines.com/directory-restaurants/listing/ricks-on-the-river/",
      "text": "Rick’s on the River - Tampa Magazine No Result View All Result Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture ADVERTISE SUBSCRIBE ABOUT PURCHASE A COPY DIGITAL ISSUES EMAIL NEWSLETTERS CONTACT US SHOP MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout No Result View All Result No Result View All Result Rick’s on the River by Rachel April 24, 2025 Share on Facebook Share on Twitter All Listings 2020-21 Tampa Bay Charity Register > Rick’s on the River Rick’s on the River Category: 2024 Best Beach Restaurant Rick’s on the River Tampa, FL Visit Website Back to All Listings Back to Charity Register Tampa, FL Tampa, FL [instagram-feed] Next Post TAMPA Magazines 2024 Best Restaurants: Best Burger Joint Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture Advertise About Subscribe Purchase a Copy Digital Issues Email Newsletters Contact Privacy Policy © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network. No Result View All Result Tampa Culture Food and Drink Home & Garden Travel Moving Tampa Sporting Health Local Knowledge Advertise About Subscribe Purchase a Copy Shop Digital Issues Email Newsletters Contact MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network."
    },
    {
      "url": "https://www.ricksnorthaustin.com/contact/",
      "text": "Contact | Get In Touch with Rick's Cabaret Skip to main content Toggle navigation (512) 218-8012 get directions Home Club Features Features Birthday Parties Bachelor Parties Restaurant Menu VIP Packages Events Shop Contact Careers Entertainers Contact Us Contact Rick's Call Us Want to speak to a live person? Whether you're looking to purchase a bottle, book a table, or want to know if your favorite dancer is working, call us anytime! Club Information (512) 218-8012 VIP Packages (800) 413-1683 Reservations Have questions? Email us any time and we'll be happy to answer any questions. One of our managers will get back to you within 24 hours. Inquire Follow Us Want to keep up with our latest events? Follow us on Facebook, Twitter, Instagram, and Google+ to stay informed of our always exciting upcoming events. Contact Us Sign-up for Special Offers (Events, Bithdays, Holidays, etc.) Yes, sign me up, please! Send Thanks for contacting us. We will be in touch soon. Terms of Service | Privacy Policy CLUB HOURS Sunday 12:00 pm - 2:00 am Monday 11:00 am - 2:00 am Tuesday 11:00 am - 2:00 am Wednesday 11:00 am - 2:00 am Thursday 11:00 am - 3:00 am Friday 11:00 am - 4:00 am Saturday 11:00 am - 4:00 am Visit Us At (512) 218-8012 3105 South Interstate 35 Round Rock, TX 78664 VISIT US AT 3105 South Interstate 35 Round Rock, TX 78664 (512) 218-8012 SUBSCRIBE TO OUR NEWSLETTER Join our digital mailing list to receive updates on specials, events & features, & receive a FREE Cover Pass Free Cover Pass Click To Print 3105 South Interstate 35 Round Rock TX 78664 For more info call us at: (512) 218-8012 Socialize With Rick's Cabaret North Austin OOPS! We encountered the following error while processing your reservation: If you continue to have issues completing your reservation, please contact us at (800) 413-1683 or click on the \"LIVE CHAT\" button below to speak with one of our support specialists. Close Are you over 18 years of age? Yes No About us RCI Internet Services, Inc., All Rights Reserved. Rickâs Cabaret, Club Onyx, Silver City, XTC Cabaret, Foxyâs Cabaret, Hoops Cabaret, The Seville Club and Bombshells Restaurant and Bar are registered trademark of RCI Hospitality Holdings, Inc. All links to social media platforms found linked from this website are provided as a service and convenience to our guests. We make no representation concerning the content, quality, accuracy, legality or suitability of their content. Rick's Cabaret makes no endorsement, expressed or implied, to any social media platforms, and as such is not responsible for their content. All photos are stock photos, posed by model. News | Other Brands | Terms of Service | Privacy Policy | ADA Compliance Statement Â© Rick's Cabaret North Austin"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "text": "Contact Us: We're Here to Help! Reach Out to Our Denver Denver Yoga Studio | The River Yoga | Golden Triangle, Sunnyside, Five Points &amp;amp;amp;amp;lt;img height=\"1\" width=\"1\" style=\"display:none\"\n  src=\"https://www.facebook.com/tr?id=646216975547069&amp;amp;amp;amp;amp;ev=PageView&amp;amp;amp;amp;amp;noscript=1\"\n/&amp;amp;amp;amp;gt; 0 Skip to Content About Meet the Team Mission & Vision Contact Us River Partners + Community Locations Golden Triangle Sunnyside Five Points Schedule Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Pricing Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Open Menu Close Menu About Meet the Team Mission & Vision Contact Us River Partners + Community Locations Golden Triangle Sunnyside Five Points Schedule Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Pricing Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Open Menu Close Menu Folder: About Back Meet the Team Mission & Vision Contact Us River Partners + Community Folder: Locations Back Golden Triangle Sunnyside Five Points Folder: Schedule Back Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Folder: Pricing Back Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Contact Us We’d love to hear from you! General Inquiries hello@theriveryogadenver.com To cancel or pause your membership you must notify us via our Membership Change Form at least 7 days before your next billing date Teacher Training & Continuing Ed. Inquiries TeacherTraining@theriveryogadenver.com Retreats retreats@theriveryogadenver.com Frequently Asked Questions Visit us at our 3 Denver, CO locations and online: Five Points Sunnyside Golden Triangle Online Studio Name * First Name Last Name Email * Message * Thank you! Locations Golden Triangle Sunnyside Five Points HELP Contact Us My Account Membership Changes FAQ Careers Connect Newsworthy Gift Cards Nominate a River Magic Maker Community Partners ©2025 The River Yoga | Privacy Policy | Terms and Conditions | Disclaimer | Photography by Jes Kimak | Videography by Reah Agency"
    },
    {
      "url": "http://www.riversorg.com/content/our-team",
      "text": "Our Team | The Rivers Organization Skip to main content Association Management Association Management Association Management Services Case Studies Quote Request Form Event Planning Event Planning Event Planning Services Case Studies Quote Request Form Fundraising Fundraising Case Studies About Us About Us Our Team Partners Testimonials Events Contact Us Working with The Rivers Organization makes it easy and convenient. We learn your needs, and plan accordingly. Our Team Theresa Parker Duane Executive Director - Owner, November 1, 2024 Terry is dedicated, detail-oriented and eager to share her experiences as clients discuss the options for their events and promotion. She joined the Rivers Organization in 2008 as Events Director and was promoted to Executive Director of The Rivers Organization in 2020. Terry serves as the Association Executive Director for several client associations. She has over thirty years of experience in government relations, coordinating events, and association management. Terry oversees all association services from start to finish—board training, lobbying, development, marketing, implementation. She adapts plans to meet client expectations and she anticipates their needs, ensuring one successful year after another. Previously, Terry served as the Events Director & Government Relations Specialist at Monroe County Fair & Recreation Association and Special Assitant to the President of the Monroe County Legislature. Phone: 585-586-6906 | E-mail: terry@riversorg.com Marilyn Giannoccaro Office Manager, Client’s Bookkeeper Marilyn is experienced, attentive and meticulous. She joined The Rivers Organization in 1991 with over 20 years of bookkeeping experience. Her skills include tax preparation, payroll, budget planning, and sales tax reports. For all associations managed by The Rivers Organization, Marilyn prepares detailed financial reports that include profits & loss, balance sheets, and monthly/yearly budget comparisons. Marilyn also manages budgets for all events planned by The Rivers Organization. Prior to The Rivers Organization, Marilyn worked as a bookkeeper at Travel Flair and Joe Caruso Tours in Rochester. Phone: 585-586-6906 | E-mail: marilyn@riversorg.com Diane Chevron Director of Development Diane is organized, focused, and ready to take on any project. She joined The Rivers Organization in 2009 with over 25 years of experience in fundraising for both nonprofit and for-profit organizations. Diane’s expertise in dealing with corporation heads and staff, leads to repeated sponsor retention and satisfied clients. She assists clients in fundraising, membership enhancement, promotion of their businesses, and attaining their project goals. She previously served as the Director of Corporate Relations at the American Heart Association, spearheading the Heart Ball and the Go Red for Women Luncheon. In addition Diane worked on the 20th Anniversary of Corn Hill Landing and raised funds so the Broad Street Aqueduct could be converted to host Dinner in the Ditch at the World’s Canal Conference. Phone: 585-586-6906 | E-mail: diane@riversorg.com Richard C. Rivers, CAE Founder, The Rivers Organization, 1989 - November 1, 2024 Rick has over 55 years experience in the meeting, convention and travel industry. He was CEO of Visit Rochester, formerly the Rochester Convention and Visitors Bureau from 1978-1987, and COO from 1987-1989. He serveed as Executive Director to several of The Rivers Organization’s Association clients. He is also a meeting planner for numerous conventions, tradeshows and events. Rick has served in volunteer leadership positions in a variety of state, local and national organizations including as President of the N.Y.S. Association of Convention & Visitors Bureau, Treasurer of the NYS. Travel & Vacation Association, and Member of the Governor’s Tourism Advisory Council under Mario Cuomo. He is a founding member and past-chair of CANAL NEW YORK, Marketing and Business Alliance, Inc., a statewide organization formed in 2006. Rick continues as a consultant and friend to The Rivers Organization and its clients. Experience We understand how organizations work, how to coordinate events, and the importance of motivating volunteers. We can determine where to host an event, when to send out invitations, how to optimize content to reach your audience and help you achieve your goals. Our services are tailored to fit your needs. Professionalism Our mission is to have your members and prospects harbor good feelings about your association. Our entire staff is always courteous and accommodating. We serve as ambassadors on your behalf. Capability Always ready when you need us, respectfully not when you don’t—we offer a wide range of services to help you manage your organization more effectively, plan an event more successfully, or simply step in to handle an immediate need. Reliability We establish schedules, we meet deadlines and maintain records for every event and meeting. If a communication needs to be sent on an exact date, you can count on us. If you need a database several years after an event, we’ll have it for you. Proactivity We focus on your return on investment by being an asset, not an expense. By pooling our experience and creativity, we generate ideas that really make a difference. Association Management Association Management Services Case Studies Quote Request Form Event Planning Event Planning Services Case Studies Quote Request Form Fundraising Case Studies About Us History Our Team Partners Testimonials Contact Us Search form Search Search Copyright © The Rivers Organization, All Rights Reserved. Website Design & Development by Archer Communications, Inc."
    }
  ]
}