{
  "fuentes": [
    {
      "url": "https://burgerbeast.com/rickeys-sports-bar-grill-pembroke-pines-florida/",
      "email": "burgerbeast@burgerbeast.com"
    },
    {
      "url": "https://rickeyswings.com/",
      "email": "rickeyswings@aol.com"
    },
    {
      "url": "https://www.siliconvalley.com/2023/05/11/san-leandro-legendary-raider-nation-sports-bar-rickys-is-making-a-comeback/",
      "email": "lzavoral@bayareanewsgroup.com"
    }
  ],
  "mails": [
    "burgerbeast@burgerbeast.com",
    "lzavoral@bayareanewsgroup.com",
    "rickeyswings@aol.com"
  ],
  "nombre_sitio": "rickeyssportsbarandgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://burgerbeast.com/rickeys-sports-bar-grill-pembroke-pines-florida/",
      "text": "The King Of Kong Is Waiting: Rickey's Sports Bar & Grill in Pembroke Pines Reddit YouTube Instagram Facebook X (Twitter) Pinterest TikTok Tumblr LinkedIn RSS HOME BURGER BEAST APPROVED BURGER TALK BEST BURGERS MIAMI BEST BURGERS BROWARD BEST FRITAS IN MIAMI BEST BURGERS ORLANDO BEST OF LISTS GUIDES COMFORT FOOD FOOD HISTORY EVENTS CROQUETA PALOOZA FOOD TRUCKS RECIPES MERCH PODCAST NEWSLETTER ABOUT HOME COMFORT FOOD BROWARD Rickey’s Sports Bar and Grill in Pembroke Pines In BROWARD Rickey’s Sports Bar and Grill in Pembroke Pines By BEAST September 28, 2008 SHARE Facebook Twitter Pinterest Email LinkedIn Tumblr Reddit WhatsApp Years ago, I bought a gigantic jug of Rickey’s World Famous Hot Sauce. At the time, I didn’t realize there was an affiliation between the hot sauce and the most significant classic arcade game player. If you’ve watched the film The King of Kong: A Fistful of Quarters as often as I have, you develop an unhealthy obsession with whoever is the reigning Donkey Kong champ. The owner of Rickey’s Sports Bar & Grill is Billy Mitchell : former Donkey Kong champ, Pac-Man champ, and “ Video Game Player of the Century .” This is the main reason I drove to Rickey’s Sports Bar & Grill in Pembroke Pines. Rickey’s Sports Bar and Grill in Pembroke Pines, Florida We started with a few apps: potato skins – pretty standard stuff topped with cheese, bacon, sour cream, and scallions ; loaded large french fries – another unnecessary potato app topped with chili, cheese, and bacon; quesadillas – nothing special ; chicken strips with fries and ten pieces of their original wings. We ordered the wings naked, aka sans breading, served with their famous sauce. The sauce options were mild, medium, hot, garlic, jalapeño, or habanero. The wings were pretay, pretay good, but the sauce hit the spot. I want to point out that my wimpy friend made us eat medium when we indeed would have gone for the jalapeño sauce. For the main event, I chose the bacon double cheeseburger: double 1/3 lb. patties with bacon and cheese served with fries. It was nothing out of the ordinary and a bit underwhelming. Is Billy Mitchell In? Rickey’s Sign The service was excellent, and when I asked our server about Billy Mitchell, he mentioned that he was back in the office. So I purchased a bottle of Rickey’s World Famous Hot Sauce and asked if I could get Billy’s autograph. He left with the bottle and came back with this on it: “Remember Always Play To Win, Always – Billy Mitchell. “ Billy Mitchell signed my bottle of Rickey’s Hot Sauce Rickey’s Sports Bar & Grill 8389 Pines Boulevard Pembroke Pines, FL (954) 744-4697 Website – https://rickeyssportsbarandgrill.com Instagram – https://www.instagram.com/rickeysgrill Monday 5:00 pm – 12:00 am Tuesday 5:00 pm – 12:00 am Wednesday 5:00 pm – 12:00 am Thursday 5:00 pm – 3:00 am Friday 5:00 pm – 4:00 am Saturday 4:00 pm – 3:00 am Sunday 12:00 pm – 12:00 am Author BEAST For almost two decades Burger Beast has documented his burger and comfort food excursions and food history findings via his blog and social media. Website Related Posts All About the Burger King Whopper September 10, 2025 Shipley’s Do-Nuts of Texas in Jacksonville, Florida September 7, 2025 IHOP Miami: From Pancakes to Burgers and Back Again September 5, 2025 Write A Comment Cancel Reply Save my name, email, and website in this browser for the next time I comment. © 2025 BURGER BEAST Top"
    },
    {
      "url": "https://rickeyswings.com/",
      "text": "Home - Rickey's Restaurant (954) 966-1429 Facebook Instagram Facebook Instagram Home Our Story Our  Menu Gallery Contact Us Select Page Welcome to Rickey’s Restaurant Rickey’s Restaurant was established in 1955 when Hollywood Boulevard was still just a dirt road. It was established by a couple, William and Barbara Mitchell who bought the Rickey’s location in 1974, five years after moving from Massachusetts to Florida with their five kids. When Rickey’s first opened, it was just a bar serving cold sandwiches and hamburgers. In 1978, Barbara came up with a hot sauce recipe which would be used to create our signature chicken wings. In 1996, we began serving twin Maine lobsters which became another of our signature dishes because we had the lowest price in town. More About Us Cold Beer Good Vibes Excellent Food Explore Our Menu From hot sandwiches to specialty seafood, our robust menu offers something for everyone! View Menu Clients Testimonials “An amazing restaurant! The best wings in all of Florida. I always get 20 medium garlic! And they knock it out of the park every single time! With that being said, they do other things really well. I also really like their steamed clams and burgers as well as just about anything on the menu.  ” – Kevin W. HOLLYWOOD, FLORIDA’S “CHEER’S”. Relaxed, Sports Crazy, Delicious Food, Excellent Staff, did I mention really Great Chicken Wings… Definitely a family and friends kinda establishment. Kid friendly. – Korina S. Been coming here since the 70’s. The best wings ever and the lobster special is unbelievable. – William L.  Call us at (954) 966-1429  Email rickeyswings@aol.com  Location 4799 Hollywood Blvd, Hollywood, FL 33021 } Restaurant Hours Sun-Wed 11 AM –12 AM Thurs – Sat 11 AM–2 AM “Happy Hour” Daily 4 PM–7 PM, 10 PM–2 AM Follow Follow Home / Our Story / Our Menu / Gallery / Contact Us Copyright © 2025 Rickey’s Restaurant | All Rights Reserved. | Privacy Policy | Powered by Affordable Digital Marketing Sign up for Monthly Discounts & Specials Leave this field empty if you're human:"
    },
    {
      "url": "https://www.siliconvalley.com/2023/05/11/san-leandro-legendary-raider-nation-sports-bar-rickys-is-making-a-comeback/",
      "text": "San Leandro: Legendary Raider Nation sports bar Ricky's is making a comeback Skip to content All Sections Subscribe Now 74°F Wednesday, September 10th 2025 Today's E-Edition Home Page Business Technology Commercial Real Estate Housing Marketplace The Mercury News Branded Content Paid Content by Brandpoint SUBSCRIBE NOW Sign up for email newsletters Sign Up Legendary Raider Nation East Bay sports bar… Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to print (Opens in new window) Print Subscribe Account Settings Contact Us Log Out Spoof a user Sign up for email newsletters Sign Up Subscribe Search 74°F Wednesday, September 10th 2025 Today's E-Edition Business Technology Commercial Real Estate Housing Marketplace The Mercury News Business SUBSCRIBER ONLY San Leandro: Legendary Raider Nation sports bar Ricky’s is making a comeback Remodeled and renamed \"Rickey's,\" the bar will welcome fans of all Bay Area sports teams — present, past and the one that plans to leave Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to print (Opens in new window) Print The former Ricky’s Sports Bar has been renamed Rickey’s Sports Lounge by new owner Ramonn Smith in San Leandro, Calif., on Thursday, May 11, 2023. The legendary bar that was home to the Raider Nation for decades has been reopened and a grand opening celebration is expected in June, Smith said. (Ray Chavez/Bay Area News Group) By Linda Zavoral | lzavoral@bayareanewsgroup.com | Bay Area News Group UPDATED: May 12, 2023 at 1:38 AM PDT The walls have been stripped of the jerseys of the greats — Otto, Sistrunk, Plunkett, Blanda, Chester — and the historic sideline photo of Madden and Stabler. Also gone are the display cases filled with helmets, pennants, programs, “Reserved for Al Davis” and “Commitment to Excellence” signs, a “JST WIN BBY” license plate and other Oakland Raiders memorabilia. But the legendary Ricky’s sports bar in San Leandro has reopened, three years after its beloved founder died, giving Raider Nation a home to call its own again. Customers had feared that the business, which Sports Illustrated had famously named the No. 2 sports bar in the nation, wouldn’t survive the death of owner Ricky Ricardo and the pandemic shutdown. “It was awesome,” said Tim Pinney, of San Leandro, who wore Raiders gear on his first return visit. “I look forward to going back there for more sporting events, especially Raiders games.” The former Ricky’s Sports Bar has been remodeled and renamed Rickey’s Sports Lounge in San Leandro. (Ray Chavez/Bay Area News Group) That’s the sort of “wow” response new owner Ramonn Smith has been hearing. A Richmond resident who was raised in Oakland, he had rarely set foot inside Ricky’s but knew of its renown. “I came in twice — in 2004 and once maybe eight years later,” he said. He’d previously co-owned a Berkeley restaurant and had always wanted to have a sports bar. He started talking with Tina Ricardo, Ricky’s widow, a year ago, then bought the business and set about renovating the interior and upgrading the infrastructure and menu in November, with a plan to “transition to a sports bar for all fans but keep that Raider base.” The bar has been in its current location on Hesperian Boulevard since 1960, though Ricky Ricardo’s father, a San Leandro native, opened the business in 1946. “I wanted to make it more 2023ish,” said Smith, who transformed the dark, neon-lit bar into a fresh, airy space. “Now you can see from one end of the bar to the back room.” Rickey’s Sports Lounge owner Ramonn Smith shows the Lounge Theater at the former Ricky’s Sports Bar in San Leandro. (Ray Chavez/Bay Area News Group) There are 40 TVs, including two large screens for big sporting events outdoors. In the room he calls the Fantasy Lounge, where 11 screens are mounted, “the true Fantasy League fan can sit and watch all the games at once.” He also changed the original name and the spelling, Ricky’s Sports Theatre & Grill, to reflect the beginning of a new era while still paying homage to the founder. It now sports an “E” in the name and is called Rickey’s Sports Lounge. Members of Raider Nation — some still fans, others no longer since the team’s move to Las Vegas — were back in the house Wednesday evening, though the emphasis was clearly on whether that other former Oakland team, the Golden State Warriors, would come roaring back against the Los Angeles Lakers in the NBA playoffs. There was lots of support for the new Rickey’s look and management. “It was great,” said Oakland native Chris Dobbins, co-founder of Save Oakland Sports, which used to hold its meetings at the old place. “I like what Ramonn has done. It’s a lot lighter. And the food’s better.” He expects the Oakland group will resume meeting there. “This was my oasis,” said Brandon Jones, of Oakland, who started hanging out at the bar when the team moved back from Los Angeles, though he was always “more of a Jerry Rice fan than a Raiders fan.” “Ricky is gone, so it’s not the same. It looks a lot different from the way it used to look. “But it’s still cool.” Details: Inaugural hours for the new Rickey’s Sports Lounge are Wednesday through Sunday from 3 to 11 p.m., with expanded hours planned for summer and when football season starts. 15028 Hesperian Blvd., San Leandro. Originally Published: May 11, 2023 at 4:25 PM PDT Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to print (Opens in new window) Print RevContent Feed Most Popular Most Popular California in talks to pay hundreds of millions to Valero to stave off Bay Area refinery shutdown California in talks to pay hundreds of millions to Valero to stave off Bay Area refinery shutdown Walmart will shut East Bay store and eliminate scores of jobs Walmart will shut East Bay store and eliminate scores of jobs Former Safeway site in downtown San Jose lands local buyer Former Safeway site in downtown San Jose lands local buyer Sale of apartment hub with hundreds of units near East Bay BART stop points to weakening market Sale of apartment hub with hundreds of units near East Bay BART stop points to weakening market San Jose retail center deal signals interest in South Bay San Jose retail center deal signals interest in South Bay Nvidia scoops up Santa Clara building as company widens holdings Nvidia scoops up Santa Clara building as company widens holdings California’s Great America chops jobs as uncertainty looms California’s Great America chops jobs as uncertainty looms Redwood City considers 21-story tower to serve older residents Redwood City considers 21-story tower to serve older residents Historic downtown San Jose building is bought for more than $3 million Historic downtown San Jose building is bought for more than $3 million San Jose approves stricter rules to combat abandoned shopping cart epidemic San Jose approves stricter rules to combat abandoned shopping cart epidemic More in Business Efforts underway to fill empty merchant spaces at Signia hotel in San Jose Downtown Berkeley apartment complex bought by East Bay investor Oracle’s Ellison tops Musk as world’s richest man after $101 billion gain Stanford graduates’ startup turns almond shell waste into organic fertilizer 2023 May 11 News Alerts Today’s e-Edition Email Newsletters Mobile Apps Member Services Subscribe Manage Subscriptions Archive Search Reprints Sitemap Contact Us Join our Team Privacy Policy Accessibility Marketplace Real Estate Lottery Classifieds Public Notices Advertise With Us Network Advertising Subscribe Now Terms of Use Accessibility Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Powered by WordPress.com VIP Copyright © 2025 MediaNews Group Close"
    }
  ]
}