{
  "fuentes": [
    {
      "url": "https://swfl.life/?eventDisplay=venue&tribe_venue=riptide-brewing-company-bonita-springs&paged=2",
      "email": "swfl-report-@250x-768x339.png"
    },
    {
      "url": "https://swfl.life/?eventDisplay=venue&tribe_venue=riptide-brewing-company-bonita-springs&paged=2",
      "email": "swfl-report-@250x.png"
    },
    {
      "url": "https://naples.floridaweekly.com/articles/nesting-in-naples-at-riptide-brewing-company/",
      "email": "jdickerson@floridaweekly.com"
    },
    {
      "url": "https://naples.floridaweekly.com/articles/nesting-in-naples-at-riptide-brewing-company/",
      "email": "strachan@floridaweekly.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "adeluca@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "asmerlinski@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "astern@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "bavery@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "bgehrs@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "bnathanson@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "ebionelli@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "fsalniker@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "jcraven@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "jfischer@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "jinfante@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "jkendall@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "jklineman@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "jlandis@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "jmckenna@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "kcooper@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "lcalamaras@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "lsouthard@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "mcaballero@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "mschneider@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "mwatrous@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "rlatif@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "sgolden@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "vballadares@bevnet.com"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "email": "zlicata@bevnet.com"
    },
    {
      "url": "https://www.floridabeernews.com/riptide-brewing-condensing-operations-to-one-taproom/",
      "email": "mark@floridabeernews.com"
    }
  ],
  "mails": [
    "adeluca@bevnet.com",
    "asmerlinski@bevnet.com",
    "astern@bevnet.com",
    "bavery@bevnet.com",
    "bgehrs@bevnet.com",
    "bnathanson@bevnet.com",
    "ebionelli@bevnet.com",
    "fsalniker@bevnet.com",
    "jcraven@bevnet.com",
    "jdickerson@floridaweekly.com",
    "jfischer@bevnet.com",
    "jinfante@bevnet.com",
    "jkendall@bevnet.com",
    "jklineman@bevnet.com",
    "jlandis@bevnet.com",
    "jmckenna@bevnet.com",
    "kcooper@bevnet.com",
    "lcalamaras@bevnet.com",
    "lsouthard@bevnet.com",
    "mark@floridabeernews.com",
    "mcaballero@bevnet.com",
    "mschneider@bevnet.com",
    "mwatrous@bevnet.com",
    "rlatif@bevnet.com",
    "sgolden@bevnet.com",
    "strachan@floridaweekly.com",
    "swfl-report-@250x-768x339.png",
    "swfl-report-@250x.png",
    "vballadares@bevnet.com",
    "zlicata@bevnet.com"
  ],
  "nombre_sitio": "riptidebrewingcompany.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://swfl.life/?eventDisplay=venue&tribe_venue=riptide-brewing-company-bonita-springs&paged=2",
      "text": "Riptide Brewing Company - Bonita Springs | SWFL Life Skip to content Home Value Analysis Home Search Contact SWFL Blog New In SWFL Coming Soon to SWFL SWFL Real Estate SWFL Eats SWFL Guides E-Newsletter SWFL Event Calender Toggle website search Menu Close Home Value Analysis Home Search Contact SWFL Blog New In SWFL Coming Soon to SWFL SWFL Real Estate SWFL Eats SWFL Guides E-Newsletter SWFL Event Calender « All Events This event has passed. Riptide Brewing Company – Bonita Springs September 10 @ 4:57 pm Fort Myers RV Show » Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Date: September 10, 2025 Time: 4:57 pm Venue Riptide Brewing Company – Bonita Springs 28120 Hunters Ridge Blvd #1 Bonita Springs , FL United States + Google Map Fort Myers RV Show » Our SWFL Event Calendar lists all upcoming events for Naples, Bonita Springs, Fort Myers and Cape Coral!Our SWFL Event Calendar lists all upcoming events for Naples, Bonita Springs, Fort Myers and Cape Coral! Meet The Team Instant Home Value Estimate Upcoming Events Sep 13 9:00 am - 1:00 pm Miromar Outlets Weekly Pop-Up Market Sep 13 9:00 am - 1:00 pm Saturday Sampling at The Roastery Grumpy Goat Coffee Sep 13 12:00 pm - 4:00 pm Hand & Harvest Artisan Market Mercato Sep 14 8:00 am - 1:00 pm Vanderbilt Farmer’s Market Galleria Shoppes at Vanderbilt View Calendar Latest From The Blog USA Ninja Challenge Kids Gym Coming to Bonita Springs Fresh Look: New Renderings of the Fort Myers Beach Pier Fed Rate Cuts on the Horizon: What It Means for Housing in Southwest Florida Vivid Shores | Over 450 New Homes Coming to East Bonita Springs Cocohatchee River House Proposed for Former Pewter Mug Location First Look: Oise Ristorante Brings Vibrant Asian-Italian Fusion to Downtown Fort Myers It’s Time to SIZZLE! 🔥 Here Is Your Guide to Sizzle Dining 2025 Crunch Bonita Springs Closes, Athletica Prepares to Open Bon Appetite | “Flavors of 5th” Kicks Off in Downtown Naples Slipaway Food Truck Park and Marina Opens in Cape Coral: A Must-Visit Waterfront Hotspot Please enable JavaScript in your browser to complete this form. Email Name Name * First Last Email * Name Subscribe Copyright 2025  SWFL Home Group | MVP Realty Using Ocean WP Theme Please enable JavaScript in your browser to complete this form. Email Name Name * First Last Email * Message Subscribe x"
    },
    {
      "url": "https://naples.floridaweekly.com/articles/nesting-in-naples-at-riptide-brewing-company/",
      "text": "“Nesting in Naples” at Riptide Brewing Company - Naples Florida Weekly Search for: Search Submit ▼ Log In Gift Subscriptions Naples Florida Weekly Naples Home News Top News Opinion Healthy Living News of the Weird Pet Tales Outdoors Business & Real Estate Business News Real Estate News The Motley Fool Networking Business Briefs On the Move A&E A&E News Cuisine What to Do, Where to Go Society Events Add Event Special Sections Marketplace Print Editions Business Directory Archives Choose Your Community Bonita Springs Charlotte County Fort Myers Key West Naples Palm Beach Florida Weekly Home About Us Advertising Solutions Newsstand Locations Subscribe Frequently Asked Questions Careers Contact Us Report Website Accessibility Problems Pay Your Advertising Invoice Public Notices Place View Obituaries Place An Obituary Log In Privacy Policy Florida Weekly Home Fort Myers Bonita Springs Charlotte County Key West Naples Palm Beach Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Select search type Places Events Search for Near Search Search Advanced Filters Sort by Distance Select Option Nearest Within 5 miles Within 10 miles Within 15 miles Within 20 miles Within 25 miles Within 30 miles Within 35 miles Within 40 miles Within 45 miles Within 50 miles More Search Search {\"hide_search_input\":\"\",\"hide_near_input\":\"\",\"show\":\"\",\"filters_pos\":\"\",\"input_size\":\"\",\"bar_flex_wrap\":\"\",\"bar_flex_wrap_md\":\"\",\"bar_flex_wrap_lg\":\"\",\"input_border\":\"\",\"input_border_opacity\":\"\",\"input_rounded_size\":\"\",\"btn_bg\":\"\",\"btn_rounded_size\":\"\",\"btn_rounded_size_md\":\"\",\"btn_rounded_size_lg\":\"\",\"bg\":\"\",\"mt\":\"\",\"mr\":\"\",\"mb\":3,\"ml\":\"\",\"pt\":\"\",\"pr\":\"\",\"pb\":\"\",\"pl\":\"\",\"border\":\"\",\"rounded\":\"\",\"rounded_size\":\"\",\"rounded_size_md\":\"\",\"rounded_size_lg\":\"\",\"shadow\":\"\",\"css_class\":\"\"} Wednesday, September 10, 2025 Search Newsletter Events Photos Classifieds Subscribe Marketplace Home News Top News Opinion Healthy Living Pet Tales Home & Garden Business & Real Estate Business News Real Estate News The Motley Fool Networking Business Briefs On the Move A&E Arts and Entertainment News What to Do, Where to Go Outdoors Society Cuisine Events Add Event Special Sections Arts Preview – Act I Arts Preview – Act II Best Of 2025 Businesses of Distinction CBIA Parade of Homes 2025 Destination Guide Health Trends How-To Guide Hurricane Guide Newcomers Guide Key West Getaways Staycations & Getaways Tasting Notes Public Notices Place View Obituaries Place An Obituary Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Latest Places New Real Estate Favorite Cypress Woods Golf & Country Club New Dining Favorite Cafe Marquise New Real Estate Favorite Royal Palm Coast Realtors Association New Shopping Favorite Caloosahatchee Cannabis Company New Professional Directory Favorite Stilwell Enterprises & Restaurant Group View all “Nesting in Naples” at Riptide Brewing Company By Staff on October 22, 2020 1. Naples’ Vice Mayor Terry Hutchison, Naples United Director Enoch Showunmi and Verónica Docio, Naples United founder and vice president. The start of October was celebrated with a crisp pineapple IPA. Vera Jaye, owner of Jaye Design and creator of the Nesting in Naples podcast, recently hosted a gathering at the newly reopened Riptide Brewing Company. During the event, there was a ribbon-cutting ceremony that brought together Naples community leaders and speakers from Naples United, the Above Board Chamber of Florida, and Cypress Cove Landkeepers to share more information about exciting new things happening in the local Naples’ area. Riptide provided tours of their brewery for guests throughout the evening and offered a specialty drink named after Vera Jaye’s podcast, called “Nesting In Naples.” The featured “Nesting in Naples” drink is an IPA that has a crisp tart taste with a hint of pineapple. The proceeds of this specialty drink raised funds that will be donated to Naples United to support their grassroot soccer program. The event included Riptide’s permanent food truck, Kraken Kitchen, owned by Sea Salt’s former chef, Freddie Mosqueda. Ending the night, there was a giveaway featuring a one hour design consultation with Vera Jaye (valued at $550), an official Naples United Jersey, and a box of Riptide swag items. 2. Ribbon Cutting Event sponsored by Naples’ Above Board Chamber featuring Riptide Leadership, Naples United Leadership, Vera Jaye of Jaye Design (black top), Freddie Mosqueda, owner of Kraken Kitchen and Bowers PR team. Florida Weekly welcomes submissions for the Society pages from charity galas and fundraising events, club meetings and other to- dos around town. We need 300- dpi photographs of groups of two or more people, facing the camera and identifi ed by first and last names. Questions? Email editor Eric Strachan at eric. strachan@floridaweekly.com . 3. Terry Hutchison, Naples vice mayor and Vera Jaye, owner of Jaye Design. 4. Naples United Leadership, Verónica Docio, founder and vice president; Vicente Sandoval, founder and president; Enoch Showunmi, director; and Andres Cortes, player. 5. Riptide team, Chris West, owner; Christian Johnson, beertender/sales; Lynden Preuss, operations manager; and Freddie Mosqueda, Kraken Kitchen owner. 6. Kraken Kitchen Corn Salsa appetizer 7. Vera Jaye specialty drink. 8. Freddie Mosqueda, Kraken Kitchen food truck owner. Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Current ye@r * Leave this field empty Δ Loading Contact Us! Click Here for Our Offices Home News Business Real Estate A&E Events Business Directory Past Print Editions Subscribe Newsletter Newsstands Website Accessibility Our Hometown DMCA Notices Newspaper website content management software and services If you have any problems, questions, or comments regarding www.FloridaWeekly.com , please contact our Webmaster .\nFor all other comments, please see our contact section . For more information on this site please read our Terms and Conditions , Privacy Policy , and Ad Choices . Copyright © 2007 - 2025  Florida Media Group LLC Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://www.brewbound.com/about/team",
      "text": "Our Team | Brewbound.com Menu Become an Insider Become a Brewbound Insider Brewbound Live Jobs Beyond Beer Big Beer Craft Data Distribution Legislative M&A New Products On-Premise & At-The-Brewery Trends People Moves Podcast Voices Press Releases back Beer Companies Supplier & Service Provider Supplier News Content Calendar Videos back Brewbound Live Replay Data Club Frontlines Newsletter back View Archive Free Sign Up Submit back Submit News Best of 2025 Awards Submit Beer Event Directories back Brewery Database Marketplace Nombase CPG Directory Brewbound Awards Beer Events Calendar Supplier & Services Guide About back Media Kit & Advertising About Brewbound Contact Us Team Charter Members Home Brewbound Live Jobs Podcast Data M&A Newsletter PR Submit News Become an Insider Sign In Account close Subscription: MANAGE MY ACCOUNT Sign Out close Subscribe Sign In Brewbound — Beer Industry News, Events, & Jobs Become a Brewbound insider today! Our Team Listed alphabetically About What We Do Team Contact Brad Avery Senior Reporter Profile & Contact Info » Brad Avery Senior Reporter Brad is a Reporter for BevNET.com. bavery@bevnet.com 617-231-8843 LinkedIn Viviana Balladares Marketing Associate Profile & Contact Info » Viviana Balladares Marketing Associate Viviana Balladares is a Marketing Associate across BevNET, NOSH and Brewbound. vballadares@bevnet.com Elizabeth Bionelli Accounting Manager Profile & Contact Info » Elizabeth Bionelli Accounting Manager Elizabeth Bionelli is the Accounting Manager for BevNET.com, Inc. ebionelli@bevnet.com 617-231-8852 LinkedIn Jacqui Brugliera Director of Marketing; Taste Radio Co-Host Profile & Contact Info » Jacqui Brugliera Director of Marketing; Taste Radio Co-Host Jacqui Brugliera is the Director of Marketing for BevNET, NOSH, Brewbound and Taste Radio. She is also the Producer of our Elevator Talk video series which introduces emerging brands to the industry and is the co-host of our Taste Radio podcast. As a Marketing and Global Perspectives graduate of Bentley University, Jacqui is passionate about the food and beverage industry, specifically its cultural and environmental impact. Instagram LinkedIn Martín Caballero Managing Editor, BevNET Profile & Contact Info » Martín Caballero Managing Editor, BevNET Martín writes news articles and feature stories covering the non-alcoholic beverage industry for BevNET. A graduate of Boston University, Martín's previous work has appeared in USA Today, The Boston Globe and The Boston Herald. mcaballero@bevnet.com 617-231-8840 Twitter LinkedIn Lou Calamaras National Account Executive Profile & Contact Info » Lou Calamaras National Account Executive Lou Calamaras is a National Account Executive on our sales team. lcalamaras@bevnet.com 1-847-324-3480 Instagram LinkedIn Kendra Cooper Events Coordinator Profile & Contact Info » Kendra Cooper Events Coordinator Kendra is the Events Coordinator across BevNET, NOSH and Brewbound. kcooper@bevnet.com (858) 987-4603 LinkedIn Carolyn Craven COO Profile & Contact Info » Carolyn Craven COO Carolyn Craven is the COO across BevNET, NOSH and Brewbound. Prior to BevNET, Carolyn spent 13 years as COO of Checkbox Survey, a leading developer of enterprise survey software, and 10 years as an accounting and finance professional in various technology organizations. She holds a BS in Marketing and Accounting from Boston College. LinkedIn John Craven CEO / Founder / Editorial Director Profile & Contact Info » John Craven CEO / Founder / Editorial Director As founder and CEO of BevNET, John Craven is a widely-recognized authority on the beverage industry and he is frequently cited in mainstream media.  His vision shapes the editorial, publishing, and positioning of all of BevNET's properties, including BevNET.com, NOSH.com, BevNET Magazine, Brewbound.com and their associated conferences. John is a graduate of Boston College with a BS in Marketing and Computer Science. jcraven@bevnet.com 617-231-8800 Twitter Facebook Instagram LinkedIn Adrianne DeLuca Assistant Managing Editor, Newsletters, BevNET & NOSH Profile & Contact Info » Adrianne DeLuca Assistant Managing Editor, Newsletters, BevNET & NOSH Adrianne DeLuca is the Assistant Managing Editor - Newsletters for BevNET and NOSH. adeluca@bevnet.com LinkedIn John Fischer Senior Account Executive Profile & Contact Info » John Fischer Senior Account Executive John has over two decades of experience in sales, account management, and customer support, and has been with BevNET for over 13 years. As the Senior Account Executive, he works directly with food and beverage brands to build awareness campaigns and attend the BevNET Live and Nosh Live events. He also manages the various industry guides that BevNET publishes throughout the year. Beyond BevNET, John runs his own photography business, and you can visit his website at www.NoRoadUnturned.com jfischer@bevnet.com 845-363-0058 LinkedIn Kevin Fisher Director of Engineering Profile & Contact Info » Kevin Fisher Director of Engineering Kevin manages the engineering team at BevNET. He oversees the development of new features, bug fixes, and adoption of new technologies for all BevNET brand sites. LinkedIn Ryan Galang Video Editor Profile & Contact Info » Ryan Galang Video Editor Ryan is a video editor and works on video content for BevNET, Brewbound and NOSH.com. Ryan is a 2015 graduate of University of California, San Diego. LinkedIn Brandt Gehrs Business Development Representative Profile & Contact Info » Brandt Gehrs Business Development Representative Brandt is a Business Development Representative across BevNET, NOSH and Brewbound. bgehrs@bevnet.com LinkedIn Shauna Golden Reporter, BevNET & NOSH Profile & Contact Info » Shauna Golden Reporter, BevNET & NOSH Shauna Golden is a Reporter for BevNET and NOSH. sgolden@bevnet.com LinkedIn Amanda Huang Designer Profile & Contact Info » Amanda Huang Designer Amanda Hunag is a designer across BevNET, NOSH and Brewbound, with a focus on UX design and social media. Jessica Infante Managing Editor, Brewbound Profile & Contact Info » Jessica Infante Managing Editor, Brewbound Jessica Infante joined Brewbound in 2019 after nearly a decade in a variety of marketing roles in the craft beer industry. Prior to that, she was a daily newspaper reporter at the Jersey Shore. Jess holds a bachelor’s degree in magazine journalism from the S.I. Newhouse School of Public Communications at Syracuse University and a master’s degree in integrated marketing communication from Emerson College. She is a certified Cicerone and lives in Salem, Massachusetts. jinfante@bevnet.com 617-231-8835 Sarah Johnson Events Manager Profile & Contact Info » Sarah Johnson Events Manager Sarah is the Events Manager for BevNET. LinkedIn Justin Kendall Editor, Brewbound Profile & Contact Info » Justin Kendall Editor, Brewbound Justin Kendall provides daily coverage of the beer industry on Brewbound.com, conducts live-streamed interviews during Brewbound’s events and co-produces the Brewbound podcast. Kendall is a nearly 20-year career journalist who led alt-weekly newspapers in Kansas City, Missouri, and Des Moines, Iowa. jkendall@bevnet.com 617-231-8841 LinkedIn Jeffrey Klineman Editor-in-Chief Profile & Contact Info » Jeffrey Klineman Editor-in-Chief As Editor-in-Chief of BevNET, Jeff Klineman oversees the organization's reporting across all of its web sites, as well as BevNET Magazine. Jeff also plans, curates, and hosts the BevNET Live and NOSH Live conferences.\r\n\r\nJeff previously worked as a newspaper reporter for the Lawrence Eagle-Tribune, the Boston TAB and the Metrowest Daily News, and has freelanced for publications like Slate, Boston Magazine, Self, George, Commonwealth, and the Chronicle of Philanthropy.  He is a graduate of Yale University and Columbia University’s Graduate School of Journalism. \r\n\r\nA frequently-cited expert on the beverage industry, Jeff has also twice been named in Forbes as one of the 25 Most Influential when it comes to Consumer and Retail Companies. jklineman@bevnet.com 617-231-8830 Twitter LinkedIn Joseph Krachie Audio Engineer & Production Director Profile & Contact Info » Joseph Krachie Audio Engineer & Production Director Joe is the audio engineer for BevNET, NOSH, Brewbound, and the Taste Radio Podcast. He is a graduate of The State University of New York at Plattsburgh and The Institute of Audio Research. Some of his previous work has been heard on NPR, The Food Network, Travel Channel and HGTV. Jon Landis Business Development Manager Profile & Contact Info » Jon Landis Business Development Manager After a decade of wearing many different hats at BevNET, Jon Landis has settled into the role of Business Development Manager where he is responsible for overseeing the organization’s sales prospecting efforts. Prior to joining BevNET in 2013, Jon was Director of Operations at Airways Development, LLC where he transformed the organization’s production, distribution, accounting, marketing and reporting processes, leading to an eventual acquisition by WestMed, Inc. Jon is a 2008 Suffolk University graduate. jlandis@bevnet.com 617-231-8834 Twitter Instagram LinkedIn Ray Latif Producer, Taste Radio; Contributing Editor, BevNET Profile & Contact Info » Ray Latif Producer, Taste Radio; Contributing Editor, BevNET Ray Latif is the lead host, producer, and content editor of Taste Radio, BevNET’s flagship podcast and the go-to show for food and beverage industry insights. With 14 years of experience in the industry, Ray is a seasoned journalist known for his sharp interviews and in-depth coverage of trends, innovation, and news. He began his career at BevNET as an assistant editor, later advancing to managing editor of both the website and magazine. Since 2016, he’s been the driving force behind Taste Radio, overseeing everything from content strategy to production.\r\n\r\nRay’s conversational style and meticulous research have earned him widespread praise from both guests and listeners. He has had the privilege of interviewing a diverse range of high-profile figures, including Patrick Mahomes, Jennifer Garner, Dan Aykroyd, Kobe Bryant, Padma Lakshmi, and Brad Paisley. His ability to connect with entrepreneurs, celebrities, and industry leaders has made Taste Radio a must-listen for anyone interested in the evolving world of food and beverage. rlatif@bevnet.com 617-231-8829 Twitter Instagram LinkedIn Zoe Licata Senior Reporter, Brewbound.com Profile & Contact Info » Zoe Licata Senior Reporter, Brewbound.com Zoe Licata joined Brewbound in 2021 after several years of freelance reporting and documentary work. She’s a Massachusetts native, guinea pig for bev-alc innovation and savant in Gen Z culture. zlicata@bevnet.com LinkedIn John McKenna Director of Sales Profile & Contact Info » John McKenna Director of Sales John McKenna has written and consulted extensively in the area of foods and beverages. Before joining BevNET to write Energy Drinks 2003, John authored a report on Functional Foods and Beverages and worked as a reporter for FDC Reports covering dietary supplements. John is a graduate of Tufts University. jmckenna@bevnet.com 617-231-8825 LinkedIn Barry Nathanson Publisher, BevNET Magazine Profile & Contact Info » Barry Nathanson Publisher, BevNET Magazine A 30-year publishing executive, Barry Nathanson has worked as publisher and group publisher in a myriad of markets including cosmetics and fragrance, consumer electronics, food and beverage marketing, non-foods merchandising and convenience store retailing. A graduate of Boston University, Barry has spent the last 22 years in the beverage retailing arena, and his experience has allowed him to serve as a resource to marketers, retailers and distributors, who recognize that his expertise and relationships, as well as his enthusiasm, lend him a unique perspective on their marketplace. bnathanson@bevnet.com 646-619-1180 Kathi O'Neil CFO Profile & Contact Info » Kathi O'Neil CFO Kathi O'Neil is BevNET's Chief Financial Officer. She also manages Human Resources. LinkedIn Joshua Pratt Technical Director Profile & Contact Info » Joshua Pratt Technical Director Joshua became a member of the team when his startup Brewbound Experience LLC joined forces with BevNET. Joshua edits all of the videos for BevNET, Brewbound, and NOSH.com. Joshua is a 2006 graduate of Northeastern University. Twitter LinkedIn Ferron Salniker Spirits Editor Profile & Contact Info » Ferron Salniker Spirits Editor Ferron Salniker is the Spirits Editor, guiding our coverage of the spirits and RTD cocktail space. She reports for BevNET.com and Brewbound.com on everything from new subcategories in established liquor types to the growth of the craft spirits business. fsalniker@bevnet.com LinkedIn Mike Schneider CMO & CRO Profile & Contact Info » Mike Schneider CMO & CRO Mike Schneider is a seasoned executive who lives at the collision of brand, experience and product. He has deep roots in branding, mobile, content and events. Prior to BevNET, Schneider lead major rebranding efforts for Skyhook and GasBuddy and was the CMO of Apptopia. He also spent over 8 years in big Boston ad agencies Hill, Holliday and allen and gerritsen leading content, digital innovation and analytics teams. A long-time blogger and thought-leader, Schneider got his start drinking and evaluating craft beer and co-wrote Location Based Marketing for Dummies. mschneider@bevnet.com 617-231-8845 Twitter Instagram LinkedIn Amanda Smerlinski Product Marketing Manager Profile & Contact Info » Amanda Smerlinski Product Marketing Manager Amanda Smerlinski is a Product Marketing Manager across BevNET, NOSH and Brewbound. asmerlinski@bevnet.com LinkedIn Lukas Southard Senior Reporter, BevNET & NOSH Profile & Contact Info » Lukas Southard Senior Reporter, BevNET & NOSH Lukas Southard is a Reporter covering the food and beverage industries across BevNET and NOSH. lsouthard@bevnet.com Adam Stern Senior Account Specialist Profile & Contact Info » Adam Stern Senior Account Specialist Adam is a member of the BevNET sales team and is focused on the non-alcoholic beverage industry. Prior to joining BevNET in 2005, Adam held a position at Decision Resources, a biopharmaceutical executive advisory service and consulting firm, as a Research Associate, covering business and technology drivers of the pharmaceutical and biotechnology markets. Adam is a graduate of Bates College with degrees in Biology and International Relations. astern@bevnet.com 617-231-8826 LinkedIn Colin Sughrue Digital Campaign Coordinator Profile & Contact Info » Colin Sughrue Digital Campaign Coordinator As the Digital Campaign Coordinator, Colin is at the forefront of BevNET’s digital initiatives, setting up online campaigns that appear on the website and in the daily newsletter. A graduate of Seton Hall University, Colin comes with a strong background in marketing and communications. Before joining BevNET, he served as a Social Media Intern at Montclair Brewery in Montclair, NJ. Colin also takes part in managing the beverage/snack samples that come into BevNET’s Newton office. Melissa Traverse Director of Community Profile & Contact Info » Melissa Traverse Director of Community Melissa serves as the starting point for new initiatives focused on nurturing and growing our Insider community. Melissa has experience in empowering food and beverage entrepreneurs to grow, previously holding positions at Whole Foods Market, The Modern Pod Co, Rodeo CPG, and Hot Bread Kitchen. LinkedIn Monica Watrous Managing Editor, Nosh Profile & Contact Info » Monica Watrous Managing Editor, Nosh For more than a decade, Monica Watrous has covered the latest trends, innovations and developments in the food and beverage industry and has organized and hosted multiple events featuring emerging brands and cutting-edge concepts. She is a lifelong foodie and a champion of startups and disruptors in the consumer packaged goods landscape. mwatrous@bevnet.com Instagram LinkedIn Aaron Willette Design Manager Profile & Contact Info » Aaron Willette Design Manager Aaron is a graphic designer and works on BevNET.com, BevNET Magazine, and the many video projects that the company undertakes. LinkedIn Jobs in the Beer Industry Brewer - Spring Street Cigars Key Accounts Manager - NoDa Brewing Co. Brewer - Aslin Beer Company Packaging Operator — 20+/hr + Growth in Naperville, IL - Craftsmith Beverage Market Manager (West Michigan) - Griffin Claw Brewing Company Quality Lab Assistant - Kane Brewing Company Regional Distributor Manager - Zevia View All Jobs Post a Job Upcoming Events Brewbound Live 2025 Marina del Rey, CA December 10 +11, 2025 Early Registration Open Promoted PR Posts MadTree Light Lager Debuting in Cans: Light Done Right Multi-Award Winning Low-Alcohol Spirits Brand, Paramour, Expands Distribution into New York, New Jersey, and Florida 23rd State Debuts FRESH PRESS: First-of-Its-Kind Pear Cider Infused with THC + CBG Brown Distributing Adds Jerry Jeff Walker Sangria Wine to Its Portfolio for Central Texas Roadhouse and Breakside Brewery Launch Citrus Missile IPA: Hypersonic Kush Anderson Brass Achieves Prestigious NSF HCV-EU Program Approval on ABF Series Backflow Preventers for Beverage Dispensing Equipment. View All Post a PR Recent Articles Newswire Features Spirits Texas Gov. Signs Executive Order to Create Legal Hemp Framework Taproom Closings: Antigua, Navigation, Simple Roots Other Half’s Guide to Navigating the Modern Craft Industry: Hospitality, Intention & Connection Coca-Cola’s Red Tree Moves Fresca Mixed From Constellation Brands to Sazerac Press Clips: Missouri’s Crane Brewing Closes; Iowa’s Big Grove Plans Kansas Location Iron Hill Brewery Announces the Closing of Three Locations; Sixteen Remain Open and Serving Guests Cascadia Team Expands Leadership and Creative Capabilities with Two Key Hires Multi-Award Winning Low-Alcohol Spirits Brand, Paramour, Partners with Green Light Distribution in Florida Dan Abrams’ Bottle Raiders Media and Events Rebrand as The Daily Pour “Stronger Through Water”: Devil’s Foot and NoDa Brewing Collaborate To Celebrate WNC’s Resilience One Year After Hurricane Helene Scorpion Mezcal Distiller Seeks Preservation of Mexico’s Heirloom Corn Davos Brands Acquires Controlling Interest in Sombra Mezcal John Esposito Joins Real McCoy Spirits as Chairman CÎROC Vodka Release New Limited Edition Summer Colada Jack Daniel’s Country Cocktails Teams with K. Michelle for Southern Peach Flavor Preiss Imports Adds Ferdinand’s Saar Collection to its International Spirits Portfolio Humboldt Distillery Expands to Markets Outside of California View All Submit News Brewbound Contact Advertise with Brewbound Submit News Submit a Beer Event Post a Job Listing Contact Us Follow Newsletter Facebook Twitter Instagram Youtube Resources About Brewbound BevNET.com Taste Radio Podcast BevNET Magazine NOSH Nombase Navigate News Events Breweries Craft Beer Jobs Craft Beer Events Calendar Industry Marketplace Videos ©2010-2025 BevNET.com®, Inc. Terms of Use Privacy Policy"
    },
    {
      "url": "https://www.floridabeernews.com/riptide-brewing-condensing-operations-to-one-taproom/",
      "text": "RipTide Brewing condensing operations to one taproom - Florida Beer News Skip to content Home About About Florida Beer News Working with Florida Beer News Blog Destination Florida Breweries Map Store Subscribe to Florida Beer News Contact Us Breaking Tom Moench, craft beer pioneer and founder of Orange Blossom Brewing, passed away Friday Tripping Animals Brewing Company is hosting Miami’s Premier Food Event October 18th Tampa’s Woven Water Brewing celebrates five years with beer releases and more Dogfish Head Debuts NEW Variety Pack Featuring Crowd-Sourced Fan-Favorites Angry Chair Brewing celebrates Brimley’s Brunch this weekend Fort Myers’ Point Ybel Brewing Company celebrates Cool & Crispy Fest 2025 Pouring Profits: What Florida Bartenders Really Take Home Wed. Sep 10th, 2025 Florida Beer News Florida's comprehensive beer news website. Home About Working with Florida Beer News Locations Tampa Bay Orlando South Florida Jacksonville Tallahassee Florida Breweries Map Podcasts Store Contact Subscribe Florida Beer News Fort Myers/ Naples South Florida RipTide Brewing condensing operations to one taproom By mark Sep 19, 2024 # beer in florida # bonita springs beer # bonita springs brewery # craft beer # florida beer # florida beer news # florida brewery # florida craft beer # Floridian craft beer # fort myers beer # naples beer # riptide beer # riptide brewing # south florida beer # south florida breweries # southwest florida beer Craft brewers around the country are right-sizing their operations, and Florida continues to see the same trend among its breweries. Southwest Florida’s RipTide Brewing Company announced on September 2nd that it would be parting ways with its Naples Taproom and operating solely from its Bonita Springs location. While many times decisions like this are difficult, they are better than the alternative of closing operations altogether. From RipTide Brewing Company To Our Amazing Community, After nearly 9 incredible years, we’ve made the difficult decision to part ways with our original taproom in Naples and consolidate into our Bonita Springs taproom. The Naples taproom has been our home, where we poured our first pints, shared countless memories, and built the foundation of who we are today. We are endlessly grateful to our loyal guests and neighbors, who made it such a special place. While saying goodbye is never easy, we believe this change will allow us to better focus on serving the SWFL community from our larger space in Bonita. Our commitment to crafting great beer and creating a welcoming space for all remains stronger than ever. We hope you’ll join us in Bonita for this new era together. We want to take a moment to express our deepest gratitude to the incredible staff who have been the heart and soul of our Naples taproom. Their dedication, passion, and hard work have made this place feel like home to so many, and we couldn’t be more thankful for their contributions over the years. Decisions like this are never easy and we are 100% committed to supporting them through this transition. They are forever a part of the Riptide Family. Although bittersweet, We’re pleased to share that our original taproom will be in great hands as it transitions to new ownership- Kaleidoscope Beer Company . We believe they will give our beloved taproom the love and attention it deserves, honoring its history while bringing their own unique touch. We’re confident that Kaleidoscope Beer Company will continue to make this space a welcoming home for craft beer lovers, just as it has always been. We hope you’ll join us in supporting them as they embark on their own journey in the space we’ve called home. A brief statement from their owner, Bill: “Kaleidoscope Beer Company is thrilled to be given this opportunity to take a well-established and loved brewery on a new journey. Riptide Naples is such a beautiful place and we’re excited to grow on that base. We look forward to serving Naples, and beyond, the best that we can.” While Riptide has officially ceased operations at the Naples taproom, the physical transition to Kaleidoscope will be a gradual process throughout September. During this time, Kaleidoscope will slowly begin to make their mark on the space, allowing for a smooth and seamless transition. We’re working closely with the new owners to ensure this beloved taproom remains a welcoming spot for our community throughout the changeover. You can still expect the same warm atmosphere, friendly faces, and great beer as we wind down this chapter together. We hope you’ll join us during this special transition period to raise a glass, share stories, and celebrate all that this taproom has meant to us. With Gratitude, Riptide Brewing Company About RipTide Brewing Company Riptide Brewing Company is a female, family-owned and operated business that started here in the heart of Naples, Florida. We aspire to live by the Southwest Florida lifestyle and therefore try to stay as involved in our community as possible by supporting our local business, charities, and organizations. Post navigation Boca Raton’s Barrel of Monks Brewing is releasing Wizard in Pink to benefit breast cancer charities J. Wakefield Brewing to host The Last Dance – final party in Wynwood By mark Related Post Florida Beer News Fort Myers/ Naples Gainesville Jacksonville Orlando Pensacola South Florida Tallahassee Tampa Bay Tom Moench, craft beer pioneer and founder of Orange Blossom Brewing, passed away Friday mark Sep 8, 2025 Florida Beer News South Florida Tripping Animals Brewing Company is hosting Miami’s Premier Food Event October 18th mark Sep 2, 2025 Florida Beer News Tampa Bay Tampa’s Woven Water Brewing celebrates five years with beer releases and more mark Aug 29, 2025 Categories BeerWise Editorials Florida Beer News Fort Myers/ Naples Gainesville Jacksonville Orlando Pensacola Short Pours South Florida Tallahassee Tampa Bay Florida Beer News thrives because of the generous support of our sponsors. Your contributions help us celebrate and promote Florida’s vibrant craft beer community. Together, we raise a glass to innovation, quality, and the passionate brewers who make it all possible. If you are interested in becoming a sponsor, please email us for more information . Archives September 2025 August 2025 July 2025 June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 December 2018 October 2018 July 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 June 2017 May 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 © Copyright 2025 Florida Beer News. All Rights Reserved."
    }
  ]
}