{
  "fuentes": [
    {
      "url": "https://fencepostrepair.com/contactus",
      "email": "flags@2x.png"
    },
    {
      "url": "https://fencepostrepair.com/contactus",
      "email": "sales@fencepostrepair.com"
    },
    {
      "url": "https://www.riverandpostjax.com/",
      "email": "events@riverandpostjax.com"
    },
    {
      "url": "https://www.riverandpostjax.com/",
      "email": "info@river-grp.com"
    },
    {
      "url": "https://www.riverandpostjax.com/",
      "email": "mccuskerjeff@yahoo.com"
    },
    {
      "url": "https://www.riverandpostjax.com/private-events",
      "email": "events@river-grp.com"
    },
    {
      "url": "https://www.riverandpostjax.com/private-events",
      "email": "events@riverandpostjax.com"
    },
    {
      "url": "https://www.riverandpostjax.com/private-events",
      "email": "info@river-grp.com"
    },
    {
      "url": "https://www.riverandpostjax.com/private-events",
      "email": "mccuskerjeff@yahoo.com"
    },
    {
      "url": "https://www.jacksonville.com/story/entertainment/local/2017/07/07/dining-notes-river-post-finds-its-chef/15762364007/",
      "email": "info@riverandpostjax.com"
    },
    {
      "url": "https://riveractionuk.com/about/",
      "email": "info@riveractionuk.com"
    },
    {
      "url": "https://riveractionuk.com/about/",
      "email": "media@riveractionuk.com"
    },
    {
      "url": "https://www.riverandpostjax.com/donation-request",
      "email": "events@riverandpostjax.com"
    },
    {
      "url": "https://www.riverandpostjax.com/donation-request",
      "email": "info@river-grp.com"
    },
    {
      "url": "https://www.riverandpostjax.com/donation-request",
      "email": "mccuskerjeff@yahoo.com"
    },
    {
      "url": "https://riverandfort.com/",
      "email": "info@riverandfort.com"
    },
    {
      "url": "https://www.riverandpostjax.com/dinner-menu",
      "email": "events@riverandpostjax.com"
    },
    {
      "url": "https://www.riverandpostjax.com/dinner-menu",
      "email": "info@river-grp.com"
    },
    {
      "url": "https://www.riverandpostjax.com/dinner-menu",
      "email": "mccuskerjeff@yahoo.com"
    },
    {
      "url": "https://www.visitjacksonville.com/directory/river-post/",
      "email": "info@riverandpostjax.com"
    },
    {
      "url": "https://www.visitjacksonville.com/directory/river-post/",
      "email": "info@visitjacksonville.com"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "brianna@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "kylie@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "lindsey@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "shirley@teamjackfoundation.org"
    },
    {
      "url": "https://www.riverandpostjax.com/faqs",
      "email": "events@riverandpostjax.com"
    },
    {
      "url": "https://www.riverandpostjax.com/faqs",
      "email": "info@river-grp.com"
    },
    {
      "url": "https://www.riverandpostjax.com/faqs",
      "email": "mccuskerjeff@yahoo.com"
    },
    {
      "url": "https://www.riverandpostjax.com/contact-us",
      "email": "events@riverandpostjax.com"
    },
    {
      "url": "https://www.riverandpostjax.com/contact-us",
      "email": "info@river-grp.com"
    },
    {
      "url": "https://www.riverandpostjax.com/contact-us",
      "email": "mccuskerjeff@yahoo.com"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "email": "info@secureitsecurities.com"
    }
  ],
  "mails": [
    "brianna@teamjackfoundation.org",
    "events@river-grp.com",
    "events@riverandpostjax.com",
    "flags@2x.png",
    "info@river-grp.com",
    "info@riveractionuk.com",
    "info@riverandfort.com",
    "info@riverandpostjax.com",
    "info@secureitsecurities.com",
    "info@visitjacksonville.com",
    "kylie@teamjackfoundation.org",
    "lindsey@teamjackfoundation.org",
    "mccuskerjeff@yahoo.com",
    "media@riveractionuk.com",
    "sales@fencepostrepair.com",
    "shirley@teamjackfoundation.org"
  ],
  "nombre_sitio": "riverandpostjax.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://fencepostrepair.com/contactus",
      "text": "Contact Us - Lean On Me Home Fence Repair New Fence Resources Contact Service Areas Blog FAQ Partnership Program Get A Quote Home Fence Repair New Fence Contact Get A Quote Resources Service Areas FAQ Partnership Program Get In Touch With Us Call Us Text Us Email Us 1-877-456-9535 1-236-358-9061 sales@fencepostrepair.com Fill out the form below and one of our team members will get in touch with you shortly. Contact Information Full Name City Phone * Email * Best time to contact you Best time to contact you Morning: 6am to noon Afternoon: Noon to 6pm Evening: 6pm to 9pm No elements found. Consider changing the search query. List is empty. Preferred Contact Method Phone Email Either Additional Information How can we help you? Submit Where to find us Ontario Acton Ajax Alberta Alliston Alymer Amherstsburg Amherstview Ancaster Angus Aurora Arthur Aurora Aylmer Ayr Baden Brantford Barrie Beachville Beaconsfield Beamsville Beeton Beighton Belle River Belleville Bellwood Belmont Binbrook Blenheim Bolton Bowmanville Bracebridge Bradford West Gwillimbury Brampton Branchton Brantford Brant Breslau Bridgenorth Brighton Brights Grove Brockville Brooklin Burford Burlington Caistor Centre Caledon Caledon East Caledonia Cambridge Cambridge (Galt area) Camlachie Carlisle Chatham-Kent Chelmsford Chippewa Clarington Clinton Cobourg Cochrane Codrington Colborne Collingwood Concord Cookstown Coombsville, Mississauga Cornwall Corunna Cottam Country Lane Barrie Courtice Courtright Crystal Beach Cumber Beach Delaware Delhi Dorchester Dover Dresden Dundalk Dundas Dunnville Durham Dutton East Gwillimbury East Hamilton Mountain East Riverside East Windsor East York Elmira Elora Erin Essex Etobicoke Exeter Fenelon Falls, Kawartha Lakes Fenwick Fergus Fonthill Fonthill Niagara Forest Fort Erie Fort Frances Freelton Galt Georgetown, Halton Hills Georgina Glencoe Gloucester Gooderham Goodwood Grafton Grand Bend Grand Valley Gravenhurst Greater Sudbury Greenbank Grimsby Guelph Hagersville Halton Hills Hamilton Hampton Hannon Harriston Harrow-Colchester Hespeler Hockley Valley Holland Landing Ilderton Ingersoll Innisfil Jackson's Point Jarvis Kanata Kawartha Lakes Kearney Keswick King City Kingston Kingsville Kitchener-Waterloo Kleinburg Komoka Lakeshore Largo Lasalle LaSalle, Ontario Leamington Limehouse Lincoln Lindsay Listowel Little Britain London Maple Markham Markham McGregor Merton Midhurst Midland Milgrove Millbrook Milton Minesing Minett Mississauga Mono Morriston Mississauga Mount Albert Mount Brydges Mount Forest Mount Hope Municipality of Lakeshore Muskoka Napanee Nepean New Dundee New Hamburg New Tecumseth Newcastle Newmarket Niagara Falls Niagara-on-the-Lake Nobleton North Bay North Whitby North York North York (Toronto) North York Nottawa Oakridge Oakville Oakville River Oaks Oasis Boulevard Oil Springs Omemee Orangeville Orillia Orleans Orléans Orono Oshawa Ottawa Otterville Owen Sound Paincourt Palm Harbour Paris Parkhill Penetanguishene Peterborough Petersburg Petrolia Phelpston Pickering Point Edward Pontypool Port Burwell Port Colborne Port Credit Port Dover Port Edward Port Elgin Port Hope Port Lambton Port Perry Port Stanley Princeton Puslinch Red Lake Richmond Hill Ridgeway Rockland Rockwood Rodney Rosseau Saint Marys Sandford Sarnia Sault Ste. Marie Scarborough Schomberg Mississauga Severn Shelburne Simcoe Smithville St. George St. Marys St. Thomas Stayner Stevensville Stittsville Stoney Creek Stoney Point Stouffville Stoutsville Stratford Strathroy Sudbury Tavistock Tecumseh Thamesford Thamesville Thorold Thornbury Thorne Thornhill Thornton Tilbury Tillsonburg Timmins Tiny Tiny Township Tiverton Toronto Tottenham Trenton Tupperville Turkey Point Unionville Unknown Uxbridge Vaughan Victoria Harbour Wainfleet Wallaceburg Wasaga Beach Waterdown Waterford Waterloo Waubaushene Welland Wellesley West Island West Lorne West Hill Weston Wheatley Whitby Whitchurch-Stouffville Willow Beach Windsor Woodbridge Woodstock York Zurich British Columbia Abbotsford Ashcroft Burnaby Chilliwack Coquitlam Courtenay Delta Delta Duncan East Richmond Fort Murray Gibsons Halfmoon Bay Hornsby Isle Kamloops Kelowna Ladysmith Langley Langley Township Maple Ridge Mayne Island Metro Vancouver Mission Nanaimo New West New Westminster North Shore North Vancouver Parksville Penticton Pitt Meadows Port Alberni Port Coquitlam Powell River Prince George Prince Rupert Qualicum Beach Richmond Salmon Arm Sechelt Sooke Surrey Tofino Tsawwassen Valemount Vancouver Vancouver Island Vernon Victoria West Vancouver Westholme Whistler White Rock Alberta Airdrie Calgary Chestermere Drayton Drumheller Edmonton High River Strathmore Quebec Côte-Saint-Luc D.D.O. Dollard-des-Ormeaux Gatineau Gore Greenfield Park Hampstead Kirkland La Prairie Lachine Laval Les Cedres Longueuil Longueuil Mercier Montreal Montreal-Ouest Oromocto Pierrefonds Pointe-Claire Prévost Quebec Repentigny Saint-Bruno-de-Montarville Saint-Lazare Sainte-Sophie Senneville Terrebonne Vaudreuil-Dorion Vaudreuil-Dorion Ville Saint-Laurent Contact 1 877-456-9535 sales@fencepostrepair.com Quick Links Repairs New Fence Contact Us FAQ Privacy Policy"
    },
    {
      "url": "https://www.riverandpostjax.com/",
      "text": "River & Post About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint * * On Fridays and Saturdays, we accept reservations for parties of 12 or less only. If we are able to accommodate any party larger than 12 guests, it will be billed 1 check.  For all parties of 9 or more, a fee of $12 per guest will be charged for no-shows and cancellations within 24 hours prior to the reservation.** For private group reservations, please call 904-233-4110 or email events@river-grp.com.** JOIN US FOR THE BEST brunch IN JAX! every saturday & sunday  11am-4PM Reserve Your Table Today Reservations are for 1st floor dining room only.  Our Rooftop Lounge is first come first served. **In order to provide the best possible experience for our guests, take out orders will be available during 11am to 4pm Tuesday through Sunday. Please call 904-575-2366 to check for availability. Book your River & Post reservation on Resy Our Vision River & Post is a culinary driven restaurant in a warm, modern setting where we strive to captivate our guests with quality ingredients, impeccable service and memorable accommodations for any occasion. River and Post opened its doors on November 20, 2017. Gallery IN THE NEWS We are thrilled to announce that the River Restaurant Group has partnered with Diamond D Ranch to provide fresh local beef at our restaurants in both Jacksonville and St. Augustine!  Please check out the video to hear about their amazing cattle farm and more on our partnership. With a restaurant perched high atop a prominent Riverside building, the team behind River & Post took a commanding view of Jacksonville’s landscape and entered the city’s culinary scene with a delectable seafood-forward menu and easily the best rooftop view in town. While the 450-seat restaurant offers great food, atmosphere and cocktails, the rooftop lounge offers some of the most unique cocktails in town that are handcrafted nightly for guests. More News & Upcoming Events Contact Us Fill out this form to send us a message. If you are trying to make a reservation, please call us at 904-575-2366 or utilize the RESY app above under the RESERVATIONS tab. Hours of Operation Restaurant Monday 4:00pm-10:00pm Tuesday – Sunday 11:00am-10:00pm Rooftop Lounge Sunday 11:00am-10:00pm Monday 4:00pm-10:00pm Tuesday-Wednesday 4:00pm-10:00pm Thursday 4:00pm-11:00pm Friday 4:00pm-12:00am Saturday 11:00am-12:00am Last Call May Occur Earlier Than Posted Time Happy Hour Monday - Friday 4:00pm-7:00pm See our FAQ sheet for more info. Our Location 1000 Riverside AveNUE Jacksonville, FL 32204 United States Restaurant: Suite 100                Rooftop Lounge: Suite 900 904- 575-2366 Careers If you're an experienced hospitality industry veteran, we want to hear from you now! Please click the button below to send us an email with an attached resume for us to review. Apply Now Back To Top 2023 © River & Post | Site By John Darabos"
    },
    {
      "url": "https://www.riverandpostjax.com/private-events",
      "text": "PRIVATE EVENTS — River & Post About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint Our event spaces When it comes to events, we have your group covered! From small intimate dinner gatherings to large cocktail hours with the best views in town, we have it all. Wondering how to make your group have the best night ever?  Find your perfect event space below and then email our Events Coordinator at events@river-grp.com or call at (904)233.4110 for special pricing on your event. Post StReet Lounge | Rooftop Accommodates: 30 to 35 Guests Combine this space with seating from our main rooftop patio to accommodate up to 100 guests. Special Features: Covered by a retractable awning Appetizers served buffet style for your guests River Lounge | Rooftop Accommodates: 20 Guests Special Features: Sunset views Open-air seating Appetizers served buffet style for your guests All seating on Friday and Saturday nights is first come, first served on the rooftop. We do not book large private events on Friday and Saturday evenings on the rooftop All private events must be finalized no later than 48 hours prior to the start of the event. St. johns room | Downstairs Accommodates: 20 to 24 Guests Special Features: AV Equipped with 55\" LCD TV with HDMI Hookup (Please make sure your computer has a standard HDMI port) Window views Glass walls oak room | downstairs Accommodates: 12 Guests Special Features: Also known as the “Chef’s Table” park room | downstairs Accommodates: Up to 20 Guests Special Features: AV Equipped with 55\" LCD TV with HDMI Hookup (Please make sure your computer has a standard HDMI port) Window shutters can be closed to create additional privacy OAK & park room COMBINATION | Downstairs Accommodates: Up to 36 Guests Special Features: AV Equipped with 55\" LCD TV with HDMI Hookup (Please make sure your computer has a standard HDMI port) Window shutters can be closed to create additional privacy Provides opportunities for various table set-ups Can be used as an indoor cocktail hour space Adjustable lighting to brighten the room for a meeting or dim the space for a dinner Large private events are only held Sunday through Saturday except during brunch hours. The rooftop may only be booked Sunday after 4pm through Thursday. Food & Beverage Minimums for the Rooftop Lounge are determined based on guest count, space required and time frame. Food & Beverage Minimums downstairs give your group access to the space for an extended period of time. Please contact our Events Coordinator for more specific information regarding our F&B Minimums. Please visit our FAQs page here for more information on parking, large parties and hours of operation. Thank you for choosing River and Post for your special event! We will respond to all requests in the order at which they are received as all events are booked on a \"first contracted\" basis. Your understanding and patience is appreciated as we work to plan your best event yet! Contact Us! FOR PRIVATE CONTRACTED EVENTS: events@river-grp.com or 904.233.4110 Back To Top 2023 © River & Post | Site By John Darabos"
    },
    {
      "url": "https://www.jacksonville.com/story/entertainment/local/2017/07/07/dining-notes-river-post-finds-its-chef/15762364007/",
      "text": "Dining Notes: River & Post finds its chef Jailhouse calls, interviews and videos, here's what's newly released in Bridegan case News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals LOCAL Dining Notes: River & Post finds its chef Ann Friedman Ovinté in St. John’s Town Center closed its doors on July 3. Owners Jacques Klempf and Fraser Burns, who own the Forking Amazing Restaurant Group, which includes Bistro AIX in San Marco and Il Desco on Park Street in Riverside, decided not to renew the lease. The nearly 5-year-old restaurant was located at 10208 Buckhead Branch Drive. In a joint statement, Klempf and Burns said, “Our group made the business decision to not renew Ovinté’s lease at the St. Johns Town Center. We both feel it is in the best interest of the group to focus on our new and exciting projects within the Forking Amazing Restaurants portfolio. We were thrilled to be one of the first locally owned and operated restaurants at the St. Johns Town Center, and we are forever thankful for our dedicated employees, loyal guests, and the entire Jacksonville community for supporting our concepts and projects throughout the city. The independent restaurant community is growing, and is a huge part of the continued development of Jacksonville. Our group is looking forward to more continued growth and expansion this year.” All outstanding Ovinté gift cards will be honored at Bistro AIX or Il Desco. Wine locker members will be contacted directly to coordinate individual inventory. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Biggie’s Pizza coming to Five Points Jacksonville Beach-based Biggie’s Pizza is coming to Five Points this fall at the former Kostas Pizza Italian Restaurant site . Owner Kostas Margaritis closed the Park Street restaurant on June 10 following 41 years in business due to health problems. Biggie’s Pizza co-owner Erald Broci and his brother opened the pizza shop at 1333 3rd St. N. in Jacksonville Beach last April. Menu highlights include create-your-own pizzas as well as gourmet pizzas such as the Jamaican Me Krazy Pie, which features a spicy Caribbean Jamaican sauce, grilled chicken, mozzarella cheese and pineapples; and the Lucky Luciano Pie, a no-sauce pizza with extra virgin olive oil, grilled chicken, ham, salami, provolone cheese, onions, mozzarella and Romano cheese. They also offer several appetizers include fried lobster macaroni and cheese bites, toasted ravioli and garlic knots, as well as a variety of salads, heroes and desserts. In addition to offering the same menu at the new shop, Broci said graffiti artist Mo Barick, who spray-painted images of rapper Notorious B.I.G. and the World Trade Center at the Jacksonville Beach location, will also be doing artwork on the walls in Five Points. Broci said he hopes to open the Five Points location this fall. “We’re hoping to open in September or October,” he said. “We’re looking forward to being in another part of the town and giving more people the chance to try our pizza.” Biggie’s Pizza in Five Points will be open weekdays from 11 a.m. to midnight and on Friday and Saturday from 11 a.m. to 2 a.m. River & Post finds its chef River & Post, a restaurant and rooftop lounge slated to open this fall in the Summit Building on Riverside Avenue, has hired an executive chef. The restaurant, which will span more than 10,000 square feet, boasts two distinct spaces including a full-service restaurant with a chef’s table and banquet space on the first floor and a rooftop concept with both indoor and outdoor seating with sweeping views of Jacksonville’s skyline and the St. Johns River. Slideshow: Take a look around what will soon be River & Post in Jacksonville Elizabeth Arana, who trained under Wolfgang Puck, Eric Ripert, David Burke and Alain Ducasse and was educated at the Culinary Institute of America and University of Florida, has been hired as the executive chef. Arana will lead the culinary process for River & Post and initially manage the kitchen design and service processes. She will also be responsible for the menu and its preparation as well as oversee the entire kitchen staff. Arana has lead teams at the Alexandria, Provence and Alphabet Kitchen restaurants in New York City as well as working directly under Executive Chef Alain Ducasse at Louis XV in France. She was also featured on the Food Network’s “Door Knock Dinners” with Gordon Elliot. Construction began at River & Post in April and the restaurant is expected to open this fall. River & Post is scheduled to begin hosting interviews for servers, managers, kitchen and bar staff and interested parties in the coming months. Those interested in employment at River & Post can contact the restaurant by email at info@riverandpostjax.com . Newk’s headed to Town Center Newk’s Eatery will open its fifth Jacksonville restaurant on July 10 in St. Johns Town Center near Aspen Dental. The menu features grilled and toasted sandwiches, pizzas, grilled and tossed salads and kettle-batch soups. The restaurant also features a Grab-N-Go cooler section filled with sandwiches, salads, soups, desserts and beverages. The 4,200-square-foot restaurant will offer indoor dining for 138 guests and patio seating for 40 more. For more information about Newk’s Eatery, visit www.newks.com. Another Broken Egg opens this month Another Broken Egg Café is opening a location in Jacksonville Beach on July 17. Prior to the grand opening, the café is hosting a Friends and Family event on July 14-15. Guests will receive a complimentary breakfast or lunch and are encouraged to make a donation to the Greater Jacksonville Area USO. The event will be held on July 14 from 10 a.m. to 1 p.m. and July 15 from 9 a.m. to 1 p.m. at 2230 3 rd St. S. in Jacksonville Beach. Reservations are required to attend with up to four guests and can be made online at www.grandopening.newatabe.com/newopenings-jacksonvillebeach.html . Asian Food Fest Saturday at Hemming The third annual Asian Food Festival returns to Hemming Park on July 8. The festival features authentic Asian and Asian-inspired dishes from Cely’s Filipino Food, Fusion Food Truck, Hapa Li and Blazin Azn as well as imported Asian beers including Lucky Buddha Beer, Tiger Beer and Red Horse Beer. There will also be vendors, artists, games and entertainment for the whole family. The free event will be held from 5-9 p.m. at Hemming Park, 117 W. Duval St. Food Trucks at Regency Saturday Regency Food Truck Takeover will be held on Saturday from 11 a.m. to 4 p.m. at Bealls, 860 Commerce Center Dr. In addition to food trucks, there will be a cash bar, local vendors and live entertainment. Food trucks include The Happy Grilled Cheese, Seaweeds Maine Lobster Rolls, What’s the Catch, Son of a Butcher, Caribbean Sunrise, Butt Hutt Smokehouse, Sweeto Burrito, Manny’s Cuban Food Truck, Joyshtick Food Truck, Mother Truckin Pizza, Team Love Seafood, Skyline Chicken and Waffles, Delish Kebabs, Cold Calf Ice Cream, Le Petite Cheri, Front Porch Kettle Corn and Guanabana. Free ‘pizza’ at Baskin-Robbins Baskin-Robbins is giving guests a free sample of their Polar Pizza on Friday from 12-5 p.m. Guests will have an opportunity to sample Baskin-Robbins’ new Mint Chocolate Chip Polar Pizza, which features a double fudge brownie crust and Mint Chocolate Chip ice cream topped with Oreo cookie pieces, fudge and marshmallow topping. Other Polar Pizza varieties include Chocolate Chip Cookie Dough, Jamoca Almond Fudge and Heath, Oreo Cookies ‘n Cream, Reese’s Peanut Butter Cup or a custom combination of a guest’s favorite ice cream flavor and toppings. Baskin-Robbins has seven locations throughout Jacksonville. For more information, visit www.BaskinRobbins.com . Send any dining news, promotions or rumors of new restaurants openings to ann.friedman@jacksonville.com. Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Legal Notices Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper NIE Jobs Real Estate Classifieds Pay Your Ad Bill Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.jacksonville.com. All rights reserved."
    },
    {
      "url": "https://riveractionuk.com/about/",
      "text": "Our Mission - River Action UK Skip to content Campaigns News About Our Mission Our Impact Our Team Our Supporters Contact Join Us Take action Donate Campaigns Agriculture Sewage Influencing Policy News About Our Mission Our Impact Our Team Our Supporters Contact Join Us Take action Donate Campaigns Influencing Policy Agriculture Sewage Latest View All Independent Water Commission View campaign River Thames Campaign View campaign Our Mission & Strategy We’re on a mission to rescue Britain’s rivers Rivers are the lifeblood of our land. Their health is intertwined with our health as individuals and communities, and with  humanity as a whole. We would not be here without them, and we are dependent on their survival. Our rivers  are facing an environmental calamity, caused by a deluge of pollution and over-abstraction. We believe however, that  this can be reversed and they can be returned to their rightful, vibrant health. The Problem Our rivers are in crisis - they are  dying and our very life line is at risk. All Britain’s rivers are polluted. In England, only 14% of rivers have ‘good’ ecological status and zero have good chemical status. Climate-change driven floods and droughts combined with polluted water threaten communities’ health and water supply. Simultaneously, the government agencies tasked with monitoring and regulating rivers have been defunded so polluters profiteer with impunity. River Action was founded to tackle this crisis. We have devised a solution that goes to the root causes of the problem, using a holistic approach to cascade urgent systemic change across the country. Our Solution Our approach is grounded in community-leadership, natural systems and collaborative action. Our five-year strategy has three overarching goals: 1. Empower local communities: Provide communities and activists with a toolkit that enables them to rescue their local river catchments. Enable citizen science groups and NGOs to collect evidence of pollution levels such as excess nutrients and dangerous bacteria. 2. Mobilise public opinion: Raise public awareness through creative and original content designed to go viral, gain maximum exposure in the national media, and amplify activists’ voices. Leverage this awareness to influence the Government and polluting industries through petitions, boycotts, shareholder actions and positive direct engagement between stakeholders. 3. Advocate government policy and industry practice change: Drive government policy enforcement of regulations through taking legal action against the relevant government bodies and creating a charter of best practices for rivers to expedite reform in regulation, incentivise sustainable water management and to enforce the law. Catalyse behaviour change in polluting industries to adopt river-friendly practices by presenting them with evidence of the pollution they are causing, pressuring urgent investment in outdated infrastructure, offering nature-based solutions, and leveraging consumer and stakeholder support. Take Action End Toxic Sludge Sign the petition to stop spreading sewage sludge. Sign Petition Donate Donate to rescue Britain’s rivers. Donate River Rescue Kit Explore our River Rescue kit to find out how you can take action for your river. Learn more Tell Nando's Tell Nando's CEO: stop killing our rivers! Email the CEO Join us in our mission to rescue britain's rivers. Donate Subscribe to our newsletter Subscribe to our mailing list to keep up with our latest news. Name First Last Email Instagram This field is for validation purposes and should be left unchanged. Δ River action Campaigns News About Contact Get Involved Take action Donate Join Us Get In touch info@riveractionuk.com media@riveractionuk.com Terms Privacy © 2025 River Action UK | Charity Number: 1194995 Design: A-Side Code: Lewis Edward We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Reject Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. Enable All Save Settings"
    },
    {
      "url": "https://www.riverandpostjax.com/donation-request",
      "text": "Donation Requests — River & Post About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint Donation Requests At River & Post, we take pride in supporting the non-profit organizations that strengthen Jacksonville. Being part of this vibrant community, we're inspired by the incredible work done to raise funds and awareness for those in Northeast Florida. By partnering with local non-profits and contributing to community events we're helping to uplift lives. Your continued support makes this possible. To request a donation, please submit the Donation Request Form Below. Please attach all event information as well as tax-exempt documentation if available. The request must be submitted 4 weeks before the event. Our benefaction manager will review the donation request and notify you via email if your donation is granted. While we wish we could donate to all causes, we cannot honor every request. Donations are made in the form of gift cards that can be used at all of our locations for silent auctions, raffles, and prizes. Our gift cards do not expire. Limitations: At this time we cannot provide event sponsorships, sponsorships of teams, or spirit nights. Your organization must be within 30 miles of one of our restaurant locations. We do not accept personal or individual requests. Please complete the Donation form below Please include information about your event, and organization. Name * First Name Last Name Email * Subject * Message * Address Address 1 Address 2 City State/Province Zip/Postal Code Country Thank you! Back To Top 2023 © River & Post | Site By John Darabos"
    },
    {
      "url": "https://riverandfort.com/",
      "text": "River & Fort | Menus Dinner Menu Lunch Menu Rooftop Dessert Menu Info Live Music News FAQ Parking Map Donation Requests Events Gift Cards Purchase a Gift Card Check Balance RESERVATIONS Careers Contact River & Post Saint Book your River & Fort reservation on Resy River & Fort Restaurant & Rooftop Lounge is located right in the heart of downtown St. Augustine at the corner of Avenida Menendez and Charlotte St, directly across from the Castillo de San Marcos. We offer a southern continental inspired menu with local seafood, steaks, wine, and craft cocktails. Our second and third floor rooftops are a perfect place to take in St. Augustine’s historic sights, the gorgeous Bayfront and, on a clear day, see all the way to the lighthouse! We are thrilled to bring our cuisine and service excellence to a community with such rich history and culture. Please follow us on Instagram and keep an eye on our website for future updates. Gift Cards Contact Us Gift cards are available either online (e-cards) or in-person at the restaurant (both plastic and e-cards). You may contact us anytime at info@riverandfort.com for questions regarding your purchase. Thank you very much for your business and we look forward to seeing you soon! APPLY NOW"
    },
    {
      "url": "https://www.riverandpostjax.com/dinner-menu",
      "text": "Dinner Menu — River & Post About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint Back To Top 2023 © River & Post | Site By John Darabos"
    },
    {
      "url": "https://www.visitjacksonville.com/directory/river-post/",
      "text": "River & Post | Visit Jacksonville Skip to content Newsletter Trip Planner 0 Saved 82 ° F Navigation Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Stay in Touch with Everything Jacksonville View Our 2025 Visitor Guide Home River & Post Share Seafood & steaks with a regional twist in a contemporary space with a rooftop bar & scenic views. Website Email River & Post 1000 Riverside Ave, Suite 100 Jacksonville, Florida 32204 Details Open in Google Maps Map Save Save Details Virtual Tour Cuisines Amenities Meeting Spaces Reviews Details Address 1000 Riverside Ave, Suite 100 Jacksonville, Florida 32204 Phone (904) 575-2366 Hours Restaurant: Monday 4:00pm-10:00pm Tuesday – Sunday 11:00am-10:00pm Rooftop Lounge Sunday 11:00am-10:00pm Monday 4:00pm-10:00pm Happy Hour Sunday - Thursday 3:00pm-6:30pm Price Range $$$ - $35 to $45 Virtual Tour Cuisines Seafood Steak House Amenities Brunch Served Dining within walking distance Dinner served Dog Friendly - Outside Only Full Bar Lunch served Off-site catering provider Reservations suggested Restaurant on site Waterfront-Ocean, River, Intracoastal Wine & Beer served Dining with Waterview Rooftop Dining Meeting Spaces Oak & Park Rooms Area : 0 square feet Oak Room Occupancy : 10 - 12 Area : 0 square feet Park Room Area : 0 square feet Post Street Lounge Rooftop Occupancy : 20 - 30 Area : 0 square feet River Lounge Rooftop Area : 0 square feet St. Johns Room Area : 0 square feet Related Content Best Places to Watch Jacksonville’s Sunrises & Sunsets With so many incredible places to immerse yourself in nature, there are naturally some beautiful places to watch the sunrise… Read More Top Bars in Jacksonville, FL When you’re looking for a night out on the town, Jacksonville has you covered. Read More 11 Top Rooftop Bars in Jacksonville Discover the coolest, hippest and most upscale rooftop bars in Jax. Read More Stay in Touch with Everything Jacksonville Sign Up View Our 2025 Visitor Guide Download Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Visit Jacksonville 100 North Laura Street Suite 120 Jacksonville, FL 32202 (800) 733-2668 Industry Resources Newsletter Sign-Up Meet the Team Board of Directors Job Postings Privacy Policy ©2025 Visit Jacksonville, All Rights Reserved Cookies Policy This website uses cookies to optimize your visitor experience. Accept or Learn more Quick Search Search Location Map"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "text": "Board & Staff | Team Jack Foundation Follow Follow Follow Follow U Search  Shop w News w Blog Donate Search for: About Us About Us Our Mission Our History Jack Hoffman Board & Staff Financials Contact Us Our Impact Projects & Progress We Fund Nebraska Childhood Brain Tumor Program Scientific Advisory Board Apply for TJF Grant Research Articles Brain Cancer About Brain Cancer What is DIPG? Brain Cancer Facts Cancer Awareness Months Brain Tumor Awareness Month Childhood Cancer Awareness Month Family Resources Events Takedown the Tumor Gala Golf Classic An Evening with Henry Winkler Miles for Team Jack Radiothon Texas Golf Broken Chair Trophy View All Events Get Involved Fundraise Workplace Giving Host an Event Birthday Fundraiser Partner Memorials Give Our Sponsors Volunteer Heroes Donate Shop Blog Select Page About Us Team Jack Board and Staff Team Jack Board Members The Team Jack Foundation is a nonprofit under the leadership of a volunteer board of directors consisting of community and business leaders from around Nebraska and the country. The board meets monthly to discuss budgets, events and other news about the fight against childhood brain cancer. The expert guidance of our volunteer board consistently drives Team Jack to new heights. Rex Burkhead Rex Burkhead is a retired running back of the National Football League. Originally drafted by Cincinnati in the sixth round (190th overall) of the 2013 NFL Draft, Burkhead spent four seasons with the New England Patriots, before signing with the Texans prior to the 2021 season. He was a key offensive contributor each season for the Patriots and was a member of the Patriots 2018 Super Championship team, scoring the last two touchdowns during the thrilling overtime AFC Championship against the Kansas City Chiefs. Burkhead played college football at the University of Nebraska, which is where his story with Team Jack began. Rex has played an important part to the development and ongoing success of the Team Jack Foundation. Not only does Burkhead serve as a board member on the Foundation’s board of directors, but he was instrumental in the Foundation’s inception itself. Team Jack was formed to raise funds for pediatric brain cancer research. Its namesake is Jack Hoffman, a 18-year-old from Nebraska who has been battling the disease for most of his life. Hoffman and Burkhead formed an unlikely friendship when Burkhead was a star player at Nebraska that has continued to this day. Hoffman even won a “Best Moment” ESPY award when he entered Nebraska’s 2013 spring game and scored a 69-yard touchdown while sporting No. 22, Burkhead’s number during his college days. The two even met President Barack Obama together at the White House in 2013. Rex is from Plano, TX, where he currently resides with this wife, Danielle, and two sons, Jett and Steel. Karen Carson Karen Carson is a Co-founder of Fat Brain Toys, a retailer and manufacturer of educational toys and games. Karen’s introduction to the toy industry came about at the suggestion of her then 10-year old son, Adam. In the Fall of 2002, after finding it difficult to locate specialty toys online, her son suggested that she and her husband Mark build their own website to better serve the growing demand for toys online. Carson accepted the challenge from her son and thus began a new career in the toy industry. Since 2002, Fat Brain Toys has grown into one of the largest online toy stores in the country. Recognizing the importance of a true multi-channel experience, Fat Brain Toys has since expanded into brick & mortar retail, opening retail store experiences in Omaha, Nebraska and Overland Park, Kansas. In addition to the company’s direct-to-consumer efforts, the company also designs and wholesales it’s own line of products to over 2,000 retailers around the world. Fat Brain Toys is a frequent benefactor to a number of non-profit organizations that support the needs of children, including: Team Jack Foundation, Omaha Children’s Hospital Foundation, Royal Family Kids, The Toy Bank, and many others. Karen has been married to her husband and business partner, Mark, since 1992, and lives in Elkhorn, Nebraska. Karen and Mark have three children, Adam, Makenzie, and Jenna. Scott Fangman Scott Fangman has 20+ years of industry experience and is the Director of Business Development at Wealth Enhancement Group where he leads outreach to RIAs across the US. He was most recently as the Business Development Officer – M&A for Advisor Seekers, leading their markets and sales team. Scott joined Wealth Enhancement Group because of the shared purpose, mission, and values. Scott previously held regional leadership roles at TD Ameritrade Institutional, where he was recognized multiple times for his accomplishments in surpassing company goals. A Nebraska native, Scott currently resides in Omaha, NE with his wife Anne and their 2 (teenage!) children. When not working, Scott enjoys hiking and reading. Scott also serves on the Board of Directors for the Team Jack Foundation raising funds and awareness for pediatric brain cancer research – his son is a survivor. Dr. Kari Galyen Dr. Kari is originally from Pierce, NE. She went to the University of Nebraska. Dr. Kari Galyen is a general practice family physician. Dr. Galyen and her husband, Dr. Jim Galyen, own and operate Sunny Meadow Medical Clinic in Norfolk, Nebraska. Originally from Pierce, NE, Dr. Galyen attended the University of Nebraska Medical Center where she received her medical doctor (MD) degree. She then completed a dual internal medicine/family practice residency in Omaha and Kearney, NE. Dr. Galyen is a strong advocate for increased funding for child brain cancer research and was a guest speaker at the 2013 Team Jack Foundation Gala. She has a strong commitment to helping improve treatment options and overall survivorship for children facing the disease. Dr. Galyen is married to Dr. Jim Galyen and together they live in Atkinson, NE with their four children, Ainsley, Brody, Blake and Luke. Brianna Hoffman Brianna Hoffman is a pharmacist at West Holt Medical Services in Atkinson, NE. She is also the Co-Founder and Board Chair of the Foundation. To contact: Brianna@TeamJackFoundation.org Kenneth Maxwell Kenneth Maxwell is the co-founder and Vice President of Advertising for Proxibid.com, a privately held Nebraska based e-commerce Company serving more than a million buyers, and thousands of businesses, auction companies, and non-profit organizations worldwide. In his tenure with the company he has led multiple teams responsible for the design and development of their real-time auction platform, and more recently, led the expansion of the company’s marketing team to provide advertising and creative services to Proxibid and their clients. Prior to Proxibid, Kenneth was the creative director for another Nebraska based startup – Leftbid.com, and was also a professional artist, selling original art through Anderson O’Brien Fine Art Gallery in Nebraska. Kenneth studied fine art at the University of Nebraska – Lincoln, and abroad in Florence, Italy. He is classically trained in painting and sculpture and graduated from UNL with a degree in Fine and Performing Arts. Ken resides in Omaha with his wife Lynn, and two children, Kate and Harrison – as well as two black Labrador retrievers, Cira and Chloe, AKA – “the meatballs”. Tiffany Miller Tiffany Miller serves as Deputy General Counsel for First Bank & Trust, Brookings, SD. She has practiced in the banking and financial services industry for over 16 years, specializing in contract negotiation and compliance. Outside of the office, Tiffany is involved in a number of community activities. She serves on the board of directors for Downtown Sioux Falls, Inc., and is on the Sioux Falls Area Chamber of Commerce Community Appeals Committee. Tiffany is motivated to serve the Foundation by the grueling and potentially harmful treatments currently used to treat pediatric brain cancer patients and the dire need for more funding to support pediatric cancer research. In honor of Jack and all children who are called to the front lines in the battle against cancer, Tiffany is committed to the Team Jack mission of raising awareness and funds for pediatric cancer research. She and her family are proud to Take A Stand in the fight against brain cancer together with the Team Jack Foundation. Tiffany and her husband, Dr. Nate Miller, are parents to two young boys, Noah and Luke. Janae Simard Janae Simard is a Registered Dental Hygienist with Family and Implant Dentistry in Lincoln, NE, since 1997. Janae is an originating member of the Team Jack Foundation board and is committed to helping the organization fund pediatric brain cancer research. She was appointed secretary for the Team Jack Foundation in 2013. Janae and her husband Robby live in Omaha, Nebraska with their two boys, Eli and Luke. The Simard family is dedicated to helping the Team Jack Foundation improve treatment for children with brain tumors. Having endured their own family adversity with one of their own children, Janae is a compassionate leader who is known for being a “hands on” servant leader for the Foundation. Janae is active in her childrens’ school and devotes much of her spare time working with children. She enjoys traveling, scuba-diving and family activities. Mark Walz Mark was born and raised in Lincoln, Nebraska. He graduated Summa Cum Laude from Nebraska Wesleyan University in 1988 with a Bachelor of Science Degree in Economics and an emphasis in Accounting. Mark began his professional career in 1988 as an independent auditor with the international accounting firm of Touche Ross & Co. (now Deloitte) in their Lincoln, Nebraska office. His client focus was primarily the banking and insurance industries. In May of 1991, Mark left Deloitte to become the Accounting Manager at Farmers Mutual Insurance Company of Nebraska and has been employed in various positions of increasing responsibility with Farmers Mutual since that time. He was promoted to Controller in 1997; Treasurer in 1999; Vice President and Treasurer in 2002; Senior Vice President, Treasurer and Chief Financial Officer in 2006; Executive Vice President, Treasurer and Chief Operating Officer in 2009; President, Treasurer and Chief Operating Officer in 2010; President and Chief Executive Officer in 2014; and Chairman, President and Chief Executive Officer in 2015. Mark is a member of both the American Institute of Certified Public Accountants and the Nebraska Society of Certified Public Accountants. Mark serves on the Board of Directors of Farmers Mutual Insurance Company of Nebraska, National Association of Mutual Insurance Companies, Nebraska Property and Liability Insurance Guaranty Association, Nebraska Chamber of Commerce, United Way, Team Jack, Junior Achievement, and the US Bank Advisory Board. *Andy Hoffman (Board Chairman 2013 - 2021) Courageous. Passionate. Gregarious. Brave. Selfless. Spiritual. Unwavering. These are just a few of the words used to describe our Team Jack Foundation co-founder, Andy Hoffman. Tributes have poured in from around the country following Andy’s passing on Monday, March 1. Andy was shockingly diagnosed with glioblastoma multiforme, a rare and very aggressive cancer, after having a seizure while running on the Cowboy Trail, in his hometown of Atkinson, Nebraska, in July 2020. Even after getting this devastating news, Andy was more determined than ever to find ways to raise money for Team Jack. And fast, while he was still able. Following his diagnosis, the Team Jack Foundation launched the “Twice the Fight” campaign as a way to show support for both Jack and Andy Hoffman’s brain cancer battles. One of Andy’s first visions to raise money for Team Jack was to sell t-shirts, and this time selling “Twice the Fight” t-shirts saw nearly 3,000 sold for over $65,000 raised. Earlier in 2020, Andy worked hard to fulfill his New Year’s resolution and finished writing his first book, “Yards After Contact” which details the family’s experience during Jack’s fight. It was published in October 2020 and has been a huge success. From the beginning, Andy made one thing clear with his book: 100% of the proceeds for the book sales go to Team Jack and, Team Jack would own the copyright to the book. To date, over 2,500 books have been sold, raising nearly $80,000 for Team Jack. In the book, Andy writes: “This book is the mission statement for the Team Jack Foundation, a Nebraska business that tirelessly works daily to improve brain cancer treatment in its region and nationally fund child brain cancer research. I hope you can open this book and know Jack and what his foundation stands for.” In early December, both ESPN and BigTen Networks produced shows giving an update on the Hoffmans’ life with cancer. The ESPN E:60 story aired as part of programming highlighting the importance of cancer research during ESPN’s 14th consecutive V Week on Dec.1-12. Andy spoke with Chris Connelly about his fight and his hopes for the future of those fighting childhood brain cancer. “This is going to sound screwy, but it’s been a blessing,” he said. “We’re supposed to thank God for the challenges that he gives us, and I’ve prayed the thank-you prayer. Thank you, God, for giving me brain cancer. Because he knows what he’s doing. And you don’t.” Check off another chance for Andy to raise awareness of this disease. Andy always looked to seize every opportunity to raise awareness for childhood brain cancer and fund research from some of the brightest research minds in the country. Although the Hoffmans knew the research they were funding may not benefit their son Jack, he did it for all the families down the road that will receive the horrible diagnosis of pediatric brain cancer. Andy remained hopeful even when faced with the grim nature of his prognosis. Andy worked hard to squeeze more life into his 42 years than most get in a lifetime. He did a couple of bucket list items, including a New Mexico elk hunt with his kids, his wife, and brothers during the last months of his life. He kept his unwavering faith and spent every moment possible with his family. In mid-February, his condition progressed, and his fight ended on Monday, March 1, where he peacefully passed away at home surrounded by his loving family. He is survived by his wife Brianna, children Jack, Ava and Reese, parents Gary and Karen Hoffman of Spencer, brothers Tony (Amy) Hoffman of Crofton and Michael (Jacky) Hoffman of Spencer, sister Julia (Chris) Jones of Tellico Plains, TN, parents-in-law Kerry and Bonnie Stiner of Burke, SD, sister-in-law Tiffany (Nate) Miller of Sioux Falls, SD, brother-in-law Kollin (Sarah) Stiner of Lakeville, MN, nephews Nathan Hoffman of Spencer, Hudson and Hayden Hoffman of Spencer, Luke Jones of Cleveland, OH, Matt and Nate Jones of Clarksburg, MD, Noah, Luke and Graham Miller of Sioux Falls, SD, and Karson Stiner of Lakeville, MN, nieces Alison (Justin) Wegenke of Fort Collins, CO, Samantha (Cody) Kahl of Grand Island, NE, Lauryn and Amelia Hoffman of Spencer, and Isabel and Nora Stiner of Lakeville, MN. He was also excited to be a Great Uncle to Will and Wren Wegenke and Alton Kahl. He was preceded in death by his brother Luke Hoffman. The Team Jack Foundation is committed to working harder than ever to ensure Andy’s legacy shines, and his mission grows. He had big ideas and big dreams for the foundation, and we will focus on making those a reality. He is irreplaceable and his smile and energy will be missed. But we will always follow the path he set to be a success. And fight on in his honor. How lucky we all are to have known him. * * Tragically, Jack’s dad, Andy Hoffman, was diagnosed with brain cancer (glioblastoma) in July of 2020. He battled for seven months before passing away from the disease. The Team Jack Foundation is committed to upholding Andy’s legacy by working harder than ever to fund the cure for childhood brain cancer. Team Jack Staff Team Jack’s caring, driven staff is dedicated to ending childhood brain cancer by pushing Team Jack forward every day. Kylie Dockter, Executive Director Kylie (Tielke) Dockter joined the Foundation in August 2013 as the first full time employee for the Foundation and is excited to be part of the fight against pediatric brain cancer. Kylie received her Bachelor of Science degree in Journalism: Public Relations in December 2009 from the University of Nebraska at Kearney with a minor in Political Science and has strong qualifications in management, marketing and sales through educational and job experience. She has been involved in the non-profit sector for over thirteen years. Prior to the Foundation, Kylie was the Director of Marketing and then Executive Director of a non-profit that benefits nearly 50 non-profits in the Denver, CO metro area. In addition to management skills, she assisted in planning large scale events to raise money for these 50 non-profits. She joined the Team Jack Foundation in August 2013 as the Chief Development Director and is now the Executive Director of the Foundation. Working with a Foundation that has such an impact on children and children’s lives has truly been a career dream for Kylie, so she is very excited to join such a prestigious and impactful Foundation to help with their goals. She was born and raised in Atkinson, NE and is married to her husband Stuart Dockter who is originally from North Dakota and together they have a daughter, Graesyn, and a son, Hayes. To contact: kylie@teamjackfoundation.org Lindsey Nemetz, Director of Marketing Lindsey (Mlnarik) Nemetz, a native of Clearwater, Nebraska, earned her degree in Business Administration from Nebraska Wesleyan University in 2001. While at NWU, she was a member of the Prairie Wolves women’s basketball and softball teams from 1997 to 2001. Lindsey now lives in Atkinson with her husband, Chris, and their five children: Maci, Drake, Avery, Landri, and Brooke. After a six-year career in property and casualty insurance, Lindsey shifted her focus to raising her family. In October 2013, she began working for the Team Jack Foundation on a limited part-time basis. Over time, her role and passion for the mission grew, leading her to become the Foundation’s Director of Marketing in November 2018. She is deeply dedicated to helping find a cure for childhood brain cancer. To contact: lindsey@teamjackfoundation.org Shirley Rossman, Event Coordinator Shirley Rossman joined the Team Jack Foundation in August 2020, assisting with donation processing and merchandise shipping. Before that, she spent her career as an elementary school teacher, retiring from West Holt Public Schools in 2020. A lifelong resident of Atkinson, Shirley and her husband, Bruce, are proud parents of four grown daughters which includes a set of triplets, and grandparents to ten grandchildren. To contact: shirley@teamjackfoundation.org Make an impact through your inbox News, upcoming events and research updates delivered straight to your inbox. About Us Our Mission Jack Hoffman Board & Staff Fund Allocation Financials Our Impact Scientific Advisory Board Sponsored Grants Research Articles Brain Cancer Family Resources Cancer Awareness Months Get Involved Fundraise Give Events Our Sponsors Volunteer Follow Follow Follow Follow Follow © 2025 Team Jack Foundation. POB 607, 47640 US Highway 20, STE 2, Atkinson, NE, 68713. All Rights Reserved. Team Jack Foundation, Inc. is exempt from federal income tax under section 501(c)3, ID Number 46-2301134, of the internal revenue code. All contributions to the Foundation are tax deductible. Privacy Policy • Contact"
    },
    {
      "url": "https://www.riverandpostjax.com/faqs",
      "text": "FAQs — River & Post About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint Frequently Asked Questions Parking Parking is available in the parking lot directly behind the main building, on the adjacent corner of Riverside Avenue & Post Street as well as across the street in a public access lot next to the Garden Club. Additional parking is available along the streets surrounding our building. For a complete parking map, please click here . Hours of Operation Restaurant (Suite 100) Monday 4:00pm-10:00pm Tuesday – Saturday 11:00am-10:00pm Sunday 11:00am-10:00pm [Brunch served 11:00am-4:00pm on Saturdays and Sundays downstairs only] Dinner Service begins at 4:00pm daily Rooftop Lounge & Bar (Suite 900) Sunday 11:00am-10:00pm Monday 4:00pm-10:00pm Tuesday – Thursday 4:00pm-11:00pm [Last call subject to change due to volume] Friday 4:00pm-VOLUME Saturday 11:00am-VOLUME Our rooftop lounge menu can be found here ROOFTOP MENU BRUNCH Brunch is served in our 1st floor dining room and patio on Saturdays and Sundays 11:00 a.m. until 4:00 p.m.  The brunch menu is not available on the rooftop.  Our regular lunch menu is not available on Saturdays and Sundays.  Please see above for our rooftop menu and check out our social media pages for current drink specials and live music! TAKE OUT MEALS As of Winter 2021, take out orders will only be available available from the hours of 11am-4pm Tuesday through Sunday. Happy Hour Specials Our Happy Hour specials run Monday -Friday, 4 - 6 p.m.!  Specials are listed below. 1/2 Off wine $5 well liquor drinks $2 off beers 1/2 off wings & flatbreads Dress Code While we do not have a specific dress code, we refer to the preferred attire as “Resort Casual” which can include things like khakis or nice jeans and a button-up or polo shirt. Ladies tend to wear nicer jeans and tops or dresses. We also see a lot of business casual guests who are joining us for lunch or dinner after the workday. On the weekends, we do see guests dress up a little more to celebrate their special occasions. No overly revealing clothing is allowed on any night. Food Preferences & Allergies If you have a specific food allergy, we will do our best to accommodate those needs by altering dishes from our main menu. Please review the menus online and speak with your server upon arrival about any special requests. ROOFTOP SEATING All of the seating on our rooftop is first come, first served. If you are interested in privately contracting an event space, we can do so Sunday through Thursday nights. For more information, please visit our Private Events page here . An automatic 20% gratuity will be added to the final bill to any rooftop guest walk out without a signature. private Events If you are wondering if your group is better suited as a reservation or as a contract, ask yourself the following questions …. Do I want a space 100% our own for my group? Do I need to use AV equipment? Will my party be paying on one check? Am I okay signing a contract and placing a credit card number on reserve? Do I want to secure rooftop space? If you answered “YES!” to most of these questions, then a contract is for you! To take the next steps, please visit our Private Events page and email our Events Coordinator. If you are looking for just a table for your group and everyone to order or pay on their own, please read below. Large Party Reservations We are able to accommodate groups of up to 12 guests total every day of the week.  Please call the restaurant to reserve parties of 8 or more guests.  All large parties (8+) are subject to a fee of $12 per guest for no-shows or cancellations within 24 hours of the reservation. A set gratuity of 20% will be added to non-contracted parties of 6 or more. Parties of more than twelve will be billed on one check. If separate reservations are made for the same party, guests will not be sat together in our dining room. They will be sat based upon business volume. Larger reservations over 12 will require speaking with our events coordinator for an assigned space and menu.  Please note: making several reservations of smaller groups does not ensure we can seat those groups together as a large table or even in the same general area of the restaurant.  Our group seating policies are here to ensure the best possible service and wait times during our busiest hours. If you are interested in privately contracting an event, please visit our Private Events page here for more information. Corkage & Cake Fee There is a $20 per bottle corkage fee for any outside beverages as well as a $20 outside dessert fee for any cakes, cupcakes, etc. brought in. Decorations Light decorations are allowed for group reservations, but are limited to 2 standard-sized balloons (no large number balloons or arches), plates, napkins and low-height centerpieces. No confetti or glitter is allowed. If you are planning on decorating, you can do so at the start of your reservation time, but your group must be sat within 15 minutes and begin ordering at that time. For privately contracted events, please check with our Events Coordinator on any decoration restrictions. Smoking There is no smoking allowed on the rooftop. All smokers must go downstairs and outside into one of the three smoking areas surrounding the building. Have a specific question not answered above? Contact us here . Back To Top 2023 © River & Post | Site By John Darabos"
    },
    {
      "url": "https://www.riverandpostjax.com/contact-us",
      "text": "Contact — River & Post About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint About Reservations Vision Upcoming Events Contact Home About Gallery Menus Brunch Menu Lunch Menu Dinner Menu Rooftop Menu Reservations PRIVATE EVENTS Live Music Gift Cards Purchase a Gift Card Check Balance Contact Us Contact Us FAQs Careers Donation Request River & Fort Saint Contact Us Fill out this form to send us a message. If you are trying to make a reservation, please call us at 904-575-2366 or utilize the RESY app above under the RESERVATIONS tab. Hours of Operation Restaurant Monday 4:00pm-10:00pm Tuesday – Sunday 11:00am-10:00pm Rooftop Lounge Sunday 11:00am-10:00pm Monday 4:00pm-10:00pm Tuesday-Wednesday 4:00pm-10:00pm Thursday 4:00pm-11:00pm Friday 4:00pm-12:00am Saturday 11:00am-12:00am Last Call May Occur Earlier Than Posted Time Happy Hour Monday - Friday 4:00pm-7:00pm See our FAQ sheet for more info. Our Location 1000 Riverside AveNUE Jacksonville, FL 32204 United States Restaurant: Suite 100                Rooftop Lounge: Suite 900 904- 575-2366 Careers If you're an experienced hospitality industry veteran, we want to hear from you now! Please click the button below to send us an email with an attached resume for us to review. Apply Now Back To Top 2023 © River & Post | Site By John Darabos"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "text": "Contact Us - Get In Touch With Our Security Systems Company 24/7 845-445-6446 info@secureitsecurities.com 24 Hour Emergency Service About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Buy Now About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Login Register | Login | My Cart 0 24 Hour Emergency Service Contact Us for Security Services in Rockland County, NY Home › Contact Us for Security Services in Rockland County, NY Contact Us for Security Services in Rockland County, NY Contact Secure IT Securities for Security Solutions in Rockland County Whether you're a homeowner in Pearl River or a business owner in Rockland County, Secure IT Securities\nCorp. offers security solutions to meet your specific needs. Reach out to us for a security consultation or to request a security quote . Our staff will work closely with\nyou to understand your needs and provide the best possible security solution. You can also schedule a\nsecurity assessment, to have our experts evaluate your property and recommend the most suitable\nsecurity measures. To get started, give us a call at (845) 445-6446 or fill out form below, and we'll be in touch with you. 24 Hour Emergency Service 1 Blue Hill Plaza, Suite 1509 Pearl River, NY 10965 845-445-6446 info@secureitsecurities.com Hours Monday - Friday: 8:00 AM - 5:00 PM Saturday : 9:00 AM - 3:00 PM Sunday : CLOSED Leave A Message Contact First Name: * Last Name: * City: * Phone Number : * Email: * Message: Contact Us Secure IT Securities Corp. 1 Blue Hill Plaza #1509 Pearl River, NY 10965 info@secureitsecurities.com 845-445-6446 About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Return Policy Standard Service Agreement Accessibility Statement Privacy Policy Our Partners Terms Of Services Smart Home Store Contact Us Blog About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Blog Our Partners Return Policy Cookie Policy Contact Us New York State Fire & Security License #12000295002 | Smart Home Security Solutions in Pearl River, NY My Cart 0 By using our website, you agree to the use of cookies as described in our Cookie Policy Accept × Shopping Cart × Your cart is empty. Continue Shopping"
    }
  ]
}