{
  "fuentes": [
    {
      "url": "https://loros.co.uk/pinboard-content/pin-board-august-2024-stories/staff-bbq-event-pin-board",
      "email": "facebook-banner@2x.png"
    },
    {
      "url": "https://loros.co.uk/pinboard-content/pin-board-august-2024-stories/staff-bbq-event-pin-board",
      "email": "favicon@2x.png"
    },
    {
      "url": "https://loros.co.uk/pinboard-content/pin-board-august-2024-stories/staff-bbq-event-pin-board",
      "email": "info@loros.co.uk"
    },
    {
      "url": "https://loros.co.uk/pinboard-content/pin-board-august-2024-stories/staff-bbq-event-pin-board",
      "email": "touch-icon@2x.png"
    },
    {
      "url": "https://loros.co.uk/pinboard-content/pin-board-august-2024-stories/staff-bbq-event-pin-board",
      "email": "twitter-banner@2x.png"
    },
    {
      "url": "https://rivierabarandgrillpuntagorda.com/contact-riviera-bar-grill-punta-gorda/",
      "email": "gm@rbgpg.com"
    },
    {
      "url": "https://rivierabarandgrillpuntagorda.com/",
      "email": "gm@rbgpg.com"
    },
    {
      "url": "https://www.independent.com/2021/10/25/riviera-bar-goes-old-school-on-figueroa-street/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://www.independent.com/2021/10/25/riviera-bar-goes-old-school-on-figueroa-street/",
      "email": "subscriptions@independent.com"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://riviera-rl.com/who-we-are/",
      "email": "aortner@eurogroup-vacances.com"
    },
    {
      "url": "https://riviera-rl.com/who-we-are/",
      "email": "beth@riviera-rl.com"
    },
    {
      "url": "https://riviera-rl.com/who-we-are/",
      "email": "louisa@riviera-rl.com"
    },
    {
      "url": "https://riviera-rl.com/who-we-are/",
      "email": "zac@purpleski.com"
    },
    {
      "url": "https://rivierabarandgrillpuntagorda.com/riviera-bar-and-grill-menu/",
      "email": "gm@rbgpg.com"
    },
    {
      "url": "https://puntagordachamber.com/",
      "email": "artboard-1@4x.png"
    },
    {
      "url": "https://puntagordachamber.com/",
      "email": "our-mission@4x.png"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://riverviewgrillandbar.com/about-us",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://rivierabarandgrillpuntagorda.com/contact/",
      "email": "gm@rbgpg.com"
    }
  ],
  "mails": [
    "aortner@eurogroup-vacances.com",
    "artboard-1@4x.png",
    "beth@riviera-rl.com",
    "eben@eyebytes.com",
    "facebook-banner@2x.png",
    "favicon@2x.png",
    "gm@rbgpg.com",
    "info@communityaccessnaperville.org",
    "info@loros.co.uk",
    "info@rivervillegrill.com",
    "logo@2x.png",
    "louisa@riviera-rl.com",
    "our-mission@4x.png",
    "subscriptions@independent.com",
    "touch-icon@2x.png",
    "twitter-banner@2x.png",
    "zac@purpleski.com"
  ],
  "nombre_sitio": "rivierabarandgrillpuntagorda.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://loros.co.uk/pinboard-content/pin-board-august-2024-stories/staff-bbq-event-pin-board",
      "text": "Staff BBQ event (Pin Board) Search LOROS Logo About LOROS About LOROS Our History News Podcast Here for you, because of you We're here making a difference We're here for our patients and families LOROS Magazine Join LOROS Jobs at LOROS Volunteering at LOROS Our Culture Contact Contact Comments & Complaints FAQs Media enquiries Organisation Meet the team Board of Trustees Patrons & Ambassadors Annual reports Our Care Our Care The care we provide How to access our care Patient information leaflets Bereavement Hubs Useful Information Visiting a friend or relative Sources of support for you and your family The LOROS HUG Quality of our care Safeguarding Share your story Healthcare Professionals How to refer a patient to LOROS Clinical Guidelines Get Involved Making a donation Ways to donate to LOROS Regular giving Giving in memory Giving a gift in your Will Affinity savings accounts LOROS gift cards Gift Aid your donation Fundraising & Events Events Fundraising toolkit LOROS challenges Fundraising for my challenge Challenge FAQs Join the LOROS Walking Group Summer Tennis League Why support LOROS? Event galleries Lottery, Scratch Cards & Raffle LOROS Lottery Why play the Lottery? Latest Lottery results Lottery @ Lunch LOROS Lottery gift Redeem your Lottery gift Scratch cards Wedding favours Scratch cards at work Raffle Raffle at your workplace Gambling and You FAQs Support LOROS Business partners Charity of the Year Sponsorship opportunities Gifts in kind VolunTEAMS I Experience VR for Business LOROS Business Club Fundraise at work Lottery @ Lunch Scratch cards at work Schools, colleges & universities Partnership with University of Leicester Venue Hire Volunteering at LOROS Event Volunteering Jobs at LOROS Shops Our shops LOROS shops Donating your items Retail Gift Aid Shop online with LOROS Refund Policy Volunteering at LOROS Centre for Excellence Education and Research Education Training Online learning Research Research at LOROS Communication Practices & Decision-making Symptom Management in Advanced Illness Research Posters Supporting people from ethnically diverse backgrounds Supporting family carers Patient & Public Involvement Centre for Excellence About Centre for Excellence Centre for Excellence Newsletter Venue and Room Hire Research studies Thinking Ahead Thinking ahead stories Assisted ventilation and the end of life Just-in-case medications for end of life care Organ & tissue donation Search Donate Refer LOROS Hospice Care Our Care The care we provide How to access our care Patient information leaflets Bereavement Hubs Useful Information Visiting a friend or relative Sources of support for you and your family The LOROS HUG Quality of our care Safeguarding Share your story Healthcare Professionals How to refer a patient to LOROS Clinical Guidelines Making a donation Ways to donate to LOROS Regular giving Giving in memory Giving a gift in your Will Affinity savings accounts LOROS gift cards Gift Aid your donation Fundraising & Events Events Fundraising toolkit LOROS challenges Fundraising for my challenge Challenge FAQs Join the LOROS Walking Group Summer Tennis League Why support LOROS? Event galleries Lottery, Scratch Cards & Raffle LOROS Lottery Why play the Lottery? Latest Lottery results Lottery @ Lunch LOROS Lottery gift Redeem your Lottery gift Scratch cards Wedding favours Scratch cards at work Raffle Raffle at your workplace Gambling and You FAQs Support LOROS Business partners Charity of the Year Sponsorship opportunities Gifts in kind VolunTEAMS I Experience VR for Business LOROS Business Club Fundraise at work Lottery @ Lunch Scratch cards at work Schools, colleges & universities Partnership with University of Leicester Venue Hire Volunteering at LOROS Event Volunteering Jobs at LOROS Our shops LOROS shops Donating your items Retail Gift Aid Shop online with LOROS Refund Policy Volunteering at LOROS Education Training Online learning Research Research at LOROS Communication Practices & Decision-making Symptom Management in Advanced Illness Research Posters Supporting people from ethnically diverse backgrounds Supporting family carers Patient & Public Involvement Centre for Excellence About Centre for Excellence Centre for Excellence Newsletter Venue and Room Hire Research studies Thinking Ahead Thinking ahead stories Assisted ventilation and the end of life Just-in-case medications for end of life care Organ & tissue donation About LOROS About LOROS Our History News Podcast Here for you, because of you We're here making a difference We're here for our patients and families LOROS Magazine Join LOROS Jobs at LOROS Volunteering at LOROS Our Culture Contact Contact Comments & Complaints FAQs Media enquiries Organisation Meet the team Board of Trustees Patrons & Ambassadors Annual reports Care Donate Staff BBQ event Please save the date for the LOROS staff thank you BBQ! This event is kindly provided and completely funded by an external charity, Rapid Relief Team, with no expense to LOROS. Thursday 15th August 4pm to 7pm Social area Please do find below the link to sign up to the thank you BBQ next week and advise of your dietary needs. Fill in your dietary needs We really value your support and want to keep in touch about the difference it's making Sign up to receive email updates Follow us: @LOROSHospice info@loros.co.uk Tel (0116) 231 3771 LOROS,\n                Groby Road,\n                Leicester LE3 9QE Policies Jobs Volunteer Staff Registered Company in England & Wales: 1298456 Registered Charity No. 506120. Website design by Root Studio"
    },
    {
      "url": "https://rivierabarandgrillpuntagorda.com/contact-riviera-bar-grill-punta-gorda/",
      "text": "Contact Riviera Bar & Grill Punta Gorda - Riviera Bar and Grill Menu Events Contact Select Page Boater Welcome If you are wondering if we can accommodate your boat, the answer is yes! Coordinates: 26.888362, -82.053196 Opening Hours Monday Through Sunday Open 11am – 9pm Punta Gorda Contact Us (941) 639-2633 gm@rbgpg.com 5500 Deltona Dr Punta Gorda, FL 33950 Facebook Instagram Designed by ASEB Consulting | © Copyright Riviera Bar & Grilll 2025, All Rights Reserved"
    },
    {
      "url": "https://rivierabarandgrillpuntagorda.com/",
      "text": "Riviera Bar & Grill Punta Gorda | Waterfront Dinning | Live Music Menu Events Contact Select Page Punta Gorda Waterfront Dinning Special Announcements None at this time. Punta Gorda Waterfront Dining Happiness is Riviera Discover a slice of paradise right here in Punta Gorda at Riviera Bar and Grill. Nestled by the shimmering waters, our waterfront dining experience is more than just a meal – it’s a journey of culinary delights and good times that’ll have you coming back for more. Let the rhythm of the water and the melody of live music (Thursday -Sunday) create the perfect ambiance for your dining experience. Raise your glass and toast to good times with our daily happy hour. Dive into a curated selection of cold, refreshing cocktails that’ll tickle your senses and add an extra sparkle to your day. Waterfront Dining Fresh Food Our chefs are creating culinary delights, conjuring up dishes that are a feast for both the eyes and the palate. Using the freshest ingredients, we create flavors that’ll take you on an amazing journey through Punta Gorda’s culinary landscape. The combination of delicious food, stunning views, and exceptional service will keep you coming back for more. Our Menu Fresh Food Our chefs are creating culinary delights, conjuring up dishes that are a feast for both the eyes and the palate. Using the freshest ingredients, we create flavors that’ll take you on an amazing journey through Punta Gorda’s culinary landscape. The combination of delicious food, stunning views, and exceptional service will keep you coming back for more. Our Menu Seamless Boater Access Arriving by boat? No problem! Riviera Bar and Grill offers seamless boater access, making it a breeze to dock and join us for an unforgettable dining experience by the water. Don’t miss out on the opportunity to indulge in the perfect blend of scenic beauty, delectable flavors, and joyful moments at Riviera Bar and Grill in Punta Gorda. Join us for a culinary escapade that’ll leave you craving more. Book your table today and let the flavors of Riviera sweep you away on a journey of taste and delight. Coordinates: 26.888362, -82.053196 Seamless Boater Access Arriving by boat? No problem! Riviera Bar and Grill offers seamless boater access, making it a breeze to dock and join us for an unforgettable dining experience by the water. Don’t miss out on the opportunity to indulge in the perfect blend of scenic beauty, delectable flavors, and joyful moments at Riviera Bar and Grill in Punta Gorda. Join us for a culinary escapade that’ll leave you craving more. Book your table today and let the flavors of Riviera sweep you away on a journey of taste and delight. Coordinates: 26.888362, -82.053196 Punta Gorda Bar with Live Music Welcome to Riviera Bar and Grill, where you will find a celebration of great music, relaxed vibes, and unforgettable moments. Immerse yourself in the soothing melodies of live music that grace our stage Thursday through Sunday, creating the perfect backdrop for your dining experience. Set against the stunning backdrop of our outdoor waterfront dining area, you’ll savor delicious meals while enjoying the gentle breeze and breathtaking views. And for our fellow boating enthusiasts, we offer easy boat access, ensuring that your journey to flavor and fun is as smooth as can be. Join us at Riviera Bar and Grill for an experience that blends the best of music, ambiance, and waterfront charm – the ultimate recipe for an unforgettable time. Note we are closed on Mondays. Event Schedule Live Music Welcome to Riviera Bar and Grill, where you will find a celebration of great music, relaxed vibes, and unforgettable moments. Immerse yourself in the soothing melodies of live music that grace our stage Thursday through Sunday, creating the perfect backdrop for your dining experience. Set against the stunning backdrop of our outdoor waterfront dining area, you’ll savor delicious meals while enjoying the gentle breeze and breathtaking views. And for our fellow boating enthusiasts, we offer easy boat access, ensuring that your journey to flavor and fun is as smooth as can be. Join us at Riviera Bar and Grill for an experience that blends the best of music, ambiance, and waterfront charm – the ultimate recipe for an unforgettable time. Note we are closed on Mondays. Event Schedule Who’s Playing Today? No event found! Boater Welcome If you are wondering if we can accommodate your boat, the answer is yes! Coordinates: 26.888362, -82.053196 Opening Hours Monday Through Sunday Open 11am – 9pm Punta Gorda Contact Us (941) 639-2633 gm@rbgpg.com 5500 Deltona Dr Punta Gorda, FL 33950 Facebook Instagram Designed by ASEB Consulting | © Copyright Riviera Bar & Grilll 2025, All Rights Reserved"
    },
    {
      "url": "https://www.independent.com/2021/10/25/riviera-bar-goes-old-school-on-figueroa-street/",
      "text": "Riviera Bar Goes Old-School on Figueroa Street - The Santa Barbara Independent Wed Sep 10, 2025 Submit an Event Newsletters Login My Account Subscribe Got a Scoop? News Arts & Entertainment Living Food & Drink Opinion Events Sports Obituaries Real Estate Indy Parenting Extra! Classifieds Home News Got a Scoop? Arts & Entertainment Santa Barbara Live Music Venues Living Food & Drink Opinion Events Sports Obituaries Real Estate Indy Parenting Cover Stories Extra! Best of Santa Barbara® 2024 Wedding Santa Barbara Green Guide Classifieds Advertise About Us Contact Us Create Event Subscribe Food & Drink Food Riviera Bar Goes Old-School on Figueroa Street Paradise Café Veterans Take Over Historic Sportsman Lounge in Downtown Santa Barbara By George Yatchisin Mon Oct 25, 2021 | 9:56am Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print Add to Favorites Credit: Carl Perry That marvelous sailfish on the wall at the new Riviera Bar certainly looks familiar, but it’s not as familiar as you think. Sure, it came from the old Paradise Café, as is the case for many of the people behind this cozy establishment on West Figueroa that opened July 29. But it’s not the fish you stared at over your margarita above the bar — it’s one from an office. “Paradise was more a general attitude toward customers and building a community,” explains the new bar’s owner, Kevin Boss. “This is Riviera, a new thing.” Credit: Carl Perry While many involved with Riviera are Paradise veterans — along with Boss, there’s manager Oliver Davis, operating partner Jim Mishler, and even office manager Karen Collyer — the boss asserted, “Paradise was a child of the ’80s.” Riviera is after more of a midcentury feel; think Tadich Grill and the Buena Vista in San Francisco or Musso & Frank in Hollywood as comparisons. Said Boss, “We want that same old-school feel, but updated.” So, while they definitely serve food, note the name is direct and doesn’t add “café” or “tavern,” or anything after an “and” or ampersand, or god forbid, a +. “We definitely want to be perceived as a bar,” he said, “a place people hang out, talk to strangers, tell lies.” Of course, anyone who has done any carousing in Santa Barbara over the past forever knows there was a bar that used to occupy this space: the beloved-by-boozers Sportsman Lounge (now re-invented on State Street). Turns out that Boss and his group have owned this building for well over a decade, and when the Sportsman’s lease was up, he knew it was time for his project. “I had a really soft spot for the Sportsman,” he recalled. “Back when I used to work at Chuck’s in the 1970s, we used to come here after we closed down, and there’d be a country and western band playing and you could get a bologna sandwich and a can of beer.” Sign up for Indy Today to receive fresh news from Independent.com, in your inbox, every morning. The Sportsman, said Boss, enjoys a much longer history than most know: from the late 1930s to the 1960s, it served food, too, more akin to Joe’s or Harry’s of today. “Then in the 1960s, it changed into more of a day bar,” Boss said. “But the kitchen was always here.” Now thoroughly renovated — like the entire establishment — that kitchen provides a short but pleasing menu with vegetable-forward snacks (like tempura green beans and zucchini fritters) and a double cheeseburger Boss admits they nicked from Au Cheval in Chicago. “We’re not trying to be super-elevated with the food,” said Boss, “but we’re not just a burger-and-a-brew place, either.” Head bartender Chad Nielson, who previously worked at places such as Pearl Social and Somerset, helps to make that true, creating a tasty menu of classic and house cocktails that currently features an on-point Boulevardier and a Sicilian Spritz that gets its bubbles from a classy Sorelle Bronca Prosecco. “So many bars focus on house syrups and tinctures made with seasonal ingredients,” explained Nielson, “so we decided to really focus on the spirits.” Boss believes that some of the more creative cocktail joints in town can get “a little too self-reflexive, a little meta.” Credit: Carl Perry So far, Riviera seems the opposite of self-conscious, walking a charming line of being retro and not precious, dark but not dingy, old-school but not shabby, easygoing but not sloppy. You can find that vibe embodied in something like its subtle, sweetly tweaked classic Spanish Manhattan, which features Rittenhouse rye, Bordiga rosso vermouth, and amontillado. Think of it as a locals’ bar any tourist should be delighted to find. “We never wanted to be on State Street,” said Boss. “We always wanted to be a destination.” 20 W. Figueroa St.; (805) 679-5170; rivierabarsb.com Support the Santa Barbara Independent through a long-term or a single contribution. Wed Sep 10, 2025 | 21:05pm https://www.independent.com/2021/10/25/riviera-bar-goes-old-school-on-figueroa-street/ More Like This Baked with Love Harborside Dining Finds a State of Gracie No Ownership Change at Ellwood Restaurant Recent News Most Read Santa Barbara County Supervisors Observes Suicide Prevention Month Health By Nick Welsh | Wed Sep 10, 2025 | 10:01am City of Santa Barbara Clearing the Way for Adaptive Reuse Downtown Housing By Ryan P. Cruz | Wed Sep 10, 2025 | 9:44am Budget Carveout Appears to Stymie Apartment Construction in Powerful Democrat’s District Housing By Ben Christopher, CalMatters | Wed Sep 10, 2025 | 9:28am ‘Significant Change of Circumstances’: Defendants Re-Arraigned After Murder Charges Dropped in State Street Stabbing Courts & Crime By Callie Fausey | Tue Sep 09, 2025 | 6:14pm Central Coast Leaders Prepare for Surge in Federal Immigration Response Immigration By Ryan P. Cruz | Tue Sep 09, 2025 | 3:50pm Sutter Health Investigating ‘Disrespectful Social Media Post’ Following Blowback Health By Ryan P. Cruz | Tue Sep 02, 2025 | 1:04pm Sutter Health Employees Terminated for ‘Insensitive’ Social Media Post Health By Ryan P. Cruz | Wed Sep 03, 2025 | 9:20pm City of Santa Barbara to Debut ‘Pedlet’ Outdoor Dining Concept on State Street Infrastructure By Ryan P. Cruz | Fri Sep 05, 2025 | 4:03pm California Rhône Legends Converge for Historic Tasting Drink By Matt Kettmann | Fri Sep 05, 2025 | 5:22pm School Shrink? Santa Barbara’s Enrollment Crisis Has a Complicated Middle Education By Ella Heydenfeldt | Sat Sep 06, 2025 | 5:00pm Premiere Events Santa Barbara Sea Glass and Ocean Arts Festival Sat, Sep 13 10:00 AM Goleta Little Shop of Hoarders- Art Show and More! Fri, Sep 12 5:00 PM Santa Barbara Learn to Play Bridge Sat, Sep 13 9:30 AM Santa Barbara “The Cost of Silence” Film Screening and Forum: Santa Barbara’s Hidden Offshore Oil Health Threat Sun, Sep 14 4:00 PM Santa Barbara Blind Fitness Presents “Spectrum of Sound” Benefit Concert Sat, Sep 20 2:00 PM Santa Barbara The Barn Dance at Sedgwick Ranch Reserve Sat, Sep 27 4:00 PM Santa Ynez The Muralist at Sullivan Goss Tue, Oct 07 10:00 AM Santa Barbara Symposium and Exhibition: “Brave New Work: AI and Tech in the Hands of Artists” Tue, Oct 07 3:15 PM Santa Barbara The Muralist at Sullivan Goss Tue, Oct 14 10:00 AM Santa Barbara Santa Barbara Independent presents Best Fest: A Celebration of the 2025 Best Of Santa Barbara® Thu, Oct 16 5:30 PM Santa Barbara The Muralist at Sullivan Goss Fri, Oct 17 10:00 AM Santa Barbara Get News in Your Inbox × Login Please note this login is to submit events or press releases. Use this page here to login for your Independent subscription Username or Email Address Password Remember Me Not a member? Sign up here. News Arts & Entertainment Living Food & Drink Opinion Promote Event Sports Events Real Estate Indy Parenting Cover Story Extra! About Us Contact Us Submit Press Release Obituaries Classifieds Advertise Promote Events Create Event Create Obituary Submit Letter Admin Login FOLLOW US ON NEWSLETTER SIGN UP Get the Independent in your inbox. Privacy Policy Copyright ©2025 Santa Barbara Independent, Inc. Reproduction of material from any Independent.com pages without written permission is strictly prohibited. If you believe an Independent.com user or any material appearing on Independent.com is copyrighted material used without proper permission, please click here . Site by Trew Knowledge. Powered by WordPress VIP . Sign in Loading Comments... You must be logged in to post a comment."
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Support our Fall Fundraiser! Click here for details. Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    },
    {
      "url": "https://riviera-rl.com/who-we-are/",
      "text": "Who We Are | Riviera Restaurants & Luxury This site uses cookies as explained in our Privacy Policy . If you agree to our use of cookies, please accept, alternatively, you can change your settings and decline. Decline Accept Home Who We Are Press in 2025 Careers with Riviera Contact Who We Are Riviera Restaurants and Luxury Ltd Riviera is a London-based hospitality group which owns the 28°-50° wine-led restaurants in London, and manages high-end ski chalets and villas in France and Spain. It is a subsidiary of Eurogroup, a family owned hospitality company based in the French Alps. At 28 years old, the London arm of Riviera plans to continue to expand, and in the next five years will see a steady increase of ambitious development. It will grow to manage 100 of the finest villas and chalets in the top resorts of the French Alps and the Mediterranean. In the UK it aims to become the reference for high-level wine-led casual dining in Central London. Award-winning luxury We are the proud operators of ‘France’s Best Ski Chalet’ for 2 years running. Our magnificent Chalet Machapuchare was awarded this prestigious title at the 2024 and 2023 World Ski Awards, recognising it not only as one of the most luxurious chalets available to rent in the Alps and beyond, but also as one of the Top 3 Chalets in the World. Chalet Harmony was new to Méribel in 2023, and it’s already an award winner! It has been crowned the World’s Best New Ski Chalet at the 2024 World Ski Awards, recognising its state-of-the-art facilities and world-class design. Riviera In The Press Senior Team Richard Green, President Richard has owned and managed restaurants, clubs and hotels for over 30 years. He owned the highest pub in Europe, opened the first Mexican and Indian restaurants in the Alps, introduced day and night clubbing in Courchevel, ran 600-room hotels in the Balearics and the Canaries and has been operating boutique hotels, high-end dining and live music venues since 1989. Joanna Laforge, Group Commercial Director Joanna joined the group in 1994 and has spent her entire career in hospitality, leisure and tourism. Debuting as a management trainee, she became Commercial Director within three years and bought into the company in 2010. Emiliano Isufi, Managing Director, London Restaurants Part-owner of the 28°-50° restaurants in London, Emiliano is a veteran of the London restaurant and club scene. His career began working in Sir Terrance Conrans Butlers Wharf Chop House, he then moved to work for Gordon Ramsey’s Michelin star restaurant at the Connaught hotel, Mayfair. In early 2007 he became the manager at Greig’s Steakhouse in Berkeley Square, Mayfair and then became the General Manager at the Zebrano Group, Carnarby Street before linking up with Richard to set up the 28°-50° restaurants. Julien Baris, Group Head Chef, London Restaurants Julien is the archetypal French cooking talent. Raised in the gastronomic heart of South West France, he has worked with some of the great Michelin chefs and has been in London since 2004. After helping to scale up the Aubaine Group, he joined 28°-50° where he is currently the Group Head Chef. Beck McInnes, Group Careers Director Hailing from NSW, Australia, Beck has a wealth of diverse experience. She holds a teaching degree, has taught cookery at the Orchards Cookery School and as worked as the chef on a Mediterranean based super yacht. Beck has been an integral member of the group for many years now – previously as Staff Manager – before joining in the permanent role of Group Human Resources Manager. Key Contacts Louisa Van Vloten, Purple Ski Managing Director: louisa@riviera-rl.com Zac Brown, Head of Sales for Travel: zac@purpleski.com Beth Thomas, Facilities Manager, London: beth@riviera-rl.com Alice Ortner, Overseas Property Manager: aortner@eurogroup-vacances.com Group Structure View Privacy Policy Cookie Policy © Riviera | 2025 Created at The Hideout"
    },
    {
      "url": "https://rivierabarandgrillpuntagorda.com/riviera-bar-and-grill-menu/",
      "text": "Riviera Bar and Grill Menu | Waterfront Dining Punta Gorda Menu Events Contact Select Page Riviera Bar and Grill Menu Discover the ultimate waterfront dining hotspot in Punta Gorda – Riviera Bar and Grill. Set against the sparkling waters, our spot isn’t just about food – it’s about good vibes, sweet sounds , and great flavors that’ll keep you coming back for more. Let the waves and live music set the scene for an awesome dining experience you’ll want to repeat. Boater Welcome If you are wondering if we can accommodate your boat, the answer is yes! Coordinates: 26.888362, -82.053196 Opening Hours Monday Through Sunday Open 11am – 9pm Punta Gorda Contact Us (941) 639-2633 gm@rbgpg.com 5500 Deltona Dr Punta Gorda, FL 33950 Facebook Instagram Designed by ASEB Consulting | © Copyright Riviera Bar & Grilll 2025, All Rights Reserved"
    },
    {
      "url": "https://puntagordachamber.com/",
      "text": "Punta Gorda Chamber of Commerce – Welcome to Punta Gorda, FL Skip to content (941) 639-3720 Search Search Search Home Member Directory About Contact Submit Feedback About The Chamber Leadership Member Testimonials Business of the Year Awards Doing Business Move Your Business to Punta Gorda Hot Deals! Job Listings Events Chamber Events Chamber Member & Community Events Halloween Wicked Window Contest Member Benefits 2026 Visitors Guide Ads Renew Membership Join The Chamber Member Benefits Submit Friday Facts Master Class Email Blast Radio Show – Platinum Members Radio Show – Gold Members Radio Show – Members ChamberMaster Login News Hurricane Resources Friday Facts Vacation Here Visitors Guide About Punta Gorda About Charlotte County Punta Gorda Farmer’s Market Things To Do Punta Gorda Airport Community Events Home Member Directory About Contact Submit Feedback About The Chamber Leadership Member Testimonials Business of the Year Awards Doing Business Move Your Business to Punta Gorda Hot Deals! Job Listings Events Chamber Events Chamber Member & Community Events Halloween Wicked Window Contest Member Benefits 2026 Visitors Guide Ads Renew Membership Join The Chamber Member Benefits Submit Friday Facts Master Class Email Blast Radio Show – Platinum Members Radio Show – Gold Members Radio Show – Members ChamberMaster Login News Hurricane Resources Friday Facts Vacation Here Visitors Guide About Punta Gorda About Charlotte County Punta Gorda Farmer’s Market Things To Do Punta Gorda Airport Community Events Welcome To The Punta Gorda Chamber of Commerce “A friendly community with a remarkable past and an exciting future.” MEMBER DIRECTORY JOIN THE CHAMBER VACATION HERE VISITORS GUIDE Our Vision The vision of the Punta Gorda Chamber of Commerce is to be the leading catalyst for a prosperous business environment that seamlessly blends economic growth with our vibrant waterfront lifestyle. By empowering businesses through advocacy, networking, and education, we foster innovation, strong partnerships, and an exceptional quality of life. Together, we are committed to building a better tomorrow for our community, ensuring Punta Gorda and its surrounding areas thrive as a unified, forward-thinking community. Our Mission The mission of the Punta Gorda Chamber of Commerce is to lead the business community through advocacy, innovation and education creating a strong and vibrant business center for Punta Gorda. Upcoming Chamber Events 3 events found. Today Now Now - 9/26/2025 September 26 Select date. Business After Hours- Punta Gorda Chamber of Commerce Sep 16 5:30 pm - 7:30 pm Business After Hours- Punta Gorda Chamber of Commerce RSVP Now Free Networking Luncheon – Laishley Crabhouse Sep 24 12:00 pm - 2:00 pm Networking Luncheon – Laishley Crabhouse Get Tickets $25.00 Annual Banquet – Anchored in Excellence: Navigating the Future Together Sep 26 6:00 pm - 10:00 pm Annual Banquet – Anchored in Excellence: Navigating the Future Together Get Tickets $125.00 – $900.00 Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file 3 events found. Today Now Now - 9/26/2025 September 26 Select date. Business After Hours- Punta Gorda Chamber of Commerce Sep 16 5:30 pm - 7:30 pm Business After Hours- Punta Gorda Chamber of Commerce RSVP Now Free Networking Luncheon – Laishley Crabhouse Sep 24 12:00 pm - 2:00 pm Networking Luncheon – Laishley Crabhouse Get Tickets $25.00 Annual Banquet – Anchored in Excellence: Navigating the Future Together Sep 26 6:00 pm - 10:00 pm Annual Banquet – Anchored in Excellence: Navigating the Future Together Get Tickets $125.00 – $900.00 Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Hurricane Resources Our community is working together to bring in the resources that you need. There are many resources that are available to our businesses. Florida Commerce Emergency bridge loans are available providing short term zero interest loans to help bridge the gap between the time a disaster impacts a business and when the business has secured longer term recovery funding. Florida Small Business Development Corporation (SBDC) has an important assessment for businesses to fill out to determine the needs in the area. Learn More Join The Chamber Join The Chamber Looking to expand your business in the Punta Gorda area? We have built a strong community of businesses that can help you achieve your goals. Whether your business is new to the area, or has been around for years, the Punta Gorda Chamber is a great way to help you reach your business goals. REASONS TO JOIN Join The Chamber Join The Chamber Looking to expand your business in the Punta Gorda area? We have built a strong community of businesses that can help you achieve your goals. Whether your business is new to the area, or has been around for years, the Punta Gorda Chamber is a great way to help you reach your business goals. REASONS TO JOIN Excellent Punta Gorda Chamber of Commerce Based on 56 reviews See all reviews Mary Bayes Joining the Chamber was a great choice for our business. We appreciate all the information we have received. The team at the Chamber is inviting, informative, and very positive in what they do. We look forward to attending many more events and meeting more great people. Thank you Lara Wileman I don't just LOVE the Chamber, I am IN AWE...! I feel empowered, supported, inspired, protected, taken care of...it simply just could not get any better. Period. If you are nearby, a business owner and NOT a MEMBER yet, you are MISSING OUT big time! Come and join the Chamber today. Jordany Cormier This is my first time being a member of a Chamber of Chamber, and I have to say that I am glad I made the decision to do so. From the time that I set foot inside the office of Punta Gorda Chamber of Commerce, I was greeted with such enthusiasm that made me feel like I was welcome there and that they were excited to have me stop by to learn more about how they can help spread the word about my community. Looking forward all the great things this relationship has in store for me and my business. Scott Jackson As a new member, I am very pleased with the information I receive from all to help our business thrive in the Punta Gorda area. I look forward to many more years being involved in the community. Response from the owner: Scott. Thank you for your kind words. We appreciate you as a new member and hope you'll see the benefits of membership in the coming weeks. Cathy Holman Have been many times over the years. They are an invaluable resource that is so often overlooked. We were able to get information on upcoming events, local banks, new businesses - all in one stop. No need to fight the computer. Staff is friendly and helpful. #puntagorda #business #information Paul Tully Very hard working people Frances Bell Florida Broker Associate KW Always such a wealth of information. The staff is A+. Mike Martin Marie Kinard Everyone at the Punta Gorda Chamber of Commerce has always been very helpful and informative. They are in a great location for folks to stop by ! They offer great advice and interesting local brochures and local event info. Lori Walters Friendly group of people, I had a slight problem with email but Tara fix it as soon as I brought it to her attention. ryan schipkowski All of the Chamber staff and members have been so welcoming! A Chamber like no other! John and his team are truly engaged with the community and here to serve every single member no matter the size of their business. Thank you for all that you do for us members and our community! Karen Norberg The Chamber offers so many ways to get your business up on top! Thanks Chamber! Beverly Lowrey Extremely focused and very helpful to ensure success. P Presseller The best Chamber ever! Response from the owner: Patty, we love you! Don Tottingham I am a brand new member to the Punta Gorda Chamber. The group is extremely welcoming and very helpful. After joining. I found that there is many different businesses within the chamber that I didnt even knew existed until I joined. As a realtor we have requests from people all over the country looking to move to the area, andmy experience with the chamber has given me a leg up on those whom have not joined. The staff is some of the best people in town....knowledgeable, and most importantly... friendly. Great experience thus far. Response from the owner: Thank you Don Rich Lancette Being a part of the Chamber has been a huge part of our success as a business. The Chamber president and staff are always eager to provide assistance and support. The Chamber members are truly a great group and very supportive of fellow business and many, many non profit organizations. The many venues and events organized by the Chamber provide great entertainment for both locals and visitors year round. I recommend visiting the website often for both businesses and residents/visitors - full of great information. Response from the owner: Thank you Rich Paul Reeves Lauri OWS Being a Chamber member, we know that our sanctuary will be promoted by the Chamber, the networking and informational lunches we participate in is always helpful to stay out there in front of our community. The Punta Gorda Chamber (and its members) is like an extended family that supports one another because of how the Chamber staff always has our back! We appreciate being included in The Wine and Jazz festival every year, and any other events that will also keep in front of the community and visitors to Punta Gorda, which is imperative for our survival. We are blessed to have such a well run Chamber! So, thank you for all you do for your members! Pam Monnier As a small business owner, I couldn’t ask for a better team on my side. This was my fourth year in business and the staff at the Charlotte County Chamber has always been there to help me grow my business. They always keep the community up to date on what’s going on and always supportive. They are a big part of the GrandCare Plus team, thank you for your support. Response from the owner: We love our members Melissa Bergey Since day one of meeting everyone at the Punta Gorda Chamber, they have welcomed me with open arms and taken me in like I am a part of their family. John especially has done so much for me personally as well as the non profit I work for. I cannot thank them enough. You guys ROCK!!!! Response from the owner: We love our members William Mulrine What a wonderful group to be associated with. The networking possibilities are endless and have provided opportunities with some great, great people. Did I say GREAT, I meant stupendous, caring, business minded, super people. I look forward to working with the Chamber and all its members. Have a wonderful year! Thank you Della Booth for the introductions... Catherine Perry The Punta Gorda Chamber is extremely involved in our community and the support of business. The value of our membership is immeasurable. The Chamber and all of it's members are like having an extended family. John and the staff extend A+ service everyday. Excellent opportunity for businesses to network and enjoy community special event. Karen McElhaney A big thank you to Punta Gorda Chamber of Commerce- We are so appreciative of your support of nonprofits in Charlotte County! While the various forms of networking opportunities are helpful in getting to know our community businesses and agencies, more importantly, your events allows us to share our mission with so many!!! MaryAnne Simone I am a member of many different groups and chambers and by far Punta Gorda Chamber is an incredible way to get your business noticed. The support from members is encouraging and most of all caring. They go out of their way to help your business be successful. Danny Nix The Punta Gorda Chamber provides a great outlet to large and small organizations for networking and community service opportunities. The staff are extremely helpful and are the perfect first impression for visitors who are enjoying our community. I find a lot of value in our membership!!! Jennifer French The Punta Gorda Chamber is fantastic! They are incredibly helpful and supportive of their members, and are always searching for new and effective ways to expand that support. Jeff Frankhouser The Punta Gorda Chamber, and in particular John Wright, is very pro business and offers numerous productive opportunities to network and meet new contact on a favorable basis. I would highly recommend new and mature businesses to consider membership as a interval part of a marketing plan. Kerstin Fox It is a great benefit for a small business to be a member of the Punta Gorda Chamber of Commerce! The staff is always courteous and helpful, and John Wright is a terrific leader of the chamber. Thank you for all that you do for Punta Gorda! Response from the owner: Thank you Genevieve Ramachandran Our Punta Gorda Chamber does a great job to keep us connected. It is a great way to network with other business owners and keep up to date with the activities in the city. John Wright and his merry band are wonderful! Michele Goldman The Punta Gorda Chamber is a great resource for networking with other small business owners and for advertising your business. Consider joining today, if you are looking for ways to meet others. Amanda White I think this is a great group who wants to see Punta Gorda thrive. I trust that post COVID-19, the Chamber will continue to be the Anchor that businesses need. Laurie Goodwyne The Punta Gorda Chamber is a wonderful resource for its members as well as our residents and visitors. They are always providing fabulous networking opportunities! Beverly Heiberger Royce Dockrill John and his team are great !!! They are always ready to help, reach the community of Punta Gorda. Dave Kelly Bob Miller Got to love the small town feel ,with a Chamber that has its hands in everything that makes an community go for good the Great !!! Response from the owner: Thank you Melissa Reichert The Punta Gorda Chamber provides fabulous networking experiences and quality events for residents, visitors and business owners in our community! Cindy Grigiski We opened a new business in downtown Punta Gorda 2 years ago. We joined the chamber immediately and it has been a good experience for us. The staff at the chamber office are helpful and the networking events have enabled us to find new clients and make new friends. Response from the owner: Cindy and Stan - you are a delight Sue Reeves This chamber is very innovative and always supportive to it's members initiatives. The support staff is outstanding! Response from the owner: Thank you Sue Maggie Matika Richard Dressel JAMES Harrington Mike Ruiz Highly engaged and fun Chamber of Commerce! The staff at The Punta Gorda Chamber is very professional, helpful and care to help our visitors, residents and their members! Keep up the good work! Lisa Riccio The Chamber is an invaluable resource for both me and my clients. As a small business owner the networking opportunities are plentiful. But I also find the staff are always willing to assist in any way. I am very comfortable sending clients and visitors to the Chamber as I know they will be well taken care of. Kathy Kresge The Punta Gorda Chamber is the best way for businesses and individuals to get involved with the community. The Chamber keeps the community vibrant, diverse and most of all fun. Conserva Irrigation of SW Florida Always helpful, awesome group of people. Awesome community group, we will stay within our Punta Gorda Chamber because they make you feel welcome. Barbara Dolleschal It was on my to-do list to become a member of this organization for a long time. Finally, this summer I joined. I knew - joining a networking organization also means time commitment (because it's just like a gym, if you don't use your membership, it doesn't work). So, this summer it was about time to do it. The experience was just WOW! I mean, it's not my first chamber membership, I've been in 3 others (still kept membership for one of them) but yes - wow - this is a very new experience. I thought Punta Gorda is a tiny town, very calm etc... but I was so wrong. The activities are great, so many events and opportunities to connect with other people and so many opportunities to market our business. And the president is the most active I've ever seen and really caring. He is not just doing his job, I believe there is true passion behind this and this helps a lot to put this organization into this what it is right now. A buzzing swarm of great people, open to connect, talk, network. It's a really great experience and I just recently said to another new member, I should have joined much earlier. Elaine Martin The Punta Gorda Chamber is a must have asset for the business community. It is an epicenter for business information with endless networking opportunities to promote your business throughout the community. The friendships are endless and the community pride enormous. Response from the owner: Truly appreciate your kind words 2025 Member & Visitor Guide Each year, this Member & Visitor Guide for Punta Gorda highlights some of the best businesses, activities, and non-profits in the area, and gives  the opportunity to celebrate our vibrant community. READ NOW MEMBER TESTIMONIALS \"Gettel Automotive of Charlotte County has been a proud Platinum Partner in Action of the Punta Gorda Chamber since 2017.   Our membership provides tremendous awareness of our business, community trust, and confidence. The value of our partnership with the Punta Gorda Chamber can't be quantified. With our membership, we are part of a strong group of business professionals that support and lift each other up to be successful. If you are looking for a way to grow your business there is nothing better than the Punta Gorda Chamber membership to make it happen!\" - Chery George Gettel Automotive “More exposure means more business and I’m glad to be a member of the Punta Gorda Chamber. From the very beginning, the Chamber Staff has been extremely helpful and thorough with getting me acquainted and answering my questions. The chamber has several ways to market member businesses through print marketing, business partnership program, and networking opportunities. They have helped me to create solid and trusted relationships in the community and I have enjoyed being a part of such a great organization and look forward to many more years!” - Alexia Martin Comber WhitCo Insurance \"There are many reasons that I am passionate about Punta Gorda Chamber of Commerce but if I had to nail it down I would say that they bring fun to the seriousness of business. We do all the networking in such a friendly way that all the events feel like a time when we meet friends and socialize as opposed to a formal business meeting. We make lifelong friends at the Punta Gorda Chamber not just business acquaintances. \nAnd the events are legendary!\" - Sue Randal Tamiami Tavern \"Being a member of the Punta Gorda Chamber has been great. It is a true experience every time we all get together and I enjoy networking with a lot of local businesses. I would recommend anyone who is trying to expand their business big or small, to become a member.\" - Mark Dumser MD Pressure Cleaning Platinum Sponsors PARTNERS IN ACTION are businesses dedicated to strengthening their Chamber and business in Punta Gorda. Click the sponsor logo/name to visit their website. Become A Sponsor Platinum Media Sponsors Platinum In Kind Platinum Sponsors PARTNERS IN ACTION are businesses dedicated to strengthening their Chamber and business in Punta Gorda. Click the sponsor logo/name to visit their website. Become A Sponsor Gold Sponsors Gold In Kind Silver Sponsors Silver Sponsors In Kind Bronze Sponsors Animal Welfare  League Calenda Real Estate Group Centennial Bank Crystal Coovert – Walker Realty Group Desoto Auto Mall Della Booth, TIME Realty Services, Inc. Drug Free Punta Gorda Elite Inspections & Pest Solutions Florida Premiere Contractors Granny Nannies Home Care Grooving Through Gorda Hoff’s Air Authority J. Meraki Beauty Emporium Marina Park Realty, LLC Peke Safety Pickleplex of Punta Gorda Pool Boy State Farm Agency -Mike Martin Superior Carpet & Upholstery Cleaning Wotitzky, Wotitzky, Ross, & Young, PA Port Charlotte Florist (In Kind) Supporting Members Archway Institute Atlanta Braves Bristol Private Wealth Management of Raymond James C.A.R.E of Charlotte County Dream Salon and Spa Edward Jones – Jim Sproul Fabulous Finds Frank Desguin Family Gator Wilderness Camp School Illusions Salon & Spa Octagon Wildlife Sancturary Spa Valerie’s House Virginia B. Andes Volunteer Community Clinic Visual Arts Center Punta Gorda Chamber of Commerce 252 W Marion Ave, Punta Gorda, FL 33950 (941) 639-3720 Hours of Operation: Monday-Friday: 9am to 4pm Saturday & Sunday: Closed CHAMBER LINKS Join The Chamber Chamber Events Member Directory ChamberMaster Login Chamber Store Account Login Friday Fact s QUICK LINKS Military Heritage Museum Peace River Botanical & Sculpture Gardens Vietnam Wall VISIT PUNTA GORDA Things To Do Community Events Farmer’s Market Punta Gorda Airport Maps Of The City © 2025, Punta Gorda Chamber of Commerce. All Rights Reserved. Name: Type: View Crop Image Crop Continue Without Cropping Reserve Your Seat Today"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://riverviewgrillandbar.com/about-us",
      "text": "About Us | River View Grill and Bar Show your Military Card for 10% off your meal! Home Photo Gallery MENUS About Us PRIVATE PARTIES & EVENTS Dogs of River View More Home Photo Gallery MENUS About Us PRIVATE PARTIES & EVENTS Dogs of River View Home Photo Gallery MENUS About Us PRIVATE PARTIES & EVENTS Dogs of River View Welcome to The River View Grill and Bar Escape to River View Grill & Bar, a beloved Three Rivers institution for over 25 years! More than just a bar, we're a family-focused grill serving up classic American fare with a warm, inviting atmosphere. Nestled at 42323 Sierra Drive, with stunning views of The Kaweah River we're the perfect spot to gather with loved ones and create lasting memories. And yes, your furry friends are welcome to join the fun! Come experience the charm and community spirit that makes \"The View\" a true local treasure. Hours Of Operation Kitchen Sunday 11 am to 8 pm Monday 11 am to 8 pm Tuesday 11 am to 8 pm Wednesday 11 am to 8 pm Thursday Closed Friday 11 am to 9 pm Saturday 11 am to 9 pm Bar Sunday 11 am to 10 pm Monday 11 am to 10 pm Tuesday 11 am to 10 pm Wednesday 11 am to 10 pm THURSDAY CLOSED Friday 11 am to 12 am Saturday 11 am to 12 am More About Us Can you handle this? The famous 3R Burger! Can you handle this? The famous 3R Burger! Can you handle this? The famous 3R Burger! Great food served by great staff. Our River Selfie Spot! Can you handle this? The famous 3R Burger! Can you handle this? The famous 3R Burger! Say Cheese! Photo Gallery GUESS WHO? Copyright © 2025 River View Grill and Bar - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept LIve Music We are excited to announce that our live bands will be starting a bit earlier this year.  Starting March 1st, we will have our Saturday & Sunday bands in the beer garden from 4 pm to 8 pm.  Be sure to follow us on FB and Instagram to get updates on band dates and times."
    },
    {
      "url": "https://rivierabarandgrillpuntagorda.com/contact/",
      "text": "Contact Riviera Bar & Grill Punta Gorda - Riviera Bar and Grill Menu Events Contact Select Page Boater Welcome If you are wondering if we can accommodate your boat, the answer is yes! Coordinates: 26.888362, -82.053196 Opening Hours Monday Through Sunday Open 11am – 9pm Punta Gorda Contact Us (941) 639-2633 gm@rbgpg.com 5500 Deltona Dr Punta Gorda, FL 33950 Facebook Instagram Designed by ASEB Consulting | © Copyright Riviera Bar & Grilll 2025, All Rights Reserved"
    }
  ]
}