{
  "fuentes": [
    {
      "url": "https://lmgfl.com/founder-of-roccos-tacos-tequila-bar-to-raise-funds-for-national-multiple-sclerosis-society/",
      "email": "sfbw-logo-2023-100x50-v6-@2x.png"
    },
    {
      "url": "https://lmgfl.com/founder-of-roccos-tacos-tequila-bar-to-raise-funds-for-national-multiple-sclerosis-society/",
      "email": "info@lmgfl.com"
    },
    {
      "url": "https://fesmag.com/topics/perspectives/point-of-view/14777-rocco-mangel-rocks-it-with-tacos-and-tequila",
      "email": "facebook-white@2x.png"
    },
    {
      "url": "https://fesmag.com/topics/perspectives/point-of-view/14777-rocco-mangel-rocks-it-with-tacos-and-tequila",
      "email": "linkedin-white@2x.png"
    }
  ],
  "mails": [
    "facebook-white@2x.png",
    "info@lmgfl.com",
    "linkedin-white@2x.png",
    "sfbw-logo-2023-100x50-v6-@2x.png"
  ],
  "nombre_sitio": "roccostacos.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://lmgfl.com/founder-of-roccos-tacos-tequila-bar-to-raise-funds-for-national-multiple-sclerosis-society/",
      "text": "Founder of Rocco's Tacos & Tequila Bar to Raise Funds for National Multiple Sclerosis Society | Lifestyle Media Group SOUTH FLORIDA BUSINESS & WEALTH MAGAZINE Digital Magazine Skip to content Main Navigation Lifestyle Media Group Search for: Sections Arts & Culture Ask the Experts Community and Philanthropy Editor’s Choice Cover Stories Editor’s Choice Local Business Good Press Industries Industries Community & Philanthropy Fashion and Retail Fashion and Retail Health Care & Wellness Hospitality Real Estate Retail Travel & Recreation Food & Drink Featured Restaurants Food & Drink Nightlife People Profiles A&E Spotlight People Profiles Local Buzz Around Town Local Buzz Things To Do Web Extras About Lifestyle Media Advertise With Us Contact Us Digital Publications Meet The Team Subscribe Social Media Connect Our Other Brands South Florida's largest single-title brand Subscribe Header Navigation Editor’s Choice Cover Stories Industries Travel & Recreation Real Estate Community and Philanthropy Arts & Culture Fashion and Retail Health Care & Wellness Good Press Food & Drink Featured Restaurants People Profiles A&E Spotlight Events Local Buzz Things To Do Ask the Experts About Us Contact Us Meet The Team Advertise With Us Web Extras Founder of Rocco’s Tacos & Tequila Bar to Raise Funds for National Multiple Sclerosis Society February 24, 2022 | Lifestyle Staff Rocco Mangel, the founder of Rocco’s Tacos & Tequila Bar , is joining forces with Walk MS to raise funds for the National Multiple Sclerosis Society this month. Mangel created ‘Team Rocco’ intending to raise $50,000 for the National Multiple Sclerosis Society as part of the philanthropic effort. On Sunday, Mangel will walk alongside his family, friends and those who support ‘Team Rocco’ to help rid the world of this disease. To help support the philanthropic effort during Multiple Sclerosis Month, participants can register to join Team Rocco can sign up here . Donations can be made online by visiting here . Multiple sclerosis is an unpredictable, often disabling disease of the central nervous system . Symptoms range from numbness and tingling to blindness and paralysis, and there is currently no cure for MS. The progress, severity and specific symptoms of MS in any one person cannot yet be predicted. Still, advances in research and treatment are leading to a better understanding of the disease while finding a cure. An estimated 1 million people live with MS in the United States. Most people with MS are diagnosed between the ages of 20 and 50, and it affects women three times more than men. For more information, please visit www.jointeamrocco.com/ . Print Share Share on Facebook Share on Twitter Share on LinkedIn Share on Pinterest You May Also Like Guy Harvey Foundation August 27, 2025 From Bustles to Bikinis: The Great Beachwear Strip-Down July 16, 2025 The Real: Harbor Beach July 2, 2025 PAMM Hosts “One Year Out” Celebration for FIFA World Cup 2026 June 7, 2025 featured Sixteen Years of Style, Strength & Support Sep 9, 2025 Next Stop, Flavor town Sep 4, 2025 The Rise of the Cool-cation Sep 4, 2025 Keep up with Lifestyle's top headlines Subscribe to our free eNewsletter Email Address (Required) Comments This field is for validation purposes and should be left unchanged. Latest Issue READ LATEST ISSUE MAGAZINE ARCHIVE More Web Extras Posts Chefs Face Off at Boca Raton’s Inaugural Seafood Festival March 18, 2025 | Lifestyle Staff The sea-sational event takes place at Mizner Park on Saturday, March 22 and includes live music, fun activities and plenty of delicious seafood. Read More City of Boca Raton Names Tiffany Beasi Winner of Inaugural Seafood Festival Art Contest March 16, 2025 | Lifestyle Staff Beasi’s design stood out for its creative interpretation of the festival’s theme and tribute to the city’s Mizner architecture Read More Jack Alexander’s Magician Exposed Residency Premieres in South Florida March 16, 2025 | Lifestyle Staff Seen on TMZ and celebrated worldwide, Jack invites audiences to step into his world of magic, where the impossible becomes an intimate, exhilarating experience. Read More Create AI Content that Sounds Like You March 13, 2025 | Lifestyle Staff Social selling expert Dean Seddon will lead a live masterclass in Miami on April 24 Read More Other Posts Oscar Piastri Wins the Formula 1 Trophy, Presented in Louis Vuitton Custom Trunk May 6, 2025 | Lifestyle Staff The special trunk was designed as part of the official partnership between LV and Formula 1. Read More Women-Led Driven Artists Racing Team (DART Car) Hits Miami with Car and Gear Designed by Artist Mickalene Thomas April 28, 2025 | Lifestyle Staff These collaborations anchor DART Car’s advocacy program, which strives to elevate women’s accomplishments in motorsports. Read More LiS: Latinos in Sports Returns to Miami for F1 Weekend on May 2 April 24, 2025 | Lifestyle Staff This year’s program will recognize Emilio Estefan with the Latinos in Sports Pionero Award. Read More Join the Hot Moms, Cool Moms Mother’s Day Celebration at CURIO at Faena Bazaar April 22, 2025 | Lifestyle Staff Shop your heart out for a good cause at CURIO at Faena Bazaar. Read More Editor’s Choice Ask the Experts Industries Food & Drink People Profiles Local Buzz ABOUT US Lifestyle remains the largest single-title brand—with the broadest geographical reach—in South Florida, encompassing seven different readership markets from Miami to Fort Lauderdale to Boca Raton. This powerful suburban network strategy—one that includes dynamic multimedia and event offerings— positions Lifestyle as a difference-maker for its advertising and community partners. Our affluent readership includes business executives, community leaders, entrepreneurs, influencers, household decision-makers and young professionals. Read More... 3200 N. Federal Highway Suite 228, Boca Raton, FL 33431 954-601-3979 info@lmgfl.com About LMG Contact LMG Advertise with LMG Latest Digital Edition View All Editions Email Address Email This field is for validation purposes and should be left unchanged. Social Connect"
    },
    {
      "url": "https://fesmag.com/topics/perspectives/point-of-view/14777-rocco-mangel-rocks-it-with-tacos-and-tequila",
      "text": "Rocco Mangel Rocks it With Tacos and Tequila - Foodservice Equipment & Supplies Subscribe to Magazine Menu Topics The Latest News Trends Perspectives DSR of the Month Foodservice by Design This Week In Foodservice E&S Extra Project Profiles Chain Profile Facility Design Project of the Month On-Site Projects Products Guide to… Beverage Equipment Carbonated Beverage Dispensers Coffee Brewers Draft Beer Systems Slushies and Smoothies Cooking Equipment Fryers Griddles Ovens Panini Presses Ranges Rotisseries Steamers Steam-Jacketed Kettles Toasters Tilting Skillets Prep Equipment Blenders Breaders Choppers Juicers Mixers Portion Scales Proofing Cabinets Slicers Refrigeration, Storage & Handling Blast Chillers Food Wells Ice Cream, Gelato and Soft-Serve Makers and Freezers Ice Machines Heated Display Merchandisers Refrigeration Shelving Sanitation and Safety Dishwashers and Warewashers Disposers Oil Filtration Ventilation Water Filtration Serving Equipment Buffetware Countertop Condiment Dispensers Tabletop and Smallwares Cookware Cutlery Dinnerware Glassware Browse Products Beverage Equipment Beverage Dispensers Coffee Brewers Draft Beer Systems Slushies and Smoothies Cooking Equipment Fryers Griddles Ovens Panini Presses Ranges Rotisseries Steamers Steam-Jacketed Kettles Toasters Tilting Skillets Prep Equipment Blenders Breaders Choppers Juicers Mixers Portion Scales Proofing Cabinets Slicers Refrigeration, Storage & Handling Blast Chillers Food Wells Ice Cream, Gelato and Soft-Serve Makers and Freezers Ice Machines Heated Display Merchandisers Refrigeration Shelving Sanitation and Safety Equipment Dishwashers and Warewashers Disposers Oil Filtration Ventilation Water Filtration Serving Equipment Buffetware Countertop Dispensers and Organizers Tabletop and Smallwares Cookware Cutlery Dinnerware Glassware Submit a Product Submit your products to be considered for inclusion for FREE in an upcoming issue of FE&S magazine. Research Distribution Giants FE&S’s annual list of the top 100 foodservice equipment and supplies dealers by sales volume. Industry Forecast FE&S’ annual forecast provides valuable insights alongside proprietary research. Archived Research Best in Class Reports Operator Purchasing Study Awards Dealer of the Year Recognizing the foodservice community’s best companies Hall of Fame Awarded to individuals who have contributed to the industry throughout their career DSR of the Year Recognizing the best in customer service and sales Tabletop Awards Recognizing excellence in the strategic and functional application of tabletop design. Facility Design Project of the Year Selected from the Facility Design Project of the Month; awarded to the highest quality design and execution Top Achievers Award-worthy personalities share a common trait: an unflinching ability to provide value on the customer’s terms. Events Industry Calendar A continuously updated list of events relevant to the entire foodservice equipment and supplies marketplace. See upcoming events Videos Point of View Content with a point of view from foodservice operators, dealers, consultants, service agents, manufacturers and reps. Advertisement Rocco Mangel Rocks it With Tacos and Tequila Point of View Amelia Levin May 01, 2017 Rocco Mangel founded Rocco's Tacos & Tequila Bar in 2007. He grew up in the restaurant industry, working his way up from bus boy to general manager and later owner of a Mexican restaurant in West Palm Beach, Fla. Big Time Restaurant Group owns and operates the eight Rocco's locations throughout Florida and one in Brooklyn, N.Y. FE&S : How did the first Rocco's come about? Rocco Mangel, Founder and Managing Partner, Rocco’s Tacos & Tequila Bar RM: I moved here in 1997, and I was a bus boy in the restaurant on Clematis Street in West Palm Beach that I bought 10 years later almost to the day. My father was in the restaurant business and my grandfather before that so I have worked at a bunch of different restaurants throughout my career and always on Clematis Street — for the 20 years I've been in Florida. In 2004 I left the restaurant industry and got more involved in the nightclub business for a while. Then a friend of mine opened a Mexican restaurant and asked if I would be the maître d' and two weeks later I became the general manager. The restaurant served tableside guacamole and very authentic Mexican cuisine and I learned more about tequila so that's how I got my fix. I traveled all of the U.S. and in Mexico and that's how I came up with the concept for Rocco's Tacos & Tequila Bar. We focus on tableside guacamole and street-food tacos but I also wanted to emphasize tequila because it's still one of the top spirits in the country. I ended up partnering with Big Time Restaurant Group to open the first location in West Palm Beach in 2007. I'm considered a co-owner but, conceptually, all of us came up with the idea. FE&S : How have you expanded the concept under Big Time Restaurant Group? RM: After we opened the first location, we opened restaurants in Boca Raton in 2009; Fort Lauderdale in 2011; Palm Beach Gardens and Orlando in 2012; Brooklyn, N.Y., in 2014 and Delray Beach in 2015. This year, we licensed the brand to open at the Fort Lauderdale airport and took possession of a new location in Tampa Bay in February. We have a couple other locations we're looking at on the West Coast of Florida right now. FE&S : What's the size of the restaurants? Do they differ in design? RM: Our restaurants usually range from about 4,500 square feet all the way to 14,000 square feet in Brooklyn with anywhere from 180 to 300 or more seats. The Orlando location is 10,000 square feet and the new Tampa restaurant will be about 6,000 to 7,000 square feet. For each location, I travel to Mexico with my partner and we design the restaurants ourselves and hand-pick the decor. The furniture and the fixtures come from Mexico, then we ship everything across the border rather than work with a fabricator here, so it's very authentic. We do work with a local dealer for our equipment. Every restaurant looks a little different. We have a signature orange star chandelier and use certain colors, but every restaurant has a unique look. Our newest Delray Beach location looks significantly different than our original restaurant in West Palm Beach but you still know you're in a Rocco's. FE&S: How did you develop the food menu? RM: We have a wonderful culinary partner, Lisabet Summa, who leads the development of the menu, though we are all part of that effort. Our fresh-to-order, tableside guacamole continues to be a big hit. We're obviously a taco restaurant so we focus on Mexican street-style tacos with all the proteins as well as a mercado taco with adobe-rubbed grilled chicken, avocado salsa, papalo and chile de arbol on corn tortillas and a California fish taco with Mahi Mahi. I came up with the Rocco's Taco, which is seared tuna and fried wonton on three small proteins. We also have a more creative Korean taco with hoisin barbecue beef, kimchi, cilantro and smoky peanut salsa. One of our more popular, larger dishes is the molcajete, a Mexican lava rock bowl that comes to the table piping hot with a mixture of seafood, steak or chicken and vegetables with tortillas on the side. FE&S : What about the tequila side of the restaurant? RM: That's my area — I handle the drinks and the bar. I like to say I've tried to earn my masters in tequila. It's great to see so many more people interested in tequila. Maybe 20 years ago when people thought about tequila they thought about how it would make them sick. There are so many more craft and small batch types available now. We find people are a lot more educated about tequila, almost like a wine connoisseur. That's why we have no less than 184 — all the way to 400 — varieties and brands of tequila in our restaurants. Our bar managers are basically tequila sommeliers. FE&S : Bar design and business is so important to restaurants, even more these days. How do you design the tequila bar? RM: The bars are designed, built and fabricated in Mexico, which gives us a unique look. My mother used to collect elephants and she passed away five years ago so I have added these elephant heads carved out of wood in the middle of the bar as a reminder of her. We try to maximize the potential for speed in our design, so we think carefully where to put the wells, the ice, and even how the doors swing open — if they swing to the left or right. Our bars are set right in the middle of the dining room so we feel they create this energy and ambiance in the room. In Brooklyn, the bar is more than 100 feet long and stretches the entire length of the restaurant. FE&S : Mexican never gets old, and it can even be considered a crowded space. How do you stay ahead of the competition? RM: We've been open for 10 years and collectively we change our concept and menu regularly so it's always fresh. We're about to roll out a new menu design for our Tampa location. We're not re-concepting, but we have noticed a trend where everyone is a lot more health conscious right now so we're going to offer tacos on lettuce wraps and other gluten free alternatives. We're also going to offer crudités like sliced radishes, carrots and celery with our tableside guacamole instead of just chips. Most people might think of Mexican food as really heavy, with all the cheese and sour cream, but we're focusing on grilled fish, fresh jicama, watermelon salad and a lot more organic-style foods. The kitchen in Tampa will be a brand new, all-scratch kitchen so we can develop and test some of these new menu items. We're also introducing a wood-fired grill at the Tampa location to add more flavor to our ingredients. It will be a part of an open kitchen, which we've focused on with our newer restaurants because we know people like to see how their food is being made and how clean things are. FE&S : You mentioned you oversee the drink development, but how would you describe your day-to-day job? RM: We have a large corporation with almost 1,000 people, with Big Time Management Group handling the back of the house and another team handling the front. I basically oversee everything, but it's easier in this day and age with computers and state-of-the-art technology in real time. I can see how many people are in any restaurant at any given time all on my cell phone, and track what's selling and what's not, and look at the cameras. But I like to be hands-on so on any given day I might go into one of the restaurants and help out behind the bar or talk to our guests or help with promotions and marketing. FE&S : How do you manage consistency across all the locations? RM: We have a weekly recap talk about all the restaurants and how they are performing, weekly manager meetings and other daily recaps. The technology platform we use also helps me manage everything remotely, and it helps us really track our costs down to the cost of each napkin. We have very good systems in place, which helps with consistency in food, drink and service. FE&S : You recently released Rocco's Spice. Tell me more about that decision and process. RM: The spice is something we created in 2007 when the first Rocco's opened. We use it in a lot of dishes. People kept asking us for the recipe and we would give it away in plastic bags. We finally realized maybe this is marketable. It took two years to get the packaging and process down, but we've rolled it out and we're getting a great response already. We're working with brand placement experts to get the spice in local supermarkets and sell it online. We're also working on a line of margarita salt items and other things we can do to promote the brand. It's not a huge moneymaker for us at the moment, but it's an incredible marketing tool. People can open their cabinet and think of us and use us in dishes they cook for their family and friends. So it's a win-win situation. Follow Us On Social Advertisement FESFlix Featured Video See More FESFlix Videos Advertisement FE&S Awards & Events Consultants' Roundtable Webcast On-Demand In this always popular hour-long webcast, we brought a panel of foodservice consultants together to share insights and inspiration from years of experience to address how to bridge technology and design, common kitchen design missteps and more. View On-Demand Advertisement Industry Calendar 2025 FEDA Annual Conference September 10-13, 2025 Grand Hyatt Scottsdale Resort & Spa Scottsdale, Ariz. feda.com Go to Calendar You May Also Be Interested In RaceTrac to buy Potbelly September 10, 2025 Potbelly has a goal to reach 2,000 restaurants system-wide. And it believes it has found a partner in RaceTrac to help the fast-casual sandwich chain hit that goal. C-store chain RaceTrac has inked a deal to acquire Potbelly in an all-cash deal, valued at $566 million. Read Article Yum! Names New Taco Bell CEO September 09, 2025 Sean Tresvant was promoted to chief executive officer for Taco Bell, effective October 1, 2025. Tresvant will also become chief consumer officer for Taco Bell’s parent company Yum! Brands. Read Article Current Issue Foodservice Equipment & Supplies is the longest-running publication serving the decision-makers of the nearly $15 billion E&S industry. View current digital issue Subscribe Want to receive a FREE subscription to Foodservice Equipment & Supplies? Subscribe to magazine Topics Perspectives Project Profiles Trends The Latest News Related Websites rddmag.com fedthoughtleadership.com zoombagroup.com Products Beverage Equipment Cooking Equipment Prep Equipment Sanitation and Safety Serving Equipment Refrigeration, Storage & Handling Tabletop & Smallwares Research Distribution Giants Industry Forecast Archived Best in Class Reports Operator Purchasing Study Awards Dealer of the Year DSR of the Year Facility Design Project of the Year Hall of Fame Top Achievers Tabletop Events Dealer of the Year Foodservice Equipment and Design Summit Industry Events Tour the Trends Webcasts Newsletter Archive eMarketplace Equipment Insights Flash News FESFlix Newsletters Guide to Products Service Insights The Specifier Resources About FE&S Accolades Contact Industry Calendar FESFlix Media Kit Sponsored Content Subscription Subscribe Renew Cancel FOLLOW US ON SOCIAL ABOUT US Foodservice Equipment & Supplies (FE&S) is the one media source that connects equipment and supplies manufacturers and service providers with the full distribution channel including news, trends and best practices for foodservice equipment dealers, specifiers, operators, and supply chain partners. Copyright © 2025 Foodservice Equipment & Supplies. All Rights Reserved. Home Topics The Latest News Perspectives DSR of the Month Foodservice by Design This Week In Foodservice E&S Extra Project Profiles Chain Profile Facility Design Project of the Month On-Site Projects Trends Products Guide to… Beverage Equipment Carbonated Beverage Dispensers Coffee Brewers Draft Beer Systems Slushies and Smoothies Cooking Equipment Fryers Griddles Ovens Panini Presses Ranges Rotisseries Steamers Steam-Jacketed Kettles Toasters Tilting Skillets Prep Equipment Blenders Breaders Choppers Juicers Mixers Portion Scales Proofing Cabinets Slicers Refrigeration, Storage & Handling Blast Chillers Food Wells Ice Cream, Gelato and Soft-Serve Makers and Freezers Ice Machines Heated Display Merchandisers Refrigeration Shelving Sanitation and Safety Dishwashers and Warewashers Disposers Oil Filtration Ventilation Water Filtration Serving Equipment Buffetware Countertop Condiment Dispensers Tabletop and Smallwares Cookware Cutlery Dinnerware Glassware Browse Products Beverage Equipment Beverage Dispensers Coffee Brewers Draft Beer Systems Slushies and Smoothies Cooking Equipment Fryers Griddles Ovens Panini Presses Ranges Rotisseries Steamers Steam-Jacketed Kettles Toasters Tilting Skillets Prep Equipment Blenders Breaders Choppers Juicers Mixers Portion Scales Proofing Cabinets Slicers Refrigeration, Storage & Handling Blast Chillers Food Wells Ice Cream, Gelato and Soft-Serve Makers and Freezers Ice Machines Heated Display Merchandisers Refrigeration Shelving Sanitation and Safety Equipment Dishwashers and Warewashers Disposers Oil Filtration Ventilation Water Filtration Serving Equipment Buffetware Countertop Dispensers and Organizers Tabletop and Smallwares Cookware Cutlery Dinnerware Glassware Submit a Product Research Distribution Giants Industry Forecast Operator Purchasing Study Best in Class Reports Awards Dealer of the Year DSR of the Year Facility Design Project of the Year Hall of Fame Tabletop Awards Top Achievers Events Industry Calendar Videos"
    }
  ]
}