{
  "fuentes": [
    {
      "url": "https://www.rockridgecanyon.com/serve/work-staff/",
      "email": "rockridge@younglife.ca"
    },
    {
      "url": "https://www.rockridgecanyon.com/serve/work-staff/",
      "email": "stay-and-study-winter-copper@4x-e1606775690470.png"
    },
    {
      "url": "https://stageshouston.com/about-staff-and-board/",
      "email": "patronservices@stageshouston.com"
    },
    {
      "url": "https://www.usaswimming.org/home/find-a-team?format=json",
      "email": "masinfo@usaswimming.org"
    },
    {
      "url": "https://www.rocknriverwalk.com/contact-us",
      "email": "director@stuartmainstreet.org"
    },
    {
      "url": "https://www.bdvsolutions.com/about-us/contact",
      "email": "sales@bdvsolutions.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "alicia@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "carolina@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "chloe@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "jaynee@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "jessica@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "tracey@visitfingerlakes.com"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "andy-bio-image@3x.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "lake-image@2x.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "leaders-icon@3x.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "mark-bio-image@3x.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "mary-bio-photo-f-p-o@3x.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "share-voice-icon@3x-300x300.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "share-voice-icon@3x.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "stage-w-logo-horizontal@3x.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "stagew-logo-tm@3x.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "stagew-logo@3x-1.png"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "email": "wood-stripe-image@2x.png"
    },
    {
      "url": "https://www.rocknriverwalk.com/about",
      "email": "director@stuartmainstreet.org"
    },
    {
      "url": "https://www.rocknriverwalk.com/vendor",
      "email": "director@stuartmainstreet.org"
    }
  ],
  "mails": [
    "alicia@visitfingerlakes.com",
    "andy-bio-image@3x.png",
    "carolina@visitfingerlakes.com",
    "chloe@visitfingerlakes.com",
    "director@stuartmainstreet.org",
    "jaynee@visitfingerlakes.com",
    "jessica@visitfingerlakes.com",
    "lake-image@2x.png",
    "leaders-icon@3x.png",
    "mark-bio-image@3x.png",
    "mary-bio-photo-f-p-o@3x.png",
    "masinfo@usaswimming.org",
    "patronservices@stageshouston.com",
    "rockridge@younglife.ca",
    "sales@bdvsolutions.com",
    "share-voice-icon@3x-300x300.png",
    "share-voice-icon@3x.png",
    "stage-w-logo-horizontal@3x.png",
    "stagew-logo-tm@3x.png",
    "stagew-logo@3x-1.png",
    "stay-and-study-winter-copper@4x-e1606775690470.png",
    "tracey@visitfingerlakes.com",
    "wood-stripe-image@2x.png"
  ],
  "nombre_sitio": "rocknriverwalk.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.rockridgecanyon.com/serve/work-staff/",
      "text": "Work Staff | Serve | RockRidge Canyon | Princeton BC CAMP YL Summer Family Retreats + Family Camps Capernaum Family Camp Summer Safety Forms & Downloads Weekend for Women YL Coastal New Years Camp SHOP Standup Paddle Boards SALE BIKES STORE Safety Plan SCHOOLS SERVE Careers CREW Leadership program Summer Interns Summer Staff Work Crew Adult Volunteers Come and Serve Adults Medical Team YouBelong@RRC Summer Internships PLAN A RETREAT Renting RockRidge Canyon “The Rock” Theatre Accommodations Meeting Spaces Dining Rooms Retail Outlets Activities Forms & Downloads Driving Directions EVENTS Concert in the Canyon Taste and See Weekend A Young Life Weekend for Women – Amazing Race Family Day Weekend Retreat WinterFest Open House Day DONATE CONTACT Contact Information About YoungLife Directions Lost & Found Careers Work Staff Serving at RockRidge Canyon, a Young Life Camp Winter Work Staff 2021 Stay & Study Program UPDATE All positions Winter Stay & Study 2021 have been filled Thanks for your interest! If you’d like to be contacted about future opportunities for young adults to serve at RockRidge Canyon please contact Allan. We’re planning for Summer and Fall so we look forward to chatting with you! Contact Us A life lived with purpose It’s not often in life that we get to evaluate our purpose, map out our future and reflect on our past. Our Work Staff team is committed to Christ first and foremost. You will have the ability and opportunity to serve with excellence and have a desire to be challenged and grow in your relationship with Christ. Winter ‘Stay & Study’ Work Staff positions at RockRidge Canyon play a vital role in our rental season, an essential aspect of what makes the summer youth season possible. You’ll live in a rural environment, surrounded by other people like yourself who really want their life to count for something. We think you’ll come away from your experiences at camp better equipped to make choices about your future plans, education and career. Stay & Study This is an awesome opportunity to live at RockRidge Canyon this Winter, while taking your online university and college courses. Join other college students as you live in Wolfe Creek Lodge, study, volunteer some weekends, and enjoy the RockRidge Canyon community throughout the Winter season. Arrival: January 3, 2020 Departure: On or before April 25th, 2021 (We are flexible with students school and finals schedule). Number of positions available: 8-10 max. Rent $450/month plus volunteer hours each month (1 weekend minimum). Accommodation is shared. Rent reduction: For additional weekends of volunteering $150 will be subtracted from your rent. You must be willing to work weekends. Meals Rent includes accommodation, however please note it does not include daily food/meals. Access to kitchen is provided. Lodging Shared accommodation 2nd Floor of Wolfe Creek Lodge Stay & Study Work Staff are provided with spaces for study, recreation and community. Payment You will be billed at the end of each month Staying Safe Staff health is paramount. Throughout the 2020 Summer and Fall we have been hosting Family Retreats. The planning and execution of these Retreats have given RockRidge Canyon staff the knowledge and experience necessary to follow BC protocols, and put in place best practices for on site guests, volunteers and staff. Health Screening upon arrival. 2 week introductory health watch. Single occupancy in Wolfe Creek Lodge during your first 2 weeks on site, with a maximum of 3 people per accommodation thereafter. Currently masks are required in all common areas Encourage social distancing when and where necessary. Follow RockRidge Canyon and BC Health protocols on and off property. Health protocols are subject to change as required by the Provincial Health Officer. Age Requirement At least 19 years of age, as of start date. Education You must be enrolled in a university or college program, taking online courses during this session. New Year’s Family Retreat Stay & Study students will be required to volunteer for New Year Family Retreat December 31-Jan 3, 2021. Roles Winter Stay & Study Work Staff will serve in multiple roles, which may include: GuestKeeping (Guest Services + Housekeeping) Food Services What are your special skills & life/work experience? Let us know in your application! Dates Start Jan 3, 2021 End On or before April 25, 2021 (We are flexible with student’s school and finals schedule) Ski-and-Board-Winter Stay-and-Study-Homework_1778-c Stay-and-Study_Skates_Hockey-Stick_1792 Stay-and-Study-Little-Rimrock_1783 Site Search Search Facebook YouTube Vimeo Instagram (250) 870-9030 Office +(250) 295-0015 Princeton Area For all Rental and Booking Enquires call +1 (250) 870-9030 ext. 4120 Mail: PO Box 1299  Princeton, BC Canada V0X 1W0 Drive: 2000 Willies Ranch Road Princeton, BC Canada V0X 1W0 rockridge@younglife.ca Careers Retreats Renting RockRidge Canyon “The Rock” Theatre Accommodations Meeting Spaces Dining Rooms Retail Outlets Activities Forms & Downloads Driving Directions © 2023 RockRidge Canyon Retreat & Conference Centre   |   RockRidge Canyon is a Young Life of Canada property. All rights reserved."
    },
    {
      "url": "https://stageshouston.com/about-staff-and-board/",
      "text": "Staff and Board – Stages Buy Tickets Donate My Account Login cart\n        ( ) SEARCH MENU About Mission and Values Our Story People Make Theater Staff and Board Financials Shows & Events Opening Soon: The Lehman Trilogy Mud Row Overview Upcoming Shows 2025–26 Subscription Packages All Shows Group Tickets Sin Muros: A Latinx Theater Festival Experience Plan Your Visit Frequently Asked Questions Accessibility Seating Our Space Rent Our Space Support Now playing 2025 Gala at the Gordy Donate Young Patrons Volunteer Ushers Insights Press News Blog Videos Community Community Offerings Educators Open House Student Matinees College Nights Young Artists Conservatory Buy Tickets Donate My Account Login cart\n        ( ) SEARCH close Staff and Board We’re great as individuals, but together we thrive. Meet the people behind the scenes. STAFF Derek Charles Livingston Artistic Director Gwen Watkins Managing Director Derek Charles Livingston is thrilled and humbled to start his first season as artistic director of Stages.  Most recently, he spent four seasons at the Utah Shakespeare Festival (USF) as the Director of New Play Development .  During that time, he also served two seasons as the Interim Artistic Director ; acted in the one-person play Thurgood , depicting the life of Supreme Court Justice Thurgood Marshall; and directed lauded productions of A Raisin in the Sun and Henry VIII as well as a reading of Polar Bears, Black Boys, and Prairie Fringed Orchids . As a new play developer, he managed USF’s Words Cubed program, which, in three seasons, produced four plays selected for professional productions at other theaters.  His new play development work in San Diego as part of Playwrights Project saw him lead four different new play development processes in partnership with multiple San Diego theaters.  Prior to his time in San Diego, Derek was a successful theater director and producer in Los Angeles, including serving over four years as the Managing Artistic Director of Celebration Theatre, the second oldest continuously operating LGBT theater in the United States. Selected work as a director: Six Degrees of Separation , Tru , Sweeney Todd (LA Scenie Awards – Best Musical, Best Director), M. Butterfly (LA Scenie Award – Best Director, LA Weekly Nomination, Best Director), Shakespeare’s R&J (Ovation Nomination – Best Director), Hedwig and the Angry Inch (Ovation Award – Best Musical), Insurrection: Holding History (LA Weekly Nomination, Best Director), Naked Will (GLAAD/LA Nomination –  Best Play), Jesus Christ Superstar , Love!Valour!Compassion! . As an acto r, he’s played multiple lawyers: Pridamont ( The Illusion ), Jerome, et al ( Merrily We Roll Along ), Billy Flyn ( Chicago ), and Thurgood Marshall ( Thurgood – twice!).  Some favorite roles include Simon ( The Whipping Man ), Hoke ( Driving Miss Daisy – New Hampshire Drama Award, Best Actor), Tupolski ( Pillowman ), Jackson ( Judy at the Stonewall Inn ), Capulet ( Romeo and Juliet ). Derek earned his BA in Theatre at Brown University and his MFA in Filmmaking from UCLA’s School of Film and Television.  Separate from performing arts, his long social-justice history includes serving as a national co-chair of the 1993 March on Washington for Lesbian, Gay, & Bi Equal Rights and Liberation – the largest LGBT march on Washington in US History.  His portrait, taken at the Million Man March, is featured in the Smithsonian Museum of African American History. He makes his home in Houston in the historic Third Ward. Gwen Watkins is a native Houstonian who has been working in Houston’s vibrant cultural sector for more than 15 years and possesses a passion to connect the community’s diverse audiences through the arts. She joined the Stages team this season as managing director, overseeing fundraising, marketing, finance, and operations teams. She holds a bachelor’s degree in English from Texas A&M University and an MBA from Rice University. Prior to joining Stages, she served as the Houston Symphony’s Chief Marketing & External Relations Officer. During her time with the Houston Symphony, Watkins spearheaded transformation within the marketing department, oversaw community engagement and education initiatives, and was a part of the leadership team that stewarded the organization through the pandemic. Before her time at the Symphony, Watkins served as Associate Head of Marketing & Communications at the Museum of Fine Arts, Houston (MFAH) where she managed marketing initiatives in support of the many facets of the institution including its hundreds of thousands of square feet of gallery space, tens of thousands of art objects, art school, art house film program, cafes, shops, and more, as well as serving a key role in the communications and marketing plans for their $450MM capital campaign project. Earlier in her career, Gwen held marketing roles at the Houston Zoo and the Houston Galleria. MANAGEMENT TEAM Joel Burkholder Production and Technical Director Mark Bailes Marketing Director Katie Jackman Interim Marketing Director Leticia Konigsberg Development Director Todd Molesky Operations Director Debra Yeang Finance and Administration Director ARTISTIC AND PRODUCTION STAFF Joseph Blanchard Assistant Technical Director of Scenery Construction Jodi Bobrovsky Prop Shop Manager Sage Cantu Production Mentor Ashley Ginn Production Stage Manager David Jezek Cutter/Draper Kasi Love Production Manager Vic Lucas Production Mentee Corey Nance Scenic Artist and Prop Shop Assistant James Ponder Assistant Technical Director of Scenery Logistics Destiny Raine Lead Electrician Lauren Smith AV Technician Leah Smith Costume Shop Manager Daun Whaley Proudction Mentee ADMINISTRATIVE STAFF Michelle Barnum Human Resources Manager Ryan Bentsen Administrative Coordinator Olivia Cantrell Content Strategist Irma M. Carrillo Patron Systems and Benefits Manager Tené Carter Community Engagement Manager Ana Garcia Development Associate Dino Hall Facilites Operator César Jáquez Building and Events Coordinator René P. Rodriguez Finance and Administration Associate Tevyn Washington Patron and Donor Experience Manager PATRON EXPERIENCE STAFF David Greiss Patron Experience Associate Leighla Henderson Patron Experience Associate Judith Igwilo Patron Experience Associate Charity Sells Patron Experience Associate Camryn Nunley Front of House Manager BOARD OF DIRECTORS EXECUTIVE COMMITTEE Charles Walker President Head of IP Disputes, US Norton Rose Fulbright George C. Lancaster Chair Chair Emeritus Global Head of Brand Hines Mike Dishberger Treasurer Chair, Finance CEO & Co-Owner Sandcastle Homes Kay Brazelton Bruce Secretary Community Leader Kalinda Campbell Chair, Nominating Global Head of Diversity, Equity, Inclusion, and Belonging ERM Luis Gomar Chair, Governance Partner, Corporate Paul Hastings LLP Jane Schmitt Chair, Audit Community Leader Alexander Lazar, MD, PhD Chair, Strategic Planning Professor UT MD Anderson Cancer Center Briana Conner Member-at-Large Anchor/Reporter ABC13 Houston Jo Furr Member-at-Large Community Leader DIRECTORS Omar Al-Aidroos Partner KPMG Ralph Burch Deputy General Counsel (Retired) ConocoPhillips Puja Detjen Partner Patterson + Sheridan LLP Duke Ensell President Admiral Transfer and Rigging Glenda Gordy Vice President/Director Gordy Oil Company Cynthia Guill Community Leader Lauren Hagerich Senior Market Development Manager K&L Gates LLP Neal Hirsch Managing Partner (Retired) Richard, Wayne and Roberts John Isgren Senior Director of Process Engineering Enterprise Products Myrtle Jones Senior Vice President, Tax (Retired) Halliburton Danny Klaes President Charlie Thomas Enterprises Harriet C. Latimer Principal Harriet Latimer & Associates Angela Lee Founder & Principal Designer Evolution by Design Jim Nicklos President Nicklos Drilling Company Steven Owsley Partner Owsley & Associates Angela Haraka Ramm Community Leader Hans Roth Managing Director Russell Reynolds Associates Phillip J. Vogelsang Managing Director (Retired) Ernst & Young Emeritus Council Ted Swindley Founding Artistic Director Dominic Cellitti Gary Chiles Jim Cowan Sally Edmundson Ray Messer Mary Moore Amy Moss Mauri Oliver Tom Paul Tara Simon Randy Young 800 Rosine St Houston, Texas 77019 Patron Services: 713.527.0123 patronservices@stageshouston.com Administrative Office: 713.527.0220 Mady and Ken Kades Box Office Patron Services hours 12:00 pm – 6:30 pm Tuesday – Saturday 12:00 pm – 4:00 pm Sunday Careers and Auditions Script Submissions Policies and Accessibility Safety Update Privacy Policy Sign up for nuggets of inspiration and news straight into your inbox. SIGN UP © 2025 Stages All Rights Reserved"
    },
    {
      "url": "https://www.usaswimming.org/home/find-a-team?format=json",
      "text": "Find A Team Events & Tickets Fan Shop Swim Shop Find A Team Block Party Membership Login / Register Times Times Home Popular Resources Individual Times Search Top Times / Event Rank Power Point Calculator Time Standards National Age Group Records All-Time Top 100 Age Group Scholastic All-America Virtual Offerings IMX/IMR Virtual Club Championship Block Party Leaderboard Club Excellence Data Hub Record Progressions All-Time Top Performers Yearly Top Performers All-Time Relay Splits World Rankings Powered by USA Swimming Continental Lists Meet Results Other Organizations NCAA Information NCAA Division I NCAA Division II NCAA Division III International School Swimming Competitions - China Swimmers & Parents Swimmers & Parents Home Popular Resources Register & Renew Membership USA Swimming University Mental Training & Wellness Anti-Doping Diversity, Equity & Inclusion Disability Nutrition & Recovery Learn the Basics Learn-to-Swim Find a Swim Team & Lessons Rules & Policies Swimmers Athlete Videos Training & Technique Open Water Swim Camps Parents Safe Sport for Parents Become an Official Coaches & Team Leaders Coaches & Team Leaders Home Coaches Coach Requirements Coach Safety Requirements American Development Model Coach Certification Program Coaches Community Coach Mental Health & Wellness Team Leaders Start a New Club Managing Your Team Block Party Grants Marketing Toolkit SWIMS Alerts Swim Camps Connect & Learn Diversity, Equity & Inclusion Disability Programs & Services Resources Registration & Renewal Team Services USA Swimming University Online Meet Entry (OME) Job Board Health Coverage Financial Advising Officials Officials Home Popular Resources Officials Tracking System National Certification & Evaluation National Meet Applications Rules & Policies Online Testing Recognition & Incentive Programs Officials Documents Open Water Officials Getting Started USA Swimming University How to Become an Official LSC Officials Chairs Safe Sport Safe Sport Home Club Tool Kit Report a Concern Complete a Background Check Safe Sport Club Recognition Minor Athlete Abuse Prevention Policy Athlete Protection Training Individuals Suspended or Ineligible Meet the Team Meet the Team Home National Team National Jr. Team Rosters National Team Alumni Athlete Videos 2024 Olympic Team About About Home Organization Overview Leadership Team Board of Directors Staff Directory Contact Us Careers Governance Board Governance Bylaws Rules & Policies Committees Board Meeting Minutes Financials USA Swimming Annual Summit LSC Resources LSC Services LSC Websites LSC Governance LSC Treasurer Operational Risk Resources Media Information Marketing Partners Marketing Resources Insurance Online Member Registration SWIMS Database Newsletter Archive Stakeholder Engagement Foundation DONATE Times Swimmers & Parents Coaches & Team Leaders Officials Safe Sport Meet the Team About Foundation MEMBERSHIP VIDEOS EVENTS & TICKETS SWIM SHOP FAN SHOP FIND A TEAM Donate BACK Times Popular Resources Individual Times Search Top Times / Event Rank Power Point Calculator Time Standards National Age Group Records All-Time Top 100 Age Group Scholastic All-America Virtual Offerings IMX/IMR Virtual Club Championship Block Party Leaderboard Club Excellence Data Hub Record Progressions All-Time Top Performers Yearly Top Performers All-Time Relay Splits World Rankings Powered by USA Swimming Continental Lists Meet Results Other Organizations NCAA Information NCAA Division I NCAA Division II NCAA Division III International School Swimming Competitions - China BACK Swimmers & Parents Popular Resources Register & Renew Membership USA Swimming University Mental Training & Wellness Anti-Doping Diversity, Equity & Inclusion Disability Nutrition & Recovery Learn the Basics Learn-to-Swim Find a Swim Team & Lessons Rules & Policies Swimmers Athlete Videos Training & Technique Open Water Swim Camps Parents Safe Sport for Parents Become an Official BACK Coaches & Team Leaders Coaches Coach Requirements Coach Safety Requirements American Development Model Coach Certification Program Coaches Community Coach Mental Health & Wellness Team Leaders Start a New Club Managing Your Team Block Party Grants Marketing Toolkit SWIMS Alerts Swim Camps Connect & Learn Diversity, Equity & Inclusion Disability Programs & Services Resources Registration & Renewal Team Services USA Swimming University Online Meet Entry (OME) Job Board Health Coverage Financial Advising BACK Officials Popular Resources Officials Tracking System National Certification & Evaluation National Meet Applications Rules & Policies Online Testing Recognition & Incentive Programs Officials Documents Open Water Officials Getting Started USA Swimming University How to Become an Official LSC Officials Chairs BACK Safe Sport Club Tool Kit Report a Concern Complete a Background Check Safe Sport Club Recognition Minor Athlete Abuse Prevention Policy Athlete Protection Training Individuals Suspended or Ineligible BACK Meet the Team National Team National Jr. Team Rosters National Team Alumni Athlete Videos 2024 Olympic Team BACK About Organization Overview Leadership Team Board of Directors Staff Directory Contact Us Careers Governance Board Governance Bylaws Rules & Policies Committees Board Meeting Minutes Financials USA Swimming Annual Summit LSC Resources LSC Services LSC Websites LSC Governance LSC Treasurer Operational Risk Resources Media Information Marketing Partners Marketing Resources Insurance Online Member Registration SWIMS Database Newsletter Archive Stakeholder Engagement BACK Foundation Dive In Find A Team & Lessons Join USA Swimming Today Find a Team or Learn to Swim Welcome to the new Find A Team! Here you can find one of 2,800+ USA Swimming clubs and hundreds of Learn to Swim programs to join the competitive side of the sport (indicated by blue pins on the map). Contact these programs directly to learn about the many options about how to join USA Swimming and enjoy swimming at any level! For more information on this map, please click here Finder Type USA Swimming Club Learn To Swim Club Excellence Level None Bronze Silver Gold Safe Sport Recognized Yes No FILTER HIDE FILTERS SWIM LESSON PROVIDER NETWORK To distinguish these providers, we designate them as part of USA Swimming’s Swim Lesson Provider Network, as these swim lesson providers go above and beyond to provide a safe environment and facility by using trained and certified instructors and\n        lifeguards, low student to teacher ratios, and proven techniques and curricula to ensure a quality learning experience for every child. The benefits of being a part of USA Swimming’s Swim Lesson Provider Network are endless! Swim Lesson Providers are connected to local Water Safety Coalition networks and supporting organizations, and provided access to discounted or free materials\n            and resources to use when hosting water safety events. Additionally, the USA Swimming Foundation has an annual grant fund for learn-to-swim providers who offer services to children who, otherwise, would not have the opportunity to participate\n            swimming lessons. Are you providing youth learn-to-swim services and interested in joining our network of  Swim Lesson Providers? To learn more about the program check out our Swim Lesson Provider Network Requirements. READY TO JOIN OUR NETWORK Are you providing youth learn-to-swim services and interested in joining our network of Swim Lesson Providers? Questions? Contact us via email . Our Community Swimmers Coaches Officials Team Leaders Resources SafeSport Club Portal Find a Team Find Swim Lessons Diversity, Equity & Inclusion Rules & Policies About Overview Board of Directors Careers Contact The Foundation About the Foundation Support the Foundation Ambassadors News & Events Follow DONATE © Copyright 2025 USA Swimming. All Rights Reserved. Privacy Policy Terms of Use Personal Data Request Form"
    },
    {
      "url": "https://www.rocknriverwalk.com/contact-us",
      "text": "Contact Us — Rock'n Riverwalk About Schedule Sponsor Vendor Contact Us Back 2025 Sponsors Sponsorship Packages About Schedule Sponsor 2025 Sponsors Sponsorship Packages Vendor Contact Us Musical Acts Musical acts interested in booking, please email an EPK along with other promotional links to Ron Hart at cleftocodatunes@gmail.com Sponsors & Vendors If you are interested in sponsoring Rock’n Riverwalk or becoming a vendor, contact Candace Callahan, Executive Director for Stuart Main Street at director@stuartmainstreet.org For all other inquires: Contact Us Name * First Name Last Name Email Address * Subject * Message * Thank you! Hours Event About Line-up FAQ Sponsor Become a Sponsor Our sponsors Promoted by UBU Brands"
    },
    {
      "url": "https://www.bdvsolutions.com/about-us/contact",
      "text": "Get in Touch with BDV Solutions | We're Here to Help Log In | Create an Account ES PT About Us Why Choose BDV Client Success Stories Government Relations Contact EB-3 Visa About EB-3 Unskilled Visa EB-3 Visa Pricing EB-3 Open Jobs News & Updates Visa Insights Blog Visa Bulletin Updates Quarterly BDV Newsletters Events & Seminars Press & Media Resources Immigration Glossary Free Immigration Guides FAQ Become a Referral Partner Connect with us directly through the chat on your Free Account We are located in beautiful Greenville, South Carolina! You are always welcome to come visit us! Meet us in person We would love to welcome you to our office in Greenville, SC. We are available for in-person meetings by appointment only. Â Appointment-only meetings ensure that you can get assistance from the correct team member when you visit our office, no matter what stage of the process you are in. Book a time here Set up a meeting Message our team directly to set up a meeting in person at the office or on the phone. Someone will gladly assist you in confirming a time to discuss BDV Solutions and the EB-3 process. Message our team Join our mailing list Subscribe to receive updates on new employer sponsor openings, the latest news from BDV Solutions, and more delivered directly to your inbox! First Name Last Name Email Address Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Prepare for your journey BDV community hub for Foreign Nationals is coming soon. Save your spot today, be notified when we launch and get exclusive access to tools and resources essential for a successful immigration journey through EB3 Unskilled. Learn how BDV Solutions is not a law firm and does not provide legal advice. Your communication with BDV Solutions does not create an attorney-client relationship and is not protected by attorney-client privilege. About Us Why Choose BDV Client Success Stories Contact EB-3 Open Jobs Partnerships Careers EB-3 Visa About EB-3 Unskilled Visa EB-3 Visa Pricing Resources Immigration Glossary Free Immigration Guides FAQ News & Updates Visa Insights Blog Visa Bulletin Updates Quarterly BDV Newsletters Events & Seminars Press & Media For U.S. Employers Contact TermsÂ ofÂ Service PrivacyÂ Policy"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "text": "Visit Finger Lakes Staff & Board of Directors | Meet the Team Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. Skip navigation Skip to main content MENU SEARCH View Maps Maps View Guides Guides Join Our Newsletter Subscribe View Maps Maps View Guides Guides Join Our Newsletter Subscribe Things To Do FLXperience Passes On The Lakes Finger Lakes Beaches & Swimming Finger Lakes Kayaking & Paddleboarding Boat Rentals & Boat Tours Marinas & Boat Launches Fishing Roseland Waterpark & Wake Park Outdoors Trail Maps Hiking Biking Parks & Playgrounds Aerial Adventures & Zip Line Tours Skiing & Snowboarding Golf Bristol Mountain Roseland Waterpark & Wake Park Aerial Adventures & Zipline Tours Skiing & Snowboarding Spas & Wellness Yoga, Gyms & Fitness Centers FLX Well-Being Passport Shopping Locally Made Antiques Eastview Mall Gifts And Souvenirs Farmers Markets Downtowns & Districts Arts & Entertainment Nightlife Theater Art Galleries & Exhibits Movie Theaters Finger Lakes Gaming & Racetrack Hands On and Educational Classes Farms & Markets Farm Tours & Events Farmers Markets & U-Pick Farms Museums & History Museums & Landmarks Women's Rights Sonnenberg Gardens & Mansion Historic Park Ganondagan State Historic Site & Seneca Art & Culture Center Path Through History Scenic Drives & Vistas Top 9 Photography Locations Top 9 \"Leaf Changing\" Experiences Gardens Day Trips Corning And Southern Tier Niagara Falls And Buffalo Ithaca And Aurora Rochester And The Erie Canal Things To Do With Kids Top 10 Family Fun Finger Lakes Activities On A Rainy Day Events & Festivals Annual Events Summer Fourth Of July Ring Of Fire Fall Colors Naples Grape Festival Maple Weekend Concerts & Live Music CMAC Experience Holiday Events 5ks, Marathons & Triathlons FLXperience Passes Well-Being Passport Discover Downtown Geneva Passport Canandaigua Lake Wine Tasting Passport Restaurants Top Finger Lakes Restaurants Finger Lakes Restaurants On The Water Cuisine Types American Bakeries And Coffee Shops Breakfast & Brunch Brewpubs & Taverns Chinese Diners German Ice Cream & Desserts Indian International Italian Mexican Pizza Sushi Thai Vegan / Vegetarian Farm To Table Local Specialities Take Out & Delivery Wineries & Vineyards Wine Tours Canandaigua Lake Wine Trail Seneca Lake Wine Trail How To Wine & Beer Trail Take Out & Delivery Craft Beverages Breweries & Craft Beer Cideries & Distilleries ROC/FLX Craft Beverage Trail How To Beer And Wine Trail Tours Take Out & Delivery Places To Stay Hotels Lakefront Hotels Resorts Bed & Breakfasts Campgrounds & RV Parks Cabins Vacation Rentals Unique Places To Stay Motels Plan Your Trip Packages & Deals Visitors Guide Trails & Trip Ideas How To Beer And Wine Trail Canandaigua Wine Trail Seneca Lake Wine Trail Top Things To Do Top 10 Winter Activities Top 10 Winter Activities To Keep Warm Indoors Top 10 Ways To Find Comfort On A Rainy Day Top 10 Places To Read A Book In The Finger Lakes A Girls Getaway Top 10 Romantic Ways to Propose in the Finger Lakes Family Fun Family Time Outdoor Recreation History Women's History Trail Sightseeing & Arts Roadside Attractions and Routes 5 & 20 Trail The Picture Perfect Trail Arts & Photo Trail Culinary Castles, Lakes And Grapes Galore Colors Of The Season Must Do For Groups In The Finger Lakes Pet Friendly Hotels Restaurants Wineries & Craft Beverages Blog FAQs Newsletter Finger Lakes Maps Transportation Getting To The Finger Lakes Finger Lakes Facts Canandaigua Lake Seneca Lake Honeoye Lake Canadice Lake Hemlock Lake Conesus Lake Keuka Lake Cayuga Lake Owasco Lake Skaneateles Lake Otisco Lake New York State Erie Canal Ontario County NY Geneva Hotels Restaurants Wineries Shopping Canandaigua Hotels Restaurants Wineries Shopping Naples Hotels Restaurants Shopping Wineries Bristol & South Bristol Victor & Farmington Hotels Restaurants Shopping Bloomfield & West Bloomfield Manchester & Shortsville Richmond, Honeoye & Canadice Phelps & Clifton Springs Hopewell, Seneca, Gorham Historic Port Gibson Colleges & Universities Weather & Webcams What To Pack Things To Do Events & Festivals FLXperience Passes Restaurants Wineries & Vineyards Craft Beverages Places To Stay Plan Your Trip Things To Do Events & Festivals FLXperience Passes Restaurants Wineries & Vineyards Craft Beverages Places To Stay Plan Your Trip Meetings Meet In The FLX Resources Regions Of Ontario County Travel Guide Meet the FLX Team Venues Meeting & Event Space Hotel Meeting Space Creative Meeting Space Meeting Planner Tools Catering & Dining Services Entertainment & Attractions Transportation Services Team Building Maps Meet and Retreat Newsletter Meetings Profile Sheet Submit RFP Quick Submit RFP Groups Group Profile Sheet Meet the Team Uniquely FLX Sample Itineraries FLX Classic FLX Foodies FLX Seasonal FLX Wine & Craft Beverage FLX Knowledge Seekers FLX Active FLX Wellness FLX Youth Destination Resources Maps About the Region Tour Support Services Submit RFP Weddings Planning Tips & Ideas Proposals Top 10 Romantic Ways To Propose In The Finger Lakes Before The Big Day Wine Tours In The Finger Lakes Spa Treatments Transportation Wedding Venues Event Spaces Rehearsal Dinners Great Photo Spots Vendors Transportation Services Honeymoons Partners Industry Updates Visit Confidently Resources E-Learning Signage & PPE Industry Resources FLVC Industry Newsletter Industry Events Upcoming Dates Legacy Awards National Travel & Tourism Week Tourism Thursdays Education & Training FLVC University Marketing Academy Ambassador Program E-learning Tourism Destination Training Partner Portal Training Partner Portal Training Manage Your Google Listing Coop Marketing Joint Marketing Partner Benefits Research and Resources FLVC Strategic Plans Annual Report Visitor Profiles, Visitation, Economic Impact NYS and National Resources Why Visitors Matter (infographics, etc.) Brand Resources & Logos Diversity / Accessibility Partner Portal Login About Us Seminars Media Online Media Kit Video & Images Gallery Press Releases Big Industry News Story Ideas Research & Reports About Us Blog Meetings Groups Weddings Partners Media Blog Meetings Groups Weddings Partners Media Blog About Us Mission & Vision Board of Directors & Staff Join Our Team History & Location Results & Recognition Local Development Corporation Archives FLVC Strategic Plans Contact Us Privacy Policy Sitemap About Us Contact Us Privacy Policy Sitemap Finger Lakes Visitors Connection, Canandaigua Home About Us Board of Directors & Staff Share Finger Lakes Visitors Connection Team Alicia Richie Quinn, CDME President & CEO Leads FLVC as the destination marketing management organization for Ontario County. Oversees the strategic direction and long-term vision for promoting the region. Alicia@VisitFingerLakes.com (585) 394-3915 ext. 356 Tracey Burkey, CDME Vice President of Destination Development Leads meetings, conventions, and group sales efforts to attract business to the region. Supports destination development initiatives that enhance visitor offerings. Tracey@VisitFingerLakes.com (585) 394-3915 ext. 353 Jessica VanDeMar Marketing Director Develops and implements innovative marketing strategies to drive tourism and brand visibility. Jessica@VisitFingerLakes.com (585) 394-3915 Carolina Taylor PR & Communications Manager Manages media relations to build awareness and engagement, and creates content to tell the Ontario County's story. Carolina@VisitFingerLakes.com (585) 394-3915 Chloe Davis Partner Engagement Coordinator Acts as the primary point of contact for community and tourism partners. Develops and delivers partnership programs, training, and educational resources. Chloe@VisitFingerLakes.com (585) 394-3915 Jaynee Straw Administrative Assistant Provides support for daily operations and visitor services. Jaynee@VisitFingerLakes.com (585) 394-3915 Board of Directors Members of our Board of Directors complete a self-evaluation annually. David Hutchings Chairperson Sonnenberg Gardens Lisa FitzGerald 1st Vice Chairperson Finger Lakes Winery Tours Charles Parkhurst Secretary Lyons National Bank Steve Fuller Treasurer Bristol Mountain Michael Kauffman Immediate Past Chairperson EASTVIEW Christopher Vastola Rep. Board of Supervisors Town of Canadice Lenore Friend Finger Lakes Community College Sherry Brahm-French Arbor Hill Grapery and ExploreNaplesNY Sheryl Mordini 1795 Acorn Inn Mark Gilbride Lazy Acre Alpacas Lori Proper The Lake House on Canandaigua Russ Kenyon Kenyon & Kenyon Mike Roeder Todd Plouffe Indus Hospitality Group Naved Amed Geneva on the Lake Jim Cecere Vinifera / Finger Lakes Goods About Us | Contact Us | Privacy Policy | Sitemap Finger Lakes Visitors Connection 19 Susan B. Anthony Lane, Canandaigua, NY 14424 (585) 394-3915 ® I LOVE NEW YORK is a registered trademark and service mark of the New York State Department of Economic Development; used with permission View Our Guides Looking for some Finger Lakes inspiration? Join Our Newsletter For all your Finger Lakes information and deals © 2025 Finger Lakes Visitors Connection"
    },
    {
      "url": "https://stagew.org/about-us/our-leadership-team/",
      "text": "Our Leadership Team | StageW HOME About Us What We Do Our Leadership Team Jobs Plan Education Plan Blog Select Page Contribute OUR LEADERSHIP TEAM Andy Gronik launched StageW™ for two reasons: To give the people of Wisconsin a voice, and to expose what is silencing that voice. He loves Wisconsin and wants to help make living here better for everyone, which is true of a lot of people but Andy is uniquely able to do something about it. Andy knows how to create jobs. He has done it. Download my Bio Andy Gronik, Founder & President Andy’s professional success has been in business. After college he worked with Quaker Oats before returning to Wisconsin to grow his dad’s company. In a short time he expanded his dad’s business to national prominence by fundamentally changing the way the company served clients and helping to create the standards used by banks nationwide to lend money on machinery and inventory. Eventually Andy cofounded his own appraisal, consulting, asset management and disposition companies and grew them to international significance. Andy’s business helped companies grow and create jobs by providing the services needed to borrow money and improve profitability. His reputation as an expert opened doors to travel across the world to promote ideas and standards to advance trade and education with other nations. Read More > Andy can have a thoughtful conversation with business leaders in over 100 industries. His deep understanding of their needs is the product of having worked with talented people throughout all aspects of thousands of manufacturing operations across the world. Here are just a few of Wisconsin’s major employers served by Andy’s companies during his 35-year career: • Allen Edmonds • Ariens Co (Simplicity) • Briggs & Stratton Corp • BRP (Bombardier) • Cargill Meat Solutions • Caterpillar (Bucyrus) • Con Agra Foods Inc. • Kraft Foods • Formost • General Electric Corporation • GE Healthcare • Grede • Grassland Dairy Products, Inc. • Harley-Davidson, Inc. • Johnson Controls • Joy Global • Kimberly-Clark • Ladish Company • Manitowoc Company • MarquipWard United • Mercury Marine • Miller Compressing • Oshkosh Corporation • Quad/Graphics, Inc. • Rexnord Industries • Sargento Foods, Inc. Andy created his first job in 2nd grade when he filled his coaster wagon with rocks and sold them door-to- door for a penny apiece. From there he caddied, washed dishes, bagged groceries, waited tables, swept factory floors, cleaned machinery and coached football. School wasn’t easy. He struggled with reading in particular, and barely made it into college. Once he got into college, however, he excelled and eventually found his way through UW-Milwaukee to the University of Georgia where he threw discus, setting the school record that he held until his teammates next throw 10 minutes later. Andy knows how important it is for schools to have the resources needed to reach every student. His struggles and successes in education are reminders of what is possible and what can be done. Wisconsin is home for Andy, his wife Mary and their two young children. He is committed to bringing people together who also love Wisconsin in order to see our state reach its potential. To bring unity, clarity and purpose back to our state. Center stage was built for you. Please get involved. Download my Bio Mark H. Iola, Chief Operating Officer Mark has dedicated his entire professional life to turning the spotlight on people so they have a voice. He fights every day for people who can’t fight for themselves. He helps kids find their way in life and helps fund their way to college. Mark knows how to bring people together and he knows how to make the quality of life better in Wisconsin. Read More > Mark began his law career after graduating from George Washington University in 1979 with a B.A. degree and the University of Oklahoma in 1982 with a J.D. degree. He immediately began fighting asbestos companies for his grandfather’s law firm, representing labor union workers in the early days of asbestos litigation. Mark has an extensive history representing asbestos cancer victims and their families who are seeking fair compensation for their injuries, as well as representing and supporting other law firms as they fight on behalf of mesothelioma victims. Mark has worked to provide educational opportunities to disadvantaged young people, serving as a Big Brother and founding board president of Big Brothers Big Sisters of Oklahoma. He has established the Mark H. Iola Scholarship to help little Brothers and Sisters pursue their educational goals when they graduate from the program. The scholarship program is one of the largest of its kind in the United States. A former high school and college debater, Mark was the executive producer of “Resolved,” an award-winning feature-length documentary film on high school debate. The movie has inspired kids around the world to get involved in debate programs and advance onto successful professional careers after college. He is active in DFW Pug Rescue, an avid alpine skier and a master at the preparation of smoked meats and BBQ sauces. Mark wants to help turn the spotlight on in Wisconsin. He sees the people of our state suffering the consequences of misguided policies and knows job growth and world-class education both begin with thought leadership. Mark sees this as a critical time and wants to give voice back to hard-working men and women so they are empowered to fight for a better future in our state. He has stepped onto StageW as a shining example of a person who wants to see Wisconsin shine. Mark gets involved. Mary Gronik, Secretary/Treasurer Mary knows all about giving people a voice. She regularly works with young women to help foster confidence, advance their job skills and prepare them for successful lives. As a lifetime Wisconsin resident and mother, Mary believes in a brighter future for Wisconsin and wants to make it a better place to live, work and receive the world’s best education. Read More > Mary excelled during her 15-year professional career as a public relations consultant, serving well-known companies throughout Wisconsin and the United States. As a college student, steel-toe boots were required for her first job at the Oak Creek Power Plant where she distributed parts and supplies to mechanics from the storeroom. A classically trained pianist, Mary worked as an accompanist in high school and a piano teacher in college. Mary currently serves on the board of the Miss Wisconsin Organization, a state preliminary for the Miss America Organization, one of the nation’s leading achievement programs and the world’s largest provider of scholarship assistance for young women. Almost all of the young women competing for the title of Miss Wisconsin receive scholarship grants to further their education. By being crowned Miss Wisconsin 1985, Mary was able to graduate debt-free from the University of Wisconsin-Milwaukee with a bachelor’s degree in business administration. Mary has served as the southeastern Wisconsin regional field director for the Miss Wisconsin Organization for more than 20 years. In 1988, she was selected by the United Service Organization and Department of Defense to travel throughout the Mediterranean, meeting and entertaining military troops. In 2002, Mary left her career to start a family. Mary and Andy are proud parents of two young children. Mary was born and raised in St. Francis, Wisconsin. The Stage is Yours. Share Your Voice. Explore Our Thoughts On CREATING JOBS EDUCATION Contact Us PO BOX 170350 MILWAUKEE, WI 53217 414.410.9988 Explore Our Thoughts On CREATING JOBS EDUCATION Contact Us PO BOX 170350 MILWAUKEE, WI 53217 414.410.9988 Bridging the Political Divide™ © StageW Inc. 2016 All Rights Reserved. Contributions to StageW are not tax-deductible. “StageW trademarks are federally registered trademarks owned by StageW, Inc. StageW claims trademark rights in the following: StageW; W-Alive; Wisconsin Alive; Bridging the Political Divide. Any unauthorized use is expressly prohibited.”"
    },
    {
      "url": "https://www.rocknriverwalk.com/about",
      "text": "About — Rock'n Riverwalk About Schedule Sponsor Vendor Contact Us Back 2025 Sponsors Sponsorship Packages About Schedule Sponsor 2025 Sponsors Sponsorship Packages Vendor Contact Us About Rock'n Riverwalk Rock'n Riverwalk is downtown Stuart, FL's signature concert series presented by Stuart Main Street and the Historic Stuart Downtown Business Association . These non-profit organizations are able to host the event at no charge to the public thanks to generous sponsors, attendee donations and additional live music events that benefit Rock'n Riverwalk. To learn more visit www.stuartmainstreet.org or email director@stuartmainstreet.org . Bring your children, pets, family and friends. For easy parking, ride the free Sailfish Shuttle from Osceola, Sailfish or Kiwanis Park. Rock'n Riverwalk gives back to the community Stuart Main Street’s mission is to create and promote a positive downtown experience for residents, businesses, and visitors. And by partnering with the Downtown Business Association, the vision for Rock'n Riverwalk continues to provide the concert series at no charge to the public and to increase the funds it raises to be able to host additional events for the public at no charge. Support our cause today. GET INVOLVED Learn about other events presented by Stuart Main Street About Downtown Stuart Come to Downtown Stuart for Rock'n Riverwalk and stay for so much more! Downtown Stuart was voted America’s Most Beautiful City by America in Bloom and one of America's Happiest Seaside Towns by Coastal Living Magazine . Shop, dine and experience more than 50 locally-owned shops, restaurants and galleries in a charming Old Florida setting. History of Rock'n Riverwalk In 2000, Rock'n Riverwalk began as the Lunchbox Concert Series on each Friday afternoon from October through June. It was launched by City of Stuart, Stuart Main Street, the Historic Downtown Business Association and the Stuart Green Market as a seasonal event to help increase visitors to the then struggling Downtown Stuart area. Over time, the event's popularity grew and the downtown traffic increased. The event was renamed RiverWalk Jazz Series and moved to Sundays, but remained seasonal. Stuart News joined as the presenting sponsor, helped produce and promote the shows, helped attract larger crowds and received six awards for their efforts from the Florida Festival & Events Association . The Florida Inland Navigation District also played an integral role in supporting the evolution of Rock'n Riverwalk by awarding a grant that funded the iconic sail shades that cover the Riverwalk stage. The beautiful shade structure has made the venue more comfortable for musicians and fans, especially during the hotter summer months. Hours Event About Line-up FAQ Sponsor Become a Sponsor Our sponsors Promoted by UBU Brands"
    },
    {
      "url": "https://www.rocknriverwalk.com/vendor",
      "text": "Vendor — Rock'n Riverwalk About Schedule Sponsor Vendor Contact Us Back 2025 Sponsors Sponsorship Packages About Schedule Sponsor 2025 Sponsors Sponsorship Packages Vendor Contact Us Vendor Opportunities Only 7 spots available! Great opportunity! No duplicate vendor types or offerings will be accepted. Basic Info: Vendor must be on site no later than 12pm, setup by 12:30pm prior to show beginning at 1pm and must provide their own 10x10 white tent with weights. Vendors are required to stay the duration of the event. We do not supply power and generators are not permitted. Vendor must agree to be \"Green\" and comply with the City of Stuart's \"no-plastics\" ordinance, and be licensed and insured. Current weekly committed Vendors include: Pawgistics- CBD Pet treats Stuart Psychic Margurie's Candy Cottage Pricing: $35/week for craft or artisan committed weekly vendors. $50/week for on-site food or vendor that wishes to be on rotation. $100/week for services (like businesses wishing to market their business such as lawyers, insurance agents, health & wellness, etc.). If wishing to schedule multiple dates, a discount will be applied. Quarterly commitment is required in-season (October-March). Payment is requested in advance each month. Cash, check, or credit cards are accepted. *Payments are non-refundable and no credits will be issued for missed dates. **The event is outdoors. Vendors are expected to be prepared for all kinds of weather. No rain dates are scheduled, and no refunds will be issued. To Apply, visit: www.stuartmainstreet.org/rockn-riverwalk Questions? Email director@stuartmainstreet.org . Frank, owner of Sea Turtle Concessions slingin fresh hot dogs. The Naturals CBD goodies Bohemian Mermaid handcrafted jewelry Snack’s Homemade Pet Treats (they also have some for cats!) The Willow Star wooden wands Doux Kitty Botanicals all natural soap Photo Credit: Alchemical Photo for Stuart Main Street Hours Event About Line-up FAQ Sponsor Become a Sponsor Our sponsors Promoted by UBU Brands"
    }
  ]
}