{
  "fuentes": [
    {
      "url": "https://www.rvfarm2school.org/staff-board",
      "email": "bella@rvfarm2school.org"
    },
    {
      "url": "https://www.rvfarm2school.org/staff-board",
      "email": "deanna@rvfarm2school.org"
    },
    {
      "url": "https://www.rvfarm2school.org/staff-board",
      "email": "ellie@rvfarm2school.org"
    },
    {
      "url": "https://www.rvfarm2school.org/staff-board",
      "email": "kristin@rvfarm2school.org"
    },
    {
      "url": "https://www.rvfarm2school.org/staff-board",
      "email": "rebecca@rvfarm2school.org"
    },
    {
      "url": "https://www.rvfarm2school.org/staff-board",
      "email": "sheila@rvfarm2school.com"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.24@2x-138x300.png"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.24@2x-138x300.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.24@2x-470x1024.png"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.24@2x-470x1024.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.24@2x.png"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.24@2x.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.51@2x-142x300.png"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.51@2x-142x300.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.51@2x-484x1024.png"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.51@2x-484x1024.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.51@2x-600x1269.png"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.51@2x-600x1269.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.51@2x.png"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "cleanshot-2022-12-19-at-21.35.51@2x.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "email": "john@growthsquad.com"
    },
    {
      "url": "https://rockinhranch.farm/events/luncheons/",
      "email": "cleanshot-2022-12-13-at-20.40.09@2x.png"
    },
    {
      "url": "https://rockinhranch.farm/events/luncheons/",
      "email": "info@rockinhranch.farm"
    },
    {
      "url": "https://rockinhranch.farm/events/luncheons/",
      "email": "john@growthsquad.com"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x-233x300.png"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x-233x300.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x-600x774.png"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x-600x774.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x-768x990.png"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x-768x990.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x-794x1024.png"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x-794x1024.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x.png"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "cleanshot-2022-10-25-at-20.57.40@2x.png.webp"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "email": "john@growthsquad.com"
    },
    {
      "url": "https://rockinhranch.farm/contact-us/",
      "email": "info@rockinhranch.farm"
    },
    {
      "url": "https://rockinhranch.farm/contact-us/",
      "email": "john@growthsquad.com"
    },
    {
      "url": "https://sanbornmills.org/staff-and-board/",
      "email": "info@sanbornmills.org"
    },
    {
      "url": "https://rockinhranch.farm/weddings/availability/",
      "email": "john@growthsquad.com"
    },
    {
      "url": "https://rockinhranch.farm/events/",
      "email": "info@rockinhranch.farm"
    },
    {
      "url": "https://rockinhranch.farm/events/",
      "email": "john@growthsquad.com"
    },
    {
      "url": "https://rockinhranch.farm/",
      "email": "john@growthsquad.com"
    },
    {
      "url": "https://rockinhranch.farm/faqs/",
      "email": "john@growthsquad.com"
    }
  ],
  "mails": [
    "bella@rvfarm2school.org",
    "cleanshot-2022-10-25-at-20.57.40@2x-233x300.png",
    "cleanshot-2022-10-25-at-20.57.40@2x-233x300.png.webp",
    "cleanshot-2022-10-25-at-20.57.40@2x-600x774.png",
    "cleanshot-2022-10-25-at-20.57.40@2x-600x774.png.webp",
    "cleanshot-2022-10-25-at-20.57.40@2x-768x990.png",
    "cleanshot-2022-10-25-at-20.57.40@2x-768x990.png.webp",
    "cleanshot-2022-10-25-at-20.57.40@2x-794x1024.png",
    "cleanshot-2022-10-25-at-20.57.40@2x-794x1024.png.webp",
    "cleanshot-2022-10-25-at-20.57.40@2x.png",
    "cleanshot-2022-10-25-at-20.57.40@2x.png.webp",
    "cleanshot-2022-12-13-at-20.40.09@2x.png",
    "cleanshot-2022-12-19-at-21.35.24@2x-138x300.png",
    "cleanshot-2022-12-19-at-21.35.24@2x-138x300.png.webp",
    "cleanshot-2022-12-19-at-21.35.24@2x-470x1024.png",
    "cleanshot-2022-12-19-at-21.35.24@2x-470x1024.png.webp",
    "cleanshot-2022-12-19-at-21.35.24@2x.png",
    "cleanshot-2022-12-19-at-21.35.24@2x.png.webp",
    "cleanshot-2022-12-19-at-21.35.51@2x-142x300.png",
    "cleanshot-2022-12-19-at-21.35.51@2x-142x300.png.webp",
    "cleanshot-2022-12-19-at-21.35.51@2x-484x1024.png",
    "cleanshot-2022-12-19-at-21.35.51@2x-484x1024.png.webp",
    "cleanshot-2022-12-19-at-21.35.51@2x-600x1269.png",
    "cleanshot-2022-12-19-at-21.35.51@2x-600x1269.png.webp",
    "cleanshot-2022-12-19-at-21.35.51@2x.png",
    "cleanshot-2022-12-19-at-21.35.51@2x.png.webp",
    "deanna@rvfarm2school.org",
    "ellie@rvfarm2school.org",
    "info@rockinhranch.farm",
    "info@sanbornmills.org",
    "john@growthsquad.com",
    "kristin@rvfarm2school.org",
    "rebecca@rvfarm2school.org",
    "sheila@rvfarm2school.com"
  ],
  "nombre_sitio": "rockinhranch.farm",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.rvfarm2school.org/staff-board",
      "text": "Staff & Board — Rogue Valley Farm to School Home About About Us Staff & Board Newsletter Archive Archivo De Boletines En Español Contact Us New! Blog Education Programs Summer Camp School Partnership Program Harvest of the Month Farm Field Trips Preparing for A Farm Field Trip Resources for Educators & Parents Cafeteria Support Local Procurement Harvest of the Month Regional Hub Gatherings & Trainings Get Involved How to Get Involved Donate Volunteer Advocate Sponsor Attend an Event Shop Donate Now Home About About Us Staff & Board Newsletter Archive Archivo De Boletines En Español Contact Us New! Blog Education Programs Summer Camp School Partnership Program Harvest of the Month Farm Field Trips Preparing for A Farm Field Trip Resources for Educators & Parents Cafeteria Support Local Procurement Harvest of the Month Regional Hub Gatherings & Trainings Get Involved How to Get Involved Donate Volunteer Advocate Sponsor Attend an Event Shop Donate Now Meet Our Team About About Us Staff & Board Newsletter Archive Archivo De Boletines En Español Contact Us New! Blog These people are the heart, soul, and brain power behind all RVF2S programs. Their expertise and enthusiasm leads to innovative, exciting programs for students throughout the valley. Staff rebecca@rvfarm2school.org Rebecca Slosberg - Co-Executive Director of programs & Staff Rebecca loves any excuse to be outside and feels lucky to have a career sharing this love and enthusiasm of our local farms and gardens.  Rebecca has worked as an interpretive park ranger and environmental educator all over the country from Alaska to Florida.  She spent several years as an educator at an outdoor science school in California and moved to the Rogue Valley to get her Masters degree in environmental education at Southern Oregon University.  Rebecca’s deep love of connecting kids to their food and the experience of being out on a farm in a garden keeps her passionate for this work. She enjoys being out in the Rogue Valley, whether it’s hiking, skiing, gardening, backpacking, chasing after her children or helping kids get their hands dirty. kristin@rvfarm2school.org Kristin pew - Co-Executive Director of operations and development Kristin grew up with a close connection to the outdoors and a great appreciation for nature. She spent many of her young adult years traveling the world and developing a deep love for regional foods and the cultural connection between place and cuisine. Kristin enjoys spending hours getting lost in outdoor markets and purchasing local foods directly from producers, and upon her return to living in the United States, she realized how disconnected most people have become from their food sources in this country. After spending many years in high-level management and business development she has decided to bring her talents to the non-profit sector and has found her passion with Rogue Valley Farm to School. ellie@rvfarm2school.org Ellie thompson - Education program manager Growing up on a small farm in Eugene, Oregon, Ellie developed a love for farming and exploring at a very young age. On any given day during her childhood, she could be found helping her parents harvest veggies from the family garden, eating all of the raspberries in the berry patch, planting seeds in her own little flower garden and collecting insects to observe and marvel at. Her love for the Earth, and her passion for creating opportunities for kids to explore and develop their own connections with nature, drove her to pursue a master’s degree in environmental education at Southern Oregon University. Little did she know that she would end up falling in love with the Rogue Valley! In her time off, Ellie enjoys camping, kayaking, and strolling about the forest with a camera and a native plant guide in hand. bella@rvfarm2school.org Bella Grubb, Procurement & Nutrition Manager Bella was originally born in Virginia but considers herself a Southern Oregon Native since moving here with her family 23 years ago - and ever since, she has delighted growing up in the wonderful breadbasket that is the Rogue Valley. Participating as a neighborhood coordinator with her family for the Medford Food Project in high school and overall being a seeker and consumer of local food, she has always taken an interest in where food comes from and how we relate to our plates at home and within our larger communities and ecosystems. Her higher education career saw her first studying Early Childhood Education, then a brief stint in an agricultural Terroir program before finally receiving her degree in Integrative Health Sciences where her studies focused on alternative health practices and philosophies, regenerative agriculture, nutrition and birth. She is delighted to now be a part of the RVF2S team where all of her interests and offerings can come together. In her free time, Bella enjoys reading, artisanal baking, expanding her homesteading skills, studying food cultures, nutrition, herbalism and homeopathy, and partner dancing from salsa to swing! Taylor Madden - Communications & Volunteer Lead, School Partnership Educator Taylor grew up steeped in all that the great outdoors offers. As a young girl, she spent all of her time outside in her family’s fruit orchard, exploring the mountains with her siblings, and learning about the natural world from her family of mountaineers and gardeners. This love for the outdoors carried over into adulthood, and Taylor’s favorite pastime is anything that involves being out in the fresh air. Her undying love for literature led her to SOU to secure a BA in English, and she has been an educator in the Rogue Valley ever since. Taylor is passionate about the intersection of academia and nature, and is ecstatic to join Rogue Valley Farm to School to help facilitate this magic for up and coming generations. deanna@rvfarm2school.org Deanna Waters-Senf, Farm 2 Cafeteria Coordinator Deanna grew up on a dairy farm in Aotearoa/New Zealand. This inculcated a strong work ethic, respect for other creatures and a love of the outdoors. She completed culinary training and apprenticeships in 1996. Following that, she cooked for 25 years in NZ, UK and USA, in a variety of restaurants, bakeries, field kitchens, game lodges, dives, vineyards, festivals and events. She specializes in farm-to-table and vegetarian cuisine. She was a Jackson County CASA (court appointed advocate for children) for 5 years. In 2019 she was elated to join RVF2S as a harvest educator. She manages 20 acres of pollinator habitat with goats, llamas and chickens. Her hobbies include: wild food foraging, hiking, story-telling, reading, music and messing around with recipes. Lela Miatke - Tasting table coordinator Born and raised in Ashland Oregon, Lela developed a passion for food even before she was old enough to use the stove. She grew up being involved in the family garden, and learned to cook with seasonal produce at a young age. As a teenager, she connected the dots between her culinary interests and her health interests, and dove headfirst into the world of nutritional science. Having graduated from Southern Oregon University with a Bachelor of Science degree of her own design, Lela plans to continue her education in order to become a nutritionist and help people heal their relationship with food. Lela’s reverence for the natural world and enthusiasm about local food shine through to all of her endeavors. When she’s not in the kitchen, Lela enjoys backpacking, wild foraging, reading a good book, and playing fiddle in a local bluegrass band. Meghan Murphy - Lead school partnership Educator Meghan grew up in the suburbs of New York City where there existed a disconnect between food and where it comes from. It wasn’t until attending graduate school for a Masters in Nutrition in London, England that Meghan became involved in a sustainable garden program focused around bringing community together through healthy, local foods. She believes that children learn best outside and is excited to be creating new opportunities for kids to be exploring and connecting to nature. Meghan moved to the beautiful Rogue Valley in 2017 to pursue the things she loves including backpacking, trail running, kayaking, frolicking through fields with her dog or laying in the grass with a book! Elise Pfrommer - lead School Partnership Educator Elise grew up in the suburbs of Boston, Massachusetts and has always enjoyed being outside and playing in the dirt. She moved to Oregon to pursue a degree in Environmental Studies at Lewis and Clark College and immediately fell in love with the Pacific Northwest. She is a passionate educator who has taught in a variety of settings, from the rugged alpine zone to school gardens to more traditional classrooms. A recent transplant to the Rogue Valley, Elise is very excited to immerse herself in the community and learn about the local food system. When she isn't working, Elise enjoys backpacking with her partner and dog, doing acrobatic yoga, and participating in trivia competitions. Ryan Idso-WeisZ - School Partnership Educator As a child growing up in the Midwest, Ryan spent much of his time in the woods, ponds, and his family's garden. Coming home with jars of tadpoles, rocks, and pockets full of dirt. His zest for adventure and love of the natural world knew no end. Now as an adult, Ryan's love of nature carries on and he is still coming home with pockets full of dirt, but this time it's from his farm. Ryan dedicated much of his professional life to renewable energy and tending to the planet. In 2017 Ryan moved to the Rogue Valley from Minnesota. There he had been the manager of a grant supported county farm. That farm donated 100% of the produce to local food shelves, shelters and provided education for the community. He, along with his family, started a series of community gardens dedicated to providing access to health and education through gardening. His commitment to improving the world is both a deeply professional and personal value. He and his family are dedicated to land conservation, regenerative practices, pollination efforts, food preservation and all things farm life at Itty Bitty Acres in Southern Oregon. Amy Bartlett - School partnership educator Amy grew up in the Rogue Valley, and learned an appreciation for our beautiful outdoors,and great climate for gardening early on from her family. Some of her favorite things to do are go out hiking and camping with her family, work in her garden, and visit local farms. She’s wanted to be an educator since 4th grade, and pursued both her Bachelors and Masters in Elementary Education to further those goals. There’s something special about being outdoors with students, though, and she’s excited to now be working for a program that lets her be outside and hands on with students, engaging them with their local community and environment! Eduardo Tovar - School partnership educator Eduardo grew up in the Rogue Valley and outside of school, he was always playing sports outside or catching bugs. His father worked at an orchard in his childhood, so early on he made a connection with the fruit and vegetables his father would bring home. In the late summer/early fall, they would always have an abundance of pears. Then there were times when they would harvest asparagus. Eduardo’s love for outdoor education grew when he worked at an outdoor summer camp, getting to be in nature and seeing the youth make a connection with the outdoors. Since then, he has had the opportunity to work in public schools and outdoor education settings. In his free time, you can find Eduardo birding or running. Anna Boesch - Seasonal Harvest Meal Educator Anna's passion for farming and education started in college, which inspired her to create her own major called \"Connecting Communities with the Environment.\" After graduating, she taught garden education to K-8 students. She worked in Fairbanks, Alaska where she started a new school garden at a middle school and ran a summer job program for students in the garden. Anna has also worked as a garden educator in San Jose, CA where she worked with middle school students on a weekly basis and started a summer camp for elementary school students. As much as Anna loved teaching, she felt it was time to expand her skill set and learn more about farming. She and her husband leased an acre of land in Santa Cruz and started their own Community Supported Agriculture farm. After a successful year, Anna and Jeff decided to start their own farm, which led them to their 50 acre farm home in Gold Hill, Wandering Roots Farm. Rachel durling - Seasonal Harvest Meal Educator Rachel has always felt a deep desire to care for the earth, leading her to complete a bachelor's degree in Environmental Studies. While interning for the National Park Service and National Forest Service doing field work and research, she discovered her ideal work environment was immersed in the tactile world of nature. Rachel's adventurous spirit, and her call to further her learning and discovery through nature's classroom and other cultures, led her to spend years living in South America. There, she lived in ecovillages learning permaculture and general farming techniques, taught yoga and English as a foreign language, and became fluent in Spanish. She has spent the last several years raising her son in the beautiful Rogue Valley and working as a guest teacher in public schools in the Ashland, Phoenix/Talent, and Medford school districts. Rachel is thrilled to be back in nature's classroom with the amazing team at Rogue Valley Farm to School, sharing the gifts of the earth with local children. board of directors Kathy Roselli -  filmmaker & child development specialist Board chair - events & development committee Kathy is a retired pediatric physical therapist & local filmmaker, living in Ashland with her husband Rand since 2011. In 2020, she produced “Farm to Families” to share the Foodbox Program with the community & the world. Kathy observed RVF2S and Fry Family Farms’ dedication to finding ways to provide as many food insecure families as possible with weekly fresh produce. Looking to volunteer for an organization which reflected her commitment to children and families as well as to eating healthy food, a lifelong passion, Kathy was so inspired by her immersive experience with RVF2S staff and community volunteers, she later volunteered to join the Board. She is an avid reader, traveler, hiker and skier and has a commitment to introduce each of her four grandchildren to snow sports - even though they live in Texas and North Carolina. Carli harvey - CPFA Partner, KDP Certified Public Accountants, LLP Board Treasurer - finance committee Carli grew up in Jacksonville, OR. She graduated from OSU with dual degrees in International Business and Business Management. She built a career with a fortune 500 company managing teams and company sales in Denver, CO, Kansas City, MO, and Seattle, WA. In 2019 she was thrilled for the opportunity to return home and to continue her journey in financial services for KDP Wealth Management. Carli is now a Partner, practicing Wealth Advisor, Chartered Financial Consultant, and Certified Plan Fiduciary Advisor.  She predominantly works with business owners here in the Rogue Valley. She is an active member of the Southern Oregon Estate Planning Council. She is passionate about empowering women in personal finance, helping owners diversify wealth outside of their business and prepare for life after the sale of their business, and helping families prepare for estate transfer that is aligned with their values. By her roots she was raised by a Minnesota pig farmer and California Rancher. She loves cooking from scratch but refuses to ever follow a recipe and therefore burns a large number of meals. Nothing makes her happier than providing nourishing food to her toddler boys. She was so inspired by RVF2S farm field trips, the curiosity and goofiness of children, and the mission of connecting them to their food. PHILIP YATES - Retired social services director board Co-chair Emeritus - finance & development committee Philip retired in 2019 after working for ACCESS for 27 years, 6 years as Development Director and 21 years as Nutrition Programs Director.   During that time Philip expanded the capacity and work of the ACCESS Food Bank in response to the increasing food insecurity in Jackson County.  In addition, he helped create many Food System Programs at ACCESS, including developing a Mobile Food Pantry, establishing a Jackson County Community Food Assessment, creating Food Share Gardens, Cooking Classes and partnering with many organizations in the community.  Philip also served two terms as the Chair of the Statewide Oregon Food Bank Network.   Prior to that Philip was a Waldorf Teacher at the Waldorf School of the Rogue Valley when it was in Jacksonville.  Philip loves to travel, hike, cycle and learn about different cultures. Amber Fry - local Farmer & business owner events committee Amber Fry is a second generation Rogue Valley Farmer and manager of the Fry Family Farm store, distribution hub, and CSA. Her parents, Suzi and Steve Fry, started farming in the Rogue Valley in 1990. What was then a couple acres on Wagner Creek Road in Talent has expanded to more than 90 acres of vegetables, flowers and berries being grown in Talent, Phoenix, Medford and Ashland. Growing food organically allows Amber to raise her children in a healthy environment, steward the land, and contribute to their community. After growing up working on the farm, Amber is proud to carry on the family tradition and partner with Rogue Valley Farm to School to increase access to healthy local produce. In her free time between harvests, she can be found enjoying the tranquil beauty of Southern Oregon, camping, hiking, and celebrating life with her family and friends. Mikel brunner - middle school teacher events committee Originally from Crescent City, California Mikel fell in love with playing outdoors, hiking through the coastal redwoods, rafting the Smith River and surfing as much as possible. He attended Southern Oregon University for undergraduate and graduate degrees. He has been teaching mathematics at McLoughlin Middle School since 2013. He is the head of the math department and coaches cross country, track and field, basketball, MathCounts and Pentagames. He sees the dire need for environmental and outdoor incorporation in the traditional classroom and loves the partnership between RVF2S and schools all over southern Oregon. When he is not teaching or coaching, he loves spending time with his family in all of the outdoor beauty Oregon has to offer. David Tourzan - Public school teacher & Business owner Board chair emeritus - FINANCE & development committee David Tourzan has taught middle school math and science for over 20 years, with an emphasis on environmental education and project-based learning. He was co-founder of the Outdoor Discovery Program at Talent Elementary, and is a regular volunteer with Rogue Valley Mentoring, the NICU, and Jackson County Fuel Committee. David has extensive contacts with local environmental groups and has collaborated with Lomakatsi, Coyote Trails, Bear Creek Watershed Education Partners, SOU, OSU Extension Service, RVCOG, Jefferson Nature Center, Salmon Watch & Kids Unlimited. As a business owner, David founded Rising Phoenix Biofuels. David coached both his son's soccer teams and involved his family in stream monitoring, watershed enhancement, and environmental projects. Say hi to the whole Tourzan crew up in the snow, biking the trails, or at the next community event. Advisory Members dan thorndike - emeritus board Events committee Dan is a licensed attorney, and has been pro bono legal support for Rogue Valley Farm to School since its inception, giving generously of his invaluable expertise. He has served formally on the board, volunteered at all events, and is always available to answer questions and keep us up to date with legalities. His family business, Medford Fabrication, is a long standing local employer and you can see Dan riding his bike to work, rain or shine, from Ashland to Medford, a stretch of over 20 miles each way. He loves to kayak, to coach the high school Nordic team, to tend to his garden, play with his family and to serve on a myriad of non-profit organizations for the betterment of his native State of Oregon. Joan Ewer Thorndike - emeritus board events committee Joan is a founding and long time board member of RVF2S.  She witnessed and helped in the growth and evolution of this organization from its grassroots beginnings to its current vibrant, well managed incarnation with deep roots in our community at large.  For almost 30 years Joan has managed Le Mera Gardens , a 10 acre commercial flower farming operation which grows certified organic seasonal fresh flowers for the people of southern Oregon and northern California. She remains a devoted admirer of Rogue Valley Farm to School and its effect on our children’s access to farm raised fresh food. Josh Bakke - EMERITUS BOARD Finance Committee Josh is a CPA and Rogue Valley native. He received his bachelor’s degree at Southern Oregon University in Ashland, Oregon, where he has lived for the last eight years. Josh has worked for Moss Adams, LLP since 2013 and consults with farmers and cooperative organizations up and down the west coast. Josh is instrumental in bringing financial stability and accurate cash flow projections to RVF2S, is a spirited volunteer at events, and makes budgets and spreadsheets understandable for all. Josh and his two brothers grew up with a love for the outdoors, spending winters on top of Mt. Ashland, and summers hiking, fishing, and rafting southern Oregon's rivers and streams. If you're ever looking for him on a weekend that's where you'll find him! Jennifer Buti - emeritus board FINANCE COMMITTEE Jennifer is a public accountant with Moss Adams, LLP. Raised in the Rogue Valley, she’s called Southern Oregon home since 1995. She received her bachelor’s degree in Business with an accounting focus from Southern Oregon University. Jennifer enjoys spending time hiking, fishing, camping, riding dirt bikes with her family, and sitting outside with a good book. Martin mares - EMERITUS BOARD Martin Mares is a youth and family therapist at local mental health agency Kairos and is a former school counselor in the Medford school district. Being a former college athlete Martin enjoy's sharing his knowledge on health and nutrition. He and his wife own a local food truck “JUEGO” selling delicious and healthy smoothies and snacks, and organizing educational and community events. Martin brings his school, fitness and nutrition background as well as his experience working in the mental health sector to the Rogue Valley Farm to School board. Martin enjoys the outdoors, traveling and fun adventures. He is originally from El Monte California, where community parks and recreational activities had a major impact on his upbringing and passion for community organizations supporting youth and families. Justin Adams - emeritus Board Justin Adams is a family physician at La Clinica Wellness Center and serves as La Clinica’s chief medical officer. He and his wife have also raced in the Siskiyou Challenge almost every year. Justin brings his medical knowledge as well as his experience in working in the nonprofit sector to the Rogue Valley Farm to School board, in addition to his dedication to health and wellness and to supporting a thriving local community. Dr. Adams grew up in Ashland, where he now lives with his wife and two children. He is a mountain biker, runner, skier, and snowboarder, and enjoys competing in marathons and triathlons and anything else that has him moving in the outdoors. Lebeau potgeiter - emeritus board Lebeau Potgeiter is a financial advisor, entrepreneur, small business owner, parent, coach, and concerned citizen utilizing his experience and skills to create a better present and future for his family, community and the world. Born in South Africa, raised in England and raising his 3 children in Southern Oregon and Michigan, he brings a global perspective to solving local issues. He is a local business owner and you can find him on the soccer pitch, volunteering, or out in nature working out. Amelia Bueche - emeritus board Dr. Amelia Bueche is a physician, parent, athlete, coach, writer, entrepreneur, and founder and director of This Osteopathic Life. She brings her experience and training, residency, board certification and practice in Neuromusculoskeletal Medicine and Osteopathic Manipulative Medicine. You can try to catch her in a triathlon, running her various businesses, or enjoying fresh air with her 3 great kids. Carmen proffitt - EMERITUS board Carmen took advantage of growing up in the San Francisco Bay Area by indulging in the diverse and delectable foods that were at her fingertips. Passionate about combating mental health and social issues, she pursued her bachelor of science in psychology at SOU with her senior capstone at Maslow Project focusing on art therapy. Carmen increasingly values education around the nutritional benefits, farming practices, and environmental impacts of the food she loves so much. She’s an avid volunteer in the community and brings her passion and technical skills to the board. Carmen rejuvenates by making pottery, being surrounded by nature, and trying new things. Elishia Tucker - EMERITUS BOARD Elishia has been obsessed with food, and the very best quality food, since she can remember. She grew up in Canada, eating homegrown produce and wild Salmon from an early age. She was eating kale way before it was cool. Her fascination with food turned her into an intrepid traveler, always seeking the next flavor, kitchen implement, and techniques. This passion led her to far-flung parts of Indonesia and learning how to cook over a wood fire in a kitchen with dirt floors, to studying Japanese cooking with sushi chefs who only speak Japanese to working in the kitchens of big fancy restaurants and tiny, humble eateries in New York City and San Francisco. She is always lending her efforts to establishments, organizations and projects that focus on organic and sustainably sourced ingredients.  She studied at the Institute for Integrative Nutrition and The Natural Gourmet Cookery, both in New York City. She can be found hiking, strolling the farmer's market, teaching kids cooking classes, designing kitchens, or planning her next adventure. Deborah Gordon - EMERITUS BOARD Deborah completed her medical and family practice residency training through the University of California at San Francisco and the Family Practice Center in Santa Rosa, California. She was drawn to the beauty of the Rogue Valley as well as the outdoor and cultural opportunities we enjoy here. Deborah moved here in 1985 as the first Medical Director for the Clinica Del Valle, then called Clinica Azteca. Her current medical practice incorporates Classical Homeopathy, Family Practice, hormonal and nutritional therapies at Madrona Homeopathy in Ashland. Ever since she learned to garden during a medical school rotation in Takilma, Deborah has valued fresh, homegrown and organic food. A late in life introduction to competitive rowing sparked her interest in combining challenging athletics with a support for farms, and thus was born the idea of the Siskiyou Challenge, RVF2S’s largest community event. She is still rowing competitively as well as gardening and raising chickens for eggs at her home in Talent. Robin Pike - EMERITUs BOARD Robin is a native of West Linn, Oregon, which was previously a rural suburb of the Portland area, now developed. She received a bachelor’s degree in Spanish from the University of San Francisco, and completed medical school, residency and fellowship training at the University of California, Davis. She has lived in the Rogue Valley since 2001, and is a practicing pathologist at several regional hospitals and at a private laboratory, Vista Pathology, in Medford. She has two grown daughters who attended Ashland schools. She is an avid and active supporter of the local farming community, and has raised chickens, lamb and beef on property near Emigrant Lake. Her passionate board service, caring attitude, and home-baked cookies for the Siskiyou Challenge will always be remembered. For fun, Robin enjoys cycling, rowing, hiking, her two dogs, and cooking and consuming the wonderful foods produced in the Rogue Valley. Erik GlattE - EMERITUS BOARD Erik is an attorney, father, husband and community advocate. Erik received his undergraduate degree from the University of Puget Sound in 1985 and graduated from the University of Oregon School Of Law in 1992. Erik joined the law firm Huycke O'Connor Jarvis, LLP, as partner, in 2011 where he continues to practice law with a focus on elder law, business law, civil litigation and estate planning. Erik enjoys the outdoors with his family whether they are rafting down the Rogue, skiing, biking, fishing or spending time on their small farm in Talent, Oregon. Erik and his family are active in the community and are proud to be involved in the future of the Rogue Valley. Erik is a past member of the Siskiyou School Board where he was instrumental in creating and expanding the school to its current stature. He is a past member of the US Rowing Team and continues to compete in rowing for the Ashland Rowing Club. christina ammon - emeritus board Christina is a child of the 70’s and grew up eating TV dinners and fast food in front of the television set. Her eating habits greatly improved after she took a job managing the vegetable garden at Eagle Mill Farm in Ashland in 1998. During her eight years there, the owner Ron Roth taught her about growing food, eating well, and enjoying food with friends. Inspired by Ron's tradition of \"pumpkin tours\" for the schools each fall, she began to invite classrooms to get more involved in the farm's activities. Alongside volunteers, the kids helped plant, tend, harvest, and cook with farm vegetables.  To secure funding for the growing project, Christina (and Jeanine Sturm!) asked attorney and beloved community member, Dan Thorndike, to help them apply for 501(c)3 status. Dan happily agreed--even waiving his attorney fees in exchange for fresh picked raspberries from the farm. She likes to bike, paraglide and travel in her van around the world, but her heart still has roots in the Pacific Northwest. www.deeptravelworkshops.com DANA YEARSLEY - EMERITUS BOARD Dana was an early board member, teacher, and volunteer with the Eagle Mill Farm Education Project. She helped dig garden beds, brought kids out to pumpkin harvests, and helped establish the early non-profit organization that became Rogue Valley Farm to School.  She competed in three sports at SOU when she came to Ashland in 1977.  Before graduating with a degree in literature, she also suited up for the women's basketball team and won the 1981 NCWSA regional tennis tournament at the No. 3 singles position to qualify for the national tournament. She continues to teach and is active in community organizations. JEANINE STURM - EMERITUS BOARD Jeanine was a founding member of Eagle Mill Farm Education Project and an essential element in its development into Rogue Valley Farm to School. From volunteering at the farm, to researching administrative structures, and forming a 501c3, Jeanine did it all. The early days were all hands on deck, and Jeanine was always ready to work. She owns and runs This Seasons Color, which is a local non-toxic landscape company and continues to contribute to local causes. RON ROTH - EMERITUS BOARD Ron is co-owner of Eagle Mill Farm, and an early supporter of Rogue Valley Farm to School by donating his land for our first pumpkin tours and harvest meals. Always willing to lend a hand, or a home grown bottle of wine, Ron has donated countless hours and assets to help build our vision. He is a visionary himself and has long supported local non-profit organizations, including using his land for the woodlot for Jackson County Fuel Committee and community farmers. Rogue Valley Farm to School might not exist today if not for Ron’s generosity over many years. barbara heyerman - emeritus board Barbara was board chair of Rogue Valley farm to school for several years while also teaching at a local public school. She volunteered for the Siskiyou Challenge, helped establish educational connections throughout the valley, and ran the meetings in a comfortable and welcoming manner. She continues to volunteer in the valley while spending time in the garden with her grandchildren. Laura roll - emeritus board Laura Roll was a 2-year board chair for Eagle Mill Farm Education Project during our transition to RVF2S, and incredibly helpful in our early years of pumpkin tours and organizational growth. She was the chair prior to Barbara Heyerman. She is a registered dietician and ongoing supporter of the little non-profit that could ;) CHRIS FOWLER - EMERITUS BOARD Chris was an early board member during the transition from Eagle Mill Farm Education Project to Rogue Valley Farm to School. His practical skills and tools allowed us to build our first outdoor kitchen, have our first harvest meals, and put up our first greenhouses at the Eagle Mill Farm. He continues to work closely with nature, and can be seen volunteering at local events. KELLY GUSTAFSON - EMERITUS BOARD Kelly was an early board member who helped get through the rocky years without any full-time employees or regular funding. She was flexible and knowledgeable and helped us establish our early programs. ruth alexander - emeritus board Ruth was an early board member of Eagle Mill Farm Education Project and longtime garden educator. She helped during the transitional years to Rogue Valley Farm to School, and her calm work ethic helped ease our growing pains. She is a strong contributor to local organizations, is active in local issues, and enjoys time in nature with her family. stay connected with us Sign up with your email address to receive news and updates! PO Box 898 Ashland, OR 97520 RVF2S Tax ID Number: 93-1322736 First Name Last Name Email Address Sign Up We respect your privacy. Thank you! Back to Top Rogue Valley Farm to School, ashland, oregon 97520, usa 541-778-7356 sheila@rvfarm2school.com ©2022 Rogue Valley Farm to School. All rights reserved. Powered by Squarespace"
    },
    {
      "url": "https://rockinhranch.farm/weddings/pricing/",
      "text": "Pricing - Rockin H Ranch Skip to content Facebook-f Instagram Pinterest-p Linkedin-in Tiktok Email Us 772-485-0089 About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events Weddings Pricing Availability Cottages Book A Tour FAQs Contact Weddings Pricing Availability Cottages Book A Tour FAQs Contact Book A Tour Wedding PRICING BLUE BARN (Accommodates 50 to 200 guests) Seasonal Pricing (October to June) Saturday $9,500 Sunday – Friday $8,000 Summer Season Pricing July to September $7,500 PINTEREST PALACE (Accommodates 30 to 100 guests) Seasonal Pricing (October to June) Friday, Saturday $3,500 Thursday – Sunday $3,000 Summer Season Pricing July to September $2,500 Hourly rates for parties under 50 available BUCK'S LAKESIDE BARN (Accommodates up to 50 guests) Seasonal Pricing (October to June) Friday, Saturday $2,500 Thursday – Sunday $2,500 Summer Season Pricing July to September $2,000 Hourly rates for parties under 50 available Weekday Pricing Many of our clients looking to host a less expensive alternative for their wedding, while maintaining that country elegant flavor, choose a day during the week. These weekday weddings provide our clients a unique experience at a greatly reduced-price. Weekday pricing is based on availability, ceremony location and size of wedding. For more information about hosting your wedding on a weekday please contact us or book a tour below. Book a Tour Schedule a VIP Tour of Rockin' H Ranch Book A Tour Home About Us Venues Events Weddings Contact Us Agritourism Disclosure Terms & Conditions Return Policy Privacy Policy Subscribe To Our Newsletter Subscription Form Subscribe © 2025 Rockin’ H Ranch. All Rights Reserved. Facebook-f Instagram Pinterest-p Linkedin-in About Us Our Blog Agritourism History Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Events Corporate Luncheons Weddings Pricing Availability Cottages FAQs Contact Us Book a Tour Facebook-f Instagram Pinterest-p Linkedin-in"
    },
    {
      "url": "https://rockinhranch.farm/events/luncheons/",
      "text": "Luncheons - Rockin H Ranch Skip to content Facebook-f Instagram Pinterest-p Linkedin-in Tiktok Email Us 772-485-0089 About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events Weddings Pricing Availability Cottages Book A Tour FAQs Contact Weddings Pricing Availability Cottages Book A Tour FAQs Contact Book A tour Luncheons In order to make reservations, we recommend you take a tour of our facility first. Click on the link below to schedule a tour. If you have any questions, please contact us at info@rockinhranch.farm or call us at 772-263-0225. Book a Tour Download Flyer Schedule a VIP Tour of Rockin' H Ranch Book A Tour Home About Us Venues Events Weddings Contact Us Agritourism Disclosure Terms & Conditions Return Policy Privacy Policy Subscribe To Our Newsletter Subscription Form Subscribe © 2025 Rockin’ H Ranch. All Rights Reserved. Facebook-f Instagram Pinterest-p Linkedin-in About Us Our Blog Agritourism History Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Events Corporate Luncheons Weddings Pricing Availability Cottages FAQs Contact Us Book a Tour Facebook-f Instagram Pinterest-p Linkedin-in"
    },
    {
      "url": "https://rockinhranch.farm/about-us/",
      "text": "About Us - Rockin H Ranch Skip to content Facebook-f Instagram Pinterest-p Linkedin-in Tiktok Email Us 772-485-0089 About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events Weddings Pricing Availability Cottages Book A Tour FAQs Contact Weddings Pricing Availability Cottages Book A Tour FAQs Contact Book a Tour About Us The Rockin’ H Ranch Philosophy At Rockin’ H Ranch we believe that opportunities for human-animal contact, as well as contact with all aspects of nature, can have a profound and nurturing effect on people. Children can respond to animals in ways they often can’t with people. The human-animal connection can be mutually beneficial to both humans and animals. Learning to care for animals seems to develop a sense of responsibility, empathy, and caring among children who may not have experienced that themselves. It is with this philosophy that our ranch has chosen to share our farm and the animals we care for with the public. What We Do The Rockin H Ranch is a premier Wedding and Events Venue located in Palm City, Florida. The weddings are pretty self explanatory, but to see the kind of events we host, visit our Other Events page. Woman-Owned We are proud to be a woman-owned business here in South Florida. To learn more about Marcia and how she started it all, visit our History page. Agritourism We are an official agricultural location. To learn more details, visit our Agritourism page. Book a Tour Schedule a VIP Tour of Rockin' H Ranch Book A Tour Home About Us Venues Events Weddings Contact Us Agritourism Disclosure Terms & Conditions Return Policy Privacy Policy Subscribe To Our Newsletter Subscription Form Subscribe © 2025 Rockin’ H Ranch. All Rights Reserved. Facebook-f Instagram Pinterest-p Linkedin-in About Us Our Blog Agritourism History Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Events Corporate Luncheons Weddings Pricing Availability Cottages FAQs Contact Us Book a Tour Facebook-f Instagram Pinterest-p Linkedin-in"
    },
    {
      "url": "https://rockinhranch.farm/contact-us/",
      "text": "Contact Us - Rockin H Ranch Skip to content Facebook-f Instagram Pinterest-p Linkedin-in Tiktok Email Us 772-485-0089 About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events Weddings Pricing Availability Cottages Book A Tour FAQs Contact Weddings Pricing Availability Cottages Book A Tour FAQs Contact Book a Tour Contact Us Address 4181 SW Boatramp Ave Palm City FL 34990 Email Address info@rockinhranch.farm Phone 772-485-0089 We are centrally located between Florida's Turnpike and I-95 Have Questions? Get In Touch! Main Contact Form First Name Last Name Email Phone/Mobile Subject Your Message Submit Form Schedule a VIP Tour of Rockin' H Ranch Book A Tour Home About Us Venues Events Weddings Contact Us Agritourism Disclosure Terms & Conditions Return Policy Privacy Policy Subscribe To Our Newsletter Subscription Form Subscribe © 2025 Rockin’ H Ranch. All Rights Reserved. Facebook-f Instagram Pinterest-p Linkedin-in About Us Our Blog Agritourism History Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Events Corporate Luncheons Weddings Pricing Availability Cottages FAQs Contact Us Book a Tour Facebook-f Instagram Pinterest-p Linkedin-in"
    },
    {
      "url": "https://sanbornmills.org/staff-and-board/",
      "text": "Staff and board - Sanborn Mills Farm HOME ABOUT About History Staff and Board Employment Opportunities Internships Directions Contact THE FARM CSA Produce The Mills The Gardens Map Trail System Visit EVENTS Events Calendar Farm to Table Lunch Event Rentals WORKSHOPS All Workshops Farm & Garden Blacksmithing, Tinsmithing, and Metal Arts Woodworking Fiber Arts Historic Craft Natural Dye Study Group Instructors Gift Certificates Teach A Workshop Workshop Policies STUDENT INFO Plan For Your Workshop Housing & Meals Getting Here Scholarships Student Forms Daily Workshop Schedule Workshop Policies SUPPORT Donate 2025 Scholarship Fund Auction Volunteer Select Page Staff Colin Cabot Founder & Executive Director Mary Witschonke Business Manager Kevin M. Schurman Operations Manager Ray Ramsey Farm Manager Marsha Grizwin Program Manager Karen Kenney Registrar Lea Rossignol Outreach and Development Coordinator Craig Mabie Studio Manager Sara Goodman Dye and Fiber Consultant Kelly Fahey Kitchen Manager/Head Chef Helen Westergren Head Gardener Madison St. George Assistant Gardener Sarah Whitt Housekeeper Jennifer Merrill Vegetable Gardener Laura Dahl Assistant Vegetable Gardener Tyler Allen Livestock Supervisor & Oxen Teamster Samantha Locke Teamster Brian Clough Millwright & Sawyer Logan Clough Mill + Sawyer Support Ray St. Pierre Carpenter Jeremy Morse Carpenter Joe Poisson Operations Board of Directors Sanborn Mills Inc. benefits from the intersection of the many skills and interests of our Board members. Current members of the Farm’s Board of Directors include: Galen Beale Kathy Bogle-Shields Colin Cabot Paula Cabot Michael Duffy Elizabeth Durfee Hengen Lynne Emerson Monroe Ben Wilson Teresa Rosenberger Jennifer Goodman (ad hoc) Sanborn Mills Farm 7097 Sanborn Road Loudon, New Hampshire (603) 435-7314 info@sanbornmills.org Follow Follow Past Workshops 2025 Copyright © 2021 Sanborn Mills Farm. All Rights Reserved.\nDesigned by Windhill Design LLC."
    },
    {
      "url": "https://rockinhranch.farm/weddings/availability/",
      "text": "Availability - Rockin H Ranch Skip to content Facebook-f Instagram Pinterest-p Linkedin-in Tiktok Email Us 772-485-0089 About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events Weddings Pricing Availability Cottages Book A Tour FAQs Contact Weddings Pricing Availability Cottages Book A Tour FAQs Contact Book a Tour Venue Availability The Blue Barn Book a Tour Pricing Packet Event Details Event Details Pinterest Palace Book a Tour Pricing Packet Buck's Lakeside Barn Book a Tour Pricing Packet Event Details Schedule a VIP Tour of Rockin' H Ranch Book A Tour Home About Us Venues Events Weddings Contact Us Agritourism Disclosure Terms & Conditions Return Policy Privacy Policy Subscribe To Our Newsletter Subscription Form Subscribe © 2025 Rockin’ H Ranch. All Rights Reserved. Facebook-f Instagram Pinterest-p Linkedin-in About Us Our Blog Agritourism History Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Events Corporate Luncheons Weddings Pricing Availability Cottages FAQs Contact Us Book a Tour Facebook-f Instagram Pinterest-p Linkedin-in"
    },
    {
      "url": "https://rockinhranch.farm/events/",
      "text": "Events - Rockin H Ranch Skip to content Facebook-f Instagram Pinterest-p Linkedin-in Tiktok Email Us 772-485-0089 About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events Weddings Pricing Availability Cottages Book A Tour FAQs Contact Weddings Pricing Availability Cottages Book A Tour FAQs Contact Book a Tour Events The Rockin H Ranch isn’t just for weddings. We are home to a number of different events. From luncheons, to Fall Festival to Thirsty Thursdays, check out our list of examples below to see if the Ranch is right for your next event. Birthday Parties School Dances Family Reunions Retirement Parties Work Luncheons Picnics Celebration of Life Team Building Field Day Prom Bridal Shower Baby Shower Corporate Events Training/Meetings Military Ball Fundraisers Holiday Parties Non-Profit Events Book a Tour Don't see your event listed here? For any questions, contact us at info@rockinhranch.farm and we’ll be happy to help. Or if you’d like, book a tour ! Come and see for yourself. Schedule a VIP Tour of Rockin' H Ranch Book A Tour Home About Us Venues Events Weddings Contact Us Agritourism Disclosure Terms & Conditions Return Policy Privacy Policy Subscribe To Our Newsletter Subscription Form Subscribe © 2025 Rockin’ H Ranch. All Rights Reserved. Facebook-f Instagram Pinterest-p Linkedin-in About Us Our Blog Agritourism History Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Events Corporate Luncheons Weddings Pricing Availability Cottages FAQs Contact Us Book a Tour Facebook-f Instagram Pinterest-p Linkedin-in"
    },
    {
      "url": "https://rockinhranch.farm/",
      "text": "Rockin' H Ranch - Premier Rustic Wedding Venues in Florida Skip to content Facebook-f Instagram Pinterest-p Linkedin-in Tiktok Email Us 772-485-0089 About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events Weddings Pricing Availability Cottages Book A Tour FAQs Contact Weddings Pricing Availability Cottages Book A Tour FAQs Contact Book a Tour 3 Premier Venues - We Don't Just Do Weddings! The Big Blue Barn Learn More Pinterest Palace Learn More Buck's Lakeside Barn Learn More Now Featuring Our On Site Cottages Rockin' Rendezvous Learn More A Rural Florida Is  A Better Florida We are proud to work with Martin County to be an official agritourism operator. Our dedication to creating a magical place on our working farm is what drives thousands to our farm each year. Under Florida Statute 570.85 Agritourism we are required to post the following warning. Please read before visiting our farm. Read Now! @rockinhranchpalmcity on Schedule a VIP Tour of Rockin' H Ranch Book A Tour Home About Us Venues Events Weddings Contact Us Agritourism Disclosure Terms & Conditions Return Policy Privacy Policy Subscribe To Our Newsletter Subscription Form Subscribe © 2025 Rockin’ H Ranch. All Rights Reserved. Facebook-f Instagram Pinterest-p Linkedin-in About Us Our Blog Agritourism History Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Events Corporate Luncheons Weddings Pricing Availability Cottages FAQs Contact Us Book a Tour Facebook-f Instagram Pinterest-p Linkedin-in"
    },
    {
      "url": "https://rockinhranch.farm/faqs/",
      "text": "FAQs - Rockin H Ranch Skip to content Facebook-f Instagram Pinterest-p Linkedin-in Tiktok Email Us 772-485-0089 About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events About Us Our Blog History Agritourism Book A Tour Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Book A Tour Events Public Events Weddings Pricing Availability Cottages Book A Tour FAQs Contact Weddings Pricing Availability Cottages Book A Tour FAQs Contact Contact Us FAQs Can I bring my decorations the night before my wedding? Unfortunately you cannot. We open our facilities at 9am the day of your wedding/event to ensure 15 hours of access. This includes vendors as well. Please be sure your vendors are not dropping off supplies throughout the week. Can I use glitter or confetti for photos? Glitter, confetti, and outdoor balloons are prohibited from our venue. Because the Ranch hosts multiple weddings/events per weekend, we must maintain a clean and orderly facility. Glitter, confetti, and balloons are non-biodegradable and can adversely affect the ranch animals that live on our farm. For those reasons, we ask that you not use any. Is there an onsite sleeping option? Yes, there is! Want one last hoo-rah with your girls before your big day? Our Rockin Rendezvous cottages are fully furnished bunkhouses available for rental. You can use this as a night-before sleep option with your bridal party, night-of option, or a getting ready suite! Visit our Venues page for more information. What is the maximum capacity of your venue? Our maximum capacity varies depending on event type and venue. The Blue Barn can handle 200 guest comfortably for a wedding or special event. Pinterest Palace is perfect for any type of event up to 100 guests. Buck's Barn is ideal for smaller events of up to 50 guests. Can I bring my own alcohol? Unfortunately, due to liability constraints, we are unable to permit outside guests from bringing their own alcohol. However, we have 3 licensed and insured bar providers that can professionally handle your event. Do you offer wedding planning services? Yes, we do!  Wedding planners are required at our venues. They will ensure your planning process goes smoothly, so that you can relax and enjoy your special day. Wedding planners offer full service packages, or thirty day packages (for the an organized bride). Our ranch manager is also happy to assist in any way they can throughout your planning process. What about special situations like a smaller party on a weekday? We love special events at RHR and host any type of event from fundraisers to school dances to bday parties. We also offer a serene setting for a celebration of life. We handle pricing for events such as these on a case by case basis. If you ever have specific questions about pricing or event dates, feel free to Contact Us . Is your Blue Barn air conditioned? Yes. The Blue Barn is air conditioned. Being a ranch venue in South Florida, we pride ourselves in having a climate controlled barn. Do you have a weather contingency option? Yes, in the event of inclement weather or extreme heat, your ceremony can be moved indoors. Still have questions? No worries! Feel free to call or email us with any other\ninquiries you might have. Or, book a tour to come and see our property! Book a Tour Contact Us Schedule a VIP Tour of Rockin' H Ranch Book A Tour Home About Us Venues Events Weddings Contact Us Agritourism Disclosure Terms & Conditions Return Policy Privacy Policy Subscribe To Our Newsletter Subscription Form Subscribe © 2025 Rockin’ H Ranch. All Rights Reserved. Facebook-f Instagram Pinterest-p Linkedin-in About Us Our Blog Agritourism History Venues The Big Blue Barn Pinterest Palace Buck’s Lakeside Barn Rockin’ Rendezvous Events Corporate Luncheons Weddings Pricing Availability Cottages FAQs Contact Us Book a Tour Facebook-f Instagram Pinterest-p Linkedin-in"
    }
  ]
}