{
  "fuentes": [
    {
      "url": "https://americasbestrestaurants.com/rests/florida/rockpit-brewing",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/some-rockpit-weirdness-going-on-is-it-us/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/some-rockpit-weirdness-going-on-is-it-us/",
      "email": "chris@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/upcoming-events/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/introducing-rockpit-brewing/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/were-opening-our-taproom-again/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/privacy-policy/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/cheers-and-thank-you/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/cheers-and-thank-you/",
      "email": "chris@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/signup/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/birthday-flight-thank-you/",
      "email": "chris@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/mug-club-details/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/events/2025-beerlympics/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/our-beers/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://www.theorlandoreal.com/rockpit-brewing-brings-small-batch-beers-to-the-sodo-district/",
      "email": "marker--hover--listing-stack@2x.png"
    },
    {
      "url": "https://www.theorlandoreal.com/rockpit-brewing-brings-small-batch-beers-to-the-sodo-district/",
      "email": "marker--listing-stack@2x.png"
    },
    {
      "url": "https://rockpitbrewing.com/weve-been-falsely-accused/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "hr@team.spruko.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "legaldept@team.spruko.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "sales@team.spruko.com"
    },
    {
      "url": "https://rockpitbrewing.com/follow/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/food/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://bonsaibar.com/products/rockpit-brewing",
      "email": "inline_2_140x@2x.png"
    },
    {
      "url": "https://bonsaibar.com/products/rockpit-brewing",
      "email": "inline_2_270x@2x.png"
    },
    {
      "url": "https://wineandcanvas.com/orlando/venue/rockpit-brewing-and-distilling/",
      "email": "infofl@wineandcanvas.com"
    },
    {
      "url": "https://craftbeerlocations.com/beerspot/rockpit-brewing-brewery-in-orlando-florida/",
      "email": "help@craftbeerlocations.com"
    },
    {
      "url": "https://rockpitbrewing.com/about/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/about/",
      "email": "chris@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/events/speed-dating-with-sodo-singles-feb-14th/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/were-heartbroken-to-tell-you-this/",
      "email": "beer@rockpitbrewing.com"
    },
    {
      "url": "https://rockpitbrewing.com/were-heartbroken-to-tell-you-this/",
      "email": "chris@rockpitbrewing.com"
    }
  ],
  "mails": [
    "beer@rockpitbrewing.com",
    "chris@rockpitbrewing.com",
    "help@craftbeerlocations.com",
    "hr@team.spruko.com",
    "infofl@wineandcanvas.com",
    "inline_2_140x@2x.png",
    "inline_2_270x@2x.png",
    "legaldept@team.spruko.com",
    "marker--hover--listing-stack@2x.png",
    "marker--listing-stack@2x.png",
    "sales@team.spruko.com"
  ],
  "nombre_sitio": "rockpitbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://americasbestrestaurants.com/rests/florida/rockpit-brewing",
      "text": "Rockpit Brewing - America's Best Restaurants Search Restaurant Owner Help Find a restaurant Get featured Restaurant Owners Hub Nominate A Restaurant Press Home Florida Rockpit Brewing Rockpit Brewing Brewery Share This Restaurant (407) 826-1773 rockpitbrewing.com beer@rockpitbrewing.com 10 W Illiana St Orlando, FL 32806 About Rockpit Brewing THE SODO DISTRICT’S FAMILY-OWNED, NEIGHBORHOOD BREWERY WITH A WARM & FAMILY-FRIENDLY TAPROOM AND AN EVER-CHANGING LINE-UP OF SMALL-BATCH BEERS. Why do we say “You’ll Dig Our Beer”? We have 20 taps in our taproom filled with a huge variety of in-house crafted beer and hard seltzer waters, ciders, wine and other drinks. The most common thing our customers tell us is, “You have something for everyone.” That’s because we don’t have 17 IPA’s on tap. We usually have 3-5 IPA’s along with a few sours, belgians, germans, lagers, pilsners, seltzer waters, etc. No matter your taste for beer, we have something you’ll dig. Previous Next Location & Contact Get Directions (407) 826-1773 rockpitbrewing.com beer@rockpitbrewing.com 10 W Illiana St Orlando, FL 32806 Follow Us: Instagram Youtube Facebook TikTok For Restaurants: Restaurant Owner Resources Contact Us: Careers Team Press © 2025 – America’s Best Restaurants | All rights reserved"
    },
    {
      "url": "https://rockpitbrewing.com/some-rockpit-weirdness-going-on-is-it-us/",
      "text": "Some RockPit weirdness going on. Is it us or them? | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Some RockPit weirdness going on. Is it us or them? There’s some weirdness going on in the RockPit universe. Well… At least when it comes to some reviews lately. Overwhelmingly, we get positive reviews. Sometimes those positive reviews include constructive criticism like “The owner Chris needs to wear different deodorant. He smells like a mix of stale beer and animal instinct.” For the record, I wear Old Spice. And I, of course, made that comment up. Seriously though, most of our reviews are great as evidenced by our overall score after two years. However, we’ve had some weird-ass things said about us lately, and we need your help figuring out if we’re doing something wrong. Keep in mind that these are four-star reviews. They weren’t negative reviews. Just weird. Are we just another Hooters/chain restaurant? The review started off as “Much more of a commercial feeling (like a “hometown” BBQ place that’s really part of a chain) than the other breweries I’ve been to in the area. Not a bad thing, per se, but….. Staff is friendly enough but again, less hometown feel, more Hooters like.” Talk about a weird mix of emotions. On the one hand, I’m like, “Oh hell yes! We made everything by hand in here, so if our work is that good, we kicked ass!” Hooters spends as much on the interior of their restaurants as we did on our whole brewery. On the other hand, I’m like, “My daughter and wife were working that night. What are they wearing when I’m not around?” Admittedly I haven’t been to a Hooters since the mid-2000s. So I’m not sure if they’ve changed their aesthetic lately. But I don’t remember them looking like our brewery. So my question to you is: Are we creeping into Hooters/Chain restaurant territory? If so, how? Are we the brewery version of Animal House? The second review ended with “The decor — frat house, 1989…..” I was never in a fraternity, nor have I ever set foot in one. So I don’t have much experience in that department. Sean (my business partner) was at Stetson in 1989. Maybe he’s influencing the updates to the interior as a throwback to his glory days? Either way, the only thing I can think of is we have a historical record of all of our canned beer on display on the steel beams near the entrance. We also have a skateboard given to us by HiFive after they won an award for the design of the “Darth Malt Legs” can art. (Award-winning Darth Malt Legs design) Other than that, I can’t think of a reason why he would make that comparison. So… Any ideas on that comparison? Again, I’m not complaining as the reviews were good ones. I’m just worried we’re not seeing something that others are seeing. Do you see what they’re saying? If so, shoot me a message at chris@rockpitbrewing.com and let me know. I’d love to get some good feedback other than changing my deodorant (again). Cheers and see you at RockPit. Chris Rock Co-founder / Chief Marketing Dude / Writer of Bad Grammar Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St So this actually happened (the abandoned husband p Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Link to: Enjoy our new 13% ABV Belgian Tripel during Trivia, Live Music, Yoga, or Brunch Link to: Enjoy our new 13% ABV Belgian Tripel during Trivia, Live Music, Yoga, or Brunch Enjoy our new 13% ABV Belgian Tripel during Trivia, Live Music, Yoga, or Br... Link to: You’re “Gonna Need A Bigger Boat” to navigate these “Tasty Waves” Link to: You’re “Gonna Need A Bigger Boat” to navigate these “Tasty Waves” You’re “Gonna Need A Bigger Boat” to navigate these “Tasty... Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/upcoming-events/",
      "text": "Upcoming Events | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Category Live Music Unique Events Weekly Events 10 September 2025 Music Bingo Game Night RockPit Brewing, 10 W Illiana St, Orlando, FL 32806 Facebook Twitter Linkedin Email View Detail 11 September 2025 Trivia Night @ RockPit RockPit Brewing, 10 W Illiana St, Orlando, FL 32806 Facebook Twitter Linkedin Email View Detail 12 September 2025 Teacher Appreciation Fridays at Rockpit Brewing Facebook Twitter Linkedin Email View Detail 12 September 2025 Led-Hed at Rockpit Brewing Facebook Twitter Linkedin Email View Detail 13 September 2025 Saturday Morning Yoga & Beer Facebook Twitter Linkedin Email View Detail 13 September 2025 Grateful Spread at Rockpit Brewing Facebook Twitter Linkedin Email View Detail 15 September 2025 Hospitality Appreciation Mondays at Rockpit Brewing Facebook Twitter Linkedin Email View Detail 17 September 2025 Music Bingo Game Night RockPit Brewing, 10 W Illiana St, Orlando, FL 32806 Facebook Twitter Linkedin Email View Detail 18 September 2025 Trivia Night @ RockPit RockPit Brewing, 10 W Illiana St, Orlando, FL 32806 Facebook Twitter Linkedin Email View Detail 19 September 2025 Teacher Appreciation Fridays at Rockpit Brewing Facebook Twitter Linkedin Email View Detail 19 September 2025 Felipe Pavani at RockPit Brewing Facebook Twitter Linkedin Email View Detail 20 September 2025 Saturday Morning Yoga & Beer Facebook Twitter Linkedin Email View Detail No event found! Load More Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St So this actually happened (the abandoned husband p When 11,000 Florida fans can’t stop talking abou Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/introducing-rockpit-brewing/",
      "text": "Introducing Rockpit Brewing | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Rockpit Brewing is widely considered as the hangout for Orlando locals who love to enjoy a good local craft beer with friends and family. Let us show you why you should join them (including us buying you a beer)… You’ll enjoy uniquely hand-crafted beer The beer you’ll enjoy at Rockpit Brewing is made from scratch using our unique recipes created right here in our brewery. This beer is waiting for you… Every beer is hand-crafted by our brewers, Cody and Josh. They spend hours brewing every beer and then spend weeks tediously ensuring the beer is perfect and ready for you to enjoy. We have over 15 – 20 of our hand-crafted beers on tap at any given time . So you’ll often be able to come in several times a month and never drink the same beer twice. Unless you turn into one of our regulars and keep returning for your favorite beer. Click here to see our current taplist “If you like great beer you have to check this place out. Everything they have is nothing short of exceptional and the variety is fantastic because even the pickiest will find something they like.” – Joe Snow, Orlando, FL You’ll easily find the perfect beer for you Let us find the perfect beer for you We make a lot of beer with a ton of variety. Everything from lagers to IPA’s, blondes to sours and porters to stouts. With the huge variety of beer we create, we know we have something on tap that you’ll absolutely enjoy. But sometimes the hardest part is finding that perfect beer. So we make it easy for you by giving you unlimited samples to “try before you buy” . Just ask for a sample of any beer you want to try and we’ll gladly give you a sample (or 4). To make your experience even better, we never force you to buy more beer than you want. That’s why we give you the choice to enjoy your beer in 9, 12 or 16 ounce pours . High ABV beers only come in 9 or 12 ounce pours. “Great new brewery with a good sized selection of beers. We tried four different beers between us and they were all excellent. Friendly staff, quick service, and a great atmosphere. We’ll definitely be visiting again.” Bobby Harmon, Orlando, FL You’ll Never Go Hungry With Texas-Style BBQ and Delectable Bites Provided By Cecil’s BBQ Doesn’t it suck to go to a brewery and have nothing to eat? The perfect pairing… Cecil’s BBQ wings with Blackstrap Con Leche We thought so too. That’s why we worked with our neighbors, Cecil’s BBQ to create an in-taproom menu for you . This means you order your food here in our taproom, it’s made next door at Cecil’s and it’s delivered right to your table by us . No waiting on Uber eats (although you can certainly order from them as well). With items like Smoked Wings, BBQ Sliders, Fried Pickles and even Grilled Cheese, there is surely something you can find to satisfy your hunger while enjoying your Rockpit Brewing beer . And if you don’t find something… you can bring your own food in . Yep, seriously. Bring a publix sub, McDonalds Big Mac or some chik-fil-a nuggets… we don’t care. As long as you’re enjoying yourself at Rockpit, we’re happy. Click here to see our in-taproom food menu “Their (Cecil’s) BBQ is the most delicious in town.” – Delia Rodriquez, Orlando, FL You’ll never be bored with our weekly events like Music Bingo, Trivia and Live Music Better times with beer. Live music every friday night That’s what you get here. We don’t want to be just another place selling beer with nothing fun to do. That’s why we have something going on all the time here at RockPit. Poker, Open Jam Sessions, Music Bingo, Trivia, Live Music, Food Truck parties and pairings are always on our schedule. Coming in soon and want to know what’s happening? Click here to see our upcoming events “ Excellent beer lineup and the staff Is very attentive. The experience has been beyond any of my expectations. These people are awesome. You should come here and enjoy a very, very good time. “ – Mario Natera, Orlando, FL Those friends who don’t drink beer? Yeah, what go them covered This hurts to admit, but not everyone likes beer . If you’re a craft beer lover and have friends who aren’t, you know this all too well. We always have something for the non-beer drinkers We’re doing everything we can to ensure that those who don’t like beer but enjoy a good wine or cider are well taken care of at Rockpit. We want to help you with those friends who have the “Oh, but I won’t have anything to drink” complaint . To help you overcome the “nothing to drink” excuse your friends have, we work with a small-batch wine distributor here in the SoDo district to bring you a select wine list that should be satisfying for the wine drinkers in your life. We also stock up on vodka sodas, ciders and other fun drinks for the non-beer drinker. Click here to see our taplist and other drinks We spent a year creating a warm and inviting atmosphere for you to enjoy yourself in “You can feel the love in this place” A businessman who’s about to open a few restaurants in the SoDo area (you’ll know the place soon) told us that recently. We the owners and dozens of our friends and family members worked for a year to build our taproom and brewery. Yes, a year. We built everything by hand so you’d never be able to find anything like our brewery anywhere in Orlando. Heck, in Florida… The tables, the bar, the decor, the sign hanging outside… everything was hand-crafted by us to give you a totally unique, inviting and warm atmosphere to serve as a local gathering place for you, your friends and your family for many years to come. You may have noticed a few “mining town” themed elements in those pictures. Why were those added? Tammy’s (wife of co-founder Chris) grandfather (Homer Little) was a coal miner in the 1940s and 1950s for the Red Jacket and Island Creek Coal companies. Jeremy’s mom tells him story after story of the long hours Homer put in just so they could put food in their stomachs and clothes on their backs. He was simply the hardest working man anyone in the family ever knew . To pay homage to the blue-collar work ethic of Homer, we create a coal-country-inspired brewery in his honor. So when you walk into Rockpit, you’ll be reminded that this is a place for hard-working people like you. “Rockpit is our new hangout. Amazing beer and staff. The atmosphere is welcoming, spacious, and great for private parties. Cecil’s bbq is right next door, and there is a menu at Rockpit that you can order from, which Cecil’s will deliver. Go there hungry and thirsty! We absolutely love this place!” – Scott Thompson, Orlando, FL You can bring the kiddos and the pups along with you Want to know the two most asked questions we’re asked here at Rockpit? Are you dog friendly? Are you kid friendly? And the answer to both of those questions is… YES! 1000%! Co-founders Chris & Sean and several of our bartenders have kids ranging from the ages of 1 to 25 (guess that dates a few of us). So it’s only natural that we are kid friendly. In fact, you’ll probably see our kids in the brewery every once in a while. And being dog parents and dog lovers, we welcome our canine friends at Rockpit. We even have readily available water bowls so you don’t have to worry about them going thirsty. So bring the kids and canines and enjoy a few beers with them at Rockpit. “Loved the laidback atmosphere and the staff was super friendly. They’re dog friendly too, so that scored major bonus points with me.” – Jennifer Hershey We’re easy to get to and have plenty of parking available Our location is behind Cecil’s BBQ on Orange Ave near the intersection of Michigan and Orange at 10 W Illiana St, Orlando, FL 32806 Click the map below to get directions from Google Maps Although our parking lot in front of the brewery only has around 20 spaces, we have another 30+ spots across the street at the DoSo office suites. Please don’t park at ABC liquor. You can also park at Cecil’s BBQ after they close for the night . Which is normally 9 PM every night. Current Rockpit Brewing Hours Monday – Thursday 12 PM – 10 PM Friday, Saturday 12 PM – 12 PM Sunday 12 PM – 8 PM “ This is the best brewery in town . The beer is great (have not had a bad one yet). The staff is very friendly and the service is great. Place looks awesome and the food is great. It’s also family and pet friendly. Look forward to going here every chance I get. “ – Tim Schwartz, Orlando, FL We’ll buy you a beer if you buy the first one Seriously. We want you to swing by and give us a try. If you agree to give us your email address below so we can shoot you a message about how to claim your free beer, we’ll buy you a beer when you buy the first one. BOGOB (Buy one, get one beer) if you will. Fill out the form below to claim your free beer. Name * First Last Email * This is where we'll send your beer voucher. Ensure it's a valid email address or no beer for you. This field is hidden when viewing the form Expiration Date MM slash DD slash YYYY CAPTCHA Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/were-opening-our-taproom-again/",
      "text": "We’re opening our taproom again. | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu We’re opening our taproom again It’s been a rough few weeks, but the light at the end of the tunnel is shining through. We’re opening our doors today (Thursday) at Noon so you can enjoy a beer or a few in the taproom or outside on the patio. And no, this isn’t a protest or anything like that. We worked out a deal with Gypsy and the Fleur D’Elise food truck to play within the rules set by the Florida DBPR, which allows us to open back up for onsite consumption. We owe a great deal of gratitude to Gypsy. She came through big time for us, and without her hard work, we’d be dead in the water still. We’re still working with Cecil’s to bring you the best BBQ in Orlando, but we will probably need a few days to get their staff back up and running for us. This shutdown hurt. Bad. RockPit and every other brewery that didn’t “serve food” was royally screwed by the Florida DBPR. When they allowed restaurants to serve alcohol, that was like a death blow for all of us. (Jax = DBPR, Shang Tsung = Us) But I’m not going to dwell on it. As Andy and Red say in The Shawshank Redemption: “Get busy living or get busy dying.” We’re getting busy living. That said, let’s cover a few things you need to know about when visiting the taproom. First, based on the Orlando EO, you have to wear a mask when entering RockPit and while ordering your beer from the bar. You’ll want to take it off when enjoying your beer unless you have one of those fancy masks with an opening. (You’ll need to bring your own straw) We’ve removed most of the bar seating and spaced all the tables out at LEAST 6 feet . We have more room inside the taproom now that Orlando Homebrew Supplies moved next door. The expanded taproom space isn’t finished just yet but will be this weekend. However, there are a few tables in the new area where you can sit. If we do get busy (as we usually do) and all the tables inside are filled, there is plenty of outdoor seating available. If you still prefer not to enjoy onsite consumption, our online sales will continue with curbside pickup available. Call us when you arrive, and we’ll run your order out to you. I gotta run now. I need to get to the brewery and finish that expanded taproom area, but I want to leave you with a quick story. My wife asked me this morning, “Are you excited to see people in the taproom?” I replied, “Honestly, not really.” You might be thinking, “What the hell, Chris? You’re not excited to see me in the taproom again?” Of course, I am. Beyond excited. Like this. But in the back of my mind, all I can think of is getting a visit from some three or four-letter agency who will try their hardest to shut us down again. So it’s hard to be excited with power-hungry agencies looking to shut us down. And unfortunately, there are those out there who want another complete shutdown of everything, so I’m sure they’ll be riding around town looking for “violators.” We’ve seen it happen to a few places already. Luckily, the places targeted by the vigilantes had all their ducks in a row. I don’t want to give anyone the firepower they crave to shut our doors again, so please help us out and play within the rules . Wear the mask, keep your distance, dance when your favorite song comes on. In other words, be cool. We both know you got that covered. Thank you again for your support during this craziness. To say it’s been stressful, frustrating and mind-boggling is an understatement. But again, like Red said… Here’s to getting busy living. – Chris Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Link to: Who should win the Bad Glamour Shot Contest? Link to: Who should win the Bad Glamour Shot Contest? Who should win the Bad Glamour Shot Contest? Link to: Two new beers on tap Link to: Two new beers on tap Two new beers on tap Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/privacy-policy/",
      "text": "Privacy Policy | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Welcome to our Privacy Policy Your privacy is critically important to us. RockPit Brewing, LLC is located at: RockPit Brewing, LLC 10 W Illiana St Orlando 32806 – Florida , United States 4078261773 It is RockPit Brewing, LLC’s policy to respect your privacy regarding any information we may collect while operating our website. This Privacy Policy applies to https://rockpitbrewing.com (hereinafter, “us”, “we”, or “https://rockpitbrewing.com”). We respect your privacy and are committed to protecting personally identifiable information you may provide us through the Website. We have adopted this privacy policy (“Privacy Policy”) to explain what information may be collected on our Website, how we use this information, and under what circumstances we may disclose the information to third parties. This Privacy Policy applies only to information we collect through the Website and does not apply to our collection of information from other sources. This Privacy Policy, together with the Terms and conditions posted on our Website, set forth the general rules and policies governing your use of our Website. Depending on your activities when visiting our Website, you may be required to agree to additional terms and conditions. Website Visitors Like most website operators, RockPit Brewing, LLC collects non-personally-identifying information of the sort that web browsers and servers typically make available, such as the browser type, language preference, referring site, and the date and time of each visitor request. RockPit Brewing, LLC’s purpose in collecting non-personally identifying information is to better understand how RockPit Brewing, LLC’s visitors use its website. From time to time, RockPit Brewing, LLC may release non-personally-identifying information in the aggregate, e.g., by publishing a report on trends in the usage of its website. RockPit Brewing, LLC also collects potentially personally-identifying information like Internet Protocol (IP) addresses for logged in users and for users leaving comments on https://rockpitbrewing.com blog posts. RockPit Brewing, LLC only discloses logged in user and commenter IP addresses under the same circumstances that it uses and discloses personally-identifying information as described below. Gathering of Personally-Identifying Information Certain visitors to RockPit Brewing, LLC’s websites choose to interact with RockPit Brewing, LLC in ways that require RockPit Brewing, LLC to gather personally-identifying information. The amount and type of information that RockPit Brewing, LLC gathers depends on the nature of the interaction. For example, we ask visitors who sign up for a blog at https://rockpitbrewing.com to provide a username and email address. Security The security of your Personal Information is important to us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Information, we cannot guarantee its absolute security. Advertisements Ads appearing on our website may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer each time they send you an online advertisement to compile information about you or others who use your computer. This information allows ad networks to, among other things, deliver targeted advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies by RockPit Brewing, LLC and does not cover the use of cookies by any advertisers. Links To External Sites Our Service may contain links to external sites that are not operated by us. If you click on a third party link, you will be directed to that third party’s site. We strongly advise you to review the Privacy Policy and terms and conditions of every site you visit. We have no control over, and assume no responsibility for the content, privacy policies or practices of any third party sites, products or services. https://rockpitbrewing.com uses Google AdWords for remarketing https://rockpitbrewing.com uses the remarketing services to advertise on third party websites (including Google) to previous visitors to our site. It could mean that we advertise to previous visitors who haven’t completed a task on our site, for example using the contact form to make an enquiry. This could be in the form of an advertisement on the Google search results page, or a site in the Google Display Network. Third-party vendors, including Google, use cookies to serve ads based on someone’s past visits. Of course, any data collected will be used in accordance with our own privacy policy and Google’s privacy policy. You can set preferences for how Google advertises to you using the Google Ad Preferences page, and if you want to you can opt out of interest-based advertising entirely by cookie settings or permanently using a browser plugin. Aggregated Statistics RockPit Brewing, LLC may collect statistics about the behavior of visitors to its website. RockPit Brewing, LLC may display this information publicly or provide it to others. However, RockPit Brewing, LLC does not disclose your personally-identifying information. Cookies To enrich and perfect your online experience, RockPit Brewing, LLC uses “Cookies”, similar technologies and services provided by others to display personalized content, appropriate advertising and store your preferences on your computer. A cookie is a string of information that a website stores on a visitor’s computer, and that the visitor’s browser provides to the website each time the visitor returns. RockPit Brewing, LLC uses cookies to help RockPit Brewing, LLC identify and track visitors, their usage of https://rockpitbrewing.com, and their website access preferences. RockPit Brewing, LLC visitors who do not wish to have cookies placed on their computers should set their browsers to refuse cookies before using RockPit Brewing, LLC’s websites, with the drawback that certain features of RockPit Brewing, LLC’s websites may not function properly without the aid of cookies. By continuing to navigate our website without changing your cookie settings, you hereby acknowledge and agree to RockPit Brewing, LLC’s use of cookies. E-commerce Those who engage in transactions with RockPit Brewing, LLC – by purchasing RockPit Brewing, LLC’s services or products, are asked to provide additional information, including as necessary the personal and financial information required to process those transactions. In each case, RockPit Brewing, LLC collects such information only insofar as is necessary or appropriate to fulfill the purpose of the visitor’s interaction with RockPit Brewing, LLC. RockPit Brewing, LLC does not disclose personally-identifying information other than as described below. And visitors can always refuse to supply personally-identifying information, with the caveat that it may prevent them from engaging in certain website-related activities. Privacy Policy Changes Although most changes are likely to be minor, RockPit Brewing, LLC may change its Privacy Policy from time to time, and in RockPit Brewing, LLC’s sole discretion. RockPit Brewing, LLC encourages visitors to frequently check this page for any changes to its Privacy Policy. Your continued use of this site after any change in this Privacy Policy will constitute your acceptance of such change. Contact Information If you have any questions about this Privacy Policy, please contact us via email or phone . Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/cheers-and-thank-you/",
      "text": "Cheers and Thank You! | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Cheers and Thank You! Pretty soon… This will be you. Be on the lookout for an email from me, Chris Rock (hey there, I’m one of the co-founders of Rockpit). The email address it’s being sent from is chris@rockpitbrewing.com. If you don’t get the email within an hour, shoot me an email at chris@rockpitbrewing.com and I’ll help get it to you. Cheers and see you soon! Some Very Helpful Information Before You Visit Us Link to: Getting To And Parking At Rockpit Brewing Parking (Please Read) Link to: Current Tap List Our Ever Changing Taplist Link to: Food Food To Enjoy In Taproom Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/signup/",
      "text": "Be The First To Know About All Things Rockpit Brewing | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Signup for our email newsletter and know about events, beer releases and alien invasions before anyone else The only email you’ll read from a local business. Nearly every day, co-founder Chris Rock sends out an email that’s been described as “must-read” or “the only email I read” by subscribers. Why? Because he doesn’t send the typical “Here’s what happening at xyz brewery this week” type of emails. Instead, he sends insider stories, funny content, what beer will be on our taps soon (so you can plan accordingly) and upcoming events at RockPit. So join in on the fun and enter your email address below. First Name Last Name Email Address Signup Form Website FreeBeerFunnel TopBrewer BogoBeerOffer Join In! Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/birthday-flight-thank-you/",
      "text": "Birthday Flight Thank You | Rockpit Brewing & Distilling Welcome aboard! Check your email. You have a coupon being sent to your email inbox right now. If you don’t see the email in the next 15 minutes or so, check your junk mail folder. If you still don’t see it, an email to chris@rockpitbrewing.com and we’ll get you on the right path. Get it? Flight? Path? Thankfully the beer at RockPit is better than our puns. Important note: Over the next few days, I’m going to introduce you properly to RockPit Brewing. You’ll receive 4 or so emails telling you all about us and why you’ll love (or hate) us. You’ll also start receiving my emails a few days a week after that . If you prefer to only get an email once a week with all the new beer releases and happenings at RockPit, click the link at the bottom of the email that looks like this: You’ll be surprised and delighted that a business is sending something so interesting when you’re used to getting those boring “Here’s what’s happening at xyz this week.” emails. I promise not to bore you. Also like I said on the previous page, you’ll get a text message from me every once a week . If you don’t want the text messages, simply reply “STOP” to any one of them and I’ll stop sending them. I wouldn’t do that though. You’ll seriously miss out on some REALLY great stuff we do here at RockPit. Cheers! Chris Rock Co-founder, RockPit Brewing chris@rockpitbrewing.com (me failing at modeling) I know I might be coming on a little strong here, but what are the chances we could be friends? Like 1 in a million? Even if it’s that low, why not give us a like on Facebook or Instagram? Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/mug-club-details/",
      "text": "Mug Club Options | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Mug Club Options This page shows you the options you have for the t-shirt and contact info for your mug club membership. Also, keep in mind that the t-shirts are mockups and will look much better when they’re printed. Men’s T-Shirt Colors The men’s cut t-shirts are Next Level CVC t-shirts. It’s the same style we use for most of our men’s t-shirts. There is a size chart on this page: https://www.nextlevelapparel.com/products/unisex-cvc-t-shirt-black Black Blue Women’s T-Shirt Colors The women’s cut t-shirts are Next Level CVC t-shirts. There is a size chart on this page: https://www.nextlevelapparel.com/products/cvc-t-shirt-indigo Black Blue Enter your contact info below and choose your t-shirt Fill out the form below for your mug details. First Name (Required) Last Name (Required) Email Address (Required) Phone Number (Required) Birth Date (Year doesn't matter) (Required) MM slash DD slash YYYY T-Shirt Style Women's Cut Men's Cut T-Shirt Color Black Blue T-Shirt Size S M L XL 2XL 3XL Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/events/2025-beerlympics/",
      "text": "2025 Beerlympics by RockPit Brewing and South Orlando Crossfit | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu 2025 Beerlympics by RockPit Brewing and South Orlando Crossfit Think you’re the best beerlete in Orlando? Wanna prove it? Then come compete in the fifth annual beerlympics here at RockPit Brewing and South Orlando Crossfit . An incredibly fun team event featuring beer-related games that will test your hand-eye coordination, strength, and, of course, beer consumption skills. This is a team event featuring beer-related games that will test your hand-eye coordination, strength, and, of course, beer consumption skills. You can sign up as a single participant but will be assigned a team on the day of the event. We encourage you to get friends to participate with you. Sign Up Now Your team of four will compete in various games. Here are the official 2025 Beerlympics games: 26.2 Meter Obstacle Relay In this game, each team member will run through an obstacle course set up by the CrossFit gym. The team score is based on how long each player takes to navigate the obstacle course successfully. Crazy Straw Chug Relay In this competition, we will fill a cup with your choice of a shot of moonshine or beer for all four team members. One by one, each team member will chug the drink through a crazy straw, run to the next person, and tag them, which will start that team member’s chug. The game is finished when all four team members have completed the chug and will be scored for total time. Beer-In-Hand Mini Golf For this event, you’ll be required to have a beer in one hand and use the other to putt the golf ball. There are three holes filled with obstacles meant to challenge your one-handed golf skills. But don’t worry, you have the beer in your hand to help with any frustration that might arise. Team Hammerschlagen Each team member will play Hammerschlagen on a single stump for time in this event. Once the timer starts, each team member must hammer their nail into the wood until it’s flat with the surface. Your time will stop when the last person has finished hammering their nail. Giant Beer Pong For this game, six garbage cans are arranged in a pyramid, and six beers are placed on a table next to the players. There is one ball that will be used for the game. Each player takes a shot at throwing a ball in the cans. If they make it, they must chug a beer, THEN retrieve their ball and move the trash can out of the way before the next player goes. They must retrieve the ball and toss it to the next player if they miss. The game ends when a ball enters the last trash can, and the contestant chugs their last beer. Double Flip Cup For this game, all four players will chug a beer (or water if they prefer) and flip a cup on the table successfully before the next player takes their turn. After all four players flip their cups, they will move to the other side of the table and flip another cup per team member. The game ends when the contestant successfully flips their last cup. Sign Up Now Registering Single Person or Team (Required) Single Person Team Your name (Required) Your Email Address (Required) Team Name Names of team members (not including yourself) + Add to Google Calendar + iCal / Outlook export The event is finished. Date Feb 08 2025 Expired! Time 1:00 pm - 5:00 pm More Info Sign up Location RockPit Brewing 10 W Illiana St, Orlando, FL 32806 Category Unique Events Share this event 0 replies Leave a Reply Want to join the discussion? Feel free to contribute! Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Comment * Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Link to: Grateful Spread at RockPit Brewing Link to: Grateful Spread at RockPit Brewing Grateful Spread at RockPit Brewing Link to: Chris & Tammy’s 25th Wedding Anniversary & Enchantment Under The Sea Dance Link to: Chris & Tammy’s 25th Wedding Anniversary & Enchantment Under The Sea Dance Chris & Tammy’s 25th Wedding Anniversary & Enchantment Under... Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/our-beers/",
      "text": "Our Drinks | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Why do we say “You’ll Dig Our Drinks”? We have 20 taps in our taproom filled with a huge variety of in-house crafted beer, in-house crafted spirits and cocktails, and a variety of wines. The most common thing our customers tell us is, “You have something for everyone.” That’s because we don’t have 17 IPA’s on tap. We usually have 3-5 IPA’s along with a few sours, belgians, germans, lagers, pilsners, seltzer waters, etc. No matter your taste for beer, wine or moonshine, we have something you’ll dig. Miner’s Light ( Lager - American Light ) Our interpretation of a light lager. One that actually has color and doesn’t taste like beer flavored water. Light bodied and crisp, this is sure to please those enthusiastic Coors, Bud and Miller drinkers and introduce them to what beer is supposed to taste like. Even the most ardent craft beer lovers will appreciate this light lager as it’s the style of beer brewed long before the bland, boring beers took over the world. ABV: 5.1% IBU: Cackler IPA ( IPA - American ) Medium-light in body with crisp, clean upfront bitterness. You’ll want to take time to savor the strong tropical and citrus notes that are prevalent in this all-american IPA. Fun fact: A “Cackler” is what they called a miner who let others do the heavy work. Sort of like Derek Zoolander (Click for video) . ABV: 7% IBU: 60 Hops: Magnum, Cascade, Centennial, Chinook Blackstrap Con Leche ( Stout - Milk / Sweet ) This coffee milk stout is smooth and silky with roasted coffee tones and a creamy finish. So easy drinking, yet totally anomalous. Fun fact: Black strap is what miners called coffee. It’s also what they called the oil that went into their oil lamps in the early 1900’s. Which makes us think a lot of miners drank really bad coffee. Oh and “con leche” is spanish for “with milk”. This beer has nothing to do with Spanish culture but we couldn’t think of anything better to use. “With Milk” doesn’t look or sound cool at all. “Con Leche” looks and sound really cool. Go on… Say it… “con leche”. Now say it with a Spanish accent. You feel cool, right? ABV: 6.2% IBU: 30 Other: Lactose SoDo Blondin ( RPB House Blonde ) Our RPB house blonde that’s easy drinking with a light, crisp finish. Fun fact: Blondin’s are aerial ropeways used in open pits in slate quarries to transport wagon loads of rock between locations. ABV: 6% IBU: 18 Malts: 2-row, White Wheat, Golden Naked Oats, Honey Malt Hops: Magnum, Cascade Rye Hard ( Rye Saison ) Yippee-ki-yay, saison lovers. This traditional farmhouse ale sneaks in a hint of spice from the rye malt and a dry, effervescent finish that sneaks up like John McClane in an air duct. ABV: IBU: P.B.R. (Pat’s Big Relocation) ( Pale Ale ) Crisp and easy drinking American Light Lager. ABV: IBU: Hop Rescue 5 ( ipa ) Made with Citra, Mandarina Bavaria, and HBC 472. Big citrus and tropical fruit up front, crisp malt backbone, and a clean, bitter finish. ABV: 6.3% IBU: 87 No One Will Notice ( IPA - New England ) A cashmere hopped, juicy NEIPA with loads of tropical fruit flavors. ABV: 6% IBU: 29 Motorboatin’ ( Florida Agave Lager ) Brewed with 55 pounds of agave, this crisp, refreshing Mexican lager showcases a perfect balance of agave’s natural sweetness and a clean, smooth finish. Brewed in collaboration with one of our amazing regulars, Tim. ABV: IBU: Stupider ( West Coast IPA ) A heavily hopped but perfectly balanced West Coast IPA. Clocking in at over 100 IBUs, this double dry-hopped beer’s citrus and tropical notes shine through, thanks to pounds and pounds of Simcoe and Centennial hops. Columbus Hops adds just a hint of spice on the back end, and the dry finish will make you want another sip immediately. ABV: IBU: Boonedoggle ( Kentucky Common ) The latest in our Pre-Prohibition series, this award winning recipe delivers a light-flavored, malt-accented beer with a slightly dry finish.  It may seem sessionable, but at 5.7% ABV, take your time and enjoy this one.  Notes of caramel and toffee with low floral hop flavor. ABV: 5.7% IBU: Mustache Ride ( Red Ale - American Amber / Red ) Mustache Ride was originally brewed and developed with the help of the Firefighters from Engine #5 . 🚒 It’s a super malty red ale that is perfect no matter what season it is… and mustache rides. ABV: IBU: Whale Oil Beef Hooked ( Stout - Irish Dry ) This dark and delicious Irish stout is a St. Patrick’s Day must-try. With a smooth and creamy texture and hints of roasted malt, it’s the perfect way to celebrate the holiday in true Irish fashion. Cheers to the luck of the Irish! ABV: 5% IBU: Never Go Full Tropic ( Tropical Wheat Ale ) A tropical bouquet of mango, papaya, and pineapple that work seamlessly together to deliver a fruit boost to this huell melon hopped wheat with a sharp finish that doesn’t lay too heavy on the palate. ABV: 5.5% IBU: Huell Hefener ( Hefeweizen ) Banana forward hefeweizen with subtle notes of melon from the Huell Melon hops. If you like hefes or wheat beer, this is for you! ABV: 5.2% IBU: Squeeze The Day ( Key Lime Kolsh ) Kolsch aged with key lime puree and tons of vanilla beans for a tart and sweet flavor. ABV: 6% IBU: Illiana ( belgian golden strong ) Illiana is a Belgian Strong Golden Ale that is deceivingly delicious. At an undetectable 8.5%, you’ll get traditional golden strong flavors like candy, bubble gum, spicy and fruity. Be careful with one. It’s so smooth you’ll need to enjoy it responsibly. Fun fact: Illiana is named after the street we’re located on. ABV: IBU: Yankee Savage – New England IPA ( IPA - New England ) Yankee Savage is our original New England IPA and what we judge all of our other NEIPAs by. We’ve tweaked the recipe to give it better balance, more mouthfeel, and softer bitterness. Brewed and dry-hopped with Citra, Azacca and Motueka hops for a citrusy, hoppy and smooth NEIPA. It is back on tap, grab a pint in the taproom or take some to-go. ABV: 6.5% IBU: 34 Petal to the Mule A refreshing twist on the classic mule, this cocktail blends floral hibiscus with the zing of ginger beer, bright lime juice, a touch of sweetness from simple syrup, and a smooth kick of Florida Cracker Moonshine. Lightly sweet, gently spicy, and citrus-forward with a crisp, floral finish. ABV: IBU: Paloma Possible A light, crisp, and refreshing twist on the Paloma cocktail created by bartender Brittany. Starting with our lavender gin, we top it off with club soda and Fever Tree Sparkling Grapefruit Soda. ABV: IBU: Cold Brew Coffee Old Fashioned A twist on a classic, this rich cocktail blends No Sleep ‘Til Christmas Coffee Moonshine, Paul’s Fault Cinnamon Vanilla Moonshine, demerara syrup, and orange bitters. Deep, spiced, and perfectly balanced—your favorite Old Fashioned with a caffeinated kick. ABV: IBU: Blueblerry Mule A bold twist on a classic, this cocktail blends small-batch lemonade moonshine, handcrafted vodka, blueberry cordial, fresh lemon juice, and spicy ginger beer. Refreshing, zesty, and packed with Southern charm in every sip. ABV: IBU: Cupid’s Run A bold blend of small-batch lemonade moonshine, fresh strawberry purée, tart grapefruit juice, and a kick of fresh jalapeño. Sweet, tangy, and just the right amount of heat—this cocktail is a true Southern sipper with a spicy twist. ABV: IBU: Gold Jacket; Green Jacket; Who Gives A Sh**! This delightful concoction combines the classic flavors of an Arnold Palmer with an extra kick of southern charm. Imagine sipping a tall glass of cool, refreshing lemonade with a healthy shot of our sweet tea moonshine while a gentle breeze rustles through the palm trees. That’s what you get with this cocktail. Named in honor of this scene here. ABV: IBU: Blueberry Lemon Thyme Gin Smash Created with in-house-crafted gin, lemon juice, blueberry juice, fragrant thyme, and a touch of simple syrup for a refreshing cocktail. ABV: IBU: Espresso Martini Freshly brewed espresso with in-house-made Florida Cracker sugarcane shine and in-house-made demerara syrup are finished with a fresh twist of lemon. ABV: IBU: Cinnamon Vanilla Old Fashioned Paul’s Fault (Cinnamon Vanilla sugarcane moonshine), orange bitters, simple syrup, wild italian amarena cherry and orange peel. ABV: IBU: Apple Pie This low-and-slow simmered recipe featuring flavors and aromas of freshly baked apple pie has people raving at the brewery. Created with a unique blend of apple cider, apple juice, cinnamon, nutmeg, ginger, clove, allspice, and orange peel, it will surely make you feel like sweater weather is right around the corner. ABV: IBU: Coconut Lavender Moonshine Lemonade This enticing cocktail combines the exotic essence of coconut puree, the floral charm of lavender syrup, the nostalgic sweetness of old-fashioned lemonade, and a healthy pour of our Florida Cracker Sugar Cane Moonshine. It’s like sipping sunshine from a mason jar, where palm trees sway and laughter fills the air. ABV: IBU: Toes In The Sand A tantalizing twist on the classic Pina Colada that will transport you straight to the shores of paradise. Close your eyes and imagine the feeling of warm sand between your toes as you sip on this sun-kissed delight. Toes In The Sand combines the velvety smoothness of coconut cream, the tropical sweetness of ripe pineapple, and the spirited kick of Florida Cracker Sugarcane Moonshine. It’s like capturing the essence of a sunny beach day in a single glass. As you take your first sip, the creamy coconut cream gently caresses your palate, creating a velvety oasis of flavor. The tropical notes of pineapple burst forth, transporting you to a lush island where the sun shines endlessly. But adding cane sugar moonshine truly sets this drink apart. ABV: IBU: Antonico ( Prosecco ) Traditional sparkling wine with ripe green fruit and citrus notes is perfect for toasting any occasion. ABV: 11% IBU: 83 ( Rose ) This salmon-colored wine is marked by a ripe peach taste. Elegant in mouth with volume at the final. ABV: 12.5% IBU: Bel Vento ( Pinot Grigio ) White wine opens with a nose of Citrus and Floral. Dry with light Citrus and bright Acidity. Flavors of Lemon, Lime, Melon with a mineral finish. ABV: 12% IBU: Seal Rock ( Chardonnay ) Aromas and flavors of caramel apple and melon, with a light buttery finish. ABV: 13% IBU: Hooks Bay ( Sauvignon Blanc ) Pale straw color with a juicy mid-palate. Delicious tropical, bright melon and citrus notes combine with a lovely fresh, mouth-watering acidity. ABV: 13% IBU: Fritz de Katz ( Riesling ) Clear white plum color. Medium-bodied, peach, ripe apple, and mint. Really good bottle for the money. Less earthy, bigger fruit. ABV: 8.5% IBU: Decordi ( Sangue di Giuda (Sweet Red) ) Red semi sweet sparkling wine, coming from the most renowned micro zones of the Oltrepo Pavese area and obtained from Barbera, Croatina, and Uva rara grapes. The nose reminds of crushed berries, dark plums and black cherry. It has a very alluring fruity smell to it. In the mouth, the wine is slightly fizzy and just a touch sweet. Ideal with all desserts and an excellent base for fruit Sangria. ABV: 6.5% IBU: Rowdy Bush ( Petite Syrah ) Light violet in color. Well balanced with totes of plum, oak, and a hint of licorice. ABV: 14.3% IBU: Quantum Leap ( Cabernet ) Aromas of blueberry, leather and dark chocolate. While on the palate offers flavors of raspberry and blueberry complemented with notes of cassis and chocolate for a smooth finish. ABV: 14.6% IBU: Scarlet of Paris ( Pinot Noir ) Cherry and Strawberry on the nose of this Red wine from France. It is dry with soft tannins and light Vanilla spice. Flavors of Cherry, Strawberry, Baking Spice, Oak and Vanilla. ABV: 12.5% IBU: Untitled Art Non-Alcoholic Beer Your choice of Hazy IPA, Pilsner, Chocolate Milk Dark Brew, Mango Dragonfruit Sour ABV: IBU: Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St So this actually happened (the abandoned husband p Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://www.theorlandoreal.com/rockpit-brewing-brings-small-batch-beers-to-the-sodo-district/",
      "text": "Rockpit Brewing Brings Small Batch Beers to the Sodo District x Skip to main content 1 (407) 813-2773 My Dashboard My Dashboard Favorites Saved Searches Messages Preferences Sign Out Sign In Search Homes Dropdown arrow Search The Orlando MLS If you are searching for homes for sale in the Orlando area please use our MLS® search below Orlando Homes Orlando Condos Search MLS Now Orlando Neighborhoods Dropdown arrow Orlando City Baldwin Park Bay Hill College Park Downtown Orlando Dr Phillips Golden Oak Lake Nona Thornton Park Search Orlando Cities Dropdown arrow Cities Celebration Clermont Horizon West Hunters Creek Kissimmee Lake Mary Maitland Mount Dora Orlando Reunion Saint Cloud Windermere Winter Garden Search Orlando Orlando Articles Dropdown arrow Orlando Articles Learn more about everything Orlando has to offer with deep dives into Real\r\n                    Estate, Life in Orlando, & Theme Parks. View All Articles Life In Orlando Theme Parks Real Estate About Us Our Story Careers Menu Close Rockpit Brewing Brings Small Batch Beers to the Sodo District By Cassady Quintana Tucked behind a long-standing staple Cecil’s BBQ, Rockpit Brewing opened its doors in 2019 by co-founders Chris Rock and Sean Burke and quickly became a neighborhood favorite, solidifying its reputation as a top-notch brewer in the community and city. The coal-country themed brewery features a family and pet-friendly taproom and weekly events for everyone to enjoy. Inside Rockpit Brewing The moment you step inside, you're transported to the Kentucky coal-mining era with a warm interior, adorned with wooden accents and communal seating. Whether you're catching up with friends or enjoying some solo time, the relaxed atmosphere at Rockpit Brewing makes it the perfect place to unwind. A fireplace surrounded by couches offers a comfortable spot for friends and family to relax whereas the bar invites patrons to chat with the friendly and knowledgeable staff. The beertenders are ready to make recommendations and guide you through finding your perfect brew. Snacks and Sips Whether you're a seasoned beer aficionado or a casual sipper, Rockpit Brewing invites customers to explore a diverse array of crafted flavors from their ever-changing line-up of small batch beers and cocktails. Each rotation includes 3-5 IPA’s alongside sours, belgians, germans, lagers, pilsners, seltzer waters, and more! Beyond the beer diversity, Rockpit prides themselves in having options for everyone. The taproom is filled with 20 taps ranging from house crafted beer, hard seltzers, ciders, moonshine, and cocktails. Patrons at Rockpit Brewery also enjoy a tasteful perk – the ability to order off an exclusive menu from Cecil's, with the convenience of having the Texas style BBQ dishes delivered right to their table. This collaborative dining experience allows for a more family-friendly atmosphere. What We Ordered: Espresso Martini $9 Blackberry Gin Mule $8 5oz Flight $12 [ Cackler IPA (IPA - American), Sodo Blondin (RPB House Blonde), Acai’nt It (Acai Bowl Sour), & Miner’s Light (Lager - American Light)] Loaded Tots From Cecil’s $8.40 The Espresso Martini, a true delight for coffee lovers, delivered a bold and energizing kick with a perfect blend of rich espresso and premium spirits. For those seeking a fruity twist, we recommend the Blackberry Gin Mule - a balance between fresh blackberries, crispness of gin and a subtle follow up of ginger beer – a refreshing concoction that satisfies. Of course, the stars of the show remain the variety of small-batch beers. From hop-forward ales to robust stouts, Rockpit Brewing's beer selection is a wonderful display of the artistry of brewing. Events Bring some weekly excitement to your days with different events hosted at Rockpit. Happy Hour: Every Monday - Friday from 4-7 PM Trivia: Every Tuesday from 7:30-9:30 PM Game Night: Every Wednesday from 7:30-9:30 PM Teacher Appreciation Happy Hour: Every Friday from 3-7 PM Morning Yoga & Beer: Every Saturday from 10-11 AM Concerts Football Watch Parties Markets Rockpit Brewing isn't just a brewery; it's a week-long event of activities, fun, and fantastic craft brews. Come for the beer, stay for the fun – there's something for everyone at Rockpit! Overall Let Rockpit Brewing be your go-to spot for a casual and inviting experience in the heart of Orlando, where you can choose from a variety of drinks for a fun night out. Cheers to good times, great company, and the craft of brewing! SoDo District Orlando's vibrant SoDo district (short for \"South of Downtown\"), pulsates with local energy and character. Best known for its surrounding historic neighborhoods and one of Orlando’s most established hospitals, Orlando Health, this neighborhood and its residents continue to revitalize Orange Avenue and Michigan Street. Alongside mom-and-pop restaurants and local shops, large retail chains have also invested in the area offering diverse options to the community. The SoDo district caters to all ages and stages of life by offering a wide range of housing options from apartments to single-family homes. If you’re interested in finding a home in the area, our team would be happy to help! The Orlando Real is sponsored by The Pozek Group. If you’re thinking of buying or selling a home in Orlando, reach out and we would love to help! Search Downtown Orlando Real Estate Listings All Listings $100,000 - $200,000 $200,000 - $300,000 $300,000 - $400,000 $400,000 - $500,000 $500,000 - $600,000 $600,000 - $700,000 $700,000 - $800,000 Over $1,000,000 Bedrooms Bathrooms Price Range Refine\n                        Search Save\n                        Search Sort by: Newest First Dropdown arrow $499,995 150 E Robinson Street 1709, ORLANDO 2\n                                    Beds 2\n                                    Baths 1,226 SqFt Residential MLS® # O6212883 New $1,300,000 ↓ $50,000 150 E Robinson Street 2102, ORLANDO 3\n                                    Beds 3\n                                    Baths 2,158 SqFt Residential MLS® # O6338817 New $350,000 150 E Robinson Street 1205, ORLANDO 1\n                                    Bed 2\n                                    Baths 985 SqFt Residential MLS® # O6340706 $340,000 11 W Harding Street C, ORLANDO 3\n                                    Beds 3\n                                    Baths 1,589 SqFt Residential MLS® # O6340654 $625,000 150 E Robinson Street 2006, ORLANDO 2\n                                    Beds 2\n                                    Baths 1,260 SqFt Residential MLS® # O6340064 $525,000 150 E Robinson Street 2203, ORLANDO 2\n                                    Beds 2\n                                    Baths 1,132 SqFt Residential MLS® # O6337872 $275,000 151 E Washington Street 408, ORLANDO 2\n                                    Beds 2\n                                    Baths 975 SqFt Residential MLS® # O6339304 $1,225,000 150 E Robinson Street 2701, ORLANDO 3\n                                    Beds 3\n                                    Baths 2,011 SqFt Residential MLS® # O6339108 $239,900 155 S Court Avenue 1908, ORLANDO 1\n                                    Bed 1\n                                    Bath 837 SqFt Residential MLS® # O6338165 $715,000 150 E Robinson Street 1612, ORLANDO 2\n                                    Beds 2\n                                    Baths 1,282 SqFt Residential MLS® # O6337005 $229,900 155 S Court Avenue 1614, ORLANDO 1\n                                    Bed 1\n                                    Bath 728 SqFt Residential MLS® # O6337528 $190,000 ↓ $10,000 155 S Court Ave 1308, ORLANDO 1\n                                    Bed 1\n                                    Bath 837 SqFt Residential MLS® # S5124183 1 2 3 4 6 Next Arrow right Find Your Orlando Dream Home Sell Your Home In Central Florida Posted by The Orlando Real on December 13th, 2023 Tags bar (23) drinks (10) beer (8) downtown (5) Facebook Share this post on Facebook Twitter Tweet this post on Twitter Email Send a link to post via Email Leave A Comment Leave text box empty Full Name - required Email Address - required Website Link e.g. yourwebsitename.com Comment - required Submit Comment Please note that your email address is kept private upon posting. Search Search Blog Navigation Arrow right All Categories Arrow right Life in Orlando Arrow right Theme Parks Arrow right Real Estate Rss Feed Our Company About Us Careers Read our blog Contact Us 270 W Plant Street Suite 230 Winter Garden, FL 34787 Youtube Facebook LinkedIn Communities Orlando Winter Garden Windermere Sellers Request Valuation Sell With Us Buyers Search Listings Mortgage Calculator Each Office Individually Owned and Operated **Hablamos Español © 2025 Real Estate Webmasters All Rights Reserved. Sitemap Privacy Policy Real Estate Webmasters will open a new window All listing information is deemed reliable but not guaranteed and should be independently verified through personal inspection by appropriate professionals. Listings displayed on this website may be subject to prior sale or removal from sale; availability of any listing should always be independently verified. Listing information is provided for consumer personal, non-commercial use, solely to identify potential properties for potential purchase; all other use is strictly prohibited and may violate relevant federal and state law. Listing data comes from My Florida Regional MLS DBA Stellar MLS. Listing information last updated on September 11th, 2025 at 6:45pm EDT. Close Sign up today & get the latest on Orlando directly to your inbox! Keeping you up to date on real estate, theme parks, and life in Orlando! Leave text box empty Leave text box empty First Name - required Last Name - required Email - required Provide a valid email address. Newsletter consent Submit Form"
    },
    {
      "url": "https://rockpitbrewing.com/weve-been-falsely-accused/",
      "text": "We’ve been falsely accused. | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu We’ve been falsely accused. The following is an email I wrote last Monday (October 14th, 2020) as part of the daily emails I send out. After being asked about this issue again, I decided to post the email here so you’re clued in on the situation. And if you don’t receive my emails, go here to sign up . You’ll be the first to know about all things RockPit, including all the insanely funny things that happen to us. 🙂 —– I’m not too fond of politics and I hate that I have to write this in the first place. Either way, politics have been intertwined into our business in the weirdest way possible and I need to clear something up. About a month ago, I received a message on Instagram. Essentially it said, “We were going to come into RockPit, but we saw a political sign on your building and decided to leave.” I happened to be at the brewery at the time and went outside to investigate. I looked at our building, and I didn’t see what they were talking about. I went out to the road, thinking maybe someone stuck a sign in the front parking lot. Nothing. But then, I looked at the building next to the RockPit building, and I spotted it. I was like… For those that don’t know, there are two buildings on our property. RockPit occupies the one on the left. Orlando Homebrew Supplies occupies the bottom floor of the one on the right , and we use the warehouse (the big garage door) for storage. But what most people don’t know is there is an apartment upstairs above OHBS. In fact, this is probably you right now… That apartment is occupied by an employee of the person that owns both of the buildings. They have been living in that apartment before we signed our lease back in 2018. And yes, the occupant of the apartment has a political sign of a presidential candidate in his window. I could see how people would confuse that window for one in our building and assume it was our sign. After all, it does look like it’s all one building. To be perfectly clear, I don’t care about the sign. I don’t get offended by the sight of a sign and assumed others wouldn’t either so I haven’t addressed the issue on a mass scale. And to be fair, most of our customers couldn’t care less. But with multiple people letting me know they and their friends won’t come to RockPit because they thought we had a political sign in our window, I felt like I had to clear this up. If you think I’m writing this to distance ourselves from our neighbor, you’d be wrong. I couldn’t care less what political sign they have in their window. Trump, Biden, Asteroid 2020, whatever. I’m writing this for two reasons. 1) If you aren’t coming to RockPit because you assumed the sign was ours, now you know why it’s there. And to quote G.I. Joe: Knowing is half the battle. Side note: I’m so happy I finally got to use that GIF. 2) As usual, I like to give you insight into the absurdity business owners have to deal with. Especially in the current political climate. It’s never boring, that’s for sure. Just another day in paradise. Seriously though. I love this stuff. Running a business without problems would probably be boring. Glad I don’t have to do it. Now if you’re wondering why I keep highlighting the word “assumed”, there’s a good reason for it. I want you to stop doing something. If you stop doing this, you’ll immediately improve all areas of your life. Your work life will be less frustrating, your relationships will improve and you’ll be in a better mood all the time. You ready for it? Here it is: stop making assumptions. Assumptions are the root of so many of your frustrations and create unnecessary problems in your life. If you ever muttered the statement “I just assumed…” and discovered you were wrong, you know what I’m talking about. Unclear about something? Ask questions. The truth, less frustration, and more happiness are on the other side of questions. Falsehoods, stress, and sadness are on the other side of assumptions. I mean, think about how sad it was for those who made the assumption that the political sign was ours and have missed out on some of the best beer and atmosphere in Orlando because of it. Even sadder is if they’re still unaware, they’re going to miss out on Buried Sunshine (our fastest selling New England IPA) and our new Rock Hard Water with Pineapple and Coconut this week. It breaks my heart to think about them missing out on those releases. I’m stoked you won’t have to suffer that fate. Cheers and I’ll see you at RockPit this week, Chris So there you go. I hope that by posting that here, it will clear up the confusion. And again, if you don’t receive my emails, go here to sign up and add a little bit of spice to your day. Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Link to: Escape to the beaches of RockPit this week for two tropically delicious releases and Hawaiian brunch. Link to: Escape to the beaches of RockPit this week for two tropically delicious releases and Hawaiian brunch. Escape to the beaches of RockPit this week for two tropically delicious releases... Link to: Undecided on who to vote for? Let us help you decide. Link to: Undecided on who to vote for? Let us help you decide. Undecided on who to vote for? Let us help you decide. Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "text": "Contact Us - Spruko Technologies | Get in Touch with Us Today sales@team.spruko.com +91 888-613-3855 | +91 888-613-3955 Home IT Services Business Consulting Company About Us Careers Why Choose Us? Events Technology Web Technologies PHP Laravel Codeigniter Combined Shape Cake PHP Node.js Frontend Technologies React JS Angular JS Next JS JavaScript Typescript Vue JS Nuxt JS Svelte Backend Technologies Node.js PHP ASP.NET Microsoft Technologies ASP.NET Core & MVC Blazor Frameworks Bootstrap Tailwind Django Laravel Flask Symfony Ready to take your business to the next level? Contact us today and let's build the future together. Contact Us Products Web Applications Innovative software solutions to boost productivity and streamline your operations. Dashboard Templates Customizable templates for quick, professional designs and creative projects. Explore our successful projects Showcasing our successful projects and client solutions. View Portfolio Introducing LivaChat LivaChat, our latest live chat solution for seamless communication. View Details Hosting Shared Hosting Linux Shared Hosting WordPress Hosting Windows Shared Hosting Hosting Servers Linux KVM VPS Dedicated Servers Windows Dedicated Servers Reseller Hosting Linux Reseller Hosting Windows Reseller Hosting Cloud Hosting Cloud Hosting Security SSL Certificates SiteLock Malware Detector Domain Register a Domain Hosting Starter Combo Choose your bundle & be on your way View Combo Offers Email & Productivity : Business Email Google Workspace Enterprise Email Titan Business Email Grow your business with our private-labeled services Join Reseller Program Services Development Web Development Custom Software Development SaaS Product Development API Development and Integration Custom CRM Development Custom E-commerce Development Educational Technology (EdTech) Development Healthcare Software Development AI Integration Services Chatbot Services Whatâs App Business API Services Digital Marketing Social Media marketing Content Marketing on Social platforms Meta Ads/ Paid Marketing Search Engine optimization Generative content optimization Google Analytics Search and Display Ads Performance Marketing Remarketing & Retargeting Ads Branding Brand Nomenclature Logo design and Brand story Brand Guidelines Collateral designs and Branding Brand Identity designs Iconography and Visual identity Other Services Technology Consulting UI/UX Design UI/UX Consulting Technical Support Installation Services Hosting Services Domain Registration Contact Us Request Quote Contact Us Get in Touch Seeking innovative solutions, exciting opportunities, or a trusted digital partner? You've found the right place. Reach out to us, and our dedicated team will address all your inquiries. To kickstart the conversation, simply share your details with us, and weâll respond promptly to help you explore. Pre-Sales Expert advice before you buy sales@team.spruko.com Support Mon-Fri from 10am to 5pm. https://support.spruko.com Careers Mon-Fri from 10am to 5pm. hr@team.spruko.com Legal Business protection and compliance. legaldept@team.spruko.com Sales Contact Quick help, just a call away. +91 888â613â3855 , +91 888â613â3955 Contact Lets get in touch You can reach us anytime via https://support.spruko.com First Name Last Name Email Phone Number Country Message You agree to our terms and conditions. Get Started 7+ Years Field Experience 200+ Projects Done Around World 24/7 Customer support +20K Happy customers 1 Day Response Time Visit our office SPRUKO TECHNOLOGIES PRIVATE LIMITED\n                                Hyderabad Corporate Office : H.NO.1, LIG 215, 8-67/83, near Tulasi Hospitals Ecil, APIIC Colony, Kushaiguda,Telangana, Hyderabad â 500062. India. Support: Email: support@team.spruko.com Mobile : +91 888-613-3855 Mobile : +91 888-613-3955 Phone: 040 2712 2233 Pre Sales: Email: sales@team.spruko.com Mobile : +91 888-613-3855 Mobile : +91 888-613-3955 Phone: 040 2712 2233 We offer the expertise and strategic guidance to drive your business forward and achieve sustained growth. Get Started Embark on your next big success Our Team is ready to provide tailored strategies to accelerate your business growth. Get an appointment now 1 Day Response Time 100% Client Satisfaction 7+ Years Field Experience Services Development Digital Marketing Branding Hosting Company About Us Why Choose Us? Careers Events Products Uhelp LivaChat Primo Slider SPK Editor Legal Licenses License Faq's Terms & Conditions Privacy Policy Phone +91 888-613-3855 +91 888-613-3955 Mail support@team.spruko.com sales@team.spruko.com © 2024 All rights reserved by Spruko Technologies Private Limited"
    },
    {
      "url": "https://rockpitbrewing.com/follow/",
      "text": "Follow Us | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Follow us on social media, get emails and text messages to be the first know about can’t miss events, beer releases and alien invasions before anyone else Follow Us On Facebook Click the icon below Follow Us On Instagram Click the icon below The only email locals read every week. My name is Chris Rock. I’m one of the co-founders of RockPit brewing. Every week, I’ll send you an email that you’ll actually look forward to. Why? Because I don’t send you the typical “Here’s what happening at RockPit this week”. I take the time to truly connect you to RockPit brewing on a personal level. You’ll get to know us better and we’ll get to know you. Also, I purposely use bad grammar and misspell words in the email. If you find the mistakes, you’ll earn a free beer. You MUST BE QUICK though. I only send a limited number of beers per week. So sign up. Get connected. Find mistakes. Get free beer. Pretty good deal, eh? First Name Last Name Email Address Phone Number We'll send you a text a few times a month about can't miss events, big beer releases and more. Also, if there happens to be an alien invasion, we'll let you know. Birthday (MM/DD) If you want a free beer flight for your birthday, give us your birth date. We'll send you an email and a text reminding you to come in for your free beer flight. Signup Form Website FreeBeerFunnel TopBrewer BogoBeerOffer BiteMagazine BirthdayFlight Sign Up >> Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/food/",
      "text": "Food | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu For more than 25 years Cecil’s BBQ has been a staple of the SoDo district . Tens of thousands of Orlando residents and visitors alike have been enjoying their mouth-watering Texas Style BBQ since 1992. We’ve teamed up with our neighbors, Cecil’s BBQ to bring you an exclusive menu (see below) unlike any other found in breweries in Orlando. Cecil’s knocked it out of the park with their menu for us. You’ll now be treated to world-class BBQ by Cecil’s BBQ while enjoying beer you won’t find anywhere else in Orlando. Cecil’s BBQ @ RockPit Hours Of Operation: Monday – Thursday 12 PM to 8:30 PM Friday – Saturday 12 PM to 9:30 PM Sunday 12 PM to 7:00 PM Regular Menu Appetizers Bacon Wrapped Jalapenos (5) $7.50 Five jalapenos wrapped in bacon, stuffed with cream cheese and slowly smoked to perfection to bring you just the right amount of heat. French Fry Basket $8.75 A basket full of hearty steak fries. Includes choice of Ranch or Spicy Ranch for dipping. Loaded Tots $8.40 Crispy tater tots smothered in cheese, bacon and chives. Add pulled pork or smoked chicken for an extra $3.00 Nachos $10.95 Fresh corn tortilla chips topped with shredded lettuce, diced tomatoes and sliced jalapenos with a creamy cheese sauce.  Side of salsa included. Add pulled pork or smoked chicken for an extra $3.00 or Smoked Brisket for an extra $3.75 Corn Chips & Salsa $5.60 Freshly cut and fried corn chips served with a chunky style salsa. Add a side of Queso for an extra $3.60 Homemade Kettle Chips $5.60 Basket of fresh, hot homemade kettle chips. Add beer cheese, hot melted cheddar or queso for an extra $3.60 Cheese Curds $8.70 Breaded and lightly fried to perfection, these cheese curds are filled with cheesy goodness. Served with a marinara sauce. Fried Okra with Spicy Ranch $7.80 These bite-sized, silky chunks of the Bayou are breaded and lightly fried, perfect for snacking and sharing. Served with a slightly spicy ranch dressing. Pretzel Bites $7.25 12oz baked and warm soft pretzel bites topped with coarse salt.  Served with spicy mustard. Add Cheddar Cheese or Beer Cheese for an extra $3.60 Smoked Chicken Egg Rolls (3) $9.25 Shredded smoked chicken, cheddar cheese, coleslaw and a tad of Cecil’s Hot BBQ Sauce in a crispy fried wonton. Entrees Grilled Cheese with Chips $6.95 Your choice of Cheddar, Provolone, or Jalapeno Jack pressed between two buttery pieces of Texas Toast. Add Pulled Pork or Smoked Chicken for an extra $3.00. Extra slice(s) of cheese for $0.60 more each. Smoked Meat Sliders $9.50 Two sliders (same type meat) with your choice of:  smoked chicken, pulled pork, smoked sausage, smoked ham, turkey, chicken salad, or brisket.**  Served with Cecil’s very own potato chips. ** Brisket is an extra $2.00 Get ‘em Topped with beer cheese for an extra $3.50 Smoked Meat Tacos $8.50 Two soft flour tortillas, a little queso and your choice of smoked chicken, pulled pork, or smoked brisket** and topped with freshly shredded cheese, lettuce, and cilantro. Served with a side of chips and salsa. (Both tacos must be the same choice of meat.) Add a side of Queso for an extra $3.60 **Brisket is an extra $1.50 Pulled Pork Sundae $8.99 BBQ Beans, Coleslaw and Pulled Pork layered and topped with yummy BBQ Sauce for total experience in a cup! Regular Sandwich on a Bun $12.95 Your choice of smoked chicken, pulled pork, smoked sausage, turkey, or brisket. Comes with a single side item. Large Sandwich on Texas Toast $14.95 Your choice of smoked chicken, pulled pork, smoked sausage, turkey, or brisket.  Comes with a single side item. Meat Plate $12.95 A lunch-sized portion of meat and a piece of Texas Toast.  Your choice of smoked chicken, pulled pork, smoked sausage, turkey, or brisket.  Comes with a single side item. Three (3) Rib Plate $14.95 Three full-sized pork ribs, rubbed, smoked and served piping hot.  Comes with a single side item. Smoked Wings (8) $11.95 8 Large Wings, slowly smoked to perfection, lightly fried for a crisp bite,  and then tossed in your choice of sauce: BBQ Buffalo Garlic Parmesan (Dry or Wet) Smoked Butter Sweet Citrus Mango Habanero You can order them dry with your choice of sauce on the side.  Comes with your choice of Blue Cheese or Ranch for dipping. Sides (add to any entree) $3.25 Barbeque Beans Cole Slaw Hot Beans Sweet Potato Souffle Green Beans Potato Salad Black-Eyed Peas Cool Cucumber Salad Jalapeño Mashed Potatoes Collard Greens French Fries Mac-N-Cheese Desserts Texas Mud $3.50 If you like chocolate, you are going to love this. Chunks of Oreo smothered with chocolate mousse, splashed with chocolate syrup, layered on more Oreo chunks. Banana Pudding $3.50 Layer upon layer of vanilla wafers and banana pudding. It’s ok to get two of them – one for now, one for later. Extras Side Queso or Beer Cheese $3.60 Extra Ranch, Blue Cheese, Spicy Mustard or Sour Cream $.80 Extra Salsa (3.25 oz) $1.80 Extra side of BBQ $.50 Sweet, Mild or Hot Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St So this actually happened (the abandoned husband p Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://bonsaibar.com/products/rockpit-brewing",
      "text": "RockPit Brewing\n– Bonsai Bar Skip to content Close menu EVENTS Beginner Workshops California Colorado Connecticut Florida Louisiana Massachusetts Maine New Jersey New Hampshire New York City New York Pennsylvania Rhode Island Texas Washington Repotting Workshops MA Repotting RI Repotting TX Repotting CA Repotting Next Level Workshops CT Next Level MA Next Level RI Next Level PRIVATE EVENTS STORE Apparel Bonsai Trees DIY Kits Gift Cards Pots Supplies ABOUT US About Us Work With Us Tree Guarantee Contact Us TREE CARE HELP Tree care Refund policy FAQ's Log in Instagram Facebook YouTube Cart Close cart Subtotal $0 Shipping, taxes, and discount codes calculated at checkout. Check out Your cart is currently empty. BonsaiBar.com homepage Instagram Facebook YouTube Log in Site navigation Cart EVENTS Beginner Workshops California Colorado Connecticut Florida Louisiana Massachusetts Maine New Jersey New Hampshire New York City New York Pennsylvania Rhode Island Texas Washington Repotting Workshops MA Repotting RI Repotting TX Repotting CA Repotting Next Level Workshops CT Next Level MA Next Level RI Next Level PRIVATE EVENTS STORE Apparel Bonsai Trees DIY Kits Gift Cards Pots Supplies ABOUT US About Us Work With Us Tree Guarantee Contact Us TREE CARE HELP Tree care Refund policy FAQ's Search \"Close (esc)\" Search \"Close (esc)\" Close (esc) Close (esc) Close (esc) Close (esc) Close (esc) RockPit Brewing Share Share on Facebook Tweet Tweet on Twitter Pin it Pin on Pinterest Level: Beginner Date September 28, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) October 12, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) October 26, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) November 9, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) November 23, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) December 7, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) December 21, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) Ticket Bonsai Bar @ RockPit Brewing Quantity − + In stock, ready to ship Inventory on the way Regular price $85 / Add to cart This item is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. September 28, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) / Bonsai Bar @ RockPit Brewing - Sold Out October 12, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) / Bonsai Bar @ RockPit Brewing - $85 USD October 26, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) / Bonsai Bar @ RockPit Brewing - $85 USD November 9, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) / Bonsai Bar @ RockPit Brewing - $85 USD November 23, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) / Bonsai Bar @ RockPit Brewing - $85 USD December 7, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) / Bonsai Bar @ RockPit Brewing - $85 USD December 21, 2025 12:00 PM / Dwarf Jade (Portulacaria Afra) / Bonsai Bar @ RockPit Brewing - $85 USD Notice Please arrive at least 15 MINUTES BEFORE your event to ensure your group can sit together, ORDER FOOD AND DRINK , and pick your FAVORITE TREE & POT! About the Event Beginner workshops are perfect for you to grab your friends, grab a drink and come make tiny trees! We’re bringing the awesome art of bonsai out of the hedged in gardens and into the streets! Or at least into your favorite bars/breweries/pubs.  Bonsai Bar is a night of fun you don’t want to miss. Learn the fundamental skills and techniques behind the art of bonsai while enjoying a night out with friends! Our teachers will introduce core concepts and guide your experience as you pot, prune, and design your very own bonsai tree! About the Venue Venue:  RockPit Brewing Address: 10 W Illiana St, Orlando, FL 32806  | Get Directions Website: RockpitBrewing.com The SoDo District’s family-owned, neighborhood brewery and distillery with a warm & family-friendly taproom and an ever-changing line-up of small-batch beers and cocktails. *Under 21 policy: Please contact venue for details regarding underage entry Beginner Tree Guarantee Our beginner tiny trees are so hardy we guarantee you can keep yours alive, or we’ll replace it. [{\"id\":52497713660272,\"title\":\"September 28, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"option1\":\"September 28, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"option2\":\"Bonsai Bar @ RockPit Brewing\",\"option3\":null,\"sku\":\"2473191\",\"requires_shipping\":false,\"taxable\":true,\"featured_image\":null,\"available\":false,\"name\":\"RockPit Brewing - September 28, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"public_title\":\"September 28, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"options\":[\"September 28, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"Bonsai Bar @ RockPit Brewing\"],\"price\":8500,\"weight\":0,\"compare_at_price\":null,\"inventory_management\":\"shopify\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":52497713693040,\"title\":\"October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"option1\":\"October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"option2\":\"Bonsai Bar @ RockPit Brewing\",\"option3\":null,\"sku\":\"2473192\",\"requires_shipping\":false,\"taxable\":true,\"featured_image\":null,\"available\":true,\"name\":\"RockPit Brewing - October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"public_title\":\"October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"options\":[\"October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"Bonsai Bar @ RockPit Brewing\"],\"price\":8500,\"weight\":0,\"compare_at_price\":null,\"inventory_management\":\"shopify\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":52497713725808,\"title\":\"October 26, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"option1\":\"October 26, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"option2\":\"Bonsai Bar @ RockPit Brewing\",\"option3\":null,\"sku\":\"2473193\",\"requires_shipping\":false,\"taxable\":true,\"featured_image\":null,\"available\":true,\"name\":\"RockPit Brewing - October 26, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"public_title\":\"October 26, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"options\":[\"October 26, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"Bonsai Bar @ RockPit Brewing\"],\"price\":8500,\"weight\":0,\"compare_at_price\":null,\"inventory_management\":\"shopify\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":52497713758576,\"title\":\"November 9, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"option1\":\"November 9, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"option2\":\"Bonsai Bar @ RockPit Brewing\",\"option3\":null,\"sku\":\"2473194\",\"requires_shipping\":false,\"taxable\":true,\"featured_image\":null,\"available\":true,\"name\":\"RockPit Brewing - November 9, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"public_title\":\"November 9, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"options\":[\"November 9, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"Bonsai Bar @ RockPit Brewing\"],\"price\":8500,\"weight\":0,\"compare_at_price\":null,\"inventory_management\":\"shopify\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":52497713791344,\"title\":\"November 23, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"option1\":\"November 23, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"option2\":\"Bonsai Bar @ RockPit Brewing\",\"option3\":null,\"sku\":\"2473195\",\"requires_shipping\":false,\"taxable\":true,\"featured_image\":null,\"available\":true,\"name\":\"RockPit Brewing - November 23, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"public_title\":\"November 23, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"options\":[\"November 23, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"Bonsai Bar @ RockPit Brewing\"],\"price\":8500,\"weight\":0,\"compare_at_price\":null,\"inventory_management\":\"shopify\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":52497713824112,\"title\":\"December 7, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"option1\":\"December 7, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"option2\":\"Bonsai Bar @ RockPit Brewing\",\"option3\":null,\"sku\":\"2473196\",\"requires_shipping\":false,\"taxable\":true,\"featured_image\":null,\"available\":true,\"name\":\"RockPit Brewing - December 7, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"public_title\":\"December 7, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"options\":[\"December 7, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"Bonsai Bar @ RockPit Brewing\"],\"price\":8500,\"weight\":0,\"compare_at_price\":null,\"inventory_management\":\"shopify\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":52497713856880,\"title\":\"December 21, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"option1\":\"December 21, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"option2\":\"Bonsai Bar @ RockPit Brewing\",\"option3\":null,\"sku\":\"2473197\",\"requires_shipping\":false,\"taxable\":true,\"featured_image\":null,\"available\":true,\"name\":\"RockPit Brewing - December 21, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"public_title\":\"December 21, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"options\":[\"December 21, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"Bonsai Bar @ RockPit Brewing\"],\"price\":8500,\"weight\":0,\"compare_at_price\":null,\"inventory_management\":\"shopify\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}}] {\"id\":52497713693040,\"title\":\"October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"option1\":\"October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"option2\":\"Bonsai Bar @ RockPit Brewing\",\"option3\":null,\"sku\":\"2473192\",\"requires_shipping\":false,\"taxable\":true,\"featured_image\":null,\"available\":true,\"name\":\"RockPit Brewing - October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"public_title\":\"October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra) \\/ Bonsai Bar @ RockPit Brewing\",\"options\":[\"October 12, 2025 12:00 PM \\/ Dwarf Jade (Portulacaria Afra)\",\"Bonsai Bar @ RockPit Brewing\"],\"price\":8500,\"weight\":0,\"compare_at_price\":null,\"inventory_management\":\"shopify\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}} Workshop FAQs Can two people share one tree/ticket? No. Our events are ticketed per person, not per tree, so everyone attending must have a ticket. This is because space is limited in our venues and we need to be able to sell tickets for every seat we have available. If someone takes a seat in our space without having purchased a ticket, that means someone who purchased a ticket may not have a seat. Thank you for understanding. Are Bonsai Bar workshops 21+? Maybe! We want everyone of all ages to get to enjoy the fun of tiny trees. Luckily most of our venues are family friendly and allow those that are underage to enter with a parent/guardian. Please see the \" UNDER 21 POLICY \" listed above or contact the venue directly. Are drink tickets included in the price of a ticket? No. When should I arrive to the event? Please arrive 15 minutes before the scheduled event to get checked in and grab yourself a drink. Workshops start promptly as scheduled! Is there a waitlist if this workshop is sold out? We do not currently have a waitlist. Tickets are first come, first serve. What's included with a ticket? You get to keep: A tree you pick A ceramic pot you pick to replant your tree 2-hours of of bonsai wisdom We have for you to borrow: A bin to hold it all in Sheers to trim Chop stick Wire for sculpting Soil for repotting What is Bonsai Bar's Cancelation/Refund Policy? RESCHEDULING, CANCELING OR TRANSFERRING YOUR TICKETS PLEASE UNDERSTAND OUR POLICIES BEFORE YOU PURCHASE TICKETS. We do not offer refunds unless a particular class does not reach minimum numbers or, for some unforeseen reason, must be canceled or rescheduled by Bonsai Bar. In this case, you will offered a full refund. You will first be offered the option to choose a future class to attend.​ If you cannot attend class, you must contact us BEFORE the class, and we will reschedule you for a future class. You must email us before 10 AM on the day of your scheduled class. You may rebook your class for an upcoming class at any brewery location we offer. Please get in touch with Bonsai Bar, not the host brewery. Happy Bonsai Customers ★★★★★ We had an amazing time and now my husband is bonsai obsessed! He's been researching and watching videos,  and every walk he is looking out for more trees that would be good to bonsai. This was the perfect introduction to a new hobby! Y'all were so knowledgeable, funny,  and inspiring.  We hope to make part 2 in 9 months or so. Thank you! Casey ★★★★★ Attended an event at Smug Brewery! Tim and Annie were awesome!!! Fun and informative....they are passionate about Bonsai and it shows! Looking forward to future events with different species!! Highly recommend! You won't be disappointed! Jessica ★★★★★ What a fun event. my husband and I both had a good time. The guys were knowledgable, funny and so helpful. If you haven't signed up for one of these classes yet..DO IT!! Michele ★★★★★ So much fun…excellent job teaching basics of Bonsai! Kathleen ★★★★★ We went to Bonsai Bar at Trident Booksellers on 10 FEB 2022.  We had a great time, thank you so much. I highly recommend doing this.  Tim and Ben made it relaxing, funny and they were super helpful. Thomas J Martinuk ★★★★★ I had a great time at the most recent Bonsai Bar event. The class was fun and informative. The instructors were very hands-on and you could tell they truly enjoyed what they were doing. If you are interested in getting into bonsai this was a great place to start. I could not have been happier with the entire experience. Josh Nearby Workshops RockPit Brewing $85 Footer Menu Footer Menu EVENTS GIFT CARDS PRIVATE EVENTS STORE ABOUT US Terms of Service Refund Policy Contact Information Press Host a Workshop Bonsai Bar Bonsai Bar Bonsai Bar is a pop-up beginner bonsai workshop taught in breweries and distilleries. Join our Beginner Bonsai Workshops for a hands-on experience that teaches you the basics of bonsai care, pruning, and styling. Create your own tree, gain expert tips, and leave with the skills to keep your bonsai thriving while learning from expert instructors. NEWSLETTER NEWSLETTER Subscribe for the latest programs, events, and resources available. Enter your email Subscribe Subscribe Instagram Facebook YouTube © 2025 Bonsai Bar Powered by Shopify \"Close (esc)\" RockPit Brewing"
    },
    {
      "url": "https://wineandcanvas.com/orlando/venue/rockpit-brewing-and-distilling/",
      "text": "RockPit Brewing and Distilling - Orlando - Wine and Canvas - Orlando Find Another Location FAQ Shopping Cart Shopping Cart 0 Shopping Cart What We Do Canvas Paint and Sip Parties Cookies and Canvas Board Art Wine Glass Painting Paint Your Pet Private Parties Event Calendar Private Events Shop Mobile Painting Party Pack “On-Demand” Paint and Sip eGift Certificate Contact Us Blog Teach Events Menu Menu 0 events found. <<< ALL EVENTS Notice There were no results found. Notice There were no results found. RockPit Brewing and Distilling – Orlando Events Venues RockPit Brewing and Distilling – Orlando RockPit Brewing and Distilling – Orlando Join us at RockPit Brewing & Distilling for your next Paint and Sip event! Orlando’s neighborhood brewery & distillery with a warm & laidback taproom where a room full of strangers feels like home. This is a family friendly venue great for all types of social groups About RockPit Brewing & Distilling: Orlando’s go-to craft brewery for laid-back vibes and small-batch brews! This inviting local hotspot features a rotating selection of house-made beers, handcrafted sodas, and a welcoming atmosphere that’s perfect for a creative night out. With spacious indoor seating, rustic-industrial charm, and delicious bites from on-site food partners, RockPit Brewing sets the perfect scene for your next Paint & Sip experience. Learn more at their WEBSITE . Plan a Private Paint and Sip at RockPit Brewing & Distilling: If you have a group of 8 or more people, you can schedule a private paint and sip event at RockPit Brewing & Distilling! Contact us to learn more about the process. Bookings depend on artist and venue availability. RockPit Brewing and Distilling – Orlando 10 W Illiana St Orlando , FL 32806 United States Get Directions 407-826-1773 https://rockpitbrewing.com/ Events at this venue Today Upcoming Upcoming Select date. Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file We Put the ART in pARTy! Navigate Find Location Private Events Contact Us Blog Contact Info Phone: (866) 631-0226 Email: support@wineandcanvas.com Follow Us: Facebook Instagram Youtube © - Wine & Canvas, All Rights Reserved | Website Design Privacy Policy Terms & Conditions Account Access Accessibility Link to: Flippers Pizzeria O-Town Link to: Flippers Pizzeria O-Town Flippers Pizzeria O-Town Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://craftbeerlocations.com/beerspot/rockpit-brewing-brewery-in-orlando-florida/",
      "text": "Find Craft Beers at RockPit Brewing Brewery in Orlando Florida Near You - Craft Beer Locations Near You Skip to content Craft Beer Locations Near You Home Locations USA Alabama Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi New Hampshire New Mexico New Jersey New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Virginia West Virginia Washington Wisconsin Wyoming UK Submit Your Spot! Blog My Account Contact 0 MAP SEARCH RockPit Brewing Brewery in Orlando Florida Brewery, Beer garden, Beer hall, Brewpub ( 727 reviews ) ADDRESS & CONTACT Address 10 W Illiana St, Orlando, FL 32806 GPS 28.5106568, -81.3769318 Telephone +1 407-826-1773 Web https://rockpitbrewing.com/ Plan My Route OPENING HOURS Monday 12-10PM Tuesday 12-10PM Wednesday 12-10PM Thursday 12-10PM Friday 12PM-12AM Saturday 12PM-12AM Sunday 12-8PM CLAIM LISTING Is info on this listing outdated? Are you owner of this business? Register and claim it now. This location is pending verification. If you are the owner reach out to help@craftbeerlocations.com Discover RockPit Brewing: Your Local Brewery in Orlando, Florida Looking for a great place to enjoy craft beer near you? Welcome to RockPit Brewing, your go-to brewery in Orlando, Florida. As a premier destination for craft beer lovers, we offer a wide variety of unique and flavorful brews, brewed with passion and precision. Whether you’re a beer connoisseur or new to the world of craft beer, we have something for everyone. Located at 10 W Illiana St, Orlando, FL 32806, Southeast Orlando, 10 W Illiana St, 32806, our brewery is easily accessible for residents of Orlando and surrounding areas. Stop by and discover why RockPit Brewing has become a favorite spot for craft beer enthusiasts in United States of America. With a focus on Brewery and Brewery, we’re dedicated to offering a diverse selection that highlights local flavors and craftsmanship. Our friendly and knowledgeable team is ready to guide you through our extensive range of beers, helping you find the perfect brew to match your tastes. At RockPit Brewing, we pride ourselves on exceptional customer service, expert recommendations, and a commitment to quality that sets us apart from the rest. Whether you’re enjoying a cold pint with friends or exploring new beer styles, our brewery provides the perfect setting for any occasion. Get in touch with us today at +1 407-826-1773 to learn more about our offerings or plan your visit. From Brewery, Beer garden, Beer hall, Brewpub to , RockPit Brewing has it all! Make us your go-to brewery for craft beer near you, and experience the best of what we have to offer. Don’t wait—explore our selection of craft beer near you and start your next beer adventure with RockPit Brewing! Check out RockPit Brewing’s reviews online to see why locals love us. Plan your visit to RockPit Brewing and taste the best brews in Orlando today! Related FEATURES & SERVICES Price Range $$ Credit Cards Reservation LOCATION ON MAP Plan My Route CONTACT OWNER NEW SEARCH Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to email a link to a friend (Opens in new window) Email Click to share on Reddit (Opens in new window) Reddit Click to share on Threads (Opens in new window) Threads Click to share on Nextdoor (Opens in new window) Nextdoor Related Leave a review Cancel reply Your email address will not be published. Required fields are marked * Your rating * Select your rating, please. Your review Your reply to review * Name * Email * Save my name, email, and website in this browser for the next time I comment. Δ Fill all required fields, please. Use valid email address, please. Craft Beer News Craft Beer News Beer Under Glass 2025: An Evening Beneath the Skyline Our Best Beers of 2024 Our Best Beer Experiences of 2024 FoBAB 2024 Reflections FoBAB 2024 Reflections Recoil Brewing Company Brewery in Skipton Address Unit 4, Snaygill Industrial Estate, Skipton BD23 2QR Lamb Brewing Company Brewery in Skipton Address Queen's Arms, Litton, Skipton BD23 5QJ Haworth Steam Brewing Co restaurants in Keighley Address 98 Main St, Haworth, Keighley BD22 8DP Copper Dragon Brewery in Keighley Address Lee Mills, St Paul's Rd, Keighley BD21 4QW Timothy Taylor's Brewery Brewery in Keighley Address Knowle Spring Brewery, Queen's Rd, Keighley BD21 1AW Copperdragon Brewery Brewery in Skipton Address Unit 4, Snaygill Industrial Estate, Skipton BD23 2QR 1 2 3 … 1,790 Next » Get Social with Us Facebook X Instagram Home Submit Listing Blog Contact CRAFT BEER LOCATIONS | ALL RIGHT RESERVED Terms and Conditions - Privacy Policy"
    },
    {
      "url": "https://rockpitbrewing.com/about/",
      "text": "About | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu About The People You’ll See At RockPit This is usually where you’ll find some boring story about how our brewery came to fruition and how we all were homebrewers and couldn’t think of doing anything else for the rest of our lives. And while that is certainly true, I’ve decided instead to dedicate this page to the kick-ass people you’ll run into at RockPit. Hi, I’m Chris Rock ( scroll all the way down the page to see me ), one of the co-founders of RockPit Brewing and I want to introduce you to the people of RockPit in the best way possible; with bad glamour shots. ** Updated 5/23/24: this page is being updated daily until all of our new staff pics are revealed at https://instagram.com/rockpitbrewing The Staff Brittany – Bartender / Dog Lover You’ll see Britt almost every day at Rockpit doing two things: Slinging drinks and petting dogs. She is, without a doubt, the first person you’ll encounter at Rockpit to ask, “Can I pet your dog?” If you happen to see Britt outside of Rockpit (like in a cornfield), you’ll most likely see her doing two things: Crushing Busch Lights and petting dogs. 🤣 Needless to say, she really, really, really, REALLY loves dogs. So the next time you’re at Rockpit with your dog, don’t be surprised to see a smiling woman beelining towards you, asking if they can pet your dog. Calista Rock – Beertender Calista Rock ( @calistarock ) is our youngest bartender and my daughter. At any given moment, you’ll catch Calista in this exact pose snapping a selfie behind the bar, in a coffee shop, or while driving down I-4. When she’s not at RockPit slinging beer, she’s mentoring up-and-coming Instagram influencers on the optimal camera angle and facial expression to create the perfect profile pic for their LinkedIn, MySpace, or Geocities account to get them noticed – no matter what speed your modem is (including 14.4 kbps). So give us your best #badglamourshot that you can feature on your own LinkedIn, Myspace or Geocities account. Tammy Rock – Beertender Tammy Rock is my wife and one of the happiest people you’ll ever meet. She always has an infectious smile on her face, loves chatting with you, getting to know you, and slinging beer your way. She also LOVES to make you laugh. It’s one of her most charming features. Tammy channeled her inner 80’s party animal and donned some jorts, frizzy hair in a bright pink scrunchie, over accentuated makeup, and of course, a Queen t-shirt. One of her all-time favorite bands. Given a choice to go back in time, you’d catch her at Live Aid in 1985, screaming the lyrics to “Radio Ga Ga” at Wembley Stadium. After the concert, she’d be pushing a keg of Rock Hard Water to the after-party where she’d no doubt be the center of attention. Scott – Bartender / Heavy Metal Advocate Scott ( @pirate.jeezus ) is a veteran of the craft beer scene. He started at Tequesta Brewing Company 11 years ago, slinging drinks and cleaning tanks. An excellent campfire guitar player (if you like Foo Fighters), he frequently travels to different cities to catch rock shows. Just be careful; the carnage he leaves behind after shredding the guitar can be catastrophic. The next time you see him at Rockpit, check out the tattoos on his right arm. They reveal his favorite movie series. The Co-Founders Chris Rock – Co-Founder Yeah, that’s me. And honestly, that’s how you’ll see me most of the time. Shorts, t-shirt, hat and lots of sawdust all over me from building stuff. In fact, when you come in and sit at any of our tables or bar, I had a hand in building it. I’m the marketing guy here at RockPit so I’m the one who convinces you to give us a try and gets you to come back over and over again. Mostly through the emails I send every week ( click here to sign up ). They’ve been called “The only email I read every week” by hundreds of our customers. My hope is that you feel like you’re not in Florida anymore when you walk through our doors and you’re treated like a family member. If you feel like that didn’t happen, shoot me an email to chris@rockpitbrewing.com and let me know about it. I’ll get it fixed for you. Sean Burke – Co-Founder Sean is our numbers cruncher and the one who ensures our crew and bills are paid. A pretty important part of keeping RockPit beer flowing your way. I brewed my first beer ever with Sean. It was a Foster’s Lager clone that was absolutely delicious. After brewing the beer he told me “One day, I’m going to open a brewery.” True to his word, we opened that brewery together eight years later. You’ll often catch Sean in the taproom chatting it up with regulars or teaching customers how to enjoy the sours brewed here at RockPit. It’s earned him the nickname “The Sour Sherpa”. Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/",
      "text": "Rockpit Brewing & Distilling | Rustic Neighborhood Orlando Brewery Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu See Our Cocktails See Our Spirits See Our Taplist Family Friendly Bring the kids. They’re absolutely welcome. Dog Friendly We love dogs and they love us. Weekly New Beer Releases New beers are released every Wednesday to Mug Club and Thursday to the public The SoDo District’s family-owned, neighborhood brewery and distillery with a warm & family-friendly taproom and an ever-changing line-up of small-batch beers and cocktails. “ This is the best brewery in Orlando. The beer is great (have not had a bad one yet). The staff is very friendly and the service is great. Place looks awesome and the food is great. It’s also family and pet friendly. Look forward to going here every chance I get. ” – Tim Schwartz Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Our espresso martini is always a good seller. But What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/events/speed-dating-with-sodo-singles-feb-14th/",
      "text": "Speed Dating With SoDo Singles | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu Speed Dating With SoDo Singles SoDo Singles is the downtown Orlando way to ditch dating apps and try this thing out in person. At SoDo Singles, we believe online dating has its place, but we really believe you make better connections by meeting in person. Is that riskier than swiping your phone in your pjs while endlessly streaming The Office? Yeah, it is. We also think it’s worth it. Toss on a clean pair of jeans and meet up with us. SODO is full of amazing singles that need the opportunity to collide. Ideally, with a few more laughs and little less ghosting. The age range for this event is 30-45. We will be holding future events with different age ranges. To attend the event, please fill out the form below. After registering, you’ll be contacted by Chelsea from SoDo Singles to confirm your spot. Name (Required) First Last Email (Required) Phone (Required) Age (Required) Sex (Required) Three Fun Facts About Yourself (Required) + Add to Google Calendar + iCal / Outlook export The event is finished. Date Feb 14 2023 Expired! Time 7:00 pm - 9:00 pm Location RockPit Brewing 10 W Illiana St, Orlando, FL 32806 Category Unique Events Share this event 0 replies Leave a Reply Want to join the discussion? Feel free to contribute! Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Comment * Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. What was our best selling lager this weekend?\nOh Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St So this actually happened (the abandoned husband p Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Link to: The Grateful Spread at RockPit Link to: The Grateful Spread at RockPit The Grateful Spread at RockPit Link to: Karaoke Night Link to: Karaoke Night Karaoke Night Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://rockpitbrewing.com/were-heartbroken-to-tell-you-this/",
      "text": "We’re heartbroken to tell you this | Rockpit Brewing & Distilling Link to Instagram Link to Facebook Home About Store Our Drinks Spirits Food Location Events Live Music Get Free Drink Menu Menu We’re heartbroken to tell you this THIS STORY IS OUTDATED. IT’S HERE FOR HISTORICAL CONTEXT. DOGS ARE WELCOME. If you bring your dog with you to RockPit or enjoy petting the pups that come in, I have some bad news. You see…The other night a couple begrudgingly walked into the brewery. They sat at the end of the bar next to the brewery. From the start, they were less than cordial. My daughter, who is super sweet and non-confrontational, immediately picked up on some “we hate everything, including this place” vibes from the couple. She tried her best to be kind to them, but they weren’t having any of it. A smile never adorned their faces. There were several dogs in the brewery as usual. Sean just adopted a little dog that his wife and kids were playing with at the table behind the unhappy couple. At some point during their agonizing 32-minute visit, one of Sean’s kids passed the 2-pound dog across the table to Sean’s wife. This set them off. They immediately pulled out their phones and started snapping pictures of Sean’s wife holding the dog in her arms. As if that wasn’t creepy enough the first few times, they kept at it for several minutes. I suppose they couldn’t get enough of the cute dog. That, or they’re just total creepers. I’m leaning towards the latter. Upon receiving their check, they asked to speak to the manager. It just so happens that it was Sean that evening. The pup’s dad they were creeping on. They proceeded to tell Sean that having dogs at an establishment was illegal. Further, they said they were locals, and they would never return because we allowed dogs at the brewery. They also said they’d be reporting us to the health department. Sean simply replied, “Thank you for coming in. Have a good evening.” After the miserable couple scurried out of the door, the people around them asked Sean, “What the hell was wrong with those people?” and told him, “You handled that WAY better than I would have.” When Sean told me about the situation, I immediately went to look at Yelp and Google for the bad review. I was expecting the 1-star review to hit both sites quickly. But the review never came. Fast forward to last week. We get a visit from the health department. As usual, there were several dogs at the brewery. The person from the health department demanded that we tell everyone who had dogs with them to leave. Sean said: The health inspector said, “I have to tell you, it’s up to you how you handle it.” To which Sean replied, “That’s why we have attorneys.” As far as the health department is concerned, dogs aren’t allowed ANYWHERE on the property of a brewery. This includes the outside porches. I know other brewery owners and managers read this email. So be prepared for a visit soon. Especially if the creepers visit your brewery. To be TOTALLY fair to the health inspector, they were VERY cordial and said they were just doing their job. And I 100% agree with that. They have a boss to answer to and the health inspector stuck around for a while to chat with us. So I DO NOT BLAME them at all. I do blame the miserable couple who had nothing better to do with their time than file complaints about something that nearly every single brewery in Orlando supports . Even if it isn’t technically “allowed”, it’s one of those things that aren’t typically enforced. Like going 5 miles over the speed limit. Technically illegal, yet usually never enforced. So we’re going to rekindle the fight on this. More specifically, Sean is leading this fight. Beyond getting our brewery doors opened, I’ve never seen him more obsessed with anything more than defeating this and allowing dogs at our brewery again. Dog and breweries go together like hops and IPAs and we intend on fighting this legally. That doesn’t mean we are going to go at it alone. In fact, several other breweries have been leading an effort to get this changed for a few years now. In even sadder news, our government “leaders” here in Florida had a chance to change this law and it died in the Florida senate. http://www.flsenate.gov/Session/Bill/2019/1219/?Tab=BillHistory So much for the representation of the small business. Especially when each of the senators on that committee has many small craft breweries in their districts. In the meantime, the pups have to stay home until we get this resolved. We are absolutely heartbroken over telling you this. Especially when you consider our first paying customer EVER at RockPit had his dog with him. Ben and Apollo enjoying the first paid beer at RockPit We intend on getting this resolved quickly. There are several avenues we can take and we’re going to pursue each one until we find that one that works best for you. Expect an update soon on this as we fight through this over the next few weeks. The good news is whatever we do to ultimately win this fight, we can pass that knowledge on to other breweries so they can follow in our footsteps until our government leaders get off their asses and get the law changed. I suppose it’s up to us to “help” them get it changed. We’ll be happy to do so. Cheers! Chris Rock Co-founder chris@rockpitbrewing.com 407-826-1773 – Brewery 321-427-6870 – Cell You’ll Dig Our Blog Happening the week of September 8th – September 14th September 8, 2025 - 12:50 pm Happening the week of September 1st – 7th September 1, 2025 - 11:56 am Happening the week of August 25th – 31st August 25, 2025 - 10:14 am Happening the week of August 18th – 24th August 18, 2025 - 8:58 am Happening the week of August 11th – 17th August 12, 2025 - 1:54 pm Archives September 2025 August 2025 July 2025 June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 March 2024 February 2024 August 2023 July 2023 March 2023 February 2023 July 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 January 2019 September 2018 July 2018 June 2018 May 2018 March 2018 Tags 11 year old's can paint building a brewery concrete is heavy hand crafted brewery I may have been an aerobics instructor it's damn hot out its so damn dirty in here live music Lt. Dan got new legs orlando yoga our tanks can only shoot beer plumbers can lay pipe the money pit is real trivia unique cool room yoga Our Location 10 W Illiana St Orlando, FL 32806 (407) 826-1773 beer@rockpitbrewing.com Hours Monday – 12PM-10PM Tuesday – 12PM-10PM Thursday – 12PM-10PM Wednesday – 12PM-10PM Friday – 12PM-12AM Sunday – 12PM-8PM Saturday – 12PM-12AM Discover more things to do in Orlando Download The App, Get A Free Drink (and more!) That’s right. When you download the Rockpit app, we’ll buy you a drink (beer or cocktail). Plus, you’ll get two more great offers included! Click the “Show Me The Details” button below to enroll and get your FREE offers! Show Me The Details Instagram rockpitbrewing Orlando's neighborhood brewery & distillery with a warm & laid-back taproom where a room full of strangers feels like home. Get ready to experience a jam-tastic journey throu Led-Hed brings the music of Led Zeppelin to the st Now serving P.B.R.... but not the one you're think Today's Porch Paradox with Chris: If someone says Savage by name. Savage by taste. Savage by sales. We hope today that you Rock Out With Your Hop Out! This weekend was insane. People were really diggin Get ready to be transported to a tropical paradise Dave McKenney’s Back! Time to waste away. Guess Ogilvie Trio at RockPit Brewing Friday, September 🎶 Jimmy Buffett Day at RockPit Brewing – Aug If your idea of a perfect night includes southern Nobody’s bringing bluegrass to Orlando like this Get ready to experience a jam-tastic journey throu Calista was feeling sour about a couple of pricks One of Central Florida’s most in-demand country- Damn it. Catfished again...\nGood thing we have St So this actually happened (the abandoned husband p When 11,000 Florida fans can’t stop talking abou Load More Follow on Instagram Copyright - Rockpit Brewing, LLC - 10 W Illiana St, Orlando, FL 32806  - Privacy Policy Link to Instagram Link to Facebook Link to: 2019 – A year of a-holes, screwups and good times Link to: 2019 – A year of a-holes, screwups and good times 2019 – A year of a-holes, screwups and good times Link to: Let’s talk about dogs, internet trolls and how I became an idiot Link to: Let’s talk about dogs, internet trolls and how I became an idiot Let’s talk about dogs, internet trolls and how I became an idiot Scroll to top Scroll to top Scroll to top"
    }
  ]
}