{
  "fuentes": [
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://ormondbeachconnect.com/taste-the-best-of-southern-cuisine-at-rose-villa-in-ormond-beach/",
      "email": "debbie@thewellerteam.com"
    },
    {
      "url": "https://www.discovervolusia.com/ormond-beach/rosevillarestaurant",
      "email": "admin@discovervolusia.com"
    },
    {
      "url": "https://www.discovervolusia.com/ormond-beach/rosevillarestaurant",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/historic-ormond-beach-eatery-shines-for-the-holidays/article_70ff766a-70e0-11ed-ba32-27ca6b2a40d9.html",
      "email": "cguarria@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/historic-ormond-beach-eatery-shines-for-the-holidays/article_70ff766a-70e0-11ed-ba32-27ca6b2a40d9.html",
      "email": "classifieds@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/historic-ormond-beach-eatery-shines-for-the-holidays/article_70ff766a-70e0-11ed-ba32-27ca6b2a40d9.html",
      "email": "ncguarria@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/historic-ormond-beach-eatery-shines-for-the-holidays/article_70ff766a-70e0-11ed-ba32-27ca6b2a40d9.html",
      "email": "newsdy@hometownnewsmediagroup.com"
    }
  ],
  "mails": [
    "admin@discovervolusia.com",
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "cguarria@hometownnewsmediagroup.com",
    "classifieds@hometownnewsmediagroup.com",
    "debbie@thewellerteam.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "name@yoursite.com",
    "ncguarria@hometownnewsmediagroup.com",
    "newsdy@hometownnewsmediagroup.com",
    "productions@diamondheadtheatre.com",
    "rtandal@diamondheadtheatre.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "rosevillaormondbeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://ormondbeachconnect.com/taste-the-best-of-southern-cuisine-at-rose-villa-in-ormond-beach/",
      "text": "Taste the Best of Southern Cuisine at Rose Villa in Ormond Beach | Ormond Beach Connect Skip to the content Ormond Beach Connect Presented by TownSites News & Articles Local Directory Connect With Us Search for: News & Articles Local Directory Connect With Us News & Articles Local Directory Connect With Us Connect Debbie Weller Realtor The Weller Team Ormond Beach Connect Ormond Beach, FL Community Taste the Best of Southern Cuisine at Rose Villa in Ormond Beach by Debbie Weller on January 22, 2025 Rose Villa Restaurant, Southern Table and Bar is a delightful spot in Ormond Beach, Florida , where Southern charm meets culinary excellence. If you’re considering a move to this beautiful area, let me take you on a virtual tour of what makes Rose Villa not just a restaurant but a community experience. A Taste of Southern Comfort As you step into Rose Villa, you’re greeted by an atmosphere that feels both polished and relaxed. This historic building, dating back to the late 1800s, was originally a bed and breakfast for guests visiting the nearby Daytona Beach. Today, it serves as a beacon of Southern hospitality, offering a menu that showcases classic comfort food with a twist. Whether you’re craving Southern fried chicken , shrimp, and grits , or lobster mac and cheese , every dish is crafted to evoke nostalgia while tantalizing your taste buds. The restaurant prides itself on using fresh ingredients to create hearty meals that feel like home. Imagine sinking your teeth into crispy fried green tomatoes or savoring the rich flavors of jambalaya—each bite is a warm embrace from the South. Cocktails and More No Southern dining experience is complete without a refreshing cocktail. At Rose Villa, the bar is adorned with ornamental touches that reflect its historic roots. Here, you can enjoy expertly crafted cocktails that complement your meal perfectly. Whether you’re in the mood for a classic Moscow mule or something more adventurous, the drink menu has something for everyone. If you’re looking for a place to unwind after a long day or celebrate a special occasion, the outdoor seating area is ideal. Picture yourself sipping on a cocktail while enjoying the gentle Florida breeze—it’s an experience that truly enhances your dining adventure. Dining Options Galore Rose Villa offers various dining options to suit your needs. You can choose to dine indoors surrounded by Victorian decor or opt for the outdoor patio under the gazebo, which often features live music. For those seeking privacy, there’s also a private dining room available for special events. The restaurant operates daily from 12 PM to 8:30 PM and extends its hours until 9 PM on Fridays and Saturdays. This flexibility allows you to plan your visit at your convenience—whether it’s for lunch, dinner, or even brunch on weekends. Community Spirit What sets Rose Villa apart is its commitment to community engagement. The restaurant hosts various events throughout the year, including wine tastings paired with exquisite meals and live music nights that bring locals together. It’s not just about food; it’s about creating memories and fostering connections within the community. Many patrons have shared their experiences of celebrating milestones at Rose Villa—from birthdays to anniversaries—making it a cherished spot for both residents and visitors alike. The staff here are known for their friendliness and attentiveness, ensuring that every guest feels like part of the family. Why Ormond Beach? Living in Ormond Beach means having access to not only incredible dining experiences like Rose Villa but also beautiful beaches, parks, and vibrant local culture. The area boasts a rich history and offers plenty of outdoor activities such as biking along scenic trails or enjoying water sports on the Atlantic Ocean. With its warm climate and friendly atmosphere, Ormond Beach is an inviting place to call home. The blend of natural beauty and community spirit creates an environment where residents can thrive. Discover Your New Favorite Spot If you’re contemplating relocating to Ormond Beach or just looking for a new favorite dining destination, make sure to visit Rose Villa Restaurant, Southern Table and Bar. With its delicious Southern cuisine, inviting atmosphere, and commitment to community engagement, it’s more than just a meal; it’s an experience waiting to be had. So why not gather some friends or family and make plans to enjoy what Rose Villa has to offer? You might just find yourself falling in love with both the food and the charming town of Ormond Beach! Source: rosevillaormondbeach.com Header Image Source: Rose Villa Restaurant – GMB Local Events Ladies Night at New Journey Chiropractic Sep 12, 2025 at 5:00 pm New Journey Chiropractic • Ormond Beach, FL View Event The Shield of Life Platform and The Gut Biome Sep 13, 2025 at 12:00 am View Event USTA FL All- Girls Tennis Camp at Ormond Beach Sep 14, 2025 at 8:30 am Ormond Beach Tennis Center • Ormond Beach, FL View Event Mixed Media Night Light or Suncatcher Class Sep 14, 2025 at 1:00 pm The Salty Mermaid Art • Ormond Beach, FL View Event Mastermind Roundtable Sep 16, 2025 at 12:00 am View Event Launch Credit Union Ormond Beach – Financial Power After Hours Sep 16, 2025 at 12:00 am View Event Spruce Creek Hike Sep 16, 2025 at 8:30 am 2317 Creek Shore Trail • New Smyrna Beach, FL View Event Financial Power After Hours Sep 16, 2025 at 5:30 pm Launch Credit Union | Ormond Beach • Ormond Beach, FL View Event Youth Leadership Program Session 1 - Orientation Day Sep 17, 2025 at 12:00 am View Event Back to School Ladies Night Sep 20, 2025 at 12:00 am 382 S Atlantic Ave, Ormond Beach, FL View Event Granada Approach, Coastal Cleanup 2025 Sep 20, 2025 at 8:00 am 21 Ocean Shore Blvd • Ormond Beach, FL View Event Van Avenue Park, Daytona Beach Shores, Coastal Cleanup 2025 Sep 20, 2025 at 8:00 am Van Avenue Park • Daytona Beach, FL View Event Dahlia Avenue Park, Coastal Cleanup 2025 Sep 20, 2025 at 8:00 am Dahlia Avenue Park • Daytona Beach Shores, FL View Event Tom Renick Park, Coastal Cleanup 2025 Sep 20, 2025 at 8:00 am Tom Renick Park • Ormond Beach, FL View Event Sunsplash Park, Daytona Beach, Coastal Cleanup 2025 Sep 20, 2025 at 8:00 am 611 S Atlantic Ave • Daytona Beach, FL View Event Sunrise Park, Coastal Cleanup 2025 Sep 20, 2025 at 8:00 am Sunrise Park • Holly Hill, FL View Event Tomoka State Park and Ormond Scenic Loop, Coastal Cleanup 2025 Sep 20, 2025 at 8:15 am 2099 N Beach St • Ormond Beach, FL View Event Mainstreet Board Meeting Sep 22, 2025 at 12:00 am View Event Networking Group 1 Sep 23, 2025 at 12:00 am View Event Networking Group 3 Sep 23, 2025 at 12:00 am View Event Latest News Elevate Your Nights With Unbeatable Happy Hour... Looking to unwind after a long day... Latest News Beach and Vine: New Wine and Coffee... A charming new establishment is set to... Latest News Unveiling The Salt Clinic: A One-Stop Destination... Ormond Beach residents now have access to... Latest News Discover Luxury for Less at Miss Priss:... In downtown Ormond Beach, fashion-conscious shoppers are... News & Articles Local Directory Connect With Us Speak With Your Local Community Professionals Interested in working with us? Reach out using the contact form below. You can also connect with us via\n                any of our social media channels. Something went wrong. Please contact support or try again. Thank you! We will be in contact shortly. First Name Last Name Email Phone Partner I'd like to speak to: Become a Community Partner Debbie Weller Interest I'm Interested In: A partnership Buying Selling Something else Message Submit © 2025 TownSites. All Rights Reserved. Privacy Policy Terms & Conditions Search for: © 2025 Ormond Beach Connect"
    },
    {
      "url": "https://www.discovervolusia.com/ormond-beach/rosevillarestaurant",
      "text": "Rose Villa Restaurant, Southern Table and Bar - Community Members - Local Business Member Login JOIN TODAY! Browse By Category Automotive & Marine Business & Professional Services Food & Drink Travel & Tours Healthcare Party & Event Services Personal Services & Care Pet & Veterinary Real Estate, Moving & Storage Service & Repair Sports & Recreation Fishing Charters Farms & CSA's Things To Do Business Districts DeLand Historic District Riverfront Shops Of Daytona Ormond Beach Mainstreet Canal Street Historic District Flagler Avenue Business Association Food & Drink Restaurants Craft Breweries / Distilleries Bars Coffee Shops Ice Cream Shops / Juice Bars Bakeries Kava Bars Food Trucks Prepared Meals Events Live Music Sports & Outdoor Food & Drink Automotive & Marine Arts & Culture Kids & Family Community Business Local Deals Coupons Food & Drink Specials Member Videos Local Spotlight Park Guide Beachfront Parks Boat Ramps Ecological Nature Parks Fishing Docks & Piers Historical Parks Local Parks Multipurpose Athletic Parks Browse By Category Automotive & Marine Business & Professional Services Food & Drink Travel & Tours Healthcare Party & Event Services Personal Services & Care Pet & Veterinary Real Estate, Moving & Storage Service & Repair Sports & Recreation Fishing Charters Farms & CSA's Things To Do Business Districts DeLand Historic District Riverfront Shops Of Daytona Ormond Beach Mainstreet Canal Street Historic District Flagler Avenue Business Association Food & Drink Restaurants Craft Breweries / Distilleries Bars Coffee Shops Ice Cream Shops / Juice Bars Bakeries Kava Bars Food Trucks Prepared Meals Events Live Music Sports & Outdoor Food & Drink Automotive & Marine Arts & Culture Kids & Family Community Business Local Deals Coupons Food & Drink Specials Member Videos Local Spotlight Park Guide Beachfront Parks Boat Ramps Ecological Nature Parks Fishing Docks & Piers Historical Parks Local Parks Multipurpose Athletic Parks Rose Villa Restaurant, Southern Table and Bar SAVE Community Members Ormond Beach, Florida Rated 5/5 (3  Reviews) Write a Review Send A Direct Message Show Phone Number Call: 386-615-7673 Overview Reviews (3) Videos (1) Contact Information Company Name Rose Villa Restaurant, Southern Table and Bar Website https://www.rosevillaormondbeach.com Online Social Profiles Phone Number Show Phone Number Call: 386-615-7673 Location 43 W Granada Blvd. Ormond Beach , Florida About  Rose Villa Restaurant, Southern Table and Bar Rose Villa is a unique historic restaurant located in Ormond Beach, Florida, offering a comfortable and polished casual atmosphere with Southern hospitality. Our restaurant features Southern-inspired cuisine, including our signature southern fried chicken, classic craft cocktails, and a wide selection of wines. Built in the late 1800s, Rose Villa was established as a bed and breakfast in 1901, serving important guests who preferred more privacy than the famous Ormond Hotel. After thriving for many years, the building became a real estate office and eventually suffered from its age. However, it was purchased by Bill Jones in 2007, who transformed the original Rose Villa into the Victorian jewel it is today. Rose Villa offers a unique dining experience with restored areas of the building, such as the Veranda and the Gazebo, which are open for cocktails, lunch, and dinner during the temperate months. Additionally, our media room, equipped with a large monitor for presentations and videos, is available for private parties and dinner meetings. We are currently working to weatherize both areas to extend our outdoor season. If you're looking for an unforgettable dining experience in Ormond Beach, Florida, come to Rose Villa. Our managing partner Kirt Roberts and proprietors Hal & Cindy Gerow thank you for joining us and invite you to share your experience by reviewing us. Rose Villa Restaurant, Southern Table and Bar Reviews Submitted\r\n\t\t\tby Dave Mailhot on 05/26/2023 Great experience! Overall Rating Staff Politeness Quality of Experience Likelihood to Revisit Likelihood to Recommend Value for Money The food and the service was exceptional. The owner greeted us at the door and open the door for us. Everyone makes you feel important to them. They check on you regularly to make sure you are having Submitted\r\n\t\t\tby Jeff Parks on 03/16/2023 I love this restaurant! Overall Rating Staff Politeness Quality of Experience Likelihood to Revisit Likelihood to Recommend Value for Money Penny and I took my best friend Mitch from Gainesville to dinner at The Rose last night  before seeing Hairball.  Shrimp app on jalapeño corn bread was so good.  Dinners of jambalaya, shrimp & grits and fried chicken with collards were amazing.  Penny makes great homemade collards but she was blown away by Chef Sylvia's recipe.  I love this restaurant, the owners and the chef!! Submitted\r\n\t\t\tby Trudy Sokolowski on 03/07/2023 Highly recommend. Overall Rating Staff Politeness Quality of Experience Likelihood to Revisit Likelihood to Recommend Value for Money beautiful place!!!   great food very reasonable pricing!!!  valet parking.   awesome place.     owner comes around and meets guests. Have you visited Rose Villa Restaurant, Southern Table and Bar? Write a Review Now Rose Villa Restaurant, Southern Table and Bar Videos Posted on\r\n\t\t\t04/10/2023 by Rose Villa Restaurant, Southern Table and Bar SAVE Guy Fieri Eats Bourbon Barbecue Pork Chops | Diners, Drive-Ins and Dives Guy gets an upgraded twist on pork chops and applesauce with this glazed pork served with a fruity chutney at Rose... Read More View More 43 W Granada Blvd., Ormond Beach, FL View On Larger Map × Map View Get Directions Close Rose Villa Restaurant, Southern Table and Bar About Discover Volusia is all about promoting & supporting locally owned, independent businesses, local artists & non-profits. We believe in making your hard-earned money go further, fueling the local economy & helping to preserve the unique character of Volusia County. Every member business is locally owned & operated. By purchasing goods & services from these businesses, you are helping create a healthier, stronger & more engaged community. Buying local is more than just a trend. Live Local - Love Local Discover Community Members Events Coupons & Rewards Why Buy Local? Join Add Your Business Be A Local VIP Support Member Login Password Retrieval Contact Us Discover Volusia © 2025. All Rights Reserved. Terms of Use | Privacy Policy | Site Photos © Jonny Nomad Media × Login or Create an account Member Login Register New Account Member Login Facebook Login * Email Address * Password Forgot Password? Click to Reset Password Not a Registered User? Create Free User Account Are You a Local Business List Your Company Now Create New Account Enter Email and Create Password * Enter Email * Confirm Email * Create Password * Confirm Password * By creating an account, you agree to our terms & conditions * I understand that personal information I enter on this website will be stored and used to contact me in the future. I can change or remove this information at any time. * I understand that if I make any purchases on this website, billing information will be securely stored with a 3rd party payment processor. I can change or remove this information at any time. The security check was not completed successfully. × Member Login Register New Account Member Login Facebook Login * Email Address * Password Forgot Password? Click to Reset Password Not a Registered User? Create Free User Account Are You a Local Business List Your Company Now Create New Account Enter Email and Create Password * Enter Email * Confirm Email * Create Password * Confirm Password * By creating an account, you agree to our terms & conditions * I understand that personal information I enter on this website will be stored and used to contact me in the future. I can change or remove this information at any time. * I understand that if I make any purchases on this website, billing information will be securely stored with a 3rd party payment processor. I can change or remove this information at any time. The security check was not completed successfully."
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/historic-ormond-beach-eatery-shines-for-the-holidays/article_70ff766a-70e0-11ed-ba32-27ca6b2a40d9.html",
      "text": "Please wait while we attempt to load the requested page"
    }
  ]
}