{
  "fuentes": [
    {
      "url": "https://royalpalmwines.com/catering/",
      "email": "kori@royalpalmwines.com"
    },
    {
      "url": "https://royalpalmwines.com/about-us/",
      "email": "kori@royalpalmwines.com"
    },
    {
      "url": "https://royalpalmwines.com/contact-us/",
      "email": "32233kori@royalpalmwines.com"
    },
    {
      "url": "https://royalpalmwines.com/contact-us/",
      "email": "kori@royalpalmwines.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/royal-palm-village-wine-and-tapas-atlantic-beach",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/royal-palm-village-wine-and-tapas-atlantic-beach",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://royalpalmwines.com/royal-events/",
      "email": "kori@royalpalmwines.com"
    },
    {
      "url": "https://guidetoflorida.com/atlantic-beach/food-drink/royal-palm-village-wine--tapas/connect",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/atlantic-beach/food-drink/royal-palm-village-wine--tapas/connect",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.soundprint.co/location/royal-palm-village-wine-tapas-atlantic-beach-fl-3811169",
      "email": "app_store@2x.png"
    },
    {
      "url": "https://www.soundprint.co/location/royal-palm-village-wine-tapas-atlantic-beach-fl-3811169",
      "email": "google_play@2x.png"
    },
    {
      "url": "https://royalpalmwines.com/retail/",
      "email": "kori@royalpalmwines.com"
    },
    {
      "url": "https://royalpalmwines.com/",
      "email": "kori@royalpalmwines.com"
    },
    {
      "url": "https://www.royalpalmsbrooklyn.com/",
      "email": "info@royalpalmschicago.com"
    },
    {
      "url": "https://www.royalpalmsbrooklyn.com/",
      "email": "info@royalpalmsshuffle.com"
    },
    {
      "url": "https://www.royalpalmsbrooklyn.com/",
      "email": "info@royalpalmsshuffle.com"
    },
    {
      "url": "https://www.royalpalmsbrooklyn.com/",
      "email": "party@royalpalmschicago.com"
    },
    {
      "url": "https://www.royalpalmsbrooklyn.com/",
      "email": "party@royalpalmsshuffle.com"
    },
    {
      "url": "https://guidetoflorida.com/atlantic-beach/food-drink/royal-palm-village-wine--tapas",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/atlantic-beach/food-drink/royal-palm-village-wine--tapas",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://royalpalmwines.com/restaurant/",
      "email": "kori@royalpalmwines.com"
    }
  ],
  "mails": [
    "32233kori@royalpalmwines.com",
    "app_store@2x.png",
    "corporate@giftly.com",
    "directory@guidetoflorida.com",
    "google_play@2x.png",
    "info@royalpalmschicago.com",
    "info@royalpalmsshuffle.com",
    "kori@royalpalmwines.com",
    "merchants@giftly.com",
    "name@yoursite.com",
    "party@royalpalmschicago.com",
    "party@royalpalmsshuffle.com"
  ],
  "nombre_sitio": "royalpalmwines.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://royalpalmwines.com/catering/",
      "text": "Catering - Royal Palm Village Wine & Tapas - Atlantic Beach Skip to content Skip to footer Home Restaurant Retail Events Catering About Tour Contact Catering Close Home Restaurant Retail Events Catering About Tour Contact Reservations kori@royalpalmwines.com 904-372-0052 Visit Us 296 Royal Palms Drive\nAtlantic Beach, Florida 32233 True Ingredients. True Flavor. True Passion. A Culinary Oasis Royal Palm is a bar and restaurant in Atlantic Beach, Florida, known for its spin on traditional tapas. The bar features an extensive selection of domestic and international fine wines and craft beers. Royal Palm’s scratch kitchen uses local ingredients to introduce you to flavors from around the globe in dishes created for sharing. Offering over 1200 bottles of fine wine, 12 rotating drafts, and over 200 bottles of craft beer, guests can purchase their paired beverages by the glass, or a bottle from the selection. It's in the details Effortless Entertaining With detailed planning, unparalleled personal service, exquisite dining, and precise implementation, Royal Palms sets the standard for a memorable occasion. From chef curated menus to extravagant event design, Royal Palm offers full catering services to any social gathering. Known for providing the optimal space to host your shower or corporate gathering, they offer a seamless process that ensures consistent quality and timeliness. Special Requests Royal Palm will collaborate with you to accommodate reasonable requests in order to provide an extraordinary event for everyone. Hosting Events Able to serve outside parties up to any size, Royal Palm is limited to hosting parties of up 25 people within the restaurant's event rooms. Contact Us Creative Catering Cuisine Wine & Dine Royal Palm offers an exclusive experience to its guests by providing menu personalization, event timeline planning, and access to their extensive inventory of over 1500 craft beers and fine wines. Whether you are looking for an energizing, productive lunch break or a rewarding, celebration gala, Royal Palm is dedicated to creating an unforgettable culinary experience for your party. PLATTERS price listed per person BRUSCHETTA PLATTER $4 w/ herbed goat cheese dip, tomato & caper relish TRUFFLE MUSHROOM DUXELLE TARTLETS $4 HOUSE MADE HUMMUS & COUNTRY OLIVES W/ GARDEN HERBS $4 Pumpkin seeds, preserved lemon oil, vegetable crudités & pita chips ARTISAN CHEESE PLATTER $5 ADD  CHARCUTERIE + $1 House made focaccia, preserves & roasted almonds. WARM PROSCIUTTO & MANCHEGO STUFFED DATES $4 w/ balsamic glaze WARM SPINACH & FETA DIP $4 w/ Pita Chips EDAMAME POT STICKERS $4 served w/ Sweet Thai Chile CHICKEN POT STICKERS $5 served w/ Sweet Thai Chile HOUSE MADE FLATBREAD $4 Vegetarian ROYAL PALM SALAD $4 Mixed greens, hearts of palm, oranges, pumpkin seeds, golden raisins, feta cheese & citrus vinaigrette served on the side CAESAR SALAD $4 House made Caesar Dressing, Garlic Focaccia Croutons, Pecorino LOCAL FARMS SEASONAL ROASTED VEGETABLE PLATE $4 w/ balsamic glaze ALVAREZ FARMS' BAKED RATATOUILLE $4 Roasted Farm Vegetables / Goat Cheese / Balsamic Glaze ROASTED BRUSSELS SPROUTS $5 Crispy prosciutto & blue cheeseRequest no prosciutto for vegetarian option BAKED MACARONI & CHEESE $4 Wainwright Dairy Chipotle Mornay / Nueske's Bacon Crumble (optional) SEAFOOD price listed per person ** EAST COAST COLD WATER OYSTERS $6 *RAW w/ Pickled Shallots *BROILED w/ Bacon, Pecorino & Romano & Scallions LUMP MINIATURE CRAB CAKES $6 w/ Smoked Tomato Remoulade *CHILE SEARED AHI TUNA $6 Aguachile / Verde / Radish / Pickled Shallots / Cucumber / Tomato / Crispy Jalapeno *AHI TUNA Poke w/ Wonton Chips $6 CHILLED LOCAL SHRIMP CEVICHE $6 w/ House made Tortilla Chips GREMOLATA SHRIMP SALAD W/ FOCACCIA TOAST $6 Fennel / Fresh Herbs / Chiles / Citrus / Sherry Vinegar / Jalapenos SHRIMP & GRITS $6 Jumbo Shrimp, Crispy Grit Cakes, Chimichurri, Southern Peach Relish POULTRY / BEEF / PORK price listed per person ALVAREZ FARMS’ SAUSAGE MEATBALLS $6 Marinara or  Mushroom Stroganoff SPRINGER MOUNTAIN FARMS’ JERK CHICKEN CONFIT $6 Braised local greens & apple-wood bacon MINIATURE BEEF EMPANADAS $6 Chimichurri Dipping Sauce ASIAN CHICKEN SKEWERS $6 Hoisin BBQ & Sweet Thai Chile Sauce SEARED BLACK ANGUS SIRLOIN $6 Chimichurri or Horseradish crema, Rolls ANGUS SIRLOIN SALTADO $6 Papas Fritas, Caramelized Onions & Peppers, Dried Tomato & Red wine Saltado WHOLE ROASTED PORK RIBEYE $6 Chimichurri, Fresh Greens, Tomato DESSERTS price listed per person Chef Selection of Assorted Miniatures $6 We are happy to accommodate special request on an individual basis. Please call with advanced notice to speak with our chef. *Consuming raw or under cooked meats, poultry, seafood, shellfish or eggs may increase your risk of food borne illness. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. Download Our Menu Invite Us Email, call, or fill out a form and a member of staff will be in contact to help plan catering services at the restaurant location or at an off-site venue. Visit Us 296 Royal Palms Drive Atlantic Beach, Florida 32233 Reach Out (904) 372-0052 kori@royalpalmwines.com Name Email Phone Preferred Date Preferred Time Comments Send Home Restaurant Retail Events Catering About Tour Contact Home Restaurant Retail Events Catering About Tour Contact Visit Us Royal Palm Village Wine & Tapas 296 Royal Palms Drive Atlantic Beach, Florida 32233 Contact Us 904-372-0052 kori@royalpalmwines.com Restaurant Hours MONDAY  – TUESDAY  4:00 – 9:00 PM WEDNESDAY – FRIDAY 4:00 – 10:00 PM SATURDAY 2:00 – 10:00 PM CLOSED ON SUNDAYS Retail Hours MONDAY  – TUESDAY  11:00 AM – 09:00 PM WEDNESDAY – SATURDAY 11:00 AM – 10:00 PM CLOSED ON SUNDAYS Facebook Instagram Tripadvisor © 2022 · Royal Palm – All Rights Reserved. Website Design by Kris Chislett Design Traditional Spanish style tapas bar with a modern twist. (904) 372-0052"
    },
    {
      "url": "https://royalpalmwines.com/about-us/",
      "text": "About - Royal Palm Village Wine & Tapas - Atlantic Beach, FL Skip to content Skip to footer Home Restaurant Retail Events Catering About Tour Contact About Close Home Restaurant Retail Events Catering About Tour Contact Reservations kori@royalpalmwines.com 904-372-0052 Visit Us 296 Royal Palms Drive\nAtlantic Beach, Florida 32233 Tradition with a Twist International Influence Royal Palm Village Wine & Tapas was established in 2011. Kori Blacker Tafoya always aspired to be a restaurateur, with years of experience in wine sales, restaurant management and service. David Joudi of Riverside Liquors was looking to open a second retail store at the beaches. They focused on providing unmatched customer service and expertise in the wine industry while seeking to create a community that brings people together. Inspired by European travel they sought to create an atmosphere which provides a transcendent experience. This would not be possible without a talented chef to make their dreams a reality. In 2011 Chef Chris Robert joined their team. Contact Us Seasonally inspired, locally sourced Chef Chris Roberts Chris is a classically trained chef with several years’ experience in the culinary arts. During his studies, he focused on the nuances of both French and classic American cuisine. He is a firm believer of sourcing locally and working closely with other small farmers who share in his passion to deliver only the best quality ingredients to their customers. This ensures fresh and flavorful dishes coming from the kitchen to the table. Raised in New Mexico, Chris immerses himself in preparing very flavorful southwestern and southern cuisine. He is also an avid baker.  His creativity and menu diversity have grown and continues to grow with Royal Palm’s concept. A Kitchen with Intention Our Values Family Royal Palm is creating  a community that brings friends and family together to share inspired dishes from around the world. Quality Not only does Royal Palm hand select  wines from all over the globe, they also use Floridian grown food for a local twist in flavor. Authenticity Featuring a scratch kitchen and hand selected wine collection, Royal Palm provides an authentic culinary experience. Proud of our Jacksonville roots Invested In Our Community Kori and David are focused on creating a business that gives back to the community. Invested in local agriculture, their number one priority is to support local farmers. Economic and agricultural growth is a small part of why they choose to work with small Floridian businesses. In addition, Royal Palm regularly hosts and donates to charities and organizations; including, the Child Cancer Fund, MS Society, Chemo Noir, and The Donna Foundation. What Our Guests Say... Home Restaurant Retail Events Catering About Tour Contact Home Restaurant Retail Events Catering About Tour Contact Visit Us Royal Palm Village Wine & Tapas 296 Royal Palms Drive Atlantic Beach, Florida 32233 Contact Us 904-372-0052 kori@royalpalmwines.com Restaurant Hours MONDAY  – TUESDAY  4:00 – 9:00 PM WEDNESDAY – FRIDAY 4:00 – 10:00 PM SATURDAY 2:00 – 10:00 PM CLOSED ON SUNDAYS Retail Hours MONDAY  – TUESDAY  11:00 AM – 09:00 PM WEDNESDAY – SATURDAY 11:00 AM – 10:00 PM CLOSED ON SUNDAYS Facebook Instagram Tripadvisor © 2022 · Royal Palm – All Rights Reserved. Website Design by Kris Chislett Design Traditional Spanish style tapas bar with a modern twist. (904) 372-0052"
    },
    {
      "url": "https://royalpalmwines.com/contact-us/",
      "text": "Contact Us - Royal Palm Village Wine & Tapas Skip to content Skip to footer Home Restaurant Retail Events Catering About Tour Contact Contact Us Close Home Restaurant Retail Events Catering About Tour Contact Reservations kori@royalpalmwines.com 904-372-0052 Visit Us 296 Royal Palms Drive\nAtlantic Beach, Florida 32233 Come Visit Us 296 Royal Palms Drive Atlantic Beach, Florida 32233 kori@royalpalmwines.com (904) 372-0052 Facebook Instagram Tripadvisor Name Email Phone How Can We Help? Send Home Restaurant Retail Events Catering About Tour Contact Home Restaurant Retail Events Catering About Tour Contact Visit Us Royal Palm Village Wine & Tapas 296 Royal Palms Drive Atlantic Beach, Florida 32233 Contact Us 904-372-0052 kori@royalpalmwines.com Restaurant Hours MONDAY  – TUESDAY  4:00 – 9:00 PM WEDNESDAY – FRIDAY 4:00 – 10:00 PM SATURDAY 2:00 – 10:00 PM CLOSED ON SUNDAYS Retail Hours MONDAY  – TUESDAY  11:00 AM – 09:00 PM WEDNESDAY – SATURDAY 11:00 AM – 10:00 PM CLOSED ON SUNDAYS Facebook Instagram Tripadvisor © 2022 · Royal Palm – All Rights Reserved. Website Design by Kris Chislett Design Traditional Spanish style tapas bar with a modern twist. (904) 372-0052"
    },
    {
      "url": "https://www.giftly.com/gift-card/royal-palm-village-wine-and-tapas-atlantic-beach",
      "text": "Royal Palm Village Wine & Tapas Giftly - Beautiful Gift Card Alternative Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Atlantic Beach Restaurants Royal Palm Village Wine & Tapas Royal Palm Village Wine & Tapas Gift Card Royal Palm Village Wine & Tapas Giftly A beautiful gift card alternative for Royal Palm Village Wine & Tapas Royal Palm Village Wine & Tapas 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Royal Palm Village Wine & Tapas (171) (904) 372-0052 Categories Tapas Bars, Beer, Wine & Spirits, Tapas/Small Plates Location 296 Royal Palms Dr, Atlantic Beach, FL Gift Tips Don't miss out on the oysters, octopus, and tuna, which are frequently praised for their flavor and presentation. Try the Medjool dates wrapped in prosciutto and cheese, they offer a unique taste experience that guests love. Sample the Angus beef sliders with bacon and pepper jelly – they are a highlight on the menu that many find delightful. Ask for Christopher's recommendations on wine if you're unsure – he is known for his expertise in selecting the perfect bottle. Consider the in-house made hot sauce as a complement to your food; it's a favorite among regulars. Click here to send a gift up to $1,000 with the suggestion to use it at Royal Palm Village Wine & Tapas. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Royal Palm Village Wine & Tapas Price $$ Ambience Casual, Classy Hours Monday-Tuesday: 11AM-9PM Wednesday-Saturday: 11AM-10PM Royal Palm Village Wine & Tapas is located in Atlantic Beach, Florida, bringing together a delightful assortment of tapas dishes and wines in a cozy setting. This charming eatery stands out for its welcoming atmosphere and engaging staff, perfect for both casual get-togethers and special occasions. Ambiance : The restaurant features a casual yet classy atmosphere, making it suitable for various occasions. Cuisine : Royal Palm Village specializes in tapas-style dishes, offering a mix of Mediterranean and modern flavors for a delightful dining experience. Highlights : Guests can select from a diverse wine collection, and enjoy unique small plates that are perfect for sharing. The unique concept of allowing guests to purchase wine at retail prices and enjoy it in-house with a minimal corkage fee adds to the appeal of Royal Palm Village. With attentive service and a creative menu, it has become a local favorite. The combination of delectable food and a fantastic wine selection makes this eatery a must-visit in the area. Customer Reviews Brenda .. 01/19/2025 Food was okay, but not the service. We had the croquettes, the bone marrow, the octopus and the jerk chicken. This last one was over cooked and dry. The... read review Rose H. 01/03/2025 My #1 place to go for dinner in Jacksonville. You have to get the oysters, the octopus, and the tuna! So good!  \n\nAll of the food is tapas style small... read review Mariah G. 11/05/2024 Down and Dirty: wonderful and relaxing atmosphere with delish food and friendly service. \n\nService: all of the staff worked well together to ensure a... read review Great Alternatives Buy a Gift & Greeting Card for Sangrias Wine And Tapas Bar : Sangrias Wine And Tapas Bar in St. Augustine is a charming and lively establishment, offering an exquisite selection of wines and delectable tapas dishes for an unforgettable dining experience. Gift $100 for Tulua Bistro Springfield : Tulua Bistro Springfield in Jacksonville offers a delightful culinary experience with its charming ambiance and delicious menu options. Updated: September 10, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Royal Palm Village Wine & Tapas gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Royal Palm Village Wine & Tapas. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Royal Palm Village Wine & Tapas or anywhere else they like! Top Related Gifts Akari Sushi Fresh Sushi, Beachside Delight 29 S 3rd St, Fernandina Beach, FL 4.0 (85) • Japanese Sweet Tee Tasty Treats Fresh Treats, Made with Love 7901 Baymeadows Cir E, Jacksonville, FL Desserts 5th Element Indian Restaurant & Bar Discover India in Every Bite 10208 Buckhead Branch Dr, Jacksonville, FL 4.4 (44) • Indian Our Deck Down Under Seafood and Sunsets Together 78 Dunlawton Ave, Port Orange, FL 3.6 (741) • $$ • Seafood Mellow Mushroom Groovy, tasty pizza vibes Brand 10k+ reviews • Pizza Bad Ass Coffee of Hawaii Kona coffee with aloha spirit Brand 8.8k reviews • Coffee & Tea Huey Magoo's Chicken Tenders Crispy, golden tenders Brand 822 reviews • Chicken Shop Mi Pueblo Authentic Mexican flavors Brand 4.6k reviews • Mexican La Habana tapas Bite into a Taste of Havana 5230 Baymeadows Rd, Jacksonville, FL Tapas Bars Vevetas Tapas by Pink Salt Tapas with a Caribbean Twist 1567 University Blvd W, Jacksonville, FL 3.5 (19) • Tapas Bars Juicy Mayport Fresh Seafood, Fun for Everyone 1487 Mayport Rd, Atlantic Beach, FL 4.1 (159) • $$ • Seafood Wine Warehouse of Atlantic Beach Your go-to for great wine deals 665 Atlantic Blvd, Atlantic Beach, FL 4.6 (34) • $$ • Beer, Wine & Spirits More Nearby Businesses Seafood Kitchen 31 Royal Palms Dr, Atlantic Beach, FL 4.3 (414) • $$ • Seafood Poe's Tavern 363 Atlantic Blvd, Atlantic Beach, FL 4.2 (945) • $$ • Burgers The Hangar Bay Cafe & Gallery 2294 Mayport Rd, Atlantic Beach, FL 4.5 (633) • $$ • New American Joseph's Pizza 30 Ocean Blvd, Atlantic Beach, FL 3.9 (201) • $$ • Italian Sub Cultured 10 Donner Rd, Atlantic Beach, FL 4.6 (327) • $$ • Salad Reve Brewing 1237 Mayport Rd, Atlantic Beach, FL 4.7 (128) • $$ • Breweries Pho Viet 1447 Mayport Rd, Atlantic Beach, FL 4.2 (234) • $ • Vietnamese Peterbrooke Chocolatier Atlantic Beach 363 Atlantic Blvd, Atlantic Beach, FL 4.8 (23) • $$ • Desserts Holey Moley 469 Atlantic Blvd, Atlantic Beach, FL 2.7 (9) • Sandwiches Angie’s Sub Shop 299 Atlantic Blvd, Atlantic Beach, FL 4.5 (14) • Sandwiches Mimi's Oriental Market 73 Sailfish Dr E, Atlantic Beach, FL 5.0 (2) • Convenience Stores Mox Ice Cream 1013 Atlantic Blvd, Atlantic Beach, FL 5.0 (21) • Ice Cream & Frozen Yogurt Olympia Cafe 2550 Mayport Rd, Atlantic Beach, FL 4.1 (103) • $ • Pizza Verde Bites Atlantic Beach, FL 5.0 (2) • Food Delivery Services The Fish Company 725-12 Atlantic Blvd, Atlantic Beach, FL 4.0 (502) • $$ • Seafood Homespun Kitchen 299-2 Atlantic Blvd, Atlantic Beach, FL 4.4 (264) • $$ • Breakfast & Brunch Tony Pepperoni 2158 Mayport Rd, Atlantic Beach, FL 3.7 (130) • $$ • Pizza ABBQ 461 Atlantic Blvd, Atlantic Beach, FL 3.9 (308) • $$ • Barbeque Safe Harbor Seafood Market 4371 Ocean St, Atlantic Beach, FL 4.4 (36) • $$ • Seafood Markets Grey Matter Distillery 1221 Mayport Rd, Atlantic Beach, FL 4.8 (83) • $$ • Distilleries Sierra Grille - Atlantic Beach 1021 Atlantic Blvd, Atlantic Beach, FL 4.0 (52) • Tex-Mex Voo Swar Restaurant & Lounge 51 Robert St, Atlantic Beach, FL 4.7 (23) • $ • American Makenu Chocolate 30 Seminole Rd, Atlantic Beach, FL 4.8 (29) • Chocolatiers & Shops Cabalen Restaurant 2294 Mayport Rd, Atlantic Beach, FL 4.5 (26) • $ • Filipino Backyard Buffalo 800 Seminole Rd, Atlantic Beach, FL 5.0 (7) • Farmers Market Holey Moley Bagel Shop 469 Atlantic Blvd, Atlantic Beach, FL 3.8 (6) • Bagels Arepa Please 469 Atlantic Blvd, Atlantic Beach, FL 4.8 (28) • Latin American What's Smokin' 4212 Ocean St, Atlantic Beach, FL 4.5 (8) • $ • Food Trucks Davinci's Pizza 469 Atlantic Blvd, Atlantic Beach, FL 4.3 (146) • $$ • Pizza Le Petit Paris Cafe Atlantic Beach 363 Atlantic Blvd, Atlantic Beach, FL 4.7 (232) • $$ • French Two Dudes Seafood Restaurant 73 Sailfish Dr, Atlantic Beach, FL 4.1 (334) • $$ • Seafood Mayport C & C Fisheries 36 W 6th St, Atlantic Beach, FL 4.8 (12) • $$ • Seafood Markets Pie Heaven Bakery Cafe 1980 Mayport Rd, Atlantic Beach, FL 4.7 (146) • $$ • Bakeries Choi's Chinese Food 499 Mayport Rd, Atlantic Beach, FL 3.6 (60) • $ • Chinese Azurea 1 Ocean Blvd, Atlantic Beach, FL 4.1 (207) • $$$ • New American The Toasted Yolk Cafe 725 Atlantic Blvd, Atlantic Beach, FL 4.7 (25) • Breakfast & Brunch Treata Tea Shoppe 363 Atlantic Blvd, Atlantic Beach, FL 4.5 (6) • Bubble Tea Juice Tap 469 Atlantic Blvd, Atlantic Beach, FL 3.9 (10) • Juice Bars & Smoothies Beach Diner 501 Atlantic Blvd, Atlantic Beach, FL 4.1 (227) • $ • Diners Eggboy 1241 Mayport Rd, Atlantic Beach, FL 4.5 (109) • Breakfast & Brunch Gnarbucha Kombucha 1257 Mayport Rd, Atlantic Beach, FL 5.0 (5) • $ • Kombucha Dano's Diner 1487 Mayport Rd, Atlantic Beach, FL 3.4 (105) • $ • Diners See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Tapas Bars Beer, Wine & Spirits Tapas/Small Plates 4.4 100-199 3 single place gcdp beautiful_gift_card_alternative_in_title_tag Atlantic Beach, FL S S Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://royalpalmwines.com/royal-events/",
      "text": "Events - Royal Palm Village Wine & Tapas - Atlantic Beach Skip to content Skip to footer Home Restaurant Retail Events Catering About Tour Contact Events Close Home Restaurant Retail Events Catering About Tour Contact Reservations kori@royalpalmwines.com 904-372-0052 Visit Us 296 Royal Palms Drive\nAtlantic Beach, Florida 32233 Turning Moments to Memories Private Events Royal Palm offers a unique experience by providing customized private events on or off site. If looking to host an event at Royal Palm we have daytime availability for private groups when planned in advanced. During the evening hours we have a semi-private area with a capacity maximum of 25 people. To reserve this space on Friday or Saturday evening, there is a minimum spend of $1000 plus tax and gratuity required. Contact Us Wine & Craft Beer Tastings With over 1200 options, professional sommeliers are available to create a tasting based on your unique palette. Pairing Events Once the wine is selected, chefs are able to curate a custom menu of hors d'oeuvres to compliment the tasting. Private Parties From bachelorette parties to company luncheons, the private dining spaces can be customized to fit any gathering. 14th Anniversary Wine Tasting Festival ATLANTIC BEACH 11/08/2025 14:00 Join us for Royal Palm’s 14th anniversary Wine Tasting Festival, benefiting the child Cancer Fund.  Celebrate with samplings of over 200 wines, keepsake wine glass, music, draft beer from local… Read more Contact Us Call to order for pick-up, schedule your next private dinner, plan catering for your event or call ahead for a large party. Visit Us 296 Royal Palms Drive Atlantic Beach, Florida 32233 Reach Out (904) 372-0052 kori@royalpalmwines.com Name Email Phone Preferred Date Preferred Time Comments Send Home Restaurant Retail Events Catering About Tour Contact Home Restaurant Retail Events Catering About Tour Contact Visit Us Royal Palm Village Wine & Tapas 296 Royal Palms Drive Atlantic Beach, Florida 32233 Contact Us 904-372-0052 kori@royalpalmwines.com Restaurant Hours MONDAY  – TUESDAY  4:00 – 9:00 PM WEDNESDAY – FRIDAY 4:00 – 10:00 PM SATURDAY 2:00 – 10:00 PM CLOSED ON SUNDAYS Retail Hours MONDAY  – TUESDAY  11:00 AM – 09:00 PM WEDNESDAY – SATURDAY 11:00 AM – 10:00 PM CLOSED ON SUNDAYS Facebook Instagram Tripadvisor © 2022 · Royal Palm – All Rights Reserved. Website Design by Kris Chislett Design Traditional Spanish style tapas bar with a modern twist. (904) 372-0052"
    },
    {
      "url": "https://guidetoflorida.com/atlantic-beach/food-drink/royal-palm-village-wine--tapas/connect",
      "text": "Contact Royal Palm Village Wine & Tapas, Food & Drink in Atlantic Beach, www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Atlantic Beach Food & Drink Royal Palm Village Wine & Tapas Send a Message Contact Royal Palm Village Wine & Tapas Name * Email Phone Number Preferred Reply Day Preferred Reply Day As soon as possible Sunday Monday Tuesday Wednesday Thursday Friday Saturday ?> Preferred Reply Time Preferred Reply Time As soon as possible 12:00 am 1:00 am 2:00 am 3:00 am 4:00 am 5:00 am 6:00 am 7:00 am 8:00 am 9:00 am 10:00 am 11:00 am 12:00 pm 1:00 pm 2:00 pm 3:00  pm 4:00 pm 5:00 pm 6:00 pm 7:00 pm 8:00 pm 9:00 pm 10:00 pm 11:00 pm * Location Message The security check was not completed successfully. Back to Listing Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://www.soundprint.co/location/royal-palm-village-wine-tapas-atlantic-beach-fl-3811169",
      "text": "Royal Palm Village Wine &amp; Tapas / Atlantic Beach, FL / Noise Level Information | SoundPrint FYQP Challenge About STORY VENUE MANAGER TIPS RESEARCH RESOURCES HOW APP WORKS FYQP CHALLENGE FAQ CONTACT US Quiet Lists Ambassadors Blog Press FYQP Challenge Florida Atlantic Beach Royal Palm Village Wine & Tapas Royal Palm Village Wine & Tapas Wine Bar · Nightlife · $$ · 8.8 / 10 Sound Information Average sound level of 84 decibels (Very Loud Noise Level) based on measurements taken by users of the SoundPrint app .  A Very Loud Noise Level is not safe for hearing, exposure can cause hearing loss. Very Loud 84 Decibels Avg dB No Data No Data 84 dB 1 No Data 5am - 11am 11am - 6pm 6pm - 10pm 10pm - 5am Based on 1 SoundCheck Nominations 0 Quiet List Recommendations by SoundPrint Users 0 Noise Complaints Submitted by SoundPrint Users Location Details 296 Royal Palms Dr Atlantic Beach, FL 32233 United States (904) 372-0052 Get Directions Open in Foursquare Comments No Comments Yet Nearby Venues Loud 77 Decibels Hawkers Asian Street Fare $$ Asian Restaurant Neptune Beach, FL Quiet 67 Decibels Southern Grounds $ Café Neptune Beach, FL Quiet 58 Decibels Buddha Thai Bistro $$ Thai Restaurant Jacksonville, FL Very Loud 84 Decibels Seafood Kitchen $$ Seafood Restaurant Jacksonville, FL Quiet 70 Decibels Sliders Seafood Grille $$ Seafood Restaurant Neptune Beach, FL Very Loud 82 Decibels Culhane's Irish Pub $$ Pub Atlantic Beach, FL Very Loud 86 Decibels Dwight's Bistro $$$$ Restaurant Jacksonville Beach, FL Very Loud 87 Decibels North Beach Fish Camp $$ Seafood Restaurant Atlantic Beach, FL Loud 80 Decibels Flying Iguana $$ Mexican Restaurant Neptune Beach, FL Loud 80 Decibels Ragtime Tavern $$ American Restaurant Atlantic Beach, FL Loud 80 Decibels Cantina Louie $ Mexican Restaurant Atlantic Beach, FL Very Loud 83 Decibels Coop 303 $ Southern / Soul Food Restaurant Atlantic Beach, FL Quiet 60 Decibels Colonel Mustard's Phat Burger $ Burger Joint Jacksonville Beach, FL Quiet 47 Decibels Selva Marina Golf Course Atlantic Beach, FL Noise Guideline Information Quiet 69 Decibels 70 dBA or below Safe for hearing, great for conversation Moderate 71 Decibels 70 - 75 dBA Safe for hearing, conducive to conversation Loud 76 Decibels 75 - 80 dBA Likely safe for hearing, difficult for conversation Very Loud 81 Decibels 80 dBA or above Not safe for hearing, exposure can cause hearing loss Disclaimers: SoundPrint measures the approximate decibel level and is not a replacement for a professional sound level measuring device. The dBA numbers displayed on the app and the website are averages of all the historical SoundChecks measured and submitted to the database. These SoundCheck dBA numbers are historical and thus are a reasonable guess as to what the specific venue’s sound level are and will be in the future. There is no guarantee that the average dBA displayed is or will be the actual noise level in the future. It is SoundPrint's goal to work with and not against louder venues. About Blog FAQ Press Contact Disclaimer Decibel Guidelines Privacy Policy Terms & Conditions Newsletter Sign up for newsletter updates below!"
    },
    {
      "url": "https://royalpalmwines.com/retail/",
      "text": "Retail - Royal Palm Village Wine & Tapas - Atlantic Beach Skip to content Skip to footer Home Restaurant Retail Events Catering About Tour Contact Retail Close Home Restaurant Retail Events Catering About Tour Contact Reservations kori@royalpalmwines.com 904-372-0052 Visit Us 296 Royal Palms Drive\nAtlantic Beach, Florida 32233 Hand Selected Collection Meet Your Match With numerous accolades from local publications as having the best wine and beer selections in Jacksonville, we pride ourselves with the ability to pair you with the perfect wines to match your palate. Our friendly staff is knowledgeable having tasted most of the wines in the selection and can assist you in picking out the perfect bottle or case of wine. If we do not have a wine or beer that are looking for in stock, we are happy to special order it for you so long as it is distributed locally. Hand Selected Collection Meet Your Match With numerous accolades from local publications as having the best wine and beer selections in Jacksonville, we pride ourselves with the ability to pair you with the perfect wines to match your palate. Our friendly staff is knowledgeable having tasted most of the wines in the selection and can assist you in picking out the perfect bottle or case of wine. If we do not have a wine or beer that are looking for in stock, we are happy to special order it for you so long as it is distributed locally. Monday  – Tuesday  11:00 am – 09:00 pm Wednesday – Saturday 11:00 am – 10:00 pm Closed on sundays Case Discounts We offer a discount of 10% on any 12 or more bottles purchased. Contact Us What Our Guests Say... Contact Us Call to order for pick-up, schedule your next private dinner, plan catering for your event or call ahead for a large party. Visit Us 296 Royal Palms Drive Atlantic Beach, Florida 32233 Reach Out (904) 372-0052 kori@royalpalmwines.com Name Email Phone How Can We Help? Send Home Restaurant Retail Events Catering About Tour Contact Home Restaurant Retail Events Catering About Tour Contact Visit Us Royal Palm Village Wine & Tapas 296 Royal Palms Drive Atlantic Beach, Florida 32233 Contact Us 904-372-0052 kori@royalpalmwines.com Restaurant Hours MONDAY  – TUESDAY  4:00 – 9:00 PM WEDNESDAY – FRIDAY 4:00 – 10:00 PM SATURDAY 2:00 – 10:00 PM CLOSED ON SUNDAYS Retail Hours MONDAY  – TUESDAY  11:00 AM – 09:00 PM WEDNESDAY – SATURDAY 11:00 AM – 10:00 PM CLOSED ON SUNDAYS Facebook Instagram Tripadvisor © 2022 · Royal Palm – All Rights Reserved. Website Design by Kris Chislett Design Traditional Spanish style tapas bar with a modern twist. (904) 372-0052"
    },
    {
      "url": "https://royalpalmwines.com/",
      "text": "Royal Palm Village Wine & Tapas - Atlantic Beach, FL Skip to content Skip to footer Home Restaurant Retail Events Catering About Tour Contact Close Home Restaurant Retail Events Catering About Tour Contact Reservations kori@royalpalmwines.com 904-372-0052 Visit Us 296 Royal Palms Drive\nAtlantic Beach, Florida 32233 A Unique Bar & Tapas Experience ABOUT US Tour of Italy Wine Dinner Tickets... Purchase Here! Where Food, Wine & Ambiance Collide Authentic & Inspired Royal Palm is a traditional tapas bar with a modern twist. The restaurant features international wines, craft beers, and large plates to share, created from local ingredients. Pull up a chair at our comfortable, year round patio, or indoors for an authentic culinary experience. Where Food, Wine & Ambiance Collide Authentic & Inspired Royal Palm is a traditional tapas bar with a modern twist. The restaurant features both domestic and international wines, craft beers, and creative plates to share that when combined make a full meal. Our menu focuses of sourcing local ingredients when available and in season. Pull up a chair at our comfortable, year-round patio, or indoors for an authentic culinary experience. Scratch Kitchen From farm-to-table, Royal Palm offers a unique culinary experience with a  scratch kitchen and a rotating menu. Wine & Craft Beer Royal Palm holds a collection of over 200 craft beers & 1200 bottles of wine all available at the table or for retail. Reservations Operating on a first come first serve policy we do not take reservations. Large parties are encouraged to call ahead and arrive early, but we cannot guarantee a reservation dependent on the day and time you wish to dine. Contact Us A Culinary Experience Worth Sharing Menu Tapas traditionally are a variety of small dishes, paired with wine, beer or sangria and shared communally with friends and family. The tradition originated in the Catalan region of Spain. Today’s evolution of tapas incorporates traditions and influences from many different cultures and countries. Royal Palm provides substantial dishes that are a representation of this diversity created with a blend of local & seasonal ingredients. View Menu SIP, SAVOR, REPEAT. Globally Inspired, Locally Sourced Don’t know your Spätlese from your Trockenbeerenauslese? Don’t worry! The highly trained staff at Royal Palm can help you every step of the way, and even offer specific pairings for each dish on the menu. With a wine and beer selection that boasts over 1,200 wines by the bottle, and over 200 bottles of craft beers, Royal Palm truly has something for every palate and budget. Combining undiscovered gems with domestic and international favorites, Royal Palm loves to compare and contrast old and new world wines in an alternating inventory. Made for sharing and pairing, each dish at Royal Palm has been created in unison with our philosophy of the relationship between food and wine; one should enhance the other; both equally and simply enjoyed. Our chef-driven kitchen creates globally inspired, shareable plates using ingredients from local producers, while also paying respect to the culinary traditions that inspired them. Royal Palm is focused on creating the perfect pairing for your wine or beer. Making a memorable dining experience with each visit. No matter the occasion, Royal Palm invites you to drink, eat, share, relax and enjoy! Contact Us What Our Guests Say... Contact Us Call to order for pick-up, schedule your next private dinner, plan catering for your event or call ahead for a large party. Visit Us 296 Royal Palms Drive Atlantic Beach, Florida 32233 Reach Out (904) 372-0052 kori@royalpalmwines.com Name Email Phone How Can We Help? Send Home Restaurant Retail Events Catering About Tour Contact Home Restaurant Retail Events Catering About Tour Contact Visit Us Royal Palm Village Wine & Tapas 296 Royal Palms Drive Atlantic Beach, Florida 32233 Contact Us 904-372-0052 kori@royalpalmwines.com Restaurant Hours MONDAY  – TUESDAY  4:00 – 9:00 PM WEDNESDAY – FRIDAY 4:00 – 10:00 PM SATURDAY 2:00 – 10:00 PM CLOSED ON SUNDAYS Retail Hours MONDAY  – TUESDAY  11:00 AM – 09:00 PM WEDNESDAY – SATURDAY 11:00 AM – 10:00 PM CLOSED ON SUNDAYS Facebook Instagram Tripadvisor © 2022 · Royal Palm – All Rights Reserved. Website Design by Kris Chislett Design Traditional Spanish style tapas bar with a modern twist. (904) 372-0052"
    },
    {
      "url": "https://www.royalpalmsbrooklyn.com/",
      "text": "Royal Palms Shuffleboard Club Brooklyn 0 Skip to Content About FAQS PRESS GIFT CARDS VENUE PHOTOS CONTACT Play Walk-Ins Game Rules & Instructions CALENDAR Parties BOOK A PARTY Leagues JOIN A LEAGUE Eat & Drink Food Menus DRINK MENUS REQUEST A PARTY Open Menu Close Menu Open Menu Close Menu About FAQS PRESS GIFT CARDS VENUE PHOTOS CONTACT Play Walk-Ins Game Rules & Instructions CALENDAR Parties BOOK A PARTY Leagues JOIN A LEAGUE Eat & Drink Food Menus DRINK MENUS REQUEST A PARTY Folder: About Back FAQS PRESS GIFT CARDS VENUE PHOTOS CONTACT Folder: Play Back Walk-Ins Game Rules & Instructions CALENDAR Folder: Parties Back BOOK A PARTY Folder: Leagues Back JOIN A LEAGUE Folder: Eat & Drink Back Food Menus DRINK MENUS REQUEST A PARTY WALK ON IN JUST DON’T WALK ON THE COURTS BOOK YOUR HOLIDAY PARTY TODAY! Slide 1 Slide 1 (current slide) Slide 2 Slide 2 (current slide) Slide 3 Slide 3 (current slide) Slide 4 Slide 4 (current slide) Slide 5 Slide 5 (current slide) Slide 6 Slide 6 (current slide) Slide 7 Slide 7 (current slide) Slide 8 Slide 8 (current slide) Slide 9 Slide 9 (current slide) Slide 10 Slide 10 (current slide) Slide 11 Slide 11 (current slide) Slide 12 Slide 12 (current slide) Slide 13 Slide 13 (current slide) Slide 14 Slide 14 (current slide) Slide 15 Slide 15 (current slide) THREE WAYS TO HANG AT ROYAL PALMS SHUFFLEBOARD CLUB Brooklyn Walk in Book a party leagues Brooklyn’s 0NE AND ONLY SHUFFLEBOARD BAR & CLUB THE ROYAL PALMS IS PRIMARILY A WALK-IN SHUFFLEBOARD CLUB … SO COME HANG OUT, SIGN UP FOR A COURT, PLAY SOME GAMES, AND ENJOY A TROPICAL COCKTAIL. 128 10 quarterly League Teams FLOOR SHUFFLEBOARD COURTS 8 Group Cabana booths 21 AND OVER ALL THE TIME, EVERY TIME 〰️ ALL THE TIME, EVERY TIME 〰️ ALL THE TIME, EVERY TIME 〰️ Except in the case of a full venue private event Upcoming events Featured Sep 12, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM DJ Blast Sep 12, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM Sep 12, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM Sep 13, 2025 1:30 PM – 7:30 PM 13:30 – 19:30 1:30 PM – 7:30 PM DJ M-Tri Sep 13, 2025 1:30 PM – 7:30 PM 13:30 – 19:30 1:30 PM – 7:30 PM Sep 13, 2025 1:30 PM – 7:30 PM 13:30 – 19:30 1:30 PM – 7:30 PM Sep 13, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM DJ Ill Digitz Sep 13, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM Sep 13, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM Sep 14, 2025 12:00 PM – 4:00 PM 12:00 – 16:00 12:00 PM – 4:00 PM Sunday Family Shuffle Sep 14, 2025 12:00 PM – 4:00 PM 12:00 – 16:00 12:00 PM – 4:00 PM Sep 14, 2025 12:00 PM – 4:00 PM 12:00 – 16:00 12:00 PM – 4:00 PM Sep 16, 2025 6:00 PM – 11:30 PM 18:00 – 23:30 6:00 PM – 11:30 PM DJ Jazzabella Sep 16, 2025 6:00 PM – 11:30 PM 18:00 – 23:30 6:00 PM – 11:30 PM Sep 16, 2025 6:00 PM – 11:30 PM 18:00 – 23:30 6:00 PM – 11:30 PM Sep 19, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM DJ Supes Base Sep 19, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM Sep 19, 2025 7:30 PM – 11:30 PM 19:30 – 23:30 7:30 PM – 11:30 PM Sep 20, 2025 1:30 PM – 7:30 PM 13:30 – 19:30 1:30 PM – 7:30 PM DJ Nina Vicious Sep 20, 2025 1:30 PM – 7:30 PM 13:30 – 19:30 1:30 PM – 7:30 PM Sep 20, 2025 1:30 PM – 7:30 PM 13:30 – 19:30 1:30 PM – 7:30 PM JOIN The LEAGUE Round up 4 to 10 players and join the ranks of the finest obscure athletes in all of NYC You’re in for a full season of new friends, fun shots, djs, our incomparable end-of-the-season banquet and free shuffleboard all season long! SIgn up Yes, we open early for cabana parties 〰️ Yes, We are a 21+ Shuffleboard Club 〰️ Yes, we open early for cabana parties 〰️ Yes, We are a 21+ Shuffleboard Club 〰️ Yes, we open early for cabana parties 〰️ Yes, We are a 21+ Shuffleboard Club 〰️ A bout FAQS PRESS GIFT CARDS CONTACT Play WALK INS GAME RULES & INSTRUCTIONS SHUFFLEBOARD SLANG CALENDAR Leagues JOIN A LEAGUE Eat & Drink DRINK MENUS FOOD MENUS Parties BOOK A PARTY VENUE PHOTOS BROOKLYN 514 Union St, Brooklyn, NY 11215 info@RoyalPalmsShuffle.com party@RoyalPalmsShuffle.com The best way to reach us is via email MONDAY - THURSDAY: 6:00P - 12:00A FRIDAY: 6:00P - 2:00A SATURDAY: 12:00P - 2:00A SUNDAY : 12:00P - 10:00P Subscribe Sign up with your email address to receive news and updates. Email Address Sign Up We respect your privacy. Thank you! VISIT ROYAL PALMS CHICAGO → info@RoyalPalmsChicago.com party@RoyalPalmsChicago.com info@RoyalPalmsChicago.com party@RoyalPalmsChicago.com"
    },
    {
      "url": "https://guidetoflorida.com/atlantic-beach/food-drink/royal-palm-village-wine--tapas",
      "text": "Royal Palm Village Wine & Tapas - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Atlantic Beach Food & Drink Royal Palm Village Wine & Tapas Royal Palm Village Wine & Tapas Share American Cuisine Restaurants 296 Royal Palms Dr, Atlantic Beach, North Carolina, 32233 Send Message 904-372-0052 Vote for Us! | American Cuisine Restaurants Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Royal Palm Village Wine & Tapas Visit Website royalpalmwines.com Online Social Profiles Phone Number 904-372-0052 Location 296 Royal Palms Dr Atlantic Beach , North Carolina , 32233 United States × Map View Get Directions Cancel FEATURED LISTINGS! Cherry Pocket Steak & Seafood Shak Lake Wales, FL 33898 Website 8634392031 Loyd Have Mercy Restaurant Titusville, FL 32780 Website 321-223-0107 Two Guys To Go Bradenton, FL 34207 Website 941-806-85-72 READ AND REAP! Dinner with a View (And Maybe a Gator) Southern Comfort With a Side of Soul! Bridging Communities, Boosting Businesses MORE TO EXPLORE! Best of Florida Voting Best American Cuisine Restaurants in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://royalpalmwines.com/restaurant/",
      "text": "Restaurant - Royal Palm Village Wine & Tapas Skip to content Skip to footer Home Restaurant Retail Events Catering About Tour Contact Restaurant Close Home Restaurant Retail Events Catering About Tour Contact Reservations kori@royalpalmwines.com 904-372-0052 Visit Us 296 Royal Palms Drive\nAtlantic Beach, Florida 32233 Royal Palm is a bar and restaurant in Atlantic Beach, Florida, known for its spin on traditional tapas. The bar features an extensive selection of domestic and international fine wines and craft beers. Royal Palm’s scratch kitchen uses local ingredients to introduce you to flavors from around the globe in dishes created for sharing. Offering over 1200 bottles of fine wine, 12 rotating drafts, and over 200 bottles of craft beer, guests can purchase their paired beverages by the glass, or a bottle from the selection. Royal Palm is a bar and restaurant in Atlantic Beach, Florida, known for its spin on traditional tapas. The bar features an extensive selection of domestic and international fine wines and craft beers. Royal Palm’s scratch kitchen uses local ingredients to introduce you to flavors from around the globe in dishes created for sharing. Offering over 1200 bottles of fine wine, 12 rotating drafts, and over 200 bottles of craft beer, guests can purchase their paired beverages by the glass or a bottle from the selection. Monday  – Tuesday  4:00 – 9:00 pm Wednesday – Friday 4:00 – 10:00 pm Saturday 2:00 – 10:00 pm Closed on Sundays Tapas are plates created to share with friends and family and often paired with wine, beer, or sangria. The tradition originated in the Catalan region of Spain. Today’s evolution of tapas incorporates traditions and influences from many different cultures and countries. Royal Palm provides substantial dishes that are a representation of this diversity created with a blend of local & seasonal ingredients. TAPAS CHEESE MEZZE $17 Focaccia  / House Made Preserves / Roasted  Almonds Add Charcuterie $6 Add Local Raw Honey $4 COUNTRY OLIVES w/ GARDEN HERBS $11 Focaccia/ Preserved Lemon Oil HOUSE MADE HUMMUS $8 Pumpkin Seeds / Preserved Lemon Oil / Pita Chips BLACK BEAN DIP $9 Queso / Salsa Fresca / House Tortilla Chips WARM PROSCIUTTO & MANCHEGO STUFFED DATES $7 w/ Balsamic Glaze ROASTED BONE MARROW $18 Black Garlic & Bacon Jam /  Son & Skye Mushrooms / Fennel / Local Greens / Focaccia CROQUETTES $13 Manchego / Chorizo / Smoked Spanish Romesco / Local Greens Salad SPANISH WHITE ANCHOVIES $13 Challah Toast  / Roasted Garlic / Fresh Greens / Tomato HOUSE MADE FLATBREAD $12 Daily Feature MAC & CHEESE $12 Wainright Dairy Chipotle Mornay / Nueske's Bacon Crumbles GARDEN ROYAL PALM SALAD $13 Fresh Local Greens / Hearts of Palm / Oranges / Pepitas / Golden Raisins / Feta / Citrus Vinaigrette PEACHES & CREAM BURRATA $15 Pickled Peaches /  Smoked Olive Oil /  Baby Greens / Georgia Pecans / Fresh Basil / Focaccia Toast ROASTED BRUSSELS SPROUTS $12 Crispy Prosciutto / Blue Cheese ALVAREZ FARMS’ BAKED RATATOUILLE $13 Roasted Farm Vegetables / Goat Cheese / Balsamic Glaze / Basil TAMARI ROASTED SON & SKYE MUSHROOMS $16 Whipped Tofu /  Salsa Macha SEAFOOD *SPICY OYSTER SHOOTER $6 Zing Zang / House Pickled Peppers / House Pickle *EAST COAST OYSTERS market Raw w/ Pickled Shallots Broiled /w/ Bacon / Pecorino Romano / Scallion * AHI TUNA  CEVICHE market Watermelon, / Fresh Jalapeno / Cucumber /  Citrus, Cilantro / Avocado Mash / Crispy Tortilla SAUTEED WILD CAUGHT SHRIMP $18 Crispy Grit Cakes / Chimichurri /Peach Relish HICKORY SMOKED OCTOPUS $17 Paprika New Potatoes / Applewood Lardons / Garden Herb Gremolata MEATS AMERICAN WAYGU BIRRIA TOSTADAS $16 Avocado Mash / Salsa Fresca / Lime Crema SPRINGER MOUNTAIN FARMS’ JERK CHICKEN CONFIT $18 Braised Local Greens / Goat Cheese Atkinson Mills Grits / Nueske’s Bacon Gravy ANGUS GROUND BEEF & NUESKE’S BACON SLIDERS $15 Angus Chuck / Applewood Bacon / Herbed Goat Cheese Add Pepper Jelly $1 ALVAREZ' SAGE SAUSAGE MEATBALLS $16 Tomato Braised / Pecorino / Focaccia CAST IRON SEARED PORK RIBEYE $18 Fresh Herb Chimichurri / Fresh Greens / Tomato ANGUS SIRLOIN SALTADO $18 Papas Fritas / Caramelized Onions & Peppers / Broiled Tomato / Red Wine Saltado Sauce *Consuming raw or under cooked meats, poultry, seafood, shellfish or eggs may increase your risk of food borne illness. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. Please inform your server of any food allergies. Parties of 8 or more are subject to a 20% gratuity. A cake cutting fee of $20 for desserts brought in house.* Any bottle of wine selected from our retail wall is subject to $10 corkage fee when enjoyed in house. For those who bring in a bottle from outside the restaurant there is a $20 corkage fee. We always feature a list of hand selected bottles that do not have a corkage fee and are just the retail price to enjoy at the table. Offering full catering services, Royal Palm can accommodate a corporate, family, or social gathering of any size. Based on each individual event’s preferences and budget, the coordinator will then propose a personalized menu for your guests. In addition to food, Royal Palm also includes their vast selection of over 1200 types of fine wine and craft beers as a part of the catering menu at retail pricing. Email to request a proposal for a large party, private dinner or upcoming catering event. Name Email Phone Preferred Date Preferred Time Comments Send Home Restaurant Retail Events Catering About Tour Contact Home Restaurant Retail Events Catering About Tour Contact Visit Us Royal Palm Village Wine & Tapas 296 Royal Palms Drive Atlantic Beach, Florida 32233 Contact Us 904-372-0052 kori@royalpalmwines.com Restaurant Hours MONDAY  – TUESDAY  4:00 – 9:00 PM WEDNESDAY – FRIDAY 4:00 – 10:00 PM SATURDAY 2:00 – 10:00 PM CLOSED ON SUNDAYS Retail Hours MONDAY  – TUESDAY  11:00 AM – 09:00 PM WEDNESDAY – SATURDAY 11:00 AM – 10:00 PM CLOSED ON SUNDAYS Facebook Instagram Tripadvisor © 2022 · Royal Palm – All Rights Reserved. Website Design by Kris Chislett Design Traditional Spanish style tapas bar with a modern twist. (904) 372-0052"
    }
  ]
}