{
  "fuentes": [
    {
      "url": "https://therumlab.com/eekh-rum-director-ceo-simran-singh/",
      "email": "jose@empresasfh.com"
    },
    {
      "url": "https://www.therumrunner.co.uk/contact",
      "email": "info@therumrunner.co.uk"
    },
    {
      "url": "https://tampabayrumrunners.com/contact-us/",
      "email": "info@tampabayrumrunners.com"
    },
    {
      "url": "https://www.goerie.com/story/news/local/2015/01/11/owner-erie-s-rum-runners/24718828007/",
      "email": "epalattella@timesnews.com"
    },
    {
      "url": "https://www.rumrunnersbonaire.com/about-us/",
      "email": "info@rumrunnersbonaire.com"
    },
    {
      "url": "https://www.wadirumnomads.com/contact",
      "email": "info@wadirumnomads.com"
    },
    {
      "url": "https://rumrunners.co.nz/pages/contact-us",
      "email": "rum-runners-logo-blue_100x@2x.png"
    },
    {
      "url": "https://rumrunners.co.nz/pages/contact-us",
      "email": "bruce@rumrunners.co.nz"
    },
    {
      "url": "https://rumrunners.co.nz/pages/contact-us",
      "email": "info@stagheaddesigns.com"
    }
  ],
  "mails": [
    "bruce@rumrunners.co.nz",
    "epalattella@timesnews.com",
    "info@rumrunnersbonaire.com",
    "info@stagheaddesigns.com",
    "info@tampabayrumrunners.com",
    "info@therumrunner.co.uk",
    "info@wadirumnomads.com",
    "jose@empresasfh.com",
    "rum-runners-logo-blue_100x@2x.png"
  ],
  "nombre_sitio": "rumrunners.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://therumlab.com/eekh-rum-director-ceo-simran-singh/",
      "text": "Eekh Rum, Director & CEO: SIMRAN SINGH - The Rum Lab You must be over 21 years old to visit this site! Welcome to the TheRumLab.com!\r\nBy entering this site you are agreeing to the Terms of Use and Privacy Policy.\r\nPlease, verify your age to enter. I'm over 21 Years Old I'm under 21 Years Old Skip to the content The Rum Lab It's Rum Education Time Newscast Interviews Live Streams Global Rum Events Guide Alliances ¡Aquí se habla de Ron! The Ultimate Awards Women Leading Rum Cocktails Rum Guide Understanding what Rum is Find a Rum Society Near You Distilleries around the World Australia Barbados Brazil Canada Colombia Costa Rica Cuba Dominican Republic France Guyana Jamaica Mexico Nicaragua Panamá Puerto Rico United Kingdom United States of America Venezuela Best Rum Livestreams & Youtube Channels Best Rum Podcasts Swag Store About Media Assets Contact US TEAM Join our team Editorial Standards Editorial Guidelines Cookie Policy Sign Up Get featured Search for: Home » Interviews » Eekh Rum, Director & CEO: SIMRAN SINGH Eekh Rum, Director & CEO: SIMRAN SINGH September 24, 2024 Off By Jose Rafael Hoffmann TRL: Who is Simran Singh? I’m Simran Singh, an educator in beverages and a devoted enthusiast of brown spirits. My journey has been about exploring and understanding the intricacies of various alcoholic drinks, and I’m passionate about diving deeper into the alco-bev industry. TRL: What does the rum mean to you? What made you fall in love with rum and when did it happen? Rum is something I’ve grown incredibly passionate about. This interest sparked in 2020 when I was exploring different spirits within the alco-bev segment. Initially, I wasn’t sure about rum as a category, but the more I dug into it, the more it captivated me. Now, I can’t imagine my journey without it. TRL: Three essential characteristics that define the rum according to your perspective. For me, rum is defined by its flavor, color, and age. The flavor of rum can range from sweet and fruity to deep and complex, depending on the ingredients and the distillation process. The color, often influenced by the aging process, gives a visual cue to its depth and character. Finally, age is a crucial factor—it tells the story of the rum, from the barrel to the bottle, and adds layers of sophistication and maturity to the spirit. TRL: What is the most important contribution you have made in the rum industry? One of my proudest contributions is introducing Eekh Agricultural Rum, a unique pure cane spirit, to the Indian market. It’s a one-of-a-kind product that I believe will pave the way for more innovative offerings in the future. And yes, there’s more in the pipeline. TRL: Benefits that the rum industry has given you. The rum industry in India is still relatively unexplored, which means there’s so much potential and so many opportunities to experiment. This space has given me the freedom to innovate and create something that can truly stand out. TRL: What´s  another thing you are passionate about, in addition to rum? Why? Aside from rum, I’ve always been drawn to single malt whiskies from India and around the world. I also have a deep interest in indigenous beverages native to India. There’s still so much to explore in this area, and I’m excited about the possibilities. TRL: What is your favorite place for drinking rum? I don’t have a specific favorite place yet, but I’m always on the lookout for the perfect spot to enjoy a good rum. TRL: Favorite drink + Recipe I’m more of an “on the rocks” person, so my go-to is 60 ml of Eekh Rum over four cubes of ice, or sometimes a single big block of ice. Simple and pure. TRL: Why is it important to educate the rum consumer? India is a huge market for rum, and most consumers aren’t even aware of it. Unfortunately, rum in India has often been underestimated and lumped into the category of cheap or country liquor. Educating consumers about the different types of rum and the quality variations—just like we do with whisky or brandy—can help shift this perception and elevate the status of rum. TRL: Any tips to train the palate and taste a good premium rum? Start by tasting a variety of rums from different regions and aging processes. Take your time to savor the aromas, flavors, and the finish. Pay attention to the subtle notes and how they evolve as the rum breathes. And, of course, always taste with an open mind. TRL: How can the rum contribute to improving the crisis in some countries? Rum production in sugarcane-rich regions has the potential to significantly boost local economies and address socio-economic challenges. In India, states like Uttar Pradesh, Maharashtra, and Karnataka could see job creation across the entire supply chain—from sugarcane farming to rum distillation. This not only provides livelihoods but also stimulates related industries, such as transportation, packaging, and marketing. In countries like Jamaica, Cuba, and the Dominican Republic, rum production is an economic cornerstone, offering a stable market for sugarcane and supporting agricultural communities. Additionally, rum distilleries often attract tourism, further driving economic growth by supporting local businesses. On a global scale, the rum industry can promote sustainable agricultural practices, such as organic farming and efficient water use, ensuring long-term viability for both the sugarcane and rum sectors. In economically struggling regions, a thriving rum industry can serve as an economic lifeline, creating jobs, generating revenue, and attracting investment, particularly in rural areas where opportunities are scarce. TRL: Is the commitment to sustainable development the key to success for the permanence of the rum industry in the world? Why? Absolutely. Sustainable development is crucial for the rum industry’s future. By focusing on eco-friendly practices, from sugarcane farming to distillation, the industry can reduce its environmental impact and ensure that it remains viable for generations to come. It’s not just about making great rum—it’s about doing it in a way that respects the planet and the people involved. TRL: Who would like to meet in the rum industry? What would you say to him/her? There are so many people I’d love to meet, but one person who stands out is Ian Burrell, the global ambassador for rum. I’d love to sit down with him, learn from his experiences, and discuss the future of rum. I’d also love to connect with various brand founders, owners, and distillers to exchange ideas and insights. TRL: What are your next goals in the rum industry? I have some exciting plans for the works, but you’ll have to wait and see. I promise it’ll be worth the wait. TRL: Plans you have when you leave the rum industry. I haven’t thought about leaving yet—I’ve just started this journey, and I’m loving every moment. TRL: Why is the role of the bartender important in the rum industry? Bartenders are vital for every spirit, not just rum. When we look back at the 1920s, bartenders were the ones who crafted some of the most iconic rum and bourbon cocktails. Today, though, rum cocktails aren’t as prominent in bars. I’d love to see bartenders experiment more with rum again, reviving those classic cocktails and creating new ones. TRL: What is your advice for new generations in the rum industry? The world of rum is vast and full of untapped potential. As someone passionate about this spirit, I encourage the next generation to dive deep and explore every facet of rum-making. Don’t be afraid to push your boundaries—whether it’s experimenting with unconventional ingredients, aging techniques, or innovative distillation methods. The rum industry thrives on creativity and innovation, and there’s always room for new ideas that challenge the status quo. TRL: How can people learn more about you? Website? Social media page? You can follow me on Instagram to stay updated @therealsim.rum @eekhrum www.eekhrum.com Related posts: Master Distiller and CEO of Destilería de Madrid: JAVIER DOMÍNGUEZ Ruta Maya Rum, Co-Founder & Director: DANILO TERSIGNI About The Author Jose Rafael Hoffmann Creative Director and Concent Manager for EmpresasFH and Director of HOFFMANNdesign. Born and raised in Caracas, Venezuela, Mr. Hoffmann has been one of the most important designers for prestigious companies in South America, including Disney, Cartoon Network, Mattel among others. Related posts: Master Distiller and CEO of Destilería de Madrid: JAVIER DOMÍNGUEZ Ruta Maya Rum, Co-Founder & Director: DANILO TERSIGNI Famille Ricci Rhum, Founder and CEO: MORGAN RICCI Category BannerSlider Interview Of The Week Interviews Tags CEO Director Eekh Rum Interiew of The Week Rum Rum Knowledge SIMRAN SINGH Woman Leading Rum Questions: Contact Us Sign Up to our Newsletter Privacy Policy Editorial Guidelines TheRumLab 2025 | All rights reserved We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Do not sell my personal information . Cookie Settings Accept Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.therumrunner.co.uk/contact",
      "text": "Rum Runner - Contact cocktails bars AIRSTREAM partnerships EVENTS contact CONTACT FORM First name * Last name * Date of Event * Number of Guests * Email address * Phone Number * Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. COCKTAILS BARS EVENTS Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. No Time for Email? WhatsApp Us! 02045016586 info@therumrunner.co.uk Copyright 2020, Rum Runner Company Number:Â 07886806 and VAT Number:Â 204 2786 25"
    },
    {
      "url": "https://tampabayrumrunners.com/contact-us/",
      "text": ""
    },
    {
      "url": "https://www.goerie.com/story/news/local/2015/01/11/owner-erie-s-rum-runners/24718828007/",
      "text": "Owner of Erie's Rum Runners buys bayfront land News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals LOCAL Owner of Erie's Rum Runners buys bayfront land Ed Palattella epalattella@timesnews.com A mainstay of Erie's bayfront has expanded his reach. A partnership that includes Tim Sedney, who owns Rum Runners Bar and Grill, has purchased the restaurant property as well as two adjacent parcels on East Dobbins Landing -- a storage lot and a bait-shop building that once housed the now-defunct Lund Boat Works. Lake Front Realty, made up of Sedney and his business partner, Gary Liebel, bought the three properties in December for a total of $750,000 from Lund Boat Works Inc. Sedney had been leasing the Rum Runners property from Lund Boat Works, which led to rumors over the years that the lease would soon be up and the bar -- popular among boaters, who can pull up next to it -- would close. With his purchase of the parcel, \"Rum Runners will continue on,\" Sedney said. \"Finally, now that I have control of the property, it is a whole different story. We aren't going anywhere.\" Sedney, 50, also owns Rum Runners Cove, a restaurant in the Sheraton complex on West Dobbins Landing; and co-owns the Lady Kate tour boat, the Scallywags pirate-themed pleasure boat and the O Danny O fishing charter boat. He and Liebel formerly owned the Victorian Princess paddle-wheeler. Sedney said he is considering nonresidential projects for the two other newly purchased parcels, but he declined to detail his ideas because they are not final. \"I do have plans,\" he said. Sedney also had been leasing the other two properties from Lund Boat Works. He had been subletting them to tenants that include Leclair Point, a bait and tackle shop that remains in business in the former Lund Boat Works building. Sedney and his family have a long history with the 1,271-square-foot Rum Runners Bar and Grill and its 0.6-acre lot. His mother, Carol, who died at 73 in 2013, opened Rum Runners there with his father, Jerry Sedney, in 1988. Jerry Sedney died at 51 in 1990, and financial issues caused Carol Sedney to sell the property to Lund Boat Works for $430,000 in 1991, according to county property records. Lund Boat Works and its owner, J. Douglas James, an Erie businessman, immediately leased the property to the Sedney family, who continued to operate Rum Runners. Tim Sedney said he was ready to buy whenever the property went up for sale. \"I am absolutely thrilled,\" he said of the purchase. \"It is something I always wanted to do -- get that property back. I am glad it came full circle.\" He said the purchase includes boat slips behind all the parcels and a boat maintenance and repair building behind Rum Runners. Sedney has been subletting that building to Maritime Marine, which also remains in business there. Lund Boat Works bought the 0.3-acre storage lot for $150,000 from another Erie family in December 1991, and in 1994 bought the 9,000-square-foot former Lund Boat Works building, on 0.3 acres, from the Erie County Industrial Development Authority. The sale price for that building, erected in 1932, was not available in property records. Sedney said he had been leasing that building and the storage lot from Lund Boat Works since shortly after James died in Florida at age 92 in 2011. James' family, no longer in Erie, retained ownership of the properties, and in 2013 decided to offer them to Sedney to buy \"and develop as he sees fit,\" said the lawyer for the James family, Robert Dwyer, of Erie. He said Lund Boat Works stopped operating after James died. The company's founder was celebrated Erie boat builder Herman Lund, who died at 91 in 1981. James, a sailing enthusiast and chief executive of the Erie-based High Pressure Equipment Co., once had ambitious plans for the property on East Dobbins Landing. In 2003, he proposed building a high-rise condominium in conjunction with a proposed commercial and residential development of property the Erie-Western Pennsylvania Port Authority owns on East Dobbins Landing, west of the former Lund Boat Works. The Port Authority project, called McAllister Place, has never proceeded, and neither did James' high-rise, largely because of city ordinances, said the Port Authority's executive director, Brenda Sandberg, who was the city's zoning officer when James proposed his plan. Sandberg said she does not believe the Port Authority had an offer to buy the former Lund Boat Works property. She said she welcomes Sedney's commitment to that area. \"It is certainly good,\" she said. \"It is certainly time to see increased development on that property.\" Sedney said the purchases fit with his family's vision of an expanding waterfront. \"I am heavily invested in Erie's bayfront,\" he said. \"We've been around a long time. We've seen a lot of things happen here.\" ED PALATTELLA can be reached at 870-1813 or by e-mail. Follow him on Twitter at twitter.com/ETNpalattella. Careers Staff Directory Accessibility Sitemap Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.goerie.com. All rights reserved."
    },
    {
      "url": "https://www.rumrunnersbonaire.com/about-us/",
      "text": "About Us - Rum Runners Skip to content Menu Home About Us Our Story Opening Hours Our Location Menu Lunch Cocktails Gin Bar Bites Dinner Pizza Reserve a Table Front row sunset seats, tasty cocktails and delicious food. About us Front row sunset seats, tasty cocktails and delicious food. Our beautifully designed oceanfront restaurant & cocktailbar are situated on one of the most amazing spots of Bonaire, opposite the uninhabited island of Klein Bonaire. Our menu includes items that are prepared fresh to order. Our servers are friendly and the atmosphere is perfect for dining with friends, family or business associates. Over the past 25+ years Rum Runners has grown by leaps and bounds by holding fast to these simple principles: serve excellent food and cocktails, provide outstanding service and create memorable experiences for our guests. Opening Hours Breakfast 7.00 – 10.00 Lunch 11.30 – 16.00 Pizza Temple 16.00 – 22.00 Dinner – a la carte Tuesday – Sunday 17.30 – 22.00 BBQ – all you can eat Monday 17.30 – 22.00 Giftcard Give it away! Look no further for a nice surprise or original gift. Buy a beautifully designed Rum Runners gift card. Nice to give and even nicer to receive. Order now Opening Hours Breakfast 7.00 – 10.00 Lunch 11.30 – 16.00 Pizza Temple 16.00 – 22.00 Dinner – a la carte Tuesday – Sunday 17.30 – 22.00 BBQ – all you can eat Monday 17.30 – 22.00 Contact Us Call 00599 717-8290 ext. 100 Email info@rumrunnersbonaire.com Visit Kaya Gob. N. Debrot 103 BONAIRE, Dutch Caribbean restaurant & cocktailbar designed by Luckybird © 2025 Rum Runners / Website design by Order our GIFTCARD x"
    },
    {
      "url": "https://www.wadirumnomads.com/contact",
      "text": "Contact options to get in touch with us | Wadi Rum Nomads Skip to content We don’t sell through OTA’s. Bookable only here. Call App Mail Find Facebook Instagram About Tours 1D jeep tour 1D1N jeep tour 1D1N Wadi Sabet tour 1D1N camel ride 2D2N Jabal Al-Hash tour 2D2N Wadi Sabet tour 2D2N Burdah rock bridge tour 3D3N Al-Hash & Wadi Sabet tour 3D3N Al-Hash & Burdah tour 3D3N Wadi Sabet & Burdah tour 4D4N Wadi Rum Nomads explorer tour 3D3N trekking 5D5N trekking Accommodations Traditional Bedouin camp Bivouac camping Info Wadi Rum weather Wadi Rum desert sites What to bring What to wear Booking and payment Cancellation and Rescheduling Geology, flora and fauna Wadi Rum desert map Blog Contact About Tours 1D jeep tour 1D1N jeep tour 1D1N Wadi Sabet tour 1D1N camel ride 2D2N Jabal Al-Hash tour 2D2N Wadi Sabet tour 2D2N Burdah rock bridge tour 3D3N Al-Hash & Wadi Sabet tour 3D3N Al-Hash & Burdah tour 3D3N Wadi Sabet & Burdah tour 4D4N Wadi Rum Nomads explorer tour 3D3N trekking 5D5N trekking Accommodations Traditional Bedouin camp Bivouac camping Info Wadi Rum weather Wadi Rum desert sites What to bring What to wear Booking and payment Cancellation and Rescheduling Geology, flora and fauna Wadi Rum desert map Blog Contact Book Home » Contact Contact the Nomads If you have any questions about our tour packages, accommodations, or group rates, or if you couldn’t find what you were looking for on our website, please feel free to contact us. You can reach us easily by filling out the contact form below. We appreciate your interest and would be happy to hear from you. If you want to book your Wadi Rum adventure with us, please complete our booking form ! Then we have all the required information at once. Thank you. Last-Minute Contact If you are interested in joining within the next 72 hours and want to ask us questions first, please contact us via WhatsApp.​ WhatsApp the Nomads If you’re not on WhatsApp, no worries! You can also reach us through KakaoTalk, Viber, Signal, Telegram, or Messenger. Send us a message​ \" * \" indicates required fields Your name * First Name Last Name Email address * Your mobile phone number Add your country's dialing code as well How we can help you? * How did you find us? * Instagram Facebook Family/friends/colleagues/etc Google Search Lonely Planet Petit Fute Reise Know-How Travel blog Travel forum TripAdvisor Another guidebook Other Privacy policy * I have read and accept to the privacy policy . And in addition to that, I consent to have this website store my submitted information so they can respond to my inquiry. Yes URL This field is for validation purposes and should be left unchanged. Δ What you get when sending us a message A copy of your message in your mailbox A personal response to your message Get in touch with us +962 795467190 +962 795467190 info@wadirumnomads.com If you’re not on WhatsApp, no worries! You can also reach us through KakaoTalk, Viber, Signal, Telegram, or Messenger. Reach our office in Rum Village Wadi Rum Nomads listings in guidebooks Facebook Instagram © 2014-2025 Wadi Rum Nomads. All rights Reserved. Design by Wadi Rum Nomads."
    },
    {
      "url": "https://rumrunners.co.nz/pages/contact-us",
      "text": "Contact us\n – Rum Runners NZ Skip to content RumRunnersNZ FREE SHIPPING ON ALL ORDERS OVER $129. Home About Us Shop Shop Cask Finish Rum Aged Rum Spiced Rum White Rum Over Proof Rum Rum Liquers Other Spirits All Bottles Cocktails Rum Files Fathers Day Flash Sale Log in Facebook Instagram Home About Us Shop Cask Finish Rum Aged Rum Spiced Rum White Rum Over Proof Rum Rum Liquers Other Spirits All Bottles Cocktails Rum Files Fathers Day Flash Sale WHOLESALE ENQUIRIES Search Log in Cart Item added to your cart Check out Continue shopping Contact us For all enquiries please contact via email. bruce@rumrunners.co.nz Or phone 021 934 644 Follow us on Instagram FOLLOW US SHOP All Bottles Tasting Boxes Aged Rum Spiced Rum White Rum Over Proof Rum Rum Liqueurs WHO ARE WE About Us Contact Tasting Notes INFO Alcohol License Terms and Conditions Refund Policy Shipping and Delivery Facebook Instagram © 2025, Rum Runners NZ Intrepid liquor Ltd Choosing a selection results in a full page refresh."
    }
  ]
}