{
  "fuentes": [
    {
      "url": "https://rocknbluescafe.com/",
      "email": "matt@pixelspread.com"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/membership/support-membership-frequently-asked-questions",
      "email": "k.mallory@rutheckerdhall.net"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/membership/support-membership-frequently-asked-questions",
      "email": "ksamy@rutheckerdhall.net"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/membership/support-membership-frequently-asked-questions",
      "email": "membership@rutheckerdhall.net"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/volunteer",
      "email": "volunteer@rutheckerdhall.net"
    },
    {
      "url": "https://www.schoolofrock.com/franchising/leadership-team",
      "email": "asset.logo-horz@1x.png"
    },
    {
      "url": "https://www.schoolofrock.com/franchising/leadership-team",
      "email": "asset.logo-horz@2x.png"
    },
    {
      "url": "https://www.schoolofrock.com/franchising/leadership-team",
      "email": "media@schoolofrock.com"
    },
    {
      "url": "https://bluesfest.net/en/contact.html",
      "email": "booking@bluesfest.net"
    },
    {
      "url": "https://bluesfest.net/en/contact.html",
      "email": "info@bluesfest.net"
    },
    {
      "url": "https://bluesfest.net/en/contact.html",
      "email": "media@bluesfest.net"
    },
    {
      "url": "https://bluesfest.net/en/contact.html",
      "email": "sales@bluesfest.net"
    },
    {
      "url": "https://soulbluesmusic.com/contactus.htm",
      "email": "bluescritic@yahoo.com"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/membership",
      "email": "lbennett@rutheckerdhall.net"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/membership",
      "email": "lleblanc@rutheckerdhall.net"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/membership",
      "email": "membership@rutheckerdhall.net"
    }
  ],
  "mails": [
    "asset.logo-horz@1x.png",
    "asset.logo-horz@2x.png",
    "bluescritic@yahoo.com",
    "booking@bluesfest.net",
    "info@bluesfest.net",
    "k.mallory@rutheckerdhall.net",
    "ksamy@rutheckerdhall.net",
    "lbennett@rutheckerdhall.net",
    "lleblanc@rutheckerdhall.net",
    "matt@pixelspread.com",
    "media@bluesfest.net",
    "media@schoolofrock.com",
    "membership@rutheckerdhall.net",
    "sales@bluesfest.net",
    "volunteer@rutheckerdhall.net"
  ],
  "nombre_sitio": "rutheckerdhall.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://rocknbluescafe.com/",
      "text": "Rock N Blues Rock N Blues Rock N Blues Rock N Blues Rock N Blues Rock N Blues Home Contact Us Events Rock N Blues Rock N Blues Rock N Blues Rock N Blues Make Some Noise! Make Some Noise! Make Some Noise! Make Some Noise! UPCOMING Events Home Contact Us Events About Us It's Always A Party There is always something happening at Rock N Blues. From concerts to casual entertainment We are the host to best national, reginal & local talent . Full service kitchen open late, Large outdoor patio with entertainment every weekend. You're going to have a great time! Book a Band For Your Event We can bring the event to you !! From booking the entertainment to providing sound, stage & lighting.  We ensure that your event will be stress-free and well organized. So sit back, relax, and leave things to us! Always Something Going On Visit our Facebook Page for daily updates . Wednesday -$5 Large Pizza Thursday-KARAOKE Friday- Live Entertainment Saturday-Live Entertainment Photo Gallery Copyright © 2023 Rock N Blues - All Rights Reserved. Powered by GoDaddy Website Builder This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/membership/support-membership-frequently-asked-questions",
      "text": "Support & Membership Frequently Asked Questions | Ruth Eckerd Hall Skip to content Accessibility Buy Tickets Search Donate Buy Tickets E-Club My Account Cart Events & Ticketing Events & Tickets View a complete list of all upcoming events! View Events Events Series and Packages Broadway Series Classic Albums Live Series Holiday Matinee Collection Seating Charts Group Sales Gift Certificates Program Book Just Announced Plan Your Visit Plan Your Visit The Ruth Eckerd Hall Experience is home to Clearwater's best venues. Plan your next visit today! More Info Ruth Eckerd Hall Directions & Parking Dining & Concessions A-Z Guide Preferred Restaurants & Hotels Venue History Pre-Show Dining The Nancy and David Bilheimer Capitol Theatre Directions & Parking Concessions Loge Boxes A-Z Guide Preferred Restaurants & Hotels Virtual Tour Venue History The Baycare Sound Directions and Parking Permitted And Prohibited Items A-Z Guide Concessions & Food Trucks Elevated Sound Package Preferred Restaurants and Hotels Venue History Murray Theatre at Ruth Eckerd Hall Directions & Parking A-Z Guide Preferred Restaurants & Hotels Venue History Preferred Restaurants & Hotels Ruth Eckerd Hall On The Road Education & Community Education & Community The Marcia P. Hoffman School of the Arts impacts more than 60,000 students annually of all ages, abilities, and circumstances. More Info Classes & Private Lessons Ruth Eckerd Hall Chorus Literature on-Line Video Series Schooltime Series Community Programs Scholarships & Tuition Assistance Support & Membership Support & Membership Learn how you change lives through the performing arts. Support Ruth Eckerd Hall's mission today. More Info Membership Make A Donation Planned Giving Corporate & Grantor Support Volunteer Member Login Instructions Venue Rental Plan your event with us. Save the date for and book and upcoming event in one of our beautiful, acoustically-perfect venues or dance studios. More Info The Margarete Heye Great Room Ruth Eckerd Hall Murray Theatre at Ruth Eckerd Hall The Nancy & David Bilheimer Capitol Theatre Technical Specs About Us Join our eClub Receive weekly show alerts, pre-sale notifications, special offers and more. Join Today Mission & Annual Report Connect Social Media Join Our E-Club Contests News & Blog Photo Galleries Leadership Administration Employment Contact Us Ticket Donations Donate Buy Tickets E-Club My Account Cart My Account Cart Search Close Home Support & Membership Membership Support & Membership Frequently Asked Questions Support & Membership Frequently Asked Questions Thank you for your interest in supporting Ruth Eckerd Hall’s mission. Below please find frequently asked questions regarding memberships and charitable contributions to the hall. If your question is not answered here, please contact us at ksamy@rutheckerdhall.net . Ways to Donate Ruth Eckerd Hall, Inc. is pleased to accept contributions via your preferred donation method. If you require further assistance, please email ksamy@rutheckerdhall.net . Online Visit our support page, where you can learn about Membership, Corporate & Grantor support and Planned Giving. You can also make a direct donation to our mission here Donate Now Phone Please call us at 727.712.2712 between 10 a.m. and 6 p.m. Mail Please mail contributions to the below address. Please make any checks payable to Ruth Eckerd Hall, Inc., and add any specific designations or restrictions to the “notes” field. Ruth Eckerd Hall, Inc. Attn: Development 1111 McMullen Booth Rd Clearwater, FL 33759 Wire/ACH Transfers Bank Account Title: Ruth Eckerd Hall Inc. Bank Account Number: #23244111 (do not add leading zeros) ACH Routing Number: 021052053 Wire Routing Number: 065503681 Wire Swift Code: WHITUS44 If further information is needed or if you have any questions, please contact: Joe Fontana Hancock Whitney Bank 2202 N. Westshore Blvd., Suite 150 Tampa, FL 33607 813-868-7867 Stock Donations Ruth Eckerd Hall is pleased to accept donations of publicly traded securities. To initiate a stock transfer, please contact Laurel Bennett, Director of Development Operations, at ksamy@rutheckerdhall.net . Donor Advised Funds We gladly accept donations via Donor Advised Funds. Please note that due to IRS regulations regarding these types of donations, Ruth Eckerd Hall may be unable to accept them as payments for gifts which entitle you to tangible benefits such as Membership or special event payments. We are also unable to accept bifurcated gifts via donor advised fund for any gifts which entitle you to tangible benefit, as the Treasure Department and IRS view both payments as inextricably linked. Please consult your DAF administrator for guidance regarding restrictions on these gifts. Tax ID Ruth Eckerd Hall, Inc. is a registered 501(C)(3) nonprofit; Federal Tax ID #59-1803628. Ruth Eckerd Hall, Inc. Florida Registration #CH1562 receives 100% of all contributions. Donation Questions Why does Ruth Eckerd Hall need my support? Aren’t ticket sales enough? As a non-profit performing arts organization, earned revenue like ticket sales and event rentals only cover a portion of our operating costs. We rely on support from individual donors, corporate partners and Grantors to fulfill our mission. Your gift ensures that Ruth Eckerd Hall will continue to bring the best entertainment to the Tampa Bay region and maintain quality arts education and outreach programs that enrich our community. Do I receive benefits in exchange for my donation? Ruth Eckerd Hall memberships at all levels entitle you to varying benefits at our venues. Please visit our membership page to review our membership levels and benefits. I need another copy of my donation acknowledgement. How can I request this? Please email ksamy@rutheckerdhall.net and we’ll be happy to send you a copy of your tax receipt. Can I make a donation in honor of someone? Of course. To make a donation in memorial please contact Laurel Bennett, Director of Development Operationsat ksamy@rutheckerdhall.net . Membership Questions What is the difference between a membership and a direct donation? Both memberships and direct donations are considered charitable contributions to Ruth Eckerd Hall. Memberships are a special type of donation that entitles you to special benefits at our venues. When you become a member of Ruth Eckerd Hall at any level, you’ll receive special benefits like members-only advanced ticket purchasing, access to donor lounges and special perks throughout our venues. Because some of our membership level include benefits that are tangible goods or services, some membership gifts are not fully tax deductible. You may choose to decline tangible membership benefits to receive a full tax deduction. Please consult your financial advisor for more information about your charitable contributions. You can support Ruth Eckerd Hall without becoming a member by making a direct donation here. How long does my membership last? Memberships are active for one year from the date of contribution. You will receive a renewal notice approximately two months prior to your membership expiration date. Can I share my membership benefits with friends and family? Ruth Eckerd Hall memberships are non-transferrable and may not be shared between multiple households. Membership benefits apply to only those who reside in your household. How does member ticketing work? Members at all levels enjoy the ability to purchase tickets for events presented by Ruth Eckerd Hall ahead of eClub and the general public. Members receive advanced notification of new on-sales via email, and may purchase tickets online, at our box office or via phone during their designated on-sale time (dependent on level). To ensure you receive all advance show announcements, notifications and update, please add maildelivery@rutheckerdhall.net to your safe sender list and check your email and mailing addresses are up to day. Most notifications are only sent via email, so be sure you check often. I lost my membership card, can I get a new one? Please contact membership@rutheckerdhall.net to request a replacement membership card. How do I get in to the Dress Circle lounge? Members at the Dress Circle level and above enjoy year-round access to our members-only Dress Circle lounges at Ruth Eckerd Hall and the Nancy and David Bilheimer Capitol Theatre. To learn more about the elevated benefits that come with Circle of Stars membership, contact Kellie Mallory at k.mallory@rutheckerdhall.net . To learn more about all membership levels and benefits, please visit our membership page . Top Thank You to Our Preferred Partners See All Ruth Eckerd Hall 1111 McMullen Booth Road Clearwater, FL 33759 Nancy & David Bilheimer Capitol Theatre 405 Cleveland Street Clearwater, FL 33755 The BayCare Sound 255 Drew Street Clearwater, FL 33755 Contact Us (727) 791-7400 (800) 875-8682 Events & Ticketing Events Series and Packages Seating Charts Group Sales Gift Certificates Program Book Just Announced Plan Your Visit Ruth Eckerd Hall The Nancy and David Bilheimer Capitol Theatre The Baycare Sound Murray Theatre at Ruth Eckerd Hall Preferred Restaurants & Hotels Ruth Eckerd Hall On The Road Education & Community Classes & Private Lessons Ruth Eckerd Hall Chorus Literature on-Line Video Series Schooltime Series Community Programs Scholarships & Tuition Assistance Support & Membership Membership Make A Donation Planned Giving Corporate & Grantor Support Volunteer Member Login Instructions Venue Rental The Margarete Heye Great Room Ruth Eckerd Hall Murray Theatre at Ruth Eckerd Hall The Nancy & David Bilheimer Capitol Theatre Technical Specs About Us Mission & Annual Report Connect Leadership Administration Employment Contact Us Ticket Donations Terms of Use Privacy Policy Site Map Accessibility COPYRIGHT © 2025 RUTH ECKERD HALL a carbon house experience"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/volunteer",
      "text": "Volunteer | Ruth Eckerd Hall Skip to content Accessibility Buy Tickets Search Donate Buy Tickets E-Club My Account Cart Events & Ticketing Events & Tickets View a complete list of all upcoming events! View Events Events Series and Packages Broadway Series Classic Albums Live Series Holiday Matinee Collection Seating Charts Group Sales Gift Certificates Program Book Just Announced Plan Your Visit Plan Your Visit The Ruth Eckerd Hall Experience is home to Clearwater's best venues. Plan your next visit today! More Info Ruth Eckerd Hall Directions & Parking Dining & Concessions A-Z Guide Preferred Restaurants & Hotels Venue History Pre-Show Dining The Nancy and David Bilheimer Capitol Theatre Directions & Parking Concessions Loge Boxes A-Z Guide Preferred Restaurants & Hotels Virtual Tour Venue History The Baycare Sound Directions and Parking Permitted And Prohibited Items A-Z Guide Concessions & Food Trucks Elevated Sound Package Preferred Restaurants and Hotels Venue History Murray Theatre at Ruth Eckerd Hall Directions & Parking A-Z Guide Preferred Restaurants & Hotels Venue History Preferred Restaurants & Hotels Ruth Eckerd Hall On The Road Education & Community Education & Community The Marcia P. Hoffman School of the Arts impacts more than 60,000 students annually of all ages, abilities, and circumstances. More Info Classes & Private Lessons Ruth Eckerd Hall Chorus Literature on-Line Video Series Schooltime Series Community Programs Scholarships & Tuition Assistance Support & Membership Support & Membership Learn how you change lives through the performing arts. Support Ruth Eckerd Hall's mission today. More Info Membership Make A Donation Planned Giving Corporate & Grantor Support Volunteer Member Login Instructions Venue Rental Plan your event with us. Save the date for and book and upcoming event in one of our beautiful, acoustically-perfect venues or dance studios. More Info The Margarete Heye Great Room Ruth Eckerd Hall Murray Theatre at Ruth Eckerd Hall The Nancy & David Bilheimer Capitol Theatre Technical Specs About Us Join our eClub Receive weekly show alerts, pre-sale notifications, special offers and more. Join Today Mission & Annual Report Connect Social Media Join Our E-Club Contests News & Blog Photo Galleries Leadership Administration Employment Contact Us Ticket Donations Donate Buy Tickets E-Club My Account Cart My Account Cart Search Close Home Support & Membership Volunteer Volunteer Ruth Eckerd Hall depends on our volunteers. People who have a love for the arts and share a commitment to excellent customer service, diversity of programming and teamwork will find Ruth Eckerd Hall a rewarding place to volunteer. Become a part of our volunteer family! Our volunteers provide valuable services to create the Ruth Eckerd Hall Experience for our patrons. Whether the assignment is front-of-house with patrons or behind-the-scenes, we need your expertise and smiling face. Volunteer Ushers Ushers play an important role in the Ruth Eckerd Hall Experience. Usher responsibilities include greeting and directing patrons, assisting patrons with seating and answering general patron questions. Coming to a show involves more than the artists’ performances – it involves every step of the concert-going experience and a friendly, helpful usher is key to making a memorable event. Community Event Volunteers Representing Ruth Eckerd Hall at community events/festivals is a great way to promote the Hall throughout our community. We are always looking for volunteers who are willing to encourage participation at the many events that are held at Ruth Eckerd Hall, the Nancy and David Bilheimer Capitol Theatre and more. If you are enthusiastic about our organization, we need your help! Administrative Volunteers Volunteers provide support to our administrative office in the Development, Education, Marketing and Ticketing Departments. Office responsibilities may include data entry, scheduling appointments, filing, copying, customer service and other duties. Intern positions in the Marketing department are also available. Apply To Volunteer Persons interested in joining our volunteer family should download the volunteer application to their computer, fill it out completely, save your changes and email this file to volunteer@rutheckerdhall.net , or print and deliver your application to the Administration Desk at Ruth Eckerd Hall. A county background check will be required of all volunteers. You will receive a confirmation email stating that we have received your application and a member of our team will contact you before the next recruitment phase. More Info Ushering at Ruth Eckerd Hall – what a blast! Great patrons. Great shows, Great management. Ellen, Current Volunteer Usher Volunteering at Ruth Eckerd Hall and the Nancy and David Bilheimer Capitol Theatre has given me the opportunity to do service for my community, see world-class entertainment and make great friends. Thanks for making me part of the REH Family! Stephanie, Current Volunteer Usher I retired in 2010 and I wanted to volunteer my time to a worthy cause. I chose Ruth Eckerd Hall for the following reasons: excellent venues for the arts (Ruth Eckerd Hall, The Murray Theatre, and the Nancy and David Bilheimer Capitol Theatre), excellent management within Ruth Eckerd Hall helping the ushers, enjoyment of volunteering with other head ushers and all ushers and enjoyment of helping patrons with all kinds of questions while attending a show. I’ve met a lot of really nice people while volunteering at the venues, the year-end party for the volunteers is fabulous and last but not least I get to see some of the performances. Rich, Current Head Usher facebook Follow Top Thank You to Our Preferred Partners See All Ruth Eckerd Hall 1111 McMullen Booth Road Clearwater, FL 33759 Nancy & David Bilheimer Capitol Theatre 405 Cleveland Street Clearwater, FL 33755 The BayCare Sound 255 Drew Street Clearwater, FL 33755 Contact Us (727) 791-7400 (800) 875-8682 Events & Ticketing Events Series and Packages Seating Charts Group Sales Gift Certificates Program Book Just Announced Plan Your Visit Ruth Eckerd Hall The Nancy and David Bilheimer Capitol Theatre The Baycare Sound Murray Theatre at Ruth Eckerd Hall Preferred Restaurants & Hotels Ruth Eckerd Hall On The Road Education & Community Classes & Private Lessons Ruth Eckerd Hall Chorus Literature on-Line Video Series Schooltime Series Community Programs Scholarships & Tuition Assistance Support & Membership Membership Make A Donation Planned Giving Corporate & Grantor Support Volunteer Member Login Instructions Venue Rental The Margarete Heye Great Room Ruth Eckerd Hall Murray Theatre at Ruth Eckerd Hall The Nancy & David Bilheimer Capitol Theatre Technical Specs About Us Mission & Annual Report Connect Leadership Administration Employment Contact Us Ticket Donations Terms of Use Privacy Policy Site Map Accessibility COPYRIGHT © 2025 RUTH ECKERD HALL a carbon house experience"
    },
    {
      "url": "https://www.schoolofrock.com/franchising/leadership-team",
      "text": "Leadership | Music Franchise Team | School of Rock Franchising Owning a franchise How to start a franchise Franchise opportunities Franchise Startup Costs Franchising Process Franchise Reviews Franchise FAQs Why School of Rock About Leadership Team Careers for musicians + educators News Request Info MEET THE SCHOOL OF ROCK TEAM Contact Us Leadership Team Meet the team that combines business savvy, a passion for music, and a drive to help franchisees succeed within our network of music franchises. Our leaders are a group of experienced franchise executives who are either musicians themselves or deeply passionate about music and music education at every successful musical school location. Stacey Ryan President Stacey joined School of Rock in 2015 as an Independent Consultant and steadily advanced through her dedication and impactful leadership. After serving as Chief Operations Officer for five years, Stacey stepped into an expanded leadership role when former CEO Rob Price transitioned to a position at School of Rock’s parent company, YEB. The company then adopted a leadership structure without a formal CEO, and Stacey was elevated to President of School of Rock in 2024. As President, Stacey oversees the day-to-day administrative and operational functions of School of Rock globally, ensuring the brand’s mission and vision for this leading education business franchise are carried out at every level. A graduate of Rutgers University, Stacey began her career in education at Huntington Learning Centers, where she grew her center and region into the top-performing operation in the nation. She then joined Goddard Preschools, where she developed a new department within Operations, redefining quality standards and driving results by supporting and growing both top and underperforming locations. Stacey has always had a passion for music, which has fueled her commitment to childhood education and her success at School of Rock. Her favorite musical artists include The Beatles, The Struts, and Rodrigo y Gabriela. Sam Dresser Chief Innovation Officer Since joining School of Rock in 2013, Sam has held various roles, from overseeing technology and the help desk team to now ensuring that all of our music programs, curricula, and teaching tools are world-class as our Chief Innovation Officer. Sam plays an integral part in crafting the roadmap to School of Rock's patented curriculum and leads projects that execute on that vision. While pursuing his music degree in Jazz Studies at DePaul University in Chicago, he began working at Apple retail stores. After completing his degree, Sam spent almost 10 years at Apple focusing on customer experience, management, and training. He grew up in a musical household, has always had a passion for music, and has been able to bring all of his passions together at School of Rock. Sam's favorite musical artists include Sonny Rollins, Foo Fighters, The Beatles, and Stevie Wonder. Anthony Padulo Chief Development Officer As School of Rock's Chief Development Officer, Tony oversees School of Rock's global franchise sales and real estate efforts, growing our network of music franchises, as well as managing our New School Opening efforts, franchise renewals, and resale programs. With over 40 years of experience in Franchise Development, Tony has served in various leadership positions during his 22 years at Dunkin’ Brands, including leading international development for 10 of those years. During that period, Tony launched Dunkin’ Donuts and Baskin-Robbins in excess of 30 new countries. Tony has also served as EVP, Global Development for BrightStar Care, the premier in-home care provider, VP of Franchise Development for Goddard Systems, another education business franchise, and Senior VP of Development at AAMCO Transmissions Inc. He has also had senior development roles with BP Oil, and ReMax Realty, one of the leading real estate companies worldwide. A graduate of Loyola College in Montreal, Canada, Tony came to the US in 1987. Tony's favorite musical artists include Tina Turner, Adele, Fleetwood Mac, and Alicia Keys. Demi Iskandar Head of Marketing Demi joined School of Rock in March 2020, where she witnessed the School of Rock community come together in countless ways to overcome the challenges of a global pandemic. Before joining School of Rock, Demi graduated from the State University of New York at Geneseo and moved to Los Angeles, California, where she began building her career in marketing at the United States-based new homebuilding company, KB Home. Demi is responsible for the company's domestic and international marketing strategies and leads a dynamic, customer-centric team. Together, they provide comprehensive brand support, execute large-scale events, oversee marketing activities for all School of Rock locations, and collaborate with the Franchise Development team to grow the brand's footprint. With expertise in digital marketing, brand strategy, content creation, and franchise marketing, Demi focuses on innovative campaigns that amplify School of Rock's impact. She thrives on collaboration, creativity, and data-driven decision-making to ensure marketing efforts resonate with students, parents, and the network of franchise owners and staff. Passionate about the intersection of music, education, and marketing, she is committed to inspiring the next generation of musicians while supporting the success of the worldwide network. Some of Demi's favorite musical acts include the Yeah Yeah Yeahs, Nina Simone, Black Keys, Pretty Lights, and Amine. Eric Schmidt Vice President of Information Technology Eric currently serves as School of Rock's Vice President of Information Technology, overseeing technology and the technical support team. Prior to joining School of Rock, Eric spent over 20 years in the medical device industry, focusing on Information Technology and Business Intelligence. Most recently, he served as the Director of Information Technology and Director of Business Intelligence/IT Applications for Arjo ($870M) and Getinge ($2.5B). Eric holds a BS in Network and Communications Management and graduated summa cum laude from DeVry University. Eric’s passion for music started when he was 10 years old and grew into a love for both musical performance and luthiery. In his free time, he enjoys building exact replicas of iconic rock guitars. Eric's favorite musical artists include John Mayer, Metallica, Rival Sons, Dead Sara, and many old-school blues guitarists. Jason Barteck Vice President of International Operations Jason Barteck began his career at School of Rock in 2010, directing group programs and teaching lessons in Baltimore, MD. He later oversaw a successful school in Littleton, CO, serving as both Music Director and General Manager. Since 2019, Jason has been supporting the global School of Rock community on the corporate team, where he was instrumental in launching the GearSelect program, providing everyone in our organization with access to premier musical instrument and equipment brands. He has also played a key role in managing franchise compliance, demonstrating his unwavering commitment to student safety. As Vice President of International Operations, Jason continues to advocate for expanding School of Rock’s global presence and ensuring the highest standards in music education within each international musical school. With his music degree from the University of Colorado Denver, Jason combines passion and expertise to help drive the success of School of Rock’s performance-based programs worldwide. As a musician himself from a young age, Jason draws inspiration from a wide range of musical influences, with favorites including Prince, Jellyfish, Bernhoft, and Paramore. Jim Love Vice President of Operations Jim joined School of Rock in 2006, serving as General Manager/Music Director for one of the original Philadelphia-area locations. In 2018, he moved into the role of Director of Operations. In addition to managing the 7 company-owned schools and providing support to the 44 franchise units in the Northeast, he served as Master Franchise support to Brazil and Latin America, as well as directly supporting School of Rock’s franchisees in Australia and Canada (Ontario). Jim now oversees the administrative functions of School of Rock’s domestic operations, supporting the success of our US-based music franchises. Jim holds a degree in Music Education and has been a professional musician and educator for thirty years. His favorite music artists are Led Zeppelin, Rush, the Misfits, Ghost, and Miles Davis, plus a special nostalgic affinity for KISS. Cia Tucci Vice President of Company School Operations As the Vice President of Company School Operations, Cia is responsible for building, supporting, and strengthening relationships with Operations Managers, General Managers, and school teams/staff. Her primary focus is on ensuring the continued success of our Company Owned schools by driving excellence in music programs, operational efficiency, and team collaboration, sharing best practices applicable across our education business franchise network. Cia has over 30 years of leadership, operations, and multi-unit / function experience. She started her career as a cashier and spent many years in Operations and Merchandising, which led to her first executive role as Vice President, Store Brands & Quality Assurance, leading the company’s $5B private label portfolio. In Supply Chain, she held roles of Vice President, Inventory Management for the chain’s 10k+ outlets and Vice President, Distribution where she led over 8,000 colleagues across a multi-unit, nationwide footprint. As Vice President, Sysco Brands, Cia was responsible for managing a $18B private label portfolio. Within her first year, she developed a long-term growth strategy, built a team, and launched the strategy designed to reposition Sysco Brands for increased sales and margin as well as brand differentiation within the industry. In all of her roles, she was responsible for financial performance, market growth, creating programs to improve service and brand differentiation with a deliberate focus on building, leading, and developing people. Some of Cia’s favorite music artists are REM, Elton John, Ben Folds, and Stevie Wonder. REQUEST FRANCHISE INFORMATION You can call us at 877-556-6184 to learn more about your School of Rock franchise opportunity or fill out the form on this page to receive our Franchise Information Report , which includes more in-depth information on our business model and the franchising process. For media inquiries, please contact media@schoolofrock.com . We've Received Your Info Thank you for your interest in franchising with School of Rock! Our Franchise Development team will be in touch. Download our Franchise Information Brochure. Country* Afghanistan Aland Islands Albania Algeria Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegowina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Cook Islands Costa Rica Cote D'Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France France, Metropolitan French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guatemala Guernsey Guinea Guinea-bissau Guyana Haiti Heard and Mc Donald Islands Honduras Hong Kong Hungary Iceland India Indonesia Iran (Islamic Republic of) Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Macedonia, The Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Martinique Mauritania Mauritius Mayotte Mexico Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Norway Oman Pakistan Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Qatar Reunion Romania Russian Federation Rwanda Saint Barthelemy Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka St. Helena St. Pierre and Miquelon Sudan Suriname Svalbard and Jan Mayen Islands Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda UK Ukraine United Arab Emirates Uruguay USA Uzbekistan Vanuatu Vatican City State (Holy See) Venezuela Viet Nam Wallis and Futuna Islands Western Sahara Yemen Yugoslavia Zaire Zambia Zimbabwe State/Province* 'Ajman 'Ali Sabih 'Amman 'Asir ?air ?aška ?u?er-Sandevo A'ali an Nil A'ana Aargau Abaiang Abakan Abemama Abengourou Aberdeen Aberdeenshire Abia Abidjan Abkhazia Aboisso Abra Abseron Abu Zaby Abuja Federal Capital Territory Abyan Acklins Açores Acoua Acquaviva Acre Ad Dakhiliyah Ad Dakhla Ad Dali Ad Daqahliyah Ad Dawhah Adamawa Adamawa (Adamaoua) Adan Adana Addis Ababa Addu Adelie Land Adiake Adiyaman Adjumani Adrar Adrar Adzope Aerodrom Afar Afyonkarahisar Agadez Agadir Agalega Islands Agboville AgcabAdi Agdam Agdas Aginskoye Agnibilekrou Agri Agrigento Agstafa Agsu Aguascalientes Agusan del Norte Agusan del Sur Ahal Welayaty Ahuachapan Ahvenanmaan Laani Aichi Aiga-i-le-Tai Aileu Ain Ain Defla Ain Temouchent Ainaro Aisen del General Carlos Ibanez Aisne Aitutaki Aiwo Aizkraukles Rajons Ajaria Ajdabiya Ajlun Akershus Akita Akkar Aklan Aksaray Akwa Ibom Al 'Aqabah Al 'Asimah Al 'Aziziyah Al Ahmadi Al Anbar Al Bahah Al Bahr al Ahmar Al Bahr al Ahmar Al Balqa' Al Basrah Al Batinah Al Bayda Al Buhayrah Al Buhayrat Al Farwaniyah Al Fatih Al Fayyum Al Fujayrah Al Gharbiyah Al Ghuwayriyah Al Hasakah Al Hoceima Al Hudaydah Al Hudud ash Shamaliyah Al Iskandariyah Al Isma'iliyah Al Jabal al Akhdar Al Jahra' Al Jawf Al Jawf Al Jazirah Al Jizah Al Jufrah Al Jumayliyah Al Karak Al Karbala Al Khartum Al Khawr Al Khums Al Kufrah Al Ladhiqiyah Al Madinah Al Mafraq Al Mahrah Al Mahwit Al Minufiyah Al Minya Al Muthanna Al Qadarif Al Qadisyah Al Qahirah Al Qalyubiyah Al Qasim Al Qunaytirah Al Wadi al Jadid Al Wahdah Al Wakrah Al Wusta Alabama Alagoas Alajuela Alaska Álava Alba Albacete Albay Alberta Alepe Alessandria Aley Alger Ali Bayramli Alibori Alicante Allier Almaty Almaty City Almeria Alo Alofi North Alofi South Alpes de Haute Provence Alpes Maritimes Alsace Alta Verapaz Alto Paraguay Alto Parana Aluksnes Rajons Alytus Amambay Amapa Amasya Amazonas Amazonas Amazonas Amazonas Ambergris Cays American Samoa Amhara Amnat Charoen Amran An Giang An Najaf An Nil al Abyad An Nil al Azraq An Nuqat al Khams Anabar Anadyr Anambra Ancash Ancona Andaman and Nicobar Islands Andhra Pradesh Andijon Andorra la Vella Anetan Ang Thong Anglesey Anguila Anguillita Angus Anhui Anibare Anjouan Ankara Annaba Anse aux Pins Anse Boileau Anse Etoile Anse Louis Anse Royale Anse-la-Raye Anseba (Keren) Antalya Antananarivo Antartida e Islas del Atlantico Antioquia Antique Antofagasta Antsiranana Antwerpen Anzoategui Aomori Aosta Apac Apatou Apayao Appenzell Ausserrhoden Appenzell Innerrhoden Apure Apurimac Aqmola Aqtobe Aquila Aquitaine Ar Raqqah Ar Rayyan Ar Riyad Ara?inovo Arad Aragatsotn Aragua Aranuka Ararat Arauca Araucania Arbil Archipel des Marquises Archipel des Tuamotu Archipel des Tubuai Ardabil Ardahan Ardèche Ardennes Arequipa Arezzo Arges Argyll and Bute Arhangay Arhus Ari Atoll Dheknu Ari Atoll Uthuru Ariana Ariège Arima Arizona Arkahangelsk Arkansas Armavir Armed Forces Africa Armed Forces Americas Armed Forces Canada Armed Forces Europe Armed Forces Middle East Armed Forces Pacific Arorae Arrondissements Of The Guadeloup Artibonite Artigas Artvin Arua Aruba Arunachal Pradesh Arusha As Sulaymaniyah As Suwayda As Suways Ascension Ascoli Piceno Ash Shamaliyah Ash Shariqah Ash Sharqiyah Ash Sharqiyah Ash Sharqiyah (Eastern) Ash Shati' Ashanti Region Assaba Assam Astana City Astara Asti Astrakhan Asturias Asuncion Aswan Asyut At Ta'mim At Tafilah Atacama Atafu Atakora Atiu Atlantico Atlantico Norte Atlantico Sur Atlantida Atlantique Attapu Attard Attica Atua Atyrau Aube Auckland Aude Aurora Aust-Agder Australian Capital Territory Austurland Auvergne Avannaa Avatele Aveiro Avellino Aveyron Ávila Awala-Yalimapo Awbari Awdal Ayacucho Aydin Ayeyarwady Ayutthaya Az Zahirah Az Zarqa' Az Zawiyah Azilal Azua Azuay Ba Ria-Vung Tau Baabda Baalbek BabAk Babil Bac Giang Bac Kan Bac Lieu Bac Ninh Bacau Bacs-Kiskun Badajoz Badakhshan Baden-Württemberg Badghis Bafata Region Baghdad Baghlan Bagmati Bago Bahia Bahr al Jabal Baie Lazare Baie Sainte Anne Baiti Baja California Norte Baja California Sur Baja Verapaz Baker Island Baki Bakool Balaka BalakAn Bale Baleares Bali Balikesir Balkan Welayaty Balkh Balochistan Balti Balvu Rajons Balzan Balzers Bam Bamako Capital District Bamian Bamingui-Bangoran Banaadir Banaba Bandraboua Bandrele Bandundu Banghazi Bangka Belitung Bangkok Bangolo Bangui Bani Suwayf Banja Luka Banjul Banskobystricky Banteay Meanchey Banten Banwa Baoruco Barahona Baranya Barbuda Barcelona BArdA Bari Bari Barima-Waini Barinas Barisal Barletta-Andria-Trani Barnaul Bartin Bas Rhin Bas-Congo Basel-Landschaft Basel-Stadt Basilan Basse Basse-Kotto Basse-Pointe Bataan Batanes Batangas Batha Batken Batman Batna Batroun Battambang Batys Qazaqstan Baucau Bauchi Bauskas Rajons Bay Bay of Plenty Bayan-Olgiy Bayanhongor Bayburt Bayelsa Bayern Bayqongyr City Bazega Be'er Sheva Beau Bassin-Rose Hill Beau Vallon Bechar Bedfordshire Beijing Beja Beja Bejaia Bekes Bekescsaba Bel Air Bel Ombre Bela Krajina Belait Belgorod Belize Bellefontaine Belluno Ben Arous Ben Slimane Ben Tre Benevento Bengkulu Bengo Benguela Benguet Beni Beni Mellal Benishangul-Gumaz Benue Beoumi Berat Berea Bergamo Berkshire Berlin Bern Berovo Berry Islands Beru Beyla Beylaqan Bheri Biankouma Bie Biella Bihar Bihor Bijeljina Bika'at Hayarden Bilasuvar Bilecik Biliran Biltine Bimini Bingol Binh Dinh Binh Duong Binh Phuoc Binh Thuan Bint Jbeil Bio-Bio Biombo Region Birgu Birkirkara Birobidzhan Birzebbuga Bishkek Biskra Bissau Region Bistrita-Nasaud Bitlis Bitola Bizerte Bjelovar-Bilogora Black Point Black River Blaenau Gwent Blagoevgrad Blagoveshchensk Blantyre Blekinge Blida Boa Vista Boaco Bobonaro Bocanda Bocas del Toro Bodden Town Boe Boffa Bogdanci Bogota D.C. Bogovinje Bohol Boke Bokeo Bolama Region Bolikhamxai Bolivar Bolivar Bolivar Bologna Bolu Bolzano Bomi Bonaire Bondoukou Bong Bongouanou Boqueron Bordj Bou Arreridj Borgo Maggiore Borgou Borkou-Ennedi-Tibesti Bormla Bornholm Borno Borsod-Abauj-Zemplen Bosanskopodrinjski Kanton Bosilovo Botosani Bouafle Bouake Bouches du Rhône Bouéni Bouenza Bougainville Bougouriba Bouira Boujdour Boulemane Boulgou Boulkiemde Boumerdes Bouna Boundiali Boyaca Brabant Wallon Braga Bragança Braila Brakna Brandenburg Brasov Bratislavsky Brava Brazzaville Brcko district Bremen Brescia Brestskaya (Brest) Bridgend Brikama Brindisi Bristol British Columbia Brittany Brokopondo Brong-Ahafo Region Brunei and Muara Brussels Brvenica Bryansk Bsharri Buada Bubanza Buckinghamshire Bucuresti Budapest Buenos Aires Bugiri Bujumbura Bukidnon Bulacan Bulawayo Bulgan Bulqize Bumthang Bundibugyo Bur Sa'id Burdur Burgas Burgenland Burgos Burgundy Buriram Bursa Bururi Bushehr Bushenyi Busia Buskerud Butare Butaritari Butel Butha-Buthe Buxoro Buzau Byblos Byumba Ca Mau Caaguazu Caazapa Cabanas Cabinda Cabo Delgado Cabrayil Cáceres Cacheu Region Cádiz Caerphilly Cagayan Cagliari Cahul Cajamarca Calarasi Caldas Calheta de Sao Miguel California Calilabab Callao Caltanissetta Calvados Camaguey Camarines Norte Camarines Sur Cambridgeshire Camiguin Camopi Campeche Campobasso Can Tho Canakkale Cañar Canelones Canillo Canindeyu Cankiri Cankuzo Cantabria Cantal Canterbury Cantons Of The Guadeloupe Depart Cao Bang Capellen Capital Capital Federal Capiz Caprivi Caqueta Carabobo Caras-Severin Carazo Carbonia-Iglesias Carchi Cardiff Cargados Carajos Shoals (Saint B Carlow Carmarthenshire Carriacou Cartago Casablanca Casanare Cascade Case-Pilote Caserta Castellón Castelo Branco Castries Cat Island Catamarca Catanduanes Catania Catanzaro Cathedral Parish Cauca Cavan Cavite Cayenne Cayo Ceara Cebu Centar Centar Župa Center Loire Valley Central Central Central Central Central Central Central Central Central (Maekel) Central Abaco Central and Western Hong Kong Is Central Andros Central Division Central Eleuthera Central Greece Central Macedonia Central Region Central River Centrale Centre Centre Ceredigion Cerro Largo Cesar Cesinovo-Obleš Cesu Rajons Ceuta Ch'ungch'ong-bukto Ch'ungch'ong-namdo Chachoengsao Chaco Chagang-do Chaguanas Chahar Mahaal and Bakhtiari Chai Nat Chaiyaphum Chalatenango Champagne Champasak Chandigarh Chang-hua Chanthaburi Chaouen Charente Charente Maritime Chari-Baguirmi Charlotte Cheboksary Cheju-do Chelyabinsk Cher Cherkasy Cherkessk Chernihiv Chernivtsi Cheshire Chi-lung Chia-i Chia-i city Chiang Mai Chiang Rai Chiapas Chiba Chiconi Chiesanuova Chieti Chihuahua Chikwawa Chimaltenango Chimborazo Chimbu Chin State Chinandega Chiquimula Chiradzulu Chiriqui Chirongui Chisinau Chita Chitipa Chittagong Chlef Choco Choiseul Choiseul Cholla-bukto Cholla-namdo Choluteca Chon Buri Chongqing Chontales Chouf Christ Church Christ Church Nichola Town Chu Chubut Chukha Chumphon Chuquisaca Cibitoke Ciego de Avila Cienfuegos Citta di San Marino City of Freeport City of Zagreb Ciudad de La Habana Ciudad Real Clackmannanshire Clare Clarendon Parish Clervaux Cluj Coahuila de Zaragoza Coast Cochabamba Cocle Coimbra Cojedes Colima Collines Colon Colon Colonia Colorado Comayagua Commewijne Communes Of The Guadeloupe Depar Como Comoe Compostela Conakry Concepcion Connecticut Constanta Constantine Conwy Copan Copenhagen Copperbelt Coquimbo Cordillera Córdoba Cordoba Cordoba Cork Cornwall Coromandel Coronie Corozal Corrèze Corrientes Corse Corse du Sud Cortes Corum Cosenza Côte d'or Côtes d'Armor Cotopaxi County Antrim County Armagh County Down County Fermanagh County Londonderry County Tyrone Couva/Tabaquite/Talparo Cova Lima Covasna Coyah Creek Cremona Crete Creuse Crimea Crooked Island Cross River Crotone Csongrad Cuando-Cubango Cuanza Norte Cuanza Sul Cuenca Culfa Cumbria Cundinamarca Cunene Cuneo Curaçao Curepipe Cuscatlan Cusco Cuvette Cuvette-Ouest Cuyuni-Mazaruni Cyangugu Da Nang Dabakala Dabola Dabou Dadra and Nagar Haveli Dagana Dahuk Daista Aceh Daista Yogyakarta Dajabon Dak Lak Dak Nong Dakar Dakhlet Nouadhibou Dalaba Dalama Daloa Daman and Diu Danane Danger Island Daoukro Dar es Salaam Dara Darhan uul Darien Darnah Dashhowuz Welayaty Daskasan Daugavpils Daugavpils Rajons Dauphin Davaci Davao del Norte Davao del Sur Davao Oriental Dayr az Zawr Debar Debarca Debrecen Dedza Del?evo Delaware Delhi Dellis Cay Delta Delta Amacuro Delvine Dembeni Demerara-Mahaica Demir Hisar Demir Kapija Denbighshire Denigomodu Denizli Dennery Dependencias Federales Derbyshire Deux Sèvres Devoll Devon Devonshire Dhaka Dhamar Dhawalagiri Dhi Qar Diber Diego Garcia Diego Martin Diekirch Dien Bien Diffa Dikhil Dili Dimashq Dimbokro Dimbovita Dingli Dinguiraye Diourbel Dire Dawa Direction Island District of Columbia Distrito Federal Distrito Federal Distrito Federal Distrito Nacional Divo Diyala Diyarbakir Djelfa Djibouti Dki Jakarta Dnipropetrovs'k Dobeles Rajons Doboj Dobrich Dodoma Dog Dolenjska Dolj Dolneni Dolnoslaskie Domagnano Donegal Donets'k Dong Nai Dong Thap Donga Dordogne Dornod Dornogov Dorset Dosso Doubs Dowa Drenthe Drôme Drugovo Druif Beach Duarte Dubayy Dublin Dubreka Dubrovnik-Neretva Ducos Dudinka Duekoue Dumfries and Galloway Dumyat Dunaujvaros Dundee DundgovL Durango Durazno Durham Durres Duzce Dzaoudzi Dzavhan Eagle Islands East (Est) East Ayrshire East Azarbaijan East Berbice-Corentyne East Caicos East Dunbartonshire East Grand Bahama East Lothian East Macedonia and Thrace East New Britain East Renfrewshire East Riding of Yorkshire East Sepik East Side East Sussex Eastern Eastern Eastern Eastern Eastern Eastern Cape Eastern Division Eastern Highlands Eastern Hong Kong Island Eastern Region Eastern Samar Ebonyi Echternach Edinburgh Edinet Edirne Edo Eger Egmont Islands Ehime Eilat and Arava Eiði Ekiti El Bayadh El Jadida El Kelaa des Sraghna El Oro El Oued El Paraiso El Peten El Progreso El Quiche El Seybo El Tarf Elazig Elbasan Elias Pina Elista Encamp Enga Enna Entre Rios Enugu Epirus Equateur Er Rachidia Ermera Erongo Erzincan Erzurum Es Smara Escaldes-Engordany Esch-sur-Alzette Eschen Escuintla Esfahan Eskisehir Esmeraldas Espaillat Espirito Santo Essaouira Essequibo Islands-West Demerara Essex Essonne Esteli Estuaire Etela-Suomen Laani Etranger Eure Eure et Loir Évora Ewa ExtrÃªme-Nord Exuma Fa'asaleleaga Faadhippolhu Faetano Fakaofo Falcon Falkirk Famagusta Fámjin Farah Faranah Farg'ona Faro Faroe Islands Fars Faryab Fatick Federally Administered Tribal Ar Federated States Of Micronesia Fejer Felidhe Atoll Ferkessedougou Fermo Ferrara Fes Fgura Fianarantsoa Fier Fife Figuig Finistère Finnmark Fiordland Fiorentino Firenze Flacq Flat Island Flevoland Flintshire Flores Floriana Florida Florida Foca Foggia Fonds-Saint-Denis Fontana Fontvieille Forecariah ForlÃ¬ Formosa Fort-De-France France Comte Francisco Morazan Frederiksborg Free State French Cay Fria Fribourg Friesland Frosinone Fua Mulaku Fuglafjørður Fugloy Fujian Fukui Fukuoka Fukushima Funafuti Funningur Fuzuli Fyn Gabes Gabrovo Gabu Region Gadabay Gafsa Gaga'emauga Gagaifomauga Gagauzia Gagnoa Galápagos Galati Galguduud Galil Galway Gambela Gamprin Ganca Gandaki Gansu Ganzourgou Gao Gaoual Gard Gargur Gasa Gash-Barka (Barentu) Gauteng Gävleborg Gaxaq Gaza Gazi Baba Gaziantep Gedo Geghark'unik' Gelderland Genève Genova George Town Georgia Gerona Gers Gevgelija Ghadamis Ghajnsielem Ghanzi Gharb Gharb al Istiwa'iyah Gharb Bahr al Ghazal Gharb Darfur Gharb Kurdufan Ghardaia Gharyan Ghasri Ghazni Ghowr Gia Lai Gifu Gikongoro Gilan Giresun Gironde Gisborne Gisenyi Gitarama Gitega Giurgiu Gjirokaster Gjorče Petrov Glacis Glarus Glasgow Gloucestershire Gnagna Goa Goias Golestan Gombe Gomo-Altaysk Goranboy Gorenjska Gorgol Gorizia Gorj Gorno-Altaysk Gorno-Badakhstan Gorontalo Gostivar Gotland Gourma Govi-Altay Govi-Sumber Goycay Gracias a Dios Gradsko Gramsh Granada Granada Grand Bassa Grand Cape Mount Grand Cay Grand Gedeh Grand Kru Grand Port Grand Turk Grand' Anse (on Mahe) Grand' Anse (on Praslin) Grand'Anse Grand'Rivière Grand-Bassam Grand-Lahou Grand-Santi Grande Comore Granma Graubünden Greater Accra Region Greater London Greater Manchester Grenadines Grevenmacher Groningen Gros-Islet Gros-Morne Grosseto Groznyy Guadalajara Guadalcanal Guainia Guaira Guajira Guam Guanacaste Guanajuato Guangdong Guangxi Guantanamo Guarda Guarico Guatemala Guaviare Guayas Gudja Gueckedou Guelma Guelmim Guera Guerrero Guidimaka Guiglo Guimaras Guipúzcoa Guizhou Gujarat Gulbenes Rajons Gulf Gulu Gumma Gumushane Guria Gwynedd Gyor Gyor-Moson-Sopron Gzira Gøtu Kommuna Ha Giang Ha Nam Ha Noi Ha Tay Ha Tinh Ha'apai Ha'il Haa Haciqabul Hadhdhunmathi Hadramawt Hai Duong Hai Phong Haifa Hainan Hainaut Hajdu-Bihar Hajjah Hakkari Hakupu Halab Halland Hamadan Hamah Hamburg Hamgyong-bukto Hamgyong-namdo Hamilton Hamilton City Hampshire Hamrun Hanover Parish Harare Harbour Island Hardap Harghita Hariai Harjumaa (Tallinn) Haryana Has Hasbaya Haskovo Hatay Hato Mayor Hau Giang Haut Rhin Haut-Mbomou Haut-Ogooue Haute Corse Haute Garonne Haute Loire Haute Marne Haute Saône Haute Savoie Haute Vienne Haute-Kotto Hautes Pyrénées Hautes-Alpes Hauts de Seine Hawaii Hawalli Hawke's Bay Heard Island Hebei Hedmark Heilongjiang Helmand Henan Hentiy Herat Hérault Hercegovacko-neretvanski Kanton Heredia Herefordshire Hermel Herrera Hertfordshire Hessen Heves Hhohho Hidalgo Highlands Hiiraan Hiiumaa (Kardla) Hikutavake Himachal Pradesh Hims Hiroshima Hlavní město Praha Ho Chin Minh Hoa Binh Hodh Ech Chargui Hodh El Gharbi Hodmezovasarhely Hofuoborgarsvaeoi Hoima Hokkaido Holguin Home Island Homyel'skaya (Homyel') Hong Kong Honiara Hope Town Horad Minsk Hordaland Hormozgan Horsburgh Island Houaphan Houet Hov Hovd Hovsgol Howland Island Hrodzyenskaya (Hrodna) Hsin-chu Hsin-chu Hua-lien Huambo Huancavelica Huanuco Hubei Huehuetenango Huelva Huesca Huila Huila Hunan Hunedoara Hung Yen Húsar Húsavík Huvadhu Atoll Dhekunu Huvadhu Atoll Uthuru Hvalba Hvannasund Hwanghae-bukto Hwanghae-namdo Hyogo I-lan Ialomita Iasi Ibaraki Ibb Ica Ida-Virumaa (Johvi) Idaho Idlib Ifrane Ifugao Iganga Igdir Ijuw Iklin Ilam Ile Amsterdam Ile Saint-Paul Iles Crozet Iles du Vent Iles Kerguelen Iles Loyaute Iles Sous-le-Vent Ilfov Ilinden Ille et Vilaine Illinois Illizi Ilocos Norte Ilocos Sur Iloilo Imbabura Imereti Imisli Imo Imperia Inagua Inch'on-gwangyoksi Inchiri Independencia Indiana Indre Indre et Loire Inhambane Inner Mongolia Intibuca Inverclyde Ioba Ionian Islands Iowa Iracoubo Irbid Irian Jawa Barat Irian Jaya Tengah Irian Jaya Timur Iringa Irkutsk Isabel Isabela Isére Isernia Ishikawa Isla Isla de la Juventud Islamabad Capital Territory Islands New Territories Islas de la Bahia (Bay Islands) Isle of Man Isle of Wight Ismayilli Isparta Issia Istanbul Istra Ita-Suomen Laani Itapua Ivano-Frankivs'k Ivanovo Iwate Izabal Izhevsk Izmir Jacqueville Jaén Jalal-Abad Jalapa Jalisco Jambi Jammu and Kashmir Jämtland Janakpur Janjangbure Janub Darfur Janub Kurdufan Janub Sina' Jarash Jarayan al Batinah Jarvamaa (Paide) Jarvis Island Jasz-Nagykun-Szolnok Jawa Barat Jawa Tengah Jawa Timur Jegunovce Jehuda Mountains Jekabpils Rajons Jelgava Jelgavas Rajons Jendouba Jerusalem Jezzine Jiangsu Jiangxi Jigawa Jihočeský Jihomoravský Jijel Jilin Jinja Jinotega Jizan Jizzax Jogevamaa (Jogeva) Johnston Atoll Johor Jönköping Jowzjan Jubbada Dhexe Jubbada Hoose Jujuy Junin Junqali Jura Jura Jurmala Jutiapa Kabale Kabarole Kaberamaido Kabul Kachin State Kadiogo Kaduna Kafr ash Shaykh Kagawa Kagera Kagoshima Kahramanmaras Kairouan Kakheti Kalangala Kalasin Kalbacar Kalimantan Barat Kalimantan Selatan Kalimantan Tengah Kalimantan Timur Kalinga Kalinigrad Kalkara Kalmar Kaluga Kampala Kamphaeng Phet Kampong Cham Kampong Chhnang Kampong Som Kampong Speu Kampong Thom Kampot Kamuli Kamwenge Kanagawa Kanchanaburi Kandahar Kandal Kanem Kangwon-do Kangwon-do Kani-Kéli Kanifeng Kankan Kano Kansas Kanton Kanton Sarajevo Kanungu Kao-hsiung city Kao-hsiung county Kaoh Kong Kaolack Kapchorwa Kapisa Kaposvar KAR Kärnten Kara Karabuk Karaman Karas Karbinci Kardjali Karlovac Karlovarský Karnali Karnataka Karonga Karpoš Kars Karuzi Kasai-Occidental Kasai-Oriental Kasese Kasnodar Kassala Kasserine Kastamonu Kasungu Katakwi Katanga Katiola Katsina Kaunas Kavadarci Kavaje Kavango Kayah State Kayanza Kayes Kayin State Kayseri Kayunga Kazan Keb Kebbi Kebili Kecskemet Kedah Kef Kelantan Kemerovo Kemo Kenedougou Kenitra Kent Kentucky Kerala Kercem Kerewan Kerman Kermanshah Kerouane Kerry Kesrwan Kgalagadi Kgatleng Khabarovsk Khammouan Khanty-Mansiysk Kharkiv Kherson Khatlon Khemisset Khenchela Khenifra Khmel'nyts'kyy Khomas Khon Kaen Khost Khouribga Khulna Khuzestan Ki?evo Kibaale Kiboga Kibungo Kibuye Kidal Kiev Kigali Rurale Kigali-ville Kigoma Kildare Kilimanjaro Kilis Kilkenny Kin-men Kindia Kingman Reef Kingston Parish Kinshasa Kirikkale Kiritimati Kirklareli Kirkop Kirovohrad Kirsehir Kirundo Kisela Voda Kisoro Kissidougou Kitaa Kitgum Klaipeda Klaksvík Ko?ani Kobenhavn Kocaeli Kochi Kogi Kohkiluyeh and Buyer Ahmad Kolda Kolhumadulu Kolonje Komarom-Esztergom Komondjari Kompienga Kon?e Konar Kondoz Konya Koprivnica-Krizevci Korce Korhogo Koroška Kosi Kosicky Kosovo Kossi Kostroma Kotayk' Kotido Koubia Kouffo Kouilou Koulikoro Koulpelogo Koundara Koungou Koura Kouritenga Kourou Kouroussa Kourweogo Kowloon City Kowloon Krabi Královéhradeck Krapina-Zagorje Kraslavas Rajons Krasnodar Krasnoyarsk Kratie Kratovo Kriva Palanka Krivogaštani Kronoberg Kruje Kruševo Kuala Lumpur Kucove Kudymkar Kujawsko-Pomorskie Kukes Kuldigas Rajons Kumamoto Kumanovo Kumi Kunene Kunoy Kuntaur Kurbin Kurdamir Kurdistan Kurgan Kuria Kursk Kutahya Kvemo Kartli Kvívík Kwai Tsing New Territories Kwangju-gwangyoksi Kwara KwaZulu-Natal Kweneng Kwun Tong Kowloon Kyenjojo Kyonggi-do Kyongsang-bukto Kyongsang-namdo Kyoto Kyrenia Kyustendil Kyyiv Kyzyl L'Ajoupa-Bouillon L'viv La Altagracia La Condamine La Coruña La Digue La Habana La Libertad La Libertad La Massana La Pampa La Paz La Paz La Paz La Rioja La Rioja La Riviere Anglaise La Romana La Spezia La Trinité La Union La Union La Vega Laane-Virumaa (Rakvere) Laanemaa (Haapsalu) Laayoune Labe Laborie Labuan Lac Lacin Laghman Laghouat Lagos Laguna Lahij Lakepa Lakota Lakshadweep Islands Lambayeque Lampang Lamphun Lampung Lanao del Norte Lanao del Sur Lancashire Landes Languedoc Roussillon Lankaran Lankaran Lansi-Suomen Laani Laois Lapin Lanani Lapusna Lara Larache Larnaca Las Palmas Las Tunas Latina Lautem Lavalleja Le Carbet Le Diamant Le François Le Lamentin Le Lorrain Le Marigot Le Marin Le Morne-Rouge Le Morne-Vert Le Prêcheur Le Robert Le Vauclin Lebap Welayaty Lecce Lecco Leicestershire Leiria Leirvík Leitrim Lekoumou Lelouma Lempira Leon León Leraba Leribe Lérida Lerik Les Anses-d'Arlet Les Trois-Îlets Leyte Lezhe Lhuntse Liaoning Liberecký Libertador General Bernardo O'Hi Librazhd Liege Lien-chiang Liepaja Liepajas Rajons Lija Lika-Senj Likoma Likouala Liku Lilongwe Lima Limassol Limbazu Rajons Limburg Limburg Limerick Limon Limousin Limpopo Lincolnshire Lindi Lipetsk Lipkovo Liquica Lira Lisboa Little Scrub Little Water Cay Littoral Littoral Livorno Lobaye Lodi Lodzkie Loei Lofa Logone Occidental Logone Oriental Loir et Cher Loire Loire Atlantique Loiret Loja Lola Long Island Longford Lop Buri Lorestan Loreto Loroum Lorraine Lorri Los Lagos Los RÃ­os Los Santos Lot Lot et Garonne Louang Namtha Louangphabang Louga Louisiana Louth Lovech Lower River Lowgar Lozère Lozovo Luanda Luapula Lubelskie Lubombo Lubuskie Lucca Lucerne Ludzas Rajons Lugo Luhans'k Lumbini Lunda Norte Lunda Sul Luqa Lusaka Lushnje Luwero Luxembourg Luxembourg M'Sila M'Tsangamouji Ma'an Ma'rib Maalhosmadulu Dhekunu Maalhosmadulu Uthuru Macau Macenta Macerata Machinga Macouba Macouria Madaba Madang Madeira Madhya Pradesh Madinat ash Shamal Madonas Rajons Madre de Dios Madrid Madriz Mae Hong Son Mafeteng Magadan Magallanes y de la Antartica Chi Magdalena Maguindanao Magway Maha Sarakham Mahaica-Berbice Mahajanga Mahakali Maharashtra Mahdia Mahilyowskaya (Mahilyow) Maiana Maine Maine et Loire Maio Makamba Makedonska Kamenica Makedonski Brod Makefu Makhachkala Makin Makira Makkah Málaga Malaita Malampa Malange Malatya Maldonado Male Atoll Malesi e Madhe Mali Mallakaster Malopolskie Maluku Maluku Utara Mambéré-Kadéï Mamou Mamoudzou Man Mana Manabí Managua Manatuto Manawatu-Wanganui Manche Manchebo Beach Manchester Parish Mandalay Mandiana Mangaia Mangghystau Mangochi Mangrove Cay Manica Manicaland Maniema Manihiki Manipur Manisa Manitoba Mankono Manouba Mansakonko Mantova Manuae Manufahi Manus Manyara Manzini Maputo Maputo (city) Mara Maradi Marakei Maramures Maranhao Mardin Margibi Maria Trinidad Sanchez Marijampole Marinduque Maripasoula Maritime Marjeyoun Markazi Marlborough Marne Marowijne Marrakech Marsa Marsaskala Marsaxlokk Marshall Islands Mary Welayaty Maryland Maryland Masaka Masalli Masaya Masbate Maseru Mashonaland Central Mashonaland East Mashonaland West Masindi Masqat Massa-Carrara Massachusetts Masvingo Mat Matabeleland North Matabeleland South Matagalpa Matam Matanzas Matera Matn Mato Grosso Mato Grosso do Sul Matoury Matruh Mauke Maule Mauren Mavrovo and Rostuša Mayaguana Mayaro/Rio Claro Mayenne Maykop Mayo Mayo-Kebbi Maysan Mayuge Mazandaran Mazowieckie Mbahiakro Mbale Mbarara Mbeya Mbomou McDonald Island Mchinji Mdina Meath Mechi Mecklenburg-Vorpommern Medea Medenine Medimurje Medio Campidano Meghalaya Mehedinti Meknes Melaka Melilla Melliea Mendoza Meneng Merida Mersch Merseyside Mersin Merthyr Tydfil Messina Meta Metro Manila Meurthe et Moselle Meuse Mexico Mgarr Miao-li Michigan Michoacan de Ocampo Micoud Middle Caicos Midi Pyrenees Midland Midlands Midlothian Midway Atoll Mie Mila Miladhunmadulu Dhekunu Miladhunmadulu Uthuru Milano Milne Bay Minas Gerais Mindoro Occidental Mindoro Oriental Mingacevir Miniyeh-Danniyeh Minnesota Minskaya Miquelon Miranda Mirdite Misamis Occidental Misamis Oriental Misiones Misiones Miskolc Misratah Mississippi Missouri Mitiaro Miyagi Miyazaki Mizoram Miðvágur Modena Mogila Mohale's Hoek Moheli Moka Mokhotlong Mon State Monaco-Ville Monagas Monaghan Monastir Mondul Kiri Mongar Monmouthshire Mono Monsenor Nouel Mont Buxton Mont Fleuri Montana Montana Monte Cristi Monte Plata Monte-Carlo Montegiardino Montenegro Montevideo Montserrado Montsinéry-Tonnegrande Monza e Brianza Moore's Island Mopti Moquegua Moravskoslezský Moray Morazan Morbihan Morelos Morobe Morogoro Morona Santiago Moroto Moscow Moselle Mosta Mostaganem Mosteiros Mouhoun Mountain Moxico Moyen-Chari Moyen-Ogooue Moyo Mpigi Mpumalanga Mqabba Msida Mt Cook-Mackenzie Mtarfa Mtsamboro Mtskheta-Mtianeti Mtwara Muaskar Mubende Mudug Mugla Muharraq Mukdahan Mukono Mulaku Atoll Mulanje Munxar Muramvya Murcia Mures Murmansk Murzuq Mus Musandam Mutalau Muyinga Mwanza Mwanza Mwaro Mykolayiv Mzimba Møre og Romsdal Naama Nabatieh Nabeul Nador Nadur Naftalan Nagaland Nagano Nagasaki Nagykanizsa Nahouri Nahr an Nil Nairobi Area Najran Nakapiripirit Nakasongola Nakhon Nayok Nakhon Pathom Nakhon Phanom Nakhon Ratchasima Nakhon Sawan Nakhon Si Thammarat Nalchik Namangan Namentenga Namibe Nampula Namukulu Namur Nan Nan-t'ou Nana-Grebizi Nana-Mambere Nangrahar Nanumanga Nanumea Napo Napoli Nara Narathiwat Narayani Narino Naryan Mar Naryn Nassarawa Nassau Island National Capital Navarra Navassa Island Navoiy Naxcivan Naxxar Nayala Nayarit Nazran Neamt Neath Port Talbot Nebbi Nebraska Neembucu Neftcala Negeri Sembilan Negev Negotino Negros Occidental Negros Oriental Nelson Nelsons Island Nes Neuchâtel Neuquen Nevada Nevsehir New Brunswick New Hampshire New Ireland New Jersey New Mexico New South Wales New York Newfoundland and Labrador Newport Ngamiland Ngounie Ngozi Niamey Niari Niassa Nibok Nickerie Nicosia Nidwalden Niederöesterreich Niedersachsen Nièvre Nigde Niger Niigata Nikunau Nilandhe Atoll Dhekunu Nilandhe Atoll Uthuru Nimba Nimruz Ninawa Ningxia Nitriansky Niulakita Niutao Nizhniy Novgorod Nkhata Bay Nkhotakota Nograd Nong Bua Lamphu Nong Khai Nonouti Nonthaburi Noord Noord Brabant Noord Holland Nord Nord Nord Nord Pas de Calais Nord-Est Nord-Kivu Nord-Ouest Nord-Trøndelag Nordjylland Nordland Nordrhein-Westfalen Norfolk Norfolk Island Normandy Norourland eystra Norourland vestra Norrbotten Norte de Santander North (Nord) North Abaco North Aegean North Andros North Ayrshire North Bank North Caicos North Carolina North Central North Cotabato North Dakota North District North East North Eastern North Eleuthera North Khorasan North Lanarkshire North New Territories North Side North West North West North Western North Yorkshire North-West Frontier North-Western Northamptonshire Northern Northern Northern Northern Northern Northern Cape Northern Division Northern Mariana Islands Northern Red Sea (Semien-Keih-Ba Northern Region Northern Samar Northern Territory Northland Northumberland Northwest (Nord-Ouest) Northwest Territories Notranjska Nottinghamshire Nouakchott Noumbiel Nova Scotia Novaci Novara Novgorod Novo Selo Novosibirsk Nsanje Ntcheu Ntchisi Ntungamo Nueva Ecija Nueva Esparta Nueva Vizcaya Nuevo Leon Nuevo Segovia Nugaal Nui Nukufetau Nukulaelae Nukunonu Nunavut Nuoro Nurestan Nusa Tenggara Barat Nusa Tenggara Timur Nyanga Nyanza Nyiregyhaza Nzerekore Oaxaca Obock Obwalden Ocotepeque Oddar Meancheay Odesa Odienne Oecussi Offaly Ogliastra Ogooue-Ivindo Ogooue-Lolo Ogooue-Maritime Ogres Rajons Ogun Oguz Ohangwena Ohio Ohrid Oio Region Oise Oita Okayama Okinawa Oklahoma Olancho Olbia-Tempio Olomoucký Olt Omaheke Ombella-M'Poko Omnogovi Omsk Omusati Ondo Ongtustik Qazaqstan Onotoa Ontario OOS Oberöesterreich Oost-Vlaanderen Opolskie Oppland Oran Orange Walk Oranjestad Ordino Ordu Ordubad Örebro Oregon Orel Orellana Orenburg Orhei Orhon Orientale Orissa Oristano Orkney Islands Orne Oromia Oruro Oruzgan Osaka Osh Oshana Oshikoto Osijek-Baranja Oslo Oslomej Osmaniye Östergötland Osun Otago Other Otjozondjupa Ouaddai Ouaka Ouanary Ouangani Ouargla Ouarzazate Oubritenga Oudalan Oudomxai Oueme Ouest Ouham Ouham-Pende Oujda Oulun Laani Oum el-Bouaghi Oume Our Lady Fatima Parish Ourense Overijssel Ovorhangay Oxfordshire Oyo P'eng-hu P'ing-tung P'yongan-bukto P'yongan-namdo P'yongyang Special City Pader Padova Paget Pahang Pailin Paktia Paktika Palana Palau Palauli Palawan Palencia Palermo Pallisa Palm Beach Palmerston Palmyra Atoll Pamandzi Pampanga Pamplemousses Panama Pando Panevezys Pangasinan Paola Papaïchton Paphos Para Para Paraguari Paraiba Paramaribo Paraná Pardubický Paris Paris / Ill de France Parma Parnumaa (Parnu) Paro Parrot Cay Parwan Pas de Calais Pasco Passore Pastaza Pathum Thani Pattani Paul Pavia Pavlodar Paysandu Pazardjik Pecs Pedernales Peh?evo Peloponnesos Pemagatshel Pemba North Pemba South Pembroke Pembroke Pembrokeshire Penal/Debe Penama Pennsylvania Penrhyn Penza Peqin Perak Peravia (Bani) Perlis Perm Permet Pernambuco Pernik Peros Banhos Perth and Kinross Perugia Pesaro Urbino Pescara Pest Petit Martinique Petropavlovsk-Kamchatskiy Petrovec Petrozavodsk Phalombe Phangnga Phatthalung Phayao Phetchabun Phetchaburi Phichit Phitsanulok Phnom Penh Phongsali Phrae Phuket Piacenza Piaui Picardie Pichincha Pieta Pinar del Rio Pine Cay Pisa Pistoia Pita Pitcairn Island Piura Plaines Wilhems Plaisance Planken Plasnica Plateau Plateau Plateaux Plateaux Pleven Plovdiv Plzeňský Podkarpackie Podlaskie Pogradec Point Fortin Pointe La Rue Poitou Charente Poltava Polvamaa (Polva) Pomeroon-Supenaam Pomorskie Pondicherry Poni Pontevedra Pool Pordenone Porkeri Port Glaud Port Louis Port Louis Port of Spain Portalegre Portland Parish Porto Porto Novo Portuguesa Posavski Kanton Potaro-Siparuni Potenza Potosi Powys Pozega-Slavonia Prachin Buri Prachuap Khiri Khan Prahova Praia Praslin Prato Preah Seihanu (Kompong Som or Si Preah Vihear Preilu Rajons Prekmurje Presidente Hayes Presovsky Prey Veng Prickly Pear Prilep Primorje-Gorski Kotar Primorska Prince Edward Island Princes Town Principe Probištip Provence Providenciales Provincia Annobon Provincia Bioko Norte Provincia Bioko Sur Provincia Centro Sur Provincia Kie-Ntem Provincia Litoral Provincia Wele-Nzas Pskov Puebla Puerto Plata Puerto Rico Pukapuka Puke Pulau Pinang Punakha Punjab Punjab Puno Puntarenas Pursat Pusan-gwangyoksi Putumayo Puy de Dôme Pwani Pyrénées Atlantiqu Pyrénées Orientale Qabala Qacha's Nek Qala Qaraghandy Qashqadaryo Qax Qazax Qazvin Qina Qobustan Qom Qoraqalpog'iston Republikasi Qormi Qostanay Qrendi Quatre Bornes Quba Qubadli Québec Queensland Queretaro de Arteaga Quetzaltenango Quezon Quinara Region Quindio Quintana Roo Quirino Qusar Quthing Qyzylorda R'as al Khaymah Rabat Rabat-Sale Racha Lechkhumi and Kvemo Svanet Radoviš Ragged Island Ragusa Rajasthan Rajshahi Rakahanga Rakai Rakhine State Rankovce Ranong Raplamaa (Rapla) Rapti Rarotonga Rashaya Rason Directly Governed City Ratanak Kiri Ratchaburi Ravenna Rayong Razavi Khorasan Razgrad Reclamation Areas Redange Redonda Reggio Calabria Reggio Emilia Régina Region Metropolitana Relizane Remich Remire-Montjoly Renfrewshire Rennell and Bellona Resen Retalhuleu Rezekne Rezeknes Rajons Rheinland-Pfalz Rhode Island Rhondda Cynon Taff Rhône Rhone Alps Riau Ribe Ribeira Grande Rieti Rif Dimashq Rift Valley Riga Rigas Rajons Rimini Ringkobing Rio de Janeiro Rio Grande do Norte Rio Grande do Sul Rio Negro Rio Negro Rio San Juan Risaralda Rivas River Cess Rivera Rivers Riviera Riviere du Rempart Rivière-Pilote Rivière-Salée Rivne Rizal Rize Rocha Rodrigues Rogaland Roi Et Roma Romblon Rondônia Rooi Thomas Roraima Roscommon Roskilde Rosoman Rostov-na-Donu Rotuma Roura Rovigo Ruggell Ruhengeri Rukungiri Rukwa Rum Cay Rumphi Runavík Rutana Rutland Ruvuma Ruyigi Ryanggang-do (Yanggang-do) Ryazan Sa Kaeo Sa'dah Saaremaa (Kuessaare) Saarland Saatli Saba Sabah Sabaragamuwa Sabha Sabirabad Sacatepequez Sachsen Sachsen-Anhalt Sada Sadarak Safi Safi Saga Sagaing Sagarmatha Sahbuz Sai Kung New Territories Saida Saint Andrew Saint Andrew Saint Andrew Saint Andrew Parish Saint Andrew Parish Saint Ann Parish Saint Anne Sandy Point Saint Anthony Saint Catherine Parish Saint David Saint David Saint David Parish Saint Elizabeth Parish Saint George Saint George Saint George Saint George Saint George Basseterre Saint George City Saint George Gingerland Saint George Parish Saint George's Saint Georges Saint Helena Saint James Saint James Parish Saint James Windward Saint John Saint John Saint John Saint John Capesterre Saint John Figtree Saint John Parish Saint Joseph Saint Joseph Parish Saint Louis Saint Lucy Saint Luke Parish Saint Mark Saint Mark Parish Saint Mary Saint Mary Cayon Saint Mary Parish Saint Michael Saint Patrick Saint Patrick Saint Patrick Parish Saint Paul Saint Paul Capesterre Saint Paul Charlestown Saint Paul Parish Saint Peter Saint Peter Saint Peter Saint Peter Basseterre Saint Peter Parish Saint Philip Saint Philip Saint Pierre Saint Thomas Saint Thomas Lowland Saint Thomas Middle Island Saint Thomas Parish Saint-Élie Saint-Esprit Saint-Georges Saint-Joseph Saint-Laurent-Du-Maroni Saint-Louis Saint-Pierre Sainte-Anne Sainte-Luce Sainte-Marie Saitama Sakarya Sakassou Saki Saki Sakon Nakhon Sal Salah ad Din Salaj Salamanca Salamat Salavan Salcedo Saldus Rajons Salekhard Salerno Salima Salomon Islands Salt Cay Salta Salto Salyan Salzburg Samana Samangan Samar Samara Samarqand Samaxi Samdrup Jongkhar Samegrelo-Zemo Svaneti Samkir Samsun Samtse Samtskhe-Javakheti Samut Prakan Samut Sakhon Samut Songkhram Samux San Andres y Providencia San Blas San Cristobal San Fernando San Giljan San Gwann San Jose San Jose San Jose de Ocoa San Juan San Juan San Juan/Laventille San Lawrenz San Luis San Luis Potosi San Marcos San Martin San Miguel San Pawl il-Bahar San Pedro San Pedro de Macoris San Salvador San Salvador San Vicente San'a San-Pedro Sanaag Sanchez Ramirez Sancti Spiritus Sandaun Sandavágur Sandpits Area Sandur Sandy Sandys Sangha Sangha-Mbaere Sangre Grande Sanguie Sanliurfa Sanma Sanmatenga Sannat Sant Julià de Lòria Santa Ana Santa Barbara Santa Catarina Santa Catarina Santa Cruz Santa Cruz Santa Cruz Santa Cruz de Tenerife Santa Fe Santa Lucija Santa Rosa Santa Venera Santander Santarém Santiago Santiago de Cuba Santiago del Estero Santiago Rodriguez Santo Domingo Sao Domingos Sao Filipe Sao Nicolau São Paulo Sao Tome Sao Vicente Saône et Loire Sar-e Pol Sara Buri Saraj Sarajevo-Romanija or Sokolac Saramacca Sarande Sarangani Saransk Saratov Sarawak Sarpang Sarthe Sarur Saskatchewan Sassandra Sassari Satu-Mare Satun Satupa'itea Saül Savanes Savannakhet Savanne Savoie Savona Sawfajjin Schaan Schaffhausen Schellenberg Schleswig-Holstein Schwyz Schœlcher Scottish Borders Scrub Seal Segou Segovia Seguela Seine et Marne Seine Maritime Seine St-Denis Selangor Selenge Semaria Sembabule Semnan Seno Serbia Sergipe Serravalle Seti Setif Settat Setúbal Sevastopol Sevilla Sfax Sha Tin New Territories Shaanxi Shabeellaha Dhexe Shabeellaha Hoose Shabwah Shag Island Sham Shui Po Kowloon Shamal Bahr al Ghazal Shamal Darfur Shamal Kurdufan Shamal Sina' Shan State Shandong Shanghai Shanxi Sharon Sharq al Istiwa'iyah Shefa Shetland Islands Shida Kartli Shiga Shimane Shinyanga Shirak Shishelweni Shizuoka Shkoder Shropshire Shumen Shyghys Qazaqstan Siauliai Sibenik Sibiu Sichuan Sidi Sidi Bel Abbes Sidi Kacem Sidon Siemreap Siena Sigave Siggiewi Siguiri Siirt Sikasso Sikkim Siliana Silistra Sinaloa Sindh Sinfra Sing Buri Singida Sinnamary Sinnar Sinoe Sinop Sint Eustatius Sint Maarten Sint Nicolaas Sint Nicolas Sipaliwini Siparia Siquijor Siracusa Sirdaryo Sirnak Sironko Sisak-Moslavina Sisaket Sissili Sistan and Baluchistan Sivas Siyazan Sjûvar Kommuna Skálavík Skåne Skikda Skopun Skrapar Skúvoy Slaskie Slavonski Brod-Posavina Sliema Sligo Sliven Smith's Smolensk Smolyan Södermanland Sofala Sofia Sofia - town Sogn og Fjordane Sokoto Solola Solothurn Soltustik Qazaqstan Somali Sombrero Somerset Somme Somogy Sonderjylland Sondrio Songkhla Sonora Sonsonate Sool Sopište Sopron Soria Soriano Soroca Soroti Sorsogon Soubre Soufriere Souk Ahras Soul-t'ukpyolsi Soum Sourou Sousse South (Sud) South Abaco South Aegean South Andros South Australia South Ayrshire South Caicos South Carolina South Cotabato South Dakota South District South East South Eleuthera South Island South Khorasan South Lanarkshire South Yorkshire Southampton Southern Southern Southern Southern Southern Southern (Debub) Southern Highlands Southern Hong Kong Island Southern Leyte Southern Nations - Nationalities Southern Red Sea (Debub-Keih-Bah Southland Southwest (Sud-Ouest). Spanish Wells Split-Dalmatia Spot Bay Srednjebosanski Kanton St. Anthony Parish St. Gallen St. Lawrence Parish St. Lazarus Parish St. Petersburg Staffordshire Štajerska Stake Bay Stann Creek Star Dojran Stara Zagora Staro Nagoričane Stavropol StÃ¢nga Nistrului Steiermark Štip Stirling Stockholm Storstrom Středočeský Struga Strumica Studeničani Stung Treng Suceava Suchitepequez Sucre Sucre Sucumbíos Sud Sud Sud-Est Sud-Kivu Suffolk Sughd Suhaj Suhbaatar Sukhothai Sulawesi Selatan Sulawesi Tengah Sulawesi Tenggara Sulawesi Utara Sultan Kudarat Sulu Sumatera Barat Sumatera Selatan Sumatera Utara Sumba Sumqayit Sumy Sunda Kommuna Suourland Suournes Suphan Buri Surat Thani Surigao del Norte Surigao del Sur Surin Surrey Surt Surwarrow Surxondaryo Susa Susa Šuto Orizari Svalbard Svay Rieng Sveti Nikole Svínoy Swansea Swieqi Swietokrzyskie Syktyvkar Sylhet Syunik' Szabolcs-Szatmar-Bereg Szeged Szekesfehervar Szolnok Szombathely Sør-Trøndelag Sørvágur T'ai-nan T'ai-nan T'ai-pei city T'ai-pei county T'ai-tung T'ao-yuan Ta Xbiex Ta'izz Tabasco Tabiteuea Tabora Tabou Tabuaeran Tabuk Tachira Tacna Tacuarembo Tadjoura Taegu-gwangyoksi Taejon-gwangyoksi Tafea Tagant Tahoua Tai Po New Territories Taichung Taichung Tak Takamaka Takeo Takhar Takutea Talas Talsu Rajons Tamakautoga Tamana Tamanghasset Tamaulipas Tambacounda Tambov Tamil Nadu Tan-Tan Tanda Tandjile Tanga Tangier Tanintharyi Taounate Tapoa Taraba Tarabulus (Tripoli) Taranaki Taranto Tarapaca Tarawa Targovishte Tarhunah Tarija Tarlac Tarn Tarn et Garonne Taroudannt Tarrafal Tarragona Tartar Tartumaa (Tartu) Tartus Tarxien Tasmania Tata Tatabanya Tataouine Taurage Tavush Tawi-Tawi Taza Tbilisi Tearce Tebessa Tehran Tekirdag Tel Aviv (Gosh Dan) Telemark Teleorman Telimele Telsiai Temburong Temotu Tennessee Tepelene Teraina Teramo Terengganu Terni Ternopil' Territoire de Belfort Teruel Tete Tetouan Tetovo Texas Thaba-Tseka Thessaly Thies Thiladhunmathi Dhekunu Thiladhunmathi Uthuru Thimphu Three Brothers Thurgau Thüringen Thyolo Tianjin Tiaret Tiassale Ticino Tiebissou Tierra del Fuego Tighina Tigray Tillaberi Timis Tindouf Tingrela Tipaza Tipperary Tirane Tiris Zemmour Tirol Tissemsilt Tizi Ouzou Tiznit Tlaxcala Tlemcen Toamasina Tobago Tocantins Tochigi Togdheer Toi Tokat Tokushima Tokyo Toledo Toledo Toliara Tolima Tolna Tombali Region Tombouctou Tomsk Tongatapu Torba Torfaen Torino Tororo Toshkent City Toshkent Region Totonicapan Tottori Touba Tougue Toulepleu Toumodi Tov Tovuz Town Area Toyama Tozeur Trabzon Trang Trapani Trarza Trashigang Trashiyangste Trat Trebinje Treinta y Tres Trelawny Parish Trenciansky Trento Treviso Triesen Triesenberg Trieste Trinity Palmetto Point Tripoli Tripura Tristan da Cunha Trnavsky Troms Trongsa Tropoje Trujillo Tsingoni Tsirang Tsuen Wan New Territories Tuamasaga Tuapa Tubruq Tucuman Tuen Mun New Territories Tukuma Rajons Tula Tulcea Tumbes Tunapuna/Piarco Tunceli Tungurahua Tunis Tunu Tura Tûrshavnar Kommuna Tutong Tuy Tuzlanski Kanton Tver Tvøroyri Tyne and Wear Tyre Tyumen Uaboe Ubon Ratchathani Ucar Ucayali Udine Udon Thani Ufa Uige Ul'yanovsk Ulan-Ude Ulanbaatar Umm al Qaywayn Umm Sa'id Umm Salal Umutara Ungheni Unsko-Sanski Kanton Upper Demerara-Berbice Upper East Region Upper River Upper Takutu-Upper Essequibo Upper Town Upper West Region Uppsala Uri Usak Ust'-Ordynskiy Ústecký Usulutan Utah Utena Uthai Thani Utrecht Uttar Pradesh Uttaradit Uva Uvs Va'a-o-Fonoti Vacoas-Phoenix Vaduz Vágur Vaiea Vaisigano Vaitupu Vakaga Val d'Oise Val de Marne Valais Valandovo Valcea Vale of Glamorgan Valencia Valgamaa (Valga) Valkas Rajons Valladolid Valle Valle del Cauca Valletta Valmieras Rajons Valparaiso Valverde Van Var Varazdin Varese Vargas Värmland Varna Vas Vasilevo Vaslui Västerbotten Västernorrland Västmanland Västra Götaland Vaucluse Vaud Vaupes Vava'u Vavoua Vayots' Dzor Vejle Veles Veliko Tarnovo Vendée Venezia Ventspils Ventspils Rajons Veracruz-Llave Veraguas Verbania Vercelli Vermont Verona Vest-Agder Vestfiroir Vestfold Vestjælland Vestmanna Vesturland Veszprem Vev?ani Viana do Castelo Vianden Vibo Valentia Viborg Vicenza Vichada Victoria Victoria Vidin Vienne Vientiane Vientiane Vieux-Fort Vila Real Viljandimaa (Viljandi) Villa Clara Vilnius Vinica Vinnytsya Viqueque Virgin Islands Virginia Virovitica-Podravina Viseu Viterbo Vitsyebskaya (Vitsyebsk) Vizcaya Viðareiði Vlaams Brabant Vladikavkaz Vladimir Vladivostok Vlasenica Vlore Vojvodina Volgograd Vologda Volta Region Volyn' Vorarlberg Voronezh Vorumaa (Voru) Vosges Vrancea Vraneštica Vrap?ište Vratza Vukovar-Srijem Vyatka Vysočina Waikato Wairprarapa Wakayama Wake Island Wakiso Wallis Wan Chai Hong Kong Island Wangdue Phodrang Wanica Warab Wardak Warminsko-Mazurskie Warwick Warwickshire Washington Wasit Waterford Wayaca Wellington West (Ouest) West Azarbaijan West Bengal West Caicos West Coast West Dunbartonshire West End West Grand Bahama West Greece West Island West Lothian West Macedonia West Midlands West New Britain West Sussex West Virginia West Yorkshire West-Vlaanderen Western Western Western Western Western Western Western Western Australia Western Beqaa Western Cape Western Division Western Highlands Western Isles Western Loire Valley Western Region Westmeath Westmoreland Parish Wexford Wicklow Wielkopolskie Wien Wiltshire Wiltz Wisconsin Woleu-Ntem Wong Tai Sin Kowloon Woqooyi Galbeed Worcestershire Wrexham Wyoming Xacmaz Xagra Xaignabouli Xaisomboun Xankandi Xanlar Xekong Xewkija Xgajra Xiangkhoang Xinjiang Xizi Xocali Xocavand Xorazm Yafran Yagha Yakutsk Yala Yalova Yamagata Yamaguchi Yamanashi Yambol Yamoussoukro Yangon Yaracuy Yardimli Yaren Yaroslavl Yasothon Yatenga Yau Tsim Mong Kowloon Yazd Yekaterinburg Yerevan Yevlax Yobe Yomou Yonne Yoro Yoshkar-Ola Yozgat Ysyk-Kol Yucatan Yuen Long New Territories Yukon Territory Yumbe Yun-lin Yunnan Yvelines Zabbar Zabol Zacapa Zacatecas Zachodniopomorskie Zadar-Knin Zaghouan Zagreb Zahle Zaire Zajas Zakarpattya Zala Zalaegerszeg Zambales Zambezia Zamboanga del Norte Zamboanga del Sur Zamboanga Sibugay Zamfara Zamora Zamora Chinchipe Zangilan Zanjan Zanzibar Central/South Zanzibar North Zanzibar Urban/West Zapadnobosanska Zapadnohercegovacka Zupanija Zaporizhzhya Zaqatala Zaragoza Zardab Zebbug Zebbug Zeeland Zejtun Zelenikovo Želino Zenicko-Dobojski Kanton Zgharta Zhambyl Zhejiang Zhemgang Zhytomyr Ziguinchor Zilinsky Zinder Ziro Zlínský Zlitan Zomba Zondoma Zonguldak Zou Zoundweogo Zrnovci Zuenoula Zufar Zug Zuid Holland Zulia Zürich Zurrieq Østfold How did you hear about us? (Choose one)* I am an Existing Franchisee I am a SoR Parent Online Print Audio Referral Tradeshow/Live Event Where online? (Choose one)* SchoolofRock.com Franchise.org Online Ad Please choose one (Choose one)* College Magazine Franchising Magazine Guitar World Music Magazine Other Which audio platform? (Choose one)* SiriusXM Podcast Other How were you referred? (Choose one)* Referred by a Friend Parent of SOR Student Adult SOR Student School Owner Saw a School Employee Other What event? (Choose one)* NAMM IFE DC International Franchise Association I Attended a SOR Performance Progressive Motor Show I consent to being contacted by School of Rock and/or its franchisees with telemarketing calls/texts, irrespective of whether my number appears on federal or state “Do Not Call” lists. See our Privacy Policy . Submit SCHOOL OF ROCK CORE VALUES We are a growing, passionate community dedicated to enriching lives through performance-based music education. We develop music creativity and proficiency within a culture of belonging, collaboration and optimism, all the while maintaining the highest ideals of safety and integrity. Learn More SCHOOL OF ROCK OUTREACH Our commitment to enriching lives goes beyond the walls of our schools via partnerships with a variety of organizations around the world supporting music education, music artists and venues, and our neighborhoods. We're passionate about making a positive impact not only in the lives of our students but also in our communities. Learn More SCHOOL OF ROCK PARTNERSHIPS We have formed relationships with some of the top entertainment and music industry and gear brands in the world - leveraging each other's offerings to deliver a truly unique and rewarding experience to our students. Learn More School of Rock is a part of Youth Enrichment Brands (YEB), the nation’s leading youth activities platform, offering camps, leagues, classes, schools and other programs. YEB companies provide fun, enriching experiences to over 950,000 children each year around the world. Learn more Home Franchising Meet the School of Rock Team Franchising (877) 556-6184 International South Africa United Kingdom Brazil Japan Owning a franchise Starting a franchise Available opportunities Franchise Costs Next Steps Franchise FAQs Why School of Rock? About Leadership Team Careers for musicians + educators (877) 556-6184 Back to school of rock © 2025 School of Rock LLC.  All Rights Reserved. The U.S. Federal Trade Commission, certain states within the U.S.A., and certain other countries have laws governing the offer and sale of franchises. If you reside in a jurisdiction where one of these laws is in effect, we may have an obligation to register our franchise offering, to provide you with specified information, and/or to meet other conditions before offering you a franchise. We intend to fulfill the applicable requirements wherever we offer franchises. The information presented here is not intended as the offer of a franchise; if nevertheless deemed to constitute an offer, we do not intend it to be made in any jurisdiction where it would be improper. Within the U.S.A., we offer franchises solely by means of our Franchise Disclosure Document."
    },
    {
      "url": "https://bluesfest.net/en/contact.html",
      "text": "Contact | bluesfest.net Contact Home Archives Program 2025 ENG Program 2025 SVE News Shop Contact Member Home Archives Program 2025 ENG Program 2025 SVE News Shop Contact Member More More child CONTACT INFO ARTISTS BOOKING ÃMÃLS BLUESFEST 2025 IS NOW FULLY BOOKED! 2026 Bluesfest is open for applications from 2025-10-01. Interest artists/bands and booking agencies can send promotion materials containing bios, cd and photos (no return) to the address below. We get somewhere between 1500 and 2000 applications or suggestions each year. That makes it impossible for us to get back to all of you. But if we are interested weâll get back to you. E-mail: booking@bluesfest.net By post:  ÃmÃ¥l's Blues FÃ¶rening, Kyrkogatan 10, SE-662 31 ÃmÃ¥l, SWEDEN SALES Email: sales@bluesfest.net Marketvendor - inside the Blues Terminal. Cost for a market spot Fri-Sat 2000 SEK. Includes: One table (3.0 x 0.80) + entrence for 2 people of your sales staff. Foodvendor - sales during ÃmÃ¥ls Bluesfest inside the Bluesterminal, express interest to sales@bluesfest.net More info here>> SALES PRESS & MEDIA Email: media@bluesfest.net Application for press accreditation is open for applications from 2025-03-01 - 2025-06-25. The application will be answered latest 2025-06-30. For more information read: Accreditation(pdf) Press rules(pdf) For additional information, please contact Blues Office at +46 (0)532 713 98 or fill out the form below ADDRESS Blues Office, Kyrkogatan 10, 662 31 ÃmÃ¥l SWEDEN PHONE +46 (0)532 713 98 EMAIL info@bluesfest.net OPENING HOURS Monday - Thursday  09:00 am - 01:00 pm Name * Email * Phone Subject * Message * some-randome-random LOCATION MAP KONTAKTUPPGIFTER/ CONTACT INFORMATION Blues Office Kyrkogatan 10 662 31 ÃmÃ¥l Tele: 0532 713 98 Mail:   info@bluesfest.net ÃPPETTIDER/OFFICE HOURS MÃ¥n-tors kl. 9-13 Mon-thur 9 am-1 pm SITEMAP Line-Up Arkiv FAQ Kontakt Medlem Shop Copyright @ All Rights Reserved"
    },
    {
      "url": "https://soulbluesmusic.com/contactus.htm",
      "text": "Contact Us southern soul blues HOW TO ORDER? Click HERE Mailing Address: Blues Critic, LLC PO BOX 691 Geneva, OH 44041 (760) 710-7188 please email us at bluescritic@yahoo.com shopbluescritic@gmail.com Advertising? If you would like to advertise on our website email us at bluescritic@yahoo.com . Our rates are very reasonable \r\nand worth it. We can do email blasts to over 1,000 DJs, booking agents and \r\nimportant industry persons. NEED TO GET YOUR MUSIC TO THE RIGHT PEOPLE ? If you are an artist, record producer or a record label and have new music you \r\nwant to reach all the important DJs, booking agents and other industry bigwigs \r\nwe can help. Our rates for \"email blasts\" are available at very reasonable prices .\r\n\t\t\tAsk about our $75 Special All we would need is an MP3 of your song(s), a photo and contact info and we can \r\nget your music \"out there\" where it belongs. Email bluescritic@yahoo.com or call 760 710 7188"
    },
    {
      "url": "https://www.rutheckerdhall.com/support-membership/membership",
      "text": "Membership | Ruth Eckerd Hall Skip to content Accessibility Buy Tickets Search Donate Buy Tickets E-Club My Account Cart Events & Ticketing Events & Tickets View a complete list of all upcoming events! View Events Events Series and Packages Broadway Series Classic Albums Live Series Holiday Matinee Collection Seating Charts Group Sales Gift Certificates Program Book Just Announced Plan Your Visit Plan Your Visit The Ruth Eckerd Hall Experience is home to Clearwater's best venues. Plan your next visit today! More Info Ruth Eckerd Hall Directions & Parking Dining & Concessions A-Z Guide Preferred Restaurants & Hotels Venue History Pre-Show Dining The Nancy and David Bilheimer Capitol Theatre Directions & Parking Concessions Loge Boxes A-Z Guide Preferred Restaurants & Hotels Virtual Tour Venue History The Baycare Sound Directions and Parking Permitted And Prohibited Items A-Z Guide Concessions & Food Trucks Elevated Sound Package Preferred Restaurants and Hotels Venue History Murray Theatre at Ruth Eckerd Hall Directions & Parking A-Z Guide Preferred Restaurants & Hotels Venue History Preferred Restaurants & Hotels Ruth Eckerd Hall On The Road Education & Community Education & Community The Marcia P. Hoffman School of the Arts impacts more than 60,000 students annually of all ages, abilities, and circumstances. More Info Classes & Private Lessons Ruth Eckerd Hall Chorus Literature on-Line Video Series Schooltime Series Community Programs Scholarships & Tuition Assistance Support & Membership Support & Membership Learn how you change lives through the performing arts. Support Ruth Eckerd Hall's mission today. More Info Membership Make A Donation Planned Giving Corporate & Grantor Support Volunteer Member Login Instructions Venue Rental Plan your event with us. Save the date for and book and upcoming event in one of our beautiful, acoustically-perfect venues or dance studios. More Info The Margarete Heye Great Room Ruth Eckerd Hall Murray Theatre at Ruth Eckerd Hall The Nancy & David Bilheimer Capitol Theatre Technical Specs About Us Join our eClub Receive weekly show alerts, pre-sale notifications, special offers and more. Join Today Mission & Annual Report Connect Social Media Join Our E-Club Contests News & Blog Photo Galleries Leadership Administration Employment Contact Us Ticket Donations Donate Buy Tickets E-Club My Account Cart My Account Cart Search Close Home Support & Membership Membership Membership Why Join? As a Ruth Eckerd Hall member, you’ll directly support our mission to change lives through the performing arts. In recognition of your generosity, you’ll enjoy exclusive access to special perks throughout our venues all year long. Benefits Include Members-only pre-sale ticketing* Hassle-free ticket exchange and return privileges* Complimentary beverages** Members-only lounge access** And so much more! Explore the membership levels below to decide what level is the best fit for your household. For assistance call: 727-712-2716 or send us an email. Select a Donation or Renewal Level Performer ($100 annual donation; $100 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows Ticket return privileges (must be done at least seven (7) days prior to show) Fees waived for seat upgrade opportunities and ticket exchanges (must be done at least seven (7) days prior to show) * Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees *Some restrictions may apply. **Pre-sale ticket orders are prioritized according to annual donation and then cumulative giving. Some restrictions may apply. ^The Raymond James Central Ticket Office at Ruth Eckerd Hall is open Tuesday - Thursday & Saturday from 12pm - 6pm, Friday 10am - 6pm. The Ticket office is closed Sunday and Monday, unless there is a performance. The Ticket Office opens 2 hours prior to showtime. For assistance call: 727-791-7400 ^ or send us an email . Player ($200 annual donation; $200 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows Increased priority ticket purchasing during the pre-sale**, before the general public* Ticket return privileges (must be done at least seven (7) days prior to show) Fees waived for seat upgrade opportunities and ticket exchanges (must be done at least seven (7) days prior to show) * Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees Two (2) complimentary drink vouchers to use at any lobby bar for wine, beer, soda or water *Some restrictions may apply. **Pre-sale ticket orders are prioritized according to annual donation and then cumulative giving. Some restrictions may apply. ^The Raymond James Central Ticket Office at Ruth Eckerd Hall is open Tuesday - Thursday & Saturday from 12pm - 6pm, Friday 10am - 6pm. The Ticket office is closed Sunday and Monday, unless there is a performance. The Ticket Office opens 2 hours prior to showtime. For assistance call: 727-791-7400 ^ or send us an email . Trouper ($400 annual donation; $400 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows Increased priority ticket purchasing during the pre-sale**, before the general public* Ticket return privileges (must be done at least seven (7) days prior to show) Fees waived for seat upgrade opportunities and ticket exchanges (must be done at least seven (7) days prior to show) * Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees Four (4) complimentary drink vouchers to use at any lobby bar for wine, beer, soda or water *Some restrictions may apply. **Pre-sale ticket orders are prioritized according to annual donation and then cumulative giving. Some restrictions may apply. ^The Raymond James Central Ticket Office at Ruth Eckerd Hall is open Tuesday - Thursday & Saturday from 12pm - 6pm, Friday 10am - 6pm. The Ticket office is closed Sunday and Monday, unless there is a performance. The Ticket Office opens 2 hours prior to showtime. For assistance call: 727-791-7400 ^ or send us an email . Producer ($800 annual donation; $800 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows Increased priority ticket purchasing during the pre-sale**, before the general public* Ticket return privileges (must be done at least seven (7) days prior to show) Fees waived for seat upgrade opportunities and ticket exchanges (must be done at least seven (7) days prior to show) * Twelve (12) complimentary drink vouchers to use at any lobby bar for wine, beer, soda or water Complimentary one-time pass to the Hoffman Dress Circle Lounge at Ruth Eckerd Hall Complimentary one-time pass to the Ray & Geri Trautlein Dress Circle Lounge at the Capitol Theatre Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees *Some restrictions may apply. **Pre-sale ticket orders are prioritized according to annual donation and then cumulative giving. Some restrictions may apply. ^The Raymond James Central Ticket Office at Ruth Eckerd Hall is open Tuesday - Thursday & Saturday from 12pm - 6pm, Friday 10am - 6pm. The Ticket office is closed Sunday and Monday, unless there is a performance. The Ticket Office opens 2 hours prior to showtime. For assistance call: 727-791-7400 ^ or send us an email . Dress Circle ($2,000 annual donation; $2,000 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows Increased priority ticket purchasing during the pre-sale**, before the general public* Private phone line and e-mail for ticket purchasing Ticket return privileges (must be done at least seven (7) days prior to show) and waitlist opportunities for upgrades Fees waived for seat upgrade opportunities and ticket exchanges (must be done at least seven (7) days prior to show) * Access to Dress Circle Lounges at Ruth Eckerd Hall and the Capitol Theatre during Main Stage shows (includes complimentary beer, champagne, wine and light refreshments) Complimentary wine, beer, soda or water at any lobby bar Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees *Some restrictions may apply. **Pre-sale ticket orders prioritized according to annual donation and then cumulative giving. Some restrictions may apply. For assistance call: 727.712.2712 or send us an email . Silver Circle ($3,000 annual donation; $2,700 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows Increased priority ticket purchasing during the pre-sale**, before the general public* Private phone line and e-mail for ticket purchasing Ticket return privileges (must be done at least seven (7) days prior to show) and waitlist opportunities for upgrades Fees waived for ticket purchases, seat upgrade opportunities and returns/exchanges (must be done at least seven (7) days prior to show) Access to Dress Circle Lounges at Ruth Eckerd Hall and the Capitol Theatre during Main Stage shows (includes complimentary beer, champagne, wine and light refreshments) Complimentary wine, beer, soda or water at any lobby bar Invitation for TWO (2) to enjoy ONE (1) exclusive Friends of Music Membership Appreciation Concerts held within active annual membership Invitation to special member events such as“Cocktails with the Cast” for select Broadway shows 20% discount on meeting space rental at Ruth Eckerd Hall* Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees One (1) complimentary private lesson at the Marcia P. Hoffman School of the Arts *Some restrictions may apply. **Pre-sale ticket orders prioritized according to annual donation and then cumulative giving. Some restrictions may apply. For assistance call: 727.712.2712 or send us an email . Gold Circle ($6,000 annual donation; $4,800 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows Increased priority ticket purchasing during the pre-sale**, before the general public* Private phone line and e-mail for ticket purchasing Ticket return privileges (must be done at least seven (7) days prior to show) and waitlist opportunities for upgrades Fees waived for ticket purchases, seat upgrade opportunities and returns/exchanges (must be done at least seven (7) days prior to show) Access to Dress Circle Lounges at Ruth Eckerd Hall and the Bilheimer Capitol Theatre during Main Stage shows (includes complimentary beer, champagne, wine and light refreshments) Complimentary wine, beer, soda or water at any lobby bar Invitation for TWO (2) to enjoy ALL exclusive Friends of Music Membership Appreciation Concerts held within active annual membership Invitation to special member events such as “Cocktails with the Cast” for select Broadway shows 20% discount on meeting space rental at Ruth Eckerd Hall* Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees One (1) complimentary private lesson at the Marcia P. Hoffman School of the Arts *Some restrictions may apply. **Pre-sale ticket orders prioritized according to annual donation and then cumulative giving. Some restrictions may apply. For assistance call: 727.712.2712 or send us an email . Platinum Circle ($12,000 annual donation; $9,400 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows Increased priority ticket purchasing during the pre-sale**, before the general public* Private phone line and e-mail for ticket purchasing Ticket return privileges (must be done at least seven (7) days prior to show) and waitlist opportunities for upgrades Fees waived for ticket purchases, seat upgrade opportunities and returns/exchanges (must be done at least seven (7) days prior to show) Increased priority for access to artist opportunities like photo lines, signed posters, etc.* Access to Dress Circle Lounges at Ruth Eckerd Hall and the Bilheimer Capitol Theatre during Main Stage shows (includes complimentary beer, champagne, wine and light refreshments) Complimentary wine, beer, soda or water at any lobby bar Access to reserved parking for Ruth Eckerd Hall shows and free valet for TEN (10) Ruth Eckerd Hall or Bilheimer Capitol Theatre Main Stage shows Invitation for FOUR (4) to enjoy ALL exclusive Friends of Music Membership Appreciation Concerts held within active annual membership Invitation to special member events such as “Cocktails with the Cast” for select Broadway shows Recognition for being a Platinum Circle level member Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees 20% discount on meeting space rental at Ruth Eckerd Hall* One (1) complimentary private lesson at the Marcia P. Hoffman School of the Arts *Some restrictions may apply. **Pre-sale ticket orders prioritized according to annual donation and then cumulative giving. Some restrictions may apply. For assistance call: 727.712.2712 or send us an email . Founders Circle ($18,000 annual donation; $15,400 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Capitol Theatre shows Increased priority ticket purchasing during the pre-sale**, before the general public* Private phone line and e-mail for ticket purchasing Ticket return privileges (must be done at least seven (7) days prior to show) and waitlist opportunities for upgrades Fees waived for ticket purchases, seat upgrade opportunities and returns/exchanges (must be done at least seven (7) days prior to show) Increased priority for access to artist opportunities like photo lines, signed posters, etc.* Access to Dress Circle Lounges at Ruth Eckerd Hall and the Bilheimer Capitol Theatre during Main Stage shows (includes complimentary beer, champagne, wine and light refreshments) Complimentary wine, beer, soda or water at any lobby bar Access to reserved parking for Ruth Eckerd Hall shows and free valet for TEN (10) Ruth Eckerd Hall or Bilheimer Capitol Theatre Main Stage shows Invitation for FOUR (4) to enjoy ALL exclusive Friends of Music Membership Appreciation Concerts held within active annual membership Access to VIP artist experiences at Friends of Music Membership Appreciation Concerts (meet and greets, photograph opportunities and Q&A sessions) Reserved premium seating, when possible, at Friends of Music Membership Appreciation Concerts Invitation to special member events such as ”Cocktails with the Cast” for select Broadway shows Recognition for being a Founder Circle level member Invitation to exclusive events held throughout the year* Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees 20% discount on meeting space rental at Ruth Eckerd Hall* One (1) complimentary private lesson at the Marcia P. Hoffman School of the Arts *Some restrictions may apply. **Pre-sale ticket orders prioritized according to annual donation and then cumulative giving. Some restrictions may apply. For assistance call: 727.712.2712 or send us an email . Superstars ($24,000 annual donation; $20,000 tax-deductible) Members-only pre-sale ticket purchasing* for both Ruth Eckerd Hall and Bilheimer Capitol Theatre shows First priority to purchase tickets during the pre-sale**, before the general public* Private phone line and e-mail for ticket purchasing Ticket return privileges (must be done at least seven (7) days prior to show) and waitlist opportunities for upgrades Fees waived for ticket purchases, seat upgrade opportunities and returns/exchanges (must be done at least seven (7) days prior to show) Increased priority for access to artist opportunities like photo lines, signed posters, etc.* Access to Dress Circle Lounges at Ruth Eckerd Hall and the Bilheimer Capitol Theatre during Main Stage shows (includes complimentary champagne, wine, beer and light refreshments) Complimentary wine, beer, soda or water at any lobby bar Access to reserved parking for Ruth Eckerd Hall shows and free valet for ALL Ruth Eckerd Hall or Bilheimer Capitol Theatre Main Stage shows Invitation for FOUR (4) to enjoy ALL exclusive Friends of Music Membership Appreciation Concerts held within active annual membership Access to VIP artist experiences at Friends of Music Membership Appreciation Concerts (meet and greets, photograph opportunities and Q&A sessions*) Reserved premium seating, when possible, at Friends of Music Membership Appreciation Concerts Invitation to special member events such as “Cocktails with the Cast” for select Broadway shows Recognition for being a superstar level member Invitation to exclusive events held throughout the year* Early Enrollment for Marcia P. Hoffman School of the Arts programs and waived enrollment fees 20% discount on meeting space rental at Ruth Eckerd Hall* One (1) complimentary private lesson at the Marcia P. Hoffman School of the Arts Marquee recognition for two (2) weeks of the year*, thanking you for your support Private lunch on stage for six (6)* *Some restrictions may apply. **Pre-sale ticket orders prioritized according to annual donation and then cumulative giving. Some restrictions may apply. For assistance call: 727.712.2712 or send us an email . Support & Membership Frequently Asked Questions Thank you for your interest in supporting Ruth Eckerd Hall’s mission. Please find frequently asked questions regarding memberships and charitable contributions to the hall on our Support & Membership FAQs page. If your question is not answered here, please contact us at lbennett@rutheckerdhall.net . More Info *restrictions apply **depending on level of membership Top Thank You to Our Preferred Partners See All Ruth Eckerd Hall 1111 McMullen Booth Road Clearwater, FL 33759 Nancy & David Bilheimer Capitol Theatre 405 Cleveland Street Clearwater, FL 33755 The BayCare Sound 255 Drew Street Clearwater, FL 33755 Contact Us (727) 791-7400 (800) 875-8682 Events & Ticketing Events Series and Packages Seating Charts Group Sales Gift Certificates Program Book Just Announced Plan Your Visit Ruth Eckerd Hall The Nancy and David Bilheimer Capitol Theatre The Baycare Sound Murray Theatre at Ruth Eckerd Hall Preferred Restaurants & Hotels Ruth Eckerd Hall On The Road Education & Community Classes & Private Lessons Ruth Eckerd Hall Chorus Literature on-Line Video Series Schooltime Series Community Programs Scholarships & Tuition Assistance Support & Membership Membership Make A Donation Planned Giving Corporate & Grantor Support Volunteer Member Login Instructions Venue Rental The Margarete Heye Great Room Ruth Eckerd Hall Murray Theatre at Ruth Eckerd Hall The Nancy & David Bilheimer Capitol Theatre Technical Specs About Us Mission & Annual Report Connect Leadership Administration Employment Contact Us Ticket Donations Terms of Use Privacy Policy Site Map Accessibility COPYRIGHT © 2025 RUTH ECKERD HALL a carbon house experience"
    }
  ]
}