{
  "fuentes": [
    {
      "url": "https://www.wedding-spot.com/venue/9010/safari-wilderness/",
      "email": "indooroutdoor@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/9010/safari-wilderness/",
      "email": "valet@2x.png"
    },
    {
      "url": "https://www.wildernessencounters.co.tz/contacts/",
      "email": "info@wildernessencounters.co.tz"
    },
    {
      "url": "https://www.africawildlifesafaris.net/about/about-us/",
      "email": "info@africawildlifesafaris.net"
    },
    {
      "url": "https://holdensafaris.com/about-us/who-we-are/",
      "email": "info@holdensafaris.com"
    },
    {
      "url": "https://kabiza.com/about-us-kabiza-wilderness-safaris",
      "email": "kabizawilderrnesssafaris@kabiza.com"
    },
    {
      "url": "https://www.wildernessdestinations.com/journal/cultures-and-communities/keith-dave-explore-rwanda",
      "email": "u002f@we.are.wilderness"
    },
    {
      "url": "https://atrsafari.com/",
      "email": "info@atrsafari.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "adelie@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "alice@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "christine@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "discover@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "elaine@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "emily@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "francis@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "joanna@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "katy@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "lucinda@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "madeleine@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "maggie@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "patricia@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "richardp@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "robyn@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "sophie@aardvarksafaris.com"
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "email": "tansy@aardvarksafaris.com"
    },
    {
      "url": "https://www.safarivet.com/pet-care-with-a-difference/the-safari-team/",
      "email": "frontdesk@safarivet.com"
    },
    {
      "url": "https://www.safari.com/contact",
      "email": "helpmeplan@safari.com"
    },
    {
      "url": "https://www.safari.com/contact",
      "email": "shann.shaw@safari.com"
    },
    {
      "url": "https://www.wildernessdestinations.com",
      "email": "u002f@we.are.wilderness"
    },
    {
      "url": "https://laltoday.6amcity.com/safari-wilderness-ranch-lakeland-fl",
      "email": "jnagamoto@6amcity.com"
    },
    {
      "url": "https://wildlifesafari.net/",
      "email": "guestservices@wildlifesafari.net"
    },
    {
      "url": "https://www.wildernessdestinations.com/journal/our-collective/the-safari-dream-team-40-years-of-wilderness",
      "email": "u002f@we.are.wilderness"
    },
    {
      "url": "https://africa-safari.com/about-us/",
      "email": "bert@paradise-wilderness.com"
    },
    {
      "url": "https://africa-safari.com/about-us/",
      "email": "info@paradise-wilderness.com"
    },
    {
      "url": "https://www.wildernessdestinations.com/contact",
      "email": "enquiry@wildernessdestinations.com"
    },
    {
      "url": "https://www.wildernessdestinations.com/contact",
      "email": "media@wildernessdestinations.com"
    },
    {
      "url": "https://www.wildernessdestinations.com/contact",
      "email": "partnerships@wildernessdestinations.com"
    },
    {
      "url": "https://www.wildernessdestinations.com/contact",
      "email": "u002f@we.are.wilderness"
    },
    {
      "url": "https://www.wildernessdestinations.com/contact",
      "email": "u003eenquiry@wildernessdestinations.com"
    },
    {
      "url": "https://www.wildernessdestinations.com/contact",
      "email": "u003emedia@wildernessdestinations.com"
    },
    {
      "url": "https://www.wildernessdestinations.com/contact",
      "email": "u003epartnerships@wildernessdestinations.com"
    },
    {
      "url": "https://www.fox13news.com/news/safari-wilderness-is-piece-of-old-florida-that-offers-unique-adventures",
      "email": "fox13tampanews@foxtv.com"
    },
    {
      "url": "https://tz.linkedin.com/company/kiriwe-travel-trekking-safaris-ltd?trk=similar-pages",
      "email": "frank@steppedogsadventures.com"
    },
    {
      "url": "https://tz.linkedin.com/company/kiriwe-travel-trekking-safaris-ltd?trk=similar-pages",
      "email": "info@steppedogsadventures.com"
    },
    {
      "url": "https://www.wildernessdawning.com/contact/",
      "email": "craig@wildernessdawning.com"
    },
    {
      "url": "https://www.wildernessdawning.com/contact/",
      "email": "reservations@wildernessdawning.com"
    }
  ],
  "mails": [
    "adelie@aardvarksafaris.com",
    "alice@aardvarksafaris.com",
    "bert@paradise-wilderness.com",
    "christine@aardvarksafaris.com",
    "craig@wildernessdawning.com",
    "discover@aardvarksafaris.com",
    "elaine@aardvarksafaris.com",
    "emily@aardvarksafaris.com",
    "enquiry@wildernessdestinations.com",
    "fox13tampanews@foxtv.com",
    "francis@aardvarksafaris.com",
    "frank@steppedogsadventures.com",
    "frontdesk@safarivet.com",
    "guestservices@wildlifesafari.net",
    "helpmeplan@safari.com",
    "indooroutdoor@2x.png",
    "info@africawildlifesafaris.net",
    "info@atrsafari.com",
    "info@holdensafaris.com",
    "info@paradise-wilderness.com",
    "info@steppedogsadventures.com",
    "info@wildernessencounters.co.tz",
    "jnagamoto@6amcity.com",
    "joanna@aardvarksafaris.com",
    "kabizawilderrnesssafaris@kabiza.com",
    "katy@aardvarksafaris.com",
    "lucinda@aardvarksafaris.com",
    "madeleine@aardvarksafaris.com",
    "maggie@aardvarksafaris.com",
    "media@wildernessdestinations.com",
    "partnerships@wildernessdestinations.com",
    "patricia@aardvarksafaris.com",
    "reservations@wildernessdawning.com",
    "richardp@aardvarksafaris.com",
    "robyn@aardvarksafaris.com",
    "shann.shaw@safari.com",
    "sophie@aardvarksafaris.com",
    "tansy@aardvarksafaris.com",
    "u002f@we.are.wilderness",
    "u003eenquiry@wildernessdestinations.com",
    "u003emedia@wildernessdestinations.com",
    "u003epartnerships@wildernessdestinations.com",
    "valet@2x.png"
  ],
  "nombre_sitio": "safariwilderness.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.wedding-spot.com/venue/9010/safari-wilderness/",
      "text": "Safari Wilderness | Venue - Lakeland, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Provided by: Safari Wilderness Report Safari Wilderness 813-382-2120 CALL VENUE FAVORITE Venue highlights Indoor and outdoor spaces Valet parking Venue details Style: Rustic & Barn, Outdoor Guest capacity: Accommodates up to 300 guests Services: Ceremony / Reception Indoor / Outdoor VIEW OPTIONS Location: 10850 Moore Road Lakeland, FL 33809 Description: Safari Wilderness is an enchanted site located in Lakeland, Florida. This festive venue will transport you and your guests for a wedding experience unlike any other. Enjoy an outdoor ceremony tucked amongst the trees along the wooden boardwalk. Afterward you and your guests can head inside to the Safari Lodge. This rustic lodge has character that is simply charming. Large windows and a soaring ceiling create an expansive space for your wedding celebration. Guests will enjoy overlooking the animals throughout the evening from the lodge. A veranda will allow your party to flow from the inside out as guests enjoy cocktails and conversation. A wedding day at Safari Wilderness is an experience of adventure and relaxation. Rest easy, observe, and bask in the spotlight of your special day. READ MORE Additional details Service Options Venue notes The rental fee is $4,500 for a ceremony and reception and includes 5 hours of event time excluding set up and clean up time. The fee for a ceremony only wedding is $2,500. Additional hours can be arranged for a fee of $1,000/hr. A refundable security deposit of $350 is required. Amenities and Restrictions Amenities - Wedding planning services - Venue set up and clean up - Day-of coordinator - Kitchen for prep only - Large parking lot Restrictions - Venue must approve all decorations - General liability insurance required - Wheelchair access limited - Exclusive caterer for venue - Amplified music OK indoors only - No smoking - Alcohol must be served by licensed bartender/caterer - Music must end by 10:00PM - Biodegradable throwables only Amenities - Wedding planning services - Venue set up and clean up - Day-of coordinator - Kitchen for prep only - Large parking lot Restrictions - Venue must approve all decorations - General liability insurance required - Wheelchair access limited - Exclusive caterer for venue - Amplified music OK indoors only - No smoking - Alcohol must be served by licensed bartender/caterer - Music must end by 10:00PM - Biodegradable throwables only Links Safari Wilderness 813-382-2120 CALL VENUE FAVORITE Venue Highlights Indoor and outdoor spaces Valet parking STARTING AT $7,675 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor / Outdoor available Max Indoor capacity: 250 Max Outdoor capacity: 300 Reception Indoor / Outdoor available Max Indoor capacity: 250 Max Outdoor capacity: 300 STARTING AT $7,675 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://www.wildernessencounters.co.tz/contacts/",
      "text": "Contacts – Wilderness Encounters  Safaris Skip to content +255 763 816 829 info@wildernessencounters.co.tz Wilderness Encounters  Safaris Home Tanzania Safari Kilimanjaro Climbing Zanzibar About Us Design A Tour Contacts Facebook page opens in new window Instagram page opens in new window Search: Close Home About Us Tanzania Safari Kilimanjaro Climbing Zanzibar Beach Our Photos DESIGN A SAFARI Contacts Contacts Would like to talk? Contact Details If you have a story to share or a question that has not been answered on our website, please get in touch with us via contact details listed below or fill in the form on the right. Contacts +255 763 816 829 info@wildernessencounters.co.tz Find us on: Facebook page opens in new window Twitter page opens in new window Linkedin page opens in new window Instagram page opens in new window Have a question? Get in Touch Name Email Message Send We arrange Safaris to the National Parks, Game Reserves and Conservation Areas. arrange safaris to historical and cultural sites. WhatsApp No. +255 763 816 829 Email: info@wildernessencounters.co.tz Find us on: Facebook page opens in new window Instagram page opens in new window Quick Links Top 11 Tanzania Attractions Top Things To Do in Arusha 2024-2025 Safari Packing Gear List Things You Need to Know Before Climbing Kilimanjaro Great Wildebeest Migration 7 Tips for Going on Safari in East Africa OUR PHOTOS Tanzania Month By Month Event Tanzania Visa Application FAQs East African Safari FAQ Giving Back to the Community Terms and Conditions How to travel safely to Tanzania on COVID We Accept: All rights reserved 2022 © WILDERNESS ENCOUNTERS SAFARIS | Web by sechaPX Go to Top"
    },
    {
      "url": "https://www.africawildlifesafaris.net/about/about-us/",
      "text": "About us Skip to main content Info@africawildlifesafaris.net Hit enter to search or ESC to close Close Search Menu Destinations Popular Uganda Uganda, known as the “Pearl of Africa,” is a vibrant landlocked country in East Africa where lush landscapes, diverse wildlife, and rich cultures converge to create a unique and unforgettable destination. Rwanda Rwanda, often called the “Land of a Thousand Hills,” is a small yet strikingly scenic country in East Africa, renowned for its rolling green landscapes, clean cities, and transformative recovery story. North & Central East Africa Tanzania Kenya Ethiopia South Sudan Central Africa Congo Gabon North Africa Egypt Southern Africa Botswana Madagascar Malawi Mozambique Namibia South Africa Zambia Zimbabwe Safari Packages Uganda 12-Day Gorillas Chimps Wildlife Epic Uganda Safari 10 Day Uganda Wildlife and Primates Safari Tour 8-Day Mgahinga-Queen Elizabeth-Murchison Falls Big Five 7-Day Murchison Falls & Kidepo National Park Wildlife 4-Day Murchison Falls National Park & Budongo Tour 3 Day Bwindi Gorilla Trek and Lake Bunyonyi Tour 3 Day Murchison Falls National Park Safari 3 Day Queen Elizabeth National Park Safari Kenya 12-Day Honeymoon Uganda & Kenya Trip 11 Day Beach Holiday and Safari in Tanzania 7-Day Magical Kenya Luxury Safari 5-Day Murchison Falls & Kibale Chimpanzee Safari 4 Day Private Lodge Safari Tanzania 3-Day Masai Mara National Reserve Safari 3-Day Luxury Safari in Murchison Falls National Park 3-Day Murchison Falls, Chimp Trekking and African Big 5 Rwanda 8-Day Gorillas Murchison Falls and Kibale Chimp Trek 8-Day Serengeti Wildebeest Migration Safari Calving Tour 7-Day Garden Route & Addo National Park Safari Tour 5-Day Gorillas, Chimps, Wildlife, Overland Safari 4-Day Tarangire, Serengeti & Ngorongoro Lodge Safari Tour 4-Day Private Kruger Park Safari 3-Day Best of Murchison Falls and African Big 5 Safari 3-Day Gorilla Trekking & Batwa Experience Holiday Types Relax, Culture, Bucket Relaxation & Scenery Beach holidays Private lodging holidays Cultural & Immersive Cultural holidays Bucket List & Signature Bucket list holidays Special interest holidays Luxury holidays Nature & Adventure Adventure & Activity-Based Climbing & Hiking Holidays Adventure holidays Photography holidays Off the beaten holidays Nature & Wildlife Wildlife holidays Primate holidays Birdwatching holidays Wildebeest migration holidays Travel Style & Audience Solo holidays Family holidays Private holidays Honeymoon holidays Group holidays Sustainable Travel Responsible and Sustainable Travel Tips Eco-friendly accommodations Our sustainability efforts Your safety Get Inspired Where to go When to go Special offers Your first safari Travel guides About About us Why choose us Refer a friend Join our team Contact us Travel stories and blogs C O N T A C T U S About Us : WildHorn Africa — Your Gateway to Authentic African Adventures About Us, Discover Africa Like Never Before In the heart of Africa’s vast and diverse landscapes, where the call of the wild resonates through endless savannahs, shimmering deltas, and ancient deserts, WildHorn Africa stands as a beacon for travelers yearning for authentic, immersive, and transformative safari experiences. More than just a tour operator, WildHorn Africa is a dedicated partner in your journey to explore the continent’s most spectacular natural wonders, cultures, and wildlife. As the world’s premier African travel specialists, we blend expert knowledge, ethical tourism principles, and a passion for conservation to deliver safaris that are deeply enriching and uniquely personal. Our story is one of commitment to Africa’s heritage and future — a mission to connect people with the land, its creatures, and its people in ways that foster respect, awareness, and unforgettable memories. This article offers a comprehensive look at WildHorn Africa — who we are, what we stand for, the services we provide, and why we are trusted by discerning travelers worldwide. Join us as we explore the essence of WildHorn Africa and invite you to embark on a safari journey like no other. Our Origins: Born from Passion and Purpose WildHorn Africa was founded by a team of passionate African travel experts with decades of combined experience in tourism, conservation, and cultural preservation. Our founders recognized early on that travel can be a powerful force for good — when done responsibly, it can support local economies, protect fragile ecosystems, and celebrate indigenous cultures. From humble beginnings as a boutique safari company focused on Botswana , Namibia , and Zimbabwe , WildHorn Africa has grown into a continent-wide leader in bespoke African tours and safaris. Our growth has always been guided by the principles of authenticity, sustainability , and personalized service. Every WildHorn journey begins with these roots — a deep love for Africa and a firm belief that travel should leave a positive impact on both visitor and host. Our Mission: Transforming Travel into Meaningful Experiences At WildHorn Africa, our mission transcends booking holidays . We strive to transform travel into a catalyst for discovery, connection, and conservation . Our goal is to open doors to Africa’s hidden treasures — from remote game reserves and iconic national parks to vibrant communities and historic sites — while promoting ethical tourism practices that protect the continent’s natural and cultural heritage. We understand that every traveler is unique. Therefore, we design tailored itineraries that reflect individual interests, pace, and comfort levels. Whether you seek the thrill of a walking safari, the tranquility of a boat cruise on the Okavango Delta, or the cultural richness of village visits, WildHorn Africa crafts experiences that resonate deeply and authentically. Sustainability is central to our approach. We collaborate closely with local communities, conservation organizations, and eco-friendly lodges to ensure that your safari supports wildlife protection, habitat preservation, and economic empowerment. In doing so, we help maintain the delicate balance that makes Africa’s wild places so extraordinary. Our Expertise: Insider Knowledge and Unmatched Local Connections What truly sets WildHorn Africa apart is our intimate understanding of the African continent and our extensive network of trusted partners. Our team comprises guides, conservationists, and cultural experts who live and breathe the landscapes we showcase. This insider knowledge enables us to offer safaris that go beyond surface-level sightseeing to deliver genuine encounters and deep learning. Our relationships with lodges, camps, community projects, and conservation bodies across Southern and East Africa ensure access to exclusive experiences unavailable through mass tourism. From private game drives in untouched wilderness to intimate cultural exchanges in remote villages, our connections allow us to tailor journeys that are both luxurious and authentic. We also prioritize flexibility and responsiveness. Travel plans can change, and so can wildlife behavior. Our team stays closely attuned to real-time conditions to adapt your itinerary for maximum enjoyment and discovery, ensuring your safari is seamless and rewarding. Our Services: Crafting Journeys That Inspire WildHorn Africa offers a wide range of services designed to meet the diverse needs of safari travelers. From solo adventurers and honeymooners to families and corporate groups, we curate itineraries that maximize the impact and enjoyment of every trip. Our services include detailed itinerary planning, airport transfers, accommodation bookings at handpicked lodges and camps, expert guiding, and special activities such as walking safaris, night drives, mokoro excursions, and cultural immersions. We handle all logistics — from flights and visas to dietary preferences and special requests — so that travelers can focus entirely on the experience. We also offer thematic safaris tailored to specific interests, such as bird watching, photography, or wildlife tracking, led by specialists passionate about their fields. Our commitment to customization means your journey is crafted around what excites and inspires you most. Commitment to Sustainability: Protecting Africa for Generations to Come At WildHorn Africa, sustainability is not an afterthought — it is embedded in everything we do . We recognize that Africa’s natural beauty and cultural richness are fragile assets that require conscientious stewardship. We partner only with lodges and operators who adhere to strict environmental standards and who actively support conservation projects and community development. Our tours promote low-impact travel, encouraging responsible behavior and respect for wildlife and local traditions. Moreover, we invest in education and capacity building for communities living alongside wildlife areas, helping to ensure that tourism benefits those who protect these lands. By choosing WildHorn Africa, travelers contribute to a cycle of positive change that supports preservation, empowerment, and cultural celebration. Why Choose WildHorn Africa? Excellence, Integrity, and Heart Travel with WildHorn Africa is about more than just visiting Africa’s iconic destinations . It is about building connections — to the land, the wildlife, the cultures, and the people who make this continent extraordinary. Our clients return time and again because they experience safaris that are expertly planned, ethically responsible, and emotionally resonant. We combine professionalism with a personal touch. Every journey is guided by expert knowledge, meticulous attention to detail, and genuine care for our clients’ happiness and well-being. Whether it’s your first safari or your tenth, WildHorn Africa promises an experience that will stay with you long after you leave the continent. Embark on Your African Journey with WildHorn Africa Africa’s magic is vast and varied, waiting for you to explore its depths and mysteries. With WildHorn Africa as your trusted guide , your safari will be a journey of discovery, wonder, and connection — an opportunity to see the wild as it was meant to be seen. We invite you to book your Africa tours and safaris today with WildHorn Africa, where passion meets expertise, and every trip is crafted to be an unforgettable adventure. Join us in celebrating the spirit of Africa, supporting its future, and creating memories that will last a lifetime. our objectives Provide memorable and high-quality travel experiences for clients. Promote sustainable and responsible tourism that protects the environment and culture. Showcase unique destinations and attractions to both local and international travelers. Offer professional and reliable customer service before, during, and after tours. Support local communities by partnering with local guides, artisans, and businesses. Talk to an expert. Let’s craft you a memorable holiday. Reach out now 3-Day Masai Mara National Reserve Safari 3-Day Gorilla Trekking & Batwa Experience 4-Day Tarangire, Serengeti & Ngorongoro 5-Day Gorillas, Chimps, Wildlife, Overland Safari 7-Day Garden Route & Addo National Park Safari 8-Day Serengeti Wildebeest Migration Safari Calving Tour Rwenzori Hiking Climb Mount Kilimanjaro Zanzibar Beach Holiday WildHorn Africa – Authentic and unforgettable tours across Africa, guided by local experts who know the land, wildlife, and culture best. At WildHorn Africa, we specialize in creating unforgettable Africa wildlife safaris and holidays that are expertly planned and personalized to your needs. With our deep local expertise, tailor-made safari packages, and commitment to sustainable tourism , we ensure every journey is immersive, authentic, and worry-free. Popular Destinations Botswana Congo Egypt Ethiopia Gabon Kenya Madagascar Malawi Mozambique Namibia Rwanda South Africa South Sudan Tanzania Uganda Zambia Zimbabwe Useful Links Join Our Team Specials Offers Where To Go When To Visit Blogs and Stories Holiday Packages Responsible Travel TRENDING PACKAGES 3 Day gorilla trek 3 Day Masai mara 3 Day Murchison Falls 3 Day Volcanoes gorilla 3 Day Queen Elizabeth Get In Touch Email Us WhatsApp Us Call Us Medium Quora LinkedIn Instagram RECOMMENDED Uganda Safaris Beach holidays Birding holidays Luxury holidays Climbing & hiking holidays Cultural holidays With honest advice from skilled professionals and dedicated local guides, every itinerary is designed to exceed your expectations. Our team works only with top-rated suppliers to ensure consistent pricing, no hidden fees, and unforgettable journeys. We offer expertly crafted, personalized travel experiences built on trust, transparency, and local passion. © WildHorn Africa. All Rights Reserved. Close Menu Destinations Popular Uganda Uganda, known as the “Pearl of Africa,” is a vibrant landlocked country in East Africa where lush landscapes, diverse wildlife, and rich cultures converge to create a unique and unforgettable destination. Rwanda Rwanda, often called the “Land of a Thousand Hills,” is a small yet strikingly scenic country in East Africa, renowned for its rolling green landscapes, clean cities, and transformative recovery story. North & Central East Africa Tanzania Kenya Ethiopia South Sudan Central Africa Congo Gabon North Africa Egypt Southern Africa Botswana Madagascar Malawi Mozambique Namibia South Africa Zambia Zimbabwe Safari Packages Uganda 12-Day Gorillas Chimps Wildlife Epic Uganda Safari 10 Day Uganda Wildlife and Primates Safari Tour 8-Day Mgahinga-Queen Elizabeth-Murchison Falls Big Five 7-Day Murchison Falls & Kidepo National Park Wildlife 4-Day Murchison Falls National Park & Budongo Tour 3 Day Bwindi Gorilla Trek and Lake Bunyonyi Tour 3 Day Murchison Falls National Park Safari 3 Day Queen Elizabeth National Park Safari Kenya 12-Day Honeymoon Uganda & Kenya Trip 11 Day Beach Holiday and Safari in Tanzania 7-Day Magical Kenya Luxury Safari 5-Day Murchison Falls & Kibale Chimpanzee Safari 4 Day Private Lodge Safari Tanzania 3-Day Masai Mara National Reserve Safari 3-Day Luxury Safari in Murchison Falls National Park 3-Day Murchison Falls, Chimp Trekking and African Big 5 Rwanda 8-Day Gorillas Murchison Falls and Kibale Chimp Trek 8-Day Serengeti Wildebeest Migration Safari Calving Tour 7-Day Garden Route & Addo National Park Safari Tour 5-Day Gorillas, Chimps, Wildlife, Overland Safari 4-Day Tarangire, Serengeti & Ngorongoro Lodge Safari Tour 4-Day Private Kruger Park Safari 3-Day Best of Murchison Falls and African Big 5 Safari 3-Day Gorilla Trekking & Batwa Experience Holiday Types Relax, Culture, Bucket Relaxation & Scenery Beach holidays Private lodging holidays Cultural & Immersive Cultural holidays Bucket List & Signature Bucket list holidays Special interest holidays Luxury holidays Nature & Adventure Adventure & Activity-Based Climbing & Hiking Holidays Adventure holidays Photography holidays Off the beaten holidays Nature & Wildlife Wildlife holidays Primate holidays Birdwatching holidays Wildebeest migration holidays Travel Style & Audience Solo holidays Family holidays Private holidays Honeymoon holidays Group holidays Sustainable Travel Responsible and Sustainable Travel Tips Eco-friendly accommodations Our sustainability efforts Your safety Get Inspired Where to go When to go Special offers Your first safari Travel guides About About us Why choose us Refer a friend Join our team Contact us Travel stories and blogs CONTACT US Customize Reject All Accept All Powered by ✖ ... show more ► Necessary Cookies Standard Necessary cookies enable essential site features like secure log-ins and consent preference adjustments. They do not store personal data. None ► Functional Cookies Remark Functional cookies support features like content sharing on social media, collecting feedback, and enabling third-party tools. None ► Analytical Cookies Remark Analytical cookies track visitor interactions, providing insights on metrics like visitor count, bounce rate, and traffic sources. None ► Advertisement Cookies Remark Advertisement cookies deliver personalized ads based on your previous visits and analyze the effectiveness of ad campaigns. None ► Unclassified Cookies Remark Unclassified cookies are cookies that we are in the process of classifying, together with the providers of individual cookies. None Reject All Save My Preferences Accept All Powered by Go to mobile version"
    },
    {
      "url": "https://holdensafaris.com/about-us/who-we-are/",
      "text": "Who We Are - Holden Safaris Menu About Us Why Holden Safaris Who We Are Our Partners How To Get The Right Safari For You Map Destinations What is a Safari Kenya Tanzania Gorilla Trekking Zambia Zimbabwe Malawi Botswana Namibia South Africa Small Group Safaris Appointment with Wonky Tusk’s Family; A Safari to Zambia’s Elephants Women Travel With A Purpose: Safari to Kenya An Elephant In My Kitchen – Small Group Safari AN EXCLUSIVE WRITER’S RETREAT with Author Dale Griffiths Stamos Flying Foxes and Homecoming Elephants Wildlife Conservation Safari of Kenya Discovery & Adventure in Zimbabwe Sample Itineraries Photo Gallery Testimonials Blog Contact Us info@holdensafaris.com 877.422.1350 | Menu About Us Why Holden Safaris Who We Are Our Partners How To Get The Right Safari For You Map Destinations What is a Safari Kenya Tanzania Gorilla Trekking Zambia Zimbabwe Malawi Botswana Namibia South Africa Small Group Safaris Appointment with Wonky Tusk’s Family; A Safari to Zambia’s Elephants Women Travel With A Purpose: Safari to Kenya An Elephant In My Kitchen – Small Group Safari AN EXCLUSIVE WRITER’S RETREAT with Author Dale Griffiths Stamos Flying Foxes and Homecoming Elephants Wildlife Conservation Safari of Kenya Discovery & Adventure in Zimbabwe Sample Itineraries Photo Gallery Testimonials Blog Contact Us Who We Are Jim Holden on Safari Jim Holden, President Jim Holden here, aka Safari Jim. I started Holden Safaris to help you plan your perfect safari. If you’ve searched for a safari online, you’re probably overwhelmed with all the options. I’m here to help you figure out where and when to go, especially if this is your first time on Safari. So why me? Several reasons: Now I’m based in Newport Beach, California, so I’m local and my knowledge of Africa enables me to answer all your questions right on the spot. I listen to my clients and help them with their decision-making process based on when they plan to travel, what’s important to them, and of course, their budget. I can honestly say that passion for Africa is what motivates me to design the best Safari for you and take away all the difficult decisions, when you might not have the knowledge. I hope to hear from you when you’re thinking of a safari. You might be in for a lengthy call or visit, as I get enthusiastic about matching your expectations when planning your perfect safari. Jim Holden was born in Lusaka, Zambia, formerly known as Northern Rhodesia. Jim attended High School in Zimbabwe and studied economics at Natal University in South Africa. After graduation, Jim traveled the world, leading overland expeditions from London to Sydney via Kathmandu, London to Cape Town across the Sahara Desert, and a year in South America traveling between Rio de Janiero and Bogota. Bitten by the travel bug, Jim returned to Africa as Regional Managing Director for Abercrombie & Kent, an early pioneer of photographic safaris, based in Nairobi, Kenya. With children at University in America, Jim relocated to the USA to manage several leading tour companies, including Travcoa and African Travel. Jim now devotes his energy and passion for Africa to his own safari company, Holden Safaris, collaborating with his many safari contacts established over 30 years in the safari business. Sonia Marsh, Safari Tour Leader I’m Sonia Marsh, a tour leader with Holden Safaris. I lead small groups on Safaris with a Purpose. We are never more than 12 guests; the perfect size for learning, having time to interact with our professional guides, and making lasting connections. Our \"Safaris with a Purpose\" are all about Africa’s wildlife, culture, people, cuisines, and connecting with like-minded guests. If you love elephants, we have a special Safari in KwaZulu Natal, South Africa, where you’ll meet Lawrence Anthony, The Elephant Whisperer's family of elephants. We encourage you to read his book prior to joining us on this one-of-a-kind Safari. You’ll also meet Francoise Malby-Anthony , and the two young rhinos she rescued. Check out this Safari which we offer every year. How often do you get to experience elephants walking through reception? Meet Wonky Tusk and her family of elephants at Mfuwe lodge in Zambia. We repeat this small group Safari yearly in Zambia, where Jim Holden was born. From the moment you arrive at the airport, to the moment you return to the U.S., everything is taken care of, and you are \"hand-held\" by our local staff. I'll also be there to take care of you. Sonia Marsh was born in Denmark and is fluent in French and Danish. She lived in Nigeria as a child, and recently served in the Peace Corps in Lesotho, Southern Africa, where she taught English to orphans and vulnerable children. She believes she was born with the wanderlust gene and looks forward to meeting you and having you join her Safaris. Angela Miller, Marketing Consultant Hello there!  I’m Angela and I work closely with Jim, Sonia, and Vivienne to help spread the good news about safaris in Africa.  My connection with the travel trade extends back into the last century, initially working as a travel agent and then for many years with an international tour operator.  My first experience on safari was almost 20 years ago with my husband and two young daughters. It was undeniably life-changing for the girls and unforgettable for all of us.  I helped found Holden Safaris with Jim, who I had worked with previously.  Years later, Jim’s approach to creating personalized safaris has proven that travelers’ expectations are not only met but exceeded.  This makes their travel advisors happy too!  In addition to my faith in Jim’s knowledge, I have personally traveled to Southern and East Africa and met our partners there.  I feel confident letting travelers and travel advisors know that, with Holden Safaris, they can’t go wrong!  Seeing the end of journey responses from travelers and speaking with their travel advisors makes my job easy as I continue to promote these extraordinary experiences. Angela was born in the UK and travel has been in her blood from an early age.  Throughout her 35 + years in travel, she has held various positions in agencies and tour operators and has had her own travel marketing company for 15 years.  She has traveled to over 40 countries worldwide, and some of her most favorite places are in Africa where she has been on safari in Kenya, Tanzania, South Africa, Botswana, Namibia, Zimbabwe, and Zambia.  “No matter how many times you venture into the wild on game drives, the experience is always different and never disappoints,” says Angela.  She is extremely pleased to be able to contribute to Holden Safaris. Vivienne Holden, Holden Safaris South African Office Director Hello from Africa – Vivienne here. Working very closely with Safari Jim and our southern and east African partners, I prepare our client safari itineraries, researching the destinations, providing day to day schedules and making sure to include all the latest travel information our clients need before their travels. At times I accompany small client groups on safari as Tour Leader, and from arrival until departure, take care of our clients’ needs to ensure unforgettable experiences. Based in Durban South Africa, I am available 24/7 should our clients need assistance or to provide answers to any questions during their travels. I’ve lived my life in South Africa and Botswana, and have travelled throughout southern and east Africa.  I understand and respect the local people and their cultures and have a passion for our precious wildlife and its preservation.  A contributor to many conservation groups, I support the work of conservationists, wildlife veterinarians, rangers, and guides in their fight to preserve our wildlife for generations to come. I am so fortunate to live only a 3 hour drive away from wildlife national parks, and no matter how many times I visit these areas, there is nothing quite like the experience of being in the African bushveld - something I love to share with our American clients. Vivienne Holden was born in Johannesburg South Africa and currently resides in Durban South Africa. Vivienne completed high school in Durban and studied at the Vega advertising school in Johannesburg. After completion of her qualification, Vivienne worked in major advertising agencies as Client Service Manager – running the advertising campaigns for major international blue-chip clients. Reporting to the City Manager, Vivienne was the Event Manager for the City of Durban and was responsible for managing major international business, sporting and entertainment events which included preparing travel packages for participants/delegates and management. Vivienne has promoted the City of Durban and various southern African travel opportunities to many international cities, special committees such as the United Nations Climate Change Committee, and sporting federations including the Olympic Committee in Lausanne. For the past 5 years, Vivienne has worked with Jim Holden and our professional local operators in southern and east Africa as the Holden Safaris African Office Director, and is passionate about sharing the magic of Africa. Contact Phone 877.422.1350 Email info@holdensafaris.com Blog Updates to your Email Recent Blog Posts “Let me Take You on an Awesome Safari to Zambia, the Place where I Grew Up and still Call Home” March 7, 2025 “Morocco Set to Overtake Egypt as Africa’s Most Visited Country” March 7, 2025 Far from the Madding Crowd in Namibia February 19, 2024 Eight Days Traveling on the Surface of the Moon February 19, 2024 A JOURNEY BACK IN TIME April 11, 2023 Upcoming Safaris Upcoming Safaris Flying Foxes and Homecoming Elephants Wildlife Conservation Safari of Kenya Discovery & Adventure in Zimbabwe Contact Us Phone: 877.422.1350 Email: info@holdensafaris.com CST#2133270-40 Recent Blog Posts “Let me Take You on an Awesome Safari to Zambia, the Place where I Grew Up and still Call Home” March 7, 2025 “Morocco Set to Overtake Egypt as Africa’s Most Visited Country” March 7, 2025 Far from the Madding Crowd in Namibia February 19, 2024 Affiliates © 2017 Holden Safaris |  Website Customization by Cascade Valley Designs"
    },
    {
      "url": "https://kabiza.com/about-us-kabiza-wilderness-safaris",
      "text": "About Us - Kabiza Wilderness Safaris - Ugandan Safari Tour Operator Discover Uganda on a Value+ or Luxury Safari with Kabiza Wilderness Safaris Menu Home Our Safaris Luxury Safaris Midrange Safaris Expat Safaris Fly-In Safaris Wellness Safari Family Safaris Gorilla Safari-Teens Photo Safari Gorilla Habituation Safari Contact About Us  – Kabiza Wilderness Safaris – Ugandan Safari Tour Operator For over a decade, there has been only one Focus, “Creating Memorable Safaris.” About us – Kabiza Wilderness Safaris – where the outcome of a Safari is more critical than the Income About Us – Kabiza Wilderness Safaris – Ugandan Safari Tour Operator: Since 2008, Kabiza Wilderness Safaris has been a cornerstone of premier safari experiences in Uganda, often referred to as the Pearl of Africa. We specialize in meticulously crafted luxury and mid-range safaris tailored to your unique dreams and budget. Our passion lies in showcasing Uganda’s unparalleled wonders, including intimate encounters with majestic mountain gorillas and chimpanzees, thrilling wildlife safaris in iconic national parks, immersive cultural experiences, and vibrant bird-watching opportunities. Every personalized itinerary is carefully designed by our expert local team, ensuring authentic and transformative journeys. We are deeply committed to responsible tourism. Kabiza actively supports conservation initiatives and partners with local communities to promote sustainability and preserve Uganda’s heritage. This ethical foundation is integral to our identity. Our exclusive “Hakuna Matata” (no worries) philosophy guarantees a seamless adventure. We handle every detail—from permits and transportation to exquisite accommodations—delivering a truly stress-free experience. Whether you’re honeymooners, families, adventurers, or photographers, we foster deep connections through enriching experiences. Book your safari today, and let us make your dream journey a reality! Our mission remains: Creating Memorable, Hakuna Matata-NoWorries Safaris. About Us: We Are Uganda, Your Gateway to Its Soul Uganda isn’t just our destination; it’s our home. At Kabiza Wilderness Safaris, we don’t just operate here – we truly belong to the Pearl of Africa. This deep connection fuels every safari we create. We know the hidden trails where mountain gorillas roam in Bwindi’s lush rainforests. We feel the mist from the thundering Murchison Falls on our skin. We understand the rhythms of Queen Elizabeth’s savannahs and the vibrant heartbeat of local cultures. This is our land, our passion, and our story to share with you. As fully licensed operators (UTB/TT/82445) and proud AUTO members, our deep roots provide unparalleled access. Only licensed operators like us can secure your gorilla and chimpanzee permits, ensuring guaranteed and priority access through our direct partnership with the Uganda Wildlife Authority. Forget impersonal tours; we craft intimate journeys rooted in decades of local expertise, revealing both iconic wonders and secrets known only to those who call Uganda home. Choose authenticity. Choose access. Choose impact. We go beyond sightseeing to inspire awe and promote stewardship. With our “Hakuna Matata” commitment, we manage every detail sustainably, ensuring your adventure uplifts local communities and protects this irreplaceable heritage. Experience Uganda not as a tourist, but as an honored guest welcomed home. Are you ready to explore the path only true insiders know? Let’s craft your unforgettable Ugandan journey today. Explore our safaris or contact us now! About us -Kabiza Wilderness Safaris-Our Network Kabiza Wilderness does not operate as a lone ranger tour operator; we belong to a reliable network that is the backbone of Tourism in Uganda. We are a Member of AUTO, the Association of Uganda Tour Operators. Countless tour operators operate in Uganda, and many work outside of AUTO. We are Licensed by the Uganda Tourist Board and the Ministry of Tourism, which means we are periodically evaluated to determine whether we meet and exceed the required Tourism Standards. We partner with the Uganda Wildlife Authority in promoting and selling Gorilla Permits, which gives us priority access to permits that non-AUTO members do not have. We partner with AeroLink Safari Airline for our Fly-In Safaris. We partner with select quality midrange and luxury Lodges and Hotels and give you the best price possible. Terms Payments Covid-19 Flexible Booking Price Guarantee T ravel Insurance Advice About us -Kabiza Wilderness Safaris – the Management Team Jon Blanc  – Director – Marketing On Blanc – A Lifelong Journey from Germany to the Heart of Africa Jon Blanc, originally from Germany, developed a passion for African exploration as a boy, inspired by Karl May’s adventure stories. Now residing in Blaine, Washington, USA, his life is characterized by a rich tapestry of global experiences paired with a strong commitment to Africa. Jon’s travels throughout countries such as France, England, Rwanda, and Kenya have enriched his appreciation for diverse cultures and the exploration of them. He has also built an extensive personal library focused on African themes. Since 1992, he has been actively engaged in humanitarian efforts in East Africa, particularly following the Rwandan genocide. His research prominently covers Uganda’s politics, history, culture, and notable biodiversity, offering valuable insights into the region’s complexities. Professionally, Jon has a varied background that includes sales, marketing, and hospitality, where he was instrumental in introducing American-style customer service to enhance guest experiences. He is also an avid hiker and conservationist, committed to studying and promoting Uganda’s unique natural heritage. In 2002, Jon founded Kabiza.com, initially dedicated to African culture and travel, which evolved into a safari platform by 2008. The name “Kabiza,” a Swahili term meaning “complete,” encapsulates Jon’s mission to provide immersive experiences that highlight Uganda’s hospitable communities, diverse wildlife, primates, and breathtaking landscapes. Geoffrey Mugambwa – Director | Safari Implementation Geoffrey Mugambwa – Partner and Safari Expert at Kabiza Wilderness Safaris Geoffrey Mugambwa is a partner at Kabiza Wilderness Safaris, bringing over 20 years of extensive experience in the safari industry. Born and raised in Uganda, he has an intimate understanding of the region’s landscapes, wildlife, and cultural nuances, which allows him to anticipate and meet the diverse needs of clients from around the world. As the lead architect behind Kabiza’s safari itineraries, Geoffrey expertly designs personalized journeys that turn travel plans into unforgettable adventures. His deep knowledge of Uganda and Rwanda encompasses every detail—from national parks and reserves to the conditions of both paved and unpaved roads, ensuring seamless and enriching safari experiences. Geoffrey’s expertise goes beyond itinerary planning; he plays a crucial role in mentoring and guiding driver-guides, which significantly contributes to the company’s reputation for excellence. A passionate advocate for conservation, Geoffrey is dedicated to protecting Africa’s unique wildlife and primates. For him, safaris are more than just a profession; they are a lifelong passion. Outside of work, he enjoys spending time with his family and is an enthusiastic follower of the British Premier Lea About – Us – Kabiza Wilderness Safaris About – Us – Kabiza Wilderness Safaris – Choose us for your Safari Kabiza Wilderness Safaris has been a leading travel operator in Uganda since 2008, specializing in crafting unforgettable journeys through the country’s stunning wilderness areas. As a fully accredited operator, recognized by the Uganda Tourism Board, and a proud member of AUTO, they offer ethical and well-organized adventures. This includes arranging gorilla permits through the Uganda Wildlife Authority and designing safaris that adhere to national standards. Their “Hakuna Matata” philosophy emphasizes comprehensive planning, allowing travelers to focus on experiencing the beauty of Uganda without added stress. Whether opting for luxury lodges that feature personalized service or more economical mid-range accommodations, guests can expect consistently high standards of quality. The company provides expert driver-guides who combine Ugandan hospitality with professional service, ensuring private tours that uncover lesser-known cultural treasures and exhilarating wildlife encounters. Additionally, travelers can benefit from flexible booking options and a no-risk guarantee, making Kabiza Wilderness Safaris a highly trusted resource for crafting the perfect safari experience in Uganda. Ready to Experience the Pearl of Africa? Don’t just dream of gorilla treks, lion-filled savannahs, and vibrant cultures—live them! Book your worry-free Uganda safari today at Kabiza Wilderness Safaris.com or contact our team to start planning. Your adventure of a lifetime awaits! Use Contact form below. About Us – Kabiza Wilderness Safaris – UgandanTour Operator Contact – Kabiza Wilderness Safaris in Uganda Plot 472 Nsambya – Millenium House – Suite 131 PO Box 36902 Kampala – Uganda Kabiza Wilderness Safaris Contact Phone Number Uganda ++256 772 978292 Our Contact Email: Kabiza WildernessSafaris . Contact us via WhatsApp Message +256 776722806 USA  – Canada – call us at 360-322-4893 – Phone rings in Uganda Use the contact form below: Please use the form Below to contact us: Go back Your message has been sent Name (required) Warning Email (required) Warning The Country you are Writing From: (required) Warning Number of Participants-Minimum Age-15: Warning Number of Days: (required) Warning Beginning Date for Your Safari (YYYY-MM-DD) (required) Warning Ending Date for your Safari: (YYYY-MM-DD) (required) Warning Nidrange or Luxury Safari Warning Your Request in Detail: Warning Warning. Submit Δ Contact Kabiza Wilderness Safaris in Uganda – Thank you for contacting us, and we will get back to you promptly. We respect your Privacy – this information is only used to create a Safari for you. We do not add you to a mailing or newsletter list or pass your information to other organization s. Contact us Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Related Pages: Consider using Kabiza Wilderness as your Tour Operator in Uganda Choose Kabiza Wilderness Safaris for an Unforgettable Uganda Safari As... Book your 2025 Safari Tour in Uganda with Kabiza Wilderness Safaris It is Time to Book your safari tour in Uganda... Kabiza Wilderness Safaris Reviews-What our Customers said about their Safari What our customers say about their Safari with us Read... Why choose an AUTO-Association of Uganda Tour Operator for your Safari Reasons Why choose an AUTO-Association of Uganda Tour Operator for... Finding the Best Tour Operator for your Safari in Uganda How do I find the Best Tour Operators in Uganda... Sort by Relevance Newest first Oldest first Things to do-See in Uganda Fly into Rwanda - Trek Gorillas in Uganda Gorilla Habituaation Experience Murchison Falls Park Safaris Kidepo Valley Park Safaris Spend a While on the Nile Safaris Mgahinga Gorilla Park Safaris The guide covers all Safari Destinations in Uganda Uganda Safety-Security Guide Kabiza Wilderness Safaris Explore Uganda and discover the Pearl of Africa with Kabiza Wilderness Safaris, your trusted partner in safari adventures! With over 15 years of experience since 2008, we have provided personalized luxury and mid-range safaris, tailored to suit your preferences and budget. Choose us for your gorilla, chimpanzee, and wildlife safari adventure. We are licensed by the Uganda Tourism Board (License UTB/TT/82445) and an accredited Association of Uganda Tour Operators member, ensuring a worry-free safari. Read more about us: Plan-Book your Safari in 2025 Discover Uganda, the Pearl of Africa, in 2025 with Kabiza Wilderness Safaris! With our easy booking process, planning and booking your Safari with us in 2025 is a breeze. Our expert team handles all planning, logistics, accommodations, and activities, including Gorilla—Chimpanzee Permits, allowing you to fully enjoy the incredible wildlife and primate encounters without any stress or hassle. Trust us for a relaxing and hassle-free adventure that creates lasting memories. Book your unforgettable Safari today! Book now Useful Links About us-Kabiza Wilderness Safaris Terms of Service Safari Payment Price Guarantee Flexible Booking Policy Privacy Policy Safari Reviews by our Clients Travel Insurance Uganda Travel Tips and Ad Current Uganda Travel Advisories Why you need a Safari Tour Operator Fly into Rwanda and Trek Gorillas in Uganda Contact Client Support Page Get ready for a one-of-a-kind safari adventure in Uganda, a destination like no other. We offer the essential resources to ensure your safari is a resounding success. Our comprehensive support empowers you to take charge of your journey. We provide vital visa information, detailed health and safety guidelines, and precise packing checklists to ensure you're fully prepared. With us, you can make the most of your adventure! Head for our Client Support Page. Copyright © 2025   Kabiza Wilderness Safaris Kabiza Wilderness Safaris-Hakuna Matata-Worry Free  Safaris in the Pearl of Africa-Uganda You cannot copy content of this page Javascript not detected. Javascript required for this site to function. Please enable it in your browser settings and refresh this page."
    },
    {
      "url": "https://www.wildernessdestinations.com/journal/cultures-and-communities/keith-dave-explore-rwanda",
      "text": "Wilderness Safaris Rwanda | Keith & Dave Explore Rwanda You need to enable JavaScript to run this app. Menu Enquire Now Destinations Camps Regions Experiences Journeys Exclusive offers Impact Journal About Wilderness Botswana Kenya Namibia Rwanda South Africa Tanzania Types of Safari Zambia Zimbabwe Botswana Kenya Namibia Rwanda South Africa Tanzania Zambia Zimbabwe Popular Camps Wilderness Bisate Lodge Volcanoes, Rwanda Wilderness Mombo Okavango Delta, Botswana Little Kulala Sossusvlei, Namibia Usawa Serengeti Serengeti, Tanzania DumaTau Camp Linyanti, Botswana Linkwasha Hwange, Zimbabwe Jao Okavango Delta, Botswana Bisate Lodge Mombo Camp Little Kulala Usawa Camp DumaTau Camp Linkwasha Camp Jao Camp Botswana Linyanti Mababe Okavango Delta Kenya Masai Mara Namibia Damaraland Kunene Sossusvlei Rwanda Akagera Volcanoes South Africa Cape Peninsula Culture & food The Cape Winelands Tanzania Serengeti Zambia Kafue Mosi-oa-Tunya Zimbabwe Hwange Mana Pools Safari Gorilla Trekking Game Drives Guided Quad Biking Rhino Tracking Helicopter Safari Star Beds Night Game Drives Boat Safari Wellness Guided Walking Safaris Nature Walks Desert E-biking Culture & Impact Local Culture Conservation Experience Journey inspiration Tailor-made Journeys Family Journeys Group Journeys Solo Journeys Couples Journeys Journey planning Our Services About Wilderness Our awards Our story Our partnerships The Wilderness Family Press room Enquire Destinations Camps Regions Experiences Journeys Exclusive offers Impact Journal About Wilderness Search Magashi Keith & Dave Explore Rwanda Cultures & Communities Joe Hanly 10/29/2021 Home Journal Keith & Dave Explore Rwanda COVID-19 took hold in March 2020, forcing the world to shut down and retreat into lockdown. So, it was with a great sense of happiness and relief that Wilderness Rwanda hosted CEO Keith Vincent, and COO Dave Bennett recently. For Dave, locked down in Mauritius, it was the first time he was able to reconnect with the staff and experience the African bush in the twenty months since the pandemic began. The Magashi team welcomed them into camp, proudly showing them the beauty of the camp and the concession. While their stay at Magashi was short, they were treated to wonderful game drives and boating safaris with one of Rwanda’s first FGASA-qualified guides, Alphonse. Along the lake shore, with Magashi’s renowned sunset cocktails, it was good to reconnect with old friends and new. After some meetings in Kigali, Bisate was also a brief stop to visit the team and experience the trails, the nursery, the greenhouse and, of course, to see the new Bisate Kwanda day lounge, before joining the Bisate guests for drinks and dinner. While Keith hosted a CNBC TV crew the following morning, Ironman Dave set off to climb Bisoke, which he managed in record time! While both Dave and Keith were so impressed with the camps, service and food, for both of them, the best part was to say hello again to our staff and people. “To me that was the ultimate highlight”, noted Keith. “Not to mention that the Bisate Kwanda was mind-blowing cool too!” Reconnecting with the Rwandan team was a re-energising and a rejuvenating experience, and hopefully marks the return of regular visits and catch-ups across the regions. In Dave’s words, “Even during these very difficult times the compassion, empathy, and energy of our teams on the ground is truly inspiring. Delivering staggering service and magic moments in extreme conditions was a personal highlight, and it’s difficult to portray how very grateful and thankful I am for our wonderful People of Wilderness – you are the glue that holds this business together!” Left to right; top to bottom: Jimmy Nsengimana, agronomist; Joseph Nsengiyumva, chef; Aimable Rukundo Ramadhan, barman-waiter; Dave Bennett, COO; Keith Vincent, CEO; Ingrid Baas, Operations Manager; Rob Baas, MD; Johnson Hakizimana, trainee chef More to discover Embark on another journey through Earth's ultimate, untamed places. These stories capture the raw beauty, passionate conservation efforts, and unique experiences that define Wilderness. We've handpicked these articles to deepen your connection with the wild and inspire your next adventure. Read them here 01 / 05 Ngamo: Story of an African farm It’s a cold and misty morning at Wilderness Davison’s, a remote safari camp in Zimbabwe’s renowned H... Read more Andy Wassung 20.06.2025 Selma Benyameni: Stories of Change From growing up in Namibia to joining Wilderness Rwanda in 2024, Selma Benyameni has had an incredib... Read more Wilderness Blogger 24.03.2025 Children in the Wilderness’ profound annual camps A first-person account of experiencing a Children in the Wilderness (CITW) annual camp and an in-dep... Read more Tao Varty 28.01.2025 CITW & Ingcungcu join forces for impact CITW, through Wilderness Touring, supports two schools that have implemented this amazing project th... Read more Craig Glatthaar 06.01.2025 Wilderness Rwanda & CITW facilitate separate bathroom for girls at Rwabiharamba Secondary School We are very grateful for our donors’ support. Without their contribution we would not be able to mak... Read more Ingrid Baas 23.10.2024 Let’s plan your next journey Ready? When we say we’re there every step of the way, we mean it, literally. From planning the perfect circuit, to private inter-camp transfers on Wilderness Air, and easing you through Customs. We’re with you on the ground, at your side, 24-7, from start to finish. Ready to take the road less travelled? Contact our Travel Designers to plan an unforgettable journey. Enquire now Need some inspiration? Be inspired by the latest news from Wilderness. Subscribe to our newsletter. First name Surname Email Address Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahrain Bahamas Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Côte d'Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Country of residence Submit About Wilderness About Impact Awards Contact Careers The Wilderness Family Journal Destinations Botswana Namibia Rwanda Zambia Zimbabwe Tanzania Kenya Journeys & Services Our Journeys Journey Inspiration Our Services Wilderness Store African Safaris Honeymoon Safari Luxury safaris in Botswana Disclaimer Privacy Policy Sitemap LLM usage guidelines Copyright ©2025 Wilderness. All rights reserved."
    },
    {
      "url": "https://atrsafari.com/",
      "text": "ATR - The World’s Leading Tailor-made Safari Company USA 888-487-5418 UK 01306 880770 EUR +44 1306 880770 +61 800 821 832 +44 1306 880770 [email protected] Search Loading... No results found Close menu USD USD GBP EUR USD GBP EUR Back What to do When to travel Where to go About us Explore Get in touch The world’s leading tailor-made safari company Helping you to find a more authentic, more exciting and better value safari Next section Home Safari is so much more than looking at animals safari is a more intense , authentic and positive way to travel If you haven’t yet been on a proper safari, then you’re in for a real treat. At its best, a safari can be a genuinely deep and life punctuating event. But organising a great safari is not straightforward, it needs to be done with care, precision and expertise. That’s where we come in. If wildlife is your primary focus, the key will be the quality and the tonality of each encounter. There is a world of difference between an intimate one-to-one encounter with a lion and being parked in an ugly circle of vehicles. We can and will deliver that difference. A great safari is a sequence of magical moments, many of which are only peripherally related to the main event. Even on a conventional savanna safari, the wildlife is perhaps only a quarter of the total experience. As we help you plan your safari, we consider the flow of every single day, to facilitate the spontaneous emergence of these moments. We do this by carefully blending a wide range of quality ingredients, such as wonderful landscapes, carefully considered lodges, unusual activities, passionate people and impromptu encounters. This considered way of travel, this attitude, isn’t only applicable to wildlife experiences. We can create safaris to the historic sites of Egypt, self-drive explorations through the deserts of Namibia or cultural adventures in Rajasthan and Bhutan. We can even bring our safari approach to bear on trips to Antarctica. safari is the primary driver of conservation in wilderness areas ATR is the world’s leading tailor-made safari company. We don’t say that lightly. It took us many years to reach the point where we felt comfortable using such a brash and sweeping statement. But we believe it to be true. And it’s great motivation. We have to live up to that standard every single day, every single trip. Our intimate team has an incredible amount of first hand experience, knowledge and expertise. We’ve lived and worked in the wilderness, we’ve built and managed camps, we’ve guided safaris, we’ve driven overland trucks, we’ve negotiated with local tribespeople, we’ve worked on cutting-edge conservation projects. Our Safari Experts, the people who will actually help you to build your trip, have been doing exactly that task for an average of 12 years each. There is no substitute for that level of experience. We will help you find a more authentic, more exciting and better value safari. And we’ll all have fun doing it. your safari should be a genuinely life-punctuating experience Extraordinary tailor-made adventures, from earthy and edgy to easy and extravagant From around USD 2500 per person, you set the ceiling Trip types Choose the type of trip that interests you most Savanna safaris This is what most people have in mind when they first think of safari Predator safaris Hardcore interaction with some of the planet’s most dangerous animals Elephant safari Trips for people who are obsessed with our big grey friends Primate safaris Getting up close and personal with gorillas, chimps and our other close relatives Honeymoon safaris Inherently romantic trips, packed with adventure and optionally sprinkled with luxury Family safaris Important landmark trips for families with kids of all ages, carefully crafted to delight everyone Historical safaris Fascinating and adventurous journeys through ancient and mysterious landscapes Snow leopard safaris Head to the Himalayas in search of this Incredibly elusive cat Luxury safaris More relaxing trips that include the finest and most dependable hotels, lodges and camps View more All trip types Primary Savanna safari Popular Family safari Honeymoon safari Luxury safari Specialist Conservation safari Cultural safari Epic safaris Historical safaris Overland expeditions Self-drive safari Walking safari Specific Chimpanzees Elephants Gorillas Jaguars Lions Migrations Predators Primates Pumas Rhinos Snow Leopards Tigers Wild-dogs Get started on your trip It’s never too soon to get in touch, we are here to help with every stage of your planning. Get in touch Sample Trips Here are some of our popular trip shapes JAN-DEC 17 nights USD 7500/10000/20000 USD 7500 Sample trip Kruger safari and Cape This trip is centred on a safari in the renowned Kruger area of South Africa, followed by an extended self-drive exploration of the Cape. JAN-DEC 14 nights USD 9200/15750/19000 USD 9200 Sample trip Botswana & Cape This trip is centred on a safari in the fabulous Okavango Delta area of Botswana, followed by a self-drive exploration of the Cape. JAN-DEC 17 nights USD 7500/10000/20000 USD 7500 Sample trip Kruger safari and Cape This trip is centred on a safari in the renowned Kruger area of South Africa, followed by an extended self-drive exploration of the Cape. JAN-DEC 14 nights USD 9200/15750/19000 USD 9200 Sample trip Botswana & Cape This trip is centred on a safari in the fabulous Okavango Delta area of Botswana, followed by a self-drive exploration of the Cape. JAN-DEC 14 nights USD 2550/4350/7350 USD 2550 Sample trip Self-drive Cape & safari This trip is an extensive self-drive exploration of the Western Cape, continuing on to the modest safari areas of the Eastern Cape. JAN-DEC 7 nights USD 5700/9400/15450 USD 5700 Sample trip Serengeti safari This short trip iincludes a savanna safari in Serengeti, followed by an overland exploration of Ngorongoro, a great blend of wildlife, landscape and culture. JAN-DEC 14 nights USD 9400/15900/27250 USD 9400 Sample trip Serengeti, Tarangire & Zanzibar This trip includes an extended savanna safari through Serengeti, Ngorongoro and Tarangire, followed by time on the tropical beaches of Zanzibar. JAN-DEC 7 nights USD 7200/11350/20750 USD 7200 Sample trip Maasai Mara safari This short trip to Kenya is focused on a good length safari in prime areas of the Maasai Mara. JAN-DEC 10 nights USD 12350/19300/36100 USD 12350 Sample trip Kenya safari & gorillas This trip combines the prime mountain gorilla area of Rwanda and a two-camp savanna safari in prime areas of the Maasai Mara in Kenya. JAN-DEC 10 nights USD 9250/11150/23500 USD 9250 Sample trip Gorillas, QE & chimps This trip starts with the prime mountain gorilla area of Bwindi Forest, before exploring the savanna safari and chimpanzee areas further north. JAN-DEC 14 nights USD 4350/7850/13200 USD 4350 Sample trip Self-drive Namibia This trip is a clockwise self-drive exploration of Namibia, including Sossusvlei (giant dunes), Swakopmund, Twyfelfontein, Etosha (wildlife) and Otji. JAN-DEC 21 nights USD 9350/11100/22600 USD 9350 Sample trip Cape, Kruger & Mozambique This trip starts with a self-drive exploration of the Cape, followed by a savanna safari in Kruger, finishing with the tropical beaches of the Bazaruto area of Mozambique. JAN-DEC 28 nights USD 19300/21550/30800 USD 19300 Sample trip Madagascar, Kruger & Cape This trip combines lemur safari in Madagascar, with savanna safari in the Kruger, followed by a self-drive exploration of the Cape. JAN-DEC 28 nights USD 15400/23500/41550 USD 15400 Sample trip Serengeti, Zanzibar, Kruger Vic Falls & Cape This epic trip comprises a safari in Serengeti, tropical beaches in Zanzibar, further safari in Kruger, Victoria Falls and a self-drive exploration of the Cape. View more Explore all trips Let’s chat! It’s amazing how much progress we can make with a short chat on the phone. Book a call About us Different safari companies deliver extraordinarily different safari experiences. If you are looking for authenticity, adventure and value, then we should hopefully be a good fit. Original innovators The first safari company on the internet, we helped to shape the modern safari and we continue to be the prime innovators in our field. Expertise and experience Our Safari Experts have incredible first-hand knowledge and an average of 12 years experience building great tips. A proud history Since 1999, we have created over a million sample  trips and helped over 120,000 guests fall in love with  safari Africa. Seamless and fun Over the years we have polished our operation to be super-reliable. Arranging your trip should be almost as much fun as going on safari. Delivering value Your trip should cost no more than if you had booked all the components directly. You effectively get our services for free. Supremely tailor-made Every single trip that we build is unique. Your trip will be precisely tailored to meet the exact requirements of everyone in your group. What our guests say 4.9 Google reviews “ATR are experts in their field and I wouldn’t trust anyone else.” Tara Stewart “We’ve used many different travel organizers and agents, but one truly stands like a giraffe, head and shoulders above all others .” Linda Goddard “ATR are honest in their appraisal of individual lodges, you can trust their judgement” Graeme Gales “The trip was our best yet . The entire thing was completely seamless.” Todd Hunter More about us Who you choose to work with will be the biggest single decision that defines the quality of your trip. Here’s a few little articles to help you get to know us a little better. Why choose us Why we do it How it works Our story Meet the team Our partners We work closely with and are recommended by all of the key lodge owners around the world. Where Next? Where Next? We offer trips to dozens of fabulous countries. Might one of these might be your next great adventure? We offer trips to dozens of fabulous countries. Might one of these might be your next great adventure? Antarctica Antarctica Antarctic Peninsula Queen Maud Land South Georgia Argentina Argentina Iguazu Sur Los Glaciares Peninsula Valdes Salta Bhutan Bhutan Bumthang Punakha Bolivia Bolivia Salar de Uyuni Botswana Botswana Linyanti Makgadikgadi Okavango Brazil Brazil Manaus Amazon Pantanal Rio de Janeiro Iguazu Sur Central African Republic Central African Republic Chad Chad Chile Chile Atacama Easter Island Torres del Paine Congo Congo Ecuador Ecuador Yasuni Amazon Egypt Egypt Aswan Cairo Luxor Ethiopia Ethiopia Lalibela Southern Omo Valley Galapagos Galapagos India India Agra Bandhavgarh Jaipur Jodhpur Kanha Kaziranga Ladakh Ranthambore Udaipur Kenya Kenya Amboseli Chyulu Hills Maasai Mara Samburu Madagascar Madagascar Andasibe Ankarana Masoala Nosy Be Malawi Malawi Liwonde Maldives Maldives Mozambique Mozambique Bazaruto Namibia Namibia Damaraland North Namibrand Skeleton Coast North Sossusvlei Nepal Nepal Annapurna Chitwan Everest Mustang Rwanda Rwanda Virunga Mountains Sao Tome and Principe Sao Tome and Principe Peru Peru Cusco Iquitos Amazon Machu Picchu Tambopata Amazon South Africa South Africa Cape Town Cape Winelands Kruger Tswalu Sri Lanka Sri Lanka Wilpattu Yala Sudan Sudan Seychelles Seychelles Tanzania Tanzania Mount Kilimanjaro Ngorongoro Ruaha Serengeti Selous Zanzibar Uganda Uganda Bwindi Forest Kibale Forest Murchison Falls Zambia Zambia Kafue Lower Zambezi South Luangwa Zimbabwe Zimbabwe Hwange Mana Pools Victoria Falls Town Africa Americas Antarctica Asia Get started on your trip It’s never too soon to get in touch, we are here to help with every stage of your planning. Start pl annin g ATR Safari © 2025 Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage Consent By using this website, you agree to our use of cookies. We use cookies to provide you with a great experience and to help our website run effectively. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Manage consent Please rotate your screen."
    },
    {
      "url": "https://aardvarksafaris.com/about/meet-the-team/",
      "text": "Meet the team of safari experts at Aardvark Safaris Home Destinations Botswana Congo Ethiopia Kenya Madagascar Malawi Maldives Mauritius Mozambique Namibia Rwanda Sao Tome and Principe The Seychelles South Africa Tanzania Uganda Zambia Zanzibar Zimbabwe Experiences Family Safaris Luxury Safaris Wildebeest Migration Primate Safaris Riding Safaris Kilimanjaro Climbs Cycling Safari Mobile Safaris Beach Holidays Exclusively yours Canoe and Mokoro Safaris Hosted Trips Weddings & Honeymoons Specialist Photographic Safaris Walking Safaris Small Group Travel Single Travellers Self Drive Adventures Planning Planning a Safari When to Travel Aardvark Safaris Brochure Safari Pricing Accommodation A Day on Safari Safari Tipping Guide The Insider’s Guide About Us Why Aardvark? The Aardvark Story Meet the team Feedback we loved Responsible Tourism Booking Conditions Aardvark Guarantee Events Careers Blog Contact Us discover@aardvarksafaris.com 01980 849160 01980 849160 Home Destinations + Botswana Congo Ethiopia Kenya Madagascar Malawi Maldives Mauritius Mozambique Namibia Rwanda Sao Tome and Principe The Seychelles South Africa Tanzania Uganda Zambia Zanzibar Zimbabwe Experiences + Family Safaris Luxury Safaris Wildebeest Migration Primate Safaris Riding Safaris Kilimanjaro Climbs Cycling Safari Mobile Safaris Beach Holidays Exclusively yours Canoe and Mokoro Safaris Hosted Trips Weddings & Honeymoons Specialist Photographic Safaris Walking Safaris Small Group Travel Single Travellers Self Drive Adventures Planning + Planning a Safari When to Travel Aardvark Safaris Brochure Safari Pricing Accommodation A Day on Safari Safari Tipping Guide The Insider’s Guide About Us + Why Aardvark? The Aardvark Story Meet the team Feedback we loved Responsible Tourism Booking Conditions Aardvark Guarantee Events Careers Blog Contact Us discover@aardvarksafaris.com 01980 849160 Meet the team Alice Gully Managing Director & Owner Alice Gully, the owner of Aardvark Safaris, has been involved in African travel since 1995. Her interest in all things African started with a zoology degree at Newcastle where her entomology tutor inspired with stories of exotic creatures that could only be found in Africa. Alice, the owner of Aardvark Safaris, has been involved in African travel since 1995. Her interest in all things African started with a zoology degree at Newcastle where her entomology tutor inspired with stories of exotic creatures that could only be found in Africa. When a second degree in vet science did not go according to plan, she fulfilled a dream by working in Zambia.  First, she helped set up a safari camp on Lake Kariba and undertook a small study on a family of seven elephants that shared her island. Next was a stint skippering catamarans on the Zimbabwean side of the lake where sailing along the wildlife filled shores of Matsuadona National Park still inspires wonderful memories. Her last job was living the dream as a back-up guide for a riding safari in Hwange, Zimbabwe, which she describes as one of those few jobs where you forget it’s work, and where managing 28 horses and showing guests the wonders of Africa from horseback was pure joy.  She decided on her future career as an African tour operator before her return and now says that anything is possible in Africa if you know how. Mother to three daughters, Alice is a hands-on owner based in the Scottish office. Alice and her children are keen hill walkers and love the outdoors, and on their African travels they are happiest on foot, in a canoe, or on horseback. She is also an experienced diver and counts the peaceful reefs of Mozambique as some of the best in the world. Her triplets got a taste of Africa at the age of two on a camel safari in Kenya with some time at the coast – never too young!  They are now teenagers and have been to Malawi, Kenya, South Africa, Tanzania and Zanzibar and The Seychelles, Malawi being the highlight. In her many years organising holidays, Alice has travelled extensively through Africa, exploring some of the more off the beaten track safari areas as well as the better known.  Kenya remains an old favourite and she has returned eight times, unable to resist the draw of all that’s on offer here.  With children she’s also come to appreciate the value of R&R holidays in beach destinations like Mauritius and the Seychelles.  Of the countries Aardvark Safaris sells, it’s only Madagascar Alice has yet to explore, but it’s only a matter of time. Favourite African experience Too many to pick one, each time I travel something takes my breath away, the people, the endless scenery, the incredible wildlife. For pure wow factor, riding horses through the migration in the Masai Mara or flying in a private plane along the Skeleton Coast of Namibia. Favourite African animal Other than giraffe (which I’d most like to come back as) it’s the little stuff like the insects and birds that enthral me. If you sit still in Africa, life is busy all around you, no matter where you are. Under the sea, in the ground or high in the trees, there is never a dull moment. Favourite three camps I love the small owner run camps where you feel as though you are staying with a friend. The host is your guide and looks after you in every way, they care how you feel and what you do. Some of these camps (and owners) include include Luwi Camp, Karisia Walking safaris, Ants Nest and Kaya Mawa. Kerry Glen at Karisia in Kenya, Camel safari, Kenya, Laikipia, Karisia Walking Safaris and Ant and Tessa Baber at Ant’s Nest in South Africa but there is a long list, not just three! Luxury safari accommodation Waterberg, South Africa, Ant’s Nest , Ant’s Collection Luwi Camp in the South Luangwa, Zambia is my desert island camp if there was only one last African trip. Hippos on a walking safari, South Luangwa, Zambia, Luwi Bushcamp Kaya Mawa’s cottages have incredible views over Lake Malawi African countries visited South Africa, Kenya, Botswana, Zimbabwe, Zambia, Malawi, Tanzania, Mozambique, Namibia, Republic of Congo, Rwanda and Uganda Tropical islands visited The Seychelles, Mauritius, Zanzibar Riding experience Wait A Little , Winelands, Tswalu , Ants Hill / Nest , Kurland , Grootbos , Horizon Horseback Safaris , African Horseback Safaris, Tuli Ride , Namibia Horse Safari Company. Offbeat Riding Safaris , Safaris Unlimited , Borana Lodge , Ol Malo , Sosian Lodge, Ol Donyo , Okavango Horse Safaris The most memorable experience on a riding safari was taking seven new guests on their first riding safari to the Okavango Delta and we met two leopards who came straight up to the horses and stopped a couple of metres away.  The week continued with phenomenal wildlife sightings, we rode with wild dog several times and let hyenas move between the horses to get to a buffalo killed by lions earlier.  The Okavango Delta is fantastic riding country and with some of the best wildlife Africa has to offer.  Two other thrilling moments have to include cantering with the zebra and wildebeest migration in the Masai Mara, Kenya and galloping flat out across the desert of Namibia, a huge buzz. On arranging holidays I pride myself on the fact that no two holidays I plan are the same. I enjoy really listening to what people want, before going to the drawing board to sketch out ideas. I believe in top end customer service, so no wedding anniversary goes unnoticed or dietary requirement is missed, and I will spend hours thinking about what could improve everybody’s experience – I want everyone to come home with the same warm fuzzy feeling about Africa that I have. As an experienced rider, I know what makes the difference between a good riding safari and an unforgettable one and will do my best to match riders to the most suitable horses and will always try to look after the non-riding spouse (I have one) as well as learner riders (like my three girls). As a mother I know the pitfalls of travelling with children and will do my utmost to choose the best camps and lodges to create a perfect family holiday – I’m proud to say my repeat and word of mouth business speaks for itself. +44 (0) 131 297 6229 alice@aardvarksafaris.com Richard Preston Chief Operating Officer After qualifying  as a Chartered Certified Accountant, Richard moved into industry and held a  number of finance positions over a nine year stretch with Coca-Cola in London. After qualifying as a Chartered Certified Accountant, Richard moved into industry and held a number of finance positions over a nine year stretch with Coca-Cola in London. Nine years hard work warranted an 18 month career break which took him on travels to Central America, Malaysia, Thailand, Borneo, China, Burma, Australia and Fiji. He worked for O2 in Slough on returning before deciding to look for a fresh challenge in a smaller, friendlier but equally dynamic working environment. He arrived at Aardvark in December 2012 and, as Chief Operating Officer, is responsible to the board for accurate financial reporting and forecasting as well as providing support and supervision to the sales teams to ensure efficient operations. When not working, Richard enjoys the gym and keeping fit during respites from the demands of a young family. +44 (0) 1980 849160 richardp@aardvarksafaris.com Katy Duncan Head of Marketing Travel enthusiast, hilarious dancer and expert multi-tasker. Katy comes with a wealth of marketing knowledge and expertise having worked in travel for almost 20 years'. Travel enthusiast, hilarious dancer and expert multi-tasker. Katy comes with a wealth of marketing knowledge and expertise having worked in travel for almost 20 years. She studied Marketing in Edinburgh before joining The Travel Corporation’s family of multi-award winning coach tour operators. Having spent time on multiple brands operating throughout Europe and with global sales offices, Katy worked her way from an initial student placement as part of her studies to sales and marketing manager. Customer service focused, she has a “people first” attitude, a value that is at the heart of Aardvark Safaris. Her drive and passion for travel has also led to her being a founding member of the Edinburgh Chapter of the global ‘Travel Massive’ network which at its peak had over 600 members. This highly engaged community holds regular networking events for tourism professionals, travel media, influencers and start ups. Since her university days Katy has spent most of her spare time travelling. She has bamboo rafted and dived in Thailand, worked on the ski fields in New Zealand, fished for piranhas and hunted for anacondas in South America. She honeymooned in Mauritius and enjoyed a four night safari in the Klaserie Private Nature Reserve in South Africa. One of her most memorable experiences was watching a day old elephant calf take its first steps. When she is feeling slightly less adventurous, Katy enjoys baking and chilled weekends exploring her local bird reserve with her husband and daughter Isla. Favourite African experiences Walking with a hibituated troop of baboons at Shompole Wilderness camp in Kenya.  We woke early, just as dawn was breaking as our guide Sisco took us on a fascinating walk following a troop of around 80 Olive baboons. We watched them play about in the trees, and learnt about their social behaviours. It was quite special observing these often overlooked primates in their natural habit. Witnessing my daughter being utterly captivated by our guide and tracker while on her first safari in the Great Karoo, South Africa. She eagerly absorbed their knowledge about tracks and animal droppings. It was here on a night drive that we spotted the elusive Aardvark – a real highlight of our holiday and something I feel truly blessed to have experienced. Favourite African animal I love elephants, their intelligence and emotial depth is quite remarkable. You can’t help but have the up most respect for these giant complex animals.  I have recently found a new love and appreciation for the many differnt species of antelope like the heartebeast, waterbuck, eland and oryx.  Their grace, speed and endurance and the imporant role they play in maintianing biodiversity and health of the landscapes they inhabit is quite astonishing. African countries visited South Africa, Egypt, Kenya Tropical Islands visited Mauritius +44 (0)131 297 6229 katy@aardvarksafaris.com Jo Ainscough Sales Director Jo joined Aardvark’s Scottish office in September 2006, fresh from two ski seasons, and as a farmer’s daughter felt instantly at home with the chickens, ducks, sheep, dogs and horses that frequent Aardvark Scotland! Animals and skiing aside, Jo’s passions include cooking, travelling, hiking and horse riding. Jo joined Aardvark’s Scottish office in September 2006, fresh from two ski seasons. Jo’s passions include cooking, travelling, hiking and horse riding. She was a chalet manager in the Alps for two winter seasons, while the summers took her to the north of Scotland to cook for large house parties.  As a child, Jo was fully immersed in the Fife Hunt pony club, and also spent some time working with top eventers and racehorses. She also has a true love for animals, having grown up as a farmer’s daughter. She put her cooking skills to good use on a two month sabbatical in Uganda and Rwanda where she was tasked with improving the food and sourcing new ingredients in some of the top lodges. A highlight of her time here was tracking mountain gorillas on three occasions – Jo is therefore an excellent person to talk to about holidays here as she can give you her own honest and unbiased advice. In the intervening years Jo has travelled widely throughout Africa and the Indian Ocean and is now a senior sales consultant at Aardvark Safaris.  She has two young daughters and can’t wait to introduce them to the wonders of Africa when they are a little older. Favourite African experiences Sleeping in a hide on the Boteti River in Botswana. There were elephant splashing around in the river and two prides of lion roaring to each other from opposite banks. I didn’t sleep a wink, but it was one of the most thrilling nights of my life! Making it to the summit of Kilimanjaro. Having that sense of satisfaction, whilst seeing the sun rise up through the clouds below, has to be one of the most magical things I’ve ever experienced. Watching a pod of 50 dolphins swim in to try and help a seal who was being attacked by a sea lion, off a cliff on Robberg Island near Plettenberg Bay in South Africa. Sleeping out under the stars of the great Namibian sky for 10 nights on the most fantastic riding safari. Despite sub-zero temperatures outside, our rollmats and feather duvets (with hot water bottles) kept us more than toasty! Waking up at 3am to see shooting stars overhead will be something that stays with me for a long time. Chimpanzee trekking in Mahale, Tanzania. About half an hour into the trek we stumbled across Christmas, the naughty male teenager chimpanzee. Our guides were telling us all about him and how they loved how he played up to the guests. As if on cue, Christmas appeared and mock charged our guide, gave him a little slap and then ran off. We followed Christmas for about 10 minutes before fidning ourselves in the middle of a hunt. The chimps were chasing the colobus monkeys – we could see them running above us in the canopy of the trees. We tracked them twice, and each experience was completely different to the time before, and equally as amazing. Favourite African animal Giraffe – I have always wondered what it’s like to be tall……they’re the complete opposite of me; tall, graceful and quiet. Three favourite camps Tsarabanjina off the north west coast of Madagascar, for its truly remote location, sugary white sand, warm translucent water, and amazingly romantic and private bandas. Tsarabanjina Schoeman Skeleton Coast Safaris’ Kunene Camp in northern Namibia. It’s on the border with Angola and is totally unique, simple and beautiful. Kunene Camp Sand Rivers in Tanzania’s Nyerere National Park (formerly Selous Game Reserve) for its exclusivity, wonderful river location and the sound of hippos from any part of the lodge. Sand Rivers African countries visited Botswana, Kenya, Malawi, Mozambique, Namibia, Uganda, Rwanda, South Africa, Tanzania, Zambia, Zimbabwe Tropical Islands visited Madagascar, Mauritius, Zanzibar Riding experience Wait A Little , Tuli Ride , African Horseback Safaris, Horizon Horseback Safaris , Ants Hill / Nest , Borana Lodge , Lewa Wilderness Safaris Unlimited , Sosian Lodge, Namibia Horse Safari Company. I think the stand out for me would be swimming through the crystal clear waters of the Okavango Delta, watching mating lion on horse back at Wait A Little, sleeping under the stars for 10 nights on the trot in Namibia and building up such a strong connection with my pony Rupert – the sense of satisfaction at reaching the Skeleton Coast at the end was incredibly emotional. And finally riding right up to a giraffe at Lewa Wilderness – so close I could see it’s beautiful long eyelashes. On arranging holidays There’s nothing better than speaking to guests who have just returned from a fantastic holiday.  It gives me such a buzz. There’s plenty of room for error when planning these trips so it’s essential to get everything absolutely right and that’s where the first hand-knowledge and attention to detail comes in.  I travel regularly, and though it’s a wonderful perk, it’s also crucial to help plan the perfect holiday.  I take a lot of pride in trying to make all the trips I plan the best they can possibly be, no matter how long it takes.  Making people happy is very satisfying. +44 (0) 131 297 6229 joanna@aardvarksafaris.com Francis Naumann Senior Travel Expert Francis grew up outdoors, spending far more time on his parents’ farm than he ever did at school. As well as being engrossed in the books of Wilbur Smith from an early age, a growing obsession with Africa was given a boost on a family holiday in Kenya when he was just 10. Francis grew up outdoors, spending far more time on his parents’ farm than he did at school. As well as being engrossed in the books of Wilbur Smith from an early age, a growing obsession with Africa was given a major boost on a family holiday in Kenya when he was just 10. Having attended agricultural college, he spent 18 months exploring outback Australia, mostly working on massive cattle stations many miles from a town of any size, and learned to love being barefoot in the bush.  Having successfully dodged wild cattle and numerous snakes, he returned to the UK to farm in Wiltshire, which he did until 1995 when the call of the wild overtook him once more and he headed for Africa. For nearly six years Francis travelled the length and breadth of the continent, guiding groups of up to 20 clients on overland safaris, in 22 countries from Morocco to Cameroon, and Kenya to Namibia. He became an expert guide in wildlife, culture, geography and general African knowledge during this time, and since he had a vehicle under his command he was able to explore new and unknown places on most trips. He then went home again, got married, and made the mistake of running a post office and shop for seven years, before joining Aardvark Safaris in 2008. Away from work, Francis loves his daughter, and is a keen tennis and cricket player as well as enjoying cycling. He also likes food, wine and beer, and occasionally mows the lawn. Happiest when barefoot in the bush, Francis is passionate about wildlife, conservation and sustainable travel, is fascinated by other cultures, and the benefits that well planned travel can deliver for less fortunate communities in developing countries. He has superb wildlife knowledge and is also a good person to talk to if you are interested in the cultural side of Africa. Favourite African experience It’s really hard to name just one, but these are among many; meeting Slot (an elephant) in Zimbabwe’s Mana Pools National Park; seeing and hearing Dogon dancers on the Bandiagara escarpment in Mali; being seriously close to chimps in Mahale Mountains National Park in Tanzania; canoeing the length of the lower Zambezi, camping on islands in the river; the sight of 250 salt laden camels with their Tuareg herders crossing the Sahara to Timbuctoo in Mali; Samburu people watering their stock at Sarara’s Singing Wells. Favourite African animal The elephant, for its majestic size, complex family and social structures, and its intelligence and longevity. I have spent hours sitting watching them. Favourite three camps Goliath Safaris in Mana Pools for the most intimate wildlife encounters. Goliath Safaris Chada Katavi in western Tanzania for its remoteness, beauty, and the feeling of being truly wild. Chad Katavi Jack’s Camp in the stunning, other-worldy landscape of the Makgadikgadi Pans in Botswana. Jack’s Camp African countries visited Kenya, Tanzania, Uganda, Malawi, Mozambique, Zambia, Zaire (now the DRC), Zimbabwe, South Africa, Botswana, Namibia, Ethiopia, Nigeria, Benin, Togo, Cameroon, Ghana, Cote D’Ivoire, Burkina Faso, Mali, Senegal, Mauritania, Morocco, Egypt Tropical Islands visited Seychelles and Madagascar. Riding experience I have ridden at Sosian , Ol Malo , Lewa , Borana , and Ol Donyo in Kenya, at Ant’s Hill (twice) , Horizon Horseback Safaris , and Grootbos in SA , In Zimbabwe I’ve ridden with Hwange Horse Safaris at Boman i, and at Victoria Falls, Kwekwe and Chimanimani (Eastern Highlands). I’ve also stayed with African Horseback Safaris in Botswana. One of the best experiences was riding from Macatoo (African Horse Safaris’ camp) to the airstrip on the morning we left instead of driving there. It was a fast 3 hour ride and we saw lions on the way. On arranging holidays I like to take time to get to know about my clients, to learn what really matters to them, and to provide holidays which suit them perfectly. I work extensively with families, and enjoy coming up with exciting and varied holidays which mix adventure and wilderness with great wildlife and masses of fun in the bush. I enjoy any opportunity to produce an unusual, mixed itinerary, perhaps taking people out of their usual comfort zones and into remote, uncharted territory, even if just for a few days, and also offering the chance to spend time with some of the continent’s fabulous people. I relish any chance to talk about my favourite places and to enthuse my audience with my passion, hopefully without inducing a yawn. Part of the joy of the work is the feedback we receive (we contact every client for it on their return), and the satisfaction and excitement engendered in our clients by the holidays we arrange. Our testimonials page makes for great reading. +44 (0) 1980 849160 francis@aardvarksafaris.com Sophie Milligan Senior Travel Expert Sophie has spent over eight years in the African travel industry, gaining in-depth knowledge of eastern and southern Africa. Her adventures have taken her from the dunes of Sossusvlei in Namibia to camping beneath the stars in southern Tanzania and trekking through Bwindi Impenetrable Forest. Sophie is a true country girl at heart. Most school holidays were spent going on adventures and participating in equestrian activities. From this, the joy of travel quickly followed – exploring Argentina, the mountains in Europe and eventually venturing to South Africa to work as a backup guide at Wait A Little Horse Safaris, where her passion for all things African was cemented. After heading to Cirencester Agricultural College to study International Equine, she spent a couple of years skiing in the Alps of France and Switzerland before the call of Africa drew her back. Sophie has spent over eight years in the African travel industry, gaining in-depth knowledge of eastern and southern Africa. Her adventures have taken her from the dunes of Sossusvlei in Namibia to camping beneath the stars in southern Tanzania and trekking through Bwindi Impenetrable Forest. Africa’s rugged landscapes and the outdoor lifestyle have become an essential part of who she is. Before joining Aardvark Safaris, Sophie spent two months living in Kenya’s Lolldaiga Hills as an artist in residence at The Safari Series, where she deepened her connection to Africa while refining her artistic talents. The common ostrich – painted by Sophie In her spare time, she continues to contribute to the equestrian world, working at The London International Horse Show, Royal Windsor Horse Show, Burghley and Badminton Horse Trials – to name just a few. Whether it’s Africa or horses, Sophie can talk about both until the cows come home. She also has a little blue whippet named Pingu, who keeps her busy too. Favourite African experiences Seeing the Golden Monkeys in Uganda was incredible – we had to walk a long way to search for the Golden Monkeys and the reward of watching them on the ground and in the trees was magic. Galloping alongside giraffe, zebra and wildebeest in the Masai Mara. Favourite African animal I have two and one is quite controversial – the spotted Hyena being one, I think they have a really bad rep but they are actually so fascinating and I quite like their primeval appearance and really love the noises they make. I also love wild dog – their patterns, pack mentality and their dish like ears fascinate me! Favourite three camps The Safari Series Camp in the Lolldaigas in Kenya – The landscape is stunning, the wildlife is exceptional, the team are fantastic and the activities offered are endless. The Safari Series Sausage Tree Camp in Zambia’s Lower Zambezi  – the scenery around the camp is like being on a movie set, the food is exceptional and being by the river and listening to hippos laughing at night is wonderful. Sausage Tree Camp Ikuka Safari Camp in Ruaha – perched on top of one of the tallest spots in Ruaha the views from this camp are stunning, the rooms are rustic, spacious, comfortable and private and, the walking safaris here are remarkable. Ikuka Safari Camp African countries visited Kenya. Rwanda, Uganda, Tanzania, Malawi, Zambia, Zimbabwe, Mozambique, Namibia, South Africa + 44 (0) 1980 849160 sophie@aardvarksafaris.com Robyn Wauchope Travel Expert Robyn's love for the outdoors and wildlife started when growing up on a farm in the Scottish Borders taking any opportunity to take an animal in as a pet. She soon got the travel bug and loved being able to explore and see how cultures and nature vary around the world. Her favorite experiences so far have been playing with an elephant calf in Thailand, kayaking with orcas in Canada and exploring Cape Town and the surrounding areas. Robyn’s love for the outdoors and wildlife started when growing up on a farm in the Scottish Borders taking any opportunity to take an animal in as a pet. She soon got the travel bug and loved being able to explore and see how cultures and nature vary around the world. Her favorite experiences so far have been playing with an elephant calf in Thailand, kayaking with orcas in Canada and exploring Cape Town and the surrounding areas. Her love for African travel started after a trip to South Africa and have dreamt about safari and the incredible wildlife since. She took her passion for exploring and went on to do a Business with Tourism and Events degree at Northumbria University, spending a summer in New Hampshire followed by a year in industry at Disney World in Florida. Having graduated in the middle of the pandemic her plans of hopping on a plane to her next adventure were short-lived and she moved back to Scotland to explore its wonders. She enjoys running (taking on the occasional race!) skiing (especially in Scotland), and a good Sunday brunch. Favourite African experiences My most memorable African experience was participating in rhino conservation efforts in South Africa. I assisted with notching and planting microchips in the horns of a white rhino in Marata. I was also fortunate to join the team at the Kwandwe Conservation Trust in assisting with the notching and tagging of a black rhino and her calf.  Hearing first hand from experts, observing their work and getting the opportunity to participate was an incredible experience. Check out more about the Kwandwe Rhino Conservation Trust here: Favourite African animal While it’s difficult to choose a favourite, I have an appreciation for all wildlife, from big cats to dung beetles. I particularly love young animals, it is fascinating to watch them navigate their new life. My top three animals are the zebra for their unique stripes and sense of community. Cheetah for their elegance and elephants, is incredible seeing them in large herds. Favourite three camps Sarara is a community-run camp nestled in the remote Nanyuki region of Kenya.  Sarara offers a unique experience amidst stunning landscapes and is conveniently located near the Reteti Elephant Sanctuary, which is a must-do while there. Sarara Camp, Kenya Ants Nest / Hill This welcoming home away from home is based in the picturesque Waterberg region in South Africa. Despite having less concentrated wildlife compared to other areas in South Africa the unique experiences I enjoyed such as horse riding and swimming with horses in the lake, made it a truly memorable experience. Ants Hill Lamai Serengeti Set amidst the spectacular Kopje’s of the northern Serengeti in Tanzania, Lamai Serengeti provides a magical base for witnessing the wildebeest migration from June to October and while the migration is in the south or central Serengeti is a quiet oasis and a wonderful combination to a migration camp. Lamai Serengeti Camp African countries visited Kenya, South Africa, Tanzania, and Botswana Tropical Islands visited The Maldives and Zanzibar View Robyn’s trip itineraries and highlights here: Botswana , Kenya On arranging holidays There is such joy in curating personalised holidays for clients, whether it’s a once-in-a-lifetime adventure, honeymoon, or family getaway. I take pride in listening to their wishes, no matter how big or small, and crafting recommendations tailored to their preferences. One of the best parts of the process is hearing about it when clients return with unforgettable memories, often sparking a wish to plan their next adventure. +44 (0) 131 297 6229 robyn@aardvarksafaris.com Emily Tetley Travel Expert Emily joined the Aardvark Safaris' Tidworth office in September 2023. Emily has been a nature enthusiast from a young age, getting her first pair of binoculars at age 11 for her bird-watching passion at the time. She is a huge animal lover and is excited about the possibility of seeing them in the wild. Emily was thrilled to join Aardvark Safaris in September 2023 which could combine her passion for travel with her desire to help people have an unforgettable holiday. She has been a nature enthusiast from a young age and cherishes the possibility of seeing them in their natural habitats. Emily has travelled extensively across southern Africa and enjoys sharing her first-hand knowledge when helping people plan their dream trips. Favourite African experience Seeing an animal in the wild for the first time is breathtaking and feels like an absolute privilege. It is as if you are seeing them for the first time ever and you feel so lucky to have stumbled upon them. I remember my first afternoon in Africa after landing, I was on the banks of the Zambezi and spotted two hippos relaxing in their natural habitat. It was so exciting, and it only got better from there. Favourite African animal I truly love all animals, but baby elephants have got to be the most adorable for me. You would never think that something so enormous can start so little! It’s so endearing to watch them totter beside their mothers, copying their behaviour to learn about the bush. Watching them navigate how to use their trunks is fascinating – for the first few months they swing them about like toys. Favourite three camps Shinde I have never been so well taken care of as at Shinde. Nothing is too much trouble and they go above and beyond to make you feel welcome. The permanent lagoon just in front of the main area is home to honking hippos, making you feel immersed in nature. Here I went in a mokoro for the first time ever, which is possible here year-round. Shinde Camp Shipwreck Lodge This is the most unique lodge you will come across. It is original, quirky and surprisingly cosy. The infamous fog of the skeleton coast descends regularly, giving a mystical feel and dampening the sand so that it becomes trailed in the footprints of mysterious creatures. The rooms are well equipped with soft blankets and log burners for chillier times. Shipwreck Lodge Kiri Camp You are guaranteed some amazing wildlife sightings in this area when on a game drive. The camp is incredibly spacious yet intimate with the most welcoming team. The large wooden decks look over the Kiri floodplains, meaning you can spot wildlife while drinking your morning coffee. Chisa Busanga Camp The rooms here are designed as weaver nests and are unlike anything you have ever seen. The open from looks out over the vast Busanga Plains so you can watch elephants, antelope, warthogs and more from your room. What I especially love about this camp is how they deliver your morning coffee in a wicker basket via a pulley. Chisa Busanga African countries visited Botswana, Namibia, South Africa, Zambia, Zimbabwe View Emily’s trip itineraries and highlights here: Namibia On arranging holidays What I love about holidays with Aardvark is that absolutely everything is taken care of – all you have to do is get to the airport. It’s enjoyable to tailor the perfect holiday for someone based on their interests. We really take the time to get it just right so that it’s not just any holiday, it’s an unforgettable experience. It’s so special to get great feedback from clients after their trip, I am always thrilled to hear that they had an amazing time. + 44 (0) 1980 849160 emily@aardvarksafaris.com Lucinda Crawford Travel Expert For Lucinda, joining the Aardvark Safaris team was an irresistible opportunity to twin travel with curating others’ ever-lasting holiday memories. Lucinda has always been an avid fan of the outdoors, ever since being old enough to toddle after any willing creature at her family farm in Melrose, Scottish Borders – ranging from pet lambs to dogs, chickens, geese, cows, with a particular love for horses, and even a pet parrot at one point. She was educated in Edinburgh, but any spare moment was spent competing in the sport of Eventing across the UK and Europe with her horses and this juggle continued whilst studying for an International Business Management degree at the Royal Agricultural University in Cirencester. After graduating in 2022, Lucinda worked in real estate in Edinburgh before heading off to explore New Zealand and Australia to dodge the Scottish winter. The trip generated many memories and a travel bug to last a lifetime, and her highlights included diving the Great Barrier Reef, swimming with dolphins in Kaikoura, skydiving over the Whitsundays and immersing herself into traditional Kiwi/Aussie life whilst meeting people from all walks of life on the way. After returning from the southern hemisphere, Lucinda worked with racehorses to fuel her outdoorsy fix until the end of the National Hunt calendar. During this time, it became apparent that her travel bug wasn’t satiated, and joining the Aardvark Safaris team in their Musselburgh office in 2023 was an irresistible opportunity to twin travel with planning others’ ever-lasting holiday memories. Favourite African experiences It is so tricky to pick one! The wildlife, the people, the camps/lodges, the landscapes… every trip to Africa offers something new and exciting. Horses truly are the best 4×4 to experience the magic of safari aboard, getting up close and personal with the wildlife never ceases to amaze me, especially how relaxed they are around even the biggest predators. Highlights include cantering across the Masai Mara alongside a dazzle of zebra with Offbeat Riding Safaris , ‘bush-whacking’ to track a pride of lions with Wait a Little in South Africa, three leopard sightings in one morning, all on horseback, at African Horseback Safaris in the Okavango Delta, galloping with the wildebeest migration with Kaskazi Horse Safaris in the Serengeti, and jumping every elephant-felled log that could be found with Horizon Horseback Safari on their Mashatu Tuli ride in eastern Botswana. Favourite African animal Whilst I love seeing any animal on safari, no matter how great or small, on safari, a leopard sighting is always a highlight due to their stealthiness and therefore, the thrill when you finally see one and can appreciate their beauty up close, normally after an immense shift from your guide. Wild dog is another favourite due to their ability to work as a team, which is reflected by their astronomically high hunting success rate, watching them hunt is so enthralling! Favourite three camps Ol Malo Lodge The views are simply just magical, the hospitality is second-to-none, and the rooms are exquisitely tasteful and built into the rockface on the hill where the lodge is situated so it really blends in with the surroundings. Ol Malo Lodge, Kenya Tanda Tula The most amazing wildlife, guiding and magnificent rooms. A very luxury, upmarket camp but tasteful, and the emphasis still firmly remains on the wildlife. Tanda Tula, South Africa Shinde Camp The most beautiful camp in such an idyllic setting that offers the perfect combination of water and land activities year-round. Shinde Camp, Botswana Riding experience Kaskazi Horse Safaris , Wait A Little , Horizon Horseback Safaris , Horizon’s Mashatu Tuli Ride , Ants Hill / Nest , Borana Lodge , Offbeat Riding Safaris, Sosian Lodge, Ol Malo Lodge, African Horseback Safaris, Okavango Horse Safaris , Ride Botswana , Camp Kalahari African countries visited Botswana, Kenya, South Africa, Tanzania View Lucinda’s trip itineraries and highlights here: Botswana , Kenya, South Africa , Tanzania On arranging holidays The tailormade element of the trips we create is so unique, and it means we can deliver exactly what the client wishes to get out of their African adventure. It is always magical when clients come back and shares their experience, as we get to travel to the same places, so it is very special when you can share their excitement. Whilst African travel is a real perk of the job, it also enables us to recommend the most well-suited holiday to our clients. I love getting to know a client, and then establishing what would work best to ensure we achieve, and hopefully emulate, their expectations, which usually leaves them with the safari bug and an infatuation with Africa. +44 (0) 131 297 6229 lucinda@aardvarksafaris.com Madeleine Prior Travel Expert Madeleine has always had a keen interest in the natural world, in particular the landscapes and wildlife of the African continent. Volunteering with wildlife in Namibia and South Africa’s Eastern Cape, lead to her studying Zoology at the University of Reading. A highlight of her degree was a field trip to Ecuador and the Galapagos islands, swimming with marine iguanas and Galapagos penguins. Madeleine has always had a keen interest in the natural world, in particular the landscapes and wildlife of the African continent. Her first safari at 9 years old to Kenya’s Masai Mara and a school trip trekking through the jungles of Madagascar intensified this passion, leading her to volunteer with wildlife in Namibia and South Africa’s Eastern Cape, before studying Zoology at the University of Reading. A highlight of her degree was a field trip to Ecuador and the Galapagos islands, swimming with marine iguanas and Galapagos penguins. After graduating, Madeleine worked on a farm back home in Wiltshire and then at a school in Hampshire as a 1:1 teaching assistant and sports coach. She enjoyed the freedom of working outdoors, and the sense of fulfilment from working in education. This, combined with the pull back to Africa, led Madeleine to book a one-way flight to Johannesburg in January 2023 to begin six months of training to become a qualified safari guide, followed by six months working at a lodge in the Greater Kruger. During this year, she was lucky enough to have time off to travel to some amazing places within South Africa (Cape Town, Rorke’s Drift and Blyde River Canyon to name a few), as well as overland trips to Lesotho and Mozambique. This year in South Africa was an incredible experience, allowing Madeleine to immerse herself in the diverse culture of the country, its varying landscapes and amazing wildlife. It was a difficult decision to move back to England after this unforgettable year, but the move back home allowed her to join Aardvark Safaris where she hopes to share her passion for safari and African culture with even more people, and help create their own unforgettable experiences. Favourite African experience An experience I’ll always remember was during my field guide training, I was walking the fence line when a nearby herd of impala suddenly began alarm calling and running right past me, quickly followed by wild dogs in hot pursuit. It was not long after I heard the snarls of a disagreement only to discover that the wild dogs had caught an impala just the other side of the fence, and were fending off a clan of hungry hyenas. Listening to the crunching of bones and the interactions between these two predators is something I’ll never forget. Favourite African animal I’ve always loved all big cats and the role they play as apex predators , but the leopard has to be my favourite . Their ability to carry twice their body weight up a tree is mind-blowing. Leopards are known for being elusive meaning whenever you get the chance to see them in the wild , it is always a breath-taking moment. African countries visited Namibia, South Africa, Mozambique, Kenya, Madagascar + 44 (0) 1980 849160 madeleine@aardvarksafaris.com Maggie Maxwell Marketing Assistant Born in New Zealand, Maggie spent the first years of her life surrounded by the natural beauty of the sands of Golden Bay, before moving to rural north-east Scotland. Growing up, around farmland with horses, ducks, and sheep, she spent most of her time outdoors which fostered a strong connection to animals and nature. Born in New Zealand, Maggie spent the first years of her life surrounded by the natural beauty of the sands of Golden Bay before moving to rural Angus in Scotland. Growing up on farmland with horses, ducks, and sheep, she spent most of her time outdoors, fostering a strong connection to animals and nature. With a childhood marked by adventurous holidays—hiking, diving, and riding in the Middle East and North Africa—she developed an insatiable curiosity for new cultures and a deep love for exploring remote landscapes. Her journey into storytelling began with an undergraduate degree in filmmaking, where she honed her creative skills, followed by an MSc in Digital Marketing, which combines creative storytelling with strategic thinking. Now, in her role at Aardvark Safaris, Maggie draws on these strengths to highlight Africa’s stunning wildlife, diverse landscapes, and unforgettable safari experiences. Recently, Maggie’s love for adventure took her to the Atlas Mountains, where she spent days on horseback, riding through challenging terrains and ancient Berber villages. This trip deepened her appreciation for Africa’s diverse physical landscapes and cultural heritage and fuelled her passion for exploring and sharing the varied experiences that Africa offers. +44 (0) 131 297 6229 maggie@aardvarksafaris.com Tansy Shingleton Concierge Having studied travel and tourism at college and International Tourism Management at university Tansy has always had an interest in the industry. Tansy’s African travel so far has been a month spent in Southern Africa including a safari in Kruger National Park, cultural experiences in Eswatini, and some time on the beach in Mozambique. Having studied travel and tourism at college and International Tourism Management at university Tansy has always had an interest in the industry. So she was delighted to join the Aardvark Safaris team in June 2019 as a sales administrator and to be able to put to good use her knowledge of the tourism industry. Tansy now works as a Travel Expert and has travelled across Namibia and Botswana, ending in Zimbabwe’s Victoria Falls for a short stay to visit some of Aardvark Safaris’ favourite properties. She previously spent a month in Southern Africa including a safari in Kruger National Park, cultural experiences in Eswatini, and some time on the beach in Mozambique. Favourite African experience A moment of personal enjoyment came to me one morning in the Okavango Delta, Botswana. I watched the sun slowly rise above a watering hole (African skies never fail to disappoint). So beautifully calm, egrets and herons wading, a mother hippo with her calf slowly padding out in search of a deeper water channel as the heat of day kicks in, zebra and wildebeest with their necks bowed and in the near distance giraffe and elephant. A perfect African scene. Favourite African animal Cats of any kind but recently I particularly enjoyed watching lions. They’re the only cat to live in groups (pride) and I loved the way their ferocity can easily be forgotten as they greet each other so affectionately, gently rubbing their battle-torn faces together. Favourite camp I’m going to cheat and say the best camp for me is any mobile safari camp. It doesn’t matter where it is, but there is no greater luxury, or thrill, than enjoying a morning brew made with water heated over the fire’s embers and having fresh bread daily cooked in the open air in tins. The tents might not be as big as a luxury safari camp, and the bathroom facilities are necessarily more simple, but mobile camps hark back to the days of pioneers and make me feel like an explorer. African countries visited South Africa, Eswatini, Mozambique, Botswana, Zimbabwe, Namibia On arranging holidays The joys of putting together a tailor made holiday is that you can plan your client the perfect trip for them. Taking time to get to know your client and drawing on your own knowledge and experiences of Africa to ensure any recommendations are best suited for their preferences whether it be a romantic hideaway for honeymooner, a luxury villa for a multi-generational trip or something a little unusual for those wanting to experience something outside of their comfort zone. Clients come to us for their first safari saying this is a once in a lifetime trip but more often than not they’re soon back in touch ready to explore what Africa can offer next, a true testament for perfectly curated trip. + 44 (0) 1980 849160 tansy@aardvarksafaris.com Patricia Knight Travel Concierge Born in Brazil to an English father and Brazilian mother, Patricia grew up in a very multicultural household with a huge number of Brazilian aunties and cousins never too far away, always being loud and chatty. Born in Brazil to an English father and Brazilian mother, Patricia grew up in a very multicultural household with a huge number of Brazilian aunties and cousins never too far away, always being loud and chatty. Her love of travel evolved through the many trips they took together as a family around the length of breadth of Brazil. How people lived, their customs, accents, cuisines always fascinated her, and the adventure of reaching a far flung place where they didn’t know what kind of hotel (if any) was waiting for them at the other end added to the sense of excitement (this was travel by the seat of our pants which was the way her parents loved doing it, and pre-internet days). She says “In Brazil, wildlife was never too far away! Mostly in the interest of self-preservation, while I was growing up I always took notice of different creatures that were around me which gradually developed into a keen interest in spotting exotic birds and other animals in the wild. Although I haven’t ventured to Africa yet, I’m sure my sense of adventure will get me there and one of the most exciting parts for me is to see the variety of wildlife that it has to offer in that incredible landscape. Now helping to develop wonderful holidays for our customers and hearing about their wildlife encounters it is inspiring me even more!” “My interest in travel led me to move to Edinburgh back in the late 90s to study a degree in International Hospitality Management. Here I started working life in hotels, then moved on into DMCs and Tour Operators gaining over 15 years’ experience within the Scottish tourism industry. It is hard not to be moved and enthusiastic about the scenery, history and legends of Scotland” “I am now very much settled in East Lothian and when I am not taking walks along the wonderful coastline with my binoculars, you might find me discovering new music (and dancing around the kitchen), enjoying a good film, or relaxing with family and friends with some good food and drink.” +44 (0)131 297 6229 patricia@aardvarksafaris.com Elaine Brand Operations Elaine was born and raised in Pretoria, South Africa. Being part of a close-knit family, travelling always formed a major part of her school years, which led to her love and interest in exploring and travel. Elaine was born and raised in Pretoria, South Africa. Being part of a close-knit family, travelling always formed a major part of her school years, which led to her love and interest in exploring and travel. Living in Pretoria meant only one thing – centrally based to reach so many amazing destinations in any direction – and that is exactly what she (and her family) did. Spending time around a campfire with friends and loved ones in Africa is the one thing everyone should experience at least once in their lifetime. Elaine was fortunate enough to have grown up knowing this as home. Even while studying (Interior Design at Pretoria University of Technology) nothing could stop her from jumping on a plane or behind the wheel of her car for a road trip. Armed with a camera and a spirit of adventure, she navigated South Africa from top to bottom. South Africa is a magical country and has the ability to take your breath away every single day and being part of that made it extra special for her. Places fondly remembered and still visited to this day include the beautiful Cape Winelands, the vast and rugged Karoo, the captivating Garden Route in the Eastern Cape, the sandy beaches and blue waters of Sodwana Bay, and the majestic Kruger National Park to name a few. Always seeking to broaden her horizons, she also travelled to various other African countries. These include Mozambique, Namibia, Swaziland, and Mauritius. After getting married, the travelling did not stop, and after visiting countries in Europe, it was ultimately Scotland that stole her heart. Being based in Scotland (Edinburgh) since 2021, she joined Aardvark Safaris operations team in 2023 . She aims to combine her vast experience in office administration, sales, finance, and creative design with her knowledge and love for Africa to deliver unforgettable experiences for every client. Apart from her love for travel, she enjoys spending time with her dogs and the outdoors, visiting new coffee shops and restaurants, cooking with her husband (around an open fire of course), and outdoor photography. +44 (0) 131 297 6229 elaine@aardvarksafaris.com Christine Wächtler Operations Christine's appreciation for wildlife, open landscapes and the outdoors started at a young age. She was born and raised in Namibia and spent a lot of her time on family camping trips exploring her home country. She then moved to Cape Town, South Africa when she was 16 years old to complete her schooling and start her journey in the tourism industry. Christine’s appreciation for wildlife, open landscapes and the outdoors started at a young age. She was born and raised in Namibia and spent a lot of her time on family camping trips exploring her home country. She then moved to Cape Town, South Africa when she was 16 years old to complete her schooling and start her journey in the tourism industry. Working for various DMC’s (Destination Management Companies) organising events and incentives to Southern Africa she had the opportunity to share her love for the outdoors. In 2014 she decided to move to Edinburgh, where she worked in the UK inbound travel industry. Christine jumped at the opportunity to share her love once again for the African outdoors as part of the operations team at Aardvark Safaris. In her free time, she loves exploring different parts of Edinburgh, cooking, taking long walks with friends and watching stand-up comedy. African countries visited: Namibia, South Africa, Zimbabwe, Zambia, Malawi +44 (0) 131 297 6229 christine@aardvarksafaris.com Mook Phongchaiyong Operations Working in sales and office administration for a satellite communications business in Thailand for 14 years, Mook started working in Operations for Aardvark Safaris in 2018. Mook likes exploring and seeing how people, cultures, nature and foods vary in different parts of the world. Working in sales and office administration for a satellite communications business in Thailand for 14 years, Mook started working in Operations for Aardvark Safaris in 2018. Mook likes exploring and seeing how people, cultures, nature and foods vary in different parts of the world. She has been to China, New Zealand, Singapore, Hong Kong, Nepal, Japan, Taiwan and the USA (California and Nevada). Mook enjoys hiking and has been to the Everest Base Camp, Gokyo Lakes, Renjo Pass and Kala Pathar in Nepal. In 2022, Aardvark Safaris sent her to Offbeat Mara Camp and Kicheche Valley Camp in the Masai Mara, Kenya, and that’s her first safari experience as well as first visit to Africa! + 44 (0) 1980 849160 mail@aardvarksafaris.com Adélie Freiss Operations Originally from the East of France, I moved to Scotland in 2016 to study at the University of Edinburgh and spent my year abroad in Saint Petersburg. My love for travel started early – growing up in a family of five, we spent summers exploring different countries with no fixed itinerary. Our parents would hand us guidebooks before each trip, and once we arrived, we would vote as a family on where to go, what to see, and which adventures to go on. Originally from the East of France, I moved to Scotland in 2016 to study at the University of Edinburgh and spent my year abroad in Saint Petersburg. My love for travel started early – growing up in a family of five, we spent summers exploring different countries with no fixed itinerary. Our parents would hand us guidebooks before each trip, and once we arrived, we would vote as a family on where to go, what to see, and which adventures to go on. My first big trips were in Togo, Benin, Senegal and Morocco, and with my sister now living in the Democratic Republic of Congo, my connection to the continent has only grown stronger. I’ve been lucky enough to see incredible wildlife while traveling, but one of my fondest memories is watching giraffes cross the road in front of our car – moving so fast yet seeming to glide in slow motion. I have yet to see any of the big cats, and it is high up on my list! When I’m not planning my next adventure, you’ll find me on the dance floor as I have a passion for Latin dances or simply hitting the gym or reading a good book. I’m really excited to be joining the Aardvark Safaris team and cannot wait to deepen my knowledge of all things Africa while helping others experience its beauty and wildlife. +44 (0) 131 297 6229 adelie@aardvarksafaris.com Carolyn Dale Finance Assistant Carolyn joined the Aardvark Safaris Hampshire team in May 2018, where she works as a finance assistant alongside Richard Preston. Her previous finance experience comes from 21 years working for the family manufacturing business, so this has been quite a change. Carolyn joined the Aardvark Safaris Hampshire team in May 2018, where she works as a finance assistant alongside Richard Preston. Her previous finance experience comes from 21 years working for the family manufacturing business, so this has been quite a change. Her young family keeps her busy most of the time but when she does get a spare moment she loves reading, football (watching not playing) and going to see live bands. She enjoys travelling and Africa is definitely on the list for a future holiday as she thinks her girls would be amazed to see the wildlife up close and personal. Botswana is high on her wish list and she would love to see any of the big cats. +44 (0) 1980 849160 mail@aardvarksafaris.com Why Aardvark? The Aardvark Story Meet the team Feedback we loved Responsible Tourism Aardvark Guarantee Events Careers Follow Us Sign up for our newsletter Sign up for our newsletter and we'll send you our Insider's Guide free     | We will not share your details with anyone. Step 1 of 3 33% FULL NAME Email * mailchimp signup What type of holiday are you planning Safari Riding safari Beach holiday Honeymoon Primate Who will you be traveling with Family Multi-generational family Couple Solo Other Δ Blog All the latest trip reports, breaking news, offers and goodies The Lost World of Lolldaiga Wednesday, 10th September 2025 Julia Cassels is an artist known for her vivid paintings and sculptures of African wildlife. She developed a deep understanding of her subjects while living in Zambia and Tanzania for [...] Read More Discover the magic of Madagascar Friday, 5th September 2025 A holiday in Madagascar offers an exotic mix of wildlife and breathtaking scenery, famous for its enchanting lemurs and idyllic beaches. It’s a magical destination but one that requires some [...] Read More Gorilla Trekking: Rwanda vs Uganda – your ultimate guide Friday, 22nd August 2025 Choosing between gorilla trekking in Rwanda or Uganda is a big decision, and it often comes down to your personal travel style, fitness level, and budget. While both countries offer [...] Read More The A-Z guide to safari animals Friday, 15th August 2025 From the moment you set foot on the dusty savanna, a safari is an unforgettable journey of discovery. With such a vast and diverse animal kingdom, it’s impossible to know [...] Read More Why a safari is the smartest holiday choice for your family Friday, 8th August 2025 In a world filled with endless holiday options, finding one that truly caters to every family member can be a challenge. What if you could combine adventure, learning and quality [...] Read More A riding safari seen through teenage eyes Friday, 8th August 2025 My trip to Botswana can only be described in one way: life changing After finishing my GCSEs, I had the privilege to stay at African Horseback Safari’s Macatoo Camp for [...] Read More Some of the finest luxury safari lodges in Africa Friday, 1st August 2025 There’s a level of safari travel in Africa that goes beyond simply “luxury.” It’s defined by exceptional locations, exquisite design, and experiences that feel completely tailored and secluded. This is [...] Read More Cycling safari in Africa – pedal power Friday, 25th July 2025 Although Africa’s vast expanses of wildlife-rich wilderness lend themselves to exploring by vehicle, travelling across the savannah under one’s own steam, whether on foot or a mountain bike, is especially [...] Read More Botswana Guided Cycling Safari Monday, 21st July 2025 This is a safari where action and adventure meet. The first cycling safari of its kind in the Okavango Delta, you’ll get to explore the ancient elephant paths that have [...] Read More Journey through history: Nelson Mandela’s South Africa Friday, 18th July 2025 South Africa’s journey from apartheid to democracy is a compelling story, with Nelson Mandela at its heart. The system of apartheid, legally enforced racial segregation and discrimination for over four [...] Read More Quick Contact We would love to hear from you, no matter how early in the planning process you might be. We’re passionate about Africa and would be happy to chat about creating your tailor made safari. HAMPSHIRE OFFICE Aspire Business Centre, Ordnance Road, Tidworth, Hampshire, SP9 7QD 01980 849160 discover@aardvarksafaris.com CALL-BACK REQUEST MAPS & DIRECTIONS SCOTTISH OFFICE Stuart House, Station Rd, Musselburgh, East Lothian, EH21 7PB 0131 297 6229 discover@aardvarksafaris.com CALL-BACK REQUEST MAPS & DIRECTIONS © 2025 Aardvark Safaris Privacy Policy Contact Us About Us Blog Our website uses cookies We use cookies to analyse our traffic, enhance our website’s functionality and performance and better experience for our users. If you require more information, please view our cookie policy. In addition, this site is protected by reCAPTCHA and the Google Privacy Policy and Terms apply. Read More Accept Reject All Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://www.safarivet.com/pet-care-with-a-difference/the-safari-team/",
      "text": "The Safari Team - Safari Veterinary Care Centers In League City, TX League City: 281-332-5612 Pearland: 346-688-7678 Contact Us Referrals Contact Us Login Blog MENU MENU Dog Breeds Wellness Center Wellness Plans Adult Dog Wellness Plans Dog Life Stage Wellness Plans Cat Wellness Plans Birds - Avian Pet Wellness Plan Reptile - Exotic Pet Wellness Plans Mammals - Exotic Pet Wellness Plans Rabbit Ferret Primates Guinea Pig Sugar Gider Chinchilla Pot Bellied Pig Hamster Hedgehog Prairie Dog Rat Boarding Services Boarding Services for Dogs Boarding Services for Cats Boarding Services for Birds Boarding Services for Exotic Mammals Boarding Services for Reptiles Boarding Services For Primates Grooming Services Pet Master Stylist Pampered Pet Grooming Dog Spa Services Cat Grooming Service Pet Safari Services HealthMap Care Topics Dogs and Cats Care Puppy Rap Pet Vaccinations Heartworms The Flea Life Cycle On Dogs & Cats Animal Ears Care Pet Behavior ANIMAL Bladder and Kidneys Pet Laboratory Tests Pet Eye Disease Veterinary Dermatology Liver Disease in Animals Pancreas Disease Brain Disease in Pets Parasitic Worms Dog Musculoskeletal Anatomy Musculoskeletal Conditions in Animals Pet Animal Dentistry Dog Reproduction Gastritis in Pets CPR Lymph Nodes in Dogs The Spleen in Dogs Pharynx in Dogs Cardiovascular Disease in Dogs Intervertebral Disc Disease Diabetes in Pets Small Mammals Hamster Guinea Pig Chinchilla Rat and Mouse Sugar Glider Care Ferrets Rabbits Hedgehog Birds Information for New Bird Owners Pet Bird Types Pet Bird Care and Husbandry Bird Anatomy, Physiology and Care Is My Bird Sick? Avian Health History Form Chlamydia in Parrots Psittacine Beak and Feather Disease (PBFD) Feather Picking in Pet Birds Hospital Release Instructions Primates Pot Bellied Pigs Care Reptiles Care of the Axolotl General Reptile Pet Care Salmonella Reptile Skin Mites Metabolic Bone Disease Turtle and Tortoise General Diseases Nutrition Bearded Dragon Boa and Python Feeding Leopard Geckos Iguana Water Dragon Laboratory Wildlife Veterinary Care The Safari Difference The Safari Differences History of Safari The Safari Standards Wellness Focus VetPlan Value Sensitive VetPlan Report We Never Say NO! Professionalism We are SWANS We Show That We Care Cameras We Diagnose Before We Treat In-House Pet Laboratory We are Team Based Veterinary Medicine Veterinarian Center Safari Workflow Model Transparency Fear Free Practice Compassionate End of Life No Charge Office Visits Advanced Diagnostics MRI At Safari Cat Scan At Safari C-Arm Fluoroscope At Safari Pet Ultrasound At Safari Digital Veterinary Radiography At Safari Veterinary Endoscopy Services At Safari Veterinary Arthroscopy At Safari Digital Veterinary Dental Radiographs At Safari Veterinary Services Pet Orthopedic Surgery Exotic Animal Surgery And Medicine Camp Safari Dog Boarding Kennel Pet Grooming Services Pet Animal Rehabilitation Pet Dental Services Intervertebral Disc Disease Dog Laryngeal Paralysis Special Procedures Regenerative Medicine Animal Stem Cell Therapy Spinal Cord Damage in Dogs from IVDD Frequently Asked Questions Stem Cell Therapy Fact or Fiction Stem Cell Types Pet Stem Cell Laboratory Platelet Rich Plasma For Pets Stemcellsafari.com Pet Care With A Difference The Safari Team Family Pets Relationships Blog Do you know about our new 3T MRI & referral service? 3T MRI Do you know about our new Pearland Clinic? Explore Now Stent placement for laryngeal paralysis View More We are looking for bright, energetic, people-oriented team members who love to teach their knowledge to join our staff. Veterinarians, new graduates or experienced, animal technicians, assistants and customer service representatives, as well as people experienced with grooming and boarding are welcome to apply. WE ARE HIRING Apply Now Safarivet / Pet Care With A Difference / The Safari Team The Safari Team Safari represents Team Based Veterinary Medicine. This team all understands the rules of the game. How to greet clients, how to comply with their wishes and how to wish a fond and sincere farewell. All team members are trained every Wednesday on both customer service and technical issues. Many veterinary facilities allow the client to only interact with the veterinarian. At Safari, we trust our whole team to provide information and services to our clients. Should the team member have an issue or question that they cannot answer they will say “I’ll be happy to find that out for you” and they will do just that. Our team works with our veterinarian to support our clients. This gives Safari many points of contact and a more stable system of service than the traditional form of veterinary practice where there is just one point of contact (the vet). Operating the Team requires standards. Standards allow for each team member to know what the veterinarian is doing and for the veterinarian to know what the team is doing. We have written standards of Ethics, Care, Communication, Appearance, Service, and Conduct. These Standards are the foundation that supports the Team in performing their functions, tasks and duties. The ethical standards set guiding principles such as “Respect all Life” and “Diagnose before you Treat” or “Do what correct for the pet”. These guiding principles are used to make decisions about what we “ought” to do. When you can have a whole team doing what they ought to do you have a very powerful force caring for your pet. Our people are not paid on production. They are mostly fueled by the emotional paycheck received when they do something good for a client or a pet. Each Wednesday we celebrate these actions among the team so that we all know the rules of the game we are playing and how serving the client and the pet in the highest form is how we score points. The Safari Train – A Christmas 2019 Story Merry Christmas Safari Team!  As you know the Swahili word for “journey” is “Safari”.  Safari was named this because there are many journeys that Safari takes. You as a Safari employee are on a journey of personal knowledge and development that teaches you about animal care, husbandry and medicine as well as how to work as a team and handle difficult situations. The Safari Pet is on the journey of life starting as a puppy or kitten or other baby critter progressing through adolescence to adulthood and finally to the senior years and death.  The Safari Client is on a journey of knowledge about the care of their pet and building of relationships with you the Safari Team. Safari as a business is on a journey to pioneer the care of pets and provide veterinary medicine the way it should be: At The Highest Level of Excellence. For a moment think of Safari like a train.  A train that stops at the different “Stations of a Pet’s Life”, the “Puppy Station”, “Adolescent Station”, “Adult Station”, and “Senior Station”.  The train is made of train cars linked together. Each of these cars has a purpose, a function a reason for being. For example, there is the “Surgery Car” that at the “Adolescent Station” provides spay or neuter services for the pet. Each train car has people that provide these services and the cars are linked together by our communications tools the treatment boards, the forms, the computer system. A train is different than other forms of travel in that a train is on tracks that keep the journey certain and provides guidance for where and how the train goes.  These tracks are the Safari Standards of Care, Service, Conduct, Appearance and Communication. Without which we could stray off the path of effective pet and client care.  Guiding Principles are the “Signals” that help focus the correct decisions such as “We Diagnose Before We Treat”, “We  Never Say NO”, “We Always Do What correct for The Pet”, “We are Ladies and Gentlemen Serving Ladies and Gentlemen”, “We Respect ALL Life”. Whether the train has a steam engine fired by wood, coal or diesel or an electric source does not matter.  They all require energy to move the wheels.  The energy comes from the relationships that people have with pets, called the “Human Animal Bond” or just “The Bond”.  Safari provides services to these loved pets throughout all stations of their life creating positive energy that fuels the engines of the Safari Train. The Safari Train is manned by the Safari Team that all work together to make each stop at each station a success. Every team member has a role. For example, Dr. Garner is the face of the train and its guiding light allowing us to all see where we are going and what our future is.  The Safari Train has been on its track since 1984 and is strong, sturdy, and determined to make headway in veterinary practice for years to come. Mikey is the chief engineer with his drone flying ahead to spot obstacles and find new directions. Lori is our scheduler, keeping the train on time and getting us to each station by the time the pet or client is ready for us. Kenneth likes to sit at the front of the train, tooting the whistle to greet clients old and new, and passing on all the news. Every member of the team brings a different skill; Ryan is always calm and methodical even when it seems like we are on a runaway train, he has a mastery of the pillars, keeping things on tack. Kathryn (tall Kathryn) is like the steward dispensing compassion and knowledge instead of drinks and snacks. Katharyn has her own style, she greets the clients with jokes and laughter and an underlying SWAN like efficiency. Brandy is a new addition, bubbly and friendly who is coming up to speed thanks to the tutoring of her coworkers. The surgery car is a busy one. There is a rush hour in the morning with all hands-on deck to get the pets ready for surgery. Lacey calmly and efficiently monitors the pets and knows where to find every instrument big or small. Gina is the queen of maintenance making sure that everything is clean and prepped so we can deal with any situation, she keeps us on track. Allison comes fresh from technician school full of knowledge and ready to acquire the skills she needs to be a great vet tec. This train works 7 days a week and Dara takes charge at the weekends. Her ability to deal with any species or situation makes her a valuable asset to the train. Veronika is the head porter. Her job is to get everything in the right place; unpacking orders, filling prescriptions or fetching pets for exams or surgery. She is always ready to lend a hand. The medicine car is a big and complicated. Communication skills are the key here. Sergio uses all his knowledge and Spanish skills to explain the doctor’s findings and recommendations. Which makes him a favorite with the clients. Scout may be new, but she has impressed with her ability to focus and do a good job no matter how much is happening at home. Amanda is young for a crazy cat lady, but her cat wrangling skills are phenomenal, and she always has a smile! Jessica may be gone but not forgotten, we can’t wait till her new baby is big enough to leave at home so Jessica can return to our team. Dr Gibson had a long journey before she got on the Safari train. She brought with her a sharp intellect, tons of enthusiasm and knowledge and a sunny outlook that is rapidly making her a favorite with our clients. We are very happy to have her at the front of our train. Grooming sometimes looks like a circus car. We have seen all kinds of animals poking their heads out of the windows. Linda is their conductor. She makes sure the grooming pets make all the correct stops whether it is hospital services, boarding or grooming. Priscilla is the ringleader, keeping everything moving and cracking the whip to keep the customers happy. Sarah is a detail-oriented groomer, cracking jokes as she turns out one masterpiece after another. Mikey works the weekend so other people can have some family time. He brings many years of experience to the team and a rare ability to work fast when needed. Grooming is a team effort. Carla is cheerful in the face of mean cats, gentle with the little furry creatures and a match for any fractious dog. Savanah is a great bather, making dogs look and smell great with ease and a smile. Mary may be small, but she has a big personality and a good attitude despite the chaos at home, a valuable asset to the grooming team. In charge of the boarding car we have Jamie, he has true grit; organizes our cage situation never complains and guides the training and duties of his staff. Scarlett is a great addition to the boarding car. She has a real rapport with the pets and clients, a positive attitude and a hard worker. Katie is the baby of the boarding family, she has boundless energy, compassion for the animals and willingness to learn. One of the tenets of Safari is that we never say no, resulting in the addition of two new cars; Rehabilitation and Regenerative Medicine. Wilson brings his veterinary background and his affinity for animals making him the rehab dog whisperer. Celia is a hard worker, who cares deeply about the pets in her care and Safari. She is quick learner and loved by clients and pets alike. Ruby is our technical specialist, nursing and nurturing the cells that make regenerative medicine possible, a real gem who will lead a hand in any department! Melinda is our communications expert, spreading the word of Safari (and how great stem cells are) both near and far. Her tireless efforts liaising with stem cell patients is invaluable. The Safari standards are the rails which keep this train on the tracks. Mrs. Garner oversees train tract maintenance; keeping the standards maintained and passing them on to each new generation of Safari team members. You have embarked on a journey that will change you forever, a journey of pet care, teamwork and personal and professional growth.  This train journey visits stations of a pet’s life following the rails of standards, guided by principles of practice and delivered by members of an empowered team.  We are providing pet care services that generate the value that provides the energy to propel the engine of the human animal bond in the Safari Train. Online Referral Form Pet Care With A Difference Relationships Family Pets The Safari Team Veterinary Services Pet Orthopedic Surgery Exotic Animal Surgery And Medicine Camp Safari Dog Boarding Kennel Pet Grooming Services Pet Animal Rehabilitation Pet Dental Services Intervertebral Disc Disease Dog Laryngeal Paralysis Special Procedures Categories Categories Select Category Advanced Imaging & Diagnostics Advanced Veterinary Treatments Animal Acupuncture Animal Awareness Days & Events Cat Care Dog Boarding Dog Care Exotic Animal Surgery & Medicine Intervertebral Disc Disease (IVDD) Pearland Pet Allergies Pet Animal Rehabilitation Pet Behavior Pet Boarding Pet Care Services Pet Care Tips & Guide Pet Dental Services Pet Diet Tips & Guide Pet Exercise Pet Grooming Pet Infections & Disease Pet Orthopedic Surgery Pet Therapy Pet Training Tips & Guide Pet Vaccinations SafariVet Uncategorized Veterinary Surgery Keep In Touch Contact Us Wellness Plans Select Wellness Plans Adult Dog Wellness Plans Dog Life Stage Wellness Plans Cat Wellness Plans Birds - Avian Pet Wellness Plan Reptile - Exotic Pet Wellness Plans Mammals - Exotic Pet Wellness Plans Rabbit Ferret Primates Guinea_pig Sugar_glider Chinchilla Pot_bellied_pig Hamster Hedgehog Prairie_dog Rat Reach Us Call Us: 281-332-5612 Email: frontdesk@safarivet.com Location: 2402 Marina Bay Dr, League City, TX 77573, USA Get in Touch League City: 281-332-5612 Pearland: 346-688-7678 frontdesk@safarivet.com 801-303-7066 Contact Us SafariVet – Pearland SafariVet – League City SafariVet – Pearland SafariVet – League City MENU MENU About Us Contact Us Apply Now Our Team Blog Reviews Terms of Use Wellness Plans Copyright © 2025 Safari Veterinary Care Centers Designed by WebCodeGenie Technology PVT LTD Contact Us League City: 281-332-5612 Pearland: 346-688-7678 CALL US Contact Us Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Help Help Feedback Feedback"
    },
    {
      "url": "https://www.safari.com/contact",
      "text": "Contact us - your perfect African safari awaits DESTINATIONS TOPÂ DESTINATIONS Cape Town Kenya Kruger National Park Masai Mara Sabi Sands Game Reserve Victoria Falls EASTÂ AFRICA Kenya Nairobi Ngorongoro Crater Rwanda Serengeti National Park Seychelles Tanzania Uganda Zanzibar SOUTHERNÂ AFRICA Botswana Eastern Cape Garden Route Madikwe & Pilanesberg Mozambique Namibia Okavango Delta Victoria Falls Zambia EXPERIENCES HOLIDAY TYPES Big 5 Safaris Great Migration Gorilla & Chimp Trekking Luxury Safaris Honeymoon Safaris Family Safaris Bush & Beach Safaris Walking Safaris Photographic Safaris Hot Air Ballooning Tours & Safaris Luxury Rail Journeys BLOG TESTIMONIALS CONTACT US ABOUT US Why travel with us Our Story Contact us FAQ Testimonials Financial Protection Community & Conservation Meet the Team Awards Partner with us Start Planning Chat now on WhatsApp Menu Find us LEARNÂ HOW |Â Connect your Google map + Contact us 1-888-SAFARIS â Toll-free in the US and Canada ( International: +27218797476 ) EMAIL helpmeplan@safari.com WHATSAPP Click here to chat on WhatsApp Social BLOG click here TESTIMONIALS click here Office ADDRESS Watershed, 17 Dock Road, Victoria & Alfred Waterfront, Cape Town OFFICEÂ HOURS 8am - 10pm (GMT+2) Though our consultants are often available outside of these hours! Planning a safari can be overwhelming, but with our expertise across 11 African countries, we make it effortless. Our specialists help you narrow down the options to create your perfect itineraryâwhether itâs a curated package or a fully bespoke journey. From flights and accommodation to activities and travel insurance, we take care of everything. â And weâre with you every step of the wayâbefore, during, and after your tripâto ensure a seamless and unforgettable safari experience. Start Planning Your Safari You can also call on 1-888-SAFARIS (Toll-free in the U.S. & Canada) THANK YOUÂ FORÂ YOURÂ ENQUIRY Our team has received your request and will be in touch shortly to assist you with your safari planning. If you need immediate assistance, call us at 1-888-SAFARIS or contact us on WhatsApp . Oops! Something went wrong while submitting the form. Customer Testimonials Trustpilot A Curated Collection of Africa's Finest Crafting your journey from a curated portfolio of Africa's 500+ finest lodges and operators. VIPÂ service Your own personal travel assistant 19 years in business Attention to every detail Relationships with 500+ operators through Africa Consultants available 24/7 58,000+ customers and counting Read more Contact a safari expert now 1-888-SAFARIS Toll-free for callers in the U.S. and Canada. International: +27 21 879 7476 Or chat to us onÂ WhatsApp: Â WhatsApp Signature safaris 5 day Sabi Sands 3 day Kapama fly-in 3 day Masai Mara explorer 7 day Iconic Cape TownÂ &Â Kruger 6 day MigrationÂ Safari 5 day GreaterÂ Kruger, Simbavati About us Contact us Why travel with us Awards Ethical wildlife policy Community & Conservation FAQ Our story Meet the team Careers Traveler reviews Africa's Leading Safari Company 2025 Join Our Affiliate Program Blog Blog home Top 10 Southern African Safaris Top 10 Lodges in Kruger Park Top 10 Okavango Lodges Top 10 Lodges in the Sabi Sands Top 10 Migration Lodges Gorilla Trekking What does a safari cost in Africa Best value for money lodges in Africa Safety tips for traveling in Africa How to choose a trusted operator Social Facebook Instagram LinkedIn YouTube You are the Journey Voted Africa's Leading Safari Company 2024 &Â 2025 in the World Travel Awards . Watershed, 17 Dock Road, Victoria &Â Alfred Waterfront, Cape Town Southern Africa Tourism Services Association (SATSA) â Member No. #1680 African Travel & Tourism Association (ATTA) â Member No. #206430 Terms of Use | Privacy Policy | Cookie Policy Copyright Â© SAFARI.com 2006 - 2025. All rights reserved."
    },
    {
      "url": "https://www.wildernessdestinations.com",
      "text": "Wilderness | Award-Winning Luxury African Safaris You need to enable JavaScript to run this app. Menu Enquire Now Destinations Camps Regions Experiences Journeys Exclusive offers Impact Journal About Wilderness Botswana Kenya Namibia Rwanda South Africa Tanzania Types of Safari Zambia Zimbabwe Botswana Kenya Namibia Rwanda South Africa Tanzania Zambia Zimbabwe Popular Camps Wilderness Bisate Lodge Volcanoes, Rwanda Wilderness Mombo Okavango Delta, Botswana Little Kulala Sossusvlei, Namibia Usawa Serengeti Serengeti, Tanzania DumaTau Camp Linyanti, Botswana Linkwasha Hwange, Zimbabwe Jao Okavango Delta, Botswana Bisate Lodge Mombo Camp Little Kulala Usawa Camp DumaTau Camp Linkwasha Camp Jao Camp Botswana Linyanti Mababe Okavango Delta Kenya Masai Mara Namibia Damaraland Kunene Sossusvlei Rwanda Akagera Volcanoes South Africa Cape Peninsula Culture & food The Cape Winelands Tanzania Serengeti Zambia Kafue Mosi-oa-Tunya Zimbabwe Hwange Mana Pools Safari Gorilla Trekking Game Drives Guided Quad Biking Rhino Tracking Helicopter Safari Star Beds Night Game Drives Boat Safari Wellness Guided Walking Safaris Nature Walks Desert E-biking Culture & Impact Local Culture Conservation Experience Journey inspiration Tailor-made Journeys Family Journeys Group Journeys Solo Journeys Couples Journeys Journey planning Our Services About Wilderness Our awards Our story Our partnerships The Wilderness Family Press room Enquire Destinations Camps Regions Experiences Journeys Exclusive offers Impact Journal About Wilderness Search Welcome to Wilderness Wilderness takes you on an unrivalled journey through a collection of the world’s most iconic wild destinations. 19.2228° S, 22.7779° E Wilderness takes you on an unrivalled journey through a collection of the world’s most iconic wild destinations. WE ARE WILDERNESS Discover Earth's ultimate, untamed places Discover Earth's ultimate, untamed places As the world’s leading conservation and hospitality company, we are the proud custodians of our planet's most significant wild places, each chosen to be part of our Collection for a specific purpose and all linked to protecting the land and life that exists there. Our destinations are vast, remote and untamed, and represent true wilderness. With access to over 6 million acres of private land, we offer intimate wildlife encounters and experiences that will leave you changed forever. #WEAREWILDERNESS #WEAREWILDERNESS Our Iconic Destinations We operate in 8 African countries, with 60+ camps promising exclusive, private wild game viewing, unrivalled style, comfort and a range of activities for a full immersion in nature and local culture. Discover our ultimate safari guide Botswana Zambia Rwanda Namibia Zimbabwe Kenya South Africa Tanzania Botswana Heed the call of the wild on an exclusive Botswana safari. Explore astonishing landscapes in the pristine wilderness areas of the Okavango Delta, and game-rich Linyanti and Mababe. Botswana Zambia From the mighty Victoria Falls to safaris in the remote wilds of Busanga Plains in Kafue National Park, endless adventure awaits in Zambia. Zambia Rwanda An increasingly rare wilderness and a land of staggering beauty, Rwanda is home to half the world’s mountain gorillas and a vast savannah teeming with iconic wildlife. Rwanda Namibia The wild Skeleton Coast. Sossusvlei’s ancient dunes. Endless horizons in Damaraland. Dramatic Namibia is a photographer's dream. Namibia Zimbabwe Zimbabwe’s quintessential safari experience awaits with adventure, spectacular sights, and thrilling wildlife encounters. Zimbabwe Kenya Home of the original East African safari, Kenya beckons with iconic wildlife and fascinating cultures, as well as one of nature’s greatest wild spectacles – the Great Wildebeest Migration. Kenya South Africa A melting pot of cultures, history, breath-taking landscapes, and abundant wildlife. There's nowhere quite like South Africa. South Africa Tanzania From Mount Kilimanjaro’s iconic snow-capped peak, to the endless plains of the Serengeti and the Great Migration, Tanzania is spellbinding. Tanzania Botswana Zambia Rwanda Namibia Zimbabwe Kenya South Africa Tanzania Camps Wilderness owns over 60 luxury and immersive camps throughout Africa Countries Offering impactful travel in a range of the finest destinations in Africa Private Exclusive access to some 2.3 million hectares of Africa’s best wildlife areas Bespoke We offer complete, tailor-made DMC services and full itineraries Community Activities allow guests to immerse themselves in various cultures and customs Plan your safari Our custom-designed journeys Tailor-made itineraries for every traveller We’re excited to take you on a journey to experience sights and sounds found nowhere else on Earth. Unique scenery, wildlife, and cultures are waiting to be revealed, and we at Wilderness can’t wait to share them with you. Our custom-designed journeys are intended to inspire but can be tailor made to suit your every need. It’s time to let your safari dreams run wild. EXPLORE OUR JOURNEYS OUR EXPERIENCES Experience real, raw nature Travelling is about more than the places you visit and the things you’ll see. It’s about people, culture, wildlife, history, and experiencing something you’ve never done before. With Wilderness you’ll walk, boat, barge, float, fly, drive, ride, trek, track and discover a world of adventures. Explore All Experiences 01 / 07 Game drives Get closer to thrilling wildlife interactions and see creatures big and small on morning and afternoon game drives. Game Drives Botswana, Tanzania, Rwanda, Zimbabwe, Zambia Mokoro Explore Botswana’s Okavango Delta on a mokoro, gliding along peacefully, revealing the wild secrets of the channels. Mokoro Botswana Hot air ballooning Be a bird for an hour or so. Fly high in a hot-air balloon for an unparalleled perspective on the wildlife and landscape below. Hot Air Ballooning Namibia & Tanzania Star Beds Sleep out under the African night sky with our Star Bed experience. Nothing is quite as thrilling or as romantic on safari. Star Beds Botswana, Namibia, Zimbabwe Guided walking safaris Slow down and pay attention to the smaller details of the safari experience on a walking safari with our professional guides. Guided Walking Safaris Botswana, Namibia, Tanzania, Zimbabwe, Zambia Hides Is there anything more thrilling? Observing wildlife just inches away, from the safety of our strategically placed hides. Hides Botswana, Zimbabwe Conservation experiences Rewild. Protect. Conserve. Wilderness combines unforgettable wildlife encounters with positive impact experiences. Conservation Experience Botswana, Namibia, Rwanda, Zambia, Zimbabwe TRAVEL WITH PURPOSE Why travel with Wilderness? Our accommodation is both luxurious and authentic. We promise unrivalled comfort and exclusivity while staying true to the vibrant soul and spirit of each, unique destination. Our private game viewing areas have limits on guest numbers, meaning fewer vehicles and people, with more intimate and up-close encounters with wildlife in their natural habitat. DESTINATIONS Wildlife Guides architecture Culture TRAVEL impact Iconic wild destinations By being one of the first in each place we operate, we have access to Earth’s most significant wild places. Each Wilderness destination offers a whole new world of environments, habitats, cultures, sights and sounds for you to discover. Join us as you explore our Collection of diverse and varied safari experiences. Best wildlife experiences Ready yourself for a true wilderness immersion - untamed, unfenced and unpredictable. Go beyond game drives and discover nature on walks, boats, hot air balloons and more. While thrilling wildlife encounters are guaranteed, education is central to the Wilderness experience. Here in the habitats of wild animals, we stay respectful of their space, keeping your safety our top priority. Industry-leading guides Meet guides with an uncommon ability for understanding, finding and explaining wildlife. Our guides are encouraged to hone their interests to answer any need, quirk or obsession. So whether you’re a family, photographer, big-cat enthusiast or avid birder, you’ll find a guide to relate. We also hire locally, benefiting the communities we operate in and providing the best knowledge of the wild. Immersive architecture Camps shouldn’t just be beautiful. They should gently immerse us in nature, unlocking all senses. Our placement of camps is an exact science, offering wildlife experiences that are as exceptional from your deck as on a game drive. With no more than 12 suites per camp, spread over hundreds of acres, and built using the lightest possible footprint, we enjoy our areas peacefully and respectfully. Cultural exploration Each camp honours its area's cultures and traditions. Over 90% of staff come from local villages, sharing their history and cultures with guests of all ages. Elevated traditional dishes make mealtimes exciting, while textiles and art are also sourced from communities. Some of our destinations also offer the opportunity to further immerse yourself in nearby villages and ongoing research projects. Seamless trusted travel We’ve been trusted by guests across the globe to create safe travel adventures since 1983. Our industry-leading safety and logistics support, Wilderness24, gives you instant on-the-ground assistance for anything and everything that might arise. And our private charter airline Wilderness Air will get you to our remote camps safely. Talk to our experts about putting together your dream journey. Shared impact We were among the pioneers of conservation hospitality, with the two halves of our business feeding in to one significant whole. On the one hand, we invite guests to experience life-changing moments in nature. On the other, we’re committed to doubling the wilderness we help protect by 2030 – all thanks to our three core impact pillars: Educate, Empower, and Protect. DESTINATIONS Iconic wild destinations By being one of the first in each place we operate, we have access to Earth’s most significant wild places. Each Wilderness destination offers a whole new world of environments, habitats, cultures, sights and sounds for you to discover. Join us as you explore our Collection of diverse and varied safari experiences. Wildlife Best wildlife experiences Ready yourself for a true wilderness immersion - untamed, unfenced and unpredictable. Go beyond game drives and discover nature on walks, boats, hot air balloons and more. While thrilling wildlife encounters are guaranteed, education is central to the Wilderness experience. Here in the habitats of wild animals, we stay respectful of their space, keeping your safety our top priority. Guides Industry-leading guides Meet guides with an uncommon ability for understanding, finding and explaining wildlife. Our guides are encouraged to hone their interests to answer any need, quirk or obsession. So whether you’re a family, photographer, big-cat enthusiast or avid birder, you’ll find a guide to relate. We also hire locally, benefiting the communities we operate in and providing the best knowledge of the wild. architecture Immersive architecture Camps shouldn’t just be beautiful. They should gently immerse us in nature, unlocking all senses. Our placement of camps is an exact science, offering wildlife experiences that are as exceptional from your deck as on a game drive. With no more than 12 suites per camp, spread over hundreds of acres, and built using the lightest possible footprint, we enjoy our areas peacefully and respectfully. Culture Cultural exploration Each camp honours its area's cultures and traditions. Over 90% of staff come from local villages, sharing their history and cultures with guests of all ages. Elevated traditional dishes make mealtimes exciting, while textiles and art are also sourced from communities. Some of our destinations also offer the opportunity to further immerse yourself in nearby villages and ongoing research projects. TRAVEL Seamless trusted travel We’ve been trusted by guests across the globe to create safe travel adventures since 1983. Our industry-leading safety and logistics support, Wilderness24, gives you instant on-the-ground assistance for anything and everything that might arise. And our private charter airline Wilderness Air will get you to our remote camps safely. Talk to our experts about putting together your dream journey. impact Shared impact We were among the pioneers of conservation hospitality, with the two halves of our business feeding in to one significant whole. On the one hand, we invite guests to experience life-changing moments in nature. On the other, we’re committed to doubling the wilderness we help protect by 2030 – all thanks to our three core impact pillars: Educate, Empower, and Protect. Our impact ethos Our journeys change lives. Not just yours, but also those of our staff, communities, and the ecosystems we impact. We help restore wilderness through low-volume high-value conservation tourism. Our Impact strategy is to educate, empower and protect communities and wildlife, together with our guests, partners, donors, governments, and researchers. Our model is responsible, sustainable, inspiring. Read about our Impact Two brands. One purpose. It’s wild out there. Go prepared. To celebrate the planet and its people with a range of gear inspired by nature and made from waste. \nWilderness & Sealand.\nFrom surf to safari. From mountains to marsh lands.\nThe urban wilderness just got more conscious.\nGear up with this limited edition collection available in a variety of sizes and three distinct colour ways to suit every kind of wild. Gear up Let’s plan your next journey Ready? When we say we’re there every step of the way, we mean it, literally. From planning the perfect circuit, to private inter-camp transfers on Wilderness Air, and easing you through Customs. We’re with you on the ground, at your side, 24-7, from start to finish. Ready to take the road less travelled? Contact our Travel Designers to plan an unforgettable journey. Enquire now Need some inspiration? Be inspired by the latest news from Wilderness. Subscribe to our newsletter. First name Surname Email Address Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahrain Bahamas Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Côte d'Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Country of residence Submit About Wilderness About Impact Journal Careers Contact Destinations Botswana Namibia Rwanda Zambia Zimbabwe Journeys & Services Our Journeys Journey Inspiration Our Services Wilderness Store African Safaris Disclaimer Privacy Policy Sitemap LLM usage guidelines Copyright ©2025 Wilderness. All rights reserved."
    },
    {
      "url": "https://laltoday.6amcity.com/safari-wilderness-ranch-lakeland-fl",
      "text": "Safari Wilderness Ranch in Lakeland, FL - LALtoday Topics Business City Culture Events Food History Real Estate Sports Travel and Outdoors Wellness City Guides Live Work Experience Events Jobs Games The Buy Advertise instagram facebook linkedin Menu Topics Business City Culture Events Food History Real Estate Sports Travel and Outdoors Wellness City Guides Live Work Experience Events Jobs Games The Buy Advertise instagram facebook linkedin Search Query Submit Search Show Search Support Us Button Widget Support Us ☕️ Buy us a coffee 🤝 Advertise Culture Safari Wilderness Ranch in Lakeland, FL You don’t have to travel to Africa to see exotic wildlife on safari. Just visit Safari Wilderness Ranch in Lakeland, FL. August 22, 2022 • Jessalin Heins-Nagamoto Facebook Twitter Nextdoor Email Copy Link copied Did you know zebras are your neighbors here in Lakeland? Photo by @linalunamar Ever wanted to take a safari trip to Africa? Put down your passport — adventure is right here in our backyard . Located at 10850 Moore Rd . (off exit 38), Safari Wilderness Ranch offers all the encounters and adventure of an African safari without having to leave Swan City. What is it? First off , here’s what it’s not: It’s not a zoo or theme park . Instead, it’s a guided tour that allows you to experience 260 + acres of pristine wilderness . You can choose from several adventures including: Vehicle safaris | $119 per person | Ride under a truck canopy to see unique and endangered species in large herds. ATV safaris | $239 per person | For a more rugged adventure, cruise around in a quiet and fuel efficient Honda ATV + feed an eland or waterbuck herd. Camel expedition | $239 per person | Join wildlife in their natural state as you ride atop a dromedary or Bactrian camel. Kayak safari | $239 per person | Navigate freshwater areas for close-up encounters with wetland species before hand feeding lemurs and touring the small mammal night house. Safari camping | Pricing varies | Extend your stay by sleeping in the bush, so to speak . Each tent is situated on a wooden deck and has a panoramic view of the animal herds. Choose your own adventure to see animals up close + personal. Photo by @linalunamar What wildlife can you see? Different tours provide different encounters, but you can generally expect to encounter a variety of wildlife including scimitar-horned oryx (which are extinct in Africa) and one of the largest herds of Defassa Waterbuck in the country . You can also spot: Zebras Watusi cattle Lemurs Llamas Ostriches Fainting goats, and… Well, there’s too much to list . You’ll just have to see them for yourself. Facebook Twitter Nextdoor Email Copy Link copied The Buy Home Why we like the Dyson V12 Cordless Vacuum — plus, a coupon code for HSN September 7, 2025 · Sarah Leonhardt The Buy Pilates gear that make a big difference in your workout September 4, 2025 · Victoria Bardega Home Cozy fall essentials from Home Shopping Network to refresh your home on a budget August 28, 2025 · Staff Shop The Buy More from LALtoday New to Lakeland How to give back and volunteer in Lakeland This list of volunteer opportunities in Lakeland includes everything from packing food for children in need to fostering pets. September 10, 2025 · Staff Food Dine on history at Lakeland’s oldest restaurants Take a bite of Lakeland’s past at these restaurants that have stood the test of time. September 9, 2025 · Connor Jacobson Travel and Outdoors Meet 5 prehistoric creatures who once roamed Polk County Millions of years ago, marine animals, mammals, and reptiles called Florida home. Learn about five whose fossils have been found in the Bone Valley area of Polk County. September 8, 2025 · Connor Jacobson Weather Fall weather forecast for Lakeland Prepare for fall weather in Lakeland, Florida with these seasonal temperature and precipitation outlooks. September 8, 2025 · Staff New to Lakeland How to find a new doctor in Lakeland This city boasts top-ranked medical providers and specialty services. Our comprehensive guide will help you find the care you need — whether you’re new to town or just looking around. September 4, 2025 · Victoria Bardega Work What you need to know about flying out of Lakeland Linder International Airport We’re here to make your flying process plane and simple. September 3, 2025 · Staff 4 Spirit Halloween stores come to the Lakeland area The store finds vacant retail spaces and signs temporary leases to set up shop leading up to Halloween — but locations can change each year. September 2, 2025 · Michael Beausoleil City Lakeland library features you didn’t know existed Check out a book, then check out these unique library features that cardholders can enjoy. September 2, 2025 · Connor Jacobson Events Stack your calendar with monthly events around Lakeland These events bring together your favorite vendors on the same day each month in nearby downtown areas and historic districts. August 28, 2025 · Connor Jacobson City Top Clicks: Here’s what you loved in LALtoday last month We keep an eye on your clicks to make sure LALtoday is always filled with content you love. August 28, 2025 · Danielle Johnson Resources Subscribe Advertise Newsletter Archive About Us Careers Contact Us Legal Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility © 6AM City Inc. 2025. All rights reserved. twitter instagram facebook linkedin"
    },
    {
      "url": "https://wildlifesafari.net/",
      "text": "Wildlife Safari Skip to content Make A Donation Today! Things To Do Things To Do Tickets Prices & Hours Memberships Gift Shop Animal Artwork Safari Map Safari Village Animal Encounters Accessibility Frequently Asked Questions Events & Rentals Events & Rentals Upcoming Events Rentals Youth Programs Youth Programs Camps Junior Zookeepers Field Trips Support Support Donate Cheetah Program Sponsor Adopt An Animal Safari Projects Memorials & Dedication Planned Giving Drive Thru Safari Tickets Drive Thru Safari Tickets Family Bundle Individual Tickets Log in X (Twitter) Facebook Instagram TikTok Things To Do Tickets Prices & Hours Memberships Gift Shop Animal Artwork Safari Map Safari Village Animal Encounters Accessibility Frequently Asked Questions Events & Rentals Upcoming Events Rentals Youth Programs Camps Junior Zookeepers Field Trips Support Donate Cheetah Program Sponsor Adopt An Animal Safari Projects Memorials & Dedication Planned Giving Drive Thru Safari Tickets Family Bundle Individual Tickets Search Log in Cart Item added to your cart View cart Check out Continue shopping Safari News Keep up to date with the most recent Safari happenings here! Our current hours are 9:00am – 6:00pm for the Drive Thru and Safari Village. Upcoming Events Boos & Brews - October 18th Zoobilee- October 24th, 25th, 26th Learn more about these events here Youth Programs Fall and Winter camp Registrations are OPEN! Check out this and other kids programs on our Camps Page. Bring the Safari Home with You! Looking for the perfect gift for the animal enthusiast in your life or want to treat yourself? We have some options we think are perfect! Check our our gift shop during your visit and make sure to stop by the animal artwork section! Amazon for the Animals Check out our Amazon Wishlist and get a present for your favorite animal. New Arrivals! We’re thrilled to announce the arrival of our new African Painted Dogs, Backslash, Tex, and Spot! These 9 year old, male pack members came to us from the Oklahoma City Zoo! You can find these beautiful canines next to our lions in the lion loop. Fun Fact: African Painted Dogs are known for their strong social bonds and dynamic pack behavior, making them an exciting and important addition to the park’s conservation-focused mission. Open Daily Open Seven Days a Week: 9:00am to 6:00pm Closed Only on Thanksgiving Day and Christmas Day Phone: (541) 679-6761 Email: guestservices@wildlifesafari.net 1790 Safari Road PO Box 1600 Winston, Oregon | 97496 About Wildlife Safari History & Mission Conservation Join Our Team Internships Volunteer Contact Us Subscribe to our emails Email Facebook Instagram TikTok X (Twitter) Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard Visa © 2025, Wildlife Safari Powered by Shopify Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://www.wildernessdestinations.com/journal/our-collective/the-safari-dream-team-40-years-of-wilderness",
      "text": "Wilderness staff celebrate 40 years of safaris You need to enable JavaScript to run this app. Menu Enquire Now Destinations Camps Regions Experiences Journeys Exclusive offers Impact Journal About Wilderness Botswana Kenya Namibia Rwanda South Africa Tanzania Types of Safari Zambia Zimbabwe Botswana Kenya Namibia Rwanda South Africa Tanzania Zambia Zimbabwe Popular Camps Wilderness Bisate Lodge Volcanoes, Rwanda Wilderness Mombo Okavango Delta, Botswana Little Kulala Sossusvlei, Namibia Usawa Serengeti Serengeti, Tanzania DumaTau Camp Linyanti, Botswana Linkwasha Hwange, Zimbabwe Jao Okavango Delta, Botswana Bisate Lodge Mombo Camp Little Kulala Usawa Camp DumaTau Camp Linkwasha Camp Jao Camp Botswana Linyanti Mababe Okavango Delta Kenya Masai Mara Namibia Damaraland Kunene Sossusvlei Rwanda Akagera Volcanoes South Africa Cape Peninsula Culture & food The Cape Winelands Tanzania Serengeti Zambia Kafue Mosi-oa-Tunya Zimbabwe Hwange Mana Pools Safari Gorilla Trekking Game Drives Guided Quad Biking Rhino Tracking Helicopter Safari Star Beds Night Game Drives Boat Safari Wellness Guided Walking Safaris Nature Walks Desert E-biking Culture & Impact Local Culture Conservation Experience Journey inspiration Tailor-made Journeys Family Journeys Group Journeys Solo Journeys Couples Journeys Journey planning Our Services About Wilderness Our awards Our story Our partnerships The Wilderness Family Press room Enquire Destinations Camps Regions Experiences Journeys Exclusive offers Impact Journal About Wilderness Search Africa The safari dream team: 40 years of Wilderness Our Collective Janine Avery 11/20/2023 Home Journal Our Collective The safari dream team: 40 years of Wilderness Four decades of creating unforgettable safaris It's a remarkable milestone for Wilderness, and as we celebrate this achievement, we reflect on the amazing journey that has brought us to where we are today. Over the past 40 years, we've been fortunate to share the beauty and wonder of the African wilderness with countless travellers from all corners of the globe. But behind the scenes, it's our team of employees who have made this journey possible. Join us as we take a moment to appreciate the hard work, passion, and dedication of our team members – and hear from some of them about what it means to work here and their hopes for the future. The future ahead of us is unlimited The future ahead of us is unlimited “The Wilderness Way is a passion. It’s a culture. A living organism. A moving animal. With a respect for wildlife and the people. I have the great privilege and honour of leading an incredible group of very gifted and talented passionate people, and an incredible business. We all know that helping save the planet and its wild areas is really what is going to save mankind in the future. I’m very proud that we as a business are going down that road. That’s what drives me on a day-to-day basis. The future ahead of us is unlimited”. – Keith Vincent, Wilderness Chief Executive Officer. Keith Vincent Keith Vincent “Wilderness celebrating 40 years is certainly a momentous occasion, made all the more personal for us since we met while we were both working for Wilderness in Namibia in 1990 – 33 years ago. In 1991 we moved to Botswana and in those days Wilderness had only two camps in the Okavango, one of which was Wilderness Mombo, which we managed. In the early days things were simple and adventurous, but the ethos of protecting the environment, conservation, looking after our staff and creating memorable experiences for our guests was already a solid foundation that bonded us all. The friends we made during those times have lasted a lifetime and our experiences made us realise how fortunate we were to be living and working in such an amazing environment and having the opportunity to make a difference in people’s lives. \"In 1997, in partnership with Wilderness, we opened Chitabe and Chitabe Lediba camps, and have been operational ever since. Wilderness has played a big role in our lives and even though so much has changed in the last 40 years, the core values and guiding principles are still the same. From all of us at Chitabe and Chitabe Lediba, we would like to wish Wilderness a very Happy 40th Birthday, may you continue to lead the industry with integrity and innovation and to instil in all of us the enduring hope for a bright future”. – Helene and Dave Hamman, owners of Wilderness Chitabe and Chitabe Lediba, Botswana. Dave and Helene Hamman “I have probably been with Wilderness since birth. My mom was one of the first eight employees at Wilderness with my dad joining in the 90s, and I’ve had an awesome upbringing seeing Wilderness grow. I wouldn’t change anything for that experience. What I love is the staff – but of course, the main thing we do is help protect these wild places. And you can see how the wildlife has boomed in the various regions where we operate. You can see the results. To me, that is what makes it so special. I do believe Wilderness is a pioneer. A trendsetter. We set the benchmark. We lead the way. For a shared purpose of protecting what we all love. But what we did in 40, let’s see if we can do it in 10, or less. Let’s push ourselves. Let’s double what we can protect. We have a great opportunity here. To leave an everlasting footprint of conservation and community. I’m very excited to see what we can do in the next 40 years”. – Scott Vincent, Sales Director and Head of Wilderness Direct, London. Life begins at 40 Neuman Vasco “This company that has held steadfast to its commitment of protecting the Earth's fauna and flora – its purpose – for 40 years! I am humbled to have been a part of this journey for the past 13-odd years, and look forward to many more years of impact to come. For me, it’s the people, the like-minded individuals who have walked the path with Wilderness. It is through us that impact reverberates for miles across land and ocean, moving small rocks and tall mountains. There’s an old saying that life begins at 40. Well, we at Wilderness are realising life has just began, and all we have achieved in the past 40 years has been preparation for further discovery and a greater sustainability footprint across the globe. We all celebrate our own Wilderness story this month, a story that has changed lives since 1983. The journey is worth a sequel!” – Neuman Vasco​, Wilderness Concession Manager, Botswana. “Having the privilege to have worked for Wilderness for 18 years I have seen some of the evolution of this company, the highs, the lows and the in-betweens. Good people have joined, good people have left, great people have stayed and what always stands out to me, no matter what we are going through, is the ability to be authentic, dedicated and passionate about what we do, while keeping our focus on our why as our beacon, our truth. The true essence of Wilderness is definitely our culture, or what I call our fairy dust, and our ability to demonstrate courage by continuously charting new paths for the industry. At the end of the day, no matter how hard things have been or how well we have done, Wilderness people always have a way of putting that all aside and having loads of fun as colleagues and friends. \"This is the true spirit of our pioneering collective and I love it! Congratulations Wilderness on this big occasion. May the journey of success continue for the team, our stakeholders and our beautiful planet”. – Alexandra Margull​, Wilderness Chief Operating Officer. “Wilderness is not just a company; it is a movement, a force for positive change, and a symbol of environmental stewardship. It symbolises a commitment to conserving the environment and promoting sustainable tourism. The smiles of the staff are a universal language, instantly making you feel at home from the very first moment. They are not just employees; they are stewards of a profound purpose. The pride I feel as part of this exceptional company is genuinely heart-warming. It's about understanding the impact each of us can have, one day at a time. It's a human experience, one that connects us to the world we live in and the incredible beings that share it with us”.  – Jason Glanville​, Environmental & Marketing Content Manager, Wilderness Rwanda. Jason Glanville We are proud to be part of a remarkable journey Cathy Kays & Family “Turning 40 is a significant milestone representing four decades of hard work, dedication and success and is a testament to the enduring strength, resilience, and vision of Wilderness. Throughout the years Wilderness has consistently demonstrated its commitment to conservation, excellence, innovation, and guest satisfaction. We have partnered with Wilderness for 24 of these 40 years, sharing many happy and momentous occasions. We value the memories we have created and the achievements we have accomplished together. We are proud to have been part of such a remarkable journey. Congratulations on reaching this remarkable milestone and we wish you continued success. May this anniversary serve as a reminder of the past achievements and as a source of inspiration for the future endeavours that lie ahead”. – Cathy Kays, Co-owner Wilderness Jao Reserve. Wilderness talks a lot about community but when I actually came to King’s Pool, I realised it’s not just community, it’s actually family. \"You can see it in the people. The way we laugh with each other, the way we talk and interact. We’re a big family that is compassionate and driven. It’s beautiful.” - Aicha Phiri, Waitress at Wilderness King’s Pool. Aicha Phiri “My journey of 17 years working at Wilderness started in a one-roomed office in Lusaka as a mechanic/driver. I saw the construction of all the Kafue camps and I was given a great chance – to transform from a mechanic to finally being the Zambian Field Operations Manager. I have also seen the transformation from using HF radios to communicate, to satellite phones, to the internet, and how these simpler methods of communications have changed bush life and brought us closer to people. We as Wilderness have played a major role in contributing to the dissemination of information and how a carbon footprint affects the areas we operate in. Every day that I wake up in the middle of the wilderness with birds singing at 04:30 and getting louder as the sun brightens, the more I realise how lucky I am to be part of this great family. It’s been a life-changing experience. I celebrate 40 years of Wilderness proudly.\" I have gained a lot of knowledge which has been passed on to the next generation to keep the Wilderness flag flying high, and I say thank you to Wilderness for what it has done for my life and my children. – Arnold Mulimba, Wilderness Zambia Field Operations Manager. Arnold Mulimba and Shumba staff “I’m very proud to be part of this organisation. Looking back on the successes of the last 40 years, I think it shows that we’re in a really good place to go forward and take what we’ve learned, to come up with something that pushes the boundaries of how we view our planet and the beautiful natural habitats that it has. I believe we’re in a prime position to be at the forefront of that. To learn a lot, to give back a lot, and to really set the standard as to what a wildlife area can mean to people and how we look after it”. – Iain McConachie, North America Retail Manager. Untamed, Untouched Wilderness “Wilderness is a very passionate company and this rubs off on everyone who works here. I’ve learned a whole lot of new things. Not once did I ever think I would be wearing boots and khakis in the bush, but I’ve fallen so much in love with it. It has totally changed the way I think\". To wake up in an untamed, untouched place and connect with yourself and nature. It is totally priceless. Faith Moutloatse Wilderness Botswana Hospitality Trainer – Faith Moutloatse, Wilderness Botswana Hospitality Trainer Celebrating 40 years of Wilderness Thank you for getting us to where we are today. Here's to the next 40 years of exploration, conservation, and unforgettable experiences! Our journey is far from over, and we invite you to join us for the next chapter of our great adventure. 01 / 05 More to discover Embark on another journey through Earth's ultimate, untamed places. These stories capture the raw beauty, passionate conservation efforts, and unique experiences that define Wilderness. We've handpicked these articles to deepen your connection with the wild and inspire your next adventure. Read them here 01 / 05 Beyond the Crossing: A better way to experience the Serengeti Discover a better way to experience the Mara River crossing with Wilderness Usawa—ethical guiding, m... Read more Lauren Dold 20.08.2025 The benefits of a Botswana green season safari Green season is a time of rejuvenation in Botswana’s wild areas. Learn more here about the benefits ... Read more Tao Varty 04.07.2025 The Hoanib – Linear Oasis of the Namib Ephemeral rivers are seasonal but sustain wildlife in dry area. Learn about Hoanib River formation. ... Read more Martin Benadie 30.06.2025 Spotlight on Mombo \"The Mother of all Camps\" There’s an unparalleled culture of seven-star hospitality where everyone knows your name. Read more Melissa  Siebert 19.06.2025 Spotlight On Linkwasha – Hwange National Park A contemporary safari camp in an iconic African landscape, Linkwasha sits on the edge of the renowne... Read more Tao Varty 09.06.2025 Let’s plan your next journey Ready? When we say we’re there every step of the way, we mean it, literally. From planning the perfect circuit, to private inter-camp transfers on Wilderness Air, and easing you through Customs. We’re with you on the ground, at your side, 24-7, from start to finish. Ready to take the road less travelled? Contact our Travel Designers to plan an unforgettable journey. Enquire now Need some inspiration? Be inspired by the latest news from Wilderness. Subscribe to our newsletter. First name Surname Email Address Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahrain Bahamas Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Côte d'Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Country of residence Submit About Wilderness About Impact Awards Contact Careers The Wilderness Family Journal Destinations Botswana Namibia Rwanda Zambia Zimbabwe Tanzania Kenya Journeys & Services Our Journeys Journey Inspiration Our Services Wilderness Store African Safaris Honeymoon Safari Luxury safaris in Botswana Disclaimer Privacy Policy Sitemap LLM usage guidelines Copyright ©2025 Wilderness. All rights reserved."
    },
    {
      "url": "https://africa-safari.com/about-us/",
      "text": "A company expert in safaris - Africa Safari Skip to content Click here to WhatsApp us! Call us info@paradise-wilderness.com FAQ Menu Safari itineraries Accommodation Africa Safari Arusha Book a room Africa Safari Lake Natron Book a room Africa Safari Maasai Boma Book a room Africa Safari Serengeti Ikoma Book a room Africa Safari Serengeti Kusini Book a room Africa Safari South Serengeti Book a room Africa Safari Karatu Book a room Africa Safari Rift Valley Book a room Africa Safari Manyara Escarpment Africa Safari Selous Book a room Africa Safari Nyerere Book a room Safari types Fly-in Safari Serengeti Fly-in & Drive Round Trip Classic Drive Safari Drive & Fly-Back Safari Beach & Safari Specials Migration Safari Spot the Big 5 Safari Round Trip Zanzibar Extension Beach & Safari Kilimanjaro and Mount Meru Wildlife areas Serengeti National Park Serengeti North & Mara River Serengeti Central & Seronera Area Ikona Wildlife Management Area (WMA) Ngorongoro Crater Lake Manyara National Park Jangwani Corridor Lake Natron Tarangire National Park Arusha National Park Nyerere National Park Serengeti South/Kusini Make an inquiry About us Contact Us Find your safari All Types Beach & Safari Holiday Classic Drive Safari Drive & Fly-Back Safari Fly-in & Drive Round Trip Fly-in Safari Serengeti All Durations 1 – 3 Days 10 – 12 Days 13 – 15 Days 4 – 6 Days 7 – 9 Days All Prices 0 – 500 USD 1600 – 2500 USD 2300 – 3500 USD 3000 – 4000 USD 500 – 1000 USD 900 – 2000 USD ABOUT US History, mission and vision One of the top tourism, accommodation, and safari businesses in Tanzania and Zanzibar is the Dutch family-owned Paradise and Wilderness. Bert and his wife Ana visited Tanzania and Zanzibar for a vacation a number of years ago, and they fell in love with both places right away. They understood that the legendary National Parks in Tanzania with their gorgeous surroundings and wildlife and Zanzibar Island's white sand beaches combined the best of both worlds and made for the ideal vacation. Knowing this, they made the decision to follow their ambition and began their entrepreneurial journey. The organization's mission is to have as many people as possible to appreciate Africa's beauty. The organisation's vision is to help Tanzania's local population by helping to create work opportunities. “Now, I am lucky enough to have five Beach Resorts, a Boutique Hotel and a private Island on Zanzibar a Safari Lodge in the Selous GR (Nyerere National Park) and several more Safari Lodges located near or in world’s most famous National Parks: Serengeti Ikoma, Serengeti Klein's Gate, Ngorongoro, Tarangire, Lake Natron, Lake Manyara, Kilimanjaro and Arusha.” Bert Schoonvelde (owner): “My holidays in Tanzania were too short to get to know this magical country, so I stayed here and made my dream my job!” One of the top tourism, accommodation, and safari organizations in Tanzania is the Paradise and Wilderness group, which is made up of various brands: Africa Safari Africa Safari is a specialist in planning fully-serviced safari holidays and runs its own lodges close to popular National Parks. Each of our lodges has distinctive features and is incorporated into the local environment and culture. Hotel Zanzibar Five resorts, a boutique hotel in Stone Town, and a private island belong to Hotel Zanzibar, which specializes in beach holidays in Zanzibar. Beach Safari Aviation Beach Safari Aviation arranges flights using our own airplanes from Tanzania and Zanzibar right into the heart of Tanzania's National Parks' game-rich regions. Now Safari Now Safari offers last minute tours from Zanzibar to Tanzania's renowned National Parks. The Paradise & Wilderness Foundation The Paradise & Wilderness Foundation was founded with the vision of giving back to the local communities through projects at local schools, in the hospitality industry, and for the environment. Paradise & Wilderness: Expert in safaris In Zanzibar and Northern Tanzania, we also provide transportation services in addition to safaris, accommodation, flights, and activities . Due to the fact that we do not use subcontractors, we can assure the quality of our services. We've created our tours so that you can fully immerse yourself in Tanzanian culture and traditions. We collaborate with regional experts who are enthusiastic about sharing their wisdom and personal experiences, ensuring that you have an in-depth understanding of the places you visit. Experience your holiday in style with all the service and luxury you can expect from Paradise & Wilderness. Contact us and let's start organising your dream holiday! Registered address: Paradise & Wilderness ltd PO Box 4107 Stone town, Zanzibar Group Director: Bert Schoonvelde (bert@paradise-wilderness.com) Contact details and phone numbers you will find on our website www.paradise-wilderness.com . Find your safari All Types Beach & Safari Holiday Classic Drive Safari Drive & Fly-Back Safari Fly-in & Drive Round Trip Fly-in Safari Serengeti All Durations 1 – 3 Days 10 – 12 Days 13 – 15 Days 4 – 6 Days 7 – 9 Days All Prices 0 – 500 USD 1600 – 2500 USD 2300 – 3500 USD 3000 – 4000 USD 500 – 1000 USD 900 – 2000 USD OUR ACCOMMODATIONS Tanzania: Africa Safari Arusha Africa Safari Lake Natron Africa Safari Maasai Boma Africa Safari Serengeti Kogatende Africa Safari Serengeti Ikoma Africa Safari Serengeti Kusini Africa Safari South Serengeti Africa Safari Karatu Africa Safari Rift Valley Africa Safari Kilimanjaro Africa Safari Selous Africa Safari Nyerere Africa Safari Saadani Zanzibar: Reef & Beach Resort Paradise Beach Resort Zanzibar Bay Resort Dream of Zanzibar Shaba Boutique Hotel OUR SAFARIS Fly-in Safari Serengeti Fly-in & Drive Round Trip Classic Drive Safari Drive & Fly-back Safari Enjoy Zanzibar: Mnemba Snorkelling Stone Town Tour Spice Farm Tour PARKS & GAME RESERVES Serengeti National Park Serengeti Northern area / Mara River Serengeti Central / Seronera Area Ikorongo Game Reserve Grumeti Game Reserve Ngorongoro Crater Lake Manyara National Park Jangwani Corridor Lake Natron Tarangire National Park Arusha National Park Selous Game Reserve (Nyerere National Park) Serengeti South/Kusini GENERAL About us Contact us: General information Booking department Financial department Marketing department Sales department Make an inquiry Download our brochures and price list from downloads page Terms & Conditions Privacy policy © 2025 Paradise & Wilderness - All Rights Reserved | Web Design by Eleven"
    },
    {
      "url": "https://www.wildernessdestinations.com/contact",
      "text": "Contact Us | Safari Contact Details | Wilderness You need to enable JavaScript to run this app. Menu Enquire Now Destinations Camps Regions Experiences Journeys Exclusive offers Impact Journal About Wilderness Botswana Kenya Namibia Rwanda South Africa Tanzania Types of Safari Zambia Zimbabwe Botswana Kenya Namibia Rwanda South Africa Tanzania Zambia Zimbabwe Popular Camps Wilderness Bisate Lodge Volcanoes, Rwanda Wilderness Mombo Okavango Delta, Botswana Little Kulala Sossusvlei, Namibia Usawa Serengeti Serengeti, Tanzania DumaTau Camp Linyanti, Botswana Linkwasha Hwange, Zimbabwe Jao Okavango Delta, Botswana Bisate Lodge Mombo Camp Little Kulala Usawa Camp DumaTau Camp Linkwasha Camp Jao Camp Botswana Linyanti Mababe Okavango Delta Kenya Masai Mara Namibia Damaraland Kunene Sossusvlei Rwanda Akagera Volcanoes South Africa Cape Peninsula Culture & food The Cape Winelands Tanzania Serengeti Zambia Kafue Mosi-oa-Tunya Zimbabwe Hwange Mana Pools Safari Gorilla Trekking Game Drives Guided Quad Biking Rhino Tracking Helicopter Safari Star Beds Night Game Drives Boat Safari Wellness Guided Walking Safaris Nature Walks Desert E-biking Culture & Impact Local Culture Conservation Experience Journey inspiration Tailor-made Journeys Family Journeys Group Journeys Solo Journeys Couples Journeys Journey planning Our Services About Wilderness Our awards Our story Our partnerships The Wilderness Family Press room Enquire Destinations Camps Regions Experiences Journeys Exclusive offers Impact Journal About Wilderness Search Get in touch Contact Enquire Missing the blaze of glory an African sunset delivers? Imagining what it would be like to trek with gorillas, walk with rhinos, photograph a leopard? Dreaming of an African safari, but don’t know where to start? Fill in your details on the enquiry form and we’ll tell you when, where, why and how to start planning the ultimate journey with Wilderness. Enquire Home Contact Johannesburg +27 11 257 5000\n\n\n\nMon-Fri 08:00 - 17:00 GMT+2 Cape Town +27 21 702 7500\n\nMon-Fri 08:00 - 17:00 GMT+2 Maun +267 686 0086\n\nMon-Fri 08:00 - 17:00 GMT+2 Gaborone +267 392 6886\n\nMon-Fri 08:00 - 17:00 GMT+2 Tanzania +255 684 15 3882 Mon-Fri 08:00 - 17:00 GMT+2 Email Contact details Other means to get in touch 01 Emergency After Hours (mobile) +27 82 576 9173 General enquiries [email protected] Press enquiries [email protected] Partnership enquiries [email protected] Careers Leadership. Dedication. Fun. Respect. The Wilderness family is made up of people from all walks of life, with a shared set of values and purpose at the heart of everything we do. Does that resonate with you? We invite you to join us on our journey to change lives through sustainable hospitality and conservation. Apply for a vacancy or send us your CV. Learn more Let’s plan your next journey Ready? When we say we’re there every step of the way, we mean it, literally. From planning the perfect circuit, to private inter-camp transfers on Wilderness Air, and easing you through Customs. We’re with you on the ground, at your side, 24-7, from start to finish. Ready to take the road less travelled? Contact our Travel Designers to plan an unforgettable journey. Enquire now Need some inspiration? Be inspired by the latest news from Wilderness. Subscribe to our newsletter. First name Surname Email Address Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahrain Bahamas Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Côte d'Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Country of residence Submit About Wilderness About Impact Awards Contact Careers The Wilderness Family Journal Destinations Botswana Namibia Rwanda Zambia Zimbabwe Tanzania Kenya Journeys & Services Our Journeys Journey Inspiration Our Services Wilderness Store African Safaris Honeymoon Safari Luxury safaris in Botswana Disclaimer Privacy Policy Sitemap LLM usage guidelines Copyright ©2025 Wilderness. All rights reserved."
    },
    {
      "url": "https://www.fox13news.com/news/safari-wilderness-is-piece-of-old-florida-that-offers-unique-adventures",
      "text": "Safari Wilderness Ranch is piece of old Florida that offers unique adventures | FOX 13 Tampa Bay News Weather Sports Good Day We Live Here Contests More Watch Live Expand / Collapse search ☰ Search site News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Rhythm Roots Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests Tampa Bay Reads Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us Safari Wilderness Ranch is piece of old Florida that offers unique adventures By FOX 13 News Staff Published April 14, 2024 11:22am EDT Lakeland FOX 13 News Share Copy Link Email Facebook Twitter LinkedIn Reddit Safari Wilderness Ranch in Lakeland Safari Wilderness Ranch has about 800 animals. All the experiences offered put visitors in the heart of where the herds of animals live and thrive. LAKELAND, Fla. - Nestled next to the Green Swamp is a ranch that is more like stepping into the wilds of Africa. Safari Wilderness Ranch is not a zoo, but it does have animals most people associate with one. It's not a ranch like a farmer's ranch, but is more like a range where wild animals live. READ: Robinson Preserve in Bradenton offers one of Florida's premier birding destinations \"We have about 800 animals here,\" Shared CEO and resident owner Lex Salisbury. \"They're all animals that do well in this climate and they thrive here, and you'll see them in big herds.\" The here is a piece of old Florida, still wild and untamed like it used to be. \"We're at Safari Wilderness now which is 260 acres in the Green Swamp in Florida,\" shared Salisbury. \"And the Green Swamp is the second-largest wilderness area after the Florida Everglades and this is the heart of the Florida Aquifer.\" \"There are five different ways you can see the place,\" shared Salisbury. \"You can see 'em on ATVs, you can see 'em on camel back safaris, you can go on vehicle tours, you can do drive-thru tours, and you can can go on kayak tours.\" READ: Jet cars can be driven on the water in Clearwater All of the experiences put the visitor in the heart of the open land where the herds of animals live and thrive. \"It's a different experience than going to a zoo,\" admitted Salisbury. \"I think it's a more real, richer thing.\" And he knows a bit about zoos, having worked in the business professionally before opening this adventure. \"Experiential learning is far more superior than lecturing people in school,\" said Salisbury of this ranch. \"If you can let people ride a camel, smell a camel, and feel a camel [then] the sense of smell and the sense of touch are emotional triggers that allow you to commit the experience to memory.\" Those memories are what keep people coming back. They are what inspire the next generation of animal lovers to support the conservation efforts of ventures like this. Safari Wilderness is located at 10850 Moore Road in Lakeland . To learn more about them and book your own visit, click here . SIGN UP: Click here to sign up for the FOX 13 daily newsletter WATCH FOX 13 NEWS Lakeland We Live Here Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . Trending Millions could lose SNAP benefits as stricter rules take effect PETA offers reward after dog abandoned 'like trash' on side of Hillsborough County road Sarasota's 'Sash and Sill' owner arrested for third time on two additional larceny charges Gibbs High School has the tallest wide receiver recruit in the country Potential Rays owner considering HCC as stadium site Latest headlines 6 shot at Tampa apartment complex, police searching for suspect Charlie Kirk shooting: Law enforcement asking for tips; search underway for gunman Cross Bay Ferry making a comeback after PSTA grant Colorado school shooting: Evergreen student shoots two others before himself, officials say Charlie Kirk shooting: What we know about the suspected gunman News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Rhythm Roots Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests Tampa Bay Reads Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us facebook twitter instagram youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs at FOX 13 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://tz.linkedin.com/company/kiriwe-travel-trekking-safaris-ltd?trk=similar-pages",
      "text": "Kiriwe Travel & Trekking Safaris Ltd | LinkedIn Skip to main content LinkedIn Articles People Learning Jobs Games Sign in Join now Kiriwe Travel & Trekking Safaris Ltd Travel Arrangements Arusha, Arusha 383 followers The Spot of Wilderness in East Africa Follow View all 3 employees Report this company About us Kiriwe Travel & Trekking Safaris Ltd experts in independent, tailor-made, wildlife safaris, beaches in Zanzibar. Photo tours, Cultural Programs and Mount Meru and Kilimanjaro Expeditions. \n\nSteppe Dogs Adventures Ltd  are specialists in unique small group tours, tailor-made journeys and with over 6 years of experience behind us, we believe that we’re the best at what we do.\n\nBe inspired by some of our recommended African safaris or by our wilderness and wildlife tours to incredible destinations across Tanzania Zanzibar & Kenya.\n\nEmails #1:  info@steppedogsadventures.com\nEmail #2:    frank@steppedogsadventures.com\nEmail #3:    swa.frank@gmail.com\nCall/Whats app:  +255788738494 \nSkype:   frank.swai1 Website https://kiriwetravel.co.tz/ External link for Kiriwe Travel & Trekking Safaris Ltd Industry Travel Arrangements Company size 2-10 employees Headquarters Arusha, Arusha Type Privately Held Founded 2013 Specialties Tanzania, Zanzibar, Kenya, Mount Kilimanjaro Climbing, and Cultural programs Locations Primary Kimandolu Arusha, Arusha 255, TZ Get directions Employees at Kiriwe Travel & Trekking Safaris Ltd Frank Swai Director l Travel Advisor l at Kiriwe Travel & Trekking Safaris Ltd Brian Swai Travel Expert  at Kiriwe Travel and Trekking Safaris Ltd sarah Pfleger Tour Operator at Kiriwe Travel & Trekking Safaris Ltd See all employees Updates Kiriwe Travel & Trekking Safaris Ltd 383 followers 3mo Report this post Like Comment Share Join now to see what you are missing Find people you know at Kiriwe Travel & Trekking Safaris Ltd Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Desert Paramours Tours Travel Arrangements Jumbo Tours and Safaris Travel Arrangements Arusha, Arusha Orca Sea Safaris Maritime Transportation Falmouth, Cornwall Everyday Safaris Limited Travel Arrangements Arusha, Arusha Region Pro Safaris Africa Oldome African Safaris Travel Arrangements Arusha, Arusha MASHUDU TOURS & SAFARIS Travel Arrangements Victoria Falls, Zimbabwe JOEKIE DU TOIT SAFARIS BLOEMFONTEIN, Free State Alkanjaoi Tours and Safaris Travel Arrangements Arusha, Arusha African Photography Safaris Photography Dalton, Northumberland Show more similar pages Show fewer similar pages LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Kiriwe Travel & Trekking Safaris Ltd Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.wildernessdawning.com/contact/",
      "text": "Contact – Wilderness Dawning Safaris Skip to content Wilderness Dawning Safaris Wilderness Dawning is a privately-owned safari company based in Maun, Botswana and Johannesburg, South Africa. Home Botswana Safaris 4 Day Enriching Mobile Safari 10 Day Highlights of Botswana Safari 15 Day Botswana Tour 6 Day Makgadikgadi Pans Safari Trip Details Private Safaris Okavango Spirit Houseboat Gallery Responsibilties Contact GET IN TOUCH Wilderness Dawning Safaris PO Box 22277, Maun, Botswana Office Hours: Mon – Fri: 08h00 – 17h00 Sat: 08h00 – 13h00 Craig : craig@wildernessdawning.com (Tel: +27 84 805 4459) & (Tel:+267 73 893 671) Agnes: reservations@wildernessdawning.com (Tel: +(267) 713 4509) Instagram: wilderness_dawning_safaris Facebook: Wilderness Dawning Safaris Enquire Now! ©Wilderness Dawning Safari | 2025 | All Rights Reserved."
    }
  ]
}