{
  "fuentes": [
    {
      "url": "https://www.tampabay.com/things-to-do/food/spirits/Bar-review-A-trip-to-Saigon-Blonde-in-St-Petersburg-is-an-immersive-experience_171062283/",
      "email": "hfreund@tampabay.com"
    },
    {
      "url": "https://ilovetheburg.com/new-bar-saigon-blonde-aims-to-be-an-escape-in-the-burg/",
      "email": "info@ilovetheburg.com"
    },
    {
      "url": "https://www.forbes.com/profile/richard-saghian/",
      "email": "feedback@forbes.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.hidden-saigon.com/about-us-1",
      "email": "linh@hidden-saigon.com"
    },
    {
      "url": "https://ilovetheburg.com/red-thread-st-pete/",
      "email": "info@ilovetheburg.com"
    },
    {
      "url": "https://www.saigonroyal.ca/contact",
      "email": "info@saigonroyal.ca"
    },
    {
      "url": "https://mytiki.life/tiki-bars/saigon-blonde",
      "email": "header-tiki-tile@2x-ddwpfegc.webp"
    },
    {
      "url": "https://www.saigonblonde.com/contact",
      "email": "info@saigonblonde.com"
    }
  ],
  "mails": [
    "feedback@forbes.com",
    "header-tiki-tile@2x-ddwpfegc.webp",
    "hfreund@tampabay.com",
    "info@ilovetheburg.com",
    "info@saigonblonde.com",
    "info@saigonroyal.ca",
    "info@scibpaints.com",
    "linh@hidden-saigon.com"
  ],
  "nombre_sitio": "saigonblonde.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tampabay.com/things-to-do/food/spirits/Bar-review-A-trip-to-Saigon-Blonde-in-St-Petersburg-is-an-immersive-experience_171062283/",
      "text": "Bar review: A trip to Saigon Blonde in St. Petersburg is an immersive experience Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Bars & Breweries Bar review: A trip to Saigon Blonde in St. Petersburg is an immersive experience EVE EDELHEIT   |   Times Bartender Lucien Chalfoun makes a cocktail at Saigon Blonde in St. Petersburg on Saturday, August 4, 2018. Saigon Blonde is a new high-concept bar with a Vietnam War-era theme, design details and exotic cocktails. By Justin Grant, Times Correspondent Published MORE FOR YOU British pub The Moon Under Water finally has a new home • Food In Dunedin, MockFusion creates bar atmosphere minus the alcohol • Bars & Breweries Advertisement Temple Terrace bets big on boozy pickleball complex • Bars & Breweries After 2 years, Clearwater brewery reopens under new management • Bars & Breweries Move to bigger location equals more business for St. Petersburg sports bar • Bars & Breweries Sip and learn at Savoir, St. Petersburg’s newest wine bar • Food This new restaurant is doing something Tampa Bay diners haven’t seen before • Food After a rocky start, Mango’s Southern Kitchen + Bar finds its footing • Food This Safety Harbor brewery is expanding. Here’s what to know. • Bars & Breweries Here’s the first retail spot coming to St. Petersburg’s tallest tower, 400 Central • Food Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://ilovetheburg.com/new-bar-saigon-blonde-aims-to-be-an-escape-in-the-burg/",
      "text": "New Saigon Blonde Bar Aims to Be \"An Escape\" in the Burg We use cookies to give you the best experience on our site. Learn more or close to accept. × Skip to content Stories Guides Events Visitors Tours Merch Stories Guides Events Visitors Tours Merch Search Search COMMUNITY PARTNER Biz , Burg New Saigon Blonde Bar Aims to Be “An Escape” in the Burg July 11, 2018 • By DuPont Octavius July 11, 2018 • By DuPont Octavius 136 SHARES Facebook Twitter Poised to launch on Central Avenue in the coming week, Saigon Blonde promises an immersive departure from the day-to-day bar experience. Intentionally mixing history and fiction, the narrative look of the new bar features design elements like commissioned artwork and custom fixtures to create “a surreal setting unlike any other in the Tampa Bay area.” Throughout the bar, special consideration has been given to the role art and design play in telling the story of Saigon Blonde. Artwork is integral to the experience and much of it was created by local contemporary realist Jean Michael Fait. His commissioned series “A Libertine in Saigon ” expresses both the cultural value of the past as well as the importance of contemporary art and local entertainment. ADVERTISEMENT Despite its international inspiration, Saigon Blonde is already rooted in local culture. Offering a full bar throughout, its inventive cocktail menu, which boasts a serious lineup of tropical ingredients and flavors (rambutan purée, for instance), sources produce from the local Farm Fresh Produce and the bar will have local selections from American Freedom Distillery, among others. In support of St. Pete’s recent move away from straws and other single-use plastics, the Saigon Blonde team is making decisions with their environmental footprint in mind. The disposable drinkware for the outdoor bar will be a plant-based bioplastic option, and straws will be paper and largely by request only. Like many other downtown establishments, they struggle with the lack of recycling services available, but are investigating other ways to decrease their environmental impact. Saigon Blonde will be located at 265 Central Ave. Rendering and logo courtesy of Saigon Blonde ADVERTISEMENT Subscribe Now Don’t miss out on All Things Good in the Burg 👉 Email Stay in the know 👇 GET UPDATES 👇 Stay connected to All Things Good in the Burg by subscribing today. Email Stay in the know DuPont Octavius Recent Stories American Stage’s ‘Broadway by Candelight’ brings Broadway performers to The James Museum September 11, 2025 The Wee British Shop brings a taste of Britain and Ireland to St. Pete September 11, 2025 New BOOlevard of Play Family Zone announced for Halloween on Central September 11, 2025 Related Stories The Wee British Shop brings a taste of Britain and Ireland to St. Pete September 11, 2025 New BOOlevard of Play Family Zone announced for Halloween on Central September 11, 2025 Razed (Director’s Cut) two new in-person screenings confirmed in St. Pete September 5, 2025 Gallagher’s Pumpkins & Christmas Trees is one of St. Pete’s best fall experiences September 4, 2025 All Recent Stories New BOOlevard of Play Family Zone announced for Halloween on Central September 11, 2025 Things to do with kids this weekend: St. Pete, Clearwater, and beyond September 11, 2025 Fun and free fitness classes in St. Pete: kayaking, biking, and trail runs September 10, 2025 Longtime British favorite Moon Under Water to make its return in Gulfport September 10, 2025 20 amazing events to attend during St. Pete’s City of Performing Arts Month September 9, 2025 Help restore Egmont Key: Volunteer for a massive cleanup effort September 9, 2025 Things To Do In St Pete This Weekend: Best Festivals & Events Going On In St Petersburg September 9, 2025 Award-winning author of ‘Build It Boldly’ to host book talk, Q&A in Tampa this week September 8, 2025 Since I Love the Burg launched in May of 2009, it has been our mission to make St. Petersburg (a.k.a. the #BURG) the best place to live, work and play. Facebook-f Instagram Twitter Tiktok Youtube Envelope Email Subscribe All Things Good Stories Guides Events Shop Visitor's Guide More From Us History Tours About / Contact Advertise Privacy Policy That's So Tampa © All rights reserved Brought to you with ❤️ by WallMedia Partners Stories Guides Events Visitors Merch"
    },
    {
      "url": "https://www.forbes.com/profile/richard-saghian/",
      "text": "Richard Saghian Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Get in Touch Get In Touch With Richard Saghian Get In Touch PROFILE Richard Saghian $2.1B Real Time Net Worth as of 9/11/25 Reflects change since 5 pm ET of prior trading day. #1814 in the world today From the Editor Richard Saghian is the founder and CEO of fast fashion company Fashion Nova, which generates some $2 billion in annual sales. The son of Iranian immigrants, Saghian started the company in 2006 after dropping out of college. He offered hundreds of new clothing styles a week, promoted on Instagram by influencers and celebrities like Cardi B. In 2018, Fashion Nova was the most Googled fashion brand, beating out the likes of Louis Vuitton, Versace and Gucci. Saghian owns several properties in Los Angeles, including a sprawling hilltop estate in Bel Air that he purchased for $141 million. Wealth History HOVER TO REVEAL NET WORTH BY YEAR Forbes Lists #1688 Billionaires (2025) Personal Stats Age 44 Source of Wealth Fast fashion, Self Made Residence Los Angeles, California Citizenship United States Marital Status Single Education Drop Out, California State University Northridge Did you know Three men attempted to rob Saghian outside his home in 2021. A confrontation with a security guard led to gunfire, resulting in one fatality. Saghian was uninjured. In 2022, Fashion Nova agreed to pay $4.2 million to settle allegations by the FTC that it suppressed negative reviews online. Fashion Nova denies the allegations. Related People & Companies Vladimir Melnikov Related by origin of wealth: Fast fashion View Profile More on Forbes 20 minutes ago USF Heads To Miami Having Maintained Poise Amid The Noise Cole Skinner could have easily retaliated after being spit at late in the game at Florida. Instead, the USF offensive lineman kept his composure and went back to work. By Tom Layberger Contributor 35 minutes ago Prosecutors Bring Charges Over Massive Ponzi Scheme Paul Regan has been charged by the Justice Department and the SEC with operating a Ponzi scheme with phony investments in ACA policies By Steve Weisman Contributor 44 minutes ago Today’s NYT Pips Hints And Solutions For Friday, September 12th Looking for help with today's New York Times Pips? Here are some expert hints, clues and commentary to help you solve today's puzzle and sharpen your skills. By Erik Kain Senior Contributor 54 minutes ago Despite Missing Xfinity Series Playoffs, Christian Eckes Believes 2025 Is A Success Nascar Xfinity Series rookie Christian Eckes missed the 2025 playoffs, but he is ready to play playoff spoiler with Kaulig Racing. By Joseph Wolkin Contributor 1 hour ago Wilson Releases Roger Federer Laver Cup Rackets And Bags The RF Collection from Wilson takes a gold-accented approach to Laver Cup with a special-edition collection By Tim Newcomb Contributor 1 hour ago IndyCar’s At Nashville Releases Attendance And TV Data For 2025 Finale Increased television viewers and more fan engagement are key data points for the Borchetta Bourbon Music City Grand Prix IndyCar race at Nashville Superspeedway in 2025. By Bruce Martin Contributor 1 hour ago Canelo Alvarez Vs. Terence Crawford Fight: Odds, Picks And Predictions We prepare you for Saturday's boxing match between Canelo Alvarez and Terence Crawford by looking at the betting odds, line movement, and offering picks and predictions. By Trent Reinsmith Contributor 2 hours ago Why Google Is The ‘Worst’: Publishing CEO Unloads On The Search Giant One digital media leader sounds off on Google’s grip over publishing — from search traffic to ad revenue and the future of journalism. By Andy Meek Senior Contributor Aug 28, 2024 Meet The Fashion Billionaire Who Spent $300 Million On LA Properties Richard Saghian, the founder of Fashion Nova, just closed on his fourth major purchase since the pandemic as he continues to rake in a fortune from his online retailer. By Jemima McEvoy Former Staff Mar 19, 2022 With ‘The One’ Sale On The Horizon, Fashion Nova’s Richard Saghian Hopes To End A Four-Year Hunt For The Perfect Home The 105,000 square foot home designed by Paul Mclean, which was originally listed at $295 million before being put for auction earlier this month, sold to Fashion Nova founder, Richard Saghian, for $141 million, including fees. By Spencer Elliott Contributor Mar 9, 2022 Fashion Nova CEO Richard Saghian Buys ‘The One’ Megamansion For $141 Million The race to own ‘The One’ is over, as it is revealed Fashion Nova CEO Richard Saghian placed the highest bid and is now the owner of Los Angeles’ largest home. By Emma Reynolds Senior Contributor Mar 9, 2022 Fashion Nova's Billionaire CEO Richard Saghian Buys Bel-Air Mega Mansion For $141 Million Usually preferring to stay out of the spotlight, Fashion Nova’s founder and CEO Richard Saghian made an unusually splashy purchase this week, paying $141 million for a mega-mansion in Bel Air. By Riley Hallaway Former Staff WATCH Mar 8, 2022 Fashion Nova’s Founder Has Spun A Billion-Dollar Fortune From Fast Fashion The fashion mogul just spent $141 million on a mega-mansion in Bel Air. By Lauren Debter Former Staff Apr 20, 2021 Netflix Executive Ted Sarandos Sells Malibu Beach House For $14.7 Million Ted Sarandos, co-CEO of the media juggernaut, and his wife, former U.S. ambassador Nicole Avant, have sold their home in Malibu for $14.73 million. By Neal Leitereg Former Contributor Nov 18, 2020 Q&A: Megan Thee Stallion On Her Debut Album, ‘Good News,’ And Her Fashion Nova Line After a banner year including the smash, \"WAP,' with Cardi B., rapper Megan Thee Stallion is dropping both her debut album and a new clothing line with Fashion Nova. I spoke to her about both. By Steve Baltin Senior Contributor Apr 8, 2020 Fashion Nova, Cardi B To Donate $1 Million For COVID-19 Relief — With Direct Checks To Those In Need The initiative hopes to provide immediate relief and offset some people’s financial burdens related to the COVID-19 pandemic. By Andrea Bossi Contributor May 13, 2019 Cardi B On New Fashion Nova Collection And Exactly How Long It Took To Get Ready For The Met Gala In addition, CEO Richard Saghian shares his goals for the brand. By Isis Briones Former Contributor More Articles also on forbes USF Heads To Miami Having Maintained Poise Amid The Noise Prosecutors Bring Charges Over Massive Ponzi Scheme Today’s NYT Pips Hints And Solutions For Friday, September 12th © 2025 Forbes Media LLC. All Rights Reserved. AdChoices AdChoices Privacy Statement Do Not Sell or Share My Personal Information Limit the Use of My Sensitive Personal Information Cookie Preferences Terms of Service Digital Terms of Sale Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Forbes Accolades Forbes Press Room Advertise"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.hidden-saigon.com/about-us-1",
      "text": "Hidden Saigon | About Us top of page INTRODUCING OUR CULTURE MAKERS INTRODUCING OUR CULTURE MAKERS Home Services Movers & Shakers Gallery About Us Press & Reviews Contact Us More... Use tab to navigate through the menu items. WE ARE HIDDEN SAIGON WHY WE DO IT Established in 2018 by Vietnamese-Canadian Linh Phan, Hidden Saigon aims to reshape how Vietnam is perceived globally , one individual at a time. ​ Our focus is on sharing authentic stories that reflect the current essence of Vietnam, moving beyond the narrative of the War, phở, and bánh mì. ​ We believe in letting the local community members tell their own stories, giving them the power to shape their representation. ​ This approach allows us to capture the true essence of contemporary Vietnam. HOW WE DO IT We have built strong connections with the community through our efforts in various sectors such as media, music, nightlife, F&B, NGOs, and the arts over the past 18 years in Vietnam. ​ By sharing a common vision and showing respect , we can engage in partnerships with businesses, creatives, and locals that many other companies may not have the opportunity to connect with. WHAT WE DO We offer a range of carefully curated activities for our guests, including journeys, workshops, events, commercial partnerships, and media production. ​ Additionally, we host diverse community events like indie Vietnamese film screenings, panel discussions, and marketplaces to nurture and strengthen our relationships with them. RESPONSIBLE TOURISM At Hidden Saigon, we recognize that our actions can have both positive and negative effects on the lives of city residents. ​ Prioritizing sensitivity to the community's needs: We collaborate closely with our partners to ensure their input is valued during development and feedback stages. ​ To minimize negative impacts, we implement the following strategies: Limiting group sizes for our tours Including multiple locations in each journey package to distribute impact across various areas Minimizing plastic usage by encouraging guests to bring refillable water bottles and reusable bags. ABOUT THE FOUNDER: LINH PHAN A Creative Producer residing in Saigon for over 18 years A Refugee Boat person who departed Saigon in 1977 and was raised in Toronto, Canada A Partner in a media production company in Saigon for 5 years, specializing in community storytelling projects, art, and cultural content Engaged in various community initiatives such as the Street Art Festival and Digital Storytelling concerning health topics for marginalized groups Recipient of numerous International Grants Conducts and develops training workshops in digital storytelling, photovoice, and film production Works with a diverse clientele including commercial, government, and television broadcasters A DJ and Event Promoter for 15 years, hosting parties recognized in the Lonely Planet Guide Vietnam and Southeast Asia as one of the trendiest club nights in Ho Chi Minh City. STAY UP TO DATE Subscribe Success! Message received. Ho Chi Minh City | linh@hidden-saigon.com |  Tel. +84 (0)908 477 079 Terms & Conditions © 2018 by Hidden Saigon Công Ty TNHH LHP International Consulting bottom of page"
    },
    {
      "url": "https://ilovetheburg.com/red-thread-st-pete/",
      "text": "Red Thread will serve up a culinary experience inspired by the Silk Road this fall We use cookies to give you the best experience on our site. Learn more or close to accept. × Skip to content Stories Guides Events Visitors Tours Merch Stories Guides Events Visitors Tours Merch Search Search COMMUNITY PARTNER Biz , Eat/Drink Red Thread will serve up a culinary experience inspired by the Silk Road this fall August 26, 2024 • By Aaron Styza August 26, 2024 • By Aaron Styza 56 SHARES Facebook Twitter St. Pete will soon welcome a new dining destination as Red Thread prepares to open at 300 1st Ave N this September. This restaurant, created by the team behind the popular Saigon Blonde bar, promises to take patrons on a culinary journey inspired by the ancient Silk Road. The team behind Leonard Contractors is overseeing the buildout. Red Thread offers an innovative dining experience that celebrates the diverse flavors and traditions of the historic trade routes connecting the East and West. The menu showcases an exquisite selection of dishes and craft cocktails, drawing inspiration from the cuisines of China, India, Persia, the Middle East, and the Mediterranean. ADVERTISEMENT A culinary journey along the Silk Road in St. Pete Red Thread’s chefs meticulously craft each dish to highlight the authentic spices, ingredients, and techniques exchanged for centuries along the ancient Silk Road. The restaurant’s name, “Red Thread,” nods to a myth from Chinese and Japanese folklore that symbolizes a predestined connection between individuals—a theme that resonates across various East Asian and Middle Eastern cultures. The owners, who have already made a name for themselves with the success of Saigon Blonde, bring a wealth of experience and passion to this new venture. Red Thread opens for brunch on weekends and offers lunch and dinner throughout the week. Guests can dine in a stylish indoor setting or on a picturesque private outdoor patio, which features an indoor/outdoor bar that seamlessly blends historical inspiration with modern luxury. The highly anticipated opening of Red Thread is expected by the end of September. ADVERTISEMENT Subscribe Now Don’t miss out on All Things Good in the Burg 👉 Email Stay in the know 👇 GET UPDATES 👇 Stay connected to All Things Good in the Burg by subscribing today. Email Stay in the know Aaron Styza Aaron Styza is an itinerant journalist, poet, fiction writer and resident of St. Pete. Recent Stories American Stage’s ‘Broadway by Candelight’ brings Broadway performers to The James Museum September 11, 2025 The Wee British Shop brings a taste of Britain and Ireland to St. Pete September 11, 2025 New BOOlevard of Play Family Zone announced for Halloween on Central September 11, 2025 Related Stories Longtime British favorite Moon Under Water to make its return in Gulfport September 10, 2025 The Frog Pond reopens in North Redington Beach: “the heart of this place stays the same” September 8, 2025 Paradeco is one of the “chicest cafes in America” September 8, 2025 An all-you-can-eat Vietnamese buffet is drawing big crowds in Pinellas Park September 4, 2025 All Recent Stories New BOOlevard of Play Family Zone announced for Halloween on Central September 11, 2025 Things to do with kids this weekend: St. Pete, Clearwater, and beyond September 11, 2025 Fun and free fitness classes in St. Pete: kayaking, biking, and trail runs September 10, 2025 Longtime British favorite Moon Under Water to make its return in Gulfport September 10, 2025 20 amazing events to attend during St. Pete’s City of Performing Arts Month September 9, 2025 Help restore Egmont Key: Volunteer for a massive cleanup effort September 9, 2025 Things To Do In St Pete This Weekend: Best Festivals & Events Going On In St Petersburg September 9, 2025 Award-winning author of ‘Build It Boldly’ to host book talk, Q&A in Tampa this week September 8, 2025 Since I Love the Burg launched in May of 2009, it has been our mission to make St. Petersburg (a.k.a. the #BURG) the best place to live, work and play. Facebook-f Instagram Twitter Tiktok Youtube Envelope Email Subscribe All Things Good Stories Guides Events Shop Visitor's Guide More From Us History Tours About / Contact Advertise Privacy Policy That's So Tampa © All rights reserved Brought to you with ❤️ by WallMedia Partners Stories Guides Events Visitors Merch"
    },
    {
      "url": "https://www.saigonroyal.ca/contact",
      "text": "Contact Us | Saigon Royal: Reach Out and Connect with Calgary's Premier Vietnamese Restaurant — Saigon Royal 0 Skip to Content Saigon Royal Home Menu Order Online DoorDash SkipTheDishes UberEats Clover (Pick-Up Only) About Us Gallery Contact Us Open Menu Close Menu Saigon Royal Home Menu Order Online DoorDash SkipTheDishes UberEats Clover (Pick-Up Only) About Us Gallery Contact Us Open Menu Close Menu Home Menu Folder: Order Online Back DoorDash SkipTheDishes UberEats Clover (Pick-Up Only) About Us Gallery Contact Us contact us get in touch (403) 723-6638 info@saigonroyal.ca leave us a google review Being a small, family-operated business, your feedback is highly valued. Please share your thoughts with us. Google Review Name * First Name Last Name Email * Message * Thank you! Visit us DOUGLAS CENTRE 20 Douglas Woods Dr SE Unit 16, Calgary, AB (403) 723-6638 Monday - Saturday 11am - 8pm Sunday Closed @ 2024 By Brand Bureau Marketing"
    },
    {
      "url": "https://mytiki.life/tiki-bars/saigon-blonde",
      "text": "Tiki Bar: Saigon Blonde | mytiki.life Welcome to the mytiki.life v2 beta. This is a work in progress and there may be some bugs. If you find any issues or have feedback send me an email: [email protected] . mytiki.life Home Tiki Mugs Swizzle Sticks Other Collectibles Collectors Creators Tiki Bars Home Tiki Bars Contact Request an update Sign in Create an account Search Quick Search Sign in Home Commercial Tiki Bars Saigon Blonde St. Petersburg, Florida, United States Add Visit Close Opened July of 2018. St. Petersburg local Peri Bandazian transformed the former LUX bar and lounge on Central Avenue into a tropical, immersive destination downtown.  Bandazian’s Saigon Blonde is inspired by ’60s-era Vietnam and while it has tiki elements, is not exactly a tiki bar in the strict sense.  It is best described as a fusion of 60s pop motifs centered around a quasi fictional background of Vietnam War era Saigon, wherein \"The proprietor, a beautiful blonde of Vietnamese and French descent, had created an oasis for locals and soldiers alike.\" The narrative look of the new bar features design elements like commissioned artwork and custom fixtures to create “a surreal setting unlike any other in the Tampa Bay area.” The owner partnered with Pinellas Park’s Creative Arts Unlimited, Inc. and St. Pete’s Wax & Hive to bring Saigon Blonde to life, and much of the art, which is a crucial component of the bar, was done by local contemporary realist Jean Michael Fait. Saigon Blonde has five distinct areas for patrons to enjoy — showcasing symbolism and memorabilia, among other decorative details such as woven bamboo-covered walls and nods to folklore: 1) The outdoor walk-up bar. 2) The front bar with tiki totems and murals, plus an inventive cocktail menu that references the Pacific Rim in flavor and color. 3) Highlighting a sultry feel, the downstairs lounge with hanging lanterns, paintings and plush furniture. 4) Fashioned from an old plane wing, the intimate, dimly lit military bar toward the back. And 5) The VIP-like loft lounge — accessed through a narrow staircase and around a bend to overlook the downstairs lounge and front bar — with more plush furniture and a mural ceiling. *NOTE: They do have a sub-section of their cocktail menu that specializes in drinks with CBD oil or cannabis aromatics, and these additions can be added to their other cocktails as well.  Shown in last photo is their Hemp Day Cocktail with Marijuana leaf sprinkle stencil of aromatics. Details Type Bar Phone (727) 827-7577 Address St. Petersburg, Florida, United States Closed? No Links saigonblonde.com instagram.com facebook.com Gallery 3\n                            Visits Chuckbob – Date: Unknown Old Captain Taylor – Date: Unknown Tiki_Wachee – Date: Unknown Entry Meta Date Created 19 Sept 2022, 11:07:29 pm Date Updated 17 Nov 2022, 10:52:10 pm Author mytikilife Edit entry ⭐ Support mytiki.life with a supporter subscription! ⭐"
    },
    {
      "url": "https://www.saigonblonde.com/contact",
      "text": "Contact — Saigon Blonde Welcome About Gallery Home Legend Drink Specials Events Gallery Press Welcome About Gallery Home Legend Drink Specials Events Gallery Press Contact 265 CENTRAL AVENUE, ST.PETERSBURG, FL 33701 727-827-7577 | Info@Saigonblonde.com Please send resumes to the email above if interested in joining the team Hours Mon  Closed Tues 4pm - 2 am Wed  4pm - 2 am Thursday 4pm - 3 am Friday 4pm - 3 am Saturday 1pm - 3 am Sunday 1pm - 3 am Name * First Name Last Name Email * Subject * Message * Thank you! Back To Top Drink Specials Events Directions Contact 265 Central Avenue North, St. Petersburg, FL, 33701, United States 727-827-7577"
    }
  ]
}