{
  "fuentes": [
    {
      "url": "https://saintmarkboca.net/staff/rev-deacon-john-christakis-md/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/about-us/who-we-are/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/marriage/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://stmarkclev.org/about/contact-us/",
      "email": "church@stmarkclev.org"
    },
    {
      "url": "https://saintmarkboca.net/realm-connect/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/realm-connect/",
      "email": "realm@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/blog/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/about-us/our-staff/",
      "email": "franastasios@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/about-us/our-staff/",
      "email": "frmarko@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/about-us/our-staff/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/staff/rev-father-mark-a-leondis/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/about-us/contact-us/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://www.stmarksgoc.org/contact",
      "email": "elprup3@aol.com"
    },
    {
      "url": "https://www.stmarksgoc.org/contact",
      "email": "fralexander@stmarksgoc.org"
    },
    {
      "url": "https://www.stmarksgoc.org/contact",
      "email": "frgabriel@stmarksgoc.org"
    },
    {
      "url": "https://www.stmarksgoc.org/contact",
      "email": "j71149@msn.com"
    },
    {
      "url": "https://www.stmarksgoc.org/contact",
      "email": "stmarkoffice@stmarksgoc.org"
    },
    {
      "url": "https://saintmarkboca.net/ministry/adult-education-catechism/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/contact/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/our-staff/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/our-clergy/",
      "email": "franastasios@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/our-clergy/",
      "email": "frmarko@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/our-clergy/",
      "email": "office@saintmarkboca.net"
    },
    {
      "url": "https://saintmarkboca.net/our-patron-saint/",
      "email": "office@saintmarkboca.net"
    }
  ],
  "mails": [
    "church@stmarkclev.org",
    "elprup3@aol.com",
    "fralexander@stmarksgoc.org",
    "franastasios@saintmarkboca.net",
    "frgabriel@stmarksgoc.org",
    "frmarko@saintmarkboca.net",
    "j71149@msn.com",
    "office@saintmarkboca.net",
    "realm@saintmarkboca.net",
    "stmarkoffice@stmarksgoc.org"
  ],
  "nombre_sitio": "saintmarkboca.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://saintmarkboca.net/staff/rev-deacon-john-christakis-md/",
      "text": "Rev. Deacon John Christakis, MD - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Rev. Deacon John Christakis, MD Rev. Deacon John Christakis, MD Dr. John E. Christakis was born on March 25, 1953 in New York City and spent his early years in New York and rural New Jersey. Upon graduation from Case Western Reserve University in Cleveland, Ohio, he attended medical school from 1975 to 1979 and earned his Medical Degree at the Mount Sinai School of Medicine in New York. In 1977 he met Stephanie and married after graduation. In June 1979 he began his 3-year residency in Internal Medicine at University of Miami Affiliated Hospitals, Jackson Memorial Hospital/Miami Veterans Hospital from 1979 to 1982. Upon completion of his medical training and residency he moved to Boca Raton where he established his solo Internal Medicine practice. He enjoyed the practice of Internal Medicine from 1982 to 2017 in Boca Raton with his father, Dr. George, and in the same office as his pediatrician brother, Dr. Paul. His mother, Emerald, a registered nurse, managed their practice for many years. While in private practice, he joined the medical staff at Boca Raton Regional Hospital and served on various hospital committees, including credentialing emergency room, and Executive committees. Physician colleagues elected Dr. Christakis as Chairman of the Physician Hospital Organization negotiating contracts between managed healthcare corporations, hospital administration and hospital staff physician leadership. Dr. Christakis also served as Medical Director of the Regents Park Nursing and Rehabilitation facility working closely with his father, Dr. George, for 7 years providing health care to the elderly. Additionally, with a strong interest in sports medicine, he volunteered and served as a physician for the USA Olympic Diving and Swimming Team at Mission Bay in Boca Raton and for the athletes training at the Olympic Training Center in Colorado Springs as well as team physician for the inaugural FAU football team. He also joined the Federal Aviation Administration as a physician performing flight physicals for pilots, serving in this capacity for 4 years. He serve on the Orthodox Christian Mission Center Board for 10 years and assisted in preparing missionaries for deployment to countries around the world to follow their missionary calling. In 2005 he was ordained to the Diaconate by Metropolitan Alexios, and presently serves at Saint Mark Church. In 2015 he accepted an offer from the GEO Group to join the company as Chief Medical Officer. He travels extensively to visit and support the medical staff that manage the health care of the patients residing within company’s facilities around the country, placing a priority and emphasis on competent and compassionate health care. He encourages all who work in the correctional and rehabilitation environment to perform their duties and responsibilities as noted in scripture, “Remember the prisoners as if chained with them and those who are mistreated- since you yourselves are in the body also” (Hebrews 13:3). Deacon John shares the tremendous joy of traveling with Stephanie, spending time with his children and their six grandchildren, cooking meals for family and friends, and enjoying the art of photography and taking portraits and images of vast landscapes. 561.994-4822 Contact Us Today Please enable JavaScript in your browser to complete this form. Name * Phone Email * Dropdown What is this message regarding? Prayer Request Home/Hospital Visit Sacraments (ie. Baptism, Wedding, etc.) Sunday Memorial / Altar Donations Office Appointments Bookkeeping / Stewardship Hall Rentals Other Message * Please NOTE: These are messages to be delivered to our Church Office. For EMERGENCIES please call our emergency line at (561) 994-4822 Comment Submit Contact Us Today Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/about-us/who-we-are/",
      "text": "First Time Visitor - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today First Time Visitor Greek Orthodox Church Welcome to Saint Mark The Orthodox Christian Church is the original Church, founded by our Lord Jesus Christ Himself, as read in the pages of the New Testament. To this day, the Orthodox Church has maintained the practices, beliefs, and ecclesiastical Traditions since its inception 2,000 years ago. Our faith is informed by these timeless Traditions and dogmas, and experienced today through the Holy Sacraments and our personal connection with Christ. We celebrate the Divine Liturgy every Sunday at 9:45 am. Below you will find some helpful information and links to learn a little bit more about us, and how we worship. If you have any questions, comments, or concerns please do not hesitate to contact us. Beliefs & Expectations WHO to Expect We are men, women, children, plumbers, electricians, business executives, students, teachers, motorcycle riders, athletes, artists, young, and old, but most of all we are FAMILY . Please Note: While many of our parishioners are descendants of immigrants from traditionally Orthodox countries (i.e.. Greece, Romania, Russia, etc.), the Orthodox Church is open for ALL people ! WHAT to Expect \"The Church is an earthly heaven in which the Heavenly God dwells and moves\" (St. Germanus, 733 AD). The Orthodox Church is, above all, a worshipping community which gathers together to experience the Divine Grace of God through the Holy Sacraments. Our bilingual services stem from the Traditions of the earliest days of Christian worship, and ALL are welcome to attend! Orthodox Church FAQ's Welcome Message Interested In Learning More About The Orthodox Church? If you would like to learn more about the Orthodox Church and grow in your walk of faith, please click on the button and fill out a short online form. One of our staff will be in contact to answer any questions you may have. I Would Like More Information Please enable JavaScript in your browser to complete this form. Name * Phone Email * City of Residence Current Faith Message * Comment Submit I Want To Learn More Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/marriage/",
      "text": "Marriage - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Marriage Marriage Sacrament Procedures Greetings in the Lord! The Saint Mark Family of Boca Raton rejoices in your upcoming wedding in the Orthodox Church. The Church views Marriage from a very special perspective, recognizing it as a mystical event in which Jesus Christ Himself participates and unites the couple as one. Always taking place within an Orthodox Church, the goal of marriage is for both individuals to achieve salvation. The couple walks prayerfully together within the realms of the Church, toward this goal. Our Saint Mark family has a vibrant ministry to all of our faithful, and we pray that you will make our Church your spiritual home as you begin your life together. Please complete the attached forms carefully, as soon as possible, and return them in person to our Office or email them to office@saintmarkboca.net. I offer you my personal congratulations and blessings that you will find this information useful as you prepare to begin your life as a married couple. With love in Christ, Rev. Mark A. Leondis, Senior Pastor Information for Your Wedding Pre-Marriage Meeting Stewardship Destination Wedding Your Sponsor Journey to Marriage Pre-Marriage Class Civil Marriage License Items Needed for Wedding The Ceremony Flowers and Rice Wedding Booklet Wedding Rehearsal & Organist Pre-Marriage Meeting As a couple, you will meet with the priest which will be arranged for you by office staff. Please bring a photocopy of your baptismal certificates, and divorce paperwork {if applicable), to the meeting. You will discuss your intentions as a couple to embrace the Faith and determine a date with the Priest for your wedding. A packet of information and forms will be given to you to be completed at home and returned to the Church office, in person, by mail, or email to ( office@saintmarkboca.net ) Stewardship At least one of the individuals intending to marry must be a Steward of Saint Mark and current with his or her pledge. If you are not a Steward but intend to become one, you will be expected to make a stewardship commitment at the time that a date has been established for the wedding. Destination Wedding If you are not a Steward of Saint Mark, or you attend a Parish outside the Metropolis of Atlanta, or have no church parish, then there is a $2,000 church usage fee; this includes the cost of a Chanter and Custodian services. No stewardship is required. You must submit one-half of the fee ($1,000) with your completed paperwork. Paperwork will not be processed without this payment. The second half is due two months prior to the wedding. Special requirements apply . You will be advised Your Sponsor {Koumbaro/Koumbara) must be an Eastern Orthodox Christian and in good standing with an Eastern Orthodox Christian parish. If married, the marriage must have been performed in an Eastern Orthodox Christian church. If not a Steward of St. Mark parish, then a letter must be submitted to us from his/her parish priest that the sponsor is in good standing and free to serve. Journey to Marriage Pre-Marriage Class According to the guidelines of the Greek Orthodox Metropolis of Atlanta, you both must participate in a one-day pre-marriage seminar. Please register at http://www.atlmetropolis.org/family-life Civil Marriage License The original must be submitted to our office two weeks prior to the wedding. Make a copy for your records. The license will be signed by the officiating clergy, the sponsor, and a witness to the ceremony. Include an envelope addressed to the Clerk of the Court from where you received the License. Items Needed for Wedding The listed items are traditionally brought to the Church by the Sponsor: □ Two Crowns with a ribbon □ Rings for both the Bride and Groom □ White Jordan Almonds (a tray to place them on is optional) □ Two White Candles The Ceremony The service takes approximately 45 minutes. Weddings are scheduled two (2) hours apart. Each wedding party will have up to thirty minutes prior to the scheduled wedding time for access to the church. Please designate a person or persons to greet your guests and walk them to their seats. Provided the bridal party arrives on time, photographs may be taken in the Church after the ceremony. If, however, the bridal party does not arrive on time, photography after the ceremony may not be allowed, since other sacraments may be scheduled following your wedding Flowers and Rice Please note that no flowers or rice are allowed to be thrown either within or outside the church building. If you will have a flower girl, then only silk flowers should be used because real flowers stain the marble floors of the church. Floral arrangements may be brought to the church one (1) hour prior to the Service. Wedding Booklet If you plan to have a booklet printed regarding the symbolism of the Sacrament, please submit it to the Church Office for review prior to printing. Wedding Rehearsal & Organist For a Church organist and the wedding rehearsal, please contact the Church Office at office@saintmarkboca.net or at 561.994.4822. Please refer to the attached Wedding Music Protocol for Metropolis of Atlanta Clergy and Faithful Protocol 02/12. \"For the Sacrament of Marriage, the Orthodox Church prefers to emphasize the human voice in offering praise and glory to God. For this reason, our chanters and choirs are encouraged to use the treasury of Orthodox hymns during the Sacrament of Marriage. After all, the purpose of our hymnography is prayer and instruments cannot pray. When prelude music is offered before the service, it should never include pop/roe/Broadway show tunes or other secular songs. Instead, we should offer Orthodox hymns such as Axion Estin, Communion Hymns, Tin Oreotita, and the Lord's Prayer, etc. The only non-Orthodox hymn that can be sung prior to the service (i.e., the prelude/processional} is Ave Maria. Traditional classical music, without words can be played by the organist before the service as well as for processional and recessionals and this is by economia. /sting note that under no circumstances whatsoever can any other musical instruments ever be permitted in the church building itself (e.g., harps, trumpets, flutes, guitars, violins/stringed instruments, drums, etc.} As we seek to adhere to this music policy and enlist those we serve to do the same, let us recall the words of St. John Chrysostom, \"The Church is not a theatre where we listen for pleasure.\" God has entrusted to us the stewardship of His true faith and worship. Therefore, it is our sacred privilege to offer and use the appropriate music and form during this Sacrament.\" Download The Full Wedding Packet Sponsor Requirements 1 The Sponsor must be an Eastern Orthodox Christian who is a steward and in good standing, that is, current in his/her stewardship committment. If married, the wedding service must have taken place in an Eastern Orthodox Church. 2 For a Sponsor who is not a members of St. Mark, he/she must have a letter from his/her parish priest stating that he/she is a member in good standing. If the Sponsor is not an active member of any local parish then he/she must participate in a St. Mark Orthodoxy Studies Class that is offered several times each year. 3 If the Sponsor is a Steward of St. Mark, he/she must be actively participating in the life of the church, i.e. attend church regularly, receive the Sacrements regularly, and be current in his/her Stewardship pledge. Letter In Good Standing Complete Our Online Marriage Form If you are in the process of planning a wedding and wish to be married at Saint Mark Greek Orthodox Church, please fill out our online marriage form and we will be in touch with you to discuss next steps. Marriage Online Form Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://stmarkclev.org/about/contact-us/",
      "text": "Contact Us - St. Mark Coptic Orthodox Church of Cleveland 216-642-7692 church@stmarkclev.org Facebook-f Twitter Instagram Youtube Android Apple Donate Now Menu Home Events Services Schedule Registration Sheet Borrowing Library Bookstore Resources About Our Pope Our Bishop Our Clergy Our Board Our Coptic Orthodox Church Our History Contact Us Watch Live Close Search for: Menu Home Events Services Schedule Registration Sheet Borrowing Library Bookstore Resources About Our Pope Our Bishop Our Clergy Our Board Our Coptic Orthodox Church Our History Contact Us Watch Live Close Search for: Donate Now Contact Us Home | About | Contact Us Ways to reach us Want To Get In Touch? Contact the church via phone, email, or fill out the form. Visit Us: 2100 East Pleasant Valley Road, Seven Hills, OH, 44131 Email Us: church@stmarkclev.org Phone Us: +1 (216) 642-7692 Send Us Message Complete the contact form below and someone will get back with you soon. Name (Required) First Last Email (Required) Enter Email Confirm Email Phone (Required) Message (Required) Please let us know what's on your mind. Have a question for us? Ask away. Welcome! We are glad you have chosen to spend a few moments looking around, discovering our church family. To fully understand us and our Orthodox tradition, come to a Divine Liturgy or to a Bible study, ask questions and feel the up-close, in-person fellowship that comes when people share time together in the presence of our Lord and Savior Jesus Christ and united in the Holy Spirit. Contact Us 2100 East Pleasant Valley Road Seven Hills, OH 44131 Phone: (216) 642-7692 Fax: (216) 642-7693 Email: church@stmarkclev.org Facebook Twitter Instagram Youtube Android Apple Quick Links Watch Live Our Events Borrowing Library Bookstore Donate Now SMS Terms and Conditions © All right reserved 2025 St. Mark Coptic Orthodox Church of Cleveland —  Developed & Maintained by Faith Web Solutions"
    },
    {
      "url": "https://saintmarkboca.net/realm-connect/",
      "text": "Realm Connect - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Realm Connect Fast and Effective Parish Communication At Saint Mark, we are blessed to have many ministries, activities, and events that help us grow in our Lord’s name. Communication is central as we navigate through life’s challenges. We are proud to announce our newest organization resource – Saint Mark Connect through Realm. We now have a singular, centralized, and organized resource to keep our Saint Mark Family aware of what’s going on and grow as a connected church family. Saint Mark Connect is an application that facilitates fast and effective communication—when we’re not able to connect in person. Saint Mark Connect serves both as an important tool for our ministry staff, as well as an online ministry tool that offers exciting opportunities to support your involvement in our church. Access it through an app on your mobile devices or through a browser window on your personal computer. Saint Mark Connect through Realm Connect helps us: Easily connect with each other online Facilitate ministry group conversations ( i.e. prayer request sent quickly to the Prayer Group) Manage personal information and who can view it Manage stewardship and all other Saint Mark giving from the touch of your phone Sign-up for upcoming events - like Palm Sunday Luncheon Setting Up Your Realm Account Accept Email Invitation Check your inbox for an invite from the church to join Realm Connect. A link in the email coming from notifications@onrealmmail.org (if you don’t receive – check your spam). will take you to Realm Connect in your web browser. You will need to create login credentials for your account. Remember to save your login information in a safe place so you can easily access it. Download The App Once you have successfully set up your account profile, you are now ready to go mobile. You can download the “Realm Connect-For Our Church” app from either the Apple or Google Play app stores. Once you have installed the app on your device, you will log in using your credentials. Create A Profile After you are successfully logged on, you can begin to create your account profile. This will consist of your basic personal information. You can add immediate family members, profile photos, and more. Your profile is how other parishioners will identify you within the application. Do You Have A Realm Account? If you would like to login to your existing Realm account, or if you need to setup your new Realm account then click on the \"Go To Realm\" button. Go To Realm Common Realm FAQ's How do I set up my account profile? To create your profile through a web browser When you are logged in, click below your name at the top right. Choose “Profile”, then click “Edit Profile” to add your information. Don’t forget to add a photo too! To create your profile in the mobile app Click on “More…” at the bottom right of your screen. On the “More” screen, click your initials at the top left, then click on “My Profile”. On the “Profile” screen, fill in your information, and add a photo too. What information goes into my account profile? Your profile will contain everything you want your fellow parishioners to know about you. It also enables you to join a small group, RSVP to events, track your giving, update your contact information, change family details, set notification preferences, or replace that outdated family photo. By keeping your information current, you are helping our staff, group leaders, and our church community. Your Profile Includes: Contact Information* (e.g. name, address, email, phone) Photo Family Members Personal Information** (e.g. marital status, birthday***, etc.) Connected Social Media accounts Giving history Ministry Group Affiliation * Your record will already be populated with your address and other personal information. Verify the information and make changes as needed. **You control who can see your details by setting your privacy preferences. Only certain office staff can see financial information. Contact information (address, phone, eMail), by default, can only be seen by office staff and leaders of groups you join. ***Feel free to enter your full birthday. The year and your age will not be displayed on your church directory profile. Is Saint Mark Connect through Realm safe, private, and secure? Your privacy is one of our greatest concerns. Realm Connect is only made up of the people in our church, it’s not like a social network that’s open to everyone. Realm Connect keeps your data safe and gives you control over what information you share and who can see it. What if I haven't received an invitation to join Saint Mark Connect yet? If you are a current member of Saint Mark, then please send an email request to: realm@saintmarkboca.net . Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/blog/",
      "text": "Blog - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Blog The Lion's Heart \"Wait for the Lord; be strong, and let your heart take courage.\" Psalm 27:14 Lighting a Candle: A Holy Offering of Prayer August 7, 2025 “The light shines in the darkness, and the darkness did not overcome it” (John 1:5). ... Read More → The 15 Days of August: Prayer, Theology, and Renewal at Saint Mark July 15, 2025 In the Orthodox Church, the first fifteen days of August form a sacred and spiritually ... Read More → United in Christ: Saint Mark’s Life-Changing Pilgrimage to Kenya July 3, 2025 This summer, a group of 23 parishioners from Saint Mark Church in Boca Raton embarked ... Read More → Our Festival . . . An Act of Hospitality January 30, 2025 At Saint Mark, we were blessed to host our Annuual Greek Festival, where between 15,000 ... Read More → “From Hammer to Cloth” by Father Anastasios January 17, 2025 If you were to read my biography, you might wonder why I seem to have ... Read More → Who we are? Mission and Values November 5, 2024 At Saint Mark, our mission is to be a “pillar of Orthodox Christianity in South ... Read More → Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/about-us/our-staff/",
      "text": "Our Clergy - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Our Clergy Clergy Rev. Father Mark A. Leondis Senior Pastor frmarko@saintmarkboca.net Father Anastasios Hallas Assistant Priest franastasios@saintmarkboca.net Rev. Fr. Alexander G. Leondis Pastor Emeritus Rev. Deacon John Christakis, MD Deacon Rev. Deacon Bryan John Shelby Deacon Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/staff/rev-father-mark-a-leondis/",
      "text": "Rev. Father Mark A. Leondis - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Rev. Father Mark A. Leondis Rev. Father Mark A. Leondis Fr. Mark Leondis is the Senior Pastor of Saint Mark Greek Orthodox Church in Boca Raton, Florida. He was born in New York and grew up in New Jersey. He graduated from Hellenic College in 1992 with a BA in Religious Studies and from Holy Cross in 1995 with a Master of Divinity. Fr. Mark pursued additional graduate studies in Youth Ministry at Gordon Conwell Theological Seminary and Fuller Theological Seminary. In 1995, Fr. Mark was appointed the Director of Youth and Young Adult Ministries for the Metropolis of Denver, and served in that position until being called to the Greek Orthodox Archdiocese in New York where he served as the National Director of Youth and Young Adult Ministries from 2000-2011. He taught Religious Education and Youth Ministry at Saint Vladimir’s Seminary in Scarsdale, NY, from 2002-2009 and continued his studies in Christian Leadership and Organizational Development at Gordon Conwell Theological Seminary in Beverly, MA. He served for 9 years (2003-2006; 2008-2012) as Chairman of the Board for Orthodox Christian Fellowship (OCF); has served parishes in Colorado and New Jersey. He is married to Anastasia and together they have two adult children. He has served as the Vice-President of the Clergy Brotherhood for the Greek Orthodox Metropolis of Atlanta, President of the Pan-Orthodox Brotherhood of South Florida, and the President of the Archdiocese Presbyters Council of the Greek Orthodox Archdiocese of America from 2018-2022. He was elevated to the rank of Protopresbyter of the Ecumenical Throne on October 24, 2021, at Saint Sophia National Cathedral during the Apostolic Visit of His All-Holiness Ecumenical Patriarch Bartholomew. He currently serves as the Vice-Chairman of the Board of Trustees for Hellenic College Holy Cross Greek Orthodox School of Theology. 561.994-4822 Contact Us Today Please enable JavaScript in your browser to complete this form. Name * Phone Email * Dropdown What is this message regarding? Prayer Request Home/Hospital Visit Sacraments (ie. Baptism, Wedding, etc.) Sunday Memorial / Altar Donations Office Appointments Bookkeeping / Stewardship Hall Rentals Other Message * Please NOTE: These are messages to be delivered to our Church Office. For EMERGENCIES please call our emergency line at (561) 994-4822 Message Submit Contact Us Today Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/",
      "text": "Saint Mark Greek Orthodox Church in Boca Raton, FL Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Welcome Slide Welcome To SAINT MARK GREEK ORTHODOX CHURCH Plan Your Visit Candle LIGHT A CANDLE Let us include you in our service by lighting a candle and praying for you Virtual Candle Stewardship Ministry Stewardship Ministry Stewardship is making a commitment to Christ of ourselves in support of the ministries of His Church. Time, talent and treasure are all ways in which we express our service to Christ. Orthodox Christian Stewardship is a way of life, which acknowledges accountability, reverence, and responsibility before God. Learn More Stewardship HEAR FROM A FEW OF OUR PARISHIONERS Stewardship is making a commitment to Christ of ourselves in support of the ministries of His Church. Time, talent and treasure are all ways in which we express our service to Christ. Orthodox Christian Stewardship is a way of life, which acknowledges accountability, reverence, and responsibility before God. Learn More Get To Know Us Welcome to Saint Mark Greek Orthodox Church. Click here to learn more about our Faith, mission and ministries. We look forward to welcoming you to our Saint Mark Family. Sermons Click here to listen to some of our sermons offered by the Clergy of Saint Mark. We hope and pray that they will inspire you to walk in this life with our Lord. Upcoming Events Click here to learn about our upcoming Saint Mark Church events. We are blessed with opportunities to come together in fellowship and grow closer to each other and our Lord. Giving Click here to make a donation or pledge; give to one of our many outreach opportunities that enable us to be the presence of Christ in our world. Boca Raton, FL Welcome to Saint Mark Greek Orthodox Church We are a pillar of Orthodox Christianity in South Florida, nurturing, strengthening, transforming and sharing our Faith in Jesus Christ, “glorifying God by loving one another as Christ loves us.” John 13:34 Learn About Us Upcoming Events All event times are in Eastern Standard Time (EST) Thursday - 09/11/2025 (Cancelled) Young @ Heart Game Day 1:00 pm - 4:00 pm Friday - 09/12/2025 Greek Language School 4:00 pm - 7:00 pm Saturday - 09/13/2025 Myrrhbearers Meet and Greet (Required) 10:00 am - 11:30 am Sunday - 09/14/2025 Orthros (Morning Prayers) 8:30 am - 9:45 am Divine Liturgy: Exaltation of the Cross 9:00 am - 10:00 am View Full Calendar Recent Sermons View Our Sermon Gallery Our Ministries Acolytes (Altar Boys) View Ministry Adult Education | Catechism View Ministry AHEPA View Ministry Archons of the Ecumenical Patriarchate View Ministry Athletic Club Ministry View Ministry Bereavement Ministry View Ministry Book Club View Ministry Bookstore View Ministry Caring Kitchen Outreach View Ministry Chanting Ministry View Ministry Daughters of Penelope (DOP) View Ministry Family Promise Ministry View Ministry GOYA (Grades 6-12) View Ministry Greek Festival View Ministry Greek Language School View Ministry Homebound Ministry View Ministry JOY (Grades K-5) View Ministry Koliva Ministry View Ministry Live Streaming Ministry View Ministry Mommy + Me View Ministry Myrrhbearers View Ministry Oratorical Festival View Ministry Parish Council View Ministry Philoptochos View Ministry Prayer Team View Ministry Prison Ministry View Ministry Prosfora (Holy Bread) View Ministry Saint MarksMEN Ministry View Ministry Stewardship Ministry View Ministry Summer Camp View Ministry Sunday Church School View Ministry Usher Ministry View Ministry Welcome/Greeters View Ministry Young @ Heart View Ministry Young Adult League (YAL) View Ministry Youth Dance (Syrtaki) View Ministry View All Parish Ministries View All Youth Ministries Stewardship Caring for The Needs of Others Become part of our family and learn about us as we learn about you! Becoming a Steward gives your family the ability to know everything going on at our Saint Mark Community. You will get newsletters, email blasts and other notifications of every event surrounding our Church Community. There are many benefits to enjoy! Let us become one together moving forward. Begin Your Pledge Today Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/about-us/contact-us/",
      "text": "Contact - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Contact Us Today (561) 994-4822 office@saintmarkboca.net 2100 Yamato Road Boca Raton, FL 33431 Hours Office Hours: Monday-Friday: 9AM-5PM Divine Liturgy : Sunday: 9:45 AM; Weekday: 9:00 AM Orthros (Morning Prayers): Sunday: 8:30 AM Online Inquiry Please fill out the below form for questions or for more information about Saint Mark Greek Orthodox Church. Please enable JavaScript in your browser to complete this form. Name * Phone Email * Dropdown What is this message regarding? Prayer Request Home/Hospital Visit Sacraments (ie. Baptism, Wedding, etc.) Sunday Memorial / Altar Donations Office Appointments Bookkeeping / Stewardship Hall Rentals Other Message * Please NOTE: These are messages to be delivered to our Church Office. For EMERGENCIES please call our emergency line at (561) 994-4822 Message Submit Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://www.stmarksgoc.org/contact",
      "text": "Contact  | Saint Mark Greek Orthodox Church Saint Mark Greek Orthodox Church Belleview, FL Home About Us Patron Saint Clergy Our Parish History Schedule of Services Church Etiquette Resources Our Faith Worship The Orthodox Church House of God Liturgy The Sacraments Special Services Teachings Spirituality History The Church Resources Ministries Saint Mark’s Ministries PHSO - PAN HELLENIC SOCIETY OF OCALA Parish Calendar News & Events Weekly Bulletin Sunday Bulletin Your Pledge Greek \"OPA\" Cruise Greek Festival Contact Greek Orthodox Metropolis of Atlanta Saint Mark Greek Orthodox Church Belleview, FL Home About Us Patron Saint Clergy Our Parish History Schedule of Services Church Etiquette Resources Our Faith Worship The Orthodox Church House of God Liturgy The Sacraments Special Services Teachings Spirituality History The Church Resources Ministries Saint Mark’s Ministries PHSO - PAN HELLENIC SOCIETY OF OCALA Parish Calendar News & Events Weekly Bulletin Sunday Bulletin Your Pledge Greek \"OPA\" Cruise Greek Festival Contact Contact Come and See! Welcome! We are glad you are here! Please contact us or come in person! Address: 9926 SE 36th Ave. Belleview, FL 34420 Email: stmarkoffice@stmarksgoc.org Tel.: +1 (352)245-0499 Rev. Fr. Alexander Lukashonok, Pastor cell: 847.749.5611 Email : fralexander@stmarksgoc.org Parish Council President: Linda Arvanitis 352.233.8910 Vice President: Ron Nichols 513.708.3127‬ Treasurer: Ecmel Aktalay 410.935.6479 Assistant Treasurer: John Stephanos E-mail: j71149@msn.com Secretary: Denise Drackley E-mail: elprup3@aol.com Name Email Message Captcha Code: Enter Captcha Code here: Submit DRIVING DIRECTIONS FROM OCALA Go south on 441 - then turn right on SE 95th St and turn left on 36th Ave or CR 467 - we are on the right. If you go to Belleview High Schools, you’ve gone too far. FROM THE VILLAGES Go north on 441 - then turn left on 110th St near Walgreens - go west and turn right on CR 467 - just past Belleview High School we are on your left - if you go to 95th St, you’ve gone too far. Online Chapel Saints, Feasts, and Readings for 09/11/2025 Theodora of Alexandria Today's Readings St. Paul's Letter to the Galatians 1:1-3, 20-24; 2:1-5 John 12:19-36 Saints and Feasts Commemorated Theodora of Alexandria; Euphrosynos the Cook; Demetrios & Evanthea the Martyrs & their son Demetrianos; Sergius and Herman of Valaam, Finland; Afterfeast of the Nativity of the Theotokos; Deinol the First Bishop of Bangor Visit the Online Chapel for more daily readings, hymns, a monthly calendar of saints and feasts, and more. Saint Mark Greek Orthodox Church 9926 SE 36th Ave. / CR467 Phone: (352) 245-0499 | Email Us About Us Our Patron Saint Schedule of Services Contact Us Our Ministries Our Faith Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    },
    {
      "url": "https://saintmarkboca.net/ministry/adult-education-catechism/",
      "text": "Adult Education | Catechism - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Adult Education | Catechism Adult Education | Catechism Working together with our Clergy and educational team, our Adult Education and Catechism is a vital component of life at Saint Mark. We spread the love, truth, and good news of Jesus Christ, the pathway to eternal salvation, through education on the history, beliefs, and mystical theology of the Orthodox Christian Church. We offer various instructional classes throughout the year during different times. Each class offers foundational teachings of our Orthodox Christian Faith and are open to all believers. Discover Orthodoxy – 5 week class directly following our Festival in January, designed for first-time inquirers, catechumens, as well as our faithful who want to draw closer to the Church. Topics include: Church History; Scripture and Tradition; Sacramental Theology; Personal Devotion and Salvation; What’s Next? A Church Tour. Rotating Catechism Class (August) – Each 4-5 session class will explore essential aspects of Orthodox beliefs. The Mother of God (Theotokos) class will explore her profound role in theology and devotion, culminating in a celebration of the Dormition feast on August 15th. This Liturgical Life class provides a dynamic overview of the Divine Liturgy and an explanation of many of the Church’s liturgical practices. Our class on the Nicene Creed engages participants in the historical and theological discussions surrounding the Nicene-Constantinopolitan Creed, with an eye on Scripture and practical application to our worshipful response to God. Finally, we explore the Orthodox Old Testament book, Wisdom of Sirach (Ecclesiasticus), engaging timeless teachings on humility and relationships and fostering a deeper commitment to walking with our Lord. Bible Study – Offered seasonally on Tuesdays at 6:00 PM (following Daily Vespers in our Sanctuary), on different books of the Bible. We utilize the Orthodox Study Bible (New King James Version) as our translation. Each season we exegete a different book of the Bible, and help with practical and daily application. Synaxis – A group discussion taking place each Thursday throughout the Ecclesiastical year at 11:00 AM, following Supplications to the Theotokos (Paraklesis) at 10:00 AM in the Sanctuary. We hold spiritual discussions utilizing books and video productions. Thinking Theologically – In this series, our Catechist Jamey Bennett will dive below the surface of traditional Bible studies, exploring the depths of Theological concepts, Church history, and the Canonical Scriptures. Gain a deeper appreciation for our Orthodox faith as we navigate the complexities of life in light of our theological tradition on a variety of topics throughout the year. This class is offered about a month on Sundays after coffee hour. If you are interested in joining or learning more about the Orthodox Christian Faith, please contact us. CLICK HERE TO DOWNLOAD OUR CATHECHISM & ADULT EDUCATION DOCUMENT Recommended Pages: Our Life In Christ No Other Foundation Ministry Leadership Jamey Bennett Ministry Sign-Up Ministry Sign-Up Ministry Information Please enable JavaScript in your browser to complete this form. Name * Phone Email * I would like more information on the following adult ministries...(Check all that apply) Adult Education | Catechism AHEPA Archons Bereavement Ministry Book Club Book Store Caring Kitchen Chanters | Music Daughters of Penelope (DOP) Family Promise (Homeless Outreach) Homebound Visitations Koliva Ministry Live Stream Ministry Parish Council Philoptochos Prayer Team Prison Ministry Prosfora Baking Saint MarksMEN Ushers Welcome | Greeters Young @ Heart I would like more information on the following youth ministries...(Check all that apply) Acolytes | Altar Boys (3rd-12th Grade) GOYA (6th-12th Grade) Greek Language School JOY (K-5th Grades) Mommy + Me Myrrhbearers (3rd-6th Grade) Oratorical Festival Summer Camp Sunday Church School YAL (College/Young Professionals) Youth Dance (Syrtaki) Submit Get More Information Ministry Information Please enable JavaScript in your browser to complete this form. Name * Phone Email * I would like more information on the following adult ministries...(Check all that apply) Adult Education | Catechism AHEPA Archons Bereavement Ministry Book Club Book Store Caring Kitchen Chanters | Music Daughters of Penelope (DOP) Family Promise (Homeless Outreach) Homebound Visitations Koliva Ministry Live Stream Ministry Parish Council Philoptochos Prayer Team Prison Ministry Prosfora Baking Saint MarksMEN Ushers Welcome | Greeters Young @ Heart I would like more information on the following youth ministries...(Check all that apply) Acolytes | Altar Boys (3rd-12th Grade) GOYA (6th-12th Grade) Greek Language School JOY (K-5th Grades) Mommy + Me Myrrhbearers (3rd-6th Grade) Oratorical Festival Summer Camp Sunday Church School YAL (College/Young Professionals) Youth Dance (Syrtaki) Submit Get More Information Upcoming Events Sunday - 09/14/2025 Thinking Theologically (Adult Catechism) 12:00 pm - 1:00 pm Sunday - 10/12/2025 Thinking Theologically (Adult Catechism) 12:00 pm - 1:00 pm Sunday - 11/9/2025 Thinking Theologically (Adult Catechism) 12:00 pm - 1:00 pm Sunday - 12/7/2025 Thinking Theologically (Adult Catechism) 12:00 pm - 1:00 pm View Full Calendar View Our Gallery Our Ministries Athletic Club Ministry View Ministry Greek Festival View Ministry Young @ Heart View Ministry Welcome/Greeters View Ministry Usher Ministry View Ministry Stewardship Ministry View Ministry Saint MarksMEN Ministry View Ministry Prosfora (Holy Bread) View Ministry Prison Ministry View Ministry Prayer Team View Ministry Live Streaming Ministry View Ministry Koliva Ministry View Ministry Homebound Ministry View Ministry Family Promise Ministry View Ministry Daughters of Penelope (DOP) View Ministry Chanting Ministry View Ministry Caring Kitchen Outreach View Ministry Bookstore View Ministry Book Club View Ministry Bereavement Ministry View Ministry AHEPA View Ministry Archons of the Ecumenical Patriarchate View Ministry Philoptochos View Ministry Parish Council View Ministry Youth Dance (Syrtaki) View Ministry Young Adult League (YAL) View Ministry Sunday Church School View Ministry Summer Camp View Ministry Oratorical Festival View Ministry Myrrhbearers View Ministry Mommy + Me View Ministry JOY (Grades K-5) View Ministry Greek Language School View Ministry GOYA (Grades 6-12) View Ministry Acolytes (Altar Boys) View Ministry Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/contact/",
      "text": "Contact - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Contact Us Today (561) 994-4822 office@saintmarkboca.net 2100 Yamato Road Boca Raton, FL 33431 Hours Office Hours: Monday-Friday: 9AM-5PM Divine Liturgy : Sunday: 9:45 AM; Weekday: 9:00 AM Orthros (Morning Prayers): Sunday: 8:30 AM Online Inquiry Please fill out the below form for questions or for more information about Saint Mark Greek Orthodox Church. Please enable JavaScript in your browser to complete this form. Name * Phone Email * Dropdown What is this message regarding? Prayer Request Home/Hospital Visit Sacraments (ie. Baptism, Wedding, etc.) Sunday Memorial / Altar Donations Office Appointments Bookkeeping / Stewardship Hall Rentals Other Message * Please NOTE: These are messages to be delivered to our Church Office. For EMERGENCIES please call our emergency line at (561) 994-4822 Message Submit Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/our-staff/",
      "text": "Our Staff - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Our Staff Staff Dawn Riger Parish Administrator Ana Voicu Bookkeeper Joanne Scheller Realm Coordinator Maria Horey Office Assistant Juliana Leondis Office Assistant Giovanni (Gio) Lagomarsino Grounds Supervisor Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/our-clergy/",
      "text": "Our Clergy - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Our Clergy Clergy Rev. Father Mark A. Leondis Senior Pastor frmarko@saintmarkboca.net Father Anastasios Hallas Assistant Priest franastasios@saintmarkboca.net Rev. Fr. Alexander G. Leondis Pastor Emeritus Rev. Deacon John Christakis, MD Deacon Rev. Deacon Bryan John Shelby Deacon Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    },
    {
      "url": "https://saintmarkboca.net/our-patron-saint/",
      "text": "Our Patron Saint - Saint Mark Greek Orthodox Church Skip to content Live Broadcast Calendar Home Ministries Youth Ministries Acolytes (Altar Boys) GOYA (Grades 6-12) Greek Language School JOY (Grades K-5) Mommy + Me Myrrhbearers Oratorical Festival Summer Camp Sunday Church School Youth Dance (Syrtaki) Parish Ministries Parish Council Philoptochos Koliva Ministry Caring Kitchen Outreach Adult Education | Catechism Archons of the Ecumenical Patriarchate AHEPA Bereavement Ministry Book Club Bookstore Chanting Ministry Daughters of Penelope (DOP) Family Promise Ministry Homebound Ministry Live Streaming Ministry Prayer Team Prison Ministry Prosfora (Holy Bread) Saint MarksMEN Ministry Usher Ministry Welcome/Greeters Young Adult League (YAL) Young @ Heart Stewardship Endowment Fund Sacraments 40 Day Blessing Baptism Confession Good Standing Letter Marriage Memorials Media/News Live Broadcast Sermons | What We Believe Video Archive Worship Guide Lion’s Heart Blog Events Greek Festival About Us First Time Visitor Mission Statement Our Patron Saint FAQ’s About The Orthodox Church Our Clergy Our Staff Contact Give Today Our Patron Saint THE APOSTLE MARK was from Cyrene of Pentapolis, which is near Libya. Having come to the Faith of Christ through the Apostle Peter, he followed him to Rome. While there, at the prompting of Saint Peter himself and at the request of the Christians living there, he wrote his Gospel in Greek. His Gospel account is the generally considered earliest of the four, and it is second in order after Matthew's. He is one of the 70 Apostles. In AD 49 (about 19 years after the Ascension of Jesus), travelling to Egypt, he preached the Gospel there and was the first to establish the Church in Alexandria (thus he founded the Church in Alexandria and is considered the founder of Christianity in Africa). Tradition tells us that he completed his life in martyrdom about the year 68. The idolaters, unable to bear his preaching, seized him, bound him with ropes, and dragged him through the streets until he, cut to pieces on rocks, gave up his soul.  He is depicted in holy icons with a lion next to him, one of the living creatures mentioned by Ezekiel (1:10), and a symbol of Christ's royal office. Apolitikion Of Saint Mark  - 4th Tone Saint Peter's companion and sacred partner were you, and servant of Christ – the Logos – and His herald most wise, O Holy Apostle Mark. You, O inspired mystic of the heavens, recorded for all of us the Savior's most divine and Holy Gospel. Therefore, O Evangelist, we lovingly honor you. Του Πέτρου συνέκδημος, και κοινωνός ιερός, του Λόγου διάκονος, και υποφήτης σοφός, εδείχθης Απόστολε. Οθεν το του Σωτήρος, Ευαγγέλιον Θείον, Μάρκε διαχαράτεις, ως ουράνιος μύστης. Διό Ευαγγελιστά σε, πόθω γεραίρομε. Apolitikion Of Saint Mark  - 4th Tone Saint Peter's companion and sacred partner were you, and servant of Christ – the Logos – and His herald most wise, O Holy Apostle Mark. You, O inspired mystic of the heavens, recorded for all of us the Savior's most divine and Holy Gospel. Therefore, O Evangelist, we lovingly honor you. Του Πέτρου συνέκδημος, και κοινωνός ιερός, του Λόγου διάκονος, και υποφήτης σοφός, εδείχθης Απόστολε. Οθεν το του Σωτήρος, Ευαγγέλιον Θείον, Μάρκε διαχαράτεις, ως ουράνιος μύστης. Διό Ευαγγελιστά σε, πόθω γεραίρομε. Interested In Learning More About The Orthodox Church? If you would like to learn more about the Orthodox Church and grow in your walk of faith, please click on the button and fill out a short online form. One of our staff will be in contact to answer any questions you may have. I Would Like More Information Please enable JavaScript in your browser to complete this form. Name * Phone Email * City of Residence Current Faith Message * Name Submit I Want To Learn More Saint Mark Greek Orthodox Church Address & Contact Information 2100 Yamato Road Boca Raton, FL 33431 561.994.4822 office@saintmarkboca.net Office Hours: Monday-Thursday: 9AM-5PM Service Hours Sunday Services: 8:30 AM Orthros (Morning Prayers) 9:45 AM Divine Liturgy Weekday Services: (According to Calendar) 9:00 AM Liturgy - Weekday Join Our List Please enable JavaScript in your browser to complete this form. Name * Email * Submit The Saint Mark Family We Glorify God by loving one another as Christ loves us. (John 13:34) The Saint Mark Family © 2025 Saint Mark Greek Orthodox Church. All Rights Reserved. Website Design by: 4 Elements Agency"
    }
  ]
}