{
  "fuentes": [
    {
      "url": "https://www.wjhg.com/2025/01/15/salty-goat-saloon-hosts-their-9th-annual-polar-plunge/",
      "email": "publicfile@wjhg.com"
    },
    {
      "url": "https://www.wjhg.com/2025/01/15/salty-goat-saloon-hosts-their-9th-annual-polar-plunge/",
      "email": "shaun.breaux@gray.tv"
    },
    {
      "url": "https://eu.newsherald.com/story/lifestyle/things-to-do/2018/01/01/polar-plunge-honors-salty-goat-saloon-owner/16701249007/",
      "email": "edion@pcnh.com"
    },
    {
      "url": "https://www.saltysboardshop.com/",
      "email": "soulsurferllc@mac.com"
    },
    {
      "url": "https://www.sltrib.com/artsliving/2025/05/03/owner-legendary-utah-blues-bar/",
      "email": "gbaquero@sltrib.com"
    },
    {
      "url": "https://www.sltrib.com/artsliving/2025/05/03/owner-legendary-utah-blues-bar/",
      "email": "jharmon@sltrib.com"
    },
    {
      "url": "https://www.sltrib.com/artsliving/2025/05/03/owner-legendary-utah-blues-bar/",
      "email": "lake_2025@2x.jpg"
    },
    {
      "url": "https://www.sltrib.com/artsliving/2025/05/03/owner-legendary-utah-blues-bar/",
      "email": "pjayswal@sltrib.com"
    },
    {
      "url": "https://www.sltrib.com/artsliving/2025/05/03/owner-legendary-utah-blues-bar/",
      "email": "subscribe@sltrib.com"
    },
    {
      "url": "https://www.saltedgoat.com/contact",
      "email": "info@saltedgoat.com"
    },
    {
      "url": "https://www.cityweekly.net/utah/trandegraves-goodbyes/Content?oid=3105727",
      "email": "john@cityweekly.net"
    }
  ],
  "mails": [
    "edion@pcnh.com",
    "gbaquero@sltrib.com",
    "info@saltedgoat.com",
    "jharmon@sltrib.com",
    "john@cityweekly.net",
    "lake_2025@2x.jpg",
    "pjayswal@sltrib.com",
    "publicfile@wjhg.com",
    "shaun.breaux@gray.tv",
    "soulsurferllc@mac.com",
    "subscribe@sltrib.com"
  ],
  "nombre_sitio": "saltygoatsaloon.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.wjhg.com/2025/01/15/salty-goat-saloon-hosts-their-9th-annual-polar-plunge/",
      "text": "The Salty Goat Saloon hosts their 9th Annual Polar Plunge Skip to content Watch Live News Your County We the People National Weather Sports Chapter Chat WJHG Apps Submit Photos & Video Shop Local Homepage News State Regional National International Crime Politics Watch Live Your County Bay Calhoun Gulf Franklin Holmes Jackson Liberty Okaloosa Walton Washington Weather Closings & Delays Hurricane Hurricane Michael: 5 Years Later Live Doppler Radar Map Room Severe Weather Guide Weather Cameras Wildfire Forecast Sports Headlines Friday Night Overtime Scoreboard Share Your Highlights Student Athlete Of The Week Sports Talk Community Community Calendar Golden Apple Award Summertime Learning 850 Student Of The Week Chapter Chat NewsChannel 7 Today Live Shots with Shaun Morning Interviews Medical Monday Foodie Friday Time Travel Tuesday We the People Contests Contact Us Meet the Sales Team Advertise With Us Find a Job Internship Opportunity Meet the Team Election Results Newsletter Discover Northwest Florida Shop Local Submit Photos & Video WJHG 7+ Time Travel Sports Talk Faces and Places 7 @ 7 Community Extra Programming Schedule NextGen TV Zeam - News Streams Circle Country Gray DC Bureau InvestigateTV Watching Your Wallet PowerNation My NetworkTV Digital Marketing The Salty Goat Saloon hosts their 9th Annual Polar Plunge By Shaun Breaux Published : Jan. 15, 2025 at 12:31 PM CST Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn PANAMA CITY BEACH, Fla. (WJHG/WECP) - No one fights alone, and no one plunges alone! That is the motto Saturday, January 18th for the Salty Goat Saloon’s 9th Annual Polar Plunge. Tickets are $30 at the door and all proceeds from the plunge and raffles will go to Leukemia Research Foundation in honor of Salty Goat’s founder, Gary Gault. Registration starts at 11:00 a.m., with the plunge to follow at 1:00 p.m. at the beach access right across the street from The Salty Goat. Following the big jump, change into some dry clothes and continue the celebration at The Salty Goat with raffle prizes and more! Copyright 2025 WJHG. All rights reserved. Most Read Conservative activist Charlie Kirk dead after being shot at university event; initial persons of interest released Open carry ban ruled unconstitutional in Florida Former Sneads High softball coach pleads guilty after sexual misconduct with player Hand soap recall expanded to include shampoos, lotions, sanitizers over sepsis concerns Suspect dead and 2 critically injured in shooting at Colorado high school, officials say Bodycam footage released from officer involved shooting in Fountain, FL Political analyst Matthew Dowd loses his MSNBC job following comments about Charlie Kirk ‘Wrong place at the wrong time’: FDLE announces arrests in shooting of FSU football player Latest News ‘I don’t want my friends to be forgotten,’ first responder recalls 9/11 attack 16-year-old Colorado high school shooter ‘radicalized by extremist network,’ authorities say ‘I don’t want my friends to be forgotten,’ first responder recalls 9/11 attack South Walton first responders run in honor of 9/11 Sowal Fire District Memorial Run FBI releases photos of person of interest in Charlie Kirk shooting Changes coming to millage rates in Walton County Changes coming to millage rates in Walton County News Sports Weather Contact Us Advertise with Us Programming Shop Local Submit Photos & Video Find a Job Hurricane Facebook Twitter Instagram WJHG 8195 Front Beach Road Panama City Beach, FL 32407 (850) 234-7777 Public Inspection File publicfile@wjhg.com - (850) 234-7777 Closed Captioning/Audio Description Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "https://eu.newsherald.com/story/lifestyle/things-to-do/2018/01/01/polar-plunge-honors-salty-goat-saloon-owner/16701249007/",
      "text": "Polar plunge honors Salty Goat Saloon owner News Sports Entertainment Opinion Advertise Obituaries eNewspaper Legals THINGS-TO-DO Polar plunge honors Salty Goat Saloon owner Participants brave cold in remembrance of Gary Gault ERYN DION edion@pcnh.com PANAMA CITY BEACH — With temperatures hovering around 40 degrees and a 13 mph wind pushing the windchill down below freezing, the second annual Not-So-Polar Plunge was considerably more polar than many of the participants anticipated. But that didn’t deter the handful of “plungers” crossing the empty beach across from the Salty Goat Saloon on Monday afternoon and running into the deceptively calm and inviting Gulf — after all, they had a tradition to uphold. “I’m still tingling,” Harrison Gregory said after getting out of the water, covered in goosebumps and draped in a towel. “It was a little revitalizing, honestly.” The event was started by the saloon’s owner, Gary Gault, to raise awareness for post-traumatic stress disorder but his closer to home this year, when it was Gault himself who needed help. After being sick all summer, Gault was diagnosed with acute myeloid leukemia, a rare form of blood cancer that spreads quickly and is notoriously difficult to detect. Just one month later, on Dec. 21, Gault died, leaving the Salty Goat Saloon family devastated. “We decided to dedicate this one to him,” said Jeremy Mers, who works at the saloon and organized this year’s plunge. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Gault didn’t have health insurance, and originally, the event was meant to help raise money to cover his treatments. With his passing, Mers said the money raised will help ease some of the medical debt passed on to his wife and daughter. Before the event, the saloon was packed to the brim, everyone wearing orange ribbons — the color for AML awareness — and sharing stories about Gault, who will always have a space at the bar with his favorite liquor ready and his chair tilted up. Beyond the plunge, which drew eight brave souls, the saloon held an event all day to raise money, with local businesses donating hundreds of dollars in gift cards and prizes for people to win. Though there were fewer “plungers” than expected — last year it was about 50 degrees out and there were many more participants — everyone who did turn out was appreciated. “It really means a lot, seeing everyone still wanting to support something he started last year,” said Gault’s daughter, Caitlin Calloway. “We all consider each other family.” Because its symptoms are so similar to a cold or flu, AML can be extremely difficult to detect, and often, people won’t see a doctor until it’s too late. Taking the stage before the plunge, Mers urged everyone to remember Gault and get tested early if they feel like something is wrong. “If there’s something you just can’t shake, go get tested,” he said. Anyone who wishes to donate to Gault’s family can do so at https://www.gofundme.com/gary-gaults-medical-bills. Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.newsherald.com. All rights reserved."
    },
    {
      "url": "https://www.saltysboardshop.com/",
      "text": "Salty's Board Shop - Salty's Board Shop 0 Items - $0.00 My account / Register Home MENS FOOTWEAR RAINBOW SANUK REEF HARI MARI TOPS HOODIES & PULLOVERS BUTTON UPS & KNITS TEES RASHGUARDS TANKS FLANNELS BOTTOMS DENIM, CHINOS, LOUNGE AND MORE BOARDSHORTS & HYBRIDS WALKSHORTS & VOLLEYS JACKETS, HOODIES & FLEECE HATS & BEANIES WALLETS ACCESSORIES SOCKS WOMENS TOPS SWEATERS & CARDIGANS BLOUSES & KNITS HOODIES & FLEECE TEES & TANKS BUTTONDOWNS BOTTOMS BOARD SHORTS JEANS, PANTS & LEGGINGS SKIRTS SHORTS DRESSES/ROMPERS ROMPERS SHIFT SUN MAXI COVER-UPS JACKETS & HOODIES SWIM TOPS BOTTOMS ONE PIECE BOARDSHORTS ACTIVEWEAR SPORTSBRAS SHORTS PANTS/LEGGINGS ACCESSORIES BAGS & SATCHELS WALLETS SCARVES HAIR ACCESSORIES HATS BRALETTES JEWELRY SOCKS FOOTWEAR REEF SANUK RAINBOW HARI MARI BILLABONG ONEILL KIDS FOOTWEAR RAINBOW REEF TOPS TEES BOTTOMS BOARDSHORTS WALKSHORTS ACCESSORIES FOOTWEAR SURF AND PADDLE PADDLE BOARDS OTHER ACCESSORIES RACKS, STRAPS, & PADS PADDLES WAX Surf Hardware SURF BOARDS SKATE WHEELS DECKS STREET LONGBOARD TRUCKS INDEPENDENT PARIS THUNDER CALIBER ACE SEISMIC BEAR GULLWING KRUX HARDWARE AND ACCESSORIES BEARINGS HARDWARE WAX RISERS BUSHINGS BARRELS & CONES STREET COMPLETES LONGBOARD COMPLETES HELMETS & PADS TRIPLE EIGHT PRO TEC 187 SLIDE GLOVES GRIP TAPE SNOW ACCESSORIES GOGGLES FIRST LAYER MEN WOMEN BOARDS HELMETS BINDINGS OUTERWEAR MEN WOMEN Snowboarding Gloves SUNGLASSES SMITH OPTICS SUNCLOUD RAYBAN SHWOOD COSTA DEL MAR CARVE A DAY IN THE SUN SUNSCREEN AFTER SUN BEACH BLANKETS & TOWELS OTHER FUN STUFF PHONE CASES/CHARGERS CANDLES FOR YOUR PUP CAMP WARES HAMMOCKS HAMMOCK CHAIRS CBD Balance boards STRAPS BAGS AND PACKS TRAVEL BAGS BACKPACKS MESSENGER BAGS ACCESSORIES UNISEX HATS KEYCHAINS WATCHES BOTTLE OPENERS STICKERS WAKE Brands WOMENS 1285 MENS 923 SUNGLASSES 599 LONGBOARD COMPLETES 78 DECKS 88 HAMMOCKS 12 For the days when only a romper will do, our Stephie Romper is the ultimate throw-it-on-and-go piece. Crafted from double cloth fabric for a flowy fit, this cute but comfy wardrobe staple includes pockets (yep, you heard that right!) and adjustable ties. Add to cart LSPACE STEPHIE ROMPER $119.00 COSTA SWELLS STRAW LIFEGUARD HAT NATURAL Add to cart COSTA COSTA SWELLS STRAW LIFEGUARD HAT NATURAL $32.00 Sign up for our newsletter: Subscribe Customer service About us Payment methods Shipping & returns Customer support Sitemap Products All products New products Offers Brands RSS feed My account Register My orders My wishlist SALTY'S BOARD SHOP 2712 DEVINE STREET COLUMBIA, SC 29205 (803) 748-9946 [email protected] © Copyright 2025 Salty's Board Shop\n                    \t- Powered by Lightspeed"
    },
    {
      "url": "https://www.sltrib.com/artsliving/2025/05/03/owner-legendary-utah-blues-bar/",
      "text": "Owner of legendary Utah blues bar dies John Paul Brophy Jr., owner of Utah’s iconic Dead Goat Saloon, dies at age of 74 Brophy was instrumental in curating Utah’s music scene. (Trent Nelson | The Salt Lake Tribune) John Paul Brophy Jr., one of the owners of Salt Lake City's Dead Goat Saloon, inside the bar standing near autographed celebrity portraits in September, 2003. Brophy died at the age of 74 on April 28, 2025. Brad Wheeler found out his longtime friend and Salt Lake City music scene staple John Paul Brophy Jr. was dying in an email from the man himself. Brophy’s farewell email was deeply personal, Wheeler said, so much so that it prompted him to make sure Brophy was recognized for his enduring legacy in the Utah music scene. Wheeler wrote to Salt Lake City Mayor Erin Mendenhall, who went on to proclaim April 23 as “John Paul Brophy Jr. Day” in recognition of his contribution to the culture and music scene in the state. Brophy, one of the owners of the iconic local blues bar The Dead Goat Saloon , died on April 28 at the age of 74 from prostate cancer. Even though the bar closed over 20 years ago, it’s not just a footnote in Utah’s music history, thanks in large part to Brophy. The same can be said about Brophy’s influence on the music scene in Salt Lake City. Under Brophy’s and his business partner Michael Ricks’ direction, the bar became the “ premier venue for blues ” music, though acts from all genres stopped at the hidden venue — from Buddy Miles to Mick Taylor of The Rolling Stones to Levon Helm. “[Brophy] and Otto Mileti at The Zephyr Club really were the backbone of live music in Salt Lake City,” Wheeler said. The Dead Goat Saloon became a music hub for those looking to learn about the history of blues and Americana music. Wheeler met Brophy through their shared love of blues music at another bar in Salt Lake, but Wheeler already knew of Brophy through reputation: this was the co-owner of the bar that broadcasted live music on KRCL on the last Monday of each month. (Trent Nelson | The Salt Lake Tribune) A composite 2003 photograph of The Dead Goat Saloon on a quiet night in Salt Lake City. “It was a weird bar. You had to walk down an alley and then go down in the basement and go underneath this other building to get to it,” Wheeler, who later worked at Dead Goat as a manager in the late ‘90, said. “When you searched it out and you went in there, it was a unique experience, because the whole world was in there.” The Dead Goat Saloon was established in 1973. Brophy bought an ownership stake in the bar around 1990, while he was writing music reviews for The Salt Lake Tribune and writing for City Weekly (under the pen name J. P. Gabellini). Wheeler said that Brophy was a steward of music history and gave “a lot of these old guys that couldn’t get a gig in the rest of the United States a place to come and perform.” The bar remains in the performer’s memories, too, like Texas blues musician Carolyn Wonderland , who said she played nearly a dozen shows at The Dead Goat Saloon. “Going to play for John Paul at The Dead Goat Saloon was a highlight on tours,” Wonderland said. “There’s something magic about that place, and the fact that he brought in a community. We’d go play places as a band that nobody’s heard of, and we would come to Salt Lake City and be like, ‘We know at least we’re gonna have John Paul and his friends at the radio station.’” (Trent Nelson | The Salt Lake Tribune) A composite 2003 photograph of The Dead Goat Saloon on a quiet night in Salt Lake City. Dead Goat closed in 2003 while under new ownership. It had been turned into a strip club. Wonderland wrote a song about the bar’s demise with guitarist Scott Daniels. “We danced our cares away underneath the Utah moon / All night at The Dead Goat Saloon,” the lyrics of the chorus go. Wonderland has only demoed the unreleased song, but is “highly tempted” to play it the next time she comes to town to honor Brophy – who heard it on a broadcast when Wonderland performed it at the High Sierra Music Festival in California. “He always brought a family around him,” Wonderland said of Brophy. “To be a safe haven for touring bands, and at the same time, be supporting your local artists the way he did … It was great.” In Mayor Mendenhall’s proclamation, she wrote, “Under [Brophy’s] mentorship and advocacy, The Dead Goat Saloon served as [an] incubator for young Utah bands.” Bands like The Tempo Timers, Megan Peters and Big Leg, and My Sister Jane had “formative gigs” at the bar. Brophy and Ricks would also sponsor “New Band Night” midweek to support local musicians. Charles Thorpe, who founded Anchor Stage Management and runs Space and Faders — a rentable space where musicians and bands can practice or record — was hired at Dead Goat at the end of the ‘90s. But the first time he went to the bar was long before that – at the age of 18 when he moved to Utah from Pennsylvania. “To end up years later, working there was kind of surreal,” Thorpe, who describes Brophy as a “father figure” said. Thorpe is now a stage manager for concerts at Red Butte Garden and Sandy Amphitheater, and has been entrenched in the local music scene for years. He said what Brophy was able to accomplish all those years ago laid a strong foundation for music in Utah. “He paved the way for what is kind of going on now [in the local music scene],” Thorpe said. “[Brophy’s] ethos is still strong in this city,” Thorpe said, tearing up as he detailed Brophy’s legacy. “What matters is that nobody forgets, because they say that you’re only truly dead when someone stops saying your name.” (Trent Nelson | The Salt Lake Tribune) Gigi Love performs at the Dead Goat Saloon in Salt Lake City in 2000. Brophy was born in Salt Lake City, Utah on January 24, 1951. He is preceded in death by his wife Wendy Whitney, brother and mother. At the age of 20, Brophy got into a motorcycle accident that left him with a lifelong spinal cord injury. He is survived by his daughter Rachael MacLaughlin and his beloved white Scottie, Willie. MacLaughlin said she was the only one who didn’t get an email, but rather a face-to-face message on Easter, when Brophy had his last meal. She and her dad shared a connection over music. “My life will be forever different,” she said. “He’s going to be missed by me and a lot of other people.” Services for Brophy will remain private, but MacLaughlin is planning a celebration of life event with details to come. RELATED STORIES Whatever happened to The Dead Goat Saloon? Randy Stinson, the face of record stores in Utah, dies at age 83 Sponsored Story Here’s how a company earns Top Workplaces honors Sponsored: The Salt Lake Tribune and Energage recognize standout organizations that prioritize a people-first culture through a rigorous, science-backed survey process. CONNECT Facebook X Instagram YouTube RSS SUBSCRIPTIONS Subscribe to Print + Digital Subscribe to Digital Only Digital Access for Print Subscribers Email Newsletters Login to your Print Account Login to your Digital Account Subscription FAQs Help and Contact Info Gift Subscriptions ABOUT US History and Mission Our Nonprofit Model Board and Advisers Officers and Staff Supporters Tax Filing and Governance Share Your Opinion Meet the Editorial Board Privacy Policy California Privacy Editorial Policies and Ethics MORE Advertise with Us Legal Notices Store Archives Story Tips Support The Tribune Join The First Amendment Society Gift Acceptance Policy Cookie Preferences Commenting Policy ABOUT US TERMS OF SERVICE PRIVACY POLICY EDITORIAL POLICY NEWS TIPS ADVERTISE CONTACT US/HELP GIFT ACCEPTANCE POLICY SUBSCRIBE PRINT EDITION EMAIL NEWSLETTERS JOIN THE FIRST AMENDMENT SOCIETY SUPPORT THE TRIBUNE SHARE YOUR OPINION MEET THE EDITORIAL BOARD COOKIE PREFERENCES Report a missed paper by emailing subscribe@sltrib.com or calling 801-237-2900 For e-edition questions or comments, contact customer support 801-237-2900 or email subscribe@sltrib.com sltrib.com © 1996- 2025 The Salt Lake Tribune. All rights reserved."
    },
    {
      "url": "https://www.saltedgoat.com/contact",
      "text": "contact | the salted goat top of page home menus reservations contact jobs Contact Address 2 S Charles Richard Beall Blvd DeBary, FL 32713 Contact Opening Hours 386-320-0217 info@saltedgoat.com Monday Tuesday Wednesday Thursday Friday Saturday Sunday Closed Closed 3:00 pm - 9:00 pm 10:00 am - 9:00 pm 10:00 am - 10:00 pm 10:00 am - 10:00 pm 10:00 am - 3:00 pm Brunch/lunch Thurs-Sun 'til 3pm Happy Hour Wed-Sat 3-6pm Dinner starts at 5pm © 2023 by The Salty Kat LLC bottom of page"
    },
    {
      "url": "https://www.cityweekly.net/utah/trandegraves-goodbyes/Content?oid=3105727",
      "text": "Très Goodbyes | Private Eye | Salt Lake City Weekly Switch to the mobile version of this page. Support the Free Press | Facts matter. Truth matters. Journalism matters Salt Lake City Weekly has been Utah's source of independent news and in-depth journalism since 1984. Donate today to ensure the legacy continues. Salt Lake City Weekly Follow Us Facebook Twitter YouTube Instagram Email All in Articles & Posts in Events in Locations in Videos Username / View Profile / Edit Profile / Log Out Log in / Create Account News A&E Eat & Drink Music Film Best of Utah Events Beer Fest Marketplace Browse News Cover Stories News Features 40th Anniversary Blogs Hits & Misses Citizen Revolt Opinion Soap Box Private Eye News of the Weird Browse Music Music Features Music Picks Browse A&E A&E Features Entertainment Picks Cannabis Free Will Astrology Browse Best of Utah Best of Utah 2024 VOTE Best of Utah 2025 Best of Utah 2023 Best of Utah 2022 Best of Utah 2021 Best of Utah 2020 Best of Utah 2019 Best of Utah 2018 Best of Utah Body & Mind Browse Marketplace CW Store CW Tix Browse Eat & Drink Restaurant Reviews Restaurant Listings Beer Nerd Browse Home Best of Utah 2022 Browse News Citizen Revolt (mobile) Browse Best of Utah Vote Best of Utah 2025 Browse Things To Read News Food & Drink Music Culture Browse Things To Read News Food & Drink Music Culture Browse Things To Do Promotions Events Browse Film Film Reviews Browse Places Restaurant Listings Browse Best Of Best of Utah 2022 Best of Utah 2023 Best of Utah 2024 Best of Utah 2022 Best of Utah 2021 Best of Utah 2020 Best of Utah 2019 Best of Utah 2018 Best of Utah Body & Mind By John Saltas Private Eye December 16, 2015 News » Private Eye Très Goodbyes Losing Dead Goat Saloon and Johanna's Kitchen means we lose part of who we are. Tweet Pin It Print Favorite Saving… click to enlarge By John Saltas Private Eye Do you have a special memory from either the Dead Goat Saloon or Johanna's Kitchen? Jeff Chipian: Johanna's scones. I black out until I see one on my plate, so the rest is a little blurry. Mason Rodrickc: When I first moved to Salt Lake City, I was a 14-year-old amoeba trying to find myself. Some new friends took me in my bright red, totally quirky polyester slacks and pearl-snap shirt to my first show Lo-Fi Cafe (post-Dead Goat). It was a vibrant and welcoming vision of city that I knew I would soon call home. Paula Saltas: I remember John Saltas wearing his white Dead Goat Saloon sweatshirt almost daily. Best article of clothing he's ever had. It reminds us of great times and John Paul. Josh Scheuerman: Pete Yorn played at the Dead Goat on his first U.S. tour in support of the album MusicForTheMorningAfter . After his show, a few pints and a wonderful cover of the Smiths' \"Panic,\" he went on to success and accolades, but a few domestic beers in a basement bar set a good stage from which to be launched. Stephen Dark: Watching former Real Salt Lake General Manager Garth Lagerwey shovel down a massive breakfast—pancakes at Johanna's were always stellar—while he dissected RSL's performance. Much like Gordon Gekko in Oliver Stone's Wall Street , he had no time to stop for lunch. Alissa Dimick: My grandma's favorite restaurant was Johanna's. On my wedding day, we had breakfast there to remember her on my special day—she had passed four years earlier. The staff there was so kind to us, and they helped give me a most memorable day. My grandmother baked homemade bread. With each batch, she placed a bit of dough in the frying pan with some Crisco and fried it into what she said were scones. I think, though, and tasty as they were (made more so with slathers of butter and homemade elderberry jam) they were just fried dough. The next time I'd see anything like them was years later at the Utah State Fairpark where a food stand was selling Navajo tacos, which were nearly the same except for the slathering of beans. In the early 1970s, I had my first Johanna's Kitchen version of a scone—a flying-saucer-size mass of deep fried dough, deep brown, light and airy, slathered in butter. Plus jam or honey, and you had room for all three they were so big. Back then, Johanna's Kitchen was sort of remote, a South State Street way-stop surrounded by beet fields and farmland. Most everyone living in the south end of the valley ate at least one meal at Johanna's. It was homey. Breakfasts were filling and the coffee good. You could take a pie to go. I was there about two months ago (and ran into about three old familiar faces), but I didn't buy a pie. I should have because on Sunday night, Johanna's just blew to smithereens. A gas leak or something and next thing you know, egg cartons are landing half mile away, and the walls are caving in. It was quite a blast, captured by at least two security cameras at nearby businesses. I'm gonna miss those scones. Over the span of two decades plus five, we've moved over 100,000 newspapers inside of Johanna's Kitchen. It's a real shame in my view. When we lose such homey artifacts, we lose more than buildings, we lose a part of who we are and how we became how we are. Just a week earlier, a Cottonwood Heights home went up in flames, a 100-percent goner. The home belonged to Mike Ricks and his wife, Linda Steele. Mike was the bassist in the Rick Welter Band, one of the best bands ever to play in Utah. Rick Welter, a bluesman through and through hit Salt Lake City with his band, the Dynatones, and could really wail on his guitar. To his side, keeping beat and looking cool was Mike Ricks, as fine a bassist as you'll ever hear. When Mike's home burned down, it took more than memories but also the wood and steel that comprised his vintage guitar collection, the tools of his trade. It was Mike who coined the Dead Goat's bumper sticker phrase \"Just a hop, skip, and a prayer from Temple Square.\" Some years later, Mike became partner in the Dead Goat Saloon, paired with local legend, John Paul Brophy. John Paul has written for this paper off and on since the late 1980s, and no one in this town has ever matched his passionate style, breadth of knowledge and love of blues music. When the unsafe Arrow Press Square building that housed the Dead Goat was demolished last week (long overdue thanks to decades of abuse and neglect by former owners), a piece of this city's soul went with it. I remember my first visit, before it became a blues hall—the great hockey fans, the famous goat heads, the pool tables, the beer and, scrawled onto a brick in the men's restroom this: G. Cole. That meant my Bingham Buddy Gerald Cole had beat me there. He signs his name on everything, like Kilroy. I'd like that brick. And a Goat Burger, one of the finest old-style burgers anywhere, RIP. \"I salvaged the many goat heads and the extensive collection of autographed photos of the bands that played the bar that adorned the walls, along with the vintage cash register that was the centerpiece of the front bar,\" says John Paul. \"That little bar was very much the highlight of my life.\" Among the shows John Paul lists as his favorites are Mick Taylor (a Rolling Stone), Buddy Miles (played with Jimi Hendrix), Los Lobos jamming after a Fairpark show, Levon Helm (of The Band), Texas bluesman W.C. Clark (where Stevie Ray Vaughan got his start) and John McEuen (Nitty Gritty Dirt band). Did you happen to see any of those? Among mine was Charlie Musselwhite. I'm a sucker for harmonica. Per John Paul, \"Carolyn Wonderland was one of my favorites when she used to play my club. I first heard the song Dead Goat Saloon on a live stream on the computer two years ago from a festival in Northern California when she played it in front of 10,000 people. I was doing some editing work and listening with one ear when I heard the line \"Utah moon.\" That got my full attention, and it just went over the rainbow from there; I was overwhelmed with emotion. She sent it to me in August 2013—a timely tribute after exactly 10 years since the last live music was played in the bar.\" If you can't find the song out there, I'd be happy to forward it to anyone who asks. Besides references to wall paintings, Commander Cody and Merle Haggard, Wonderland also bemoans that after John Paul and Mike, the Dead Goat became a shaker bar with pole dancers replacing the guitars. Progress? Not. That was John Paul's house, that room was s a cred, Just too much soul to hide in a downtown bar. We danced our cares away underneath a silver Utah moon, All night at the Dead Goat Saloon, Drank ourselves to death a thousand times b e fore noon, Another all-nighter at the Dead Goat Saloon. Scones and guitars and music. The real treasures. Editor's note: Visit the \"Mom and Michael Ricks' rebuild\" crowdfunding campaign at GoFundMe.com/momandmike . Send comments to john@cityweekly.net . Tweet Pin It Print Favorite Saving… Tags: Private Eye « Fire and Aim | Xmas Central » More Private Eye » Latest in Private Eye America is at its best when labor unions are strong. Private Eye By John Saltas Sep  3, 2025 A small army of Utah women dealt the Legislature a major blow on partisan gerrymandering. Private Eye By John Saltas Aug 27, 2025 Shoddy street resurfacing projects turn Murray's sleepy subdivisions into an off-road adventure. Private Eye By John Saltas Aug  6, 2025 More » Trending SLC Council approves Delta Center parking garage and emergency loans for Main Street fire damage. The Arts Issue 2025 SLC councilwoman gets an earful from west-side residents after announcement of new homeless campus. Readers also liked… Hey Utah, get off of Spotify and back into local SLC radio. Small Lake City By Bill Frost Mar  5, 2025 Tesla-driving Republicans can't handle Salt Lake City's speed bumps. Private Eye By John Saltas Mar 12, 2025 ··· Home | Who We Are | Contact | Circulation | Work With Us | Advertising | Newsletters | Guides | E-Weekly | Issue Archives | Privacy Policy / Terms of Use © 2025\n    \n      Salt Lake City Weekly Website powered by Foundation"
    }
  ]
}