{
  "fuentes": [
    {
      "url": "https://www.visitspacecoast.com/profile/cocoa-beach/american-cuisine/salty-sisters-bar-and-grill/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://satsuite.collegeboard.org/sat/testing-staff",
      "email": "tasintl@ets.org"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "tasintl@ets.org"
  ],
  "nombre_sitio": "saltysisterscb.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visitspacecoast.com/profile/cocoa-beach/american-cuisine/salty-sisters-bar-and-grill/",
      "text": "Salty Sisters Bar and Grill - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Restaurants Salty Sisters Bar and Grill Add to Wishlist Salty Sisters Bar and Grill Salty Sisters Bar and Grill is your destination for delicious food, refreshing drinks, and a welcoming atmosphere. Great bands, theme nights, drink specials and plenty of space to stretch your legs. Their menu features a variety of classic American favorites, as well as some unique twists on traditional dishes. Whether you’re in the mood for a juicy burger, a hearty salad, or a tasty appetizer, they’ve got something to satisfy your cravings. And our selection of draft beers, wines, and cocktails is sure to impress. So come join them for a meal, a drink, live entertainment or just to catch up with friends. Add to Trip Visit Website Direction 24 N Brevard Ave, Cocoa Beach, FL 32931 Contact (321) 613-2474 Discover More nearCocoa Beach All Hotels Restaurants Events Add to Wishlist Juice N Java Cafe Cocoa Beach Sip into the season with a specialty coffee from Juice N Java Cafe. Add to Trip Add to Wishlist Coastal Market Cocoa Beach Cocoa Beach Fresh • Local • Coastal At Coastal Market, you’ll find everything from handcrafted deli sandwiches and fresh-baked pastries to fresh produce, premium meats, and specialty groceries. We even cater your gatherings with custom trays and menus. Stop by and taste why we’re Cocoa Beach’s favorite neighborhood market! Enjoy  1/2 Sandwich,… Add to Trip Add to Wishlist Fuji Yama THAI and sushi Cocoa Beach Lunch special starting at $12.95, name this ad get Asahi beer for only 5 bucks! Add to Trip Add to Wishlist Boardroom Cocoa Beach Located just steps away from main street, where you can enjoy our casual but trendy atmosphere. We offer the largest selection of boutique wines at the beach by both the glass and bottle; as well as craft, classics & local beer, seltzer and a variety of other beverages like house… Add to Trip Add to Wishlist 2georges oceanside bar & grill Cocoa Beach Enjoy a glass of house wine on us with any dinner purchase! Just minutes from the Cocoa Beach Pier and world-famous Ron Jon Surf Shop, 2georges oceanside bar & grill is a local favorite for fresh seafood, especially known for our world famous jumbo lump crab cakes. We also have… Add to Trip Add to Wishlist Cape Grill and Bar Cocoa Beach Come visit Cape Grill and Bar, the hidden jewel of Cape Canaveral, to try our made-from-scratch Prix Fixe lunch or dinner offerings! We are open to the public inside the Holiday Inn Club Vacations Resort. Both menus feature appetizers of house-made Crab Rangoon Flautas or Mozzarella Sticks, along with a… Add to Trip Add to Wishlist Rebellion Beachside Bar and Bistro Cocoa Beach Enjoy a revolving 4-course prix fixe menu for $45! We are excited to change up this menu as fresh, local ingredients become available! Here’s a sample of what may be available for your reservation! 1st Course: Crudo 2nd Course: Oyster Stew 3rd Course: Roasted Chicken with Mushrooms and Truffles OR… Add to Trip Add to Wishlist American Cab Co Cocoa Beach American Cab is the trusted transportation partner for airports, train stations, bus stations, theme parks, or cruise terminals. Reliable and secure cab services are offered to all destinations in Brevard County and beyond. Enjoy door-to-door service, flat rates to local airports and attractions, and the peace of mind of traveling… Add to Trip Add to Wishlist Shark Tank Cocoa Beach Vacation Rentals Cocoa Beach Come to Shark Tank Vacation Rentals, your exclusive getaway just steps from downtown Cocoa Beach and the pristine shores of Florida’s Space Coast. Each unit in our newly renovated quadplex features two bedrooms, a bathroom, and a stylish blend of seaside charm and contemporary elegance. Spend your days surfing, relaxing… Add to Trip Add to Wishlist Space Coast Sights LLC Cocoa Beach Our family owned small business offers excursions that highlight Natural Florida (including hike options), a historic village with a waterfront park, and famous landmarks on sandy beaches. Visit coastal communities of Cocoa, Merritt Island, Cocoa Beach, and Cape Canaveral where dining, entertainment, wildlife, education, and relaxation await. Our sightseeing destinations… Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Kabob-a-licious Cocoa Beach Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a… Add to Trip Add to Wishlist Central Florida Kayaking Inc. Cocoa Beach Central Florida Kayaking offers guided kayak tours throughout Brevard County, including Merritt Island, Cocoa Beach, Melbourne, and other locations near Orlando. Kayaking tours explore the beauty of The Thousand Islands, mangrove tunnels, and the Indian River Lagoon. If you would like to see dolphins, manatees, and wild birds, or experience… Add to Trip Add to Wishlist Skull & Books VR Cocoa Beach Discover the Space Coast’s most unique adventure! Skull & Books VR combines the magic of a cozy used bookstore with the excitement of a cutting-edge VR arcade—all in one unforgettable destination. Whether you’re solving mysteries in an immersive VR escape room, battling alongside friends in multiplayer games, or just picking… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist MoonShine A Plant Based Kitchen MoonShine A Plant Based Kitchen is Cocoa Villages go to destination for fresh, flavorful, and 100% vegan cuisine. We specialize in creative plant based dishes, made from scratch and locally sourced ingredients when possible, offering a menu that’s nourishing as it is delicious. From vibrant bowls and comfort food classics... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist End of Summer Party Join us as we bid farewell to summer at Space Coast Harley-Davidson on Saturday, September 20 from 12-4p! We’ll have Live Music featuring Rising Lion, bikini bike wash, vendors and good food by Like Grandma’s Kitchen and SpaceCat’s Kitchen, plus, check out Bonehead Beard Care! Don’t miss out on the... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Name This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://satsuite.collegeboard.org/sat/testing-staff",
      "text": "SAT Weekend Testing Staff | College Board Before going to your test center, remember to download Bluebook™ and complete exam setup on your testing device. When you finish, you'll get an admission ticket that you need to bring on test day. SAT Suite of Assessments Home SAT SAT Home My SAT What's on the SAT SAT Dates and Deadlines Registration Accommodations Device Readiness Device Lending What to Bring and Do on Test Day SAT Scores SAT Testing Staff SAT Test Center Search Check for Test Center Closings Help Center: Students Help Center: Professionals and Educators Test Security and Fairness SAT Testing Rules SAT School Day SAT School Day Home SAT School Day Test Dates Taking SAT School Day Accommodations SAT School Day Scores SAT School Day Testing Rules PSAT/NMSQT PSAT/NMSQT Home PSAT/NMSQT Test Dates What's on the PSAT/NMSQT? Taking the PSAT/NMSQT PSAT/NMSQT Scores Scholarships and Recognition PSAT/NMSQT Testing Rules PSAT 10 PSAT 10 Home PSAT 10 Test Dates What's on the PSAT 10? Taking the PSAT 10 PSAT 10 Scores Scholarships and Recognition PSAT 10 Testing Rules PSAT 8/9 PSAT 8/9 Home PSAT 8/9 Test Dates What's on the PSAT 8/9? Taking the PSAT 8/9 PSAT 8/9 Scores PSAT 8/9 Testing Rules Scores Scores Home Score Release Dates SAT Weekend Scores SAT School Day, PSAT/NMSQT, and PSAT 10 Scores PSAT 8/9 Scores Online Score Reports for Educators Practice Practice Home My Practice 101 Student Readiness Check What Are Content Domains? Full-Length SAT Suite Practice Tests How to Use Bluebook Practice Tests How to Use Khan Academy Practice with Confidence Build Your Study Plan Setting a Target Score How to Use the Student Question Bank Practice Resources for Educators Question of the Day For K–12 Educators About the SAT Suite SAT Fee Waivers District/School Pricing Details In-School Educator Experience Using Skills Insight™ Additional Tools and Resources Professional Development for K–12 Educators Test Centers BigFuture School and Connections For Higher Ed Professionals For Higher Ed Professionals Home SAT and College Success SAT Validity Score Reports SAT Suite Benefits: For Students & Parents Students & Parents Home El examen SAT Why Take the SAT? Why Take a PSAT-Related Assessment? BigFuture School Mobile App Help Center: Parents Support Help Center: Students Help Center: Professionals and Educators Help Center: K–12 Reporting Portal Help Center: SAT Suite Ordering and Registration (Schools) Help Center: SAT Suite Ordering and Registration (Districts) Higher Education Reporting Portal Help Contact Us More Display Site Navigation Home SAT Active Page: SAT Testing Staff Digital SAT Suite of Assessments SAT Weekend Testing Staff Thank you for providing students the opportunity to take the digital SAT. Use the information on this page to begin planning for a successful SAT Weekend test administration. See What's New Become a Test Center Test Day Readiness at a Glance Review the Checklist and Your Resources Complete the College Board Required Training Confirm Access to Test Day Toolkit Sign the Testing Staff Agreement in Test Day Toolkit Test Day Readiness: Get Started Test Coordinator Readiness Find the readiness checklist which includes information about when and how to access the College Board required training, Test Day Toolkit setup instructions, and our honoraria payment vendor. Start Planning Proctor and Monitor Readiness Find detailed test day procedures and College Board required training. Get Details Technology Get a tech readiness checklist and find out how to work with technology staff at your school or facility. Get Test Day Tips Testing Students with School-Based Accommodations in a Test Center Learn the steps you need to take if you're testing a student with school-based accommodations in a test center. Find More Info Training We created short, self-guided training modules to introduce procedures for test center planning, test day protocols, Test Day Toolkit, and technology. Training is required for all staff each administration year. Experienced staff may bypass familiar topics by completing a knowledge check. Once linked to the administration, we'll confirm if additional training is needed or if past training meets requirements. Take the Training Resources The password to access documents on this page is the same for all PDF downloads that require one. It can be found in the latest email from College Board. You can access most resources without a password in the training platform. Sign in using your College Board account. Downloads Resources for Coordinators For test coordinators, use these resources if you're overseeing the administration of SAT Weekend. Resources for Coordinators Close Modal Download Test Coordinator Manual This manual contains policies and procedures for test coordinators overseeing SAT Weekend administrations. PDF 4.38 MB Download Key Information for Test Coordinators This resource provides an overview of key requirements for test coordinators administering the SAT on a weekend. PDF 545.38 KB Download Join the Staff for Our SAT Weekend Administration Coordinators can print and distribute this flyer to help recruit staff for SAT Weekend administrations in fall 2025 and spring 2026. PDF 482.56 KB Download SAT Coordinator Change Form Weekend test centers can use this form to update staff information if their test coordinator changes. PDF 145.57 KB Download SAT Weekend Large Test Center Readiness Supplement Advice for testing staff in large SAT Weekend test centers. PDF 627.15 KB Close Download All Downloads Resources for Staff SAT Weekend testing staff should use these resources to prepare for test day administration. Resources for Staff Close Modal Download Proctor Manual This manual contains policies and procedures for proctors administering the SAT Weekend administrations. PDF 5.53 MB Download SAT Weekend Proctor Script Practice Resource Proctors can use this practice resource to learn what to expect when reading the script in Test Day Toolkit. PDF 1.18 MB Download Hall and Room Monitor Test Day Guide This guide covers everything hall and room monitors need to know about test day procedures. PDF 642.89 KB Download Technical Troubleshooting Guide Technology monitors should use the troubleshooting tips in this guide on test day to help students and staff. PDF 1.09 MB Close Download All Downloads Resources for Testing with Accommodations Use these resources if you have students testing with accommodations for the SAT Weekend. Resources for Testing with Accommodations Close Modal Download Quick Guide to Accommodations This guide provides an overview of common testing accommodations students may have and gives instructions to coordinators and proctors on administering those accommodations during a weekend test. PDF 1019.95 KB Download Test Coordinator Manual This manual contains policies and procedures for test coordinators overseeing SAT Weekend administrations. PDF 4.38 MB Download Proctor Manual This manual contains policies and procedures for proctors administering the SAT Weekend administrations. PDF 5.53 MB Download SAT Weekend Paper Testing Script This document provides a test-day script for administering SAT Weekend to students who require a paper version of the test. If you are a proctor administering the paper test for the digital SAT Weekend, use this script along with the instructions given in the Proctor Manual. PDF 468.36 KB Close Download All Downloads Posters and Flyers for Your Center Use these posters and flyers in your test center to help your staff and your students prepare for test day. Posters and Flyers for Your Center Close Modal Download Join the Staff for Our SAT Weekend Administration Coordinators can print and distribute this flyer to help recruit staff for SAT Weekend administrations in fall 2025 and spring 2026. PDF 482.56 KB Download SAT Test Day Requirements Flyer Students should use this flyer to learn test day requirements, what to bring on test day, and the test admission process. PDF 591.19 KB Download SAT Parent and Guardian Admin Flyer SAT staff should use this flyer to tell parents and guardians to stop, pick up their student before noon, and to not let their student take electronic devices into the testing area. PDF 609.8 KB Download SAT Student Guide This guide provides helpful information for students taking the SAT during a weekend administration. PDF 2.44 MB Download 2025-26 SAT Test Center Poster This SAT Weekend poster is for test center coordinators to fill in their test center dates for 2025-26. PDF 3.99 MB Download \"Do Not Close Device\" Poster This poster should be displayed for students so they know what it looks like when they successfully submit their answers in the Bluebook testing app. PDF 446.02 KB Download SAT Directional Signs Print these directional signs to help students navigate your test site. PDF 442.73 KB Download No Prohibited Devices The SAT Suite prohibits electronic devices that aren't used for testing. PDF 541.68 KB Download Bluebook Check-In Poster Print and display this flyer in the testing rooms so students know your center's Wi-Fi information before signing into the Bluebook testing app. PDF 546.81 KB Download Help Room Directional Signs Print and display these directional arrows to show staff and students where the help room is. PDF 541.07 KB Download \"Place Your Phones Here\" Poster Print and display this flyer to show students where they can place their phones. PDF 446.69 KB Download \"Do Not Disturb\" Poster Print and display this flyer so staff and students know testing is in progress. PDF 502.03 KB Download SAT Benefits Poster The SAT Benefits Poster reminds students why they should take the SAT. PDF 12.31 MB Download SAT Benefits Poster International The SAT Benefits Poster reminds students why they should take the SAT. PDF 6.64 MB Download SAT Calculator Policy Flyer Print and post this flyer to inform students of the SAT calculator policy. PDF 1.4 MB Close Download All Download Training Platform User Guide Testing staff should use this guide to learn how to access College Board required training and the resources in the Training Launch Page. PDF 1.69 MB PLAY VIDEO Test Day Overview Learn what proctors and students experience during digital testing. Test Day Experience Close Modal Close Conversation Guides Working with IT Staff on Technical Readiness Get the Checklist Talk to Students About Why They Should Take the SAT Find More Details Frequently Asked Questions Have questions about technology, staffing, or other topics affecting SAT testing staff? Find the Answers Dates and Deadlines 2025 SAT, SEP 13, 2025 7:45 AM Local September 13 SAT Registration for this test has closed. Details Add to Calendar 2025 FRI, SEP 19, 2025 Registration Deadline for October SAT Add to Calendar See All Dates 2025 TUE, SEP 23, 2025 Late Registration Deadline for October SAT Add to Calendar See All Dates 2025 FRI, SEP 26, 2025 September SAT Score Release Add to Calendar Getting Scores 2025 SAT, OCT 4, 2025 7:45 AM Local October 4 SAT Stand Out to Colleges Details Add to Calendar 2025 FRI, OCT 17, 2025 October SAT Score Release Add to Calendar Getting Scores Contact Us For questions regarding test administration, loaned devices, Test Day Toolkit, issues with the Bluebook testing app, setting up managed devices, or any other technical assistance, call 877-348-5728 (United States) or +1 212-307-9731 (international). In addition to regular weekday hours, we are open for extended overnight hours the entire week before the test. For help with policies and procedures, test day issues, and loaned devices: Email Us For help with Test Day Toolkit: Email Digital Support Changes for Fall 2025 SAT Weekend Testing See what's changed since the previous administration season. Honoraria Learn how to work with our honoraria payment vendor, Raise. Technology See a test readiness checklist and find out how to work with technology staff at your school or facility. Test Coordinator Readiness Test center coordinators and primary SSD coordinators can find Test Day Toolkit setup instructions, a readiness checklist, and training modules. Device Lending Testing Students with School-Based Accommodations in a Test Center Learn the steps coordinators will need to take if you're testing students with school-based accommodations in a test center. Test Day Experience Find out what proctors and students should expect on test day. Proctors and Monitors Proctors and monitors can access detailed test day procedures and their College Board required training. FAQ See the answers to common questions about technology, staffing, and other topics affecting testing staff."
    }
  ]
}