{
  "fuentes": [
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "acannon@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "adavis@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "arb@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "atrussell@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "awells@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "bcordle@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "csr@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "jbailey@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "jcummings@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "jjones@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "jwillis@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "kray@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "mlatour@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "mplowick@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "rbooker@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "rperkins@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "soa@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "soaaccounting@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "tcooper@soaowners.com"
    },
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "email": "vklamerus@soaowners.com"
    },
    {
      "url": "https://www.baytownewharf.com/where_to_go.php?type=39",
      "email": "prg@tumulo.com"
    },
    {
      "url": "https://www.sandestinowners.com/",
      "email": "soa@soaowners.com"
    },
    {
      "url": "https://www.baytownewharf.com/contact_us.php",
      "email": "contact@baytownewharf.com"
    }
  ],
  "mails": [
    "acannon@soaowners.com",
    "adavis@soaowners.com",
    "arb@soaowners.com",
    "atrussell@soaowners.com",
    "awells@soaowners.com",
    "bcordle@soaowners.com",
    "contact@baytownewharf.com",
    "csr@soaowners.com",
    "jbailey@soaowners.com",
    "jcummings@soaowners.com",
    "jjones@soaowners.com",
    "jwillis@soaowners.com",
    "kray@soaowners.com",
    "mlatour@soaowners.com",
    "mplowick@soaowners.com",
    "prg@tumulo.com",
    "rbooker@soaowners.com",
    "rperkins@soaowners.com",
    "soa@soaowners.com",
    "soaaccounting@soaowners.com",
    "tcooper@soaowners.com",
    "vklamerus@soaowners.com"
  ],
  "nombre_sitio": "sandestin.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.sandestinowners.com/departments/staff-directory/",
      "text": "Staff Directory - Sandestin Owners Association Staff Directory - Sandestin Owners Association Sandestin Owners Association Login | Register Members Board of Directors & Advisory Board Notices & Calendar General Committee Information Neighborhood Association Management New Homeowners Departments Accounting Administration Architectural Review Department (ARB) Communications & Customer Service Property Services Security Staff Directory Library FAQ Hurricane Information Cox Communications Map Photo Gallery Rules & Regulations Weekly Email Archive Tom Talks Contact Us Staff Directory Staff Directory Sandestin, Fl 87°F few clouds Administration Office Hours Monday thru Friday 8 a.m. to 5 p.m. Closed from 11:30-12:30 for lunch. Main Office Phone (850) 424-5950 Toll Free 1-844-424-5950 Not sure who to contact? Email the General Mailbox and we will assist you or forward your message to the correct department. soa@soaowners.com NAME POSITION PHONE NUMBER EMAIL ADDRESS Tom Cooper Executive Director (850) 424-5959 tcooper@soaowners.com Victoria Klamerus Asst. Executive Director (850) 424-5955 vklamerus@soaowners.com Aimie Trussell Communications Manager (850) 424-5934 atrussell@soaowners.com Valerie Rodriguez Customer Service (850) 424-5951 csr@soaowners.com Jenn Jones Customer Service (850) 424-5950 jjones@soaowners.com Jimmy Willis Director, Security (850) 424-5933 jwillis@soaowners.com Robert Booker Asst. Director, Security (850) 424-5958 rbooker@soaowners.com Kyle Ray Director, Property Services (850) 424-5922 kray@soaowners.com Bobby Cordle Asst. Director, Property Services (850) 424-5956 bcordle@soaowners.com Jennifer Bailey Director, Finance (850) 424-5944 jbailey@soaowners.com Alyssa Wells Staff Accountant (850) 424-5941 awells@soaowners.com Rebecca Perkins Accounts Receivable Clerk (850) 424-5940 rperkins@soaowners.com Mercedes LaTour Accounts Payable Clerk (850) 424-5942 mlatour@soaowners.com Angie Davis ARB Administrator (850) 424-5930 adavis@soaowners.com ARB Staff Support (850) 424-5931 arb@soaowners.com Josh Cummings ARB Compliance Officer (850) 424-5956 jcummings@soaowners.com Melissa Plowick Human Resources Manager (850) 424-5960 mplowick@soaowners.com Search for: Quick Links Guest Registration Website Homeowner Specials 8.21.25 Cox Communications Contact Information Text Alerts – How to Sign Up SOA Improvement Projects 8.29.25 Register Your Pet! Golf Cart Gate Access & Rules 2024 Golf Cart Acknowledgment Form Beach Access & Use for Owners & Guests Beach Warning Flags Flyer Swim safely – check out what color flag is flying before heading to the beach! Click here for Estoppel and Closing Document Requests 2025 SOA Fleet Form Grand Boulevard – Events, Retailers, Theater & More The Market Shops The Hilton Sandestin Beach Sandestin Golf and Beach Resort The Village of Baytowne Wharf SoWal – South Walton Beaches events & news locals and visitors Walton County – local government news, information and contacts Ascension Hospital (Previously Sacred Heart) Sitemap Sandestin Owners Association, Inc. 215 Grand Blvd | Suite 101 | Sandestin, FL 32550 Main Phone: (850) 424-5950 | Fax: (850) 424-5963 | E-mail: soa@soaowners.com ©2023 Sandestin Owners Association, Inc. All rights reserved. Website created by South Florida Web Design Studio SOA Careers Members Board of Directors & Advisory Board Notices & Calendar General Committee Information Neighborhood Association Management New Homeowners Back Departments Accounting Administration Architectural Review Department (ARB) Communications & Customer Service Property Services Security Staff Directory Back Library FAQ Hurricane Information Cox Communications Map Photo Gallery Rules & Regulations Weekly Email Archive Tom Talks Back Contact Us Staff Directory Back × Close Panel"
    },
    {
      "url": "https://www.baytownewharf.com/where_to_go.php?type=39",
      "text": "Where To Go | The Village of Baytowne Wharf | Located in Sandestin Golf and Beach Resort Menu Home What To Do January February March April May June July August September October November December Where To Stay Where To Go Village Shopping Village Dining Village Nightlife Village Map Village Activities Merchant Happenings Photos FAQs Sponsorships Follow Us Directions Contact Us HOA Login What To Do village calendar Where To Stay lodging & availability Where To Go shops, dining & nightlife Village Map layout & photos Menu Village Activities Merchant Happenings Photos FAQs Sponsorships Follow Us Directions Contact Us Village Activities Merchant Happenings Photos FAQs Sponsorships Directions Contact Location Types • Village Shopping • Village Dining • Village Nightlife Where To Go Village Dining 5 o'Clock Somewhere Phone Number: 850-308-2458 Website: https://www.5oclocksomewheremiramarbeach.com/ Hours: 11am-11pm | Sunday-Thursday 11am-12am | Friday-Saturday *All Merchant hours and business is subject to change. With its idyllic water views, curated retail offerings, inviting woodburning fireplace, indoor/outdoor bar, and captivating live entertainment, the 5 o'clock Somewhere Bar and Grill Miramar Beach promises an unforgettable experience that celebrates the essence of coastal living. Whether you seek tranquility by the fireplace or vibrant festivities by the bay, this tropical haven invites you to embrace the spirit of \"it's five o'clock somewhere\" and surrender to the magic of the moment. [ December Live Music Schedule! ] Bunkley's Burgers and Grill Phone Number: 850- 842-7078 Hours: 11am-11pm | Sunday through Thursday 11am-2am | Friday and Saturday *All Merchant hours and business is subject to change. Family-friendly, casual diner, serving fresh burgers, chicken, hot dogs, seafood, shakes and boba tea. Big screen tv's for sports with outdoor seating. indoor robot servers. Located in Baytowne Wharf [ Connect with us on Facebook! ] Cannery Lane Cantina Phone Number: 850-424-6934 Website: www.facebook.com/CanneryLaneCantina/ Hours: 12pm-9pm | Tuesday-Saturday 12pm-8pm | Sunday CLOSED MONDAYS *All Merchant hours and business is subject to change. Baytowne's own Coastal Grill and Cantina, stop by and experience one of our Mexican and Caribbean inspired style of tacos, burritos, bowls, and quesadillas. Live life to the fullest with our shareables, such as our fresh Avocado Fries and top it all off with a refreshing beer or sangria.  Let's all Toast to the Coast Life! [ Click Here for Menu ] Charlie's Café Phone Number: 850-424-6459 Website: www.facebook.com/CharliesCafeBaytowne Hours: 7am-4pm | 7 days a week *All Merchant hours and business is subject to change. Charlie's Caf'e serves locally made Charlie's Donuts, fresh sandwiches, salads, and ice cream. We also have a full espresso bar featuring coffee roasted here in the panhandle and locally made Kombucha. Dude & Meatballs: Italian Bar and Restaurant Phone Number: (850) 424-7775 Hours: 3PM-9PM | Tuesday - Friday 12PM-9PM | Saturday - Sunday CLOSED MONDAY *All Merchant hours and business is subject to change. Come join us at Dude & Meatball's for a one of a kind experience. Join us inside and over look the pond or outside on our large two story patio and large outdoor bar. Dude & Meatball's is the best of both worlds with your favorite Italian cuisine and beach atmosphere. Our menu items include our famous made from scratch dishes and sauces. Our menu includes appetizers, pastas, sandwiches, salads, drinks, and desserts all made with fresh ingredients. You have to stop by and experience the different tastes of Italy! We will be open for lunch, dinner, and late night. Dude is a 4 year old, Old English Sheep dog that loves the attention and melts the hearts of customers! Meatball is a sassy Pomeranian/miniature poodle that runs the show and doesn't take no for an answer! Come by and catch us if you’re lucky! View menu here! [ Connect with us on Facebook! ] Fat Tuesday Daiquiri Bar Phone Number: 850-351-1809 Hours: 3pm-11pm | Monday-Thursday 12pm-12am | Friday & Saturday 12pm-11pm | Sunday *All Merchant hours and business is subject to change. Fat Tuesday Daiquiri Bar, the famous New Orleans daiquiri and frozen drink bar, serves up specialties at The Village of Baytowne Wharf. Enjoy frozen concoctions like 190 Octane or the Hurricane each blended, chilled and served to cool the summer heat. Fat Tuesday will also serve up wings and snacks to munch on while you catch the big game on the flat-screen televisions or test your skills on an interactive video game. Connect with Fat Tuesday on Facebook! [ View Our Menu (pdf) ] Hammerhead's Bar & Grille Phone Number: 850-351-1997 Website: www.hammerheadsbarandgrille.com Hours: 5pm-9pm | 7 days a week *All Merchant hours and business is subject to change. Come enjoy this dockside Bar & Grille serving Fried Baskets, Steamed Seafood, Burgers and accompanied with Ice Cold Beers and Cocktails. Relax overlooking the Choctawhatchee bay to Live Music in a Family/Pet friendly ambiance. Located in the Village of Baytowne Wharf within the Sandestin Resort. Connect with Hammerheads on Facebook! View our Menu [ Location ] John Wehner's Village Door Restaurant featuring Live Entertainment Phone Number: 850-610-5959 Website: www.thevillagedoor.com Hours: 11am-10pm | 7 days a week *All Merchant hours and business is subject to change. The Village Door Restaurant is a Baytowne Wharf anchor that offers a gluten-friendly seafood and BBQ menu, the area's best live entertainment, and a beautiful view of the Sandestin Mariana on the Choctawhatchee Bay. Our BBQ is slow smoked \"low and slow\" daily in our fabulous Old Hickory smoker.  We use only oak and pecan wood for the perfect smoked meat flavor. We have five different meats to choose from, all served with a trio of our award-winning scratch-made BBQ sauces. Don't forget the entire menu is Gluten-Friendly made from our \"Big Sexy Kitchen\".  Yes, you CAN eat chicken fingers and fries from our gluten free fryer if you avoid gluten! We have live entertainment during both lunch and dinner, creating a fun and lively atmosphere every day. Enjoy your meal on the outdoor covered deck with stunning bay views, or head inside in the air conditioning to catch a game on our TVs. On the weekends, the dance floor heats up at night, in our award-winning Dance Club.For more information about our Dance Club visit https://thevillagedoor.com/dance-club The Village Door Restaurant is also a great option for parties and corporate events. Visit our website to contact us about your next event! For the latest updates and information visit us online at www.thevillagedoor.com View Our Menu [ Location ] La Cremeria Hours: 11am-10 pm | 7 days a week *All Merchant hours and business is subject to change. Serving gelato, coffee, milkshakes, Icee, Italian Ice, soft drinks, TY brand flash animals, smoothies, and fresh baked treats. LandShark Bar & Grill Phone Number: 850-308-2458 Website: miramarbeach.landsharkbarandgrill.com Hours: 11am-11pm | Sunday-Thursday 11am-12am | Friday-Saturday *All Merchant hours and business is subject to change. Nestled within the charming guard-gated community of Miramar Beach, the LandShark Bar and Grill stands as a vibrant oasis of entertainment and relaxation. Accessible and welcoming, this coastal gem beckons visitors with its easy entry and shuttle service, ensuring a seamless arrival experience. Miramar Beach itself is a golf cart community, adding to the quaint charm and unique atmosphere of the LandShark Bar and Grill. Whether you choose to relax on the ground floor or ascend to the second level, you'll find yourself captivated by the panoramic lawn views that surround you. The LandShark Bar and Grill proudly boasts two vibrant bars, each exuding a lively ambiance that invites conversation and celebration. Additionally, an outdoor covered grab-and-go bar offers a convenient option for those on the move, and a retail shop, adorned with a tasteful array of both Margaritaville and LandShark apparel, invites guests to take a piece of this paradise home with them. December Live Music Schedule! [ View Menu Here! ] Moo La-La Ice Cream & Desserts Phone Number: 850- 654-3333 Hours: 10am-10pm | 7 Days a Week *All Merchant hours and business is subject to change. Indulge in a variety of 24 rich ice cream flavors served in an array of styles, traditional soft serve or ever changing yogurt flavors. You can also enjoy a selection of eclectic and scrumptious desserts, chocolates and pastries. All served in The Village of Baytowne Wharf. Poppy's Crazy Lobster Phone Number: 850-351-1996 Website: www.crazylobsterdestin.com Hours: 5pm-9pm | 7 days a week *All Merchant hours and business is subject to change. We invite you to enjoy Fresh Local Seafood along with some of our Creole & Cajun Favorites while overlooking the beautiful Choctawatchee Bay. Located in the Village of Baytowne Wharf within the Sandestin Resort. Enjoy the sun setting from our second floor balcony overlooking the Bay, while enjoying great service, delicious seafood and steaks and an extensive list of wines and signature cocktails at Poppys. Private Parties up to 300 guests are welcome. Contact Matt Demoreski, Event Coordinator, for details. Email: prg@tumulo.com Connect with Poppy's on Facebook! View Our Menu [ Location ] Roberto's Pizzeria & Sports Bar Phone Number: 850-351-1998 Website: www.robertositalianpizzeria.com Hours: 11am-10pm | 7 days a week *All Merchant hours and business is subject to change. Nestled within the Village of Baytowne Wharf serving the best Gourmet Pizzas, Pastas, Calzones, Stromboli's, Salads, wings, and more. This casual family friendly Pizzeria has plenty of indoor and outdoor seating, Full Bar, Big Screen TV's, and great Drink Specials. Whether it's to catch the big game or bring the family and friends for a pizza party, this is the place to be. Connect with Roberto's Pizzeria on Facebook! Super Bowl Party! More Info Here! [ View Their Menu ] Ruby Slipper Website: www.rubybrunch.com Hours: 7am-2pm | Monday-Friday 7am-3pm | Saturday & Sunday *All Merchant hours and business is subject to change. Ruby Slipper offers playful twists on Southern brunch staples along with eye-opening cocktails. Please visit us at rubybrunch.com to learn more! #ThatBrunchLife View Our Menu Here! Join The Waitlist Here! Rum Runners Phone Number: 850-351-1817 Website: www.rumrunners.com Hours: 4pm-2am | Sunday-Thursday 11am-2am | Friday & Saturday *All Merchant hours and business is subject to change. There is nothing like the delicious food and live entertainment at Rum Runners featuring Great Food, Great Music and Great Fun. Home of the the \"World Famous\" Dueling Piano Players performing all the hits from the '50s to today with high-energy, crowd interaction and fun. Voted \"Best of Destin Casual Dining 2012.\" LIVE ENTERTAINMENT SCHEDULE:\r\nSunday - Wednesday | Live Music 6pm-12am Thursday - Saturday | Dueling Pianos 7pm-12am And, don't forget about the sports bar upstairs, a great happy hour spot with outdoor patio seating overlooking the Events Plaza. Perfect for your next corporate group event, birthday, bachelorette party or bachelor party. Connect with Rum Runners on Facebook! View Our Menu [ Location ] Slick Lips Seafood & Oyster House Phone Number: 850-347-5060 Website: slicklipsseafood.com Hours: 11am-9pm | Sunday-Thursday 11am-10pm | Friday & Saturday *All Merchant hours and business is subject to change. Derived from the nickname given to Amberjack who doesn't have any teeth, Slick Lips is a family-friendly seafood restaurant and oyster bar. With a key concentration on fresh ingredients, locally caught fish, and an assortment of fresh oysters prepare to be hooked on this prime dining spot! For inquiries please email slicklipsseafood@gmail.com Private Parties and Events are welcome! Please Contact: Tim Brand | Event Manager 850.826.0879    tim@slicklipsseafood.com [ Connect with Slick Lips on Facebook! ] Sundries General Market Website: www.sundriesgeneralmarket.com Hours: 8am-10pm | 7 days a week *All Merchant hours and business is subject to change. Stop by for groceries, ice, beer, wine, hard seltzers, tobacco, sodas, candy, snacks, health & beauty products, bathroom supplies, hot& cold food items for breakfast, lunch, dinner and everything else in-between . A convenience store located in the beautiful Village of Baytowne Wharf at Sandestin Resort. The Green Panini Phone Number: 850-708-5215 Website: https://green-panini.com/ Hours: 8am-9pm | 7 days a week *All Merchant hours and business is subject to change. Welcome to Green Panini, where wellness meets deliciousness! At Green Panini, we are on a mission to provide you with a wide range of healthy and nourishing options that will tantalize your taste buds and energize your body. Our carefully curated menu features a delightful assortment of grilled paninis, refreshing salads, revitalizing shakes and smoothies, rejuvenating juices, invigorating acai bowls, and revitalizing energy shots. [ View Menu Here ] Tony Larue's New Orleans Snoballs Phone Number: 850-424-6934 Hours: 4pm-9pm | Wednesday-Saturday 4pm-8pm | Sunday CLOSED MONDAYS & TUESDAYS *All Merchant hours and business is subject to change. What better way to cool down than with a New Orleans style snoball? Stop by Tony Larues for a variety of snacks! Munch on kettle corn, cotton candy, popcorn and, of course, a New Orleans Snoball! With a wide variety of flavors and a fun New Orleans vibe, you will be coming back for more of these tasty treats. Connect with Tony Larue's on Facebook! Yaki Phone Number: 850-353-2200 Hours: 11am-9pm | Sunday-Thursday 11am-10pm | Friday-Saturday *All Merchant hours and business is subject to change. Asian restaurant bringing hot and ready to eat hibachi plates and fresh sushi! [ Connect with us on Facebook! ] Village Dining 5 o'Clock Somewhere Phone Number: 850-308-2458 Website: https://www.5oclocksomewheremiramarbeach.com/ Hours: 11am-11pm | Sunday-Thursday 11am-12am | Friday-Saturday *All Merchant hours and business is subject to change. With its idyllic water views, curated retail offerings, inviting woodburning fireplace, indoor/outdoor bar, and captivating live entertainment, the 5 o'clock Somewhere Bar and Grill Miramar Beach promises an unforgettable experience that celebrates the essence of coastal living. Whether you seek tranquility by the fireplace or vibrant festivities by the bay, this tropical haven invites you to embrace the spirit of \"it's five o'clock somewhere\" and surrender to the magic of the moment. [ December Live Music Schedule! ] Bunkley's Burgers and Grill Phone Number: 850- 842-7078 Hours: 11am-11pm | Sunday through Thursday 11am-2am | Friday and Saturday *All Merchant hours and business is subject to change. Family-friendly, casual diner, serving fresh burgers, chicken, hot dogs, seafood, shakes and boba tea. Big screen tv's for sports with outdoor seating. indoor robot servers. Located in Baytowne Wharf [ Connect with us on Facebook! ] Cannery Lane Cantina Phone Number: 850-424-6934 Website: www.facebook.com/CanneryLaneCantina/ Hours: 12pm-9pm | Tuesday-Saturday 12pm-8pm | Sunday CLOSED MONDAYS *All Merchant hours and business is subject to change. Baytowne's own Coastal Grill and Cantina, stop by and experience one of our Mexican and Caribbean inspired style of tacos, burritos, bowls, and quesadillas. Live life to the fullest with our shareables, such as our fresh Avocado Fries and top it all off with a refreshing beer or sangria.  Let's all Toast to the Coast Life! [ Click Here for Menu ] Charlie's Café Phone Number: 850-424-6459 Website: www.facebook.com/CharliesCafeBaytowne Hours: 7am-4pm | 7 days a week *All Merchant hours and business is subject to change. Charlie's Caf'e serves locally made Charlie's Donuts, fresh sandwiches, salads, and ice cream. We also have a full espresso bar featuring coffee roasted here in the panhandle and locally made Kombucha. Dude & Meatballs: Italian Bar and Restaurant Phone Number: (850) 424-7775 Hours: 3PM-9PM | Tuesday - Friday 12PM-9PM | Saturday - Sunday CLOSED MONDAY *All Merchant hours and business is subject to change. Come join us at Dude & Meatball's for a one of a kind experience. Join us inside and over look the pond or outside on our large two story patio and large outdoor bar. Dude & Meatball's is the best of both worlds with your favorite Italian cuisine and beach atmosphere. Our menu items include our famous made from scratch dishes and sauces. Our menu includes appetizers, pastas, sandwiches, salads, drinks, and desserts all made with fresh ingredients. You have to stop by and experience the different tastes of Italy! We will be open for lunch, dinner, and late night. Dude is a 4 year old, Old English Sheep dog that loves the attention and melts the hearts of customers! Meatball is a sassy Pomeranian/miniature poodle that runs the show and doesn't take no for an answer! Come by and catch us if you’re lucky! View menu here! [ Connect with us on Facebook! ] Fat Tuesday Daiquiri Bar Phone Number: 850-351-1809 Hours: 3pm-11pm | Monday-Thursday 12pm-12am | Friday & Saturday 12pm-11pm | Sunday *All Merchant hours and business is subject to change. Fat Tuesday Daiquiri Bar, the famous New Orleans daiquiri and frozen drink bar, serves up specialties at The Village of Baytowne Wharf. Enjoy frozen concoctions like 190 Octane or the Hurricane each blended, chilled and served to cool the summer heat. Fat Tuesday will also serve up wings and snacks to munch on while you catch the big game on the flat-screen televisions or test your skills on an interactive video game. Connect with Fat Tuesday on Facebook! [ View Our Menu (pdf) ] Hammerhead's Bar & Grille Phone Number: 850-351-1997 Website: www.hammerheadsbarandgrille.com Hours: 5pm-9pm | 7 days a week *All Merchant hours and business is subject to change. Come enjoy this dockside Bar & Grille serving Fried Baskets, Steamed Seafood, Burgers and accompanied with Ice Cold Beers and Cocktails. Relax overlooking the Choctawhatchee bay to Live Music in a Family/Pet friendly ambiance. Located in the Village of Baytowne Wharf within the Sandestin Resort. Connect with Hammerheads on Facebook! View our Menu [ Location ] John Wehner's Village Door Restaurant featuring Live Entertainment Phone Number: 850-610-5959 Website: www.thevillagedoor.com Hours: 11am-10pm | 7 days a week *All Merchant hours and business is subject to change. The Village Door Restaurant is a Baytowne Wharf anchor that offers a gluten-friendly seafood and BBQ menu, the area's best live entertainment, and a beautiful view of the Sandestin Mariana on the Choctawhatchee Bay. Our BBQ is slow smoked \"low and slow\" daily in our fabulous Old Hickory smoker.  We use only oak and pecan wood for the perfect smoked meat flavor. We have five different meats to choose from, all served with a trio of our award-winning scratch-made BBQ sauces. Don't forget the entire menu is Gluten-Friendly made from our \"Big Sexy Kitchen\".  Yes, you CAN eat chicken fingers and fries from our gluten free fryer if you avoid gluten! We have live entertainment during both lunch and dinner, creating a fun and lively atmosphere every day. Enjoy your meal on the outdoor covered deck with stunning bay views, or head inside in the air conditioning to catch a game on our TVs. On the weekends, the dance floor heats up at night, in our award-winning Dance Club.For more information about our Dance Club visit https://thevillagedoor.com/dance-club The Village Door Restaurant is also a great option for parties and corporate events. Visit our website to contact us about your next event! For the latest updates and information visit us online at www.thevillagedoor.com View Our Menu [ Location ] La Cremeria Hours: 11am-10 pm | 7 days a week *All Merchant hours and business is subject to change. Serving gelato, coffee, milkshakes, Icee, Italian Ice, soft drinks, TY brand flash animals, smoothies, and fresh baked treats. LandShark Bar & Grill Phone Number: 850-308-2458 Website: miramarbeach.landsharkbarandgrill.com Hours: 11am-11pm | Sunday-Thursday 11am-12am | Friday-Saturday *All Merchant hours and business is subject to change. Nestled within the charming guard-gated community of Miramar Beach, the LandShark Bar and Grill stands as a vibrant oasis of entertainment and relaxation. Accessible and welcoming, this coastal gem beckons visitors with its easy entry and shuttle service, ensuring a seamless arrival experience. Miramar Beach itself is a golf cart community, adding to the quaint charm and unique atmosphere of the LandShark Bar and Grill. Whether you choose to relax on the ground floor or ascend to the second level, you'll find yourself captivated by the panoramic lawn views that surround you. The LandShark Bar and Grill proudly boasts two vibrant bars, each exuding a lively ambiance that invites conversation and celebration. Additionally, an outdoor covered grab-and-go bar offers a convenient option for those on the move, and a retail shop, adorned with a tasteful array of both Margaritaville and LandShark apparel, invites guests to take a piece of this paradise home with them. December Live Music Schedule! [ View Menu Here! ] Moo La-La Ice Cream & Desserts Phone Number: 850- 654-3333 Hours: 10am-10pm | 7 Days a Week *All Merchant hours and business is subject to change. Indulge in a variety of 24 rich ice cream flavors served in an array of styles, traditional soft serve or ever changing yogurt flavors. You can also enjoy a selection of eclectic and scrumptious desserts, chocolates and pastries. All served in The Village of Baytowne Wharf. Poppy's Crazy Lobster Phone Number: 850-351-1996 Website: www.crazylobsterdestin.com Hours: 5pm-9pm | 7 days a week *All Merchant hours and business is subject to change. We invite you to enjoy Fresh Local Seafood along with some of our Creole & Cajun Favorites while overlooking the beautiful Choctawatchee Bay. Located in the Village of Baytowne Wharf within the Sandestin Resort. Enjoy the sun setting from our second floor balcony overlooking the Bay, while enjoying great service, delicious seafood and steaks and an extensive list of wines and signature cocktails at Poppys. Private Parties up to 300 guests are welcome. Contact Matt Demoreski, Event Coordinator, for details. Email: prg@tumulo.com Connect with Poppy's on Facebook! View Our Menu [ Location ] Roberto's Pizzeria & Sports Bar Phone Number: 850-351-1998 Website: www.robertositalianpizzeria.com Hours: 11am-10pm | 7 days a week *All Merchant hours and business is subject to change. Nestled within the Village of Baytowne Wharf serving the best Gourmet Pizzas, Pastas, Calzones, Stromboli's, Salads, wings, and more. This casual family friendly Pizzeria has plenty of indoor and outdoor seating, Full Bar, Big Screen TV's, and great Drink Specials. Whether it's to catch the big game or bring the family and friends for a pizza party, this is the place to be. Connect with Roberto's Pizzeria on Facebook! Super Bowl Party! More Info Here! [ View Their Menu ] Ruby Slipper Website: www.rubybrunch.com Hours: 7am-2pm | Monday-Friday 7am-3pm | Saturday & Sunday *All Merchant hours and business is subject to change. Ruby Slipper offers playful twists on Southern brunch staples along with eye-opening cocktails. Please visit us at rubybrunch.com to learn more! #ThatBrunchLife View Our Menu Here! Join The Waitlist Here! Rum Runners Phone Number: 850-351-1817 Website: www.rumrunners.com Hours: 4pm-2am | Sunday-Thursday 11am-2am | Friday & Saturday *All Merchant hours and business is subject to change. There is nothing like the delicious food and live entertainment at Rum Runners featuring Great Food, Great Music and Great Fun. Home of the the \"World Famous\" Dueling Piano Players performing all the hits from the '50s to today with high-energy, crowd interaction and fun. Voted \"Best of Destin Casual Dining 2012.\" LIVE ENTERTAINMENT SCHEDULE:\r\nSunday - Wednesday | Live Music 6pm-12am Thursday - Saturday | Dueling Pianos 7pm-12am And, don't forget about the sports bar upstairs, a great happy hour spot with outdoor patio seating overlooking the Events Plaza. Perfect for your next corporate group event, birthday, bachelorette party or bachelor party. Connect with Rum Runners on Facebook! View Our Menu [ Location ] Slick Lips Seafood & Oyster House Phone Number: 850-347-5060 Website: slicklipsseafood.com Hours: 11am-9pm | Sunday-Thursday 11am-10pm | Friday & Saturday *All Merchant hours and business is subject to change. Derived from the nickname given to Amberjack who doesn't have any teeth, Slick Lips is a family-friendly seafood restaurant and oyster bar. With a key concentration on fresh ingredients, locally caught fish, and an assortment of fresh oysters prepare to be hooked on this prime dining spot! For inquiries please email slicklipsseafood@gmail.com Private Parties and Events are welcome! Please Contact: Tim Brand | Event Manager 850.826.0879    tim@slicklipsseafood.com [ Connect with Slick Lips on Facebook! ] Sundries General Market Website: www.sundriesgeneralmarket.com Hours: 8am-10pm | 7 days a week *All Merchant hours and business is subject to change. Stop by for groceries, ice, beer, wine, hard seltzers, tobacco, sodas, candy, snacks, health & beauty products, bathroom supplies, hot& cold food items for breakfast, lunch, dinner and everything else in-between . A convenience store located in the beautiful Village of Baytowne Wharf at Sandestin Resort. The Green Panini Phone Number: 850-708-5215 Website: https://green-panini.com/ Hours: 8am-9pm | 7 days a week *All Merchant hours and business is subject to change. Welcome to Green Panini, where wellness meets deliciousness! At Green Panini, we are on a mission to provide you with a wide range of healthy and nourishing options that will tantalize your taste buds and energize your body. Our carefully curated menu features a delightful assortment of grilled paninis, refreshing salads, revitalizing shakes and smoothies, rejuvenating juices, invigorating acai bowls, and revitalizing energy shots. [ View Menu Here ] Tony Larue's New Orleans Snoballs Phone Number: 850-424-6934 Hours: 4pm-9pm | Wednesday-Saturday 4pm-8pm | Sunday CLOSED MONDAYS & TUESDAYS *All Merchant hours and business is subject to change. What better way to cool down than with a New Orleans style snoball? Stop by Tony Larues for a variety of snacks! Munch on kettle corn, cotton candy, popcorn and, of course, a New Orleans Snoball! With a wide variety of flavors and a fun New Orleans vibe, you will be coming back for more of these tasty treats. Connect with Tony Larue's on Facebook! Yaki Phone Number: 850-353-2200 Hours: 11am-9pm | Sunday-Thursday 11am-10pm | Friday-Saturday *All Merchant hours and business is subject to change. Asian restaurant bringing hot and ready to eat hibachi plates and fresh sushi! [ Connect with us on Facebook! ] © Copyright 2025, The Village of Baytowne Wharf  - Privacy Policy | Website Created By: Edge 4 HOA Login © 2025, The Village of Baytowne Wharf. Privacy Policy | Website by: Edge 4 HOA Login"
    },
    {
      "url": "https://www.sandestinowners.com/",
      "text": "Welcome Home! - Sandestin Owners Association Welcome Home! - Sandestin Owners Association Sandestin Owners Association Login | Register Members Board of Directors & Advisory Board Notices & Calendar General Committee Information Neighborhood Association Management New Homeowners Departments Accounting Administration Architectural Review Department (ARB) Communications & Customer Service Property Services Security Staff Directory Library FAQ Hurricane Information Cox Communications Map Photo Gallery Rules & Regulations Weekly Email Archive Tom Talks Contact Us Staff Directory Welcome Home! COX Fiber Install Project For more information and the tentative schedule visit \"Cox Communications Page\" under Library Sandestin, Fl 87°F clear sky Welcome to the Sandestin Owners Association! The SOA is a non-profit property owners association, which is responsible for, but not necessarily limited to, operating and maintaining the following: Security evolution zenith Sanitation Most master storm water drainage systems The bicycle and walking paths Most Roadways Landscaping of the common properties and the master irrigation systems Lake Maintenance Architectural Review Board Two swimming pool facilities that are heated seasonally based on water temperature. – The Phil Hummel Aquatic Center, located at the intersection of Baytowne Ave and Heron Walk Drive (by the traffic circle and adjacent to Bay Pines) and the other , The Audubon Pool, is on Audubon Drive across from Linkside Village. Both are open daily from 7:00 a.m. to 9:00 p.m. We have designed this website to help you quickly become familiar with the Sandestin Owners Association (SOA) operations and keep you updated on community projects, meetings, and news. Each Department has its own page that gives a description of their responsibilities as well as contact information. There is also a staff directory . If you are not sure who to contact with your question or concern, you can simply email soa@soaowners.com and your information will be forwarded accordingly. Follow us on Facebook page and Instagram today! SOA mission statement: Preserve and Enhance the Experience and the Assets of the Sandestin Community. Tom Cooper, Executive Director Office Hours: Monday – Friday, 8:00 a.m. -5:00 p.m. Closed for lunch – 11:30 a.m. – 12:30 p.m. Click here for contact information. COX Fiber Install Project For more information and the tentative schedule visit \"Cox Communications Page\" under Library Login / Register Email Password Remember Me Forgot your password? Don't have an account? Register Now Guest Registration Quick Links Guest Registration Website Homeowner Specials 8.21.25 Cox Communications Contact Information Text Alerts – How to Sign Up SOA Improvement Projects 8.29.25 Register Your Pet! Golf Cart Gate Access & Rules 2024 Golf Cart Acknowledgment Form Beach Access & Use for Owners & Guests Beach Warning Flags Flyer Swim safely – check out what color flag is flying before heading to the beach! Click here for Estoppel and Closing Document Requests 2025 SOA Fleet Form Grand Boulevard – Events, Retailers, Theater & More The Market Shops The Hilton Sandestin Beach Sandestin Golf and Beach Resort The Village of Baytowne Wharf SoWal – South Walton Beaches events & news locals and visitors Walton County – local government news, information and contacts Ascension Hospital (Previously Sacred Heart) Sitemap Search for: Sandestin Owners Association, Inc. 215 Grand Blvd | Suite 101 | Sandestin, FL 32550 Main Phone: (850) 424-5950 | Fax: (850) 424-5963 | E-mail: soa@soaowners.com ©2023 Sandestin Owners Association, Inc. All rights reserved. Website created by South Florida Web Design Studio SOA Careers Members Board of Directors & Advisory Board Notices & Calendar General Committee Information Neighborhood Association Management New Homeowners Back Departments Accounting Administration Architectural Review Department (ARB) Communications & Customer Service Property Services Security Staff Directory Back Library FAQ Hurricane Information Cox Communications Map Photo Gallery Rules & Regulations Weekly Email Archive Tom Talks Back Contact Us Staff Directory Back × Close Panel"
    },
    {
      "url": "https://www.baytownewharf.com/contact_us.php",
      "text": "Contact Us | The Village of Baytowne Wharf | Located in Sandestin Golf and Beach Resort Menu Home What To Do January February March April May June July August September October November December Where To Stay Where To Go Village Shopping Village Dining Village Nightlife Village Map Village Activities Merchant Happenings Photos FAQs Sponsorships Follow Us Directions Contact Us HOA Login What To Do village calendar Where To Stay lodging & availability Where To Go shops, dining & nightlife Village Map layout & photos Menu Village Activities Merchant Happenings Photos FAQs Sponsorships Follow Us Directions Contact Us Village Activities Merchant Happenings Photos FAQs Sponsorships Directions Contact Contact Us Thank you for your interest in The Village of Baytowne Wharf.  Please contact us if you have any questions about one of our upcoming events or our Village merchants. Phone: 850-267-8180 Email: contact@baytownewharf.com For Accommodation Information or to Make a Lodging Reservation , please visit www.sandestin.com . For leasing information, please email: Email: contact@baytownewharf.com Contact Form * Required fields Name: * Email: * Address: * City: * State: * Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virgin Islands Virginia Washington West Virginia Wisconsin Wyoming Zip Code: * Home Phone: Other Phone: How did you hear about us? * Surfing the web I received information in the mail Atlanta Homes and Lifestyles Coastal Living Magazine STRATOS Wall Street Journal I saw a billboard Northwest Florida Daily News A friend/ family member told me about it My realtor told me about it OTHER (please specify in comments) Comments: What common object does this symbol represent? * Answering the question above will help us reduce spam submissions. If your answer is incorrect, you will be able to try again. Send Message © Copyright 2025, The Village of Baytowne Wharf  - Privacy Policy | Website Created By: Edge 4 HOA Login © 2025, The Village of Baytowne Wharf. Privacy Policy | Website by: Edge 4 HOA Login"
    }
  ]
}