{
  "fuentes": [
    {
      "url": "https://sanibelcommunityhouse.net/about/",
      "email": "emily@sanibelcommunityhouse.net"
    },
    {
      "url": "https://sanibelcommunityhouse.net/about/",
      "email": "jennifer@sanibelcomunityhouse.net"
    },
    {
      "url": "https://sanibelcommunityhouse.net/about/",
      "email": "kristin@sanibelcommunityhouse.net"
    },
    {
      "url": "https://sanibelcommunityhouse.net/about/",
      "email": "marco@sanibelcommunityhouse.net"
    },
    {
      "url": "https://www.gulfcoastam.com/sanibel-hoa-management",
      "email": "info@gulfcoastam.com"
    },
    {
      "url": "https://members.sanibel-captiva.org/sanibel-community-house-moving-quickly-to-reopen-for-2023-24-season/",
      "email": "09_september-is-basic-literacy-education-month-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/sanibel-community-house-moving-quickly-to-reopen-for-2023-24-season/",
      "email": "bailey-matthews-national-shell-museum-aquarium-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/sanibel-community-house-moving-quickly-to-reopen-for-2023-24-season/",
      "email": "fair-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/sanibel-community-house-moving-quickly-to-reopen-for-2023-24-season/",
      "email": "wayne-kliewer-pretty-in-pick-1-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/sanibel-community-house-moving-quickly-to-reopen-for-2023-24-season/",
      "email": "jog-pic-500x383@2x.jpg"
    },
    {
      "url": "https://www.redbridge.gov.uk/contact-us/",
      "email": "trusha.patel2@redbridge.gov.uk"
    },
    {
      "url": "https://www.redbridge.gov.uk/contact-us/",
      "email": "buildingcontrol@redbridge.gov.uk"
    },
    {
      "url": "https://www.redbridge.gov.uk/contact-us/",
      "email": "pressoffice@redbridge.gov.uk"
    },
    {
      "url": "https://www.sanibelchurch.com/contact",
      "email": "info@sanibelchurch.com"
    },
    {
      "url": "https://sanibelcommunityhouse.net/event/sanibel-captiva-business-womens-association-2/",
      "email": "kristin@sanibelcommunityhouse.net"
    },
    {
      "url": "https://sanibelcommunityhouse.net/event/sanibel-captiva-business-womens-association-2/",
      "email": "taylor@irisprintdesigns.com"
    },
    {
      "url": "https://members.sanibel-captiva.org/the-sanibel-community-house-and-sanibel-community-association-sca-announces-new-executive-director/",
      "email": "09_september-is-basic-literacy-education-month-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/the-sanibel-community-house-and-sanibel-community-association-sca-announces-new-executive-director/",
      "email": "bailey-matthews-national-shell-museum-aquarium-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/the-sanibel-community-house-and-sanibel-community-association-sca-announces-new-executive-director/",
      "email": "fair-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/the-sanibel-community-house-and-sanibel-community-association-sca-announces-new-executive-director/",
      "email": "wayne-kliewer-pretty-in-pick-1-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/the-sanibel-community-house-and-sanibel-community-association-sca-announces-new-executive-director/",
      "email": "jog-pic-500x383@2x.jpg"
    },
    {
      "url": "https://sanibelcommunityhouse.net/event/summer-showcase/2024-06-24/",
      "email": "kristin@sanibelcommunityhouse.net"
    },
    {
      "url": "https://sanibelcommunityhouse.net/",
      "email": "kristin@sanibelcommunityhouse.net"
    },
    {
      "url": "https://sanibelcommunityhouse.net/event/sanibel-art-fest/2024-02-10/",
      "email": "kristin@sanibelcommunityhouse.net"
    },
    {
      "url": "https://sanibelcommunityhouse.net/contact/",
      "email": "kristin@sanibelcommunityhouse.net"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "email": "info@safehavencommunityservices.org"
    },
    {
      "url": "https://sanibelcommunityhouse.net/board-of-directors/",
      "email": "kristin@sanibelcommunityhouse.net"
    },
    {
      "url": "https://sanibelcommunityhouse.net/events/",
      "email": "kristin@sanibelcommunityhouse.net"
    },
    {
      "url": "https://torontohousing.ca/contact-us",
      "email": "311@toronto.ca"
    },
    {
      "url": "https://torontohousing.ca/contact-us",
      "email": "help@torontohousing.ca"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/sanibel-community-house/49938",
      "email": "info@sanibelcommunityhouse.net"
    }
  ],
  "mails": [
    "09_september-is-basic-literacy-education-month-500x383@2x.jpg",
    "311@toronto.ca",
    "bailey-matthews-national-shell-museum-aquarium-scaled-500x383@2x.jpg",
    "buildingcontrol@redbridge.gov.uk",
    "emily@sanibelcommunityhouse.net",
    "fair-scaled-500x383@2x.jpg",
    "help@torontohousing.ca",
    "info@gulfcoastam.com",
    "info@safehavencommunityservices.org",
    "info@sanibelchurch.com",
    "info@sanibelcommunityhouse.net",
    "jennifer@sanibelcomunityhouse.net",
    "jog-pic-500x383@2x.jpg",
    "kristin@sanibelcommunityhouse.net",
    "marco@sanibelcommunityhouse.net",
    "pressoffice@redbridge.gov.uk",
    "taylor@irisprintdesigns.com",
    "trusha.patel2@redbridge.gov.uk",
    "wayne-kliewer-pretty-in-pick-1-scaled-500x383@2x.jpg"
  ],
  "nombre_sitio": "sanibelcommunityhouse.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sanibelcommunityhouse.net/about/",
      "text": "About Us - Sanibel Community Association – The Community House Skip to main content Search Menu Home Shell Show & Festival Events Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Support Us Overview Become a Member Donate Online Volunteer About Us About Us Overview Board of Directors Staff News News Overview Newsletter Archive Subscribe to Newsletter Gallery Contact Us Get in touch Submit the form on the contact page , or reach out using one of\n          the methods below. kristin@sanibelcommunityhouse.net (239) 472-2155 2173 Periwinkle Way Sanibel, FL 33957 Sanibel Community Association - The Community House - Home Page News News Newsletter Archive Subscribe to Newsletter Gallery About Us Overview Board of Directors Staff Contact Us Contact Us Privacy Policy search Facebook profile LinkedIn profile LinkedIn profile Instagram profile Your Cart Page Shell Show & Festival Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Donate Become a Member Volunteer Toggle mobile menu About Our Mission Statement: “To enrich community spirit through educational, cultural and social gatherings in our historic Community House.” Curtis Perry The Early Days Part-time Captiva resident Curtis Perry, of Brunswick, Maine, walked the length of Captiva and Sanibel and convinced residents a community center was needed. Going door to door, he not only got them to believe in the idea, he asked them to contribute money, labor, and materials to make the center a reality. Perry was a confirmed bachelor and resident artist. The Community House is considered to be “The Heart of the Island”, with its rich history of serving islanders as both a gathering place for island activities as well as a rental space for private events. Built in 1927, The land upon which the SCA sits was donated by one of Sanibel’s original residents, Cordie Nutt. Keeping The Community House in service to the community is a Sacred Trust carried on by the board of directors. History is rich within the walls of The Community House. The Historic “Founder’s Room” has been open to the public since 1927. We invite you to stop in for a tour and see for yourself where it all began. The Community House strives to become an eco-friendly home all the while keeping our commitment to honoring our rich history by preserving our historic rooms.​ About SCA Inc. The Sanibel Community Association (SCA) is an independent organization that operates “The Community House,” which not only serves as an event location but also offers rental space. The Community House is composed of 3 rooms that can be rented separately or altogether (the entire building). Churches, civic organizations, clubs, non-profits, and island families have used The Community House for their parties, weddings, fundraisers, and other special events. Located conveniently on the west end of Periwinkle near Dunlop Road, The Community House is the place to meet neighbors and friends! We invite you to be a contributing partner and help support events in our historic building, the only island venue that is uniquely Sanibel. There is always something happening at The Community House. Come join us and see! Sanibel Community Association Inc. EIN# 59-1060466 The Community House serves as the historical heart of the island. Any public, private, individual, or group is welcome. One of the First Non-Profits on the Island Since 1927, The Community House has served as the gathering place of the islands. Many social organizations, civic groups, and clubs that first found a home here at The Community House are still here to this day. Though the Sanibel Community Association and therefore the Community House is not part of the City of Sanibel government or properties, the city actually has its roots here; the famous referendum of 1974 that incorporated the City of Sanibel was held here. The historic Founder’s Room was also the meeting place for the very first City Council meetings. The Community House also hosts many large events and festivals including the Annual Shell Show and Festival. It is one of the largest and longest-running Shell-related shows in the world, and it funds a large portion of SCA’s operations within the community. The Community House Welcome to the Sanibel Community Association. We are a 501(c)3 nonprofit organization governed by a volunteer board of directors. The funds we raise through membership dues, fundraisers, events, donations and room rental income are used to operate The Community House. Established in 1927 as a local gathering place for all residents and visitors, The Community House was the birthplace for many civic groups and the incorporation of Sanibel as a city. sca board of directors Emily Ankerson Executive Director ~ Email Kristin Van Olst Director of Engagement ~ Email Jennifer Canner Executive Administrative Assistant ~ Email Marco Ospina Director of Programs and Events ~ Email Melanie Moraga Membership Development and Communications Support Hunter Frew Facilities Current Job Openings Facility Set Up More Information / Apply Online Donate Today! We invite you to support events in our historic building, the only island venue that is uniquely Sanibel. There is always something happening at The Community House. Click Here to Donate! Home Calendar About Rentals Contact Us Address 2173 Periwinkle Way, Sanibel, FL 33957 Contact 239.472.2155 kristin@sanibelcommunityhouse.net Office Hours Weekdays | Mon - Fri 9am to 1pm View Lee County Tourist Development Council Facebook profile LinkedIn profile LinkedIn profile Instagram profile Copyright ©\n          2025 Sanibel Community Association. All Rights Reserved. Built by BOOST Creative"
    },
    {
      "url": "https://www.gulfcoastam.com/sanibel-hoa-management",
      "text": "Sanibel Association Management | Gulf Coast Association Management Skip to main content Homeowner Login Board Member Login (941) 213-4801 Home Management Services HOA Overview Accounting & Reporting Maintenance & Inspections Support Services Community Outreach Assessment Collection Compliance Resort Management Overview Operations Housekeeping & Maintenance Guest Services Revenue Management Our Communities Board Members Board Member Resources Board Member Login Homeowners Homeowner Resources Homeowner Login Forms Estoppel Request Onboarding Form Contact Info Update Form Blog About About Us Testimonials Contact MENU (941) 213-4801 Homeowner Login Board Member Login Home Management Services HOA Overview Accounting & Reporting Maintenance & Inspections Support Services Community Outreach Assessment Collection Compliance Resort Management Overview Operations Housekeeping & Maintenance Guest Services Revenue Management Our Communities Board Members Board Member Resources Board Member Login Homeowners Homeowner Resources Homeowner Login Forms Estoppel Request Onboarding Form Contact Info Update Form Blog About About Us Testimonials Contact Twitter Youtube Facebook Linked In Instagram Full Service HOA Management for Sanibel Gulf Coast puts you back in control of your community. Overview Accounting Maintenance Support Community Outreach Assessments Compliance Overview We’re a full-service community association management company. Our dedicated team of licensed professionals has decades of management experience with a specific goal in mind: to strengthen communities. The Gulf Coast staff includes in-house resources for bookkeeping, maintenance, inspections and much more.\tNo two associations are the same, therefore whether your association needs full-service management or just assistance with financials, we have a program to suit your needs and budget. Gulf Coast understands that a well-run community benefits everyone! Request a Proposal What We Do As your Manatee, Sarasota, Lee and Charlotte County Community Association Manager ACCOUNTING & REPORTING We handle budget preparation, accounts payable and receivable, reserve analysis, payroll, and collections, consolidating the data into clear and concise monthly financial reports for your convenience. LEARN MORE MAINTENANCE & INSPECTIONS We organize and oversee all community maintenance requirements, ensuring round-the-clock emergency response, conducting inspections of common areas, and scheduling regular maintenance tasks. LEARN MORE SUPPORT SERVICES We provide support to boards by aiding in document preparation, facilitating meetings, maintaining records, and offering consulting services to enhance efficiency and organization. LEARN MORE COMMUNITY OUTREACH & ENGAGEMENT The Online Portal provides board members and homeowners with a platform for effective communication, offering real-time access to all community information and data. LEARN MORE ASSESSMENT COLLECTION Our Online Portal for homeowners simplifies the collection of payments, ensuring owners can easily track the status of their accounts LEARN MORE COMPLIANCE Confronting neighbors about violations is something no one looks forward to. However, we handle inspections, enforcement, and the meticulous record-keeping of all violations and compliance reports on your behalf. LEARN MORE We Have Three Goals When Managing Your Manatee, Sarasota, Lee and Charlotte County Community 1 Make Your Community the Best Place to Live. 2 Deliver Superb Service to Board Members and Residents. 3 Add Tangible Value Back to Your Community. Administrative Management Handling of all membership inquiries Organize & attend membership meetings Estoppel Services Selecting insurance providers and policies for board approval Obtaining competitive bids for services Monitoring of local/national laws and advice on pertinent legislative issues Communicating with city, state and county authorities as needed Financial Management Accounting and Reporting Budget Preparation Vendor and Invoice Management Monthly reconciliations Maintenance & Building Management Enforcement of community association covenants, conditions and restrictions Common area inspections Architectural Review Process Compliance and Violations Online maintenance and work order management 24-hour availability/on-call maintenance Discover Sanibel Because Your Community Is Your Home Sanibel Island, Florida, is celebrated for its unique blend of natural beauty and commitment to environmental preservation. Known for its lush landscapes and abundant wildlife, the island offers a peaceful retreat from the hustle and bustle of city life. Its beaches, famous for their abundance of seashells, provide a serene setting for beachcombing and relaxation. Sanibel’s approach to development is distinctive, with a focus on maintaining its natural environment through strict zoning laws and a commitment to low-rise buildings. This dedication to conservation is complemented by a range of eco-friendly activities and educational programs at places like the J.N. \"Ding\" Darling National Wildlife Refuge. The management of Sanibel’s community is integral to maintaining its character and quality of life. Homeowners' associations (HOAs) and local governance bodies are actively involved in overseeing the island’s growth and preserving its ecological integrity. These organizations play a key role in implementing community guidelines, managing public spaces, and promoting sustainable practices. Their work ensures that Sanibel remains a desirable and harmonious place to live, reflecting the island’s values of environmental respect and community engagement. Areas We Serve Bradenton Ellenton Lakewood Ranch Parrish Sarasota Venice Englewood North Port Port Charlotte Punta Gorda Barrier Islands Wellen Park Nokomis Longboat Key Palmetto Siesta Key Anna Maria Island Palm Island Sanibel Captiva Fort Myers Fort Myers Beach Lido Key CONTACT Office: (941) 213-4801 Email: Info@gulfcoastam.com 11051 Gatewood Drive Bradenton , FL 34211 Gulf Coast Association Management 11051 Gatewood Drive Bradenton , FL 34211 (941) 213-4801 Info@gulfcoastam.com social sharing Bradenton Property Management Property Management Bradenton Property Management, Bradenton investment services, Bradenton Real Estate portfolio management, Bradenton Houses and Homes for Rent Office Hours - Mon - Fri - 9AM - 5PM Operational Hours - Mon - Sun - 9AM - 10PM Emergency Hours - 24/7 QUICK LINKS HOA Services Resort Management Our Communities Board Member Resources Homeowner Resources About Contact Blog CONNECT Twitter Youtube Facebook Linked In Instagram Copyright 2025 Gulf Coast Association Management. All Rights Reserved.\n\t\t\t\t\t\tProperty Manager Website powered by PMW . Sitemap Privacy Policy Gulf Coast Association Management is committed to ensuring that its website is accessible to people\n\t\t\t\t\t\twith disabilities. All the pages on our website will meet W3C WAI's Web Content Accessibility Guidelines 2.0,\n\t\t\t\t\t\tLevel A conformance. Any issues should be reported to Info@gulfcoastam.com . Website Accessibility Policy"
    },
    {
      "url": "https://members.sanibel-captiva.org/sanibel-community-house-moving-quickly-to-reopen-for-2023-24-season/",
      "text": "Sanibel Community House Moving Quickly To Reopen For 2023/24 Season - Sanibel-Captiva Chamber of Commerce Members Skip to content Business Search Calendar of Events Lodging Vacancies Search for: Chambers Healthcare Home Our Chamber About Us Staff Board of Directors Annual Report Job Opportunities News Contact Membership Member Testimonials Member Benefits Marketing Opportunities Directory Join the Chamber Member Login Advocacy John Lai On Deck CAPTAINS FOR CLEAN WATER Legislative Priorities Programs & Events Sanibel 50th Anniversary Previous Next Sanibel Community House Moving Quickly To Reopen For 2023/24 Season Like many Island facilities, the Sanibel Community House has had some unique challenges in recovering from Hurricane Ian.  Many items needed to make repairs have been in short supply–everything from construction materials to electrical components, computer systems, audio-visual equipment and skilled labor, all of which has slowed down restoration work. However, eight months after the storm left its mark, the Community House has announced that it expects to return to full operation in September, in time to host meetings and events for groups and organizations planning for the upcoming fall-spring season.  Those wishing to reserve space and times for upcoming activities should contact the Community House office at 239-472-2155. Community House Executive Director Teresa Riska-Hall explained that opening the facility will happen in three phases over the summer, with partial access for some smaller events by June 15.  In the first phase, Phase 1, the lobby area, the “Islanders” small meeting room, rest rooms and outdoor veranda will be available for smaller events.  By August 31, Phase 2 will be added, including the “Great Hall” auditorium, “Community Room” and kitchen facilities. Groups that have held their regular meetings at the Community House in the past, including the Rotary Club and the Shellcrafters, will be moving their activities back to the House in the coming weeks. The final phase, Phase 3, will come on stream by October 1, adding the “Founders Room”, which was part of the the original Community House historic structure dating from 1927.  Said Riska-Hall: “The floodwater from Ian washed out the original foundation pillars of the Founders Room, and repairing that area has been one of the most complicated parts of our restoration work, requiring the most time to complete.  But we are happy to report it should be ready to go by October.” The Community House had completed a complete renovation project in 2016 which was much appreciated by Islanders, making the recent damage from Hurricane Ian all the more unfortunate.  Current restoration work is designed to bring the facility back to its pre-storm function and appearance. The Sanibel Community House, now in its 97 th year, is owned and operated by the Sanibel Community Association (SCA), a non-profit 501-c-3 organization, with a long-held mission is to serve the civic, social and educational needs of the residents of our Island community.  Said SCA Board President Carol Townsley:  “This is a very happy announcement for us. The SCA Board has been anxious to get the Community House back in service and available to our Island neighbors to help them return to normal.  Many groups rely on the House as a place to meet, and Island non-profits rely on it for their very important fundraising activities.  We look forward to welcoming them back and supporting their work.” Jade Nakonetschny 2023-05-26T13:06:57-04:00 May 26th, 2023 | Uncategorized | Share This Story, Choose Your Platform! Facebook X Reddit LinkedIn WhatsApp Tumblr Pinterest Vk Email Related Posts JOIN THE CHAMBER Business Name: * Email: * Primary Contact: * Physical Address: * Full-Time Employees: * JOIN THE CHAMBER This field should be left blank 1159 Causeway Road Sanibel Island, FL 33957 239-472-1080 Contact Us Chamber Business Member Login Sanibel & Captiva Island Quick Links Daily Vacancy » Hot Deals » Resorts & Hotels » Inns & Cottages » Vacation Condos » Vacation Homes » Jobs » Press Room » Chamber Info » Business Search » Recent News From The Chamber Sign Up for our Monthly Newsletter Submit Checkout Island Happenings » Today’s Lodging Vacancies » Search Our Site Search for: Translate this Page Photo Credit: Lee County Visitor & Convention Bureau. © Copyright 2019-2025 Sanibel & Captiva Islands Chamber of Commerce | All Rights Reserved Worldwide. Privacy & Legal Notice Page load link Go to Top"
    },
    {
      "url": "https://www.redbridge.gov.uk/contact-us/",
      "text": "Contact us Cookies on Redbridge.gov.uk We use some essential cookies to make this website work. We’d like to set additional cookies to understand how you use our website, remember your settings and improve our services. We also use cookies set by other sites to help us deliver content from their services. Accept additional cookies Reject additional cookies View cookies You've accepted additional cookies. You can change your cookie settings at any time. Hide cookie message You've rejected additional cookies. You can change your cookie settings at any time. Hide cookie message Skip to main content Login Register Accessibility Tools Navigation menu Search Redbridge × Search Redbridge Menu Intelligent search Try our AI powered search What are you looking for? Tab Switch to Classic search AI-generated content can sometimes make mistakes. Check the 'References' for important info. Classic search What are you looking for? Search REDBRIDGE.GOV.UK Switch to Intelligent search Report it Apply for it Pay for it Book it About the council Adult and children's services Benefits and financial support Bins, waste and recycling Births, deaths, marriages, civil partnerships and citizenship Business Council Tax Crime and public safety Feedback and complaints Have your say Health and wellbeing Housing Jobs Leisure, sport and the arts Libraries Our streets Parking Pensions Planning and building Regeneration and growth Roads and pavements Schools Voting and elections Young people Home Contact Us Important × Our improved Redbridge Council website We have improved our website to help you find information and access what you need more easily. If you find something that is not working properly or have any feedback, please let us know. Give us your feedback Contact us Telephone enquiries Our call centre can get very busy, and we are asking you to help us by only contacting us if you have an urgent query. We want to prioritise helping our more vulnerable customers. If you can use our website to contact us or report, this will enable us to support those who can’t use other channels available to them. You can contact us via our online contact form. We will get back to you with the support you need. Changes to the Customer Contact Centre at Lynton House If you wish to speak with us, please call our customer service advisors on 020 8554 5000 who will be able to help you with your enquiry or direct you to where you can access more information. We do receive a high number of calls and regrettably customers may experience a delay in their call being answered. Alternatively you can contact us via our online contact form and we will get back to you. You can also visit our Engagement Hubs and access various support you need in your local community. You can call us between 8am to 6pm Monday to Friday. Telephone appointments will be scheduled between 9am to 4pm as per opening times. Calls outside of these hours including weekends will be answered by our out of hours service. Our Face to face service at Lynton House is available by pre-booked appointment only. We will only see customers with an immediate emergency. If you require these services please call using the relevant contact details: Customer services: 020 8554 5000 Housing 020 8708 4002 – open Monday to Friday, 9am to 4.45pm Council tax 020 8708 5670 – open Monday to Friday, 8:30am to 5pm Benefits 020 8708 5690 – open Monday to Friday, 8:30am to 5pm Adult Social Service 020 8708 7333 – open Monday to Sunday, 9am to 5pm Children’s Services 020 8708 3885 – open Monday to Friday, 9am to 5pm Other Enquiries 020 8554 5000 – open Monday to Friday, 8am to 6pm Online services Did you know you can report a problem, book an appointment, apply and pay through our website at a time that suits you. Sometimes this might be quicker and easier for you to let us know about a problem. If you are having difficulties finding any information or would like to contact us about any of our services please complete our online form and we will get back to you with an answer as soon as we can. Contact us form Want to make a compliment or complaint about our services? Visit our have your say page . Report it Pay for it Apply for it Book it If you want to call us You can call our customer service advisors on 020 8554 5000 who will be able to help you with your enquiry or direct you to where you can access more information. We are open Monday to Friday from 8am to 6pm. If you need Text Relay Services you should dial 18001 before this number to access the text relay service. Direct services To make a payment – 24 hour automated payment line 020 8708 4708 Please check our opening hours during Christmas and New Year Council Tax enquiries – open between 8.30am to 5pm Monday to Friday - 020 8708 5670 Council Tax reduction (formerly Council Tax Benefit) – open between 8.30am to 5pm Monday to Friday - 020 8708 5690 Blue Badge application and enquiries - 020 7520 7205 Housing Benefit enquiries – open between 8.30am to 5pm Monday to Friday - 020 8708 5690 Housing advice and options – open 9am to 4.45pm Monday to Friday – 020 8708 4002/4003 Planning Enquiries – open between 9am to 5pm Monday to Friday - 0208 708 2884 Planning and pre-application payments -  0208 708 4708 (this is an automated payment service available 24/7. You will be presented with a list of payment options - please press 9 for planning) Building Control payments and enquiries - open between 8:30am and 10:30am Monday to Friday - 020 8708 2529. After 10.30 you can email Building Control alternatively our customer services advisor will take your details and the nature of your query and pass this over to the Building Control team. Are you worried about a vulnerable child? You can call our Child protection services between 9am and 5pm on 020 8708 3885 Are you worried about a vulnerable adult? You can call our Adult first contact team between 9am and 5pm on 020 8708 7333 Emergency out of office hours enquiries For emergency out of hours please call 020 8554 5000 or 02087085897 every day 6pm to 8am Out of hours emergency calls: antisocial behaviour registrars dangerous structures Lifeline If you are worried about a vulnerable child you can call child protection emergencies out of hours call 020 8708 5897. Contact us using British Sign Language (BSL) If you are a British Sign Language (BSL) user, you can contact us using the InterpretersLive! service, provided by Sign Solutions. Contact us using a BSL interpreter When you can contact us The video call service is available for: General enquiries - Monday to Friday 8am to 6pm Housing benefits and council tax - Monday to Friday 8.30am to 4pm Emergency out of hours - every day 8am to 8pm (outside of these hours you can text 07800 140 749) How to use BSL video interpretation? The BSL video InterpretersLive! service will connect you to a video BSL Interpreter. Go to InterpretersLive! Enter your name (this is optional) and select which Redbridge service you want to contact You will then be connected to a video BSL Interpreter Read the InterpretersLive! privacy statement Visit us Redbridge Customer Centre Lynton House 255 - 259 High Road Ilford IG1 1NY Day Time Monday 9am to 4pm Tuesday 9am to 4pm Wednesday 9am to 4pm Thursday 9am to 4pm Friday 9am to 4pm Saturday Closed Sunday Closed Bank Holidays and Public Holidays Closed Accessibility Should you be asked to attend an appointment, disabled access is available at the main entrance. Facilities include: hearing loop digital support easy read larger rooms available for wheelchair access Our website has an accessibility tool called 'Recite Me' which allows you to change the language, font size and style and magnify our website content. You can access this by clicking the accessibility button in the top right-hand corner of the page. Write to us Lynton House 255 - 259 High Road Ilford IG1 1NY Press office The Redbridge Press Office deals with all media enquiries to the Council. If you’re a journalist with a media enquiry, email pressoffice@redbridge.gov.uk Have your say Visit our Have your say webpage to make a compliment or compliant about our services, give feedback and view our consultations. Your feedback is important to us Help us improve our service Support links Accessibility statement About accessibility Privacy and cookies Contact us Support links Feedback Terms of use Maps © 2025 Redbridge Council"
    },
    {
      "url": "https://www.sanibelchurch.com/contact",
      "text": "Contact - Sanibel Communty Church Skip to content About Us Our Mission Our Beliefs Our History Our Team Directory Contact The Gospel Next Steps Connect Card Membership Seminar Volunteer Join a Community Group Events Ministries Men’s Women’s Kids Teens Young Adults Community Groups Watch Give About Us Our Mission Our Beliefs Our History Our Team Directory Contact The Gospel Next Steps Connect Card Membership Seminar Volunteer Join a Community Group Events Ministries Men’s Women’s Kids Teens Young Adults Community Groups Watch Give Contact Us Get in Touch We’d love to hear from you. Contact us by phone, email or by clicking the button below to fill out a form to get started 1740 Periwinkle Way Sanibel, FL 33957 (239) 472-2684 info@sanibelchurch.com Submit a Form Facebook-f Instagram Youtube Service Times Sunday Morning 10am Get Our App Contact Info 1740 Periwinkle Way Sanibel, FL 33957 (239) 472-2684 info@sanibelchurch.com Get Updates Subscribe to our newsletter to get updates about news and events at SCC. Subscribe We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://sanibelcommunityhouse.net/event/sanibel-captiva-business-womens-association-2/",
      "text": "Sanibel Captiva Business Women’s Association Open House - Sanibel Community Association – The Community House Skip to main content Search Menu Home Shell Show & Festival Events Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Support Us Overview Become a Member Donate Online Volunteer About Us About Us Overview Board of Directors Staff News News Overview Newsletter Archive Subscribe to Newsletter Gallery Contact Us Get in touch Submit the form on the contact page , or reach out using one of\n          the methods below. kristin@sanibelcommunityhouse.net (239) 472-2155 2173 Periwinkle Way Sanibel, FL 33957 Sanibel Community Association - The Community House - Home Page News News Newsletter Archive Subscribe to Newsletter Gallery About Us Overview Board of Directors Staff Contact Us Contact Us Privacy Policy search Facebook profile LinkedIn profile LinkedIn profile Instagram profile Your Cart Page Shell Show & Festival Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Donate Become a Member Volunteer Toggle mobile menu Event Calendar Back to Calendar Sanibel Captiva Business Women’s Association Open House SCBWA invites women of Sanibel and Captiva community to join them for an evening of networking and socializing. Each year, SCBWA gathers to show member appreciation and welcome new prospective members. The evening will include food, refreshments and an opportunity to win door prizes. Members are encouraged to bring a non-member friend. A special thank you to our event sponsors, Custom Goods Unlimited and MHK Architecture In previous years, the annual open house has brought more than 50 women from the community for a fun evening of fellowship. In three years, SCBWA has grown to a group of more than 60 active members. SCBWA is dedicated to empowering and supporting the women who work and live on the islands through networking, mentorship, continuing education and career advancement. SCBWA aims to serve the community by offering an inclusive, supportive and diverse group of women supporting women. Its focus is the advancement of women’s career development targeted to workers, aspiring workers and residents of Sanibel and Captiva. The group meets every third Tuesday of the month at various businesses and restaurants at noon. Registration is required for the event on Eventbrite . For additional questions contact taylor@irisprintdesigns.com . Updates are posted at www.facebook.com/SanCapBWA . Event Details This event has passed. Date: Tuesday, May 7th, 2024 Time: 5:00PM -\r\n              8:00PM Location: 2173 Periwinkle Way Sanibel , FL 33957 United States Admission: $10/Registration is required. Register Add to your calendar: Google Calendar iCal Export Print Event Similar Events View https:sanibelcommunityhouse.neteventrotary-meeting-22025-09-12 View Cultural Cultural September 12th, 2025 7:30AM -\r\n        9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventrotary-meeting-22025-09-19 View Cultural Cultural September 19th, 2025 7:30AM -\r\n        9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventrotary-meeting-22025-09-26 View Cultural Cultural September 26th, 2025 7:30AM -\r\n        9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventrotary-meeting-22025-10-03 View Cultural Cultural October 3rd, 2025 7:30AM -\r\n        9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventsanibel-island-fishing-club-meeting-8 View Cultural Cultural October 7th, 2025 6:30PM -\r\n        8:30PM Sanibel Island Fishing Club Meeting View https:sanibelcommunityhouse.neteventrotary-meeting-22025-10-10 View Cultural Cultural October 10th, 2025 7:30AM -\r\n        9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventrotary-meeting-22025-10-17 View Cultural Cultural October 17th, 2025 7:30AM -\r\n        9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventrotary-meeting-22025-10-24 View Cultural Cultural October 24th, 2025 7:30AM -\r\n        9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventrotary-meeting-22025-10-31 View Cultural Cultural October 31st, 2025 7:30AM -\r\n        9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventrotary-meeting-22025-11-07 View Cultural Cultural November 7th, 2025 7:30AM -\r\n        9:00AM Rotary Meeting"
    },
    {
      "url": "https://members.sanibel-captiva.org/the-sanibel-community-house-and-sanibel-community-association-sca-announces-new-executive-director/",
      "text": "The Sanibel Community House and Sanibel Community Association (SCA) Announces New Executive Director - Sanibel-Captiva Chamber of Commerce Members Skip to content Business Search Calendar of Events Lodging Vacancies Search for: Chambers Healthcare Home Our Chamber About Us Staff Board of Directors Annual Report Job Opportunities News Contact Membership Member Testimonials Member Benefits Marketing Opportunities Directory Join the Chamber Member Login Advocacy John Lai On Deck CAPTAINS FOR CLEAN WATER Legislative Priorities Programs & Events Sanibel 50th Anniversary Previous Next The Sanibel Community House and Sanibel Community Association (SCA) Announces New Executive Director The Sanibel Community House & Sanibel Community Association (SCA) is pleased to announce Emily Ankerson as the new Executive Director for the organization. Ms. Ankerson has served as Executive Director of the Captiva Civic Association since 2021 and previously worked as an administrator at an arts education non-profit in West Palm Beach. She holds a master’s degree from Saint Michael’s College in Vermont and dedicated the beginning years of her career to education before entering the nonprofit sector. The mission of the Sanibel Community Association is to enrich community spirit through educational, cultural, and social gatherings in the historic Community House. Built in 1927, The Community House has long served as a gathering place for neighbors and friends, holding rich history within its walls. The Community House lies in the “heart” of the islands, as a midway point between the water’s edge and Captiva Island, and thrives on hosting educational programs, social gatherings, weddings, classes, meetings, demonstrations, fundraisers, and many other special events and activities throughout each year. As the Executive Director, Ms. Ankerson will bring her skills in strategic leadership, experience in non-profit growth and brand-building, a positive and collaborative community presence, and will strive to grow and foster member relationships and support for the Community House. Most importantly, she brings her enthusiasm and excitement for a bright and successful future for the organization and for fulfilling and enhancing its mission. For any additional information or questions, please contact [email protected] Jade Nakonetschny 2024-08-26T06:41:13-04:00 August 26th, 2024 | Uncategorized | Share This Story, Choose Your Platform! Facebook X Reddit LinkedIn WhatsApp Tumblr Pinterest Vk Email Related Posts JOIN THE CHAMBER Business Name: * Email: * Primary Contact: * Physical Address: * Full-Time Employees: * JOIN THE CHAMBER This field should be left blank 1159 Causeway Road Sanibel Island, FL 33957 239-472-1080 Contact Us Chamber Business Member Login Sanibel & Captiva Island Quick Links Daily Vacancy » Hot Deals » Resorts & Hotels » Inns & Cottages » Vacation Condos » Vacation Homes » Jobs » Press Room » Chamber Info » Business Search » Recent News From The Chamber Sign Up for our Monthly Newsletter Submit Checkout Island Happenings » Today’s Lodging Vacancies » Search Our Site Search for: Translate this Page Photo Credit: Lee County Visitor & Convention Bureau. © Copyright 2019-2025 Sanibel & Captiva Islands Chamber of Commerce | All Rights Reserved Worldwide. Privacy & Legal Notice Page load link Go to Top"
    },
    {
      "url": "https://sanibelcommunityhouse.net/event/summer-showcase/2024-06-24/",
      "text": "Summer Showcase - Sanibel Community Association – The Community House Skip to main content Search Menu Home Shell Show & Festival Events Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Support Us Overview Become a Member Donate Online Volunteer About Us About Us Overview Board of Directors Staff News News Overview Newsletter Archive Subscribe to Newsletter Gallery Contact Us Get in touch Submit the form on the contact page , or reach out using one of\n          the methods below. kristin@sanibelcommunityhouse.net (239) 472-2155 2173 Periwinkle Way Sanibel, FL 33957 Sanibel Community Association - The Community House - Home Page News News Newsletter Archive Subscribe to Newsletter Gallery About Us Overview Board of Directors Staff Contact Us Contact Us Privacy Policy search Facebook profile LinkedIn profile LinkedIn profile Instagram profile Your Cart Page Shell Show & Festival Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Donate Become a Member Volunteer Toggle mobile menu Event Calendar Back to Calendar Summer Showcase Step into our lobby and immerse yourself into a world of inspiration and creativity at the “Summer Showcase”, presented in part with the Sanibel-Captiva Art League . Join us on weekdays from 9:00am-1:00pm during the months of May and June, (excluding holidays) featuring the magnificent talent of several local artists in our community. Don’t miss this chance to shop locally, support our community and experience the beauty of their work firsthand! All pieces in the showcase are available for purchase by contacting the featured artist directly by calling the number listed on the labels. A portion of the proceeds benefit The Sanibel Community House. Event Details This event has passed. Date: Monday, June 24th, 2024 Time: 9:00AM -\r\n              1:00PM Recurs: Daily 5/06/24 - 1/01/70 Location: 2173 Periwinkle Way Sanibel , FL 33957 United States Admission: Free Admission Add to your calendar: Google Calendar iCal Export Print Event Similar Events View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-09-15 View Art Art September 15th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-09-22 View Art Art September 22nd, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-09-29 View Art Art September 29th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-10-06 View Art Art October 6th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-10-13 View Art Art October 13th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-10-20 View Art Art October 20th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-10-27 View Art Art October 27th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-11-03 View Art Art November 3rd, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-11-10 View Art Art November 10th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-11-17 View Art Art November 17th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class"
    },
    {
      "url": "https://sanibelcommunityhouse.net/",
      "text": "The Community House Skip to main content Search Menu Home Shell Show & Festival Events Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Support Us Overview Become a Member Donate Online Volunteer About Us About Us Overview Board of Directors Staff News News Overview Newsletter Archive Subscribe to Newsletter Gallery Contact Us Get in touch Submit the form on the contact page , or reach out using one of\n          the methods below. kristin@sanibelcommunityhouse.net (239) 472-2155 2173 Periwinkle Way Sanibel, FL 33957 Sanibel Community Association - The Community House - Home Page News News Newsletter Archive Subscribe to Newsletter Gallery About Us Overview Board of Directors Staff Contact Us Contact Us Privacy Policy search Facebook profile LinkedIn profile LinkedIn profile Instagram profile Your Cart Page Shell Show & Festival Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Donate Become a Member Volunteer Toggle mobile menu The Island Gathering Place Since 1927 Welcome to the Islands’ Home The Community House is where friends and residents meet to socialize through education, culture, events, and programs presented by the Sanibel Community Association. Learn More View Sanibel Community House YouTube Video Featured Events View https:sanibelcommunityhouse.neteventrotary-meeting-22025-09-12 Virtual Art Show View Cultural Cultural September 12th 7:30AM - 9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventsanibel-hearts-22025-09-12 Virtual Art Show View Social Social September 12th 1:00PM - 3:00PM Sanibel Hearts View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-09-15 Virtual Art Show View Art Art September 15th 10:00AM - 1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventrotary-meeting-22025-09-19 Virtual Art Show View Cultural Cultural September 19th 7:30AM - 9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventsanibel-hearts-22025-09-19 Virtual Art Show View Social Social September 19th 1:00PM - 3:00PM Sanibel Hearts View https:sanibelcommunityhouse.neteventinternational-talk-like-a-pirate-day-happy-hour Virtual Art Show View Community Community September 19th 4:30PM - 6:30PM International Talk Like a Pirate Day Happy Hour View https:sanibelcommunityhouse.neteventprivate-event-43 Virtual Art Show View September 21st 6:00PM - 10:00PM Private Event View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-09-22 Virtual Art Show View Art Art September 22nd 10:00AM - 1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventrotary-meeting-22025-09-26 Virtual Art Show View Cultural Cultural September 26th 7:30AM - 9:00AM Rotary Meeting View https:sanibelcommunityhouse.neteventsanibel-hearts-22025-09-26 Virtual Art Show View Social Social September 26th 1:00PM - 3:00PM Sanibel Hearts View Our Full Calendar View\n                    https:interland3.donorperfect.netweblinkWebLink.aspx?name=sanibel&id=1 Become a Member View\n                    https:interland3.donorperfect.netweblinkWebLink.aspx?name=sanibel&id=65 Donate View\n                    supportvolunteer Volunteer Artist News Tue, July 8, 2025 Be the first to know more information by signing up to receive our email notifications! subscribe here to for e-news READ more View More Articles Donate Today! We invite you to support events in our historic building, the only island venue that is uniquely Sanibel. There is always something happening at The Community House. Click Here to Donate! Home Calendar About Rentals Contact Us Address 2173 Periwinkle Way, Sanibel, FL 33957 Contact 239.472.2155 kristin@sanibelcommunityhouse.net Office Hours Weekdays | Mon - Fri 9am to 1pm View Lee County Tourist Development Council Facebook profile LinkedIn profile LinkedIn profile Instagram profile Copyright ©\n          2025 Sanibel Community Association. All Rights Reserved. Built by BOOST Creative"
    },
    {
      "url": "https://sanibelcommunityhouse.net/event/sanibel-art-fest/2024-02-10/",
      "text": "Sanibel Art Fest - Sanibel Community Association – The Community House Skip to main content Search Menu Home Shell Show & Festival Events Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Support Us Overview Become a Member Donate Online Volunteer About Us About Us Overview Board of Directors Staff News News Overview Newsletter Archive Subscribe to Newsletter Gallery Contact Us Get in touch Submit the form on the contact page , or reach out using one of\n          the methods below. kristin@sanibelcommunityhouse.net (239) 472-2155 2173 Periwinkle Way Sanibel, FL 33957 Sanibel Community Association - The Community House - Home Page News News Newsletter Archive Subscribe to Newsletter Gallery About Us Overview Board of Directors Staff Contact Us Contact Us Privacy Policy search Facebook profile LinkedIn profile LinkedIn profile Instagram profile Your Cart Page Shell Show & Festival Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Donate Become a Member Volunteer Toggle mobile menu Event Calendar Back to Calendar Sanibel Art Fest The Annual Sanibel Art Festival will be held on Saturday and Sunday February 10th and 11th from 9am-4pm. Check out the works of artists from near and far. Proceeds from the event will benefit The Sanibel Community House and The SCA. Click HERE for more information about Boulderbrook Productions and the Indoor Sanibel Art Fest. Event Details This event has passed. Date: Saturday, February 10th, 2024 Time: 9:00AM -\r\n              4:00PM Recurs: 2/11/24 Location: 2173 Periwinkle Way Sanibel , FL 33957 United States Admission: Entry is a suggested $5 donation at the gate. Add to your calendar: Google Calendar iCal Export Print Event Similar Events View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-09-15 View Art Art September 15th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-09-22 View Art Art September 22nd, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-09-29 View Art Art September 29th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-10-06 View Art Art October 6th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-10-13 View Art Art October 13th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-10-20 View Art Art October 20th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-10-27 View Art Art October 27th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-11-03 View Art Art November 3rd, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-11-10 View Art Art November 10th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class View https:sanibelcommunityhouse.neteventshell-crafters-2-22025-11-17 View Art Art November 17th, 2025 10:00AM -\r\n        1:00PM Shellcrafters Class"
    },
    {
      "url": "https://sanibelcommunityhouse.net/contact/",
      "text": "Contact Us - Sanibel Community House Skip to main content Search Menu Home Shell Show & Festival Events Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Support Us Overview Become a Member Donate Online Volunteer About Us About Us Overview Board of Directors Staff News News Overview Newsletter Archive Subscribe to Newsletter Gallery Contact Us Get in touch Submit the form on the contact page , or reach out using one of\n          the methods below. kristin@sanibelcommunityhouse.net (239) 472-2155 2173 Periwinkle Way Sanibel, FL 33957 Sanibel Community Association - The Community House - Home Page News News Newsletter Archive Subscribe to Newsletter Gallery About Us Overview Board of Directors Staff Contact Us Contact Us Privacy Policy search Facebook profile LinkedIn profile LinkedIn profile Instagram profile Your Cart Page Shell Show & Festival Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Donate Become a Member Volunteer Toggle mobile menu Contact Us We'd love to hear from you! 2173 Periwinkle Way, Sanibel, FL 33957 Get Directions for 2173 Periwinkle WaySanibel, FL 33957 on Google Maps 239.472.2155 Call Sanibel Community Association - The Community House kristin@sanibelcommunityhouse.net Email Sanibel Community Association - The Community House Contact Form \" * \" indicates required fields First Name * Last Name * Email * Phone * Message * CAPTCHA Δ Locate Us Office Hours Weekdays | Mon - Fri 9am to 1pm Donate Today! We invite you to support events in our historic building, the only island venue that is uniquely Sanibel. There is always something happening at The Community House. Click Here to Donate! Home Calendar About Rentals Contact Us Address 2173 Periwinkle Way, Sanibel, FL 33957 Contact 239.472.2155 kristin@sanibelcommunityhouse.net Office Hours Weekdays | Mon - Fri 9am to 1pm View Lee County Tourist Development Council Facebook profile LinkedIn profile LinkedIn profile Instagram profile Copyright ©\n          2025 Sanibel Community Association. All Rights Reserved. Built by BOOST Creative"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "text": "Contact Safe Haven Community Services: Get in Touch for Foster, Kinship, and Adoption Support — Safe Haven Community Services 0 Skip to Content About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School Open Menu Close Menu Open Menu Close Menu About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School About Folder: Services Back Foster Care Kinship Care Adoption Folder: Training Back Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Folder: Care Giver Portal Back Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery Folder: FAQs Back Foster FAQs Kinship FAQs Adoption FAQs Donate English Back Back-To-School We take pride in delivering exceptional customer service. We Would Love To Connect With You… If you have any questions, please don't hesitate to contact us through the contact form. You can also reach us by email or phone from 9 a.m. to 5 p.m. CST, Monday through Friday. Click on one of the forms below and we will get back to you promptly . Foster Care Foster Care Inquiry Form What services are you interested in? Foster to adopt Foster (only) Respite (only) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for foster children? * Gender preference to foster: * boy(s) girl(s) Any gender Age preference to foster: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your foster care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . kinship care Kinship Care Inquiry Form What services are you interested in? Kinship-Foster to Adopt Kinship Straight to Adopt Kinship to Permanent Legal Conservatorship (PMC) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Name of child's kinship worker: First Name Last Name Phone of Child's kinship worker: (###) ### #### Name of caregiver(s) DFPS worker: First Name Last Name Phone of caregiver(s) DFPS worker (###) ### #### List all children placed in your care by DFPS: Child 1 First Name Last Name Child 1 DOB MM DD YYYY Child 2 First Name Last Name Child 2 DOB MM DD YYYY Child 3 First Name Last Name Child 3 DOB MM DD YYYY Child 4 First Name Last Name Child 4 DOB MM DD YYYY Child 5 First Name Last Name Child 5 DOB MM DD YYYY Child 6 First Name Last Name Child 6 DOB MM DD YYYY Thank you for reaching out to Safe Haven with your kinship care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Adoption Adoption Inquiry Form What services are you interested in? Foster to adopt Straight Adopt Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for adoption/foster children? * Gender preference to adopt: * boy(s) girl(s) Any gender Age preference to adopt: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your adoption inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . General Info General Information Name * First Name Last Name Email * Phone (###) ### #### Subject * Message * Thank you for reaching out to Safe Haven! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Email info@safehavencommunityservices.org Phone (713) 988-7233 (SAFE) Address 8100 Washington Ave. Suite 167 Houston, TX 77007 Sign Up For Our Newsletter Family Focused Treatment Association Partner Affiliates Texas Department of Family and Protective Services Child Welfare League of America Greater Houston Permanency Collaborative Safe Haven Community Services Safe Haven Community Services is a licensed and funded 501(c)(3) nonprofit child-placing agency under the Texas Department of Family and Protective Services EIN: 74-3025434 Additional Services Safe Haven Youth Ranch Selim Behavioral Health Contact Us 713.988.7233 (SAFE) Office Location 8100 Washington Ave, Suite 167 Houston, TX 77007 Site Home About Volunteer Family Gallery Sign Up For Our Newsletter Services Foster Care Adoption Kinship Care Training Annual Training New Family Training Donate CELEBRATING 20 YEARS OF SERVICE!"
    },
    {
      "url": "https://sanibelcommunityhouse.net/board-of-directors/",
      "text": "Board of Directors - Sanibel Community Association – The Community House Skip to main content Search Menu Home Shell Show & Festival Events Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Support Us Overview Become a Member Donate Online Volunteer About Us About Us Overview Board of Directors Staff News News Overview Newsletter Archive Subscribe to Newsletter Gallery Contact Us Get in touch Submit the form on the contact page , or reach out using one of\n          the methods below. kristin@sanibelcommunityhouse.net (239) 472-2155 2173 Periwinkle Way Sanibel, FL 33957 Sanibel Community Association - The Community House - Home Page News News Newsletter Archive Subscribe to Newsletter Gallery About Us Overview Board of Directors Staff Contact Us Contact Us Privacy Policy search Facebook profile LinkedIn profile LinkedIn profile Instagram profile Your Cart Page Shell Show & Festival Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Donate Become a Member Volunteer Toggle mobile menu Board of Directors Dick Bourdow Board President Sarah Jacobson Board Vice President Melissa Lehman Board Secretary Richard Roberts Treasurer Fred Bondurant Director Bob Brooks Director Carmella Cioffi Director Jim McCallion Director Nancy McDole Director Don McDonald Director Mark Reiner Director Josh Stewart Director Valerie Tutor Director Kirk Whalen Director Pete Wiese Director Home Calendar About Rentals Contact Us Address 2173 Periwinkle Way, Sanibel, FL 33957 Contact 239.472.2155 kristin@sanibelcommunityhouse.net Office Hours Weekdays | Mon - Fri 9am to 1pm View Lee County Tourist Development Council Facebook profile LinkedIn profile LinkedIn profile Instagram profile Copyright ©\n          2025 Sanibel Community Association. All Rights Reserved. Built by BOOST Creative"
    },
    {
      "url": "https://sanibelcommunityhouse.net/events/",
      "text": "Archives: Events - Sanibel Community Association – The Community House Skip to main content Search Menu Home Shell Show & Festival Events Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Support Us Overview Become a Member Donate Online Volunteer About Us About Us Overview Board of Directors Staff News News Overview Newsletter Archive Subscribe to Newsletter Gallery Contact Us Get in touch Submit the form on the contact page , or reach out using one of\n          the methods below. kristin@sanibelcommunityhouse.net (239) 472-2155 2173 Periwinkle Way Sanibel, FL 33957 Sanibel Community Association - The Community House - Home Page News News Newsletter Archive Subscribe to Newsletter Gallery About Us Overview Board of Directors Staff Contact Us Contact Us Privacy Policy search Facebook profile LinkedIn profile LinkedIn profile Instagram profile Your Cart Page Shell Show & Festival Calendar Rentals Facility Overview Facility Use Information Plan Your Event Request A Booking Support Us Donate Become a Member Volunteer Toggle mobile menu Event Calendar Monthly Events SCROLL FOR MORE Loading view. Events Search and Views Navigation Search Enter Keyword. Search for Events by Keyword. Find Events Hide filters Event Views Navigation Month List Month Today 9/11/2025 September 2025 Select date. Filters Changing any of the form inputs will cause the list of events to refresh with the filtered results. Done Clear Event Category : Open filter Close filter Event Category Art Community Culinary Cultural Educational Social S Sun M Mon T Tue W Wed T Thu F Fri S Sat 0 events, 31 0 events, 31 0 events, 1 0 events, 1 0 events, 2 0 events, 2 1 event, 3 1 event, 3 11:30 AM - 1:30 PM View Community Category Chamber Business Lunch & Business Resource Fair September 3 @ 11:30 AM - 1:30 PM Chamber Business Lunch & Business Resource Fair The next monthly SanCap business luncheon will take place at 11:30 a.m. Wednesday, September 3, at The Community House, 2173 Periwinkle Way, Sanibel Island. Members of the Sanibel & Captiva Islands Chamber of Commerce will have the opportunity to participate in a Business Resource Fair featuring John Talmage, director of the Lee County Economic Development […] 0 events, 4 0 events, 4 2 events, 5 2 events, 5 7:30 AM - 9:00 AM Event Series View Cultural Category Rotary Meeting September 5 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting Click here for more information about the Sanibel-Captiva Rotary Club. 1:00 PM - 3:00 PM Event Series View Social Category Sanibel Hearts September 5 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts No reservations required, $5 suggested donation. This fun card game is available to all. Beginners are always welcome! 0 events, 6 0 events, 6 0 events, 7 0 events, 7 2 events, 8 2 events, 8 10:00 AM - 1:00 PM Event Series View Art Category Shellcrafters Class September 8 @ 10:00 AM - 1:00 PM Event Series Shellcrafters Class Observe the original Sanibel Island Artists at work from 10am-1pm. A shell crafting class starts at 10am, the class is free, just pay for supplies to create a beautiful shell flower. Approximate Shell Flower Costs: $3-$5/per flower. Other many beautiful items are available for purchase and priced individually. All sales benefit the operations of the […] 10:00 AM - 2:00 PM View Educational Category CFI Nonprofit Training Workshop September 8 @ 10:00 AM - 2:00 PM CFI Nonprofit Training Workshop Join CFI this September for a half-day workshop with donor relations expert Lynne Wester. Walk away with actionable ideas, smarter strategies, and fresh tools to deepen donor engagement and drive results. Board members and nonprofit staff are welcome — feel free to invite them! Click HERE to read more about the upcoming workshop. 2 events, 9 2 events, 9 10:00 AM - 12:00 PM View Community Category CVS Flu Shot Clinic September 9 @ 10:00 AM - 12:00 PM CVS Flu Shot Clinic Susan McClintock, CVS Sanibel Pharmacist, will be on-site at the Community House offering free flu shots. Attendees must bring their insurance card. No appointment is needed. 11:00 AM - 1:30 PM View Community Category FISH Friendly Faces Luncheon September 9 @ 11:00 AM - 1:30 PM FISH Friendly Faces Luncheon FISH OF SANCAP is inviting friends, neighbors, and visitors to gather for their next Friendly Faces Luncheon on Tuesday, September 9, 2025, at 11:00 a.m. at the Sanibel Community House, 2173 Periwinkle Way. The monthly get-together is open to all ages—whether you live on the islands, work here, or are just visiting. It’s a chance […] 0 events, 10 0 events, 10 0 events, 11 0 events, 11 2 events, 12 2 events, 12 7:30 AM - 9:00 AM Event Series View Cultural Category Rotary Meeting September 12 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting Click here for more information about the Sanibel-Captiva Rotary Club. 1:00 PM - 3:00 PM Event Series View Social Category Sanibel Hearts September 12 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts No reservations required, $5 suggested donation. This fun card game is available to all. Beginners are always welcome! 0 events, 13 0 events, 13 0 events, 14 0 events, 14 1 event, 15 1 event, 15 10:00 AM - 1:00 PM Event Series View Art Category Shellcrafters Class September 15 @ 10:00 AM - 1:00 PM Event Series Shellcrafters Class Observe the original Sanibel Island Artists at work from 10am-1pm. A shell crafting class starts at 10am, the class is free, just pay for supplies to create a beautiful shell flower. Approximate Shell Flower Costs: $3-$5/per flower. Other many beautiful items are available for purchase and priced individually. All sales benefit the operations of the […] 0 events, 16 0 events, 16 0 events, 17 0 events, 17 0 events, 18 0 events, 18 3 events, 19 3 events, 19 7:30 AM - 9:00 AM Event Series View Cultural Category Rotary Meeting September 19 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting Click here for more information about the Sanibel-Captiva Rotary Club. 1:00 PM - 3:00 PM Event Series View Social Category Sanibel Hearts September 19 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts No reservations required, $5 suggested donation. This fun card game is available to all. Beginners are always welcome! 4:30 PM - 6:30 PM View Social Category International Talk Like a Pirate Day Happy Hour September 19 @ 4:30 PM - 6:30 PM International Talk Like a Pirate Day Happy Hour Stop by for International Talk Like a Pirate Day Happy Hour at the House! 🏴‍☠️🧭ﾒ🦜🗺️🍹⚓︎ Join us for live music, specialty drinks, light bites, a craft table, door prizes, and more fun! $5 for non members & free for members!   • Non Members, click here to register. • Members, please call us at 239-472-2155 before registering […] 0 events, 20 0 events, 20 1 event, 21 1 event, 21 6:00 PM - 10:00 PM Private Event September 21 @ 6:00 PM - 10:00 PM Private Event 1 event, 22 1 event, 22 10:00 AM - 1:00 PM Event Series View Art Category Shellcrafters Class September 22 @ 10:00 AM - 1:00 PM Event Series Shellcrafters Class Observe the original Sanibel Island Artists at work from 10am-1pm. A shell crafting class starts at 10am, the class is free, just pay for supplies to create a beautiful shell flower. Approximate Shell Flower Costs: $3-$5/per flower. Other many beautiful items are available for purchase and priced individually. All sales benefit the operations of the […] 0 events, 23 0 events, 23 0 events, 24 0 events, 24 0 events, 25 0 events, 25 2 events, 26 2 events, 26 7:30 AM - 9:00 AM Event Series View Cultural Category Rotary Meeting September 26 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting Click here for more information about the Sanibel-Captiva Rotary Club. 1:00 PM - 3:00 PM Event Series View Social Category Sanibel Hearts September 26 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts No reservations required, $5 suggested donation. This fun card game is available to all. Beginners are always welcome! 0 events, 27 0 events, 27 0 events, 28 0 events, 28 1 event, 29 1 event, 29 10:00 AM - 1:00 PM Event Series View Art Category Shellcrafters Class September 29 @ 10:00 AM - 1:00 PM Event Series Shellcrafters Class Observe the original Sanibel Island Artists at work from 10am-1pm. A shell crafting class starts at 10am, the class is free, just pay for supplies to create a beautiful shell flower. Approximate Shell Flower Costs: $3-$5/per flower. Other many beautiful items are available for purchase and priced individually. All sales benefit the operations of the […] 0 events, 30 0 events, 30 0 events, 1 0 events, 1 0 events, 2 0 events, 2 2 events, 3 2 events, 3 7:30 AM - 9:00 AM Event Series View Cultural Category Rotary Meeting October 3 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting Click here for more information about the Sanibel-Captiva Rotary Club. 1:00 PM - 3:00 PM Event Series View Social Category Sanibel Hearts October 3 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts No reservations required, $5 suggested donation. This fun card game is available to all. Beginners are always welcome! 0 events, 4 0 events, 4 There are no events on this day. There are no events on this day. There are no events on this day. September 3 September 3 @ 11:30 AM - 1:30 PM Chamber Business Lunch & Business Resource Fair There are no events on this day. September 5 September 5 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting September 5 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts There are no events on this day. There are no events on this day. September 8 September 8 @ 10:00 AM - 1:00 PM Event Series Shellcrafters Class September 8 @ 10:00 AM - 2:00 PM CFI Nonprofit Training Workshop September 9 September 9 @ 10:00 AM - 12:00 PM CVS Flu Shot Clinic September 9 @ 11:00 AM - 1:30 PM FISH Friendly Faces Luncheon There are no events on this day. There are no events on this day. September 12 September 12 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting September 12 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts There are no events on this day. There are no events on this day. September 15 September 15 @ 10:00 AM - 1:00 PM Event Series Shellcrafters Class There are no events on this day. There are no events on this day. There are no events on this day. September 19 September 19 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting September 19 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts September 19 @ 4:30 PM - 6:30 PM International Talk Like a Pirate Day Happy Hour There are no events on this day. September 21 September 21 @ 6:00 PM - 10:00 PM Private Event September 22 September 22 @ 10:00 AM - 1:00 PM Event Series Shellcrafters Class There are no events on this day. There are no events on this day. There are no events on this day. September 26 September 26 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting September 26 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts There are no events on this day. There are no events on this day. September 29 September 29 @ 10:00 AM - 1:00 PM Event Series Shellcrafters Class There are no events on this day. There are no events on this day. There are no events on this day. October 3 October 3 @ 7:30 AM - 9:00 AM Event Series Rotary Meeting October 3 @ 1:00 PM - 3:00 PM Event Series Sanibel Hearts There are no events on this day. Aug This Month Oct Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file"
    },
    {
      "url": "https://torontohousing.ca/contact-us",
      "text": "Contact us | Toronto Community Housing Skip to main content Secondary navigation News and stories Events Careers Board and governance Partner with TCHC About Us Search Site search Search Menu Main navigation Current tenants Tenant guide Your tenancy and lease Your home Common areas Transfers and housing changes Your TCHC team Tax information Tenant Charter Tenant policies Services and support Tenant Service Hubs Request repairs, maintenance or pest control Affordable internet and mobile program Energy relief program Employment resources Community services directory Current building posters iHelp Tenant safety Community Safety Unit (CSU) Prepare for an emergency Safety guide Fire safety Identifying scams and fraud Accessibility in TCHC The built environment Accessibility in communications Accessibility in engagement R-PATH Committee Book a space Book a one-time private event Book a community event or program Programs and tenant engagement Tenant engagement Tenant Councils Tenant Advisory Committee Youth Tenant Advisory Committee Tenant Community Action Table (TCAT) Local Initiative Funding for Tenants (LIFT) Tenant Engagement System Review Youth programs Camp Inspire KickStart Midnight Basketball HeadstART Brook Restoration Pre-Apprenticeship program The Next Surgeon Community programs Be.Build.Brand. YouthWorx Community gardens Stop the Bleed True Vision Scholarships Investing in Our Diversity Scholarship Alexandra Park Revitalization Scholarship Don Summerville Scholarship Regent Park Scholarship The Centre for Advancing the Interests of Black People Centre Community Funds Building construction and revitalization Revitalization Alexandra Park Don Summerville Firgrove-Grassways Lawrence Heights Regent Park Swansea Mews Completed Revitalizations Capital repairs 10-year capital plan Deep building retrofits Planned Project Services Community updates Relocation and return Conservation Conservation resources for tenants Transparency Reporting Financial reporting Annual reports Access to information Make a freedom of information request Collection and use of personal information Insurance claims Report fraud Accountability offices Prospective tenants Market rent Affordable rent Subsidized rent (RGI) City resources Contact us Get in touch with us Feedback, compliments and complaints Tenant complaint process Tenant Human Rights Complaints Improving the tenant human rights process Sign up for email and text communications Staff directory Main navigation (Mobile) Current tenants Tenant guide Your tenancy and lease Your home Common areas Transfers and housing changes Your TCHC team Tax information Tenant Charter Tenant policies Services and support Tenant Service Hubs Request repairs, maintenance or pest control Affordable internet and mobile program Energy relief program Employment resources Community services directory Current building posters iHelp Tenant safety Community Safety Unit (CSU) Prepare for an emergency Safety guide Fire safety Identifying scams and fraud Accessibility in TCHC The built environment Accessibility in communications Accessibility in engagement R-PATH Committee Book a space Book a one-time private event Book a community event or program Programs and tenant engagement Tenant engagement Tenant Councils Tenant Council Elections: Nominations process Tenant Advisory Committee Youth Tenant Advisory Committee Tenant Community Action Table (TCAT) Local Initiative Funding for Tenants (LIFT) Tenant Engagement System Review Youth programs Camp Inspire KickStart Midnight Basketball HeadstART Brook Restoration Pre-Apprenticeship program The Next Surgeon Community programs Be.Build.Brand. YouthWorx Community gardens Stop the Bleed True Vision Scholarships Investing in Our Diversity Scholarship Alexandra Park Revitalization Scholarship Don Summerville Scholarship Regent Park Scholarship The Centre for Advancing the Interests of Black People Centre Community Funds Building construction and revitalization Revitalization Alexandra Park Don Summerville Firgrove-Grassways Lawrence Heights Regent Park Swansea Mews Completed Revitalizations Capital repairs 10-year capital plan Deep building retrofits Planned Project Services Community updates Relocation and return Conservation Conservation resources for tenants Transparency Reporting Financial reporting Annual reports Access to information Make a freedom of information request Collection and use of personal information Insurance claims Report fraud Accountability offices Prospective tenants Market rent Affordable rent Subsidized rent (RGI) City resources Contact us Get in touch with us Feedback, compliments and complaints Tenant complaint process Tenant Human Rights Complaints Improving the tenant human rights process Sign up for email and text communications Staff directory Secondary navigation (Mobile) News and stories Events Careers Board and governance Partner with TCHC About Us Contact us There are a variety of ways to contact TCHC. Depending on who you need to reach, you may want to give us a call, fill out a feedback form or contact our solutions team. We look forward to hearing from you. Get in touch with Toronto Community Housing Get in touch with Toronto Community Housing staff and client care by phone, email or online form. Feedback, compliments and complaints Provide your feedback, compliments and complaints through this form. Tenant complaint process Do you have an unresolved concern or a complaint you would like to escalate? Contact the Solutions team. Tenant Human Rights Complaints How to submit a human rights complaint Email and text communications Learn how we use email and text to communicate with tenants, and sign up to receive updates from us. Staff directory Access our staff directory here. Contact us for service, maintenance and other support. Back to top Contact TCHC Client Care Centre (24/7) Phone: 416-981-5500 Email: help@torontohousing.ca Client care request form Community Safety Unit Phone: 416-921-2323 City of Toronto Phone: 311 Email: 311@toronto.ca Website: toronto.ca Access to housing: housingconnections.ca Footer Tenant guide Terms of use & privacy Web accessibility Land acknowledgement Toronto Community Housing Instagram Toronto Community Housing Facebook Toronto Community Housing LinkedIn Toronto Community Housing X © Toronto Community Housing Corporation\n\t\t\t\t2025"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/sanibel-community-house/49938",
      "text": "Sanibel Community House | Visit Fort Myers | SW Florida Skip to main content Footer Top Home Meetings Weddings Travel Trade EN 89° Now 89° Close Islands Beaches All Beaches Alison Hagerup Beach Park Blind Pass Beach Park Boca Grande Beach Accesses Bonita Beach Park Bowditch Point Park Bowman's Beach Park San Carlos Bay - Bunche Beach Preserve Causeway Islands Park Cayo Costa State Park Crescent Beach Family Park Dog Beach Park Gasparilla Island State Park Gulfside City Beach Park Lighthouse Beach Park Little Hickory Island Park Lovers Key State Park Lynn Hall Memorial Park Tarpon Bay Beach Turner Beach Yacht Club Beach Neighborhoods All Neighborhoods Alva, Buckingham & Lehigh Acres Boca Grande & Outer Islands Bonita Springs & Estero Cape Coral Captiva Island Fort Myers Fort Myers Beach Matlacha North Fort Myers Pine Island Sanibel Island Things to Do All Things to Do Plan Your Trip Arts & Entertainment Murals Attractions Outdoor Activities & Sports Parks & Nature Paddling Trail Shopping Tours & Transportation Eat & Drink All Eat & Drink Restaurants Cafes Bars, Lounges & Clubs Breweries & Distilleries Ways to Stay All Ways to Stay Bed & Breakfast Campgrounds Condos Cottages Hotels Motels RV Parks Resorts Vacation Rentals Events All Events Arts & Culture Concerts Education Fairs & Festivals Food & Drink Nature & Outdoors Sports & Recreation Deals All Deals Digital Passes Parks, Points & Perks Sanibel Wild Mile Sun Saver Passport Search May we recommend Live Webcams Things to Do Plan Your Trip Digital Visitor Guide Quick Links Overview Overview Gallery Gallery Amenities Amenities Share Share Visit Website Sanibel Community House The mission of our historical non profit is to enrich community spirit through educational, cultural and social gatherings in our historic Community House.  We also house a new commercial kitchen so offer Culinary Education for both children and Adults as well as space for your favorite caterer. The Community House also provides rental space for over 800 people, but the facility can also be separated into... Load More The mission of our historical non profit is to enrich community spirit through educational, cultural and social gatherings in our historic Community House.  We also house a new commercial kitchen so offer Culinary Education for both children and Adults as well as space for your favorite caterer. The Community House also provides rental space for over 800 people, but the facility can also be separated into smaller areas.  Located on the main street of Periwinkle, adjacent to the community park. We offer many events and classes while also providing rental facilities for weddings, reunions, workshops and more!  Public wi-fi, and all the new tech wonders are here. Load Less 26.437243, -82.072435 (239) 472-2155 2173 Periwinkle Way Sanibel Island , FL 33957 United States info@sanibelcommunityhouse.net View Website Key Features Things to Do Arts & Entertainment Arts and Crafts Cultural Center Art Museum Performing Arts Center Attractions Historic Sites Family Fun Cultural Center Historic Attraction Shopping Gifts Where to Eat Restaurants Meeting Facilities & Services Meeting Facilities Weddings Wedding Venues Wedding Vendors Wedding Services Gallery Amenities Activities Social Programs 26.437243, -82.072435 (239) 472-2155 2173 Periwinkle Way Sanibel Island , FL 33957 United States info@sanibelcommunityhouse.net View Website Key Features Things to Do Arts & Entertainment Arts and Crafts Cultural Center Art Museum Performing Arts Center Attractions Historic Sites Family Fun Cultural Center Historic Attraction Shopping Gifts Where to Eat Restaurants Meeting Facilities & Services Meeting Facilities Weddings Wedding Venues Wedding Vendors Wedding Services What's Nearby Pinocchio's Ice Cream at Periwinkle Place Pinocchio's Ice Cream is a Sanibel tradition since 1980. With a recent return to the island at a new location in the... Sanibel Island Beach Resort We’re back and better than ever! We are thrilled to announce the re-opening of Sanibel Island Beach Resort as part of... Captain Bubby's IsLAND Tours Captain Bubby's IsLAND Tours was created to fill the gap between touring individually and a fully escorted tour. We are... Footer Top Home Meetings Weddings Travel Trade Contact Local: (239) 338-3500 Toll-Free: (800) 237-6444 2201 Second Street Suite 600 Fort Myers, Florida 33901 Footer Menu 2 For Visitors Plan Your Trip Digital Visitor Guide Beach Conditions Footer Menu 3 For Businesses About VCB ADA Notice Film Permit Requests Industry Portal Login Newsletter Sign Up Sign up for our enewsletter to receive information on the greater Fort Myers area. Footer Bottom Menu Cookie Preferences Privacy Policy Tourism Accessibility Guide © 2025 Lee County Visitor & Convention Bureau"
    }
  ]
}