{
  "fuentes": [
    {
      "url": "https://www.ftmyersmagazine.com/editorial-sanibelmusicfestival2022",
      "email": "e@icloud.com"
    },
    {
      "url": "https://www.ftmyersmagazine.com/editorial-sanibelmusicfestival2022",
      "email": "ftmyersmagazine@icloud.com"
    },
    {
      "url": "https://members.sanibel-captiva.org/bank-of-the-islands-sponsors-sanibel-music-festival/",
      "email": "09_september-is-basic-literacy-education-month-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/bank-of-the-islands-sponsors-sanibel-music-festival/",
      "email": "bailey-matthews-national-shell-museum-aquarium-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/bank-of-the-islands-sponsors-sanibel-music-festival/",
      "email": "fair-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/bank-of-the-islands-sponsors-sanibel-music-festival/",
      "email": "wayne-kliewer-pretty-in-pick-1-scaled-500x383@2x.jpg"
    },
    {
      "url": "https://members.sanibel-captiva.org/bank-of-the-islands-sponsors-sanibel-music-festival/",
      "email": "jog-pic-500x383@2x.jpg"
    },
    {
      "url": "https://sanibelmusicfestival.org/product/emerson-string-quartet-2/",
      "email": "info@sanibelmusicfestival.org"
    },
    {
      "url": "https://sanibelmusicfestival.org/wp-content/uploads/2020/03/Boston-Chamber-Music-Society-Program-Notes.pdf",
      "email": "info@sanibelmusicfestival.org"
    },
    {
      "url": "https://sanibelmusicfestival.org/2025-performances/",
      "email": "info@sanibelmusicfestival.org"
    },
    {
      "url": "https://sanibelmusicfestival.org/?attachment_id=39696",
      "email": "info@sanibelmusicfestival.org"
    },
    {
      "url": "https://www.aspenmusicfestival.com/about/staff",
      "email": "info@aspenmusic.org"
    },
    {
      "url": "https://www.aspenmusicfestival.com/about/staff",
      "email": "studentservices@aspenmusic.org"
    },
    {
      "url": "https://www.aspenmusicfestival.com/about/staff",
      "email": "tickets@aspenmusic.org"
    },
    {
      "url": "https://sanibelmusicfestival.org/wp-content/uploads/2017/12/SMF-2018_TICKET_ORDER_FORM_Part1.pdf",
      "email": "info@sanibelmusicfestival.org"
    },
    {
      "url": "https://sanibelmusicfestival.org",
      "email": "info@sanibelmusicfestival.org"
    },
    {
      "url": "https://www.mssf.org.uk/about-us/",
      "email": "info@mssf.org.uk"
    },
    {
      "url": "https://coloradomusicfestival.org/about-the-festival/staff/",
      "email": "boxoffice@chautauqua.com"
    },
    {
      "url": "https://coloradomusicfestival.org/about-the-festival/staff/",
      "email": "colorado_music_festival@2x-scaled.jpg"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    }
  ],
  "mails": [
    "09_september-is-basic-literacy-education-month-500x383@2x.jpg",
    "anirudh.shetye@skanem.com",
    "bailey-matthews-national-shell-museum-aquarium-scaled-500x383@2x.jpg",
    "beatrice.malle@skanem.com",
    "boxoffice@chautauqua.com",
    "colorado_music_festival@2x-scaled.jpg",
    "e@icloud.com",
    "fair-scaled-500x383@2x.jpg",
    "ftmyersmagazine@icloud.com",
    "info.nairobi@skanem.com",
    "info@aspenmusic.org",
    "info@mssf.org.uk",
    "info@sanibelmusicfestival.org",
    "jane@skanem.ke",
    "jog-pic-500x383@2x.jpg",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "studentservices@aspenmusic.org",
    "tickets@aspenmusic.org",
    "wayne-kliewer-pretty-in-pick-1-scaled-500x383@2x.jpg"
  ],
  "nombre_sitio": "sanibelmusicfestival.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ftmyersmagazine.com/editorial-sanibelmusicfestival2022",
      "text": "Ft.Myers magazine - Sanibel Music Festival 2022 top of page HOME — ABOUT US — CIRCULATION & DISTRIBUTION — AD SPECS & PRODUCTION DEADLINES CURRENT ISSUE — CALENDAR — NEWS — COVERS — EDITORIAL ARCHIVES — EDITORIAL ART GALLERY ART GALLERY GUIDE — ATTRACTIONS GUIDE — COLLEGE & UNIVERSITY GUIDE — MUSIC & THEATER SEASON GUIDE 35th Sanibel Music Festival 2022 All concerts at Sanibel Congregational United Church of Christ, 2050 Periwinkle Way. All concerts begin at 7:30pm. For information, call 344-7025. Saturday MARCH 5 Jon Nakamatsu Jon Nakamatsu, American Pianist and Gold Medalist at the 10th Van Cliburn International Piano Competition. Since winning the Cliburn Gold Medal in 1997, Mr. Nakamatsu has toured year-round with leading conductors and orchestras and in recitals and chamber music world-wide. His recording of Gershwin’s ‘Concerto in F’ and ‘Rhapsody in Blue’ topped Billboard’s charts for six months. He serves as Artistic Director of the Cape Cod Chamber Music Festival and is now Artist-in-Residence of the Chautauqua Piano Program. Program: Chopin, Schubert Tuesday MARCH 8 American Chamber Players Piano Trio plus Flute American Chamber Players’ Founder & Artistic Director, longtime NPR music commentator Miles Hoffman, has created a program with a delightful mix of instrumental combinations. Cellist Stephen Balderston is a former Assistant Principal Cello of the Chicago Symphony., Joanna Maurer is an Associate 1st Violinist of the Metropolitan Opera Orchestra.Pianist Anna Stoytcheva won the prestigious Ettore Pozzoli International Piano Competition at age 17. Sara Stern is solo flutist of the 21st Century Consort at the Smithsonian Institution. Program: Gaubert, Ibert, Schubert, Bach, Brahms Saturday MARCH 12 The Boston Trio Pianist Heng-Jin Park, who made her solo debut with the Boston Pops at age 15, is the Trio’s Founding Member and Artistic Director of Halcyon Music Festival. Cellist Jonah Ellsworth has performed as soloist with the Boston Symphony and Boston Philharmonic, among others. Violinist Grace Park is winner of the 2018 Naumberg International Violin competition and is a member of the Lincoln Center Chamber Music Society. Program: Beethoven, Faure, Haydn, Brahms Tuesday MARCH 15 Members of the Julliard String Quartet with Anna Polonsky, piano Guest pianist Anna Polonsky joins the Juilliard following the January death of their distinguished violist, Roger Topping. Founded in 1946 and hailed by The Boston Globe as “the most important American quartet in history,” the ensemble performs in Sanibel as part of a world tour honoring its 75th anniversary. The quartet is in residence at Juilliard, and its members are sought-after teachers in the String and Chamber music faculties. During the summer, they work with students at the Tanglewood Music Center. Program: Mozart, Penderecki, Brahms Saturday MARCH 19 Ken Broberg American Pianist Ken Broberg is the Silver Medalist at the 15th Van Cliburn International Piano Competition in 2017, followed by a bronze medal at the 2019 International Tchaikovsky Competition. Mr. Broberg’s most recent honor was winning first prize in the 2021 American Pianists Awards. Program: Medtner, Faure, Schumann Tuesday MARCH 22 Opera Theater of Connecticut Singing Andrew Lloyd Webber ‘Singing Andrew Lloyd Webber: Superstar of Song and Stage,’ features the music of Jesus Christ Superstar, ‘‘Cats,’ ‘Evita,’ and ‘Phantom of the Opera.’ Webber’s honors include a knighthood, seven Tony Awards, three Grammy awards and an Oscar. Alan Mann, noted speaker and opera historian, hosts the concert with humorous and informed narratives. Saturday MARCH 26 Emerson String Quartet The Emerson’s list of achievements spans more than four decades, more than 30 acclaimed recordings, nine Grammys (including two for the Best Classical Album), three Gramophone Awards, the Avery Fisher Prize, and Musical America’s ‘Ensemble of the Year.’ They were inducted into the Classical Music Hall of Fame in 2010. In 2015, the Emerson received The Richard J. Bogomolny National Service Award, the highest award in classical chamber music. Program: Beethoven, Schubert Tuesdays MARCH 26 & April 5 Emerging Artists Series Florida Gulf Coast University Bower School of Music String Ensembles Under the direction of Dr. Kyle Szabo, head of strings studies and Orchestra Director at FGCU. Emerging Artist Series concerts are free, donations encouraged. March/April 2022 ftmyersmagazin e@icloud.com 516-652-6072 ©2025 by Ft.Myers magazine bottom of page"
    },
    {
      "url": "https://members.sanibel-captiva.org/bank-of-the-islands-sponsors-sanibel-music-festival/",
      "text": "Bank of the Islands Sponsors Sanibel Music Festival - Sanibel-Captiva Chamber of Commerce Members Skip to content Business Search Calendar of Events Lodging Vacancies Search for: Chambers Healthcare Home Our Chamber About Us Staff Board of Directors Annual Report Job Opportunities News Contact Membership Member Testimonials Member Benefits Marketing Opportunities Directory Join the Chamber Member Login Advocacy John Lai On Deck CAPTAINS FOR CLEAN WATER Legislative Priorities Programs & Events Sanibel 50th Anniversary Previous Next Bank of the Islands Sponsors Sanibel Music Festival Bank of the Islands is proud to support the Sanibel Music Festival as its returning Website Sponsor. The Bank recently made a $1,500 donation in support of the Festival’s online portal for performance details and ticket sales. The Bank’s Sanibel office is also providing in-person ticket sales. Celebrating its 37th anniversary of producing this volunteer-driven annual event, the Festival presents live musical performances of the highest standard at affordable prices, often promoting the careers of emerging artists. “The Sanibel Music Festival is such an important part of our islands’ cultural landscape,” said Richard Shera, Bank of the Islands Vice President, Sanibel-Captiva Office Manager, and Loan Specialist.  “As the Festival’s Website Sponsor, we hope to encourage robust ticket sales and sold-out performances. It’s a great way to show how much we appreciate being your island bank!” All islanders and visitors are encouraged to visit www.sanibelmusicfestival.org to purchase tickets. The 2024 Festival will include six concerts from March 5-23 featuring classical and chamber music, as well as vocal performances. Ticket prices are set at $50 for adults and $25 for students, and discounted packages for multiple performances are also available. Due to ongoing hurricane recovery at its traditional Sanibel venue, this year’s Festival performances will take place at Peace Lutheran Church, 15840 McGregor Blvd, in Fort Myers. Bank of the Islands is located at 1699 Periwinkle Way, at the corner of Casa Ybel Road, on Sanibel. The Captiva office is at 14812 Captiva Drive, next to the Captiva Post Office. As the oldest locally owned and managed community bank on Sanibel and Captiva, Bank of the Islands is proud to be the winner of more than 50 “Best of the Islands” awards over two decades. Jade Nakonetschny 2024-02-19T08:13:37-05:00 February 19th, 2024 | Uncategorized | Share This Story, Choose Your Platform! Facebook X Reddit LinkedIn WhatsApp Tumblr Pinterest Vk Email Related Posts JOIN THE CHAMBER Business Name: * Email: * Primary Contact: * Physical Address: * Full-Time Employees: * JOIN THE CHAMBER This field should be left blank 1159 Causeway Road Sanibel Island, FL 33957 239-472-1080 Contact Us Chamber Business Member Login Sanibel & Captiva Island Quick Links Daily Vacancy » Hot Deals » Resorts & Hotels » Inns & Cottages » Vacation Condos » Vacation Homes » Jobs » Press Room » Chamber Info » Business Search » Recent News From The Chamber Sign Up for our Monthly Newsletter Submit Checkout Island Happenings » Today’s Lodging Vacancies » Search Our Site Search for: Translate this Page Photo Credit: Lee County Visitor & Convention Bureau. © Copyright 2019-2025 Sanibel & Captiva Islands Chamber of Commerce | All Rights Reserved Worldwide. Privacy & Legal Notice Page load link Go to Top"
    },
    {
      "url": "https://sanibelmusicfestival.org/product/emerson-string-quartet-2/",
      "text": "Home - Sanibel Music Festival Home 2026 Performances Donations About Us Contact FAQ Photo Retrospective My Account Cart Checkout Select Page Tickets are not yet available for purchase. Please click here to be alerted when tickets are available. February 21 : Violins On The Veranda, a virtuosic evening with wine and hors d’oeuvres March 3 : Cliburn International Piano Competition Gold Medalist Aristo Sham of Hong Kong March 7 : Calidore String Quartet, Jeffrey Myers, Violin; Ryan Meehan, Violin; Jeremy Berry, Viola; Estelle Choi, Cello March 10 : Viano String Quartet, Tate Zawadiuk, Cello; Aiden Kane, Viola; Lucy Wang, Violin; Hao Zhou, Violin March 14 : Boston Trio, Pianist Heng-Jin Park, Cellist Jonah Ellsworth, Violinist Irina Muresanu March 21 : Opera Theater of Connecticut \u0003Music and Songs of Andrew Lloyd Webber March 24 : Anna Polonsky, Piano; David Shifrin, Clarinet; Peter Wiley, Cello Spring/Summer 2025 Dear Chamber Music Lovers: As the start of Sanibel Music Festival’s 39th season in 2026 approaches, we want to extoll our exciting offerings! The Holiday Luminary concert at our venue of Sanibel Congregational Church, on December 5th, 2025, will mark the beginning of the island’s holiday celebration and the commencement of our musical season. Sanibel Music Festival believes in the transformative power of world-class chamber music and is pleased to present, on March 3rd, 2026, as our opening concert, Aristo Sham, the Gold Medalist Winner of the Cliburn International Piano Competition. Continuing our tempo and crescendo through the month of March, we will welcome Calidore String Quartet on March 7th. Rhapsodized by the New York Times, they are “deep reserves of virtuosity and irrepressible dramatic instinct.” A reprise in 2026 by the Viano String Quartet, who we welcomed in 2023 to rave reviews, will delight us on Tuesday, March 10th. Boston Trio follows on March 14th extolled by the Palm Beach Daily News as “… an energetic program characterized by passion and youthful enthusiasm.” Continuing with the rhythm and momentum of our dynamic March, Opera Theater of Connecticut will showcase the Music and Songs of Andrew Lloyd Webber. As a grand finale to the season, we greatly anticipate the Polonsky-Shifrin-Wiley Trio. The piano, cello, and clarinet trio was formed in 2019 as a collaboration of three distinguished and established artists. Make an impact by assisting in SMF’s continued mission to enrich and stay “in tune with” the cultural life of Sanibel Island! We continue to expand our community outreach efforts. In addition to supporting emerging artists and initiating collaborative projects with community businesses and non-profits, we strive to make our high-quality concerts accessible to all. Sanibel Music Festival is a 501 c3 organization, which allows your contribution to be considered tax-deductible. Please consult with your tax advisor for the best advice. Stay tuned to our website for ticket information as well as money-saving ticket packages for our 2026 season! Online ticket purchases will generate a scan code and an email confirmation, both of which can be used not only to expedite your entry into the concert venue but also will serve as an ecologically friendly way to present your tickets in the true Sanibel spirit! “Chordially yours” Deborah Larson and Shirley Witte Co-Presidents Sanibel Music Festival PO Box 1623 Sanibel, FL 33957 239-344-7025 2026 CONCERT VENUE UCC Sanibel Congregational Church 2050 Periwinkle Way, Sanibel, FL 33957 NEW! CLICK HERE FOR Donor Information E-mail: [email protected] www.SanibelMusicFestival.org MISSION STATEMENT The mission of the Festival is to present classical music of the highest standard and to promote the careers of emerging artists through performance opportunities at affordable prices. SANIBEL MUSIC FESTIVAL FACTS The Sanibel Music Festival was founded in the 1980’s by Marilyn Lauriente, musician and impresario. The Festival has presented such wonderful artists as: The Emerson String Quartet, Olga Kern, Opera Theater of Connecticut, David Finckel, Wu Han, The Juilliard String Quartet, Orion Weiss, Joyce Yang, Jon Nakamatsu, Ruth Laredo, the American String Quartet, the Pacifica Quartet, and the Prazak Quartet. The Festival presents a concert series each season, featuring chamber music, piano, and vocal ensemble, as well as outreach and education programs. HOSTING OPPORTUNITIES FOR 2026 The privilege of hosting an artist in your home is a wonderful opportunity to be “up close and personal” with world-famous artists. This also affords the host some special perks at the accompanying concert. Contact Deborah Larson for details and to choose your dates and artists for hosting. Call or Text: 703-966-9474 . Email: [email protected] “A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE. 1-800-HELP-FLA (435-7352) OR www.FloridaConsumerHelp.com . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.” FLORIDA REGISTRATION CH2935 About Us Contact FAQ Media Photo Retrospective Website Design by Total Concept, Inc. Copyright © 2025 Sanibel Music Festival"
    },
    {
      "url": "https://sanibelmusicfestival.org/wp-content/uploads/2020/03/Boston-Chamber-Music-Society-Program-Notes.pdf",
      "text": "Home - Sanibel Music Festival Home 2026 Performances Donations About Us Contact FAQ Photo Retrospective My Account Cart Checkout Select Page Tickets are not yet available for purchase. Please click here to be alerted when tickets are available. February 21 : Violins On The Veranda, a virtuosic evening with wine and hors d’oeuvres March 3 : Cliburn International Piano Competition Gold Medalist Aristo Sham of Hong Kong March 7 : Calidore String Quartet, Jeffrey Myers, Violin; Ryan Meehan, Violin; Jeremy Berry, Viola; Estelle Choi, Cello March 10 : Viano String Quartet, Tate Zawadiuk, Cello; Aiden Kane, Viola; Lucy Wang, Violin; Hao Zhou, Violin March 14 : Boston Trio, Pianist Heng-Jin Park, Cellist Jonah Ellsworth, Violinist Irina Muresanu March 21 : Opera Theater of Connecticut \u0003Music and Songs of Andrew Lloyd Webber March 24 : Anna Polonsky, Piano; David Shifrin, Clarinet; Peter Wiley, Cello Spring/Summer 2025 Dear Chamber Music Lovers: As the start of Sanibel Music Festival’s 39th season in 2026 approaches, we want to extoll our exciting offerings! The Holiday Luminary concert at our venue of Sanibel Congregational Church, on December 5th, 2025, will mark the beginning of the island’s holiday celebration and the commencement of our musical season. Sanibel Music Festival believes in the transformative power of world-class chamber music and is pleased to present, on March 3rd, 2026, as our opening concert, Aristo Sham, the Gold Medalist Winner of the Cliburn International Piano Competition. Continuing our tempo and crescendo through the month of March, we will welcome Calidore String Quartet on March 7th. Rhapsodized by the New York Times, they are “deep reserves of virtuosity and irrepressible dramatic instinct.” A reprise in 2026 by the Viano String Quartet, who we welcomed in 2023 to rave reviews, will delight us on Tuesday, March 10th. Boston Trio follows on March 14th extolled by the Palm Beach Daily News as “… an energetic program characterized by passion and youthful enthusiasm.” Continuing with the rhythm and momentum of our dynamic March, Opera Theater of Connecticut will showcase the Music and Songs of Andrew Lloyd Webber. As a grand finale to the season, we greatly anticipate the Polonsky-Shifrin-Wiley Trio. The piano, cello, and clarinet trio was formed in 2019 as a collaboration of three distinguished and established artists. Make an impact by assisting in SMF’s continued mission to enrich and stay “in tune with” the cultural life of Sanibel Island! We continue to expand our community outreach efforts. In addition to supporting emerging artists and initiating collaborative projects with community businesses and non-profits, we strive to make our high-quality concerts accessible to all. Sanibel Music Festival is a 501 c3 organization, which allows your contribution to be considered tax-deductible. Please consult with your tax advisor for the best advice. Stay tuned to our website for ticket information as well as money-saving ticket packages for our 2026 season! Online ticket purchases will generate a scan code and an email confirmation, both of which can be used not only to expedite your entry into the concert venue but also will serve as an ecologically friendly way to present your tickets in the true Sanibel spirit! “Chordially yours” Deborah Larson and Shirley Witte Co-Presidents Sanibel Music Festival PO Box 1623 Sanibel, FL 33957 239-344-7025 2026 CONCERT VENUE UCC Sanibel Congregational Church 2050 Periwinkle Way, Sanibel, FL 33957 NEW! CLICK HERE FOR Donor Information E-mail: [email protected] www.SanibelMusicFestival.org MISSION STATEMENT The mission of the Festival is to present classical music of the highest standard and to promote the careers of emerging artists through performance opportunities at affordable prices. SANIBEL MUSIC FESTIVAL FACTS The Sanibel Music Festival was founded in the 1980’s by Marilyn Lauriente, musician and impresario. The Festival has presented such wonderful artists as: The Emerson String Quartet, Olga Kern, Opera Theater of Connecticut, David Finckel, Wu Han, The Juilliard String Quartet, Orion Weiss, Joyce Yang, Jon Nakamatsu, Ruth Laredo, the American String Quartet, the Pacifica Quartet, and the Prazak Quartet. The Festival presents a concert series each season, featuring chamber music, piano, and vocal ensemble, as well as outreach and education programs. HOSTING OPPORTUNITIES FOR 2026 The privilege of hosting an artist in your home is a wonderful opportunity to be “up close and personal” with world-famous artists. This also affords the host some special perks at the accompanying concert. Contact Deborah Larson for details and to choose your dates and artists for hosting. Call or Text: 703-966-9474 . Email: [email protected] “A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE. 1-800-HELP-FLA (435-7352) OR www.FloridaConsumerHelp.com . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.” FLORIDA REGISTRATION CH2935 About Us Contact FAQ Media Photo Retrospective Website Design by Total Concept, Inc. Copyright © 2025 Sanibel Music Festival"
    },
    {
      "url": "https://sanibelmusicfestival.org/2025-performances/",
      "text": "Home - Sanibel Music Festival Home 2026 Performances Donations About Us Contact FAQ Photo Retrospective My Account Cart Checkout Select Page Tickets are not yet available for purchase. Please click here to be alerted when tickets are available. February 21 : Violins On The Veranda, a virtuosic evening with wine and hors d’oeuvres March 3 : Cliburn International Piano Competition Gold Medalist Aristo Sham of Hong Kong March 7 : Calidore String Quartet, Jeffrey Myers, Violin; Ryan Meehan, Violin; Jeremy Berry, Viola; Estelle Choi, Cello March 10 : Viano String Quartet, Tate Zawadiuk, Cello; Aiden Kane, Viola; Lucy Wang, Violin; Hao Zhou, Violin March 14 : Boston Trio, Pianist Heng-Jin Park, Cellist Jonah Ellsworth, Violinist Irina Muresanu March 21 : Opera Theater of Connecticut \u0003Music and Songs of Andrew Lloyd Webber March 24 : Anna Polonsky, Piano; David Shifrin, Clarinet; Peter Wiley, Cello Spring/Summer 2025 Dear Chamber Music Lovers: As the start of Sanibel Music Festival’s 39th season in 2026 approaches, we want to extoll our exciting offerings! The Holiday Luminary concert at our venue of Sanibel Congregational Church, on December 5th, 2025, will mark the beginning of the island’s holiday celebration and the commencement of our musical season. Sanibel Music Festival believes in the transformative power of world-class chamber music and is pleased to present, on March 3rd, 2026, as our opening concert, Aristo Sham, the Gold Medalist Winner of the Cliburn International Piano Competition. Continuing our tempo and crescendo through the month of March, we will welcome Calidore String Quartet on March 7th. Rhapsodized by the New York Times, they are “deep reserves of virtuosity and irrepressible dramatic instinct.” A reprise in 2026 by the Viano String Quartet, who we welcomed in 2023 to rave reviews, will delight us on Tuesday, March 10th. Boston Trio follows on March 14th extolled by the Palm Beach Daily News as “… an energetic program characterized by passion and youthful enthusiasm.” Continuing with the rhythm and momentum of our dynamic March, Opera Theater of Connecticut will showcase the Music and Songs of Andrew Lloyd Webber. As a grand finale to the season, we greatly anticipate the Polonsky-Shifrin-Wiley Trio. The piano, cello, and clarinet trio was formed in 2019 as a collaboration of three distinguished and established artists. Make an impact by assisting in SMF’s continued mission to enrich and stay “in tune with” the cultural life of Sanibel Island! We continue to expand our community outreach efforts. In addition to supporting emerging artists and initiating collaborative projects with community businesses and non-profits, we strive to make our high-quality concerts accessible to all. Sanibel Music Festival is a 501 c3 organization, which allows your contribution to be considered tax-deductible. Please consult with your tax advisor for the best advice. Stay tuned to our website for ticket information as well as money-saving ticket packages for our 2026 season! Online ticket purchases will generate a scan code and an email confirmation, both of which can be used not only to expedite your entry into the concert venue but also will serve as an ecologically friendly way to present your tickets in the true Sanibel spirit! “Chordially yours” Deborah Larson and Shirley Witte Co-Presidents Sanibel Music Festival PO Box 1623 Sanibel, FL 33957 239-344-7025 2026 CONCERT VENUE UCC Sanibel Congregational Church 2050 Periwinkle Way, Sanibel, FL 33957 NEW! CLICK HERE FOR Donor Information E-mail: [email protected] www.SanibelMusicFestival.org MISSION STATEMENT The mission of the Festival is to present classical music of the highest standard and to promote the careers of emerging artists through performance opportunities at affordable prices. SANIBEL MUSIC FESTIVAL FACTS The Sanibel Music Festival was founded in the 1980’s by Marilyn Lauriente, musician and impresario. The Festival has presented such wonderful artists as: The Emerson String Quartet, Olga Kern, Opera Theater of Connecticut, David Finckel, Wu Han, The Juilliard String Quartet, Orion Weiss, Joyce Yang, Jon Nakamatsu, Ruth Laredo, the American String Quartet, the Pacifica Quartet, and the Prazak Quartet. The Festival presents a concert series each season, featuring chamber music, piano, and vocal ensemble, as well as outreach and education programs. HOSTING OPPORTUNITIES FOR 2026 The privilege of hosting an artist in your home is a wonderful opportunity to be “up close and personal” with world-famous artists. This also affords the host some special perks at the accompanying concert. Contact Deborah Larson for details and to choose your dates and artists for hosting. Call or Text: 703-966-9474 . Email: [email protected] “A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE. 1-800-HELP-FLA (435-7352) OR www.FloridaConsumerHelp.com . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.” FLORIDA REGISTRATION CH2935 About Us Contact FAQ Media Photo Retrospective Website Design by Total Concept, Inc. Copyright © 2025 Sanibel Music Festival"
    },
    {
      "url": "https://sanibelmusicfestival.org/?attachment_id=39696",
      "text": "Home - Sanibel Music Festival Home 2026 Performances Donations About Us Contact FAQ Photo Retrospective My Account Cart Checkout Select Page Tickets are not yet available for purchase. Please click here to be alerted when tickets are available. February 21 : Violins On The Veranda, a virtuosic evening with wine and hors d’oeuvres March 3 : Cliburn International Piano Competition Gold Medalist Aristo Sham of Hong Kong March 7 : Calidore String Quartet, Jeffrey Myers, Violin; Ryan Meehan, Violin; Jeremy Berry, Viola; Estelle Choi, Cello March 10 : Viano String Quartet, Tate Zawadiuk, Cello; Aiden Kane, Viola; Lucy Wang, Violin; Hao Zhou, Violin March 14 : Boston Trio, Pianist Heng-Jin Park, Cellist Jonah Ellsworth, Violinist Irina Muresanu March 21 : Opera Theater of Connecticut \u0003Music and Songs of Andrew Lloyd Webber March 24 : Anna Polonsky, Piano; David Shifrin, Clarinet; Peter Wiley, Cello Spring/Summer 2025 Dear Chamber Music Lovers: As the start of Sanibel Music Festival’s 39th season in 2026 approaches, we want to extoll our exciting offerings! The Holiday Luminary concert at our venue of Sanibel Congregational Church, on December 5th, 2025, will mark the beginning of the island’s holiday celebration and the commencement of our musical season. Sanibel Music Festival believes in the transformative power of world-class chamber music and is pleased to present, on March 3rd, 2026, as our opening concert, Aristo Sham, the Gold Medalist Winner of the Cliburn International Piano Competition. Continuing our tempo and crescendo through the month of March, we will welcome Calidore String Quartet on March 7th. Rhapsodized by the New York Times, they are “deep reserves of virtuosity and irrepressible dramatic instinct.” A reprise in 2026 by the Viano String Quartet, who we welcomed in 2023 to rave reviews, will delight us on Tuesday, March 10th. Boston Trio follows on March 14th extolled by the Palm Beach Daily News as “… an energetic program characterized by passion and youthful enthusiasm.” Continuing with the rhythm and momentum of our dynamic March, Opera Theater of Connecticut will showcase the Music and Songs of Andrew Lloyd Webber. As a grand finale to the season, we greatly anticipate the Polonsky-Shifrin-Wiley Trio. The piano, cello, and clarinet trio was formed in 2019 as a collaboration of three distinguished and established artists. Make an impact by assisting in SMF’s continued mission to enrich and stay “in tune with” the cultural life of Sanibel Island! We continue to expand our community outreach efforts. In addition to supporting emerging artists and initiating collaborative projects with community businesses and non-profits, we strive to make our high-quality concerts accessible to all. Sanibel Music Festival is a 501 c3 organization, which allows your contribution to be considered tax-deductible. Please consult with your tax advisor for the best advice. Stay tuned to our website for ticket information as well as money-saving ticket packages for our 2026 season! Online ticket purchases will generate a scan code and an email confirmation, both of which can be used not only to expedite your entry into the concert venue but also will serve as an ecologically friendly way to present your tickets in the true Sanibel spirit! “Chordially yours” Deborah Larson and Shirley Witte Co-Presidents Sanibel Music Festival PO Box 1623 Sanibel, FL 33957 239-344-7025 2026 CONCERT VENUE UCC Sanibel Congregational Church 2050 Periwinkle Way, Sanibel, FL 33957 NEW! CLICK HERE FOR Donor Information E-mail: [email protected] www.SanibelMusicFestival.org MISSION STATEMENT The mission of the Festival is to present classical music of the highest standard and to promote the careers of emerging artists through performance opportunities at affordable prices. SANIBEL MUSIC FESTIVAL FACTS The Sanibel Music Festival was founded in the 1980’s by Marilyn Lauriente, musician and impresario. The Festival has presented such wonderful artists as: The Emerson String Quartet, Olga Kern, Opera Theater of Connecticut, David Finckel, Wu Han, The Juilliard String Quartet, Orion Weiss, Joyce Yang, Jon Nakamatsu, Ruth Laredo, the American String Quartet, the Pacifica Quartet, and the Prazak Quartet. The Festival presents a concert series each season, featuring chamber music, piano, and vocal ensemble, as well as outreach and education programs. HOSTING OPPORTUNITIES FOR 2026 The privilege of hosting an artist in your home is a wonderful opportunity to be “up close and personal” with world-famous artists. This also affords the host some special perks at the accompanying concert. Contact Deborah Larson for details and to choose your dates and artists for hosting. Call or Text: 703-966-9474 . Email: [email protected] “A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE. 1-800-HELP-FLA (435-7352) OR www.FloridaConsumerHelp.com . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.” FLORIDA REGISTRATION CH2935 About Us Contact FAQ Media Photo Retrospective Website Design by Total Concept, Inc. Copyright © 2025 Sanibel Music Festival"
    },
    {
      "url": "https://www.aspenmusicfestival.com/about/staff",
      "text": "Staff | Aspen Music Festival And School Donate Buy Merchandise Buy Tickets PDF Calendar events school support about community Calendar Tickets/Box Office 2025 Program Book Plan Your Visit Virtual Stage 2025 Livestreams About the School Admissions Programs of Study Student Handbook Faculty Portal Alumni Hub Artist-Faculty Make a Contribution Brand Partnerships Planned Giving Government and Foundation Support Rent or Provide Housing Volunteer Advertising Opportunities About the AMFS Culture, Excellence, Access Board and National Council Staff Employment Read and Listen Convocation Press Area Code of Conduct Programs for Local Youth School Year Programs Hire a Musician cancel events Calendar Tickets/Box Office 2025 Program Book Plan Your Visit Virtual Stage 2025 Livestreams school About the School Admissions Programs of Study Student Handbook Faculty Portal Alumni Hub Artist-Faculty support Make a Contribution Brand Partnerships Planned Giving Government and Foundation Support Rent or Provide Housing Volunteer Advertising Opportunities about About the AMFS Culture, Excellence, Access Board and National Council Staff Employment Read and Listen Convocation Press Area Code of Conduct community Programs for Local Youth School Year Programs Hire a Musician 09 cancel Calendar Tickets/Box Office 2025 Program Book Plan Your Visit Virtual Stage 2025 Livestreams About the School Admissions Programs of Study Student Handbook Faculty Portal Alumni Hub Artist-Faculty Make a Contribution Brand Partnerships Planned Giving Government and Foundation Support Rent or Provide Housing Volunteer Advertising Opportunities About the AMFS Culture, Excellence, Access Board and National Council Staff Employment Read and Listen Convocation Press Area Code of Conduct Programs for Local Youth School Year Programs Hire a Musician 02 01 About the AMFS 03 02 01 Culture, Excellence, Access 03 02 01 Board and National Council 03 02 01 Festival Leadership 03 02 01 Board of Trustees 03 02 01 National Council 03 02 01 Corporation 03 02 01 Trustee Secure Area 03 02 01 2025-26 AMFS Board of Trustees 03 02 01 Board Committees 03 02 01 Key Contacts 03 02 01 Board Meeting Packets 03 02 01 Strategic Plan 03 02 01 Music Associates of Aspen Bylaws 03 02 01 Conflict of Interest Policy 03 02 01 Disclosure and Compliance Form (please sign) 03 02 01 Financial Documents 03 02 01 Staff 03 02 01 Employment 03 02 01 Publications 03 02 01 Deep Focus: Enriching the Aspen Experience 03 02 01 Festival Focus 03 02 01 2025 03 02 01 2024 03 02 01 2023-2015 03 02 01 Podcast - High Notes 03 02 01 AMFS on Spotify 03 02 01 Annual Report 03 02 01 Student Spotlight 03 02 01 Season Calendar Request Form 03 02 01 Convocation 03 02 01 Press Area 03 02 01 Press Releases 03 02 01 News Room 03 02 01 AMFS Code of Conduct 03 Staff General Inquiries Name / Title Email Address Phone Number Administration .(JavaScript must be enabled to view this email address) 970 925 3254 Alumni Correspondence .(JavaScript must be enabled to view this email address) 970 205 5052 Box Office .(JavaScript must be enabled to view this email address) 970 925 9042 Student Services Office .(JavaScript must be enabled to view this email address) 970 205 5050 Executive Office Name / Title Email Address Phone Number Alan Fletcher Munroe President and CEO .(JavaScript must be enabled to view this email address) 970 205 5011 Susanne Morrison Executive Assistant .(JavaScript must be enabled to view this email address) 970 205 5011 Jennifer Brown Elliot Vice President for Special Projects .(JavaScript must be enabled to view this email address) 970 205 5040 Finance and Administration Name / Title Email Address Phone Number Hilary Respass Vice President and Chief Operating Officer .(JavaScript must be enabled to view this email address) 970 205 5046 Deisy Kessler Chief Financial Officer .(JavaScript must be enabled to view this email address) 970 205 5041 Tessa Lemke Finance Assistant .(JavaScript must be enabled to view this email address) 970 205 5044 IT and HR Name / Title Email Address Phone Number Fritz Grueter Manager of Information Services .(JavaScript must be enabled to view this email address) 970 205 5045 Charlie Fields Accounting Director .(JavaScript must be enabled to view this email address) 970 205 5042 Facilities Name / Title Email Address Phone Number Matthew Bergdahl Director of Facilities .(JavaScript must be enabled to view this email address) 970 205 5029 Tim Rafferty Facilities Technician .(JavaScript must be enabled to view this email address) 970 205 5029 John Hammarback Facilities Technician .(JavaScript must be enabled to view this email address) 970 205 5029 Artistic Administration Name / Title Email Address Phone Number Patrick Chamberlain Vice President for Artistic Administration .(JavaScript must be enabled to view this email address) 970 205 5030 Joseph Pfender Editor-in-Chief, Programs .(JavaScript must be enabled to view this email address) 970 205 5032 Katie Brill Associate Artistic Administrator .(JavaScript must be enabled to view this email address) 970 205 5031 Operations Name / Title Email Address Phone Number Kate Northfield Lanich Vice President and General Manager .(JavaScript must be enabled to view this email address) 970 205 5022 Beth Noble Director of Operations .(JavaScript must be enabled to view this email address) 970 205 5021 Timothy Hsu Housing Director .(JavaScript must be enabled to view this email address) 970 205 5028 Kyle Schick Director of Production .(JavaScript must be enabled to view this email address) 970 205 5027 Nicole Mendyka Manager of Personnel .(JavaScript must be enabled to view this email address) 970 205 5024 Student Services Name / Title Email Address Phone Number Azusa Chapman Vice President and Dean of Students .(JavaScript must be enabled to view this email address) 970 205 5053 Ronte’ Hardy Assistant Dean of Admissions and Student Life .(JavaScript must be enabled to view this email address) 970 205 5054 Megan McDevitt Assistant Dean of Enrollment and Student Programming .(JavaScript must be enabled to view this email address) 970 205 5052 Education and Community Name / Title Email Address Phone Number Heather Kendrick Stanton Vice President for Education and Community .(JavaScript must be enabled to view this email address) 970 205 5057 Lindsay Bobyak Manager of Education and Community Programs .(JavaScript must be enabled to view this email address) 970 205 5055 Veronica Lopez Education and Community Coordinator .(JavaScript must be enabled to view this email address) 970 205 5059 Marketing and Communications Name / Title Email Address Phone Number Laura E. Smith Vice President for Marketing and Communications .(JavaScript must be enabled to view this email address) 970 205 5070 Jessica Moore Senior Director of Marketing and Global Communications .(JavaScript must be enabled to view this email address) 970 205 5075 Bonnie Shappell Director of Ticket Services .(JavaScript must be enabled to view this email address) 970 205 5025 Justin Bak Communications Manager .(JavaScript must be enabled to view this email address) 970 205 5078 Kristin Cleveland Publications Manager .(JavaScript must be enabled to view this email address) 970 205 5073 Emma Kirby Marketing Manager .(JavaScript must be enabled to view this email address) 970 205 5072 Diane Stine Archive Manager and Guest Services .(JavaScript must be enabled to view this email address) 970 205 5074 Advancement Name / Title Email Address Phone Number Austin Stewart Vice President for Advancement .(JavaScript must be enabled to view this email address) 970 205 5060 Lenor Leeds Associate Vice President for Advancement .(JavaScript must be enabled to view this email address) 970 205 5062 Chandler Martin Director of Annual Giving and Special Events .(JavaScript must be enabled to view this email address) 970 205 5065 Kat Berg Donor Stewardship Manager .(JavaScript must be enabled to view this email address) 970 205 5061 Grant Strom Advancement Manager .(JavaScript must be enabled to view this email address) 970 205 5064 Elana Weiner Annual Fund and Special Events Coordinator .(JavaScript must be enabled to view this email address) 970 205 5066 Leah Podzimek Institutional Giving Specialist .(JavaScript must be enabled to view this email address) 970 205 5063 09 02 01 About the AMFS 03 02 01 Culture, Excellence, Access 03 02 01 Board and National Council 03 02 01 Festival Leadership 03 02 01 Board of Trustees 03 02 01 National Council 03 02 01 Corporation 03 02 01 Trustee Secure Area 03 02 01 2025-26 AMFS Board of Trustees 03 02 01 Board Committees 03 02 01 Key Contacts 03 02 01 Board Meeting Packets 03 02 01 Strategic Plan 03 02 01 Music Associates of Aspen Bylaws 03 02 01 Conflict of Interest Policy 03 02 01 Disclosure and Compliance Form (please sign) 03 02 01 Financial Documents 03 02 01 Staff 03 02 01 Employment 03 02 01 Publications 03 02 01 Deep Focus: Enriching the Aspen Experience 03 02 01 Festival Focus 03 02 01 2025 03 02 01 2024 03 02 01 2023-2015 03 02 01 Podcast - High Notes 03 02 01 AMFS on Spotify 03 02 01 Annual Report 03 02 01 Student Spotlight 03 02 01 Season Calendar Request Form 03 02 01 Convocation 03 02 01 Press Area 03 02 01 Press Releases 03 02 01 News Room 03 02 01 AMFS Code of Conduct 03 07 06 Robert Spano , Music Director 02 Alan Fletcher , Munroe President and CEO Administrative Offices 02 225 Music School Road Aspen, CO 81611, USA 04 Get directions 02 +1 970 925 3254 02 info@aspenmusic.org Box Office 02 960 North 3rd Street Aspen, CO 81611, USA 04 Get directions 02 +1 970 925 9042 02 tickets@aspenmusic.org Student Services Office 02 225 Music School Road Aspen, CO 81611, USA 04 Get directions 02 +1 970 205 5050 02 studentservices@aspenmusic.org 07 07 Events Calendar Tickets/Box Office 2025 Program Book Plan Your Visit Virtual Stage 2025 Livestreams Support Make a Contribution Brand Partnerships Planned Giving Government and Foundation Support Rent or Provide Housing Volunteer Advertising Opportunities About About the AMFS Culture, Excellence, Access Board and National Council Staff Employment Read and Listen Convocation Press Area Code of Conduct School About the School Admissions Programs of Study Student Handbook Faculty Portal Alumni Hub Artist-Faculty 07 Community Programs for Local Youth School Year Programs Hire a Musician 07 07 Follow Us 06 Check out our Instagram 04 Join us on Facebook 04 Check out our Tweets 04 Watch AMFS videos on Youtube 04 Listen to AMFS on Spotify 04 AMFS on LinkedIn 07"
    },
    {
      "url": "https://sanibelmusicfestival.org/wp-content/uploads/2017/12/SMF-2018_TICKET_ORDER_FORM_Part1.pdf",
      "text": "Home - Sanibel Music Festival Home 2026 Performances Donations About Us Contact FAQ Photo Retrospective My Account Cart Checkout Select Page Tickets are not yet available for purchase. Please click here to be alerted when tickets are available. February 21 : Violins On The Veranda, a virtuosic evening with wine and hors d’oeuvres March 3 : Cliburn International Piano Competition Gold Medalist Aristo Sham of Hong Kong March 7 : Calidore String Quartet, Jeffrey Myers, Violin; Ryan Meehan, Violin; Jeremy Berry, Viola; Estelle Choi, Cello March 10 : Viano String Quartet, Tate Zawadiuk, Cello; Aiden Kane, Viola; Lucy Wang, Violin; Hao Zhou, Violin March 14 : Boston Trio, Pianist Heng-Jin Park, Cellist Jonah Ellsworth, Violinist Irina Muresanu March 21 : Opera Theater of Connecticut \u0003Music and Songs of Andrew Lloyd Webber March 24 : Anna Polonsky, Piano; David Shifrin, Clarinet; Peter Wiley, Cello Spring/Summer 2025 Dear Chamber Music Lovers: As the start of Sanibel Music Festival’s 39th season in 2026 approaches, we want to extoll our exciting offerings! The Holiday Luminary concert at our venue of Sanibel Congregational Church, on December 5th, 2025, will mark the beginning of the island’s holiday celebration and the commencement of our musical season. Sanibel Music Festival believes in the transformative power of world-class chamber music and is pleased to present, on March 3rd, 2026, as our opening concert, Aristo Sham, the Gold Medalist Winner of the Cliburn International Piano Competition. Continuing our tempo and crescendo through the month of March, we will welcome Calidore String Quartet on March 7th. Rhapsodized by the New York Times, they are “deep reserves of virtuosity and irrepressible dramatic instinct.” A reprise in 2026 by the Viano String Quartet, who we welcomed in 2023 to rave reviews, will delight us on Tuesday, March 10th. Boston Trio follows on March 14th extolled by the Palm Beach Daily News as “… an energetic program characterized by passion and youthful enthusiasm.” Continuing with the rhythm and momentum of our dynamic March, Opera Theater of Connecticut will showcase the Music and Songs of Andrew Lloyd Webber. As a grand finale to the season, we greatly anticipate the Polonsky-Shifrin-Wiley Trio. The piano, cello, and clarinet trio was formed in 2019 as a collaboration of three distinguished and established artists. Make an impact by assisting in SMF’s continued mission to enrich and stay “in tune with” the cultural life of Sanibel Island! We continue to expand our community outreach efforts. In addition to supporting emerging artists and initiating collaborative projects with community businesses and non-profits, we strive to make our high-quality concerts accessible to all. Sanibel Music Festival is a 501 c3 organization, which allows your contribution to be considered tax-deductible. Please consult with your tax advisor for the best advice. Stay tuned to our website for ticket information as well as money-saving ticket packages for our 2026 season! Online ticket purchases will generate a scan code and an email confirmation, both of which can be used not only to expedite your entry into the concert venue but also will serve as an ecologically friendly way to present your tickets in the true Sanibel spirit! “Chordially yours” Deborah Larson and Shirley Witte Co-Presidents Sanibel Music Festival PO Box 1623 Sanibel, FL 33957 239-344-7025 2026 CONCERT VENUE UCC Sanibel Congregational Church 2050 Periwinkle Way, Sanibel, FL 33957 NEW! CLICK HERE FOR Donor Information E-mail: [email protected] www.SanibelMusicFestival.org MISSION STATEMENT The mission of the Festival is to present classical music of the highest standard and to promote the careers of emerging artists through performance opportunities at affordable prices. SANIBEL MUSIC FESTIVAL FACTS The Sanibel Music Festival was founded in the 1980’s by Marilyn Lauriente, musician and impresario. The Festival has presented such wonderful artists as: The Emerson String Quartet, Olga Kern, Opera Theater of Connecticut, David Finckel, Wu Han, The Juilliard String Quartet, Orion Weiss, Joyce Yang, Jon Nakamatsu, Ruth Laredo, the American String Quartet, the Pacifica Quartet, and the Prazak Quartet. The Festival presents a concert series each season, featuring chamber music, piano, and vocal ensemble, as well as outreach and education programs. HOSTING OPPORTUNITIES FOR 2026 The privilege of hosting an artist in your home is a wonderful opportunity to be “up close and personal” with world-famous artists. This also affords the host some special perks at the accompanying concert. Contact Deborah Larson for details and to choose your dates and artists for hosting. Call or Text: 703-966-9474 . Email: [email protected] “A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE. 1-800-HELP-FLA (435-7352) OR www.FloridaConsumerHelp.com . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.” FLORIDA REGISTRATION CH2935 About Us Contact FAQ Media Photo Retrospective Website Design by Total Concept, Inc. Copyright © 2025 Sanibel Music Festival"
    },
    {
      "url": "https://sanibelmusicfestival.org",
      "text": "Home - Sanibel Music Festival Home 2026 Performances Donations About Us Contact FAQ Photo Retrospective My Account Cart Checkout Select Page Tickets are not yet available for purchase. Please click here to be alerted when tickets are available. February 21 : Violins On The Veranda, a virtuosic evening with wine and hors d’oeuvres March 3 : Cliburn International Piano Competition Gold Medalist Aristo Sham of Hong Kong March 7 : Calidore String Quartet, Jeffrey Myers, Violin; Ryan Meehan, Violin; Jeremy Berry, Viola; Estelle Choi, Cello March 10 : Viano String Quartet, Tate Zawadiuk, Cello; Aiden Kane, Viola; Lucy Wang, Violin; Hao Zhou, Violin March 14 : Boston Trio, Pianist Heng-Jin Park, Cellist Jonah Ellsworth, Violinist Irina Muresanu March 21 : Opera Theater of Connecticut \u0003Music and Songs of Andrew Lloyd Webber March 24 : Anna Polonsky, Piano; David Shifrin, Clarinet; Peter Wiley, Cello Spring/Summer 2025 Dear Chamber Music Lovers: As the start of Sanibel Music Festival’s 39th season in 2026 approaches, we want to extoll our exciting offerings! The Holiday Luminary concert at our venue of Sanibel Congregational Church, on December 5th, 2025, will mark the beginning of the island’s holiday celebration and the commencement of our musical season. Sanibel Music Festival believes in the transformative power of world-class chamber music and is pleased to present, on March 3rd, 2026, as our opening concert, Aristo Sham, the Gold Medalist Winner of the Cliburn International Piano Competition. Continuing our tempo and crescendo through the month of March, we will welcome Calidore String Quartet on March 7th. Rhapsodized by the New York Times, they are “deep reserves of virtuosity and irrepressible dramatic instinct.” A reprise in 2026 by the Viano String Quartet, who we welcomed in 2023 to rave reviews, will delight us on Tuesday, March 10th. Boston Trio follows on March 14th extolled by the Palm Beach Daily News as “… an energetic program characterized by passion and youthful enthusiasm.” Continuing with the rhythm and momentum of our dynamic March, Opera Theater of Connecticut will showcase the Music and Songs of Andrew Lloyd Webber. As a grand finale to the season, we greatly anticipate the Polonsky-Shifrin-Wiley Trio. The piano, cello, and clarinet trio was formed in 2019 as a collaboration of three distinguished and established artists. Make an impact by assisting in SMF’s continued mission to enrich and stay “in tune with” the cultural life of Sanibel Island! We continue to expand our community outreach efforts. In addition to supporting emerging artists and initiating collaborative projects with community businesses and non-profits, we strive to make our high-quality concerts accessible to all. Sanibel Music Festival is a 501 c3 organization, which allows your contribution to be considered tax-deductible. Please consult with your tax advisor for the best advice. Stay tuned to our website for ticket information as well as money-saving ticket packages for our 2026 season! Online ticket purchases will generate a scan code and an email confirmation, both of which can be used not only to expedite your entry into the concert venue but also will serve as an ecologically friendly way to present your tickets in the true Sanibel spirit! “Chordially yours” Deborah Larson and Shirley Witte Co-Presidents Sanibel Music Festival PO Box 1623 Sanibel, FL 33957 239-344-7025 2026 CONCERT VENUE UCC Sanibel Congregational Church 2050 Periwinkle Way, Sanibel, FL 33957 NEW! CLICK HERE FOR Donor Information E-mail: [email protected] www.SanibelMusicFestival.org MISSION STATEMENT The mission of the Festival is to present classical music of the highest standard and to promote the careers of emerging artists through performance opportunities at affordable prices. SANIBEL MUSIC FESTIVAL FACTS The Sanibel Music Festival was founded in the 1980’s by Marilyn Lauriente, musician and impresario. The Festival has presented such wonderful artists as: The Emerson String Quartet, Olga Kern, Opera Theater of Connecticut, David Finckel, Wu Han, The Juilliard String Quartet, Orion Weiss, Joyce Yang, Jon Nakamatsu, Ruth Laredo, the American String Quartet, the Pacifica Quartet, and the Prazak Quartet. The Festival presents a concert series each season, featuring chamber music, piano, and vocal ensemble, as well as outreach and education programs. HOSTING OPPORTUNITIES FOR 2026 The privilege of hosting an artist in your home is a wonderful opportunity to be “up close and personal” with world-famous artists. This also affords the host some special perks at the accompanying concert. Contact Deborah Larson for details and to choose your dates and artists for hosting. Call or Text: 703-966-9474 . Email: [email protected] “A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE. 1-800-HELP-FLA (435-7352) OR www.FloridaConsumerHelp.com . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.” FLORIDA REGISTRATION CH2935 About Us Contact FAQ Media Photo Retrospective Website Design by Total Concept, Inc. Copyright © 2025 Sanibel Music Festival"
    },
    {
      "url": "https://www.mssf.org.uk/about-us/",
      "text": "About Us - The Music Summer School and Festival Skip to content 2025 Courses 2025 Concerts Register/Booking Accessibility 2025 Courses 2025 Concerts Register/Booking Home About Us About Us Archive 2024 Close About Us Archive 2024 Close How it all works Register/Booking Bursaries Accommodation Gresham’s Holt in Norfolk Travel Volunteers Close Register/Booking Bursaries Accommodation Gresham’s Holt in Norfolk Travel Volunteers Close News Support Us Who We Are Contact Us What are you looking for today? No results found, please try another search...here is something you may be interested in Close 1 of 1 About Us Home » About Us Passion for music The Summer School Foundation is an independent charity (reg.272163), first established in 1976. Until 2023 The Summer School Foundation (formerly The Dartington International Summer School Foundation) worked to support and develop the Dartington International Summer School and Festival, and subsequently the Dartington Music Summer School and Festival. We achieved this, thanks to the generous support of our donors and supporters, by providing bursaries for talented young musicians and teachers, enabling them to attend the Summer School; providing funding to establish new courses at the Summer School; supporting capital improvement works at Dartington; providing funds to help underwrite the core staff and operational costs of the Summer School; and providing advice and support to the Summer School team. The Summer School Foundation has also worked to ensure the legacy of the Summer School is preserved and celebrated, having created the Summer School archive and, most recently, having placed this in the care of the British Library. In 2023 the Foundation set out to secure the future of the Summer School at a new location. We are delighted to have found a wonderful setting at Gresham’s School in stunning North Norfolk. The Music Summer School and Festival will operate from 2nd to 16th August 2025 at Gresham’s School , Holt, Norfolk. Gresham’s (which counts Benjamin Britten, Lennox Berkeley and W H Auden amongst its alumni) provides a fabulous base for the Summer School, with stunning performance and rehearsal facilities along with relaxing and comfortable residential accommodation for participants, all surrounded by beautiful grounds and woodlands. The picturesque Georgian market town of Holt is less than 10 minutes walk from the school whilst the North Norfolk coast is just 4 miles away. Concerts, talks and events take place every day throughout The Music Summer School and Festival, across a range of different spaces including the Auden Theatre, the Fishmongers’ Recital Hall in the Britten Music Building, the Dyson Building, the Chapel, and the wonderfully atmospheric outdoor Theatre in the Woods. The Music Summer School and Festival features a range of courses for participants including Choir, Vocal Ensembles and Chamber Choir, Opera Scenes, Improvisation, Chamber Music, Baroque Orchestra, Wind Ensemble, String Ensemble, Early Music, Composition, Instrumental and Vocal Workshops and Masterclasses and much more. The Summer School Foundation Buttermead, Manaton Newton Abbot Devon TQ13 9XG Home Privacy Policy Contact Us Sign Up to Our Mailing List Booking Terms and Conditions Sitemap Call Us: 01263 586 320 Email Us: info@mssf.org.uk Contact Us The Summer School Foundation. Charity No. 272163            © Copyright 2025,  All Rights Reserved. ^ Accessibility Options Use the controls below to change how you view the site. You can increase the text size and switch to a high contrast version. Smaller Text A Normal Text Larger Text High Contrast Close Close menu This Website Uses Cookies Like most websites, we use cookies on our site to improve the user experience. Find out more about cookies on this site You can update your preferences at any time by clicking on the icons at the bottom of this page. Mandatory – can not be deselected. Necessary cookies help make a website usable by enabling basic functions like page navigation and access to secure areas of the website. The website cannot function properly without these cookies. Necessary Preferences Statistics Marketing ...Saving your preferences. Please wait Cookie Name: PHPSESSID Provider: Website Desc: This cookie is native to PHP applications. The cookie is used to store and identify a users' unique session ID for the purpose of managing user session on the website. The cookie is a session cookies and is deleted when all the browser windows are closed. Expiry: session Type: Marketing Cookie Name: sg-cookies Provider: Website Desc: This cookie simply stores your preferences on the website and allows you to continue viewing the website under your terms Expiry: 1 year Type: Necessary Cookie Name: sg-expiry Provider: Website Desc: Checks when to expire your accessibility preferences. After an hour, all the 'ch-' cookies are reset Expiry: 1 hour Type: Necessary Cookie Name: sg-popup Provider: Website Desc: Stores whether the in-site popup has been closed by the user so that the user will not see the popup during the same session Expiry: session Type: Necessary Cookie Name: ch-font-sizes Provider: Website Desc: Controls the preferences set within the accessibility options. This specifically remembers your font-size choices. Expiry: 1 hour Type: Necessary Cookie Name: ch-font-times Provider: Website Desc: Controls the preferences set within the accessibility options. This specifically remembers how big you needed your font sizes. Expiry: 1 hour Type: Necessary Cookie Name: ch-prefs Provider: Website Desc: Controls the preferences set within the accessibility options Expiry: 1 hour Type: Necessary Cookie Name: _gcl_au Provider: Website Desc: Google Tag Manager sets the cookie to experiment advertisement efficiency of websites using their services. Expiry: 3 months Type: Necessary Cookie Name: __cfduid Provider: .bootstrapcdn.com Desc: The cookie is used by cdn services like CloudFare to identify individual clients behind a shared IP address and apply security settings on a per-client basis. It does not correspond to any user ID in the web application and does not store any personally identifiable information. Expiry: 1 month Type: Necessary Cookie Name: __cfduid Provider: .fontawesome.com Desc: The cookie is used by cdn services like CloudFare to identify individual clients behind a shared IP address and apply security settings on a per-client basis. It does not correspond to any user ID in the web application and does not store any personally identifiable information. Expiry: 1 month Type: Necessary Cookie Name: _ga Provider: google.com Desc: This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors. Expiry: 2 years Type: Necessary Cookie Name: _gid Provider: google.com Desc: This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the wbsite is doing. The data collected including the number visitors, the source where they have come from, and the pages viisted in an anonymous form. Expiry: 1 day Type: Statistics Cookie Name: rc::a Provider: google.com Desc: This cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. Expiry: session Type: Statistics Cookie Name: rc::b Provider: google.com Desc: This cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. Expiry: session Type: Statistics Cookie Name: rc::c Provider: google.com Desc: This cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. Expiry: session Type: Statistics Cookie Name: _GRECAPTCHA Provider: google.com Desc: This cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. Expiry: 179 days Type: Statistics Cookie Name: CONSENT Provider: google.com Desc: Used to detect if the visitor has accepted the marketing category in the cookie banner. This cookie is necessary for GDPR-compliance of the website. Expiry: 2 years Type: Necessary Cookie Name: _gat_UA-* Provider: google.com Desc: Google Analytics sets this cookie for user behaviour tracking. Expiry: 1 minute Type: Statistics Cookie Name: _ga_* Provider: google.com Desc: Google Analytics sets this cookie to store and count page views. Expiry: Google Analytics sets this cookie to store and count page views. Type: Statistics Cookie Name: test_cookie Provider: doubleclick.net Desc: doubleclick.net sets this cookie to determine if the user's browser supports cookies. Expiry: 15 minutes Type: Marketing Cookie Name: _cf_bm Provider: Vimeo Desc: This cookie is used to distinguish between humans and bots. This is beneficial for the website in order to make valid reports on the use of their website Expiry: 1 day Type: Necessary Cookie Name: CONSENT Provider: YouTube.com Desc: Used to detect if the visitor has accepted the marketing category in the cookie banner. This cookie is necessary for GDPR-compliance of the website Expiry: 2 years Type: Necessary Cookie Name: VISITOR_INFO1_LIVE Provider: YouTube.com Desc: This cookie is set by Youtube and registers a unique ID for tracking users based on their geographical location Expiry: 5 months Type: Necessary Cookie Name: YSC Provider: YouTube.com Desc: This cookie is set by Youtube. Used to track the information of the embedded YouTube videos on a website. Expiry: 8 months Type: Marketing Cookie Name: GPS Provider: YouTube.com Desc: This cookie is set by Youtube and registers a unique ID for tracking users based on their geographical location Expiry: 30 mintues Type: Marketing Cookie Name: yt.innertube::nextId Provider: YouTube.com Desc: Registers a unique ID to keep statistics of what videos from YouTube the user has seen Expiry: none Type: Marketing Cookie Name: yt.innertube::requests Provider: YouTube.com Desc: Registers a unique ID to keep statistics of what videos from YouTube the user has seen Expiry: none Type: Marketing Cookie Name: ytidb::LAST_RESULT_ENTRY_KEY Provider: YouTube.com Desc: Stores the user's video player preferences using embedded YouTube Video Expiry: none Type: Marketing Cookie Name: yt-remote-cast-available Provider: YouTube.com Desc: Stores the user's video player preferences using embedded YouTube Video Expiry: session Type: Marketing Cookie Name: yt-remote-cast-installed Provider: YouTube.com Desc: Stores the user's video player preferences using embedded YouTube Video Expiry: session Type: Marketing Cookie Name: yt-remote-connected-devices Provider: YouTube.com Desc: Stores the user's video player preferences using embedded YouTube Video Expiry: none Type: Marketing Cookie Name: yt-remote-device-id Provider: YouTube.com Desc: Stores the user's video player preferences using embedded YouTube Video Expiry: none Type: Marketing Cookie Name: yt-remote-fast-check-period Provider: YouTube.com Desc: Stores the user's video player preferences using embedded YouTube Video Expiry: session Type: Marketing Cookie Name: yt-remote-session-app Provider: YouTube.com Desc: Stores the user's video player preferences using embedded YouTube Video Expiry: session Type: Marketing Cookie Name: yt-remote-session-name Provider: YouTube.com Desc: Stores the user's video player preferences using embedded YouTube Video Expiry: session Type: Marketing A list of cookies used by this website. Name Provider Description Expiry Type PHPSESSID Website This cookie is native to PHP applications. The cookie is used to store and identify a users' unique session ID for the purpose of managing user session on the website. The cookie is a session cookies and is deleted when all the browser windows are closed. session Marketing sg-cookies Website This cookie simply stores your preferences on the website and allows you to continue viewing the website under your terms 1 year Necessary sg-expiry Website Checks when to expire your accessibility preferences. After an hour, all the 'ch-' cookies are reset 1 hour Necessary sg-popup Website Stores whether the in-site popup has been closed by the user so that the user will not see the popup during the same session session Necessary ch-font-sizes Website Controls the preferences set within the accessibility options. This specifically remembers your font-size choices. 1 hour Necessary ch-font-times Website Controls the preferences set within the accessibility options. This specifically remembers how big you needed your font sizes. 1 hour Necessary ch-prefs Website Controls the preferences set within the accessibility options 1 hour Necessary _gcl_au Website Google Tag Manager sets the cookie to experiment advertisement efficiency of websites using their services. 3 months Necessary __cfduid .bootstrapcdn.com The cookie is used by cdn services like CloudFare to identify individual clients behind a shared IP address and apply security settings on a per-client basis. It does not correspond to any user ID in the web application and does not store any personally identifiable information. 1 month Necessary __cfduid .fontawesome.com The cookie is used by cdn services like CloudFare to identify individual clients behind a shared IP address and apply security settings on a per-client basis. It does not correspond to any user ID in the web application and does not store any personally identifiable information. 1 month Necessary _ga google.com This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors. 2 years Necessary _gid google.com This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the wbsite is doing. The data collected including the number visitors, the source where they have come from, and the pages viisted in an anonymous form. 1 day Statistics rc::a google.com This cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. session Statistics rc::b google.com This cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. session Statistics rc::c google.com This cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. session Statistics _GRECAPTCHA google.com This cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. 179 days Statistics CONSENT google.com Used to detect if the visitor has accepted the marketing category in the cookie banner. This cookie is necessary for GDPR-compliance of the website. 2 years Necessary _gat_UA-* google.com Google Analytics sets this cookie for user behaviour tracking. 1 minute Statistics _ga_* google.com Google Analytics sets this cookie to store and count page views. Google Analytics sets this cookie to store and count page views. Statistics test_cookie doubleclick.net doubleclick.net sets this cookie to determine if the user's browser supports cookies. 15 minutes Marketing _cf_bm Vimeo This cookie is used to distinguish between humans and bots. This is beneficial for the website in order to make valid reports on the use of their website 1 day Necessary CONSENT YouTube.com Used to detect if the visitor has accepted the marketing category in the cookie banner. This cookie is necessary for GDPR-compliance of the website 2 years Necessary VISITOR_INFO1_LIVE YouTube.com This cookie is set by Youtube and registers a unique ID for tracking users based on their geographical location 5 months Necessary YSC YouTube.com This cookie is set by Youtube. Used to track the information of the embedded YouTube videos on a website. 8 months Marketing GPS YouTube.com This cookie is set by Youtube and registers a unique ID for tracking users based on their geographical location 30 mintues Marketing yt.innertube::nextId YouTube.com Registers a unique ID to keep statistics of what videos from YouTube the user has seen none Marketing yt.innertube::requests YouTube.com Registers a unique ID to keep statistics of what videos from YouTube the user has seen none Marketing ytidb::LAST_RESULT_ENTRY_KEY YouTube.com Stores the user's video player preferences using embedded YouTube Video none Marketing yt-remote-cast-available YouTube.com Stores the user's video player preferences using embedded YouTube Video session Marketing yt-remote-cast-installed YouTube.com Stores the user's video player preferences using embedded YouTube Video session Marketing yt-remote-connected-devices YouTube.com Stores the user's video player preferences using embedded YouTube Video none Marketing yt-remote-device-id YouTube.com Stores the user's video player preferences using embedded YouTube Video none Marketing yt-remote-fast-check-period YouTube.com Stores the user's video player preferences using embedded YouTube Video session Marketing yt-remote-session-app YouTube.com Stores the user's video player preferences using embedded YouTube Video session Marketing yt-remote-session-name YouTube.com Stores the user's video player preferences using embedded YouTube Video session Marketing"
    },
    {
      "url": "https://coloradomusicfestival.org/about-the-festival/staff/",
      "text": "Our Staff We Can’t Wait to See You Concerts & Events Concert Calendar Family Friendly Concerts Pre-Concert Talks Open Rehearsals Tiny Rock Concerts Ticket Information Buy Tickets Ticket Information Box Office Subscriptions Gift Certificates Group Tickets Frequently Asked Questions × Plan Your Festival Visit Know Before You Go Our Venue Getting Here Accessibility Free Shuttle Dining Options Frequently Asked Questions Visiting Boulder The Festival performs in beautiful Boulder, Colorado — a breathtaking location full of nature, culture, cuisine, art, and more. Learn More × Learn About Our Educational Programs Festival Fellows Meet the Festival Fellows: eight aspiring professional musicians who receive coaching and performance opportunities through the Festival and its guest artists. Learn More Center for Musical Arts This excellent community music school is also the educational arm of our organization. Learn More × With your support, we’re making an impact through music Learn More Individual Giving Donate Today Ways to Give Giving Circles Where Your Money Goes Special Events Organizational Giving Corporate Sponsorship Government and Foundations Our Sponsors Planned Giving Donor Advised Funds Stocks, Securities, and Mutual Funds Wills and Trusts Beneficiary Designations Charitable Gift Annuities Where Your Money Goes × About the Colorado Music Festival General Info About the Festival Frequently Asked Questions Diversity, Equity and Inclusion Employment Contact Our People Our Music Director Our Orchestra Artists-in-Residence Our Staff Our Board News and Updates Press Room Blog Newsletter Signup × Buy Tickets FAQs Watch & Listen Donate Gala Concerts & Tickets Plan Your Visit Education Support Us About Us Select Page Our Staff <strong>Elizabeth McGuire</strong> Executive Director <strong>Alberto Gutierrez</strong> General Manager <strong>Cindy Hohman</strong> Director of Marketing and Community Relations <strong>Kathy Kucsan, Ph.D.</strong> Education Director <strong>Abbey Davis</strong> Marketing and Development Coordinator <strong>Crystal Lohman</strong> Development Manager Marta Boratgis, Housing Coordinator Larry Brezicka, Artistic Coordinator Emily Burst, Production Manager Brian Jack, House Manager Michael Quam, Sound Engineer Lisa Vaupel, Orchestra Personnel Manager Our People Music Director, Peter Oundjian The Orchestra Our Staff Our Board of Directors General Info About the Festival Employment Press Contacts Contact Us Read Our Blog Sign Up for Emails Get In Touch Colorado Music Festival Administrative Office 200 E. Baseline Rd. Lafayette, Colorado 80026 Box Office The Colorado Chautauqua 303-440-7666 boxoffice@chautauqua.com Follow Follow Follow CONTACT US AUDITIONS & EMPLOYMENT ADMINISTRATIVE STAFF E-NEWSLETTER Press & Resources Stories & News Press Room Past Festival Seasons Need Help? FAQs Contact Us Privacy Policy Copyright Website 2025 | Colorado Music Festival | All Rights Reserved"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    }
  ]
}