{
  "fuentes": [
    {
      "url": "https://santivachronicle.com/news/city-providing-no-contact-hurricane-prep-procedures/",
      "email": "emergency.management@mysanibel.com"
    },
    {
      "url": "https://santivachronicle.com/news/city-providing-no-contact-hurricane-prep-procedures/",
      "email": "steve.chaipel@mysanibel.com"
    },
    {
      "url": "https://www.sanatvaayurvedic.com/pages/contact-us",
      "email": "sales@sanatva.com"
    },
    {
      "url": "https://www.sanatvaayurvedic.com/pages/contact-us",
      "email": "sales@santava.com"
    },
    {
      "url": "https://www.sanatvaayurvedic.com/pages/contact-us",
      "email": "sanatva_13d00ae3-8f10-4df2-8e02-914894091e64_160x@2x.png"
    },
    {
      "url": "https://www.sanatvaayurvedic.com/pages/contact-us",
      "email": "sanatva_1_150x@2x.png"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "tiffany@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "alexandra@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "celia@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "courtney@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "eric@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "fabiola@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "imam@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "joshua@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "martha@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "matthew@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "matthewm@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "nardos@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "rustem@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "ryan@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "sasha@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "susanna@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "tiffany@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "tiwa@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "victoria@ground.news"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "email": "wren@ground.news"
    },
    {
      "url": "https://www.chroniclebooks.com/pages/about-us",
      "email": "cb_weblogo_alt_01_small@2x.png"
    },
    {
      "url": "https://www.chroniclebooks.com/pages/about-us",
      "email": "cb_weblogo_main_01_350x@2x.png"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://santivachronicle.com/news/sanibel-captiva-trust-company-presents-author-of-empty-mansions/",
      "email": "fsteger@sancaptrustco.com"
    }
  ],
  "mails": [
    "alexandra@ground.news",
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "cb_weblogo_alt_01_small@2x.png",
    "cb_weblogo_main_01_350x@2x.png",
    "celia@ground.news",
    "courtney@ground.news",
    "emergency.management@mysanibel.com",
    "eric@ground.news",
    "fabiola@ground.news",
    "fsteger@sancaptrustco.com",
    "imam@ground.news",
    "info.nairobi@skanem.com",
    "info@reception-plus.de",
    "jane@skanem.ke",
    "joshua@ground.news",
    "martha@ground.news",
    "matthew@ground.news",
    "matthewm@ground.news",
    "nardos@ground.news",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "rustem@ground.news",
    "ryan@ground.news",
    "sachen.gudka@skanem.com",
    "sales@sanatva.com",
    "sales@santava.com",
    "sameer.gaikwad@skanem.com",
    "sanatva_13d00ae3-8f10-4df2-8e02-914894091e64_160x@2x.png",
    "sanatva_1_150x@2x.png",
    "sasha@ground.news",
    "shamila.mirza@skanem.com",
    "steve.chaipel@mysanibel.com",
    "susanna@ground.news",
    "tiffany@ground.news",
    "tiwa@ground.news",
    "victoria@ground.news",
    "wren@ground.news"
  ],
  "nombre_sitio": "santivachronicle.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://santivachronicle.com/news/city-providing-no-contact-hurricane-prep-procedures/",
      "text": "City Providing ‘No Contact’ Hurricane Preparation Procedures Skip to navigation Skip to content Search for: Santiva Chronicle The Sanibel & Captiva Daily News Sanibel News Sanibel Police Reports COVID-19 Election 2021 Election 2021 Op-Ed A Silent Sanibel Captiva News Community Island Insider Op-Ed Religion Obituaries Community Calendar Outdoor Environmental News Sweet Shots by Kyle Sweet Arts-Culture Reviews Lifestyle & Food Education CROW CAW (Case A Week) Business Financial News Real Estate Business Listings Contact Contact Us Weekly Email Subscriptions SC Staff Contact Us SC Staff Search for: Santiva Chronicle The Sanibel & Captiva Daily News Sanibel News Sanibel Police Reports COVID-19 Election 2021 Election 2021 Op-Ed A Silent Sanibel Captiva News Community Island Insider Op-Ed Religion Obituaries Community Calendar Outdoor Environmental News Sweet Shots by Kyle Sweet Arts-Culture Reviews Lifestyle & Food Education CROW CAW (Case A Week) Business Financial News Real Estate Business Listings Contact Contact Us Weekly Email Subscriptions SC Staff Home News City Providing ‘No Contact’ Hurricane Preparation Procedures City Providing ‘No Contact’ Hurricane Preparation Procedures May 13, 2020 0 489 provided to Santiva Chronicle Hurricane season begins June 1 and the City of Sanibel is offering ‘no contact’ ways to prepare due to COVID-19. The annual live hurricane seminar will not be offered this year. Instead, citizens and business owners can view the 2018 seminar on the city’s YouTube channel. The 2016 hurricane re-entry passes will continue to be used and anyone who is a new resident or does not have one can obtain a residential pass application online. One of the following proof of address documentation is required: driver’s license, vehicle registration, voter registration, utility bill or a screen shot from the Lee Property Appraiser’s website listing your name as the property owner. For business owners who need a commercial pass, can get the application online . A  business tax receipt is required and can be obtained by emailing steve.chaipel@mysanibel.com or calling 239-472-9615. Completed residential or commercial applications and appropriate documentation can be emailed to emergency.management@mysanibel.com or mailed to the Sanibel Police Department, attention Lt. Towler, 800 Dunlop Road, Sanibel, FL 33957. Hurricane pass applications can be done in-person at the Sanibel Police Department with proper social distancing. It is also an appropriate time to confirm registration for alertLee notifications , the emergency notification system that replaced CodeRed in July 2019. The city and Lee County uses this tool to send targeted emergency alerts, which can be received on multiple devices. Anyone previously registered for CodeRed will have to register for the alertLee system. Share this: Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to print (Opens in new window) Print Post navigation Previous Article Make Senior Living Work For You Both Next Article Sanibel Under Mandatory Water Restriction Order from SFWMD Leave a Comment Cancel reply We are interested in articulate, well-informed remarks that are relevant to the article. We welcome your advice, your criticism and your unique insights into the issues of the day. To be approved for publication, your comments should be civil and avoid name-calling. It may take up to 24 hours for your comment to appear, if it is approved. This site uses Akismet to reduce spam. Learn how your comment data is processed. SC Supporter SC Supporters WEEKLY EMAIL NEWS SIGNUP Article Search Search for: Advertisement SANTIVA CHRONICLE MEDIA, LLC ©2024 Contact Us Weekly Email Subscriptions Support Local Journalism SC Staff Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://www.sanatvaayurvedic.com/pages/contact-us",
      "text": "Contact REGISTER / LOGIN 0 Your cart is currently empty Total: Rs. 0.00 View Cart Home Products Herbal Capsules Shop by Product Shilajit Avleh Premium Shilajit Capsules Gaskia Ashwagandha Kofko Livkia Amla Capsules Tulsi Capsules Health Concern Liver Care Kidney Care Digestive Care Piles Care Joint & Muscle Pain Cough and Cold Skin Care Male Wellness Women Wellness Immunity Booster Combo Packs REGISTER / LOGIN 0 Your cart is currently empty Total: Rs. 0.00 View Cart Home Products Herbal Capsules Shop by Product Shilajit Avleh Premium Shilajit Capsules Gaskia Ashwagandha Kofko Livkia Amla Capsules Tulsi Capsules Health Concern Liver Care Kidney Care Digestive Care Piles Care Joint & Muscle Pain Cough and Cold Skin Care Male Wellness Women Wellness Immunity Booster Combo Packs Home Contact Contact Us Feel free to reach us at: Address : SCO 12, Sector 5, Panchkula - 134109, Haryana E-mail: sales@santava.com +91 91155 91455 Write to us Name * Email * Subject Message Send DISCLAIMER : All statements are based on clinically studied benefits of each ingredient. This product is not intended to diagnose, treat, cure or prevent any disease. Result may vary person to person. Sanatva , a premium wellness brand by AV Traders , is dedicated to bringing you the finest in health and quality. Established in 2015, we have built a reputation for providing premium quality products at affordable prices. Our range of products includes herbal capsules, syrups, pain oils, and more, all of which are manufactured using the highest quality raw materials sourced from trusted vendors. Sanatva, Sanatva Ayurveda and Sanatva Ayurvedic is a Trademark of AV Traders , committed to delivering excellence in wellness and quality. Address: SCO 12, Sector 5, Panchkula - 134109, Haryana Email: sales@sanatva.com Customer Support: +91 9115591455 Company About Us Contact Blogs Privacy Policy Refund  and Cancellation Policy Terms & Conditions Products Liver Care Digestive Care Kidney Care Herbal Capsules Joint Pain Relief Piles Care Skin Care Cough Care Male Wellness Women Care Signup for Newsletter Sign up with your email to stay updated on the hottest deals and news tailored just for you! Subscribe Copyright © 2025 Sanatva Ayurvedic. All Rights Reserved. Added to cart successfully! VIEW CART CHECKOUT Added to cart successfully! VIEW CART CHECKOUT"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://ground.news/interest/santiva-chronicle",
      "text": "Breaking News Headlines Today | Ground News Skip to main content See every side of every news story Get Started Browser Extension Thursday, September 11, 2025 Set Location International Edition Home For You Local Blindspot Subscribe Login Subscribe Login News from Santiva Chronicle Follow News from Santiva Chronicle Follow Trending Topics Artificial Intelligence Soccer Drones European Union Israel-Gaza Company About History Mission Blog Testimonials Group Subscriptions Subscribe Gift Free Trial Careers Affiliates Help Help Center FAQ Contact Us For Educators/Libraries Media Bias Ratings Ownership and Factuality Ratings Referral Code News Sources Topics Tools App Browser Extension Daily Newsletter Blindspot Report Newsletter Burst Your Bubble Newsletter Timelines Gift Privacy Policy Manage Cookies Privacy Preferences Terms and Conditions © 2025 Snapwise Inc News For You Search Blindspot Local Israel-Gaza Artificial Intelligence Soccer Drones European Union World Cup Social Media Stock Markets Volleyball Apple NATO Donald Trump Education We’ve assigned a media bias rating of unknown to Santiva Chronicle . You can read more about our methodology here. Santiva Chronicle ’s factuality rating is Unknown . Ground News calculates this rating using a combination of the fact and reliability ratings from Ad Fontes Media and Media Bias/Fact Check. We’ve assigned a media bias rating of unknown to Santiva Chronicle . You can read more about our methodology here. Santiva Chronicle ’s factuality rating is Unknown . Ground News calculates this rating using a combination of the fact and reliability ratings from Ad Fontes Media and Media Bias/Fact Check. Information about Santiva Chronicle Where is Santiva Chronicle located? Santiva Chronicle 's Website Media Bias Ratings Do you disagree? Edit bias Learn more about Media Bias Ratings . Factuality Learn more about Factuality Ratings Reveal Factuality Ratings by upgrading to a Premium account. Tap Upgrade to explore subscription options to meet all your reading needs. Upgrade Ownership Learn more about Ownership categories Reveal Ownership Data by upgrading to a Vantage account. Tap Upgrade to explore subscription options to meet all your reading needs. Upgrade News Home Page Local News Blindspot Feed International International North America South America Europe Asia Australia Africa Trending Internationally Artificial Intelligence Soccer Drones European Union World Cup Trending in U.S. Israel-Gaza Volleyball US Economy Soccer US Politics Trending in U.K. Israel-Gaza UK Economy Premier League NHS Manchester United"
    },
    {
      "url": "https://www.chroniclebooks.com/pages/about-us",
      "text": "About Us | Chronicle Books Free Shipping Over $50+ Skip to content Browse Books Art + Design Bestsellers Architecture + Interiors Art Coloring + Activity Books Design Photography Entertainment Bestsellers Fiction General Non-Fiction Puzzles + Games Ridley's Games Humor Movies + TV Music Pets Star Wars Food + Drink Bestsellers Baking + Desserts Beverages Chefs + Restaurants Entertaining + Holidays General Cookbooks Kitchen Accessories Vegetarian + Special Diets Life + Style Bestsellers Craft Fashion + Style Health + Wellness Home + Décor Inspiration Love + Friendship Parenting + Baby Sex + Relationships Travel Weddings + Parties New Releases Shop Now → Upcoming Shop Now → Bestsellers Shop All Bestsellers Award Winning Titles Bestsellers Shop Now → Children's Books Shop Now → Life + Style Shop Now → Humor + Entertainment Shop Now → We Love LEGO® Shop Now → Licensed & Series Series Letters to My One Line a Day Bibliophile Pendleton LEGO Shop Now → Star Wars Shop Now → Marvel Shop Now → Disney & Pixar Shop Now → Studio Ghibli Shop Now → Kids + Teens Shop All Books by Age Ages 0-2 Ages 3-5 Ages 6-8 Ages 9-12 Teens Activities + Games by Age Ages 0-2 Ages 3-5 Ages 6-8 Ages 9-12 All Ages The Book That Can Read Your Mind Shop Now → Juneteenth Is Shop Now → The Construction Site series Shop Now → Stationery + Journals Cards + Stationery Notecards Postcards Stationery Journals + Notebooks Blank Journals Guided Journals Calendars + Planners Shop One Line a Day → Shop Desk Accessories → Shop Wall Calendars → Shop Continuous Greetings → Gifts Shop All Card Decks Puzzles & Games Shop Bestselling Gifts → Gifts For Kids and Teens → Gifts For Movie Buffs → Shop Gifts For Baby → Shop Gifts For Pet Lovers → Browse Books Art + Design Bestsellers Architecture + Interiors Art Coloring + Activity Books Design Photography Entertainment Bestsellers Fiction General Non-Fiction Puzzles + Games Ridley's Games Humor Movies + TV Music Pets Star Wars Food + Drink Bestsellers Baking + Desserts Beverages Chefs + Restaurants Entertaining + Holidays General Cookbooks Kitchen Accessories Vegetarian + Special Diets Life + Style Bestsellers Craft Fashion + Style Health + Wellness Home + Décor Inspiration Love + Friendship Parenting + Baby Sex + Relationships Travel Weddings + Parties Bestsellers Shop All Bestsellers Award Winning Titles Licensed & Series Series Letters to My One Line a Day Bibliophile Pendleton Kids + Teens Shop All Books by Age Ages 0-2 Ages 3-5 Ages 6-8 Ages 9-12 Teens Activities + Games by Age Ages 0-2 Ages 3-5 Ages 6-8 Ages 9-12 All Ages Stationery + Journals Cards + Stationery Notecards Postcards Stationery Journals + Notebooks Blank Journals Guided Journals Calendars + Planners Gifts Shop All Card Decks Puzzles & Games Clear Search 0 Cart Recently Viewed Add Browse Books Art + Design Bestsellers Architecture + Interiors Art Coloring + Activity Books Design Photography Entertainment Bestsellers Fiction General Non-Fiction Puzzles + Games Ridley's Games Humor Movies + TV Music Pets Star Wars Food + Drink Bestsellers Baking + Desserts Beverages Chefs + Restaurants Entertaining + Holidays General Cookbooks Kitchen Accessories Vegetarian + Special Diets Life + Style Bestsellers Craft Fashion + Style Health + Wellness Home + Décor Inspiration Love + Friendship Parenting + Baby Sex + Relationships Travel Weddings + Parties Bestsellers Shop All Bestsellers Award Winning Titles Licensed & Series Series Letters to My One Line a Day Bibliophile Pendleton Kids + Teens Shop All Books by Age Ages 0-2 Ages 3-5 Ages 6-8 Ages 9-12 Teens Activities + Games by Age Ages 0-2 Ages 3-5 Ages 6-8 Ages 9-12 All Ages Stationery + Journals Cards + Stationery Notecards Postcards Stationery Journals + Notebooks Blank Journals Guided Journals Calendars + Planners Gifts Shop All Card Decks Puzzles & Games Browse Books Browse Books Art + Design Art + Design Bestsellers Architecture + Interiors Art Coloring + Activity Books Design Photography Entertainment Entertainment Bestsellers Fiction General Non-Fiction Puzzles + Games Ridley's Games Humor Movies + TV Music Pets Star Wars Food + Drink Food + Drink Bestsellers Baking + Desserts Beverages Chefs + Restaurants Entertaining + Holidays General Cookbooks Kitchen Accessories Vegetarian + Special Diets Life + Style Life + Style Bestsellers Craft Fashion + Style Health + Wellness Home + Décor Inspiration Love + Friendship Parenting + Baby Sex + Relationships Travel Weddings + Parties Bestsellers Bestsellers Shop All Bestsellers Award Winning Titles Licensed & Series Licensed & Series Series Series Letters to My One Line a Day Bibliophile Pendleton Kids + Teens Kids + Teens Shop All Books by Age Books by Age Ages 0-2 Ages 3-5 Ages 6-8 Ages 9-12 Teens Activities + Games by Age Activities + Games by Age Ages 0-2 Ages 3-5 Ages 6-8 Ages 9-12 All Ages Stationery + Journals Stationery + Journals Cards + Stationery Cards + Stationery Notecards Postcards Stationery Journals + Notebooks Journals + Notebooks Blank Journals Guided Journals Calendars + Planners Gifts Gifts Shop All Card Decks Puzzles & Games Register / Login Search Search Search Clear Home\n        /\n        About Us Our Story Who We Are Chronicle Books is an independent publisher based in San Francisco that has been making things since the Summer of Love. We are inspired by the enduring magic of books, and by sparking the passions of others. We believe in partnering with artists, writers, and organizations that represent the diversity of our world, and we are committed to an inclusive company culture that respects and uplifts people of diverse backgrounds and points of view. What We Do As soon as you pick up our publishing, we want you to be able to tell that what you're holding comes from us. We consider every detail, and ask questions like these: does the design support and enhance the content? How does it feel in your hands? What special touches can we add to make it an object you'll treasure? We apply this approach to everything we make, whether it’s a book, journal, game, ebook, or our newest invention. Where We Do It Based in San Francisco, our headquarters are in an old maritime machine shop and warehouse. There are 4 floors: one for sales, marketing, and operations, one for editorial and contracts, another for design and production, and meeting space where we all come together. There’s even a storefront you can visit. Stop by the next time you’re in town and bring your favorite tote, or take home one of ours. How You Can Find Us We’ve often been told \"I see your books everywhere \" and that’s just how we like it—you'll find our telltale spectacles on store shelves of all kinds, all over the world. Once you start looking, you can’t miss us. Wherever you are, we invite you to see things differently too. You can find your nearest bookstore using IndieBounds’s Bookstore Finder tool . For customer service related to chroniclebooks.com orders, call 1.800.759.0190 or email hello@chroniclebooks.com. Privacy Policy | Do Not Sell My Personal Info Corporate Social Responsibility / MSA Statement PUBLISHING PARTNERS Petit Collage | Princeton Architectural Press  |  Laurence King Publishing Galison + Mudpuppy  |  Twirl Books  |  Hardie Grant Books Quadrille Publishing  |  Levine Querido | The Creative Company Sierra Club | Blackwell & Ruth About About Us Chronicle Connects Retail Accounts International Accounts Publishing Partners Catalogs Ebooks Corporate Gifts Permissions & Subrights Events Support Contact Us FAQ Shipping & Returns Retail Locations Jobs Submissions Custom Publishing Copyright © 2025, Chronicle Books . Copyright © 2025, Chronicle Books . Powered by Shopify Availability"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * First Surname name E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://santivachronicle.com/news/sanibel-captiva-trust-company-presents-author-of-empty-mansions/",
      "text": "Sanibel Captiva Trust Company Presents Author of ‘Empty Mansions’ Skip to navigation Skip to content Search for: Santiva Chronicle The Sanibel & Captiva Daily News Sanibel News Sanibel Police Reports COVID-19 Election 2021 Election 2021 Op-Ed A Silent Sanibel Captiva News Community Island Insider Op-Ed Religion Obituaries Community Calendar Outdoor Environmental News Sweet Shots by Kyle Sweet Arts-Culture Reviews Lifestyle & Food Education CROW CAW (Case A Week) Business Financial News Real Estate Business Listings Contact Contact Us Weekly Email Subscriptions SC Staff Contact Us SC Staff Search for: Santiva Chronicle The Sanibel & Captiva Daily News Sanibel News Sanibel Police Reports COVID-19 Election 2021 Election 2021 Op-Ed A Silent Sanibel Captiva News Community Island Insider Op-Ed Religion Obituaries Community Calendar Outdoor Environmental News Sweet Shots by Kyle Sweet Arts-Culture Reviews Lifestyle & Food Education CROW CAW (Case A Week) Business Financial News Real Estate Business Listings Contact Contact Us Weekly Email Subscriptions SC Staff Home News Sanibel Captiva Trust Company Presents Author of ‘Empty Mansions’ Sanibel Captiva Trust Company Presents Author of ‘Empty Mansions’ March 6, 2023 0 646 provided to The Santiva Chronicle Bill Dedman FORT MYERS, Fla. – The Sanibel Captiva Trust Company is presenting a talk March 14 by Pulitzer prize-winning journalist Bill Dedman, author of the best-seller “Empty Mansions.” The biography covers copper heiress Huguette Clark, who owned palatial homes in Santa Barbara, Connecticut and New York, but lived for 20 years in a simple hospital room despite being in excellent health. Her grand New York home was unoccupied for nearly 60 years. Dedman, who discovered Huguette’s story for NBC News, collaborated with Huguette Clark’s cousin, Paul Clark Newell Jr., one of the few relatives to have conversations with her. “It’s a mystery of wealth and loss,” said Dedman. “If Huguette Clark had been better advised, she would not have lost $40 million of her fortune to distant relatives, and her estate would not have wasted $25 million on legal fees. Her life story is extreme, but it holds lessons for us all.” “Bill’s book aligns very well with what we do here at The Sanibel Captiva Trust Company every day,” said Carolyn Rogers, CFRE, Wealth Services. “We work to assure our clients’ financial and estate plans are built and executed properly for the benefit and protection of our clients and their heirs.” The complimentary presentation will begin with a 5 p.m. reception, followed by the program at 6 p.m. It will be held at The Burroughs Home, 2505 First St. in Fort Myers. Seating is limited, and reservations are required. $2 million or more in investible assets. Contact Frances Steger at fsteger@sancaptrustco.com or call 239-472-8300. About The Sanibel Captiva Trust Company The Sanibel Captiva Trust Company is an independent trust company with $3.6 billion in assets under management that provides Family Office and Wealth Management Services, including investment management, trust administration and financial counsel to high-net-worth individuals, families, businesses, foundations and endowments. Founded in 2001 as a state-chartered independent trust company, the firm is focused on wealth management services that are absolute-return oriented and performance driven. Each portfolio is separately managed and customized specifically to the client’s yield and cash-flow requirements. The Naples Trust Company and The Tampa Bay Trust Company are divisions of The Sanibel Captiva Trust Company. Offices are located in Sanibel, Fort Myers, Naples, Marco Island, Tampa, Belleair Bluffs and Tarpon Springs. For information, visit sancaptrustco.com Share this: Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to print (Opens in new window) Print Post navigation Previous Article Captains For Clean Water Coming To Congress Jewelers Next Article Celebratory Ribbon Cutting Marks Opening of Temporary Sanibel Fire Station 172 Leave a Comment Cancel reply We are interested in articulate, well-informed remarks that are relevant to the article. We welcome your advice, your criticism and your unique insights into the issues of the day. To be approved for publication, your comments should be civil and avoid name-calling. It may take up to 24 hours for your comment to appear, if it is approved. This site uses Akismet to reduce spam. Learn how your comment data is processed. SC Supporter SC Supporters WEEKLY EMAIL NEWS SIGNUP Article Search Search for: Advertisement SANTIVA CHRONICLE MEDIA, LLC ©2024 Contact Us Weekly Email Subscriptions Support Local Journalism SC Staff Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    }
  ]
}