{
  "fuentes": [
    {
      "url": "https://www.sarasotaartmuseum.org/careers/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/press-room/",
      "email": "bboyd@ringling.edu"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/press-room/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/about/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://aamd.org/museum-careers/current-opportunities/6609",
      "email": "elazowski@graystoneadv.com"
    },
    {
      "url": "https://aamd.org/museum-careers/current-opportunities/6609",
      "email": "tbank@koyapartners.com"
    },
    {
      "url": "https://aamd.org/museum-careers/current-opportunities/6609",
      "email": "u003etbank@koyapartners.com"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/frequently-asked-questions/",
      "email": "museumevents@ringling.edu"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/frequently-asked-questions/",
      "email": "groups@sarasota.art"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/frequently-asked-questions/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/frequently-asked-questions/",
      "email": "lwood1@ringling.edu"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/school-tours/",
      "email": "carolyn.james@constellationculinary.com"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/school-tours/",
      "email": "groups@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/school-tours/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.ringling.edu/about/community-programs/sarasota-art-museum/",
      "email": "admissions@ringling.edu"
    },
    {
      "url": "https://www.ringling.edu/about/community-programs/sarasota-art-museum/",
      "email": "communications@ringling.edu"
    },
    {
      "url": "https://www.ringling.edu/about/community-programs/sarasota-art-museum/",
      "email": "info@ringling.edu"
    },
    {
      "url": "https://www.ringling.edu/about/community-programs/sarasota-art-museum/",
      "email": "info@sarasota.art"
    },
    {
      "url": "https://honolulumuseum.org/pQXZfo/get-in-touch",
      "email": "info@honolulumuseum.org"
    },
    {
      "url": "https://honolulumuseum.org/pQXZfo/get-in-touch",
      "email": "shop@honolulumuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/current-season/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/new-senior-director-of-business-operations/",
      "email": "aparker@magnifygood.com"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/new-senior-director-of-business-operations/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.artsarasota.org/leadership",
      "email": "christina@artsarasota.org"
    },
    {
      "url": "https://www.artsarasota.org/leadership",
      "email": "info@artsarasota.org"
    },
    {
      "url": "https://www.artsarasota.org/leadership",
      "email": "youtheducation@artsarasota.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/visit/",
      "email": "museumevents@ringling.edu"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/visit/",
      "email": "groups@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/visit/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/visit/",
      "email": "lostandfound@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/exhibitions/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/sarasota-art-museum-announced-new-senior-curator/",
      "email": "aparker@magnifygood.com"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/sarasota-art-museum-announced-new-senior-curator/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://www.smccombturbitt.com/contact",
      "email": "sarah@smccombturbitt.com"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/opportunities/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://sarasotaarts.org/venue/sarasota-art-museum/",
      "email": "info@sarasota.art"
    },
    {
      "url": "https://sarasotaarts.org/venue/sarasota-art-museum/",
      "email": "info@sarasotaartmuseum.org"
    },
    {
      "url": "https://sarasotaarts.org/venue/sarasota-art-museum/",
      "email": "info@sarasotaarts.org"
    },
    {
      "url": "https://sarasotaarts.org/organization/sarasota-art-museum/",
      "email": "info@sarasota.art"
    },
    {
      "url": "https://sarasotaarts.org/organization/sarasota-art-museum/",
      "email": "info@sarasotaarts.org"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/past-programs/",
      "email": "info@sarasotaartmuseum.org"
    }
  ],
  "mails": [
    "admissions@ringling.edu",
    "aparker@magnifygood.com",
    "bboyd@ringling.edu",
    "carolyn.james@constellationculinary.com",
    "christina@artsarasota.org",
    "communications@ringling.edu",
    "elazowski@graystoneadv.com",
    "groups@sarasota.art",
    "groups@sarasotaartmuseum.org",
    "info@artsarasota.org",
    "info@honolulumuseum.org",
    "info@ringling.edu",
    "info@sarasota.art",
    "info@sarasotaartmuseum.org",
    "info@sarasotaarts.org",
    "lostandfound@sarasotaartmuseum.org",
    "lwood1@ringling.edu",
    "museumevents@ringling.edu",
    "sarah@smccombturbitt.com",
    "shop@honolulumuseum.org",
    "tbank@koyapartners.com",
    "u003etbank@koyapartners.com",
    "youtheducation@artsarasota.org"
  ],
  "nombre_sitio": "sarasotaartmuseum.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.sarasotaartmuseum.org/careers/",
      "text": "Careers - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Careers Sarasota Art Museum offers employees an opportunity to contribute to Sarasota’s thriving arts community. Sarasota Art Museum is an exciting place to work, as it is always growing and changing. We are always looking for new members of our team. Sarasota Art Museum is a division of Ringling College of Art and Design, which manages the employment application process. Your application for currently posted positions is welcome, and you are encouraged to revisit this site often for information about new opportunities. Current Job Postings View job postings at Ringling College of Art and Design Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/press-room/",
      "text": "Press Room - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Press Room For press images, press kits, or to request an interview: Please contact: Becca Boyd Museum Marketing and Communications Manager Sarasota Art Museum of Ringling College of Art and Design bboyd@ringling.edu create new email Press Releases Sarasota Art Museum Traces Four Decades of Janet Echelman’s Path-Breaking Career Sarasota Art Museum Traces Four Decades of Janet Echelman’s Path-Breaking Career ‘Radical Softness’ follows the... Read More > Sarasota Art Museum presents never-before-seen installation by Tampa native artist Selina Román Sarasota Art Museum presents never-before-seen installation by Tampa native artist Selina Román “Abstract Corpulence” blends... Read More > Sarasota Art Museum Celebrates Art Deco’s Centennial  in Upcoming Exhibition Sarasota Art Museum Celebrates Art Deco’s Centennial in Upcoming Exhibition ‘Art Deco: The Golden Age... Read More > Sarasota Art Museum to donate 650 basketballs from installation by David Huffman to local area schools and community centers Sarasota Art Museum to donate 650 basketballs from installation by David Huffman to local area... Read More > Chris Friday Creates Sanctuaries of Nostalgia and Rest from the Modern World in Mixed Media Exhibition Chris Friday Creates Sanctuaries of Nostalgia and Rest from the Modern World in Mixed Media... Read More > Artist Lillian Blades invites visitors into an immersive labyrinth of veils and reflection at Sarasota Art Museum, beginning June 1 Artist Lillian Blades invites visitors into an immersive labyrinth of veils and reflection at Sarasota... Read More > Sarasota Art Museum Announces its  2025-2026 Season Exhibition Schedule Sarasota Art Museum Announces its 2025-2026 Season Exhibition Schedule Upcoming exhibitions feature works by internationally... Read More > Sarasota Art Museum Brings Gee’s Bend Quilts  and Paulson Fontaine Press Prints to Sarasota for the First Time Sarasota Art Museum Brings Gee’s Bend Quilts and Paulson Fontaine Press Prints to Sarasota for... Read More > Sarasota Art Museum Presents Future Now: Virtual Sneakers to Cutting-Edge Kicks as part of National Tour Sarasota Art Museum Presents Future Now: Virtual Sneakers to Cutting-Edge Kicks as part of National... Read More > Artist Joe Fig Debuts New Works in Exhibition that Records One of the Largest Gatherings of Vermeer Paintings to Date Artist Joe Fig Debuts New Works in Exhibition that Records One of the Largest Gatherings... Read More > Creative couple’s work presented together for first time in ‘Larry Fink / Martha Posner: Flesh and Bone’ Creative couple’s work presented together for first time in ‘Larry Fink / Martha Posner: Flesh... Read More > Sarasota Art Museum Commissions Amalgam, a New Site-Specific Installation by Renowned Ceramic Artist and Designer Molly Hatch Sarasota Art Museum Commissions Amalgam, a New Site-Specific Installation by Renowned Ceramic Artist and Designer... Read More > Hermitage Artist Ted Riederer Returns to Sarasota Art Museum Hermitage Artist Ted Riederer Returns to Sarasota Art Museum June 3-9 to Create Additional Vinyl... Read More > Sarasota Art Museum Announces 2024/2025 Season Exhibition Schedule Sarasota Art Museum Announces 2024/2025 Season Exhibition Schedule Upcoming exhibitions feature contemporary art by local,... Read More > Take Art Classes Where Art Lives Take Art Classes Where Art Lives Adult Art Classes Available at The Studios at SAM... Read More > Florida Hurricanes Inspire Sarasota Art Museum Fall Exhibition Featuring Judy Pfaff Florida Hurricanes Inspire Sarasota Art Museum Fall Exhibition Featuring Judy Pfaff The monumental installation marks... Read More > Juana Valdés: Embodied Memories, Ancestral Histories at Sarasota Art Museum Features Powerful Works Anchored in Historical and Personal Narratives Juana Valdés: Embodied Memories, Ancestral Histories at Sarasota Art Museum Features Powerful Works Anchored in... Read More > Selection of Exquisite and Boldly Shaped World-Class Glasswork by 16 Renowned International Artists Featured at Sarasota Art Museum Selection of Exquisite and Boldly Shaped World-Class Glasswork by 16 Renowned International Artists Featured at... Read More > Sarasota Art Museum Creates Multimedia Educational Resources Through IMLS Grant Sarasota Art Museum Creates Multimedia Educational Resources Through IMLS Grant New INSIDE OUT: Educator and... Read More > Sarasota Art Museum Announces 2023/2024 Season Exhibition Schedule Sarasota Art Museum Announces 2023/2024 Season Exhibition Schedule Visitors are invited to experience new installation... Read More > Sarasota Art Museum Announces 2023-2024 Teen Arts Council Class Sarasota Art Museum Announces 2023-2024 Teen Arts Council Class July 27, 2023 SARASOTA, Fla. (July... Read More > Sarasota Art Museum to Present Immersive Installation by Carlos Bunga This Summer Sarasota Art Museum to Present Immersive Installation by Carlos Bunga This Summer July 13, 2022... Read More > Call to Artists Announced for Tampa Bay Area Exhibition Skyway 2024 Call to Artists Announced for Tampa Bay Area Exhibition ‘Skyway 2024: A Contemporary Collaboration’ Exhibition... Read More > Chakaia Booker: Surface Pressure at Sarasota Art Museum Explores Sociocultural Themes Through a Diverse Range of Materials Chakaia Booker: Surface Pressure at Sarasota Art Museum Explores Sociocultural Themes Through a Diverse Range... Read More > Sarasota Art Museum Continues Participation in Blue Star Museums Program Sarasota Art Museum Continues Participation in Blue Star Museums Program May 18, 2023 SARASOTA, Fla.... Read More > Sarasota Art Museum Presents A Beautiful Mess: Weavers & Knotters of the Vanguard Sarasota Art Museum Presents A Beautiful Mess: Weavers & Knotters of the Vanguard Opening Feb.... Read More > Richard Benson: The World Is Smarter Than You Are Opens Feb 5 Richard Benson: The World Is Smarter Than You Are Opens Feb. 5 at Sarasota Art... Read More > Sarasota Art Museum Announced New Senior Curator Sarasota Art Museum of Ringling College is delighted to announce that Rangsook Yoon, Ph.D, has... Read More > International Award-Winning Musical Artists Featured in Salon-Style Series Concerts International Award-Winning Musical Artists Featured in Salon-Style Series Concerts New program kicks off Nov. 5... Read More > Nationwide Art Initiative Debuts at Sarasota Art Museum Nationwide Art Initiative Debuts at Sarasota Art Museum More than 500 Community Members from Sarasota... Read More > Journeys to Places Known and Unknown – Janet Biggs and peter campus Stills from peter campus, strafe das meer: carmans river 2 and 3, 2022 Videograph.12:13 minutes,... Read More > Sarasota Art Museum Announces New Senior Director of Business Operations Sarasota Art Museum Announces New Senior Director of Business Operations August 30, 2022 Sarasota, FL... Read More > Sarasota Art Museum Announces Fall Education Programs Sarasota Art Museum Announces Fall Education Programs Registration for studio arts classes opens Aug. 16... Read More > Steven and William Ladd: Lead With a Laugh to Open Sept. 4 at Sarasota Art Museum Steven and William Ladd Welcome to Santo Poco!2018Archival board, fiber, trinkets, pins, papier-mâché, and dye60... Read More > SAM Offers Summer Teen Studios and Studio Art Programs for Adults Studios At SAM Photos: Daniel Perales Sarasota Art Museum Offers Summer Teen Studios and Studio... Read More > Sarasota Art Museum is a Blue Star Museum Sarasota Art Museum is proud to announce its participation in Blue Star Museums. Blue Star... Read More > SAM debuts First U.S. Solo Museum Exhibition by Jamaica-based Textile and Fiber Artist Katrina Coombs Sarasota Art Museum presents I M(O)ther: Threads of the Maternal Figure, the first U.S. solo... Read More > State of the Art 2020: Constructs at SAM State of the Art 2020: Constructs Comes to Sarasota Art Museum Sarasota, FL – April... Read More > Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/",
      "text": "Home - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Art Deco The Golden Age of Illustration Learn more about the exhibition Lillian Blades: Through the Veil Through October 26, 2025 Learn more about the exhibition Jillian Mayer: Slumpies Through August 19, 2026 Learn more about the exhibition Molly Hatch: Amalgam April 26, 2026 Learn more about the exhibition Inside Out View the exhibitions Barbara Banks: Worker View the exhibition online Selina Roman Abstract Corpulence Learn more about the Exhibition SHOP Inspiring gift ideas SHOP + Sarasota Art Museum Find it here JAZZ THURSDAYS AT SAM Join us  Second Thursdays from 5:30 pm – 8 pm for music and drinks on the Marcy & Michael Klein Plaza, and art in the galleries. Join us for Jazz PROGRAMS Learn more about our upcoming programs Join us for new Weekly programs View programs Bistro Open Daily 9 am-3 pm Saturday and Sunday Brunch (941) 330-9881 opens phone dialer Bistro offers a gourmet selection of light fares, including sandwiches, soups, specialty coffees, and desserts. View Bistro Menu SHOP Mon-Sat 10 am-5 pm Sun 11 am-5 pm (941) 309-4346 opens phone dialer Museum Members receive a 10% discount in the Shop and invitations to exclusive events. Your purchases support the Museum’s programs and exhibitions. Shop Online Our Members get more. Not yet a Member? Become a Member today and receive free admission, discounts in the Museum SHOP and Bistro. Become a Member Home Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Showcasing 100 rare posters along with sculptures, cocktail shakers, and furniture pieces, this exciting exhibition celebrates the centennial anniversary of Art Deco and the artistic significance it brought to the early 20th-century. Learn more about this exhibition A. M. Cassandre, L'Intransigeant , 1925. Collection of the Crouse Family. Image credit: Courtesy of Poster House. Selina Román: Abstract Corpulence August 31–March 29, 2026 Selina Román blends photography, abstraction, and self-portraiture to explore themes of beauty and the politics of size. Roman’s photographs transform the gallery into a space of quiet resistance, subverting traditional ideas of feminine beauty. Learn more about this exhibition Selina Román (American, 1978). Blockhead 1 , 2025. Dye sublimation on aluminum, 40 x 50 in. Courtesy of the artist. Lillian Blades: Through the Veil June 1–October 26, 2025 Blades invites visitors to enter, wander through, and lose themselves within an immersive maze of mixed-media “veils.”  These radiant tapestries suspended from the ceiling shimmer with reflective surfaces, activating the space with bouncing light and color. Learn more about this exhibition Visitors viewing Lillian Blades: Through the Veil , June 1-October 26, 2025, Sarasota Art Museum. Photo by Harry Sayer. Jillian Mayer: Slumpies May 4, 2025–August 19, 2026 Mayer explores the impact of technology on the human body through this interactive sculpture series. Slumpies invites viewers to sit and slump on these sculptures, much like furniture, and find a place of comfort while using their technological devices. Learn more about this exhibition Jillian Mayer. Slumpie 75-Work Desk 4 Lefties , 2025. Fiberglass, epoxy, found foam, hardware, polyurethane elastomer, 87 x 85 x 43 in. Installation view of Slumpies at Sarasota Art Museum, Sarasota, Florida, 2025. Photo: Ryan Gamma. Molly Hatch: Amalgam April 25, 2024–April 26, 2026 Hatch’s newly commissioned “plate painting,” Amalgam (2023), was created specifically for Sarasota Art Museum. Consisting of more than 450 earthenware plates hand-painted in white, blue, and gold luster, the abstract lines and shapes in Amalgam are drawn from a variety of historical ceramics from around the globe. Learn more about this exhibition Molly Hatch (American, born 1978). Amalgam (detail), 2023-24. Ceramic, 220 in. x 324 in. Courtesy of the artist. Photo: John Polak. Molly Hatch Staccato 2017/2022 Ceramic 40 x 270 in. Courtesy of the artist and Todd Merrill Studio Christian Sampson, Vita In Motu (2019) Photo: Coke Wisdom O'Neal Molly Hatch (American, born 1978). Installation view of Amalgam at Sarasota Art Museum, Sarasota, Florida, 2024. Ceramic. Courtesy of the artist. Photo: John Polak. Installation image of Chakaia Booker (American, born 1953). Square Peg, 2003. Rubber tires, wood, and steel at Sarasota Art Museum Inside Out invites you to discover works of art throughout our Museum Campus, in addition to those showcased through rotating exhibitions in our galleries. Inside Out Artists Jose Alvarez (D.O.P.A), Coming Together Claire Ashley, Chromatic Blush: Wee Bairn John Clement, Shazam Samo Davis, Happiness in ROYGBIV Molly Hatch, Staccato John Henry, Complexus Jillian Mayer, Slumpies Olivier Mosset, Untitled Leah Rosenberg, 28 Colors Christian Sampson, Vita in Motu Learn more about Inside Out MORE ABOUT CURRENT EXHIBITIONS Next Janet Echelman: Radical Softness November 16–April 26, 2026 Experience an intimate look at award-winning and internationally recognized artist Janet Echelman’s artistic evolution, from early explorations in drawing, painting, and textiles to the monumental netted sculptures that have redefined public spaces around the world. Learn more about this exhibition Janet Echelman (American). Study (Butterfly Rest Stop 1/9 scale) , Rome, Italy, 2022. Courtesy of the artist. Photo: Giovanni DeAngelis. Something Borrowed, Something New April 19, 2026–September 27, 2026 Featuring works by such acclaimed modern and contemporary artists as Louise Bourgeois, Chuck Close, Yoko Ono, David Hockney, Ai Weiwei, and more, this never-before-seen exhibition offers a rare glimpse into private collections held throughout Southwest Florida. Learn more about this exhibition William Villalongo (American, born 1975). Mother Tongue , 2020. Acrylic, cut velour paper and pigment print collage, 40 x 40 in. (sheet); 44 ⅛ x 43 ⅜ in. (frame). Courtesy of ©Villalongo Studio LLC and Susan Inglett Gallery, NYC Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Maria A. Guzmán Capron explores the complexities of identity through vibrant figurative textiles. Drawing inspiration from her own multicultural heritage, the artist creates layered portraits of exuberant, multi-faceted characters in this new solo exhibition. Learn more about this exhibition Maria A. Guzmán Capron. Eros , 2022. Fabric, thread, batting, stuffing, spray paint and acrylic paint, 81 x 87 x 1 1/2 in. Courtesy of the artist and Nazarian / Curcio. Beautiful Ideas: The Prints of Sol LeWitt May 17–October 25, 2026 Regarded as one of the founders of both minimalism and conceptual art, Sol LeWitt (1928-2007) is best known for his large-scale wall drawings and modular structures. Alongside these works, LeWitt generated more than 350 print projects during his 40-year artistic career, including thousands of lithographs, silkscreens, etchings, aquatints, woodcuts, and linocuts. Learn more about this exhibition Sol LeWitt (1928-2007). Loopy Doopy, Blue/Red , 2000. Oil-based woodcut. 20 5/8 × 28 5/8 in. (52.3 × 72.6 cm). New Britain Museum of American Art, Gift of Sol LeWitt. © Estate of Sol LeWitt 2025 Learn Programs Join us this season for programs that invite you to experience art and engage your senses. LEARN ABOUT CURRENT PROGRAMS P-12 School Visits Kids love art! And we love kids! Learn more about opportunities for P-12 students to learn about the art at Sarasota Art Museum. LEARN ABOUT SCHOOL VISITS The Memory Project Sarasota Art Museum has taken on stewardship of the history of the former Sarasota High School building. Learn about the history of the site and help keep the memory of the site—prior to recent transformation—alive. LEARN ABOUT THE MEMORY PROJECT About the Museum M. Leo Elliott – Former Sarasota High School Photo: Dick Dickinson Marcy & Michael Klein Plaza Photo: Ryan Gamma Anchoring the Ringling College Museum Campus, the Museum has 15,000 square feet of dedicated exhibition gallery space, Bistro, Shop, auditorium for educational events, performance and film, a sculpture courtyard and extensive grounds and facilities where one can engage with site-specific and site-responsive art experiences. PLAN YOUR VISIT LEARN MORE ABOUT THE MUSEUM Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/about/",
      "text": "About - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ M. Leo Elliott Building – Former Sarasota High School Photo: City of Sarasota About Governance & Leadership Sarasota Art Museum is governed by the Ringling College Board of Trustees with support from the Museum Advisory Committee. Museum Advisory Committee Elaine Crouse, Chair Larry Thompson, President, Ringling College of Art and Design, ex officio Virginia Shearer, Executive Director, ex officio Ravindranath Akhoury Veronica Brady Warren Colbert Linda Dickinson Dean Eisner Robert A. Essner Joe Fig William M. Kahane Michael Klein Tom Koski Flora Major Frank Martucci Mary Ann Meyer Rosemary Oberndorf Ellen Sandor Joel Schemmel Lois Stulberg John Suhler Pauline Wamsler Mission & Vision Sarasota Art Museum is a catalyst for appreciation and understanding of the art of our time. As a platform for education, exposure and experimentation, the Museum inspires new ideas and new ways of being through an endless rotation of transformative, relevant, and pioneering exhibitions and programs designed to elevate and empower all by cultivating discerning visual thinkers and ethical citizens. The Vision In 2003, a group of 13 forward-thinking Sarasotans came together to further their goal of enhancing Sarasota’s rich cultural landscape with a contemporary art museum. After a two-year dialogue with area arts, educational, and community leaders, the Sarasota Art Museum partnered with Ringling College of Art and Design to transform the historic Sarasota High School into an art museum and visual arts educational center. As the region’s first museum dedicated to contemporary art, the Museum offers visitors a place to see thought-provoking, boundary-pushing exhibitions and participate in dynamic educational programming with global thought leaders. The facility is a resource for learning about global art discourse and deepening appreciation for 20th and 21st century art and artists through exhibition gallery spaces, an auditorium, an outdoor sculpture garden, a bistro, retail store, and extensive grounds for performance, happenings, sculpture, site-specific and site-responsive installations, movement classes, and gatherings. Sarasota Art Museum is an ideal “third space” for friends and family from the community, the region, and around the world to gather, learn, be inspired, and experience the power of art to transform society. Museum Founders Dr. Richard Basch Murray Bring Brooke Callanen Linda Dickinson Koni Findlay Dottie Baer Garner Bill Hartman Christine Isaac Mark & Irene Kauffman Elaine Keating Tom Koski Flora Major John Meyer Keith Monda Kat Schuetz Wendy Surkis Lois Stulberg About the Museum M. Leo Elliott – Former Sarasota High School Photo: Dick Dickinson Marcy & Michael Klein Plaza Photo: Ryan Gamma Anchoring the Ringling College Museum Campus, the Museum has 15,000 square feet of dedicated exhibition gallery space, Bistro, Shop, auditorium for educational events, performance and film, a sculpture courtyard and extensive grounds and facilities where one can engage with site-specific and site-responsive art experiences. PLAN YOUR VISIT LEARN MORE ABOUT THE MUSEUM'S HISTORY Diversity and Inclusion at Ringling College We are a community comprised of beliefs and backgrounds from every corner of the world. That’s why we elevate, support, and empower our students, alumni, faculty, staff, and supporters to celebrate their differences in an environment of trust and respect. Art and design exists and thrives through diversity. Diversity of thought and perspective shapes cultures and conversations. It comprises the foundation on which Ringling College is built. Every member of our community adds to who we are: a dedicated, curious, quirky, and talented blend of creatives. We are relentless in our pursuit of brilliance and uncompromising in our values of diversity, equity, and inclusion. And you are welcome here. Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://aamd.org/museum-careers/current-opportunities/6609",
      "text": "Executive Director, Sarasota Art Museum | Association of Art Museum Directors Contact Us Member Login Search Current Opportunities Back to List Executive Director, Sarasota Art Museum Executive Director, Sarasota Art Museum Ringling College of Art and Design Sarasota, FL About The Sarasota Art Museum The Sarasota Art Museum is a catalyst for appreciation and understanding of the art of our time. As a platform for education, exposure and experimentation, the Museum inspires new ideas and new ways of being through an endless rotation of transformative, relevant, and pioneering exhibitions and programs designed to elevate and empower all by cultivating discerning visual thinkers and ethical citizens. About Ringling College of Art and Design Founded in 1931 and located in Sarasota, Florida, Ringling College of Art and Design is a private, not-for-profit college offering the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. Enrolling over 1,600 undergraduate students from 55 countries and 44 states, the College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The College is recognized as the most technologically advanced art college in the world and is known for its cutting-edge and innovative programs, including Virtual Reality Development, Entertainment Design, Business of Art and Design, and more. Striving to create globally aware and socially responsible leaders of art and design, the College’s teaching model ultimately shapes students into highly employable and globally aware artists and designers. In addition to the college’s main campus, the recently opened Sarasota Art Museum anchors the Ringling College Museum Campus with 20,000 square feet of exhibition gallery space plus a bistro, shop, auditorium for educational events, performance and film, a beautiful courtyard, and classrooms for the College’s Osher Lifelong Learning Institute. The Opportunity The Ringling College of Art and Design seeks a forward-thinking, innovative Executive Director who will galvanize and inspire students, faculty, community members, and the global public in an ambitious collaborative vision for the Sarasota Art Museum. Reporting directly to the President of Ringling College of Art and Design, the Executive Director will work closely with the Museum Advisory Committee (MAC) of the Board of Trustees of the College. The Ringling College Board of Trustees has ultimate governance authority over the Sarasota Art Museum (“Museum”) as a division of Ringling College, and the Museum Advisory Committee actively acts in an advisory capacity to the President and to the Ringling College Board of Trustees. The Executive Director must be an engaging leader adept at building and maintaining relationships with a wide range of constituents, including College administrators, students, faculty, community members, and donors. This individual will help to develop a distinctive national profile for the museum and will create connections with other museums, regional non-profit art organizations, and other contemporary art institutions. Working with the President and the Museum Advisory Committee, the Executive Director will further develop and articulate a vision for the Museum to a variety of constituencies. The Executive Director must understand and promote the Museum’s role in the academic mission of the College, as well as the College’s wider public charge. Toward that end, the Executive Director must be able to leverage the profile of the Museum to engage its constituency more deeply with the Museum and the College as a whole. The Executive Director must have a deep commitment to and understanding of diversity – in all dimensions – as a force for academic and artistic excellence and as a deeply held commitment at the heart of the institution’s mission. Specifically, the next Executive Director will: • Develop and implement a strong collaborative vision that connects the Museum both to Ringling College and to the broader community and global issues by: • overseeing the development and implementation of innovative education initiatives that integrate the Museum into the community and the College. • overseeing the creation of public programs that will appeal to and foster new connections with a wide range of diverse audiences. Serve as the Museum’s chief liaison with the college and global community, ensuring that the Museum’s impact is felt locally, internationally, and campus-wide by: • engaging with campus partners to integrate the Museum into the mission of Ringling College. • developing local, national, and global networks and partnerships to ensure that the Museum’s impact reaches beyond the campus of Ringling College. • collaborating with the College’s advancement leadership and team members in developing and stewarding strong relationships with donors, and working with the Museum Advisory Committee to advance the mission and goals of the Museum. • working closely with the College’s internal and external communications staff for all marketing and public relations. • serving as primary spokesperson for the Museum. Manage the operational and administrative duties for the Museum in close collaboration and partnership with the College by: • fostering a collaborative and supportive working environment focused on inclusion, innovation, growth, and personal and professional development. • overseeing the day-to-day public operation of the Museum to ensure quality and efficiency. • working with the College’s Office of Human Resources to determine personnel needs and hiring of staff. • managing budgets and grants and working closely with the College’s finance teams to ensure effective development of and adherence to all programming and operational budgets. • taking an active role supporting efforts by the College’s Advancement Office to develop annual revenue streams and enduring endowments to ensure the financial stability of the museum. Candidate Profile The next Executive Director of the Sarasota Art Museum will be a persuasive and creative leader who is inspired by the unique mission of a contemporary art museum embedded in a premiere art and design college.  Top candidates will demonstrate evidence of progressively increasing organizational leadership within complex environments where relationship building and influencing skills are key to success. Ringling College seeks candidates with leadership experience in an art museum setting, arts institution, or similar organization, with a record of strong institutional and financial management. Other key qualities include a talent and enthusiasm for outreach and collaboration, and a commitment to diversity and inclusion.  A bachelor’s degree in art, art history, or other relevant field or research area is required, and an advanced degree or equivalent professional and leadership experience in a comparable setting is preferred. The ideal candidate should possess the following leadership competencies, professional expertise, and personal qualities: Strategic and Visionary Leader The Executive Director will be a dynamic and charismatic leader with an entrepreneurial and enthusiastic spirit, and the ability to: (1) develop a compelling and captivating vision for the Museum, (2) partner with colleagues at the College and members of the broader community, and (3) serve as a visible and effective advocate for the critical role that the arts play in the overall educational and community service mission of the College. This individual must be a proven strategic thinker with the foresight, capacity, and experience to understand and balance complex and discrete needs. This person must be capable of providing stability and confidence when faced with important and quickly changing circumstances.  The Executive Director will be a consultative thought-leader within the College and the arts community. Mission Fit and Expertise The Executive Director will have a passion for art and an appreciation for the creative process. They will possess a dedication and enthusiasm for education at all levels.  The Executive Director must have an appreciation for the unique role of a College-based museum serving the wider public, and will understand and cultivate collaborative opportunities within an academic community. The Executive Director will help set the vision for compelling exhibitions, programs, and publications that expand audience engagement. The next leader will have a solid grasp and keen awareness of national and international trends and best practices in art museums and within the broader art world. Development and Fundraising The Executive Director will have knowledge of fundraising as well as cultivation and stewardship of donors.  They must be able to build strong relationships within the greater community, with current and potential donors, and with the advisory board. This leader will have substantial knowledge and experience with various fundraising and communications channels, including major gifts and capital campaigns, foundations, and corporations, and the ability to provide high-touch engagement with all of the Museum’s and College’s constituents. Business Acumen and Operational Expertise The Executive Director will have a strong record of successful oversight and management of finance and operations. This person will promote a culture of excellence and high-quality execution at all levels within the institution, providing outstanding stewardship for the Museum. Highly skilled in budget, financial, and personnel management, this individual will have the perspective to work with the appropriate College office to consider the impact of decisions, strategic plans or initiatives, and programs on the organization, and to make sound recommendations accordingly. Skilled and Inspirational Manager The Executive Director will be a decisive, results-driven leader with a collegial, team-oriented working style, open and nimble in adjusting to emerging needs or shifting priorities. This individual will have a proven record of visible and effective leadership and management, and the demonstrated ability to professionally develop, nurture, motivate, and retain a strong team that is focused on impact, excellence, accountability, and efficiency. This person must understand the subtleties of motivating and directing, as well as delegating, handling, and prioritizing multiple activities and responsibilities.  A practiced leader and advocate, the Executive Director will possess the ability to negotiate graciously and diplomatically, while remaining decisive, proactive, and fair.  An unpretentious individual of high integrity, the Executive Director will possess good judgment and will be a motivator, able to inspire a shared vision, quality performance, and strong morale, empowering and cultivating staff through communication, feedback, and delegation, while actively promoting teamwork and collaboration. External Relations and Relationship-Building The Executive Director will have a compelling public presence and will be skilled at developing, building, and sustaining excellent relationships. This person will have a demonstrated ability to connect with and build bridges among the various stakeholders within and across the College’s environment, including faculty, administrators, students, the Museum Advisory Committee, major donors, and members of the community. The Executive Director will have excellent written and verbal communication skills and the facility to connect effectively with audiences of varying levels of expertise. This individual will have the capacity to serve as an active and sensitive listener, and to thrive as the Sarasota Art Museum at Ringling College’s foremost champion, persuading stakeholders to support and advance the Museum’s mission.  This person will also be a charismatic connector, collaborator, and bridge-builder with ability to engage with and gain buy-in from diverse stakeholders around their vision for the Museum. Other Characteristics The Executive Director will have a high level of emotional intelligence and be a humble, flexible leader with a sense of humor. Intellectually and artistically curious, the next leader will be able to break down silos and work collegially, building connections across teams, divisions, campus constituents, and community. Compensation & Benefits Compensation and benefits are competitive and commensurate with experience. Contact Naree Viner and Tenley Bank of Koya Partners have been exclusively retained for this search. To express your interest in this role please submit your materials here or email Tenley directly at tbank@koyapartners.com . All inquiries and discussions will be considered strictly confidential. The Sarasota Art Museum at Ringling College of Art and Design is an equal opportunity employer and strongly encourages applications from people of color, persons with disabilities, women, and LGBTQ+ applicants. Ringling College’s campus community is a diverse blend of people, ideas and creativity. From its students to the faculty, staff, alumni, and friends that support them, the College offers an intimate environment for learning. Ringling College of Art and Design recognizes that creatives play a significant role in society. The College’s primary mission is to provide programs leading to degrees that prepare students to be discerning visual thinkers and ethical practitioners in their chosen area of art and design. About Koya Partners Koya Partners, a part of the Diversified Search Group, is a leading executive search and strategic advising firm dedicated to connecting exceptionally talented people with mission-driven clients. Our founding philosophy—The Right Person in the Right Place Can Change the World—guides our work as we partner with nonprofits & NGOs, institutions of higher education, responsible businesses, and social enterprises in local communities and around the world. For more information about Koya Partners, visit www.koyapartners.com . About this Job Ringling College of Art and Design Sarasota , FL Category: Professional Salary Range: - Posted: April 28, 2021 Share this Page Twitter Facebook Copyright © 2025 Association of Art Museum Directors Contact Us / Terms of Use Facebook / Twitter"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/frequently-asked-questions/",
      "text": "FAQ - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Wendy G. Surkis & Peppi Elona Lobby Photo by Ryan Gamma Frequently Asked Questions General What is Sarasota Art Museum? Sarasota Art Museum of Ringling College is a contemporary art museum known as a kunsthalle (an art museum without a permanent collection). Does Sarasota Art Museum have a permanent collection? No. What are the Museum's admission prices? Discounts? Free days? Sarasota Art Museum’s general admission for adults is $20.00. Free Second Sundays at SAM are the Second Sunday of every month. Additional information is available on our Visit page. Click here to go to our Visit page. What is the schedule of future exhibitions? The schedule for future exhibitions will be available under the Exhibitions “NEXT” section. Click here to visit the “NEXT” page . What are the dining amenities in Sarasota Art Museum? Shopping? The Bistro is located in the Paul Rudolph building. To learn more about Bistro, visit their page here . SHOP is located within the Elliott building. To learn more about the SHOP, visit their website here . What are the Museum hours? Click here to view our current hours on our Visit page. Where should I park when visiting the Museum? Parking is available to the south of the Museum campus. Are food and drink allowed in the Museum? Food and drink are not permitted in the galleries. May I take photographs in the Museum? Can I use my cell phone? Photography and videography is permitted for personal, noncommercial use at SAM within public indoor and outdoor spaces and most exhibitions. Visitors are welcome and encouraged to take personal photos and video of their SAM experience to share via social media. Exceptions may apply for special exhibitions based on artist copyrights. To protect our art on view, the use of flash photography, selfie sticks, tripod, or drones, is not permitted on the Museum campus. Professional and commercial videography and photography is prohibited without a permit. For inquires about commercial videography and photography pricing and permit details, please email MuseumEvents@ringling.edu create new email . What should visitors keep in mind for visiting Sarasota Art Museum? Information about visiting Sarasota Art Museum is located on our Visit page. Click here to go to the Visit page. Does Sarasota Art Museum offer tours? Groups of ten or more (including P-12 school tour requests) must schedule in advance by contacting our Visitor Experience Team at 941.309.4300 or emailing: groups@sarasota.art create new email Membership How do I become a Member? Sarasota Art Museum has varying levels of membership. Click here to visit our Membership page to learn more. When will my membership expire? When you join the Museum, your Membership is valid for a year from purchase date. Are there reciprocal member privileges with other museums or local attractions? Yes, the Museum partners with Mod/Co, which encompasses 85+ museums within the US and Canada. If you are not a part of this program, this program is part of Sarasota Art Museum’s Supporter level membership and above. Click here to see which 85+ museums participate in Mod/Co. opens  PDF  file I’m a snowbird, can I freeze my membership when I am out of town? We cannot freeze memberships. Can I give my member card to my neighbor, friend etc.? Memberships are non-transferable. When you arrive at the Museum, you will need to show a valid ID and your member card for entry. Can I change my membership level? Yes, you can upgrade your membership at any point. Simply call our membership office or visit our reception desk to change your membership level. How do I get guest passes? Guest passes are allotted to Supporter Membership levels and above. Guest passes will be mailed along with your Membership cards. They cannot be replaced if lost or stolen so keep them in a safe place. What happens when I use all my guest passes? Once you have exhausted your guest passes for the year, guests will be admitted at the General Admission price. What if I lose my member card? Lost member cards are replaced at a cost of $5. This can be replaced at the reception desk. Events Can I rent space in the Museum for a private event? Yes, we would love to help you host your perfect event at the Sarasota Art Museum. Please contact Laura Stuart Wood at lwood1@ringling.edu create new email if you are interested in hosting an event at the Museum. Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/school-tours/",
      "text": "School Tours - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ School Tours at Sarasota Art Museum Students & Teachers, Welcome to Sarasota Art Museum! Bring your students for a Museum visit, free of charge! Sarasota Art Museum’s school tour program is designed to integrate visual art into the classroom and enhance student literacy, critical thinking, observation, and communication skills through museum visits, and classroom resources. School tours introduce students to original works of contemporary art, a range of media and processes, and related vocabulary to broaden students’ understanding of artistic concepts, increase comprehension of visual vocabulary, develop art-making skills, and build student self-confidence and communication skills. School Tour Details Registration is required for both guided and high school self-guided tours. Guided tours last about 60 minutes and are offered on Tuesdays and Thursdays from 10 am to 12 pm. Self-guided visits can be as long as you’d like and are offered any day of the week, beginning at 10 am. One adult chaperone per 10 students is required . Chaperones receive free admission and must remain with their group for the entire visit. School Tour Availability Guided tours are free for school groups. Reservations must be made at least three weeks in advance. Guided tours are a 60-minute tour led by a Museum Guide including interactive activities in the galleries. Self-guided tours are free for school groups, with registration made at least two weeks in advance. We invite you to explore the Museum on the day of your choosing and at your own pace. Self-guided tours can be as long as you’d like! Take a deep dive and spend the day on campus visiting our galleries, SHOP, and Bistro, or pop-in to check out your favorite pieces with your students. About School Tours Observe, discuss, and connect! Contemporary artists often use unconventional methods, media, and messages to push traditional art forms’ boundaries. With all three of our Guided School Tours, your students will learn to look at and appreciate the art of our time. During your visit your students are encouraged to observe closely and think critically, so they can express their ideas confidently and creatively about any work of art. Tours are designed to support your work in the classroom by developing students’ visual literacy and critical thinking skills through collective reflection and interpretation. We have also designed a series of resources to accompany your tour – the Inside Out Videos and Educator Guides – to engage your students before and after your visit. Our resources are carefully designed to inspire curiosity, imagination, and understanding, as well as cultivate in our young learners an appreciation for contemporary art. Join us for a conversational tour. CREATION TOUR (K-12) (10 am and 11 am tour, Tuesdays or Thursdays) (OFFERED DURING THE SCHOOL YEAR) Students will use visual thinking routines incorporating mindfulness and movement to observe and interact with the art. Students will practice reasoning skills, putting their thoughts and reflections into words by sharing in the group conversation. They will also take time to reflect and sketch, accessing their imaginations to create their own interpretation of the art. Students will acquire new vocabulary to help them express their ideas fluently when describing and reflecting on works of art. Incorporates Visual Arts and English Language Arts standards. Creation Lab Educator Resources ARCHITECTURE TOUR (K-12) (10 am and 11 am tour, Tuesdays or Thursdays) (OFFERED DURING THE SCHOOL YEAR) Students will observe the building, the space and the art in the space in order to make spatial reasoning connections in the museum. They will learn how the art relates to the space in terms of dimensions, color, and light. Students will use visual thinking routines that incorporate mindfulness, slow looking, and sketching in order to process what they observe. They will practice making observations, asking questions, and making inferences as part of the group discussion. Students will acquire new vocabulary to help them express their ideas fluently when describing and reflecting on works of art. Incorporates Visual Arts, Mathematics and Science standards. Architecture Lab Educator Resources DISCOVERY TOUR (K-12) (10 am and 11 am tour, Tuesdays or Thursdays) (OFFERED DURING THE SCHOOL YEAR) Students will explore the elements of art via observable properties such as line, color, shape, weight, and texture while also practicing numeric operations and geometrical reasoning. For grades K – 5, students will learn properties of matter. For grades 6 – 12, students will practice making observations and inferences verbally and in written form. All students will acquire new vocabulary to help them express their ideas fluently when describing and reflecting on works of art. Incorporates Visual Arts, Mathematics and Science standards. Discovery Lab Educator Resources How to Book Your School Tour We’re excited to welcome your group to the Museum! Please be aware our tours have limited capacities. Reservations are required for all school visits and must be made at least three weeks in advance, pending availability. For more information, contact Group Services at 941-309-4300 or email: Groups@SarasotaArtMuseum.org create new email (Monday through Friday between 10 am and 5 pm) or submit your booking form below. Sign up for a School Tour High School Self-Guided Tours Self-Guided Tours We welcome you to explore the Museum on your own as well! We have resources available and activities to do both at the Museum and at home to supplement your visit. School Tour Guidelines For more information about what to expect and what to know before you go, download our comprehensive School Tour Guidelines below. Download School Tour Guidelines opens  PDF  file Lunch Options If you would like to stay for lunch, please plan to bring bagged lunches and enjoy lunch picnic-style on the Great Lawn with your own blankets. Lunches can be brought to the Museum lobby and stored until your lunch break. If you would like to order lunch from the Museum’s Bistro, please contact Carolyn James, Catering Manager, at Carolyn.James@ConstellationCulinary.com create new email Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.ringling.edu/about/community-programs/sarasota-art-museum/",
      "text": "Sarasota Art Museum - A Contemporary Art Museum Skip to main content Instagram Facebook Youtube Resources Parents and Families Student Resources Faculty and Staff Resources Galleries Museum Close Search search Menu Academics Majors Business of Art and Design Computer Animation Creative Writing Entertainment Design Film Fine Arts Game Art Graphic Design Illustration Motion Design Photography and Imaging Virtual Reality Development Visual Studies Enhance Your Education Minors and Certificates Liberal Arts First Year Studio Program INDEX: Industry Experience Domestic Opportunities International Opportunities Fulbright Program Campus Resources Library Technology Explore Our Facilities Faculty Studio Labs AI at Ringling Important Links PreCollege Student Stories Alumni Spotlight Academic Calendar Admissions Apply Admission Requirements Portfolio Prep Important Dates International Students Next Steps After Acceptance Financial Aid and Tuition Financial Aid Opportunities Tuition Scholarships & Grants Loans Student Employment Requirements & Policies Visit Campus Daily Tours Virtual Tour Online Information Sessions Open House Accepted Student Day National Portfolio Day Important Links Connect With Admissions Request Information Plan a Visit Apply Campus Life Living on Campus Campus Housing Campus Dining Living in Sarasota Campus Virtual Tour Madeby Gallery Beyond the Classroom Activities and Leadership Volunteer Opportunities Varsity Esports Diversity at Ringling Student Support Services Advising, Records, and Registration Center for Student Success Student Access Services Student Learning Services Health Services Public Safety International Affairs Military / Veteran Services Important Links Visit Campus Campus Virtual Tour Career Support Outcomes From Campus to Career What can you do with an Art Degree? Career Services Center for Career Services Career Resources Career Events Employers and Recruiters College Central Alumni Resources Benefits and Services Alumni Visiting Campus Keep in Touch Alumni Events Important Links INDEX: Industry Experience Connect with Career Services About About Us History Awards and Rankings Diversity at Ringling Sustainability Community Programs Continuing and Professional Studies Teen Programs Innovation Workshops Sarasota Art Museum Galleries and Exhibitions Osher Lifelong Learning Institute Town Hall Speaker Series Englewood Art Center Kadenze Online Learning People Offices and Departments Leadership and Administration Faculty Employment Opportunities Parent Ambassadors Alumni News & Events News Alerts Publications Fast Facts Giving Request Info Apply search Sarasota Art Museum Ringling College’s dynamic laboratory for the exploration of contemporary art Sarasota Art Museum offers thought-provoking exhibitions and education programs that start conversations and amplify the city’s creative spirit. As Sarasota’s only museum focused solely on contemporary artists and their work, the Museum features a constant rotation of exhibitions, site-specific installations, and artist commissions. Committed to Building Community With no permanent collection and expansive, cathedral-like spaces to host rotating exhibitions, the Museum provides contemporary artists unique opportunities to launch new works, collaborate, and engage with audiences. In addition to 15,000 square feet of dedicated exhibition and gallery space, the Museum offers unparalleled opportunities for Ringling College students and alumni, and students of all ages from the community to explore the visual arts through multi-session classes and drop-in artmaking opportunities like Saturday Studios and Your Wednesday Playdate. The Museum is home to a robust portfolio of education programs, including the Osher Lifelong Learning Institute (OLLI) at Ringling College, which offers a variety of courses and events for adult learners, and The Studios at SAM. Contact Sarasota Art Museum 1001 Tamiami Trail Sarasota, FL 34236 941-309-4300 info@sarasota.art Visit Website “ Sarasota Art Museum is Ringling College of Art and Design’s contemporary and teaching art museum and serves as a catalyst for appreciation and understanding of the art of our time. As a platform for education, exposure, and experimentation, the mission and vision of the Museum is to inspire new ideas and new ways of being through an endless rotation of transformative, relevant, and pioneering exhibitions and programs designed to elevate and empower all by cultivating discerning visual thinkers and ethical citizens. ” Dr. Larry R. Thompson, President of Ringling College of Art and Design Ringling College of Art and Design Sarasota Art Museum Recent News See All News Sarasota Art Museum Fine Arts and Photography and Imaging faculty featured in Sarasota Art Museum solo exhibition Faculty & Staff Fine Arts Photography Sarasota Art Museum Fine Arts and Photography and Imaging faculty featured in Sarasota Art Museum solo exhibition August 22, 2025 Ringling College Department Head Joe Fig featured on CBS spotlight for Vermeer-inspired exhibition Faculty & Staff Fine Arts Sarasota Art Museum Visual Studies Ringling College Department Head Joe Fig featured on CBS spotlight for Vermeer-inspired exhibition July 15, 2025 Sarasota Art Museum to donate 650 basketballs from installation by David Huffman to local area schools and community centers Sarasota Art Museum Sarasota Art Museum to donate 650 basketballs from installation by David Huffman to local area schools and community centers July 11, 2025 Juneteenth resources and events within our community Alfred R. Goldstein Library Sarasota Art Museum Juneteenth resources and events within our community June 17, 2025 Chris Friday featured on WUSF podcast in talk about food depictions in her SAM exhibit Sarasota Art Museum Chris Friday featured on WUSF podcast in talk about food depictions in her SAM exhibit June 12, 2025 See All News Why Choose Ringling? Get to know Ringling College of Art and Design Ringling College of Art and Design educates students, its community, and the world to understand art and creativity as essential dimensions to life. About Ringling Plan a Visit Our Majors Learn about each of our 13 creative disciplines. Student Life Find yourself—and your community. News & Events Stay up-to-date with whats happening on campus. Also of Interest Sarasota Art Museum Founders Documentary Sarasota Art Museum enriches culture and... Sarasota Art Museum and Ringling College... RCAD_Logo_SolidWhite_2023 Ringling College of Art and Design 2700 N. Tamiami Trail Sarasota, FL 34234 Contact: info@ringling.edu 941-351-5100 Office Hours: M-F 8:30 am-4:30 pm EST instagram facebook youtube tiktok linkedin x-twitter Information Request Info Campus Map Virtual Tour Admissions Apply News Giving Our Publications Bookstore Corporate About Us Transcripts and Degree Verification Policies and Procedures Public Safety Employment Opportunities Consumer Information Web Accessibility Title IX Reporting HEERF Reporting EASE Grant Performance Measures Get in Touch We’re happy to answer any questions you may have. Admissions Questions (applying, portfolio, transfers, deadlines, events) admissions@ringling.edu General Questions info@ringling.edu Media Inquiries communications@ringling.edu Web Accessibility Inquiries communications@ringling.edu © 2025 Ringling College of Art and Design. All Rights Reserved. Close Menu Academics Majors Business of Art and Design Computer Animation Creative Writing Entertainment Design Film Fine Arts Game Art Graphic Design Illustration Motion Design Photography and Imaging Virtual Reality Development Visual Studies Enhance Your Education Minors and Certificates Liberal Arts First Year Studio Program INDEX: Industry Experience Domestic Opportunities International Opportunities Fulbright Program Campus Resources Library Technology Explore Our Facilities Faculty Studio Labs AI at Ringling Important Links PreCollege Student Stories Alumni Spotlight Academic Calendar Admissions Apply Admission Requirements Portfolio Prep Important Dates International Students Next Steps After Acceptance Financial Aid and Tuition Financial Aid Opportunities Tuition Scholarships & Grants Loans Student Employment Requirements & Policies Visit Campus Daily Tours Virtual Tour Online Information Sessions Open House Accepted Student Day National Portfolio Day Important Links Connect With Admissions Request Information Plan a Visit Apply Campus Life Living on Campus Campus Housing Campus Dining Living in Sarasota Campus Virtual Tour Madeby Gallery Beyond the Classroom Activities and Leadership Volunteer Opportunities Varsity Esports Diversity at Ringling Student Support Services Advising, Records, and Registration Center for Student Success Student Access Services Student Learning Services Health Services Public Safety International Affairs Military / Veteran Services Important Links Visit Campus Campus Virtual Tour Career Support Outcomes From Campus to Career What can you do with an Art Degree? Career Services Center for Career Services Career Resources Career Events Employers and Recruiters College Central Alumni Resources Benefits and Services Alumni Visiting Campus Keep in Touch Alumni Events Important Links INDEX: Industry Experience Connect with Career Services About About Us History Awards and Rankings Diversity at Ringling Sustainability Community Programs Continuing and Professional Studies Teen Programs Innovation Workshops Sarasota Art Museum Galleries and Exhibitions Osher Lifelong Learning Institute Town Hall Speaker Series Englewood Art Center Kadenze Online Learning People Offices and Departments Leadership and Administration Faculty Employment Opportunities Parent Ambassadors Alumni News & Events News Alerts Publications Fast Facts Giving Request Info Apply Instagram Facebook Youtube Resources Parents and Families Student Resources Faculty and Staff Resources Galleries Museum twitter x-twitter facebook linkedin youtube instagram tiktok Parent Ambassadors Inquiry Form Parent/Guardian Name (Required) First Last Parent/Guardian Email (Required) Address Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Mobile Phone Student Name (Required) First Last Major Year of Graduation Please check any area(s) you are interested in being involved with Campus Events Events in your city Advancement Career Services Other If other, please list below: × FIELD1 FIELD2 INFO CAREER INSIGHT 2025 - TABLE HOSTS 1:00pm to 4:00pm in the Library Blue designates Ringling Alumni at the Table Company Description/Title Name(s), Website 22squared VP, Creative Director - JR began his career working out of the BBDO offices, in both San Francisco and Los Angeles, building campaigns for Visa, Pioneer Electronics, Mitsubishi, and California Lottery. His creative talents added to long-running campaigns like QSR Jack in the Box and Red Bull. His work has been recognized by D&AD, the London International Awards, the Emmys, and the Effies. At 22squared, he mentors junior creatives and serves on the Diversity and Inclusion Council. Jason \"JR\" Roberts Jason Roberts Work , 22squared AAF Suncoast President of AAF Suncoast Selina Bostic AAF Suncoast Arsenal Entertainment Group Over 25 years of experience in the creative and entertainment industry. A graphic designer and entrepreneur with expertise in corporate branding, digital design, and print media. Former Senior Designer with the CIA, working with clients like U.S. Space Force, Walt Disney World, and Universal Studios Orlando. Tim Oliver Arsenal Entertainment Group BUCK Senior Designer, Children’s book illustrator, Editorial illustrator Jamiel Law BUCK Centripetale Product Design Principal Miguel E. Elasmar Centripetale Product Design Cirkul Design Manager Barry Klipp Cirkul Creative Education Foundation Fun Maker, Conference Coordinator, and Logistics, Creative, Cinephile Roseanne Avella Creative Education Foundation Creative Expressions On file Leia Madden Epic Games Academic Advisor Luis Cataldi Epic Games EPSILON RETAIL MEDIA VP, Creative Brian Anthony Epsilon Feld Entertainment Director, Client Services - Creative Services Sarah Tildsley Feld Entertainment Friend + Johnson Artist Representative Simone Friend Friend + Johnson Greater Sarasota Chamber of Commerce Opportunities For All Manager Melanie Lavender Greater Sarasota Chamber of Commerce KeeKee's Big Adventures Co-founder and co-creator of KeeKee’s Big Adventures, a kids and family travel entertainment brand with books, podcasts, and videos aimed at sparking curiosity and adventure. Shannon Jones KeeKee's Big Adventures X"
    },
    {
      "url": "https://honolulumuseum.org/pQXZfo/get-in-touch",
      "text": "Get in touch | Honolulu Museum of Art To the cookie settings To the main content To the footer Book tickets Shopping cart Login To search form Menu General Ticketing, tours, and classes Membership and donor services Media and image reproduction requests Curatorial information On at HoMA Events In the galleries Current exhibitions Upcoming exhibitions Films Art tours & talks Visit Book tickets Visit HoMA Shangri La tour Accessibility Café + Coffee Bar Shop Our collection Collection highlights Search the collection Library Members Learn Art classes Scholarships Educators On at HoMA Events In the galleries Current exhibitions Upcoming exhibitions Films Art tours & talks Visit Book tickets Visit HoMA Shangri La tour Accessibility Café + Coffee Bar Shop Our collection Collection highlights Search the collection Library Members Learn Art classes Scholarships Educators Login Book tickets Search Close Update my account Synchronize account Get in touch General HoMA visitor information (808) 532-8700 [email protected] HoMA Café & Coffee Bar (808) 532-8734 HoMA Shop (808) 532-8703 [email protected] Art School (808) 532-8741 [email protected] Ticketing, tours, and classes Event and film tickets (808) 532-3853 [email protected] Classes (808) 532-8741 [email protected] Membership and donor services Membership (808) 532-8724 [email protected] Donor Services [email protected] Corporate partners [email protected] Major giving; [email protected] Legacy giving [email protected] Media and image reproduction requests Media inquiries [email protected] Image reproduction requests For image reproduction rights, please email [email protected] Requests will be handled in the order in which they are received. Please allow two weeks for your request to be addressed. Curatorial information [email protected] Stories HoMA Blog HoMA Magazine Press About About us Leadership Strategic Plan Financial information Get in touch Support us Opportunities Research Library and Archives Search the collection Past exhibitions facebook instagram youtube threads Subscribe to our newsletter Subscribe © Honolulu Museum of Art Powered by Peppered Cookies We use cookies and similar techniques to analyze the use of the website, to make it possible to display third-party content such as videos, and for various other applications. These cookies are also placed by third parties. More information… Functional cookies These are necessary for the website to function properly. This way your shopping cart will be remembered and you can log in on the website with your account. Minimal cookies This option allows cookies to enrich your experience on the website. For example, media from third parties such as videos. We also keep statistics to continuously improve the site. All cookies With these cookies we collect further information to carry out our marketing activities, such as newsletters and advertisements, in the most efficient and personal way. Only functional cookies Minimal cookies All cookies Put me on the waiting list Close We have received your application. We will contact you when tickets become available. Something went wrong. Please call to be put on the waiting list. OK Wish list Close Added: OK To wishlist"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/current-season/",
      "text": "Current Season - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Learn Program Guide Weekly Programs Highlights Tour Wednesdays, Fridays, Saturdays at 11 am Your Wednesday Playdate Wednesdays  10 am-12 pm Free Second Sundays at SAM Second Sundays 11 am – 5 pm Quick Links Weekly Programs Events Member Exclusive Talks and Tours Performances and More Movement All programs by date Spring Break Open Studios Tuesday, March 18 - March 21 1 - 4 pm Free for Members Free with Museum Admission Join us in all 3 of our studios for FREE Art-making during Spring Break! Create your own one-of-a-kind sneakers and wearable art with Ceramics, Watercolor Painting, and Multi-media projects inspired by our current exhibition Future Now . Events Art on Film Put the art world in focus with Art on Film at SAM. Join us for award-winning documentaries, short films, and biopics that highlight some of our favorite artists, reveal untold histories, and explore what it takes to make it as an artist today. Each screening will include opportunities for discussion and connection among audience members. Thursday, September 25, 2025 | 2 pm Thursday, October 30, 2025 | 2 pm Thursday, November 20, 2025 | 2 pm Tuesday, January 27, 2026 | 2 pm Tuesday, February 24, 2026 | 2 pm Thursday, March 26, 2026 | 2 pm Thursday, April 23, 2026 | 2 pm Thursday, May 28, 2026 | 2 pm Learn More Bistro Pop-Up Nights Enjoy an after-hours gallery tour and a 4-course dinner curated by Executive Peyton Leffingwell. Dinner reservations are available for 6:30 pm. Private tour will begin one hour prior to dinner, at 5:30 pm. Wednesday, October 8, 2025 | 5:30 pm Wednesday, November 5, 2025 | 5:30 pm Wednesday, January 7, 2026 | 5:30 pm Wednesday, February 4, 2026 | 5:30 pm Wednesday, March 4, 2026 | 5:30 pm Wednesday, April 8, 2026 | 5:30 pm Wednesday, May 6, 2026 | 5:30 pm Learn More Uncorked Celebrate the art of wine! Join us for Uncorked, SAM’s new monthly wine tasting series. Each event features a new and exciting selection of six wines, as well as gourmet cheeses. Learn about the curated selection through a guided presentation led by 99 Bottles Owner Mark Tuchman and enjoy a full glass of wine of your choice following the presentation. Bottles will be available for purchase. Tuesday, September 16, 2025 | 5:30 pm Tuesday, October 14, 2025 | 5:30 pm Tuesday, November 18, 2025 | 5:30 pm Tuesday, January 13, 2026 | 5:30 pm Tuesday, February 10, 2026 | 5:30 pm Tuesday, March 10, 2026 | 5:30 pm Tuesday, April 14, 2026 | 5:30 pm Tuesday, May 19, 2026 | 5:30 pm Learn More Cocktails + Culture Discover the art of craft cocktails at this demonstration and tasting led by Spirits Educator, Mixologist, and Owner of N8 Hospitality, Brad Coburn. Enjoy light bites and two artistically concocted cocktails inspired by SAM’s exhibition Art Deco: The Golden Age of Illustration . Additional beverages will be available for purchase. Monday, November 3, 2025 | 5:30 pm Monday, March 2, 2026 | 5:30 pm Learn More Talks and Tours Conversation series: What in the (art)World? Meet in the Wendy G. Surkis & Peppi Elona Lobby Sarasota Art Museum First Tuesdays |  11 am Be part of our engaging series held every first Tuesday of the month, delving into both the surface ripples and the profound depths of the contemporary art world with art appraiser and advisor, Elana Rubinfeld. Tuesday, May 6, 2025 | 11 am Learn More Art at Noon Meet in the Wendy G. Surkis & Peppi Elona Lobby Sarasota Art Museum Third Tuesdays |  Noon Come enjoy discussions with specialists and artists covering a variety topics related to Sarasota Art Museum’s exhibitions, architecture, and areas of interest. Tuesday, September 16, 2025 | 12 pm Tuesday, October 21, 2025 | 12 pm Tuesday, November 18, 2025 | 12 pm Tuesday, December 16, 2025 | 12 pm Tuesday, January 20, 2026 | 12 pm Tuesday, February 17, 2026 | 12 pm Tuesday, March 17, 2026 | 12 pm Tuesday, April 21, 2026 | 12 pm Learn More Museum Architecture Walking Tour Meet in the Wendy G. Surkis & Peppi Elona Lobby Sarasota Art Museum Explore the iconic architecture around the Sarasota Art Museum campus in this walking tour led by Architecture Sarasota’s President Marty Hylton. Monday, October 13, 2025 | 1 pm Monday, November 10, 2025 | 1 pm Monday, December 15, 2025 | 1 pm Monday, January 19, 2026 | 1 pm Monday, February 16, 2026 | 1 pm Monday, March 16, 2026 | 1 pm Monday, April 13, 2026 | 1 pm Monday, May 11, 2026 | 1 pm Learn More Mindfulness and Art: A Collaboration of the Senses Learn to practice mindfulness using all five of your senses! The journey will begin with a comprehensive look at mindfulness and how to apply its concepts through the arts.  This 6-part series is guided by Crystal Brooks, LCSW CIMHP, Owner and Psychotherapist of North Star Counseling and Wellness. May 1, 2025 | Mindfulness and the Nose – The Aroma of Wellness Learn More This Is Not a Book Club! Explore the intersection of art and literature at This Is Not a Book Club! Moderated by Certified Art Appraiser Elana Rubinfeld, each gathering will dive into one new release or art world classic – offering in-depth insights into the people, places, and ideas that shape contemporary art, and illuminating your understanding of this complex and entertaining universe. Tuesday, May 13, 2025 Learn More Art at Noon Tuesday, September 16 at noon Curator’s Tour –  September 2025 Monday, September 29, 2025 | 1 pm Curator’s Tour –  October 2025 Monday, October 20, 2025 | 1 pm Artist Talk: Jillian Mayer Saturday, October 25, 2025 | 1-2pm Curator’s Tour –  November 2025 Monday, November 3, 2025 | 1 pm Opening Day Talk: Janet Echelman Saturday, November 15, 2025 |  1-2 pm Director’s Tour – November 2025 Monday, November 24, 2025 | 1 pm Curator’s Tour –  December 2025 Monday, December 8, 2025 | 1 pm Director’s Tour – January 2026 Monday, January 26, 2026 | 1 pm Director’s Tour – February  2026 Monday, February 23, 2026 | 1 pm Director’s Tour – March 2026 Monday, March 30, 2026  | 1 pm Director’s Tour – April 2026 Monday, April 27, 2026  | 1 pm Education Programs Performances and More Jazz Thursday Marcy & Michael Klein Plaza Sarasota Art Museum Second Thursdays |  5:30 pm – 8 pm Join us for live jazz at Sarasota Art Museum, hosted by the Jazz Club of Sarasota, with extended hours in the galleries, Bistro, and SHOP! Thursday, September 11, 2025 Thursday, October 9, 2025 Thursday, November 13, 2025 Thursday, December 18, 2025 Learn More After Hours Marcy & Michael Klein Plaza Sarasota Art Museum Last Tuesday |  5:30 pm – 7:30 pm Join us on the last Tuesday of the month for live music and dancing, with extended hours in the galleries, Bistro, and SHOP! Each month features a different musical genre and style, so you can listen to new sounds and learn new moves. Relax and just enjoy the music, or join in on the dance floor! October 28, 2025 – Country Line Dancing November 25, 2025 – Motown Hits December 30, 2025 – Classical Holiday and Waltz January 27, 2026 – 1920s Jazz and Swing February 24, 2026 – Traditional Irish Music and Dance March 31, 2026 – 1950s Rock n’ Roll April 28, 2026 – Latin and Salsa Dancing May 26, 2026 – Traditional Sea Shanty Folk Learn More Movement Move Through In The Galleries Sarasota Art Museum Join us for a joyful hour of movement and human connection. This class will invite close looking and a deeper exploration of the art on view in SAM’s galleries through creative expression. Saturday, May 3, 2025 | 9 am Learn More All programs by date After Hours Fourth Tuesdays | 5:30 pm – 7:30 pm Jazz Thursdays Second Thursdays | 5:30 pm-8:00 pm Art at Noon Tuesday, September 16 at noon Uncorked Tuesday, September 16, 2025 | 5:30 pm Art on Film Thursday, September 25, 2025 | 2 pm Curator’s Tour –  September 2025 Monday, September 29, 2025 | 1 pm Bistro Pop-Up Nights Wednesday, October 8, 2025 | 5:30 pm Curator’s Tour –  October 2025 Monday, October 20, 2025 | 1 pm Artist Talk: Jillian Mayer Saturday, October 25, 2025 | 1-2pm Curator’s Tour –  November 2025 Monday, November 3, 2025 | 1 pm Opening Day Talk: Janet Echelman Saturday, November 15, 2025 |  1-2 pm Director’s Tour – November 2025 Monday, November 24, 2025 | 1 pm Curator’s Tour –  December 2025 Monday, December 8, 2025 | 1 pm Director’s Tour – January 2026 Monday, January 26, 2026 | 1 pm Director’s Tour – February  2026 Monday, February 23, 2026 | 1 pm Director’s Tour – March 2026 Monday, March 30, 2026  | 1 pm Director’s Tour – April 2026 Monday, April 27, 2026  | 1 pm Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/new-senior-director-of-business-operations/",
      "text": "Sarasota Art Museum Announces New Senior Director of Business Operations - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Sarasota Art Museum Announces New Senior Director of Business Operations August 30, 2022 Sarasota, FL – August 30, 2022 – Sarasota Art Museum is pleased to announce the appointment of Christina Fraser as its Senior Director of Business Operations, effective Sept. 9, 2022. “We welcome Christina as we continue evolving to achieve our mission,” said Virginia Shearer, executive director of Sarasota Art Museum. “Christina is a great team player with a powerful collaborative spirit and a deep interest and commitment to this community and to the future of Sarasota Art Museum.” With more than 13 years of professional experience at arts and higher education institutions including The John and Mable Ringling Museum of Art and New College of Florida, Fraser has in-depth experience in managing resources, personnel, and operations, and leading cross-departmental teams to achieve common institutional goals. As a museum professional, she bridges creative, financial, and operational areas through her expertise in finance administration, marketing, public engagement and events, facilities management, and public safety. Fraser holds a bachelor’s degree in business administration from the University of South Florida. The Senior Director of Business Operations is a newly created leadership position responsible for managing the Museum’s operating budget and revenue generating programs, leading a variety of special projects including institutional publications, overseeing major digital infrastructure initiatives, and implementing long-term financial planning. “I am thrilled to join the team of passionate museum professionals and to contribute to Sarasota Art Museum’s growing success!” said Christina Fraser. Christina Fraser, Senior Director of Business Operations at Sarasota Art Museum About Sarasota Art Museum Sarasota Art Museum is a catalyst for appreciation and understanding of the art of our time. As a platform for exposure, education, and experimentation, the Museum inspires new ideas and new ways of being through an endless rotation of transformative, relevant, and pioneering exhibitions and programs designed to elevate and empower all by cultivating discerning visual thinkers and ethical citizens. Sarasota Art Museum is Ringling College of Art and Design’s dynamic laboratory for the exploration and advancement of contemporary art. Sarasota Art Museum shares the Ringling College Museum Campus with Ringling College’s Continuing Studies program comprised of the non-credit Studio and Digital Arts program and the Osher Lifelong Learning Institute (OLLI) at Ringling College. Located in the historic Sarasota High School, Sarasota Art Museum opened to the public in 2019 in the beautifully reimagined building by K/R Architects. The new Museum is comprised of 15,000 square feet of dedicated exhibition space, a plaza court, the Great Lawn featuring temporary sculpture and site – specific installations, Bistro, and SHOP. As Sarasota’s only museum solely focused on contemporary artists and their work, Sarasota Art Museum offers visitors a place to see thought-provoking exhibitions and participate in education programs that start conversations and amplify the city’s creative spirit. SHOP, located in the Museum’s lobby, features an eclectic collection of exhibition-related merchandise, art and architecture books, contemporary jewelry, and gifts. Bistro at Sarasota Art Museum is located on the Museum’s campus in Paul Rudolph’s Sarasota School of Architecture 1959 Vocational Shops building. The Bistro fare is inspired by Florida’s regional fruit stands and farmer’s markets and emphasizes local produce, healthy proteins, and artisanal specialty items brought to you by Executive Chef and general manager Kaytlin Dangaran. To stay in the know: Become a Sarasota Art Museum Member Sign Up for Email updates Follow us on Facebook Follow us on Instagram Museum Admission and Hours Visit Media Contact: Ashley Parker MagnifyGood Phone: 941-713-9821 aparker@magnifygood.com Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.artsarasota.org/leadership",
      "text": "Board & Staff — Art Center Sarasota Skip to Content Open Menu Close Menu Exhibitions On View Artist Talks Upcoming Call to Artists Exhibition Catalog Archives EDUCATION Family Saturdays Mini Art Camp Adult Classes & Workshops Adult Education Policies Education Catalog Engage Join Volunteer Donate Shop Our Partners About Board & Staff History Sculpture Garden Careers Media Contact Events Upcoming Events Artists on Art - Critique Calendar Rent Our Space 0 0 DONATE 0 0 DONATE Exhibitions On View Artist Talks Upcoming Call to Artists Exhibition Catalog Archives EDUCATION Family Saturdays Mini Art Camp Adult Classes & Workshops Adult Education Policies Education Catalog Engage Join Volunteer Donate Shop Our Partners About Board & Staff History Sculpture Garden Careers Media Contact Events Upcoming Events Artists on Art - Critique Calendar Rent Our Space Open Menu Close Menu Folder: Exhibitions Back On View Artist Talks Upcoming Call to Artists Exhibition Catalog Archives Folder: EDUCATION Back Family Saturdays Mini Art Camp Adult Classes & Workshops Adult Education Policies Education Catalog Folder: Engage Back Join Volunteer Donate Shop Our Partners Folder: About Back Board & Staff History Sculpture Garden Careers Media Contact Folder: Events Back Upcoming Events Artists on Art - Critique Calendar Rent Our Space DONATE Leadership Board of Directors Mary Davis Wallace Chair Brenda Griffiths Vice Chair Ellen Seidensticker Secretary Barbara Banks Treasurer Michael Kinsey Board Member Cathy Wilson Board Member Staff Katherine Ceaser Executive Director More Katherine Ceaser, a Sarasota native, has a strong foundation in arts education and community engagement with a career rooted in the nonprofit and educational sectors. Before joining ACS as education director in 2023, Ceaser served as an adjunct faculty member, education advisor, and assistant director of career advising at the University of South Florida Sarasota-Manatee. She also worked as an ESE teacher with Sarasota County Schools, gaining valuable experience in higher education and K-12 environments. Ceaser holds an Ed.M. in International Education Policy from Harvard University, an MAT in Elementary Education from American University, and a BA in International Studies from the University of South Florida. Holly Flaig Youth Education Coordinator More Holly Flaig is excited to spread the joy of art-making to kids of all ages as the Youth Education Coordinator at Art Center Sarasota. She has a B.A. in Psychology and Art Therapy from Miami University, where she explored the positive impact that the arts have on mental well-being. She dedicates much of her free time to creativity through various mediums such as ceramics, photography, and crochet, and incorporates her love of nature into her work. Email Holly Christina Baril Curator & Director of Exhibitions More Christina joined the ACS team in January 2022 and serves as our Curator & Director of Exhibitions. Prior to joining ACS, she has held positions at State College of Florida, New Bedford Art Museum (MA), National September 11 Memorial & Museum (NYC), and the Newseum (Washington D.C.). Christina was born & raised in NYC and received her MFA in Ceramics from the University of Massachusetts Dartmouth and her BBA in Marketing & Art/Art History from the College of William and Mary. Email Christina Cassie Andrews Program Assistant More Cassie joined Art Center Sarasota in August 2023 and she is a Program Assistant for the Adult Education department. She received her BA in Studio Art from Florida State University in 2019 where she served as a founding board member of Print Club FSU. Cassie worked as a Branding and Promotions Coordinator for FSU’s Student Union before returning to her hometown of Bradenton, FL. She is currently pursuing a master’s degree in Mass Communication with a focus on web design from the University of Florida. Peg Shanley Program Assistant Rachel Denton Administrative Coordinator More Rachel Denton joined Art Center Sarasota in May 2025 after serving as Marketing and Public Relations Associate at Gulf Coast Community Foundation. Prior to that position, Rachel was the Communications Manager and Voter Outreach Coordinator at the Sarasota County Supervisor of Elections Office, and the Communications Manager at the Arts and Cultural Alliance of Sarasota County. Rachel brings years of experience specializing in communications, branding, and storytelling. She is a Sarasota native with roots and experience planted deeply in the community. Rachel is a former board member and a longstanding member of the Central West Coast Chapter of the Florida Public Relations Association. Rachel was honored as Young Professional of the Year in 2018 by the Greater Sarasota Chamber of Commerce and received an Award of Appreciation in 2019 from the Central West Coast Chapter of the Florida Public Relations Association for her work on their board. She holds a Bachelor’s degree in Humanities with an emphasis in Communication from Florida State University. Rachel enjoys spending time with her dog and family and playing board games. Kelly Jordan Bookkeeper Laurie Miller Director of Education & Community Engagement More Laurie Miller is a creative producer and content creator with a strong background in children’s media, nonprofit collaboration, and educational program development. Before joining Art Center Sarasota in 2025, she worked with The Patterson Foundation and the Suncoast Campaign for Grade-Level Reading, where she helped design and implement initiatives like This Book is Cool! and Suncoast Remake Learning Days, a regional festival offering hundreds of free, hands-on learning events. Known for transforming bold, inclusive ideas into impactful content and large-scale community programs, Laurie blends storytelling, strategic planning, and collaboration to create accessible, curiosity-driven experiences for learners of all ages. Her creative work has been featured by the Canadian Broadcasting Corporation, Disney XD, Sesame Studios, and Discovery Channel. She was a Juno Award nominee for the children’s music album The Moblees , and has written and directed theatrical productions at venues including LA’s Geffen Playhouse, NYC’s Daryl Roth Theatre, and the White House Easter Egg Roll. History As the first visual arts organization in area, we started a movement that has made Sarasota the cultural destination it is today. 1926 The Sarasota Art Association was established in 1926 as the first arts organization in Sarasota. Founder Marcia Rader, Art Supervisor of the Sarasota School System, was the driving force behind the initial meetings of local art supporters who formed the association. In the early years, the group met monthly and sponsored exhibits in rented facilities. 1941 In 1941, the Association incorporated as a not-for-profit organization. At that time, the stated mission was “to promote the educational and cultural advantages of Sarasota in the field of contemporary art.\" Many renowned local artists like Jerry Farnsworth, Elden Rowland, Syd Solomon and Hilton Leech were instrumental in establishing the center as the focal point for Sarasota's visual arts. 1949 The City of Sarasota provided the Art Association, with a lease of land near the downtown area and in 1948, after the war, the association broke ground for its present building which was designed in the then-popular style of the Sarasota School of Architecture. The building opened in 1949 with only one gallery which is now known as Gallery 3. 1961 The Atrium (Gallery 4) or “Patio Gallery” as it was called was later erected with donations from members and was enclosed in 1961. Several more additions were made to the building adding on the front two galleries, the classroom and the back kitchen and class area. The association's philosophy during the 1960’s, stated that “while the gallery is important to display the works of local artists, one-man shows and traveling exhibitions, there is a social aspect of the association that bears heavy fruit. It is a meeting place for all who are interested in the many phases of art; it is a place to make friends and see what is going on in Sarasota…” This philosophy is still the inherent mission of Art Center Sarasota today. 2009 The 1950's and 60's were a time of great social involvement of the community in the visual arts. The Art Association would hold their famous Beaux Arts Ball each year. A thousand guests would participate in a grand themed costume party at the Sarasota Municipal Auditorium. Today, the Art Center has brought back some of the excitement of the balls by creating the iconcept event in 2009. Local artists create \"fashion\" from unconventional materials for a grand runway show. 2025 - 2026 As Art Center Sarasota reflects on a century of creativity, connection, and community, together we honor the lasting legacy behind us while forging an indelible mark on the future. The Art Center’s Centennial Season, beginning in fall 2025 and running through summer 2026, will feature the iconic Beaux Arts Ball, our inaugural Authors & Illustrators Book Fair, inspiring exhibitions, engaging classes, youth and family programs, and recurring, innovative art events. This milestone is a testament to the strength and passion of our incredible arts community. Visual arts continue to flourish in Sarasota, as do the artists who bring them to life. Art Center Sarasota is a nonprofit organization that offers curated and juried exhibitions, workshops and classes, outreach initiatives, and more. Art Center Sarasota 941-365-2032 707 N. Tamiami Trail, Sarasota, FL 34236 Gallery Hours: Mon-Sat, 10 am-5 pm MAKE A DONATION SIGN UP FOR E-NEWS Art Center Sarasota, Inc. is a 501(c)(3) tax-exempt organization and all contributions are tax deductible to the extent allowable by law. ART CENTER SARASOTA , INC. MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE, THE DEPARTMENT’S CONSUMER HOTLINE, 1-800-HELP FLA (435-7352) OR 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION'S WEBSITE www.FDACS.gov. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION #CH867 EDUCATION POLICIES | PRIVACY POLICY | ACCESSIBILITY STATEMENT | RENTAL INFORMATION © 2022 Art Center Sarasota. All rights reserved."
    },
    {
      "url": "https://www.sarasotaartmuseum.org/visit/",
      "text": "Visit - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Marcy & Michael Klein Plaza Photo: Ryan Gamma Plan your Visit OPEN 7 Days a Week Today is , , Museum Exhibition Gallery Hours 10am – 5pm Monday – Saturday 11am – 5pm Sunday 10 am – 5 pm 11 am – 5 pm Monday – Saturday Sunday SHOP 10am – 5pm Monday – Saturday 11am – 5pm Sunday 10 am – 5 pm 11 am – 5 pm Monday – Saturday Sunday Bistro 9 am – 3 pm Daily 9 am – 3 pm Daily Free Second Sundays at SAM are the Second Sunday of every month. The Museum Campus will be closed on Memorial Day, Juneteenth, July 4 for Independence Day, Labor Day, Thanksgiving Day, Christmas Day, and New Year’s Day. Sarasota Art Museum’s top priority is the safety of our community, visitors, artists, and staff members. The Museum Campus, including the Bistro, Shop, and Museum Grounds are open to all and we welcome you for your next visit. Visiting the Museum Sarasota Art Museum has 15,000 square feet of dedicated exhibition gallery space spread across three floors along with the popular Bistro and Shop for visitors to spread out and enjoy all the Museum has to offer. Take in our outdoor sculpture and site-responsive installations in the Museum’s Marcy & Michael Klein Plaza and the Great Lawn. Admission General Admission $20 17 and Under Free Museum Members Free Cross College Alliance Students Free with ID Veterans & Active Military Free with ID Ringling College of Art and Design Faculty, Staff, and Students Free (includes 1 guest) Ringling College of Art and Design Alumni Free Tickets are available for purchase up until 4:30 pm on the day you would like to attend. Join and Save! Join today and apply today’s admission towards Museum Membership. You’ll enjoy free admission and a 10% discount in Shop + Sarasota Art Museum and Bistro. You’ll also receive invitations to special Members-only events. Become a Member Getting Here Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 Parking Free visitor parking is available on the south side of the Museum. For visitors that would like to use public transportation, The SCAT bus stop is located in front of the Museum on South Tamiami Trail. Click here to learn more about SCAT schedule and maps Where to Shop The SHOP + Sarasota Art Museum is located on the first floor of the Elliott building. Museum Members receive a 10% discount in SHOP + Sarasota Art Museum and invitations to exclusive Members-only shopping events. Learn more about SHOP here Where to Eat Bistro is open daily from 9 am to 3 pm. Bistro offers a gourmet selection of light fares, including sandwiches, soups, specialty coffees, and desserts. Learn more about Bistro here Catering is available for event rentals. Learn more about Catering here Where to Stay (in town) Trying to figure out where to stay when you are visiting Sarasota? Stay at one of our partners, The Ritz-Carlton, Sarasota or Art Ovation Hotel, Autograph Collection. Learn more about their locations at the links below. The Ritz-Carlton, Sarasota Art Ovation Hotel, Autograph Collection Visitor Information Accessibility Sarasota Art Museum is committed to providing inclusive experiences for all audiences. To learn more about the Museum’s accessibility, click the button below to visit our Accessibility page. Visit our accessibility page Coatroom Large bags, backpacks and umbrellas may be stored in the complimentary lockers located in the coatroom. Photography and Videography Photography and videography is permitted for personal, noncommercial use at SAM within public indoor and outdoor spaces and most exhibitions. Exceptions may apply for special exhibitions based on artist copyrights. To protect our art on view, the use of flash photography, selfie sticks, tripod, or drones, is not permitted on the Museum campus. Professional and commercial videography and photography is prohibited without a permit. For inquires about commercial videography and photography pricing and permit details, please email MuseumEvents@ringling.edu create new email Drawing in the Galleries Drawing in the galleries is a centuries old tradition. We hope you will be so inspired here at the Museum. While visitors are welcome to sketch in the galleries, we ask that you use only pencil (no ink or paint) and sketchbooks no larger than 8 ½ x 11. Food and Beverages Food and beverages are not allowed in the Museum galleries. Outside food and beverages are not permitted on the Museum campus. Respect the Art “Don’t touch, climb or sit on, kick, hit, or lick the art” ( unless otherwise directed by the artist or Museum.) We love art and know that you do, too. So, please help us protect the work. Artwork can be very fragile and easily damaged by just the oils in your fingers and hands. We recommend keeping an arm’s length distance from the work. School Groups Groups of ten or more (including P-12 school tour requests) must schedule in advance by contacting our Visitor Experience Team at 941.309.4300 or emailing: groups@sarasotaartmuseum.org create new email Lost & Found We would be happy to reunite you with your lost items. Please email lostandfound@sarasotaartmuseum.org create new email Pets Service animals as defined by the American Disabilities Act (ADA) are always welcome. Pets should stay home. No Smoking Smoking, including vaping, is prohibited throughout the Museum and Museum campus. Weapons Firearms and all other weapons are prohibited in all areas of the Museum, except for those carried by law enforcement officers. Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/exhibitions/",
      "text": "Exhibitions - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ A. M. Cassandre, L'Intransigeant , 1925. Collection of the Crouse Family. Image credit: Courtesy of Poster House. Selina Román (American, 1978). Blockhead 1 , 2025. Dye sublimation on aluminum, 40 x 50 in. Courtesy of the artist. Visitors viewing Lillian Blades: Through the Veil , June 1-October 26, 2025, Sarasota Art Museum. Photo by Harry Sayer. Jillian Mayer. Slumpie 75-Work Desk 4 Lefties , 2025. Fiberglass, epoxy, found foam, hardware, polyurethane elastomer, 87 x 85 x 43 in. Installation view of Slumpies at Sarasota Art Museum, Sarasota, Florida, 2025. Photo: Ryan Gamma. Molly Hatch (American, born 1978). Amalgam (work in progress), 2023-24. Ceramic, 220 in. x 324 in. Courtesy of the artist. Photo: John Polak. Christian Sampson, Vita In Motu , (2019) Photo: Coke Wisdom O'Neal Bistro Thonet Exhibit Barbara Banks, Worker , (2019) Molly Hatch Staccato 2017/2022 Ceramic 40 x 270 in. Courtesy of the artist and Todd Merrill Studio Now A. M. Cassandre, L'Intransigeant , 1925. Collection of the Crouse Family. Image credit: Courtesy of Poster House. Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Showcasing 100 rare posters along with sculptures, cocktail shakers, and furniture pieces, this exciting exhibition celebrates the centennial anniversary of Art Deco and the artistic significance it brought to the early 20th-century. Learn more about this exhibition Selina Román (American, 1978). Blockhead 1 , 2025. Dye sublimation on aluminum, 40 x 50 in. Courtesy of the artist. Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Selina Román blends photography, abstraction, and self-portraiture to explore themes of beauty and the politics of size. Roman’s photographs transform the gallery into a space of quiet resistance, subverting traditional ideas of feminine beauty. Learn more about this exhibition Visitors viewing Lillian Blades: Through the Veil , June 1-October 26, 2025, Sarasota Art Museum. Photo by Harry Sayer. Lillian Blades: Through the Veil June 1–October 26, 2025 Blades invites visitors to enter, wander through, and lose themselves within an immersive maze of mixed-media “veils.”  These radiant tapestries suspended from the ceiling shimmer with reflective surfaces, activating the space with bouncing light and color. Learn more about this exhibition Jillian Mayer. Slumpie 75-Work Desk 4 Lefties , 2025. Fiberglass, epoxy, found foam, hardware, polyurethane elastomer, 87 x 85 x 43 in. Installation view of Slumpies at Sarasota Art Museum, Sarasota, Florida, 2025. Photo: Ryan Gamma. Jillian Mayer Slumpies May 4, 2025–August 19, 2026 Mayer explores the impact of technology on the human body through this interactive sculpture series. Slumpies invites viewers to sit and slump on these sculptures, much like furniture, and find a place of comfort while using their technological devices. Learn more about this exhibition Molly Hatch (American, born 1978). Amalgam (detail), 2023-24. Ceramic, 220 in. x 324 in. Courtesy of the artist. Photo: John Polak. Molly Hatch: Amalgam April 25, 2024–April 26, 2026 Hatch’s newly commissioned “plate painting,” Amalgam (2023), was created specifically for Sarasota Art Museum. Consisting of more than 450 earthenware plates hand-painted in white, blue, and gold luster, the abstract lines and shapes in Amalgam are drawn from a variety of historical ceramics from around the globe. Learn more about this exhibition Inside Out Christian Sampson, Vita In Motu (2019) Photo: Coke Wisdom O'Neal Molly Hatch Staccato 2017/2022 Ceramic 40 x 270 in. Courtesy of the artist and Todd Merrill Studio Installation image of Chakaia Booker (American, born 1953). Square Peg, 2003. Rubber tires, wood, and steel at Sarasota Art Museum Inside Out invites you to discover works of art throughout our Museum Campus, in addition to those showcased through rotating exhibitions in our galleries. Inside Out Artists Jose Alvarez (D.O.P.A), Coming Together Claire Ashley, Chromatic Blush: Wee Bairn John Clement, Shazam Samo Davis, Happiness in ROYGBIV Molly Hatch, Staccato John Henry, Complexus Jillian Mayer, Slumpies Olivier Mosset, Untitled Leah Rosenberg, 28 Colors Christian Sampson, Vita in Motu Learn more about Inside Out Next Before Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/sarasota-art-museum-announced-new-senior-curator/",
      "text": "Sarasota Art Museum Announced New Senior Curator - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Sarasota Art Museum Announces New Senior Curator November 8, 2022 SARASOTA, Fla. (Nov. 8, 2022) – Sarasota Art Museum of Ringling College is delighted to announce that Rangsook Yoon, Ph.D, has been appointed Senior Curator, a newly established position for the Museum. Yoon brings to the Museum an impressive depth of experience and training as a curator, scholar, administrator, and educator – most recently at Artis–Naples, The Baker Museum in Naples, Florida where she currently serves as Curator of Modern Art. Rangsook Yoon Photo: Daniel Perales In her new role at Sarasota Art Museum, Yoon will lead the curatorial department and supervise all aspects of the Museum’s exhibition program, working closely with senior leadership to shape the long-term artistic vision for the Museum. “Rangsook Yoon is an exceptionally versatile and talented curator, museum professional, and educator and I’m thrilled she will be joining our team as Sarasota Art Museum’s new senior curator,” said Sarasota Art Museum Executive Director Virginia Shearer. “Rangsook stood out among an impressive applicant pool as a creative thinker who shares our commitment to dynamic, relevant arts programming that makes a lasting impact. I was particularly impressed by Rangsook’s deep understanding of the unique role that college and university museums play in fostering artistic experimentation and inspiration for students across the learning continuum. Sarasota Art Museum is poised for long-term growth and Rangsook’s commitment to innovative and forward-thinking exhibition projects, diversity and inclusion, and the educational role of museums make her an ideal partner.” During her tenure at The Baker Museum, Yoon administered or curated over twenty modern and contemporary art exhibitions working with a range of regional, national, and international artists. As curator of The Baker’s annual Florida Contemporary exhibition, Yoon sought to diversify both media and artist representation, by showcasing works from talented Latinx and women artists in Florida, and increasing the regional visibility and relevance of The Baker Museum. In addition to Yoon’s accomplishments in exhibition curation, she has been responsible for several notable acquisitions for The Baker’s permanent collection and has worked extensively with the Museum’s education programs. Yoon was previously Director of Experiences and Curator at the Art & History Museums–Maitland (A&H), where she oversaw the A&H’s exhibition, public outreach, and educational programming, as well as artist residencies. Born, raised, and educated in South Korea, Yoon majored in French language and literature at Korea University in Seoul, before relocating to the US to study art history. She obtained her Ph.D. in Art History from the Institute of Fine Arts, New York University. A specialist in European art from the Renaissance period, Yoon is an enthusiastic generalist knowledgeable in a wide range of the history of Western and global art. She taught college-level art history for six years at nationally ranked institutions including Trinity University, Texas; Central College in Iowa; and Chapman University in California. In 2013, Yoon served as a curatorial fellow at Rollins Museum of Art in Winter Park. The Association of Art Museum Curators selected Yoon to be one of ten international curators for its 2021–22 Mentorship program. About Sarasota Art Museum Sarasota Art Museum is a catalyst for appreciation and understanding of the art of our time. As a platform for exposure, education, and experimentation, the Museum inspires new ideas and new ways of being through an endless rotation of transformative, relevant, and pioneering exhibitions and programs designed to elevate and empower all by cultivating discerning visual thinkers and ethical citizens. Sarasota Art Museum is Ringling College of Art and Design’s dynamic laboratory for the exploration and advancement of contemporary art. Sarasota Art Museum shares the Ringling College Museum Campus with Ringling College’s Continuing Studies program comprised of the non-credit Studio and Digital Arts program and the Osher Lifelong Learning Institute (OLLI) at Ringling College. Located in the historic Sarasota High School, Sarasota Art Museum opened to the public in 2019 in the beautifully reimagined building by K/R Architects. The new Museum is comprised of 15,000 square feet of dedicated exhibition space, a plaza court, the Great Lawn featuring temporary sculpture and site – specific installations, Bistro, and SHOP. As Sarasota’s only museum solely focused on contemporary artists and their work, Sarasota Art Museum offers visitors a place to see thought-provoking exhibitions and participate in education programs that start conversations and amplify the city’s creative spirit. SHOP, located in the Museum’s lobby, features an eclectic collection of exhibition-related merchandise, art and architecture books, contemporary jewelry, and gifts. Bistro at Sarasota Art Museum is located on the Museum’s campus in Paul Rudolph’s Sarasota School of Architecture 1959 Vocational Shops building. The Bistro fare is inspired by Florida’s regional fruit stands and farmer’s markets and emphasizes local produce, healthy proteins, and artisanal specialty items brought to you by Executive Chef and general manager Kaytlin Dangaran. To stay in the know: Become a Sarasota Art Museum Member Sign Up for Email updates Follow us on Facebook Follow us on Instagram Museum Admission and Hours Visit Media Contact: Ashley Parker MagnifyGood Phone: 941-713-9821 aparker@magnifygood.com Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://www.smccombturbitt.com/contact",
      "text": "Contact | Get in Touch Today — Fine Art by Sarah McComb-Turbitt Skip to Content Open Menu Close Menu Home Original Paintings Limited Edition Prints Courses About Contact Login Account 0 0 Home Original Paintings Limited Edition Prints Courses About Contact Login Account 0 0 Open Menu Close Menu Home Original Paintings Limited Edition Prints Courses About Contact Login Account Get in touch! sarah@smccombturbitt.com (902) 809-5890 Name * First Name Last Name Email * Phone Country (###) ### #### Message * Budget Send me a description of the project and include your budget here. $ Thank you for your inquiry, I will be in touch soon! “ In the end, we will conserve only what we love; we will love only what we understand; and we will understand only what we are taught ” — Baba Dioum Sarah McComb-Turbitt Owen Sound, ON, Canada sarah@smccombturbitt.com (902)-809-5890 The Collector's List Be the first to know about new artwork, limited-edition releases, and special events before social media channels First Name Last Name Email Address I'M IN! YAY!! I couldn’t be happier to have you join me and follow the 2021 launch of this exciting career pivot. Thank you for the support & your enthusiasm for my work! ♡Sarah For thousands of years, First Nations people have walked on this land. Their relationship with the land is at the centre of their lives.  Wherever you are, please take a moment to reflect on the traditional caretakers of the lands you call home.  Here in Bruce County, Ontario, I want to acknowledge the traditional Territory of the Anishinabek Nation: The People of the Three Fires known as Ojibway, Odawa, and Pottawatomie Nations. And further give thanks to the Chippewas of Saugeen, and the Chippewas of Nawash, now known as the Saugeen Ojibway Nation, as the traditional keepers of this land. I want to acknowledge further the more recent history and ongoing connections the Saugeen Metis have to this place. May we all, as Treaty People, live with respect on this land and live in peace and friendship with all its diverse peoples. Copyright © 2024 Sarah McComb-Turbitt. All rights reserved."
    },
    {
      "url": "https://www.sarasotaartmuseum.org/opportunities/",
      "text": "Opportunities - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Opportunities Sarasota Art Museum’s Museum guides are valued educators who lead adult tours and school tours, utilizing dialogue, inquiry, and visual thinking strategies. Become a Museum Guide! Looking for a way to involve yourself in the arts? We are looking for you! Are you: Enthusiastic? Passionate about Education? Love Contemporary Art? Willing to learn? Are you interested in: Working with the public? Working with students? As a Museum dedicated to Contemporary Art, we look for those who love art (and learning!) as much as we do. SAM’s Museum Guides, as the knowledgeable representatives of the Museum, share stories, facts, and our community-based approach to contemporary art. Museum guides reflect flexibility, responsibility, and respect regarding Museum patrons, staff, and other volunteers. Being a Museum guide includes training, scheduling, and newsletters, along with communication, partnering with our Public Programming Coordinator and Community Catalyst in engaging the public. We are committed to ensuring our museum guides feel appreciated and prepared with the best knowledge about contemporary and current exhibitions. A previous docent or museum guide experience, history in arts, or arts education can be helpful, although not required. Apply to be a Museum Guide Interested in being a part of our team? Apply below. Click here to apply to be a Museum Guide Already a Museum Guide? Login to your VicNet account below. Login to VicNet Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    },
    {
      "url": "https://sarasotaarts.org/venue/sarasota-art-museum/",
      "text": "Sarasota Art Museum - sarasotaarts.org MEMBER LOGIN LOGIN REGISTER LOGOUT MY ACCOUNT English Arabic Chinese (Simplified) Chinese (Traditional) English French German Japanese Korean Kurdish (Kurmanji) Spanish Vietnamese There are no recent bookmarks. Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT MENU Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Venue Type Art Center Business/Company Comedy Club Concert Hall Gallery Meeting Space Museum Park/Garden/Open Space Performing Arts Center Restaurant/Cafe School Studio Theater State / Province FL City/Town Englewood Laurel Longboat Key Nokomis North Port Osprey Sarasota Venice Zip/Postal Code 34223 34224 34228 34229 34230 34231 34232 34233 34234 34235 34236 34237 34238 34239 34240 34241 34242 34243 34260 34272 34274 34275 34276 34277 34278 34284 34285 34286 34287 34288 34289 34292 34293 34295 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue Sarasota Art Museum Facebook Twitter Linkedin Print Sarasota Art Museum Anchoring the Ringling College Museum Campus, the Museum has 15,000 square feet of dedicated exhibition gallery space, Bistro, Shop, auditorium for educational events, performance and film, a sculpture courtyard and extensive grounds and facilities where one can engage with site-specific and site-responsive art experiences. Anchoring the Ringling College Museum Campus, the Museum has 15,000 square feet of dedicated exhibition gallery space, Bistro, Shop, auditorium for educational events, performance and film, a sculpture courtyard and extensive grounds and facilities where one can engage with site-specific and site-responsive art experiences. View less MORE ABOUT THIS VENUE Venue Type: Museum LOCATION Sarasota Art Museum 1001 S Tamiami Trail, Sarasota, FL 34236 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette Accessibility Information Elevator Service Animal Service animals as defined by the American Disabilities Act (ADA) are always welcome. Pets should stay home. Wheelchair Access ADDITIONAL ACCESSIBILITY INFO: Sarasota Art Museum is committed to providing inclusive experiences for all audiences. The Museum is accessible for visitors with limited mobility via the elevator and ramps. Wheelchairs are available for visitors with limited mobility on a first come, first served basis. American Sign Language (ASL) interpretation is available for guided tours by contacting the Museum two weeks in advance of your visit. To schedule ASL interpretation, please contact info@sarasotaartmuseum.org PARKING INFO Free visitor parking is available on the south side of the Museum. For visitors that would like to use public transportation, The SCAT bus stop is located in front of the Museum on South Tamiami Trail. PUBLIC HOURS Museum Exhibition Gallery Hours 10 am – 5 pm | Monday – Saturday 11 am – 5 pm | Sunday SHOP 10 am – 5 pm | Monday – Saturday 11 am – 5 pm | Sunday Bistro 9 am – 3 pm | Daily The Museum Campus will be closed on Memorial Day, July 4 for Independence Day, Labor Day, Thanksgiving Day, and Christmas Day. PUBLIC ADMISSION FEES $15 General Admission UPCOMING EVENTS PAST EVENTS Jazz Thursdays at the SAM Presented by Sarasota Art Museum and Jazz Club of Sarasota at Sarasota Art Museum Sep 11, 2025 Accessibility Info Facebook Twitter Linkedin Uncorked Presented by Sarasota Art Museum at Sarasota Art Museum Sep 16, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets Jazz Thursdays at the SAM Presented by Sarasota Art Museum and Jazz Club of Sarasota at Sarasota Art Museum Oct 9, 2025 Accessibility Info Facebook Twitter Linkedin Uncorked Presented by Sarasota Art Museum at Sarasota Art Museum Oct 14, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets After Hours featuring The Derek Lersch Band Presented by Sarasota Art Museum at Sarasota Art Museum Oct 28, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets SHOW MORE Cocktails + Culture Presented by Sarasota Art Museum at Sarasota Art Museum Sep 8, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets Thursday Night Jazz at the SAM Presented by Sarasota Art Museum and Jazz Club of Sarasota at Sarasota Art Museum Aug 14, 2025 Accessibility Info Facebook Twitter Linkedin Personal to Political: Celebrating the African American Artists of Paulson Fontaine Press Presented by Sarasota Art Museum at Sarasota Art Museum May 4 - Aug 10, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets Chris Friday: Where We Never Grow Old Presented by Sarasota Art Museum at Sarasota Art Museum May 4 - Aug 10, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets Jazz Thursday at the SAM Presented by Sarasota Art Museum and Jazz Club of Sarasota at Sarasota Art Museum Jul 10, 2025 Accessibility Info Facebook Twitter Linkedin SHOW MORE Contact information Email / Website / Facebook / Instagram / 1001 S Tamiami Trail, Sarasota, FL 34236 (941) 309-4300 Find A Venue Search by Keyword Venue Type Art Center Business/Company Comedy Club Concert Hall Gallery Meeting Space Museum Park/Garden/Open Space Performing Arts Center Restaurant/Cafe School Studio Theater State / Province FL City/Town Englewood Laurel Longboat Key Nokomis North Port Osprey Sarasota Venice Zip/Postal Code 34223 34224 34228 34229 34230 34231 34232 34233 34234 34235 34236 34237 34238 34239 34240 34241 34242 34243 34260 34272 34274 34275 34276 34277 34278 34284 34285 34286 34287 34288 34289 34292 34293 34295 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access DIRECTORIES Artists Organizations Venues SUBMIT A LISTING Event Artist Organization ABOUT Sarasota Arts Contact Us Privacy Policy ABOUT The Arts and Cultural Alliance of Sarasota County is a member-powered organization that serves as an advocate for arts and culture in Sarasota County. CONTACT US HOURS : 9 a.m. – 5 p.m. Monday – Friday SARASOTA ARTS | 1226 N. Tamiami Trail, Suite 300 Sarasota FL 34236 941-365-5118 | info@sarasotaarts.org © 2025 - Arts and Cultural Alliance of Sarasota County. All Rights Reserved. { Powered by ARTSOPOLIS }"
    },
    {
      "url": "https://sarasotaarts.org/organization/sarasota-art-museum/",
      "text": "Sarasota Art Museum - sarasotaarts.org MEMBER LOGIN LOGIN REGISTER LOGOUT MY ACCOUNT English Arabic Chinese (Simplified) Chinese (Traditional) English French German Japanese Korean Kurdish (Kurmanji) Spanish Vietnamese There are no recent bookmarks. Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT MENU Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Organization Type Arts Council/Alliance Association/Club/Group Cabaret/Dinner Theatre Comedy Club Commercial Business Dance Educational Festival Film/Video Food/Drink Foundation Gallery History/Heritage Hospitality Kids/Family Library Media Museum Music Nonprofit Retail Theatre Traditional Arts Visual Arts City/Town Englewood Laurel Longboat Key Nokomis North Port Osprey Sarasota Venice Zip/Postal Code 34223 34224 34228 34229 34230 34231 34232 34233 34234 34235 34236 34237 34238 34239 34240 34241 34242 34243 34260 34272 34274 34275 34276 34277 34278 34284 34285 34286 34287 34288 34289 34292 34293 34295 SEARCH Advanced Filters Home Organization Sarasota Art Museum Facebook Twitter Linkedin Print Sarasota Art Museum In 2003, a group of 13 forward-thinking Sarasotans came together to further their goal of enhancing Sarasota’s rich cultural landscape with a contemporary art museum. After a two-year dialogue with area arts, educational, and community leaders, the Sarasota Art Museum partnered with Ringling College of Art and Design to transform the historic Sarasota High School into an art museum and visual arts educational center. As the region’s first museum dedicated to contemporary art, the Museum offers visitors a place to see thought-provoking, boundary-pushing exhibitions and participate in dynamic educational programming with global thought leaders. The facility is a resource for learning about global art discourse and deepening appreciation for 20th and 21st century art and artists through exhibition gallery spaces, an auditorium, an outdoor sculpture garden, a bistro, retail store, and extensive grounds for performance, happenings, sculpture, site-specific and site-responsive installations, movement classes, and gatherings. Sarasota Art Museum is an ideal “third space” for friends and family from the community, the region, and around the world to gather, learn, be inspired, and experience the power of art to transform society. In 2003, a group of 13 forward-thinking Sarasotans came together to further their goal of enhancing Sarasota’s rich cultural landscape with a contemporary art museum. After a two-year dialogue with area arts, educational, and community leaders, the Sarasota Art Museum partnered with Ringling College of Art and Design to transform the historic Sarasota High School into an art museum and visual arts educational center. As the region’s first museum dedicated to contemporary art, the Museum offers visitors a place to see thought-provoking, boundary-pushing exhibitions and participate in dynamic educational programming with global thought leaders. The facility is a resource for learning about global art discourse and deepening appreciation for 20th and 21st century art and artists through exhibition gallery spaces, an auditorium, an outdoor sculpture garden, a bistro, retail store, and extensive grounds for performance, happenings, sculpture, site-specific and site-responsive installations, movement classes, and gatherings. Sarasota Art Museum is an ideal “third space” for friends and family from the community, the region, and around the world to gather, learn, be inspired, and experience the power of art to transform society. View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: Museum UPCOMING EVENTS PAST EVENTS Jazz Thursdays at the SAM Presented by Sarasota Art Museum and Jazz Club of Sarasota at Sarasota Art Museum Sep 11, 2025 Accessibility Info Facebook Twitter Linkedin Uncorked Presented by Sarasota Art Museum at Sarasota Art Museum Sep 16, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets Jazz Thursdays at the SAM Presented by Sarasota Art Museum and Jazz Club of Sarasota at Sarasota Art Museum Oct 9, 2025 Accessibility Info Facebook Twitter Linkedin Uncorked Presented by Sarasota Art Museum at Sarasota Art Museum Oct 14, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets After Hours featuring The Derek Lersch Band Presented by Sarasota Art Museum at Sarasota Art Museum Oct 28, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets SHOW MORE Cocktails + Culture Presented by Sarasota Art Museum at Sarasota Art Museum Sep 8, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets Thursday Night Jazz at the SAM Presented by Sarasota Art Museum and Jazz Club of Sarasota at Sarasota Art Museum Aug 14, 2025 Accessibility Info Facebook Twitter Linkedin Personal to Political: Celebrating the African American Artists of Paulson Fontaine Press Presented by Sarasota Art Museum at Sarasota Art Museum May 4 - Aug 10, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets Chris Friday: Where We Never Grow Old Presented by Sarasota Art Museum at Sarasota Art Museum May 4 - Aug 10, 2025 Accessibility Info Facebook Twitter Linkedin Buy Tickets Jazz Thursday at the SAM Presented by Sarasota Art Museum and Jazz Club of Sarasota at Sarasota Art Museum Jul 10, 2025 Accessibility Info Facebook Twitter Linkedin SHOW MORE Contact information Email / Website / Facebook / Instagram / Primary address: 1001 South Tamiami Trail, Sarasota, FL 34236 (941) 309-4300 Find An Organization Search by Keyword Organization Type Arts Council/Alliance Association/Club/Group Cabaret/Dinner Theatre Comedy Club Commercial Business Dance Educational Festival Film/Video Food/Drink Foundation Gallery History/Heritage Hospitality Kids/Family Library Media Museum Music Nonprofit Retail Theatre Traditional Arts Visual Arts City/Town Englewood Laurel Longboat Key Nokomis North Port Osprey Sarasota Venice Zip/Postal Code 34223 34224 34228 34229 34230 34231 34232 34233 34234 34235 34236 34237 34238 34239 34240 34241 34242 34243 34260 34272 34274 34275 34276 34277 34278 34284 34285 34286 34287 34288 34289 34292 34293 34295 DIRECTORIES Artists Organizations Venues SUBMIT A LISTING Event Artist Organization ABOUT Sarasota Arts Contact Us Privacy Policy ABOUT The Arts and Cultural Alliance of Sarasota County is a member-powered organization that serves as an advocate for arts and culture in Sarasota County. CONTACT US HOURS : 9 a.m. – 5 p.m. Monday – Friday SARASOTA ARTS | 1226 N. Tamiami Trail, Suite 300 Sarasota FL 34236 941-365-5118 | info@sarasotaarts.org © 2025 - Arts and Cultural Alliance of Sarasota County. All Rights Reserved. { Powered by ARTSOPOLIS }"
    },
    {
      "url": "https://www.sarasotaartmuseum.org/past-programs/",
      "text": "Past Programs - Sarasota Art Museum Skip to content Give Subscribe Search Search for: Menu Visit Tours Digital Guide Educator Resources Accessibility Exhibitions Now Art Deco: The Golden Age of Illustration August 31, 2025–March 29, 2026 Selina Román: Abstract Corpulence August 31, 2025–March 29, 2026 Lillian Blades: Through the Veil June 1–October 26, 2025 Molly Hatch: Amalgam April 25, 2024 – April 26, 2026 Inside Out Jose Alvarez (D.O.P.A) Coming Together Claire Ashley Chromatic Blush: Wee Bairn John Clement Shazam Samo Davis Happiness in ROYGBIV Molly Hatch Staccato John Henry Complexus Jillian Mayer Slumpies Olivier Mosset Untitled Leah Rosenberg 28 Colors (Sarasota, FL) Christian Sampson Vita in Motu Next Janet Echelman: Radical Softness November 16, 2025–April 26, 2026 Something Borrowed, Something New April 19, 2026–September 27, 2026 Maria A. Guzmán Capron: New Works April 19, 2026–September 27, 2026 Beautiful Ideas: The Prints of Sol LeWitt May 17, 2026–October 25, 2026 Exhibition Archive Learn Programs Youth and Family Summer Camp Adult Classes SAM Teen Arts Council Educator Resources School Tours Adult Tours Support Membership Ambassador Program Special Events Art Bash Unconventional Evening En Plein Air Wine Dinner Fresh Perspective Lunch Series SAM Discoveries Exhibition Sponsorship Catalyst for Creativity Campaign Donate About About the Museum The Memory Project Barbara Banks Worker Press Room Shop Bistro Event Rentals FAQ Past Programs December 2021 FAMILY ART SESSIONS Hands-on for the Holidays Week of December 26 – December 31 Sarasota Art Museum 1 pm – 3 pm FREE for Members Included with Museum Admission Celebrate with friends and family this season at Sarasota Art Museum! This year, the Museum is introducing a new lineup of art-making activities for all ages. Whatever your holiday traditions, Sarasota Art Museum is here to help you make new memories and revisit cherished ones. Visit our studios and enjoy drop in hands on art-making activities with a professional artist-educator. From snow globes to imaginary animal portraits, you’re sure to find activities to spark creativity and fun. Sunday, Dec. 26 – Create your own Winter Scene Snow Globes . We’ll play in the studio with oil pastels, watercolors, and fine lines. Monday, Dec. 27 – Inspired by the beauty of birch and aspen trees, we’ll paint together in our Into The Woods workshop . Tuesday, Dec. 28 – Lions, and tigers, and bears, oh my! Drop into our studio and make your own glittering Imaginary Animals . Wednesday, Dec. 29 – Celebrate one of our favorite spirit animals in the Turtles and Tides workshop . We’ll explore these magical creatures and the patterns and textures that define them. Thursday, Dec. 30 – Capture the essence of this adorable primate in our Lemur Portraits studio . Friday, Dec. 31 – Boom, crack, pop! It’s time to ring in the new year. Let’s create a sky full of light and color in our Cityscape Fireworks workshop . November 2021 David Budd, Easter Island I ,  1973 Oil on canvas 60 x 60 in. Collection of Ringling College of Art and Design Photo: Rich Schineller CURATOR TALK David Budd: Motion Within Stillness Emory Conetta and Tim Jaeger Thursday, November 4 6pm – In the galleries Co-curators Emory Conetta and Tim Jaeger will speak about David Budd’s unique approach to abstract painting and the various evolutions of this painting technique the artist explored in the 1970s. This Curator Talk will take place in the 3rd Floor Tom & Sherry Koski Gallery so that the artwork can be experienced during the program. This exhibition is made possible, in part, with generous support from: October 2021 Installation view of Art and Race Matters: The Career of Robert Colescott Photo: Ryan Gamma CURATOR TALK Art and Race Matters: The Career of Robert Colescott Lowery Stokes Sims, Joe Lewis, & Barry Blinderman Thursday, October 28 6pm – Via Zoom Celebrated as a renegade of the art world, Robert Colescott’s paintings evoke powerful emotions and thoughtful contemplation—engaging themes of race, gender, and identity. For this Curator Talk , Lowery Stokes Sims, the exhibition’s co-curator, will discuss the work of Robert Colescott within the greater context of art in the 1980s, accompanied by Joe Lewis and Barry Blinderman. Art and Race Matters: The Career of Robert Colescott is co-curated by Lowery Stokes Sims and Matthew Weseley, and organized by Raphaela Platow, the Contemporary Arts Center’s Alice & Harris Weston Director and Chief Curator. Following its debut in Cincinnati, the exhibition travelled to the Portland Art Museum, Sarasota Art Museum and Chicago Cultural Center. Learn more about the exhibition here Major support of the exhibition has been provided by the Henry Luce Foundation, the National Endowment for the Arts, and Richard Rosenthal; the Andy Warhol Foundation for the Visual Arts for the research phase of the exhibition and the exhibition itself; and the Harold & Arlene Schnitzer CARE Foundation for its support of the catalogue. The exhibition was also awarded a Sotheby’s Prize in 2018 in recognition of curatorial excellence and its exploration of an overlooked and under-represented area of art history. Additional support for this exhibition has been generously provided by: Ernie Kretzmer Gerald and Sondra Biller Fabi World Music Music on the plaza SPIN  - Featuring FABI WORLD MUSIC Thursday 14 October 6 pm – 8 pm Marcy & Michael Klein Plaza SPIN invites you to socialize and experience the contemporary genre of sound through the exploration of musical notes, movement, and engagement. Join us for SPIN on Thursday, August 19, in the Marcy and Michael Klein Plaza for our live music and movement program. ABOUT FABI WORLD MUSIC Fabi World Music is an acoustic trio that explores world music with a Miami twist. Fabi World Music is known for their world beat-rootsy-grooves. Bistro and SHOP will be open for SPIN. BISTRO will be open with full-bar and food menu. Bistro SPIN Menu Guava and cheese pastelitos Miami Chopped- charred corn, hearts of palm, avocado cilantro dressing Rice Bowl- Black beans, charred corn, avocado, cilantro, smoked tomato vinaigrette Columbian style hot dogs with plantain chips- potato sticks, roasted pineapple, pink sauce Churros with dulce de leche Sponsored by: September 2021 Chef Kaytlin Dangaran Executive Chef Bistro at Sarasota Art Museum of Ringling College BISTRO COOKING DEMOS Thailand Thursday, September 30 5 pm – 8 pm Bistro Executive Chef Kaytlin Dangaran of Bistro and Constellation Culinary teaches cooking classic cuisine using simple, quality ingredients to produce honest and great tasting food. Each course will be paired with a classic spirit, wine, or beverage by Café Manager, John Dangaran. Thailand Menu: Green papaya Salad and a lesson on condiments in Thailand Pad Thai you can make at home Mango Sticky rice Installation view of Art and Race Matters: The Career of Robert Colescott Photo: Ryan Gamma SPOTLIGHT TALK Art and Race Matters: The Career of Robert Colescott Tuesday, September 28 6 pm Via Zoom Join us to discuss a selection of artworks in detail with Assistant Curator, Emory Conetta. Spotlight Talks prompt consideration of ideas related to exhibitions and artworks currently on view at the Museum that are not present in exhibition or online text, making each program a unique conversation and experience to engage with the work in new ways. Chef Kaytlin Dangaran Executive Chef Bistro at Sarasota Art Museum of Ringling College BISTRO COOKING DEMOS India Thursday, September 16 5 pm – 8 pm Bistro Executive Chef Kaytlin Dangaran of Bistro and Constellation Culinary teaches cooking classic cuisine using simple, quality ingredients to produce honest and great tasting food. Each course will be paired with a classic spirit, wine, or beverage by Café Manager, John Dangaran. India Menu: Garlic naan bread with black dahl Biriyani and raita Mango Lassi Installation view of Charles McGill: In the Rough Photo: Ryan Gamma CURATOR TALK Charles McGill: In the Rough Guest curator Joe Lewis Thursday, September 9 6 pm Via Zoom Guest curator Joe Lewis will discuss the life and work of artist, educator, and golf professional Charles McGill. While trained as a figurative painter, Charles McGill is celebrated for his assemblage works that re-purpose the plastic, steel, leather, vinyl, and hardware from vintage golf bags, transforming the accessory and game of golf from a symbol of exclusion and privilege to a site for discussions surrounding racial and class inequities. Learn more about this exhibition Joe Lewis is a nationally known non-media-specific artist, professor of art at the University of California, and president of the Noah Purifoy Foundation. He exhibits frequently, most recently at the Museum of Contemporary Art, Oaxaca, Mexico; Museum of Modern Art, and James Fuentes Gallery, New York. His work is in notable collections, including The Los Angeles County Museum CA, Studio Museum in Harlem, Deutsche Bank, and Museum of Modern Art, NY. Lewis has written for Art in America , The LA Weekly , Artforum , and his essays regarding the confluence of art, technology, and society appear in anthologies and peer-reviewed journals. August 2021 Chef Kaytlin Dangaran Executive Chef Bistro at Sarasota Art Museum of Ringling College BISTRO COOKING DEMOS Greece Thursday 26 August 5 pm – 8 pm Bistro Executive Chef Kaytlin Dangaran of Bistro and Constellation Culinary teaches cooking classic cuisine using simple, quality ingredients to produce honest and great tasting food. Each course will be paired with a classic spirit, wine, or beverage by Café Manager, John Dangaran. Greece Menu: The Greek salad of my youth Falafel with all the dips and sauces Baklava July 2021 The Hongs MUSIC ON THE PLAZA SPIN - Featuring The Hongs Thursday 15 July 6 – 8 pm Marcy & Michael Klein Plaza SPIN invites you to socialize and experience the contemporary genre of sound through the exploration of musical notes, movement, and engagement. Join us for SPIN every third Thursday this summer in the Marcy and Michael Klein Plaza for our live music and movement program. ABOUT THE HONGS Multinational Afro-Beat/electronic rock group, The Hongs, was formed by Jamaican-born musician, Gordon Myers, and have since become one of the most popular bands of the international Miami music scene. The Hongs blend elements of Afro-Beat/electro-pop with nu-wave creating a unique sound. Spreading the dance/Afro-Beat/rock/electro/house hybrid one toe at a time…The Hongs inspire Art. BISTRO – SPIN MENU BISTRO will be open with a full bar and food menu. BISTRO SPIN SPECIALS ROASTED CHICKEN AND CORN EMPANADAS with chipotle aioli SPINACH AND MANCHEGO EMPANADAS ARUGULA WITH CHARRED CORN warm bacon vinaigrette and heirloom tomatoes BLACKENED MAHI SANDWICH with house made tartar sauce and chips TRES LECHE CAKE with cinnamon whipped cream June 2021 Shantel Norman & Co. MUSIC ON THE PLAZA SPIN - Featuring Shantel Norman & Co. Thursday 17 June 6 – 8 pm Marcy & Michael Klein Plaza SPIN invites you to socialize and experience the contemporary genre of sound through the exploration of musical notes, movement, and engagement. Beginning June 17 , join us for SPIN every third Thursday this summer in the Marcy and Michael Klein Plaza for our live music and movement program. ABOUT SHANTEL NORMAN & CO. Considered one of the best singers in the United States, this native of Lexington, North Carolina will lighten up your evening with pop, rock, soul, and funk. Shantel Norman was a contestant on the Apollo Theater Amateur Night in New York City, Triad Idol (North Carolina), and appeared on ABC Network’s reality show Karaoke Battle USA , which was hosted by Joey Fatone (N-Sync), with panel judges Carnie Wilson (Wilson Phillips), Joe Levy (Editor-in-Chief, Rolling Stone and Maxim magazines), and Brian “The Cowboy” Scott (Former Karaoke World Champion, and Country Songwriter). BISTRO – SPIN MENU BISTRO will be open with a full bar and food menu. BISTRO SPIN SPECIALS Watermelon Salad with mint and feta and a white balsamic vinaigrette Roasted beet and goat cheese tartine Pear, gorgonzola, and truffle balsamic flatbread Smoked Salmon with dill cream, heirloom tomatoes, and herb salad on ciabatta Bison meatball sliders Watermelon Gin cooler with rosemary May 2021 Héctor Esrawe and Ignacio Cadena, Los Trompos , (2015) Photo: Sarasota Art Museum FREE DAY Free Day Activities Sunday 30 May Museum Free Day is the last Sunday of every month. Join us for Museum Free Day! Bring your friends and family to explore new art and thought-provoking exhibitions, and participate in our fun activities. Mary’s Front Porch – 11:15 am to 12:00 pm Imagine sitting on a front porch and curling up to a good book. Let your imagination glide along as the words take you to another place. Absorbing the words brings about knowledge, imagination, and exposure to vocabulary. Encouraging a thirst for knowledge, the Front Porch is where children of all ages can share their imagination and creativity. Musical Interludes – 12:00 pm to 1:30 pm All instrumental – performers are local musicians. First musician/group is the Michael Ross Trio . Mr. Ross’s motto is: “Get a good sound, swing hard, and play the bass like a bass.” What is your medium?- 2:00 pm to 4:00 pm Many individuals come to the museum to view the art but many may not understand the art medium that the artist utilizes to express their art movement. What is your medium? is a program that can be offered either during Free Day where each individual have the opportunity to learn a particular medium – it is an introductory class and at the end of the session, each individual will receive a brown bag to carry the supplies that are given to take home. This program can be both an exhibition-related and non-exhibition-related program. This will allow the museum to engage with the teaching artists group here in Sarasota. This program is an art driven life for everyone. First art medium is: Watercolor. Carl Abbott, La Musa Azul Lunch & Learn : Express art history talks La Musa Azul with Carl Abbott Tuesday 25 May 12 pm Marcy & Michael Klein Plaza FREE for Museum Members; $10 not-yet Museum Members RSVP required. Grab lunch from the Bistro and join Carl Abbott to learn about his La Musa Azul installation at the Museum. Thonet Exhibit at Bistro LUNCH & LEARN: EXPRESS ART HISTORY TALKS Perfect Objects: Michael Thonet's No. 14 Chair Tuesday 18 May 12 pm Marcy & Michael Klein Plaza The Perfect Objects series puts the spotlight on iconic design objects and why they are so enduring. Yoga for ALL Photo: Sarasota Art Museum Movement at the Museum YOGA FOR ALL Sunday 16 May 10 am Marcy & Michael Klein Plaza The Movement Series unites mind and body for a holistic art experience. Chef Kaytlin Dangaran Executive Chef Bistro at Sarasota Art Museum of Ringling College Bistro Cooking Demo Italy Thursday 13 May 5:30 pm Bistro Join us for an unforgettable cooking experience with Executive Chef Kaytlin Dangaran of Bistro and Constellation Culinary as she teaches cooking classic cuisines from around the globe using simple, quality ingredients to produce honest and great tasting food. Each course will be paired with a classic spirit or wine. Italy Menu Classic Negroni Cocktail Crudo Two Ways: Tuna Crudo with caperberries & Snapper Crudo with pistachio and mint Branzino — Olives, charred lemon, parsley Chocolate Budino with Amaretti crumble Ariel Blue Music on the plaza Ariel Blue Saturday 8 May 11 am – 1 pm Marcy & Michael Klein Plaza Grab brunch from Bistro and join us en plein air to hear vocalist Ariel Blue sing an array of music from jazz, pop, soul, and classic R&B. Ariel is an actor, singer, and writer, and she performs on mainstage productions with Westcoast Black Theatre Troupe and Florida Studio Theatre Improv. Marcy & Michael Klein Plaza Photo: Ryan Gamma MOVEMENT AT THE MUSEUM Meditation for ALL Sunday 2 May 10 am Marcy & Michael Klein Plaza The Movement Series unites mind and body for a holistic art experience. Héctor Esrawe and Ignacio Cadena, Los Trompos , (2015) FAMILY DAY Look, Talk, Create! Saturday 1 May 2 pm – 4 pm Thomas McGuire Hall Family Day offers art-making activities and educational experiences for visitors of all ages to engage with art and one another. Look: Enjoy the Janaina Tschäpe: Between the Sky and the Water exhibition prior to Family Day activities. Admission is free for those 17 and under accompanied by an adult. Enjoy: Come enjoy lunch specials at the Bistro prior to the presentation and art-making activities. Specials include: Waffles with strawberries and whipped cream, red velvet whoopie pies, and strawberry Shirley Temples. Talk: Seating for the presentation and art-making activities will open at 2pm. At 2:15pm, we will start our interactive presentation, where Emory Conetta, the Museum’s Curatorial Assistant, will guide us in exploring the works in the exhibition, and Ross Johnston, an Environmental Scientist, will speak on the aquatic animals that can be experienced in the Museum’s current exhibition and the importance of recycling and reuse to protect our oceans and wildlife. Create: Use materials provided by the Museum to create your own aquatic-inspired artwork to take home! Sponsored by: April 2021 Rudolph on-site during construction of Temple Street Parking Garage 1959-1963, Photo: Judith York Newman Lunch & Learn: Express Art History Talks The Architecture of Paul Rudolph Tuesday 27 April 12 pm Virtual – via Zoom Join us for this virtual program to learn about the architecture of Paul Rudolph with the Museum’s Curatorial Assistant, Emory Conetta. Janaina Tschäpe, Livia 2 (2003) Cibachrome, 40 x 50 in. On loan from the National Museum of Women in the Arts, Washington DC, Gift of the Tony Podesta Collection, Washington D.C. Photo: Janaina Tschäpe ARTIST TALK Janaina Tschäpe Wednesday 21 April 7:30 pm 6-7 pm Prix Fixe Dinner (Optional) Marcy & Michael Klein Plaza Join us for a special evening en plein air for an artist talk with Janaina Tschäpe, who will be discussing her exhibition at the Museum. If joining us for dinner prior, you will be able to pick up a pre-arranged dinner and drink from Bistro between 6-7pm to enjoy your meal before the talk. Seating will begin at 7pm for the talk and will be on a first come, first served basis. Sponsored by: Yoga for ALL Photo: Sarasota Art Museum Movement at the Museum YOGA FOR ALL Sunday 18 April 10 am Marcy & Michael Klein Plaza The Movement Series unites mind and body for a holistic art experience. Héctor Esrawe and Ignacio Cadena, Los Trompos , (2015) FAMILY DAY Look, Talk, Create! Saturday 10 April 2 pm – 4 pm Thomas McGuire Hall Look : Enjoy the Janaina Tschäpe: Between the Sky and the Water exhibition prior to Family Day activities. Admission is free for those 17 and under accompanied by an adult. Talk : Emory Conetta, the Museum’s Curatorial Assistant, and Ross Johnston from Mote Marine will speak on the aquatic animals that can be experienced both at Mote and in the Museum’s current exhibition, Janaina Tschäpe: Between the Sky and the Water. Create : Use materials similar to the artist to create your own aquatic-inspired artwork to take home! Sponsored by: Carl Abbott The Bayou Studio at Sarasota Art Museum 2021 Photo: Ryan Gamma ARCHITECT TALK Carl Abbott Thursday 8 April 6:30 pm Thomas McGuire Hall Join us for a talk with Carl Abbott as he discusses his exhibition at the Museum. Sarasota Art Museum Photo: Ryan Gamma Lunch & Learn: Express Art History Talks The Architecture of M. Leo Elliott Thursday 8 April 12 pm Marcy & Michael Klein Plaza Grab lunch from Bistro and join us to learn about the Museum Campus architecture by M. Leo Elliott March 2021 Marcy & Michael Klein Plaza Photo: Ryan Gamma Lunch & Learn: Express Art History Talks Zen Jail by JPW3 Thursday 25 March 12 pm Marcy & Michael Klein Plaza Grab lunch from the Bistro and join us to learn about JPW3’s Zen Jail . Yoga for ALL Photo: Sarasota Art Museum Movement at the Museum YOGA FOR ALL Sunday 21 March 10 am Marcy & Michael Klein Plaza The Movement Series unites mind and body for a holistic art experience. Paperclips Source: officemuseum.com Lunch & Learn: Express Art History Talks Perfect Objects: The Paperclip Tuesday 2 March 12 pm McGuire Hall The Perfect Objects series puts the spotlight on iconic design objects and why they are so enduring. February 2021 Marcy & Michael Klein Plaza Photo: Ryan Gamma Lunch & Learn: Express Art History Talks Zen Jail by JPW3 Thursday 25 February 12 pm Marcy & Michael Klein Plaza Grab lunch from the Bistro and join us to learn about JPW3’s Zen Jail . Marcy & Michael Klein Plaza Photo: Ryan Gamma Movement at the Museum YOGA FOR ALL Sunday 21 February 10 am Marcy & Michael Klein Plaza The Movement Series unites mind and body for a holistic art experience. Timex Watch ©Timex Archive Lunch & Learn: Express Art History Talks Perfect Objects: Timex Watch Tuesday 16 February 12 pm McGuire Hall The Perfect Objects series puts the spotlight on iconic design objects and why they are so enduring. Marcy & Michael Klein Plaza Photo: Ryan Gamma Movement at the Museum Meditation for ALL Sunday 14 February 10 am Suhler Gallery The Movement Series unites mind and body for a holistic art experience. Carl Abbott, La Musa Azul Lunch & Learn: Express Art History Talks La Musa Azul by Carl Abbott Thursday 11 February 12 pm Marcy & Michael Klein Plaza Grab lunch from the Bistro and join us to learn about Carl Abbott’s La Musa Azul installation from one of the Museum’s crew members! January 2021 Marcy & Michael Klein Plaza Photo: Ryan Gamma Lunch & Learn: Express Art History Talks Architecture: Paul Rudolph & M. Leo Elliott Thursday 28 January 12 pm Marcy & Michael Klein Plaza Grab lunch from the Bistro and join us to learn about the Museum Campus architecture by Paul Rudolph & M. Leo Elliott. May 2020 Max Strang Photo: Strang Architects ARTIST TALK Architecture in the Anthropocene Max Strang Thursday 7 May 6pm Architect Max Strang will discuss his visionary “paper project,” Orlampa , a dystopian blueprint for coastal Floridians to respond with when the seas rise and push us inland. This talk is part of the Museum’s Architecture in the Anthropocene initiative. The Architecture in the Anthropocene series asks a simple question: In a world of shifting climate trends, environmental stress that drives humans to migrate and relocate, and radical new technologies that are blurring the boundaries of organic and machine, how should we be building? Or, perhaps, should we be building? What futures should we prepare for? What materials should we be constructing with? This series will investigate how we are prepared, or not, for our era. POSTPONED April 2020 Leah Rosenberg Photo: Montalvo Arts Center ARTIST TALK Leah Rosenberg Thursday 30 April 6pm Based in San Francisco, Rosenberg’s art spans painting, installation, sculpture, printmaking, and food, while focusing on the role of color in our lives and its emotional and psychological impact. She has done a number of site-specific installations in which she mines the local landscape for inspirational colors, then incorporates them into lively designs that respond to the architecture of the site. Come hear her speak about 28 Colors (Sarasota, FL) , currently installed in our Museum lobby and stairwell, and find out which Sarasota colors captured her curiosity! POSTPONED Sophia Anna Szokolay, Dae Hee Ahn, Audrey Chen and Lauren Siess, Alumni from Perlman Music Program PERFORMANCE The Shock of the New Sunday 19 April 3pm All art was once contemporary. Come listen and learn about how these groundbreaking works of art were first received. Presented in partnership with The Perlman Music Program/Suncoast Sponsored by Williams Parker Attorneys At Law POSTPONED Jennifer Packer Photo: Albert Hosia Jerriod Avant ARTIST TALK The Work and Influences of Jennifer Packer Sunday 19 April 1pm 2020 Hermitage Greenfield Prize Winner Jennifer Packer will speak about her life and work as an artist, followed by a conversation with Greenfield Prize Jury Chair Valerie Cassel Oliver, curator of Modern and Contemporary art at the Virginia Museum of Fine Arts. Join us for a screening of The Last Green Thread followed by a discussion with conservationist and subject of the film, Mallory Dimmitt of Florida Wildlife Corridor. POSTPONED Florida Wildlife Corridor FILM SCREENING The Last Green Thread Saturday 18 April 4pm 18 min On a narrow path through Florida’s Everglades Headwaters, three friends embark on a journey to survey a fragile wilderness corridor before it disappears forever. Amidst a backdrop of massive development and population growth, their expedition documents the vitality and connectedness of an ecosystem in a state of rapid transformation. Mother nature may be resilient, but when the last green thread is stretched to the breaking point, can we summon the courage and resourcefulness to change course? Join us for a screening of The Last Green Thread followed by a discussion with conservationist and subject of the film, Mallory Dimmitt of Florida Wildlife Corridor. POSTPONED PAMM Director Franklin Sirmans with Arturo Herrera's When Alone Again III, (2001) Photo: Angel Valentin SCHOOL OF THOUGHT Frank Sirmans Thursday 16 April 6pm Join us for a conversation with Franklin Sirmans, Executive Director of the Pérez Art Museum, and Sarasota Art Museum’s Executive Director, Anne-Marie Russell, about the state of contemporary art museums and the challenges we face today in terms of shifting societal expectations. Relative to the art museum, how can we maintain scrutiny, accountability, and decolonization efforts in the face of a rapidly shifting world on the global and local scale? Franklin Sirmans has been the director of the Pérez Art Museum, Miami since 2015. Previously serving as the curator of contemporary art at the Los Angeles County Museum of Art, Sirmans has an extensive background in the fields of art criticism, curating, and writing. POSTPONED Maurizio Cattelan, Comedian (2019) Photo: John Taggart MASTER CLASS THE ART MARKET: What’s Up with that Banana, Anyway? Tuesday 14 April 10am - 12pm This season’s Master Class focuses on the art market. How is the art market like other markets? How is it different? What do we mean when we talk about value? What are we actually buying when we acquire a work of art? What does it mean to “own” art? Enjoy a lively discussion about all this and more (and yes, we will address the banana…)   Master class includes light refreshments and materials. POSTPONED Liam Gillick, Pinboard Prototype 1 (Milan House Project) (1993) THIS IS WHAT HAPPENED: ART SINCE THE 60s Conclusion & Discussion Tuesday 7 April 6pm This session will recap the previous 14 talks. If you missed them, this will be a fun “speed art history” session! This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. POSTPONED March 2020 Mona Hatoum, Light Sentence (1992) THIS IS WHAT HAPPENED: ART SINCE THE 60s The 90s Part II Relational Aesthetics & Immersive Installation Tuesday 31 March 6pm VR before VR. The Real Real. Life as art. Art as life. The presentation of self in everyday life. What is theatre, what is performance, what is living, what is a set, what is a sculpture? This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. POSTPONED M. Leo Elliott Building – Former Sarasota High School Photo: City of Sarasota THE MEMORY PROJECT Let's Talk : Dr. Thomas W. (Bill) Clyburn, PH.D. Saturday 21 March 4 pm In 1954, Brown v. Board of Education of Topeka, 347 U.S. 483, was a landmark decision of the U.S. Supreme Court which ruled that U.S. state laws establishing racially segregated public schools as unconstitutional. Yet it took nine years for Sarasota High School to be integrated. Dr. Thomas Clyburn was one of two students to integrate the all-white institution. Dr. Clyburn will share his story about his experience during this period, and then he and the Museum’s Director of Public Engagement, Michele Parchment, will sit down in conversation to further unpack this complex period in our nation’s history and how it played out here in the Elliott building. POSTPONED Sharon Lockhart, Ohne Titel (Spiral) (1997) THIS IS WHAT HAPPENED: ART SINCE THE 60s The 90s Part I Photography & Identity Tuesday 17 March 6 pm Our preferred medium of verisimilitude can’t help but form a relationship to our sense of self. See how these twinned practices intersected in the 90s. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. POSTPONED Gerard Richter, Gelbrün (Yellow-Green) (1982) THIS IS WHAT HAPPENED: ART SINCE THE 60s Painting is Dead. Long Live Painting. Painting in the 80s Tuesday 3 March 6 pm We humans have been at this painting thing for a long time. It keeps dying, and it keeps coming back. Why? This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. February 2020 Dan Cameron Photo: Knight Foundation ARTIST TALK Dan Cameron on Tony Feher Thursday 27 February 6 pm Dan Cameron is a New York-based curator, art writer, arts administrator, archivist and educator. Cameron was Senior Curator at the New Museum from 1995 to 2006, and he is the founder of Prospect New Orleans. He was Chief Curator at Orange County Museum of Art in Newport Beach, California from 2012 to 2015 and has headed major international projects since then. As part of Color. Theory. & (b/w), Cameron guest curated three works by artist Tony Feher. Following heightened political activism on AIDS-related issues and his own health struggles, Feher’s artistic practice evolved into discovering devalued objects whose “colors and forms conveyed the clarity and simplicity in their found state that matched the ideal in Feher’s own mind.” Richard Hamilton, Just what was it that made yesterday’s homes so different, so appealing (1956) THIS IS WHAT HAPPENED: ART SINCE THE 60s Global Pop Tuesday 18 February 2020 6pm Take a tour around the world to see how “Pop Art” takes on the vernacular. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. Waste Land , Directed by Lucy Walker Waste Land Thursday 13 February 2020 6pm Directed by Lucy Walker 98 min. Waste Land follows renowned artist Vik Muniz as he journeys from his home base in Brooklyn to his native Brazil and the world’s largest garbage dump, Jardim Gramacho, located on the outskirts of Rio de Janeiro. There he photographs an eclectic band of catadores— self-designated pickers of recyclable materials. Muniz’s initial objective was to “draw” the catadores with garbage. However, his collaboration with these inspiring characters as they recreate photographic images of themselves out of garbage reveals both the dignity and despair of the catadores as they begin to re-imagine their lives. January 2020 Jerry Saltz, Photo: Sciulli/Getty Images for Vulture Festival How to Look at Art with Jerry Saltz Thursday 23 January 2020 6pm A special evening with one of the art world’s most celebrated and passionate voices, Jerry Saltz. Jerry Saltz is the senior art critic at New York Magazine and its entertainment site, Vulture. He is the winner of the 2018 Pulitzer Prize in Criticism and the 2019 National Magazine Award. Before joining New York Magazine, Saltz had been art critic for The Village Voice since 1998 and was twice nominated for the Pulitzer Prize during his tenure there. Saltz is both the go-to broadcast commentariat on art world issues (i.e. Koons’ Rabbit sale) and one of the rare art critics who manages to make criticism both smart and fun. A frequent guest lecturer, he has spoken at the Museum of Modern Art, the Guggenheim, the Whitney Museum, and many others and has appeared at Harvard, Yale, Columbia, the Rhode Island School of Design, the Art Institute of Chicago, and numerous other prestigious venues. Saltz’ new book How to be an Artist will be published by Riverhead Books in March 2020. Jerry Saltz’s How to look at Art was part of the Museum’s How to… series which takes a look at the simple approach to the complex challenges of life to look at how we might best live in the world today.  For example, How to…Eat when hundreds of millions of people around the globe are food insecure or worse, how should we eat for the health of our planet and the health of our bodies? Nutritionists, environmentalists, chefs and policy experts will weigh in on the subject. How to…Build looks at what materials are both cost effective and have limited extraction impact? How should we prepare our buildings to withstand the ravages of a constantly shifting climate? Should government agencies mandate style? Listen to architects, climate scientists and urban planners discuss. How to…Write a Letter looks at some epic correspondence from the past and examines what it takes to craft a letter in an era of tweets and texts. How to… Read the Newspaper looks at the editorial process to see how the print edition is shaped to establish hierarchies of information. How to…Think welcomes a philosopher, an educator and a brain scientist to discuss how we process information and how we can develop our critical thinking faculties in a world of overstimulation. Sam Gilliam, Carousel Change ,   (1970) THIS IS WHAT HAPPENED: ART SINCE THE 60s What Happened? Conclusion & Discussion Tuesday 14 January 2020 6pm What happened during This is What Happened? This interactive session will draw some conclusions, find patterns and themes, open up new paths of exploration and evaluation for the period and set the stage for the Spring series, Art Now: Art Since the 90s. This talk is the conclusion to the art history series titled, This is What Happened: Art Since the 60s. The next series will start in Spring 2020. These sessions are open to the general public and double as a core component of the Museum’s docent training program. Vik Muniz, Daisies in a Jam Jar (2014) ART ON FILM Worst Possible Illusion: The Curiosity Cabinet of Vik Muniz Thursday 9 January 2019 6pm Worst Possible Illusion is an intimate look at the creative life and work of one of the art world’s most heralded artists, Vik Muniz. The film follows Muniz on a whimsical, world-hopping journey from his studio in Brooklyn, New York, to his native Brazil to see his grandmother; to Chicago, his first home in the United States where he worked as a gas-station attendant and pushed carts in a grocery store; to Arizona, where he creates a gigantic bone drawing in the desert and goes to extraordinary lengths to capture it on film. In this engaging documentary, Muniz charmingly articulates his modus operandi and philosophies, providing the viewer with an enchanting, intimate and humorous glimpse into his creative life and work. After the screening, find out how to draw in the sky, hire a helicopter to shoot an earthwork and capture it all on film during the Q&A with the filmmaker. Peter Campus, Video Ergo Sum (2017) THIS IS WHAT HAPPENED: ART SINCE THE 60s Video & Digital Art Tuesday 7 January 2020 6pm As always, new technologies drive new art forms. From the early days of the digital revolution to just before the advent of the smartphone, the scaling down of technologies to make them accessible to a wider audience has resulted in a societal revolution that has totally shifted our apprehension of the world around us. Learn about early screen and projection-based pioneers and see how the history of film and the history of art have long been intertwined. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. 2019 November 2019 Worst Possible Illusion: The Curiosity Cabinet of Vik Muniz (2003) Photo: Coke Wisdom O'Neal ART ON FILM Worst Possible Illusion: The Curiosity Cabinet of Vik Muniz Thursday 14 November 2019 6pm Worst Possible Illusion is an intimate look at the creative life and work of one of the art world’s most heralded artists, Vik Muniz. The film follows Muniz on a whimsical, world-hopping journey from his studio in Brooklyn, New York, to his native Brazil to meet his grandmother; to Chicago, his first home in the United States, where he worked as a gas-station attendant and pushed carts in a grocery store; to Arizona, where he creates a gigantic drawing in the desert and goes to extraordinary lengths to capture it on film. In this engaging documentary, Muniz charmingly articulates his modus operandi and philosophy, providing the viewer with an enchanting, intimate and humorous glimpse into his creative life and work. Marina Abramovic, Art must be beautiful, Artist must be beautiful , (1975-76) THIS IS WHAT HAPPENED: ART SINCE THE 60s Feminist Art Tuesday 26 November 2019 6pm Recent examinations, such as the WACK! Art & the Feminist Revolution exhibition, have helped deepen our understanding of just how influential so-called “Feminist Art” has been. Using Linda Nochlin’s groundbreaking 1971 essay “ Why Have There Been No Great Women Artists ” as a starting point, we’ll begin to unpack the deeply influential and wide-ranging works, people and ideas that make up this “movement”. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. Judy Chicago, Rainbow Pickett , (1965, recreated 2004) and Trinity (1965) THIS IS WHAT HAPPENED: ART SINCE THE 60s Minimalism Tuesday 19 November 2019 6pm Long misunderstood, “Minimalism” has become a catchall phrase for “less is more”, but what were these artists truly examining through their pioneering investigations of space? Learn about how both Warhol and Judd can be considered “Minimalists” and how art exhibitions and artist communities shape our ideas about what constitutes a “movement”. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. 7000 Oaks — City Forestation Instead of Josephy Beuys, City Administration (German: 7000 Eichen — Stadtverwaldung statt Stadtverwaltung) (1982-1987) THIS IS WHAT HAPPENED: ART SINCE THE 60s Social Sculpture Tuesday 12 November 2019 6pm Each generation creates a new moniker for these related practices—Social Sculpture, Relational Aesthetics, Social Practice Art. Central to all of these movements is the notion that art is a transformative agent in shaping society, and that the role of the citizen is to engage as an active agent in the process of bringing about the world. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. Robert Smithson, Spiral Jetty (1970) THIS IS WHAT HAPPENED: ART SINCE THE 60s Earth Art Tuesday 5 November 2019 6pm “Earth Day” officially began in 1970, but artists have long been engaged with the natural world, as the history of landscape painting can attest. Learn about how artists of this period took their environmental interests, combined them with political activism and exploration beyond the museum-gallery system, and created a new generation of “Earth Art”. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. October 2019 Joseph Kosuth, One and Three Chairs, (1965) THIS IS WHAT HAPPENED: ART SINCE THE 60s Conceptual & Process Art Tuesday 29 October 2019 6pm Inspired by anti-consumerist gestures, a rising interest in non-western cosmologies, and a desire to ensure the prominence of ideas over objects, so-called “Conceptual Art” resonates with the rise of “experienced-based” consumer phenomena we are witnessing today. This session will examine the wide-ranging set of investigations circulating around the “dematerialization of art”. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. Allan Kaprow, Women licking jam off a car from happening household (1964) Photo: Sol Goldberg THIS IS WHAT HAPPENED: ART SINCE THE 60s Happenings & Performance Tuesday 22 October 2019 6pm Visual artists have long toyed with performance and play, and engaged in a variety of experimental, experiential gestures that blur the lines of visual art and theatre. Learn about the early origins of performance, such as Dada’s “ Cabaret Voltaire “, that laid the groundwork for everyone from Allan Kaprow through Gutai to the Viennese Actionists. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. Édouard Manet, Olympia ,  (1863) THIS IS WHAT HAPPENED: ART SINCE THE 60s Prehistory of Postmodernism Tuesday 15 October 2019 6pm When the radical group of artists who came to be known as the Impressionists burst onto the scene in 1874, our ideas about “art” were forever changed, and the notion of the avant-garde was born. While the art emerging in the 1960s may have seemed shocking and new, these revolutionary gestures are rooted in an earlier era. Learning about “contemporary art” from the 1860s will help you grasp and appreciate the new, now. This talk is part of an on-going art history series titled, This is What Happened: Art Since the 60s. These sessions are open to the general public and double as a core component of the Museum’s docent training program. April 2019 Parrish Art Museum by Herzog & de Meuron Photo: Matthu Placek CURATOR TALK Dr. Alicia Longwell Thursday 18 April 2019 6pm Dr. Longwell, Lewis B. and Dorothy Cullman Chief Curator at the Parrish Art Museum in Long Island, will discuss the curatorial program of the Parrish, developed over her thirty-five year tenure at the Museum. She has organized numerous survey and solo exhibitions on Marsden Hartley, Frederick Kiesler, Dorothea Rockburne, Alan Shields, and Jack Youngerman. Longwell received her Ph.D. from the Graduate Center, City University of New York, where her dissertation topic was John Graham, the subject of a retrospective she organized for the Parrish Art Museum in 2017. Valerie Cassel Oliver, VFMA Curator of Modern & Contemporary Art Photo: VMFA CURATOR TALK Valerie Cassel Oliver Thursday 4 April 2019 6pm Join us for a conversation with Valerie Cassel Oliver, Sydney and Frances Lewis Family Curator of Modern and Contemporary Art, Virginia Museum of Fine Arts. Previously the Senior Curator at the Contemporary Arts Museum Houston, she also co-curated the Whitney Museum of American Art’s Biennial Exhibition in 2000 and directed the Visiting Artists Program at the School of the Art Institute of Chicago. She will be speaking on her curatorial practice and her most recent project co-curating the first major survey of the work of Howardena Pindell. March 2019 Sheila Hicks in front of elements from The Treaty of Chromatic Zones (2015) Photo by: Cristobal Zanartu CURATOR TALK Sheila Hicks: Material Voices Thursday 21 March 2019 6pm Drawing on global weaving traditions, the history of painting and sculpture, and architecture, Sheila Hicks has redefined how fiber is used to create art, influencing a generation of artists. Curator Karin Campbell of Joslyn Art Museum will share how Hick’s oeuvre has taken shape over time and discuss the essential links between the artist’s work and lived experience. Roy Lichtenstein, Magnifying Glass , (1963) MASTER CLASS Part II: Collector's Series Tuesday 12 March 2019 10am Master Classes offer a deeper look at various subjects, though are designed for any level, so no advance training is required. The Connoisseurship Series is a 3-part series, and need not be done in order as the courses will rotate continuously. PART II: We all gather things around us, but what makes a “collection”? What is the difference between “shopping” and “collecting”? An art collection is a highly personalized reflection of the collector — one’s values, one’s interests, one’s ‘taste.’ Are you interested in starting a collection? Do you have art, but not sure if it constitutes a collection? This Master Class will look at some extraordinary collections and collectors, examine what makes a great collection, and offer insight into how to develop a collection, on any budget. Princess, performance duo Alexis Gideon and Michael O'Neil Photo: Courtesy of the Artists PERFORMANCE Out There: Performance by Princess Tuesday 9 March 2019 8pm The performance duo Princess, comprising of Alexis Gideon and Michael O’Neil (JD Samson & MEN), use music as the backbone of a multi-disciplinary practice that often explores issues of queerness and the concept of masculinity. Simultaneously gay, straight, queer, masculine, and feminine, Princess embodies the fluidity and coherence between the seemingly contradictory. Out There is a concept video album and live performance that explores the role men ought to be playing during the current cultural reckoning of misogyny. According to the artists, the science fiction narrative piece is likened to Beyoncé’s “Lemonade” meets “Hamilton” meets Kraftwerk, and builds on the long legacy of concept albums like Ziggy Stardust and Deltron 3030. The world premiere of Out There takes place at the Andy Warhol Museum on March 1, followed by a tour and the NYC premiere at the New Museum in April. February 2019 Emilios Farrington-Arnas. Maptic Device , (2016) CURATOR TALK ACCESS + ABILITY Thursday 28 February 2019 6pm There has been a surge of design with and by people with a wide range of physical, cognitive, and sensory abilities. Cara McCarty, Curatorial Director at Cooper-Hewitt Smithsonian Design Museum and co-curator of the exhibition Access + Ability , will explore how users and designers are expanding and adapting accessible products and solutions in ways previously unimaginable, from low-tech products that assist with daily routines to the newest cutting-edge technologies. Waste Land , Directed by Lucy Walker ART ON FILM Waste Land Tuesday 12 February 2019 7pm Filmed over nearly three years, Waste Land follows renowned artist Vik Muniz as he journeys from his home base in Brooklyn to his native Brazil and the world’s largest garbage dump, Jardim Gramacho, located on the outskirts of Rio Janeiro. There he photographs an eclectic band of “catadores” — self designated pickers of recyclable materials. Muniz’s initial objective was to “paint” the catadores with garbage. However, his collaboration with these inspiring characters as they recreate photographic images of themselves out of garbage reveals both the dignity and despair of the catadores as they begin to re-imagine their lives. Toshiko Horiuchi MacAdam, Rainbow Net (2012) Extraordinary Playscapes Tuesday 12 February 2019 7pm What we learn through play impacts our physical, mental, social, and creative health — and designers, architects, and play advocates are taking notice. Extraordinary Playscapes examines the art, history, science, and importance of play while telling the story behind some of the most incredible play spaces in the world. From towering treetop paths to hand-knit crochet playgrounds, scholar Amanda Hawkins of Design Museum Foundation will share how architects and designers worldwide are engaging diverse communities to translate play objectives into state-of-the-art and meaningful environments. January 2019 Jean Shin, Chance City ,(2001-09) ARTIST TALK Jean Shin Thursday 31 January 2019 6pm Jean Shin is nationally recognized for her monumental installations that transform everyday objects into elegant expressions of identity and community. For each project, she amasses vast collections of a particular object — prescription pill bottles, sports trophies, sweaters — which are often sourced through donations from individuals in a participating community. These intimate objects then become the materials for her conceptually rich sculptures, videos, and site-specific installations. Distinguished by her meticulous, labor-intensive process, and her engagement of the community, Shin’s arresting installations reflect individuals’ personal lives as well as collective issues that we face as a society. Past Programs 2016-2018 Back to Current Programs Sarasota Art Museum Ringling College Museum Campus 1001 South Tamiami Trail Sarasota, FL 34236 info@sarasotaartmuseum.org create new email (941) 309-4300 opens phone dialer Have An Art-Filled Visit to Sarasota Visit Membership Exhibitions Programs About Shop Bistro FAQ Event Rentals Press Room Careers Privacy Policy Donate to the Museum Become a Member Join our Email List Follow us on social media Ringling College of Art and Design Ringling College of Art and Design Since 1931, Ringling College of Art and Design has cultivated the creative spirit in students from around the globe. The private, not-for-profit, fully accredited college offers the Bachelor of Fine Arts degree in eleven disciplines and the Bachelor of Arts in two. The College’s rigorous curriculum employs the studio model of teaching and immediately engages students through a comprehensive program that is both specific to the major of study and focused on the liberal arts. The Ringling College teaching model ultimately shapes students into highly employable and globally aware artists and designers. For more information visit www.ringling.edu and follow the College on Facebook , Instagram , Twitter , LinkedIn , and YouTube . Learn more about Ringling College © Sarasota Art Museum 2025"
    }
  ]
}