{
  "fuentes": [
    {
      "url": "https://www.excellentice-kirkland.com/en/contact-us/",
      "email": "info@excellentice-kirkland.com"
    },
    {
      "url": "https://www.excellentice-kirkland.com/en/contact-us/",
      "email": "info@excellentice-kirkland.com"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    },
    {
      "url": "https://www.sarasotafair.com/events/2024/sarasota-sharks-tooth-festival2",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://www.sarasotafair.com/events/2024/https2guysshowscom",
      "email": "guylemakos@yahoo.com"
    },
    {
      "url": "https://www.sarasotafair.com/events/2024/https2guysshowscom",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://www.sarasotafair.com/p/about/contact-us",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://www.sarasotafair.com/p/about/contact-us",
      "email": "rory@sarasotafair.com"
    },
    {
      "url": "https://www.tsnn.com/venues/robarts-arena-sarasota-fairgrounds",
      "email": "dtormohlen@tsnn.com"
    },
    {
      "url": "https://www.sarasotafair.com/",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://www.sarasotafair.com/events/2025/riverview-high-school-graduation",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://www.sarasotafair.com/events",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://thearenagroup.net/about-us",
      "email": "media@thearenagroup.net"
    },
    {
      "url": "https://www.sarasotafair.com/events/2024/httpswwwcaiwestfloridaorgsitehomecfm",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://allmusicmagazine.com/venues/sarasota-county-fairgrounds-robarts-arena/",
      "email": "all-music-logo-white@2x.png"
    },
    {
      "url": "https://allmusicmagazine.com/venues/sarasota-county-fairgrounds-robarts-arena/",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://www.sarasotafair.com/p/about/board-of-directors",
      "email": "info@sarasotafair.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://arenagroup.com/usa/contact/",
      "email": "info@arenaamericas.com"
    },
    {
      "url": "https://sarasotaguitarshow.com/",
      "email": "ktw@clevaone.com"
    },
    {
      "url": "https://www.sarasotafair.com/p/getinvolved/robards-arena",
      "email": "info@sarasotafair.com"
    }
  ],
  "mails": [
    "all-music-logo-white@2x.png",
    "dtormohlen@tsnn.com",
    "guylemakos@yahoo.com",
    "info@arenaamericas.com",
    "info@excellentice-kirkland.com",
    "info@reception-plus.de",
    "info@sarasotafair.com",
    "ktw@clevaone.com",
    "media@thearenagroup.net",
    "rory@sarasotafair.com",
    "tstuder@astrosecuritymonitoring.com"
  ],
  "nombre_sitio": "sarasotafair.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.excellentice-kirkland.com/en/contact-us/",
      "text": "Contact Us | How to reach the team at Excellent Ice Kirkland - Excellent Ice Kirkland | Montreal-Area Arena Skip to content Excellent Ice Kirkland | Montreal-Area Arena GIVE YOURSELF THE EDGE | hockey | skating | rentals | more Login / Register online! Home Info and Rates Expand Facility Information and Rental Rates Our Team Contact Us Refund Policy Privacy Policy Surrey (B.C.) Rink Lark Group (Head Office) Preseason Clinics | Sept 2025 Fall Program 2025 Expand Youth Learn to Skate Programs Youth Hockey Programs with Sean Tilley Perfect Skating™: Dynamic Skating and Skills Adult Hockey Instructionals Leagues Expand Adult PHL Fall/Winter League 2025/26 Stats and Schedules FR Excellent Ice Kirkland | Montreal-Area Arena GIVE YOURSELF THE EDGE | hockey | skating | rentals | more Toggle Menu Login / Register Online Contact Us We are happy to help! Email Contact Us Please enable JavaScript in your browser to submit the form Get in Touch With us We are happy to answer your questions! If you have any questions about our facility or programs, please use the contact form and we will get back to you as soon as you can! You can also email us at info@excellentice-kirkland.com or call us at 514-695-4368 . Administrative Hours Monday – Friday 8:00AM – 4:00PM Located in Kirkland, QC Want to know more? How to reach us By phone Front desk: Phone: 514-695-4368 Fax: 514-426-4539 On the map 2950 rue Edmond Kirkland, QC H9H 5J5 Send a message General inquiries: Info@excellentice-kirkland.com Facebook X Instagram Home About Contact Us Privacy Policy Refund Policy How to reach us 2950 Edmond Kirkland, QC. H9H 5J5 514-695-4368 info@excellentice-kirkland.com © 2025 Excellent Ice Kirkland | Montreal-Area Arena Scroll to top Scroll to top Preseason Clinics | Sept 2025 Fall Program 2025 Toggle child menu Expand Youth Learn to Skate Programs Youth Hockey Programs with Sean Tilley Perfect Skating™: Dynamic Skating and Skills Adult Hockey Instructionals Leagues Toggle child menu Expand Adult PHL Fall/Winter League 2025/26 Stats and Schedules FR"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    },
    {
      "url": "https://www.sarasotafair.com/events/2024/sarasota-sharks-tooth-festival2",
      "text": "Sarasota Sharks Tooth Festival skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds Skip Navigation Links Events > Consumer Show > Sarasota Shark Tooth Festival Sarasota Shark Tooth Festival Date: Aug 24 - Aug 25, 2024 About: The 2nd Annual Shark Tooth Festival is held in the air conditioned Robarts Arena. Displays, vendors, activities, and education displays. Produced by : Capt. Ron Gauthier, Ocean Explorer, TV Executive, Boat Captain/ Producer/ Host Date/Time: Saturday, August 24 from 10 a.m. to 5 p.m. Sunday, August 25 from 10 a.m. to 3 p.m. Tickets: Adults: ages 13 & up: $12.00 Children: 12 and under: FREE Seniors and Military: $6 FREE Parking Tickets can be purchased at the box office at the day of the event! of Transcript Location(s): Robarts Arena Category(s): Consumer Show View Itinerary Be A Fan 1 of 1 Upload of Transcript Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://www.sarasotafair.com/events/2024/https2guysshowscom",
      "text": "Two Guys Gun Show skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds Skip Navigation Links Events > Consumer Show > Two Guys Gun Show Two Guys Gun Show Date: May 04 - May 05, 2024 Dates: May 4-5, 2024 Hours Saturday: 9:00am - 5:00pm Sunday: 9:00am - 3:00pm Admission: WEEKEND TICKET (Admission includes both Saturday AND Sunday) Adult (17 and over)     $10.00 Child (16 and under)     FREE Active Military or LEO     FREE Veteran OR Retired LEO     $1.00 OFF Free Parking! Description This Sarasota gun show is held at Robarts Arena\n and hosted by 2 Guys Shows. All federal, state and local firearm \nordinances and laws must be obeyed. Promoter 2 Guys Shows Contact: Guy Lemakos Phone: (727) 776-3442 Email: guylemakos@yahoo.com https://2guysshows.com/ of Transcript Official Site: https://2guysshows.com/ Location(s): Robarts Arena Category(s): Consumer Show View Itinerary Be A Fan 1 Fans! 1 of 1 Upload of Transcript of Transcript Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://www.sarasotafair.com/p/about/contact-us",
      "text": "Contact / Directions skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds Home > About Us > Contact / Directions Contact / Directions Office hours: Mon., Tues., Thurs. & Fri. 9 AM - 5 PM. Office is closed on Wednesdays. info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 US Telephone: 941-365-0818 FAX: 888-502-2505 Booking inquiries: rory@sarasotafair.com President/CEO: Rory Martin - rory@sarasotafair.com of Transcript Questions? Comments? First Name * Last Name * Email Address * Sign me up for email updates * What's on your mind? * Submit of Transcript Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://www.tsnn.com/venues/robarts-arena-sarasota-fairgrounds",
      "text": "Venues & Destinations Special Events is part of the Informa Connect Division of Informa PLC Informa PLC | ABOUT US | INVESTOR RELATIONS | TALENT This site is operated by a business or businesses owned by Informa PLC and all copyright resides with them. Informa PLC's registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 8860726. Advertise with us About Sign Me Up! Sign Me Up! Trade Shows & Conferences Related Topics Event Design Event Food & Beverages Event Management Event Planning Event Tech Exhibitors Networking Events Trade Show Marketing Recent in Trade Shows & Conferences SEE ALL Convention Center World’s Largest Venue Management Company Gets a New Name: Legends Global World’s Largest Venue Management Company Gets a New Name: Legends Global by Danica Tormohlen Sep 11, 2025 3 Min Read Event Tech What’s New in Trade Show Tech: Conference AI Debuts, Personify Rolls Out Mobile App Updates and More Industry Innovations What’s New in Trade Show Tech: Conference AI Debuts, Personify Rolls Out Mobile App Updates and More Industry Innovations by Lisa Plummer Savas Sep 10, 2025 7 Min Read Venues & Destinations Related Topics Convention Center Recent in Venues & Destinations SEE ALL Convention Center World’s Largest Venue Management Company Gets a New Name: Legends Global World’s Largest Venue Management Company Gets a New Name: Legends Global by Danica Tormohlen Sep 11, 2025 3 Min Read Venues & Destinations On Site: The Ultimate Planning Guide for Trade Shows in Cincinnati On Site: The Ultimate Planning Guide for Trade Shows in Cincinnati by Danica Tormohlen Aug 29, 2025 13 Min Read People & Career Development TSNN Podcasts TSNN Top Trade Show List More Related Topics Newsletters TSNN Trade Show Calendar Advertise with Us Experts & Opinions Sustainability Recent in More Sponsored Content Life Cycle of Event Carpet: An Infographic on Best Practices Life Cycle of Event Carpet: An Infographic on Best Practices Sep 2, 2025 5 Min Read Sustainability Website Debuts for First-Ever Sustainability Benchmarking Platform for Event Venues Website Debuts for First-Ever Sustainability Benchmarking Platform for Event Venues by Danica Tormohlen Aug 11, 2025 4 Min Read Home Venues & Destinations Venues & Destinations More Topics Convention Center Convention Center World’s Largest Venue Management Company Gets a New Name: Legends Global World’s Largest Venue Management Company Gets a New Name: Legends Global Legends Global emerges as the new identity for the world's largest venue management company following Legends' acquisition of ASM Global last year, now operating more than 450 venues worldwide including major convention centers like Moscone Center and ICC Sydney. by Danica Tormohlen Sep 11, 2025 | 3 Min Read Venues & Destinations On Site: The Ultimate Planning Guide for Trade Shows in Cincinnati On Site: The Ultimate Planning Guide for Trade Shows in Cincinnati by Danica Tormohlen Aug 29, 2025 13 Min Read Venues & Destinations Destination News: New Offerings from Visit Milwaukee, Orlando, Anaheim, and Ottawa Tourism Destination News: New Offerings from Visit Milwaukee, Orlando, Anaheim, and Ottawa Tourism by Lisa Plummer Savas Aug 26, 2025 7 Min Read Venues & Destinations On Site: The Ultimate Planning Guide For Trade Shows in San Antonio On Site: The Ultimate Planning Guide For Trade Shows in San Antonio by Danica Tormohlen Aug 22, 2025 7 Min Read Sponsored Content Come for the meeting, and stay for Dallas Come for the meeting, and stay for Dallas Aug 21, 2025 3 Min Read Sustainability Website Debuts for First-Ever Sustainability Benchmarking Platform for Event Venues Website Debuts for First-Ever Sustainability Benchmarking Platform for Event Venues by Danica Tormohlen Aug 11, 2025 4 Min Read Sponsored Content State of the Sustainable Events Industry: Summer 2025 Trends & Risks Report State of the Sustainable Events Industry: Summer 2025 Trends & Risks Report Jul 29, 2025 | 4 Min Read Venues & Destinations What’s New in Venues: Upgrades and New Offerings at Convention Centers in Minneapolis and San Diego What’s New in Venues: Upgrades and New Offerings at Convention Centers in Minneapolis and San Diego Jul 22, 2025 | 3 Min Read by Lisa Plummer Savas People & Career Development One to Watch: Meet IAVM CEO Trevor Mitchell One to Watch: Meet IAVM CEO Trevor Mitchell Jul 15, 2025 | 6 Min Read by Lisa Plummer Savas People & Career Development From Hotel Executive to Vegas Sales Chief: Meet Vanessa Claspill, LVCVA's New Strategic Force From Hotel Executive to Vegas Sales Chief: Meet Vanessa Claspill, LVCVA's New Strategic Force Jul 11, 2025 | 5 Min Read by Danica Tormohlen Sponsored Content From Planning to Performance—MGM Resorts Makes It Happen From Planning to Performance—MGM Resorts Makes It Happen Jul 10, 2025 | 3 Min Read Convention Center Inside Look at San Antonio's Convention Center with Executive Director Patricia Muzquiz Cantor Inside Look at San Antonio's Convention Center with Executive Director Patricia Muzquiz Cantor Jun 26, 2025 | 3 Min Read by Danica Tormohlen Event Planning Exclusive: WTC Miami CEO & COO Share How They're Adapting to Market Shifts in 2025 Exclusive: WTC Miami CEO & COO Share How They're Adapting to Market Shifts in 2025 Jun 18, 2025 | 5 Min Read by Danica Tormohlen Venues & Destinations What's New in Convention Centers: Flex Spaces, New Builds, Renovations, and New Names What's New in Convention Centers: Flex Spaces, New Builds, Renovations, and New Names Jun 13, 2025 | 5 Min Read by Lisa Plummer Savas Event Planning Informa Selects Louisville to Host Connect Spring Marketplace in 2026 Informa Selects Louisville to Host Connect Spring Marketplace in 2026 Jun 11, 2025 | 2 Min Read by Danica Tormohlen Sponsored Content Meet Well: Integrating Wellness Into Your Event at MGM Resorts Meet Well: Integrating Wellness Into Your Event at MGM Resorts Jun 5, 2025 | 2 Min Read Trade Shows & Conferences Mario Bass Officially Takes the Helm of Visit San Antonio Mario Bass Officially Takes the Helm of Visit San Antonio Jun 3, 2025 | 4 Min Read by Danica Tormohlen People & Career Development Cultural Perspective as a Superpower: Teri Orton Champions AAPI Voices in the Trade Show Industry Cultural Perspective as a Superpower: Teri Orton Champions AAPI Voices in the Trade Show Industry May 23, 2025 | 2 Min Read Convention Center TSNN On Site: Hyatt Breaks Ground on 800-room Headquarters Hotel in Miami Beach TSNN On Site: Hyatt Breaks Ground on 800-room Headquarters Hotel in Miami Beach May 22, 2025 | 5 Min Read by Danica Tormohlen Venues & Destinations Austin Unveils First Look at New $1.6 Billion Convention Center Austin Unveils First Look at New $1.6 Billion Convention Center May 6, 2025 | 3 Min Read by Lisa Plummer Savas Venues & Destinations Venue News: Kentucky Expo Kicks Off Expansion, The Department Opens in Detroit Venue News: Kentucky Expo Kicks Off Expansion, The Department Opens in Detroit May 2, 2025 | 5 Min Read by Lisa Plummer Savas Sustainability TSNN, IAVM, and Honeycomb Strategies Launch Industry-First Sustainability Benchmarking Platform for Venues TSNN, IAVM, and Honeycomb Strategies Launch Industry-First Sustainability Benchmarking Platform for Venues Apr 22, 2025 | 3 Min Read by Danica Tormohlen People & Career Development TSNN Exclusive: Q&A with Choose Chicago’s New President & CEO Kristen Reynolds TSNN Exclusive: Q&A with Choose Chicago’s New President & CEO Kristen Reynolds Apr 11, 2025 | 6 Min Read by Danica Tormohlen Venues & Destinations Convention Center Briefs: Orlando, Phoenix, and San Antonio Convention Centers Launch Expansion Projects, Sustainability Initiatives, Tech Upgrades Convention Center Briefs: Orlando, Phoenix, and San Antonio Convention Centers Launch Expansion Projects, Sustainability Initiatives, Tech Upgrades Apr 8, 2025 | 6 Min Read by Lisa Plummer Savas Trade Shows & Conferences Glamour and Growth: Inside Questex’s 2025 International Beauty Show in NYC Glamour and Growth: Inside Questex’s 2025 International Beauty Show in NYC Apr 7, 2025 | 3 Min Read by Shannon Thaler People & Career Development One to Watch: Heather Larson, President & CEO, Meet Chicago Northwest One to Watch: Heather Larson, President & CEO, Meet Chicago Northwest Mar 21, 2025 | 5 Min Read by Lisa Plummer Savas Trade Shows & Conferences E3 Organizers Set to Launch Invite-Only Event in Las Vegas E3 Organizers Set to Launch Invite-Only Event in Las Vegas Feb 7, 2025 | 3 Min Read by Danica Tormohlen Venues & Destinations How New Orleans Is Elevating Meetings & Events Ahead of Super Bowl LIX How New Orleans Is Elevating Meetings & Events Ahead of Super Bowl LIX Feb 4, 2025 | 4 Min Read by Danica Tormohlen Venues & Destinations Venue News: Comic-Con Inks Deal with SDCC, Loop Station Opens at Westgate Las Vegas Venue News: Comic-Con Inks Deal with SDCC, Loop Station Opens at Westgate Las Vegas Feb 3, 2025 | 5 Min Read by TSNN News Sponsored Content Sustainability Certifications 101: Event Venues Edition Sustainability Certifications 101: Event Venues Edition Jan 28, 2025 | 4 Min Read People & Career Development Javits Center Taps Joyce Leveston as Its First Female CEO Javits Center Taps Joyce Leveston as Its First Female CEO Jan 28, 2025 | 4 Min Read by Lisa Plummer Savas Venues & Destinations Houston Preview: The Ultimate Planning Guide for PCMA Attendees Houston Preview: The Ultimate Planning Guide for PCMA Attendees Jan 6, 2025 | 5 Min Read by Danica Tormohlen Trade Shows & Conferences CloserStill Media’s New York Vet Show Reports Double-Digit YOY Growth in Attendance CloserStill Media’s New York Vet Show Reports Double-Digit YOY Growth in Attendance Dec 18, 2024 | 4 Min Read by Danica Tormohlen Trade Shows & Conferences TSNN Reveals 2024 Award Winners at IAEE Celebration in Los Angeles TSNN Reveals 2024 Award Winners at IAEE Celebration in Los Angeles Dec 17, 2024 | 8 Min Read by Danica Tormohlen Venues & Destinations Informa Launches Asia-Pacific MICE Event in Hong Kong in 2025 Informa Launches Asia-Pacific MICE Event in Hong Kong in 2025 Nov 14, 2024 | 4 Min Read by Danica Tormohlen Previous 1 2 3 4 5 … 12 Next Sign Up for Complimentary Trade Show News E-newsletters! TSNN is the No. 1 online news source for the trade show industry - stay 'in the know' by receiving your free e-newsletters covering a variety of market sectors. Sign me up! TSNN Top 250 Dashboard Check It Out Connect About Us Contact Opportunities Advertise Submit a Press Release Join Us Sign Me Up! Follow Us Copyright © 2025 Informa Connect Limited. Registered in England & Wales with number 01835199, registered office 5 Howick Place, London, SW1P 1WG. Website TOU | Event Code of Conduct | Group of privacy policy | CCPA | Cookie policy"
    },
    {
      "url": "https://www.sarasotafair.com/",
      "text": "Sarasota Agricultural Fair skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds Upcoming Events Discover More Let's Keep In Touch Sign up for the latest updates & deals. SARASOTA FAIR 3000 Ringling Blvd. Sarasota, FL 34237 GET DIRECTIONS FACEBOOK INSTAGRAM Loading... Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://www.sarasotafair.com/events/2025/riverview-high-school-graduation",
      "text": "Riverview High School Graduation skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds Skip Navigation Links Events > Social > Riverview High School Graduation Riverview High School Graduation Date: May 30, 2025 Please Note: Please plan on arriving early to find a parking space and a seat in the arena. Carpooling is recommended. Tickets are available only through Riverview High School. No balloons allowed. No exceptions. of Transcript Location(s): Robarts Arena Category(s): Social View Itinerary Be A Fan 1 of 1 Upload of Transcript NO BALLOONS ALLOWED! of Transcript Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://www.sarasotafair.com/events",
      "text": "Events skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds X Close Events View: View: Date Filter All Upcoming All Events Our Picks Fan Picks Past Events View Itinerary categories ALL CATEGORIES Consumer Show Social Concerts Trade Shows Show Sports Circus Fair By Location Sarasota County Agricultural Fair Assoc. View: Filter/Search Category: ALL Tag: ALL No Results There are no events matching your search criteria. Please choose a different filter\r\n            and/or category. Create Your Schedule Create your custom schedule by setting the filter on the left to \"Upcoming Events\", then clicking the save button on events you plan to attend. Log in to View My Events You can add events to your personal schedule by signing into your account! Log In X Email More Info Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://thearenagroup.net/about-us",
      "text": "The Arena Group – Where the Action is About Us Our Brands Leadership Investors Careers Press Contact Search The Arena Group – an innovative media and technology company – is home to many of the most iconic and passionate media brands . Each month we connect over 100 million people with interests they love, enriching their experiences through like-minded communities, all while offering diverse storytelling and trusted recommendations. See all Your audience, at scale . Our brand safe content reaches consumers in an engaging way on each step of their journey. Our data and addressability allow us to provide our partners with a specific and holistic plan that delivers business results: Audience Targeting Proprietary technology leveraging our fully addressable inventory to curate segments that connect advertisers to consumers in key moments. Commerce Audience-led e-commerce by using an array of signals from our data to maximize effectiveness. Branded Content & Sponsorship We craft inspiring stories and bring our media brands to life, connecting partners with authentic, passionate audiences online and through impactful IRL experiences. Display Advertising Direct, Programmatic Guaranteed, PMP, Open Exchange. We connect our partners with our authentic, passionate and fully addressable audience in key moments. Our industry-leading and proprietary user management platform optimizes brand impact at every step of the purchase funnel, building lasting relationships. Latest News August 25, 2025 The Arena Group to Participate in the Lake Street 2025 BIG9 Conference Read More August 14, 2025 The Arena Group Posts 67% Revenue Growth with Record Profits Read More July 31, 2025 The Arena Group Authorizes Share Repurchase Program Read More See all Contact media@thearenagroup.net 200 Vesey Street, 24th floor, New York, NY 10281 About Us Our Brands Leadership Investors Careers Press Terms of Use Privacy Policy © 2025 The Arena Group Holdings, Inc . All rights reserved. Privacy Preference Center Privacy Preferences"
    },
    {
      "url": "https://www.sarasotafair.com/events/2024/httpswwwcaiwestfloridaorgsitehomecfm",
      "text": "CA Day 2024 skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds Skip Navigation Links Events > Consumer Show > CA Day 2024 CA Day 2024 Date: Apr 09, 2024 About: WELCOME TO THE CAI WEST FLORIDA CHAPTER! Our mission is to provide education, tools and resources promoting the highest standards among managers, business partners, homeowners and board members for the benefit of all community associations in the Sarasota, Manatee and DeSoto Counties. Our membership includes condominium, cooperative, and homeowner associations as well as manager members and those who provide services and products to associations. As one of the most active chapters in the nation, we have greater than 1000 members! Community Associations Institute: National Organization Our mission is to inspire professionalism, effective leadership and responsible citizenship. of Transcript Location(s): Robarts Arena Category(s): Consumer Show View Itinerary Be A Fan Official Site: https://www.caiwestflorida.org/site_home.cfm 1 of 1 Upload of Transcript Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://allmusicmagazine.com/venues/sarasota-county-fairgrounds-robarts-arena/",
      "text": "Sarasota County Fairgrounds & Robarts Arena - All Music Magazine Logout Search Search News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact Festivals Contributors Advertising Festivals Contributors Advertising Venues Edit Venue Details Add Upcoming Show Reset Password Sarasota County Fairgrounds & Robarts Arena Sarasota Blues , Funk , Rock (941) 365-0818 info@sarasotafair.com View Website 3000 Ringling Blvd Sarasota Florida 34237 Smoking About The Venue Sarasota Fairgrounds, Robarts Arena, Potter Building, Ken Clark Auditorium The Sarasota Fairgrounds offers a variety of facilities for use for small to large functions. Robarts Arena, Ken Clark Auditorium, and the Potter Building will accommodate meetings, weddings, reunions, trade shows, craft fairs, sporting events or concerts. The building’s maximum capacities range from 150, 299 to 5,000. The expansive 65 acre complex also boasts RV rallies, Suncoast Renaissance Festival, and other outdoor activities. The annual Sarasota County Fair is held annually in March. Upcoming Events: No events yet, check back later! Contact Us © 2025 All Music Magazine. All rights reserved. Privacy Policy"
    },
    {
      "url": "https://www.sarasotafair.com/p/about/board-of-directors",
      "text": "Board of Directors skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds Home > About Us > Board of Directors Board of Directors EXECUTIVE BOARD Dale Oswalt Chair Bill Furst Vice Chair Randy Boyd Secretary Scott Eller Treasurer John Chrzczonowski Bill McClain Sarasota Garden Club- Parliamentarian Livestock Comm. Liaison DIRECTORS Johnny B. Albritton Citrus Grower Daniel Corso Sarasota Co. Livestock Association Lee Hayes Byron SRQ Co. Cooperative Extension B.C. Drymon Florida Nursery Growers David Gwatney Barbra Houghtaling Member at Large Member at Large Tripp Jennings Sarasota Co. School Board Mike Kennedy Sarasota County Farm Bureau Robbie Martin Vegetable Growers Carolyn Mason Travis Mullet Member at Large Member at Large Larry Prohs Judge Erika Quartermaine Member at Large Member at Large Ken Richards Pat Robinson Matt Scarbrough Member at Large Member at Large Member at Large Don Strickland Member at Large Ken Walters Member at Large PRESIDENT / CEO Rory S. Martin DIRECTOR EMERITUS Jeffri Durrance Byron Crofut Wilbur Smith Al Light Randy Thies of Transcript Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * Datenschutz Surname First Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://arenagroup.com/usa/contact/",
      "text": "Contact Arena Group USA | Get in Touch with Our Team Contact | Arena Americas Contact MENU Products & Services Tent Structures Custom Structures Flooring & Seating Solutions Graphic Printing Design / Manufacturing Well Dressed Tables Event Types & Applications Sporting Live Event Temporary Facility Solutions Solutions & Innovations About Us Team News & Insights Contact CALL: (800) 383-6332 Arena Group Arena UK & Europe Arena Middle East Arena Asia Let's get started It’s time to bring your space to life. Let us know how we can help! Contact us today for a quick response. CALL: (800) 383-6332 EMAIL: Send a message First Name * Last Name * Email * Phone City State AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY What can we help you with? Get a quote Career opportunities Planning and event Other Message Preferred Method of Contact: Email Phone Subscribe for epic event advice and insights. SUBMIT Please do not fill in this field. 1 2 3 4 5 6 To extend our reach throughout the United States, Arena Americas maintains branch locations in addition to our corporate headquarters. 1 Corporate 10861 S. Howell Ave. Oak Creek, WI 53154 (414) 831-7000 (800) 383-6332 2 Design & Manufacturing 10861 S. Howell Ave. Oak Creek, WI 53154 (414) 831-7000 (800) 383-6332 3 New York/New Jersey 71 Central Ave. Kearny, NJ 07032 (800) 383-6332 4 Ft. Irwin 48245 Ft. Irwin Rd. Barstow, CA 92311 (800) 383-6332 5 Shaffer Sports & Events 10901 Tanner Rd. Houston, TX 77041 View Website 6 Florida / Southeast 8500 Parkline Blvd. Ste. 110 Orlando, FL 32809 (407) 297-1165 (800) 383-6332 Global OVER 250 YEARS OF EXPERIENCE AND ICONIC EVENTS AROUND THE GLOBE With over 250 years of experience, Arena is a leading innovator in the design and build of temporary architecture and integrated event solutions. Globally. Arena Group is headquartered in the UAE with offices in the USA, UK, Dubai, Abu Dhabi, Saudi Arabia, Malaysia, and Korea. GLOBAL HEADQUARTERS Arena Group 1802 Arenco Tower, Dubai, UAE PO Box 114384 +971 (4) 252 9656 Explore Our Family Of Companies About Us Contact Arena Group © 2023 Arena Americas. All rights reserved. Privacy Policy Code of Conduct General Web Site Terms and Conditions of Use We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Accept"
    },
    {
      "url": "https://sarasotaguitarshow.com/",
      "text": "Home - 2026 Sarasota Guitar And Amp Show Skip to content Home Dealers Tickets T Shirt Contact Us Home Dealers Tickets T Shirt Contact Us Event Days Day Date Time Dealer Day Friday June 5th 2026 10am - 5pm Saturday June 6th 2026 10am - 5pm Sunday June 7th 2026 10am - 3pm 2026 Sarasota Guitar and Amp Show - June 6th-7th 2026 Robarts Arena 3000 Ringling Blvd, Sarasota, FL 34237 | June 6th-7th 2026 Secure Dealer Space Payment DEALER APPLICATION Book 2026 Host Hotel Hampton Inn & Suites Book 2026 Host Hotel Carlisle Hotel Special rate. Use group code is AMP26 Tickets Get Your General Admission Tickets to the Sarasota Guitar Show Now! At the Door 1 day $20 Cash Advanced Tickets Buy  1 Day $15 Ages 12 & Under Free VIP Dealer Day Early Access & Entire Show $175 Buy VIP Tickets Here 2026 Sarasota Guitar & Amp Show T Shirt $25.00 USD Buy an Official 2026 Sarasota Guitar and Amp Show T shirt and get in Free Order Now Contact Us Submit Now Show Address: 2026 Sarasota Guitar and Amp Show Robarts Arena 3000 Ringling Blvd, Sarasota, FL 34237 941-993-3098 ktw@clevaone.com Follow us Facebook Twitter Instagram Copyright © [2023]. A Cleva One, LLC production All rights reserved. privacy policy. Scroll to Top"
    },
    {
      "url": "https://www.sarasotafair.com/p/getinvolved/robards-arena",
      "text": "Robarts Arena skip to main content Search Website Search Sign up for email updates from Sarasota County Agricultural Fair Assoc. Email Get Updates Tickets About Us Welcome Board of Directors Livestock Committee Creative Arts Committee Contact / Directions Events Event Calendar Consumer Show Social Concerts Trade Shows Show Sports Circus Fair Event Results Itinerary Fair Sarasota Fair Livestock Shows Exhibitor Add-On Form Livestock Committee 2026 Steer and Swine Buyer Information Creative Arts Commerical Exhibit Information Fair Map Entertainment Admission & Hours Food Vendor Information Facebook Twitter Photo Gallery Get Updates Facility Rentals Robarts Arena Potter Building Ken Clark Building Fairgrounds Home > Facility Rentals > Robarts Arena Robarts Arena Robarts Arena is home to a variety of events.  The building's 15,000 square foot floor  provides room for a variety of sporting events, home shows, banquets, gun shows, concerts, graduations and more. The maximum capacity for the building is 4845 depending on the floor configuration.  The newly renovated chair seating holds 2,696 with hand rails and photo-glo strips on the stairs for extra safety.  It features a box office,  remodeled bathrooms, renovated concessions, two renovated locker rooms, and the site provides ample parking. For more information, please contact our office to schedule a meeting to discuss your event.  Contact us 941-365-0818. of Transcript of Transcript Robarts Arena Floor Plan PDF Robarts Arena Floor Plan of Transcript of Transcript Robarts Arena Rate Sheet PDF Robarts Arena Rate Sheet of Transcript of Transcript Home | About Us | Events | Fair | Facility Rentals | Contact | Site Map | Privacy, Terms & Cookies | Purchase Policy Contact Us 941.365.0818 info@sarasotafair.com 3000 Ringling Blvd. Sarasota, FL 34237 Copyright ©2025, Sarasota County Agricultural Fair Assoc.. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets Hours & Directions Contact Site Map Privacy, Terms & Cookies Purchase Policy"
    }
  ]
}