{
  "fuentes": [
    {
      "url": "https://www.brooklynfilmfestival.org/contact-us",
      "email": "feedbacket@wbff.org"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/contact/",
      "email": "info@sarasotafilmfestival.com"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/volunteer/",
      "email": "chrissy@sarasotafilmfestival.com"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/about/",
      "email": "boxoffice@sarasotafilmfestival.com"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/about/",
      "email": "development@sarasotafilmfestival.com"
    },
    {
      "url": "https://sarasotaarts.org/event/sarasota-film-festival-2025/",
      "email": "info@sarasotaarts.org"
    },
    {
      "url": "https://sarasotaarts.org/event/sarasota-film-festival-2025/",
      "email": "info@sarasotafilmfestival.com"
    },
    {
      "url": "https://variety.com/2024/film/news/sarasota-film-festival-2024-lineup-steve-buscemi-the-listener-1235946181/",
      "email": "obits@variety.com"
    },
    {
      "url": "https://stpetecatalyst.com/events/sarasota-film-festival/",
      "email": "park@stpetecatalyst.com"
    },
    {
      "url": "https://stpetecatalyst.com/events/sarasota-film-festival/",
      "email": "paul@sarasotafilmfestival.com"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/sponsor/",
      "email": "petra@sarasotafilmfestival.com"
    }
  ],
  "mails": [
    "boxoffice@sarasotafilmfestival.com",
    "chrissy@sarasotafilmfestival.com",
    "development@sarasotafilmfestival.com",
    "feedbacket@wbff.org",
    "info@sarasotaarts.org",
    "info@sarasotafilmfestival.com",
    "obits@variety.com",
    "park@stpetecatalyst.com",
    "paul@sarasotafilmfestival.com",
    "petra@sarasotafilmfestival.com"
  ],
  "nombre_sitio": "sarasotafilmfestival.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.brooklynfilmfestival.org/contact-us",
      "text": "Contact Us @ Brooklyn Film Festival Brooklyn Film Festival Films Winners Press Sponsors Shop Search Contact Socials Staff About CONTACT THE FESTIVAL GENERAL QUESTIONS If you have any other questions about the current edition of the festival, you can get in touch with us by email at festival AT wbff.org or info AT wbff.org. By phone you can reach us at + 1 (718) 388 4306 FILM SUBMISSION INQUIRIES If you have a question that is not answered in our FILM SUBMISSION FREQUENTLY ASKED QUESTIONS Send an email to submit AT wbff.org or call us at + 1 (718) 388 4306 OFFICE & SHIPPING ADDRESS Brooklyn Film Festival 180 South 4th Street, Suite 2 S, Brooklyn, NY 11211, United States GOOGLE MAP & DIRECTIONS (note: Building entrance on South 5 Place) Phone: +1 (718) 388 4306 PRESS INQUIRIES & REGISTRATION Media representatives can register for the upcoming edition using the PRESS REGISTRATION FORM To contact the Press Office call +1 (718) 388 4306 or send an email to pr AT wbff.org SPONSORSHIP OPPORTUNITIES To learn how to join our family of sponsors, check out our current SPONSORSHIP OPPORTUNITIES or send an email to sponsor AT wbff.org VOLUNTEERING If you are interested in learning how to put a festival together while working in a creative and stimulating atmosphere, part time and full time volunteering positions are currently available. Send your resume to volunteer AT wbff.org OPEN VOLUNTEER POSITIONS FESTIVAL DIRECTORS Looking to contact one of the festival’s directors? CONTACT FESTIVAL DIRECTORS Submit a Film faq latest news press press releases coverage winners 2025 film lineup design awards & prizes festival sponsors photos about BFF 2025 staff film society film festival judges exchange archive festival themes film library films by year films by premiere films by edition films by category films by country films a to z donate contact follow BFF ABOUT CONTACT FOLLOW US NEWS sending... I agree 2025 Brooklyn Film Festival is a 501(c)(3) non-profit organization"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/contact/",
      "text": "Contact - Sarasota Film Festival Skip to main content 2025 PASSES Films Schedule Special Events Screenings Shorts Previous Festivals 2024 2023 2022 2021 2020 2019 Visions of the Black Experience 2021 Cinematheque Education Summer Film Camps Cinematheque Outdoor Screenings Support Us Sponsor Volunteer About Our Sponsors Who We Are Submit Contact DONATE Buy Passes In The News Buy Passes In The News 2025 PASSES Films Schedule Special Events Screenings Shorts Previous Festivals 2024 2023 2022 2021 2020 2019 Visions of the Black Experience 2021 Cinematheque Education Summer Film Camps Cinematheque Outdoor Screenings Support Us Sponsor Volunteer About Our Sponsors Who We Are Submit Contact DONATE Sign up to stay in touch! Get SFF updates and event invites delivered to your inbox. By submitting this form, you are granting: Sarasota Film Festival, 332 Cocoanut Avenue, Sarasota, Florida, 34236, United States, https://sarasotafilmfestival.com permission to email you. You may unsubscribe via the link found at the bottom of every email. Contact SFF Questions? Feedback? Suggestions? We would love to hear from you. To reach us, email info@sarasotafilmfestival.com or call (941) 364-9514. Please enable JavaScript in your browser to complete this form. Name * Email * Comment or Message * Comment Submit Title Sponsor Presenting Sponsor Signature Sponsors Sarasota Film Festival is devoted to supporting the art and elevating the craft of cinema. Become a Member SFF Films Education Membership Support Us About SFF News Get Tickets Privacy Policy Sarasota Film Festival 332 Cocoanut Ave. Sarasota, FL 34236 Copyright 2025  Sarasota Film Festival  |  Web design by Sande Caplin & Associates | Web Accessibility"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/volunteer/",
      "text": "Volunteer - Sarasota Film Festival Skip to main content 2025 PASSES Films Schedule Special Events Screenings Shorts Previous Festivals 2024 2023 2022 2021 2020 2019 Visions of the Black Experience 2021 Cinematheque Education Summer Film Camps Cinematheque Outdoor Screenings Support Us Sponsor Volunteer About Our Sponsors Who We Are Submit Contact DONATE Buy Passes In The News Buy Passes In The News 2025 PASSES Films Schedule Special Events Screenings Shorts Previous Festivals 2024 2023 2022 2021 2020 2019 Visions of the Black Experience 2021 Cinematheque Education Summer Film Camps Cinematheque Outdoor Screenings Support Us Sponsor Volunteer About Our Sponsors Who We Are Submit Contact DONATE Volunteers – Be Part of The Team! Volunteer at the The 26th Annual Sarasota Film Festival April 4- 13, 2025 The Sarasota Film Festival is celebrating its 27th season and we couldn’t do it without the help of our amazing and dedicated volunteers ! SFF is a non profit organization and we rely greatly on the generosity of volunteers and we do our best to make it fun! Volunteers perks: FREE Volunteer T-shirt earn movie passes based on your volunteer hours earn invitations to our extra special events and parties Volunteer meet and greet mixer before our season starts Volunteer Appreciation Party to end our season Are you in? To volunteer for the 27th Sarasota Film Festival, please email Christina Belgin Rullan with your information – a little about you, your availability and contact info to Chrissy@SarasotaFilmFestival.com . SFF is a non-profit organization and relies on the generosity and dedication of hundreds of Volunteers in achieving our mission: to celebrate the art of filmmaking and the contribution of filmmakers by hosting an international film festival and developing year-long programs for the economic, educational, and cultural benefit of our community. Each year, our Volunteer work-force is vital to the success of our 10-day Festival. Volunteers are needed to assist in over 15 departments of the Sarasota Film Festival – from theater operations to transportation to events. Our Volunteers are people who love film, love community engagement, love Sarasota and are valued members of the team. If you’re ready to get involved, meet new people, and discover the latest in international film, then please read on and apply. We welcome returning and brand-new Volunteers alike. Don’t miss this one-of-a-kind experience! The Sarasota Film Festival (“SFF”), Inc. is a not for profit, charitable and tax exempt organization as defined by IRS Code 501(c)(3). Your tax deductible amount is limited to the excess of the contribution over the fair market value of any goods or services received in exchange for your donation. A copy of the official registration (CH12031) and financial information may be obtained from the Division of Consumer Services by calling toll free 1-800-435-7352 within the State of Florida. Registration does not imply endorsement, approval or recommendation by the State. Volunteer Links Information Departments & Responsibilities Guidelines & Expectations Looking for other ways to support the Sarasota Film Festival? Sign up to stay in touch! Get SFF updates and event invites delivered to your inbox. By submitting this form, you are granting: Sarasota Film Festival, 323 Central Ave., Sarasota, Florida, 34236, United States, https://sarasotafilmfestival.com permission to email you. You may unsubscribe via the link found at the bottom of every email. Title Sponsor Presenting Sponsor Signature Sponsors Sarasota Film Festival is devoted to supporting the art and elevating the craft of cinema. Become a Member SFF Films Education Membership Support Us About SFF News Get Tickets Privacy Policy Sarasota Film Festival 332 Cocoanut Ave. Sarasota, FL 34236 Copyright 2025  Sarasota Film Festival  |  Web design by Sande Caplin & Associates | Web Accessibility"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/about/",
      "text": "About - Sarasota Film Festival Skip to main content 2025 PASSES Films Schedule Special Events Screenings Shorts Previous Festivals 2024 2023 2022 2021 2020 2019 Visions of the Black Experience 2021 Cinematheque Education Summer Film Camps Cinematheque Outdoor Screenings Support Us Sponsor Volunteer About Our Sponsors Who We Are Submit Contact DONATE Buy Passes In The News Buy Passes In The News 2025 PASSES Films Schedule Special Events Screenings Shorts Previous Festivals 2024 2023 2022 2021 2020 2019 Visions of the Black Experience 2021 Cinematheque Education Summer Film Camps Cinematheque Outdoor Screenings Support Us Sponsor Volunteer About Our Sponsors Who We Are Submit Contact DONATE Comments Box SVG icons Used for the like, share, comment, and reaction icons This message is only visible to admins. Problem displaying Facebook posts. Backup cache in use. Error: (#200) Provide valid app ID Type: OAuthException About Sarasota Film Festival The Sarasota Film Festival, founded in 1998, is an international film festival hosted in Sarasota, Florida and viewable from around the world. The festival is typically held each April, in support of its mission: t o celebrate the art of filmmaking and the contribution of filmmakers by hosting an international film festival and developing year-long programs for the economic, educational, and cultural benefit of our community . Frequently Asked Questions When is the 2022 Sarasota Film Festival? The 24th Annual Sarasota Film Festival will run from April 1st – 10th, 2022. How do I find out about the films, events, and parties? Information about every Festival film and event is in the Film Guide! Each year, our digital Film Guide is available online, and hard copies are available at various businesses around town, and at our Box Office. View our schedule for more information. How much do film tickets cost? Final 2022 prices yet to be announced, but in previous festivals the prices have been: $15 – General public $11 – SFF Members Click here to learn more about becoming a member. $10 – Students, Educators, and School Administrators (with valid ID) Children 12 and under may attend all SFF youthFEST films for FREE. Tickets are required and may be obtained at the SFF Box Office. DAY OF TICKETS Films that are close to selling out go into “DAY OF” mode, with some tickets placed on reserve for pass-holders and filmmakers. If more general public tickets can be released, they are sold at the “Day Of” price on the day of the show. To avoid paying the higher price, we encourage patrons to consider buying SFF memberships, which allow for ticket sales before the general public, exclusive discounts and a host of other benefits that can be found here . Here are the “DAY OF” ticket prices: REGULAR: $22/public and $16/members MATINEE: $15/public and $11/members SPOTLIGHT/CENTERPIECE: $30/public and $22/members Please come to the SFF Box Office with any questions, comments or concerns, or email the box office team at boxoffice@sarasotafilmfestival.com . What are the Box Office hours? @Sarasota Municipal Auditorium 801 N. Tamiami Trail, Sarasota, FL 34236 Box Office Open Daily APRIL 1-10, 2022 8:30 AM – 9:15 PM @CMX CinéBistro Siesta Key 3501 S. Tamiami Trail, Suite 1100, Sarasota, FL 34239 Box Office Open Daily APRIL 2-10, 2022 5:30 PM – 7:00 PM Call the Box Office 941-366-6200 8:00 AM – 8:00 PM What if there’s a film I want to see and tickets are not available? New Policy to be announced for SFF 2022 Where should I stay when visiting the Sarasota Film Festival? Visit our Plan Your Visit section for special offers from our partner airport and hotels. Does SFF offer any education programs? For adults, too? The SFF Education department offers a variety of in-classroom and out-of-classroom education programs, for students from elementary school through adulthood, at no cost. To learn more about our year-round education and outreach initiatives, visit the “Community” section of our website. Can I volunteer at the Sarasota Film Festival? Can I earn service hours? Absolutely! Our volunteer work force is key to the success of our festival, and since we are a 501(c)(3) non-profit organization, you can earn service hours for your school. Find out more information about volunteering by CLICKING HERE. I want to help SFF, but I don’t have time to volunteer. What can I do? You can help SFF continue and expand its programming year-round by becoming an SFF Member , or make a tax-deductable donation to The Sarasota Film Festival, Inc. Please email development@sarasotafilmfestival.com for more information about donating to our mission. 2002 Sarasota Film Festival Sarasota Film Festival Sarasota Film Festival The 2002 Sarasota Film Festival The 2002 Sarasota Film Festival 2005 7th Annual Sarasota Film Festival 7th Annual Sarasota Film Festival Sarasota Film Festival Sarasota Film Festival 2006 Sarasota Film Festival – Opening Night Sarasota Film Festival – Opening Night Sarasota Film Festival – Opening Night Sarasota Film Festival 2006 – Robert Altman Portrait Session Sarasota Film Festival 2006 – William H. Macy Portrait Session Luncheon Under The Banyans – Sarasota Film Festival 2006 2006 Sarasota Film Festival – Street Party “American Blackout” With Cynthia McKinney – Sarasota Fim Festival 2006 Sarasota Film Festival – “Coffee And Conversation” Sarasota Film Festival – Opening Night World Cinema Celebration – Sarasota Film Festival 2006 2007 In Conversation With Steve Buscemi The Reel Experience At Sarasota Film Festival Night Of 1,000 Stars Night Of 1,000 Stars Norman Jewison Book Signing Luncheon Under the Banyans Luncheon Under the Banyans The Reel Experience At Sarasota Film Festival 2013 Sarasota Film Festival 2013 – Red Carpet For Filmmaker Awards & Closing Night Film Sarasota Film Festival 2013 – Burma Red Carpet Sarasota Film Festival 2013 – Red Carpet For Hollywood Nights II Sarasota Film Festival 2013 – Event: Late Night Unwrap Party Sarasota Film Festival 2013 – Documentary Centerpiece Screenings: Running From Crazy Sarasota Film Festival 2013 – Event: Cinema Tropicale Sarasota Film Festival 2013 – Event: Cinema Tropicale Sarasota Film Festival 2013 – Red Carpet For Cinema Tropicale Sarasota Film Festival 2013 – Tribute Luncheon Sarasota Film Festival 2013 – Tribute Luncheon Sarasota Film Festival 2013 – Tribute Luncheon Sarasota Film Festival 2013 – Red Carpet For Tribute Luncheon 2014 2014 Sarasota Film Festival – Day 9 – Red Carpet For Closing Night Film: The One I Love 2014 Sarasota Film Festival Day 7 – Book Signing & Conversation: Sewing Hope 2014 Sarasota Film Festival, Opening Night Party 2014 Sarasota Film Festival, Opening Night Party 2014 Sarasota Film Festival Day 10 – Red Carpet For Hollywood Nights: Program 2 2014 Sarasota Film Festival Day 8 – Cinema Tropicale 2014 Sarasota Film Festival Day 8 – Cinema Tropicale 2014 Sarasota Film Festival Day 8 – Cinema Tropicale 2014 Sarasota Film Festival Day 8 – Cinema Tropicale 2014 Sarasota Film Festival Day 8 – Cinema Tropicale 2014 Sarasota Film Festival Day 7 – Side By Side Symposium 2015 Screening Of “I’ll See You in My Dreams” – Red Carpet 2015 Sarasota Film Festival, Day 8 2015 Sarasota Film Festival, Day 8 2015 2016 SFF 2016 –  Cinema Tropicale Event SFF 2016 –  Cinema Tropicale Event SFF 2016 – Conversation With  Olympia Dukakis Sarasota Film Festival 2016 Awards Ceremony SFF 2016 –  Cinema Tropicale Event SFF 2016 –  Cinema Tropicale Event SFF 2016 –  Cinema Tropicale Event 2018 2018 Sarasota Film Festival – Day 2 2018 Sarasota Film Festival – Day 2 2018 Sarasota Film Festival – Day 1 2018 Sarasota Film Festival – Day 1 2018 Sarasota Film Festival – Day 3 2018 Sarasota Film Festival – Day 2 2018 Sarasota Film Festival – Day 2 Title Sponsor Presenting Sponsor Signature Sponsors Sarasota Film Festival is devoted to supporting the art and elevating the craft of cinema. Become a Member SFF Films Education Membership Support Us About SFF News Get Tickets Privacy Policy Sarasota Film Festival 332 Cocoanut Ave. Sarasota, FL 34236 Copyright 2025  Sarasota Film Festival  |  Web design by Sande Caplin & Associates | Web Accessibility"
    },
    {
      "url": "https://sarasotaarts.org/event/sarasota-film-festival-2025/",
      "text": "Sarasota Film Festival 2025, Sarasota Film Festival  at Regal Hollywood, Sarasota FL, Film MEMBER LOGIN LOGIN REGISTER LOGOUT MY ACCOUNT English Arabic Chinese (Simplified) Chinese (Traditional) English French German Japanese Korean Kurdish (Kurmanji) Spanish Vietnamese There are no recent bookmarks. Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT MENU Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Find An Event Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Classes/Workshops Dance Family-Friendly Festivals Film Free! Holiday Music Performing Arts Theatre Visual Arts Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue Quick Search Today Weekend Tomorrow The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Search by date range: Today Tomorrow Weekend next 7 14 30 SEARCH Advanced Filters Home Film Sarasota Film Festival 2025 Accessibility Info Facebook Twitter Linkedin Print Please Note: This event has expired. Sarasota Film Festival 2025 Presented by Sarasota Film Festival at  Regal Hollywood , Sarasota FL Apr 04 - 13 2025 A top annual film festival, bringing the best in cinema and educational programming to Florida’s Suncoast. Buy Tickets The 27th annual Sarasota Film Festival (SFF) is recognized as a world-class cultural event featuring thought-provoking films from some of the best-known and emerging independent voices. Held in Sarasota, FL, SFF emphasizes the best in cinema alongside exciting programs and events with filmmakers and celebrity guests. It screens over 200 films each year, including features, documentaries, shorts, and a robust educational program. The 27th annual Sarasota Film Festival (SFF) is recognized as a world-class cultural event featuring thought-provoking films from some of the best-known and emerging independent voices. Held in Sarasota, FL, SFF emphasizes the best in cinema alongside exciting programs and events with filmmakers and celebrity guests. It screens over 200 films each year, including features, documentaries, shorts, and a robust educational program. View less ADMISSION INFO FREE-$150 (for special events) Phone: (941) 364-9514 Email: info@sarasotafilmfestival.com PHOTOS LOCATION Regal Hollywood 1993 Main St, Sarasota, FL 34236 View in Google Maps Accessibility Information: Currently, no accessibility information is available for this event. Connect with this Organization: DONATE CONNECT WITH Sarasota Film Festival Email / Website / Facebook / Twitter / Instagram / MEMBER REVIEWS There are currently no reviews/comments for this event. Be the first to add a review/comment , and let folks know what you think! Find Local Events Search by date: The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Select Category Classes/Workshops Dance Family-Friendly Festivals Film Free! Holiday Music Performing Arts Theatre Visual Arts Select Venue Search by date range: Today Tomorrow Weekend next 7 14 30 SEARCH RESET Sign up for our Newsletter! Sponsor Highlight Ian Black Real Estate is a premiere commercial real estate firm located in Sarasota, Florida, that provides brokerage and property management services. Boasting 20 years in business, unparalleled regional market knowledge and deep roots in the community, our firm offers outstanding client service with creativity and integrity. Explore other local businesses that support arts and culture! Mission The mission of the Arts and Cultural Alliance is to serve as the voice, advocate, and resource for arts and culture in our community. Vision The vision of the Arts and Cultural Alliance is that arts and culture are essential to the continuing development of a vibrant, creative community. Values Access Collaboration Education Inclusiveness Integrity Service Unity DIRECTORIES Artists Organizations Venues SUBMIT A LISTING Event Artist Organization ABOUT Sarasota Arts Contact Us Privacy Policy ABOUT The Arts and Cultural Alliance of Sarasota County is a member-powered organization that serves as an advocate for arts and culture in Sarasota County. CONTACT US HOURS : 9 a.m. – 5 p.m. Monday – Friday SARASOTA ARTS | 1226 N. Tamiami Trail, Suite 300 Sarasota FL 34236 941-365-5118 | info@sarasotaarts.org © 2025 - Arts and Cultural Alliance of Sarasota County. All Rights Reserved. { Powered by ARTSOPOLIS }"
    },
    {
      "url": "https://variety.com/2024/film/news/sarasota-film-festival-2024-lineup-steve-buscemi-the-listener-1235946181/",
      "text": "Sarasota Film Festival Lineup Includes Steve Buscemi's 'The Listener' Sarasota Film Festival Lineup Includes Steve Buscemi's 'The Listener' Plus Icon Film Plus Icon TV Plus Icon What To Watch Plus Icon Music Plus Icon Docs Plus Icon Digital & Gaming Plus Icon Global Plus Icon Awards Circuit Plus Icon Video Plus Icon What To Hear Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Got a Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Variety Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Variety Plus Icon Read Next: Don Cheadle, Bridgid Coulter and Faith Evans to Be Honored at HollyRod’s DesignCare Gala Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Home Film News Mar 21, 2024 2:00pm PT Sarasota Film Festival’s 2024 Lineup Includes Sundance Favorites and Steve Buscemi’s ‘The Listener’ (EXCLUSIVE) The 10-day Florida fest will feature 23 narrative features, 41 documentary features and 81 short films By Addie Morfoot Plus Icon Addie Morfoot Contributor @kamorfoot Latest ‘Observer’ Doc Director Ian Cheney on Embracing  Bespoke Distribution: ‘We Are Curating an Event That Reminds Us Why We Make These Films’ 20 hours ago In ‘Love + War,’ Pulitzer Prize-Winning Photographer Lynsey Addario Gets Candid About Risking Her Life, Being a Mom and Not Having It All 6 days ago Director Oren Jacoby On His Big Oil Resistance Telluride Doc ‘This Is Not A Drill’: ‘It’s a Look At The Failure of an Entire Industry to Tell the Truth’ 1 week ago See All Michael Cambio Fernandez Steve Buscemi’s “The Listener” is heading to the Sarasota Film Festival . The 26th edition of the Florida fest will feature live and in-person screenings and events that will take place across Sarasota beginning on April 5. The 10-day fest will feature 23 narrative features, 41 documentary features and 81 short films. Buscemi will be in Sarasota to participate in a Q&A following the screening of “The Listener,” which will serve as the closing night film. About a crisis hotline worker enduring the pressures of her job, the film starring Tessa Thompson made its world premiere at Venice Film Festival in 2022. Related Stories Mindy Kaling Hulu Comedy Series 'Not Suitable for Work' Sets Five Main Cast Members 'Deli Boys' Renewed for Season 2 at Hulu, Fred Armisen Joins Cast Lynn Dow’s “Bull Street,” starring Loretta Devine and Amy Madigan, will open the fest on April 5. The drama centers on a South Carolina small-town lawyer (Malynda Hale) as she faces local politics and an unwavering judge (Madigan) when her estranged father’s family tries to evict her and her grandmother (Devine) from her home. Popular on Variety Jeff Dupre’s documentary “This Is a Film About the Black Keys,” which examines the story of musicians Dan Auerbach and Patrick Carney’s journey from a basement jamming session in Akron, Ohio, to rock ’n’ roll super-stardom, will make its Florida debut as the festival’s centerpiece film on April 12. The film made its world premiere earlier this month at the South by Southwest Film Festival. The fest’s narrative centerpiece screenings include the April 12 East Coast premiere of Warren Skeels’ thriller “The Man in the White Van,” and the April 13 Florida premiere of Ethan Berger’s “The Line,” a thriller exploring the moral ambiguity of loyalty to tradition. “The Line” stars Austin Abrams, a Sarasota-native who will attend the festival and receive SFF’s Rising Star Award. Abrams credits including HBO’s “Euphoria,” Netflix’s “Do Revenge”  and Amazon Studios’ “Chemical Hearts.” His next role is opposite George Clooney and Brad Pitt in the Jon Watts’ upcoming  movie “Wolfs.” “It is incredibly special that we also have the opportunity to honor a young talent in Austin Abrams — whose work has spanned prestige television to independent film — and to welcome him back to the community that helped launch his passion for the arts,” says Sarasota Film Festival chairman and board president  Mark Famiglio. “We are proud to continue supporting film education, and to help spur creative output and tourism in the greater Sarasota area through the festival’s partnerships this year with Ringling College of Art and Design, Art Advocates, and many other local institutions.” Fest’s spotlight presentations include Sundance documentaries Natalie Rae and Angela Patton’s “Daughters” and Dawn Porter’s “Luther: Never Too Much,” as well as DOC NYC films Jeff Zimbalist’s “How to Come Alive With Norman Mailer,” and Stephen Soucy’s “Merchant Ivory.” Also included in the spotlight presentations is Noah Pritzker’s narrative comedy “Ex-Husbands” about a middle-aged man overwhelmed by his pending divorce and the declining health of his father, which stars Griffin Dunne and Roseanne Arquette. The narrative feature competition will showcase Mohamed Kordofani’s “Goodbye Julia,” Monia Chokri’s “The Nature of Love,” Olmo Schnabel’s “Pet Shop Days,” Pascal Plante’s  “Red Rooms,” and Josh Margolin’s “Thelma.” The documentary feature competition include Brian J. Smith’s “A House Is Not a Disco,” Liam Jordan’s “Into the Spotlight: The Jake Ilardi Story,” Brendan Bellomo and Slava Leontyev’s “Porcelain War,” Margreth Olin’s “Songs of Earth” and Emily Kassie and Julian Brave NoiseCat’s “Sugarcane.” This year’s festival will also feature a new partnership with USA Swimming, formed in conjunction with the Open Water National Championships taking place May 3-5 at Sarasota’s Nathan Benderson Park. SFF will welcome athletes and representatives from USA Swimming at this year’s edition to receive a donation directly supporting the USA Swimming Foundation, which aims to provide the opportunity for every person in the US to learn to swim. SFF will feature 13 programs of short narrative and documentary films. Tickets for the festival will be available for purchase beginning March 22 online and in-person. 2024 Sarasota Film Festival Lineup: OPENING NIGHT FILM BULL STREET East Coast Premiere dir. Lynn Dow (USA), 2024 In this stirring drama, a South Carolina small-town lawyer (Malynda Hale) faces local politics, an unwavering judge (Amy Madigan) and the town’s past in the battle of her life when her estranged father’s family tries to evict her and her grandmother (Loretta Devine) from the only home she has ever known. CLOSING NIGHT FILM THE LISTENER Florida Premiere dir. Steve Buscemi  (USA), 2022 In this stirring testament to the power of empathy, Tessa Thompson (in a masterful performance) plays a crisis hotline worker enduring the pressures of her job in this new film from director Steve Buscemi. NARRATIVE CENTERPIECE FILMS THE LINE Florida Premiere dir. Ethan Berger (USA), 2023 This chilling, nuanced thriller explores the moral ambiguity of loyalty to tradition, as seen through a college sophomore in the throes of fraternity culture. Featuring Sarasota native Austin Abrams. THE MAN IN THE WHITE VAN East Coast Premiere dir. Warren Skeels (USA), 2024 Inspired by a true story, The Man in the White Van dives into the eerie underbelly of a seemingly idyllic 1974 Florida town and follows the harrowing experience of young Annie Williams, whose carefree existence is turned upside down as she becomes stalked by an ominous man in a white van. DOCUMENTARY CENTERPIECE FILM THIS IS A FILM ABOUT THE BLACK KEYS East Coast Premiere dir. Jeff Dupre (USA), 2024 The story of Dan Auerbach and Patrick Carney’s journey from a basement jamming session in Akron, Ohio to rock ’n’ roll super-stardom. *Please note this film is also screening in the Music Focus Sidebar. SPOTLIGHT FEATURES DAUGHTERS dir. Natalie Rae and Angela Patton (USA), 2024 Four young girls prepare for a special Daddy Daughter Dance with their incarcerated fathers, as part of a unique fatherhood program in a Washington, D.C., jail. EX-HUSBANDS dir. Noah Pritzker (USA), 2023 This poignant comedy follows a middle aged man overwhelmed by his pending divorce and the declining health of his father, who plans a getaway to Tulum, insistent he knows nothing of his son’s plans to be there at the same time for a bachelor party. HOW TO COME ALIVE WITH NORMAN MAILER Florida Premiere dir. Jeff Zimbalist (USA), 2023 The life and times of an American icon, from his formative years in Brooklyn through his career as a preeminent cultural voice. *Please note this film is also screening in the Jewish Focus Sidebar. LIV ULLMANN: A ROAD LESS TRAVELED dir. Dheeraj Akolkar (USA), 2023 A delightful, engaging portrait of one our greatest actresses, brimming with intimate memories and profound reflections on her hopes, fears, grief, rejections, dreams pursued, and lessons learned. *Please note this film is also screening in the Arts Sidebar. LUTHER: NEVER TOO MUCH Florida Premiere dir. Dawn Porter (USA), 2024 Luther Vandross started his career supporting David Bowie, Roberta Flack, Bette Midler, and more. His undeniable talent earned platinum records and accolades, but he struggled to break out beyond the R&B charts. Intensely driven, he overcame personal and professional challenges to secure his place amongst the greatest vocalists in history. *Please note this film is also screening in the African-American & The African Diaspora and Music Focus Sidebars. MERCHANT IVORY dir. Stephen Soucy (USA), 2023 The story behind the longest running partnership in the history of cinema that has produced such classics as Howard’s End, A Room with a View and The Remains of the Day. *Please note this film is also screening in the Arts and LGBTQ+ Focus Sidebars. TAKING VENICE dir. Amei Wallach (USA), 2023 This fun caper movie explores the true story behind the rumors that, at the height of the Cold War, the U.S. government rigged the most influential art exhibition, the Venice Biennale, so that their chosen artist, Robert Rauschenberg, could win the festival’s Grand Prize. Told with an extraordinary cast of experts and insiders from the art world with extensive archival footage. *Please note this film is also screening in the Directed by Women and Arts Sidebars. NARRATIVE FEATURE COMPETITION GOODBYE JULIA dir. Mohamed Kordofani (Sudan), 2023 Amid the social and political upheaval of Sudan in 2005, two women’s disparate lives become unexpectedly entangled in tragedy, friendship and lies in this moving tale. *Please note this film is also screening in the African-American & The African Diaspora Sidebar. THE NATURE OF LOVE Florida Premiere dir. Monia Chokri (Canada, France), 2023 A sexy, witty romcom examining romantic passion in a real-world environment that follows philosophy lecturer Sophia’s happily intellectual life disrupted when she meets a rugged building contractor. *Please note this film is also screening in the Directed by Women Sidebar. PET SHOP DAYS Florida Premiere dir. Olmo Schnabel (USA), 2023 A riveting portrait of lost young men in search of connection whose activities drag them into a dead-end world of passion, drugs and depravity in the backstreets of New York City. *Please note this film is also screening in the LGBTQ+ Focus Sidebar. RED ROOMS dir. Pascal Plante (Canada), 2023 Kelly-Anne is riveted by a high profile case of a serial killer. When reality blurs with her morbid fantasies, she goes down a wicked path to seek the final piece of the case’s puzzle in this wonderfully creepy tale of the dark web and over-the-top obsession. THELMA dir. Josh Margolin (USA), 2024 When 93-year-old Thelma Post (June Squibb) gets duped by a phone scammer pretending to be her grandson, she sets out on a treacherous quest across the city to reclaim what was taken from her. A thrilling and delightful story exploring aging, family and autonomy. *Please note this film is also screening in the Jewish Focus Sidebar. DOCUMENTARY FEATURE COMPETITION A HOUSE IS NOT A DISCO Florida Premiere dir. Brian J. Smith (USA), 2024 An intimate and humorous film that peers into one of the world’s only “homo-normative” communities, the island “paradise” of Fire Island Pines, told through home video, archival footage, and eccentric character portraits of the vibrant present. *Please note this film is also screening in the LGBTQ+ Focus Sidebar. INTO THE SPOTLIGHT: THE JAKE ILARDI STORY World Premiere dir. Liam Jordan (USA), 2022 An action-packed look at the highs, lows, and injuries Osprey’s Jake Ilardi endures on his journey to the US Olympic Skateboard team, and his mission within his local community to keep their skatepark operational and free to the public. *Please note this film is also screening in the Sports Focus sidebar. PORCELAIN WAR Florida Premiere dir. Brendan Bellomo & Slava Leontyev (USA, Ukraine), 2024 Amidst the chaos and destruction of the brutal Russian invasion of Ukraine, three artists defiantly find inspiration and beauty as they defend their culture and their country in this Sundance Grand Jury Prize winner. *Please note this film is also screening in the Arts Sidebar. SONGS OF EARTH Florida Premiere dir. Margreth Olin (Norway), 2023 A majestic symphony of stunning beauty for the big screen. With director Margreth Olin’s 85-year-old father as a guide, we experience Norway’s most scenic valley, Oldedalen in Nordfjord. *Please note this film is also screening in the Directed by Women Sidebar. SUGARCANE dir. Emily Kassie, Julian Brave & NoiseCat (USA, Canada), 2024 This Sundance award winner is a gripping investigation where unmarked graves at an Indian residential school unearth secrets below and above ground, igniting a reckoning in the lives of survivors and their descendants (including the film’s co-director). *Please note this film is also screening in the Directed by Women Sidebar. INDEPENDENT VISIONS FEATURE COMPETITION ART THIEF dir. Arthur Egeli (USA), 2023 After stealing a painting from a local museum, a passionate-but-untalented artist is thrust into the midst of the biggest art theft in modern history. Inspired by true events. *Please note this film is also screening in the Arts Sidebar. BLOOM East Coast Premiere dir. Mark Totte (USA), 2023 The touching story of an Indiana woman in her late sixties who embarks on a road trip across America, wandering through towns, memories and reckoning with her past. CURRY SCENT World Premiere dir. Christa Boarini (USA), 2024 A refreshing tale about a Bradenton-based Indian immigrant family desperately grasping for the American Dream by trying to find their daughter, Geetha, a wealthy match before their visas run out. *Please note this film is also screening in the Directed by Women Sidebar. GOOD BAD THINGS dir. Shane D. Stanger (USA), 2024 A young man with muscular dystrophy steps out of his comfort zone and into the world of online dating. An unexpected match challenges him to be vulnerable and sparks a profound journey of self-acceptance. PUDDYSTICKS East Coast Premiere dir. Megan Seely (USA), 2024 A joyously twisted comedy that follows anxious videogame designer Liz’s therapeutic odyssey into a secret society of adults who play like they are little kids. *Please note this film is also screening in the Directed by Women Sidebar. NARRATIVE FEATURES CHUCK CHUCK BABY Florida Premiere dir. Janis Pugh (United Kingdom), 2023 Helen’s humdrum world takes a surprisingly interesting romantic turn with the return of her charismatic childhood friend Joanne. This is the musical rom-com set in a Welsh chicken processing plant you never knew you needed. *Please note this film is also screening in the Directed by Women and LGBTQ+ Focus Sidebars. CLOWNS LIKE ME dir. Jason Cannon (USA), 2023 A humorous, poignant, and profound examination of the stigmas attached to developmental disorders and mental illnesses, offering hope to anyone on a journey to achieve mental wellness. THE FEELING THAT THE TIME FOR DOING SOMETHING HAS PASSED Florida Premiere dir. Joanna Arnow (USA), 2023 A mosaic-style comedy following the life of a woman as time passes in her long-term casual BDSM relationship, low-level corporate job, and quarrelsome Jewish family. *Please note this film is also screening in the Jewish Focus Sidebar. GREEN BORDER Florida Premiere dir. Agnieszka Holland (USA), 2023 A harrowing story set on the border of Poland and Belarus that offers a glimpse into the lives of refugees  fleeing to the European Union and the humanitarian activists working to help them reach safety. *Please note this film is also screening in the Directed by Women Sidebar. HELLBENT ON BOOGIE World Premiere dir. Vito Trupiano (USA), 2023 In this tender, humorous Florida-set drama, Quinn runs away from her overbearing mother with the help of her reckless brother in hopes of achieving her dream of becoming a dancer. THE MEANING OF A RITUAL dir. Natalie MacMahon (Germany), 2023 A coming of age story about two women from different generations, who have more in common than they are willing to admit. An empathic, young plant doctor gifted with extrasensory powers and an emotionally fragile, isolated artist, must rescue each other to rediscover the essence of living. *Please note this film is also screening in the Directed by Women Sidebar. THE OLD OAK Florida Premiere dir. Ken Loach (United Kingdom), 2023 A story of anger and tolerance when a group of Syrian refugees moves into a floundering English village, and a decisive rift fueled by prejudices develops between the community and its newest inhabitants. THE TROUBLE WITH JESSICA dir. Matt Winn (USA), 2023 A dead body, a nosy neighbor and a blueberry clafoutis dessert are just a few of the items a couple on the verge of financial collapse encounters over one very eventful evening in this hilarious black comedy. DOCUMENTARY FEATURES 36 SECONDS: PORTRAIT OF A HATE CRIME dir. Tarek Albaba (USA), 2023 Out of the 2015 tragedy of three Muslim-Americans shot point blank in North Carolina, comes this moving look at a resilient community in pursuit of the truth and, ultimately, the proper justice. BAD LIKE BROOKLYN DANCEHALL Florida Premiere dir. Ben DiGiacomo & Dutty Vannier (USA), 2023 A celebration of the Jamaican dancehall music scene that reverberated across Brooklyn in the 90s and its ever-present influence on a younger generation. Executive produced by Shaggy. *Please note this film is also screening in the African-American & The African Diaspora and Music Focus Sidebars. CATCHING FIRE: THE STORY OF ANITA PALLENBERG Florida Premiere dir. Alexis Bloom & Svetlana Zill (USA), 2023 An exploration of the life of Anita Pallenberg, European actress and rock ’n’ roll muse. Told in Anita’s own words, from her unpublished memoir, and in the words of her family and others close to her, this bittersweet film is a never-seen-before look at life with The Rolling Stones. *Please note this film is also screening in the Directed by Women and Music Focus Sidebars. CHUCK OWEN AND THE JAZZ SURGE PRESENT: THE MAKING OF WITHIN US – THE 25TH ANNIVERSARY ALBUM dir. Jared Brown (USA), 2022. This documentary takes audiences through the creative process, showcasing the collaboration that went into crafting the celebrated 25th-anniversary album of Chuck Owen and the Jazz Surge. COPA ‘71 dir. James Erskine & Rachel Ramsay (UK), 2023 In this documentary executive produced by Serena and Venus Williams, the filmmakers use archival footage and new interviews to tell the story of the captivating yet “unofficial” 1971 Women’s World Cup, a moment virtually erased from the history of soccer. *Please note this film is also screening in the Directed by Women and Sports Focus Sidebars. THE DEATH TOUR East Coast Premiere dir. Stephan Peterson & Sonya Ballantyne (Canada), 2023 The Death Tour follows wrestling hopefuls across remote Indigenous communities in Canada’s far North on “the most grueling tour in indie wrestling.” This test of strength and grit will show how far some are willing to go to live their dreams. *Please note this film is also screening in the Directed by Women and Sports Focus Sidebars. FIELDING DREAMS: A CELEBRATION OF BASEBALL SCOUTS World Premiere dir. H James Gilmore (USA), 2024 An intimate journey profiling baseball scouts, the unsung heroes of America’s pastime, who use their instincts and intuition to find the ballplayers of tomorrow in the face of growing technology, data and big business. *Please note this film is also screening in the Sports Focus sidebar. JESSZILLA Florida Premiere dir. Emily Sheskin (USA), 2023 New Jersey’s Jesselyn Silva, a three-time national boxing champion, is on her way to superstardom, dominating the junior ranks at the age of 15. With her every step of the way is her father Pedro, a single parent who helps her navigate coaches, training schedules, and the angst of teenage life. When a devastating diagnosis threatens the father-daughter tandem, the pair turn to each other to fight their greatest opponent yet. *Please note this film is also screening in the Directed by Women and Sports Focus Sidebars. LADY LIKE dir. Luke Willis (USA), 2024 Enrapturing profile of Rex Wheeler, better known to the outside world as drag queen extraordinaire and Ru Paul’s Drag Race finalist Lady Camden, who works with Rex to save his inner child after a troubled and traumatic childhood. *Please note this film is also screening in the LGBTQ+ Focus Sidebar. LEFT ALONE RHAPSODY dir. Stewart M Schulman (USA), 2023 A look at the life of pianist John Bayless, who becomes an internationally renowned performer and recording artist, suffers a debilitating stroke, and begins a career comeback in this journey through music, illness and determination. *Please note this film is also screening in the Music Focus Sidebar. MAKA dir. Elia Moutamid (Italy), 2023 An exploration of displacement, identity, and belonging in following noted Cameroon-born author Geneviève Makaping’s life in Italy and perilous migration journey. A story of a Black woman reclaiming the narrative and speaking out against the media’s representation of immigrants. *Please note this film is also screening in the African-American & The African Diaspora Sidebar. THE MAMMOTH HUNT North American Premiere dir. Aistė Stonytė (Lithuania), 2023 The incredible story of Lithuanian theater director (and now Sarasota resident) Jonas Jurašas’ leaving his country in 1968 in the wake of a play banned by the Soviets, the secret filming of that play and Jurasas’ new life in America and eventual return to his homeland. *Please note this film is also screening in the Directed by Women and Arts Sidebars. MINTED dir. Nicholas Bruckman (USA), 2023 A fascinating look at the intersection of art, commerce, and digital ownership through the rise and crash of the NFT market. MOVIEPASS, MOVIECRASH East Coast Premiere dir. Muta’Ali (USA), 2024 The unbelievable origin story, meteoric rise and stranger-than-fiction implosion of the theatrical movie subscription app, MoviePass, as told through the eyes of the visionary co-founders, complete with the unique challenges they faced only to eventually find themselves cast aside, watching from the sidelines, as new executives seized control and havoc ensued. MY NAME IS ALFRED HITCHCOCK dir. Mark Cousins (United Kingdom), 2022 In a most unique fashion, along with a bevy of clips, My Name Is Alfred Hitchcock re-examines the vast filmography and legacy of one of the 20th century’s greatest filmmakers through a new lens: through the auteur’s own voice. *Please note this film is also screening in the Arts Sidebar. NAKED AMBITION: BUNNY YEAGER dir. Dennis Scholl & Kareem Tabsch (USA), 2023 The scintillating story of Miami’s Bunny Yeager, a trailblazing model, designer, and photographer who popularized the bikini, invented the selfie, discovered Bettie Page, and introduced feminist agency in sexy pictures in the ’50s. *Please note this film is also screening in the Arts Sidebar. NO ONE ASKED YOU Florida Premiere dir. Ruth Leitman (USA), 2023 Comedian, disrupter extraordinaire and The Daily Show co- creator Lizz Winstead and her team of activists crisscross the U.S. to support abortion clinic staff and bust stigma. Pop culture icons and next-gen comics fuel this six-year road film activating small-town folks to rebuild vandalized clinics, exposing wrongdoer politicians, domestic terrorists, and media neglect as the race to the bottom ensues. *Please note this film is also screening in the Directed by Women and LGBTQ+ Focus Sidebars. SOMEONE LIVES HERE Florida Premiere dir. Zachary Russell (USA), 2023 A modern-day David and Goliath story, set against the backdrop of North America’s housing crisis, when a carpenter takes it upon himself to build, and make accessible, small, life-saving shelters for the unhoused residents of Toronto during the pandemic. SOUNDTRACK TO A COUP D’ETAT dir. Johan Grimonprez (Belgium, France), 2024 A vibrant film essay, likely the most music-filled history lesson you’ll ever partake, that marries jazz and politics to unravel the colonial machinations of power in the Congo circa 1960. STYLEBENDER Florida Premiere dir. Zoe McIntosh (USA), 2023 An intimate look at Israel Adesanya, the Nigerian born New Zealand based MMA champion, which goes beyond the ring and delves deep into an unlikely fighter’s journey. Exploring themes of masculinity, bullying and even the healing power of dance, this documentary is a poignant examination of the complex, exciting and sometimes controversial person known as “The Last Stylebender.” *Please note this film is also screening in the African-American & The African Diaspora, Directed by Women, and Sports Focus Sidebars. SUSAN FENIGER. FORKED Florida Premiere dir. Liz Lachman (USA), 2023 The wildly entertaining behind-the-scenes story of award-winning celebrity chef Susan Feniger on her first solo restaurant and her passionate struggle and quest to bring global street food under one roof in the form of a new L.A. restaurant. *Please note this film is also screening in the Directed by Women and LGBTQ+ Focus Sidebars. SWAMP DOGG GETS HIS POOL PAINTED Florida Premiere dir. Ryan Olson & Isaac Gale (USA), 2024 Hidden away, deep in the suburbs of Los Angeles, legendary cult musician, songwriter and producer Swamp Dogg, alongside housemates Moogstar and Guitar Shorty, have transformed their home into an artistic playground. Together, they navigate the tumultuous music industry, forging a unique and inspiring bond across time and space. *Please note this film is also screening in the African-American & The African Diaspora and Music Focus Sidebars. UNBROKEN dir. Beth Lane (USA), 2023 The daughter of a Holocaust survivor embarks on an international quest to uncover answers about the plight of her mother and her six siblings who, as mere children, escaped Nazi Germany relying solely on their own youthful bravado and the kindness of German strangers. *Please note this film is also screening in the Directed by Women and Jewish Focus Sidebars. YOURS IN FREEDOM, BILL BAIRD dir. Rebecca Cammisa (USA), 2023 Florida Premiere Oscar-nominated filmmaker Rebecca Cammisa gives us a portrait of Bill Baird, who has been called the devil incarnate, pervert, CIA agent, saint, the unsung hero of the birth control battle and whose decades-long fight for women’s right to abortion is as relevant as ever. *Please note this film is also screening in the Directed by Women Sidebar. SFF FOCUS: ENVIRONMENT COMMON GROUND dir. Joshua Tickell & Rebecca Harrell Tickell (USA), 2023 The solution of Regenerative farmers to bring soil health across the continent and beyond. CONSERVATION ACROSS CONTINENTS: MADAGASCAR dir. Fredric Lehne (USA), 2024 Lemurs are the most unique and most endangered primates in the world. This documentary film discusses the work of Lemur Conservation Foundation in Madagascar and Myakka City, Florida. NOCTURNES Florida Premiere dir. Anupama Srinivasan & Anirban Dutta (USA, India), 2024 This uniquely immersive Sundance Award winner transports us to the mountainous forest of the eastern Himalayas, where researchers seek to describe and understand moth diversity at different elevations as a way to urge us all to look more closely at the hidden interconnections of the natural world. ORGANIC RISING Florida Premiere dir. Anthony Suau (USA), 2023 A thorough look at the organic food culture – both the history and current practices – that demystifies the regulatory process and farming methods to give us informed choices for maintaining a strong and robust agricultural future. WOMEN OF THE WATERSHED dir. Scott Michael Barnett (USA), 2024 A young woman journeys to the source of the Everglades headwaters to better understand the historic challenges of water management and pollution that now threaten this fragile ecosystem. Along the way she meets a new generation of advocates who are redefining the balance of women in conservation. NARRATIVE SHORTS BAD DRIVER dir. Antonia Grilikhes-Lasky (USA), 2024 The end of a relationship leaves a woman desperate to reassert her independence by overcoming her driving phobia. But when she finds herself in the driver’s seat, she turns into a compulsive oversharer who can’t start the car. Luckily, her new driving companion won’t let her off the hook so easy. BEIN’ GREEN dir. William Givens-Jensen (USA), 2023 Olivia, a talented biracial actress, participates in an audition through a Zoom call. Her agent calls with positive feedback but tells her she needs to go back on tape and act more “authentically black.” Olivia defiantly tapes herself, expressing her exhaustion with being judged, and chooses to embrace who she is whether they like it or not. BIRD HOURS dir. Kyle Dubiel (USA), 2023 Lars and Frances are two young professionals who work day in and day out for Sol Corp. Their routine consists of putting on VR Headsets and transporting their souls into the “cloud”. After reports of absurd catastrophic news events, Lars smashes his and Frances’ headsets and they escape their apartment into a sun-drenched world of unknowns. CHAUNCEY dir. Daniel Rashid & Reilly Anspaugh (USA), 2023 When Zoe brings her new boyfriend home for the first time, she decides to hide her childhood stuffed animal Chauncey in the sock drawer. But when she starts to her Chauncey’s voice in her head, she has to choose whether to continue hiding him, or to reveal the truth and risk disaster. COUPLE OF CARDS dir. Toky Randriamahazosoa & Andrianiaina Ramanasoa (USA), 2024 Two silly old farts – Fredric Lehne and Reed Birney – have coffee at Ida’s diner, like they do every morning, when unexpected events compel them to confront the past, their lifelong rivalry, and the memory of the gal who broke both their hearts, while still giving hope for the future. COLOR OF AUTUMN dir. Aimiende Negbenebor Sela (USA), 2023 Inspired by a true story, this film depicts a precocious eight-year-old Black girl who lives with her hardworking parents and her adoring, wise grandmother in a quaint house on the Southside of Chicago. Nestled within the safety of her neighborhood and focused on the comforts and stresses of her family’s hard-won middle class life, Dottie Grimsby has little awareness of racial tension or the isolation of segregation. But she is about to find out. DARK ROOM dir. Christine Juarbe (USA), 2023 A successful woman attempts to work through childhood trauma through lucid dreaming. Can she face the truth? DELTA dir. Jing Ai Ng (USA), 2023 The Chinese-American Lee family, who has lived in the Mississippi Delta for generations, is preparing for the day by taking inventory at their grocery store. The two Lee siblings — Phoebe and Raymond — work in tandem like they have all of their lives. Except this summer is different. Phoebe is leaving home for a college far from Mississippi, and in doing so is saying goodbye to her older brother and an entire way of life. DRAGONFLY dir. Julia Morizawa (USA), 2023 A young girl learns of her mother’s survival of the Tokyo Firebombing on March 9-10, 1945 through the eyes of her brother’s spirit. EATING 38 CHEESEBURGERS dir. Andrew Schwab (USA), 2024 A twenty-first century ouroboros. It’s burgers all the way down. ESTELA, IS IT YOU? dir. Fabian Martin & Victor Martin (USA), 2023 A grieving woman communicates with her dead husband through her car radio. FLOWER dir. Lauren Finerman (USA), 2023 Rose struggles to get by as her mother’s caretaker while experiencing housing insecurity when she finds a source of hope in an unexpected place– her community. GREETINGS dir. Stephanie Bencin (USA), 2023 After struggling over what to write in a coworker’s birthday card, Trish discovers that whatever she writes comes true. At first this goes great, but when her coworkers accidentally forget her own birthday, things…take a turn. HOMECOMING dir. David R. Hardberger (USA), 2023 A woman is awakened in the middle of the night by her husband at the front door. When she tries to tell him he can’t be there anymore, he ignores her words. INFRACTION dir. Timothy Blackwood (USA), 2023 When a prison guard is murdered on the job, his replacement and an inmate form an unlikely relationship with life-altering ramifications. This film is based on the real life story of Philadelphia native Terrance Lewis who served 21 years in prison for a murder he did not commit. THE LIFT dir. Laura Maccabee (USA), 2024 Following the loss of his husband, a grief-stricken retiree (Sam Anderson) finds renewed connection with a mysterious young woman who’s attempting to terminate a pregnancy. LITTLE ORANGE FLAGS dir. Julianna Gelinas Bonifacio (USA), 2024 Twelve-year-old Iris is sent to live on a farm in rural Pennsylvania after an encounter with her mom’s boyfriend. LESSONS dir. Shawn Butcher (USA), 2024 Family ties are tested after a pre-teen boy reveals his face in a robbery gone wrong. MAIN CHARACTER ENERGY dir. Sohale Dezfoli (USA), 2023 An actor goes into an open call but misses an important detail in the character description. MEETING MR. OSCAR dir. Toni Short & Jeongwon Lee (USA), 2023 Audrey, a middle aged woman sleepwalking through her life, encounters an elderly eccentric stranger, Mr. Oscar, who challenges her way of thinking and daily routines. Their unexpected friendship becomes a catalyst for her to step out of her comfort zone and move forward in a new direction. PANO dir. Henry Miller (USA), 2024 Film photographer, Tanner Pletzke, captures the essence of his surroundings, weaving a deeply personal narrative through mesmerizing panoramic collages that blur the line between art and photographic memory. Pushing the boundaries even further, he brings his collages to life as awe-inspiring physical installations, inviting viewers to step into a captivating world where complex emotions and hidden stories await. RUMIA dir. Anthony Vazquez (USA), 2024 The vision for this film was to utilize the perspective of what so many woman go through in life. Showcasing how a subject that is rarely discussed, is something that happens to so many woman around the world everyday. SLEEPING ALONE dir. Kelsea Buaman-Murphy (USA), 2023 Sleeping Alone is a short comedic thriller that follows Andy, a young woman from the city, as she attempts to enjoy a night of housesitting in the countryside. Over the course of the evening, her minor fears about sleeping in a house by herself begin to mount, forcing her to take increasingly extreme actions. SPARE ME dir. Wilderley Mauricette (USA), 2024 Spare Me tells the story of “Trey Compton” a young African American man confronting his past to overcome changing a flat tire. Throughout the story, the viewer is shown flashbacks to showcase what connection Trey has to this certain location which is a sundown town, and why changing a tire is no easy task for him to undertake. This is also a period piece, so the Production design, costumes, and props will reflect a southern state during the early 1930s/40s, and have a focus on sundown towns during that time period. *Please note this film is also screening in the African-American & The African Diaspora Sidebar. STRANGE CREATURES dir. Nicholas Payne Santos (USA), 2024 Desperate to see her brother again, a young woman visits the site of his death. Starring Quinn Jackson (It Cuts Deep) and Sean-Michael Wilkinson (American Horror Story), with Christine Nyland (An Unquiet Grave). THE DOLLCATCHER dir. Jamey Hastings (USA), 2023 A woman’s attempt to catch a few hours of peace and solitude in the woods is interrupted in the night by a mysterious girl. THE MISSING VOICE dir. Jeremie Dameme (USA), 2023 Chole, a victim of domestic violence is caught between trusting the police force that has so far proven unreliable in truly protecting her and her abuser’s campaign of threats and manipulation. THE OSSAN dir. Venita Ozols-Graham (USA), 2023 After her wealthy new husband dies unexpectedly, a young widow contacts a mystical Ossan to protect her from the teenaged step sons hell bent on eliminating her to regain control of the estate. THE SUIT dir. Carol McCann (USA), 2023 Inspired by a song of the same name written by the legendary songwriter Hugh Prestwood, the film follows a salt of the earth older woman and her granddaughter who go in search of the perfect suit for Grandpa, a man who has spent his life “scratchin’ the earth.” WHEN UNFETTERED dir. Derek Franzese (USA), 2023 When an AI humanoid’s proprietor passes away, she is released on a journey where she discovers what it means to feel emotion after encountering and befriending a special child. WHY DOGS HOWL dir. Sandi Johnson (USA), 2023 After meeting online, a BOY and GIRL are out on their first date. It rapidly devolves into the BOY vomiting out his life in a Howl that ultimately encompasses the entire universe. DOCUMENTARY SHORTS ALOK dir. Alex Hedison (USA), 2024 A compelling portrait of ALOK, acclaimed nonbinary author, poet, comedian, and public speaker. Executive-produced by Jodie Foster. BURTON ROCKS CALLING dir. Burton Rocks (USA), 2024 Burton Rocks’ health left him isolated. So, he started calling some of America’s biggest stars. They answered. Forty years later, Burton shares his fascinating collection of interviews for the first time. DAG CAMERA REPAIR dir. Atesh Atici (USA), 2024 Don Goldberg is one of the few master Leica repair technicians left in the world. He is overworked and his millennial clients don’t make it any easier, but his son is determined to follow in his footsteps. ENTERING PORNLAND: ROSI dir. Benjamin Nolot (USA), 2022 Rosi is a high school teacher who is loved by her students. When her battle to pay off her college loans prompts Rosi to seek a more lucrative source of income, she ends up getting hired as a porn actress. But the glow of her newfound stardom quickly fades when Rosi realizes her new career isn’t what she thought it might be. FINDING FATE dir. Beth Toni Kruvant (USA), 2023 The film centers on the lives and experiences of these three mothers – and the ferocity with which they fight to protect their children and families. In doing so, the viewer gets a rare glimpse of how powerful the maternal spirit is during a time of war. Through valuing each other’s histories and current realities, Finding Fate reveals that when we find common ground, we can unite to help build a shared future. I HAVE A NAME dir. Eric S. Vaughn (USA), 2024 A poignant documentary that unfolds alongside Jon Linton, an artist who lost a friend and colleague to addiction and homelessness. In an attempt to process what happened, Jon walked out into to world, with his camera, to open himself to the reality of what it is to be unhoused. He wandered into a human experience akin to Tolstoy walking out into his beloved Moscow in the late 1800s. IMPOSSIBLE IS JUST A WORD dir. Jen Stafford (USA), 2023 Chris Nikic made history by becoming the first athlete with Down Syndrome to complete the IRONMAN, the world’s most grueling triathlon. Amidst his astounding athletic accomplishments and intellectual disability, we uncover Chris’ greatest aspirations from homeownership to falling in love, drawing on points of relatability that resonate universally. KIM JONG, ALFAMAN AND THE PROBE: A LEMONS RACE: dir. Yasmin Sanie-Hay (USA), 2023 This documentary follows the wild and wacky adventures of three teams in the infamous 24 Hours of LeMons endurance race for $500 cars. MISS BROWN dir. Christina Burchard (USA), 2023 “Miss Brows” is a documentary-hybrid highlighting the enterprising spirit of Gina Fiore who uses her intellect and street smarts to become an elite player in the game of Blackjack. Over the course of her career she has led various teams, taking over 10 million dollars out of the casinos. THE CALM UNDER THE WATER dir. Cam Brooks (USA), 2024 An artist who is paralyzed from the neck down confronts several obstacles on his journey towards happiness and inner peace. THE SCHOOL OF CANINE MASSAGE dir. Emma D. Miller (USA), 2024 The Ojai School of Canine Massage provides professional training in the art and science of dog massage therapy. With a mix of whimsy and tenderness, this film offers a portrait of this singular school and its dog-loving participants —revealing how people heal dogs and dogs heal people. THE PERFECT SHOT: ANTARCTICA dir. Quinn Halleck (USA), 2023 In this Stephen King story adaptation, Larry deals with his sister’s disappearance, and discovers what he is, and isn’t responsible for, as he searches for her. INTERNATIONAL SHORTS BURN OUT dir. Chloe Culpin (United Kingdom), 2023 Heena, on the brink and desperate to get out of her soul-less, money driven job, goes on a midweek pub session with her co-workers where they all descend into animalistic chaos. ECOSPHERE dir. Vito Pistone (Belgium), 2024 A fire ant named Redd ends up separated from her colony inside a huge glass bowl called the Ecosphere. She befriends a group of local bugs who help her get back home, but is that really where she belongs? A GOOD DAY WILL COME dir. Amir Zargara (Canada), 2024 Arash is a professional wrestler with dreams of representing his country and winning gold medals. The country is in turmoil and its people are suffering. Arash must decide between using his platform to stand up to tyranny, or put his head down and remain silent. KINGS dir. Olivier Côté (Canada), 2024 Elias and Laurent are the only two new counsellors at camp this summer. When their initiation goes sideways, Laurent tries to get out of it – and the entire group ridicules him. Elias is trapped: he either needs to reject his friend, or risks being rejected himself. LIMITE dir. George Nicholas (Mexico), 2023 Sixteen-year-old Manuel lives in Tijuana, Mexico with his grandfather while his mom works in the United States. When he meets a girl, he sees an opportunity to assert his independence, but what he doesn’t know about her will push him to the limit.Inspired by real events. PILL NATION dir. Bruno Tadeu (Brazil), 2024 Dante is an old gay activist who refuses to retire. Facing the inevitable end of his existence, he decides to fulfill his old plans of opening the first LGBTQIA+ retirement house in Brazil, ignoring the advice of his great friend, Francisca, who argues that they no longer need to care. THE PHOTOGRAPHER dir. Alexander Graeff (France), 2023 France, 1936. Gerta, a young German photoreporter, lives in exile with her companion, the Hungarian photographer André Friedmann. When the Spanish civil war breaks out, they are determined to cover the events and thus to fight fascism. Faced with the newspapers’ reluctance to send them to Spain, Gerta decides to invent a new identity for them. PRIMOS dir. Ricardo J Varona (Puerto Rico), 2023 During a teenage road trip to the west coast of Puerto Rico, 16-year-old Cristóbal begins to suspect that his crush, Yazmín, and cousin Marcos are secretly seeing eachother. ROOSTER’S CROW dir. Alexandre Lefebvre (Canada), 2023 Drowned in a family reunion chaos filled with testosterone and pig roast, REYNALD will try to prove to his nephew, his family but mostly himself that’s he’s still king. THE SKATES dir. Halima Ouardiri (Canada), 2023 Mina loves to skate. Today, her father, recently divorced from her mother, accompanies her to her first figure skating lesson. An ordinary day if something hadn’t happened to the skates. THE WAITING dir. Voker Schlecht (Germany), 2023 Karen Lips is researcher and lives for several years in a tiny little shack in Costa Rica to observe frogs. When she leaves the cloud forest for a short time and returns, the frogs are gone. All of them. Karen sets out to find them – and encounters a horrible truth. TWENTY dir. Jason Hogan (United Kingdom), 2024 TWENTY is the story of the girl behind the number. Made in partnership with the charity SHELTER, the film follows Emily, a homeless ballet dancer undertaking a potentially life-changing audition. 2K5 dir. Nicole Pott (United Kingdom), 2023 It’s 2005, Ellie and her ‘BFF 4lyf’, Zoe, listen to rap music and slam rhymes every day, dreaming of the big stage. But, at twelve, for Ellie, it’s easy to be a dreamer and less easy to ignore the harsh realities as the only Black kid at school. RINGLING SHORTS ART AS A MEANS OF BREATH dir. Celi Mitidieri (USA), 2022 The community leader and artist Yoleidy Rosario-Hernandez explores the connections between art and ancestry in the journey to find zirself. BLINDS WIDE OPEN dir. Ben Sutherland (USA), 2023 An agoraphobic man named Greg, fears that someone outside of his apartment window is watching him. Every night he enjoys a routine of watching conspiracy filled videos from a public access TV talk show and has dinner with his only trusted friend, his neighbor. However, his paranoia is heightened when the talk show host begins speaking to him, informing him that his neighbor may not be what he seems. HEATHER dir. Sarah Forest (USA), 2024 Daisy, a young woman, lives at home balancing taking care of her ill and hyper-religious mom. Daisy becomes obsessed and infatuated with Heather Brown, a VHS aerobics instructor. Heather begins talking to Daisy through the TV, showcasing some demonic quirks. I <3 KATY dir. Peyton Leopold (USA), 2023 Two unsuspected lovers join forces to tackle a local graffiti legend. What starts out as a manic pixie dream turns into a cold harsh reality they both have to face. SUPER COOL REAL HORSE dir. Jeno Broschofsky (USA), 2023 Roommates and so-called friends make a small bet that turns into a high stakes battle through movie genres to decide who is the better storyteller. TESILFY dir. Jackson Fowler (USA), 2024 A fast paced display of the Tesla car. SARASOTA FILMMAKERS NARRATIVE SHORTS BLUE BOY dir. Tyler Riggs (USA), 2024 Insecure New Jersey bodybuilder, Joey Rossi aka Joey Muscles, starts doing steroids in a last ditch effort to go pro. CHROMA dir. Taoquan Fu (USA), 2024 DEEP AWAKENING dir. Steve Stein (USA), 2024 Across the country, video calls are interrupted when hackers break into a widely used chat application and broadcast a message using AI to all users that will change their lives forever. FOUNDATION dir. Steven Hedrick, Jr. (USA), 2024 When her girlfriend goes missing in a high-rise hotel, a lonely young woman desperately searches for her with the help of the night manager. NOVA dir. Tristan Anthony Ortiz (USA), 2024 After mysteriously vanishing in space, a young astronaut suddenly reemerges twenty years later to find the world and his wife have moved on. SCREAMING INTO THE WIND dir. Kevin O’Neill (USA), 2024 Evie Ingle, trapped in her grief and abusive marriage, takes matters into her own hands to break that cycle. Through visual and sonic storytelling, the audience will experience the inner world of Evie’s struggle without the use of dialogue. SHIP OF THESEUS dir. Michael Zhang (USA), 2024 In a post-biological revolution dystopia, Theseus, a young fighter with an unwavering sense of his father’s values, confronts a moral crossroads. As he battles cybernetically enhanced opponents in underground fights, he must decide whether to preserve his humanity or embrace technological augmentation for power. SUPERSTITIOUS dir. Melany Andrea Di Pietro Cecere & Carolina Rapp (USA), 2024 Superstitious tells a story about a clumsy and anxious fair named Ailbhe who owns a magic shop and does her best to avoid bad luck until one day an adorable black cat named Jinx stumbles into her store. Chaos ensues as Ailbhe gets progressively more stressed with every step Jinx takes. Will Ailbhe be able to overcome her fears to save them both before it’s too late? TREVOR HURT SOMEONE dir. Sam Pinnelas (USA), 2024 Straight male best friends Sean and Trevor deliberate the events of the preceding night, when Trevor sexually assaulted Sean, at the bar where it happened. WERNER HERZOG SAVES TAXI DRIVER dir. John Stevenson (USA), 2024 Two unsuspected lovers join forces to tackle a local graffiti legend. What When Martin Scorsese threatens to kill the head of Columbia Studios in response to its cut of his masterpiece TAXI DRIVER, film buddies Steven Spielberg and George Lucas enlist the help of the only filmmaker hardcore enough to save him… WERNER HERZOG! WREN’S WORLD dir. Hollis Rosenkranz (USA), 2024 Wren, fourteen, insecure, and tasked with watching her sister for the summer, is forced to spend her days at the community pool. Plagued by bikini-clad bodies surrounding her, Wren is sick of feeling inadequate and is intrigued when presented with the opportunity to finally become perfect. SARASOTA FILMMAKERS DOCUMENTARY SHORTS BAAR dir. Dev Walker (USA), 2024 After battling a life-threatening disease, a young man with down syndrome proves that challenges are meant to be overcome and that there’s no obstacle big enough to steal his joy. His determination is inspirational. His kindness is golden. His name is Joey Baar. CONNECTIONS dir. Corey Marr & Lisa Mills (USA), 2024 A close look inside the world of a Special Olympian, Becky Richter. DEAR TAMPA BAY dir. Amanda Moore (USA), 2024 Tampa Bay is one of the areas in our nation most vulnerable to climate change. But Tampa Bay isn’t alone, communities across the Gulf coast face similar climate impacts. FINISH dir. Dev Walker (USA), 2024 Against all odds, a young man with autism and tourette syndrome enters a grueling gravel race, pushing himself to the limit as he faces physical and mental challenges along the way. NOT ROD dir. Becca Greene & Alex Pollack (USA), 2024 As a renowned Rod Stewart tribute artist, George Orr entertains sold out crowds with his singing and Chardonnay-soaked banter. NOT ROD is a short documentary about a big personality who reminds us that it is never too late to do what you love. SPACE COAST dir. Justin Barber (USA), 2024 People from around the world gather on the Space Coast to witness the launch of Artemis-1, the ‘World’s most powerful rocket.’ But Mark, a veteran of the Space Shuttle Program, doubts this ‘moondoggle’ will ever fly. THE FENTANYL PROJECT dir. KT Curran (USA), 2024 The Fentanyl Project is a 26 minute, short documentary about the impact of illegal fentanyl abuse in Sarasota/Manatee counties. Read More About: Documentaries to Watch, Sarasota Film Festival Jump to Comments More from Variety Norway Picks Joachim Trier’s ‘Sentimental Value’ for the International Feature Oscar Race Indie Sales Closes Deals on Momoko Seto’s ‘Dandelion’s Odyssey’ Ahead of North American Premiere at Toronto (EXCLUSIVE) Film Movement Takes North American Distribution Rights for Cannes, Toronto Title ‘Renoir’ (EXCLUSIVE) JavaScript is required to load the comments. Loading comments... Most Popular Matthew Dowd Fired From MSNBC for Charlie Kirk Comments Glen Powell Says Chris Pratt in ‘Guardians of the Galaxy’ Changed Hollywood Leading Men: You Can Be ‘Sillier’ and Not Just ‘Brooding’ Like Robert… ‘Superman’ Sequel ‘Man of Tomorrow’ Is the Story of Superman and Lex Luthor Teaming Up Against a ‘Much Bigger Threat’; Filming Eyes April 2026… Daniel Day-Lewis Speaks Out on Ending Acting Retirement After Eight Years: I Felt ‘Hollowed Out’ but ‘I Never Stopped Loving the Work… Audible’s ‘Harry Potter’ Series Expands Cast With Keira Knightley, Kit Harington, James McAvoy, Simon Pegg and More Jezebel Adds Editor’s Note to Article About Hiring ‘Witches to Curse Charlie Kirk’ Published Two Days Before He Was Assassinated Polly Holliday, Who Played Flo on ‘Alice,' Dies at 88 Jimmy Kimmel on Charlie Kirk’s Shooting Death: Can We Stop ‘Angry Finger Pointing’ and ‘Agree It’s Horrible and Monstrous to Shoot Another Human… MSNBC Apologizes for Analyst Matthew Dowd's Commentary on Charlie Kirk's Death: 'Insensitive and Unacceptable' Joaquin Phoenix, Nicola Coughlan and More Join 3,900 Industry Names Pledging Not to Work With Israeli Film Institutions 'Complicit in War Crimes' Must Read Film COVER | Channing Tatum's 'Roofman' Reinvention By Andrew Wallenstein 1 week Film Venice Film Festival Reviews Film Cooper Hoffman on ‘The Long Walk,’ Coming of Age After 'Licorice Pizza' TV ‘SNL’ Adds Five: Meet the New Cast Members Film E. Jean Carroll Hopes Her Explosive Telluride Doc Will ‘Finish Off’ Donald Trump Sign Up for Variety Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Variety Confidential A Variety and iHeartRadio Podcast More From Our Brands Rolling Stone ‘The Furnace Just Lit Up’: Daniel and Ronan Day-Lewis on ‘Anemone’ Robb Report This Wild New Track-Only Supercar Is Powered by a Naturally Aspirated V-12 Sportico Kalshi’s Trading Arm Muddles ‘Peer-to-Peer’ Claims WWD Rebecca Minkoff Launches Stadium Collection at Amazon With Some Surprisingly Stylish Pieces TVLine Mr. & Mrs. Smith Season 2 Delayed at Prime Video (Report) Variety About Us Advertise Media Kit Careers Legal Terms of Use Privacy Policy California Privacy Rights Privacy Preferences AdChoices Your Privacy Choices Accessibility Magazine Customer Service Back Issues Subscribe Help More Newsletters Archives Events Luminate Connect Instagram Twitter YouTube Facebook LinkedIn Variety The Business of Entertainment Subscribe Today Have a News Tip? Let us know Variety Close the menu Expand the sub menu Film News Reviews Podcasts Box Office Events Columns Trailers Expand the sub menu TV News Reviews Podcasts Ratings Pilot Scorecard Columns Trailers Expand the sub menu What To Watch Lists & Features Expand the sub menu Music News Album Reviews Concert Reviews Hitmakers Music For Screens Grammys Expand the sub menu Docs Lists & Features Expand the sub menu Tech Features Global VIP+ Tech Expand the sub menu Global News Asia Markets & Festivals Features Expand the sub menu Awards Circuit News Film Predictions TV Predictions Video Artisans Columns Awards Circuit Podcast Expand the sub menu Video Popular Cover Shoots - Behind the Scenes Actors on Actors Power of Women Events Artisans Expand the sub menu What to Hear Lists & Features Expand the sub menu More Coverage Obituaries - submit obituaries to obits@variety.com Photos Podcasts Scene Voices Theater Expand the sub menu More Variety Live Media Summits Vscore Luminate - Film & TV Variety Archives Variety500 Industry Executives Have a News Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Alerts and Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Follow Us Got a Tip? Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Advertise About Contact Us Variety is a part of Penske Media Corporation. © 2025 Variety Media, LLC. All Rights Reserved. Icon Link Plus Icon ad"
    },
    {
      "url": "https://stpetecatalyst.com/events/sarasota-film-festival/",
      "text": "Sarasota Film Festival • St Pete Catalyst ST Pete's Business Daily (and a whole lot more) sign up for a free lifetime subscription And take your seat at the table Name Email Subscribe News Know Innovate Thrive Create Place Impact Venture Content SPG Insight Partner Stories Podcasts People Influencers The Hustle The Shuffle Organizations Connect Contribute Content Promote Your Business Meet the Team Support the Catalyst Events Community Voices Connect with us Type a text St Pete Catalyst News Know Innovate Thrive Create Place Impact Venture Content SPG Insight Partner Stories Podcasts People Influencers The Hustle The Shuffle Organizations Connect Contribute Content Promote Your Business Meet the Team Support the Catalyst Events Community Voices Founded in 1998, the Sarasota Film Festival (SFF) has grown to be a ten-day festival that plays independent and international narratives, docs and shorts that are programmed into a schedule of over 200 films including features, themed shorts packages and additional programming sidebars that change each year to reflect the strengths of submitted films. Festival events include socially-driven parties and private receptions to honor guest filmmakers, community-wide street festivals and the black-tie Filmmakers Tribute Dinner. SFF patrons have enjoyed intimate performances from Aerosmith and The B52’s as well as a host of special appearances from local and international musicians. Share Tweet Share Click to comment Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Please fill out all the form entries below. We do not publish anonymous comments. Comments are held for moderation per our posting guidelines - please read them.  We appreciate your taking the time to share your perspective on how to improve our community. First Name * Last Name * Email * Your email will not be published Subscribe to the Catalyst daily edition, the Daily Spark By posting a comment, I have read, understand and agree to the Posting Guidelines . Apr 01 2022 Sarasota Film Festival Organized by Paul Ratner Event Tags: Art Event Details Event Starts Apr 01 2022 12:00 PM Event Ends Apr 10 2022 12:00 PM Event Website View Social Media Event Phone (941) 364-9514 Event Email paul@sarasotafilmfestival.com Add to Calendar Location: Sarasota Film Festival, 332 Cocoanut Ave, Sarasota, FL, 34236 Featured Events Sep 12 @ 12:00 PM - Sep 13 @ 12:00 AM Lei'd On The Roof Luau Party Sep 12 @ 12:00 PM - Sep 13 @ 12:00 AM Sep 13 @ 09:00 AM - 01:00 PM Art Yard Sale Sep 13 @ 09:00 AM - 01:00 PM Sep 14 @ 06:00 PM - 09:00 PM OKSANA Live! In Saint Petersburg Sep 14 @ 06:00 PM - 09:00 PM Sep 17 @ 05:30 AM - 07:30 AM Quis for Life Community Gun Violence Awareness Walk Sep 17 @ 05:30 AM - 07:30 AM Share with friend Please enter email address you want to share this article with Share Calendar Click on the calendar you prefer to save this event to: Google Yahoo Outlook Apple iCal Cancel OK The St. Pete Catalyst The Catalyst honors its name by aggregating & curating the sparks that propel the St Pete engine.  It is a modern news platform, powered by community sourced content and augmented with directed coverage.  Bring your news, your perspective and your spark to the St Pete Catalyst and take your seat at the table. Email us: s park@stpetecatalyst.com Quick Links Contribute Content Events Sparkive The Wire St Pete X Promote Your Business Connect With Us Subscribe for Free Subscription Form Name Email Subscribe Privacy Policy | Copyright © 2020 St Pete Catalyst Share with friend Enter the details of the person you want to share this article with. Your Name * Your Email * Friend Email * Share Share Tweet Share"
    },
    {
      "url": "https://www.sarasotafilmfestival.com/sponsor/",
      "text": "Sponsor SFF - Sarasota Film Festival Skip to main content 2025 PASSES Films Schedule Special Events Screenings Shorts Previous Festivals 2024 2023 2022 2021 2020 2019 Visions of the Black Experience 2021 Cinematheque Education Summer Film Camps Cinematheque Outdoor Screenings Support Us Sponsor Volunteer About Our Sponsors Who We Are Submit Contact DONATE Buy Passes In The News Buy Passes In The News 2025 PASSES Films Schedule Special Events Screenings Shorts Previous Festivals 2024 2023 2022 2021 2020 2019 Visions of the Black Experience 2021 Cinematheque Education Summer Film Camps Cinematheque Outdoor Screenings Support Us Sponsor Volunteer About Our Sponsors Who We Are Submit Contact DONATE Sponsorship Opportunities As one of the highest-attended art events on Florida’s Suncoast, the Sarasota Film Festival is a leading platform for corporate exposure and brand activation opportunities. Whether providing goods or services, or direct financial support, there are many ways to make a big impression at SFF and we work hard to develop a customized sponsorship package that meets your marketing goals and budget. To find out more about sponsorship and marketing opportunities with the Sarasota Film Festival, please email petra@sarasotafilmfestival.com . Without the support of generous sponsors, the Sarasota Film Festival would not be able to fulfill our mission: To celebrate the art of filmmaking and the contribution of filmmakers by hosting an international film festival and developing year-long programs for the economic, educational, and cultural benefit of our community. Download SFF 2023 Sponsor Deck The Sarasota Film Festival (“SFF”), Inc. is a not for profit, charitable and tax exempt organization as defined by IRS Code 501(c)(3). Your tax deductible amount is limited to the excess of the contribution over the fair market value of any goods or services received in exchange for your donation. A copy of the official registration (CH12031) and financial information may be obtained from the Division of Consumer Services by calling toll free 1-800-435-7352 within the State of Florida. Registration does not imply endorsement, approval or recommendation by the State. Looking for other ways to support the Sarasota Film Festival? Sign up to stay in touch! Get SFF updates and event invites delivered to your inbox. By submitting this form, you are granting: Sarasota Film Festival, 332 Cocoanut Avenue, Sarasota, Florida, 34236, United States, https://sarasotafilmfestival.com permission to email you. You may unsubscribe via the link found at the bottom of every email. Title Sponsor Presenting Sponsor Signature Sponsors Sarasota Film Festival is devoted to supporting the art and elevating the craft of cinema. Become a Member SFF Films Education Membership Support Us About SFF News Get Tickets Privacy Policy Sarasota Film Festival 332 Cocoanut Ave. Sarasota, FL 34236 Copyright 2025  Sarasota Film Festival  |  Web design by Sande Caplin & Associates | Web Accessibility"
    }
  ]
}