{
  "fuentes": [
    {
      "url": "https://satellitebeach.gov/departments/police_department/administration/index.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/police_department/administration/index.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/residents/sustainable_satellite/beaches/beach_water_quality.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/residents/sustainable_satellite/beaches/beach_water_quality.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/department_information.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/department_information.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://pelicanhill.com/contact/",
      "email": "reservations@pelicanhill.com"
    },
    {
      "url": "https://www.satellitebeach.gov/departments/recreation_department/volunteer_opportunities.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://www.satellitebeach.gov/departments/recreation_department/volunteer_opportunities.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://www.abetterdj.net/Wedding-Galleries/CAMERON-CAITLIN-Pelican-Beach-Clubhouse-Satellite-Beach-FL/i-k5wmhtf",
      "email": "help@smugmug.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/recreation_facilities/pelican_beach_clubhouse.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/recreation_facilities/pelican_beach_clubhouse.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://www.abetterdj.net/Wedding-Galleries/GREG-WHITNEY-Pelican-Beach-Clubhouse-satellite-Beach-FL-9-9/i-jm3vLDS",
      "email": "help@smugmug.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/recreation_facilities/pelican_beach_park.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/index.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/index.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://pelicanbay.pt/en/contacts/",
      "email": "info@pelicanbay.pt"
    },
    {
      "url": "https://satellitebeach.gov/government/city_boards/sustainability_board/index.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/government/city_boards/sustainability_board/index.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/rental_facilities/index.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/rental_facilities/index.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/public_works/staff_teams.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/public_works/staff_teams.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://pelicanhotel.com/contact/",
      "email": "reservation@pelicanhotel.com"
    },
    {
      "url": "https://pelicanhotel.com/contact/",
      "email": "restaurant@pelicanhotel.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/special_events.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/special_events.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/police_department/",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/police_department/",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/pelican-beach-clubhouse-satellite-beach",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/pelican-beach-clubhouse-satellite-beach",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://www.pelicanbeach.com/contact/",
      "email": "pelicangrandpr@zimmerman.com"
    },
    {
      "url": "https://www.pelicanbeach.com/contact/",
      "email": "info@pelicanbeach.com"
    },
    {
      "url": "https://www.pelicanbeach.com/contact/",
      "email": "sales@pelicanbeach.com"
    },
    {
      "url": "https://weddingswithtifini.com/beach-clubhouse-wedding",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://weddingswithtifini.com/beach-clubhouse-wedding",
      "email": "typesetit@att.net"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/beach_bonfires.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/beach_bonfires.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/rental_facilities/drs_community_center.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/rental_facilities/drs_community_center.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/police_department/faqs___links/city_of_satellite_beach_contact_information.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/police_department/faqs___links/city_of_satellite_beach_contact_information.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/community_involvement.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/community_involvement.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/government/city_boards/index.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/government/city_boards/index.php",
      "email": "webpageupdate_subscribers@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/special_event_calendar.php",
      "email": "e-notification@revize.com"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/special_event_calendar.php",
      "email": "tgaskins@satellitebeach.gov"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/special_event_calendar.php",
      "email": "webpageupdate_subscribers@revize.com"
    }
  ],
  "mails": [
    "corporate@giftly.com",
    "e-notification@revize.com",
    "filler@godaddy.com",
    "help@smugmug.com",
    "info@pelicanbay.pt",
    "info@pelicanbeach.com",
    "merchants@giftly.com",
    "pelicangrandpr@zimmerman.com",
    "reservation@pelicanhotel.com",
    "reservations@pelicanhill.com",
    "restaurant@pelicanhotel.com",
    "sales@pelicanbeach.com",
    "tgaskins@satellitebeach.gov",
    "typesetit@att.net",
    "webpageupdate_subscribers@revize.com"
  ],
  "nombre_sitio": "satellitebeach.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://satellitebeach.gov/departments/police_department/administration/index.php",
      "text": "The Satellite Beach Police Department Command Staff Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Police Department Administration Related Pages Records Property & Evidence Biased Based Profiling Professional Standards Job Opportunities Alarm Permits Solicitation Permits Ride Alongs The Satellite Beach Police Department Command Staff Chief Jeff M. Pearson Jeff M. Pearson has served the Satellite Beach Police Department since January of 1987, rising through the ranks to his current role as Police Chief. Chief Pearson oversees a department composed of 25 sworn officers and 10 support staff. He is responsible for all facets of department operations including the Patrol Division, Criminal Investigations Division, Records Division, Evidence Division, Administrative Support staff, department policy, budget, and volunteer programs. Chief Pearson began his career as a dispatch trainee and became a full-time dispatcher in March of 1987. In 1988, he enrolled in the Police Academy. He attended the Academy during the day and worked the Dispatch midnight shift until he graduated. In 1989, Chief Pearson realized his dream of becoming a law enforcement officer and was hired as a full-time Satellite Beach Police officer. He has held numerous positions during his career with the Satellite Beach Police Department including Field Training Officer, Detective, Corporal, Sergeant, Staff Sergeant, and Commander. In October of 2008, he was promoted to Deputy Chief, overseeing the Field Training Officer Program, Motorcycle Unit, Selective Traffic Enforcement Unit, DUI Enforcement, budget, Evidence, and Records. On August 1, 2011, after serving three years as the Deputy Chief, he was promoted to the Chief of Police. Originally from Rochester, New York, Chief Pearson moved to Brevard County in 1979. He attended Satellite High School and earned an Associate degree from Brevard Community College in 1990. In 2003, he graduated from The University of Central Florida with a Bachelor’s degree in Criminal Justice with a minor in Psychology. Chief Pearson furthered his education at Webster University, earning a Master’s degree in Public Administration in December of 2006. In recognition of his leadership and community service, Chief Pearson was honored as one of Lead Brevard’s “4 under 40” winners in 2007, highlighting his exceptional leadership qualities and extensive community involvement. He is an active member of the Brevard County Association of Chiefs of Police, the Florida Police Chiefs Association, the International Association of Chiefs of Police, and the FBI National Academy. He is an Executive Board Member of the Florida Police Chiefs Association and served as the 66th President of the Florida Police Chiefs Association in 2020. Florida Governor Rick DeSantis reappointed Chief Pearson to serve as a Commissioner on the Criminal Justice Standards and Training Commission, where he has served since 2016. Chief Jeff M. Pearson may be reached at (321) 773-4400 or by email at: [email protected] Deputy Chief Brad Hodge Deputy Chief Brad Hodge has served the Satellite Beach Police Department for over 35 years. He graduated from Satellite High School and furthered his education at the Santa Fe Institute of Public Safety in Gainesville, Florida, where he graduated top of his class and obtained his Law Enforcement certification. Deputy Chief Hodge pursued Public Administration at the University of Central Florida and is an esteemed graduate of the FBI National Academy’s 218th session. Throughout his prestigious career, he has garnered numerous accolades, including two-time Satellite Beach Officer of the Year, Brevard County Officer of the Year, and City of Satellite Beach Employee of the Year in both 2006 and 2013. In his current role as Support Services Deputy Chief, Deputy Chief Hodge oversees the following divisions: Criminal Investigations Evidence Communications School Resource Officer program Office of Professional Standards and Accreditation Internal Affairs Training Coordinator Emergency Response Team Commander Public Information Officer Deputy Chief Brad Hodge may be reached at (321) 773-4400  or by email at: [email protected] Lieutenant Ronnie Kinsey Lieutenant Ronnie Kinsey joined the Satellite Beach Police Department in 2020 upon relocating to Satellite Beach. Previously, he served nine years with the Clayton County Police Department near Atlanta, where he held roles in various specialized units including uniform patrol, Motor Vehicle Crash Investigations, Georgia’s H.E.A.T. Unit, and the Criminal Investigations Division. Lt. Kinsey also supervised the Uniform Patrol Division and led an Armed Robbery Suppression Unit. Lt. Kinsey holds two earned degrees: a Bachelor of Business Administration with a concentration in Marketing from Clayton State University in Morrow, GA, and a Master of Divinity with a concentration in Leadership from Liberty University in Lynchburg, VA. He is a 2024 graduate of the University of Louisville Southern Police Institute's 94th Command Officer's Development Course, a rigorous academic course that prepares the next generation of law enforcement leadership executives. He has accumulated nearly 2,000 hours of police training, including active certifications in Georgia and Florida, extensive expertise in DUI and impaired driving investigations, and specialized training in Internal Affairs, Advanced Criminal Procedures, and advanced supervision techniques. His primary area of specialization is traffic crash reconstruction. Currently, he heads the Traffic Homicide Investigations Unit at the Satellite Beach Police Department and leads the Beachside T.H.I. Taskforce, comprising Traffic Homicide Investigators from four agencies in Brevard County tasked with reconstructing fatal motor vehicle accidents. Beyond his professional pursuits, Lt. Kinsey treasures time spent with his wife and children. He is conversational in Spanish, enjoys traveling, hiking in the Rocky Mountains, and motorcycle riding. His favorite place to travel is the country of Uganda where he has been three times to do humanitarian work in the east African region. Lt. Ronnie Kinsey may be reached at (321) 773-4400 or by email at: [email protected] Lieutenant Anthony Holland Lieutenant Anthony Holland was born and raised in New Jersey, graduating from Mount Olive High School in 2003. His journey into public service began in 2006 when, at twenty years old, he enlisted in the United States Air Force. After completing basic training at Lackland Air Force Base in San Antonio, Texas, he served as a member of the USAF Security Forces Unit (Military Police). In 2010, Lieutenant Holland transferred to the USAF Reserves and relocated to Patrick Air Force Base, joining the 45th Security Forces Squadron. While Lieutenant Holland was stationed at Patrick Air Force Base, he was hired as a Corrections Deputy for the Brevard County Sheriff's Office. Lt. Holland worked for the Brevard County Sheriff's Office as a Corrections Deputy for three years. During this time, he enrolled in and attended the Corrections to Law Enforcement crossover academy at Eastern Florida State College, paving the way for his career as a Police Officer with the Satellite Beach Police Department. In 2013 Lieutenant Holland was hired by the Satellite Beach Police Department and served in the Uniformed Patrol Division before transferring to the Criminal Investigations Division as a detective in 2016. He was promoted to Corporal in 2017, Sergeant in 2019, and promoted to Lieutenant in 2022. Currently, he oversees the Criminal Investigations Division, School Resource Officer Unit, and the Communications Division. In 2021, Lieutenant Holland completed the Florida Leadership Academy (FLA Class #48), offered by the Florida Department of Law Enforcement, enhancing his leadership and professional skills. Lieutenant Holland has been recognized through many awards, including multiple Officer of the Quarter awards, the Hartmann/Flagg DUI Enforcement Officer of the Year award, and a Life Saving award in 2022. On his off days, Lieutenant Holland enjoys spending time with his wife, two sons and daughter. Lt. Anthony Holland may be reached at (321) 773-4400 ext. or by email at: [email protected] Back to the top Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/police_department/administration/index.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/residents/sustainable_satellite/beaches/beach_water_quality.php",
      "text": "Beach Water Quality Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Facebook Search Home Residents Sustainable Satellite Beaches Beach Water Quality Related Pages Beach Parks and Accesses Beach Surf Cams Sea Turtles Beach Water Quality Mayors Monarch Pledge Hightower Radar Shorebirds Sea Turtles Beach Renourishment Beach Water Quality Florida Healthy Beaches Program Coastal Beach water samples are collected bi-monthly at Pelican Beach Park by the Florida Department of Health in Brevard County and are analyzed for enterococcus. High concentrations of these bacteria may indicate the presence of microorganisms that could cause disease, infections, or rashes. Environmental Health is responsible for issuing health advisories or warnings when these conditions are confirmed. Sampling is conducted bi-weekly from the first week of March to the last week of September. To see the latest levels at Pelican Beach Park, click here . Read more about the program here . Contact info: 850-254-4240 EPA Beacon Program Public database of pollution occurrences for coastal recreation waters state and nationwide. The BEACON program provides a nationwide map that visitors can use and zoom into areas of concern to determine if there are any advisories or closures. Click on the map below to access the database: Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/residents/sustainable_satellite/beaches/beach_water_quality.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/department_information.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Department Information Related Pages Meet Our Staff Activity Brochure Drop In Classes Online Registration Rhythm In Motion Dance Recreation Facilities DRS Community Center Pelican Beach Clubhouse Beach Parks Tennis/Racquetball Courts E. Lorraine Gott Dog Park Skate/BMX Park Playgrounds Sports Fields Samsons Island Rental Facilities DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Civic Center Special Events Upcoming Events Calendar Volunteer Opportunities Community Involvement Recycling Opportunities Other Related Links Forms Open Gym Department Information Mission Statement: To provide a variety of activities and services that encourages health, fitness, relaxation, education and enjoyment for our citizens and surrounding areas, while preserving the natural beauty of our beachside community. Office Location: David R. Schechter Community Center 1089 South Patrick Drive Satellite Beach, FL 32937 Phone: (321) 773-6458 Fax: (321) 777-5207 Email : [email protected] Office Hours: Monday-Friday 8:30am-5pm Code of Conduct: Click here Payments Accepted: Cash, Check, Money Order, and Credit Cards (Visa/MasterCard/Discover/American Express). Please note that the credit card company (Forte) charges a minimum of $1.95 or 2.5% per transaction whichever is greater. Checks can only be accepted for facility rentals occurring more than thirty days out from time of payment. Refund Policy: Program refunds must be requested at least 5 business days prior to the start of the class, unless otherwise noted. If you notify the Recreation Department later than five full business days, but before the first day of class, you will receive a partial refund. No refunds will be issued the day of or after the class has begun. Please note: City Financial Policy is that checks must have 30 days to clear before a refund will be issued. Refunds back to a credit card are accomplished usually within 3 business days of the request.  Additional fees will be charged for checks returned NSF and participation can be suspended until fees are paid in full. For facility refunds, please refer to your facility contract for the reservation refund policy. (Please note the convenience fee for credit card use is non-refundable) NSF/Returned Check Policy: The following fees will be assessed on any NSF or Returned Check. No further registration or participation will be allowed until accounts/fees are paid in full. Upon notification of NSF or Returned Check, the City has given a grace period of 21 days before the full structure is invoked.  Until then citizens are asked to pay only $5 towards the cost of the dishonored check. Please call us for any questions or concerns. $25 fee for checks up to $50 $30 fee for checks from $50-$300 $40 or 5% fee (whichever is greater) for checks over $300 Under Florida law, e-mail addresses are public records. If you prefer not to have your e-mail address released in response to a public records request, please call City Hall at 321-773-4407 or send request in writing to: City of Satellite Beach, 565 Cassia Boulevard, Satellite Beach, FL 32937. Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/department_information.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://pelicanhill.com/contact/",
      "text": "Contact Us - The Resort at Pelican Hill The Resort at Pelican Hill MENU Close Search Close Search for: Home Exclusive Offers Bungalows Villas Extended Stay Program Cabanas Dining Upcoming Events Pelican Picnic Pelican Grill Coliseum Pool & Grill In-Room Dining Great Room Villa Pool Caffè & Market Spa Treatment Menu The Salon Fitness & Wellness Packages Spa Amenities Golf Book A Tee Time Golf Rates & Fees Gold Membership Meetings & Events Executive Meetings One Day Weddings Grand Wedding Weekends Wedding Venues Experiences Upcoming Events Crystal Cove Area Activities Resort Our Story Resort Map Coliseum Pool Gallery The Shops at Pelican Hill Sustainability Resort Information & Policies Postcards from Pelican Hill® Activities Calendar Gift Cards Extended Stay Program Shops Book Your Stay (888) 507-6427 Facebook Pinterest Instagram (888) 507-6427 BOOK YOUR STAY Close BOOK YOUR STAY Check In 12 September Check Out 15 September 2 Adults 1 2 3 4 5 6 7 8 0 Children 0 1 2 3 4 5 6 CHECK AVAILABILITY (888) 507-6427 Pelican Get in Touch With Us We’d be happy to assist you with any questions or concerns regarding your visit. \" * \" indicates required fields Please select the nature of your inquiry. * —– Room Reservations Spa Bookings Conference Room Inquiries Wedding Inquiries Donation Requests Marketing & PR Gift Cards Groups Extended Stay Golf Groups Golf Membership Other Name * First Last Email * Enter Email Confirm Email What is the size of your group? * 16+ Less than 12 For information on Gift Cards, please visit this link . For donation requests and information, please visit this link . For more information on golf memberships please use this form . To submit a request for proposal for your next meeting or conference please use this form . Phone For us to better assist you, please input the best number for us to reach out. This field is hidden when viewing the form Address Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Comments * Communicate with me via: Email Phone CAPTCHA Name This field is for validation purposes and should be left unchanged. Δ Address: 22701 Pelican Hill Road South Newport Coast, CA 92657 DIRECTIONS > Phone Number: 888.507.6427 Join Marriott Bonvoy. Create your Marriott Bonvoy account now to start earning points toward free hotel nights and other rewards. Sign up today and take advantage of exclusive rates for members. Sign up Exclusive Offers Newsletter Facebook Pinterest Instagram Resort Map Information & Policies Contact Us Careers Photography Policy Press Room PHONE: (888) 507-6427 INTERNATIONAL: 001.949.612.0332 22701 Pelican Hill Road South Newport Coast, CA 92657 CURRENT WEATHER 64 ° Clear © 2025 The Resort at Pelican Hill, All Rights Reserved. Accessibility Privacy Policy Social Media Agreement Drone Policy We use cookies on our website. By continuing to use this site, you agree to our cookie policy. Accept"
    },
    {
      "url": "https://www.satellitebeach.gov/departments/recreation_department/volunteer_opportunities.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Volunteer Opportunities Related Pages Meet Our Staff Activity Brochure Drop In Classes Online Registration Rhythm In Motion Dance Recreation Facilities DRS Community Center Pelican Beach Clubhouse Beach Parks Tennis/Racquetball Courts E. Lorraine Gott Dog Park Skate/BMX Park Playgrounds Sports Fields Samsons Island Rental Facilities DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Civic Center Special Events Upcoming Events Calendar Volunteer Opportunities Community Involvement Recycling Opportunities Other Related Links Forms Open Gym Volunteer Opportunities BECOME A SATELLITE BEACH VOLUNTEER The City of Satellite Beach Recreation Department's Volunteer Involvement Program connects citizens to the city through community engagement. We coordinate efforts with local public and private schools, civic organizations, and the community to allow volunteer participation in a variety of city-sponsored events, camps, and programs. The City of Satellite Beach prides itself on our long history of citizen volunteers. Our founder, Percy Hedgecock, stated that “this community was built on the backs of citizen volunteers.” Satellite Beach students and adults are encouraged to invest time in their community. HOW DO I SIGN UP TO VOLUNTEER? Step 1 Submit your volunteer application by clicking the button below. If you have already completed an application, proceed to Step 2. Step 2 Click below to view and sign up for current, ongoing opportunities. (Must have completed the application in Step 1 to view opportunities.) If you do not remember your password, please DO NOT create a new account. Instead, click \"reset password.\" Come join the fun and assist with our classes and community activities! Details can be found in your volunteer portal. If you have not yet registered to volunteer, please fill out an application above, then click on the \"Join Us\" button to register for any upcoming opportunities. If you have any questions, please contact the Satellite Beach Recreation Department: Ana Pazderak 321-773-6458 [email protected] WELCOME TO OUR VOLUNTEER COMMUNITY We are thrilled to offer a variety of ongoing volunteer opportunities throughout the city. Your time and effort can make a significant impact, and we can't wait to work with you! Seasonal Camps and Classes: Join us for our seasonal camps during Spring Break, Summer, and Winter Break. Volunteers are essential for set-up, tear-down, sign-in, cleanup, and assisting campers with activities and crafts. Some programs may also require prep work before the start of the program. Your help ensures a fun and smooth experience for all campers! Special Events: Be part of the excitement at our special events throughout the year! From Golf Cart Parades to Flashlight Easter Egg Hunts, Breakfast with the Bunny, Samsons Island Open House, Hook Kids on Fishing, Founder’s Day, Holiday Open House, and more, there's always something happening. Volunteers play a crucial role in making these events memorable. Beach & Community Cleanups: Join the Satellite Beach Sustainability and Beautification Boards in keeping our community beautiful. Opportunities include beach cleanups, Samsons Island workdays, community garden assistance, native plantings, and much more. Your efforts help preserve our natural spaces for everyone to enjoy. Special Projects: Do you have unique skills like photography, video, or crafts? We have special projects that could use your expertise. Reach out to us for more information and see how you can contribute your talents. Group and Corporate Opportunities: Looking for a team-building activity that gives back to the community? We offer special projects for groups on Samsons Island, in our Gopher Tortoise Conservation area, and across our parks and beaches. Contact our volunteer coordinator to find the perfect project for your team. Together, we can make a positive impact! To register for any of the above opportunities, please follow the steps above or contact the Recreation Department at 321-773-6458. We look forward to having you join our volunteer family! Looking for more volunteer opportunities in the City? Check out our Police Department's Community Volunteer Program which offers a variety of long-term volunteer opportunities such as Bike Patrol, Citizen Patrol, Stop By & Say Hi, Marine Patrol and more. Click here for more information https://sbpdvolunteers.weebly.com/ Share this page Share this page × Copy and paste this code into your website. <a href=\"http://www.satellitebeach.gov/departments/recreation_department/volunteer_opportunities.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://www.abetterdj.net/Wedding-Galleries/CAMERON-CAITLIN-Pelican-Beach-Clubhouse-Satellite-Beach-FL/i-k5wmhtf",
      "text": "1A CAMERON & CAITLIN Pelican Beach Clubhouse Satellite Beach, FL - A Better DJ and Photographer Nationwide social media A Better DJ and Photographer provides top level DJ and photography-video services for your wedding- party-event-Sweet 16 party-Quinceanera- corporate event- holiday party-concert-festival, and more, all at great prices anywhere in the country. Our expert wedding DJ and wedding photographer-video prices are very affordable, and we will help you create the perfect package for your wedding or event and budget. Free planning assistance and wholesale photo printing is available to all of our clients! Our performances are legendary! Same great prices nationwide! 321-617-3169 Mon-Fri 11AM-9PM EST After hours and weekend phone consultations by appointment only Please don't use this form. For fast service call us at 321-617-3169. Click here to contact us!! Or fill out this form CONTACT FORM Please contact me and help me book my date! All lines * must be completed First Name: * Type of event * Date of event * Services needed * Cell Phone: * Best time to call * Email: * City * State: AL AK AZ AR CA CO CT DE DC FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY Powered by SmugMug Owner Log In Report Content"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/recreation_facilities/pelican_beach_clubhouse.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Recreation Facilities Pelican Beach Clubhouse Pelican Beach Clubhouse Pelican Beach Clubhouse – Beachfront Event Venue in Satellite Beach, FL Looking for a beachfront event venue in Satellite Beach, Florida ? The Pelican Beach Clubhouse is one of the most popular rental facilities on the Space Coast—perfect for weddings , club meetings , birthday parties , and special events . Located directly on Jimmy Buffett Highway (A1A) , this charming venue features: A cozy indoor event space ideal for small gatherings A spacious outdoor wooden deck with stunning views of the Atlantic Ocean Easy beach access and a peaceful, scenic atmosphere Whether you're planning a sunset wedding , a community meeting , or a private celebration , the Pelican Beach Clubhouse offers a unique and memorable setting. Rental Information 🔗 View 2025 Rental Prices 🔗 Download Sample Rental Contract 🔗 View Facility Diagrams Walk-through tours are available by appointment: 🕒 Mondays–Wednesdays, 8:30 AM – 3:30 PM 📞 Call 321-773-6458 to schedule your visit. Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/recreation_facilities/pelican_beach_clubhouse.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://www.abetterdj.net/Wedding-Galleries/GREG-WHITNEY-Pelican-Beach-Clubhouse-satellite-Beach-FL-9-9/i-jm3vLDS",
      "text": "GREG & WHITNEY Pelican Beach Clubhouse satellite Beach, FL 9-9-18 - A Better DJ and Photographer Nationwide social media A Better DJ and Photographer provides top level DJ and photography-video services for your wedding- party-event-Sweet 16 party-Quinceanera- corporate event- holiday party-concert-festival, and more, all at great prices anywhere in the country. Our expert wedding DJ and wedding photographer-video prices are very affordable, and we will help you create the perfect package for your wedding or event and budget. Free planning assistance and wholesale photo printing is available to all of our clients! Our performances are legendary! Same great prices nationwide! 321-617-3169 Mon-Fri 11AM-9PM EST After hours and weekend phone consultations by appointment only Please don't use this form. For fast service call us at 321-617-3169. Click here to contact us!! Or fill out this form CONTACT FORM Please contact me and help me book my date! All lines * must be completed First Name: * Type of event * Date of event * Services needed * Cell Phone: * Best time to call * Email: * City * State: AL AK AZ AR CA CO CT DE DC FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY Powered by SmugMug Owner Log In Report Content"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/recreation_facilities/pelican_beach_park.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Facebook Search Home Departments Recreation Department Recreation Facilities Beach Parks and Accesses Pelican Beach Park Related Pages DRS Community Center Pelican Beach Clubhouse Beach Parks and Accesses Pelican Beach Park Hightower Beach Park Gemini Beach Park Crotty Beach Park Tennis/Racquetball Courts E. Lorraine Gott Dog Park Skate/BMX Park Playgrounds Sports Fields Samsons Island About Samsons Island Pelican Beach Park Pelican Beach Park 1525 Highway A1A Satellite Beach, FL 32937 (321) 773-6458 Brevard County Lifeguard Schedule: Weekends Only from 10-5pm now until May 20th. Everyday from 10-5pm, May 24th-August 9th. Park hours are from 9:00am till dusk. Pelican Beach Park is our beachside park where many celebrated activities take place. It’s the perfect location for special events such as family gatherings, birthday parties, and company picnics.  Due to the popularity of the park, it is required that pavilions must be rented in order to utilize.  The volleyball courts are for use by pavilion renters with permits on the weekends. The amenities in the park include: Pavilions with Grills Volleyball Courts ADA Dun Crossover ADA Restrooms ADA Outdoor Showers ADA Parking Volleyball Courts The two volleyball sand courts can be used by the community without reservation during the week. However, on weekends the courts are reserved for use by renters of pavilions. OCEANFRONT PRESERVATION TRACT Funding for the acquisition of property adjacent to the south of Pelican Beach Park was provided by the FLORIDA COMMUNITIES TRUST using PRESERVATION 2000 FUNDS and the CITY OF SATELLITE BEACH This site is open to the public for environmental education purposes. Please visit or call the Satellite Beach recreation Department at (321)773-6458 to make arrangements. Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/recreation_facilities/pelican_beach_park.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/index.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Related Pages Meet Our Staff Activity Brochure Drop In Classes Online Registration Rhythm In Motion Dance Recreation Facilities DRS Community Center Pelican Beach Clubhouse Beach Parks Tennis/Racquetball Courts E. Lorraine Gott Dog Park Skate/BMX Park Playgrounds Sports Fields Samsons Island Rental Facilities DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Civic Center Special Events Upcoming Events Calendar Volunteer Opportunities Community Involvement Recycling Opportunities Other Related Links Forms Open Gym Recreation Department Welcome to Satellite Beach Recreation! Connecting Community Through Recreation, Wellness & Fun” We’re glad you’re here. Whether you're a resident or a visitor, we invite you to explore all that our department has to offer. From engaging programs and well-maintained facilities to exciting special events, there’s something for everyone to enjoy. Our dedicated team is honored to serve this vibrant community. We take pride in the trust you’ve placed in us and are committed to providing exceptional service, enriching experiences, and a welcoming environment for all. We hope you find our website helpful as you learn more about our offerings and stay connected with what’s happening in Satellite Beach. Warm regards, Cassie Warthen Recreation Director Our Mission To provide a variety of activities and services that promote health, fitness, relaxation, education, and enjoyment for our citizens and surrounding areas—while preserving the natural beauty of our beachside community. Contact Us 📍 Office Location: David R. Schechter Community Center 1089 South Patrick Drive Satellite Beach, FL 32937 📞 Phone: (321) 773-6458 📠 Fax: (321) 777-5207 📧 Email: [email protected] 🕒 Office Hours: Monday–Friday, 8:30 AM – 5:00 PM Code of Conduct: Click here Payments Accepted: The Satellite Beach Recreation Department offers several payment options including cash, personal checks, credit/debit cards, and money orders. Please note that when using a credit/debit card, a processing fee of 3.04% of the total cost will be added by the processing company. This fee is not retained by the City of Satellite Beach. Checks should be made payable to the City of Satellite Beach unless otherwise noted. Checks can only be accepted for facility rentals occurring more than thirty days out from time of payment. Refund Policy: Program refunds must be requested at least 5 business days prior to the start of the class, unless otherwise noted. If you notify the Recreation Department later than five full business days, but before the first day of class, you will receive a partial refund. No refunds will be issued the day of or after the class has begun. Please note: City Financial Policy is that checks must have 30 days to clear before a refund will be issued. Refunds back to a credit card are accomplished usually within 3 business days of the request.  Additional fees will be charged for checks returned NSF and participation can be suspended until fees are paid in full. For facility refunds, please refer to your facility contract for the reservation refund policy. (Please note the convenience fee for credit card use is non-refundable) NSF/Returned Check Policy: The following fees will be assessed on any NSF or Returned Check. No further registration or participation will be allowed until accounts/fees are paid in full. Upon notification of NSF or Returned Check, the City has given a grace period of 21 days before the full structure is invoked.  Until then citizens are asked to pay only $5 towards the cost of the dishonored check. Please call us for any questions or concerns. $25 fee for checks up to $50 $30 fee for checks from $50-$300 $40 or 5% fee (whichever is greater) for checks over $300 Under Florida law, e-mail addresses are public records. If you prefer not to have your e-mail address released in response to a public records request, please call City Hall at 321-773-4407 or send request in writing to: City of Satellite Beach, 565 Cassia Boulevard, Satellite Beach, FL 32937. Check us out on Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/index.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://pelicanbay.pt/en/contacts/",
      "text": "Contact | Talk to us - Pelican Bay Skip to content Services Projects About Us Blog Contact Services Projects About Us Blog Contact PT ES PT ES Facebook Instagram Linkedin Tiktok Services Digital Marketing Websites & Online Shops Graphic Design Capturing Content Projects About Us Blog Talk to Us EN PT ES Services Digital Marketing Websites & Online Shops Graphic Design Capturing Content Projects About Us Blog Talk to Us EN PT ES Let's turn your ideas into reality You’re one step closer to giving your brand the boost it needs. Just get in touch with our team and you’ll receive all the support you need to boost your brand. Start by asking for a proposal Name Company / Brand E-mail Cell phone What services do you need? Performance Ads Social media management Website or Online Shop E-mail Marketing SEO Graphic Design Capturing Content Other How can we help you? I have read and accept the Privacy Policy . Request a quote Thank you! Your request for proposal has been sent successfully! Contact R. Henrique de Paiva Couceiro, Nº10 2700-453 - Amadora, Lisbon info@pelicanbay.pt (+351) 914 434 077 (Call to national mobile network) Let's work on your brand awareness Request a free quote Pelican Bay Digital Agency info@pelicanbay.pt (+351) 914 434 077 (Call to national mobile network) R. Henrique de Paiva Couceiro, Nº10 - Room 96 2700-453 | Amadora, Lisboa Useful links Services Projects About Us Blog Contact Policies Privacy Policy Cookie Policy Complaints book Follow us Facebook Instagram Linkedin Tiktok © 2025  PELICAN BAY. All rights reserved. Developed by Pelican Bay | Digital Agency Gerir Cookies Utilizamos cookies para melhorar a tua experiência. Desativá-las pode limitar algumas funcionalidades do site. Funcional Funcional Always active O armazenamento ou acesso técnico é estritamente necessário para a finalidade legítima de permitir a utilização de um serviço específico explicitamente solicitado pelo utilizador ou para a única finalidade de realizar a transmissão de uma comunicação através de uma rede de comunicações eletrónicas. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Estatísticas Estatísticas The technical storage or access that is used exclusively for statistical purposes. O armazenamento ou acesso técnico utilizado exclusivamente para fins estatísticos anónimos. Sem uma intimação, conformidade voluntária por parte do teu Provedor de Serviços de Internet ou registos adicionais de terceiros, as informações armazenadas ou obtidas apenas para esta finalidade geralmente não podem ser usadas para te identificar. Marketing Marketing O armazenamento ou acesso técnico é necessário para criar perfis de utilizador, enviar publicidade ou rastrear o utilizador num website ou em vários websites para fins de marketing semelhantes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Aceitar Negar Preferências Guardar preferências Preferências {title} {title} {title} Gerir Cookies"
    },
    {
      "url": "https://satellitebeach.gov/government/city_boards/sustainability_board/index.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Government City Boards Sustainability Board Related Pages Agendas and Minutes Meeting Videos Sustainability Workshops Sustainable Satelite Sustainability Board Board Description and Duties Membership: 7 primary members and 2 alternates. Staff: Public Works Department Meetings: 4th Wednesday, every other month, at 6:00 p.m. in the Council Chamber.  Please check the website calendar for meeting dates. For questions regarding this Board contact the Public Works Department at (321) 777-2309 Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/government/city_boards/sustainability_board/index.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/rental_facilities/index.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Rental Facilities Related Pages DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Pavilions & Amenities Civic Center Rental Facilities Rental Facilities at Satellite Beach Your Space for Every Occasion Planning a family reunion, a special celebration, or a community event? The City of Satellite Beach offers a variety of rental facilities to help make your occasion memorable. From scenic picnic spots to versatile indoor spaces, we have options to suit gatherings of all sizes. DRS Community Center 🕒 Rental Hours: 8 AM – 1 AM 👥 Capacity: Varies by room Ideal for: Community functions, private parties 📍 Indoor space with flexible layout [Learn More →] Pelican Beach Clubhouse 🕒 Rental Hours: 8 AM – 1 AM 👥 Capacity: Up to 70 guests Oceanfront deck with stunning views Ideal for: Intimate celebrations, receptions [Learn More →] Pelican Beach Park 🕒 Rental Hours: 9 AM – Dusk 👥 Capacity: 12–70 guests (6 pavilions) Volleyball courts, playground, beach access Ideal for: Picnics, reunions, outdoor fun [Learn More →] Civic Center 🕒 Rental Hours: 8 AM – 1 AM 👥 Capacity: 50–150 guests Two rooms, kitchen, AV, WiFi, gazebo & pond view Ideal for: Weddings, meetings, community events [Learn More →] 📅 How to Reserve a Facility To book a space, contact the Recreation Department by phone or visit us in person. Once booked, you’ll have two weeks to complete your rental contract and submit payment. 💳 Payment Options We accept: Cash Checks (payable to City of Satellite Beach ) Credit Cards (3.04% processing fee added upon checkout) Note: If your event is within 30 days of booking, payment must be made by cash or credit card . Security Guidelines Some events may require a security guard, based on the Recreation Director’s discretion. If required, the renter is responsible for this cost. Plan Ahead Our facilities are popular and book quickly. We recommend reserving your preferred date and location well in advance . 🎥 Virtual Tour Take a virtual tour of our Civic Center: [ Coming Soon! → ] Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/rental_facilities/index.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/public_works/staff_teams.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Public Works Staff Teams Related Pages Grounds Roads & Drainage Staff Teams The Satellite Beach Public Works Department provides a variety of services throughout the City. While Public Works is mainly viewed as the maintenance vehicle for roads and grounds areas, there is a wide range of functions performed by the department that may go unseen by the public. As a beachside community, we have many areas where our residents and visitors can take advantage of the beautiful surroundings nature has provided. The frequent use of these facilities and the harsh salt environment requires that we continually maintain these areas to keep them safe and clean for all to use. Many of Satellite Beach’s residents and visitors enjoy walking or biking through the community. The City has many miles of sidewalk and bike paths, maintained by Public Works, which allow these activities to be done safely. Youth sports has always been a very important part of life in Satellite Beach. The City provides many athletic facilities for various sports. The Public Works Department works very hard to ensure that all of these facilities are well maintained for safe year round activity. To maintain the many components that make up the infrastructure of Satellite Beach, the Public Works Department is composed of five main divisions or teams. Administration: Administration is a key part of the Public Works mission. The Director and Assistant Director coordinate within the Department to respond to requests for services from Citizens and other Departments. They also interact with other entities, City, State or Federal, for problems in Satellite Beach that are out of our area of responsibility. For example, SR A1A is in Satellite Beach but is maintained by the Florida Department of Transportation, as is SR 513 (South Patrick Drive). If there is a problem on either of those roads, work must be coordinated through FDOT. Facilities Maintenance Team: Facilities maintains all City buildings, beach accesses/dune crossovers, and athletic field restroom/concession areas. They also maintain park facilities, such as Hightower Park and Pelican Beach Park; clubhouse, rental pavilions and restrooms. Roads and Drainage Team: Roads & Drainage maintain all City streets and sidewalks, with the exception of those along SR A1A and SR 513. Other responsibilities of this Team include: Street signs and stormwater system maintenance. Grounds Maintenance Team: The Grounds crew is responsible for the landscaping and maintenance of all City facilities, parks, and common areas. They are also responsible for public right-of-way areas such as DeSoto Parkway and Jamaica Boulevard. Maintaining the many athletic fields around the City is also a big part of the Grounds Team’s daily workload. Vehicle Maintenance: Our Chief Mechanic maintains all Police, Public Works, Fire, and Building and Zoning vehicles and equipment. Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/public_works/staff_teams.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://pelicanhotel.com/contact/",
      "text": "Contact - Pelican Hotel Miami Beach Skip to content Contact MORE MORE Hotel HOTEL Story Gallery Press Location & Arrival Story Gallery Press Location & Arrival BOOK NOW BOOK NOW LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 CONTACT US +1 305-673-3373 EMAIL reservation@pelicanhotel.com NEWS The Pelican Hotel Blog Facebook-square Instagram Linkedin Youtube Rooms ROOMS Penthouse One Suite King Executive Suite King Ocean View Suite Queen Deluxe King Suite Accesible Deluxe King Suite Deluxe Queen Ocean View Deluxe Queen Bohemian Deluxe Queen Suite Deluxe Queen Deluxe Twin Deluxe Twin Accessible BOOK NOW BOOK NOW LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 CONTACT US +1 305-673-3373 EMAIL reservation@pelicanhotel.com NEWS The Pelican Hotel Blog Facebook-square Instagram Linkedin Youtube Pelican Cafe PELICAN CAFE Restaurant Book a table Kitchen Pelican Cafe Bar Corporate & Gatherings Restaurant Book a table Kitchen Pelican Cafe Bar Corporate & Gatherings BOOK A TABLE BOOK NOW LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 CONTACT US +1 305-673-3373 EMAIL reservation@pelicanhotel.com NEWS The Pelican Hotel Blog Facebook-square Instagram Linkedin Youtube Room 55 Experience Miami Offers BOOK NOW BOOK NOW BOOK NOW BOOK NOW Need more info or just want to say hi? We would love to hear from you! Get in touch with us and leave a message in the attached form. Your Name Email Phone Number Message I accept the Privacy Policy Send Contact How to get here Hotel Policies Arrival Get Arround Accessibility Careers Catering & Events Phone: + 1 305 673 3373 WhatsApp: +1 305 699 7830 Email: reservation@pelicanhotel.com Address: 826 Ocean Drive, Miami Beach, FL. 33139 Get Here: Pelican Hotel, located at 826 Ocean Drive, Miami Beach, FL 33139 From Miami International Airport (MIA): By Car: Head east on FL-836 E from the airport. Merge onto I-395 E toward Miami Beach. Continue onto MacArthur Causeway. Turn left onto Collins Avenue. Turn right onto 8th Street. Continue onto Ocean Drive. Pelican Hotel will be on your left at 826 Ocean Drive. By Public Transportation: Take the MIA Mover from the airport to the Miami Central Station. Transfer to the Orange Line of Miami-Dade Metrorail heading towards Dadeland South. Get off at Government Center Station and transfer to the Southbound C Local Metrobus. Get off at 9th Street & Washington Avenue. Walk east on 9th Street towards Ocean Drive. Turn left on Ocean Drive, and Pelican Hotel will be on your right. From Port of Miami: By Car: Head west on Port Boulevard. Continue onto I-395 W. Merge onto MacArthur Causeway. Turn left onto Collins Avenue. Turn right onto 8th Street. Continue onto Ocean Drive. Pelican Hotel will be on your left at 826 Ocean Drive. By Public Transportation: Unfortunately, there is no direct public transportation route from the Port of Miami. A taxi or rideshare service would be recommended. From Fort Lauderdale-Hollywood International Airport (FLL): By Car: Take I-595 E from the airport. Merge onto I-95 S toward Miami. Take exit 4 toward I-195 E/Miami Beach. Continue onto W 41st Street/Arthur Godfrey Road. Turn right onto Indian Creek Drive. Continue onto Collins Avenue. Turn left onto 8th Street. Continue onto Ocean Drive. Pelican Hotel will be on your left at 826 Ocean Drive. By Public Transportation: Take the Tri-Rail Shuttle to Fort Lauderdale Airport Station. Board the Tri-Rail train heading south to the Metrorail Transfer Station. Transfer to the Orange Line of Miami-Dade Metrorail heading towards Dadeland South. Get off at Government Center Station and transfer to the Southbound C Local Metrobus. Get off at 9th Street & Washington Avenue. Walk east on 9th Street towards Ocean Drive. Turn left on Ocean Drive, and Pelican Hotel will be on your right. Remember to check for any updates or changes in transportation options, and consider traffic conditions when traveling by car. Safe travels! Check-in – 4:00 PM Check-out – 11:00 AM Internet – Free WiFi is available in all areas of the hotel. Resort Fee – There is a service fee of $38.00 per night. Plus tax Parking – The parking fee is $42 per night before taxes. Unlimited in/out access Eligible Age to check-in – 21 years Pets are welcome! – We allow one dog 30lbs or under. There is a fee of $25 per night plus a onetime clean up fee of $150.00 *Pet reservations must be re approved by the hotel prior to arrival. Children – Children 12 sleeping in the same bed as parents stay free. Children Over 12 pay 3 rd occupancy rate plus extra bed rate. Extra Beds & Cribs – Rollaway beds in approved rooms subject to availability. $75 per day. Cribs are available, subject to availability and carry a rental fee of $75.00 per stay. Smoking – Our hotel is 100% non-smoking, sorry, no smoking is allowed. Guest Payment Options – We accept American Express, Visa, Euro/Mastercard, and Discover cards. Guest Information Required for Reservations and at Check-in: Guests will be required to provide a valid ID and at check-in.‍ All guests staying in the hotel must be registered with the front desk. Credit/Debit Card Pre-authorizations & Charges: Guest credit cards will be pre-authorized and charged for the first night room and tax prior to arrival. Credit/Debit Card Charges at Check-in: A $300 deposit will be held on the credit card provided at check in to cover incidental charges and damage upon check-in, and it will be released back to the same payment method at check out Cancellation policies: We offer free cancellations up to 72 hours prior to arrival, but early departures within this window are non-refundable. Please note that non-refundable rates are, as the name suggests, non-refundable. We’re excited to welcome you to the Pelican Hotel in the heart of Miami Beach! To ensure a smooth and enjoyable arrival experience, please take note of the following details: Address Information: Pelican Hotel 826 Ocean Drive Miami Beach, FL 33139 Tel: 305-673-3373 Check-In Time: Check-In Time: 4:00 PM EST. Please note that we cannot guarantee early check-in. To ensure access to guest rooms for guests traveling overnight, we recommend booking the night prior to facilitate early room availability. As a courtesy, the hotel will hold your bags on your day of arrival until your room is ready for check-in, allowing you time to explore the city. Check-Out Time: Check-Out Time: 11:00 AM EST. We regret that we cannot guarantee late check-out due to incoming guests. However, we would be pleased to hold your bags until you are ready to depart for the airport, port, or next destination. Please note that we do not hold bags once you have checked out of the hotel. Parking: For guests arriving by car, we offer valet parking at the Pelican Hotel for $42.00 per day with in/out services. Please approach the hotel entrance upon arrival, and our valet attendants will assist you with parking arrangements. Airport Transportation: For guests arriving at Miami International Airport (MIA) or Fort Lauderdale-Hollywood International Airport (FLL), or Ports, we recommend transportation options such as taxis, ride-sharing services, and rental cars. Please contact our concierge team for assistance and pricing with arranging private limo airport transportation in advance. Special Requests: We strive to accommodate our guests needs and preferences to ensure a memorable stay. If you have any special requests or require additional assistance during your arrival, please inform us in advance, and we’ll do our best to accommodate you. We look forward to welcoming you and making your stay with us unforgettable! Welcome to the Pelican Hotel Miami Beach! To make your stay even more enjoyable, here are some convenient transportation options for exploring the vibrant city of Miami Beach. Public Transportation Miami-Dade Transit (MDT): The Miami-Dade Transit system offers extensive bus routes and Metrorail services throughout the city. Bus stops are conveniently run along Collins Avenue and Washington Avenue, providing easy access to the Government Center Metrorail station in downtown Miami. Metrorail: Metrorail is a rapid transit system serving Miami-Dade County with convenient connections to downtown Miami and other major destinations (like the speed train to Orlando) From Government Center Metrorail Station, you can also take the Metrorail Orange line towards Miami International Airport (MIA) Disembark at the next stop, Miami Central Station Take the Brightline train to Orlando Additionally, keep in mind that transportation options and schedules may change, so it’s best to verify the current information closer to your travel date. Hop-on-Hop-off: The Red Bus is a popular hop-on hop-off tour service that allows visitors to discover Miami Beach, Little Havana, Wynwood, Coconut Grove and other top attractions. The buses are double-decker, providing great views of the city as you travel. Passengers can hop on and off at any designated stops along the route, making it easy to explore different areas of Miami Beach. See the concierge for pricing. Free Rides and Shuttle Services Freebee: Freebee offers on-demand, eco-friendly transportation within specific areas of Miami Beach. Download the Freebee app to request a ride and enjoy complimentary transportation to nearby attractions, restaurants, and shops. Miami Beach Trolley: The Miami Beach Trolley is a free transportation option that connects popular destinations within Miami Beach, including South Beach, North Beach, and Mid-Beach. Look for the nearest trolley stop close to the Pelican Hotel to hop on board and explore the area hassle-free. Additional Transportation Options Ride-Sharing Apps: Utilize popular ride-sharing apps like Uber and Lyft for convenient door-to-door transportation around Miami Beach. Simply request a ride through the app, and a driver will pick you up at the Pelican Hotel and take you to your desired destination. Bicycle Rentals: CitiBikes Conveniently located across the street with numerous dock stations around Miami Beach.  The solar-powered bike sharing system consists of a fleet of specially designed, sturdy, very durable bikes that are locked into a network of docking stations sited at regular intervals around a city. With 160+ station locations and more on the way, bikes are available to use 24 hours a day, 365 days a year. There are two distinct ways to utilize the Citi Bike program, Hourly Rental. Explore Miami Beach at your own pace. Accessibility Commitment at Pelican Hotel At Pelican Hotel, we are dedicated to ensuring that our website is accessible to all individuals, regardless of their circumstances and abilities. Our commitment extends to conforming with the Web Content Accessibility Guidelines (WCAG 2.0, Level AA) set forth by the World Wide Web Consortium (W3C). Guiding Principles The WCAG guidelines provide a comprehensive framework for enhancing web content accessibility, specifically designed to accommodate users with disabilities. We strive to align our website closely with these principles to create an inclusive and user-friendly online environment. Ongoing Efforts While we work diligently to uphold accessibility standards throughout www.pelicanhotel.com, we acknowledge that achieving perfection in every aspect can be challenging. Our team is actively engaged in an ongoing effort to address any areas where compliance may be currently lacking. Dynamic Nature of the Website Please be aware that our website is dynamic and regularly updated to provide fresh and relevant content. Due to this dynamic nature, minor accessibility issues may occasionally arise. Rest assured, we are committed to promptly identifying and rectifying any such issues as they occur. Continuous Improvement Pelican Hotel is dedicated to ensuring that every section of our website attains the highest level of web accessibility. We are continually exploring and implementing solutions to elevate the overall accessibility of our site, fostering an inclusive online experience for all users. Your Feedback Matters Your input is invaluable to us. If you have any comments or suggestions regarding the accessibility of our site, please do not hesitate to contact our accessibility coordinator. You can reach us via email at reservation@pelicanhotel.com or by phone at 305-673-3373. Your feedback plays a crucial role in our ongoing efforts to enhance accessibility, and we appreciate your assistance in making our website more accessible for everyone. Thank you for choosing Pelican Hotel. BOOK Book a Room Book a Table NAVIGATE Hotel Rooms Pelican Cafe Room 55 Experience Miami Offers Blog FAQ Hotel Rooms Pelican Cafe Room 55 Experience Miami Offers Blog FAQ ROOMS Deluxe Queen Bohemian Deluxe Queen Deluxe Twin Deluxe Twin Accessible Deluxe King Suite Deluxe King Suite Accessible Deluxe Queen Suite Deluxe Queen Ocean View Suite Queen Suite King Ocean View Suite King Executive Penthouse One Facebook-square Instagram Linkedin Youtube Copyright © 2025 Pelican Hotel. Carefully crafted by Subsign CONTACT US +1 305-673-3373 Contact us here LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 EMAIL reservation@pelicanhotel.com restaurant@pelicanhotel.com NEWSLETTER I accept the Privacy Policy Submit Terms and Conditions Privacy Policy Cookie Policy Hotel Policies Pet Policy Accessibility Copyright © 2025 Pelican Hotel Facebook-square Instagram Linkedin Youtube BOOK Book a Room Book a Table CONTACT US +1 305-673-3373 LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 EMAIL reservation@pelicanhotel.com restaurant@pelicanhotel.com ROOMS Deluxe Queen Bohemian Deluxe Queen Deluxe Twin Deluxe Twin Accessible Deluxe King Suite Deluxe King Suite Accessible Deluxe Queen Suite Deluxe Queen Ocean View Suite Queen Suite King Ocean View Suite King Executive Penthouse One NEWSLETTER I accept the Privacy Policy Submit Hotel Policies Pet Policy Accessibility Terms and Conditions Privacy Policy Cookie Policy Copyright © 2025 Pelican Hotel Carefully crafted by Subsign BOOK Book a Room Book a Table ROOMS Deluxe Queen Bohemian Deluxe Queen Deluxe Twin Deluxe Twin Accessible Deluxe King Suite Deluxe King Suite Accessible Deluxe Queen Suite Deluxe Queen Ocean View Suite Queen Suite King Ocean View Suite King Executive Penthouse One NEWSLETTER I accept the Privacy Policy Submit CONTACT US +1 305-673-3373 LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 EMAIL reservation@ pelicanhotel.com restaurant @ pelicanhotel.com NAVIGATE Hotel Rooms Pelican Cafe Room 55 Experience Miami Offers Blog FAQ Hotel Rooms Pelican Cafe Room 55 Experience Miami Offers Blog FAQ Hotel Policies Pet Policy Accessibility Terms and Conditions Privacy Policy Cookie Policy Copyright © 2025 Pelican Hotel Carefully crafted by Subsign MORE MORE MORE MORE BOOK NOW BOOK NOW WELCOME TO MIAMI! 1:34 AM   / Miami, FL 81° Partly Cloudy Miami, FL climate ▸ Home Hotel Story Gallery Press Location & Arrival Rooms Deluxe Queen Bohemian Deluxe Queen Deluxe Twin Deluxe Twin Accessible Deluxe King Suite Deluxe King Suite Accessible Deluxe Queen Suite Deluxe Queen Ocean View Suite Queen Ocean Front Suite King Suite King Executive Penthouse One Pelican Cafe Restaurant Book a table Kitchen Pelican Cafe Bar Corporate&Gatherings Room 55 Experience Miami Offers CONTACT US +1 305-673-3373 Location 826 Ocean Drive, Miami Beach, FL. 33139+1 305-673-3373 Email reservation@pelicanhotel.com Facebook-square Instagram Linkedin Youtube CONTACT US +1 305-673-3373 Location 826 Ocean Drive, Miami Beach, FL. 33139+1 305-673-3373 Email reservation@pelicanhotel.com Facebook-square Instagram Linkedin Youtube Everything worked perfectly! Our team will review your inquiry and contact you within 24 hours. HOME HOME"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/special_events.php",
      "text": "SPECIAL EVENT INFORMATION Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Special Events Related Pages Meet Our Staff Activity Brochure Drop In Classes Online Registration Rhythm In Motion Dance Recreation Facilities DRS Community Center Pelican Beach Clubhouse Beach Parks Tennis/Racquetball Courts E. Lorraine Gott Dog Park Skate/BMX Park Playgrounds Sports Fields Samsons Island Rental Facilities DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Civic Center Special Events Upcoming Events Calendar Volunteer Opportunities Community Involvement Recycling Opportunities Other Related Links Forms Open Gym SPECIAL EVENT INFORMATION LOOKING FOR AN EVENT: Special Events help build a sense of belonging and community pride. The City of Satellite Beach offers a variety of Special Events throughout the year through our Recreation Department as well as through our strong community partnerships. Click the link below to view our events calendar or follow us on Facebook: EVENTS CALENDAR #PLAYSATELLITEBEACH PLANNING AN EVENT IN SATELLITE BEACH? The Recreation Department exists to serve the community and to guide event planners through the special event permitting procedure. Any  special events, such as surf/skate contests, runs/walks, parades, block parties and citywide holiday celebrations that take place on both City Owned Property or Non-City Owned Property are initiated with our office. For the safety and well-being of participants and the public, the City of Satellite Beach requires submission of a Special Event Application along with a to-scale Site Plan for both City Owned Property events and Non-City Owned Property events. Click the link to the below for pdf Special Events Application. If you have any questions contact us at 321-773-6458 to schedule a pre-application review meeting. PLANNING A BEACH CEREMONY? Have your ceremony in the sand on one of the most beautiful beaches in Florida. A beach ceremony permit is required if one or more of the following applies to your event. Event is generating income from attendees Over 25 attendees Commercial support provided. Equipment, tents, arch, chairs, generators etc. (These are not provided by the city, but are allowed.) Click here for BEACH CEREMONY application. Please contact us with any questions at 321-773-6458 Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/special_events.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/police_department/",
      "text": "SATELLITE BEACH POLICE DEPARTMENT Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Police Department Satellite Beach Police Department Command Staff and Administrative Services Records Property & Evidence Biased Based Profiling Professional Standards Job Opportunities Employment Opportunities Alarm Permits Solicitation Permits Ride Alongs Operations Patrol Division K-9 Unit Marine Patrol ATV Patrol Criminal Investigations Beachside Shared Victim Advocate School Resource Officers Emergency Response Team Communications Public Services Domestic Violence & Victims Rights FDLE Sexual Offenders Fingerprinting Found Property Free Gun Locks (LSV) Low Speed Vehicle Registration House Checks Hurricane Preparedness Identity Theft Proper Use of 911 School Crossing Guard Station Tours Stop By & Say Hi Special Needs Registry Hartmann~Flagg Memorial Page Volunteers FAQs & Links City of Satellite Beach Contact Information Contact Us SATELLITE BEACH POLICE DEPARTMENT Welcome Letter from the Chief Welcome to the Satellite Beach Police Department’s website.  On behalf of the proud members of our department, we are pleased to present the accomplishments of our safe and beautiful City. The Satellite Beach Police Department is committed to serving our community.  We value going above and beyond the call of duty and doing more than others expect.  Through careful employee selection and continuous training, the Satellite Beach Police Department delivers professional, ethical, and compassionate public safety services to our residents, businesses, and visitors. Dedicated police officers, civilian staff, crossing guards, and volunteers pledge to protect, serve, and improve the quality of life throughout our community.  The community benefits from the law enforcement services provided through the following divisions: Patrol, K-9, Emergency Response Team, School Resource Officers, Criminal Investigations, Professional Standards, Traffic Homicide Investigations Unit, Victim Advocate, Communications, Records, and Property & Evidence. The Satellite Beach Police Department Volunteer Program is designed to enhance our delivery of public safety services by providing people a way to share their time and talents with our community.   Volunteers perform meaningful roles which directly impact the quality of life in our community by serving in various volunteer programs like C.O.P. (Citizens on Patrol), Marine Patrol, ATV Beach Patrol, Bike Patrol, Fingerprinting, House Checks, Administration, and Stop By & Say Hi. Our motto “Serving Our Community” is not just a slogan – it is our daily mission. The men and women of the Satellite Beach Police Department take pride in our service to the community and remain committed to earning the trust and confidence of the community we serve every day. Chief Jeff M. Pearson The Satellite Beach Department is firmly committed to equal employment opportunity and provides for equal opportunity before and during employment with the Department for all applicants and employees regardless of race, color, religion, sex, age, national origin, political affiliation, disability, marital status, or other similar factors not job related. Satellite Beach Policy Prohibiting Bias Based Profiling CONTACT INFORMATION: Satellite Beach Police Department 510 Cinnamon Drive Satellite Beach, FL 32937 Emergency Phone Number: Dial 911 Non -emergency Phone Number: (321) 773-4400 Fax Number: (321) 773-5414 For general inquiries, Email: [email protected] Back to the top Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/police_department/\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://www.giftly.com/gift-card/pelican-beach-clubhouse-satellite-beach",
      "text": "Pelican Beach Clubhouse Gift & Greeting Cards - Email, Text or Print - 1495 Highway A1A, Satellite Beach, FL Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Satellite Beach Activities Pelican Beach Clubhouse Pelican Beach Clubhouse Gift Card Pelican Beach Clubhouse Giftly A beautiful gift card alternative for Pelican Beach Clubhouse Pelican Beach Clubhouse 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Pelican Beach Clubhouse (3) (321) 773-6577 Categories Beaches Location 1495 Highway A1A, Satellite Beach, FL Click here to send a gift up to $1,000 with the suggestion to use it at Pelican Beach Clubhouse. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Pelican Beach Clubhouse Buy a gift for Pelican Beach Clubhouse. Treat your friends with a Giftly to Pelican Beach Clubhouse, located at 1495 Highway A1A in Satellite Beach, FL. With Giftly, you can purchase a Pelican Beach Clubhouse gift online and have it delivered instantly via email or text, print it yourself at home, or have it professionally printed and delivered by mail. It's like sending a gift card or gift certificate except that the recipient has more flexibility in how they spend it. Updated: September 07, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Pelican Beach Clubhouse gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Pelican Beach Clubhouse. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Pelican Beach Clubhouse or anywhere else they like! Top Related Gifts Crayola Experience Unleash Your Colorful Creativity 8001 S Orange Blossom Trl, Orlando, FL 3.7 (371) • $$ • Amusement Parks ICE! at Gaylord Palms Resort Chill Adventures Await at Gaylord Palms 6000 W Osceola Pkwy, Kissimmee, FL 2.5 (402) • Arts & Entertainment AMF Sky Lanes Bowling, Games, and Great Memories 7401 S Orange Blossom Trail, Orlando, FL 3.4 (41) • Bowling AMF Kissimmee Lanes Strike Up the Fun in Kissimmee 4140 W Vine St, Kissimmee, FL 3.4 (56) • Bowling Tables Beach Family Fun on a Quiet Shore 197-199 N Hwy A1A, Satellite Beach, FL 4.0 (3) • Beaches Bicentennial Beach Relax at Bicentennial Beach Ocean Dunes Dr, Indian Harbour Beach, FL 4.4 (7) • Beaches Michael P Crotty Beach Park Quiet Shores, Beach Bliss Awaits 99 Sunrise Ave, Satellite Beach, FL 5.0 (2) • Parks Hightower Beach Park Hightower Beach Park: Waves and Relaxation 815 Hwy A1A, Satellite Beach, FL 4.4 (17) • Parks More Nearby Businesses Ocean Avenue Park 190 Ocean Ave, Melbourne Beach, FL 4.0 (1) • Beaches Indialantic Boardwalk and Seashore 201 N Miramar Ave, Indialantic, FL 3.9 (27) • Beaches Beach Island Resort 1125 S Atlantic Ave, Cocoa Beach, FL 5.0 (7) • Beaches Robert P Murkshe Memorial Park 1600 S Atlantic Ave, Cocoa Beach, FL 5.0 (3) • Beaches Cocoa Beach 1 S 2nd St, Cocoa Beach, FL 4.5 (10) • Beaches Cape Canaveral Beach 600 Washington Ave, Cape Canaveral, FL 4.8 (5) • Beaches Playalinda Beach 17 Olsen Rd, Orlando, FL 4.4 (28) • Beaches Treasure Shores Beach 12760 Florida A1A, Vero Beach, FL 3.3 (3) • Beaches South Beach 1704 Ocean Dr, Vero Beach, FL 4.5 (13) • Beaches Seagull Park 285 Hwy A1A, Satellite Beach, FL 4.7 (6) • Parks Pelican Beach Park 1525 Hwy A1A, Satellite Beach, FL 4.6 (18) • Parks South Beach Fitness 1946 Hwy A1A, Indian Harbour Beach, FL 2.9 (51) • Gyms Nurturing Sol Healing Arts 1300 Pinetree Dr, Indian Harbour Beach, FL 5.0 (5) • Yoga Beach Shack Beach Rentals 1 Minutemen Cswy, Cocoa Beach, FL 5.0 (2) • Beach Equipment Rentals Blockhouse Beach A1A, Patrick Air Force Base, FL 4.0 (3) • Beaches Paradise Beach & Park 113 Paradise Blvd, Indialantic, FL 4.3 (22) • Beaches The Melbourne Beach Park Hwy A1A & Ocean Blvd, Melbourne Beach, FL 4.5 (11) • Beaches Canaveral National Seashore Cape Canaveral, FL 4.7 (18) • Beaches Florida's Space Coast Office of Tourism 267 W Cocoa Beach Cswy, Cocoa Beach, FL 4.5 (2) • Beaches Vero Beach 4009 Ocean Dr, Vero Beach, FL 4.4 (7) • Beaches Jaycee Beach 4100-4198 Ocean Dr, Vero Beach, FL 4.5 (17) • Beaches Ocean Breeze Inn 3384 Ocean Dr, Vero Beach, FL 3.7 (12) • Beaches Fit With Cassandra 1359 Hwy A1A, Satellite Beach, FL 5.0 (2) • Trainers Satellite Beach Cinemas 1024 Florida A1A, Satellite Beach, FL 3.5 (31) • Cinema Satellite Beach Dog Park 750 Jamaica Blvd, Satellite Beach, FL 3.4 (9) • Dog Parks Gleason Park Lansing Gleason Park Trl, Indian Harbour Beach, FL 4.5 (6) • Parks Kiwi Racquet and Fitness Club 30 Tradewinds Dr, Indian Harbour Beach, FL 4.0 (4) • Sports Clubs Bonsteel Park 8455 Hwy A1a, Melbourne Beach, FL 5.0 (3) • Parks Cocoa Beach 1033 S Atlantic Ave, Cocoa Beach, FL 4.0 (162) • Beaches Town of Indialantic By The Sea 216 5th Ave, Indialantic, FL 4.0 (2) • Beaches Alan Shepard Park 216-248 E Cocoa Beach Cswy, Cocoa Beach, FL 4.3 (11) • Beaches Hangars Beach 745 S Atlantic Ave, Patrick Air Force Base, FL 4.4 (7) • Beaches Sea Shell Suites At Sebastian Preserve 8795 S Highway A1A, Melbourne Beach, FL 5.0 (3) • Beaches Golden Sands Beach Park 10350 Highway A1a, Vero Beach, FL 4.1 (7) • Beaches Wabasso Beach Life Guard Station 1840 Wabasso Beach Rd, Vero Beach, FL 4.2 (6) • Beaches Sexton Plaza Beach Vero Beach, FL 4.5 (2) • Beaches Dance Arts Centre 1855 S Patrick Dr, Satellite Beach, FL 5.0 (5) • Performing Arts Beachside Arts & Beyond 246 Hwy A1A, Satellite Beach, FL 4.0 (4) • Yoga Florida Academy of Baking 1370 Hwy A1A, Satellite Beach, FL 5.0 (8) • Cooking Classes Spessard Holland Beach 2525 S Highway A1a, Melbourne Beach, FL 4.2 (5) • Parks Juan Ponce de Leon Landing 4005 S Hwy A1a, Melbourne Beach, FL 4.5 (6) • Parks Betsy Markle - Sunshine Wellness 125 Anona Pl, Melbourne, FL 5.0 (5) • Nutritionists See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Beaches 4.7 3 5 single place gcdp gift_and_greeting_card_in_title_tag Satellite Beach, FL S S Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://www.pelicanbeach.com/contact/",
      "text": "Contact Pelican Grand Beach in Fort Lauderdale Our Resort Resort Amenities Contact & Directions FAQ Accessibility Gift Cards Eco-Friendly Rooms & Suites Overview Guest Rooms Suites Luxury Suites Accessible Rooms Offers Packages & Offers Dining Overview Ocean2000 O2K lounge The Emporium In-Room Dining View Menus Spa Spa & Fitness Spa Services Spa Packages & Promotions Spa Products Experiences Experiences Overview Daily Events Calendar Beach + Water Sports Local Attractions Golf Meetings & Events Overview Plan Your Meeting Meeting Venues Meeting Testimonials Weddings Overview Plan Your Wedding Wedding Venues Wedding Testimonials Gift Cards My Reservation Resort Amenities Contact & Directions FAQ Accessibility Gift Cards Eco-Friendly ZERO ENTRY POOL PRIVATE BEACH Overview Guest Rooms Suites Luxury Suites Accessible Rooms SUITES GUEST ROOMS Packages & Offers PACKAGES & OFFERS ANTICIPATING PARADISE Overview Ocean2000 O2K lounge The Emporium In-Room Dining View Menus OCEAN2000 RESTAURANT HAPPY HOUR Spa & Fitness Spa Services Spa Packages & Promotions Spa Products SPA & FITNESS CENTER SPA SERVICES Experiences Overview Daily Events Calendar Beach + Water Sports Local Attractions Golf PRIVATE BEACH LOCAL ATTRACTIONS Overview Plan Your Meeting Meeting Venues Meeting Testimonials MEETING VENUES PLAN YOUR EVENT Overview Plan Your Wedding Wedding Venues Wedding Testimonials PLAN YOUR WEDDING WEDDING VENUES GIFT CARD Skip to content Contact Gallery BOOK NOW BOOK NOW Questions? Need some local tips? Let’s chat. Hearing from you is important to us, don’t hesitate to call us with questions, or send us any feedback you have. Talk soon! PELICAN GRAND BEACH RESORT Front Desk 954-622-8417 Reservations 866-905-8042 info@pelicanbeach.com DINING 954-556-7667 info@pelicanbeach.com SPA 954-556-7600 FIND YOUR WAY TO US Pelican Grand Beach Resort 2000 North Ocean Blvd Fort Lauderdale, FL, 33305 Open Google Map Meetings & Catered Events 954-556-7550 sales@pelicanbeach.com Weddings 954-556-7550 sales@pelicanbeach.com Public Relations Janie Henker PelicanGrandPR@zimmerman.com Lost and Found For lost & found items please click link below: REPORT LOST ITEM ADDRESS Pelican Grand Beach Resort 2000 North Ocean Blvd Fort Lauderdale, FL 33305 Map & Directions NEWS & OFFERS LIST HOTEL DIRECT 954-622-8417 ROOM RESERVATIONS 866-905-8042 NEWS & OFFERS LIST AWARDS & PRESS Top 500 Hotels in the World Travel + Leisure, 2023 Readers’ Choice Award Convention South, 2020-2023 SEE MORE AWARDS & PRESS Facebook-f Instagram Careers Contact & Directions Awards & Press Accessibility Travel Professionals Sitemap Cookie Center CALIFORNIA The Portofino Hotel & Marina The Napa Valley Wine Train Kona Kai San Diego Resort River Terrace Inn Argonaut Hotel San Diego Mission Bay Resort L’Auberge Del Mar Estancia La Jolla Hotel & Spa COLORADO Gateway Canyons Resort & Spa FLORIDA Little Palm Island Resort & Spa LaPlaya Beach & Golf Resort Pelican Grand Beach Resort Ocean Key Resort & Spa Solé Miami, A Noble House Resort The Inn on Fifth Marquesa Hotel GEORGIA Jekyll Island Club Resort MASSACHUSETTS Chatham Inn Relais & Châteaux MEXICO Corazón Cabo Resort & Spa OREGON Headlands Coastal Lodge & Spa Inn at Cape Kiwanda Hart’s Camp TEXAS The Stella Hotel WASHINGTON The Edgewater Hotel WYOMING Snake River Sporting Club Teton Mountain Lodge & Spa Hotel Terra Jackson Hole Teton Private Residences ABOUT NOBLE HOUSE Our Collections Noble House Shop CHOOSE EXPERIENCE: BEACH WINE SKI URBAN HIDDEN GEMS SPA © 2025 Noble House Hotels & Resorts | Privacy Policy . HOTEL DIRECT 954-622-8417 RESERVATIONS 866-905-8042 DINING 954-556-7667"
    },
    {
      "url": "https://weddingswithtifini.com/beach-clubhouse-wedding",
      "text": "Beach Clubhouse Wedding Weddings with Tifini Weddings with Tifini Weddings with Tifini Weddings with Tifini Weddings with Tifini Weddings with Tifini Weddings with Tifini Weddings with Tifini Wedding Services Package Deals Beach Clubhouse Wedding Contact More Wedding Services Package Deals Beach Clubhouse Wedding Contact Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Wedding Services Package Deals Beach Clubhouse Wedding Contact Account My Account Sign out Sign In My Account Satellite Beach Clubhouse Wedding Package Wedding Venue The Pelican Beach Clubhouse 1495 Florida A1A, Satellite Beach, FL 32937 Package availability based on availability of Clubhouse Venue. Please find additional information on the clubhouse, including rental rates, included tables, chairs, and layout here: Satellite Beach, FL 2025 Rental Pricing Rental Contract PDF Clubhouse Layout, Diagram and Details This package is exclusive to this venue. Max Venue Occupancy 60 Wedding Planning Wedding Planning Provides vendor referrals and manages contracts, vendor insurance, etc. Schedules and attends vendor meetings, onsite tours, etc. Helps determine and manage your budget, as well as tracks deposits and payments. Day of Wedding Coordination: Review for any potential challenges or issues, provide solutions and suggestions for resolution. Review the signed contracts/services contracted with vendors, confirm logistics. Detailed timelines for vendors, wedding party and the day's events. Completes a final walk-through of the ceremony and reception sites. Attends/Manages the rehearsal. Oversees Wedding Day Design & Decor Wedding Photography Wedding Design & Decorator Assist client in defining the wedding's design concept. Provides color palette guidance. Oversees the décor budget and vendors (florist, rentals, lighting, stationery). Sources special props and equipment. Attends a site visit to visualize where you want everything to go, devise a layout, and identify potential problems. Assist in creating detailed floor plans. Manages and executes all of the décor, design and confirm supplies are in place, on-site at the wedding. Wedding Photography Wedding Photography Our experienced photographers will capture every precious moment of your Wedding Day, creating beautiful and lasting memories for you to cherish. Your photographer will be assigned based on availability. Your photography services will be a total of 4 hours. The photographer will be providing services at the venue only, no off-site services will be included. Photography service begins 1 hour prior to ceremony time, to collect detail shots and photos of setup. Couple getting ready and first look, if applicable. Photographers: Lady Blue Photography by Nerissa Johnson Sterling Dreams Photography Lauren Linahon Photography You may inquire with your assigned photographer for additional hours, off-site or additional services. Prices vary per photographer. All the Perks What's Included: Venue coordination for availability and contract. We secure the venue, assume responsibility for the liability and regulations of the venue. Additionally, the venue is cleaned at the end of services and the key is returned to the Recreation Department. There will be no deposit returned to the client due to these services provided. Ceremony Officiant Custom Ceremony Script Marriage License Service for Non-Residents Ceremony Music Fresh floral bouquet and boutonniere in coordinating colors and design of ceremony. Full access to all of decor inventory for design. Ceremony setup: Arch, 25 chairs, aisle decor, etc. from Beach Weddings in Florida Cocktail Reception Setup on Deck and inside clubhouse area, for provided champagne toast and cake cutting. What to know... The package is designed to accommodate small, intimate/micro-weddings with a ceremony then a cocktail reception to follow, for a first dance, champagne toast and cake cutting; the price is exclusive to the vendors who remain available to provide the packaged services. You may provide or replace any vendor or service within the package by contracting your own vendor/service provider, however, there will be no discounts or credits from this package. 2025 Rates $6439 Add on chairs - $15/chair Max Ceremony Guest Chairs 50 Food handling, setup, display or service - $150/hour/pp MC or Music Controls - $75/hour Local Catering, Beverage, Food Supplies, Desserts, etc. available for add-on, contact for quote. Vendor recommendations available. Want all the same services... but somewhere else? Take the package with you! This package pricing is exclusive to this venue; however, you may move all these services to an alternate location of your preference. The venue cost would be the sole responsibility of the client. The cost difference will be based on location, guest count and availability. Submit your inquiry Copyright © 2025 Weddings with Tifini - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/beach_bonfires.php",
      "text": "Beach Bonfires Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Beach Bonfires Related Pages Meet Our Staff Activity Brochure Drop In Classes Online Registration Rhythm In Motion Dance Recreation Facilities DRS Community Center Pelican Beach Clubhouse Beach Parks Tennis/Racquetball Courts E. Lorraine Gott Dog Park Skate/BMX Park Playgrounds Sports Fields Samsons Island Rental Facilities DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Civic Center Special Events Upcoming Events Calendar Volunteer Opportunities Community Involvement Recycling Opportunities Other Related Links Forms Open Gym Beach Bonfires BONFIRE SEASON RUNS NOVEMBER THRU THE END OF FEBRUARY BONFIRE SEASON IS CLOSED Recreational beach bonfires have long been part of the culture of Satellite Beach for decades. Per City Ordinance 26-31: outdoor burning shall only be allowed with a permit, that includes ceremonial fires, recreational fires, bonfires and campfires. Bonfire season runs November 1 ST through February 28 TH . No permits will be issued from March 1 ST through October 31 ST due to sea turtle nesting season. Several changes have been made to the permitting process for individuals interested in obtaining a bonfire permit. All permits will be issued by the Recreation Department (Located at 1089 S. Patrick Drive, Satellite Beach, FL 32937) on a first come, first serve basis. Permit fees are $50 each, plus a fully refundable security/damage deposit in the amount of $100 per bonfire site, and a signed and notarized hold harmless agreement. PLEASE NOTE: Last minute bonfire permits issued for the upcoming weekend must have the notarized paperwork completed and be paid for in full no later than 12pm on Friday (or by 12pm Wednesday for weekend of Thanksgiving/Christmas). Click arrow (-->) on top left corner of the map for complete list of bonfire sites Refund Policy: Refunds are available if requested at least 3 full business days prior to the permit date. A full refund of the permit fee and deposit will be mailed approximately 3 weeks following the notice of cancellation. Refunds requested less than 3 full business days, but still prior to reservation date will result in forfeiture of the permit fee, however, the security/damage deposit will be returned following the notice of cancellation, approximately 3 weeks (if paid by credit card, it will be processed back to the card immediately). Security/Damage Deposit Refund: A full refund of your security/damage deposit will be returned to you after your event providing you abided by the bonfire rules and regulations. The security/damage deposit refund will be processed and mailed to you approximately 3 weeks following permitted date or applied directly back to the credit card used to make payment. If your deposit is withheld, you will be notified by the city within 2-3 business days. Office Location: David R. Schechter Community Center 1089 South Patrick Drive, Suite 105 Satellite Beach, FL 32937 Phone: (321) 773-6458 Fax: (321) 777-5207 Email : [email protected] Office Hours: Monday-Friday 8:30am-5pm Payments Accepted: Cash, Check, Money Order, and Credit Cards (Visa/MasterCard/Discover/American Express). Please note that the credit card company (Forte) charges a minimum of $2.00 or 2.55% per transaction whichever is greater. Checks can only be accepted for bonfires occuring more than thirty days out from time of payment. Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/beach_bonfires.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/rental_facilities/drs_community_center.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Rental Facilities DRS Community Center Related Pages DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Pavilions & Amenities Civic Center DRS Community Center Host Your Next Event at the DRS Community Center! David R. Schechter Community Center | Satellite Beach, FL Looking for the perfect space to host your next event, party, or meeting? The DRS Community Center offers over 37,000 square feet of versatile, air-conditioned space designed to meet your needs—whether you're planning a birthday bash, a corporate event, a dance class, or a community gathering. Available Rental Spaces Meeting Room Spacious and flexible—ideal for everything from weddings to workshops. Size: 1,692 sq. ft. | Capacity: 106 people Amenities: (20) 6-ft tables, kitchenette (microwave, sink, fridge) Rates: Standard: $36/hr or $432/day Resident Discount: $18/hr or $216/day Deposit: $100 (refundable) Perfect for: Weddings, birthday parties, company events, club meetings Concession Area A cozy, casual space with a full kitchen—great for small gatherings. Capacity: 40 people Amenities: Full kitchen, (10) 42” round tables Rates: Standard: $30/hr or $360/day Resident Discount: $15/hr or $180/day Deposit: $100 (refundable) Perfect for: Social gatherings, group meetings, casual events Dance Studios (1 & 2) Designed for movement—ideal for dance, fitness, and rehearsals. Capacity: 40–60 people Features: Mirrored walls, specialty dance flooring Rates: Standard: $30/hr or $360/day Resident Discount: $15/hr or $180/day Deposit: $100 (refundable) Perfect for: Dance practice, exercise classes, workshops Gymnasium A large, dynamic space for sports and large-scale events. Capacity: 453 people Features: Bleachers, basketball hoops, locker rooms with showers Rates: Standard: $90/hr Resident Discount: $45/hr Deposit: $100 (refundable) Perfect for: Basketball, volleyball, pickleball, fitness classes, tournaments 🕗 Rental Hours: 8:00 AM – 1:00 AM daily 📍 Location: David R. Schechter Community Center 1089 S. Patrick Dr., Satellite Beach, FL Ready to Book? Contact us today to check availability and reserve your space! Let the DRS Community Center be the backdrop for your next unforgettable event. 📞 Phone: (321) 773-6458 Click here for Rental Contract Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/rental_facilities/drs_community_center.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/police_department/faqs___links/city_of_satellite_beach_contact_information.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Police Department FAQs & Links City of Satellite Beach Contact Information City of Satellite Beach Contact Information FAQ & Links To email a short message to our Mayor, City Council and City Manager with suggestions, concerns or feedback for our City, please visit our Citizens Request Center . To send longer messages or attachments, please use the individual email addresses below. Position/Department Info Name Location/Hours of Operation Fax Email Phone City Manager Brittany Retherford 565 Cassia Boulevard Satellite Beach, FL 32937 [email protected] (321) 773-4407 .ext 114 Assistant City Manager Suzanne Sherman 565 Cassia Boulevard Satellite Beach, FL 32937 [email protected] (321) 773-4407 City Clerk Gwen Peirce 565 Cassia Boulevard Satellite Beach, FL 32937 - - City Clerk's Office Monday-Friday 8:00 am-4:30 pm (321) 779-1388 [email protected] (321) 773-4407 Building Official Patrick Callahan 565 Cassia Boulevard Satellite Beach, FL 32937 - - Monday -Friday 8:00 am-4:30 pm *Closed for lunch 12:00-1:00 (321) 777-6619 [email protected] (321) 773-4409 Fire Chief Jeff Dangler 240 JacksonAvenue, Satellite Beach, FL 32937 (321) 773-8199 [email protected] (321) 773-4405 Police Chief Jeff Pearson 510 Cinnamon Drive Satellite Beach, FL 32937 (321) 773-5414 [email protected] (321) 773-4400 Public Works Director Allen Potter 240 Jackson Avenue Satellite Beach, FL 32937 - - 7:30am-3:30 pm (321) 777-2241 [email protected] (321) 777-2309 Recreation Director Cassie Warthen 1089 South Patrick Drive Satellite Beach, FL  32937  - - 8:30am-Various Hours See Recreation web page for details (321) 777-5207 [email protected] (321) 773-6458 Support Services Director Nick Walsh 565 Cassia Boulevard Satellite Beach, FL 32937 [email protected] (321) 773-4407 Planning & Sustainability Director Sandra Leone 1390 South Patrick Drive, Satellite Beach, FL 32937 [email protected] (321) 364-2252 City Council- Mayor Steve Osmer [email protected] (321) 773-4407 City Council - Council Member Mark Boyd [email protected] (321) 773-4407 City Council- Council Member Mike Chase [email protected] (321) 773-4407 City Council- Council Member Jodi Rozycki [email protected] (321) 773-4407 City Council - Council Member Stephen Sams [email protected] (321) 773-4407 Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/police_department/faqs___links/city_of_satellite_beach_contact_information.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/community_involvement.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Community Involvement Related Pages Meet Our Staff Activity Brochure Drop In Classes Online Registration Rhythm In Motion Dance Recreation Facilities DRS Community Center Pelican Beach Clubhouse Beach Parks Tennis/Racquetball Courts E. Lorraine Gott Dog Park Skate/BMX Park Playgrounds Sports Fields Samsons Island Rental Facilities DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Civic Center Special Events Upcoming Events Calendar Volunteer Opportunities Community Involvement Recycling Opportunities Other Related Links Forms Open Gym Community Involvement Community Involvement: The City of Satellite Beach Recreation Department offers great opportunities for you to stay involved in your community.  In addition to the programs listed below, we have a list of civic and social clubs that meet at city facilities. Satellite Beach Recreation Department Volunteer Involvement Program (VIP): Become a Satellite Beach VIP! Satellite Beach Recreation Department offers our Volunteer Involvement Program to connect citizens to the City through community engagement.  The Volunteer Involvement Program coordinates efforts with local schools, community groups and the public to allow volunteer participation in many City sponsored events, camps, and programs. Satellite Beach students and adults are encouraged to invest time in their community. If you are interested, submit a completed volunteer application and contact Ana Pazderak at (321) 773-6458 or [email protected] for more information. Satellite Beach Community Paramedic Program: Satellite Beach Fire Department offers in-home health evaluations for older citizens who have chronic health conditions. Community Health Paramedics will schedule appointments to visit citizens in their homes as needed to conduct physical exams and check ups. Services provided include: In-Home Paramedic exam on a weekly visit, 12 Lead EGG, Vitals including weight, Blood Glucose, Oxygen Saturation, Medication review and compliance, Nutrition review and compliance, Link with Primary Care Provider(s) to provide first hand observations about your health status and potential needs, as well as Link to Community Services to enhance your quality of life. To request additional  information, contact the Satellite Beach Fire Department, Monday-Friday 9am-4pm by calling (321) 773-4405 Ext. 4, or visit the Community Paramedic Program page . Satellite Beach Police Department Volunteer Program: Satellite Beach is known for their volunteers who want to make a difference and give back to the community.  Our existing police volunteer presence and support have provided a solid contribution to our quality of life. Because of our volunteers, we are able to provide a wider range of services to our residents and extend Police visibility as the volunteers patrol the neighborhoods. COPS also assist with city special events. In order to be a volunteer you must successfully pass a background check and be able to donate 2 hours a week. If you are interested, please visit the SBPD Volunteer Page at https://satellitebeach.gov/departments/police_department/volunteers.php . Stop By & Say Hi Program: The Satellite Beach Police Department Volunteer Program provides a beneficial program titled “Stop By & Say Hi” where our volunteers literally do just that with our City residents. We provide companionship and become a friend who is close by. Our compassionate volunteers provide laughter, brighten a day, and let our residents know they are not forgotten and that we care in Satellite Beach. We also offer basic resources and support. The program is free of charge and confidential. There are no requirements except that they must live in the City limits of Satellite Beach. The resident can be of any age or background and can be someone who would enjoy having someone to talk to while they reminisce about the good old days. We encourage you to recommend someone you know to [email protected] or call the Satellite Beach Police Department: (321) 773-4400 ext 412. A referral form is located at City Hall or the SB Police Station. It is also available on the Stop By and Say Hi page . Volunteers in Motion: The Volunteers in Motion Program began in 1996 and helps seniors live independently by offering life sustaining  transportation to medical appointments, pharmacies and to the grocery store. This service is coordinated by Space Coast Area Transit. Volunteers in Motion will provide specialized vans which will accommodate mobility devices in support of our Satellite Beach’s Community Paramedic, Stop By & Say Hi Program and Neighbor Helping Neighbor residents. This is an exciting new opportunity for the City of Satellite Beach residents who participate in one of these programs so that transportation will be available. Samsons Island Adopt-A-Park Program: Samsons Island Nature Park is a 52-acre island owned by the City of Satellite Beach located in the Indian River Lagoon.  Since 1991, City volunteers and staff have worked diligently to re-vegetate local flora and fauna on this spoil island so the community can enjoy a small piece of open land. The City’s Adopt-A-Park program recruits individuals, families and local organizations to lend a hand with park duties that fit their ability level. Individuals and families can volunteer on the island on a schedule convenient to them, while organizations are asked to commit to work parties at least twice a year. Those interested in volunteering on Samsons Island can contact Cassie Warthen, Satellite Beach Recreation Director, via email at [email protected] or call by phone at 773-6458. Sport Organizations: Youth sport organizations in Satellite Beach are always looking for good volunteers. Duties can range from board positions to concession stand workers, coaches, managers, or team parents. Most sport league websites list their volunteer opportunities. The sport league websites are listed in our current activity brochure. Community Board/Committees: There are many citizen boards that advise City Council on important issues concerning community growth and policy management. One such board is coordinated through the Recreation Department:  The Recreation Board members recommend future facilities and recreation related policies to the City Council.  If you are interested in participating in a City board, visit the City Boards page to view current vacancies and download an application or contact the City Clerk's Office at 773-4407. Satellite Beach Library: Please call 779-4004 to find out how to become involved with the Library. Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/community_involvement.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/government/city_boards/index.php",
      "text": "Satellite Beach, FL Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Government City Boards Related Pages Beach Parking Ad Hoc Committee Board of Adjustment Agendas & Minutes Firefighters & Police Pension Plan Board of Trustees Agendas & Minutes General Employee Pension Plan Board of Trustees Agendas & Minutes Library Board Agendas & Minutes Planning Advisory Board Agendas & Minutes Recreation Board Agendas & Minutes Sustainability Board Agendas & Minutes Sustainable Satellite Tree & Beautification Board Agendas & Minutes Youth Council Agendas & Minutes City Boards Apply for a Board If you are a resident and a registered voter in the City of Satellite Beach, and would like to become involved with your City, please submit a completed board application at the link below.  These are all volunteer (unpaid) positions. Board Application For questions or comments, contact the City Clerk by phone (773-4407) or email [email protected] . For more details on a board, click on the name of the board you'd like to view. Board of Adjustment (BOA) Vacancy : None Library Board Vacancy : Two (2) Alternates Pension Plan Board of Trustees (Firefighters and Police) Vacancy : None Pension Plan Board of Trustees (General Employees) Vacancy :  None Planning Advisory Board (PAB) Vacancy: None Recreation Board Vacancy :  None Sustainability Board Vacancy : None Tree & Beautification Board Vacancy : None Youth Council Vacancies : Four (4) Members Application to serve on Youth Council* *Form must be downloaded, saved and reopened in Adobe prior to entering information. You must have Adobe Acrobat Reader to download and open the application. ADA Accessibility :  The City is currently working on converting all online documents to an ADA Accessible format pursuant to WCAG 2.0 AA standards.  During this process, an unconverted document can be converted immediately upon request by contacting the City Clerk's Office at (321) 773-4407 or [email protected] . Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/government/city_boards/index.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    },
    {
      "url": "https://satellitebeach.gov/departments/recreation_department/special_event_calendar.php",
      "text": "Upcoming Community Events Skip to main content Government Agendas & Minutes City Council City Council Election City Values Statements Council Agendas & Minutes Meeting Videos Meeting Videos City Manager City Boards Board of Adjustment Firefighters & Police Pension Plan Board of Trustees General Employee Pension Plan Board of Trustees Library Board Planning Advisory Board Recreation Board Sustainability Board Tree & Beautification Board Youth Council Special Magistrate Agendas & Minutes Public Records Public Records Request Departments City Clerk Agendas & Minutes 2024 City Council Election Public Records Public Records Request Community Development Department Business Tax Receipts City Maps Disaster Preparedness Fees Flood Insurance Update Flood Maps Forms Land Development Regulations Online Portal Permit Information Quick Links Fire Department Beach Bonfire Community Paramedics Customer Service Emergency Management Fall Prevention History Join Our Crew Mobile Integrated Health Spotlight on Safety Contact Us Police Department Administration Operations Public Services Volunteers Memorial Page FAQs & Links Contact Us Public Works Staff Teams Roads and Drainage Grounds Stormwater Hurricanes Photo Gallery Project Updates Recreation Department Department Information Activity Brochure Beach Bonfires Online Registration Forms Rhythm In Motion Dance Meet Our Staff Recreation Facilities Rental Facilities Special Events Volunteer Opportunities Recycling Opportunities Other Related Links Support Services Annual Budgets & Financial Audits Forms Job Opportunities Sustainable Satellite Residents Beachcaster Beach Parking Permit Beach Surf Cams Citizen of the Year City Council Election City Forms & Documents Alarm Permit Application Public Records Forms City News Community Involvement Current City Projects E-Notifications FAQs Job Opportunities Low Speed Vehicles (LSV) Registration Online Permitting Public Records Request Recreation Activity Brochure Online Registration Beach Bonfires Beach Parks and Accesses Recreation Facilities Rental Facilities Special Events Sustainable Satellite Resources for Residents Volunteer Opportunities Waste Management Info Service Request Service Information Disabled / Elderly Pickup Assistance Yard Waste Collection Guidelines Business Business License Applications Bids - RFP - RFQ Forms E-Notifications Sustainable Satellite Visitors City History First 50 Years Through The Decades Softball Capital of the World Beachcaster Beach Bonfires Beach Parking Permit Beach Parks and Accesses E-Notifications Eco-Resource Links Job Opportunities Public Records Request Recreation Facilities Rental Facilities Sustainable Satellite How Do I? Apply For/ Obtain Beach Parking Permit Bids - RFP/RFQ Business License Applications City Boards Job Opportunities Public Records Request Contact Us Download/View Agendas & Minutes Meeting Videos City Documents Forms FAQs Website Accessibility File a Code Complaint Find/Learn About City Council Election Recycling Opportunities Special Events Volunteer Opportunities Register Bike Registration E-Notifications Low Speed Vehicle (LSV) Registration Recreation Online Registration Report a Concern/Provide Feedback Translate This Page Afrikaans Albanian Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese Punjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili Swedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Yoruba Zulu Search Home Departments Recreation Department Special Events Upcoming Events Calendar Related Pages Meet Our Staff Activity Brochure Drop In Classes Online Registration Rhythm In Motion Dance Recreation Facilities DRS Community Center Pelican Beach Clubhouse Beach Parks Tennis/Racquetball Courts E. Lorraine Gott Dog Park Skate/BMX Park Playgrounds Sports Fields Samsons Island Rental Facilities DRS Community Center Pelican Beach Clubhouse Pelican Beach Park Civic Center Special Events Upcoming Events Calendar Volunteer Opportunities Community Involvement Recycling Opportunities Other Related Links Forms Open Gym Upcoming Community Events ONGOING EVENTS Big Truck Day – Saturday, September 27th Beep beep—clear the way for Big Truck Day! Kids of all ages are invited to explore fire trucks, dump trucks, construction vehicles, and more at this hands-on event. Climb aboard, sit in the driver’s seat, and experience the excitement of these mighty machines up close! Location: DeLaura Middle School Parking Lot Time: 10:00 AM – 2:00 PM 🔇 Horn-Free Hour: 10:00 – 11:00 AM (ideal for children with sensitive ears) Admission: FREE – Adult supervision required Have a Big Rig You Want to Show Off at Big Truck Day? Do you have a truck, vehicle, or piece of heavy equipment that kids (and grown-ups!) would love to see up close? We’re looking for awesome participants to display their vehicles at Big Truck Day on September 27th in Satellite Beach! Whether it’s a fire truck, tow truck, construction vehicle, or something totally unique — we’d love to have you join the fun! 👉 Interested in bringing a big truck? Fill out our quick form or contact us at 321-773-6458 or [email protected] to reserve a space. (Guest attendance registration not required). This event is proudly presented in partnership with Beachside Smiles Pediatric Dentistry and Space Coast Urgent Care . Halloween Golf Cart Parade - Friday, October 24th Presented by the Satellite Beach Golf Cart Club & the City of Satellite Beach Sponsored by Realty World Curri Properties Get ready for a spooky night of fun at our annual Halloween Golf Cart Parade ! Watch as creatively decorated golf carts roll through town in costume, bringing Halloween spirit to life. The event features a parade , costume and cart decoration contests , food trucks , music , prizes , and more! Parade Details: Check-In Begins: 5:00 PM All Participants Must Be Signed In By: 5:45 PM Parade Step-Off: 6:00 PM Start Location: DeLaura Middle School End Location: Satellite Beach Sports Park (750 Jamaica Blvd) Parade Route: Will be posted on Facebook closer to the event date Registration Fees: Early Bird: $10 per cart (Aug 4 – Sept 12) Regular: $15 per cart (Sept 13 – Oct 23) Day-of Registration: $20 per cart 👉 Click here to register your cart! 👻 Not registering a cart? Spectators are welcome! Join us along the parade route or at the finish line for a free family festival with food, music, and Halloween fun for all ages. Founders Day Celebration – Saturday, November 1st Join us for one of Satellite Beach’s most beloved traditions— Founders Day ! From 9:00 AM to 3:00 PM at the DRS Community Center , enjoy a full day of fun featuring the Satellite Beach Woman’s Club Marketplace with over 200 craft and specialty vendors , live music, food, and family-friendly activities. The Founders Day Parade kicks off at 11:00 AM from DeLaura Middle School and ends at the DRS Community Center. This year’s theme, “Join Our Flock,” is inspired by vibrant flamingo artwork created by DeLaura Middle School students and celebrates the power of community, teamwork, and connection. 📣 Vendor applications are open through September 15 . To apply, call the Recreation Department at 321-773-6458 . 👉 Want to be in the parade? Click here to register your group or float! Holiday Golf Cart Parade - Friday, December 19th Presented by the Satellite Beach Golf Cart Club & the City of Satellite Beach Get ready to deck the carts and light up the night ! 🌟 Join us for the most magical event of the season — the Annual Holiday Golf Cart Parade in Satellite Beach! Whether you're cruising in a cart or cheering from the sidelines, this festive celebration is packed with holiday cheer, twinkling lights, and community spirit. Event Highlights: Holiday-themed golf cart parade Decoration contest with prizes Food trucks & live music Family festival at the finish line Parade Details: Check-In Begins: 4:30 PM All Participants Must Be Signed In By: 5:15 PM Parade Step-Off: 5:30 PM Start Location: DeLaura Middle School End Location: Satellite Beach Sports Park (750 Jamaica Blvd) Parade Route: Will be posted on Facebook closer to the event date Registration Fees: Registration Opens Oct 25th Early Bird: $10 per cart (Oct 25 – Nov 22)) Regular: $15 per cart (Nov 23 - Dec18) Day-of Registration: $20 per cart 🎅 Not registering a cart? No problem! Spectators are welcome to line the parade route and join us at the finish line for a free family festival filled with music, food, and holiday magic. International Coastal Cleanup - Saturday, September 20th Be part of a global movement to protect our oceans and waterways! The City of Satellite Beach is proud to participate in the 40th Annual International Coastal Cleanup , founded by Ocean Conservancy and locally sponsored by Keep Brevard Beautiful (KBB) . Saturday, September 20th | 8:00 AM – 12:00 PM City staff will be stationed at Pelican Beach Park , while our amazing partners, SWAT (Students Working Against Tobacco) , will lead efforts at Hightower Beach . Volunteers of all ages are invited to help remove litter from our beautiful coastline and contribute to the world’s largest database on marine debris using Ocean Conservancy’s Clean Swell® app . Since its inception, the International Coastal Cleanup has mobilized over 18 million volunteers to remove more than 380 million pounds of trash from beaches and waterways worldwide. Every piece of litter collected helps protect marine life and keeps our local environment clean and safe. What to Bring: Closed-toe shoes Reusable water bottle Sunscreen & hat Enthusiasm to make a difference! Student service hours available! No registration required—just show up ready to help. Supplies will be provided. Let’s work together to #SeaTheChange and keep Satellite Beach beautiful! Share this page Share this page × Copy and paste this code into your website. <a href=\"http://satellitebeach.gov/departments/recreation_department/special_event_calendar.php\">Your Link Name</a> Share this page on your favorite Social network Facebook Twitter Reddit Close DEPARTMENTS City Clerk Community Development Department Fire Department Police Department Public Works Recreation Department Support Services GOVERNMENT Agendas & Minutes City Boards City Council City Manager Meeting Videos Public Records QUICK LINKS Agendas & Minutes Meeting Videos Sustainable Satellite Job Opportunities City Documents Beachcaster ©2025 City of Satellite Beach, FL 565 Cassia Boulevard Satellite Beach, FL 32937 (321) 773-4407 Powered by revize Login Close Read More"
    }
  ]
}