{
  "fuentes": [
    {
      "url": "https://www.scarsevents.com/",
      "email": "contact@scarsfarm.com"
    },
    {
      "url": "https://sparkeventgroup.com/services/event-workforce/",
      "email": "info@sparkeventgroup.com"
    },
    {
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10656807/",
      "email": "abbi.mathews@uwe.ac.uk"
    },
    {
      "url": "https://modernfarmer.com/2013/04/farm-wounds/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.scarsevents.com/scars-events/farmers-market/",
      "email": "contact@scarsfarm.com"
    },
    {
      "url": "https://www.scarsevents.com/scars-events/farmers-market/",
      "email": "contact@www.scarsevents.com"
    },
    {
      "url": "https://www.scarsevents.com/weddings/",
      "email": "contact@scarsfarm.com"
    },
    {
      "url": "https://www.scarsevents.com/careers/",
      "email": "contact@scarsfarm.com"
    },
    {
      "url": "https://www.scarsevents.com/our-venue/",
      "email": "contact@scarsfarm.com"
    },
    {
      "url": "https://www.scarsevents.com/private-events/",
      "email": "contact@scarsfarm.com"
    },
    {
      "url": "https://www.scarsevents.com/gallery/",
      "email": "contact@scarsfarm.com"
    },
    {
      "url": "https://www.scarsevents.com/contact-us/",
      "email": "contact@scarsfarm.com"
    }
  ],
  "mails": [
    "abbi.mathews@uwe.ac.uk",
    "chosen-sprite@2x.png",
    "contact@scarsfarm.com",
    "contact@www.scarsevents.com",
    "info@sparkeventgroup.com"
  ],
  "nombre_sitio": "scarsevents.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.scarsevents.com/",
      "text": "Scars Events - Central Florida’s Most Unique Wedding Venue Skip to content Book A Tour Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Home Venue Wedding Packages Gallery Contact Us Careers Gallery Contact Us Careers Book A Tour Scars Farm Make Reservations Major Upgrades $ 0 + Open Barn $ 0 sqft Restroom Building 0 Monitor Barn 0 sqft Wedding and Event Venue Scars Farm is a wedding venue located in Bartow, Florida. Its an idyllic 54-acre site that offers a large strawberry-shaped pond lined with washingtonia palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Facilities and Capacity With a capacity of up to 400 guests, it has a 5,000-square-foot climate-controlled barn and 3,400-square-foot open rustic barn that accommodates beautiful outdoor receptions. The open barn offers views of our strawberry-shaped pond and washingtonia palm trees, while the modern monitor barn is surrounded by 124ft of glass doors/windows and is the crown jewel of the property. There are multiple ceremony locations to choose from. Exchange vows under one of the magnificent trees overlooking our lake with seating arranged for your guests. Our 12-restroom building will ensure your guests aren’t waiting in long lines. The luxuriously decorated get-ready suite overlooks our lake, and beautiful wildflower meadows offer the perfect place to shoot wedding photos. Make use of our iconic Cinderella carriage, which is a truly unique and beautiful addition to your big entrance. Services Offered We work to ensure sure your wedding day goes off without a hitch. We work with you and your chosen vendors to make the event successful and reflective of your vision. With adaptable and accommodating service, we are there to provide everything to make your perfect day a reality. We can set up chairs and tables with flatware, china, and glasses as required for your occasion. Our facility also offers catering and bar services customized to your tastes and preferences. There is abundant parking, and we offer valet parking as well. Consider Scars Farm to celebrate your love in an elegant, peaceful paradise. Our Venue Our Venue Our picturesque venue and grounds aim to bring the rustic charm and romance of our rural setting together with modern amenities and convenience. The event space here at Scars Farm offers four different outdoor and indoor ceremony sites, as well as 5,000 square feet of indoor reception area with a dance floor. There’s also a 3,400 square foot open barn, a rustic bar, a fire pit, and on-site parking for added convenience. Learn More Wedding Events Wedding Events Discover why Scars Farm is the perfect place to host your wedding! Our Full-Service Wedding Package is full of amenities and services, giving you the freedom to design the perfect day for you and your guests without any extra stress. Learn More Private Events Private Events Are you planning a corporate event and longing for a change of scenery away from the home office? Look no further than Scars Farm! Our venue has plenty of outdoor space for your team to gather, ideal for stress-relieving micro retreats, team-building activities, and more. Plus, you’ll be captivated by the beautiful views of the Tampa and Orlando area and mesmerized by the stunning sunsets. Book a visit to Scars Farm today and experience the benefits of a break from your office. Learn More Corporate Events Corporate Events Are you looking to celebrate a milestone in your life or that of a loved one? Are you in need of an ideal location for a corporate retreat or a charity event? Then consider Scars Farm for your special occasion! Whether you’re planning an extravagant 40th birthday celebration, your child’s graduation party, a family friend’s daughter’s engagement, or even an elopement, we offer the perfect space for your festivities. Learn More Newsletter Get Newsletter Email Subscribe Now Lets Celebrate Your Love Contact Us Now Scars Events Icon-facebook Instagram Information Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Contact contact@scarsfarm.com 863-537-6590 833-941-0989 777 ALTURAS RD, BARTOW, FL 33830 Gallery © 2022 Scars Farm. All Rights Reserved. Design by Jabstract Web Design The Basics 54+ acres of private land 9,000 sq ft modern and rustic farm venue Five climate controlled buildings Mutiple indoor and outdoor ceremony options Bridal suite overlooking lake garfield Groom’s room and private outdoor area 12 restroom building 20,000 sq ft garden area Groom’s room and private outdoor area Cinderella horse carriage Wildflower meadows Vendor building with kitchen Strawberry pond and crossing palm trees Setup and teardown of chairs & tables Custom-built moveable bar Access to entire property for photos Personalized floor plan Chairs + tables 14 hour rentals on weekends (12 hours Monday – Thursday) Facebook Twitter Skype Whatsapp Envelope Tripadvisor Book A Tour Scars Farm is a wedding venue located in Bartow, Florida. It’s an idyllic 54-acre site that offers a large strawberry-shaped pond lined with palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Barbecue or caviar, this venue has it all. Our main website is still in development. If you have any questions at all, please fill out the form below and we’ll be in touch! Name Email Phone Message Send Feedback Request We are very sorry that we did not meet your expectations… We strive for no less than 5 stars and this is not something that we take lightly. We genuinely stand behind our product. Please let us know where you felt we dropped the ball and we’ll get in touch with you soon to discuss. We’re very sorry and look forward to speaking with you."
    },
    {
      "url": "https://sparkeventgroup.com/services/event-workforce/",
      "text": "Event Staff | Event Workforce Solutions | Spark Event Group Skip to content Home Workforce Management VIPeople Jobs Volunteers About The Team News Contact us Spark Workforce Management Spark is the leading supplier of event workforce management solutions in Australia, working across the biggest events, with the largest agencies and brands. We provide motivated experienced event staff across Australia – we call them Workforcers – for events in all shapes and sizes. We believe workforce management is important, which is why we personally screen every staff member in order to provide event staff who put their best foot and brightest smile forward. Most importantly, that translates to success at your event. At Spark, we have over 40 years combined experience solely in workforce management, allowing us to hand-pick and recommend the motivated and passionate event staffers you seek. It also means we know our staff back to front, so we can supply just the right fit for your need. Let us Staff Your Event WORKFORCE MANAGEMENT SERVICES At Spark, we provide workforce solutions to assist you with: + staff planning and scheduling + recruitment and selection + time and attendance management + performance management + staffing analytics and much more… Extensive Database Active Event Staff Events Per Year Managers & Supervisors Social Distancing Ambassadors Labour & Crew Senior Event Professionals Patron Services Activation & Merchandise Hospitality Technical & Ticketed SPARK EVENT WORKFORCE CASE STUDIES Australian Open Customer service Ticketing Ushering Labour Up to 500 staff per day 14 days. 18,000+ hours worked Find out more about the Australian Open here Formula 1 Grand Prix Wide-ranging workforce 320+ staff per day 12,000+ hours worked 5 weeks on-site Large scale Logistically challenging Find out more about the Formula 1 Australian Grand Prix here TLA Australia Multiple events annually Cricket AFL Football Brand Activations Find out more about the TLA Australia Events here University of Melbourne Multiple events annually Commencement Ceremonies Graduation Ceremonies Find out more about the University of Melbourne Graduation Events here Download our Portfolio WHAT OUR CLIENTS SAY “Having an experienced crew with a can do attitude was so helpful and allowed my team to get through the days without feeling smashed and confident that your team had our backs. From the set up crew working on a hot and windy day, the event staff managing zones in places they were unfamiliar with, to the bump out crew supporting the team when we could barely speak, you were all great.” City of Whittlesea – Community Festival “I just wanted to extend my thanks to you for a fantastic day. The team were great. I received lots of feedback that your team were super helpful and friendly, which helped us raise $275,000 which is an amazing result. Thank you again for all your support.” RULE Prostate Cancer – E.J Whitten Grand Final Legends Lunch “Super Round was a great success! The Spark Staff did a fantastic job and were very popular with the crowd across the 3 days. They were very reliable, always on time and very easy to trust them with tasks. Looking forward to working together in the near future.” TEG Live – Super Round “All the staff were terrific. They completed all tasks with such efficiency and diligence. The event was a great success so thank you for giving us such a great team.” RMIT & Metro Tunnel Project – NOLA Block Party “Thank you to you and all of the contracted staff who worked Craigieburn Festival last Saturday. We had a record crowd of around 20,000 throughout the day and such great feedback. Every one of the Spark Staff were amazing!” Hume City Council – Craigieburn Festival “The Adelaide Spark Staff tonight were one of the best staffs we’ve had during our Australia run. Thank you, really appreciate it.” Yondr – Chris Rock Tour “Your team were fantastic!!  They all slotted into the hosting roles effortlessly and were an integral part of the customer experience.” TEG Live – Kambosos Jr v Haney (Boxing) – Marvel Stadium “A big thank you for your help in sourcing and providing four staff for us at yesterday’s event. They were all EXCELLENT and couldn’t recommend them highly enough. The were professional, efficient, hard working, friendly and a delight to work with. “ Fetching Events – Endeavour College of Natural Health Graduation “Thank you for helping to make the Hume Christmas Carols a great success! The team and professional staff at Spark are always great to work with and we appreciate you all coming on board. We had approximately 10,000 patrons attend throughout the evening with our stage production one of the best yet. Thank you for being part of it.” Hume City Council – Christmas Carols Get in Touch WE ARE THE TECH LEADERS We align people resource with world-leading digital answers. Through sister company Rosterfy we provide the technology behind complicated personnel supply needs. It’s a system acclaimed at the likes of US Superbowl, London Marathon, Cricket World Cup. FAQs How can Spark Event Group help me with event staff for my event? Spark is the leading supplier of event workforce solutions in Australia, working across the biggest events, with the largest agencies and brands. We provide motivated experienced event staff for events in all shapes and sizes. At Spark, we know our staff back to front, so we can supply just the right fit for your need. What event staff can Spark Event Group provide? At Spark, we provide workforce solutions to assist you with: + staff planning and scheduling + recruitment and selection + recruitment and selection + time and attendance management + performance management + staffing analytics and much more… How can I apply for event work with Spark Event Group? Head to our opportunities page to apply within your state. Alternatively, email the Workforce Team at hello@sparkeventgroup.com . If you are already a Spark workforcer, login to your Rosterfy portal Rosterfy portal to see all upcoming opportunities available. How do I download more information on your Event Workforce company? With offices in Sydney and Melbourne, Spark Event Group is your go-to event workforce company. Download our portfolio here for more information on how we can assist you with staffing your next event. LET US HELP Want to find out how we can help with your event staffing? Fill out the form and one of our team members will promptly respond to you. Specialised Experienced Motivated sparkeventgroup And that’s a wrap on MotoGP 2024 🏁 Cheers to 5 amazing years! 🎉✨ last week we ce And that’s a wrap on Melbourne University’s Au What a day for a site visit, see you in October… Load More Follow on Instagram workforce Login Contact your new world of event organisation Spark Event Group info@sparkeventgroup.com Privacy Policy Copyright 2025 © Home Workforce Management VIPeople Jobs Volunteers About The Team News Contact us WooCommerce not Found Newsletter Home Workforce Management VIPeople Jobs Volunteers About The Team News Contact us"
    },
    {
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10656807/",
      "text": "‘Scars: How Our Wounds Make Us Who We Are’: Improving appearance-based stigma, conceptualisation of beauty and body esteem through a documentary - PMC Skip to main content An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official\n                            government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely\n                                connected to the .gov website. Share sensitive\n                                information only on official, secure websites. Search Log in Dashboard Publications Account settings Log out Search… Search NCBI Primary site navigation Search Logged in as: Dashboard Publications Account settings Log in Search PMC Full-Text Archive Search in PMC Journal List User Guide PERMALINK Copy As a library, NLM provides access to scientific literature. Inclusion in an NLM database does not imply endorsement of, or agreement with,\n    the contents by NLM or the National Institutes of Health. Learn more: PMC Disclaimer | PMC Copyright Notice Scars Burn Heal . 2023 Nov 16;9:20595131231205398. doi: 10.1177/20595131231205398 Search in PMC Search in PubMed View in NLM Catalog Add to search ‘ Scars: How Our Wounds Make Us Who We Are’ : Improving appearance-based stigma, conceptualisation of beauty and body esteem through a documentary Abigail Mathews Abigail Mathews 1 The Centre for Appearance Research, University of the West of England, Bristol, UK Find articles by Abigail Mathews 1, ✉ , Bruna Costa Bruna Costa 1 The Centre for Appearance Research, University of the West of England, Bristol, UK Find articles by Bruna Costa 1 , Aida Mikkola Aida Mikkola 1 The Centre for Appearance Research, University of the West of England, Bristol, UK Find articles by Aida Mikkola 1 , Diana Harcourt Diana Harcourt 1 The Centre for Appearance Research, University of the West of England, Bristol, UK Find articles by Diana Harcourt 1 Author information Article notes Copyright and License information 1 The Centre for Appearance Research, University of the West of England, Bristol, UK ✉ Abigail Mathews, Centre for Appearance Research, Frenchay Campus, Coldharbour Lane, University of the West of England, Bristol BS16 1QY, UK. \nEmail: abbi.mathews@uwe.ac.uk Collection date 2023 Jan-Dec. © The Author(s) 2023 This article is distributed under the terms of the Creative Commons Attribution 4.0 License ( https://creativecommons.org/licenses/by/4.0/ ) which permits any use, reproduction and distribution of the work without further permission provided the original work is attributed as specified on the SAGE and Open Access page ( https://us.sagepub.com/en-us/nam/open-access-at-sage ). PMC Copyright notice PMCID: PMC10656807  PMID: 38022894 Abstract Introduction Those with an altered appearance as a result of injury, health condition or treatment can face stigma, which may contribute to adverse psychosocial outcomes. However, current research tends to focus on supporting individuals themselves to cope, rather than targeting societal stigma. This study aimed to reduce societal stigma towards this group, through the use of a documentary about people with scars. Methods 146 adults completed questionnaires before and after viewing the documentary. Results After viewing, participants had reduced self-reported intentions to behave in a stigmatising way towards those with visible differences, broader conceptualisation of beauty, and more positive body-esteem. Qualitative data also suggested further positive impacts. Conclusion Those with visible differences (for example scars) are subject to societal stigmatisation which perpetuates psychological and social problems. Therefore, alleviating social stigma through the media, as demonstrated through the documentary in this study, may improve the lives of those living with visible differences. Lay Summary People with an altered appearance or scars as a result of injury, health condition or treatment can face stigma, which may contribute to harmful psychological and social outcomes. However, current research tends to focus on supporting affected individuals themselves to cope, rather than targeting societal stigma. This study aimed to find out whether a documentary about people with scars was successful at reducing viewers’ stigma towards this group. A group of 146 adults completed questionnaires before and after viewing the documentary. After viewing, questionnaires indicated that participants had reduced intentions to behave in a stigmatising way towards those with visible differences. Furthermore, they also viewed a broader range of appearances as beautiful and felt more positive about their own bodies. Comments and feedback from participants also suggested further positive impacts. Those with visible differences (for example scars) are subject to societal stigmatisation which can cause and worsen mental health problems. Therefore, alleviating social stigma through the media, as demonstrated through the documentary in this study, may improve the lives of those living with visible differences. Keywords: Visible difference, scars, stigma, appearance, intervention, media Introduction The term ‘visible difference’ refers to an appearance that is notably different to the ‘norm’, typically as a result of injury or congenital or acquired health conditions, and includes scarring of any sort. 1 As ‘visible difference’ can be difficult to define, estimates of the number of individuals living with a visible difference range between 2% and 20% of the UK population. 2 , 3 Having a visible difference can have an adverse psychosocial impact for some affected, including depression, poor body image, low self-esteem, social isolation and a poorer quality of life. 1 , 4 – 6 This may be because those who look ‘different’ can experience negative social encounters, including unwanted questions, staring, unkind comments, discrimination in different contexts (including in school and the workplace), and general societal stigmatisation. 7 , 8 One explanation for this stigma is intergroup anxiety, 9 whereby those with visible differences are seen as part of an ‘outgroup’ and are consequently avoided by those without. This may be due to evolutionary explanations, for example disease avoidance, whereby avoidance is activated through visibly perceiving signs that connote disease, though these are often inaccurate, especially in modern society. 10 Another cause of this anxiety may be the learning of negative stereotypes, which are perpetuated through media depictions of those with differences. 11 – 13 Intergroup anxiety can be overcome through many components, two of which are knowledge about the outgroup and contact with those in it. 9 Therefore, providing education and a means of contact with the outgroup allows for individuals to readjust negative assumptions about those with differences, potentially reducing stigma against them. Despite this, most interventions in the field of visible difference centre around supporting the individuals themselves to better cope with challenges, 6 , 14 rather than challenging and changing the societal attitudes that cause stigma. The role of the media The media is a key source of appearance-based messaging, and thus a prominent way in which appearance-based norms and ideals are communicated. 15 Appearance-based norms and ideals refer to societal pressures that govern the way individuals feel they should look. For example, in the UK, women experience pressure to be slim, whilst the ‘desired’ for men is to be lean and muscular. 16 Television, movies, magazines, and social media are all significant in relation to communicating appearance-based norms and ideals in the general population. 17 Exposure to media depictions of appearance norms and ideals may contribute towards appearance dissatisfaction. 18 , 19 Problematically, this has been associated with adverse health and psychosocial outcomes including disordered eating, smoking, and drinking, decreased physical activity, 20 , 21 poorer academic performance, 22 and depression and low self-esteem. 23 In addition to the appearance-related pressures facing the general population, those who have a visible difference often face additional challenges which can be exacerbated by the media. People with visible differences are rarely represented in the media, 11 meaning there is limited visibility and normalisation of difference. Furthermore, existing media portrayals of visible difference often reinforce incorrect assumptions and negative attitudes. 12 For example, visible differences such as scarring are often used in film and television as a reason for a character to be bitter, evil or a victim. 12 , 13 There is a need for easily and widely accessible interventions aiming to promote understanding and acceptance of appearance diversity. Such interventions may work to reduce stigma and thus improve the experience of those living with, and affected by, visible differences. The media may be a particularly powerful avenue for these, due to its ability to increase the visibility of differences and thus work to normalise them. 12 The efficacy of media interventions at promoting acceptance of appearance diversity To date, various media campaigns, including on TV and social media, have aimed to promote the acceptance of appearance diversity including visible differences. 13 However, until now, the impact of these campaigns on people's attitudes towards their own and others’ appearance has rarely been evaluated. Although this recently emerging area of research is currently limited, available results are promising. Social media messages combining educational elements in conjunction with positive imagery of people with an appearance-altering condition (vitiligo) have been shown to be effective at reducing unaffected participants’ stigma towards differences. 24 Stone and Fisher used indirect contact through audio and video personal narrative clips of people with facial differences and found participants had more positive assumptions of the target individuals’ personal and social skills after viewing either type of content. 25 The efficacy of media interventions at promoting appearance-related satisfaction In addition to reducing social stigma and improving the social experiences of people with visible differences, media interventions aimed at promoting acceptance of appearance diversity may also have a beneficial impact on how members of the general public who do not have visible differences/an altered appearance feel about their own looks. Recently, media such as film and games including more diverse appearances in terms of weight and body shape, have shown efficacy at improving body satisfaction (how an individual feels towards their body's appearance), appearance-ideal internalisation (the extent to which an individual subscribes to socially defined ideals of appearance), and negative affect (adverse feelings). 26 , 27 Further, global advertising campaigns are increasingly including people with a greater range of appearance diversity, with recent research suggesting they can be effective in improving self-esteem and positive affect in the general population. 28 Aims This paper reports a study that aimed to evaluate the impact that watching a documentary about people with scars had on viewers’ intentions to behave in a stigmatising way towards those who look different, and their evaluations of their own appearance. In addition, the paper also aimed to consider whether low-level interventions such as this are a viable option for promoting acceptance of appearance diversity in society. Hypotheses H1. After viewing the documentary, participants’ intentions to act in a stigmatising way towards those who look different will decrease. H2. After watching the documentary, participants will have a broader conceptualisation of beauty. H3. After watching the documentary, participants’ body esteem will increase. Method The documentary ‘Scars: How Our Wounds Make Us Who We Are’ (referred to from hereon as ‘Scars’) is a 20-min documentary-style film which follows the personal stories of five adults with scars. It showcases each individual's story about their scarring, exploring their lived experience through personal narratives. The documentary was published in April 2020 and is freely available online [ https://www.youtube.com/watch?v=d03vGv5K8qw&t=2s ]. The research team had no input in creating the documentary. Further information about the adults seen in ‘Scars’ can be found in Table 1 . Table 1. Descriptions of individuals featured in the ‘Scars’ documentary. Name Gender Position of scar on body Cause of scar Pete Male Hand Congenital condition Christina Female Upper arm, covered by tattoo. Domestic abuse/violence Helen Female Forearms Self-harm Cordelia Female Scalp Brain tumour surgery Simon Male Across face and one eye Military conflict Open in a new tab Within the documentary, the individuals reflect upon their experiences with others, such as positive reactions from friends and family, the impact of their scars in their personal relationships, and the reactions, impressions and assumptions from other people. Furthermore, their stories relate to overcoming adversity and include messages of strength and bravery, for example that the scar is symbolic of winning a battle. Finally, the individuals each signify their scars are now a part of who they are and tell true stories about a person. Woven into their stories, contributors tell the viewer how their scars were acquired and the impact they have had on their lives, using close-up imagery of the scars themselves. Furthermore, the documentary works to humanise the contributors and their scars by providing opportunities for the viewer to connect and relate on a personal level, for example through discussing familial and romantic relationships, friendships, hobbies, employment, confidence, and self-esteem. The discussion of these topics is coupled with everyday life shots, for example of an individual gardening or spending time with their children. Further, the five individuals are varied in terms of ethnicity, gender, age-range, and type of scarring, which arguably offers more opportunities for a range of audiences to relate. Design This study was carried out with two cohorts of adults: a general population sample (cohort 1) and a larger student sample (cohort 2). Institutional ethical approval was obtained from the Faculty Research Ethics Committee at the University of the West of England. A pre-/post- design was selected to assess the impact of watching the documentary. Online surveys were designed to capture outcomes. The pre-documentary surveys included demographic information and standardised outcome measures (detailed below), before directing participants to watch the full documentary. Immediately after watching ‘Scars’, respondents were asked to complete the standardised outcome measures again, as well as provide additional feedback specifically related to the film. This study was run with two cohorts. In the first cohort, participants watched an online livestream of the documentary. In the second, participants were directed to watch the film online. In addition to the survey, online data related to the documentary (including comments and other web analytics) were also collated and analysed in order to assess the broader public's reactions to ‘Scars’. Survey outcome measures Outcome measures were chosen to assess respondents’ intention to engage in stigmatising behaviour towards those with a visible difference, as well as the ways respondents evaluated their own appearance and appearance more generally (including other people's appearance). The following well-established standardised measures were used: Stigmatising behaviour. An adapted version of the Perceived Stigmatisation Questionnaire (PSQ) 29 was used to evaluate respondents’ intention to act in a stigmatising way towards those with visible differences. Participants were asked to respond in relation to someone with a visible difference or scar, for example “I would avoid looking at them”. Items are rated on a 5-point Likert scale (1 = never, 5 = always), and a higher score indicates higher levels of intention to engage in stigmatising behaviours. Conceptualisation of beauty. Seven items from the 9-item version of the Broad Conceptualisation of Beauty Scale (BCBS) 30 were used to assess how respondents conceptualise beauty. Questions were adapted to not focus solely on women and body shape/size. Items such as “Even if a physical feature is not considered attractive by others or by society, I think that it can be beautiful” are rated on 7-point Likert scale (1 = strongly disagree, 7 = strongly agree). Higher scores indicate a greater ability to broadly conceptualise beauty. Body esteem. The appearance subscale of the Body Esteem Scale for Adolescents and Adults (BES-AA) 31 was used to evaluate respondents’ subjective satisfaction with their own appearance. It consists of 10 items, such as “I worry about the way I look”. Items are rated on a 5-point Likert scale (0 = never, 4 = always). Negative items are reverse scored, and a higher score indicates higher body esteem. Online data Data was extracted from publicly available platforms including YouTube, Vimeo, Twitter, Instagram, Facebook, The Guardian newspaper's webpages, and Reddit. A search using the title of the documentary ( Scars: How Our Wounds Make Us Who We Are ) was conducted in August 2020, four months after the documentary's release in April 2020. Data extracted included the number of times the documentary was watched, liked and shared, and social media comments were collated. A content analysis was conducted on the comments in order to evaluate how the documentary was received by the public beyond the participants within this study. Recruitment Cohort 1 (C1). The study was first advertised to the general public, predominantly through relevant social media and other online platforms (e.g., the University of the West of England and research centre, and UK charitable organisations that work to support people affected by visible difference) from April 2020 to July 2020. Cohort 2 (C2). The study was then advertised to a student sample, on the University of the West of England Undergraduate Psychology Student Participant Pool in February 2021. Students were given course credits for taking part. Participants C1. A total of 43 people from the general population responded to the online survey. Most were female (75.4%, n = 32), 10 (23.3%) were male and one respondent did not report their gender (2.3%). Participants had a mean age of 38.72 (SD = 14.49), ranging from 17–70 years. Most respondents (86.0%, n = 37) indicated that they, or someone they knew had a visible difference or scar. Of these, 36 reported having a scar themselves. Further information can be found in Table 2 . Table 2. Causes of scarring amongst participants. C1 n (%) C2 n (%) Participants who reported having a visible difference or scar 36 (83.72%) 56 (54.36%) Reason for scarring Medical treatment or surgery 9 (25%) 8 (14.29%) Injury, including stabbing, dog attack, burns or accident 4 (11.1%) 11 (19.64) Self-harm 4 (11.1%) 3 (5.36%) Congenital, including cleft lip and/or palate 3 (8.3%) 3 (5.36%) Circumcision 1 (2.8%) 0 (0%) Eczema 0 (0%) 1 (1.79%) Multiple causes 5 (11.1%) 8 (14.29%) Did not disclose 10 (27.8%) 22 (39.29) Open in a new tab C2. A total of 103 undergraduate students responded to the online survey, 80 female (77.7%); 23 male (22.3%). Participants had a mean age of 22.68 (SD = 0.73), ranging from 16–60 years. When asked whether they, or someone they knew had a visible difference or a scar, most respondents (69.9%, n = 72) said ‘yes’. Of these, 56 reported having a scar themselves. Further information can be found in Table 2 . Analyses Paired samples t-tests compared sample mean scores on stigamatising behaviour (PSQ), conceptualisation of beauty (BCBS) and body esteem (BES-AA), at time 1 (pre-documentary) and time 2 (post-documentary), for both the general population cohort (C1) and student cohort (C2). Qualitative data (including that extracted from the surveys and the comments extracted from online platforms) were analysed by the second and third authors, BC and AM, using inductive content analysis. 32 The data were read multiple times and a preliminary set of frequently occurring themes (codes) were identified and then applied to the full data. All codes were compared between researchers until agreement was reached. Frequency counts and example quotes were selected to demonstrate each code. Results Outcome measures Stigmatising Behaviour. In both cohorts there was a significant difference between PSQ scores at time 1 and time 2: C1 time 1 (M = 1.86, SD = 0.532) and time 2 (M = 1.73, SD = 0.650); t(42) = 2.331, P = 0.025; C2 time 1 (M = 1.71, SD = 0.466) and time 2 (M = 1.50, SD = 0.415); t(102) = 7.515, P ≤ 0.001. Therefore, in both C1 and C2, respondents’ intentions to act in a stigmatising way towards those with visible differences reduced after watching the Scars documentary, supporting H1. Conceptualisation of Beauty. BCBS scores at time 1 (M = 5.83, SD, 1.103) and time 2 (M = 6.01, SD = 1.134) were found to be significantly different in C1; t(42) = −2.344, P = 0.024. Similarly, in C2, BCBS scores at time 1 (M = 6.15, SD, 0.780) were significantly different to those at time 2 (M = 6.40, SD = 0.693); t(102) = −5.006, P ≤ 0.001. In support of H2, in both C1 and C2 respondents’ ability to more broadly conceptualise beauty increased after watching the Scars documentary. Body Esteem. In C1, participants’ body esteem scores (BES-AA) at time 1 (pre-documentary) (M = 2.08, SD = 0.926) were significantly different to those at time 2 (post) (M = 2.29, SD = 0.810); t(42) = −3.791, P ≤ 0.001. In C2, there was also a significant difference between the BES-AA scores at time 1 (M = 1.81, SD = 0.782) and time 2 (M = 2.39, SD = 0.504); t(102) = −13.078, P ≤ 0.001. In both C1 and C2, respondents’ body esteem scores were more favourable after watching the ‘Scars’ documentary, supporting H3. Other data When asked whether they felt that watching the documentary changed their beliefs about or attitudes and/or reactions to scars, 36.3% ( n = 15) of respondents in C1 and 55.3% ( n = 57) of respondents in C2 said ‘yes’. In both C1 and C2, at time 2 (post-documentary), respondents were asked further questions about the documentary. Table 3 provides a full overview of codes and exemplar quotes. Respondents who indicated that the documentary changed their beliefs, attitudes and/or reactions to scars reported various positive impacts of watching the documentary, which included increased acceptance of self and others, and positive comments about those featured in the film. Those who indicated that it did not change their beliefs, attitudes and/or reactions to scars cited already having positive views prior to seeing the film. Table 3. Survey comments and themes. Theme Exemplar Quotes C1 N (%) C2 N (%) Question: Do you feel that watching the documentary changed your beliefs, reactions and/or attitude(s) to scars? Total: 41 Total: 100 Positive impact – more accepting of self “More accepting of myself” “Kind of, slightly it definitely moved me towards the more positive / acceptance side” 3 (7.32%) 6 (6%) Positive impact – hopes to achieve greater confidence/acceptance “I really appreciated everyone's level of self-confidence… hope that one day I can be like that with my appearance, as well.” “It made me question my acceptance of my own scars and how I could reframe my experience” 3 (7.32%) 1 (1%) Positive impact – thinking about scars differently “I realise that having scars does not prevent your job prospects” “It made me think about the story behind the scar” 2 (4.88%) 34 (34%) Positive comments about people in the documentary “I was encouraged by the people in film and how they were still optimistic and confident…” 2 (4.88%) 4 (4%) No impact/change – existing knowledge and attitudes/beliefs “I was already pretty familiar with similar stories so watching the film didn't change much.” “it confirmed them” “No - I think I already had quite ‘positive'/holistic beliefs about scars.” 14 (34.15%) 26 (26%) Question: Do you feel that art mediums, such as films, are a good way to increase awareness and acceptance of appearance diversity? Total: 40 Total: 102 Importance of representation “The more often you see diversity in the media, the more ‘normal’ and accepted it becomes and the easier it is to not see it as different in a negative light.” 5 (12.5%) 25 (24.5%) Power of the media (using it for good) “It normalizes our differences in context” 2 (5%) 21 (20.59%) Media can educate “Yes, because many people have no experience of these things and it’s a way of spreading knowledge and understanding” “They improve understanding and acceptance” “Yes I feel we could learn more using this method” 9 (22.5%) 7 (6.86%) Benefits of art “Art connects and heals us as human beings.” “People are more likely to think about them and be wiling to watch them.” “Good way of getting someone's emotions across” 6 (15%) 13 (12.75%) Other art mediums “…I don't have the patience to sit through media such as films/ videos unless I have to. I think other art forms would be a better viewing medium for me.” 2 (5%) 0 (0%) Benefit of stories “Yes. I like to hear voices and see images of experience. For me, having the person tell their story helps me to connect with them and understand more about them.” “Seeing people with diverse appearance talking about their experience helps people to relate and empathise” 7 (17.5%) 14 (13.73%) Open in a new tab Note: Answers extracted from a free text-box response, ‘Please explain your answer’. Most respondents (C1 n = 39; 90.7%; C2 n = 101; 98.1%) agreed that art mediums, such as films, are a good way to increase acceptance of appearance diversity. Cited reasons included the importance of media representation, the power of the media to normalise difference and educate, the ability for the media to be engaging and emotionally powerful, and the benefit of personal stories. Web analytics and online comments In July 2020, the documentary had been viewed 62,436 times (YouTube and Vimeo) and generated a total of 53 posts through Instagram ( n = 9), Facebook ( n = 12), Twitter ( n = 29), and Reddit ( n = 3). These posts and views received 2566 likes and 248 shares. Twitter accounted for more than half of these posts (52.72%) and nearly half of the shares (49.20%). Most likes were found on YouTube (29.54%) and Instagram (26.04%). Within these 53 posts there were 211 comments (YouTube (32.72%), Instagram (25.88%), Twitter (22.66%), Facebook (18.43%), Vimeo (2.30%)). The 211 comments were further divided into 258 individual quotes, and a total of 15 codes were created from them (see Table 4 ). These included compliments about the documentary, its filming and production, or the people in the documentary, expressions of gratitude for the documentary, sharing of personal life experiences, and suggesting that there is a need for similar documentaries. Table 4. Online comments. Codes Exemplar quotes n (%) of total quotes General compliments of the documentary “Just watched it - it's really gorgeous” “Beautiful film” 88 (34.11%) Compliments of the filming, editing, production and/or direction “Brilliant video, beautifully filmed and edited.” 5 (1.94%) Positive comments about the people in the documentary “Beautiful people” “I admire their courage” 33 (12.79%) Thankful for the documentary “What an excellent film thank you for making it” “We need more of this. Thank you.” 21 (8.14%) Sharing own experiences of scars “I have multiple scars on my body and each one comes with its own story…I don’t hide them because they are part of who I am.” 20 (7.75%) Sharing own experience of life more generally “I can feel it . . I have gone through all of this. For people you are just a joke kinda pointless.” 9 (3.49%) Need for similar documentaries and further discussion on related topics “Could have done with more things like this as a child growing up with extensive scarring, and especially as a teenager” 5 (1.94%) General comments about scars “Scars tell stories about what we’ve lived and who we are – or were. Some scars are visible; some are not.” “Scars tell us a lot deeper than just skin deep. It's the history of us making the best version of a person we are now” 15 (5.81%) Documentary looks interesting / must watch it “This looks very interesting” “Very cool. Want to watch this!” 11 (4.26%) Negative comments about the documentary “How about you get over it instead of writing an article about it?” 4 (1.55%) Open in a new tab Discussion The findings from this study suggest that a 20-min documentary, depicting the experiences of real people with real scars, had a beneficial impact on how people feel about their own appearance (body esteem), appearance in general (conceptualisation of beauty) and their views towards people with scars. Participants described how watching the documentary had made them more accepting of themselves, given them hope for becoming more self-confident, and prompted them to think about scars differently. They were positive towards media, like film, as a good way to increase acceptance of appearance diversity for many reasons, such as demonstrating representation, normalising difference, providing education, showcasing personal stories of real people, and doing so in a way that is engaging and emotionally powerful. Furthermore, qualitative data extracted from various online platforms showed mostly favourable comments about the documentary and people in it, suggesting that the general public (beyond those taking part in the study) found it acceptable and positive. Findings from the current study suggest that watching ‘Scars’ reduced intentions to engage in stigmatising behaviour towards those who look different and do not fit the societal beauty ‘norm’. However, a large proportion of participants in C1 and C2 (36.3% and 55.3% respectively) stated that the documentary did not change their attitudes or beliefs towards scars. Those who elaborated on their answer stated that this was because they already held positive attitudes. The significant improvement on the PSQ in both cohorts, even when many participants stated it did not change their views, may indicate that watching ‘Scars’ improved stigmatising attitudes even in those with previous unstigmatised perceptions. Alternatively, it may highlight differences between explicit and implicit stigma within these groups. Further, the outcome measures used in this study are more comprehensive than the questions asked in the feedback questionnaire, and so may be more sensitive to nuanced changes in attitudes and stigma. This supports previous work demonstrating the ability of media-based interventions to reduce stigma towards those with visible differences. 24 , 25 , 33 Given the possible social challenges that those with altered appearances may experience, 8 and the resulting negative impact on wellbeing, 1 our findings suggest that the development and promotion of destigmatising interventions (like ‘Scars’) is a worthwhile effort. Further, ‘Scars’ also led to viewers feeling better about themselves and their own appearance, as demonstrated by more positive body esteem results and qualitative feedback of the documentary. Traditional media often depicts ‘idealised’ appearances which, for most people, are unrepresentative and unattainable, expectantly resulting in feelings of body dissatisfaction. 34 , 35 Scholars have previously expressed the urgent need for interventions to improve body image and body confidence. 36 The current findings echo existing literature which demonstrate that exposure to diverse appearances in the media can have a positive impact on consumers’ feelings towards their own appearance, 26 , 27 possibly through minimising comparisons with others. 37 Specifically, similarly to previous research, 38 , 39 the current study found that exposure to diverse appearances (in the form of people with various types of scars), had a beneficial impact on body-esteem. Implications for practice Despite the long-documented ability of the media to cause body dissatisfaction, 18 , 19 and stigmatise those who look different, 12 this emerging area of research demonstrates the media as a potential tool to foster positive outcomes for both attitudes towards others and individuals’ own bodies. It is therefore important to consider both what makes a media intervention effective, and how to produce positive outcomes rather than causing harm. For example, previous research has demonstrated that although a documentary effectively reduced weight bias in viewers, 40 a reality television programme significantly increased it, 41 highlighting the importance of the messaging and context in which it is presented. Previous research suggests that both positive messages, and messages of overcoming adversity, are effective in reducing stigma towards others with visible differences. 25 The stories within ‘Scars’ are framed positively and demonstrate individuals overcoming adversity. Although there are negative messages within these stories (e.g., struggles with self-harm and domestic violence), the overarching message of the documentary remains largely positive, and each story ends on a positive note. In previous literature, it has been suggested that endings may leave the strongest impression due to a type of recency effect, 25 which may explain the current findings. It has been previously suggested that stigma occurs due to intergroup anxiety and that two methods of reducing intergroup anxiety are (1) providing contact with the outgroup and (2) providing education about the outgroup. 9 Providing indirect contact, for example through ‘Scars’, is suggested to avoid physiological stress that may be associated with direct contact with a stigmatised group. 25 , 42 ‘Scars’ provides first-person narratives, which evidence suggests may be particularly effective at reducing appearance-based prejudice and discrimination in general population interventions. 25 , 43 Further, ‘Scars’ educates viewers on the acquisition, management of and adjustment to various types of scars. Consistent with intergroup anxiety theory, previous research suggests that providing education about the target condition is an important aspect of reducing stigma towards those affected by it. 24 , 33 In summary, the ‘Scars’ documentary provides positive messaging, personal narratives, education and visual exposure of scars, all of which may have contributed to the favourable findings. However, our study could not pinpoint which individual or combined elements led to the positive effect of the documentary. As such, further research is needed to better understand which elements of media-based interventions aimed at increasing acceptance of appearance diversity are most important for efficacy. Beyond the content of the documentary, it would also be beneficial to learn how to fine-tune technical aspects of such interventions to maximise effectiveness. For example, the length of the video could be significant. A documentary similar in length to ‘Scars’ was found to effectively reduce weight bias in viewers. 40 However, Stone and Fisher found that much shorter exposure (2two-minute narratives via audio or video) significantly increased positive personality assumptions and feelings about possible future interactions with people with facial differences. 25 Alternatively, it may be the case that shorter clips with repeated exposure may be more effective. 24 Conversely, it should also be examined whether it is possible to overexpose individuals to this interventional content. Future research should aim to determine which elements make these interventions effective, the optimum exposure needed to generate positive change and conduct follow-ups to determine the longevity of positive effects. Limitations It is possible that people who chose to take part, particularly in C1, were already interested in the topic of visible difference and scarring, meaning they may not be representative of the broader population. Indeed, in C1, most respondents reported having a visible difference or scar (83.72%). However, the documentary had a similarly positive effect in C2, where considerably less participants reported having a visible difference or scar (54.36%). Describing scarring as a visible difference in this study may have encouraged a higher proportion of participants to self-identify as having a visible difference than would ordinarily be the case, meaning that the percentage of those with visible differences in our sample is likely to be a liberal estimate. Further, in addition to participants having visible differences and/or scars themselves, it is arguable that individuals who sign up to research on a voluntary basis may differ in terms of personality characteristics, motivations and beliefs which resultingly generate more favourable responses within psychological research studies than may be seen in the general population. 44 , 45 Nevertheless, the authors propose that the significant pre- and post- differences found in both samples is promising. It is important to note that the current study relied on self-report, which could have raised issues of demand characteristics and social desirability. 46 Participants may have understood the intention of the study (pre- and post- assessment with ‘Scars’ being the stimuli) and provided responses which they felt would be viewed favourably by others. In addition, the adapted version of the PSQ was used to evaluate respondents’ intention to act in a stigmatising way towards those with visible differences, and not their actual behaviour . Whilst this relationship is not definitive and there are questions about the intention-behaviour link, behavioural science generally shows a strong association, 47 and outgroup attitudes regarding future contact have been previously found to relate to actual contact. 48 Despite these limitations, these findings are still helpful and promising with regards to informing the development of media-based interventions to promote acceptance of appearance diversity amongst the general population. More research is needed to better understand what aspects of such interventions result in efficacy. Furthermore, future research should use follow-ups in order to assess the long-term impact of such interventions. Additionally, work with other audiences and in different contexts is warranted. For example, it would be helpful to examine whether ‘Scars’ would be effective with young people in a school setting, since research suggests media interventions may be less effective in this population. 49 Conclusions While the media can have a negative impact on individuals’ appearance satisfaction and stigma towards those who look different, it can also be used as a means to normalise, educate, and destigmatise. The present study addresses an important gap in the literature and demonstrates the effectiveness of a low-level intervention aiming to promote understanding and acceptance of appearance diversity. Watching ‘Scars’ led to participants feeling more positive about their own looks, whilst also viewing those with visible differences more favourably. This in turn may contribute to a reduction in stigma (and stigmatising behaviour), and fewer social challenges for those living with, and affected by, visible differences. Acknowledgements We would like to thank the participants in this study and the people who shared their stories in the ‘Scars’ documentary. ‘Scars’ was directed by Laura Dodsworth and Rebecca Lloyd Evans. It is a Tigerlily Production for the Guardian. Footnotes Author note: In light of the importance of our identities and their impact on our research, we wish to provide information regarding the authors’ backgrounds. All four authors self-identify as white women. They have previous experience of researching issues related to altered appearance, including scarring. Some of the authors have scars, most of which are not usually visible to other people. The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Funding: The authors disclosed receipt of the following financial support for the research, authorship, and/or publication of this article: This work was supported by the VTCT Foundation. ORCID iD: Abigail Mathews https://orcid.org/0000-0002-7399-9383 How to cite this article Mathews A, Costa B, Mikkola A, and Harcourt D. ‘Scars: How Our Wounds Make Us Who We Are’: Improving appearance-based stigma, conceptualisation of beauty and body esteem through a documentary. Scars, Burns & Healing , Volume 9, 2023. DOI: 10.1177/20595131231205398 . References 1. Rumsey N, Harcourt D. Who is affected by appearance concerns, in what way, and why? Overview. In: Rumsey N, Harcourt D. (eds) Oxford Handbook of the Psychology of Appearance. Oxford, UK: Oxford University Press, 2012, pp.117–120. [ Google Scholar ] 2. Changing Faces. Disfigurement facts for the media. Changing Faces , https://www.changingfaces.org.uk/for-the-media/facts-figures/ (2023, accessed 17 July 2023). 3. Changing Faces. Disfigurement in the UK, https://www.changingfaces.org.uk/campaign/dituk (2017, accessed 1 February 2023). 4. Rumsey N, Harcourt D. Body image and disfigurement: issues and interventions. Body Image\n2004; 1: 83–97. [ DOI ] [ PubMed ] [ Google Scholar ] 5. Clarke A. Psychosocial aspects of facial disfigurement: problems, management and the role of a lay-led organization. Psychol Health Med\n1999; 4: 127–142. [ Google Scholar ] 6. Norman A, Moss TP. Psychosocial interventions for adults with visible differences: a systematic review. PeerJ\n2015; 3: e870. [ DOI ] [ PMC free article ] [ PubMed ] [ Google Scholar ] 7. Stone A, Wright T. Evaluations of people depicted with facial disfigurement compared to those with mobility impairment. Basic Appl Soc Psych\n2012; 34: 212–225. [ Google Scholar ] 8. Thompson A, Kent G. Adjusting to disfigurement: processes involved in dealing with being visibly different. Clin Psychol Rev\n2001; 21: 663–682. [ DOI ] [ PubMed ] [ Google Scholar ] 9. Stephan WG. Intergroup anxiety: theory, research, and practice. Pers Soc Psychol Rev\n2014; 18: 239–255. [ DOI ] [ PubMed ] [ Google Scholar ] 10. Oaten M, Stevenson RJ, Case TI. Disease avoidance as a functional basis for stigmatization. Philos Trans R Soc Lond B Biol Sci\n2011; 366: 3433–3452. [ DOI ] [ PMC free article ] [ PubMed ] [ Google Scholar ] 11. Wardle C, Boyce T. Media coverage and audience reception of people with disfigurement or visible loss of function . The Healing Foundation, 2009. 12. Johanssen J, Garrisi D. “I Am Burning, I Am Burning”: affect, acid attacks and British tabloid newspapers. J Stud\n2019; 20: 463–479. [ Google Scholar ] 13. Changing Faces.\nI am not your villain | Representing disfigurements in film, https://www.changingfaces.org.uk/get-involved/campaign-with-us/i-am-not-your-villian/ (accessed 3 May 2023). 14. Jenkinson E, Williamson H, Byron-Daniel J, et al. \nSystematic review: psychosocial interventions for children and young people with visible differences resulting from appearance altering conditions, injury, or treatment effects. J Pediatr Psychol\n2015; 40: 1017–1033. [ DOI ] [ PubMed ] [ Google Scholar ] 15. Holland G, Tiggemann M. A systematic review of the impact of the use of social networking sites on body image and disordered eating outcomes. Body Image\n2016; 17: 100–110. [ DOI ] [ PubMed ] [ Google Scholar ] 16. Buote VM, Wilson AE, Strahan EJ, et al. \nSetting the bar: divergent sociocultural norms for women’s and men’s ideal appearance in real-world contexts. Body Image\n2011; 8: 322–334. [ DOI ] [ PubMed ] [ Google Scholar ] 17. Fardouly J, Vartanian LR. Social Media and body image concerns: current research and future directions. Curr Opin Psychol\n2016; 9: 1–5. [ Google Scholar ] 18. Grabe S, Ward LM, Hyde JS. The role of the media in body image concerns among women: a meta-analysis of experimental and correlational studies. Psychol Bull\n2008; 134: 460–476. [ DOI ] [ PubMed ] [ Google Scholar ] 19. McArdle KA, Hill MS. Understanding body dissatisfaction in gay and heterosexual men: the roles of self-esteem, media, and peer influence. Men Masc\n2009; 11: 511–532. [ Google Scholar ] 20. Bornioli A, Lewis-Smith H, Smith A, et al. \nAdolescent body dissatisfaction and disordered eating: predictors of later risky health behaviours. Soc Sci Med\n2019; 238: 112458. [ DOI ] [ PubMed ] [ Google Scholar ] 21. Neumark-Sztainer D, Paxton SJ, Hannan PJ, et al. \nDoes body satisfaction matter? Five-year longitudinal associations between body satisfaction and health behaviors in adolescent females and males. J Adolesc Health\n2006; 39: 244–251. [ DOI ] [ PubMed ] [ Google Scholar ] 22. Yanover T, Thompson JK. Eating problems, body image disturbances, and academic achievement: preliminary evaluation of the eating and body image disturbances academic interference scale. Int J Eating Disord\n2008; 41: 184–187. [ DOI ] [ PubMed ] [ Google Scholar ] 23. Paxton SJ, Neumark-Sztainer D, Hannan PJ, et al. \nBody dissatisfaction prospectively predicts depressive mood and low self-esteem in adolescent girls and boys. J Clin Child Adolesc Psychol\n2006; 35: 539–549. [ DOI ] [ PubMed ] [ Google Scholar ] 24. Slater A, Guest E, Treneman-Evans G, et al. \nUtilising social media to increase acceptance of appearance-altering conditions: A two-part experimental study. 25. Stone A, Fisher V. Changing negative perceptions of individuals with facial disfigurement: the effectiveness of a brief intervention. Basic Appl Soc Psych\n2020; 42: 341–353. [ Google Scholar ] 26. Matheson E, Lewis-Smith H, Diedrichs P. The effectiveness of brief animated films as a scalable micro-intervention to improve children's body image: a randomised controlled trial. Body Image\n2020; 35: 142–153. [ DOI ] [ PubMed ] [ Google Scholar ] 27. Atkinson MJ, Diedrichs PC. Assessing the impact of body image concerns on functioning across life domains: development and validation of the Body Image Life Disengagement Questionnaire (BILD-Q) among British adolescents. Body Image\n2021; 37: 63–73. [ DOI ] [ PubMed ] [ Google Scholar ] 28. Selensky JC, Carels RA. Weight stigma and media: an examination of the effect of advertising campaigns on weight bias, internalized weight bias, self-esteem, body image, and affect. Body Image\n 2021; 36: 95–106. [ DOI ] [ PubMed ] [ Google Scholar ] 29. Lawrence J, Fauerbach J, Heinberg L, et al. \nThe reliability and validity of the Perceived Stigmatization Questionnaire (PSQ) and the Social Comfort Questionnaire (SCQ) among an adult burn survivor sample. Psychol Assess\n2006; 18: 106–111. [ DOI ] [ PubMed ] [ Google Scholar ] 30. Tylka TL, Iannantuono AC. Perceiving beauty in all women: psychometric evaluation of the Broad Conceptualization of Beauty Scale. Body Image\n2016; 17: 67–81. [ DOI ] [ PubMed ] [ Google Scholar ] 31. Mendelson BK, Mendelson MJ, White DR. Body-Esteem Scale for adolescents and adults. J Pers Assess\n2001; 76: 90–106. [ DOI ] [ PubMed ] [ Google Scholar ] 32. Neuendorf KA. The Content Analysis Guidebook. Thousand Oaks, CA: Sage Publications, Inc, 2017. [ Google Scholar ] 33. Bogart KR, Tickle-Degnen L. Looking beyond the face: a training to improve perceivers’ impressions of people with facial paralysis. Patient Educ Couns\n2015; 98: 251–256. [ DOI ] [ PMC free article ] [ PubMed ] [ Google Scholar ] 34. Rodgers RF, McLean SA, Paxton SJ. Longitudinal relationships among internalization of the media ideal, peer social comparison, and body dissatisfaction: implications for the tripartite influence model. Dev Psychol\n2015; 51: 706–713. [ DOI ] [ PubMed ] [ Google Scholar ] 35. Betz DE, Ramsey LR. Should women be “All About That Bass?”: diverse body-ideal messages and women’s body image. Body Image\n2017; 22: 18–31. [ DOI ] [ PubMed ] [ Google Scholar ] 36. Halliwell E, Diedrichs PC, Orbach S. Costing the invisible: a review of the evidence examining the links between body image, aspirations, education and workplace confidence . Centre for Appearance Research, the University of the West of England Research Repository, 2014. 37. Thompson JK, Heinberg LJ, Altabe M, et al. \nExacting Beauty: Theory, Assessment, and Treatment of Body Image Disturbance . American Psychological Association, 1999. [ Google Scholar ] 38. Bissell K, Rask A. Real women on real beauty. Int J Advert\n2010; 29: 643–668. [ Google Scholar ] 39. Haas CJ, Pawlow LA, Pettibone J, et al. \nAn intervention for the negative influence of Media on body esteem. Coll Stud J\n2012; 46: 405–418. [ Google Scholar ] 40. Burmeister JM, Taylor MB, Rossi J, et al. \nReducing obesity stigma via a brief documentary film: a randomized trial. Stig Health\n2017; 2: 43–52. [ Google Scholar ] 41. Domoff SE, Hinman NG, Koball AM, et al. \nThe effects of reality television on weight bias: an examination of The Biggest Loser. Obesity\n2012; 20: 993–998. [ DOI ] [ PubMed ] [ Google Scholar ] 42. Blascovich J, Mendes WB, Hunter SB, et al. \nPerceiver threat in social interactions with stigmatized others. J Pers Soc Psychol\n2001; 80: 253–267. [ DOI ] [ PubMed ] [ Google Scholar ] 43. Corrigan PW, Morris SB, Michaels PJ, et al. \nChallenging the public stigma of mental illness: a meta-analysis of outcome studies. Psychiatr Serv\n2012; 63: 963–973. [ DOI ] [ PubMed ] [ Google Scholar ] 44. Lönnqvist J-E, Paunonen S, Verkasalo M, et al. \nPersonality characteristics of research volunteers. Eur J Pers\n2007; 21: 1017–1030. [ Google Scholar ] 45. Van Lange PAM, Schippers M, Balliet D. Who volunteers in psychology experiments? An empirical review of prosocial motivation in volunteering. Pers Individ Dif\n2011; 51: 279–284. [ Google Scholar ] 46. Krumpal I. Determinants of social desirability bias in sensitive surveys: a literature review. Qual Quant\n2013; 47: 2025–2047. [ Google Scholar ] 47. Sheeran P, Maki A, Montanaro E, et al. \nThe impact of changing attitudes, norms, and self-efficacy on health-related intentions and behavior: a meta-analysis. Health Psychol\n2016; 35: 1178–1188. [ DOI ] [ PubMed ] [ Google Scholar ] 48. Christ O, Hewstone M, Tausch N, et al. \nDirect contact as a moderator of extended contact effects: cross-sectional and longitudinal impact on outgroup attitudes, behavioral intentions, and attitude certainty. Pers Soc Psychol Bull\n2010; 36: 1662–1674. [ DOI ] [ PubMed ] [ Google Scholar ] 49. Swanton R, Allom V, Mullan B. A meta-analysis of the effect of new-media interventions on sexual-health behaviours. Sex Transm Infect\n2015; 91: 14–20. [ DOI ] [ PubMed ] [ Google Scholar ] Articles from Scars, Burns & Healing are provided here courtesy of SAGE Publications ACTIONS View on publisher site PDF (323.6 KB) Cite Collections Permalink PERMALINK Copy RESOURCES Similar articles Cited by other articles Links to NCBI Databases Cite Copy Download .nbib .nbib Format: AMA APA MLA NLM Add to Collections Create a new collection Add to an existing collection Name your collection * Choose a collection Unable to load your collection due to an error Please try again Add Cancel Follow NCBI NCBI on X (formerly known as Twitter) NCBI on Facebook NCBI on LinkedIn NCBI on GitHub NCBI RSS feed Connect with NLM NLM on X (formerly known as Twitter) NLM on Facebook NLM on YouTube National Library of Medicine 8600 Rockville Pike Bethesda, MD 20894 Web Policies FOIA HHS Vulnerability Disclosure Help Accessibility Careers NLM NIH HHS USA.gov Back to Top"
    },
    {
      "url": "https://modernfarmer.com/2013/04/farm-wounds/",
      "text": "On the Job: Farm Scars - Modern Farmer Skip to content Search Menu Close Farm Food Consumption Search Topics Farming Redefined Food Equity Conscious Consumption Meet the Modern Farmer On The Ground Spotlight On How To Explore People Solutions Hub Series Modern Farmer About Us Our Team Collaborations Submissions The Modern Farmer Weekly Home · Consumption · News · On the Job: Farm Scars News - Article On the Job: Farm Scars Farming is incredibly difficult and often dangerous work. According to the Centers for Disease Control and Prevention, close to 500 farmers and farmworkers lost their lives in 2010... #Archive by Suko Presseau · April 4, 2013 Farming is incredibly difficult and often dangerous work. According to the Centers for Disease Control and Prevention , close to 500 farmers and farmworkers lost their lives in 2010. Every day, nearly 250 agricultural workers suffer an injury that causes them to miss work, and 5 percent of those injuries result in permanent impairment. Two farmers talked to Modern Farmer recently about the injuries they sustained while working on the farm. These interviews have been edited and condensed. Bob Cassler, 54, of Coon Brothers Farm in Amenia, New York, was working on a dairy farm during the early ’90s when a payloader (tractor) he was driving flipped over. MF: Would you tell me a little bit about what happened? BC: I don’t remember the day. I’m not big on dwelling on that stuff. MF: What season was it? BC: It was in May. I was coming down the hill in the payloader, and there was a mechanical failure and the brakes gave out. And next thing I know I was upside down, with that machine on top of me. MF: And then what happened? BC: I kind of looked around and yelled for help. It happened right here – it wasn’t too far from the barn. And then the fire department came, got me out of there and I had a nice helicopter ride to the hospital. MF: What had happened? BC: After it was all said and done, most of the weight was in my shoulder, so it cut off the blood supply, and a piece of fiberglass cut through my muscles and nerves, right to the bone. Basically it was a lot of physical therapy to get back. Even the doctors were shocked that I didn’t have any broken bones. It just took time, a lot of effort on my part. By October, I was back on full time. MF: And you were conscious, and you guys were talking the whole time? BC: Yup. MF: Any farm-related injuries since then? It’s been 20 years. BC: No, I’m kicked by a cow once in awhile, but that’s normal. Brian Crosby, 35, of Berkshire Valley Holsteins in Hillsdale, New York, caught his hand in a machine called a roller mill. MF: What happened when your hand got caught? Was it like an auger, or a grinder? BC: It’s like a grinder. It’s got two steel rolls that spin, and as the corn goes through, it crushes it. MF: Does the machine automatically stop? Is there a sensor system? BC: Nope. MF: So your hand started to get crushed in it? BC: As I realized what was happening, I yanked it out. MF: Was anyone around? BC: Nope, I had to drive myself to the hospital. I wrapped it up in a shirt, and off I went. MF: Did it break skin? BC: Yup, it crushed the third and fourth metacarpals, and all the tendons and muscles were ripped out, so they had to reconstruct it. It happened to be one of the top surgeons in the state was at the hospital at the time I rolled in, so I was pretty lucky. MF: It crushed your bones, but they were able to patch them up? BC: Yeah, they put pins in them. MF: Did you regain full … BC: I got all the sensation back, but movement [is only] 75 percent. MF: How long did the whole healing process take? BC: Six months. Subscribe Notify of new follow-up comments new replies to my comments Label {} [+] Name* Email* Website Δ Label {} [+] Name* Email* Website Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. 1 Comment Most Voted Newest Oldest Inline Feedbacks View all comments Follow us Facebook Instagram LinkedIn X Republish! Republish This Story Want to republish a Modern Farmer story? We are happy for Modern Farmer stories to be shared, and encourage you to republish our articles for your audience. When doing so, we ask that you follow these guidelines: Please credit us and our writers For the author byline, please use “Author Name, Modern Farmer.” At the top of our stories, if on the web, please include this text and link: “This story was originally published by Modern Farmer . ” Please make sure to include a link back to either our home page or the article URL. At the bottom of the story, please include the following text: “Modern Farmer is a nonprofit initiative dedicated to raising awareness and catalyzing action at the intersection of food, agriculture, and society. Read more at <link>Modern Farmer</link>.” Use our widget We’d like to be able to track our stories, so we ask that if you republish our content, you do so using our widget (located on the left hand side of the article). The HTML code has a built-in tracker that tells us the data and domain where the story was published, as well as view counts. Check the image requirements It’s your responsibility to confirm you're licensed to republish images in our articles. Some images, such as those from commercial providers, don't allow their images to be republished without permission or payment. Copyright terms are generally listed in the image caption and attribution. You are welcome to omit our images or substitute with your own. Charts and interactive graphics follow the same rules. Don’t change too much. Or, ask us first. Articles must be republished in their entirety. It’s okay to change references to time (“today” to “yesterday”) or location (“Iowa City, IA” to “here”). But please keep everything else the same. If you feel strongly that a more material edit needs to be made, get in touch with us at [email protected] . We’re happy to discuss it with the original author, but we must have prior approval for changes before publication. Special cases Extracts. You may run the first few lines or paragraphs of the article and then say: “Read the full article at Modern Farmer” with a link back to the original article. Quotes. You may quote authors provided you include a link back to the article URL. Translations. These require writer approval. To inquire about translation of a Modern Farmer article, contact us at [email protected] Signed consent / copyright release forms. These are not required, provided you are following these guidelines. Print. Articles can be republished in print under these same rules, with the exception that you do not need to include the links. Tag us When sharing the story on social media, please tag us using the following: - Twitter (@ModFarm) - Facebook (@ModernFarmerMedia) - Instagram (@modfarm) Use our content respectfully Modern Farmer is a nonprofit and as such we share our content for free and in good faith in order to reach new audiences. Respectfully, No selling ads against our stories. It’s okay to put our stories on pages with ads. Don’t republish our material wholesale, or automatically; you need to select stories to be republished individually. You have no rights to sell, license, syndicate, or otherwise represent yourself as the authorized owner of our material to any third parties. This means that you cannot actively publish or submit our work for syndication to third party platforms or apps like Apple News or Google News. We understand that publishers cannot fully control when certain third parties automatically summarize or crawl content from publishers’ own sites. Keep in touch We want to hear from you if you love Modern Farmer content, have a collaboration idea, or anything else to share. As a nonprofit outlet, we work in service of our community and are always open to comments, feedback, and ideas. Contact us at [email protected] . Republish our articles for free, online or in print, under a Creative Commons license. Close window Republish this article This work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License . Want to republish a Modern Farmer story? We are happy for Modern Farmer stories to be shared, and encourage you to republish our articles for your audience. When doing so, we ask that you follow these guidelines: Please credit us and our writers For the author byline, please use “Author Name, Modern Farmer.” At the top of our stories, if on the web, please include this text and link: “This story was originally published by Modern Farmer . ” Please make sure to include a link back to either our home page or the article URL. At the bottom of the story, please include the following text: “Modern Farmer is a nonprofit initiative dedicated to raising awareness and catalyzing action at the intersection of food, agriculture, and society. Read more at <link>Modern Farmer</link>.” Use our widget We’d like to be able to track our stories, so we ask that if you republish our content, you do so using our widget (located on the left hand side of the article). The HTML code has a built-in tracker that tells us the data and domain where the story was published, as well as view counts. Check the image requirements It’s your responsibility to confirm you're licensed to republish images in our articles. Some images, such as those from commercial providers, don't allow their images to be republished without permission or payment. Copyright terms are generally listed in the image caption and attribution. You are welcome to omit our images or substitute with your own. Charts and interactive graphics follow the same rules. Don’t change too much. Or, ask us first. Articles must be republished in their entirety. It’s okay to change references to time (“today” to “yesterday”) or location (“Iowa City, IA” to “here”). But please keep everything else the same. If you feel strongly that a more material edit needs to be made, get in touch with us at [email protected] . We’re happy to discuss it with the original author, but we must have prior approval for changes before publication. Special cases Extracts. You may run the first few lines or paragraphs of the article and then say: “Read the full article at Modern Farmer” with a link back to the original article. Quotes. You may quote authors provided you include a link back to the article URL. Translations. These require writer approval. To inquire about translation of a Modern Farmer article, contact us at [email protected] Signed consent / copyright release forms. These are not required, provided you are following these guidelines. Print. Articles can be republished in print under these same rules, with the exception that you do not need to include the links. Tag us When sharing the story on social media, please tag us using the following: - Twitter (@ModFarm) - Facebook (@ModernFarmerMedia) - Instagram (@modfarm) Use our content respectfully Modern Farmer is a nonprofit and as such we share our content for free and in good faith in order to reach new audiences. Respectfully, No selling ads against our stories. It’s okay to put our stories on pages with ads. Don’t republish our material wholesale, or automatically; you need to select stories to be republished individually. You have no rights to sell, license, syndicate, or otherwise represent yourself as the authorized owner of our material to any third parties. This means that you cannot actively publish or submit our work for syndication to third party platforms or apps like Apple News or Google News. We understand that publishers cannot fully control when certain third parties automatically summarize or crawl content from publishers’ own sites. Keep in touch We want to hear from you if you love Modern Farmer content, have a collaboration idea, or anything else to share. As a nonprofit outlet, we work in service of our community and are always open to comments, feedback, and ideas. Contact us at [email protected] . On the Job: Farm Scars by Suko Presseau, Modern Farmer April 4, 2013 <h1>On the Job: Farm Scars</h1>\n<p class=\"byline\">by Suko Presseau, Modern Farmer <br />April 4, 2013</p>\n<p>Farming is incredibly difficult and often dangerous work. According to the <a href=\"http://www.cdc.gov/niosh/topics/aginjury/\">Centers for Disease Control and Prevention</a>, close to 500 farmers and farmworkers lost their lives in 2010. Every day, nearly 250 agricultural workers suffer an injury that causes them to miss work, and 5 percent of those injuries result in permanent impairment. Two farmers talked to Modern Farmer recently about the injuries they sustained while working on the farm. <em><strong>These interviews have been edited and condensed.</strong></em></p>\n<p><img src=\"http://modernfarmer.com/wp-content/uploads/2013/04/04_13_wounds2.png\" alt=\"\" /></p>\n<p><strong><em>Bob Cassler, 54, of Coon Brothers Farm in Amenia, New York, was working on a dairy farm during the early '90s when a payloader (tractor) he was driving flipped over.</em></strong></p>\n<p><strong>MF:</strong> Would you tell me a little bit about what happened?</p>\n<p><strong>BC:</strong> I don't remember the day. I'm not big on dwelling on that stuff.</p>\n<p><strong>MF:</strong> What season was it?</p>\n<p><strong>BC:</strong> It was in May. I was coming down the hill in the payloader, and there was a mechanical failure and the brakes gave out. And next thing I know I was upside down, with that machine on top of me.</p>\n<p><strong>MF:</strong> And then what happened?</p>\n<p><strong>BC:</strong> I kind of looked around and yelled for help. It happened right here - it wasn't too far from the barn. And then the fire department came, got me out of there and I had a nice helicopter ride to the hospital.</p>\n<p><strong>MF:</strong> What had happened?</p>\n<p><strong>BC:</strong> After it was all said and done, most of the weight was in my shoulder, so it cut off the blood supply, and a piece of fiberglass cut through my muscles and nerves, right to the bone. Basically it was a lot of physical therapy to get back. Even the doctors were shocked that I didn't have any broken bones. It<br />\njust took time, a lot of effort on my part. By October, I was back on full time.</p>\n<p>MF: And you were conscious, and you guys were talking the whole time?</p>\n<p>BC: Yup.</p>\n<p>MF: Any farm-related injuries since then? It's been 20 years.</p>\n<p>BC: No, I'm kicked by a cow once in awhile, but that's normal.</p>\n<p><img src=\"http://modernfarmer.com/wp-content/uploads/2013/04/04_13_wounds1.png\" alt=\"\" /></p>\n<p><strong><em>Brian Crosby, 35, of Berkshire Valley Holsteins in Hillsdale, New York, caught his hand in a machine called a roller mill.</em></strong></p>\n<p><strong>MF:</strong> What happened when your hand got caught? Was it like an auger, or a grinder?</p>\n<p><strong>BC:</strong> It's like a grinder. It's got two steel rolls that spin, and as the corn goes through, it crushes it.</p>\n<p><strong>MF:</strong> Does the machine automatically stop? Is there a sensor system?</p>\n<p><strong>BC:</strong> Nope.</p>\n<p><strong>MF:</strong> So your hand started to get crushed in it?</p>\n<p><strong>BC:</strong> As I realized what was happening, I yanked it out.</p>\n<p><strong>MF:</strong> Was anyone around?</p>\n<p><strong>BC:</strong> Nope, I had to drive myself to the hospital. I wrapped it up<br />\nin a shirt, and off I went.</p>\n<p><strong>MF:</strong> Did it break skin?</p>\n<p><strong>BC:</strong> Yup, it crushed the third and fourth metacarpals, and all the tendons and muscles were ripped out, so they had to reconstruct it. It happened to be one of the top surgeons in the state was at the hospital at the time I rolled in, so I was pretty lucky.</p>\n<p><strong>MF:</strong> It crushed your bones, but they were able to patch<br />\nthem up?</p>\n<p><strong>BC:</strong> Yeah, they put pins in them.</p>\n<p><strong>MF:</strong> Did you regain full ...</p>\n<p><strong>BC:</strong> I got all the sensation back, but movement [is only]<br />\n75 percent.</p>\n<p><strong>MF:</strong> How long did the whole healing process take?</p>\n<p><strong>BC:</strong> Six months.</p>\n<p>This &lt;a target=&quot;_blank&quot; href=&quot;https://modernfarmer.com/2013/04/farm-wounds/&quot;&gt;article&lt;/a&gt; first appeared on &lt;a target=&quot;_blank&quot; href=&quot;https://modernfarmer.com&quot;&gt;Modern Farmer&lt;/a&gt; and is republished here under a &lt;a target=&quot;_blank&quot; href=&quot;https://creativecommons.org/licenses/by-nd/4.0/&quot;&gt;Creative Commons Attribution-NoDerivatives 4.0 International License&lt;/a&gt;.&lt;img src=&quot;https://modernfarmer.com/wp-content/uploads/2024/08/cropped-favicon-1-150x150.png&quot; style=&quot;width:1em;height:1em;margin-left:10px;&quot;&gt;</p>\n&lt;img id=&quot;republication-tracker-tool-source&quot; src=&quot;https://modernfarmer.com/?republication-pixel=true&amp;post=574&quot; style=&quot;width:1px;height:1px;&quot;&gt; Copy to Clipboard 1 Modern Farmer Weekly Solutions Hub Innovations, ideas and inspiration. Actionable solutions for a resilient food system. Explore Explore other topics Farm Food Consumption Share With Us We want to hear from Modern Farmer readers who have thoughtful commentary, actionable solutions, or helpful ideas to share. Submit For people who care where their food comes from. Topics Farming Redefined Food Equity Conscious Consumption Modern Farmer About Us Our Team Collaborations Submissions Community and Policies Community Guidelines Ethics and Policies Funders and Supporters Republication Guidelines Accessibility Statement Privacy Policy Follow us Facebook Instagram LinkedIn X © 2025 Modern Farmer. All rights reserved. Modern Farmer is part of Epic Gardening, Inc. wpDiscuz Insert We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Cookie settings ACCEPT Cookies Policy Close Cookies This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non Necessary non-necessary Any cookies that may not be particularly necessary for the website to function and are used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. Save & Accept"
    },
    {
      "url": "https://www.scarsevents.com/scars-events/farmers-market/",
      "text": "Farmers Market - Scars Events Skip to content Book A Tour Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Home Venue Wedding Packages Gallery Contact Us Careers Gallery Contact Us Careers Book A Tour FARMERS MARKET Home Farmers Market Farmers Market 777 ALTURAS RD, BARTOW, FL 33830 Vendor Application The Scars Famers Market will be held monthly on Wednesdays at Scars Farm. It’s located at 777 Alturas Rd, Bartow, FL 33830 The Market is open to customers from 10 am to 7 pm. Michael (Market Manager) is responsible for the weekly operations of the market. Phone:  863-513-4805 Email: contact@www.scarsevents.com How to Apply to be a Vendor a) Preparation – It’s important that you carefully read this document before submitting your application. –        Your application should address all the topics defined here, regarding your type of product –        Applications are reviewed and evaluated on-goingly throughout the year. b) Application – Applying to the Market is done online. A. General Guidelines a) Selection Criteria – Potential vendors are screened based on a number of criteria, including: 1. Product Type 2. Product Quality 3. Presentation b) Booth Setup – –        Vendors should have displays that are eye-catching and thoughtfully designed. –        For both appearance and safety reasons, we recommend the use of professional grade 10 x10’ tents with full internal frames (vs recreational tents that have only perimeter frames). c) Commercial Products – Our focus is on products that are designed and created by the vendor. –        We do not accept products that are commercially produced and/ or distributed. d) Product Lines – The Market management makes judgments about the appropriate number of vendors within a product category. –        This assessment is based on the number of total available spaces, etc., and how many vendors are currently vending any one category of product. –        We limit the number of similar products so that each vendor has the opportunity to be successful. e) Product Mix – We do not accept applications for multiple categories of products in the same booth.  (e.g. pottery & jewelry). f) Booth Size – The standard booth space is up to 12 feet wide and 12 feet deep. g) Attendance Frequency – The Market will have both full-time and half-time vendors. –        The focus in the first season will be on having full-time vendor participation. –        Half-time vendors would typically be craft vendors.  This is intended for some weekly variety in the customers’ shopping experience. –        Half-time vendors can select which dates they want to request in a 10-12 week scheduling window. B. Farm Produce a) Farmers – We are very interested in cultivating relationships with farmers. –        Interested farmers should contact us directly to learn about the current opportunities available. C. Plants & Flowers a) Grower Preference – Preference is given to growers versus resellers. D. Crafts b) Product Priorities – The primary focus of the market is related to produce, food and plants.  Crafts supplement these core products and provide color and variety to the market. c) Product Categories – Crafts are evaluated within a respective product type (e.g. pottery, clothing, jewelry, personal care products, yard art, etc.). d) Homemade – We support craftspeople at the market.  As a result, crafts must be made by the vendor. e) Resale – Items offered for re-sale or are commercially produced are not f) Food-Related – High-quality and very unique items that are food related (e.g. cookbooks, kitchen utensils, table linens, aprons, etc.) may be considered, even if they are not made by the vendor. E. Services a) Service Delivery – We will consider service vendors if the service is conducted at the market (e.g. face painting, massage, knife sharpening, etc.). b) Promotion – We do not accept applications for businesses wishing to promote services provided elsewhere (e.g. health clubs, real estate sales, medical offices).  This type of activity is eligible to participate as a ‘sponsor’. F. Other Businesses a) Sponsorship – Businesses that do not meet our eligibility requirements can request to participate as a ‘sponsor’.  Contact us to learn more about sponsorship options. G. Fees a) Amount – The vending fee is $50/ day or per market. H. The Application Process a) Application Details –You need to address all the categories of the information below in your application. –  Omitting information (e.g. prices, vending experience) will delay the process or diminish the likelihood of a positive response. Product Description ( Include product details, prices, production methods, etc .) Business Description ( Include the background/training of the owner, origins of the business, etc . ) Vending Approach/ Experience ( How your booth is designed, and where you’ve vended before ) b) Pictures – Good pictures of your product and setup are important. –  Provide photos of your products. –  Show us a picture of your booth , and ones that show your product display and signage. c) Waitlisting – If a prospective vendor applies in a product line that we deem to be full if the application is sufficiently strong, it may be ‘waitlisted’.  When space becomes available because: (1) a current vendor in a product category leaves, or (2) new space becomes available (because of expansion), and the vendor with the strongest application (within the category) on the waitlist may be invited to screen. d) Re-Application – A follow-up application can be made after an initial decline. –  It must be made at least one year following the earlier application and should outline key changes or enhancements since the earlier submission. –  Applicants who have been notified that they are on a Waitlist need not apply again.  They are simply waiting for an appropriate opening.  They will be notified should one occur. I. The Approval Process a) Approved Vendors – Some vendors will be approved immediately based on the strength of their application. b) Screened Vendors – The Application Committee may decide that your application warrants an invitation to vend once (called a ‘screening’ visit) at the Market. –  The purpose of this visit is to complete an overall assessment of your product and booth setup. –  The decision about approval will be provided following the screening visit. J. Taxes a) Sales Tax – Sales tax, where required by the State, is the responsibility of the seller. K. Liability Insurance a) Required Coverage – All vendors are required to carry liability insurance coverage with the Market listed as an ‘Additionally Insured’.  Details of coverage will be provided on approval. Scars Events Icon-facebook Instagram Information Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Contact contact@scarsfarm.com 863-537-6590 833-941-0989 777 ALTURAS RD, BARTOW, FL 33830 Gallery © 2022 Scars Farm. All Rights Reserved. Design by Jabstract Web Design The Basics 54+ acres of private land 9,000 sq ft modern and rustic farm venue Five climate controlled buildings Mutiple indoor and outdoor ceremony options Bridal suite overlooking lake garfield Groom’s room and private outdoor area 12 restroom building 20,000 sq ft garden area Groom’s room and private outdoor area Cinderella horse carriage Wildflower meadows Vendor building with kitchen Strawberry pond and crossing palm trees Setup and teardown of chairs & tables Custom-built moveable bar Access to entire property for photos Personalized floor plan Chairs + tables 14 hour rentals on weekends (12 hours Monday – Thursday) Facebook Twitter Skype Whatsapp Envelope Tripadvisor Book A Tour Scars Farm is a wedding venue located in Bartow, Florida. It’s an idyllic 54-acre site that offers a large strawberry-shaped pond lined with palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Barbecue or caviar, this venue has it all. Our main website is still in development. If you have any questions at all, please fill out the form below and we’ll be in touch! Name Email Phone Message Send Feedback Request We are very sorry that we did not meet your expectations… We strive for no less than 5 stars and this is not something that we take lightly. We genuinely stand behind our product. Please let us know where you felt we dropped the ball and we’ll get in touch with you soon to discuss. We’re very sorry and look forward to speaking with you."
    },
    {
      "url": "https://www.scarsevents.com/weddings/",
      "text": "Weddings - Scars Events Skip to content Book A Tour Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Home Venue Wedding Packages Gallery Contact Us Careers Gallery Contact Us Careers Book A Tour Weddings Home Weddings All Inclusive Wedding Packages Emerald Wedding Package Glass Barn Open Barn Bridal Suite \"The Lounge\" - Groom's Room 12 Restroom Building Vendor Building Ceremony Photographer Videographer Officiant Catering Couple's Wedding Cake with Cupcakes Professional DJ - Includes up lighting Professional Bartender Bridal Hair & Makeup - 8 Services Floral Black Crossback and/or White Padded Garden Chairs Round, Rectangle Table Linens Wedding Decor Set Up and Clean Up Restroom Attendant Valet Parking Full Planning & Coordination Select Your Preferred Date Below Friday or Sunday Saturday Monday - Thursday Edit Content 50 Guests $27,900 100 Guests $31,900 150 Guests $35,900 200 Guests $39,900 250 Guests $43,900 300 Guests $47,900 Edit Content 50 Guests $28,900 100 Guests $32,900 150 Guests $36,900 200 Guests $40,900 250 Guests $44,900 300 Guests $48,900 Edit Content 50 Guests $26,900 100 Guests $30,900 150 Guests $34,900 200 Guests $38,900 250 Guests $42,900 300 Guests $46,900 *Pricing above reflects dates booked through 2026 *Plus 7% Tax Make Reservations Sapphire Wedding Package Glass Barn Open Barn Bridal Suite \"The Lounge\" - Groom's Room 12 Restroom Building Vendor Building Multiple Options for Ceremony including Lakefront Premium Photographer Premium Videographer Officiant Catering w/ Upgraded Catering Menu Selections Gourmet Wedding Cake Professional DJ - Includes up lighting Professional Bartender Bridal Hair & Makeup - 16 Services Floral Black Crossback and/or White Padded Garden Chairs 6 Cocktail Tables Round, Rectangle & Cocktail Table Linens - Any Color Wedding Decor Set Up and Clean Up Restroom Attendant Golf Cart Transportation Valet Parking Full Planning & Coordination Select Your Preferred Date Below Friday or Sunday Saturday Monday - Thursday Edit Content 50 Guests $34,900 100 Guests $39,900 150 Guests $44,900 200 Guests $49,900 250 Guests $54,900 300 Guests $59,900 Edit Content 50 Guests $39,900 100 Guests $44,900 150 Guests $49,900 200 Guests $54,900 250 Guests $59,900 300 Guests $64,900 Edit Content 50 Guests $29,900 100 Guests $34,900 150 Guests $39,900 200 Guests $44,900 250 Guests $49,900 300 Guests $54,900 *Pricing above reflects dates booked through 2026 *Plus 7% Tax Make Reservations Diamond Wedding Package Glass Barn Open Barn Bridal Suite \"The Lounge\" - Groom's Room Refreshments in Lounge and Suite 12 Restroom Building Vendor Building Multiple Options for Ceremony including Lakefront Premium Photographer Premium Videographer Officiant Catering w/ Upgraded Catering Menu Selections Gourmet Wedding Cake, and Dessert Bar Professional DJ - Includes up lighting, Photobooth Professional Bartenders - Includes Full-Service Bar Bridal Hair & Makeup - 24 Services Premium Floral Black Crossback and/or White Padded Garden Chairs 8 Cocktail Tables Round, Rectangle & Cocktail Table Linens - Any Color China, Glassware & Flatware Premium Wedding Decor Complete Set Up/Breakdown – Includes 10 Staff Members Restroom Attendants Golf Cart Transportation Valet Parking Premium Full Planning & Coordination Select Your Preferred Date Below Friday or Sunday Saturday Monday - Thursday Edit Content 50 Guests $59,900 100 Guests $64,900 150 Guests $69,900 200 Guests $74,900 250 Guests $79,900 300 Guests $84,900 Edit Content 50 Guests $64,900 100 Guests $69,900 150 Guests $74,900 200 Guests $79,900 250 Guests $84,900 300 Guests $89,900 Edit Content 50 Guests $54,900 100 Guests $59,900 150 Guests $64,900 200 Guests $69,900 250 Guests $74,900 300 Guests $79,900 *Pricing above reflects dates booked through 2026 *Plus 7% Tax Make Reservations Diamond Plus Wedding Package Glass Barn Open Barn Vendor Building 12 Restroom Building Bridal Suite \"The Lounge\" - Groom's Room Multiple Options for Ceremony including Lakefront Refreshments in Bridal Suite & Grooms Room Premium Photographer Premium Videographer Officiant w/ Upgrade Options Catering w/ Upgraded Catering Menu Selections Gourmet Wedding Cake, and Dessert Bar Professional DJ - Includes up lighting, Photobooth Premium Floral Professional Bartenders - Includes Full-Service Bar Restroom Attendants Bridal Hair & Makeup - 32 Services Black Crossback and/or White Padded Garden Chairs 12 Cocktail Tables Round, Rectangle & Cocktail Table Linens - Any Color China, Glassware & Flatware Premium Wedding Decor Complete Set Up/Breakdown – Includes 18 Staff Members Golf Cart Transportation Valet Parking Premium Full Planning & Coordination Friday or Sunday Saturday Monday - Thursday Edit Content 50 Guests $79,900 100 Guests $89,900 150 Guests $99,900 200 Guests $109,900 250 Guests $119,900 300 Guests $129,900 Edit Content 50 Guests $89,900 100 Guests $99,900 150 Guests $109,900 200 Guests $119,900 250 Guests $129,900 300 Guests $139,900 Edit Content 50 Guests $69,900 100 Guests $79,900 150 Guests $89,900 200 Guests $99,900 250 Guests $109,900 300 Guests 119,900 *Pricing above reflects dates booked through 2026 *Plus 7% Tax Make Reservations Newsletter Get Newsletter Email Subscribe Now Lets Celebrate Your Love Contact Us Now Scars Events Icon-facebook Instagram Information Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Contact contact@scarsfarm.com 863-537-6590 833-941-0989 777 ALTURAS RD, BARTOW, FL 33830 Gallery © 2022 Scars Farm. All Rights Reserved. Design by Jabstract Web Design The Basics 54+ acres of private land 9,000 sq ft modern and rustic farm venue Five climate controlled buildings Mutiple indoor and outdoor ceremony options Bridal suite overlooking lake garfield Groom’s room and private outdoor area 12 restroom building 20,000 sq ft garden area Groom’s room and private outdoor area Cinderella horse carriage Wildflower meadows Vendor building with kitchen Strawberry pond and crossing palm trees Setup and teardown of chairs & tables Custom-built moveable bar Access to entire property for photos Personalized floor plan Chairs + tables 14 hour rentals on weekends (12 hours Monday – Thursday) Facebook Twitter Skype Whatsapp Envelope Tripadvisor Book A Tour Scars Farm is a wedding venue located in Bartow, Florida. It’s an idyllic 54-acre site that offers a large strawberry-shaped pond lined with palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Barbecue or caviar, this venue has it all. Our main website is still in development. If you have any questions at all, please fill out the form below and we’ll be in touch! Name Email Phone Message Send Feedback Request We are very sorry that we did not meet your expectations… We strive for no less than 5 stars and this is not something that we take lightly. We genuinely stand behind our product. Please let us know where you felt we dropped the ball and we’ll get in touch with you soon to discuss. We’re very sorry and look forward to speaking with you."
    },
    {
      "url": "https://www.scarsevents.com/careers/",
      "text": "Careers - Scars Events Skip to content Book A Tour Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Home Venue Wedding Packages Gallery Contact Us Careers Gallery Contact Us Careers Book A Tour Scars Careers Home Scars Careers Marketer We hope to reach out to members of the community in multiple ways! It’s important that our marketer understands the central purpose of Scars Farm and is able to engage the community through communication tools that include press releases, print material, product promotion and social media outreach. He or she must also be able to operate advanced computer programs and be able to produce fliers, brochures, and promotional materials that are engaging in both design and content and are consistent with our central mission. Internships and Volunteers We are eager to offer internship opportunities and welcome anyone who has an interest in sustainable ecosystems, Animal welfare, or environmental science as a possible career. The students we hope to attract need to be responsible, eager to further their knowledge, and willing to help with all aspects of our farm operations and animal care. We also welcome volunteers – we need all the help that we can get as we continue to expand our operations! For anyone looking for experience in their field of interest or would like to learn more about our volunteer opportunities, please call us at 833-941-0989. Event Support Our Special Event venue offers the public opportunities to not only commemorate precious milestones in their personal lives, but to also celebrate holidays, hold inspirational retreats, host corporate or association gatherings, or pay tribute to first responders and others in the community who deserve our thanks. We are looking for individuals to assist in the logistical management of our events. This may include helping to prepare our venue and setting up chairs and tables, tending to attendee needs, and participating post event duties. Our event support team must be organized, energetic, flexible, friendly and be able to pay meticulous attention to detail. Gift Shop Staff We are seeking individuals who are willing to serve in a variety of roles that may include processing sales, operating a cash register, organizing and maintaining the displays, managing the inventory, restocking the supplies, answering phones, greeting customers and being able to answer questions about Scars Farm. Our gift shop is small right now but we anticipate that we may need to expand and add additional staff. Qualities that we are looking for include being: friendly, organized, cheerful, flexible, patient, and detail-focused. Property/Landscape Manager It’s important that our property is managed and maintained so that it reflects the permanent agriculture landscape and renewable food forest that we hope to achieve. Our goal has always been to design our own growing space and find a way to work with nature to provide a sustainable lifestyle – not only for us, but to also use as an example of what can be done within a defined area of land. The Property Manager we hope to hire needs to have the will and the skill to maximize our land’s potential without disturbing the beautiful balance that nature has provided. Scars Events Icon-facebook Instagram Information Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Contact contact@scarsfarm.com 863-537-6590 833-941-0989 777 ALTURAS RD, BARTOW, FL 33830 Gallery © 2022 Scars Farm. All Rights Reserved. Design by Jabstract Web Design The Basics 54+ acres of private land 9,000 sq ft modern and rustic farm venue Five climate controlled buildings Mutiple indoor and outdoor ceremony options Bridal suite overlooking lake garfield Groom’s room and private outdoor area 12 restroom building 20,000 sq ft garden area Groom’s room and private outdoor area Cinderella horse carriage Wildflower meadows Vendor building with kitchen Strawberry pond and crossing palm trees Setup and teardown of chairs & tables Custom-built moveable bar Access to entire property for photos Personalized floor plan Chairs + tables 14 hour rentals on weekends (12 hours Monday – Thursday) Facebook Twitter Skype Whatsapp Envelope Tripadvisor Book A Tour Scars Farm is a wedding venue located in Bartow, Florida. It’s an idyllic 54-acre site that offers a large strawberry-shaped pond lined with palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Barbecue or caviar, this venue has it all. Our main website is still in development. If you have any questions at all, please fill out the form below and we’ll be in touch! Name Email Phone Message Send Feedback Request We are very sorry that we did not meet your expectations… We strive for no less than 5 stars and this is not something that we take lightly. We genuinely stand behind our product. Please let us know where you felt we dropped the ball and we’ll get in touch with you soon to discuss. We’re very sorry and look forward to speaking with you."
    },
    {
      "url": "https://www.scarsevents.com/our-venue/",
      "text": "Venue - Scars Events Skip to content Book A Tour Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Home Venue Wedding Packages Gallery Contact Us Careers Gallery Contact Us Careers Book A Tour Central Florida Event Venue Home Venue Bartow Florida Our Venue Our venue and grounds have been designed to emphasize the charm and romance of our pastoral setting without sacrificing modern comforts or convenience. Scars Farm’s event space includes four picturesque outdoor and indoor ceremony sites, 5,000 square feet of indoor reception space with dance floor. It also includes a 3,400 square foot open barn, rustic bar, fire pit, on-site parking, and more. Behind the scenes, we are fully equipped with ample power for bands, DJs, and audio needs as well as a spacious catering kitchen for easy prep and prompt service. Our venue was designed with ADA accessible pathways and indoor restrooms so that every guest feels right at home. Our buildings are climate controlled for year-round use. Our goal is to provide you with both the scenery and the setup to create the memorable event you envision. With our expert guidance and well-appointed facility, you can confidently plan and experience your Scars Farm wedding! Make Reservations Event Spaces Modern Monitor Barn: Our Modern 5,000-square-foot climate-controlled barn monitor barn is surrounded by 124ft of glass doors/windows and is the crown jewel of our venue. Accommodates up to 400 guests for indoor receptions and ceremonies when the weather turns for the worse. Rustic Open Barn: 70-year-old wood from 24 horse stalls was carefully disassembled and reassembled to create an amazing backdrop for cocktail hour. Ceremony Options: Choose from 6 unique areas to tie the knot, including 3 lake options. Exchange vows in the heart of our receptions and ceremonies. Bridal Suite: Getting ready for a wedding can be exciting, but tedious. Our staff is always on-site to assist you so that your day is stress-free. The Bridal Suite is designed to enchant you and your bridesmaids from the minute you walk in. You and your bridal team can get ready together in style. Grooms Room: There is limitless choice for the modern groom; whether you and the boys are rocking tails or tweed, bow ties or no ties, velvet or linen, kilts or a three-piece, we know you’ll appreciate a calm and quiet space to perfect your look. 12 Restroom Building: We’ve been asked on multiple occasions if Chip and Joanna Gaines designed this building! Your guests will never have to wait in hour-long lines again. Cinderella Carriage: You can have a true fairytale entrance, with our horse-drawn Cinderella’s Carriage, which will be an experience that you and your guests will always remember. Other Features: Vendor Building for catering prep, valet parking, market lighting and more! We’ve considered every detail, from the fun to the functional! All Bridal Suite Newsletter Get Newsletter Email Subscribe Now Scars Events Icon-facebook Instagram Information Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Contact contact@scarsfarm.com 863-537-6590 833-941-0989 777 ALTURAS RD, BARTOW, FL 33830 Gallery © 2022 Scars Farm. All Rights Reserved. Design by Jabstract Web Design The Basics 54+ acres of private land 9,000 sq ft modern and rustic farm venue Five climate controlled buildings Mutiple indoor and outdoor ceremony options Bridal suite overlooking lake garfield Groom’s room and private outdoor area 12 restroom building 20,000 sq ft garden area Groom’s room and private outdoor area Cinderella horse carriage Wildflower meadows Vendor building with kitchen Strawberry pond and crossing palm trees Setup and teardown of chairs & tables Custom-built moveable bar Access to entire property for photos Personalized floor plan Chairs + tables 14 hour rentals on weekends (12 hours Monday – Thursday) Facebook Twitter Skype Whatsapp Envelope Tripadvisor Book A Tour Scars Farm is a wedding venue located in Bartow, Florida. It’s an idyllic 54-acre site that offers a large strawberry-shaped pond lined with palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Barbecue or caviar, this venue has it all. Our main website is still in development. If you have any questions at all, please fill out the form below and we’ll be in touch! Name Email Phone Message Send Feedback Request We are very sorry that we did not meet your expectations… We strive for no less than 5 stars and this is not something that we take lightly. We genuinely stand behind our product. Please let us know where you felt we dropped the ball and we’ll get in touch with you soon to discuss. We’re very sorry and look forward to speaking with you."
    },
    {
      "url": "https://www.scarsevents.com/private-events/",
      "text": "Private Events - Scars Events Skip to content Book A Tour Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Home Venue Wedding Packages Gallery Contact Us Careers Gallery Contact Us Careers Book A Tour Private Events Private Events Home Private Events Having a Private Party in Central Florida? Want to throw your spouse an amazing 40th birthday party? Want to plan corporate retreat? What about your child’s graduation party? Is your close family friend’s daughter engaged? Need a place to host your annual non-profit charity event? Want to elope instead of a full wedding? No matter the occasion, Scars Farm has the space for you! With our brand-new modern monitor barn, rustic open barn, beautiful gardens, and manicured lawn – we have the ability to create custom rental proposals to fit your needs. We are fully equipped with ample power for bands, DJs, and audio needs as well as a spacious catering kitchen for easy prep and prompt service. Our ground floor was designed with ADA accessible indoor restrooms so that every guest feels right at home. Our Monitor barn and Event buildings are climate controlled for year-round use. Contact us for a custom quote and we will make your party dreams come true. Make Reservations Scars Events Icon-facebook Instagram Information Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Contact contact@scarsfarm.com 863-537-6590 833-941-0989 777 ALTURAS RD, BARTOW, FL 33830 Gallery © 2022 Scars Farm. All Rights Reserved. Design by Jabstract Web Design The Basics 54+ acres of private land 9,000 sq ft modern and rustic farm venue Five climate controlled buildings Mutiple indoor and outdoor ceremony options Bridal suite overlooking lake garfield Groom’s room and private outdoor area 12 restroom building 20,000 sq ft garden area Groom’s room and private outdoor area Cinderella horse carriage Wildflower meadows Vendor building with kitchen Strawberry pond and crossing palm trees Setup and teardown of chairs & tables Custom-built moveable bar Access to entire property for photos Personalized floor plan Chairs + tables 14 hour rentals on weekends (12 hours Monday – Thursday) Facebook Twitter Skype Whatsapp Envelope Tripadvisor Book A Tour Scars Farm is a wedding venue located in Bartow, Florida. It’s an idyllic 54-acre site that offers a large strawberry-shaped pond lined with palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Barbecue or caviar, this venue has it all. Our main website is still in development. If you have any questions at all, please fill out the form below and we’ll be in touch! Name Email Phone Message Send Feedback Request We are very sorry that we did not meet your expectations… We strive for no less than 5 stars and this is not something that we take lightly. We genuinely stand behind our product. Please let us know where you felt we dropped the ball and we’ll get in touch with you soon to discuss. We’re very sorry and look forward to speaking with you."
    },
    {
      "url": "https://www.scarsevents.com/gallery/",
      "text": "Gallery - Scars Events Skip to content Book A Tour Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Home Venue Wedding Packages Gallery Contact Us Careers Gallery Contact Us Careers Book A Tour Our Gallery Home Our Gallery All Other Newsletter Get Newsletter Email Subscribe Now Lets Celebrate Your Love Contact Us Now Scars Events Icon-facebook Instagram Information Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Contact contact@scarsfarm.com 863-537-6590 833-941-0989 777 ALTURAS RD, BARTOW, FL 33830 Gallery © 2022 Scars Farm. All Rights Reserved. Design by Jabstract Web Design The Basics 54+ acres of private land 9,000 sq ft modern and rustic farm venue Five climate controlled buildings Mutiple indoor and outdoor ceremony options Bridal suite overlooking lake garfield Groom’s room and private outdoor area 12 restroom building 20,000 sq ft garden area Groom’s room and private outdoor area Cinderella horse carriage Wildflower meadows Vendor building with kitchen Strawberry pond and crossing palm trees Setup and teardown of chairs & tables Custom-built moveable bar Access to entire property for photos Personalized floor plan Chairs + tables 14 hour rentals on weekends (12 hours Monday – Thursday) Facebook Twitter Skype Whatsapp Envelope Tripadvisor Book A Tour Scars Farm is a wedding venue located in Bartow, Florida. It’s an idyllic 54-acre site that offers a large strawberry-shaped pond lined with palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Barbecue or caviar, this venue has it all. Our main website is still in development. If you have any questions at all, please fill out the form below and we’ll be in touch! Name Email Phone Message Send Feedback Request We are very sorry that we did not meet your expectations… We strive for no less than 5 stars and this is not something that we take lightly. We genuinely stand behind our product. Please let us know where you felt we dropped the ball and we’ll get in touch with you soon to discuss. We’re very sorry and look forward to speaking with you."
    },
    {
      "url": "https://www.scarsevents.com/contact-us/",
      "text": "Contact Us - Scars Events Skip to content Book A Tour Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Home Venue Wedding Packages Gallery Contact Us Careers Gallery Contact Us Careers Book A Tour Contact Us Home Contact Us 863-537-6590 833-941-0989 777 Alturas Road Bartow FL, 33830 contact@scarsfarm.com HAVE A QUESTION? FILL OUT THE FORM AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. Contact Form Name Email Phone Message Send Check the Map Our Location Newsletter Get Newsletter Email Subscribe Now Lets Celebrate Your Love Scars Events Icon-facebook Instagram Information Home Venue Wedding Packages Gallery Contact Us Careers Home Venue Wedding Packages Gallery Contact Us Careers Contact contact@scarsfarm.com 863-537-6590 833-941-0989 777 ALTURAS RD, BARTOW, FL 33830 Gallery © 2022 Scars Farm. All Rights Reserved. Design by Jabstract Web Design The Basics 54+ acres of private land 9,000 sq ft modern and rustic farm venue Five climate controlled buildings Mutiple indoor and outdoor ceremony options Bridal suite overlooking lake garfield Groom’s room and private outdoor area 12 restroom building 20,000 sq ft garden area Groom’s room and private outdoor area Cinderella horse carriage Wildflower meadows Vendor building with kitchen Strawberry pond and crossing palm trees Setup and teardown of chairs & tables Custom-built moveable bar Access to entire property for photos Personalized floor plan Chairs + tables 14 hour rentals on weekends (12 hours Monday – Thursday) Facebook Twitter Skype Whatsapp Envelope Tripadvisor Book A Tour Scars Farm is a wedding venue located in Bartow, Florida. It’s an idyllic 54-acre site that offers a large strawberry-shaped pond lined with palm trees and rolling green fields that overlook beautiful wildflowers on our lake, making it a unique and tranquil backdrop to your special day. Barbecue or caviar, this venue has it all. Our main website is still in development. If you have any questions at all, please fill out the form below and we’ll be in touch! Name Email Phone Message Send Feedback Request We are very sorry that we did not meet your expectations… We strive for no less than 5 stars and this is not something that we take lightly. We genuinely stand behind our product. Please let us know where you felt we dropped the ball and we’ll get in touch with you soon to discuss. We’re very sorry and look forward to speaking with you."
    }
  ]
}