{
  "fuentes": [
    {
      "url": "https://scbwa.net/keynotes/",
      "email": "20director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/keynotes/",
      "email": "director@scbwa.net"
    },
    {
      "url": "https://www.aba.org/event/space-coast-birding-and-wildlife-festival-2/",
      "email": "info@aba.org"
    },
    {
      "url": "https://scbwa.net/field-trips-2/",
      "email": "director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/",
      "email": "20director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/",
      "email": "director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/faqs/",
      "email": "director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/faqs/",
      "email": "orders@runaboutcourier.com"
    },
    {
      "url": "https://scbwa.net/registration/",
      "email": "20director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/registration/",
      "email": "director@scbwa.net"
    },
    {
      "url": "https://www.artsbrevard.org/events/2024-space-coast-birding-and-wildlife-festival",
      "email": "info@artsbrevard.org"
    },
    {
      "url": "https://www.artsbrevard.org/events/2024-space-coast-birding-and-wildlife-festival",
      "email": "kathy@scbwa.net"
    },
    {
      "url": "https://wildsidenaturetours.com/space-coast-birding-wildlife-festival/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://wildsidenaturetours.com/space-coast-birding-wildlife-festival/",
      "email": "controls@2x.png"
    },
    {
      "url": "https://wildsidenaturetours.com/space-coast-birding-wildlife-festival/",
      "email": "info@wildsidenaturetours.com"
    },
    {
      "url": "https://mymerrittislandfl.com/event/space-coast-birding-and-wildlife-festival/",
      "email": "info@mymerrittislandfl.com"
    },
    {
      "url": "https://www.scbwi.org",
      "email": "conference@scbwi.org"
    },
    {
      "url": "https://www.scbwi.org",
      "email": "hayley@hayleyclearyart.com.jpg"
    },
    {
      "url": "https://www.nbbd.com/fly/",
      "email": "kathy@scbwa.net"
    },
    {
      "url": "https://scbwa.net/presentations/",
      "email": "director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/contact-us/",
      "email": "20director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/contact-us/",
      "email": "director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/about-the-festival/",
      "email": "20director@scbwa.net"
    },
    {
      "url": "https://scbwa.net/about-the-festival/",
      "email": "director@scbwa.net"
    }
  ],
  "mails": [
    "20director@scbwa.net",
    "chosen-sprite@2x.png",
    "conference@scbwi.org",
    "controls@2x.png",
    "director@scbwa.net",
    "hayley@hayleyclearyart.com.jpg",
    "info@aba.org",
    "info@artsbrevard.org",
    "info@mymerrittislandfl.com",
    "info@wildsidenaturetours.com",
    "kathy@scbwa.net",
    "orders@runaboutcourier.com"
  ],
  "nombre_sitio": "scbwa.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://scbwa.net/keynotes/",
      "text": "Keynote Speakers - Space Coast Birding and Wildlife Festival Skip to content director@scbwa.net January 21-25, 2026 Radisson Resort at the Port Cape Canaveral, Florida Facebook page opens in new window Instagram page opens in new window X page opens in new window Space Coast Birding and Wildlife Festival January 24th – 28th, 2024 Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact 2026 FESTIVAL SPEAKERS - COMING SOON LAST YEAR'S SPEAKER SCHEDULE Opening Keynote Wednesday, January 22nd, 6 p.m Rosemary Mosco, “Pigeons, Sparrows, and More: The Surprising Human Histories and Behaviors of Common Birds” Thursday, January 23rd, 6 p.m. Jerry Lorenz, “Return of the American Flamingo to Florida” Friday, January 24th, 6 p.m Kenn Kaufman, “ The Birds That Audubon Missed” Saturday, January 25th, 6 p.m Amar Ayyash, “Gull and Man” KEYNOTE SPEAKERS Wed. Jan. 22, 6:00pm; $20 Rosemary Mosco, “Pigeons, Sparrows, and More: The Surprising Human Histories and Behaviors of Common Birds” “ Talk Description: Ordinary birds are so often overlooked, but they’re full of compelling, entertaining, and surprising stories. Join author and cartoonist Rosemary Mosco for a lively talk about the quirky histories and behaviors of birds such as pigeons, cardinals, gulls, sparrows, and more. Rosemary is the cartoonist behind Bird and Moon , and she’ll share facts, stories, art, and jokes as she attempts to convince you to give pigeons (and other ordinary birds) a chance. Bio – Rosemary Mosco is a science writer and naturalist who makes books and cartoons that connect people with the natural world and who gives engaging talks and workshops to groups of all ages. She’s written and drawn for The New York Times, Audubon, the PBS show Elinor Wonders Why, The Old Farmer’s Almanac for Kids, Ranger Rick, and more, and makes a regular comic strip in the Cornell Lab of Ornithology’s Living Bird magazine. She creates acclaimed science books for kids and adults and the nature comic Bird and Moon, which won the National Cartoonists Society’s award for Best Online Short Form Comic and was the subject of an award-winning museum exhibit . Her climate change comics were exhibited at AAAS headquarters and the Peabody Essex Museum . Rosemary holds a Masters of Science from the Field Naturalist Program . She also served as a judge for a Festival of Bad Ad-hoc Hypotheses , judged a bird tattoo contest , and co-founded a week celebrating invertebrate butts . Thurs. Jan. 23, 6:00pm; $20 Dr. Jerry Lorenz, “ Return of the American Flamingo to Florida “ Talk Description: Over 100 American Flamingos were caught up in Hurricane Idalia, a powerful and destructive Category 4 hurricane that hit the Big Bend region in late August 2023. Dr. Jerry Lorenz, Audubon Florida’s director of research, led a February 2024 flamingo survey and believes that the flamingos recorded represent “the floor of this new population,” and that there are likely more. The return of flamingos is an encouraging sign that the birds are adapting even while rising sea levels threaten their habitats. At Merritt Island National Wildlife Refuge, a flamingo had been sighted in 1992 and not since, until Idalia. Currently 16 have settled in the nearby Mosquito Lagoon. Sightings around Florida may signal the return of one of the state’s most celebrated symbols. Dr. Lorenz will tell us all about it. Bio – Jerry Lorenz is the State Research Director for Audubon Florida and has spent more than 25 years performing applied ecological studies in Florida Bay and the Everglades. Th e effect of water management practices on Florida Bay in food web dynamics of the Roseate Spoonbill has been his primary research focus. His results have been used to design structural and operational changes that benefit ailing Florida Bay and are guiding Everglades Restoration. Although primarily focused on the ecology of spoonbills, he has also authored or co-authored scientific manuscripts on myriad subjects including mangrove ecology, conceptual ecological models, exotic fish introductions to the Everglades, reddish egret nesting ecology, wading birds in general, and most recently has delved into the ecology of American Flamingos in Florida. He earned a doctorate in Marine Biology from the University of Miami, has been a member of the Florida Keys National Marine Sanctuary Advisory Council for more than 20 years and was a founding member of the Florida Oceans Council. Fri., Jan. 24, 6:00pm; $20 Kenn Kaufman, “The Birds that Audubon Missed” Talk Description: Intense competition. Raging ambition. Towering egos. Heroic effort alternating with plagiarism and fraud. That was the state of bird study in eastern North America in the early 1800s, as a few intrepid characters raced to find the last few bird species that were still unknown to science. ​When Kenn Kaufman began delving into this period in ornithological history, he was surprised to see how many events of two centuries ago have a direct connection to our experience of birding today. The book that resulted from his research, The Birds That Audubon Missed , is a celebration of discovery and rediscovery, the lure of the unknown, the complexity of nature, and the endless power of birds to delight and amaze us. Bio – Kenn burst onto the North American birding scene as a teenager in the 1970s, pursuing birds all over the continent, chronicled in his highly amusing classic Kingbird Highway . After several years as a professional bird tour leader, taking groups to all seven continents, he transitioned to a career as a writer, editor, and illustrator. Most of his energy currently goes into writing books and painting bird portraits. His 13 books include seven titles in his own series, Kaufman Field Guides, designed to encourage beginners by making the first steps in nature study as easy as possible. His new book, The Birds That Audubon Missed ,  was published this May. Kenn is a field editor for the National Audubon Society and a Fellow of the American Ornithological Society. He is the only person to have received the American Birding Association’s lifetime achievement award twice. Kenn lives in Oak Harbor, Ohio, with his wife Kimberly Kaufman, also a dedicated naturalist. Sat. Jan. 25, 6:00pm; $20 Amar Ayyash, “ Man and Gull “ Talk Description: Many birders have a love-hate relationship with gulls. But increasingly people are being drawn to this family of birds, the Laridae, and are eagerly calling themselves “larophiles”. Amar Ayyash is both an expert on the gulls of North America and an evangelist for “gull recreation”. In this talk, he will share why gulls are so fascinating. He will also highlight key identification field marks for separating gull species and some of the often-ignored topics in gull-study such as the aging process and molt. Bio – Amar hosts the popular website anythinglarus.com and often presents at birding events throughout the continent. Much of his free time is dedicated to traveling the world to photograph and study gulls. He has published a number of articles on gulls and a new book, The Gull Guide . Amar lives in northern Illinois where he teaches mathematics. “subject to change without notice” CONTACT US! If you have any questions regarding the festival, sponsorship, or exhibiting, please give us a shout. director@scbwa.net Space Coast Birding and Wildlife Association P.O. Box 74, Mims, Florida 32754 January 21st -25th, 2026 Name Email Address Subject Your Message Δ 2023 Space Coast Birding and Wildlife Festival | Websites by Melbourne Website Designer SCBWA is a 501 (c) (3) non-profit organization Go to Top"
    },
    {
      "url": "https://www.aba.org/event/space-coast-birding-and-wildlife-festival-2/",
      "text": "Space Coast Birding and Wildlife Festival - American Birding Association Skip to content Search for: Member Portal Search for: Podcast Livestreams Birding News Magazines Columns Toggle Navigation About Our Mission The American Birding Association inspires all people to enjoy and protect wild birds. Learn More About Us Mission Diversity, Equity, and Inclusion ABA Directors ABA Staff ABA Awards Bylaws & Financial Statements Privacy Contact us PO Box 3070 Colorado Springs, CO 80934 Email: info@aba.org Phone: (800) 850-2473  or (302) 838-3660 Support Our Mission Donate today to support our mission to make birding better Donate Today Our Mission ABA Directors ABA Staff ABA Awards Diversity, Equity, and Inclusion Bylaws & Financial Statements Privacy Contact Us Birding Resources Birding Resources Just getting started? Visit our New Birders page Welcome New Birders Community Resources Welcome New Birders Birding Clubs & Organizations ABA Area Birding Trails ABA Code of Birding Ethics Festivals & Community Events Podcast All ABA Media Listing & Taxonomy ABA Checklist ABA Checklist Committee Recording Standards & Ethics Committee Listing Areas & regions ABA Recording Rules & Interpretations ABA Area Big Year Rules ABA Area Big Day Rules ABA Area Introduced Species ABA Area Repatriated Indigenous Species Listing Central Learning Identification Vault Monthly Photo Quiz Articles Livestreams ABA Area Field Guides ABA Publications Archive News & Alerts ABA Birding News ABA Blog ABA Rare Bird Alert Rare Bird Alert Facebook Group North American Rare Bird Alert (NARBA) Community Resources Welcome New Birders ABA Area Birding Trails Birding Clubs & Organizations Festivals & Community Events ABA Code of Birding Ethics American Birding Podcast All ABA Media Listing & Taxonomy ABA Checklist ABA Checklist Committee Recording Standards and Ethics Committee ABA Recording Rules and Interpretations Listing Areas and Regions ABA Area Big Year Rules ABA Area Big Day Rules ABA Area Introduced Species ABA Area Repatriated Indigenous Species Listing Central Learning Identification Vault Monthly Photo Quiz Articles Livestreams ABA Area Field Guides ABA Publications Archive! News & Alerts ABA Blog ABA Birding News ABA Rare Bird Alert Rare Bird Alert Facebook Group North American Rare Bird Alert (NARBA) Programs Programs The ABA offers a variety of programs including birding tours, community weekends, and our renowned young birders program. See All Programs Travel Katinka Domen 2025-07-31T18:36:35-04:00 Puerto Rico Endemics American Birding Association 2025-07-24T23:42:57-04:00 Chicago Spring Warblers American Birding Association 2025-07-24T22:41:18-04:00 Costa Rica American Birding Association 2025-05-16T16:58:40-04:00 Colombia: North Coast and Llanos American Birding Association 2025-08-21T19:31:43-04:00 South Africa All Tours Young Birders Young Birders Program ABA Young Birder of the Year Mentoring Program Fledgling Magazine Scholarships Connect with Other Young Birders Community Weekends Imagine a world where the joy of birding knows no boundaries – and where urban landscapes become vibrant havens for birders and  nature enthusiasts of all backgrounds. Upcoming Trips Travel Young Birders Community Weekends Connect Connect with the ABA Community There are plenty of ways to connect with the ABA and it’s members, on and offline Connect ABA Online Community Social Network General Discussion Facebook Group What’s This Bird Facebook Group Rare Bird Alert Facebook Group ABA Blog Newsletters In the Wild Festivals & Community Events Birding Clubs & Organizations ABA Community Weekends Birding Tours & Travel Young Birders Travel Partnerships Birders’ Exchange Donation Program ABA Songbird Coffee Support Become a Member Donate Ways to Give ABA Online Community Social Media Network General Discussion Facebook Group What’s This Bird Facebook Group Rare Bird Alert Facebook Group ABA Blog Newsletters In the Wild Festivals & Community Events Birding Clubs & Organizations ABA Community Weekends Birding Tours & Travel Partnerships Birders’ Exchange Donation Program ABA Song Bird Coffee Support Become a Member Donate Ways To Give Membership ABA Membership For all birders no matter what your skill level or reasons for birding Join Now Membership Join Now Renew Your Membership Manage Your Membership Member Portal Giving Donate Now Planned Giving Matching Gifts Ways to Give Amazing Benefits Monthly magazines, member-only content, partner discounts, and more. Join Now Renew Your Membership Manage Your Membership Member Portal Donate Donate Donate Now Ways To Give Gift Planning Matching Gifts Donate This event has passed. × Space Coast Birding and Wildlife Festival January 22 - January 26 The 26th Space Coast Birding and Wildlife Festival will be held January 22-26, 2025. Location is the Radisson Resort At The Port, 8701 Astronaut Blvd, Cape Canaveral, FL, 32920. Field trips, led by strong local and out-of-town leaders, go to all of the hotspots in this coastal location and inland. Visit our large exhibit hall with optics vendors, tour companies, and other vendors and exhibitors. Attend our keynotes and workshops. Visit our website and get on our mailing list for early announcement of registration. https://scbwa.net/ Event Navigation Everglades Birding Festival Fernald Preserve Winter Bird Fest Details Start: January 22 End: January 26 Event Categories: Birding Festivals , Birding Festivals - featured , Travel Event Tags: endemics , digiscoping Website: https://scbwa.net/ Organizer Space Coast Birding and Wildlife Association Phone 407-637-2525 Email director@scbwa.net View Organizer Website Venue Space Coast Birding and Wildlife Festival 1311 North Highway U.S. 1 Titusville , FL 32796 United States + Google Map Phone 321-268-5224 View Venue Website Subscribe to our newsletters PO Box 3070 Colorado Springs, CO 80934 Email: info@aba.org Phone: (800) 850-2473  or (302) 838-3660 Connect Community Social Network General Discussion Facebook Group What’s This Bird Facebook Group Rare Bird Alert Facebook Group Blog Newsletters Contact Us About Us Our Mission Diversity Equity and Inclusion ABA Directors ABA Staff ABA Awards Bylaws & Financial Statements Privacy Support the ABA Become a Member Membership Benefits Manage your Membership Donate Planned Giving Matching Gifts Ways to Give Page load link This website uses cookies and third party services. Ok Go to Top"
    },
    {
      "url": "https://scbwa.net/field-trips-2/",
      "text": "Field Trips - Space Coast Birding and Wildlife Festival Skip to content director@scbwa.net January 21-25, 2026 Radisson Resort at the Port Cape Canaveral, Florida Facebook page opens in new window Instagram page opens in new window X page opens in new window Space Coast Birding and Wildlife Festival January 24th – 28th, 2024 Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Field Trips Wednesday Thursday Friday Saturday Sunday Wednesday, January 22 St. Sebastian River Preserve SP and Fellsmere Grade Offshore Birding and Wildlife Pelagic Adventure Beginning Birding Field Trip at MINW Learn Wildlife Photography at Orlando Wetlands Park Mullet Head Island Kayak Trip at MINWR Wednesday Trip 1 Tour of Veteran’s Memorial Park “Smart” Rain Garden – Wednesday Flora & Fauna of Merritt Island NWR Airboat birding along the St. Johns Wednesday Trip 1 Mullet Head Island Kayak Trip at MINWR Wednesday Trip 2 Airboat Birding Along the St. Johns Wednesday Trip 2 Airboat Birding Along the St. Johns Wednesday Trip 3 Blue Dolphin Ultimate Boat Birding Mullet Head Island Kayak Trip at MINWR Wednesday Trip 3 Marsh Birding at the St. Johns NWR Red-cockaded Woodpecker at SSRPSP St. Sebastian River Preserve SP and Fellsmere Grade SOLD OUT This trip features some of the best birding sites in southern Brevard and Indian River Counties. With an early start at St. Sebastian River Preserve State Park we’ll see Red-cockaded Woodpeckers emerge from their roost cavities, see Brown-headed Nuthatches, hopefully see and hear Bachman’s Sparrows singing. Learn about RCWO and BHNU relocation efforts and other management projects while seeing these very special birds. After we get our fill of pinewoods inhabitants, we will cross over to the Fellsmere Grade Recreation Area to see the nesting Roseate Spoonbills and other possible species. Price: $95 includes a box lunch & snack. Date: Wednesday, Jan 22 Time: 5:00 – 11:00 a.m. Type: Bus. Departure Details: Meet at 4:45 a.m. in front of the Radisson hotel lobby to board the bus. Leader: David Simpson Participant Limit: 11 Accessibility: Moderate walking required. Clean, accessible bathrooms available at the Preserve. Additional Site Information : https://www.floridastateparks.org/St-Sebastian https://www.sjrwmd.com/lands/recreation/fellsmere Brown Booby Offshore Birding and Wildlife Pelagic Adventure Sponsored by the American Bird Conservancy The Canaveral Princess is an 85-foot, single-hull boat with excellent observation areas on the upper deck, bow and stern. We will first visit working shrimp boats for the birds that follow them. Our chumming behind the boat will result in a crowd of gulls, terns, pelicans and gannets to watch from amazingly close quarters. Once we’ve collected some birds to follow our boat, if the weather permits, we’ll set out for the Gulf Stream. Our destination will be an undersea formation known as “The Steeples,” a productive setting of cliffs and seamounts that create upwellings and current edges along the western edge of the Gulf Stream. Birds likely to be seen include Northern Gannet; Pomarine and Parasitic Jaeger and several species of gulls and terns. Birds we hope to see include Audubon’s, Cory’s, Great and Manx Shearwater; Band-rumped Storm Petrel; Bridled and Sooty Tern; Brown Booby; Red Phalarope; Black-legged Kittiwake and Sabine’s Gull. Price: $195 includes a box lunch & snack. Date: Wednesday, Jan 22 Time: 7:30 a.m. – 5:00 p.m. Type: Meet on site. Arrival Details: Meet at the Canaveral Princess, 670 Glen Cheek Drive, Port Canaveral, FL by 7:00 a.m. The Canaveral Princess docks between Rusty’s and Gator’s DocksideRestaurants in Port Canaveral. Estimated 4 minutes from the Radisson at the Port. Leaders: Bert Alm, Sergio Arias, Christian Newton, Mitchell Harris, Greg Miller Participant Limit: 64 Accessibility: Wear waterproof shoes and bring rain gear, sunscreen and sea-sickness treatment if needed.Rest rooms on board. Additional Site Information : https://orlandoprincess.com/the-boats/ Disclaimer: If the trip does not go as scheduled on Wednesday, January 22nd you will automatically be rescheduled for Monday, January 27th.  If the trip is cancelled on both dates due to inclement weather as determined by the boat’s captain, only then will you receive a full refund.  Please do not book this trip if you are not prepared to stay through Monday should the need arise due to schedule change. If the trip does not go as scheduled on Jan. 22nd and DOES go on Jan. 27th, there will be NO refunds for anyone who cannot be on board on Jan. 27th. Great Egret Beginning Birding Field Trip at MINWR SOLD OUT Join Kim for an intimate morning of instruction and observation along the highly acclaimed Black Point Wildlife Drive where there will be birds galore. She will provide helpful hints for beginners such as where to find birds, interesting behaviors, and identification tricks of the birding trade. We will see how the reddish egret dances for its food while the Little Blue Heron simply stalks its food. The large flocks of white birds will become familiar to you as Great Egrets, Snowy Egrets, White Ibis, Woodstorks and White Pelicans. Shallow impoundments filled with wading birds will offer opportunities to differentiate between egrets and herons. Birding is far more than a hobby. It is an open door to the world of nature, a touch point that connects people to the outdoors. Price: $35 Date: Wednesday, Jan 22 Time: 8:00 a.m. – 11:30 a.m. Type: Meet on site. Arrival Details: Meet at the Parrish Park boat ramp parking (under the Max Brewer Bridge) to board a small bus at 7:45. Estimated 35 minutes from the Radisson at the Port. Leader: Kimberly King-Wrenn Participant Limit: 12 Accessibility: Must be able to get on and off of bus. Some walking on flat packed roads. Restrooms available midway through the Black Point Wildlife Drive. Additional Site Information : https://www.fws.gov/refuge/merritt-island Red-shouldered Hawk Learn Wildlife Photography at Orlando Wetlands Park Orlando Wetlands Park: Orlando Wetlands Park is an ideal spot for bird photography, boasting a wide variety of bird species such as herons, egrets, and ibises. Our main Focus in this class will be how configure your camera to the right setting for stunning photographs. Note: To ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience. Price: $65 Date: Wednesday, Jan 22 Time: 8:00 a.m. – 11:30 a.m. Type: Meet on site Arrival Details: Meet at 7:45 at the Orlando Wetlands Park, 25155 Wheeler Road, Christmas.Estimated 39 minutes from the Radisson at the Port. Leaders: Jason Giraulo and Phil Lintereur Participant Limit:  15 Accessibility: Accessible restrooms are available parking lot, but not on the dikes and trails. Some walking on unpaved trails. Additional Site Information: https://www.orlando.gov/Parks-the-Environment/Directory/Wetlands-Park Salt Marsh Skipper Flora & Fauna of Merritt Island NWR SOLD OUT On this trip we will start with a hardwood hammock trail seeing oaks, maples, elms, palms, sub-tropical shrubs and the expected native species of woodland birds. Years ago a Townsends warbler spent the entire winter basically in a single large live oak. Then we will drive a short distance to a scrub/pine flatwoods habitat that borders a large marsh. There will be scrub oaks, lyonias and various scrub species. Florida Scrub-Jays are probable and Roseate Spoonbills, egrets, shorebirds and eagles are possible. Price: $30 Date: Wednesday, Jan 22 Time: 9:00 a.m. – 12:00 p.m. Type: Meet on site. Arrival Details: Meet at 8:45 at the Oak Hammock Trail parking lot on SR 406, approx. 1/2 mile east of the MINWR Visitor Center. Estimated 41 minutes from the Radisson at the Port. Tip: SR 406 is also Beach Road/A.Max Brewer Memorial Parkway. Leaders: Jim and Kay Stahl Participant Limit: 12 Accessibility: Easy walking on a boardwalk and flat, dry trails required. Bathrooms available 1/2 mile away at the MINWR Visitor Center. Additional Site Information : https://www.fws.gov/refuge/merritt-island Mangrove Tree Crab Mullet Head Island Kayak Trip at MINWR – Wed Trip 1 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $ 60.00 Date: Wednesday, Jan 22 Time: 9:00 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman, Jesse Huth Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Tour of Veterans Memorial Park “Smart” Rain Garden – Wednesday Discover the newly enhanced Veterans Memorial Park, a cherished community space that harmoniously blends natural beauty with innovative technology improving resilience for the City of Cape Canaveral. The park recently underwent a transformative upgrade made possible by a $1 million National Science Foundation CIVIC Challenge grant. The focus of this tour will be the new “Smart” Rain Garden, a sophisticated bioswale system monitored by a network of remote sensors and capable of holding 150,000 gallons of stormwater filtered by nearly 1,000 Florida-friendly and native plants which create a thriving habitat for local pollinators. Join us under majestic oak trees, including one unique specimen over 250 years old, to observe butterflies and bees while learning more about this example of green stormwater infrastructure. Veterans Memorial Park provides a model for how urban spaces can mitigate flood risks and protect water quality, while also providing vital natural areas for community members – wildlife and humans alike. Price: $ 10.00 Date: Wednesday, Jan 22 Time: 10:00 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at 9:45 at the Cape Canaveral Library, 201 Polk Ave, Cape Canaveral, FL. Leaders: Amy Reaume, John Stiner Participant Limit: 20 Accessibility: Restrooms and water are available at the neighboring Cape Canaveral library. The rain garden can be viewed from surrounding sidewalks. Visitors who would like to go down into the rain garden which has uneven terrain (a slope and rocks) should wear closed toed shoes. Additional Site Information: https://blogs.ifas.ufl.edu/brevardco/2024/10/30/smart-rain-garden-series-veterans-memorial-park-location/ Snail Kite Airboat birding along the St. Johns – Wed Trip 1 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Wednesday, Jan 22 Time: 10:00 a.m. – 11:30 a.m. Type: Meet on site. Arrival Details: Arrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Betty Salter Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ American White Pelican Mullet Head Island Kayak Trip at MINWR – Wed Trip 2 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Wednesday, Jan 22 Time: 12:00 p.m. – 2:00 p.m. Type: Meet on site Arrival Details: Meet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Crested Caracara Airboat birding along the St. Johns – Wed Trip 2 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Wednesday, Jan 22 Time: 12:00 p.m. – 1:30 p.m. Type: Meet on site. Arrival Details: Arrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ Immature Bald Eagle Airboat Birding Along the St. Johns – Wed Trip 3 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Wednesday, Jan 22 Time: 2:00 p.m. – 3:30 p.m. Type: Meet on site. Arrival Details: Arrive by 1:45 p.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ Osprey with Redear Sunfish Blue Dolphin Ultimate Boat Birding The Blue Dolphin is a 49-passenger Coast Guard approved pontoon boat operated by Mark and Michele Anderson. This four-hour adventure will start at Kelly Park East, which is just 6 minutes from the Radisson Resort. We will cross the Banana River, pass through the Canaveral Locks and into Port Canaveral where you may see the Space X fleet of rocket recovery ships and plenty of birds! In addition, you are likely to see dolphins. A flock of American White Pelicans is normally seen at the entrance to the locks and during the cruise you will see Ospreys and other raptors, Wood Storks, Northern Gannets, pelicans, cormorants, gulls, terns and lots of egrets and herons. Past trips have produced such uncommon visitors as Common Eider, Magnificent Frigatebird Sabine’s Gull and Common Loon. We are looking forward to seeing you aboard the Blue Dolphin. Price: $100 includes snack, water, and boxed lunch. Date: Wednesday, Jan 22 Time: 1:00 p.m. – 5:00 p.m. Type: Meet on site Arrival Details: Arrive at 12:45 p.m. at Kelly Park East, 2550 N. Banana River Drive, Merritt Island. Estimated 7 minutes from the Radisson at the Port. Leaders: Wesley Homoya,Christian Newton Participant Limit: 46 Accessibility: Handicapped Accessible. Rest room on boat. Sunscreen is recommended. Additional Site Information : https://www.spacecoastrivertours.com/index.html American Flamingo Mullet Head Island Kayak Trip at MINWR – Wed Trip 3 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Wednesday, Jan 22 Time: 3:00 p.m. – 5:00 p.m. Type: Meet on site Arrival Details: Meet at 2:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Sora Marsh Birding at the St. Johns NWR – Wed SOLD OUT A caravan of USFWS trucks will carry attendees into the St. Johns National Wildlife Refuge which is a restricted access property. This preserve was the last home of the now-extinct Dusky Seaside Sparrow. These marshes west of Titusville are unique because saline water seeps to the surface from a layer of salty water that lies above the Floridan Aquifer, creating marine-type habitats in the middle of a huge freshwater floodplain – perfect for secretive marsh birds. The Black Rail is one of the most elusive wetland birds and is on the state and federal endangered and threatened species lists. King Rails and Virginia Rails are also possible. As the sun sets on the marsh horizon and wading birds flock to their roosts, we will make stops and listen for elusive rail calls. Price: $65 Includes a snack. Date: Wednesday, Jan 22 Time: 4:15 p.m. – 7:15 p.m. Type: Meet on site. Arrival Details: Arrive at  4:15 at Cracker Barrel Restaurant, 4745 Helen Hauser Blvd, Titusville in the south parking area. Estimated 25 minutes from the Radisson at the Port. Leaders: David Simpson, Kim King-Wrenn Participant Limit: 14 Accessibility: There are no restrooms on site. You may be walking through water, mud, and grass. Old shoes, or knee boots are advised. Additional Site Information : https://www.fws.gov/refuge/st-johns Thursday, January 23 Lake Apopka North Shore Shiloh’s Sharptails, Marshbirds and More Salt Lake Wildlife Management Area Trailer Tour Birding Rotary Park Learn Wildlife Photography at Black Point Wildlife Drive Florida Scrub Jay Hike at Cruickshank Sanctuary Chain of Lakes Park Airboat Birding Along the St. Johns – Thursday Early Easy Bird & Wildlife Photography with Sony Mirrorless Cameras at Orlando Wetlands – Thursday Tour of Hubbs-SeaWorld Research Institute’s Coconut Point Lab – Trip 1 Mullet Head Island Kayak Trip at MINWR – Thursday Trip 1 Barrier Island Center and Pelican Island Cruise Airboat birding along the St. Johns – Thursday – Trip 1 Tour of Hubbs-SeaWorld Research Institute’s Coconut Point Lab – Trip 2 Airboat Birding Along the St. Johns – Thursday – Trip 2 Mullet Head Island Kayak Trip at MINWR – Thursday Trip 2 Airboat Birding Along the St. Johns – Thursday – Trip 3 Blue Dolphin Ultimate Boat Birding and Wildlife Journey – Thursday Mullet Head Island Kayak Trip at MINWR – Thursday Trip 3 Marsh Birding at the St. Johns NWR – Thursday Barred Owl, Lake Apopka Lake Apopka North Shore SOLD OUT This property is one of the premier locations in the southeastern United States to observe birds. The list of birds found here continues to grow, with over 370 species having been recorded. During the winter months, more than 150 species regularly use the property, from showy herons and egrets to ducks and shorebirds and numerous tiny warblers and flycatchers. Other wildlife found here includes alligators, turtles, bobcats, otters, raccoons, snakes and coyotes. Former farmlands make up the Lake Apopka North Shore restoration area. The St. Johns River Water Management District’s major activities include marsh and floodplain restoration and the creation of a marsh flow-way. Circulating lake water through restored wetlands filters Lake Apopka’s waters. If the weather allows, attendees will tour in the District’s bench trailer, starting with the dawn chorus at the most optimum spot and continuing on the wildlife drive, which will be closed to the public. Price: $135 Includes lunch and snacks. Date: Thursday, Jan 23 Time: 5:00 a.m. – 4:00 p.m. Type: Bus Departure Details: Meet at 4:45 in front of the Radisson hotel lobby to board the bus. Leaders: Chris Newton, Brady Bailo, Greg Miller Participant Limit: 22 Accessibility: Some walking required. Porta-potties are available throughout the restoration area. Additional Site Information : https://www.sjrwmd.com/lands/recreation/lake-apopka/ Clapper Rail Shiloh’s Sharptails, Marshbirds and More SOLD OUT This trip begins in the marshes where Turnbull Creek drains into the northern end of the Indian River Lagoon. There we will look for both Nelson’s and Saltmarsh Sparrows, Sedge Wrens and Clapper Rails. Short-eared Owls are seen here occasionally as well. After ample time in the marsh we’ll walk east along the dike system that skirts the edge of Shiloh’s extensive marshes and impoundments looking for ducks, shorebirds and waders. This is an area of rich estuaries and ponds that teem with wildlife. Price: $65 Date: Thursday, Jan 23 Time: 6:15 a.m. 11:00 a.m. Type: Meet on site Arrival Details: Meet 6:15 a.m. at the Circle K located at 6004 US-1, Mims, FL 32754. It is on the corner of US 1 and Magoon Ave. Estimated 38 minutes from the Radisson at the Port. Leaders: Mitchell Harris, Gabriel Lugo Participant Limit: 15 Accessibility: No rest rooms on site. Bring Muck Boots or shoes that you don’t mind getting wet for the sparrow search. Walk will be 3-4 four miles long on unpaved trails. Additional Site Information : https://www.fws.gov/refuge/merritt-island Bachman’s Sparrow Salt Lake Wildlife Management Area Trailer Tour Salt Lake WMA’s 8,000 acres border three large lakes and the St. Johns River in northern Brevard County. Don’t miss this chance to explore it in a bench seat trailer. Home to a spectacular range of natural communities, this beautiful property includes pine flatwoods, hardwood hammocks and oak scrub on higher ground. Oak and cabbage palm hammocks, swamps, freshwater marshes, wet prairies, and salt flats occupy the wetter locales. Numerous wading birds, shorebirds, waterfowl, and raptors can be found on the lakes and marshes and the river. Bald Eagles and Wild Turkeys are commonly seen. The flatwoods provide good habitat for woodpeckers and songbirds, such as the Eastern Bluebird and Bachman’s Sparrow. Gopher tortoises, deer, feral hogs, river otters, alligators and turtles may also be seen. This extraordinary opportunity to be able to ride through the management area rather than walk it, as well as the reasonable cost, is a benefit of the Watchable Wildlife Public Access Program of the Florida Fish and Wildlife Conservation Commission. Price: $30 Date: Thursday, Jan 23 Time: 6:45 a.m. -11:30 a.m. Type: Meet on site Arrival Details: Meet at Salt Lake WMA, 1590 Arch Rd., Mims. Park at the main public parking area for Salt Lake WMA. Estimated 36 minutes from the Radisson at the Port. Leaders: Tom Ledford, Jeremiah Oden Participant Limit: 26 Accessibility: There is a porta potty located at the Salt Lake WMA main entrance. No restroom facilities are available during the trip. Additional Site Information : https://myfwc.com/recreation/lead/salt-lake/ Milkweed butterfly chrysalis at Rotary Park Birding Rotary Park Explore this beautiful park with naturalist, educator, and birder Kate Wells. Our bird walk will begin on the front porch of Rotary Park Nature Center, which is located in the center of the park, directly across from the large pavilion. There are binoculars and bird books available to borrow upon request. We will be looking and listening for winter songbirds such as warblers, sparrows, and buntings, as well as year-round birds such as woodpeckers, gnatcatchers, cardinals, and jays. Red-shouldered Hawks and Osprey will almost certainly be in attendance; with some luck, we may even encounter Sandhill Cranes. As the park is surrounded by the Indian River Lagoon, frequent flyovers include pelicans, herons, egrets, cormorants, and anhinga. Price: $20 Date: Thursday, Jan 23 Time: 7:15 a.m. – 9:30 a.m. Type: Meet on site Arrival Details: Meet at Rotary Park, 1899 South Courtenay Parkway, Merritt Island, FL 32952 Note that there a few parks in Brevard County named Rotary Park, make sure you enter this address into your GPS. Approximately 12. 4 miles  (20 minutes) from the Radisson Resort at the Port. Leader: Kate Wells, PhD, Rotary Park Environmental Program Supervisor, Carlos Bethancourt Participant Limit: 20 Accessibility: There are accessible restrooms and trails throughout the park. Highly recommended: Water-resistant shoes, sun protection, insect bite prevention, and drinking water. The park does not have food sales or vending machines. Additional Site Information: https://www.brevardfl.gov/ParksAndRecreation/ParksByCity/ParksInMerrittIsland/Rotary Northern Shovelers at Black Point Wildlife Drive Learn Wildlife Photography at Black Point Wildlife Drive Situated within the Merritt Island National Wildlife Refuge, Black Point Wildlife Drive is a 7-mile scenic route that offers exceptional bird photography opportunities. This drive features a variety of habitats, including salt marshes and mudflats, attracting numerous bird species such as roseate spoonbills, egrets, and herons. This class will focus on the use of blinds, selecting of lenses, protecting your gear in salt air conditions, and having the birds come to you. Note: To ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience. Price: $65 Date: Thursday, Jan 23 Time: 8:00 – 11:30 a.m. Type: Meet on site Arrival Details: Meet at 7:45 a.m at the Parrish Park Boat Ramp Parking Lot, Max Brewer Memorial Pkwy, Titusville. Estimated 33 minutes from the Radisson at the Port. Leaders: Jason Giraulo and Phil Lintereur Participant Limit: 15 Accessibility: Restroom facilities are available midway through drive. Additional Site Information: https://www.fws.gov/refuge/merritt-island Florida Scrub Jay at Cruickshank Sanctuary Florida Scrub Jay Hike at Cruickshank Sanctuary SOLD OUT The Helen and Alan Cruickshank Sanctuary in Rockledge is considered to be one of the best EEL Sanctuary properties to observe Florida Scrub-Jays, a threatened species that is Florida’s only endemic bird. When the environment meets their needs, Florida Scrub-Jays will spend their entire lives on the same lands. The Cruickshank Sanctuary is located on the Atlantic Coastal Ridge, a sandy relic maritime dune line that extends along the Florida East Coast from Jacksonville down to Miami. Patches of oak, sand pine scrub, and freshwater depression marshes add to the Sanctuary’s diversity. Since the EEL Program began land management at the 168-acre Sanctuary, the Florida Scrub-Jay population has increased from a few visiting birds to over 50 birds in 8 separate family territories. Gopher Tortoises, Red-bellied Woodpeckers, and other species requiring scrub habitat are often observed in the Sanctuary. Price: $30 Date: Thursday, Jan 23 Time: 8:30 a.m. – 10:30 a.m. Type: Meet on site Arrival Details: Meet at the Helen & Alan Cruickshank Sanctuary, 360 Barnes Blvd, Rockledge, FL. Estimated 25 minutes from the Radisson at the Port. Carpooling is highly recommended as spaces are limited. Try using the official Festival app if you want to find others looking to car pool. Leaders: Bert and Val Alm, Chip Clouse Participant Limit: 12 Accessibility: No rest rooms on site. Walking on unpaved trails required. Additional Site Information : https://www.brevardfl.gov/EELProgram/Sanctuaries/HelenAndAllanCruickshankSanctuary Red-shouldered Hawk at Chain of Lakes Park Chain of Lakes Park SOLD OUT This recreation complex includes many habitats such as artificial lakes and wetlands (salt marsh and mangroves), hardwood and sabal palm hammocks. Species seen here include Eagles, Hawks, Wood Storks, Glossy Ibis, Cattle Egrets, Roseate Spoonbills, Mottled Ducks, gulls and terns. And, if you walk through the hammock, you might even catch get a look at Painted Buntings! There is also a 5-story observation deck. Price: $25 Date: Thursday, Jan 23 Time: 8:30 a.m. – 11:00 a.m. Arrival Details: Meet at 2300 Truman Scarborough Way, Titusville at 8:15 a.m.  From Truman Scarborough Way, turn right onto Snowy Egret Way. Park in the lot at the end of Snowy Egret Way, by the Home of the Titans sign. Type: Meet on site. Accessibility: Restrooms available on the corner of Chain of Lakes Drive and Snowy Egret Way. Walking on a combination of paved and unpaved trails and some boardwalk. Leaders: David Simpson Participant Limit: 20 Additional Site Information: https://www.brevardfl.gov/ParksAndRecreation/ParksByCity/ParksInTitusville/ChainOfLakes Immature American Bald Eagle Airboat Birding Along the St. Johns – Thursday Early Trip You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Thursday, Jan 23 Time: 8:30 a.m. – 10:00 a.m. Type: Meet on site. Arrival Details: Arrive by 8:15 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ Male Blue-ringed Dancer at Orlando Wetlands Easy Bird & Wildlife Photography with Sony Mirrorless Cameras at Orlando Wetlands – Thursday Bird and wildlife photography will never be easy but we don’t have to make it any harder than it is.There is no need to shoot in manual and RAW. If you learn how your camera works and trust it for focus and exposure, it will leave you free to find and frame the birds and wildlife you want to photograph. Using the newer Sony mirrorless cameras  as an example, I will show you how to bring back consistently satisfying images of birds and wildlife. Price: $65 Date: Thursday, Jan 23 Time: 8:30 a.m. – 11:30 a.m. Type: Meet on site Arrival Details: Meet in the parking area for the Orlando Wetlands Park. Leaders: Stephen Ingraham (Point and Shoot Nature Photographer) Participant Limit: 10 Accessibility: Walking on possibly uneven/unpaved trails. Restrooms available at visitors center, but not on trails. Additional Site Information : https://www.orlando.gov/Our-Government/Departments-Offices/Public-Works/Water-Reclamation-Division/Orlando-Wetlands Tour of Hubbs-SeaWorld Research Institute’s Coconut Point Lab – Trip 1 Join us for a limited-access tour of the Hubbs-SeaWorld Research Institute’s (HSWRI) Coconut Point Lab in Melbourne Beach, where our team leads Florida’s busiest marine mammal stranding program. The tour will provide a behind the scenes look at our marine mammal and habitat conservation efforts, including an introduction to Indian River Lagoon dolphin population ecology, ongoing research, and our marine mammal stranding response program. The tour includes a walkthrough of our small research facility, featuring a research lab, marine mammal tissue bank, and necropsy lab. Guests will also have a chance to view Brevard Zoo’s on-site seagrass nursery, which, when fully operational, will play a critical role in IRL habitat restoration efforts. With a legacy dating back to 1963, HSWRI is committed to the conservation of marine life and the health of the world’s oceans. The institute’s work in the Indian River Lagoon (IRL) exemplifies its mission to apply scientific solutions to the many challenges facing marine ecosystems. Through research, education, and outreach, HSWRI has made significant contributions to marine conservation, including efforts to protect IRL dolphins and other vulnerable species​​​​. Price: $30.00 Date: Thursday, Jan 23 Time: 9:00 a.m. – 10:30 a.m. Type: Meet on site Arrival Details: Hubbs-SeaWorld Research Institute’s Coconut Point Lab, 4020 S. Hwy A1A, Melbourne Beach, FL. Due to limited parking, car pooling is highly encouraged. Leaders: Dr. Jeff Eblem, TBD Participant Limit: 12 Accessibility: Our facility is handicap accessible, and children aged 12 or older are welcome to join. Additional Site Information: https://hswri.org/ Mullet Head Island Kayak Trip at MINWR – Thursday Trip 1 SOLD OUT Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Thursday, Jan 23 Time: 9:00 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman, Jesse Huth Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Lesser and Greater Yellowlegs at Pelican Island NWR Barrier Island Center and Pelican Island Cruise SOLD OUT This trip begins with a personal tour of the Barrier Island Education Center (BIEC) and a video followed by scoping for shorebirds and sea birds at the boardwalk along the Atlantic Ocean. The BIEC is located inside the Archie Carr National Wildlife Refuge (ACNWR) on South Melbourne Beach. Continuing the bus ride to Sebastian, you will arrive at Capt. Hiram’s Resort for a late lunch and a boat tour to Pelican Island (our first National Wildlife Refuge) on the River King, a 45-foot USCG approved pontoon boat. 16 species nest on the 4.2-acre Pelican Island, including Brown Pelican, Wood Stork, Anhinga, American Oystercatcher, and many herons and egrets. On the water look for American White Pelican, Lesser Scaup, Mottled Duck, Common Loon, Horned Grebe, Pied-billed Grebe, Red-breasted Merganser and many gulls and terns. Bottle-nosed dolphins are probable and sea turtles are possible. Price: $135. Includes snacks. In addition, you should bring money for a 2:00 p.m. lunch at Blackfin’s Riverfront Grill at Capt. Hiram’s Resort. Date: Thursday, Jan 23 Time: 9:30 a.m. – 7:30 p.m. Type: Bus Departure Details: Meet at 9:15 a.m. in front of the Radisson hotel lobby to board the bus. Leaders: Wesley Homoya, Ray Mojica, Charlie Venuto Participant Limit: 12 Accessibility: Rest rooms available at stops. Some walking on paved and unpaved trails. Additional Site Information : https://www.brevardfl.gov/EELProgram/Sanctuaries/BarrierIslandSanctuary https://hirams.com/things-to-do/riverking/ Disclaimer: In the event of inclement weather as determined by the captain, participants on the trip will view Pelican Island and the birds coming in to roost for the evening from the Refuge’s land-based location on the barrier island. Snail Kite Airboat birding along the St. Johns – Thursday – Trip 1 – SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Thursday, Jan 23 Time: 10:00 a.m. – 11:30 a.m. Type: Meet on site. Arrival Details: Arrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: João Jara Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ Tour of Hubbs-SeaWorld Research Institute’s Coconut Point Lab – Trip 2 Join us for a limited-access tour of the Hubbs-SeaWorld Research Institute’s (HSWRI) Coconut Point Lab in Melbourne Beach, where our team leads Florida’s busiest marine mammal stranding program. The tour will provide a behind the scenes look at our marine mammal and habitat conservation efforts, including an introduction to Indian River Lagoon dolphin population ecology, ongoing research, and our marine mammal stranding response program. The tour includes a walkthrough of our small research facility, featuring a research lab, marine mammal tissue bank, and necropsy lab. Guests will also have a chance to view Brevard Zoo’s on-site seagrass nursery, which, when fully operational, will play a critical role in IRL habitat restoration efforts. With a legacy dating back to 1963, HSWRI is committed to the conservation of marine life and the health of the world’s oceans. The institute’s work in the Indian River Lagoon (IRL) exemplifies its mission to apply scientific solutions to the many challenges facing marine ecosystems. Through research, education, and outreach, HSWRI has made significant contributions to marine conservation, including efforts to protect IRL dolphins and other vulnerable species​​​​. Price: $30.00 Date: Thursday, Jan 23 Time: 11:00 a.m. – 12:30 p.m. Type: Meet on site Arrival Details: Hubbs-SeaWorld Research Institute’s Coconut Point Lab, 4020 S. Hwy A1A, Melbourne Beach, FL. Due to limited parking, car pooling is highly encouraged. Leaders: Dr. Jeff Eblem, TBD Participant Limit: 12 Accessibility: Our facility is handicap accessible, and children aged 12 or older are welcome to join. Additional Site Information: https://hswri.org/ Crested Caracara Airboat Birding Along the St. Johns – Thursday – Trip 2 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Thursday, Jan 23 Time: 12:00 p.m. – 1:30 p.m. Type: Meet on site. Arrival Details: Arrive by 11:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ American White Pelican Mullet Head Island Kayak Trip at MINWR – Thursday Trip 2 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Thursday, Jan 23 Time: 12:00 p.m. – 2:00 p.m. Type: Meet on site Arrival Details: Meet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman, Special Guest: Dr. Jerry Lorenz Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Caspian Tern Blue Dolphin Ultimate Boat Birding and Wildlife Journey – Thursday The Blue Dolphin is a 49-passenger Coast Guard approved pontoon boat operated by Mark and Michele Anderson. This four-hour adventure will start at Kelly Park East, which is just 6 minutes from the Radisson Resort. We will cross the Banana River, pass through the Canaveral Locks and into Port Canaveral where you may see the Space X fleet of rocket recovery ships and plenty of birds! In addition, you are likely to see dolphins. A flock of American White Pelicans is normally seen at the entrance to the locks and during the cruise you will see Ospreys and other raptors, Wood Storks, Northern Gannets, pelicans, cormorants, gulls, terns and lots of egrets and herons. Past trips have produced such uncommon visitors as Common Eider, Magnificent Frigatebird Sabine’s Gull and Common Loon. We are looking forward to seeing you aboard the Blue Dolphin. Price: $100 includes snack & light lunch from Fishlips Waterfront Bar and Grill. Date: Thursday, Jan 23 Time: 1:00 p.m. – 5:00 p.m. Type: Meet on site Arrival Details: Arrive at 12:45 p.m. at Kelly Park East, 2550 N. Banana River Drive, Merritt Island. Estimated 7 minutes from the Radisson at the Port. Leaders: Dave Hartgrove,Dave Grant Participant Limit: 46 Accessibility: Handicapped Accessible. Rest room on boat. Sunscreen is recommended. Additional Site Information : https://www.spacecoastrivertours.com/index.html American Flamingo Mullet Head Island Kayak Trip at MINWR – Thursday Trip 3 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Thursday, Jan 23 Time: 3:00 p.m. – 5:00 p.m. Type: Meet on site Arrival Details: Meet at 2:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Sora Marsh Birding at the St. Johns NWR – Thursday SOLD OUT A caravan of USFWS trucks will carry attendees into the St. Johns National Wildlife Refuge which is a restricted access property. This preserve was the last home of the now-extinct Dusky Seaside Sparrow. These marshes west of Titusville are unique because saline water seeps to the surface from a layer of salty water that lies above the Floridan Aquifer, creating marine-type habitats in the middle of a huge freshwater floodplain – perfect for secretive marsh birds. The Black Rail is one of the most elusive wetland birds and is on the state and federal endangered and threatened species lists. King Rails and Virginia Rails are also possible. As the sun sets on the marsh horizon and wading birds flock to their roosts, we will make stops and listen for elusive rail calls. Price: $65 Includes a snack. Date: Thursday, Jan 23 Time: 4:15 p.m. – 7:15 p.m. Type: Meet on site. Arrival Details: Arrive at  4:15 at Cracker Barrel Restaurant, 4745 Helen Hauser Blvd, Titusville in the south parking area. Estimated 25 minutes from the Radisson at the Port. Leaders: Kim King-Wrenn, David Simpson Participant Limit: 14 Accessibility: There are no restrooms on site. You may be walking through water, mud, and grass. Old shoes, or knee boots are advised. Additional Site Information : https://www.fws.gov/refuge/st-johns Friday, January 24 St. Sebastian River Preserve SP and Fellsmere Grade Tosohatchee Wildlife Management Area Manatees of Blue Spring and St. Johns River Cruise Orlando Wetlands Park Trailer Tour – Friday Learn Wildlife Photography at Gleason Park Gulls and other Waterbirds at Jetty Park Florida Wildlife Hospital Photo Shoot Winter Waders, Warblers & Waterfowl at Sams House Turkey Creek Sanctuary Mullet Head Island Kayak Trip at MINWR – Friday Trip 1 Florida Wildlife Hospital Tour Airboat birding along the St. Johns – Friday Trip 1 Tour of Veterans Memorial Park “Smart” Rain Garden – Friday Mullet Head Island Kayak Trip at MINWR – Friday Trip 2 Airboat Birding Along the St. Johns – Friday Trip 2 Blue Dolphin Ultimate Boat Birding and Wildlife Journey – Friday Airboat Birding Along the St. Johns – Friday Trip 3 Mullet Head Island Kayak Trip at MINWR – Friday Trip 3 Owls and Rails of MINWR Brown-headed Nuthatch, SSRPSP St. Sebastian River Preserve SP and Fellsmere Grade This trip features some of the best birding sites in southern Brevard and Indian River Counties. With an early start at St. Sebastian River Preserve State Park we’ll see Red-cockaded Woodpeckers emerge from their roost cavities, see Brown-headed Nuthatches, hopefully see and hear Bachman’s Sparrows singing. Learn about RCWO and BHNU relocation efforts and other management projects while seeing these very special birds. After we get our fill of pinewoods inhabitants, we will cross over to the Fellsmere Grade Recreation Area to see the nesting Roseate Spoonbills and other possible species. Price: $95 includes a snack. Date: Friday, Jan 24 Time: 5:00 – 11:00 a.m. Type: Bus. Departure Details: Meet at 4:45 a.m. in front of the Radisson hotel lobby to board the bus. Leaders: David Simpson Participant Limit: 11 Accessibility: Moderate walking required. Clean, accessible bathrooms available at the Preserve. Additional Site Information : https://www.floridastateparks.org/St-Sebastian https://www.sjrwmd.com/lands/recreation/fellsmere Eastern Bluebird Tosohatchee Wildlife Management Area SOLD OUT The Tosohatchee marshes are feeding areas for wading birds and, during winter months, host large numbers of migrating waterfowl. Forested uplands support deer, bobcats, gray foxes, wild turkeys, woodpeckers, hawks, owls, and songbirds. Some of the threatened and endangered species found at the reserve include Bald Eagle, Wood Stork, Eastern Indigo Snake, and Gopher Tortoise. Birds of interest include Bachman’s Sparrow, Brown-headed Nuthatch, Eastern Bluebird, Red-headed Woodpecker, and Florida Sandhill Crane. Shaped by alternating cycles of fire and flood, Tosohatchee WMA is a mosaic of marshes, swamps, pine flatwoods and oak hammocks that borders 19 miles of the St Johns River. Deep inside the reserve, Jim Creek flows through some of the last remaining virgin cypress swamps in Florida. Price: $65 includes a snack sack. In addition, there is a $3 Entrance fee per car that you must pay on entering the park. Date: Friday, Jan 24 Time: 6:15 a.m. – 11:30 a.m. Type: Meet on site Arrival Details: Meet Up at Tosohatchee WMA 3365 Taylor Creek Road, Christmas FL 32709. Once through the entrance gate, proceed 0.1 miles to Parking Area #1. This parking area is directly across from the hunting check station. We will leave from this location. Estimated 28 minutes from the Radisson at the Port. Note: Once parked, participants will need to carpool with someone that has an appropriate vehicle that will not get stuck in the mud or receive water damage while on our roads. Vehicles such as a 4-wheel drive or all-wheel drive. Leaders: Bert and Val Alm (Space Coast Audubon) , Gina and Adam Kent Participant Limit: 18 Accessibility: This is a self-driving tour with stops along the way for short walks. There are composting toilets at the entrance but not out on the roads and trails. Be sure the you dress in warm clothing and be prepared for wet conditions, even if it is not raining. Additional Site Information : https://myfwc.com/recreation/lead/tosohatchee/things-to-do/ Purple Gallinule Manatees of Blue Spring and St. Johns River Cruise SOLD OUT This special trip consists of a visit to Blue Spring State Park (BSSP). The morning will start with a walk along the shore of Blue Spring Run to observe Florida’s most charismatic megafauna, the West Indian Manatee, and bird the woodlands surrounding the spring run. What makes BSSP so unique and special is that during colder months its crystal-clear waters are one of Florida’s best places to watch the manatees. A box lunch will be provided on a river cruise onboard a U.S. Coast Guard approved pontoon boat that was specially designed to ply the shallow backwaters of this unique section of the historic St. Johns River. The captain is a licensed Coast Guard captain who knows the history of the area and the wildlife that abounds. It leaves from BSSP, passes through a historic cypress logging canal and into the Hontoon Dead River, where you will experience the wild and pristine Florida swamp as it has been over the centuries. Highlights from the trip in 2020 included more than a dozen Purple Gallinules, over two dozen Limpkins, more than three dozen Anhingas, both night herons and 5 species of woodpeckers. Price: $120 includes a box lunch and snack. Date: Friday, January 24 Time: 6:30 a.m. – 2:45 p.m. Type: Bus Departure Details: Meet at 6: 15 in front of the Radisson hotel lobby to board the bus. Leaders: Laurilee Thompson, Serge Arias, Chris Newton Participant Limit: 22 Accessibility: Marine head on the boat. Handicapped Accessible. Additional Site Information : https://www.floridastateparks.org/parks-and-trails/blue-spring-state-park Woodstork and Spoonbill at Orlando Wetlands Park Orlando Wetlands Park Trailer Tour – Friday SOLD OUT This regional water treatment area, owned by the City of Orlando, began receiving reclaimed water in 1987, submerging the 1700-acre Sun Charm Ranch beneath millions of gallons of treated sewage. For 30 years the City closed the park during winter months so that the former owners could hunt waterfowl, until 2016 when it bought the hunting rights. Join us as we take a trip into the park where more than 220 bird species have been identified including Wood Storks, Bald Eagles, Crested Caracaras, Limpkins, Purple Gallinules, rails and spoonbills. Painted Buntings lurk in some of the dense vegetation bordering the 20 miles of roads and woodland trails leading through marshes, hardwood hammocks and along scenic lakes. Large numbers of waterfowl and wading birds are expected. Other wildlife found here includes alligators, turtles, deer, hogs, bobcats, otters, raccoons, opossums, snakes and coyotes. There will be multiple stops with walking to spy the best birds. Price: $90 Date: Friday, Jan 24 Time: 7:30 a.m. – 11:00 a.m. Type: Meet on site. Arrival Details: Meet at the Orlando Wetlands Park, 25155 Wheeler Road, Christmas.Estimated 39 minutes from the Radisson at the Port. Leaders: João Jara,Wayne Klockner Participant Limit: 20 Accessibility: Accessible restrooms are available parking lot, but not on the dikes and trails. Some walking on unpaved trails. Additional Site Information : https://www.orlando.gov/Parks-the-Environment/Directory/Wetlands-Park Softshell Turtle at Gleason Park Learn Wildlife Photography at Gleason Park This is a fantastic park located in Indian Harbor beach with a series of diverse environments which include Upland, ponds and a short walk to the Indian River which is key for Warblers (ie Redstarts, Thrushes, Merlins and Cooper’s Hawk, this is a perfect area to learn how to let birds come to you, how to optimize point and shoots, getting the right exposures and the use of tri and mono pods. Note: To ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience. Price: $65 Date: Friday, Jan 24 Time: 8:00 – 11:30 a.m. Type: Meet on site Arrival Details: Meet at 7:45 at Gleason Park, 1233 Yacht Club Blvd, Indian Harbour Beach, FL 32937 Leaders: Jason Giraulo and Phil Lintereur Participant Limit: 15 Accessibility: Accessible rest rooms at park. Walking required over sand, unpaved trails, and board walk. Additional Site Information: https://www.indianharbourbeach.org/Facilities/Facility/Details/Gleason-Park-5 Snowy Plover at Jetty Park Gulls and Other Waterbirds at Jetty Park SOLD OUT Don’t miss out on this fun opportunity to spend time in the field with gull expert Amar Ayyash. Lush vegetated dunes give way to a wide shoreline where all types of beach birds gather. Several species of gulls and terns, shorebirds and even wading birds feed in the surf. This natural habitat provides a pleasant backdrop to compare plumages and age classes of several gull species. We’ll look for gannets, loons and other occasional visitors such as a jaegers, especially if shrimp boats are out. Price: $60 Date: Friday, Jan 24 Time: 8:00 a.m. – 12:00 p.m. Type: Meet your guides at 7:45 at the Radisson in front of the Expo Hall for car pooling and to receive your Jetty Park passes. Arrival Details: Carpool to Jetty Park: 400 Jetty Park Drive, Cape Canaveral, FL 32920. Follow Jetty Park Rd to the first paved parking lot. Meet in front of the changing rooms. Estimated 6 minutes from the Radisson at the Port. Leaders: Amar Ayyash, Sierra Mayer Participant Limit: 20 Accessibility: Walking required on trails and in sand. Restrooms available Additional Site Information : https://www.portcanaveral.com/Recreation/Jetty-Park-Beach-Pier Reddish Egret on Black Point Wildlife Drive Beginning Birding Field Trip at MINWR – Friday SOLD OUT Join Kim for an intimate morning of instruction and observation along the highly acclaimed Black Point Wildlife Drive where there will be birds galore. She will provide helpful hints for beginners such as where to find birds, interesting behaviors, and identification tricks of the birding trade. We will see how the reddish egret dances for its food while the Little Blue Heron simply stalks its food. The large flocks of white birds will become familiar to you as Great Egrets, Snowy Egrets, White Ibis, Woodstorks and White Pelicans. Shallow impoundments filled with wading birds will offer opportunities to differentiate between egrets and herons. Birding is far more than a hobby. It is an open door to the world of nature, a touch point that connects people to the outdoors. Price: $35 Date: Friday, January 26 Time: 8:00 a.m. – 11:30 a.m. Type: Meet on site. Arrival Details: Meet at the Parrish Park boat ramp parking (under the Max Brewer Bridge) to board a small bus at 7:45. Estimated 35 minutes from the Radisson at the Port. Leader: Kimberly King-Wrenn Participant Limit: 12 Accessibility: Must be able to get on and off of bus. Some walking on flat packed roads. Restrooms available at the Visitor Center and midway through the Black Point Wildlife Drive. Additional Site Information : https://www.fws.gov/refuge/merritt-island Florida Wildlife Hospital Photo Shoot This trip provides a great opportunity for photographers who want to work on their wildlife photography skills. Florida Wildlife Hospital has a spot on property where they can have their animal ambassadors perch and climb while participants take photos of the animals. You will be able to play with focal lengths, apertures, etc. with a bird that isn’t going to fly off or animal that won’t disappear into the brush. This trip is not not suitable for young children as it is mostly staying in one spot while participants play with camera settings and take photos. Florida Wildlife Hospital will try to bring 4 animals out and give participant about 15 minutes with each animal. Note that you will NOT be posing or coming into contact in any way with the animals. This is strictly a opportunity to practice your wildlife photography in a controlled environment. Price: $ 25.00, a portion of which is donated back to the hospital. Date: Friday, January 24 Time: 8:00 – 9:30 a.m. Type: Meet on site Arrival Details: Arrive at 7:45 at Florida Wildlife Hospital, 4560 N. U.S. Highway 1, Palm Shores, FL 32935. Please park in the church parking lot just to the North of the hospital (look for the big red cross). Leaders: Steve Ingraham Participant Limit: 10 Accessibility: The photography spot is on the back of the property and requires walking on uneven surfaces. Additional Site Information: https://floridawildlifehospital.org/ Prairie Warbler at Turkey Creek Sanctuary Turkey Creek Sanctuary SOLD OUT Join us for a walk through this 130 acre park. Over 30 species of warblers have been seen here, and there is also the opportunity to see manatees, alligators, Florida cooters as well as fish, otters, and other birds including ospreys, owls and hawks. Price: $25 Date: Friday, Jan 24 Time: 8:30 a.m. – 11:00 a.m. Type: Meet on site. Arrival Details: Meet at 1518 Port Malabar Blvd NE, Palm Bay at 8:15. Leaders: Charlie Venuto, David Trently Participant Limit: 20 Accessibility: Restrooms on site. Walking on combination of trails and board walk. Additional Site Information: https://www.palmbayflorida.org/Home/Components/FacilityDirectory/FacilityDirectory/86/1647 Black and White Warbler at Sams House Winter Waders, Warblers & Waterfowl at Sams House SOLD OUT Merritt Island is the wintering destination for numerous species of birds. From waders to warblers, the Sams House property offers birders a wide variety of habitats and bird species to be found. We will take a leisurely stroll around the property looking, and listening, for wintering songbirds like Warblers, Hermit Thrush, Ruby-crowned Kinglets, and Yellow-bellied Sapsucker, then take a brief hike to the mangroves and Indian River Lagoon looking for gulls, terns, pelicans, and waterfowl. Join us as we experience the birding, the beauty, and the biodiversity of the Sams House property. Following our morning birding adventure please enjoy a brief personal tour of the 1875 cabin and 1888 house. Price: $25 Date: Friday, Jan 24 Time: 8:30 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at Sams House at Pine Island Conservation Area, 6195 N. Tropical Trail, Merritt Island, FL. Estimated 33 minutes from the Radisson at the Port. Leaders: Chip Clouse, Mariah Hryniewich Participant Limit: 20 Accessibility: Restrooms available. Walking required on unpaved trails. Closed toe shoes, sunscreen, and mosquito repellant are advised. Additional Site Information : https://www.brevardfl.gov/EELProgram/Sanctuaries/SamsHouse Mangrove Tree Crab Mullet Head Island Kayak Trip at MINWR – Friday Trip 1 SOLD OUT Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Friday, Jan 24 Time: 9:00 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Florida Wildlife Hospital Tour For this tour, Florida Wildlife Hospital staff will walk you through the building and tell you about the history of the hospital and how our hospital is setup. You will walk past the outdoor pre-release enclosures so you can see more of the 5-acre property. Please note that you will NOT see wildlife on this tour – it is illegal for the hospital to exhibit the wildlife that is being rehabilitated. But you will get to see some behind the scenes and how the property is laid out and hear about how the wildlife hospital helps wildlife. This tour is not appropriate for children. Price: $ 25.00, a portion of which is donated back to the hospital. Date: Friday, January 24 Time: 10:00 – 11:30 a.m. Type: Meet on site Arrival Details: Arrive at 9:45 at Florida Wildlife Hospital, 4560 N. U.S. Highway 1, Palm Shores, FL 32935. Please park in the church parking lot just to the North of the hospital (look for the big red cross). Leaders: Steve Ingraham Participant Limit: 10 Accessibility: The photography spot is on the back of the property and requires walking on uneven surfaces. Additional Site Information: https://floridawildlifehospital.org/ Snail Kite Airboat birding along the St. Johns – Friday Trip 1 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Friday, Jan 24 Time: 10:00 a.m. – 11:30 a.m. Type: Meet on site. Arrival Details: Arrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ Tour of Veterans Memorial Park “Smart” Rain Garden – Friday Discover the newly enhanced Veterans Memorial Park, a cherished community space that harmoniously blends natural beauty with innovative technology improving resilience for the City of Cape Canaveral. The park recently underwent a transformative upgrade made possible by a $1 million National Science Foundation CIVIC Challenge grant. The focus of this tour will be the new “Smart” Rain Garden, a sophisticated bioswale system monitored by a network of remote sensors and capable of holding 150,000 gallons of stormwater filtered by nearly 1,000 Florida-friendly and native plants which create a thriving habitat for local pollinators. Join us under majestic oak trees, including one unique specimen over 250 years old, to observe butterflies and bees while learning more about this example of green stormwater infrastructure. Veterans Memorial Park provides a model for how urban spaces can mitigate flood risks and protect water quality, while also providing vital natural areas for community members – wildlife and humans alike. Price: $ 10.00 Date: Wednesday, Jan 22 Time: 10:00 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at 9:45 at the Cape Canaveral Library, 201 Polk Ave, Cape Canaveral, FL. Leaders: Amy Reaume, TBD Participant Limit: 20 Accessibility: Restrooms and water are available at the neighboring Cape Canaveral library. The rain garden can be viewed from surrounding sidewalks. Visitors who would like to go down into the rain garden which has uneven terrain (a slope and rocks) should wear closed toed shoes. Additional Site Information: https://blogs.ifas.ufl.edu/brevardco/2024/10/30/smart-rain-garden-series-veterans-memorial-park-location/ Crested Caracara Airboat Birding Along the St. Johns – Friday Trip 2 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Friday, Jan 24 Time: 12:00 p.m. – 1:30 p.m. Type: Meet on site. Arrival Details: Arrive by 11:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Julia Wiggins Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ American White Pelican Mullet Head Island Kayak Trip at MINWR – Friday Trip 2 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Friday, Jan 24 Time: 12:00 p.m. – 2:00 p.m. Type: Meet on site Arrival Details: Meet at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Double-crested Cormorant Blue Dolphin Ultimate Boat Birding and Wildlife Journey – Friday The Blue Dolphin is a 49-passenger Coast Guard approved pontoon boat operated by Mark and Michele Anderson. This four-hour adventure will start at Kelly Park East, which is just 6 minutes from the Radisson Resort. We will cross the Banana River, pass through the Canaveral Locks and into Port Canaveral where you may see the Space X fleet of rocket recovery ships and plenty of birds! In addition, you are likely to see dolphins. A flock of American White Pelicans is normally seen at the entrance to the locks and during the cruise you will see Ospreys and other raptors, Wood Storks, Northern Gannets, pelicans, cormorants, gulls, terns and lots of egrets and herons. Past trips have produced such uncommon visitors as Common Eider, Magnificent Frigatebird Sabine’s Gull and Common Loon. We are looking forward to seeing you aboard the Blue Dolphin. Price: $100 includes snack, water and boxed lunch. Date: Friday, Jan 24 Time: 1:00 p.m. – 5:00 p.m. Type: Meet on site Arrival Details: Arrive at 12:45 p.m. at Kelly Park East, 2550 N. Banana River Drive, Merritt Island. Estimated 7 minutes from the Radisson at the Port. Leaders: Gina Kent, Greg Miller Participant Limit: 46 Accessibility: Handicapped Accessible. Rest room on boat. Sunscreen is recommended. Additional Site Information : https://www.spacecoastrivertours.com/index.html Immature Bald Eagle Airboat Birding Along the St. Johns – Friday Trip 3 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Friday, Jan 24 Time: 2:00 p.m. – 3:30 p.m. Type: Meet on site. Participant Limit: 5 Arrival Details: Arrive by 1:45 p.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Julia Wiggins Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ American Flamingo Mullet Head Island Kayak Trip at MINWR – Friday Trip 3 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Friday, Jan 24 Time: 3:00 p.m. – 5:00 p.m. Type: Meet on site Arrival Details: Meet at 2:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Great Horned Owl Owls and Rails of MINWR SOLD OUT Join Mitchell, Tom and Renee for an evening out in search of the denizens of the dark at Merritt Island National Wildlife Refuge. We’ll search the marshes and hammocks for Great Horned, Screech, Barred and possibly Short-eared Owl. Before we begin our search for owls, we will spend some time along the marshes of Peacock’s Pocket a small bay-like feature of the Indian River Lagoon near where it joins with Banana Creek listening for rails. In the past we’ve had good luck with King, Clapper, Virginia and Black Rail in these marshes. So, if you are interested in nocturnal birds, just bring your sense of curiosity and a flashlight or two. Price: $65 Date: Friday, Jan 24 Time: 4:00 p.m. – 8:30 p.m. Type: Meet on site Arrival Details: Meet Up at the Parrish Park Boat Ramp Parking Lot — 1 A. Max Brewer Causeway, Titusville on the north side of the parking lot by the picnic pavilions. Estimated 33 minutes from the Radisson at the Port. Leaders: Mitchel Harris, Tom Ledford Participant Limit: 10 Accessibility: There are restrooms nearby at the east end of Parrish Park. There are no restrooms available out on the refuge dikes or trails. Walking on unpaved trails required. Additional Site Information : https://www.fws.gov/refuge/merritt-island Saturday, January 25 Central Florida Specialties Learn Wildlife Photography at Helen and Allan Cruickshank Sanctuary History of Canaveral National Seashore Tour Airboat Birding Along the St. Johns – Saturday Early Malabar Scrub Sanctuary Gulling Adventure for Landlubbers Enchanted Forest Sanctuary Day Hike – Saturday Easy Bird & Wildlife Photography with Sony Mirrorless Cameras at Orlando Wetlands Smyrna Dunes Park Mullet Head Island Kayak Trip at MINWR – Saturday Trip 1 Plein Air Nature Drawing at Maritime Hammock Preserve Horseshoe Crabs Titusville Causeway-More than Just Shorebirds Young Birders Event Gull Fly-In at Daytona Beach Shores Airboat birding along the St. Johns – Saturday Trip 1 Tour of Veterans Memorial Park “Smart” Rain Garden – Saturday Airboat Birding Along the St. Johns – Saturday Trip 2 Mullet Head Island Kayak Trip at MINWR – Saturday Trip 2 Beach Birds Boat Trip on the Halifax River Airboat Birding Along the St. Johns – Saturday Trip 3 Mullet Head Island Kayak Trip at MINWR – Saturday Trip 3 Nocturnal Nature Hike at Enchanted Forest Sanctuary American Kestrel Central Florida Specialties SOLD OUT A pre-dawn start at Three Lakes WMA will target Red-cockaded Woodpeckers, Bachman’s Sparrows, Brown-headed Nuthatches, Pine Warblers and Eastern Bluebirds. Next stop is Lake Marian Marina to look for Osprey, Bald Eagle, Spoonbill, Limpkin, possible Dowitchers, Yellowlegs, Pelicans, Snail kite, and other lake species. Next destination is Joe Overstreet Road to search for Red-headed Woodpeckers. Along the road we will look for Eastern Meadowlarks, Savannah Sparrows, Caracara, and possibly even a Scissor-tailed Flycatcher. Our last destination is Brownie Wise Park where we till look for Painted bunting, Snail kite, warblers, Limpkin, nesting Bald Eagles, Vermilion Flycatcher, and the Grove-billed Ani if it is still in the area. Price: $145 includes a snack sack and box lunch. Date: Saturday, Jan 25 Time: 5:00 a.m. – 4:00 p.m. Type: Bus Departure Details: Meet at 4:45 in front of the Radisson hotel lobby to board the bus. Leaders: Brady Bailo, Tom Ledford, Chris Newton, Gallus Quigley Participant Limit: 32 Accessibility: Restroom stops will be made en route. Some walking required on paved and unpaved trails. Additional Site Information : https://myfwc.com/recreation/lead/three-lake s/ https://lakemarianresort.com/facilities/ https://www.osceola.org/Community/Parks-and-Public-Lands/Find-a-Park-Facility-or-Conservation-Area/Tupperware-Island-Conservation-Area-Brownie-Wise-Park Cedar Waxwings, Cruickshank Sanctuary Learn Wildlife Photography at Helen and Allan Cruickshank Sanctuary Located in Rockledge, the Helen and Allan Cruickshank Sanctuary is a 140-acre preserve known for its excellent birdwatching and photography opportunities. The sanctuary’s diverse habitats, including scrub, flatwoods, and wetlands, attract a variety of bird species such as Florida scrub-jays, red-shouldered hawks, and woodpeckers This environment is perfect for learning how to control exposure with confidence and to optimize your camera setting for stunning photos Note: To ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience. Price: $65 Date: Saturday, Jan 25 Time: 8:00 – 11:30 a.m. Type: Meet on site Arrival Details: Meet at 7:20 at the Helen & Alan Cruickshank Sanctuary, 360 Barnes Blvd, Rockledge, FL. Estimated 25 minutes from the Radisson at the Port. Leaders: Jason Giraulo and Phil Lintereur Participant Limit: 10 Accessibility: No rest rooms on site. Walking on unpaved trails required. Black Skimmer Smyrna Dunes Park SOLD OUT This spectacular beachside park at Ponce Inlet offers panoramic views of the ocean, inlet and estuary as well as the opportunity to get close looks at gulls, terns and shorebirds. Take a leisurely two-mile walk via boardwalk over pristine coastal dune habitat (watch for Gopher Tortoises) and along the shoreline. Brown and American White Pelicans, Black Skimmers, Common Loons, cormorants and numerous species of gulls and terns are found here and there is always a chance to discover a rare gull. Up to twenty species of shorebirds are possible, including American Oystercatchers, Piping and Wilson’s Plovers, Purple Sandpipers and Red Knots. Bait fish activity at the inlet’s mouth attracts sea birds, especially Northern Gannets. Passerines are possible in the hammocks. Price: $35 plus $10.00 entrance fee that must be paid going into park. Date: Saturday, Jan 25 Time: 8:00 a..m. – 11:30 a.m. Type: Meet on site Arrival Details: Meet Up at Smyrna Dunes Park,2995 N. Peninsula Ave., New Smyrna Beach. Estimated 68 minutes from the Radisson at the Port. Leaders: Ed Carlson, John Kendall Participant Limit: 20 Accessibility: Restrooms at the trailhead. Two-mile walk on boardwalk. Additional Site Information : https://www.volusia.org/services/public-works/coastal-division/coastal-parks/smyrna-dunes-park.stml History of Canaveral National Seashore Tour Canaveral National Seashore isn’t just for the birds! Come join this tour to learn about the history of the first natives Floridians, the pioneers that came later, and the growing space industry. Stops on this tour include the historic Seminole Rest site, the Eldora Community, and the Canaveral National Seashore Apollo Beach Visitor Center. Price: $ 90.00 Date: Saturday, Jan 25 Time: 8:00 a.m. – 12:00 p.m. Type: Bus Departure Details: Meet at 7: 45 a.m. in front of the Radisson hotel lobby to board the bus. Leaders: Jabez Coggan, Ashley Lord, Wesley Homoya, Laura Henning, John Stiner Participant Limit: 21 Accessibility: Restrooms available at all stops. Additional Site Information : https://www.nps.gov/cana/learn/historyculture/seminole.htm https://www.nps.gov/cana/learn/historyculture/eldora.htm https://www.nps.gov/cana/planyourvisit/visitorcenters.htm Young or Female Blue-ringed Dancer at Orlando Wetlands Easy Bird & Wildlife Photography with Sony Mirrorless Cameras at Orlando Wetlands Bird and wildlife photography will never be easy but we don’t have to make it any harder than it is.There is no need to shoot in manual and RAW. If you learn how your camera works and trust it for focus and exposure, it will leave you free to find and frame the birds and wildlife you want to photograph. Using the newer Sony mirrorless cameras  as an example, I will show you how to bring back consistently satisfying images of birds and wildlife. Price: $65 Date: Saturday, Jan 24 Time: 8:30 a.m. – 11:30 a.m. Type: Meet on site Arrival Details: Meet in the parking area for the Orlando Wetlands Park. Leader: Stephen Ingraham Participant Limit: 10 Accessibility: Walking on possibly uneven/unpaved trails. Restrooms available at visitors center, but not on trails. Additional Site Information : https://www.orlando.gov/Our-Government/Departments-Offices/Public-Works/Water-Reclamation-Division/Orlando-Wetlands Immature American Bald Eagle Airboat Birding Along the St. Johns – Saturday Early Trip SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Saturday, Jan 25 Time: 8:30 a.m. – 10:00 a.m. Type: Meet on site. Arrival Details: Arrive by 8:15 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ Gopher Tortoise at Enchanted Forest Enchanted Forest Sanctuary Day Hike – Saturday SOLD OUT Join the staff at the Enchanted Forest Sanctuary, where the Environmentally Endangered Lands (EELs) program all started, to enjoy a guided hike through multiple habitats on and off the marked trails. Staff will be in front of the nature center for an introduction to the Enchanted Forest before the hike. There will be possible opportunities to see and/or hear different species of birds from Pileated Woodpeckers, warblers, flyover ducks and wading birds (Roseate Spoonbills, Black-bellied Whistling-Ducks, herons, egrets and more.), Red-shouldered Hawks, owls and more. You never know what you may see in the Enchanted Forest. Price: $25 Date: Saturday, Jan 25 Time: 8:30 a.m. – 10:45 a.m. Type: Meet on site Arrival Details: Meet at the Enchanted Forest Sanctuary, 444 Columbia Blvd., Titusville. Estimated 25 minutes from the Radisson at the Port. Leaders: Serge Arais, TBD Participant Limit: 20 Accessibility: Restrooms are available in the nature center. The nature center and the immediate area are handicapped accessible the trails are not. Additional Site Information : https://www.brevardfl.gov/EELProgram/Sanctuaries/EnchantedFores tSanctuary Laughing and Ring-billed Gulls at the Cocoa Landfill Gulling Adventure for Landlubber s SOLD OUT We will visit Brevard County’s Central Disposal Facility aka Cocoa Landfill where experts will help you learn to separate different species and age classes among the 20,000+ gulls that gather here.  Hundreds of Herring and Lesser Black-backed Gulls join the thousands of Laughing and Ring-billed Gulls.  Among them we may find rarities such as Iceland, Glaucous, maybe California or others.  In addition to the gulls we will see dozens of Wood Storks, hundreds of vultures, White Ibis, grackles, cowbirds, and blackbirds.  Bald Eagles come in to feed on the various birds, offering excellent photo ops.  We will continue to Port Canaveral to lunch at Fishlips Waterfront Bar and Grill where we can observe gulls, terns, pelicans, and more while dining on the waterfront.  Jetty Park is our last destination where we will see what gulls have stayed on the coast and maybe also see Gannets, loons, an eider or Purple Sandpiper. Price: $125, incudes snack. In addition, you should bring money for lunch at Fishlips Waterfront Bar and Grill. Date: Saturday, Jan 25 Time: 8:30 a.m. – 3:00 p.m. Type: Bus Departure Details: Meet at 8:15 a.m. in front of the Radisson hotel lobby to board the bus. Leaders: Bert Alm, David Simpson, Amar Ayyash Participant Limit: 22 Accessibility: Restrooms available at all stops. Walking on trails and sand required. Additional Site Informatio n: https://www.brevardfl.gov/SolidWaste/Facilities/CentralDisposalFacility https://www.portcanaveral.com/Recreation/Jetty-Park-Beach-Pier https://www.fishlipswaterfront.com Gopher Tortoise at Malabar Scrub Sanctuary Malabar Scrub Sanctuary Join us in this EEL (Environmentally Endangered Land) property where you might see Florida scrub-jays, gopher tortoises, and other wildlife. There are many different protected habitats in this park including scrub, xeric hammock, flatwoods, hardwood swamp, ponds and depression marshes. Price: $25 Date: Saturday, Jan 25 Time: 8:30 a.m. – 11:00 a.m. Type: Meet on site. Arrival Details: Meet at 1501 Malabar Woods Blvd., Malabar at 8:15. Approximately 48 min (30.4 miles) from the Radisson at the Port. Leaders: Will Johnson Participant Limit: 20 Accessibility: Restrooms on site. A wide, paved path bisects the park, making it accessible to all. Additional Site Information: https://www.brevardfl.gov/EELProgram/Sanctuaries/MalabarScrubSanctuary Mangrove Tree Crab Mullet Head Island Kayak Trip at MINWR – Saturday Trip 1 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Saturday, Jan 25 Time: 9:00 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ White-eyed Vireo, Maritime Hammock Preserve Plein Air Nature Drawing at Maritime Hammock Preserve SOLD OUT On this field trip you will learn the basics of drawing live in nature with artist and art teacher Jessica Sodano. You will receive supplies including a sketch pad and pencils that you get to take home to continue practicing. At Maritime Hammock you will see birds, flowers and many other interesting subjects to draw. Price: $25 Date: Saturday, Jan 25 Time: 9:00-11:00 a.m. Type: Meet on Site Arrival Details: Meet at Maritime Hammock Preserve (1235 N Atlantic Ave, Cocoa Beach, FL 32931) at 9:00 a.m.  There is parking in the Denny’s lot. IMPORTANT: There is a similarly named Maritime Hammock Sanctuary, but that is miles away and NOT the correct park. Make sure you enter the correct address into your GPS. Leader: Jessica Sodano Participant Limit: 12 Accessibility: Walking on clearly marked but unpaved trails. There are no rest rooms on the preserve, but there is a nearby Denny’s. Additional Site Information: https://www.cityofcocoabeach.com/Facilities/Facility/Details/Maritime-Hammock-Preserve-27 Horseshoe Crab, Titusville Horseshoe Crabs Titusville Causeway-More than Just Shorebirds SOLD OUT The Horseshoe Crab (Limulus polyphemus) is arguably the most interesting invertebrate on our coast. Horseshoe Crabs were first reported by Spanish explorers here in Florida. Now, development around the Indian River Lagoon watershed is severely impacting this keystone species.  We will visit Florida’s most productive Horseshoe Crab nesting area – the Titusville Causeway and Gator Creek Dike on the Merritt Island National Wildlife Refuge. We will talk about its lifestyle in our estuaries, threats and citizen science to protect it. We’ll review monitoring and restoration proposals for this critical habitat and discuss activities stakeholders have in horseshoe crab habitat protection, including NASA, who is trying to preserve beaches where Horseshoe Crabs nest at the Space Center. The unique conditions that occur in this part of the Indian River Lagoon may reward us with a spawning event. Even if horseshoe crabs are not actively nesting, there’s plenty to see at this very special place. Price: $25 Date: Saturday, Jan 25 Time: 9:00 a.m. – 11:30 a.m. Type: Meet on site Arrival Details: Meet at the paved parking lot at the entrance to Merritt Island NWR, on the right 0.4 miles east of the A. Max Brewer Causeway bridge. (This is the paved parking on W. Gator Creek Rd where the kiosk is and before the MINWR signs.)  Estimated 34 minutes from the Radisson at the Port. Leaders: Dave Grant, Laurilee Thompson Participant Limit: 16 Accessibility: Restrooms are available at Parrish Park Boat ramp. Walking on uneven surfaces and sand required. Additional Site Information : https://myfwc.com/research/saltwater/crustaceans/horseshoe-crabs/citizen-watch/ Bird box being used by an Eastern Screech Owl Young Birders Event Forty lucky Young Birders with their guardians will be treated to a taste of the Space Coast Birding and Wildlife Festival and some birding and fun activities at Jetty Park, Cape Canaveral, thanks to a sponsorship by the Canaveral Port Authority. In this free program, participants and their guardians will break into two groups to do either owl pellet dissection or bird box making, alternating with birding along the jetty and beach. Picnic lunch at the pavilion is included. Afterwards, as an option, visit the Expo Hall at the festival venue, Radisson Resort at the Port, Cape Canaveral, 6 minutes away. At the Expo hall, the Silent Auction features 9 excellent  kids-size binoculars donated by KOWA, retail $118, buy now price $75, in case you want to visit the Expo Hall earlier in the festival. Price: Free, but you must register here Date: Saturday, Jan 25 Time: 10:00 a.m. – 2:00 p.m. Type: Meet on site Arrival Details: Meet Up at Jetty Park: 400 Jetty Park Drive, Cape Canaveral, FL 32920. Meet at the Pavilion on your left as you enter, part of the RV Campground. Leaders: Ethan and Brennan Landreville, Melissa Steinberg, Julia Wiggins Participant Limit: 40 Accessibility: Some walking on trails and in sand. Restrooms available Additional Site Information: https://www.portcanaveral.com/Recreation/Jetty-Park-Beach-Pier Questions: Email director@scbwa.net Bonaparte’s Gull Gull Fly-In at Daytona Beach Shores Tour the Marine Science Center. Enjoy a picnic lunch at Ponce Inlet Lighthouse Park and walk out to the jetty for shorebirds & gulls. Then board the bus to Frank Rendon Park which is known for the largest congregation of gulls on any beach in the US. This incredible dense array of gulls allows close approach to observe and photograph minute details on each species. Seen consistently here are species that are rare in Florida, including the only record of Vega Gull. Laughing, Franklin, Ring-billed, Herring, Bonaparte’s, Lesser Black-backed, Great Black-backed, Glaucous, Iceland, Thayer’s and California Gulls have all been recorded here. Possible European Herring Gull, Yellow-legged Gull and a Slaty-backed Gull have appeared. This beach is also the best location in Florida to regularly see jaegers from shore. Each evening the gulls leave the beach and settle on the ocean just beyond the breakers. Pomarine and Parasitic Jaegers regularly patrol these huge groups, harassing the gulls. Price: $150 includes box lunch and snack. Date: Saturday, Jan 25 Time: 10:00 a.m. – 6:00 p.m. Type: Bus Departure Details: Meet at 9:45 in front of the Radisson hotel lobby to board the bus. Leaders: Kenn Kaufman, Mitchell Harris, Sharon Stiteler Participant Limit: 22 Accessibility: Rest rooms available at Science Center parks. Walking on unpaved trails and sand. Due to damages sustained from the 2022 Hurricanes, ADA access onto the beach is not currently available. Additional Site Information : https://www.volusia.org/services/public-works/coastal-division/coastal-parks/lighthouse-point-park.stml https://www.volusia.org/services/public-works/coastal-division/coastal-parks/frank-rendon-park.stml Snail Kite Airboat birding along the St. Johns – Saturday Trip 1 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Saturday, Jan 25 Time: 10:00 a.m. – 11:30 a.m. Type: Meet on site. Arrival Details: Arrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ Tour of Veterans Memorial Park “Smart” Rain Garden – Saturday Discover the newly enhanced Veterans Memorial Park, a cherished community space that harmoniously blends natural beauty with innovative technology improving resilience for the City of Cape Canaveral. The park recently underwent a transformative upgrade made possible by a $1 million National Science Foundation CIVIC Challenge grant. The focus of this tour will be the new “Smart” Rain Garden, a sophisticated bioswale system monitored by a network of remote sensors and capable of holding 150,000 gallons of stormwater filtered by nearly 1,000 Florida-friendly and native plants which create a thriving habitat for local pollinators. Join us under majestic oak trees, including one unique specimen over 250 years old, to observe butterflies and bees while learning more about this example of green stormwater infrastructure. Veterans Memorial Park provides a model for how urban spaces can mitigate flood risks and protect water quality, while also providing vital natural areas for community members – wildlife and humans alike. Price: $ 10.00 Date: Saturday, Jan 25 Time: 10:00 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at 9:45 at the Cape Canaveral Library, 201 Polk Ave, Cape Canaveral, FL. Leaders: Amy Reaume, TBD Participant Limit: 20 Accessibility: Restrooms and water are available at the neighboring Cape Canaveral library. The rain garden can be viewed from surrounding sidewalks. Visitors who would like to go down into the rain garden which has uneven terrain (a slope and rocks) should wear closed toed shoes. Additional Site Information: https://blogs.ifas.ufl.edu/brevardco/2024/10/30/smart-rain-garden-series-veterans-memorial-park-location/ Crested Caracara Airboat Birding Along the St. Johns – Saturday Trip 2 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Saturday, Jan 25 Time: 12:00 p.m. – 1:30 p.m. Type: Meet on site. Arrival Details: Arrive by 11:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ American White Pelican Mullet Head Island Kayak Trip at MINWR – Saturday Trip 2 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Saturday, Jan 25 Time: 12:00 p.m. – 2:00 p.m. Type: Meet on site Arrival Details: Meet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Piping Plover Beach Birds Boat Trip on the Halifax River SOLD OUT A 4-hour boat trip on the Coast Guard certified 40-passenger pontoon boat, Discovery, will target Disappearing Island on a falling tide, when large concentrations of gulls, terns and shorebirds will be congregating to feed on the exposed sandbar. Disappearing Island is located near the entrance to Ponce Inlet. Other exposed sand bars near the inlet and in the Halifax River will also be visited, if possible. Twenty species of shorebirds are possible here, including American Oystercatchers, Piping and Wilson’s Plovers, Purple Sandpipers and Red Knots. There is always a possibility of finding rarities such as a Glaucous or Iceland Gull among the many gulls that will be seen. Participants on this trip in 2020 saw 14 shorebird species, 5 gull species, 4 tern species, both night-herons and lots of bottlenose dolphins. The Saturday afternoon Beach Birds class will be a great introduction for this trip. Price: $85 Date: Saturday, Jan 25 Time: 12:00 p.m. – 4:00 p.m. Type: Meet on site Arrival Details: Meet at 11:45 at 116 North Causeway (FL Highway 44), New Smyrna Beach, FL. Park in the grassy field on the right directly across from the Volusia Medical Center. Important: Due to an art festival in town that coincides with this trip,  people coming from I95 should take State Route 44 East and bear left at the Canal Street/Business 44 fork.  Take Canal street/Bus 44 to US1 and make a left turn onto US1, a few blocks down make a right at the light on Washington Avenue, this turns into the North Causeway and our boat is located at 116 North Causeway in NSB.  There are signs for MDC boat tour parking. Once you are at the light at Canal Street and US 1 you will see all the excitement of our annual Images Art Festival and the streets will be closed down.  I’d suggest you leave a little extra time for any congestion in the area. Those coming from North or South Via US 1 should head EAST on Washington Avenue and follow that to 116 North Causeway. Leaders: Adam Kent, Gina Kent Participant Limit: 36 Accessibility: Boat is handicapped accessible. Marine head on board. Bring water, snacks and sunscreen. Additional Site Information : https://marinediscoverycenter.org/ https://marinediscoverycenter.org/boat-tours/ Immature American Bald Eagle Airboat Birding Along the St. Johns – Saturday Trip 3 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Saturday, Jan 25 Time: 2:00 p.m. – 3:30 p.m. Type: Meet on site. Arrival Details: Arrive by 1:45 p.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Jessica Sodano Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ American Flamingo Mullet Head Island Kayak Trip at MINWR – Saturday Trip 3 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Saturday, Jan 25 Time: 3:00 p.m. – 5:00 p.m. Type: Meet on site Arrival Details: Meet at 2:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman, Will Johnson Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Screech Owl at the Enchanted Forest Nocturnal Nature Hike at Enchanted Forest SOLD OUT Whhoooo… is ready for a nocturnal adventure at the Enchanted Forest Sanctuary? Join Naturalists on a night of discovery and exploration on the trails!  Keep an eye and ear out for owls, bats, flying squirrels, and fireflies. Price: $25 Date: Saturday, Jan 25 Time: 6:30 p.m. – 8:30 p.m. Type: Meet on site Arrival Details: Meet at 6:15 at the Enchanted Forest Sanctuary, 444 Columbia Blvd., Titusville, FL. Estimated 25 minutes from the Radisson at the Port. Leaders: Joannie Faulls, TBD Participant Limit: 20 Accessibility: Restrooms will only be available in the nature center prior to the hike. The nature center and the immediate area are handicapped accessible; the trail is not. Please wear closed-toe shoes and bring water, bug spray and a flashlight or headlamp, red light strongly preferred. Additional Site Information : https://www.brevardfl.gov/EELProgram/Sanctuaries/EnchantedForestSanctuary Sunday, January 26 Recording Bird Calls Orlando Wetlands Park Trailer Tour – Sunday Shorebird Identification Talk and Field Trip Beginning Birding Field Trip at MINWR – Sunday Learn Wildlife Photography at Jetty Park Enchanted Forest Sanctuary Day Hike – Sunday Black Point Wildlife Drive & Cruickshank Trail Mullet Head Island Kayak Trip at MINWR – Sunday Trip 1 Betty Salter Trail at The Great Outdoors Diceranda Scrub Preserve Airboat birding along the St. Johns – Sunday Trip 1 Airboat Birding Along the St. Johns – Sunday Trip 2 Mullet Head Island Kayak Trip at MINWR – Sunday Trip 2 Airboat Birding Along the St. Johns – Sunday Trip 3 Mullet Head Island Kayak Trip at MINWR – Sunday Trip 3 Who is hiding in the bushes? Record it’s voice and find out! Recording Bird Calls Have you ever heard a bird call and wanted to include it on your eBird list? Join Brady Bailo for this informative trip to Maritime Hammock where you will learn how to record bird calls using your cell phone. To get the most out of this trip, please download and install the free Merlin App to your phone. Price: $20 Date: Sunday, January 26 Time: 7:30-9:30 a.m. Type: Meet on Site Arrival Details: Meet at 7:15 at Maritime Hammock Preserve (1235 N Atlantic Ave, Cocoa Beach, FL 32931) IMPORTANT: There is a similarly named Maritime Hammock Sanctuary, but that is miles away and NOT the correct park. Make sure you enter the correct address into your GPS. Leader: Brady Bailo Participant Limit: 15 Accessibility: Walking on clearly marked but unpaved trails. There are no restrooms on the preserve, but there is a nearby Denny’s. Additional Site Information: https://www.cityofcocoabeach.com/Facilities/Facility/Details/Maritime-Hammock-Preserve-27 Spur-throated Grasshopper at Orlando Wetlands Park Orlando Wetlands Park Trailer Tour – Sunday SOLD OUT This regional water treatment area, owned by the City of Orlando, began receiving reclaimed water in 1987, submerging the 1700-acre Sun Charm Ranch beneath millions of gallons of treated sewage. For 30 years the City closed the park during winter months so that the former owners could hunt waterfowl, until 2016 when it bought the hunting rights. Join us as we take a trip into the park where more than 220 bird species have been identified including Wood Storks, Bald Eagles, Crested Caracaras, Limpkins, Purple Gallinules, rails and spoonbills. Painted Buntings lurk in some of the dense vegetation bordering the 20 miles of roads and woodland trails leading through marshes, hardwood hammocks and along scenic lakes. Large numbers of waterfowl and wading birds are expected. Other wildlife found here includes alligators, turtles, deer, hogs, bobcats, otters, raccoons, opossums, snakes and coyotes. There will be multiple stops with walking to spy the best birds. Price: $90 Date: Sunday, January 26 Time: 7:30 a.m. – 12:00 p.m. Type: Meet on site. Arrival Details: Meet at the Orlando Wetlands Park, 25155 Wheeler Road, Christmas.Estimated 39 minutes from the Radisson at the Port. Leaders: Christian Newton, TBD Participant Limit: 20 Accessibility: Accessible restrooms are available parking lot, but not on the dikes an trails. Some walking on unpaved trails. Additional Site Information : https://www.orlando.gov/Our-Government/Departments-Offices/Public-Works/Water-Reclamation-Division/Orlando-Wetlands Laughing Gulls Shorebird Identification Talk and Field Trip SOLD OUT Join David, Dee and Jessica to learn tips and tricks of basic shorebird identification.  After an indoor presentation, we will go afield to test your skills. Price: $60 Date: Sunday, January 26 Time: 7:30 a.m. – 11:00 a.m. Type: Meet on site. Arrival Details: Meet at 7:15 a.m. at Dixie Crossroads, 1475 Garden St, Titusville, FL 32796 for presentation. After, we will carpool to another location to test your new shorebird ID skills. Leader: David Simpson, DeeFairbanks Simpson, Jessica Sodano Participant Limit: 15 Accessibility: Some walking on possible mud and/or uneven surfaces. Additional Site Information : https://www.fws.gov/refuge/merritt-island Snowy Plover, Jetty Park Learn Wildlife Photography at Jetty Park Join us for a hands-on bird photography workshop at the picturesque Jetty Point Park in Port Canaveral. This park offers a perfect backdrop to capture stunning shots of Florida’s diverse bird species, from wading herons and pelicans to majestic ospreys in flight. In this class we’ll explore how to get the perfect portrait and how to optimize your settings for outstanding photography. Note: To ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience. Date: Sunday, Jan 26 Time: 8:00 – 11:30 a.m. Type: Meet your guides at 7:45 at the Radisson in front of the Expo Hall for car pooling and to receive your Jetty Park passes. Arrival Details: Carpool to Jetty Park: 400 Jetty Park Drive, Cape Canaveral, FL 32920. Follow Jetty Park Rd to the first paved parking lot. Meet in front of the changing rooms. Estimated 6 minutes from the Radisson at the Port. Leaders: Jason Giraulo and Phil Lintereur Participant Limit: 15 Accessibility: Walking required on trails and in sand. Restrooms available Additional Site Information: https://www.portcanaveral.com/Recreation/Jetty-Park-Beach-Pier Male Black Swallowtail at Enchanted Forest Enchanted Forest Sanctuary Day Hike – Sunday Join the staff at the Enchanted Forest Sanctuary, where the Environmentally Endangered Lands (EELs) program all started, to enjoy a guided hike through multiple habitats on and off the marked trails. Staff will be in front of the nature center for an introduction to the Enchanted Forest before the hike. There will be possible opportunities to see and/or hear different species of birds from Pileated Woodpeckers, warblers, flyover ducks and wading birds (Roseate Spoonbills, Black-bellied Whistling-Ducks, herons, egrets and more.), Red-shouldered Hawks, owls and more. You never know what you may see in the Enchanted Forest. Price: $25 Date: Sunday, January 26 Time: 8:30 a.m. – 10:45 a.m. Type: Meet on site Arrival Details: Meet at the Enchanted Forest Sanctuary, 444 Columbia Blvd., Titusville. Estimated 25 minutes from the Radisson at the Port. Leaders: Adam Kent,Sergio Arias,Gina Kent,Teressa Nick Participant Limit: 20 Accessibility: Restrooms are available in the nature center. The nature center and the immediate area are handicapped accessible the trails are not. Additional Site Information : https://www.brevardfl.gov/EELProgram/Sanctuaries/EnchantedForestSanctuary Roseates and Ibises on Black Point Wildlife Drive Black Point Wildlife Drive & Cruickshank Trail This is a self-driving tour of the Black Point Wildlife Drive and a walking tour on part of the Cruickshank Trail. Through Allan Cruickshank’s vision, enthusiasm, determination and influence, NASA and the US Fish and Wildlife Service reached an agreement in 1963 which created the Merritt Island National Wildlife Refuge. To pay tribute to this man’s unique contribution to the National Wildlife Refuge System, a five-mile trail was dedicated to his memory. This easy 5-mile walk around the Cruickshank Trail takes participants through marshlands with the likelihood of observing wading birds, shore birds, wintering warblers and birds of prey. Charlie will entertain you with stories of Allan and Helen Cruickshank’s influence on the environmental movement while walking along parts of the Cruickshank Trail as time permits. While driving to the trailhead, stops will be made along the Black Point Wildlife Drive to look at concentrations of birds. Examples of the birds you may see include Great Blue Heron, Tri-color Heron, Osprey, Pied Billed Grebes, Reddish Egret, Little Blue Heron, Gray Catbird, Red-bellied Woodpecker, Mottled Duck, Blue-wing Teal, Anhinga, and Double-crested Cormorant. Price: $35 Date: Sunday, January 26 Time: 8:30 a.m. – 12:30 p.m. Type: Meet on site. Arrival Details: Meet at 8:15 a.m at the Parrish Park Boat Ramp Parking Lot 1 A. Max Brewer Memorial Pkwy, Titusville at. Estimated 33 minutes from the Radisson at the Port. Leaders: Bert Alm (Space Coast Audubon), Gallus Quigley, Charlie Venuto Participant Limit: 20 Accessibility: Restroom facilities are available at the trailhead. Must be able to walk 5 miles on unpaved trail. Additional Site Information : https://www.fws.gov/refuge/merritt-island Mangrove Tree Crab Mullet Head Island Kayak Trip at MINWR – Sunday Trip 1 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Sunday, January 26 Time: 9:00 a.m. – 11:00 a.m. Type: Meet on site Arrival Details: Meet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ American Alligator Betty Salter Trail at The Great Outdoors – SOLD OUT On our way to the trailhead, we will be looking for our resident Sandhill Cranes, Great Horned Owls, Osprey and Red-Shouldered Hawks. As we enter the trail, there is a wet meadow on the right which in spring is covered in wildflowers. The first half of the trail has little shade as it passes between wetlands, ponds, and the Canaveral Marshes tract of St. Johns River Water Management District. Midway through the trail we will cross a 30-foot-long twelve-inch-wide concrete weir with a coated wire cable handrail. To the left is a borrow pond and to the right a stream bed connected to the St. Johns River. The second half of the trail is shaded by pines, palms, cedars and oak trees. Egrets, herons, ducks and shorebirds as well as bobcats, deer and alligators have been seen on this trail. After the tour, consider having lunch at the Blue Heron Restaurant in TGO. Price: $25.00. If desired, bring money for lunch at Blue Heron Restaurant in the Great Outdoors. Date: Sunday, January 26 Time: 9:00 a.m. – 12:00 p.m. Type: Meet on site Arrival Details: Meet Up at Golf Carts Unlimited, 880 Hospitality Way, Titusville, FL 32780. The Great Outdoors (TGO) is a gated community so the driver should be prepared to show the gatekeeper your ID and explain that you are there for a tour with Betty Salter. Estimated 30 minutes from the Radisson at the Port. Leaders: Betty Salter, Robin Francis Participant Limit: 12 Accessibility: No restrooms available. Must be able to walk about 1 mile on unpaved trails. Good hiking shoes & walking stick are recommended. Additional Site Information : https://naturecenterattgo.org/ https://www.blueheronrestaurant.org/ Fragrant Waterlily Diceranda Scrub Preserve See a delicate, fragrant mint, the Titusville Balm, found nowhere else in the world except in the Titusville area. In January it will be in fruit. Several species of pines, lyonias and other flatwood species will be seen – a few could be in bloom. The mile long trail passes by a large marsh, filled with water lilies, where wood ducks nest. Ferns are abundant. Florida Scrub-Jays, Eastern Towhees, woodpeckers and raptors might be seen. This is a very nice natural area surrounded by urban homes. Price: $25 Date: Sunday, January 26 Time: 9:00 a.m. – 1:00 p.m. Type: Meet on site Arrival Details: Meet at 8:45 at the Diceranda Scrub Preserve 4900 Melissa Drive, south of Route 50, in Titusville. Estimated 28 minutes from the Radisson at the Port. Leaders: Jim and Kay Stahl Participant Limit: 12 Accessibility: No restrooms available on site. Additional Site Information : https://www.brevardfl.gov/EELProgram/Sanctuaries/DicerandraScrubSanctuary Snail Kite Airboat birding along the St. Johns – Sunday Trip 1 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Sunday, January 26 Time: 10:00 a.m. – 11:30 a.m. Type: Meet on site. Arrival Details: Arrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ Crested Caracara Airboat Birding Along the St. Johns – Sunday Trip 2 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Sunday, January 26 Time: 12:00 p.m. – 1:30 p.m. Type: Meet on site. Arrival Details: Arrive by 11:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Kelly Smith Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ American White Pelican Mullet Head Island Kayak Trip at MINWR – Sunday Trip 2 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Sunday, January 26 Time: 12:00 p.m. – 2:00 p.m. Type: Meet on site Arrival Details: Meet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ Immature Bald Eagle Airboat Birding Along the St. Johns – Sunday Trip 3 SOLD OUT You will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL Price: $90 Date: Sunday, January 26 Time: 2:00 p.m. – 3:30 p.m. Type: Meet on site. Arrival Details: Arrive by 1:45 p.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port. Leader: Dave Grant Participant Limit: 5 Accessibility: You must be able to get up into high seats on the airboat. No restroom facility on site. Additional Site Information : https://stjohnsairboatour.com/ American Flamingo Mullet Head Island Kayak Trip at MINWR – Sunday Trip 3 Join Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet! Note: No children under 4 years old are allowed on this trip. Price: $60.00 Date: Sunday, January 26 Time: 3:00 p.m. – 5:00 p.m. Type: Meet on site Arrival Details: Meet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge. Leaders: Rebecca Chapman Participant Limit: 8 Accessibility: This activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest. Additional Site Information: https://springstosea.com/ 2023 Space Coast Birding and Wildlife Festival | Websites by Melbourne Website Designer SCBWA is a 501 (c) (3) non-profit organization Go to Top"
    },
    {
      "url": "https://scbwa.net/",
      "text": "Space Coast Birding & Wildlife Festival Jan 22-26, 2025 Cape Canaveral Skip to content director@scbwa.net January 21-25, 2026 Radisson Resort at the Port Cape Canaveral, Florida Facebook page opens in new window Instagram page opens in new window X page opens in new window Space Coast Birding and Wildlife Festival January 24th – 28th, 2024 Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Birding & Wildlife Festival January 21-25, 2026 For the 27th year, Space Coast will bring together curious amateurs and expert birders in great locations for days of fun. REGISTER HERE Sponsors & Exhibitors January 21-25, 2026 Located at the Radisson Resort at the Port, Cape Canaveral, there will be more than 50 exhibits geared towards the birding, wildlife and nature enthusiast. Meet Our Sponsors EXPO HALL IS FREE AND OPEN TO THE PUBLIC EXPO HALL and presentations are at the Radisson Resort at the Port, 8701 Astronaut Blvd., Cape Canaveral, FL 32920 Come visit 50+ optics vendors, tour operators and conservation non-profits at our Expo Hall. Hours are 12-6 Wednesday through Friday, 10-6 on Saturday (January 21-25, 2026) Curious to learn about the natural side of our state? The Space Coast Birding and Wildlife Festival (SCBWF) allows you to add to your life list, take some amazing photos, see different Florida habitats, and meet other birders and naturalists from around the country! The 2026 Space Coast Birding and Wildlife Festival will be January 21-25, 2026. If you are not already on the email list, use this link. We will send updates including when registration will open. REGISTRATION LINK 3rd Party Website Disclaimer * This festival is brought to you by the Space Coast Birding and Wildlife Association (SCBWA), a 501 (c) (3) non-profit organization A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE (800-435- 7352) WITHIN THE STATE. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. THANK YOU! Sponsors, Exhibitors, Keynotes, Field Trip Leaders, Photographers, Presenters, and Attendees SPONSORS & EXHIBITORS Entrance to the Expo Center is free! Exhibitors from many locations create a wonderful shopping opportunity for the Space Coast. Let’s visit them early and often (Wednesday through Saturday only!) More than 50 exhibits for birding, wildlife, and nature enthusiasts create an exciting Expo Center. Destination tour companies, wildlife and birding organizations, nature-based businesses, authors, photographers, and painters showcase their talents to help you increase your fun. Examine and explore an outstanding array of camera and optic equipment. Swarovski Optik offers to clean and inspect your optics equipment (any brand) free of charge, so bring your binoculars and scopes to the Expo Center! The Expo Center is open each afternoon so you can visit as soon as your field trip returns. Check the Bird Updates first for real-time information on the latest sightings! Afternoon workshops and presentations are on site so you can easily pop in and out of the Expo Center before and after sessions to see what’s available and say hello to the festival sponsors. Visit six booths to earn a free ticket to Sips n Bits appetizers. All are welcome! Expo Hours: Wed – Fri from 12 PM – 6 PM and Sat from 10 AM – 6 PM 12 PM Doors Open (when exhibitors return from morning field trips) 5 PM Sips n Bits Appetizers (free with your punch card). Fill your plate and take another look at your favorite booths. 6 PM Keynote Speaker in the Jamaica Room. BECOME A SPONSOR/EXHIBITOR SPONSOR LIST EXHIBITOR LIST EXHIBITOR MAP MANATEE LEVEL EAGLE LEVEL PANTHER LEVEL SCRUB JAY LEVEL PELICAN LEVEL PILEATED WOODPECKER LEVEL FIELD TRIPS Highlighting the best birding areas in East Central Florida Total list of birds seen on field trips during the 2020 Space Coast Birding and Wildlife Festival SEE ALL FIELD TRIPS What a remarkable place to visit! The county’s landscape was shaped by, and still is dominated by water. The north flowing St Johns River with numerous lakes and marshes borders its western side. On its eastern side, the Atlantic Ocean’s high energy waves crash against the edge of Florida’s largest barrier island. The Indian River Lagoon rules the landscape with two dozen habitats found within its watershed. Along the lagoon’s western side, ancient sandy scrublands straddle the Atlantic Coastal Ridge. Two ocean inlets bookend the region: Ponce Inlet on the north end and Sebastian Inlet to the south. Festival field trips were chosen to highlight the best birding, wildlife, and habitat areas in the Space Coast region. They will be staffed by some of the world’s finest birding guides. What more could a space-age birder want? Where else can you find most of the Sunshine State’s most sought-after birds and wildlife all in one place? More than 330 species of birds are found in or migrate through our county. Alligators? We have them by the thousands. Hop on a St. Johns River airboat ride and you will see. Manatees? 1/3 of the state’s population of these beloved iconic animals can be found here. In January, they hover around a warm water discharge at a local power plant that’s off-limits to the public. We’ve made it easy to see manatees in their winter habitat and lots of waterbirds in their breeding plumage on the Manatees of Blue Spring and St. Johns River Cruise. Roseate Spoonbills and Reddish Egrets can be seen in a variety of places. Join the Blue Dolphin Ultimate Boat Birding & Wildlife Journey to see nesting spoonbills and other waders on a rookery island as well as a variety of ships (and birds) at Port Canaveral. Botttlenose Dolphins? You should see plenty on the Blue Dolphin Ultimate Boat Birding & Wildlife Journey; Beach Birds Boat Trip on the Halifax River; Barrier Island Center & Pelican Island Boat Trip, and the Offshore Birding & Wildlife Adventure. By the way, birders spotted 14 species of shorebirds on the Beach Birds Boat Trip on the Halifax River in 2020. The offshore trip also has a potential for sightings of Atlantic Spotted Dolphin, North Atlantic Right Whale and Humpback Whale. Sea turtles? We have them by the tens of thousands in the summertime. The only place where you are likely to spot one this time of the year is near the warm waters of the Gulfstream on the offshore trip. Some of the field trips will utilize buses for transportation. Others require attendees to drive their own vehicles and meet at the sites. Field trip leaders’ names and affiliations will be added to the trip descriptions later. Please make sure that you fill up your water bottles prior to participating on a field trip and take them with you. Dress warmly in layers, wear closed-toed shoes and above all — have fun! CONTACT US! If you have any questions regarding the festival, sponsorship, or exhibiting, please give us a shout. director@scbwa.net Space Coast Birding and Wildlife Association P.O. Box 74, Mims, Florida 32754 January 21st -25th, 2026 Name Email Address Subject Your Message Δ 2023 Space Coast Birding and Wildlife Festival | Websites by Melbourne Website Designer SCBWA is a 501 (c) (3) non-profit organization Go to Top"
    },
    {
      "url": "https://scbwa.net/faqs/",
      "text": "FAQ's - Space Coast Birding and Wildlife Festival Skip to content director@scbwa.net January 21-25, 2026 Radisson Resort at the Port Cape Canaveral, Florida Facebook page opens in new window Instagram page opens in new window X page opens in new window Space Coast Birding and Wildlife Festival January 24th – 28th, 2024 Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact FREQUENTLY ASKED QUESTIONS Check here for frequently asked questions and answers. Cancellations We appreciate your understanding and respect concerning adherence to the policy of monies being non-refundable as of January 13th which is clearly stated under Cancellations following Registration Pricing on SCBWA.net . By now we have made financial commitments based on your participation in activities we offer that we cannot afford to be liable for, or too late to attempt to sell since advance registration was cut off on January 12th. We are trying to ensure that we can not only bring this festival back successfully and professionally this year, but also be financially viable to announce next year’s date. We are a 501 (c) (3) so there is a good chance part or all of your monies may be tax deductible. Hotel Info Festival Hotel – Radisson Resort at the Port, 8701 Astronaut Blvd., Cape Canaveral, FL 32920 Hotel Accessibility Wheelchair-accessible bathroom vanity Braille/raised signage Elevator Accessible bathroom (select rooms) In-room accessibility (select rooms) Roll-in shower (select rooms) Wheelchair-accessible path of travel Wheelchair-accessible parking Assistive listening devices available Wheelchair-accessible public washroom Wheelchair-accessible van parking Wheelchair-accessible path to elevator Wheelchair-accessible registration desk Wheelchair-accessible pool Wheelchair-accessible fitness center Wheelchair-accessible business center Wheelchair-accessible restaurant Visual alarms in hallways Handrails in stairways Wheelchairs available on site Hand-held shower heads Closed captioned TV Portable shower seat Raised toilet seat Grab bar near toilet Grab bar in shower Lever door handles Phone accessibility kit Well-lit path to entrance Stair-free path to entrance Pool hoist on site Pool access ramp on site BOOK YOUR ROOM Bird List Total list of birds seen on field trips during the 2020 Space Coast Birding and Wildlife Festival. Pelagic Trip You must register for the festival in order to participate. We are offering the pelagic as part of the festival opportunities. Please note that if the trip does not go on Wednesday it will automatically be rescheduled for the following Monday as outlined in the trip description. Exhibitors Shipping Information Exhibitor Shipping Information: We strongly recommend shipping your item within one week of your arrival date. The earliest date that items may arrive at the hotel is January 13th. Items will be held in the hotel’s secure luggage room. When you arrive, please take your ID to the hotel front desk to claim your item. If you use Runabout Couriers, their number in the US is 321-617-9022 or email: orders@runaboutcourier. com Your shipping label must include: Your name and business name, the festival name, and the hotel name and address. Example: John Doe/ABC Company for Space Coast Birding and Wildlife Festival c/o Radisson Resort at the Port 8701 Astronaut Blvd. Cape Canaveral, FL 32920 Expo Center Hours Expo Center Hours: Wed – Thur – Fri  12:00 pm – 6:00 pm Sat  10:00 am – 6:00 pm How to Modify Your Registration If you have signed up for a trip but decide you want to drop it, follow these instructions: From the registration confirmation email that you received, click the Manage Your Registration link. When prompted, enter your Confirmation Number from the email. On the next screen, scroll down to and click the Modify Registration button. Scroll to the bottom of the Personal Information page and click Next . Scroll to the bottom of the Registration Options page and click Next . On the Field Trips and Presentations page, scroll down to the field trip that you want to drop. You will see that the button is blue and says Selected . Click that button; the button will turn white and changes to Select, indicating that it is no longer selected. Scroll to the bottom of the page and click Next . Scroll to the bottom of the Registration Summary page and click Next . On the next page click Submit . You will receive a confirmation that you have dropped a trip and will receive a refund. If you want to drop a trip and add a different trip: From the registration confirmation email that you received, click the Manage Your Registration link. When prompted, enter your Confirmation Number from the email. On the next screen, scroll down to and click the Modify Registration button. Scroll to the bottom of the Personal Information page and click Next . Scroll to the bottom of the Registration Options page and click Next. On the Field Trips and Presentations page, scroll down to the field trip that you want to drop. You will see that the button is blue and says Selected. Click that button; the button will turn white and changes to Select , indicating that it is no longer selected. Scroll to the trip you want to switch to (you might have to scroll up or down based on the start time of the trip). Click Select . Scroll to the bottom of the Field Trips and Presentations page and click Next . Scroll to the bottom of the Registration Summary page and click Next. On the Order Summary page, enter payment information for the newly added trip, then click Submit. You will receive a confirmation that you have dropped one trip and added the other. If you want to add a trip: From notification email that you received, click the Manage Your Registration link. When prompted, enter your Confirmation Number from your email. On the next screen, scroll down to and click the Modify Registration button. Scroll to the bottom of the Personal Information page and click Next . Scroll to the bottom of the Registration Options page and click Next . On the Field Trips and Presentations page, scroll to the trip you that you want to add. Click Select . Scroll to the bottom of the Field Trips and Presentations page and click Next . Scroll to the bottom of the Registration Summary page and click Next. On the Order Summary page, enter payment information for the trip, then click Submit. You will receive a confirmation that you have successfully added the trip. I Am On A Waitlist For A Field Trip. What Should I Do Now? Some trips are very popular, and there are no guarantees that you will be notified that spot on a trip has become available. But, if you are notified, you have to act fast – you only have 2 hours to add the trip until the next person on the waitlist is given the opportunity to grab the trip. After you get on a waiting list for a sold out trip: Add director@scbwa.net to your email contacts list so your notifications don’t end up in your junk mail box. Watch your email! If someone else drops the trip, you will receive an email notification that a spot is now open. Click the Register for Session button in the email. When prompted, enter your Confirmation Number shown in the email. On the next screen, scroll down to and click the Modify Registration button. Scroll to the bottom of the Personal Information page and click Next. Scroll to the bottom of the Registration Options page and click Next. On the Field Trips and Presentations page, scroll to the trip for which you are waitlisted and click Select. Scroll to the bottom of the Field Trips and Presentations and click Next. Scroll to the bottom of the Registration Summary page and click Next. On the Order Summary page, enter payment information for the trip, then click Submit. You will receive a confirmation that you have successfully added the trip. 2023 Space Coast Birding and Wildlife Festival | Websites by Melbourne Website Designer SCBWA is a 501 (c) (3) non-profit organization Go to Top"
    },
    {
      "url": "https://scbwa.net/registration/",
      "text": "Registration - Space Coast Birding and Wildlife Festival Skip to content director@scbwa.net January 21-25, 2026 Radisson Resort at the Port Cape Canaveral, Florida Facebook page opens in new window Instagram page opens in new window X page opens in new window Space Coast Birding and Wildlife Festival January 24th – 28th, 2024 Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact REGISTER HERE STAY INFORMED : Join the mailing list to receive festival updates.. Even after registration, if you are on the mailing list , we will notify you of any additions or changes. 2026 Registration will open November 1st. THANK YOU – Many thanks to our festival sponsors and exhibitors, speakers and field trip leaders, volunteers and board members and YOU for creating a vibrant festival for all to enjoy! LOCATION – Radisson Resort at the Port, Cape Canaveral, FL. Staying at the Radisson at the Port makes your festival experience more enjoyable and less stressful. You can attend educational presentations and workshops, depart for field trips, enjoy our enlightening keynote presentations, and experience our Expo Center… all in one convenient location. Click here for discounted hotel rates for all festival participants. Reservations must be made by December 6, 2025 to receive the discounted rate. REGISTRATION DESK – Hours for picking up your Festival Badge and T-shirts: Tuesday Jan 20th from 2:00 – 5:00 PM Wednesday – Saturday Jan 21st – 24th from 7:00 – 11:00 AM REGISTRATION PRICING for all 5 days: Wednesday – Sunday Early Bird Registration: November 1 to December 1, 2025 = only $50.00, a savings opportunity for this year only. Advance Registration from December 1 – 31, 2025 = $65 January 2026 Registration = $75. REFUND POLICY for Registration and Events By December 1, 2025 – 100% refund By December 31, 2025 – 75% refund During January 2026 – no refunds, sorry (because your fees for bus, catering, registration processing, badging, etc. will have already been paid) ONCE REGISTRATION OPENS Before you click the “Register Here” button below: Go to the Field Trips, Keynotes and Presentations tabs to read the full event descriptions. Make a list of all the events you want to attend. Go back to this REGISTRATION Tab. Click the Register Here button below . You will automatically be transferred to our digital registration software “Cvent”. Enter your contact information and your t-shirt preorder. Select the events you wish to attend. If an event is already full, you may opt to join the waiting list. Proceed to checkout and review your selection list. Follow the prompts to check out by credit card. Just before you complete your registration, you will have the opportunity to double-check and add or remove sessions. As soon as your payment is received, you will receive an email confirmation. Save this email and your CONFIRMATION NUMBER so you can make changes later if desired. Even if your decisions are rock solid, you will want this ability if any trips or speakers are unexpectedly cancelled due to weather, etc. Tip: In your confirmation, you will see an option to add your selections to your calendar. If you select this, a link back to the full description of your events including the time, location, etc. will appear on your calendar. This is useful! If you want to make any changes after you have completed your registration, follow the directions in your confirmation email, using your account log-in information and confirmation number. REGISTER HERE 3rd Party Website Disclaimer * CONTACT US! If you have any questions regarding the festival, sponsorship, or exhibiting, please give us a shout. director@scbwa.net Space Coast Birding and Wildlife Association P.O. Box 74, Mims, Florida 32754 January 21st -25th, 2026 Name Email Address Subject Your Message Δ 2023 Space Coast Birding and Wildlife Festival | Websites by Melbourne Website Designer SCBWA is a 501 (c) (3) non-profit organization Go to Top"
    },
    {
      "url": "https://www.artsbrevard.org/events/2024-space-coast-birding-and-wildlife-festival",
      "text": "2024 Space Coast Birding & Wildlife Festival - Brevard Cultural Alliance Skip to content Facebook Instagram X YouTube Pinterest LinkedIn 321.690.6817 | info@artsbrevard.org About BCA News Brevard Cultural Alliance Brevard County Space Coast Weekly Newsletter Events Calendar of Events Classes & Workshops Submit Your Event to the BCA Calendar Members Current Members Become a Member Member Login Resources Calls for Art Artist Services Submit a Call for Art & Artist Service Funding Opportunities Programs Art in Public Places Arts Education True Colors Support Donate Legacy Giving Membership Sponsor & Partner Volunteer Search for: About BCA News Brevard Cultural Alliance Brevard County Space Coast Weekly Newsletter Events Calendar of Events Classes & Workshops Submit Your Event to the BCA Calendar Members Current Members Become a Member Member Login Resources Calls for Art Artist Services Submit a Call for Art & Artist Service Funding Opportunities Programs Art in Public Places Arts Education True Colors Support Donate Legacy Giving Membership Sponsor & Partner Volunteer Search for: About BCA News Brevard Cultural Alliance Brevard County Space Coast Weekly Newsletter Events Calendar of Events Classes & Workshops Submit Your Event to the BCA Calendar Members Current Members Become a Member Member Login Resources Calls for Art Artist Services Submit a Call for Art & Artist Service Funding Opportunities Programs Art in Public Places Arts Education True Colors Support Donate Legacy Giving Membership Sponsor & Partner Volunteer Search for: 2024 Space Coast Birding & Wildlife Festival On behalf of the Space Coast Birding and Wildlife Association, we invite you to join us for the 25th Space Coast Birding and Wildlife Festival, January 24-28, in Cape Canaveral, FL.  As one of our sponsors said -this is the “Rise of the Phoenix’ in the birding festival community! The festival is being held at the Radisson Resort at the Port and what makes this location so amazing is it allows us to offer everything under one roof – sleeping rooms, meeting rooms, Expo Center, dining options, field trip bus departures, you name it!  We are excited to have the ability to meet the demand we have had in the past! For your convenience we have secured a block of rooms at the Radisson Resort at the Port, 8701 Astronaut Blvd., Cape Canaveral, FL 32920, at a discounted rate for 2024 Space Coast Birding and Wildlife Festival attendees. Attached please find the link to this special rate: https://www.choicehotels.com/reservations/groups/G9639537 Please visit www.scbwa.net for more information. Do not hesitate to contact Kathy Rooney at kathy@scbwa.net or Barb Eager at barb@scbwa.net if you need any further information. 2024 updates will be posted as they become available as our brand new organization builds a new festival website. Festival registration is scheduled to open late October/early November 2023. We have chosen to have the Sandhill Crane as our official festival bird for 2024. Cranes symbolize travel, open mindedness, aspiration, and as a symbol of grace, the crane inspires us to pause and reflect and honor the miracles around us. Come join us, we are not flying into extinction, we are coming back better than ever! + Add to Google Calendar + iCal / Outlook export Tags: Cultural Events in Brevard , Main Page Carousel , Space Coast Birding and Wildlife Festival Date Jan 24 - 27 2024 Expired! Time Free Expo Center 12:00 pm - 6:00 pm Location Radisson Resort at the Port 8701 Astronaut Blvd., Cape Canaveral Organizer Space Coast Birding & Wildlife Festival Email kathy@scbwa.net Website https://scbwa.net Follow us on other pages: Contact BCA: 513 N Harbor City Blvd . Suite C. Melbourne, FL 32935 (321) 690-6817 info@artsbrevard.org Support BCA DONATE BCA is a 501(c)(3). All donations are tax-deductible. Page load link Go to Top"
    },
    {
      "url": "https://wildsidenaturetours.com/space-coast-birding-wildlife-festival/",
      "text": "Space Coast Festival - Wildside Nature Tours Skip to content 888-875-9453 888-875-9453 info@WildsideNatureTours.com BUY TRAVEL CERTIFICATES! EXPLORE NOW HOME TOURS TOURS BY REGION North America – Alaska & Hawaii Caribbean Central America & Mexico South America – Galapagos Islands Africa / Middle East Europe India / Asia / Australia Arctic & Antarctica TOURS BY STYLE Photography Tours Wildside Limited Series OM System Only Workshop Women Only Workshop Nature Journaling Birding Tours Big Year Birding Tours Short Trips – Target Birds Wildlife Safaris Wildside Weekender One Week – One Lodge Tours Small Ship Adventure Cruises Private Tour Planner TRAVEL CERTIFICATES TOURS BY DATE All Tours By Date Birding Tours by Date Photography Tours By Date Wildlife Safaris By Date About Travel Info & Forms Private Tour Planner Registration & Cancellation Trip Insurance Privacy Policy CLIENT INFORMATION FORM Get To Know Us Meet Our Team About Wildside News and Updates Contact Us Our Blogs Notes from the Wildside The Wild Lens Big Year Blog Community & Conservation Community Connections ZEISS Optics Allens Camera Wildside Facebook Group FESTIVALS North Shore Birding Festival Space Coast Festival Florida Bird & Photo Fest Biggest Week Acadia Birding Festival SE Arizona Birding Fest Cape May Bird Fest Rio Grande Valley Conservation Partnerships BirdsCaribbean.org Black Swamp Bird Observatory Friends of Magee Marsh WEBINARS BIRDING WEBINARS NATURE & TRAVEL WEBINARS PHOTOGRAPHY WEBINARS Explore Now HOME About Travel Info & Forms COVID-19 Travel Protocols TRAVEL CERTIFICATES Private Tour Planner Trip Insurance CLIENT INFORMATION FORM Get To Know Us Meet Our Team Why Travel With Wildside News and Updates Trip Reports Testimonials TRAVEL CERTIFICATES Contact & Policies Contact Us Privacy Policy Registration & Cancellation Community & Conservation Community Connections ZEISS Optics Allens Camera The Heat Company Wildside Facebook Group FESTIVALS North Shore Birding Festival Space Coast Festival Florida Bird & Photo Fest Biggest Week Acadia Birding Festival SE Arizona Birding Fest Cape May Bird Fest Rio Grande Valley Conservation Partnerships BirdsCaribbean.org Black Swamp Bird Observatory Friends of Magee Marsh Orange Audubon Society OUR TOURS TOURS BY DATE All Tours By Date Birding Tours by Date Photography Tours By Date Wildlife Safaris By Date TOURS BY REGION North America – Alaska & Hawaii – USA National Parks Caribbean Central America & Mexico South America – Galapagos Islands Africa / Middle East Europe India / Asia / Australia Arctic & Antarctica TOURS BY STYLE Photography Tours Wildside Limited Series OM System Photo Workshop Women Only Workshop Nature Journaling Birding Tours Big Year Birding Tours Short Trips – Target Birds Wildlife Safaris Wildside Weekender One Week – One Lodge Tours Small Ship Adventure Cruises Private Tour Planner TRAVEL CERTIFICATES Blogs & Trip Reports Updates & Trip Reports News and Updates Trip Reports Birding & Nature Blogs Notes from the Wildside Big Year Blog Photography Blogs The Wild Lens Online Learning Personal Instruction ONE-ON-ONE PHOTO INSTRUCTION OLYMPUS ONE-ON-ONE INSTRUCTION WEBINARS UPCOMING WEBINARS BIRDING WEBINARS PHOTOGRAPHY WEBINARS NATURE & TRAVEL WEBINARS Have Questions? Ask Kevin a Question About This Tour \" * \" indicates required fields Tour Name * If not already completed, please enter the tour name above. Your Name * First Last Email * Phone * Questions * CAPTCHA Receive Periodic Emails and Updates Yes, please add me to your email list! Company This field is for validation purposes and should be left unchanged. Δ Space Coast Festival Meet Our Team Kevin Loughlin Adrian Binns Glenn Crawford Chris Brown Greg Miller Scott Weidensaul Edison Buenaño Pedro Guaycha Gabriel Lugo Catherine Hamilton John Kricher Esteban Daniels Alex Lamoreaux James Adams Kevin Karlson Dale Rosselet Luke Tiller Lee Hoy Josh Engel Tom Stephenson Alyce Bender Dawn Wilson Jennifer Leigh Warner Rafael Rueda Hernández Lauren diBiccari Chris McGinnis Kyle Moon Sandy Zelasko Manomet Staff Scott Whittle NEWS & UPDATES Stay up-to-date with new tours, special offers and exciting news. We'll also share some hints and tips for travel, photography and birding.\nWe will NEVER share nor sell your information! Name * First Last Email * Preferred Trip Styles * Please help us send the information for trip styles in which you are most interested. Birding Photography Wildlife Viewing Nature Journaling Captcha LinkedIn This field is for validation purposes and should be left unchanged. Δ Space Coast Birding & Wildlife Festival — January 24 – 28, 2024 Wildside Nature Tours is a top sponsor of the Space Coast Birding & Wildlife Festival. Each year, Wildside brings a number of our tour guides to volunteer leading fields trips, offer spotlight and keynote talks and man the Wildside booth in the vendor area, giving you ample opportunity to get to know our team. Florida is rich in native populations of wildlife and birds, but it is also on a busy route for migrating birds stopping over for the winter. Florida’s Space Coast – home to Merritt Island National Wildlife Refuge, Canaveral National Seashore, and Kennedy Space Center, is one of the best birding locations in the United States because it is situated at the convergence of two zones — temperate and tropical — creating a natural diversity of unique habitats that attract varied bird species. For a crash course on Florida’s wildlife, this Festival is ideal for all ages, from beginners to veterans, and the Wildside leaders are on hand to help you learn about and enjoy all we see. We can’t even put into words the gratitude we have for what Kevin Loughlin and his Wildside family of tour guides contributes to the Space Coast Birding and Wildlife Festival. For nearly ten years, we have been fortunate to provide world class birders on many of our field trips due to the leaders that Kevin brings to our festival for that sole purpose. His support also allows us to offer keynote speakers that are the leading experts in their fields of expertise. What means the most though, is Kevin’ genuine interest and outreach to do everything possible to help ensure that our festival remains one of the premiere birding festivals in the country. We consider his friendship, and his team, priceless! —Barb Eager, Executive Director – Brevard Nature Alliance To learn more about this festival visit the Space Coast Bird and Wildlife Festival website. Get in Touch! 888-875-9453 +1 (610) 564-0941 info@WildsideNatureTours.com Mailing Address: Wildside Nature Tours 241 Emerald Drive Yardley, PA 19067 Additional Resources Meet Our Team News & Updates Registration and Cancellation Privacy Policy Trip Insurance Client Information Form About Us Since 1993, Wildside has offered birding tours and photo workshops that adhere to strong ethical standards. We believe in leaving the smallest possible footprint on the environment while maximizing the positive economic impact on local communities. Images and content protected and monitored. © 2025 Wildside Nature Tours. All Rights Reserved."
    },
    {
      "url": "https://mymerrittislandfl.com/event/space-coast-birding-and-wildlife-festival/",
      "text": "Space Coast Birding and Wildlife Festival  - Merritt Island Redevelopment Agency Skip to content WELCOME TO MERRITT ISLAND, FL – CALL TODAY @ 321-454-6610 OR EMAIL CONTACT / LOCAL RESOURCES NEWS EVENTS DISCOVER M.I. Toggle Navigation An Island of OPPORTUNITIES Doing BUSINESS On The Island We’re Here To Help Your Business Through Planning, Partnerships, Infrastructure, Financing Tools & Grants. INVESTING In Merritt Island Invest Here Why Merritt Island Discover Our Island Why Brevard Florida’s Space Coast Why Florida The Sunshine State Featured Commercial Space Available in Merritt Island Major Employers Demographics & Rankings Redevelopment in the News Merritt Island Health First to Be a Huge Driver for Redevelopment Looking Back, Looking Up TWO LNG-powered vessels call Port Canaveral home Zoning Changes for Health First Move Forward Contact Us Learn More Redevelopment in ACTION Merritt Island on Florida's Space Coast Redevelopment Work For Business & Community MIRA CONTACT & LOCAL RESOURCE INFO Development Opportunities & Resources Infrastructure Investment Merritt Island Brownfields Grant Program Merritt Island Safe Streets for All Program Commercial Facade Grants Storm Water Credits Calculator Contact Us Learn More Fortenberry Regional Stormwater Treatment Collaborative Featured Projects Health First Hospital Slated to Be the Largest Capital Project in Central Merritt Island History Veterans Memorial Park 82 Acre Park Featuring Beautiful Lakes, Trails and Planned Entertainment Venue Cone Road Project Storm Water Runoff Infrastructure Investment Griffis Landing at Blue Crab Cove A 2.7 Acre Historic Waterfront Site About MIRA Merritt Island on Florida's Space Coast Redevelopment Work For Business & Community MIRA CONTACT & LOCAL RESOURCE INFO About MIRA Governance & Meetings Governing Documents, Access and Reporting Leadership Professional Staff and an Appointed Volunteer Board MIRA Redevelopment Zones Oversite for Four Designated Zones PARTNERS At the Heart of Redevelopment Project Successes How We ASSIST Redevelopment Planning, Tools and Support Upcoming Events & Meeting Notices Sep 25 Featured Featured 2:00 pm - 5:00 pm MIRA Board of Directors Meeting Oct 23 Featured Featured 2:00 pm - 5:00 pm MIRA Board of Directors Meeting Nov 27 Featured Featured All day MIRA Board of Directors – No Meeting in November Dec 11 Featured Featured 2:00 pm - 5:00 pm MIRA Board of Directors Meeting View Calendar Featured Project The Amphitheatre at Veterans Memorial Park Island Living Living LIFE On The Island Merritt Island’s Rich History, Culture, And Environment Make For A Perfect Mix Of Work / Life Balance. DISCOVER MERRITT ISLAND Living in Merritt Island Featured Stops Indigenous Adventures History & Legacy Explore Florida’s Space Coast kennedyspacecenter.com portcanaveral.com spacecoastlaunches.com visitspacecoast.com Toggle Navigation Contact Us Learn More Invest Here An Island of OPPORTUNITIES Why Merritt Island Discover Our Island Why Brevard Florida's Space Coast Why Florida The Sunshine State Featured Commercial Space Available in Merritt Island Major Employers Demographics & Rankings News Redevelopment in the News Development Opportunities & Resources Projects Featured, Infrastructure Investment & Planning Merritt Island Brownfields Grant Program Facade Program Commercial Grant Opportunity Storm Water Credits Calculator Pre-application Preliminary Estimating Tool Living in Merritt Island Life On The Island Featured Stops Indigenous Adventures History & Legacy About MIRA Merritt Island Redevelopment Agency Governance & Meetings LEADERSHIP MIRA Redevelopment Zones PARTNERS Meeting Notices News Redevelopment in the News Events MIRA Meetings & Area Events Meeting Notices MIRA Board Meetings & Events This event has passed. × Space Coast Birding and Wildlife Festival January 22 - January 24 The Space Coast Birding and Wildlife Festival introduces nature-lovers to some of Florida’s best birding areas on birding and photo trips led by expert leaders. Based out of the Radisson Resort at the Port, Cape Canaveral, the festival’s Expo Hall will host optics dealers, tour companies and local environmental organizations. After morning field trips, some by bus, others in your own car, visit the Expo Hall Wednesday through Saturday afternoons. Keynotes, Wednesday through Saturday, are after the close of the Expo Hall. Fees and preregistration are required for field trips, a few workshops and keynotes. One day registration is $25, with field tips or keynotes additional. Admission to the Expo Hall is free and there are many free workshops to attend. The American Flamingo is our bird of the year, with 19 flamingos reported from the Indian River Lagoon! If you are interested in photography, we have special trips and workshops. Take one of the boat trips to see Botttlenose Dolphins, Manatees, and even whales offshore or one of the boat trips on the St. Johns River. This is the 26th year of this festival, one of the biggest in the country, formerly held in Titusville and just bouncing back after a pandemic-driven hiatus. If you love nature, join us for a great time! Expo Hours: Wed – Fri from 12 PM – 5 PM and Sat from 10 AM – 6 PM 12 PM Doors Open (when exhibitors return from morning field trips) 5 PM Sips n Bits Appetizers (free with your punch card). Fill your plate and take another look at your favorite booths. 6 PM Keynote Speaker in the Jamaica Room. Space Coast Birding & Wildlife Festival 2025 – Online Marketing Event By Cindy Staples Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Share This Story, Choose Your Platform! Facebook X Reddit LinkedIn WhatsApp Tumblr Pinterest Vk Xing Email Event Navigation Cocoa Beach Kite & Beach Fest MIRA Board of Directors Meeting Details Start: January 22 End: January 24 Event Category: Area Events Merritt Island Redevelopment Agency 2575 N. Courtenay Parkway, Ste. 214 Merritt Island, FL 32953 Registered Agent’s Name: Mr. Larry J. Lallo EMAIL 321-454-6610 © 2024 Merritt Island Redevelopment Agency | Established October 4, 1988, Brevard County, Florida | County Ordinances 1988-37, 2006-32 & 2014-21 | Chapter 163, Part III & 189 , Florida Statutes Privacy Policy | Accessibility Policy | Contact Us Page load link Go to Top"
    },
    {
      "url": "https://www.scbwi.org",
      "text": "The Global Community for Children’s Book Creators – SCBWI The Global Community for Children’s Book Creators The Society of Children’s Book Writers and Illustrators provides the resources,  professional networking, and community-building opportunities that support writers, illustrators, and translators throughout their careers. Register today SH Shelley Hanmo Author, Illustrator Happening Now The Winter Conference in NYC is January 16-18 Mark your calendars! The in-person Winter Conference features keynotes from Meg Medina and Tiffany Jackson and a special interview with Jason Reynolds. Registration opens October 14. Deep Dive Into Nonfiction Our next offering from SCBWI University! Designed for children's book creators eager to create nonfiction children's books that will sell in today’s market. Register Now Create Your BookStop Page Today! This powerful marketing opportunity increases visibility for both traditionally published and self-published children’s books, giving them exposure to a wide audience of book buyers. See more Community news SCBWI Weighs In on Google’s Gemini Storybook for Kids Artificial Intelligence (AI) continues to be a hot topic in children’s publishing. Publishers Weekly recently spoke with SCBWI Executive Director Sarah Baker about Google’s AI Gemini Storybook app, which lets users create personalized, illustrated storybooks with read-aloud narration. See full post A Statement on the Supreme Court Decision in Mahmoud v Taylor, by Ellen Hopkins Ellen Hopkins is the award-winning author of 20 nonfiction books for children and 15 New York Times best-selling young adult novels-in-verse, 2 middle grade novels, plus 4 novels for adult readers. She is also a longtime member of the SCBWI Advisory Council and member of the SCBWI Anti-Censorship Committee. See full post Congratulations to SCBWI Member of the Year, Debbie Ridpath Ohi! Debbie Ridpath Ohi was awarded the Stephen Mooser Member of the Year award at our 2025 Summer Conference. Congratulations Virtual Portfolio Showcase Winners! Our annual Summer Virtual Portfolio Showcase is a career-launching opportunity for children's book illustrators! Congratulate the winners and learn more about their artwork on SCBWI.org! View the Virtual Portfolio Showcase Winners! Apply to the Bologna Children’s Book Fair Scholarship for Illustrators - Closes September 30, 2025 Learn More and Apply This month's featured illustrator - SHELLEY HANMO Get to know this month’s illustrator – their techniques, how they got started, and how they navigate the publishing industry. Take the Featured Illustrator Challenge and apply now to be the next Featured Illustrator! Click to learn more Congratulations to the July/August Draw This Winners! Prompt: MISMATCHED Congratulations to our #SCBWIDrawThis winners!\n\nPractice your craft and build you portfolio by participating in monthly art prompts. Member Illustrators can post their DrawThis! entries on Instagram, Bluesky, and on the Illustrator Gallery with the tag #SCBWIDrawThis to enter and have your art seen by industry pros. The September 2025 prompt is TRAVEL. See full post Kim Turrisi Promoted to Vice President at Society of Children’s Book Writers and Illustrators A foundational figure of SCBWI for more than two decades, Kim brings a legacy of dedication, innovation, and unwavering support for members to her new leadership role. Read more Carla Hayden: A Constellation by Ellen Hopkins On May 20, SCBWI joined forty-seven organizations in a public statement condemning the firing of Dr. Carla Hayden, the fourteenth Librarian of Congress, and urging Congress to intervene. Read More SCBWI ILF: Children’s Book Changemakers Special This thought-provoking 85-minute special was hosted on May 27, featuring Lin Oliver, Maulik Pancholy, Ann and Ben Brashares, Winsome Bingham, Linda Williams Jackson, and more special guests. Watch Video Explore opportunities Member benefits Discover expert tips, resources, and inspiration for children’s book writers, illustrators, and translators to succeed in publishing and improve their creative skills. Learn more Global Regional Chapters Find your community close to home. Connect with local members for critiques, \nnetworking and more. Find your community Awards and grants Let your talent shine and enter for some financial and skills-related support. Explore categories Stay Connected The Official SCBWI Blog Hosted by Justin Campbell and monthly guest-bloggers, the SCBWI Blog contains industry news, interviews, and in-depth posts addressing everything from book promotion, to school visits, timely issues and more! Two new posts each week! See more SCBWI Podcast Catch up on our weekly podcast, featuring interviews with publishing professionals as well as award-winning writers, illustrators, and translators. New episodes every Thursday! See more SCBWI YouTube Our YouTube channel features everything, from how-to guides to help you navigate SCBWI.org to archival footage of the greatest kid lit creators of all time. Check in monthly for our interviews with SCBWI Featured Illustrators. See more Frequently Asked Questions Membership Find out why membership matters. Learn more Common questions Questions you’re probably asking yourself\nright now. Learn more Awards & Grants Learn how to submit to awards, grants, and scholarships. Learn more Your imagination knows no bounds, SCBWI helps it soar Find your creative community and bring your stories to life. Join SCBWI Today About Membership Our Mission Who We Are Global Regions Impact and Legacy Fund Partners Annual Report Gift Cards Submissions & Showcases Awards and Grants Illustrator Gallery Member Bookstore Translation in SCBWI SCBWI at Bookshop.org Events Annual Events Regional In-Person Events Regional Virtual Events Publications The Essential Guide to Publishing for Children Self-Publishing Resources Newsletters Podcasts The Official SCBWI Blog Connect & Support FAQ & Policies Contact Us Donate Privacy Policy Terms of Service Cookie Notice Careers Discussion Board © Copyright 2024 SCBWI. All Rights Reserved."
    },
    {
      "url": "https://www.nbbd.com/fly/",
      "text": "Space Coast Birding and Wildlife Festival CONNECT CONTACT NBBD Home Page Go & Do Sports Cultural History & Museums Space Nature & Outdoors Non-Profits Houses of Worship Government Education Interactive Site Map Disabilities Services CONTACT BUSINESSES Businesses Directory Restaurants Real Estate EVENTS LISTING Festivals Facebook Downtown Titusville Parks & Recreation Parks Activities Community Center Calendars Wildlife Refuge National Seashore Enchanted Forest Sams House PRESS RELEASES Brevard County City of Titusville Downtown Titusville NASA NASA PR SpaceX PR ULA PR Blue Origin PR Launch Viewing Parrish Medical OUTDOORS National Wildlife Refuge National Seashore Refuge/Seashore MAP Sanctuaries Enchanted Forest Sams House Sanctuaries MAP Ecotourism Photography Space Coast Outdoors Birding Paddling Hiking Biking PARKS Calendars North Area Parks Scottsmoor & Mims Titusville Area Port St. John & Canaveral Groves Disabilities LIBRARIES Mims / Scottsmoor Titusville Port St. John Brevard County Genealogy SOFT ADVENTURES Playgrounds Downtown Titusville Museums & History Refuge & Seashore South Titusville Fishing & more POPULAR North Brevard History Windover Bog People Gopher tortoise Warbird Airshow Edible Plants Black Point Drive Fort Christmas Manatee Hammock Campground Wildlife Festivals Wildlife Rehabilitators St. Johns River Fishing Pier Parrish Medical Sea Turtle Festival N.B. Heritage Foundation ????? Menu with CSS3 Css3Menu.com 2025 Space Coast Birding and Wildlife Festival January 22nd-26th, 2025 www.scbwa.net (12/10/23) January 2024 Information: On behalf of the Space Coast Birding and Wildlife Association, we invite you to join us for the 25th Space Coast Birding and Wildlife Festival, January 24-28, 2024, Cape Canaveral, FL. As one of our sponsors said – this is the “Rise of the Phoenix’ in the birding festival community! The festival is being held at the Radisson Resort at the Port and what makes this location so amazing is it allows us to offer everything under one roof - sleeping rooms, meeting rooms, Expo Center, dining options, field trip bus departures, you name it!  We are excited to have the ability to meet the demand we have had in the past! For your convenience we have secured a block of rooms at the Radisson Resort at the Port, 8701 Astronaut Blvd., Cape Canaveral, FL 32920, at a discounted rate for 2024 Space Coast Birding and Wildlife Festival attendees. Attached please find the link to this special rate: https://www.choicehotels.com/reservations/groups/G9639537 . Please visit www.scbwa.net for more information. Do not hesitate to contact Kathy Rooney at kathy@scbwa.net or Barb Eager at barb@scbwa.net if you need any further information. Festival Registration is scheduled to open early November 2023. We have chosen to have the Sandhill Crane as our official festival bird for 2024. Cranes symbolize travel, open mindedness, aspiration, and as a symbol of grace, the crane inspires us to pause and reflect and honor the miracles around us. Come join us, we are not flying into extinction, we are coming back better than ever! ARCHIVES SPACE COAST BIRDING AND WILDLIFE FESTIVAL 1997-2021 END OF AN ERA BREVARD NATURE ALLIANCE (BNA) AND HOST OF THE SPACE COAST BIRDING AND WILDLIFE FESTIVAL SAYS THANKS FOR THE MEMORIES This is exceedingly difficult news to share, but after thoughtful deliberation by the BNA Board of Directors, the time has come to do so. After two years of not having the Space Coast Birding and Wildlife Festival, the Board of Directors had ample discussions sharing perspectives and opinions regarding the future of the festival and the BNA. On March 2nd, 2022, the BNA Board of Directors voted unanimously to discontinue the festival and dissolve the 501 (c) (3) non-profit corporation effective April 30, 2022. There are several reasons for this decision, but it narrows down to: Financial consequences of not having the festival the last two years which normally constitutes almost 95% of the BNA’s annual income; The dramatic changes we are seeing in bird migration patterns and changes in habitat resulting in a decline of birds and wildlife to be seen; Declining registration numbers from our loyal festival attendees who became a part of the demographic hesitant to travel during the times of covid and with the uncertainty of what the near future holds; On behalf of the BNA Board of Directors, we want to say thank you with our sincerest gratitude to everyone who has been a part of the success that the organization and festival have enjoyed for 25 years. We will be reaching out to sponsors and exhibitors who provided financial support for 2023 festival and/or of the BNA organization to see how you wish to direct the return of funds if requested. It will also be a chance to say thank you personally. Barb, Laurilee, Kathy and Jim FYI • • THIS IS NOW ARCHIVED • • FYI Space Coast Birding & Wildlife Festival 2022 Space Coast Birding and Wildlife Festival cancelled due to COVID and lack of birds It is with a heavy heart that we are informing you that the Space Coast Birding and Wildlife Festival will be canceled for 2022. It was a difficult decision. But we want to ensure that our guests are safe and with Covid exploding in our community the way that it is, we can’t provide an atmosphere in which we are confident that our guests will be safe. Florida Today — January 7, 2022 scbwf.org 2021 The tradition continues in 2021 with the 24th Annual Space Coast Birding & Wildlife Festival offering great speakers, education workshops, and of course, social interactions. This year, however, we will be doing all of this online with many virtual sessions - some live, some pre-recorded, and some interactive! New Location for 2022 Festival Brevard Nature Alliance is excited to announce we have found a new home for the Space Coast Birding and Wildlife Festival! Having outgrown the premises used for many years in the Titusville area we are pleased to announce that our new home for the 2022-2023-2024 festivals will be the Radisson Resort at the Port, Cape Canaveral, Florida. 24th Annual Space Coast Birding & Wildlife Festival January 2021 VIRTUAL THIS YEAR : ON LOCATION CANCELLED Festival phone number: 321-268-5224 barb@brevardnaturealliance.org May 5, 2020: Facebook Message from Barb Eager, Executive Director With heavy hearts, and after considerable contemplation, reflection, and conversations with the many friends and supporters of the Space Coast Birding and Wildlife Festival (SCBWF) - from sponsors to exhibitors, to speakers, to leaders, and most especially our attendees, we have made the difficult decision to cancel the 24th Annual SCBWF which was to be held in January 2021. For us as an organization, we feel that currently it is the socially responsible thing to do considering our demographic, and our inability to get a firm commitment on a location in a timely manner. We are going to take this year off to secure a new location here on the Space Coast that will enable us to continue offering the multitude of events we do; at the level of quality and content we do. We are planning on rebranding and restructuring to be back bigger and better than ever, January 26th - January 30th, 2022. In the meantime, we are looking at a multitude of options to stay out there and involved whether it be a local community event, virtual or webinars, etc. I am astounded at the ways everyone is getting so creative and hope we can emulate. On behalf of the staff and the Brevard Nature Alliance Board of Directors, we wish you all the best as we work our way through this very unprecedented time in our lives. Barb Eager Executive Director Brevard Nature Alliance www.scbwf.org THE 2024 OFFICIAL FESTIVAL WEBSITE North Brevard Business Directory In-depth community resources for the Titusville, Florida area • HOME Titusville Area Businesses Calendar/Events Festivals Places to Go Things to Do Ecotourism About the NBBD Community Organizations Government Maps Get out and go! Keeping you up-to-date with what is available and what is going on in the Titusville, FL area. Contact the webmaster for most anything by CLICKING HERE the North Brevard Area Produced by Peak Performance Co. nbbdcom@gmail.com Last updated: 5/6/20 —  © 1996 - 2016 • Info on participating in this directory. • Info for non-profits. • We can register, produce, host and market your Internet presence. Originated April, 1997 This was the originating website (for 13 years) of the \"Space Coast Flyway Festival\" see: The First Thirteen Years — 1997 - 2009 by Dave Freeland ARCHIVES of some past Festival Programs (searchable PDFs)"
    },
    {
      "url": "https://scbwa.net/presentations/",
      "text": "Presentations - Space Coast Birding and Wildlife Festival Skip to content director@scbwa.net January 21-25, 2026 Radisson Resort at the Port Cape Canaveral, Florida Facebook page opens in new window Instagram page opens in new window X page opens in new window Space Coast Birding and Wildlife Festival January 24th – 28th, 2024 Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact 2026 Presentations – COMING SOON All presentations are free with registration. Since we are adding presentations currently, feel free to select when you pick up your badge or, since space is limited, save your confirmation number and log in again to select. LAST YEAR’S PRESENTATIONS: Wednesday Save Our Sea Grasses through Low Impact Living Fakhatchee Strand’s Iconic Ghost Orchids and Other Rare Plants Digiscoping Sparrows How You Can Help Local Whales and Dolphins Why Native Plants Are Important Call of The Wild: The Amazing Sounds of Florida’s Wildlife Thursday Conservation at the Brevard Zoo Rain Garden Benefits and How to Develop Them Monitoring Whales and Other Cetaceans Discover Panama: A Birdwatcher’s and Nature Lover’s Paradise Audubon’s Birds of Florida by Clay Henderson (CANCELLED due to illness of speaker) Birds & Culture in Southern Portugal 3-4:15 Martinique Friday Conservation & Wildlife of the Western Caribbean, Bocas del Toro, Panama Friday 12-1:15 Jamaica Feathers & Fermentation: Good Times for Good Causes Friday 12-1:15 Antigua Restoring the Balance of the Indian River Lagoon Friday 12:00-1:15 Martinique The Plastic Diet Friday 1:30-2:45 p,m Martinique Demystifying Birding in Columbia – One Bird at a Time 1:30 p.m. – 1:15 p.m. Martinique What’s Going on at the American Birding Association (ABA)? Friday 3-4:15 p,m, Antigua The Battles of Midway Friday 3-4:15 p.m Bermuda Saturday eBird Tips and Tricks: Maximizing Your Use of the World’s Largest Citizen Science Database 12:00 p.m. – 1:15 p.m. Martinique Let’s Be a Good Neighbor to the Lagoon 1:30 p.m. – 2:45 p.m. Martinique Birding Amazonas and Other Great Spots in South America 1:30 p.m. – 2:45 p.m. Bermuda Is Prescribed Fire Really Good for Birds? 1:30 p.m. – 2:45 p.m. Jamaica Gateway to Trinidad: The Asa Wright Nature Center 3:00 p.m. – 4:15 p.m. Bermuda How Important Are Caterpillars for Birds? Critical! 3:00 p.m. – 4:15 p.m. Martinique Room Wednesday, January 22 Save Our Sea Grasses through Low Impact Living Seagrass is considered the most crucial habitat in the Indian River Lagoon, acting as a primary food source and shelter for numerous marine species, including manatees, fish, and invertebrates. Presence of sea grass indicates the lagoon’s overall health, due to its sensitivity to water quality changes.  A new report on the health of the Indian River Lagoon shows mixed results, with some areas improving while others are still struggling with sea grass growth. The complexity of the Indian River Lagoon makes it difficult to pinpoint one area of concern. In this presentation, Dr. Laura Wilson will share the importance of improving water quality and what each of us can do, including living shoreline restoration, using rain barrels, native plantings and buffer zones around ponds. Date: Wednesday, January 22 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Bermuda Room Cost: Free with festival registration About the Speaker: Dr. Laura Wilson is Executive Director of the Marine Resources Council. Inspired by the natural world, Laura pursues work that brings together her love of learning, teaching, and exploring. Her background is in vertebrate paleontology, specifically studying ancient marine ecosystems that evolved in a greenhouse climate and comparing them to modern systems. After 12 years in academia, Laura realized she wanted to make a bigger impact on Earth’s future. She started as the Executive Director of MRC in June 2024, where she is able to employ strategic leadership, encourage data-informed decision making, facilitate collaborations, and encourage life-long learning. Fakhatchee Strand’s Iconic Ghost Orchids and Other Rare Plants The Fakahatchee Strand State Preserve is Florida’s largest state park and contains some of the most diverse rare plant life in the United States. Thirty-three kinds of ferns, some 10 feet high, grow here, the most on the continent. There are 16 species of bromeliads, air plants resembling pineapples, including some found only here. Forty-four kinds of orchids, all listed as threatened or endangered, are hidden in the dense tangle of jungle. These include the iconic ghost orchid. The Orchid Thief is a 1998 non-fiction book by American journalist Susan Orlean, based on her investigation of the 1994 arrest of horticulturist John Laroche and a group of Seminoles in south Florida for poaching rare orchids in the Preserve. The movie Adaptation with Meryl Streep and Nicolas Cage was based on this book. Date: Wednesday, January 22 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Jamaica Room Cost: Free with festival registration About the Speaker: Mike Owen worked thirty years as park biologist at Fakahatchee Strand and retired in summer 2023. A University of South Florida graduate, Mike worked for the state’s marine research division in St. Petersburg, but when he went to work for the park service, he found his niche. At home in the swamp, he found a balance between educating about Fakahatchee’s rare plants and protecting them. Digiscoping Sparrows In this presentation, you will learn about the art of digiscoping the often under appreciated sparrows. You will learn to find the beauty and joy in the common and uncommon sparrows of the US. Date: Wednesday, January 22 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Jeremiah is originally from the Pineywoods of East Texas and is a lifelong nature lover and outdoorsman. He has always especially loved birds of prey. After watching Dr. Fitzpatrick’s lecture on the possible re-discovery of the ivory billed woodpecker he stumbled upon Cornell advertising a global big day. His first day birding was a big day in May 2020. He immediately became obsessed and started chasing everything He could. He fell in love with Digiscoping out of a need to try to get birds identified. He has since then fallen in love with sparrows and spent some of 2022 and all of 2023 digiscoping the sparrows of the United States. He has produced three calendars and two amateur photographic books of his phone photography. He now loves professional photography as well. He guides a bit now as well as became a Kowa brand ambassador in 2024. How You Can Help Local Whales and Dolphins The Hubbs-SeaWorld Research Institute focuses on local whales and dolphins and stranding response efforts. This workshop will highlight best practices if you discover a stranded or injured whale or dolphin, how you can help local dolphins, and the tools and techniques used by Hubbs-SeaWorld researchers to study dolphins – like photo-identification and tracking methods. Date: Wednesday, January 22 Time: 3:00 p.m. – 4:15 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Wendy Noke Durden is a Research Scientist at Hubbs-SeaWorld Research Institute’s Florida Laboratory. She began her marine mammal career by volunteering for the cetacean stranding network, while completing her Master’s at University of Central Florida on dolphin interactions with the commercial blue crab fishery. She has studied the population biology, behavioral ecology and health of marine mammals for over 20 years, publishing over two dozen scientific manuscripts. Wendy’s focus is the conservation, health and ecology of local whale and dolphin populations. She co-directs the marine mammal stranding program, is the lead investigator on Florida’s dolphin population ecology program, and directs Hubbs’ efforts to rescue and monitor entangled, out of habitat, or free-swimming dolphins in need of intervention. She oversees internships, undergraduate research projects and provides guidance to graduate students. Why Native Plants Are Important Why is WHAT you plant in your landscape important?  Here’s the science to prove how important your landscape choices are. We’ll be sharing a copy of Dr. Doug Tallamy’s presentation ‘Restoring Nature’s Relationships’ with amazing nature photography which shows the relationship between plants and wildlife. This event is free to the public so please help us get the word out! Date: Wednesday, January 22 Time: 3:00 p.m. – 4:15 p.m. Location: Radisson Resort at the Port, Antiqua Room Cost: Free with festival registration About the Speaker: Jane Higgins moved to Brevard County over 45 years ago from Maine. After working at Harris for 30 years in accounting and raising two children, she started following her mother’s passion for gardening. Her motivation to go native started when she realized her youngest son would be leaving for college and she would have to learn how to use a lawnmower to mow a lawn that didn’t look very good to begin with. Jane joined the Conradina Chapter of the Florida Native Plant Society 12 years ago and has been on the Board for the past 10 years. She is also on the Landscaping with Florida Natives Tour Committee. The grass and the lawnmower are now both gone and she enjoys going outside to see what’s blooming and all the wildlife, recently including a Barred Owl. Jane is a huge fan of Dr. Doug Tallamy’s work and enjoys sharing his message with others! Call of The Wild: The Amazing Sounds of Florida’s Wildlife The Amazing Sounds of Florida’s Wildlife by David Mann, Haikubox David Mann delves into the symphony of animal sounds that resonate throughout the diverse ecosystems of Florida. From the mesmerizing underwater harmonies of fish choruses, dolphins’ melodic whistles, and manatees’ endearing squeaks, to the alluring calls of Florida’s bird species, this talk unveils the intricate auditory world of the Sunshine State. Along the way, you’ll learn about new cutting-edge birdsong detection technology being used to build a community science monitoring network. David will share distinctive audio recordings to showcase the vast array of living creatures that enrich Florida’s distinctive acoustic environment, underscoring their significance and the importance of safeguarding these fragile ecosystems for the benefit of future generations. Date: Wednesday, January 22 Time: 3:00 p.m. – 4:15 p.m. Location: Radisson Resort at the Port, Bermuda Room Cost: Free with festival registration About the Speaker: David Mann has extensive experience in bioacoustics research and scientific instrumentation development. He earned his PhD in Biological Oceanography from MIT and the Woods Hole Oceanographic Institution, followed by 12 years as a faculty member at the University of South Florida where his lab studied hearing and acoustic communication in fishes and marine mammals.  In 2003, he founded Loggerhead Instruments to design and sell underwater acoustic equipment for scientific research. Haikubox was hatched when David and a long-time colleague at the Cornell Lab of Ornithology envisioned an automatic birdsong identification product developed and sold by Loggerhead Instruments which incorporates technology created at the Lab. Thursday, January 23 Conservation at the Brevard Zoo Take a virtual look behind the scenes at Brevard Zoo, where we’ll be showcasing how we answer the call to conserving some of Florida’s most endangered species. This presentation focuses on the critically endangered Florida Grasshopper Sparrow program and the combined efforts of multiple agencies to monitor, protect, breed, and release hundreds of birds every year onto the Florida’s prairies to bring this species back from the brink of extinction. Attending this presentation will give you an insight into the recovery project as a whole and show you why this species matters. Date: Thursday, January 23 Time: 12:00 p.m. – 1:15 p.m. Location: Radisson Resort at the Port, Bermuda Room Cost: Free with festival registration About the Speaker: Kelly Currier is Conservation Coordinator at the Brevard Zoo and a conservationist with a passion for ecosystem biodiversity. She has centered her career working on species recovery projects and in wildlife rehabilitation. She specializes in husbandry for species that are a part of breeding and release programs that have specific habitat requirements and need to remain as wild as possible for release. Kelly joined Brevard Zoo three years ago and continues her work as the coordinator for the Florida Grasshopper Sparrow breeding project at the zoo, helping to develop it into the successful breeding program it is today. Rain Garden Benefits and How to Develop Them A rain garden is a depressed area in the landscape that collects rain water from a roof, driveway or street and allows it to soak into the ground. Planted with grasses and flowering perennials, rain gardens can be a cost effective and beautiful way to reduce runoff from your property. Rain gardens can also help filter out pollutants in runoff and provide food and shelter for butterflies, song birds and other wildlife. Date: Thursday, January 23 Time: 12:00 p.m. – 1:15 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Zachary Eichholz, works with the City of Cape Canaveral. Monitoring Whales and Other Cetaceans Sightings of the critically endangered Right Whales occur around coastal Central Florida in January. There are currently fewer than 375 North Atlantic Right Whales in existence, making local and regional volunteers essential in protecting these animals when they arrive off Central Florida’s shorelines each winter. The Blue World Research Institute trains and leads coastal volunteers to spot and report sightings of these whales, which migrate from Canada and New England to Georgia and Florida each winter to deliver their calves. The Blue World Research Institute responds to reports of large whale injuries and entanglements and train teams globally for this dangerous and critical work. This organization uses the latest technology to make a detailed health assessment of individual marine animals. Blue World Research Institute also works to stop trash and plastics from entering the oceans and waterways, and organizes coastal shoreline clean-ups, both on rivers and beaches, to pick-up and document the extent of the pollution problem.Description Date: Thursday, January 23 Time: 12:00 p.m. – 1:15 p.m. Location: Radisson Resort at the Port, Jamaica Room Cost: Free with festival registration About the Speaker: Julie Albert, director of the Blue World Research Institute’s Right Whale Sighting Network, https://bwri.org/. earned a marine biology degree at Texas A&M in Galveston, Texas, and volunteered for the Texas Marine Mammal Stranding Network and working in cephalopod aquaculture — raising king penguins — before moving to Florida in 1999 to work as the Marine Resources Council’s Right Whale Program Coordinator. That program was taken over by Blue World Research Institute in 2023. Discover Panama: A Birdwatcher’s and Nature Lover’s Paradise Nestled between North and South America, Panama may be compact, but it rivals the natural splendor of much larger nations. This biodiversity hotspot, no bigger than South Carolina, is a treasure trove for nature enthusiasts. With over 1,015 bird species, along with diverse mammals, reptiles, amphibians, and more than 10,000 plant species, Panama’s ecological richness is nothing short of extraordinary. Join Carlos Bethancourt, a seasoned guide with the Canopy Family, on a captivating photographic journey. Explore lush habitats, from the historic Canal Zone to the foothills of western Panama and the untamed beauty of the Darién lowlands in the east. Along the way, encounter everything from majestic toucans and vibrant hummingbirds to the elusive Panamanian Night Monkey and playful Kinkajous. Carlos’s engaging stories and vivid imagery will transport you right into the heart of Panama’s wilderness. Prepare to immerse yourself in an adventure where each turn reveals why Panama is a paradise for birding and nature exploration. Date: Thursday, January 23 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Carlos Bethancourt was born in Panama City in 1978 and grew up surrounded by the natural beauty of Huile, a rural village near the Canal Zone. Influenced by his family’s deep connection to nature, he developed a passion for conservation and birdwatching from an early age. After high school, Carlos earned a scholarship to study natural resources and ornithology at Mt. Hood Community College in Oregon. He began his career at the Canopy Tower in 2000, quickly establishing himself as a leading figure in the birdwatching community. Over the years, he has led tours, workshops, and presented at major birding events across the United States, Great Britain, and Germany, sharing his expertise with bird enthusiasts around the world. In 2018, Carlos was recognized as ‘Best Nature Tour Guide’ by EcoTripMatch. Today, he remains deeply involved in marketing and conservation projects for the Canopy Family, working to promote ecotourism and protect Panama’s natural treasures. Audubon’s Birds of Florida by Clay Henderson John James Audubon’s expedition to Florida 1831-1832 was the most significant journey of the famous artist/naturalist. The exhibit at the Museum of Arts and Sciences in Daytona Beach entitled Audubon’s Birds of Florida chronicles this expedition. High-resolution reproductions of 39 birds Audubon painted from Florida together with 50 additional Florida birds from Birds of America are on display through March 5th at the Cici and Hyatt Brown Museum of Art of the Museum of Arts and Sciences in Daytona Beach. Our presenter Clay Henderson curated the exhibit. His accompanying book Audubon’s Birds of Florida captures the history and art of Audubon’s six-month expedition to the Florida Territory, describing previously unknown birds of the Florida wilderness. The narrative retraces his journeys through swamps, encounters with Indians and pirates, and survival from violent storms. Clay visited and searched for birds in all the places Audubon visited from the St. Johns River to the Dry Tortugas. Screenshot Date: Thursday, January 23 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Jamaica Room Cost: Free with festival registration About the Speaker: Clay Henderson has done extensive work in conservation land acquisition, developed the first county endangered lands acquisition program and helped launch Preservation 2000 and Florida Forever, the nation’s premier conservation programs. From 1995-2000 he served as President of Florida Audubon Society and prior to that was a member of the Board of Directors. In 1998 as a member of the Florida Constitution Revision Commission, he sponsored most of the environmental provisions in the Florida Constitution. Clay has visited and searched for birds in each of the places explored by John James Audubon and documented how those places have changed. He is a sixth generation Floridian and resides in New Smyrna Beach. Birds & Culture in Southern Portugal Southern Portugal offers a fantastic diversity of habitats and a large variety of birds, in a relatively small territory. All this, besides an excellent infrastructure and a rich cultural heritage, with winding streets, historic plazas and squares, an array of castles, cathedrals, museums, Roman ruins, promenades, culinary delights and great wines. Joao will talk about some of the practical aspects, should you plan a visit. Date: Thursday, January 23 Time: 3:00 p.m. – 4:15 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: João was born in Lisbon and studied Biology at the Faculdade de Ciências de Lisboa, from where he developed his professional career in the pharmaceutical industry, as senior manager and director of various multinational companies. With some 40 years of field experience, he has an intimate knowledge of the birds and birding in Portugal. He has travelled extensively in Europe, Africa, Asia and the Americas with birding as the main objective. João was a member of the national board of SPEA (BirdlLife International partner in Portugal) and was a voting member of the Portuguese Rarities Committee from 2005 until 2011 and chairman of the committee from 2007 until 2011. Author and co-author of articles about birds, João is also co-author of the book Where to Watch Birds in Southern Portugal . In 2008, he launched the first Portuguese company totally dedicated to the organization of birdwatching tours, Birds & Nature Tours Portugal, which he manages and guides many of its tours, as well as presenting bird identification courses. Besides birds, he has an active special interest in amphibians, reptiles and fish. Friday, January 24 Conservation & Wildlife of the Western Caribbean, Bocas del Toro, Panama Bocas del Toro, Panama, is not only unique, but also breathtaking! There are few places on earth where you can see all life-zones known to the Tropics. Bocas del Toro could be the most ecologically diverse place on planet Earth, we just haven’t found everything yet. Endemism of the local flora and fauna is off the charts. There are over 70 regionally endemic species of birds. A biological corridor of connected protected areas creates an extremely important zone for altitudinal tropical migrants, that rely on high altitude and low humid coastal forests to support their breeding and seasonal fruit foraging. The same habitat is also crucial for the North American migrants we know. Tranquilo Bay Eco Adventure Lodge is a 700- acre reserve, created to include all stakeholders, to ensure that local habitats are protected and to provide a sustainable way of life for future stakeholders. Date: Friday, January 24 Time: 12:00 p.m. – 1:15 p.m. Location: Radisson Resort at the Port, Jamaica Room Cost: Free with festival registration About the Speaker: Jim Kimball is an owner/operator of Tranquilo Bay Eco Adventure Lodge in Bocas del Toro, Panama. He has lived on site for over 20 years with his wife and business partner, creating a world class, full service, wildlife preserve. In doing so, they have protected nearly 700-acres of old growth Low humid Atlantic forest in the Western Caribbean, a habitat vitally important to an extraordinary cornucopia of regionally endemic species of flora and fauna. Feathers & Fermentation: Good Times for Good Causes Enjoying unique ciders and beers from local small businesses, seeing and learning about birds in new and interesting ways, and raising awareness and funds for some of the best conservation organizations around- these are a few of my favorite things! If you’re into these things too, come to this program where I’ll discuss my Feathers & Fermentation event series in Indianapolis, perhaps inspiring you to make or join a similar program in your area. Date: Friday, January 24 Time: 12:00 p.m. – 1:15 p.m. Location: Radisson Resort at the Port, Antiqua Room Cost: Free with festival registration About the Speaker: Wes Homoya was born and raised in Indiana, and as such is a firm believer in practicing Hoosier hospitality-living graciously with each other and this planet we all call home. This ethic was instilled in him by his parents: Barb, a nature-loving nurse who taught him compassion for little things like salamanders, and Michael, a botanist and author who exemplified not only why it’s important to know the names of the flora and fauna around you, but why we must share this knowledge with others. Eventually this desire to learn led to studying ecology and ornithology at Purdue University under the esteemed Dr. Barny Dunning. Various employments since have allowed him to live, work, and bird in wild places throughout Australasia, Southeast Asia (including a year in Hong Kong), Central and South America, the Caribbean, and Europe (including anti-poaching efforts with a bird conservation NGO on Cyprus). Currently, Wes resides in downtown Indy and spends his days conducting avian surveys throughout the Midwest, foraging wild ingredients for his brother’s libations at Ash & Elm Cider, and being an ambassador for birds and conservation in any way he can, whether via the Bird Safe Indy project for the local Audubon chapter or getting folks pumped up about birds n booze at his popular event series Feathers & Fermentation. Restoring the Balance of the Indian River Lagoon The current condition of the IRL didn’t change overnight – there was a recent defining moment that tipped the Lagoon from a more natural seagrass dominated system to a less natural algae dominated system. When we understand our roles in what ails the lagoon, we can better understand how to bring it back to a healthier balance. Date: Friday, January 24 Time: 12:00 p.m. – 1:45 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Heather Stapleton graduated from Indiana University with triple majors in Environmental Studies, Political Science and French with an area concentration Public Affairs. She was a Peace Corps Volunteer in Benin, West Africa for three years.  Previously, Heather was the Education Director at the Environmental Learning Center for 16 years. Currently a community engagement coordinator for the Indian River Lagoon National Estuary Program, she channels her passion for the environment into fostering community connections and helping people live more lagoon-friendly. She started her plastic free diet in February 2024 and for the most part, has stuck to it! Demystifying Birding in Columbia – One Bird at a Time Step into the world of an avid birder and discover Colombia’s birding wonders in all of its splendor! Explore the country’s most biodiverse regions, including the Andes Cordillera, the stunning Santa Marta mountains on the Caribbean Coast, and the captivating Amazon foothills. This presentation will introduce you to the iconic birds that make Colombia their home. You’ll be captivated by their colors, unique behaviors, and incredible songs. This is an invitation to immerse yourself in the magic of birding in Colombia and embark on a future adventure with us. Welcome to the birdiest country on earth! Date: Friday, January 24 Time: 1:30 p.m. – 1:15 p.m. Location: Radisson Resort at the Port, Montego Room Cost: Free with festival registration About the Speaker: Giovani Ortiz is a Colombian birder on a mission to showcase the remarkable avian diversity of the world’s birdiest country. His journey with Icaro Birding began five years ago when he watched a documentary highlighting the sheer number of bird species in Colombia. Inspired, he joined a local birding club in New Orleans, where he was residing at the time. What’s Going on at the American Birding Association (ABA)? This talk will be an informal conversation with ABA’s executive director and Community and Conservation Director about the latest happenings at the American Birding Association. Come join them for news on planned activities, our Young Birder Program, the popular ABA podcast, and other happenings at ABA. Date: Friday, January 24 Time: 3:00 p.m. – 4:15 p.m. Location: Radisson Resort at the Port, Antiqua Room Cost: Free with festival registration About the Speaker : Many festival attendees may recognize Kelly Smith as the ABA representative at various bird festivals and conferences around the ABA area. A research and conservation-minded naturalist, she has volunteered or served on the board of many nature organizations for the last fifteen years including the Rio Grande Valley Birding Festival and Balcones Songbird Festival, the South Texas Border Chapter Texas Master Naturalists, the Friends of the Wildlife Corridor and the Friends of Balcones Canyonlands National Wildlife Refuge, Texas Pelagics, the Texas Ornithological Society, and the Brandywine Zoo Kestrel Monitoring Program. She has also spent years assisting raptor and songbird banding projects in the Lower Rio Grande Valley. Kelly puts her business degree to work for the ABA as the Finance and Operations Manager, program lead for the relaunched Birders’ Exchange initiative, and online store manager. When not at work or volunteering, Kelly spends her time hiking and kayaking around San Antonio, Texas and scuba-diving in the Caribbean. About the Speaker : Wayne Klockner joined the ABA after a long career in conservation with The Nature Conservancy. Professionally, Wayne has lived and worked in Maryland, Delaware, New York, Massachusetts, and Indonesia, fulfilling his dream to work conserving natural lands and waters for all life. Wayne has been a lifelong birder; as a pre-teen in New Jersey, his spark bird was the Dark-eyed Junco. He has since pursued birds in 19 countries and counting but most enjoys documenting the seasonal changes in birdlife in patches close to home. Wayne lives in Ocean City, Maryland with his wife, Lisa, and a springer spaniel named Lizzy. His best yard birds so far are White Ibis and Red Crossbill. The Battles of Midway Visit the world’s largest albatross colony while celebrating the greatest victory of the US Navy at the most famous atoll of the Pacific. We will witness amazing bird colonies and animal behavior, and unique coral reefs – all while exploring this remote island during its largest ecological restoration effort to protect these magnificent seabirds and their habitat. Date: Friday, January 24 Time: 3:00 p.m. – 4:15 p.m. Location: Radisson Resort at the Port, Bermuda Room Cost: Free with festival registration About the Speaker: Dave Grant is the Director of Conservation at the Shark Research Institute in Princeton, NJ. When not studying whale sharks and the protection of all sharks and rays, he is often working on ships in polar regions studying birds and other wildlife. Fascinated by all marine life, he is particularly experienced in the behavior and conservation of colonial seabirds. The Plastic Diet Single-stream recycling aimed to boost recycling rates, but less is being recycled now. Most plastic is downcycled or not recycled at all, often becoming litter through curbside spills, wind, or wildlife. This litter harms birds, who ingest plastic, mistaking it for food, leading to malnutrition, poisoning, and death. Birds also use plastic in nests, which can harm chicks. Reducing single-use plastics can help. Heather Stapleton shares her journey of significantly reducing plastic use, finding empowerment in each successful change. One attendee to this talk will win a sustainable gift basket that will help you on your way to a plastic-free future! Date: Friday, January 24 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Heather Stapleton graduated from Indiana University with triple majors in Environmental Studies, Political Science and French with an area concentration Public Affairs. She was a Peace Corps Volunteer in Benin, West Africa for three years.  Previously, Heather was the Education Director at the Environmental Learning Center for 16 years. Currently a community engagement coordinator for the Indian River Lagoon National Estuary Program, she channels her passion for the environment into fostering community connections and helping people live more lagoon-friendly. She started her plastic free diet in February 2024 and for the most part, has stuck to it! Saturday, January 25 eBird Tips and Tricks: Maximizing Your Use of the World’s Largest Citizen Science Database Join Will Johnson, regional eBird reviewer for Brevard, Volusia, and Indian River counties, for an interactive and wide-ranging discussion on how to make the most of eBird for reporting and tracking your bird observations, exploring the birdlife in your area, and contributing to impactful citizen science. In this session we will place particular emphasis on demystifying the eBird review process and learning best practices for documenting your sightings so that you can become a more skilled and intentional (e)birder in the field. Whether you’re a veteran eBird user or completely new to the program, this session is designed so that everybody will take away valuable lessons they can apply during the festival’s many fantastic field trips. Date: Saturday, January 25 Time: 12:00 p.m. – 1:15 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Will Johnson serves as the regional eBird reviewer for Brevard, Volusia, and Indian River counties and contributes to local environmental organizations as a frequent guest speaker and tour leader. A lifelong resident and avid birder of east-central Florida, Will has developed a thorough expertise of local birdlife and is particularly knowledgeable about this area’s migration patterns, vagrancy trends, and biogeography. In addition to spending extensive time in the field, Will enjoys expressing his love of birds through art and illustration and has had his artwork featured in multiple local and national publications. Will recently graduated from Dartmouth College in Hanover, NH with a bachelor’s degree in environmental studies, and he currently works remotely from Vero Beach, FL for a climate tech startup supporting nature-based carbon removal projects. Let’s Be a Good Neighbor to the Lagoon Native landscapes and tree protection are important for water quality and also for survival of birds.. Some birds only breed in older trees. Organic care of native trees provides hiding and resting habitat for birds. Fruit of trees provides migratory birds sustenance on their long trips. Katherine Booth will share what she has learned about care of trees for the environment. Date: Saturday, January 25 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Katherine Booth worked as a nurse practitioner and after retirement, she started a Conservation Club at her condominium association that has outreach into other homeowner associations, educating owners about Florida native plants and wildlife and innovations in technology to restore water quality. Since 2019, she has served on the City of Vero Beach Tree Protection and Beautification Commission, and most recently as Chairperson, she led the effort that improved the City’s Landscape and Tree Protection ordinances to help restore the water quality of the Lagoon. From her experience, Katherine founded a nonprofit environmental organization Let’s Be a Good Neighbor to the Lagoon, with the message that native plant landscaping and organic care of native trees are a “solution to pollution” and critical to clean air and clean water for human health. Birding Amazonas and Other Great Spots in South America In this presentation you will learn about Zyba Outdoors, which operates three flagship projects: Mamirauá, located deep in the Amazon; Xingu, an indigenous reserve situated within a protected area Patizal, nestled in the Atlantic Forest. Tours are designed to take participants to these premier birdwatching destinations, where we implement training programs and actively support community development initiatives. We mix these locations with other well establish projects, to give our guests the best Brazilian experience. Our Communities Project is built on the belief that a preserved forest must provide as much or more value to local communities than it would if used for cattle ranching or monoculture farming. We see this as a long-term investment—in both the land and its people. We aim to attract tourists who seek unique, meaningful experiences while contributing to the preservation of the forest and its cultural heritage. Zyba serves as a partner in the projects, supporting the promotion and organization of activities while also funding improvements and training in the communities. This initiative benefits more than 60 families by creating jobs for tour guides, kitchen and cleaning services, accommodations, and logistics for supplies, as well as providing donations of basic items. Birdwatching in our destinations is available year-round. However, we recommend visiting during the dry season, but before the regions become excessively dry, to maximize your experience. Screenshot Date: Saturday, January 25 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Bermuda Room Cost: Free with festival registration About the Speaker: Mauricio Piza is a biologist and one of the owners of Zyba Outdoors, a small travel agency from Brazil hosting birdwatching trips across South America. Is Prescribed Fire Really Good for Birds? Is prescribed fire really good for birds? How do we know? With successive steps backwards in time Tim Kozusko will explain how we know that fire is a natural process that most ecosystems in Florida require to be good habitat for birds and other organisms. Date: Saturday, January 25 Time: 1:30 p.m. – 2:45 p.m. Location: Radisson Resort at the Port, Jamaica Room Cost: Free with festival registration About the Speaker: Tim Kozusko recently retired after a career at Kennedy Space Center as an ecologist. He was born and raised in Cocoa Beach Florida and is a board member of the Merritt Island Wildlife Association. He has 20 years experience with prescribed fire in central Florida. He resides in Melbourne Beach with wife Laura. Gateway to Trinidad: The Asa Wright Nature Center Located in the lush rainforest of Trinidad’s northern range, the Asa Wright Nature Centre (AWNC) is one of the most beautiful and accessible places in the Caribbean to see and learn about the island’s abundant flora and fauna. The William Beebe Tropical Research Station, also known as Simla, is a 211-acre tropical research facility with more than 1,000 adjoining acres available for research activities. Starting in the early 19th century as a cocoa plantation, it shifted to coffee and cocoa production, leveraging Trinidad’s favorable climate and rich volcanic soil. Hadco Experiences now operates the property as an ecolodge. Birdwatching, hiking including to secret trails to waterfalls, witnessing endangered Leatherback turtle nesting, and enjoying unique cultural immersions await you at the Asa Wright Nature Center. Date: Saturday, January 25 Time: 3:00 p.m. – 4:15 p.m. Location: Radisson Resort at the Port, Bermuda Room Cost: Free with festival registration About the Speaker: Rachael Nathaniel came to Asa Wright Nature Center with years of experience in the hospitality industry. How Important Are Caterpillars for Birds? Critical! Birders know that migratory birds need berries for sustenance. Birders know which trees they are most likely to find birds feeding on. Some birders are also native plant gardeners and are contributing to creating habitat for birds in their own yards and neighborhoods. Even more important than fruits or any other insects are the caterpillars. With information from Scott Weidensaul’s beautiful book Living on the Wind and Dr. Doug Tallamy’s Bringing Nature Home and Nature’s Best Hope, combined with her own experience growing native plants and birding in Central Florida, Deborah Green will share how caterpillars relate to timing of spring migration in the Eastern United States. She will share what are the best trees for caterpillars and thus the best trees for birds. Date: Saturday, January 25 Time: 3:00 p.m. – 4:15 p.m. Location: Radisson Resort at the Port, Martinique Room Cost: Free with festival registration About the Speaker: Deborah Green, who earned her Ph.D in entomology at University of California, Berkeley, knows a lot about small caterpillars, and now as a birder, is fascinated by the plant/caterpillar/songbird story. Deborah founded and chairs the committee running the NORTH SHORE BIRDING FESTIVAL on the Lake Apopka North Shore, serves as president of Orange Audubon Society and has directed Space Coast Birding and Wildlife Festival starting in May of this year. 2023 Space Coast Birding and Wildlife Festival | Websites by Melbourne Website Designer SCBWA is a 501 (c) (3) non-profit organization Go to Top"
    },
    {
      "url": "https://scbwa.net/contact-us/",
      "text": "Contact Us - Space Coast Birding and Wildlife Festival Skip to content director@scbwa.net January 21-25, 2026 Radisson Resort at the Port Cape Canaveral, Florida Facebook page opens in new window Instagram page opens in new window X page opens in new window Space Coast Birding and Wildlife Festival January 24th – 28th, 2024 Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact CONTACT US! If you have any questions regarding the festival, sponsorship, or exhibiting, please give us a shout. director@scbwa.net Space Coast Birding and Wildlife Association P.O. Box 74, Mims, Florida 32754 January 21st -25th, 2026 Name Email Address Subject Your Message Δ MARK YOUR CALENDARS! 2026 Space Coast Birding & Wildlife Festival Welcome or welcome back to the Space Coast Birding and Wildlife Festival If you are new to Florida and curious for a way to safely learn about the natural side of the state, Space Coast offers the ways to see different Florida environs. And you’ll have the fun of meeting other birders and naturalists from across the state! This year’s official festival bird is the American Flamingo. Following Hurricane Idalia in late August 2023, flamingos were flung throughout the east. If we are lucky, the ones that feed near Haulover Canal within the Merritt Island National Wildlife Refuge can be seen on kayak trips. We cannot be sure they will stay for the festival, but we are hoping. Come join us! 2023 Space Coast Birding and Wildlife Festival | Websites by Melbourne Website Designer SCBWA is a 501 (c) (3) non-profit organization Go to Top"
    },
    {
      "url": "https://scbwa.net/about-the-festival/",
      "text": "About the Festival - Space Coast Birding and Wildlife Festival Skip to content director@scbwa.net January 21-25, 2026 Radisson Resort at the Port Cape Canaveral, Florida Facebook page opens in new window Instagram page opens in new window X page opens in new window Space Coast Birding and Wildlife Festival January 24th – 28th, 2024 Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact Home About Staff Sponsors and Exhibitors Become A Sponsor/Exhibitor Sponsors Exhibitors Exhibitor Map Speakers Keynotes Presentations Field Trips Photography ID Workshop Registration FAQ’s General Info 2020 EIR Report 2020 Summary & Stats Anti-Discrimination Policy Bird Checklist Certification of Solicitation Contact A flamboyance of flamingos and a party of scrub jays! 2026 Space Coast Birding & Wildlife Festival Click here to be added to the email list for any updates and LIKE our Facebook page . Birding, photography, and wildlife enthusiasts — all will enjoy the 27th Space Coast Birding & Wildlife Festival. Five days of fun and camaraderie in the Florida sunshine with your flock! Adventure with expert guides who help you see and do more on land and water. Experience remarkable stories, photographs, and topical information shared by world-class birders. Examine high-quality equipment and local treasures in a large indoor Expo Center. Bring your kids to our exciting Young Birder Event . Check back as speakers, field trips, photographers, sponsors, and exhibitors are added. Click here to be added to the email list for any updates and LIKE our Facebook page . Come join us in January 2026! CONTACT US! If you have any questions regarding the festival, sponsorship, or exhibiting, please give us a shout. director@scbwa.net Space Coast Birding and Wildlife Association P.O. Box 74, Mims, Florida 32754 January 21st -25th, 2026 Name Email Address Subject Your Message Δ READ ABOUT THE FESTIVAL ORGANIZERS https://scbwa.net/about-the-festival/staff/ 2023 Space Coast Birding and Wildlife Festival | Websites by Melbourne Website Designer SCBWA is a 501 (c) (3) non-profit organization Go to Top"
    }
  ]
}