{
  "fuentes": [
    {
      "url": "https://leadiq.com/c/seaworld-parks--entertainment/5a1d95d62300005b0084804d/employee-directory",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/seaworld-parks--entertainment/5a1d95d62300005b0084804d/employee-directory",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://orlandovacation.com/pages/seaworld",
      "email": "help@orlandovacation.com"
    }
  ],
  "mails": [
    "help@orlandovacation.com",
    "name@company.com",
    "sales@leadiq.com"
  ],
  "nombre_sitio": "seaworld.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://leadiq.com/c/seaworld-parks--entertainment/5a1d95d62300005b0084804d/employee-directory",
      "text": "SeaWorld Parks & Entertainment Employee Directory, Headcount & Staff | LeadIQ Learn more at LeadIQ.com Start free SeaWorld Parks & Entertainment Employee Directory Entertainment Providers Florida, United States 1001-5000 Employees SeaWorld Parks & Entertainmentâ¢ is a leading theme park and entertainment company providing experiences that matter and inspiring guests to protect animals and the wild wonders of our world. We are one of the worldâs foremost zoological organizations and a global leader in animal husbandry, behavioral management, veterinary care and animal welfare. We also rescue and rehabilitate marine and terrestrial animals that are ill, injured, orphaned or abandoned, with the goal of returning them to the wild. The SeaWorldÂ® and Busch GardensÂ® rescue teams have helped more than 40,000 animals in need over the last 50+ years.\n\nWe own or license a portfolio of recognized brands including SeaWorldÂ®, Busch GardensÂ®, Sesame PlaceÂ® and Sea RescueÂ®. Over our more than 50-year history, we have built a diversified portfolio of 12 destination and regional theme parks that are grouped in key markets across the United States. Many of our parks showcase our one-of-a-kind zoological collection and all of our parks feature a diverse array of thrill and family rides, shows, educational demonstrations and/or other attractions with broad demographic appeal which deliver memorable experiences and a strong value proposition for our guests.\n\nWe have also produced Parentâs Choice and Emmy Award winning shows like Sea Rescue and The Wildlife Docs that celebrate real & inspirational stories of rescue, rehabilitation and return to the wild by the animal rescue, animal care and veterinary teams at SeaWorld and Busch Gardens, in cooperation with our partners also committed to care for wildlife in need. Sign up for free to view info Company overview Email format Find SeaWorld Parks & Entertainment employees' phone numbers or email addresses Find Employee SeaWorld Parks & Entertainment Global Highlights Location Employees North America 1.7K United States Of America 1.7K Canada 1 Jamaica 1 Dominican Republic 1 Europe 6 United Kingdom Of Great Britain And Northern Ireland 4 Spain 2 Oceania 6 Australia 6 Asia 4 China 1 Malaysia 1 United Arab Emirates 1 Philippines 1 South America 2 Ecuador 2 SeaWorld Parks & Entertainment 's Leadership C. D. Chief Zoological Officer Mobile Phone Email C. F. Chief Commercial Officer Mobile Phone Email F. J. Vice President Communications Mobile Phone Email A. B. Vice President Of Marketing, Seaworld And Aquatica Orlando Mobile Phone Email B. L. Vice President Of Product Mobile Apps And In-Park Digital Experiences Mobile Phone Email C. B. Vice President Zoological Operations Mobile Phone Email M. P. Vice President , Human Resources Mobile Phone Email M. W. Vice President Finance Mobile Phone Email SeaWorld Parks & Entertainment Employee Metrics 100% 50% 0% 2025 2024 Operations Sales Entertainment Analytics Education Other Human Resources Contact profiles from SeaWorld Parks & Entertainment Name Title Contact Info Location Last Update A. S. Owner Mobile Phone Email Oct 22, 2024 A. G. President Mobile Phone Email Oct 22, 2024 C. D. Chief Zoological Officer Mobile Phone Email Oct 16, 2024 C. F. Chief Commercial Officer Mobile Phone Email Jun 25, 2025 D. F. President Mobile Phone Email Oct 21, 2024 J. F. Interim Chief Financial Officer And Treasurer Mobile Phone Email Apr 08, 2024 K. K. Owner Mobile Phone Email Oct 17, 2024 L. R. Executive Assistant To Cio Mobile Phone Email United States Florida Jul 25, 2024 M. L. Owner And Chief Instructor Mobile Phone Email United States Florida Apr 25, 2025 N. U. President Mobile Phone Email Oct 18, 2024 1 2 3 â¦ Next > Frequently Asked Questions What is SeaWorld Parks & Entertainment known for? SeaWorld Parks & Entertainment was founded in 2009 operates in the Entertainment Providers industry . The company's main headquarters is located in Suite 400 Orlando, FL 32819 US ; you can contact the main corporate office by phone at +1-813-987-**** . Explore SeaWorld Parks & Entertainment 's company overview page for more information. What is SeaWorld Parks & Entertainment 's most common email format? SeaWorld Parks & Entertainment employees' email format typically follows the pattern of . Trying to find reliable and up-to-date employee contact data? Find more SeaWorld Parks & Entertainment email formats with LeadIQ. How many employees does SeaWorld Parks & Entertainment have currently? SeaWorld Parks & Entertainment has approximately 2.5K employees as of April 2025 . These team members are located across 5 continents, including North America Europe Oceania . Who are SeaWorld Parks & Entertainment 's key employees and leadership? As of April 2025 , SeaWorld Parks & Entertainment 's key employees include: Chief Zoological Officer: C. D. Chief Commercial Officer: C. F. Vice President Communications: F. J. Vice President Of Marketing, Seaworld And Aquatica Orlando: A. B. Vice President Of Product Mobile Apps And In-Park Digital Experiences: B. L. Looking for contact data? Unlock accurate emails and phone numbers for your ideal prospects with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://orlandovacation.com/pages/seaworld",
      "text": "SeaWorld Orlando Marine Theme Park & Attraction - Orlando Vacations Skip to content Lodging Orlando Hotels Orlando Vacation Homes Theme Park Tickets Walt Disney World Tickets Universal Studios Florida Tickets SeaWorld Florida Tickets Smaller Orlando Attraction Tickets Orlando Dinner Shows Group Tickets Packages Walt Disney World Packages Universal Studios Orlando Packages SeaWorld Orlando Packages Group Packages Planning Group Planning Payment Plans Orlando Dinner Shows Walt Disney World Resort Universal Studios Orlando Resort SeaWorld Orlando LEGOLAND Orlando Other Orlando Attractions Tickets Information About Us Blogs Affiliate Program Orlando Employee Discounts Contact Us Lodging Orlando Hotels Orlando Vacation Homes Theme Park Tickets Walt Disney World Tickets Universal Studios Florida Tickets SeaWorld Florida Tickets Smaller Orlando Attraction Tickets Orlando Dinner Shows Group Tickets Packages Walt Disney World Packages Universal Studios Orlando Packages SeaWorld Orlando Packages Group Packages Planning Group Planning Payment Plans Orlando Dinner Shows Walt Disney World Resort Universal Studios Orlando Resort SeaWorld Orlando LEGOLAND Orlando Other Orlando Attractions Tickets Information About Us Blogs Affiliate Program Orlando Employee Discounts Contact Us Book Your SeaWorld Vacation Today SeaWorld Orlando Theme Park SeaWorld Orlando Theme Park is a special place to visit and one that is sure to put a smile on everyone in your family. SeaWorld Orlando consists of three major parks: SeaWorld Orlando, Discovery Cove and Aquatica . SeaWorld is located in the middle of Disney World and Universal Studios, and while this is the smallest of the three major theme parks in Orlando, do not let its size fool you. SeaWorld offers a big adventure for everyone. SeaWorld Orlando | Related Parks SeaWorld Orlando Theme Park SeaWorld has a setup unique to any other theme park in the world: one third of SeaWorld is dedicated as a theme park, one third encompasses a marine animal zoo and the final third is set up to be a marine animal hospital. Learn More SeaWorld Aquatica Aquatica is SeaWorld Orlando’s  water park. It is truly fun for the whole family with something for everyone including wave pools, slides and more. Learn More SeaWorld Discovery Cove Discovery Cove  is a unique hands-on park within SeaWorld that offers a unique vacation experience! Animal and aquatic lovers of all ages should experience this once in a lifetime opportunity. Learn More Everything About SeaWorld Check Out Our Helpful SeaWorld Articles Below: SeaWorld touring plan for teenagers SeaWorld Touring plan for young children SeaWorld for Adults SeaWorld for Guests with Autism SeaWorld for Guests in a Wheelchair Visiting SeaWorld while pregnant Orlando Hotels Hotels Near SeaWorld Enjoy luxurious accommodations, exclusive amenities, and easy access to SeaWorld’s thrilling attractions. Book now for the best rates and make your stay unforgettable! Hotels Near SeaWorld Why Is SeaWorld Orlando Special? SeaWorld’s philosophy is to educate the public about marine wildlife and how to preserve it for future generations. Before you visit, you might want to read about planning your day at SeaWorld . SeaWorld, like most theme parks, is built in a large circle, half of the entertainment is shows that have dedicated start times, roller coasters and rides are sprinkled throughout the park, and then animal encounters are strategically located next to the shows. SeaWorld has done an incredible job of making the learning experience fun and exciting. The shows entertain you, but also teach you a little about the animals and their habitat, the roller coasters keep you entertained and the animal encounters (think of a zoo encounter) are planned to educate you about the animals, and what we need to do as a society to help them continue to flourish in nature. There are many attractions and special events which provide a refreshing and distinctive experience for families. Not many people know this but the majority of the animals you will see at SeaWorld have been injured at sea and the doctors on staff at SeaWorld rescued them from disastrous consequences. After their rehabilitation, many of the animals were not fit to return to the wild so SeaWorld developed shows around them. Attractions and Shows SeaWorld has recently been called Orlando’s Roller Coaster Capital and for good reason. SeaWorld offers over 20 theme park rides, with 6 of those rides being roller coasters, 18 animal displays or experiences, and 5 entertaining shows. Click here to learn about all the shows and rides at SeaWorld. Special Tip : If you are planning to see all the theme parks in Orlando, you might want to visit SeaWorld in the middle of your vacation. Most of the shows do not start until 11am, and quite frankly the shows at night are always a little more entertaining. This will give you and your family an opportunity to sleep in and rest. Even though you are on vacation, walking around the theme parks will be quite tiring. In addition to these shows, SeaWorld also offers fun events throughout the year. Some of these events require special admission tickets such as: Halloween Spootakular , SeaWorld Howl-O-Scream , 7 Seas Food Festival, Summer Spectacular, and Christmas Celebration. SeaWorld Tickets SeaWorld will only take you a day to see pretty much everything so you do not need a multi day ticket unless you are looking to visit Aquatica too, then we would recommend a two day ticket. Aquatica is located just down the road from SeaWorld, but if you want to enjoy both parks you should really spend two days (one at each park). One of the unusual attractions about SeaWorld is that you can add all day dining to your SeaWorld tickets . This add on varies in cost but on average expect to spend an additional $39 per person. All Day Dining allows you to eat every 90 minutes at restaurants located throughout the park, and  you get an entree, drink and dessert. Here is a great article about dining at SeaWorld . This is a great deal especially, if you are going to be eating both lunch and dinner at SeaWorld. Vacation Homes Near SeaWorld Orlando Vacation Homes Near SeaWorld Orlando Find your perfect vacation home near SeaWorld Orlando. Our spacious homes offer all the comforts you need, plus the convenience of being close to SeaWorld’s exciting marine adventures. Orlando Vacation Rentals Orlando Vacation Packages SeaWorld Orlando Vacation Packages Dive into an unforgettable adventure with our SeaWorld Orlando vacation packages. Enjoy discounted tickets, top-rated hotel stays, and special perks bundled together for the ultimate vacation experience. Perfect for families, couples, and groups, our packages offer unbeatable value and convenience. Explore the wonders of SeaWorld, from thrilling rides to amazing marine life exhibits, and relax in comfortable accommodations nearby. Book your SeaWorld Orlando vacation package now for the best deals and a hassle-free getaway! Book Now Where to Stay When Visiting SeaWorld Orlando This amazing theme park is located equal distance between Walt Disney World and Universal in Central Florida, so there are many choices but here are a few great hotels near SeaWorld for you to choose among. For the best pricing on hotels, you will want to look in the area of Lake Buena Vista. This area is very close to SeaWorld but it also caters to Walt Disney World travelers, so pricing is much more competitive. Vacation homes are another wonderful lodging option and if your primary reason for visiting Orlando is SeaWorld, look for a vacation home in Kissimmee . It is much easier to get to SeaWorld from the Kissimmee area than it is from Davenport or along the 192 interstate corridors. Inside Tip: To get the best deal on your SeaWorld Orlando Vacation , you will want to book a vacation package, which comes complete with theme park tickets and hotel accommodations. Most of our customers book their SeaWorld Vacation as a package, offering them the most savings. Touring SeaWorld We want you to know that Orlandovacation.com is here to help you plan your SeaWorld vacation. In order to help our guests we have written many articles to help families plan their vacation, please feel free to reach out to us: through web chat or on the phone ( 1-800-641-4008 ) and we will be more than happy to assist. It does not matter the make up of your family or group, everyone will love SeaWorld. Need Tickets? Get Tickets Now SeaWorld Orlando Main Menu Lodging Tickets Packages Information Lodging Tickets Packages Information Footer Menu Home Contact Us Blogs Privacy Policy Refund and Returns Policy Terms of Service Blogs Sitemap Home Contact Us Blogs Privacy Policy Refund and Returns Policy Terms of Service Blogs Sitemap Contact Us Call: 1-800-641-4008 Email: help@orlandovacation.com Address: 1515 Park Center Dr #2k, Orlando, FL 32835 Facebook Instagram Youtube Pinterest Linkedin American Express Visa JCB Discover Diners Club Mastercard © 2025 Orlando Vacation"
    }
  ]
}