{
  "fuentes": [
    {
      "url": "https://www.freep.com/story/news/local/michigan/oakland/2021/06/28/ferndale-irish-pub-rosie-ogradys-closed-down/5373257001/",
      "email": "marshad@freepress.com"
    },
    {
      "url": "https://www.askrosie.ai/contact",
      "email": "you@company.com"
    },
    {
      "url": "https://www.gradycampbell.com/contact/",
      "email": "info@gradycampbell.com"
    },
    {
      "url": "https://www.gradyscoldbrew.com/pages/reach-out",
      "email": "customerservice@gradyscolcbrew.com"
    },
    {
      "url": "https://www.gradyscoldbrew.com/pages/reach-out",
      "email": "customerservice@gradyscoldbrew.com"
    },
    {
      "url": "https://www.gradyscoldbrew.com/pages/reach-out",
      "email": "info@gradyscoldbrew.com"
    },
    {
      "url": "https://www.gradyscoldbrew.com/pages/reach-out",
      "email": "wholesale@gradyscoldbrew.com"
    },
    {
      "url": "https://www.laliga.com/en-GB/clubs/sevilla-fc/squad",
      "email": "sevillafc@sevillafc.es"
    }
  ],
  "mails": [
    "customerservice@gradyscolcbrew.com",
    "customerservice@gradyscoldbrew.com",
    "info@gradycampbell.com",
    "info@gradyscoldbrew.com",
    "marshad@freepress.com",
    "sevillafc@sevillafc.es",
    "wholesale@gradyscoldbrew.com",
    "you@company.com"
  ],
  "nombre_sitio": "sevillequarter.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.freep.com/story/news/local/michigan/oakland/2021/06/28/ferndale-irish-pub-rosie-ogradys-closed-down/5373257001/",
      "text": "Ferndale Irish pub, Rosie O'Grady's closed down Sunday night News Sports Autos Entertainment Advertise Obituaries eNewspaper Legals OAKLAND Rosie O'Grady's in downtown Ferndale closes its doors for good Minnah Arshad Detroit Free Press Downtown Ferndale bid farewell to decades-old Irish pub, Rosie O’Grady’s, Sunday night. The closure was announced on Facebook Saturday night, hours before the store’s last day in business, writing that it was “mostly due in part to ongoing staffing shortages.” “It's been a good ride and unfortunately, tomorrow, June 27, will be Rosie’s Last Call,” the Facebook post read. The restaurant could not be reached for comment. As first reported by Eater, this shutdown came two months after Hometown Restaurant Group, which owns Rosie O’Grady’s, bought Public House and Antihero. Over the weekend, Rosie O’Grady’s final post saw more than 200 comments, ranging from despair at the closure to frustration for the late notice to staff and customers. This came a few months after the same owners were accused of pulling a publicity stunt for One-Eyed Betty’s, when they announced a temporary closing for renovations that led people to believe the closure was permanent. More: Ferndale's One-Eyed Betty's renovation closure triggers a firestorm of angry comments Highland Park: Red Hots Coney Island in Highland Park to close doors after 100 years in business At the end of the farewell post, Rosie O’Grady’s said they were working on a space at 9 Mile Road and Allen Street. Contact Minnah Arshad: MArshad@freepress.com and follow her on Twitter @minnaharshad. Support local journalism here . Staff Directory Careers Accessibility Support Sitemap Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Renvy.com Michigan.com Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.freep.com. All rights reserved."
    },
    {
      "url": "https://www.askrosie.ai/contact",
      "text": "Get in touch with us Blog Data Security Contact Us Help Center Contact us Get in touch Whether about Rosie, spreadsheet modeling, or anything else, we're all ears. First Name Last Name Email Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Need assistance? We're Here to Help Whether you have questions, need support, or want to share feedback, we're here to listen and assist. Choose the method of communication that works best for you, and let's start the conversation. Email Us Feel free to email us anytime at support@askrosie.ai . Expect a response within one business day. Set Up a Meeting Prefer a conversation? Schedule a direct meeting via Calendly with our team to discuss your needs in detail. Your AI business analystâ¨with superhuman spreadsheet skills. Company Help Security Terms Privacy Contact Â© 2025 Rosie Inc. All rights reserved."
    },
    {
      "url": "https://www.gradycampbell.com/contact/",
      "text": "Contact Us | Grady Campbell Inc. Grady Campbell Incorporated Markets Work About Private Equity Productions News and Insights Contact Product has been added to your cart. How can we help? Looking for a strategic partner who knows design, branding, and marketing inside and out? Let’s get started! Connect Leave us a message using the form below and a representative will reply to you shortly. Name* Last Name* Your email* Company Subject General Inquiry Brand Accelerate Inquiry Kickstarter Program GCI Publishing Message* Chicago 900 N Franklin Street, Suite 610, Chicago, IL 60610 312.642.6511 | info@gradycampbell.com Dubai Bluewaters Island 3, Suite 105, Dubai, UAE hello@brandplaydium.com Find success in impactful design. Let’s get started! Chicago 900 N Franklin Street, Suite 610, Chicago, IL 60610 312.642.6511 | info@gradycampbell.com Dubai Bluewaters Island 3, Suite 105, Dubai, UAE hello@brandplaydium.com Expertise Markets Financial Private Equity Law Business Consumer Technology Industrial Nonprofit Culture Who We Are About Our Team Our Collaboration Contact What We Do Work Productions Video Gallery Start-up Brand Package Playbooks Books and Publications Shop For PE Firms Private Equity Top 50PE Awards Program M&A Weekly PE Brand Accelerate Top Exec Awards Program Newsroom News and Insights Client News Expertise Markets Financial Private Equity Law Business Consumer Technology Industrial Nonprofit Culture Who We Are About Our Team Our Collaboration Contact What We Do Work Productions Video Gallery Start-up Brand Package Playbooks Books and Publications Shop For PE Firms Private Equity Top 50PE Awards Program M&A Weekly PE Brand Accelerate Top Exec Awards Program Newsroom News and Insights Client News Copyright© 2025 Grady Campbell Inc. All Right Reserved. Privacy Policy Terms of Use United States Menu"
    },
    {
      "url": "https://www.gradyscoldbrew.com/pages/reach-out",
      "text": "Contact Us | Grady's Cold Brew | Grady's Cold Brew Skip to Content logo spacer account Cart items ( 0 ) Shop Now Shop All Concentrates Bean Bags Decaf Buy In Bulk Merchandise Find in Stores How to Enjoy Enjoy Hot! Bean Bag Brewing Instructions Recipes Learn More about us What is Grady's? About Us Grady's Brew Blog FAQ Subscriptions Contact Wholesale Login Apply Contact Us Cart items ( 0 ) Recently Added 0 Items Total $ 0.00 Go to Checkout The item you just added is unavailable. Please select another product or variant. Recently Added 0 Items Total $ 0.00 Go to Checkout The item you just added is unavailable. Please select another product or variant. Open searchbar Open account Close searchbar Log in or Sign up close account Subscribe Shop Now Shop All Concentrates Bean Bags Decaf Buy In Bulk Merchandise Find in Stores How to Enjoy Enjoy Hot! Bean Bag Brewing Instructions Recipes Learn More about us What is Grady's? About Us Grady's Brew Blog FAQ Subscriptions Contact Wholesale Login Apply Contact Us GET IN TOUCH! PHONE (9AM-5PM EST| MONDAY-FRIDAY): (718) 860-1600 LIVECHAT FOR PRESS INQUIRIES: info@gradyscoldbrew.com FOR WHOLESALE & CORPORATE INQUIRIES: wholesale@gradyscoldbrew.com FOR CUSTOMER SERVICE INQUIRES: customerservice@gradyscoldbrew.com If you would like to have Grady's at your upcoming event in the Northeast, please take a moment and email us at info@gradyscoldbrew.com . About Grady's Cold Brew Grady’s Cold Brew is a New Orleans–Style coffee concentrate. We cold brew a special blend of coffee, chicory, and spices for 20 hours,  resulting in a velvety-smooth cup with every pour. Sip it straight, water it down, or milk it for all it's worth. Cheers! Menu Shop About us Grady's Brew Blog Contact Grady's Bucks FAQs Local NYC Delivery Procedure Privacy Policy Terms & Conditions Accessibility Statement Subscribe Signup to get the latest news..."
    },
    {
      "url": "https://www.laliga.com/en-GB/clubs/sevilla-fc/squad",
      "text": "Official Sevilla FC staff in 2025/26 | LALIGA LALIGA INSTITUTIONAL LALIGA WITH SPORT WHERE TO WATCH LALIGA LALIGA GROUP LALIGA INSTITUTIONAL Transparency Transparency Regulatory Institutional information Organisation chart Economic management Agreements and contracts Subsidies Compliance Manual, Guides and Channels Pressroom Pressroom What is LALIGA? Press Releases Image Gallery Logos Institutional Calendar Documents Newsletter Contact FUNDACIÓN LALIGA FUNDACIÓN LALIGA About us activities Futura Afición Fair Play Social Environmental Fair Play Transparency Sponsors Sponsors Campus LALIGA Audiovisual rights Audiovisual rights Documents Batches TV Broadcast Regulation International Audiovisual rights LALIGA Experience & Loyalty programs LALIGA Business school LALIGA Business school MBA of LALIGA Master in mgmt, methology and  Football Analytics Master in Law applied to PF Master in global sport MK Master's Degree in Sports Marketing Work with us Work with us Work with clubs Work with clubs LALIGA WITH SPORT Aficiones Unidas Aficiones Unidas About us Amateur guide News LALIGA FC FUTURES LALIGA FC FUTURES LALIGA Grassroots LALIGA Grassroots Other Competitions Other Competitions Copa del Rey Copa de la Reina Champions League Europa League Conference League Spanish Super Cup European Super Cup UEFA EURO 2024 LALIGA Group Transparency Transparency Regulatory Institutional information Organisation chart Economic management Contracts LALIGA Impulso English LALIGA EA SPORTS Home Calendar Results Standings Clubs Transfers Partidazos LALIGA HYPERMOTION Home Calendar Results Standings Clubs Transfers LIGA F Moeve Home Calendar Results Standings Clubs Liga F Moeve LALIGA Genuine Moeve Home Results Standings Images Videos Sponsors Logos Stats Videos News Photo Galleries Apps & Games LALIGA Tv Zona Fans Accreditations Work with us Work with clubs Legal notice Cookies policy Privacy policy Complaints Web Map © 2025 LaLiga Home LALIGA EA SPORTS Clubs Sevilla FC Sevilla Fútbol Club SAD Year of foundation Stadium 1890 Ramón Sánchez-Pizjuán President Official Web José María Del Nido Carrasco http://www.sevillafc.es/ Club Squad Next matches Results Statistics Transfers Official staff of the Sevilla FC 2025/26 PLAYER COMPARISON TEAM COMPARISON HAVE YOU NOT REGISTERED YET? GET INTO MI LIGA Complaints Site Map Accreditations Work with us Work with clubs Accessibility Legal notice Privacy Policy Cookies Policy © 2025 - LALIGA"
    }
  ]
}