{
  "fuentes": [
    {
      "url": "https://shoppesatthornebrook.com/thornebrook-at-home/",
      "email": "reception@lozanodentalcare.com"
    },
    {
      "url": "https://shoppesatthornebrook.com/2022/09/19/thornebrook-chocolates-gainesvilles-premiere-chocolatier/",
      "email": "info@thornebrookchocolates.com"
    },
    {
      "url": "http://shoppesatthornebrook.com/portfolio-item/guaranteed-rate/",
      "email": "anthony.cerrud@ccm.com"
    },
    {
      "url": "http://shoppesatthornebrook.com/portfolio-item/guaranteed-rate/",
      "email": "byron.zoning@ccm.com"
    },
    {
      "url": "https://shoppesatthornebrook.com/portfolio-item/thornebrook-chocolates/",
      "email": "info@thornebrookchocolates.com"
    },
    {
      "url": "https://realnex.com/listings/804955/thornebrook-village",
      "email": "brian@thomasgrouprealty.com"
    },
    {
      "url": "https://realnex.com/listings/804955/thornebrook-village",
      "email": "sales@realnex.com"
    }
  ],
  "mails": [
    "anthony.cerrud@ccm.com",
    "brian@thomasgrouprealty.com",
    "byron.zoning@ccm.com",
    "info@thornebrookchocolates.com",
    "reception@lozanodentalcare.com",
    "sales@realnex.com"
  ],
  "nombre_sitio": "shoppesatthornebrook.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://shoppesatthornebrook.com/thornebrook-at-home/",
      "text": "Shoppe Updates | Shoppes at Thornebrook Welcome to Thornebrook! Blog Directory ▼ All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Navigation Blog Directory All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Search Blog Directory All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Search Shoppe Updates Service and store hour updates Now it’s more important than ever to support our local community.  Our local business community is quickly adapting to our current situation. For more general resources, visit our COVID-19 Information page . Below is a directory of our shops that are offering unique ways for you to shop and access their services. We hope this helps you during this time . Our shops are here for you! Note: Each shop is working on a re-opening plan that feels safe and appropriate for them. Please be patient as they transition with your safety in mind. Life Unplastic – Shop online at Life Unplastic’s website and pick up at the store.  Questions? Call (352) 225-3116 Thornebrook Gallery – Open during regular business hours.  Customers are also welcome to shop online at Thornebrook Gallery’s website . Free delivery on all jewelry orders.  Questions? Call (352) 378-4947 Ilene’s Gator Store – Shop online at https://www.ilenesgatorstore.com/ . Free shipping on all orders.  Sales updated every day.  Questions? Call 352-378-1611 Malgorzata’s – Now open M-F 10 am – 4 pm and Sat 11 am – 4 pm.  Will stay open longer upon request.  Select inventory is now available for order online. Visit Malgorzata’s website to see available inventory . To order please call 352-215-8689 or 352-428-3477. Follow Malgorzata’s Facebook page for updates. Brittany’s Fine Jewelry – Showroom is open during normal business hours.  Jewelry is available to order online. Visit Brittany’s Fine Jewelry website to see the selection. Arabesque Dance and Activewear – Open during normal business hours.  Customers may also visit Arabesque Dance and Activewear website to shop online. Dancewear and face masks are available. Thornebrook Chocolates – Browse the menu online . Then choose your service option: 1. Take Out: One person at a time in the store, while staff gathers your selected items. We are your personal shoppers! 2. Curbside: Order placed and charged by credit card via phone 352-371-0800. Please then call when you arrive, and we will bring it to your vehicle! 3. Delivery: Some options are available through UberEATS. We may be able to make a delivery to you ourselves if located in the City of Gainesville. Please send a message with specific questions/locations. Bageland Bagels – Browse the menu online (and make sure to check our FB page for any daily lunch special ) Call (352) 371-3354 to place an order.  Service options: 1. Pick-up in the store (limit 3 customers in the store at a time) 2. If paid over the phone, food will be placed on a designated table by the door for easy pick-up. Formaggio’s Bistro & Wine – Formaggio’s is now open for sit-down service. Tues – Saturday 11:00 am to 9:00 pm.  Indoor and outdoor seating will be limited in order to comply with social distancing. Employees will be wearing masks and gloves. Customers will also need to wear masks on our premises anytime you are not at your table.  Also open for carry-out and delivery 11 am – 6 pm. Browse the menu on Bite Squad . Call 352-505-6202 to place an order for carry-out or order delivery through Bite Squad . Update: Floating Lotus Therapeutic Spa & Health Center – Open normal business hours, Mon-Sat 9am – 8pm.  Gift certificates and membership options available for purchase online. Click here to purchase a gift certificate online . Click here to learn about membership .  In addition, they are now selling products on their website http://floatinglotusspa.com/ available for delivery or pickup! Eden Michele Salon – Gift cards are available. Call (352) 888-7528 or message them on the Eden Michele Salon Facebook page . Vain Salon – Vain Salon is now open with limited occupancy.  Please contact your stylist to find out what days they are working.  Also offering no contact delivery of retail products, including gift cards.  Call (352) 505-6161 or send them a message on the Vain Salon Facebook page . McIntyre Stained Glass Studio & Art Gallery – Open Tuesday – Saturday from 11 – 4, and also by appointment.  Call (352) 372-2752 to order a gift card in any amount. Gainesville Health & Fitness Women – Gainesville Health and Fitness is now streaming classes online on the GHF YouTube channel .  Visit the GHF website for Online Nutrition Coaching .  Visit the GHF At Home page for online workout schedules and other resources available to GHF members. The Wedding Cycle – Follow The Wedding Cycle Facebook pag e for dreamy wedding gown posts and updates. Bead All About It – Follow the Bead All About It Facebook page for cute project posts and updates. SALON ZIBA – SALON ZIBA is open. Go to zibadebeaute.com to book your appointment.  Follow the Salon Ziba Facebook page for updates. Gainesville Kitchen & Bath – Gainesville Kitchen & Bath is now offering safe, free, call-in consultations. Call (352) 415-4577. Email photos of you home and they’ll do the rest. Book your project by May 31st and they’ll donate $500 to a local food bank. The Floor Store At Thornebrook – Available by appointment only.  Call 352-284-3304 or e-mail thefloorstore2441@gmail.com Govind and Sons Fine Jewelry – Call or text (352) 222-9696 to start designing your custom jewelry, including engagement and wedding bands. Lozano Dental Care – Open for emergency patients only at this time.  Call (352) 376-7335 or email reception@lozanodentalcare.com Klaus Fine Jewelry – Re-opened. If for some reason you do not feel comfortable coming in the store they are available for curbside and home delivery also. Lili’s Alterations – Lili’s is making masks free for those providing essential services. Please call (352) 377-6255 to request and follow Lili’s on Facebook for updates . Painted Table – The Painted Table is open Tuesday through Saturday from 10 to 2.  They ask that all customers wear a mask. POWERED BY THE X THEME Blog Directory Media Events Contact Map Owners & Tenants Type and Press “enter” to Search"
    },
    {
      "url": "https://shoppesatthornebrook.com/2022/09/19/thornebrook-chocolates-gainesvilles-premiere-chocolatier/",
      "text": "Thornebrook Chocolates – Gainesville’s Premiere Chocolatier | Shoppes at Thornebrook Welcome to Thornebrook! Blog Directory ▼ All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Navigation Blog Directory All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Search Blog Directory All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Search Thornebrook Chocolates – Gainesville’s Premiere Chocolatier Thornebrook Chocolates is Gainesville’s Premiere Chocolatier. Serving gourmet chocolate, fine hand-dipped confections, and other treats for over 35 years, they are loved by residents of all ages. In this series we are highlighting the exceptional local businesses of Thornebrook. We had the opportunity to sit down with Cathleen Blagay, shareholder owner of Thornebrook Chocolates, for a few questions: 1. What do you love most about your business? What I love most about my business is being a part of people’s everyday lives as well as their special occasions. The relationships with other people and gift giving – it’s really exciting to be part of that experience. People tend to come in and what they’re doing to get that special gift for somebody and it’s really heartwarming to hear some of the stories that people share with us. It also can kind of tug at the heart strings being there at times of challenge but I love that our store is able to be there in times of celebration and in times of challenge when comfort is needed. 2. What is one thing that new shoppers should know you offer? What I’d love to let new customers know is to let our chocolate consultants know if there’s something special that they’re looking for or a favorite. We have hundreds of different types of chocolates. We have wine. We have gifts and like mugs and baskets. We also have some hidden gems that are behind the showcase that we can’t bring forward. We have a lot to offer, so let us help you find your chocolate match made in heaven. 3. What is another shop in Thornebrook you would recommend to a friend and why? I have recommended so many shops in Thornbrook to friends. We have hairdressers, jewelers, an alterations shop, flower shop, a gym, music shop, a wedding store. So many different opportunities to find something special. Treat yourself to a spa visit and get a facial, we even have a spa just for kids!  I just couldn’t say enough good things about all the merchants here in Thornbrook. 4. Anything else you’d like to add? At Thornebrook Chocolates we usually try to have a few new options like hot and spicy Chipotle almonds or cocoa bombs for the holidays. But I would say coming here for the classics like our cordial cherries and our chocolate covered Oreos is the best part. Come visit us and get your favorite chocolate, have some gelato, grab a bottle of wine, get something for you, get something for someone else. We’re here year round, and we hope to be here for another 35 years, maybe more. More Information Thornebrook Chocolates is located at Shoppes At Thornebrook 2441 NW 43rd Street Suite 21 Gainesville FL, 32606. Visit their Facebook page for more information including special hours . Questions? Call (352) 371-0800 or email info@thornebrookchocolates.com Visit the website at https://www.thornebrookchocolates.com/ POWERED BY THE X THEME Blog Directory Media Events Contact Map Owners & Tenants Type and Press “enter” to Search"
    },
    {
      "url": "http://shoppesatthornebrook.com/portfolio-item/guaranteed-rate/",
      "text": "CrossCountry Mortgage | Shoppes at Thornebrook Welcome to Thornebrook! Blog Directory ▼ All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Navigation Blog Directory All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Search Blog Directory All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Search CrossCountry Mortgage Find the perfect mortgage for your situation, anytime, anywhere.We understand that choosing a mortgage is the biggest financial decision of your life, and we’re committed to making the process as seamless, friendly and financially valuable to you as possible. It’s a simple formula that has made us one of the most trusted mortgage providers in the U.S. Address: 2441 NW 43rd Street Suite 1B Gainesville , FL 32606 Phone: (352) 554-2270 Website: https://crosscountrymortgage.com/gainesville-fl-4341/ Email: Byron Zonin Byron.zoning@ccm.com Anthony Cerrud Anthony.cerrud@ccm.com Share POWERED BY THE X THEME Blog Directory Media Events Contact Map Owners & Tenants Type and Press “enter” to Search"
    },
    {
      "url": "https://shoppesatthornebrook.com/portfolio-item/thornebrook-chocolates/",
      "text": "Thornebrook Chocolates | Shoppes at Thornebrook Welcome to Thornebrook! Blog Directory ▼ All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Navigation Blog Directory All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Search Blog Directory All Shops and Services Apparel Dine With Us! Health, Salon, & Spa Home Renovation & Design Jewelry Professional Services Wedding Kids Reuse, Recycle, & Repurpose Available Listings Media Events Contact Map Owners & Tenants Search Thornebrook Chocolates Telephone: 352-371-0800 or Email: info@thornebrookchocolates.com Shoppe Hours: Monday – Saturday 10:00 – 6:00pm Hand-dipped chocolate confections made in the store! Specialty candy and custom-made baskets and fine gifts. Wines that pair with chocolates. Share Leave a Comment You must be logged in to post a comment. POWERED BY THE X THEME Blog Directory Media Events Contact Map Owners & Tenants Type and Press “enter” to Search"
    },
    {
      "url": "https://realnex.com/listings/804955/thornebrook-village",
      "text": "Thornebrook Village FOR SALE on 2441 NW 43rd Street 5A, realnex.com Toggle navigation Login Solutions CORE RealNex Mobile MarketEdge MarketPlace RealFit RealNex VR About Media Pricing Knowledge Contact Login Create Account Activate Service × Print Report Report Type Brief, Single Page - Layout 1 Brief, Single Page - Layout 2 Detailed, Multi-Page Detailed, Multi-Page - Single Photo Detailed, Multi-Page - No Photos Detailed, Multi-Page - No Map Detailed, Multi-Page - No Demographics Detailed, Multi-Page - No Map / No Demographics Demographics Line Item Summary Map and List Prepared For Display listing agent information Display commission Create Report Cancel 504 Murphy Road Suite L Stafford, TX 77477, USA 281-299-3161 sales@realnex.com Quick Links Solution Product About Media Subscribe Contact Follow Us on Social Networks © 2025 All Rights Reserved Terms & Condition • Privacy Contact Sales If you have questions or want to schedule a demo, please contact us via the form below. You can also reach us by phone at (281) 299-3161. Name Name is required. Email Email is required. Send Contact Support If you have questions, need help with something, or even if you just need to schedule training, don't hesitate to contact us via the form below. Name Name is required. Email Email is required. Phone Send % Or Enter email to login or Create an account Please enter valid Email Welcome Login Using a Password Login OR Login Without a Password Instead of using a password, you have the choice of receiving a One-Time Pin (OTP) via email or SMS every time you log in. If desired, please select this option below. Send Me OTP via Email SMS Welcome! You have not verified your email, please complete verification before login. Resend Verification Email Enter your password here Forgot your password? Save my email and password Password Login OR Send me One-Time-Password via Email SMS Welcome! Send Me OTP via Email SMS OR I like to Login using Password Password Login Welcome! We sent the OTP via {sms/email}.  if you do not receive the code within 30 seconds please click Resend Code. The code will expire 10 minutes after you receive it. Please login or click Resend Code if code is expired. Resend Code Invalid Code entered , please click Resend Code and try again We need the following information to complete your registration Why is Mobile Phone Number Needed? I agree to Terms & Privacy Please Accept Terms & Privacy Welcome! Send Me Access Code via Email SMS Thank You For Registering With Us! You should receive an email from RealNex Support. Click the link in the email to begin your free trial. * If you don’t receive an email promptly, check your junk folder. Close"
    }
  ]
}