{
  "fuentes": [
    {
      "url": "https://centercityphila.org/explore-center-city/ccd-sips",
      "email": "citizen@example.org"
    },
    {
      "url": "https://www.sipsocial.co.uk/",
      "email": "richard@sipsocial.co.uk"
    },
    {
      "url": "https://gussipanddip.com/",
      "email": "contactforms@lettuce.com"
    },
    {
      "url": "https://gussipanddip.com/",
      "email": "gussipanddipcs@lettuce.com"
    },
    {
      "url": "https://sipnswig.co.uk/",
      "email": "cheers@sipnswig.co.uk"
    },
    {
      "url": "https://sipnswig.co.uk/",
      "email": "giles@sipnswig.co.uk"
    },
    {
      "url": "https://mobilesipevents.com/",
      "email": "carla@mobilesipevents.com"
    },
    {
      "url": "https://mobilesipevents.com/",
      "email": "flags@2x.png"
    },
    {
      "url": "https://sipnswig.co.uk/contact-us/",
      "email": "cheers@sipnswig.co.uk"
    },
    {
      "url": "https://sipnswig.co.uk/contact-us/",
      "email": "giles@sipnswig.co.uk"
    },
    {
      "url": "https://www.sabinelondon.co.uk/contact-us/",
      "email": "sabine@sohocommunications.co.uk"
    },
    {
      "url": "https://www.sabinelondon.co.uk/contact-us/",
      "email": "sabinestpauls@leonardohotels.co.uk"
    },
    {
      "url": "https://sipnswig.co.uk/mobile-cocktail-bar-hire/",
      "email": "cheers@sipnswig.co.uk"
    },
    {
      "url": "https://sipnswig.co.uk/mobile-cocktail-bar-hire/",
      "email": "giles@sipnswig.co.uk"
    },
    {
      "url": "https://siponmain.com/",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://sipandserve.us/",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://sipandserve.us/",
      "email": "events@sipandserve.us"
    }
  ],
  "mails": [
    "carla@mobilesipevents.com",
    "cheers@sipnswig.co.uk",
    "citizen@example.org",
    "contactforms@lettuce.com",
    "eben@eyebytes.com",
    "events@sipandserve.us",
    "flags@2x.png",
    "giles@sipnswig.co.uk",
    "gussipanddipcs@lettuce.com",
    "info@indiantypefoundry.com",
    "richard@sipsocial.co.uk",
    "sabine@sohocommunications.co.uk",
    "sabinestpauls@leonardohotels.co.uk"
  ],
  "nombre_sitio": "sipontheroof.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://centercityphila.org/explore-center-city/ccd-sips",
      "text": "Center City District | CCD SIPS Menu Close Working together every day to enhance the vitality of Center City Philadelphia >>> Center City District CCD Parks CCD Foundation CPDC What are you searching for? Search Menu Doing Business Doing Business Doing Business Home Why Center City Why Center City Home Business Resources Business Resources Home Open a Store Open a Store Open a Store Home Success Stories Retail Resources Research & Reports Research & Reports Research & Reports Home Data Dashboard Data Dashboard Home State of Center City State of Center City Home Developments Developments Home Office & Employment Office & Employment Home Housing Housing Home Retail Retail Home Transportation Transportation Home Explore Center City Explore Center City Explore Center City Home Shop Shop Home Dine Dine Home Experience Experience Home Events Events Events Home Office Events Living Living Home CCD Restaurant Week CCD Restaurant Week Home CCD SIPS CCD SIPS CCD SIPS Home CCD SIPS List View Let's Do Lunch Center City Let's Do Lunch Center City Home Open Streets: West Walnut Open Streets: West Walnut Open Streets: West Walnut Home West Walnut Business Directory FAQ CCD Services CCD Services CCD Services Home Clean Clean Home Public Safety Public Safety Public Safety Home Safety Patrol Community Service Representatives Homeless Outreach Crime Prevention Homeless Outreach Homeless Outreach Home Streetscape Streetscape Streetscape Home Parkway Projects Lighting Signs Banners Landscaping Capital Projects Capital Projects Home Marketing & Events Marketing & Events Home CCD Leadership CCD Leadership Home CCD Assessments CCD Assessments Home Blog Blog Pressroom About Us Job Opportunities RFP Opportunities Contact Us Report A Problem Privacy Policy Site Credits CCD Boundary Map Center City District Explore Center City CCD SIPS CCD SIPS Center City District SIPS Mix, mingle and make it a night; Philadelphia’s favorite happy hour tradition celebrates its 21st season this summer, offering the ultimate after-work experience. To view a list of participating bars and restaurants, click here . Who: Dozens of bars and restaurants across Center City What: Happy hour offering $7 cocktails, $6 wine, $5 beer and half-priced appetizers When: 5 p.m. to 7 p.m., every Wednesday, June 4 through August 27, 2025 Where: Center City Philadelphia The following select locations will provide 15% off dinner after 7 p.m. - discounted dinner locations . From outdoor beer gardens and cocktail lounges to dance bars and some of the best restaurants in Philadelphia, there’s a place for everyone at CCD SIPS. Learn More SIPS Merch Celebrate the 21st birthday of Center City SIPS with a limited edition SIPS T-shirt, available for pre-order now. Learn More CCD SIPS - 2025 Participants Search 1518 Bar and Grill 1518 Sansom St, Philadelphia, PA 19102 CCD SIPS Specials Air Grille at Dilworth Park 1 S 15th St, Philadelphia, PA 19102 CCD SIPS Specials Aki Nom Nom 1210 Walnut St, Philadelphia, PA 19107 CCD SIPS Specials ArtBar at Sonesta Hotel 1800 Market St, Philadelphia, PA 19103 CCD SIPS Specials Attico Rooftop 219 S Broad Street Philadelphia, PA 19107 CCD SIPS Specials Balcony Bar at Curtain Call Kimmel Center for the Performing Arts, 300 S Broad St, Philadelphia, PA 19102 CCD SIPS Specials Bar Bombon 133 S 18th St, Philadelphia, PA 19103 CCD SIPS Specials Bar Lesieur 1523 Sansom St, Philadelphia, PA 19102 CCD SIPS Specials Bar-Ly Chinatown 101 N. 11th St, Philadelphia, PA 19107 CCD SIPS Specials Barbuzzo 110 S 13th St, Philadelphia, PA 19107 CCD SIPS Specials Barcade Center City 1326 Chestnut St, Philadelphia, PA 19107 CCD SIPS Specials Barra Rossa 929 Walnut St, Philadephia, PA 19107 CCD SIPS Specials Barstool Sansom Street 1213 Sansom St, Philadelphia, PA 19102 CCD SIPS Specials The Black Sheep 247 S 17th St, Philadelphia, PA 19103 CCD SIPS Specials Bodega Taco Bar 1223 Walnut Street, Philadelphia, PA 19107 CCD SIPS Specials PAGE 1 2 3 4 Instagram CCD SIPS on Instagram Follow @centercitydistrict on Instagram for all SIPS content  and to learn more about what's happening in Center City. Explore Center City SIPS at CCD Parks Every Wednesday from June 4 to August 27, from 5 p.m. to 7 p.m., enjoy $7 Hornitos® Tequila cocktails, $6 wine and $5 beer at SIPS happy hour al fresco at Dilworth Park and Cret Park. Sponsor Cocktail Recipes Try CCD SIPS featured drink recipes to create great Hornitos®  Tequila cocktails at home. Sign up here to receive CCD email updates. Interests In Center City Rail Park Updates Publications and Reports The Center City District (CCD), Central Philadelphia Development Corporation (CPDC) and Center City District Foundation (CCDF) work together to enhance the vitality and competitiveness of Philadelphia's downtown. In 1991, the business leadership organization CPDC created the CCD business improvement district to deliver daily services with the goal of making Center City clean and safe. This helped transform Center City into a vibrant 24-hour downtown, attractive to businesses, residents, students, shoppers and tourists. In addition, the CCD is responsible for the management of Dilworth, Sister Cities, John F. Collins and Cret Parks, four extraordinary public spaces in the heart of Center City. CCDF, the charitable affiliate of the CCD, was launched in 2016 to support the next generation of public space improvements in Center City Philadelphia. All Social Media Accounts © 2025 Center City District | Central Philadelphia Development Corporation | Center City District Foundation Pressroom About Us Job Opportunities RFP Opportunities Contact Us Report A Problem Privacy Policy Site Credits CCD Boundary Map"
    },
    {
      "url": "https://www.sipsocial.co.uk/",
      "text": "Sip Social | Mobile Cocktail Bar | Formerly Mix & Muddle top of page HOME ABOUT SERVICES GALLERY CONTACT OUR CLIENTS drink curious About Us Sip Social , formerly known as Mix & Muddle , is a luxury events studio aimed at passionately delivering curious cocktails for weddings, marketing & PR events, brand activations, and corporate parties. Set up by mixologist and events expert Richard Maxted in 2017, we've executed over 400 events nationwide and internationally , and designed hundreds of curious cocktails. Personable, precise, and stylish at the core. LINE UP Our Team Damien O'Leary Staffing Manager Richard Maxted Director & Founder Lars Thornhill Operations Manager Services Corporate Events Marketing & PR launches, sophisticated drinks receptions, and office parties Wedding Parties Reception and after dinner cocktail bars Brand Partnerships Brand activations, photographic content creation, and Perfect Serve creations Get in Touch Curious about how we can elevate your next event? Let's chat. 61 Central Street, London, EC1V 3AF +44 7815 601758 richard@sipsocial.co.uk Name Phone Email Message How did you hear about us? Send Thanks for reaching out! We'll be in touch within 24hrs. Connect With Us @SipSocialUK Our Clients Sip Social is the trading name of Mix & Muddle Limited. Company Number 145718806. © 2025 by Sip Social. Designed by Tekglide bottom of page"
    },
    {
      "url": "https://gussipanddip.com/",
      "text": "Home Page - Gus Sip and Dip Skip to main content Walk-ins Only Happy Hour Menu F.A.Q. Contact Gus' Sip & Dip 51 W. Hubbard St. Chicago, IL 60654 Happy Hour / Menu / F.A.Q. / Contact Happy Hour / Menu / F.A.Q. / Contact Walk-ins Only Walk-ins Only 51 W. Hubbard St. Chicago Fine Mixed Drinks and Dipped Sandwiches Gus' Sip & Dip, brings a classic tavern experience to the heart of River North, welcoming walk-ins on a first-come, first-served basis. Our beverage menu, created by Kevin Beary, offers high-quality cocktails at an approachable price, paired perfectly with Chef Bob Broskey's timeless tavern dishes. Learn More View Menu September 11 Happy Hour Drink of the Day Clover Club Enjoy Mon-Fri 4pm - 5pm Mixed Drinks Food Menu All Mixed Drinks - $12ea. Vodka 1 . Cosmo ketel one vodka, orange curacao, lime, real cranberry juice 2 . White Russian ketel one vodka, coffee liqueur, espresso, hand-shaken cream 3 . Dirty Martini ketel one vodka, house olive brine, dry vermouth, blue cheese stuffed olives Tequila 4 . Naked and Famous rey campero espadin mezcal, aperol, yellow chartruese, lime 5 . Margarita tequila ocho blanco, lime, agave 6 . Improved Tequila Cocktail tequila ocho blanco, maraschino, absinthe, grapefruit bitters Gin 7 . Gin Martini tanqueray no. ten, vermouth blend, orange bitters 8 . Martini and Tonic tanqueray no. ten, vermouth blend, orange bitters, tonic water 9 . Breakfast Martini tanqueray london dry gin, orange liqueur, earl grey tea, marmalade, honey toast 10 . Gin Gimlet tanqueray london dry gin, absinthe, lime cordial 11 . Clover Club tanqueray london dry gin, raspberry eau di vie, fresh raspberry, lemon, egg white 12 . Martinez tanqueray london dry gin, maraschino liqueuer, sweet vermouth, orange bitters Cognac 13 . French 125 peyrat cognac, lemon, dry champagne 14 . Japanese Cocktail peyrat cognac, almond orgeat, orange bitters 15 . Milk Punch peyrat cognac, madeira, black tea, lemon 16 . Brandy Wisconsin Old Fashioned peyrat cognac, orange, cherry, 7-Up Rum 17 . Hemingway Daiquiri real mccoy light rum, maraschino liqueur, grapefruit, lime 18 . Hawaii-Style Mai Tai rum blend, orange curacao, almond orgeat, pineapple, tangerine, lime 19 . Mojito don pancho 8 year rum, lime, mint, club soda Whiskey 20 . Brown Derby buffalo trace bourbon, adjusted grapefruit, grapefruit cordial 21 . Midnight Stinger buffalo trace bourbon, fernet branca, lemon juice 22 . Cameron's Kick kilbeggan irish whiskey, singleton single malt scotch whisky, lemon, almond orgeat 23 . Irish Coffee kilbeggan irish whiskey, metric coffee, cane sugar, hand shaken cream 24 . Sazerac knob creek rye whiskey, cane sugar, absinthe 25 . Bobby Burns singleton single malt scotch whisky, red vermouth, benedictine 26 . God Father johnnie walker black blended scotch whisky, lazzaroni amaretto Other 27 . Harvey Wallbanger delord blanche armagnac, galliano, adjusted orange juice, absinthe 28 . Adonis fino, amontillado & px sherry, sweet vermouth, orange bitters 29 . Amaretto Sour lazzaroni amaretto, knob creek rye, lemon, egg white 30 . Grasshopper crème de menthe & cacao, green chartreuse, whipped cream, shaved chocolate Beer, Cider, Wine, & Champagne 31 . Champagne 20 32 . Beer light or dark 8 33 . Cider 8 34 . Burgundy red or white 20 As a way to offset rising costs, we have added a 3.5% surcharge to all checks. You may request to have this taken off your check should you choose. About Gus' Gus’ Sip & Dip, brings a classic tavern experience to the heart of River North, welcoming walk-ins on a first-come, first-served basis. Our beverage menu, created by Kevin Beary, offers high-quality cocktails at an approachable price, paired perfectly with Chef Bob Broskey’s timeless tavern dishes. Get Hours & Directions The Team Scott Kitsmiller / Bar Manager Kitsmiller’s journey from musician to bar professional has been fueled by a love for nightlife and creativity, beginning with performing in Detroit’s vibrant bar scene and evolving into a career in cocktail innovation. After years as Bar Manager for Three Dots and a Dash and The Bamboo Room, Scott joins the Gus’ Sip & Dip team as the Bar Manager. Bob Broskey / Executive Chef Bob Broskey, Executive Chef Partner of Gus’ Sip & Dip, brings his culinary expertise from Pittsburgh, Pennsylvania, where his passion for cooking was nurtured in a family of talented cooks. Broskey honed his craft in Chicago at renowned Michelin-starred restaurants like Ria and L2O before making a name for himself at Intro, where he earned recognition as one of Zagat’s “30 Under 30.” Joining RPM Seafood in 2019, Broskey’s dedication and skill have earned him a partnership within the RPM family of restaurants. He now oversees chef teams nationwide across various RPM concepts, including RPM Italian, RPM Steak, RPM Seafood as well as Pizzeria Portofino and The Oakville. At Gus’ Sip & Dip, Broskey has crafted a menu of timeless tavern dishes that perfectly complements Beary’s cocktail program. Kevin Beary / Beverage Director Kevin Beary leads the beverage program at Gus’ Sip & Dip, bringing a deep understanding of historic recipes and a creative touch that elevates our cocktail offerings. Before joining Gus’ Sip & Dip, Kevin spent years at the helm of Three Dots and a Dash and The Bamboo Room, both celebrated for their exceptional cocktail experiences. Under his leadership, The Bamboo Room earned recognition as one of Esquire’s Best Bars in America and a North America’s 50 Best ‘One To Watch.’ His expertise continues to set the standard for excellence in Chicago’s cocktail scene. F.A.Q. Looking to host an event? Please fill out the form here and someone from our events team will be in touch soon. How do I get on the waitlist? As soon as you arrive, check in with the host to put your name on the waitlist. How late do you serve food until? We serve food until 12AM Sunday – Thursday and 1AM on Friday and Saturday. Are you kid friendly? We are 21+ only. Are there gluten free options available? Of course, many dishes on the menu can be made gluten free. Please notify your bartender or server about any allergies/dietary restrictions. Do you offer any vegetarian or vegan options? Yes we offer several vegetarian items and limited vegan options. Please ask your bartender or server for guidance on the menu. Do you accept reservations? We are walk-in only. When is Happy Hour? Happy Hour is available Monday – Friday from 4PM-5PM, featuring a rotating cocktail of the day for $6. Do You Offer Non-alcoholic Options? Yes! Several cocktails on our menu have their number underlined, indicating they can be made without alcohol. Do You Have Valet? Yes, it can be found just outside the restaurant. Valet is available until 11pm daily Stay in the know Sign up for our email list to stay up to date on exclusive offers, special events, seasonal specials, and more. First Name* Last Name* Email* Zip * SIGN ME UP × EAT. PLAY. WIN. Earn up to 5x points through September 30 with End of Summer Scratch off I'm Ready To Win Hours SUNDAY - THURSDAY 4pm - 12am FRIDAY - SATURDAY 12pm - 1am Happy Hour Mon - Fri : 4pm - 5pm Location 51 W. Hubbard St. Chicago, IL 60654 Contact 312 - 736 - 0163 Send us a message Facebook Icon Instagram Icon LETTUCE.COM | FREQUENT DINERS | GIFT CARDS | ACCESSIBILITY | PRIVACY POLICY | TERMS OF USE © 2025 Gus' Sip & Dip®. A Lettuce Entertain You® Restaurants."
    },
    {
      "url": "https://sipnswig.co.uk/",
      "text": "Mobile Bar Hire & Mobile Cocktail Bars Warwickshire - Sip 'n' Swig Skip to main content Hit enter to search or ESC to close Close Search search 0 Menu Home Sip ‘n’ Swig HQ HQ Info HQ Events Bar Hire Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Wedding Bar Hire Gin Tasting Events Shop Cocktail Cans Experiences Gift Vouchers Gift Packs Gin & Spirits Wine Cocktail Juices, Purees and Syrups Craft Beer Cans FAQs Cocktail Making Classes Blog Case Studies Blog Get in Touch search 0 was successfully added to your cart. Menu EVENT & MOBILE BAR HIRE SPECIALISTS Private Events Private Events Private Events Corporate Events Corporate Events Corporate Events Sip 'n' Swig HQ Sip 'n' Swig HQ Sip 'n' Swig HQ Why Sip ‘n’ Swig Sip ‘n’ Swig offer a bespoke mobile bar hire service. We can set up a bar, tasting event or cocktail masterclass at any venue, including at your home! It’s important to us that we stock our event bars with premium, independent and upcoming brands. Using our knowledge and experience we ensure that our drinks are kept and served at their optimum, always with professional and friendly service. Formed in 2017 but with many more years of hospitality experience, we have managed a range of events. Our knowledge, along with your requirements, allows us to provide the perfect service for your event. EVENT & MOBILE BAR HIRE SPECIALISTS EVENT MOBILE BAR HIRE WITH QUALITY PRODUCTS, PROFESSIONAL, FRIENDLY SERVICE AND DRINK SOLUTIONS FOR EVERY EVENT. BASED FROM STRATFORD-UPON-AVON, WARWICKSHIRE, COVERING THE UK CONTACT US CONTACT US CONTACT US Sip 'n' Swig 5.0 Based on 37 reviews powered by G o o g l e review us on Alicia Henstock 11:31 21 Oct 24 We had a lovely birthday celebration of nine friends at our house and Giles was a brilliant host! Cocktails were delicious and we had a lot of fun; much giggling, especially by the third one. He supplied all the cocktail shakers, glassware and ingredients, so it was very easy on us. We’re deciding when to have the next one. Tania Noble 20:58 10 Oct 24 Sip n Swig provided the bar and drinks for 100 people at our party, and did a fabulous job. Everyone commented on how delicious their cocktails were, and it was great they could also offer mocktails. All their staff were very helpful, anccommodating and friendly. Highly recommend them! Helen Hunt 09:20 01 Oct 24 Sip and Swig provided a cocktail bar at our party. Both Giles and Jodie provided the most amazing cockails and service, they went down an absolute treat with our guests. Thank you. Verity Harris 18:58 30 Jul 24 Best cocktail class ever! Holly Nixon 17:21 25 Jun 24 We organised a cocktail making masterclass for 16 of my networking group ladies and we had a blast.  Giles and team made sure we had everything we needed, joined in the fun and ensured a great time was had by all. We had a mixture of alcoholic and non-alcoholic cocktails which meant that everyone got to participate and we can't wait to have another event like this.  Highly recommend. H P 16:09 23 Feb 24 I totally recommend the cocktail masterclass it was excellent. I booked it for my friend's hen weekend and it was one of the best experiences we had. Giles gave us a great class which was really fun and interesting and Giles and Jodie made a really big effort to accommodate our group (vegan, gluten free options and non-alcoholic spirits) which we really appreciated and meant that everyone really enjoyed it. Thank you to Sip 'n' Swig, we had the best time! Jade Monks 12:52 10 Aug 23 The team at Sip 'n' Swig were fabulous! Couldn't recommend more. Hired for a social event at my company. The cocktails were delicious and looked great. Very happy colleagues and will definitely use Sip n Swig again. Shop for Sip ‘n’ Swig cocktail cans, Stag Gin and liqueurs Espresso Martini Cocktail Can £ 7.50 £ 7.50 Add to basket Pina Colada Cocktail Can £ 7.50 £ 7.50 Add to basket Spiced Rum Mai Tai Cocktail Can £ 7.50 £ 7.50 Add to basket Stag Gin Negroni Cocktail Can £ 7.50 £ 7.50 Add to basket Tropical Daiquiri Cocktail Can £ 7.50 £ 7.50 Add to basket Passionfruit Martini Cocktail Can £ 7.50 £ 7.50 Add to basket Strawberry Daiquiri Cocktail Can £ 7.50 £ 7.50 Add to basket Stag Gin Bramble Cocktail Can £ 7.50 £ 7.50 Add to basket Passionfruit Martini Cocktail Can £ 7.50 £ 7.50 Add to basket Tropical Daiquiri Cocktail Can £ 7.50 £ 7.50 Add to basket Stag Gin Bramble Cocktail Can £ 7.50 £ 7.50 Add to basket Strawberry Daiquiri Cocktail Can £ 7.50 £ 7.50 Add to basket Shop for more Stag Gin Premium Small Batch London Dry Gin. Sip ‘n’ Swig are delighted to share Stag Gin Smooth and Spiced with you. Our own recipe, Award Winning, 46% ABV classic, juniper forward London Dry Gins. Buy Now Buy Now Buy Now Trusted By Mills & Reeve UK Law Firm, Mills & Reeve are big fans of our gin and cocktail bars! We have delivered a number of their events from Christmas Drinks at Birmingham Cathedral, to a gin bar for their clients in the office to branded Stag Gin Miniatures for gift bag favours. Pixel Toys Local Independent Game Studio, Pixel Toys, love a party! With any occasion comes a cocktail bar! From Summer Party to Long Weekend Celebration, our cocktail bar pops up in the office to bring the team together! Farmers Fayre Trusted to serve their clients exceptional cocktails that elevate their event offerings, Farmers Fayre welcome us for an array of their events. You can even enjoy a Stag Gin in their restaurant or pick up a bottle in the Farm Shop! Contact Us Use this form to send us an email about your next event! Name (Required) First Last Email (Required) Phone (Required) Type of event (Required) Select Corporate Event Private Event Wedding Bar Product - Cocktail Cans/Gin Masterclasses Other Where did you hear about us? Select Facebook Instagram LinkedIn Google search or other Togather Met via Networking Previous event guest Referral from existing customer We’ve used you before! Referral from venue or supplier At an Event/Exhibition Event date (Required) DD slash MM slash YYYY Number of Guests (Required) Venue (inc Postcode) (Required) Message Sign Up For Newsletter Based on the beautiful Alscot Estate at Grove Business Park, we now have a licensed premises to invite you to! Services Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Cocktail Making Classes Gin Tasting Events Wedding Bar Hire Policies Privacy Policy Cookie Policy (UK) Contact Sip ‘n’ Swig to discuss mobile bar hire, cocktail masterclasses, gin tasting events and more! 07581015916 07872921415 cheers@sipnswig.co.uk giles@sipnswig.co.uk Based in Stratford-Upon-Avon, Warwickshire, CV37. Covering the UK 3B Grove Business Park, Alscot Estate, Atherstone on Stour, Stratford-upon-Avon, CV37 8DX © 2025 Sip 'n' Swig. facebook linkedin instagram Close Menu Home Sip ‘n’ Swig HQ HQ Info HQ Events Bar Hire Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Wedding Bar Hire Gin Tasting Events Shop Cocktail Cans Experiences Gift Vouchers Gift Packs Gin & Spirits Wine Cocktail Juices, Purees and Syrups Craft Beer Cans FAQs Cocktail Making Classes Blog Case Studies Blog Get in Touch 07581015916 07872921415 cheers@sipnswig.co.uk giles@sipnswig.co.uk Based in Stratford-Upon-Avon, Warwickshire, CV37. Covering the UK 3B Grove Business Park, Alscot Estate, Atherstone on Stour, Stratford-upon-Avon, CV37 8DX Manage Cookie Consent We use cookies to optimise our website and our service. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept cookies Functional only View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://mobilesipevents.com/",
      "text": "SIP SOCIETY MOBILE BAR We use cookies to improve your experience on our site. By using our site, you consent to the use of cookies. Rejecting cookies will prevent non-essential cookies from loading. Learn more Accept all Accept essential About Us Services Schedule a Call Gallery Contact Us Serving all of Connecticut & Massachusetts About Us Services Gallery Contact Us Serving all of Connecticut & Massachusetts Elevate Your Event with Premium Mobile Bartending From unforgettable cocktails to seamless service, we bring the bar to you. Book today to make your event a standout experience! CONTACT US Whether it’s a wedding, corporate gathering, or private party, we’ll take care of everything, so you can enjoy a worry-free celebration. Stress-Free Bar Service We Handle Every Detail, So You Can Enjoy Your Event! Planning & Coordination We’ll begin by discussing your desired guest experience, from cocktail styles to service details. 30 days before the event, we'll confirm final touches and review any extra services. We're also happy to coordinate with your event planner for seamless execution. Alcohol Preparation While we can’t legally supply alcohol, we’ll provide a thorough alcohol purchase guide detailing exact quantities, bottle sizes, types, and recommendations, making your selection process easy and worry-free. Set - Up & Service Before guests arrive, we handle full bar setup, ensuring everything is in place for a smooth start. We simply ask that the alcohol is accessible in a designated area, and we’ll bring all mixers, garnishes, cups, ice, and anything else needed for service. When bar service begins, our primary focus is providing your guests with an outstanding experience. Breakdown & Wrap-Up After service, we handle cleanup, packing any leftover alcohol and leaving it ready for you in the designated area. Prepare for compliments on the unforgettable bar experience—we’ll leave you with wonderful memories to toast to for years to come! With SIP SOCIETY , your event’s bar service will be one less thing to worry about. We’re here to bring your vision to life with care and professionalism , ensuring a memorable occasion for you and your guests. CONTACT US Dry Hire Bar Service Tailored for Your Unique Event Dry hire is a service where we provide everything for your bar—except the alcohol. We supply the equipment, mixers, drinkware, ice, and bartenders, while you choose and purchase the alcohol. You’ll have full control over your selections, and we’ll guide you on quantities and types. It's the perfect choice for flexibility and a customized bar experience. So, as I like to say… Sit Back, Relax, and Be a Guest at Your Own Party! Add-Ons to Elevate Your Event Experience Champagne Wall Make a Statement with Our Stunning Champagne Wall! Perfect for weddings, parties, or upscale gatherings, our Champagne Wall adds an elegant touch to your celebration. With capacity to hold up to 50 champagne glasses, it serves as both a functional drink station and an eye-catching display. Use it to greet guests with a bubbly surprise or even showcase treats, seating charts, or floral arrangements. Complete with customizable vinyl decals to match your event’s theme, this centerpiece is sure to impress! Self-Service Hydration Station Keep Guests Refreshed with a Chic Hydration Station! Offer your guests a stylish way to stay hydrated with our Self-Service Hydration Station. Choose from refreshing options like infused water, lemonade, or classic ice water—beautifully displayed in elegant dispensers. This setup is ideal for outdoor events, cocktail hours, or anytime you want to keep your guests cool and comfortable. Self-serve and hassle-free, it’s a thoughtful touch that shows you care about every detail. Champagne Toast Service Raise a Glass in Style with Our Champagne Toast Service! Let us take care of the bubbly for your special moments. Our team will chill, pop, and pour champagne for all your guests, ensuring everyone has a glass in hand to celebrate. Whether it’s a wedding toast, an anniversary, or a corporate milestone, we’ll make sure the experience is seamless, sophisticated, and unforgettable. Cheers to a perfect celebration! Table-Side Wine Service Elevate Your Event with Personalized Table-Side Wine Service! Bring the luxury of fine dining to your event with our Table-Side Wine Service. Our professional bartenders will pour wine directly for your guests, ensuring a polished and attentive touch throughout your dinner or celebration. Perfect for weddings, formal dinners, or upscale events, this service adds sophistication and ensures your guests feel pampered. Dessert Favor Wall Sweeten Your Celebration with Our Dessert Favor Wall! Make your desserts and favors a show-stopping centerpiece with our Dessert Favor Wall. Perfect for weddings, baby showers, and parties, this versatile display transforms treats like donuts, cupcakes, cookies, or small packaged favors into a stunning visual experience. Fully customizable with decals to match your theme, this rental is a creative and stylish way to wow your guests and make dessert time unforgettable! Champagne Wall ▼ Make a Statement with Our Stunning Champagne Wall! Perfect for weddings, parties, or upscale gatherings, our Champagne Wall adds an elegant touch to your celebration. With capacity to hold up to 50 champagne glasses, it serves as both a functional drink station and an eye-catching display. Use it to greet guests with a bubbly surprise or even showcase treats, seating charts, or floral arrangements. Complete with customizable vinyl decals to match your event’s theme, this centerpiece is sure to impress! Self-Service Hydration Station ▼ Keep Guests Refreshed with a Chic Hydration Station! Offer your guests a stylish way to stay hydrated with our Self-Service Hydration Station. Choose from refreshing options like infused water, lemonade, or classic ice water—beautifully displayed in elegant dispensers. This setup is ideal for outdoor events, cocktail hours, or anytime you want to keep your guests cool and comfortable. Self-serve and hassle-free, it’s a thoughtful touch that shows you care about every detail. Champagne Toast Service ▼ Raise a Glass in Style with Our Champagne Toast Service! Let us take care of the bubbly for your special moments. Our team will chill, pop, and pour champagne for all your guests, ensuring everyone has a glass in hand to celebrate. Whether it’s a wedding toast, an anniversary, or a corporate milestone, we’ll make sure the experience is seamless, sophisticated, and unforgettable. Cheers to a perfect celebration! Table-Side Wine Service ▼ Elevate Your Event with Personalized Table-Side Wine Service! Bring the luxury of fine dining to your event with our Table-Side Wine Service. Our professional bartenders will pour wine directly for your guests, ensuring a polished and attentive touch throughout your dinner or celebration. Perfect for weddings, formal dinners, or upscale events, this service adds sophistication and ensures your guests feel pampered. Dessert Favor Wall ▼ Sweeten Your Celebration with Our Dessert Favor Wall! Make your desserts and favors a show-stopping centerpiece with our Dessert Favor Wall. Perfect for weddings, baby showers, and parties, this versatile display transforms treats like donuts, cupcakes, cookies, or small packaged favors into a stunning visual experience. Fully customizable with decals to match your theme, this rental is a creative and stylish way to wow your guests and make dessert time unforgettable! Ready To Book Or Have Questions? Event Highlights < > Ready to Elevate Your Event? Get Quote Now! Hi, I am Carla the founder of Sip Society Mobile Bar & Events , and I couldn’t be more excited that you’ve found us! After over a decade balancing a career in corporate management with my passion for bartending, I decided to follow my dream of creating something all my own—and thus, Sip Society was born. From the moment I stepped into event bartending, I was hooked. Each event brings something unique, introducing me to incredible people and unforgettable experiences. I quickly realized that this was more than just a job; it was my calling. Helping people celebrate life’s biggest moments in a way that feels special, effortless, and fun is exactly where I want to be. The best part of building this business? Forming a top-tier team of bartenders who share the same enthusiasm for creating exceptional experiences. I’ve been fortunate to work alongside some of the best in the industry, and I knew exactly who I wanted on this journey with me. Together, we bring dedication, expertise, and energy to every event we serve. We can’t wait to make your celebration unforgettable. With Sip Society, you get more than just bar service—you get a personalized experience. Cheers to unforgettable memories! Frequently Asked Questions What areas do you serve? We proudly serve all of Connecticut and Massachusetts. Based in Putnam, we’re happy to travel to bring our services to you. There is no travel fee for events within a 30-mile radius of Putnam. For locations beyond 30 miles, a small travel fee will apply. What types of events do you cater to? We’re here for all your special moments, including weddings, rehearsal dinners, bridal and baby showers, graduations, private parties, corporate events, and much more! Do you supply the alcohol or should I supply it? Due to state liquor laws, we’re unable to provide alcohol directly. However, we’ll make the process easy for you by offering a comprehensive shopping list with the exact quantities and types of alcohol needed. We handle everything else to ensure a safe, fun, and memorable event! If my venue has a bar space, can you set that up? Absolutely! We’re flexible and can work with existing bar spaces at your venue. We also offer additional bar setups to meet your needs, whether it’s for multiple bar stations or a dedicated cocktail hour setup. What is the deposit requirement? To secure your date, we require a $250 non-refundable deposit. The remaining balance is due 14 days before your event. How far in advance should I book, and what is your cancellation policy ? The sooner, the better! Early booking ensures we can reserve your date. However, feel free to inquire about availability for last-minute events—we’ll do our best to accommodate! View cancellation policy here. Are you insured and are your bartenders certified? Yes, we proudly carry a comprehensive General & Liquor Liability insurance policy, giving our clients added security and peace of mind. Upon request, we can provide copies of our insurance policies directly to your venue. Additionally, all of our bartenders are TIPS Certified, meaning they are professionally trained in responsible alcohol service, ensuring your event is not only enjoyable but safe. Is gratuity included in your fees? Gratuity is not included in our standard fees. We offer several options: - Tip Jar: We can place a tip jar on the bar for guests to contribute. - No Tip Jar: If you prefer no tip jar, the event host can add a 22% gratuity per bartender, based on the final invoice. - Combination Option: A mix of both, with a tip jar on the bar and a partial gratuity fee. Get a Tailored Quote for Your Event ! Tell Us About Your Vision- We'll Handle the Cocktails! Name * Email * Phone * Date of Event * Goals & Details Submit Refund & Cancellation Policy | Privacy Policy | Terms of Service Follow Us On: Quick Link About Us Services Gallery Contact Us Contact Us © 2024 All rights reserved. SIP SOCIETY MOBILE BAR & EVENTS"
    },
    {
      "url": "https://sipnswig.co.uk/contact-us/",
      "text": "Contact Us - Sip 'n' Swig Mobile Bar Hire - Cocktail Bars Event Bar Warwickshire Skip to main content Hit enter to search or ESC to close Close Search search 0 Menu Home Sip ‘n’ Swig HQ HQ Info HQ Events Bar Hire Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Wedding Bar Hire Gin Tasting Events Shop Cocktail Cans Experiences Gift Vouchers Gift Packs Gin & Spirits Wine Cocktail Juices, Purees and Syrups Craft Beer Cans FAQs Cocktail Making Classes Blog Case Studies Blog Get in Touch search 0 was successfully added to your cart. Menu Home » Contact Sip ‘n’ Swig to discuss mobile bar hire, cocktail masterclasses, gin tasting events and more! Contact Us Contact Sip ‘n’ Swig to discuss mobile bar services, mobile cocktail bar, cocktail masterclasses or other servicess Name (Required) First Last Email (Required) Phone (Required) Type of event (Required) Select Corporate Event Private Event Wedding Bar Product - Cocktail Cans/Gin Masterclasses Other Where did you hear about us? Select Facebook Instagram LinkedIn Google search or other Togather Met via Networking Previous event guest Referral from existing customer We’ve used you before! Referral from venue or supplier At an Event/Exhibition Event date (Required) DD slash MM slash YYYY Number of Guests (Required) Venue (inc Postcode) (Required) Message Based in Stratford-upon-Avon, predominantly serving Warwickshire, Oxfordshire, Gloucestershire but our premium services are popular around the UK and even internationally. Our emails are monitored regularly but if you need to speak to us quickly contact Giles on 07581015916 or Jodie on 07872921415 Sign Up For Newsletter Based on the beautiful Alscot Estate at Grove Business Park, we now have a licensed premises to invite you to! Services Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Cocktail Making Classes Gin Tasting Events Wedding Bar Hire Policies Privacy Policy Cookie Policy (UK) Contact Sip ‘n’ Swig to discuss mobile bar hire, cocktail masterclasses, gin tasting events and more! 07581015916 07872921415 cheers@sipnswig.co.uk giles@sipnswig.co.uk Based in Stratford-Upon-Avon, Warwickshire, CV37. Covering the UK 3B Grove Business Park, Alscot Estate, Atherstone on Stour, Stratford-upon-Avon, CV37 8DX © 2025 Sip 'n' Swig. facebook linkedin instagram Close Menu Home Sip ‘n’ Swig HQ HQ Info HQ Events Bar Hire Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Wedding Bar Hire Gin Tasting Events Shop Cocktail Cans Experiences Gift Vouchers Gift Packs Gin & Spirits Wine Cocktail Juices, Purees and Syrups Craft Beer Cans FAQs Cocktail Making Classes Blog Case Studies Blog Get in Touch 07581015916 07872921415 cheers@sipnswig.co.uk giles@sipnswig.co.uk Based in Stratford-Upon-Avon, Warwickshire, CV37. Covering the UK 3B Grove Business Park, Alscot Estate, Atherstone on Stour, Stratford-upon-Avon, CV37 8DX Manage Cookie Consent We use cookies to optimise our website and our service. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept cookies Functional only View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.sabinelondon.co.uk/contact-us/",
      "text": "Reserve a Spot | Cocktail Bar Near St Pauls | Sabine Menus What’s On Events & Private Hire Gallery Contact Us Book Now Contact Us Carter Lane, London, EC4V 5AJ Opening Hours Sun-Wed: 12pm – 12am Thurs-Sat: 12pm – 1am Sabine Enquiries: SabineStPauls@leonardohotels.co.uk Press and Media Enquiries: Sabine@sohocommunications.co.uk book Now SUNDAY – WEDNESDAY: 12PM -12AM THURSDAY – SATURDAY: 12PM – 1AM LUNCH: MONDAY – THURSDAY: 12PM – 4PM BRUNCH: DAILY: 12PM – 3PM CONTACT US: Sabine@sohocommunications.co.uk Carter Lane,  London, EC4V 5AJ Privacy Policy FAQs Press by Propeller Close"
    },
    {
      "url": "https://sipnswig.co.uk/mobile-cocktail-bar-hire/",
      "text": "Mobile Cocktail Bar Hire UK - Sip 'n' Swig Stratford Skip to main content Hit enter to search or ESC to close Close Search search 0 Menu Home Sip ‘n’ Swig HQ HQ Info HQ Events Bar Hire Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Wedding Bar Hire Gin Tasting Events Shop Cocktail Cans Experiences Gift Vouchers Gift Packs Gin & Spirits Wine Cocktail Juices, Purees and Syrups Craft Beer Cans FAQs Cocktail Making Classes Blog Case Studies Blog Get in Touch search 0 was successfully added to your cart. Menu Home » Mobile Cocktail Bar Hire Mobile Cocktail Bar Hire Private events from £180 Package example - 100 cocktails over 2 hours, including staff, glassware etc. excluding travel £1130 Premium Products Trained cocktail bartenders Personalised cocktail menus and cocktails Pop up bar structures availablefor inside or out Mobile Cocktail Bar Hire or you could consider a cocktail making class or cocktail cans Shop Now Shop Now Shop Now When an event needs sophistication, excitement and wow factor to impress your guests, what is better than a mobile cocktail bar with your own cocktail bartender on hand to mix up your favourite cocktails? We come to you and set up our rustic wooden mobile bar for any event. Stocked with personalised cocktails, a selection of favourites or some true classics, all of our cocktails are hand made with quality, fresh ingredients, with alcohol or without. Giles was trained with the Savoy Group and has passed his training on to all of our cocktail bartender’s so you know you’re getting a ‘proper’ cocktail! We are based in Warwickshire but travel all over the UK with our mobile cocktail bars. Cocktail bar hire is popular for hen and stag parties, celebrations at home, product launches, birthday parties and more! Your cocktail bartender will bring all of the equipment, spirits, mixers, garnishes, ice, glassware etc. so you can just relax and enjoy alongside your guests! Sample Menu Sample Menu Sample Menu FAQ’s Where do you travel to? We’re based in Stratford-upon-Avon, Warwickshire but work all over the country and abroad too. Although travel costs apply, we can travel to wherever your event may be! What will the bar look like? We have our own rustic wooden bars or modern bar structures that you can have your own printed front on. We can also work off a bar structure or even a suitable vehicle that you provide, we have a number of contacts if you are looking for something a little different. We’ve also worked off kitchen islands and garden bars, message us to see how we can make your space work. The smallest bar we have is 1m, this could service up to around 50 guests. Our normal rustic wooden bars are 1.5m so we suggest a 2m x 2m space. We also use two rustic bars together for larger events. There are no restrictions on where we can access with our pop up bars. If you are having draft beer, we will need power, otherwise, just the space. We do have a 3x3m gazebo we can use for outside spaces. What cocktails do you serve? We will give you a cocktail menu to choose from, most can be made alcoholic or non, but we’re always open to consider other favourite cocktails! We suggest 4 cocktail options to be served and all of our cocktails are full strength, made fresh to order with fresh and quality ingredients. We aren’t self taught cocktail makers following recipes, Giles trained with the Savoy Group and his cocktails knowledge and training is passed on to the team, all of our cocktails are made to his recipes so you always have a consistent cocktail from Sip ‘n’ Swig. Our cocktails are always served in glassware, unless specifically requested otherwise. Do you do dry hire or staff only? We do not offer dry hire. As a general rule, we do not offer staff only however please contact us if this is what you require as there may be options. Can I have a cash bar at my event? Yes we can ensure the correct licences are in place whether you want to provide all drinks for your guests, a capped number for each guest or you want a full cash bar where guests purchase their own drinks. In this case a booking fee and minimum spend would apply. Guests can pay by cash or card. How many people do you cater for? Cocktail Bars work best for more than 25 guests due to our minimums. We can run cocktail bars for weddings, festivals and balls. There are options for any party size so please get in touch to discuss your requirements. Can you personalise my event? Yes absolutely, think brand coloured cocktails, cocktail toppers with event details or company logo on or custom printed bar front, cocktails renamed to suit your event, personalised drinks tokens, the list is endless, chat to us about personalising your bar, drinks and cocktails; it’s what we do best! How much will it cost? Our Booking Fee for a private event is £150 (plus VAT). Your booking fee secures your date reservation, at least one senior member of the Sip ‘n’ Swig team, bar hire or structure sourcing as required (if an alternative structure is required to those that we provide, additional costs may be incurred) and all consumables. We are a fully licensed and insured company. If your event requires a Temporary Events Notice (TEN) we can ensure that this is in place. Depending on your event requirements you will have staff costs, travel and drinks. For example, a cocktail bar with 2-3 hours of service and 100 cocktails served. Menu of 4 bespoke cocktails for guests to choose from (choice of alcoholic / non alcoholic) All cocktails are made fresh to order for your guests. Travel included within 10 miles of Stratford (outside of this additional charges apply) Event package price: £1,450 inc VAT (includes booking fee) We will have a minimum amount of cocktails based on the amount of guests, we generally suggest cocktails are served for 2-3 hours at any event. If we are running a full bar, we will include cocktails throughout. Our Promise Professional, friendly and knowledgeable staff from Sip ‘n’ Swig A bar stocked with premium, independent, new to market and local products. Freshly made, full strength and well-balanced cocktails Complete peace of mind, we take care of everything so you can sit back and enjoy the party A personal touch, we are a family run business and treat every event as if it were our own with a genuine love for what we do A bespoke bar offering unique to you through personalisation and branding – we will help you put your stamp on it Contact Us Use this form to send us an email about your next event Name (Required) First Last Email (Required) Phone (Required) Type of event (Required) Select Corporate Event Private Event Wedding Bar Product - Cocktail Cans/Gin Masterclasses Other Where did you hear about us? Select Facebook Instagram LinkedIn Google search or other Togather Met via Networking Previous event guest Referral from existing customer We’ve used you before! Referral from venue or supplier At an Event/Exhibition Event date (Required) DD slash MM slash YYYY Number of Guests (Required) Venue (inc Postcode) (Required) Message The Process 1 Contact us via email or enquiry form with your event details (guest numbers, times, location, bar type). 2 We’ll confirm date availability and provide initial info within 48 hours. 3 Receive a quote link once we have all the details. Arrange a call or request any quote amendments. 4 Upon quote acceptance and Booking Fee payment, your date is secured. From here we’ll finalise details like cocktail choices and bar branding. 5 We handle everything: drinks, glassware, ice, garnishes and staff. 6 We’ll confirm all details 14 days before your event, but feel free to reach out anytime. 7 For larger events, access your own portal to track requirements, timings, and drink selections. 8 Trust us to deliver on time and impress your guests with exceptional service and a touch of class. Sign Up For Newsletter Based on the beautiful Alscot Estate at Grove Business Park, we now have a licensed premises to invite you to! Services Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Cocktail Making Classes Gin Tasting Events Wedding Bar Hire Policies Privacy Policy Cookie Policy (UK) Contact Sip ‘n’ Swig to discuss mobile bar hire, cocktail masterclasses, gin tasting events and more! 07581015916 07872921415 cheers@sipnswig.co.uk giles@sipnswig.co.uk Based in Stratford-Upon-Avon, Warwickshire, CV37. Covering the UK 3B Grove Business Park, Alscot Estate, Atherstone on Stour, Stratford-upon-Avon, CV37 8DX © 2025 Sip 'n' Swig. facebook linkedin instagram Close Menu Home Sip ‘n’ Swig HQ HQ Info HQ Events Bar Hire Corporate Event Bar Hire Mobile Cocktail Bar Hire Event Bars Wedding Bar Hire Gin Tasting Events Shop Cocktail Cans Experiences Gift Vouchers Gift Packs Gin & Spirits Wine Cocktail Juices, Purees and Syrups Craft Beer Cans FAQs Cocktail Making Classes Blog Case Studies Blog Get in Touch 07581015916 07872921415 cheers@sipnswig.co.uk giles@sipnswig.co.uk Based in Stratford-Upon-Avon, Warwickshire, CV37. Covering the UK 3B Grove Business Park, Alscot Estate, Atherstone on Stour, Stratford-upon-Avon, CV37 8DX Manage Cookie Consent We use cookies to optimise our website and our service. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept cookies Functional only View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://siponmain.com/",
      "text": "Cocktail Lounge - Sip On Main Home Weddings Donations Contact Home Weddings Donations Contact More Home Weddings Donations Contact Home Weddings Donations Contact Lounge: 636-744-1724 sip\nEAT\nenjoy sip\nEAT\nenjoy sip\nEAT\nenjoy sip\nEAT\nenjoy Join us for a drink at our cocktail bar! Visit Us About Us Sip & Snack Event Rental Space Event Rental Space Discover the art of mixology in an atmosphere of refinement and elegance. Whether you're a seasoned cocktail aficionado or a newcomer to the world of libations, Sip On Main invites you to our cocktail lounge to savor the moments that matter in style and sophistication. Our menu is designed for sharable meals. Event Rental Space Event Rental Space Event Rental Space Looking for a space to fit your event needs? We have a fully equipped banquet room at Sip On Main! Our event rental space is nestled in the heart of Union, Missouri in the lower level. Whether you're planning a corporate meeting, birthday bash, or any special occasion, our space transforms to suit your vision as a private rental cocktail bar too. Catering & Rentals Event Rental Space Catering & Rentals We want to bring the party to you! On top of our Mobile Bartending service, we now offer a Mobile Bar! Our Mobile Bar service is not just about mixing drinks, it’s about creating unforgettable moments for you and your guests! Please contact us below to inquire about renting our Mobile Bar. Menu Signature Sips Sip Mango Tequila, Lemon Juice, Strawberry Puree, Club Soda Blackberry Manhattan Bourbon, Blackberry Syrup, Sweet Vermouth, Bitters Creme Brûlée Martini Vanilla Vodka, Vanilla Liqueur, Irish Cream, Caramel Sosa Vodka, Orgeat, Honey Syrup, Tea Strawtini Gin Campari, Strawberry Syrup Stinger Whiskey, Orange Bitters, Lemon Juice, Honey Syrup Sparrow Light Rum, Dark Rum, Orange Juice, Pineapple Juice, Grenadine, Bitters Mules Moscow, Irish, Kentucky, Blackberry Martinis Chocolate, Lemon Drop, Creme Brûlée, Apple Tini, Coffee Wine White Douglass Hil - Chardonnay Avalon - Chardonnay La Playa - Sauvignon Blanc Black Ridge - Moscato Hive & Honey - Riesling Red Costal Vines - Cab Sauvignon Avalon - Cab Sauvignon Costal Vines - Pinot Noir Lucky Star - Pinot Noir Albertoni - Merlot Cycles Gladiator - Merlot Mocktails Sosa (NA) Unsweet Tea, Honey, Orgeat Missing Summer (NA) Sicilian Lemon Balsamic, Club Soda, Lime Juice Key Lime Pie (NA) Lime Juice, Orgeat, Simple Syrup Stinger (NA) NA Whiskey, Lemon, Honey Mule (NA) Lime Juice, Honey, Ginger Beer Gimlet (NA) Lime Juice, Simple Syrup, Club Soda Tea-Tini (NA) Lemon Juice, Simple Syrup, Tea Beer Canned, Bottled, Seltzers Appetizers Southwest Eggrolls Fried Pickle Chips 8 Piece Wings Lobster Rangoon Crab Rangoon Spinach Artichoke Dip Fry Board Flatbreads Cheese Pizza Sauce, Pizza Cheese Mix Pepperoni Pizza Sauce, Pizza Cheese Mix, Pepperoni BBQ Pork Belly BBQ Pork, Jalapeno, Pepperjack Cheese, BBQ Sauce, Pineapple Buffalo Chicken Ranch, Buffalo Chicken, Bacon, Pepperjack Philly Cheese Steak Steak, Onions, Green Peppers, Red Peppers, Mushrooms Paninis Comes with choice of fries Italian Panini Pepperoni, Salami, Romaine, Pepperjack, Tomato, Honey Mustard, Pepperoncini, Onion BBQ Pork Belly BBQ Pork, Jalapeno, Pepperjack, BBQ Sauce, Pineapple Philly Cheesesteak Steak, Onion, Green Peppers, Red Peppers, Mushrooms Salads House, Caesar Reviews Social Contact Us Send a Message Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Grab a Drink! Don't just read about us, come on in and have our bartenders make you the perfect cocktail at the perfect cocktail lounge! For Event Rental, catering, and equipment rental, please contact us! Sip On Main Lounge: 636-744-1724 Liquor Catering: 636-744-1725 Hours Open today 11:00 am – 11:00 pm Wednesday & Thursday: 11am - 11pm Friday & Saturday: 11am - Midnight Kitchen Hours until 10pm Copyright © 2025 Sip On Main - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://sipandserve.us/",
      "text": "Mobile Bartending Service for Hire | Sip and Serve Click here for your FREE Ultimate Event Bar Guide! 614.655.8376 Home Get a quote Reviews Drink Calculator Payments Featured in Voyage Ohio Hiring Bartenders What's New? More Home Get a quote Reviews Drink Calculator Payments Featured in Voyage Ohio Hiring Bartenders What's New? 614.655.8376 Home Get a quote Reviews Drink Calculator Payments Featured in Voyage Ohio Hiring Bartenders What's New? Luxury Mobile Bar Services for Weddings & Events in Ohio Luxury Mobile Bar Services for Weddings & Events in Ohio Luxury Mobile Bar Services for Weddings & Events in Ohio Luxury Mobile Bar Services for Weddings & Events in Ohio Free Brochure Weddings,    Private parties,  and corporate events Why Choose  Sip and Serve Mobile Bar Services Elegance in every pour Sip & Serve Mobile Bar Services offers luxury mobile bartending for weddings and special events in Ohio , including Lancaster, Hocking Hills, and Columbus.  Our team of professional wedding bartenders brings a curated, full-service experience to your celebration—from signature cocktails to sophisticated setups, every detail is handled with elegance, charm, and style . Whether you're planning an intimate gathering or a large reception, our mobile bar hire ensures unforgettable service and timeless memories. Stress-Free Service from Start to Finish You bring the guests, we’ll bring the bar. Sip & Serve offers professional mobile bartending services for weddings and events in Ohio , including Columbus, Hocking Hills, and Lancaster. Our experienced wedding bartenders take care of every detail—setup, ice, cups, mixers, garnishes, and cleanup—so you can relax and celebrate in style with a beautifully curated mobile bar experience . Personal Touch That Goes Beyond the Bar We don’t just pour drinks—we pour heart into every celebration. At Sip & Serve, our Ohio-based mobile bartending service specializes in wedding bar experiences that reflect your vision from the first consultation to the final toast. Whether you're planning in Columbus , Hocking Hills, or Dublin our team of professional wedding bartenders ensures your day is seamless, stylish, and truly unforgettable. Booking 2025 & 2026 Book Now! Limitted Availability Reserve my date! Frequently Asked Questions Please reach us at events@sipandserve.us f you cannot find an answer to your question. Do you provide alcohol? No, we are a dry hire.  Which helps our clients save up to 40% of their overall bar expense! What are your add-ons? Ice & coolers Self Serve Water Station 10x10 White Pop Up tent Mockatils Soda Portable black OR white bar Standing tables Table wine service Champagne Wall or Pour Additional hours or bartenders Social Stay in Touch! Sign up to hear from us about our specials and events. Email Sign up Featured in Voyage Ohio Sip and Serve Mobile Bar Services Serving Hocking & surrounding counties Call or text 614-655-8376 Copyright © 2025 Sip and Serve Mobile Bar Services  - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    }
  ]
}