{
  "fuentes": [
    {
      "url": "https://siptequila.com/pages/subscription-faq",
      "email": "info@siptequila.com"
    },
    {
      "url": "https://sipindustries.com/about-us/who-we-are/",
      "email": "sales@sipindustries.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    }
  ],
  "mails": [
    "info@reception-plus.de",
    "info@siptequila.com",
    "sales@sipindustries.com"
  ],
  "nombre_sitio": "siptequila.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://siptequila.com/pages/subscription-faq",
      "text": "Subscription FAQ Skip to content FREE shipping on orders $249+ We're showing that you are in CHANGE CONFIRM × ENTER ZIP CODE FOR DOORSTEP DELIVERY Enter your zip code for pricing and local availability SUBMIT Open navigation menu Open search Shop Best Sellers New Arrivals Tasting Kits Engraved Bottles Bundle & Save Gifting Sip Merch Shop By Expression Blanco / Plata Reposado Anejo Extra Anejo Cristalino High Proof Mezcal OTHER SPIRITS Previous Next Featured Collections If You Like Wine Tequilas for wine lovers If You Like Whiskey Tequila for aged spirits lovers What You Should Be Drinking Our favorite Brands Gifting Gifts under $100 Gifts under $150 Gifts under $250 Gifts $250 and up Corporate Gifts Engraved Bottles Membership Tequila Club Sip Events Daily Tastings (Stuart, FL) Weekly Events (Stuart, FL) Private Events (Stuart, FL) Sip Tequila Become an Ambassador Ship to: Open search Open account page Open cart 0 LOOKS LIKE DELIVERY IS NOT SUPPORTED IN THAT STATE. CLICK HERE TO CHANGE ZIP CODE. Best Sellers New Arrivals Tasting Kits Engraved Bottles Bundle & Save Gifting Sip Merch Shop By Expression Blanco / Plata Reposado Anejo Extra Anejo Cristalino High Proof Mezcal OTHER SPIRITS Featured Collections If You Like Wine Tequilas for wine lovers If You Like Whiskey Tequila for aged spirits lovers What You Should Be Drinking Our favorite Brands Gifting Gifts under $100 Gifts under $150 Gifts under $250 Gifts $250 and up Corporate Gifts Engraved Bottles Shop Membership Tequila Club Sip Events Account Become an Ambassador Shop Best Sellers Engraved Bottles Sip Events Daily Tastings (Stuart, FL) Weekly Events (Stuart, FL) Private Events (Stuart, FL) Close Cookie policy We use cookies and similar technologies to provide the best experience on our website. Refer to our Privacy Policy for more information. Accept Decline 0 Your cart is empty Continue shopping Clear Close Shop By Brand Best Sellers Shop All Popular Brands Explore More Gift Guide Join The Club New Arrivals Subscription FAQ Need to manage your subscription? Go here: https://siptequila.com/account/login?manage-subscriptions Need an account? Sign up here: https://siptequila.com/account/register \"If you know what you like and want to keep it regularly stocked (and at a discount if you play your cards right), Sip Tequila’s single bottle subscription is a great place to start.\" - Liquor.com Pay As You Go Subscription Details Pick one or more tequilas to be delivered at your desired interval. Flat rate $10 shipping under $99 and Free Shipping over $99 Select delivery cadence - Have your Tequila delivered monthly, or every 2, 4, or 6 months Requires a minimum of 2 shipments before cancellation Will continue charging as shipped until canceled Self-service subscription management options: Swap products Update quantities Change order date Update credit card and address Update delivery interval Pause or skip orders anytime View history and upcoming orders If you wish to add a product to your current subscription or need help, please contact us a info@siptequila.com Prepaid Subscription Details Pick one of your favorite tequilas to be delivered at your desired interval Limit of 1 (one) product on prepaid subscriptions Flat rate $10 shipping under $99 and Free Shipping over $99 Select delivery cadence - Have your Tequila delivered monthly, or every 2, 4, or 6 months Prepaid gift subscriptions expire at end of the prepaid period You can renew your subscription at end of the prepaid period Self-service subscription management options: Update credit card and address Update delivery interval Pause or skip order anytime View history and upcoming orders If you need help, please contact us a info@siptequila.com ✺ Sign Up for Exclusive Deals Join us for special offers and exclusive product offerings. E-mail Subscribe More Info FAQs About Us Contact Us Visit Us Gift Card Shipping Terms & Conditions Membership Terms Privacy Policy Stuart FL - Retail Location Stuart, FL - Weekly Events Stuart, FL - Daily Tastings Stuart, FL - Private Events ❍ Tequila Concierge Looking for gifting guidance? Have a special order request? Our Tequila Concierge team is here to help. Get in Touch © 2025, Sip Tequila | Customer Service: (833) 747-1110\nST Online, Inc. is located in the United States Unfortunately, delivery is not supported in your state yet. But let's stay in touch Share your email below and be the first to know when shipping is supported in your region. Email We value your privacy and we will protect your personal information according to our Privacy Policy. Your wishlist Please add product to your wishlist to see them here. Login to see your wishlist! Select All Move to cart Delete Login Explore more products Add products Close My wishlist Please add product to your wishlist to see them here. Login to see your wishlist! Select All Move to cart Delete Login Explore more products Add products Add to wishlist Choose your wishlist to be added Create New wishlist Save My Wishlist Save Share List Via Email Sender Name* Recipients Email* Subject* Message* SHARE WISHLIST Or Share Via Subscribe and get alerts about your Wishlist We will notify you on events like Low stock, Restock, Price drop or general reminders so that you don’t miss the deal Subscribe Move to cart See Product Details Are you sure you want to delete this wishlist? Yes No Are you sure you want to delete selected wishlist products? Yes No Out of stock products will be not move. Are you want to move selected wishlist products? Yes Cancel Wishlist management page This page allows you to manage and add wishlist items directly to the cart. Share your public wishlist on social media, through links, and via custom email. You can subscribe to get update about your wishlist items You have been unsubscribed You will no longer receive emails about wishlist activities from this store. Close Guest shopper You are currently shopping anonymously! Login to save your wishlist. Login Copy link to share Share this item Or Share Via ${{amount}} Deal of the day Days : Hours : Minutes : Seconds"
    },
    {
      "url": "https://sipindustries.com/about-us/who-we-are/",
      "text": "Who We Are - SIP Industries Link to LinkedIn Link to Facebook Link to X Toll Free:  877-921-6111 About Us Who We Are Why SIP History Social Responsibility Industry Links Terms & Conditions of Sale News Events Products Fittings Joint Restraints MJ Accessories Linings & Coatings MJ x MJ Adapter Hydrant Bury & Extensions Fabricator Flanges Misc. Accessories Valve & Service Boxes Cleanout & Monument Boxes Meter Boxes Extension Rings Manhole Frames & Covers Drainage Grates & Curb Inlets Trench Grates Detectable Warning Plates Resources Product Highlights Product Brochure Price List Submittals & Certifications Technical Advisory & Support Engineering Calculators Careers Sales & Support Contact Click to open the search input field Click to open the search input field Search Menu Menu Who We Are You are here: Home 1 / About Us 2 / Who We Are Since 1960 SIP has been globally manufacturing quality iron products. SIP was one of the first innovators to globally source municipal castings and utility fittings in the United States. We set the standard for quality and reliable globally sourced products in an economical manner for the utility marketplace and OEM castings. Our products are fully recyclable and made from recycled material wherever possible. Team SIP pledges to continue to produce quality products and deliver customer satisfaction through honest and ethical practices. We take pride in stating that we still sincerely serve our first customer in US with as much zeal and commitment as we did on our first order in 1977. We extend a humble gratitude to our customers, vendors and associated people for their consistent trust and support. The company is committed to its team members whose talent, experience and hard work have been invaluable to the growth of the company. Lala Rangilal Founder, SIP Industries Mission Service is Priority Our dedication to provide outstanding customer service and experience to last a lifetime Responsible Product Offering Our commitment to deliver quality products at competitive prices while maintaining an exhaustive product-line inventory Building Relationships Our belief to build and maintain long-term relationship based on transparency, honesty and loyalty People Empowerment Empower team members on grounds of lawful and ethical practices Sustainable Community Our sincerity towards working in collaboration with the community we work in for a better tomorrow Contact Info 8876 Gulf Freeway, Suite 500 Houston, TX 77017 sales@sipindustries.com 877-921-6111 713-923-6111 Quick Links Products Contact Us Careers Terms & Conditions of Sale Privacy Policy Quality Manufacturer Since 1960 © Copyright - SIP Industries. | Web Design by M16 Marketing Scroll to top Scroll to top Scroll to top This site uses cookies. By continuing to browse the site, you are agreeing to our use of cookies. OK Cookie and Privacy Settings How we use cookies We may request cookies to be set on your device. We use cookies to let us know when you visit our websites, how you interact with us, to enrich your user experience, and to customize your relationship with our website. Click on the different category headings to find out more. You can also change some of your preferences. Note that blocking some types of cookies may impact your experience on our websites and the services we are able to offer. Essential Website Cookies These cookies are strictly necessary to provide you with services available through our website and to use some of its features. Because these cookies are strictly necessary to deliver the website, refusing them will have impact how our site functions. You always can block or delete cookies by changing your browser settings and force blocking all cookies on this website. But this will always prompt you to accept/refuse cookies when revisiting our site. We fully respect if you want to refuse cookies but to avoid asking you again and again kindly allow us to store a cookie for that. You are free to opt out any time or opt in for other cookies to get a better experience. If you refuse cookies we will remove all set cookies in our domain. We provide you with a list of stored cookies on your computer in our domain so you can check what we stored. Due to security reasons we are not able to show or modify cookies from other domains. You can check these in your browser security settings. Check to enable permanent hiding of message bar and refuse all cookies if you do not opt in. We need 2 cookies to store this setting. Otherwise you will be prompted again when opening a new browser window or new a tab. Click to enable/disable essential site cookies. Other external services We also use different external services like Google Webfonts, Google Maps, and external Video providers. Since these providers may collect personal data like your IP address we allow you to block them here. Please be aware that this might heavily reduce the functionality and appearance of our site. Changes will take effect once you reload the page. Google Webfont Settings: Click to enable/disable Google Webfonts. Google Map Settings: Click to enable/disable Google Maps. Google reCaptcha Settings: Click to enable/disable Google reCaptcha. Vimeo and Youtube video embeds: Click to enable/disable video embeds. Accept settings Hide notification only"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Nachricht E-Mail Surname Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    }
  ]
}