{
  "fuentes": [
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://somiartfest.org/contact/",
      "email": "info@somiartfest.org"
    },
    {
      "url": "https://somiartfest.org/vendors/",
      "email": "info@somiartfest.org"
    },
    {
      "url": "https://www.projectaccessnow.org/about-us/staff",
      "email": "iepsconsultation@projectaccessnow.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "concertpa@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "courtney@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "darcie@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "finance@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "jill@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "lee@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "operations@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "theatricalpa@prescottpark.org"
    }
  ],
  "mails": [
    "concertpa@prescottpark.org",
    "courtney@prescottpark.org",
    "darcie@prescottpark.org",
    "finance@prescottpark.org",
    "iepsconsultation@projectaccessnow.org",
    "info@communityaccessnaperville.org",
    "info@somiartfest.org",
    "jill@prescottpark.org",
    "lee@prescottpark.org",
    "operations@prescottpark.org",
    "theatricalpa@prescottpark.org"
  ],
  "nombre_sitio": "somiartfest.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    },
    {
      "url": "https://somiartfest.org/contact/",
      "text": "Contact - SOMI Art Fest Skip to main content Skip to footer Home Attend Visit Artist List Festival Program Exhibit For Artists Vendors Support Us Volunteer Become a Sponsor Award Winners About Us Contact Home Attend Visit Artist List Festival Program Exhibit For Artists Vendors Support Us Volunteer Become a Sponsor Award Winners About Us Contact Contact Get in touch Address P.O. Box 430953 South Miami, FL 33243 Email: info@somiartfest.org Phone: 305-769-5977 Send Us A message Send Stay up to date Stay up to date with the lateset news Subscribe Quick Links Home About For Artists Patron Get  in touch P.O. Box 430953 South Miami, FL 33243 info@somiartfest.org Copyright © 2025 • SOMI Art Fest Follow us on Facebook Follow us on Instagram"
    },
    {
      "url": "https://somiartfest.org/vendors/",
      "text": "Vendors - SOMI Art Fest Skip to main content Skip to footer Home Attend Visit Artist List Festival Program Exhibit For Artists Vendors Support Us Volunteer Become a Sponsor Award Winners About Us Contact Home Attend Visit Artist List Festival Program Exhibit For Artists Vendors Support Us Volunteer Become a Sponsor Award Winners About Us Contact Vendors Vendors Our Vendors Our festival celebrates the creativity and diversity of the arts, and we’re committed to providing a wide variety of delicious and unique food options for our visitors to enjoy. At our festival, you’ll have the opportunity to showcase your products to a diverse audience of art lovers and enthusiasts. Some key details about our festival application process Vendors interested in participating in our festival should contact us. Selection process Our selection committee will review all applications and select vendors based on quality as well as how they fit with the festival's theme and vision. Booth Space Vendors selected to participate in our festival will be provided with a designated booth space Sales Vendors are responsible for selling their own items at the festival. Vendors are encouraged to bring marketing materials such as business cards or brochures. We welcome vendors of all types and backgrounds to apply to participate in our festival. Whether you’re a startup or an established business, we believe that our festival provides an exciting opportunity to showcase your products and engage with a wider community. If you’re interested in participating in our festival as a vendor, please fill out the application below. Food Vendors Vendors Vendors Frequently Asked Questions When is SOMI Art Fest? The festival is held every year the weekend after Presidents’ Day. Our next festival is February 21 and 22, 2026. Where is the festival located? The festival is located in the downtown area of South Miami on Sunset Drive (SW 72nd Street) from US 1 to Red Road (SW 57th Avenue.) Stay up to date Stay up to date with the lateset news Subscribe Quick Links Home About For Artists Patron Get  in touch P.O. Box 430953 South Miami, FL 33243 info@somiartfest.org Copyright © 2025 • SOMI Art Fest Follow us on Facebook Follow us on Instagram"
    },
    {
      "url": "https://www.projectaccessnow.org/about-us/staff",
      "text": "Project Access NOW Staff: Leadership & Dedicated Team Members | Portland, OR About Mission Learn about how and why we do what we do. People Get to know our staff, leadership, and board. Partners Learn who partners with us to achieve our mission. Impact Stories of success from clients and partners. News Keep up with the latest from Project Access NOW. View our Strategic Plan Click Here Get Involved Donate Your donations will support our efforts. Volunteer Give your time and energy to help people receive care they need. Board &Â Committee Service Become a core member of the leadership team. Employment Find out about current employment opportunities. Contact Get in touch with Project Access NOW. Seeking services? Click Here Refer a client Get Help About Mission People Partners Impact News Programs Donated Care Insurance Support Community Health Community Assistance Advocacy Get Involved Donate Volunteer Board & Committee Service Employment Contact In need of services? Click here Our Staff Leadership Executive Team Greg Sutliff âVice President Finance they/them Omar Al Rais, MBA, MBChB Senior Vice President Operations he/him/his Rebecca Raab, MS Vice President Development and Communications she/her/hers Tracy Carver, MPA President and CEO she/her/hers Leadership Joseph Nicoletti Director IT and Strategic Projects he/him/his Myrna Valdez Director Programs and People she/her/hers/ella Program Management Brennan Universe Manager Executive Assistant and Board Affairs they/them Chloe Dominguez Manager Program and Office Logistics she/her/hers Emma Holland Manager Operations she/her Erika Valdez Manager Donated Care (DC) she/her/hers Jina Kalberg Manager Finance she/her/they/them Julie Chu, PMP Senior Project Manager Strategic Projects (SP) she/her/hers Peter Merritt Manager Impact and Advocacy he/him Ranisha Isom, BS, CAC, CHW Manager Insurance Enrollment and Payment Support she/her/hers Sandra Rivera Manager Community Assistance Program (CAP) she/her/hers/ella We're hiring! Check out our employment opportunities now View Open Positions Subscribe to Updates Join our newsletter to stay up-to-date on news and events. About Mission People Partners Impact Annual Reports News Get Involved Donate Volunteer Employment Contact Resources Social Services Insurance Appointment Client Referral Follow us Facebook Instagram LinkedIn © Project Access NOW. All rights reserved. Privacy Policy Terms of Service Cookies Policy Site Map"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "text": "Leadership - Prescott Park Arts Festival FAQs For The Record My Account Cart Menu Events Concert Series Movies Theatre Camp ENCORE! Josie’s Family Jams Special Events Community Showcases All Events Season Passes Reservations How It Works Reserve a Spot Pre-Order Food Inclement Weather Policy Rain or Shine Series Season Program About Us Mission Our Timeline Leadership Join the Team Our Kitchen Theatrical Rentals Getting Here Contact Support Us Advertise Donate Get Involved Gift Cards People for the Park Sponsors Events Concert Series Movies Theatre Camp ENCORE! Josie’s Family Jams Special Events Community Showcases All Events Season Passes Reservations How It Works Reserve a Spot Pre-Order Food Inclement Weather Policy Rain or Shine Series Season Program About Us Mission Our Timeline Leadership Join the Team Our Kitchen Theatrical Rentals Getting Here Contact Support Us Advertise Donate Get Involved Gift Cards People for the Park Sponsors FAQs For The Record My Account Cart Prescott Park Arts Festival Leadership Prescott Park Arts Festival PO Box 4370 Portsmouth, NH 03802 Box Office Hours 10am to 4pm, Monday-Friday 603.436.2848 hello@prescottpark.org Staff Courtney Perkins Executive Director Lee Frank Director of Development Jill Pettigrew General Manager Darcie Champagne Marketing & Development Manager Alexa McNamara Site Manager Brock Piechota Operations Manager Ro Gavin Theatre Production Manager Tristan Law Concert Production Manager Kelsey Loomis Bookkeeper Board of Directors Tyler Goodwin Chair Goodwin Family Management CEO John Tabor Immediate Past PPAF Board Chair Portsmouth City Council Michael Harrison Co-Vice Chair Corporate Director & Advisor Elisabeth Robinson Co-Vice Chair Whole Life Health Care Board Certified Family Nurse Practitioner John P. Bohenko Treasurer City Administrator Saco, Maine Kelsey Kraus Secretary The Kane Company Director of Property Management Jack Blalock Civic Leader Caitlin Burke Boulos Company Partner Joseph Chase SCS Financial Managing Director, Private Client Group Michele Correnti Correnti Marketing Owner + Founder Mariah Erikson, Esq. Aland Realty Chief of Operations/Owner Andrew Hart Barrel One Collective Manager JoAnn Hodgdon PCGiT Founder, Vice President Jacob Levenson SNHU Business Process Manager Matt Marra Matt Marra Ventures & Advisory Angel Investor and Advisor Tod O’Dowd Avery Insurance Agency President Community Professionals Group Michele Correnti Chair, Community Professionals Group Correnti Marketing Owner + Founder Colton Cadarette Notoriot Founder & Producer Kelly Freitas A Good Pear Design Studio Co-Founder & Principal Designer Bryttnie Gillis Envision Group | Compass Real Estate NH & ME Real Estate Advisor Marta Robinson Sage Couch Counseling Owner Jessica Stack Stackable: Creative Marketing Collective Owner + Principal Liz Tosi Vital Design Senior Visual Designer & Department Manager Join our newsletter to keep up with all the Festival's offerings! Sign Up Events About Us FAQs Season Passes Support Us For The Record Reservations Box Office Hours: 10am to 4pm, Tuesday-Friday Call us: 603.436.2848 Send us a Message: hello@prescottpark.org Terms of Use Privacy Policy © 2025 Prescott Park Arts Festival. All rights reserved. | Prescott Park Arts Festival PO Box 4370 Portsmouth, NH 03802 Prescott Park Arts Festival is an independently operated 501(c)3 not-for-profit organization. This fiscally responsible festival is managed by a professional staff and volunteer Board of Directors. All contributions are tax deductible to the full extent allowable by law. Back to top."
    }
  ]
}