{
  "fuentes": [
    {
      "url": "https://www.equerryco.com/contact-us",
      "email": "info@equerryco.com"
    },
    {
      "url": "https://www.equerryco.com/contact-us",
      "email": "info@equerryconsulting.co.uk"
    },
    {
      "url": "https://www.sunshineanimalrescue.org/contact-us",
      "email": "lauren@sunshineanimalrescue.org"
    },
    {
      "url": "https://www.susanjpennrealtor.com/southwest-ranches/",
      "email": "susan@susanpennrealtor.com"
    },
    {
      "url": "https://www.southwestranches.org/departments/parks-recreation-and-open-space/frequently-asked-questions/",
      "email": "dlauretano@southwestranches.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    }
  ],
  "mails": [
    "dlauretano@southwestranches.org",
    "info@communityaccessnaperville.org",
    "info@equerryco.com",
    "info@equerryconsulting.co.uk",
    "lauren@sunshineanimalrescue.org",
    "susan@susanpennrealtor.com"
  ],
  "nombre_sitio": "southwestranches.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.equerryco.com/contact-us",
      "text": "Contact | Trusted Equestrian Marketing Specialists — EQUERRY / CO 0 Skip to Content About Services Portfolio INSIGHTS Contact us Open Menu Close Menu About Services Portfolio INSIGHTS Contact us Open Menu Close Menu About Services Portfolio INSIGHTS Contact us Get In Touch We believe in building lasting relationships with those who are as passionate about their place in the equine industry as we are. For more information on our services, please take a moment to fill out the form below, or schedule a call to discuss how we can work together. LET US WORK TOGETHER Telephone UK: +44 (0)1452 922041 US: +1  (716)306 3667 info@equerryco.com Email CONNECTION IS EVERYTHING TO US Would you like to be the first to know our take on the latest in equine sports and marketing? Subscribe to our LinkedIn Newsletter here ! Purpose-driven equestrian marketing, media, and branding solutions that power performance. SERVICES / All Services Marketing Branding Media & Press Research Website Design EXPLORE / About The Team Portfolio Insights CONNECT / Contact Us Book a Call CLIENT PORTAL | TERMS & CONDITIONS | PRIVACY POLICY | COOKIE POLICY © 2017-2025 EQuerry Consulting Ltd | Company Registered in England & Wales No: 09938770 | VAT: 410 0350 73"
    },
    {
      "url": "https://www.sunshineanimalrescue.org/contact-us",
      "text": "CONTACT US | Reach Out Today — sunshine animal rescue 0 Skip to Content HOME MEET OUR PETS ADOPT GET INVOLVED ITEMS NEEDED ABOUT US ABOUT US Login Account DONATE Open Menu Close Menu HOME MEET OUR PETS ADOPT GET INVOLVED ITEMS NEEDED ABOUT US ABOUT US Login Account DONATE Open Menu Close Menu HOME MEET OUR PETS ADOPT Folder: GET INVOLVED Back ITEMS NEEDED Folder: ABOUT US Back ABOUT US Login Account DONATE Contact us. To contact us fill out the contact us form with your information and message. Please include a subject when sending your email. You can also contact us by emailing us at Lauren@sunshineanimalrescue.org. We will try to get back to you within 24-48 hours. Thank you Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Subscribe Sign up with your email address to receive news and updates about Sunshine Animal Rescue pets, events and more Email Address Sign Up We respect your privacy. Thank you! Contact Us Donate Quick Links Lauren@sunshineanimalrescue.org EIN #92-3542862 501c3 Organization Sunshine Rescue Follow Us Instagram Facebook TikTok"
    },
    {
      "url": "https://www.susanjpennrealtor.com/southwest-ranches/",
      "text": "Southwest Ranches, FL Real Estate l Southwest Ranches Homes For Sale l Southwest Ranches Pool Homes For Sale HOME HOME VALUES ADVANCED SEARCH MARKET REPORTS BLOG FEATURED LISTINGS Open main menu Contact us Phone number Sign up or Sign in Share Edit Profile Saved Searches 0 Favorite Properties 0 Sign Out Previous Edit Profile Saved Searches 10 Favorite Properties 10 Sign Out HOME HOME VALUES ADVANCED SEARCH MARKET REPORTS BLOG FEATURED LISTINGS Contact Us Sign up / Sign in Share 954-557-5993 Share this with your friends Copy Close 954-557-5993 Real Estate Company Call Close Southwest Ranches, FL Real Estate & Luxury Homes For Sale Find Your Home Advanced Search Sell Your Home Southwest Ranches, FL Real Estate & Luxury Homes For Sale Southwest Ranches Homes For Sale in Southwest Ranches Florida, offers an exclusive lifestyle with prestigious estates and expansive acreage . This serene community is home to notable sports celebrities and boasts custom single-family homes and equestrian properties ranging from 5,000 to 12,000 square feet, typically set on 1 to 5-acre lots . Discover the Unique Charm of Southwest Ranches Life in Southwest Ranches provides a peaceful, rural atmosphere where sidewalks and traffic lights are non-existent, creating a tranquil escape. Many properties feature canals or ponds, adding to the picturesque scenery and providing a natural water source for landscaping. While enjoying this quiet lifestyle, residents are still just minutes from shopping, dining, beaches, and the airport. Distinctive Features and Amenities in Southwest Ranches, FL Privacy and Space: Homes are primarily located between Sheridan Street and Griffin Road, from US 27 to Flamingo Road, offering ample privacy. Equestrian Paradise: This is a true equestrian area, perfect for horse lovers. Water Systems: Most residential homes utilize well water and salt filtration systems. Rural Roadways: Two-lane roads with side canals maintain the neighborhood's charming rural feel. Top-Rated Schools: Benefit from A-rated public schools like Hawks Elementary, Silver Trails Middle, and West Broward High, as well as excellent private school options. Expansive Parks: Enjoy numerous parks, including Rolling Oaks, Sunshine Ranches Equestrian Park, Southwest Meadows Sanctuary, Trail Side Park, Country Estates Fishing Hole Park, and Frontier Trails. Premier Neighborhoods in Southwest Ranches If you're considering making Southwest Ranches your home, here are five highly desirable neighborhoods: Rolling Oaks: Ideal for horse enthusiasts, this neighborhood offers spacious lots and a serene, private ambiance. Sunshine Ranches: Providing a rural lifestyle with excellent accessibility, this area features a mix of large estates and smaller properties amidst tree-lined streets and ample green spaces. It's also minutes from shopping centers, schools, and recreation. Country Acres: A tranquil, family-friendly community with large lots and custom-built homes, offering easy access to local parks and equestrian trails. Landmark Ranch Estates: Known for its luxury estates and expansive properties, this gated community provides an exclusive and secure living experience with convenient access to amenities. Southwest Ranches Estates: This neighborhood offers a diverse selection of estate-style and smaller homes, fostering a friendly and welcoming atmosphere and easy access to major highways, schools, and shopping. Ultimately, Southwest Ranches offers the perfect blend of privacy, peacefulness, and acreage, all while being incredibly convenient to modern conveniences. It's where you can live a quiet life with vast land, yet be just a 5 to 10-minute drive from shops and restaurants, surrounded by multiple multi-million dollar homes. Our website features the best Southwest Ranches, FL real estate search for homes, condos, land and foreclosure properties available. It is the only site you will ever need! It is easy-to-use and updated by the official Realtor®’s database every 15 minutes. You can save searches, and get daily email alerts of new listings, price changes, sold data, and market reports. Our Interactive Map Search allows you to view properties on a map or refine your search by drawing the boundaries around the area you desire. Here is your FREE Southwest Ranches Market Report! Curious about what’s happening in your neighborhood? You can create a custom market report to see what’s active, under contract, and sold in your neighborhood! Considering selling or refinancing your home? Get an INSTANT property valuation now! Contact us today to find out how we can be of assistance to you! Southwest Ranches, FL Real Estate & Homes For Sale l Southwest Ranches Real Estate $57,000,000 ACTIVE Status ***ONCE IN A LIFETIME OPPORTUNITY TO REDEVELOP 83 ACRES OF PRIME LAND IN SOUTHWEST RANCHES!!!*** CONSISTING OF THREE (3) PARCELS,THE EAST MOST 43 ACRES IS CURRENTLY ZONED “CF” (COMMUNITY FACILITY) & IS CURRENTLY OPERATING AS A SCHOOL & CHURCH. CF ZONING ALSO PERMITS FOR A CEMETERY OR \"ALF\"(ASSISTED LIVING FACILITY)…THE CONTIGUOUS 40 ACRES (CONSISTING OF 2 PARCELS) IS ALSO ZONED CF, HOWEVER, DUE TO A 1,000 LINEAR FT SEPARATION REQ'D BY SW RANCHES, A SEPARATE “CF” FACILITY COULD NOT OPERATE INDEPENDENTLY W/O COMBINING W/THE 43 ACRES... OR KEEP THE COWS & LAND BANK THIS AMAZING PROPERTY FOR FUTURE GENERATIONS! 13900 GRIFFIN RD, Southwest Ranches $57,000,000 ACTIVE Status ***ONCE IN A LIFETIME OPPORTUNITY TO REDEVELOP 83 ACRES OF PRIME LAND IN SOUTHWEST RANCHES!!!*** CONSISTING OF THREE (3) PARCELS,THE EAST MOST 43 ACRES IS CURRENTLY ZONED “CF” (COMMUNITY FACILITY) & IS CURRENTLY OPERATING AS A SCHOOL & CHURCH. CF ZONING ALSO PERMITS FOR A CEMETERY OR \"ALF\"(ASSISTED LIVING FACILITY)…THE CONTIGUOUS 40 ACRES (CONSISTING OF 2 PARCELS) IS ALSO ZONED CF, HOWEVER, DUE TO A 1,000 LINEAR FT SEPARATION REQ'D BY SW RANCHES, A SEPARATE “CF” FACILITY COULD NOT OPERATE INDEPENDENTLY W/O COMBINING W/THE 43 ACRES... OR KEEP THE COWS & LAND BANK THIS AMAZING PROPERTY FOR FUTURE GENERATIONS! 13900 GRIFFIN RD, Southwest Ranches $39,499,000 ACTIVE Status ⋅ 10 Beds ⋅ 23,977 SqFt. ***ONE-OF-A-KIND MASTERPIECE!!!***2.39 ACRES,SPRAWLING 34,353SF TOTAL /23,977SF LIVING AREA,THIS HOME IS DESIGNED FOR THOSE WHO DEMAND EXCELLENCE &DO NOT COMPROMISE! BOASTING MAIN HOUSE 6 BEDRMS,8FULL BATHS+6 POWDER RMS. GUEST HOUSE (2BEDS/2BATHS)W/SEP ENTRANCE &STAFF QTRS (2BEDS/1BATH). IMPRESSIVE 2,359SF MAN CAVE W/GARAGE-17 FT CEILINGS(CAN FIT 3 LIFTS HIGH),SALON,SPA,MASSAGE &FULL GYM. EXCLUSIVE WOMEN’S WING W/GARAGES. EXPANSIVE SOCIAL SPACES W/MULTI-RETREAT OPTIONS. 500+ BOTTLE WINE CELLAR& A CAPTIVATING 3-SIDED F/P. DUAL ELEVATORS. GOURMET SHOWCASE KIT W/GAGGENAU LUXURY APPLS& A HIDDEN BUTLER’S PANTRY. LUXURIOUS PRIMARY SUITE FEATURING A SPA-LIKE SETTING COMPLETED W/A TROPHY CLOSET. RESORT-STYLE LANAI W/A FULL SUMMER KIT,OVERLOOKING A MODERN POOL/SPA W/ENCHANTING WATER &FIRE FEATURES. 16745 STRATFORD COURT, Southwest Ranches $36,000,000 ACTIVE Status ⋅ 11 Beds ⋅ 23,302 SqFt. Estate X, a contemporary masterpiece in AKAI Estates, epitomizes exclusivity. Designed by architect Vasco Vieira, this villa seamlessly integrates indoor & outdoor living across 48,642 total SF. Luxurious water features flow throughout, complementing the private tropical retreat while walls of glass offer panoramic views to the outdoors. Crafted to elevate the owner's lifestyle, this estate boasts an infinity-edge pool, gym, spa and captivating entertainment areas. The grand entrance evokes a 5-star resort oasis, setting the stage for unparalleled sophistication. Set on over 4 acres, AKAI Estates features a private helipad for seamless access, tennis courts, pickleball courts, a putting green, & basketball courts. Enjoy the ultimate in luxury living and a lifestyle unmatched in refinement. 4730 Akai Dr, Southwest Ranches $32,000,000 ACTIVE Status ***ONCE IN A LIFETIME OPPORTUNITY TO OWN 43 ACRES OF PRIME LAND IN SOUTHWEST RANCHES!!!*** THE PROPERTY IS CURRENTLY ZONED “CF” (COMMUNITY FACILITY) & IS CURRENTLY OPERATING AS A SCHOOL &CHURCH. CF ZONING ALSO PERMITS FOR A CEMETERY OR \"ALF\"(ASSISTED LIVING FACILITY) AND SEVERAL OTHER GOVERNMENTAL USES…THE CONTIGUOUS 40 ACRES (CONSISTING OF 2 PARCELS) IS ALSO AVAILABLE AND CAN BE PRUCHASED FOR A TOTAL OF 83 ACRES... THE OPTIONS ARE ENDLESS TO REDEVELOP ESPECIALLY FOR A DEVELOPER LOOKING TO CAPTURE THE LUXURY MARKET, ALL 83 ACRES CAN BE DOWNGRADED TO “RR” RURAL RANCHES WHICH ALLOWS FOR 2 ACRE+ NET HOMESITES…OR KEEP THE COWS & LAND BANK THIS AMAZING PROPERTY FOR FUTURE GENERATIONS! OWNER WILL SUBDIVIDE TO ACCOMMODATE YOUR NEEDS. 13900 GRIFFIN RD, Southwest Ranches $25,000,000 ACTIVE Status ***ONCE IN A LIFETIME OPPORTUNITY TO OWN 40 ACRES OF PRIME LAND IN SOUTHWEST RANCHES!!!*** THE PROPERTY IS CURRENTLY ZONED “CF” (COMMUNITY FACILITY). HOWEVER, IT CAN NOT OPERATE UNDER ITS'  CURRENT ZONING DESIGNATION AND NEEDS TO BE REZONED AND DOWNGRADED TO \"RR\" (RURAL RANCHES - 2 ACRE MIN HOMESITE). THERE IS A 1,000 LINEAR FT SEPARATION REQ'D BY THE TOWN BETWEEN 2 PROPERTIES ZONED \"CF\". THE CONTIGUOUS 43 ACRES IS ZONED \"CF\" AND IS ALSO AVAILABLE FOR PURCHASE..TOTALING 83 ACRES... THE OPTIONS ARE ENDLESS TO REDEVELOP ESPECIALLY FOR A DEVELOPER LOOKING TO CAPTURE THE LUXURY MARKET,ALL 83 ACRES CAN BE DOWNGRADED TO “RR” RURAL RANCHES WHICH ALLOWS FOR 2 ACRE+ NET HOMESITES…OR KEEP THE COWS&LAND BANK THIS AMAZING PROPERTY FOR FUTURE GENERATIONS! OWNER WILL SUBDIVIDE TO ACCOMMODATE YOUR NEEDS. 13900 GRIFFIN RD, Southwest Ranches $24,000,000 ACTIVE Status #PRIME #LOCATION A HUGE PARCEL! NW CORNER OF SHERIDAN ST AND FLAMINGO ROAD. 48+/- ACRES! GREAT POTENTIAL! DRIVE AROUND LUXURIOUS SOUTHWEST RANCHES TO SEE THE ESTATES AND LARGE RANCHES ATTRACTING MANY CELEBRITIES. 7 FOLIOS: 514002010240, 514002010410, 514002010411, 514002010440, 514002010420, 514002010430, 514002010413 6701 Sw 124th Ave, Southwest Ranches $24,000,000 ACTIVE Status #PRIME #LOCATION A HUGE PARCEL! NW CORNER OF SHERIDAN ST AND FLAMINGO ROAD. 48+/- ACRES! GREAT POTENTIAL! DRIVE AROUND LUXURIOUS SOUTHWEST RANCHES TO SEE THE ESTATES AND LARGE RANCHES ATTRACTING MANY CELEBRITIES.  \r\n7 FOLIOS: 514002010240, 514002010410, 514002010411, 514002010440, 514002010420, 514002010430,\r\n514002010413. 6701 Sw 124th Ave, Southwest Ranches $17,210,400 ACTIVE Status ⋅ 8 Beds ⋅ 12,467 SqFt. Welcome to Estate B, breathtaking contemporary masterpiece in the ultra-luxury enclave of AKAI Estates. Designed by world-acclaimed architect Vasco Vieira, this estate showcases over 25,333 sqft of seamless indoor-outdoor living. Striking private courtyard with reflective pond sets stage for grand entrance, while vanishing doors connect interior spaces to infinity-edge pool with an island and separate lounge terrace. Designed for gatherings, this estate offers an outdoor kitchen, fire pit lounge, and entertainment areas. Inside, residence features 8 Bedrooms, 8.5 Bath, Gym, Spa, Office, Family and Media rooms, and Service Suite, all adorned with elevated finishes and cutting-edge smart-home technology. Experience pinnacle of contemporary design and luxurious living within South Florida. 4761 Akai Dr, Southwest Ranches $15,450,000 ACTIVE Status ⋅ 6 Beds ⋅ 11,110 SqFt. PRE-CONSTRUCTION OPPORTUNITY | One of a kind modern estate designed by acclaimed Affiniti Architect,interiors by Jennifer Rosenthal Design. Nestled within the exclusive gated enclave of LANDMARK RANCH ESTATES,this remarkable 14,316 SF masterpiece offers a 11,110 SF of interior floor plan, boasting impressive ceilingheights of up to 24', and floor to ceiling glass walls that provide spectacular views of the expansive 2.3 acre siteand resort-sized pool. This is a True Estate property. The massive kitchen is completely equipped with top of theline Sub Zero and Wolf appliances, room sized pantry, summer kitchen, office, media+club room. By ownerbuilding soft costs not included. Contract price might be subject to contruction cost escalation. Completion: 24months from groundbreaking. 16825 Stratford Ct, Southwest Ranches $15,250,000 ACTIVE Status ⋅ 6 Beds ⋅ 11,041 SqFt. PRE-CONSTRUCTION OPPORTUNITY | One of a kind modern minimalist design by renowned Affiniti Architects, interiors by Jennifer Rosenthal Design. Nestled within the exclusive gated enclave of LANDMARK RANCH ESTATES, this remarkable 13,877SF masterpiece offers a 11,041SF of interior floor plan, boasting impressive ceiling heights, up to 24', and floor to ceiling glass walls that provide spectacular views of the expansive 2.6 acre cul-de-sac site and resort-sized pool, with canal and preserve views. This is a True Estate property. The massive kitchen is completely equipped with top of the line Sub Zero and Wolf appliances, room sized pantry, summer kitchen, office, media+club room. Contract price might be subject to construction cost escalation. Completion: 24 months from groundbreaking. 17025 Stratford Ct, Southwest Ranches $13,750,000 ACTIVE Status ⋅ 6 Beds ⋅ 13,619 SqFt. Rare opportunity to acquire a 4.8 Acre compound in prestigious gated Landmark Ranch Estates. Built in 2017, the grand 6-bed/6-bath +2 home features 13,000+ SF of spacious living over two floors with 15,000+ SF in total, with a floor plan designed for entertaining and big gatherings. With impressive 24-foot ceilings and floor to ceiling glass, the home allows for spectacular views of the impressive acre-sized backyard and resort sized pool. On the empty lot, you can build a new modern home, guest house, tennis court or simply expand on the current residence. Landmark Ranch Estates is a multi-acre private luxury gated residential community in SW Ranches. Located 20 minutes from Fort Lauderdale Airport and the beaches, don’t miss this opportunity. 16730 Stratford Ct, Southwest Ranches $12,399,000 ACTIVE Status ⋅ 6 Beds ⋅ 10,478 SqFt. Experience unparalleled luxury, sophistication, and modern design in this 10,478 sq ft estate, offering 12,618 sq ft of total covered space that seamlessly connects expansive indoor and outdoor areas. With six spacious bedrooms and eight elegant bathrooms, including a private master wing for ultimate relaxation, this home has been meticulously crafted for elevated living. Entertain in the cabana/rec room, home office, study, theatre, or formal and family rooms. The gourmet kitchen and discreet butler’s kitchen ensure every gathering is flawless. The \"finger-like\" architectural design creates serene courtyards and lush gardens, with trees rising through roof cutouts. Outside, enjoy the pool, spa, splash pad, and sports court. 5671 Sw 130th Ave, Southwest Ranches $12,000,000 ACTIVE Status ⋅ 9 Beds ⋅ 6,057 SqFt. This extraordinary, highly secure compound offers unparalleled luxury with every imaginable amenity. Featuring a huge lot with a stunning pool area complete with a covered gazebo, chef’s grill, and cabana bath, it’s perfect for both entertaining and relaxation. The property also includes a separate guest house and horse stables, ideal for discerning equestrian lovers, with a large equestrian center just one block away. Set on several acres of pristine land, this estate boasts 9 spacious bedrooms and 10.5 bathrooms, providing ample space for large families and visiting guests, all designed to accommodate a lifestyle of unparalleled comfort and sophistication 14305 Stirling Rd, Southwest Ranches $11,900,000 ACTIVE Status ⋅ 7 Beds ⋅ 8,718 SqFt. Presenting a monumental custom estate in Southwest Ranches, where no detail is overlooked. This 12,000+ sq.ft. architectural marvel, set on 2.25 acres, features 7 lavish bedrooms, 7 exquisite bathrooms, and 2 opulent half-baths, all masterfully crafted with an unrivaled commitment to perfection. Soaring ceilings and walls of glass bathe each room in natural light, highlighting rare stones and rich woods throughout. Inspired by the world's most elite resorts, this home boasts a sunken entertainment area, a resort-level pool oasis, and a state-of-the-art wellness center with a gym and steam room. Distinctive features include a car showroom theater, a weight-bearing parking area by the pool, and a hidden office overlooking the estate. Schedule a private tour today! 17900 Sw 70th Pl, Southwest Ranches $11,500,000 ACTIVE Status ⋅ 5 Beds ⋅ 3,320 SqFt. Welcome to Legacy Ranch, an unprecedented opportunity to acquire a private compound in the heart of prestigious Sunshine Ranches. Spanning approximately 4.67 acres, this exclusive offering includes three single-family residences, two barns, three pools, and two tranquil pond features, all tucked away on a quiet dead-end street. Bordering one of Florida’s most significant private estates, the property offers a rare blend of scale, privacy, and long-term upside. Whether you envision a custom trophy estate or development of multiple luxury homes, the potential is unmatched. Additional surrounding parcels may be available depending on offer terms, providing an opportunity to assemble a larger estate footprint. 5701 SW 134th Ave, Southwest Ranches $9,894,500 ACTIVE Status ⋅ 7 Beds One-of-a-Kind Estate Architectural Masterpiece – Designed by famed Affinity Architects, this 6BR, 6BA, 3HB estate situated on over 2 acres of land offers refined living with exceptional design. The flexible layout allows for 7+ bedrooms and multiple build-out options. A first-of-its-kind soaring grand hall for unforgettable entertaining, leading to an open-air covered outdoor kitchen and dining pavilion overlooking a pool, shaded lounge, and spa. Amenities include an optional wellness room with sauna, private movie theatre, 2 family rooms, staff quarters, mud room, tennis courts/equestrian range, and 2 laundry rooms. A 4-car garage plus guest parking ensures ample space. Every detail reflects quality craftsmanship, timeless style, and a seamless connection between indoor and outdoor living 17311 Sw 52nd Ct, Southwest Ranches $9,750,000 ACTIVE Status ⋅ 5 Beds ⋅ 7,618 SqFt. Luxury meets lifestyle at this Southwest Ranches Gem! This Brand New design-inspired estate offers +-10,000 SF of Indoor/Outdoor living space & sits on more than 2 acres. A true compound featuring privacy wall, automated gated entrances and 4 car garage. The interior features 5 spacious bedrooms, dedicated library/office, gym, club room, & 6.5 baths. Open-concept layout anchored by an iconic fireplace. The chef’s kitchen is a showstopper with Wolf appliances, 60” gas range, Cristallo countertops, & expansive prep and storage area. Cool off in your resort-style heated pool, raised spa, swim-up bar, & a fully equipped outdoor kitchen and enjoy a newly built basketball and pickleball court surrounded by lush landscaping. Southwest Ranches is the crown jewel of Broward County. Move in READY! 12701 Luray Rd, Southwest Ranches $9,250,000 ACTIVE Status ⋅ 6 Beds ⋅ 13,619 SqFt. Stunning 2.4 acre contemporary estate located in prestigious gated Landmark Ranch Estates. Built in 2017, this grand 6-bed/6-bath +2 home features 13,000+ SF of spacious living over two floors with 15,000+ SF in total, with a floor plan designed for entertaining and big gatherings. With i 24-foot ceilings and floor to ceiling glass, the home allows for spectacular views of the impressive acre-sized backyard and resort sized pool. Landmark Ranch Estates is a multi-acre private luxury gated residential community in SW Ranches. Located 20 minutes from Fort Lauderdale Airport and the beaches, don’t miss this opportunity. 16720 Stratford Ct, Southwest Ranches $9,200,000 ACTIVE Status ⋅ 6 Beds ⋅ 8,000 SqFt. The spectacular Delano Contemporary estate is nestled within the exclusive gated enclave of LANDMARK RANCH ESTATES. This remarkable 11,408sf masterpiece offers 8,000sf of A/C two-story floor plan, providing impressive ceilingheights of up to 27', and floor to ceiling glass walls that allow for grand views of the expansive landscaped acre-sized yards and over-sized pool. This is a true Estate property. The open format kitchen is completely equipped with top of the line Sub Zero and Wolf appliances, room sized pantry, summer kitchen, among manyother features. The second story, boasts a additional laundry room, morning bar, plus a dedicated loft and outdoor terraces. All this, while still being minutes from Miami, FLL and Boca. Pre-construction, 24 mos. to complete. Shown with site upgrades. 16700 Berkshire Ct, Southwest Ranches $8,999,000 ACTIVE Status ⋅ 4 Beds ⋅ 3,076 SqFt. ***A ONCE-IN-A-LIFETIME OPPORTUNITY ON PRESTIGIOUS HANCOCK ROAD!!!*** WELCOME TO ONE OF THE LAST REMAINING MULTI-ACRE ESTATES ON COVETED HANCOCK RD IN SUNSHINE RANCHES! SPANNING 8.46 ACRES+/-,THIS RARE OFFERING COMBINES EXCLUSIVITY,SCALE&UNMATCHED POTENTIAL. DON’T LET THE RURAL CHARM FOOL YOU,SW RANCHES IS QUICKLY BECOMING THE “HAMPTONS OF SOUTH FLORIDA,”W/OVER 18 MEGA MANSIONS CURRENTLY BUILT,IN FOR PERMIT,OR UNDER CONSTRUCTION. THIS PROPERTY BOASTS 294' OF FRONTAGE& 1,251' OF DEPTH, W/A PICTURESQUE OAK TREE-LINED D/W WELCOMING YOU HOME. IT'S HIGH AND DRY,W/CITY WATER &NO WETLANDS-AN IDEAL CANVAS TO DEVELOP. EXISTING 3,076 SF HOME (4BD/3BA) IS BEING SOLD AS-IS. REPLATTING ALLOWS FOR DIVISION INTO 3 BUILDABLE LOTS (MINIMUM 2 ACRES EACH),MAKING THIS A IDEAL FOR A DREAM-HOME/FAMILY COMPOUND. 5400 HANCOCK ROAD, Southwest Ranches $8,999,000 ACTIVE Status ***A ONCE-IN-A-LIFETIME OPPORTUNITY ON PRESTIGIOUS HANCOCK ROAD!!!*** WELCOME TO ONE OF THE LAST REMAINING MULTI-ACRE ESTATES ON COVETED HANCOCK RD IN SUNSHINE RANCHES! SPANNING 8.46 ACRES+/-,THIS RARE OFFERING COMBINES EXCLUSIVITY,SCALE&UNMATCHED POTENTIAL. DON’T LET THE RURAL CHARM FOOL YOU,SW RANCHES IS QUICKLY BECOMING THE “HAMPTONS OF SOUTH FLORIDA,”W/OVER 18 MEGA MANSIONS CURRENTLY BUILT,IN FOR PERMIT,OR UNDER CONSTRUCTION. THIS PROPERTY BOASTS 294' OF FRONTAGE& 1,251' OF DEPTH, W/A PICTURESQUE OAK TREE-LINED D/W WELCOMING YOU HOME. IT'S HIGH AND DRY,W/CITY WATER &NO WETLANDS-AN IDEAL CANVAS TO DEVELOP. EXISTING 3,076 SF HOME (4BD/3BA) IS BEING SOLD AS-IS. REPLATTING ALLOWS FOR DIVISION INTO 3 BUILDABLE LOTS (MINIMUM 2 ACRES EACH),MAKING THIS A IDEAL FOR A DREAM-HOME/FAMILY COMPOUND. 5400 HANCOCK ROAD, Southwest Ranches $8,500,000 ACTIVE Status ⋅ 5 Beds ⋅ 5,364 SqFt. **EXPERIENCE TIMELESS LUXURY IN THIS EUROPEAN SPANISH-STYLE VILLA.*** NESTLED IN THE PRESTIGIOUS HEART OF SUNSHINE RANCHES, THIS BREATHTAKING 5-BEDROOM 7-BATH ESTATE BLENDS CLASSIC ELEGANCE WITH MODERN SOPHISTICATION. FROM THE MOMENT YOU STEP INSIDE, SOARING HIGH-VOLUME CEILINGS, EXPANSIVE PORCELAIN FLOORS AND WALLS OF FLOOR-TO-CEILING GLASS FLOOD THE HOME WITH NATURAL LIGHT & PANORAMIC VIEWS. THE GOURMET CHEFS KITCHEN FLOWS SEEMLESSLY INTO INVITING LIVING AND LOUNGING AREAS-PERFECT FOR HOSTING GATHERINGS WITH FAMILY & FRIENDS. STEP OUTSIDE TO A COVERED PATIO COMPLETE WITH A FULLY EQUIPPED SUMMER KITCHEN, OVERLOOKING LUSH TROPICAL GARDENS AND A RESORT-STYLE POOL OASIS THAT INVITES YEAR-ROUND RELAXATION. THIS EXCEPTIONAL RESIDENCE IS MORE THAN A HOME-IT'S A LIFESTYLE. 5801 Estates Dr, Southwest Ranches $7,912,000 ACTIVE Status ⋅ 8 Beds ⋅ 1,796 SqFt. Pre-Construction custom mansion (approx. 8,000 sq feet living space) on a 3.41 acre gated and fenced private compound in very exclusive Sunshine Ranches. Current plans include ready to build 5 bed/5 bath, office, GYM, 4 car garage Mediterranean dream home on of the highest elevations in area. Full concrete construction on both floors, elevator, massive 22' windows in great room, complete spa area etc.  Plans can easily be modified to accommodate an 8 bed/7 bath home instead. Pristine grounds with plenty of room for horse stables, tennis court, basketball court etc. No HOA, city water, exotic fruit trees. Property already has a very nice 3 bed/2 bath home that you can live in while construction takes place. 6500 Volunteer, Southwest Ranches $7,500,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,514 SqFt. Rare  nearly 10 Acre property in Southwest Ranches. This expansive 9.65-acre lot offers cleared and semi-filled land, perfect for development, a nursery, or a horse ranch. Included is a fully remodeled 4 bed, 3 bath home and a 2,000 sq ft two-story Barn/Workshop. Updates include new tile floors, a contemporary kitchen with quartz countertops and stainless steel LG Studio appliances, renovated bathrooms, recessed lighting, sleek linear AC vents, and two new AC units with smart Nest thermostats. Fresh paint and redone stucco enhance the exterior, along with a new septic tank & electric gate. Potential to subdivided into 4 lots, buyer due diligence required, buyer responsible to confirm all information with the town of Southwest Ranches. 6800 SW 172nd Ave, Southwest Ranches $7,500,000 ACTIVE Status Rare nearly 10 Acre property in Southwest Ranches. This expansive 9.65-acre lot offers cleared and semi-filled land, perfect for development, a nursery, or a horse ranch. Included is a fully remodeled 4 bed, 3 bath home and a 2,000 sq ft two-story Barn/Workshop. Updates include new tile floors, a contemporary kitchen with quartz countertops and stainless steel LG Studio appliances, renovated bathrooms, recessed lighting, sleek linear AC vents, and two new AC units with smart Nest thermostats. Fresh paint and redone stucco enhance the exterior, along with a new septic tank & electric gate. Potential to subdivided into 4 lots, buyer due diligence required, buyer responsible to confirm all information with the town of Southwest Ranches. 6800 SW 172nd Ave, Southwest Ranches $6,999,999 ACTIVE Status SUNSHINE RANCHES 10 GROSS ACRES (2 PARCEL'S) (9.4 TOTAL NET ACRES)**BUILD LUXURY DREAM ESTATE** PARTIAL HOUSE PAD & CARETAKER QUARTERS ON PROPERTY**\r\nALSO AVAILABLE 2.5 & 5 ACRE PARCELS AVAILABLE AS WELL** 12850 Luray Road, Southwest Ranches $6,999,999 ACTIVE Status 4.95-Acre Property in SW Ranches—turnkey business to fund your dream home construction. Includes a Bougainvillea Nursery, sheep farm, pergolas, fountains, electronic gate, 5,000 sq ft event barn, bride/groom cottages, outdoor church, bell fountain, 2 office trailers, and 1,800 sq ft storage barn. Comes with plans for a 10,000 sq ft mansion with 1,200 sq ft guest house. Fully licensed with Agricultural benefits and Agritourism protections. 4680 SW 148 AVE, Southwest Ranches $6,995,000 ACTIVE Status ⋅ 6 Beds ⋅ 8,088 SqFt. Located on 2.3 acres in the prestigious Southwest Ranches community, this 9,000+ sq ft modern estate blends resort-style amenities with sleek design. The home features 6 spacious bedrooms, 7 bathrooms, a home theater, private gym, and a bright open layout with soaring ceilings and designer finishes. Outdoors, enjoy a stunning pool, full basketball court, batting cage, and plenty of space to entertain or relax in total privacy. A rare opportunity to own a contemporary masterpiece with unmatched amenities in one of South Florida’s most exclusive neighborhoods. 13441 Mustang Trl, Southwest Ranches $6,675,000 ACTIVE Status ⋅ 7 Beds ⋅ 6,273 SqFt. This exceptional property in the desirable Southwest Ranches neighborhood offers nearly 10,000 sq. ft. of luxurious living space. Boasting 7 bedrooms, 8 bathrooms, and situated on almost an acre of land, this contemporary masterpiece is designed for modern elegance and spacious living. A rare opportunity to customize your dream home while enjoying serene surroundings and upscale living. 2026 delivery. 16684 Sw 59th Ct, Southwest Ranches $6,500,000 ACTIVE Status Rare offering: NO POWER LINES! Nearly 8 acres of flat, cleared, and fully fenced land in prestigious Southwest Ranches. Enjoy privacy, quietness and security with access via a semi-private road and no overhead power lines. This pristine canvas offers enormous value—land prep is complete, saving time and hundreds of thousands in development costs. Nearly 100% usable land with minimal wetlands making the potential to create your own private retreat. Ideal for a multigenerational estate, serene family compound or potential to subdivide into 1 acre lots. Land is surrounded by residential only - with incredible community adjacent of multimillion dollar residences. This opportunity is unmatched tranquility, value and potential. Survey available (2017) 17100 Sw 54th St, Southwest Ranches $6,000,000 ACTIVE Status ⋅ 8 Beds ⋅ 9,201 SqFt. Luxury new construction in the prestigious Stone Creek of Southwest Ranches! This modern estate sits on 2.5 acres and offers over 9,200 Sq Ft under A/C. Designed for both elegance and functionality, the home will feature 8 bedrooms, 8.5 bathrooms, playroom, family room, gym, sport bar/flex space, elevator, and two laundry rooms. The chef’s kitchen offers dual islands, walk-in pantry, high-end appliances, upstairs kitchenette. The master suite is a private retreat with terrace and two oversized walk-in closets. With permits in place and construction underway, this is a rare opportunity to customize your dream home in one of South Florida’s most desirable communities. The sky is the limit with this truly exceptional estate. 5600 SW 128th Ave, Southwest Ranches $5,800,000 ACTIVE Status ⋅ 5 Beds ⋅ 5,424 SqFt. Live like royalty in Southwest Ranches at this exquisite equestrian estate located on the prestigious Hancock Road, known as one of the most coveted addresses in South Florida.\r\nDubbed the “Florida Hamptons”, this home boasts 5 bedrooms, 5 bathrooms, soaring ceilings, and a separate 1-bedroom guest home. Designed for luxury entertainment, enjoy a custom-designed pool, outdoor bar, basketball court, mini-golf, and a veranda that’s perfect for sunset soirées.\r\nAn air-conditioned multipurpose space offers endless potential—convert it into a recording studio, gym, office, or man cave, sports training area. Virtual staging for reference only. \r\nStep into a lifestyle where equestrian trails, celebrity neighbors, and serene sophistication converge. 6320 Hancock Rd, Southwest Ranches $5,795,000 ACTIVE Status ⋅ 5 Beds ⋅ 8,127 SqFt. Improved Price! This country living oasis, 1 mile from grocers, restaurants, and 15 minutes from Ft Lauderdale was built in 2023, sits on 2.78 acres in the heart of Southwest Ranches, an equestrian community. It is an interior lot, off the road, private and quiet. The gated entry opens up to a 2/2 guest house, renovated in 2019, perfect for guests. The oversized rear deck overlooks the gazebo on the pond, horse pastures and tiki hut, great for casual entertaining. The courtyard style main home wraps around the modern saltwater pool and spa, with ample area for seating, lounging, and relaxing. There is a free-standing wine cooler. Custom cabinetry throughout. The home has 9 seats theater, oversized playroom, gym, 3 bedrooms, 6 bathrooms, and 2 offices that can convert to 2 more bedrooms. 13500 Stirling Rd, Southwest Ranches $5,500,000 ACTIVE Status ⋅ 6 Beds ⋅ 8,120 SqFt. Welcome to this newly constructed masterpiece by Toll Brothers,nestled in the prestigious Rolling Oaks neighborhood of SWR.Situated on two sprawling acres,this sleek and modern estate spans over 8500 sq.ft of luxurious living space. 6BD & 7.5BA, this homes offers both comfort and sophistication. It features two grand primary suites-one on each floor- each with its own lavish bathroom. The open floor plan showcases a seamless flow between living,dining and entertainment areas, highlighted by soaring ceilings, exquisite chandeliers, and a striking glass-railed staircase. Upstairs, a media room and mini bar, while downstairs, a wine cellar awaits. Four -car garage provides ample space. This estate blends elegance and functionality, ideal for those who appreciate equestrian living and privacy. 17811 Sw 58th St, Southwest Ranches $5,500,000 ACTIVE Status ⋅ 7 Beds ⋅ 5,515 SqFt. PRIME AGRICULTURAL LOCATION Currently Zoned AG Perfect for Equestrian Center/Lg. Animal Vet/Farming- Property fully fenced; 12 stall pole barn w/electric/plumbing, & feed room; groom qtrs & storage in CBS building w/electric, water, & septic tank; 10 stall pole barn w/breezeway-open pole barn for storage; workshop/machine shop w/220 outlet w/electric, sink w/water, 2 40' containers w/shelving on 2 sides, 2 pull down garage doors, concrete floor; paddock; storage shed elevated on cinder blocks ** 2 ATTACHED HOUSES 2006 Metal Roof w/tongue & groove treated wood. 4/3 SFR Pecan paneling; Pecky cypress walls; RiverRock Fireplace; Professional ballet studio; formal dining & living room; great room; & more 2nd home 3/2- SFR newer kitchen/bathrooms NO DEVELOPERS-sold w/folio 504032040018 per PDR 5901 Sw 160th Ave, Southwest Ranches $5,385,000 ACTIVE Status ⋅ 5 Beds ⋅ 4,663 SqFt. A Rare ~4.5 Acre Estate Opportunity in South Florida!! Modern Luxury with Expansion Potential\r\nown one of Southwest Ranches most exceptional properties with a private ~4.5 acre estate featuring a stunning modern 5 bedroom and 4.5 bathroom residence which includes a separate fully appointed guest house. This offers the perfect blend of space, style, and seclusion. What makes this property truly unique is the inclusion of a separate, buildable vacant lot next door which is ideal for new construction, future investment, or multi-generational living. Whether you’re looking to build a second home or simply hold onto a rare piece of land in South Florida's rapidly disappearing open space the possibilities are endless! The home is offered separately at $3,495,000.  OPEN HOUSE SATURDAY & SUNDAY!! 17490 Sw 70th Pl, Southwest Ranches $5,300,000 ACTIVE Status ⋅ 6 Beds ⋅ 8,392 SqFt. Don’t miss this one-of-a-kind majestic gated estate in sought-after Rolling Oaks, Southwest Ranches! This impressive 6-bedroom, 6-bath ranch-style home with high volume ceilings, sits on 5 beautifully maintained acres and offers the ultimate in privacy, space, and lifestyle. Enjoy the spectacular tropical resort pool and patio area, and a large gazebo—perfect for entertaining! The property also includes a professionally built CBS stables with two upstairs apartments—a 2 bed/1 bath and a 1 bed/1 bath—ideal for guests or staff. Whether you're looking to entertain, relax, or live the equestrian lifestyle, this palatial estate has it all. A rare opportunity—schedule your private tour today! 6200 SW 183rd Way, Southwest Ranches $5,295,000 ACTIVE Status ⋅ 8 Beds ⋅ 7,966 SqFt. Discover this extraordinary private oasis located within Southwest Ranches. This modern estate sits on 2.5 acres and boasts 8 BEDS and 7.5 BATHS across the main residence and private guest house. Newly constructed in 2018, the residence has top of the line finishes including marble and wood flooring throughout. The gourmet kitchen is a chef’s dream and features Wolf and Sub-Zero appliances. Entertain effortlessly in the expansive and private outdoor area that includes a state-of-the-art pool, summer kitchen, and ample space for lounging and dining. The estate is secured by two private gates and includes a gorgeous porte-cochère and 6-car garage. All Impact Glass throughout. Brand new Turf rooftop. EV charger for your electric cars. No HOA. 4610 Sw 178th Ave, Southwest Ranches $5,295,000 ACTIVE Status ⋅ 6 Beds ⋅ 6,258 SqFt. Mediterranean Elegance Meets Old-World Charm in Landmark Ranch Estates. A rare gem in South Florida’s premier gated enclave, home to just 44 custom estates and a discreet roster of celebrity neighbors.This Mediterranean-inspired masterpiece sits on 2.3acres of lush, resort-style grounds, offering timeless style and sophistication. From the moment you arrive, the old-world charm is unmistakable custom millwork, and rich architectural details echo the elegance of a European villa.  6 bedrooms + office/den, 7 bathrooms, and private maid’s quarters. Entertain in the billiard/bar lounge, outdoor kitchen or unwind by the heated pool or on your private putting green.This is more than a home, it’s a lifestyle. All this exceptional property needs is YOU. 16740 Berkshire Ct, Southwest Ranches $5,000,000 ACTIVE Status ⋅ 5 Beds ⋅ 6,000 SqFt. Hurry half way built!!! New Construction Luxury Home in Southwest Ranches\r\nThis stunning 5-bedroom, 6-bathroom estate on over 2 acres offers unmatched luxury and\r\nprivacy. With the ability to choose your colors and cabinetry, you can personalize this home\r\nto your liking. Features include an office that can be converted into a 6th bedroom, 2 safe\r\nrooms, a gourmet kitchen with gas appliances, inground pool, summer kitchen, 3-car\r\ngarage, hurricane impact windows and doors, and a cozy fireplace. Enjoy the ultimate in\r\ncomfort and security in this beautiful, brand-new home. Pick your colors and flooring before it's to late. 17510 Sw 48th St, Southwest Ranches $4,750,000 ACTIVE Status ⋅ 7 Beds ⋅ 6,744 SqFt. Welcome to your dream retreat nestled within coveted SW Ranches. Serene, gated, pristine estate sprawls across 2.42 ac of lush, manicured land w mature exotic trees, offering privacy & luxury. Floor to ceiling impact windows & French doors line the dbl heighted first floor creating a seamless blend of indoor-outdoor living. Over 7000 sf of AC living space; home exudes sophistication & comfort. Estate's façade is wrapped in natural coral rock blending an organic exterior/modern interior in this newly updated home that has 7 bedrooms with walk-in closets & 8 full spa-like baths & 2 half baths. The floor plan offers a Chef's kitchen w subzero/Wolf/Miele built-in appliances, theater, office, gym, fireplace, library, game room and built-in wet bar. Huge Pool & Cabana with full utilities & deck. 5800 Sw 178th Ave, Southwest Ranches $4,700,000 ACTIVE Status ⋅ 7 Beds ⋅ 5,007 SqFt. Gated 2.3 acre estate in exclusive Sunshine Ranches offering unmatched privacy, space, and tropical luxury. This 7 bedroom, 6.5 bath hacienda style residence (including a den) also features a separate office, wood and tile flooring, crown molding, and generous living areas filled with natural light. The fully fenced grounds are a true tropical paradise professionally landscaped with over $300K in mature palms, exotic plants, and fruit trees, plus over $20K in custom outdoor lighting. Outdoor highlights include an expansive travertine deck, scenic walking trails, and a tiki hut overlooking a serene private lagoon. Additional features include a 4 car garage, whole house generator, 500 gallon underground propane tank, and security cameras. A rare find in prestigious Southwest Ranches. 14211 Sunset Ln, Southwest Ranches $4,599,000 ACTIVE Status ⋅ 5 Beds ⋅ 5,850 SqFt. Set on an absolutely stunning and private 2.34-acre lot in the heart of Sunshine Ranches, this estate offers a rare blend of luxury, space, and tranquility. Surrounded by lush landscaping with a true Zen garden feel, paved walkways, and a beautiful entrance waterfall pond, the property is a secluded oasis. The 5-bedroom home includes an office, maid’s quarters, and 4.5 bathrooms, with marble flooring throughout, bamboo floor family room, a formal living and dining room with fireplace, and a custom billiard and bar area. The chef’s kitchen features an oversized island and high-end appliances. The grand master suite includes dual spa-style bathrooms and his-and-hers closets. Enjoy a resort-style pool and spa, two gazebos, a full-size lighted tennis court, and complete privacy throughout. 14641 MUSTANG TRAIL, Southwest Ranches $4,500,000 ACTIVE Status ⋅ 7 Beds ⋅ 7,895 SqFt. A stunning 2021-built estate by Toll Brothers, offering nearly 8,000 sq ft of modern elegance on a private 1-acre lot in Southwest Ranches.\r\n\r\nA grand two-story entry and lush landscaping invite you inside to a bright, open floorplan featuring 7 bedrooms, 8 full baths, two half-baths, and soaring ceilings. The chef’s kitchen boasts JennAir appliances, a massive island, and custom cabinetry, seamlessly connecting to expansive living and dining spaces.\r\n\r\nEnjoy entertaining at the full wet bar or outdoors by the heated zero-entry saltwater pool with a sun shelf and summer kitchen. An elevator, 3-car garage, smart-home tech, and serene views complete this offering.\r\n\r\nSet in a community near Weston, Davie, and top schools, a rare chance to own luxury without the wait. 17130 Magnolia Estates Dr, Southwest Ranches $4,499,900 ACTIVE Status ***5 PRIME ACRES IN SUNSHINE RANCHES!!!*** LIVE AMONGST THE GIANTS IN HIGHLY SOUGHT-AFTER SUNSHINE RANCHES IN ONE OF THE MOST PRESTIGIOUS NEIGHBORHOODS IN BROWARD COUNTY! RECENTLY DUBBED “THE HAMPTONS OF SOUTH FLORIDA”, SOUTHWEST RANCHES IS OFFICIALLY ON THE MAP WITH OVER 16 MEGA MANSIONS CURRENTLY UNDER CONSTRUCTION, ALREADY BUILT OR IN FOR PERMIT WITH OVER 19,000 SQFT... THIS SECTION OF SOUTHWEST RANCHES HAS A STAGGERING RECENT SALE EXCEEDING 22 MILLION+ AND ANOTHER MEGA MANSION THAT IS CURRENTLY PENDING AT 17 MILLION! ALL THE LEG WORK IS ALREADY DONE, THIS LOT IS READY TO DEVELOP! THE SURVEY IS ALREADY DONE AND THERE ARE \"NO WETLANDS\" ON THE PROPERTY! DESIGN AND BUILD YOUR DREAM HOME OR COMPOUND...OR DIVIDE INTO TWO (2) 2.42 ACRE +/- BUIDABLE LOTS. YOU HAVE SEVERAL OPTIONS! 6301 APPALOOSA TRAIL, Southwest Ranches $4,475,000 ACTIVE Status ⋅ 6 Beds ⋅ 6,112 SqFt. Sited on nearly 2-acres in the Estate Section, this 8,084± total sq ft residence with guest house offers the ultimate rural retreat. Updated with a sophisticated modern European aesthetic, this 4-Bedroom residence & separate 2-bedroom guest house, complete with a full kitchen, living & laundry, is perfect for hosting visiting family/guests. Luxe chef's kitchen, with adjoining pool-view breakfast room, has work island & dining extension, finished with exotic zebra-wood cabinetry & professional-grade appliances. The master suite offers pool-courtyard access, a spa-like quartz bathroom with jetted tub, double vanities, walk-in shower, separate steam room & water closet. Privately hedged & gated this estate appeals to equestrians, nature enthusiasts, and VIP's seeking privacy. 2024 Metal Roof 6901 Holatee Trl, Southwest Ranches $3,999,900 ACTIVE Status ⋅ 4 Beds ⋅ 4,146 SqFt. ***THIS TURNKEY EQUESTRAIN OPERATION ON 2.35 ACRES IS A HORSE LOVER'S PARADISE!!!*** EXCEPT FOR THE SHELL, EVERY COMPONENT OF THE HOUSE IS NEW! FINALIZED W/4 BEDROOMS,3.5 BATHS, NEW 3 CAR GARAGE & PORTE COCHERE. NEW MODERN INTERIOR TASTEFULLY DONE W/DESIGNER KITCHEN AND NAME BRANDS APPLS. NEW POOL/SPA W/PAVERS, COMPLETED W/NEW PERGOLA/SUM KIT. NEW ROOF & ALL IMPACT GLASS. 3 BARNS-TOTAL OF 10 STALLS & A STATE OF THE ART ARENA (142'X200') W/SUPERIOR FOOTING,EXCELLENT DRAINAGE,IRRIGATION & FLY SPRAY SYSTEM. FULL TACK & SEPARATE FEED RMS W/EXTRA STORAGE. FORTIFIED W/FENCING AND COLUMNS, CIRCULAR D/W W/DOUBLE GATED ENTRY. MATURE LANDSCAPING & TROPICAL FOLIAGE HIGHLIGHTS THIS CHARMING COUNTRY STYLE RANCH HOME. FULL BACK-UP GENERATOR. COMPLETED W/RELAXING POND, WATERFALL, FRUIT TREES & MUCH MORE. 13211 MUSTANG TRL, Southwest Ranches $3,990,000 ACTIVE Status PRIME Southwest Ranches Opportunity! This exceptional 3.25-acre corner lot, perfectly positioned at Melaleuca Road and Luray Road, offers an unparalleled canvas for your dream estate. Enter through a private, gated entrance framed by majestic mature oaks, setting the tone for the exclusivity within. Located in one of Broward County’s most coveted and fastest-growing luxury enclaves—home to elite athletes, entertainers, and top-tier executives—this property is a rare find in a market with virtually no supply of premium buildable lots. Unlike most parcels in the area, this property is being upgraded with city water access—saving time and expense—and that installation is nearing completion. Architectural and engineering plans for a custom estate are available to qualified purchasers. 6541 Melaleuca Rd, Southwest Ranches $3,970,000 ACTIVE Status ⋅ 6 Beds ⋅ 5,216 SqFt. Welcome to this stunning 2022-built estate in the exclusive Circle S Estates, a private community of just 42 modern homes. Nestled on a 1-acre fully fenced lot, this two-story home offers 6 BD, 4.5 BA, and a separate in-law quarters. Inside, you're welcomed by soaring 30-ft volume ceilings, marble floors throughout, ultra-modern finishes, and abundant natural light. The primary suite is conveniently located on the 1st floor. The large backyard offers ample space to add a pool and summer kitchen. Designed for both luxury and privacy, the home also features tinted impact windows and a high-resolution camera system. This is a rare opportunity to own in one of the most sought-after communities. Schedule your showing today! Also available for lease! 15846 Sw 49th St, Southwest Ranches $3,950,000 ACTIVE Status ⋅ 5 Beds ⋅ 4,000 SqFt. Welcome to this ultra-luxury estate in prestigious Southwest Ranches, set on 2.03 meticulously maintained acres. Fully renovated with no expense spared, this exceptional property is a true masterpiece. The estate includes 8 horse stables & a separate 4,000 sqft garage featuring a private upstairs office with A/C, ideal for conversion into a guest house and another 1,000 sqft garage/storage area. The main residence spans 4,000 sq ft under air and showcases 5 bedrooms, 4 bathrooms, impact windows, a redesigned private gated driveway, and a laundry/utility/mudroom for added functionality. Step outside to your private resort-style oasis, complete with a large pool, Brazilian teak wood ceilings, a summer kitchen, a pool house, and a stunning two-story tiki hut with electric and lighting. 6300 SW 190th Ave, Southwest Ranches $3,700,000 ACTIVE Status ⋅ 7 Beds ⋅ 5,920 SqFt. LOCATION LOCATION LOCATION FOR HORSE LOVERS-Property has gate access to Sunshine Ranches Equestrian Park; 12 stall barn with tack & storage room; round ring; 2 paddocks; 2 wash station; separate mare/foal stall can also be used as chicken coop; In-Law cottage w/2 car garage; lovely mature trees and foliage; beautiful pond w/gazebo; *CONSERVATIVE EASEMENT AGREEMENT W/BROWARD COUNTY CONVEYS-BUYER MUST INCLUDE SIGN/NOTARIZE AFFIDAVIT W/OFFER STATING THEY ACKNOWLEDGE & COMPLY W/USEAGE... Build your dream home on this beautiful property! The 3370 sf home can't be accessed for showings/inspections until owner vacates.Two months post occupancy required. Access at closing/funding only. HORSES & EQUIPMENT DO NOT CONVEY All information deemed accurate but not guaranteed; Buyer to verify. 14490 Stirling Rd, Southwest Ranches $3,650,000 ACTIVE Status ⋅ 5 Beds ⋅ 3,854 SqFt. Luxurious Southwest Ranches Estate, 2.5 acres approximately in a private gated lot.  Main House and guest house.  Chef kitchen, new A/C unit, high impact windows.  Beautiful pool and patio with built in BBQ. Sauna in the master bathroom. 5121 Sw 210th Ter, Southwest Ranches $3,499,900 ACTIVE Status ⋅ 5 Beds ⋅ 3,246 SqFt. EQUESTRIAN ESTATE IN SUNSHINE RANCHES- one of South Florida’s most prestigious communities *This fully renovated 5 bed/4 bath estate offers over 5,320 square feet under air, that includes a 620 SF guest house and 1,600+ SF air-conditioned building. Natural light and open living, new impact windows, a brand-new standing seam metal roof. Full video surveyance. Outdoor with a resort-style pool, expansive gazebos for entertaining, and professional landscaping with full irrigation system. Private electric gate, complete equestrian facilities with stables, dedicated feed and tack room, paddocks, two covered wash racks, a half-acre professional riding arena, storage and much more… 5360 Volunteer Rd, Southwest Ranches $3,499,000 ACTIVE Status SUNSHINE RANCHES 4.7 NET ACRES**BUILD YOUR LUXURY DREAM HOME** ON THIS 5 GROSS ACRE LOT** 2.5  ACRE LOTS & 10 ACRES ALSO AVAILABLE** 12840 Luray Road, Southwest Ranches $3,450,000 ACTIVE Status First Time on the Market – A Unique Opportunity in the Rolling Oaks section of Southwest Ranches - 5 Acres Available area to build your Dream Estate - Featuring an Ancient Fishing and Hunting Camp Archeological Site - Offering a Rare Opportunity to Incorporate a Private Nature Park as part of your new Luxury Estate. Property is ideal for a Custom Residence Complex with Guest House and Amenities such as Tennis Court, Putting Green, Horse Stables and much more. A Special Land Blending Cultural Heritage with Modern Development Potential. Call today for more information and a private tour. 66 SW Street, Southwest Ranches $3,399,000 ACTIVE Status ⋅ 5 Beds ⋅ 4,177 SqFt. 13431 Old Sheridan 13431 Old Sheridan St, Southwest Ranches $3,299,000 ACTIVE Status ***OVER 4.5 ACRES OF LAND IN HIGHLY SOUGHT AFTER ROLLING OAKS ESTATES!!!*** FOR THOSE TIRED OF LIVING THE CITY LIFE, HATE LIVING UP NORTH OR LOOKING TO BUILD A PRIVATE COMPOUND…THIS PROPERTY IS FOR YOU! THIS LOT IS FULLY WETLAND FREE, CLEAR OF TREES AND READY FOR CONSTRUCTION. OFFERING THE POTENTIAL TO SPLIT INTO TWO LOTS AND BUILD TWO HOUSES, THIS LOT IS AN IDEAL INVESTMENT OPPORTUNTY. WITH PLOT COVERAGE UP TO 10% IN THE ROLLING OAKS COMMUNITY, THERE ARE ENDLESS POSSIBILITIES FOR YOUR VISION. YOU CAN BUILD YOUR DREAM HOME AND STILL HAVE PLENTY OF ROOM FOR YOUR GUEST HOUSE, BARN, GARAGES, ANIMALS, RIDING ARENA, ETC. 5101 SW 178 AVE, Southwest Ranches $3,225,000 ACTIVE Status ⋅ 6 Beds ⋅ 6,035 SqFt. DISCOVER THE ULTIMATE COUNTRY LIFESTYLE AT SUNSHINE RANCHES! THIS 6-BED, 6-BATH ESTATE SPRAWLS ACROSS 2.16 ACRES, BOASTING A GRAND MASTER WING WITH A LIVING AREA, BAR, AND WALK-IN CLOSET. THE GOURMET KITCHEN FEATURES EXOTIC GRANITE, CHERRY WOOD CABINETS, AND HIGH-END APPLIANCES. ENJOY CHISELED EDGE MARBLE FLOORS, HI-TECH SECURITY, AND A DETACHED 1-BED GUEST HOUSE WITH A 4-CAR GARAGE. OUTSIDE, A COVERED PATIO, NEW DECK, AND POOL AREA AWAIT, ALL SECURED BY IMPACT GLASS. WITH A GAS GENERATOR, RESORT-STYLE PAVILION, AND AMPLE STORAGE, THIS PROPERTY EPITOMIZES LUXURY COUNTRY LIVING. 14701 SUNSET LN, Southwest Ranches $2,999,900 ACTIVE Status ⋅ 6 Beds ⋅ 3,059 SqFt. ***COMPLETELY REMODELED FROM HEAD TO TOE, FOR THOSE STILL ENJOYING THE EQUESTRAIN LIFESTYLE SOUTHWEST RANCHES HAS TO OFFER!!!*** NESTLED ON 1.85 ACRES, FULLY FENCED IN &GATED PROPERTY CHECKS ALL THE BOXES. GREETED BY A BEAUTIFUL FRONT POND W/FOUNTAIN &WINDING DRIVEWAY. TOTALING OVER 5,500 SQFT,THE MAIN HOUSE FEATURES 4 BEDRMS/2 BATHS,OVERSIZED 4 CAR GARAGE W/ A/C & ROOM FOR CAR LIFTS. GOURMET KITCHEN W/HUGE ISLAND,S/S APPL PACKAGE &WATERFALL EDGES. NEWER ROOF,ALL NEW IMPACT GLASS,FLOORING &BATHRMS. SCREENED-IN POOL. ATTACHED 2 BEDRM/1BATH APARTMENT W/KITCHEN, LIVING RM W/SEPARATE PRIVATE ENTRANCE. REMODELED 4 STALL CBS BARN W/TACK/FEED ROOM/OFFICE & AN ATTACHED COVERED 45’ X 40’ ARENA FOR THE RIDING ENTHUSIAST OR SPORTS COURT. ADDITIONAL STORAGE SHED W/ELECTRICITY TO STORE YOUR EQUIPMENT. 5790 MELALEUCA RD, Southwest Ranches $2,999,500 ACTIVE Status ⋅ 6 Beds ⋅ 5,647 SqFt. ***LUXURY CUSTOM-BUILT ESTATE*** NESTLED ON OVER 2 ACRES IN THE PRESTIGOUS TOWN OF SOUTHWEST RANCHES. DESIGNED FOR BOTH COMFORT AND ELEGANCE, THIS HOME FEATURES A NEWER ROOF AS WELL AS A THOUGHTFULLY DESIGNED TRIPLE SPLIT FLOOR PLAN, OFFERING PRIVACY AND SEAMLESS FLOW. ENTERTAIN WITH THE OPEN-CONCEPT KITCHEN WHICH SEAMLESSLY CONNECTS TO THE FAMILY ROOM AND BAR AREAS. EXQUSITE MARBLE & WOOD FLOORING THROUGHOUT. RELAX IN THE THEATRE, STEAM SHOWER OR RESORT STYLE POOL/SPA WITH TRAVERTINE DECKING. THIS HOME EMBODIES TIMELESS SOPHISTICATION ALL THE WHILE ENHANCED BY TRANSITIONAL ARCHITECTURE. 5941 SW 185th Way, Southwest Ranches $2,995,000 ACTIVE Status ⋅ 7 Beds ⋅ 5,758 SqFt. Fully fenced and gated 2.2-acre estate in equestrian-friendly Southwest Ranches. 5-bedroom residence plus a separate 2-bedroom guest house-ideal for multi-gen living, a home office, rental income, etc. The main home offers 3,000+ living sq ft, volume ceilings, abundant natural light, 2-car garage, and expansive driveway. The detached, updated guest house boasts 1,300+ sq ft, a storage room, private laundry, and a 3-seat jacuzzi. Property features new water heaters, new well pumps and water filtration systems. Newly installed municipal water line directly across the property, makes city water connection optional instead of the area's typical well water. No overhead power lines running through the property. Agricultural exemption with citrus, tropical, and exotic fruit trees. 12851 Luray Rd, Southwest Ranches $2,975,000 ACTIVE Status ⋅ 5 Beds ⋅ 4,879 SqFt. Stunning 2019-built estate in coveted Rolling Oaks, Southwest Ranches. Set on a 2-acre cul-de-sac lot, this 5BR/5.5BA home offers a well-designed floor plan with beautiful finishes. First floor features an office, master suite with 2 custom closets, luxe bath with jacuzzi, rain shower & jets, plus an additional bedroom suite. Spacious living area boasts a gourmet kitchen with Jenn-Air appliances, double ovens, quartz island, huge walk-in pantry & bar with wine/beverage fridges & quartz counters. Upstairs: 3 bedrooms & loft. Expansive fenced yard showcases a beach-entry pool, spa & swim-up bar—perfect for entertaining. 17819 Sw 58th St, Southwest Ranches $2,850,000 ACTIVE Status ⋅ 5 Beds ⋅ 4,421 SqFt. Drive through the gate and follow the tree-lined driveway to this uniquely stunning estate nestled on over 2 acres and set on one of the most coveted streets in Southwest Ranches. This home invites you in with its distinctive yet casual design and attention to detail. Fruit-bearing trees and lush foliage create an unparalleled backdrop for creating memories. Inside you find 5 beds/3.5 baths plus 30x20 flex room, ideal for media, gym or recreational space. Vaulted ceilings with wood finishes grace most ceilings and a multitude of glass sliders frame the picturesque outdoor views. Step outside to the spacious L-shaped covered patio and relax or entertain beside the inviting heated pool. Metal roof and gutters 2023, Complete home generator. 3 ACs, oversized 2 car garage etc. Nothing Compares. 13494 Stirling Rd, Southwest Ranches $2,830,000 ACTIVE Status ⋅ 6 Beds ⋅ 4,296 SqFt. Welcome to your Bounty Of Love ranch. One of a kind eclectic country chic home in the heart of sunshine Ranches. Nestled in a whimsical 2 1/2 acre lush landscaping tropical fruit trees throughout Custom 150k heated resort style pool & Oversized Jacuzzi. Your main house features new roof 2018, 4 bedrooms 3 full baths Formal living room fireplace Dining stunning Zen family room views your oasis, Hand painted kitchen cabinets. Custom oversize gazebo w-built-in wood burning pizza oven, fireplace & barbecue. 4 BR 3 bath in Main house. Detached Cozy cottage has 2 bedrooms 1 bath full kitchen. 3 custom barn stalls With private barn bungalow attached to a Unique full bathroom. Hosts a border or trainer. Large pond Many more nestled corners of treasures a must see To feel the Zen in nature. 13350 Luray Rd, Southwest Ranches $2,825,000 ACTIVE Status ⋅ 4 Beds ⋅ 5,965 SqFt. Welcome to your dream equestrian estate, where luxury and tranquility meet. Nestled on over two pristine acres along a creek in Southwest Ranches. Built in 2008, this 5965 sqft custom home with 4 beds and 5 bath, impact door and window protection with soaring ceilings and bright, open floor plan. Every detail reflects top-tier craftsmanship, from the elegant foyer to the gourmet kitchen equipped with premium appliances. Expansive living spaces seamlessly transition to the outdoors,with sparkling pool, fully equipped outdoor kitchen, and cozy fire pit. Immerse yourself in a serene retreat combining country charm and seclusion, where breathtaking sunsets and peaceful creek views await. 17801 Sw 50th St, Southwest Ranches $2,770,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,046 SqFt. Fully updated, and privately nestled on 2.04 acres in Southwest Ranches. Located on a quiet cul-de-sac surrounded by mature trees, this modern home features beautiful marble flooring throughout, a new metal roof (2021), impact windows & doors, and individual ductless mini-split AC units in each room. Enjoy your resort-style backyard featuring a new saltwater pool (2022), pergola, and custom-built outdoor kitchen, perfect for entertaining. Customize your property with a barn, stables, or guest house and build your dream equestrian estate, the possibilities are endless. NO HOA! Enjoy peaceful living in one of Southwest Ranches’ most desirable locations. Available for lease! Schedule your showing today! 18300 Sw 48th St, Southwest Ranches $2,750,000 ACTIVE Status This 2 Acre Lot,  located in an unrivaled location within the Prestigious AKAI Estates Development Comprised of 44 tropical Acres. Residences and guests are greeted with a Staffed Security Guard 24/7.  Once inside, lakes and fountains shimmer in the sunlight, and provide a Royal Palm Tree lined road leading towards your Residence that include a proposed private community Helipad and  two Putting Greens. AKAI Estates is a boutique community with only 16 Luxury Estates.  Every Estate comes with its own Aquatic Center. Several amenities upgrade options, such as tennis courts, pickleball court, putting green and outdoor and/or indoor basketball courts. Sale of this exceptional lot is part of the Akai Estates Collection of Models designed by the Internationally Acclaimed Architect Vasco Vieira. 4761 Akai Dr, Southwest Ranches $2,750,000 ACTIVE Status PREMIUM LOT INSIDE LANDMARK RANCH ESTATES!!! Nestled within the quaint town of Southwest Ranches, this ultra-private and exclusive enclave is THE ONLY gated community in town, offering a true estate lifestyle experience. This expansive 2.2 acres property provides ample space for sport courts, car barn, resort sized pool, guest house, detached gym, among other. Just minutes away from FLL Intl Airport, at the Heart of South Florida! This 207'x475' corner lot can accomodate estates ranging from 5000sf to over 15,000sf. The community has just 44 estate sites, of which only few remain, and this offering represent one of the last corners available! Landmark is the preferred location for VVIP buyers looking for PRIVACY, TRANQUILITY, ACCESIBILITY and VALUE. Lot sale requires building the home. 16825 Stratford Ct, Southwest Ranches $2,724,000 ACTIVE Status ⋅ 6 Beds ⋅ 3,500 SqFt. Must see this exceptional tropical property!!! 6 Bed 3 Bath on 2.5 acres Main house 2,731 sq. ft. 4 Bed 2 Bath Adjoining guesthouse 2-Bed 1-Bath with its own kitchenette, private entrance and HVAC providing ample space for guests. Freestanding metal building 50'X32' W/14' eaves W/2 attached stalls, great for hobbies, toys or workshop Perfect for home-based businesses Ample parking for vehicles or trailers. Fully fenced Shared spring fed lake along with 300' of canal frontage Deep water well Tropical landscaping w/ Mangos Avocados Bananas Papayas & Coconuts palms.  27'round above ground pool with solar heating Attached 16'X20' elevated gazebo Easy access to highways, airports, professional sport venues, shopping, hospitals, restaurants, schools Click on Matterport link for unfurnished view 18901 SW 63rd St, Southwest Ranches $2,700,000 ACTIVE Status ⋅ 4 Beds ⋅ 3,313 SqFt. An equestrian dream in Southwest Ranches, this 4,400-sf ranch-style estate sits at the end of a private cul-de-sac on 2.5 serene acres with mature oak trees, lily ponds, & sweeping lawns. Oversized decks designed for entertaining overlook the grounds. Inside, an 18-ft vaulted cedar great room with loft serves as the heart of the home, opening seamlessly to the family room, Florida room, and spacious kitchen anchored by an oversized island. Two suites are thoughtfully positioned on opposite wings for privacy. The primary features a spa-inspired bath with wet room, soaking tub, steam shower, & integrated audio. The second serves as an attached guest or in-law suite, complete with its own private entrance and deck. This property offers a rare sense of sanctuary just minutes from city life. 5750 James B Pirtle Ave, Southwest Ranches $2,699,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,530 SqFt. SUNSHINE RANCHES GEM! CHARMING NORTHERN COUNTRY HOME WITH 4 BEDROOMS AND 3 BATHS. THIS PROPERTY IS NESTLED ON 2.13 ACRES. BEAUTIFUL SPACIOUS FRONT PORCH TO SIT AT AND ENJOY THE VIEW OF THE OAK TREE CANOPY. THIS INVITING HOME HAS 4 BEDROOMS 3 BATHS, TRIPLE SPLIT FLOOR PLAN. WOOD DECK OUT BACK WITH A FABULOUS GARDEN POOL. PEACEFUL AND TRANQUIL SETTING, TRUE SOUTHWEST RANCHES LIVING. 13500 Sw 55th St, Southwest Ranches $2,650,000 ACTIVE Status ⋅ 5 Beds ⋅ 4,713 SqFt. One Of Kind Centrally located 2023 Estate Attributes 5,961 sq ft has 5 Bedrooms and 4.5 Bath, Loft, 3 Car Garage 1 Acre Lot fenced in With Pool, Trampoline, And Kids Playground, Comes With State of the art Appliances, A Chefs Style Kitchen, Hard Wood Floors in All Bedrooms and Through out 2nd Floor, Automatic Generator for any blackouts, 75 recessed exterior led accent Lighting. get the best of both worlds Country living in Southwest\r\nRanches Equestrian Paradise And City living just minutes away Highways, Shops, Restaurants, Lounges, And\r\nParks. 15 Min to Sawgrass Mills Mall and Amerant Bank Arena. Top 5 Biggest malls in US with full entertainment\r\nComplex Shops Restaurants Bars Lounges Movie Theater. Take Advantage of this Mansion a once in a life time\r\nopportunity. See Virtual Tour! 15821 Sw 49th St, Southwest Ranches $2,650,000 ACTIVE Status ⋅ 5 Beds ⋅ 4,150 SqFt. 99% Vacant Home! PRICED UNDER MARKET VALUE FOR A QUICK SALE! Set on a beautifully Landscaped & Private 2.4-Acre Lot on coveted Thoroughbred Lane in SUNSHINE RANCHES! A Long, Royal Palm-lined Driveway leads to a spacious 4/4.5 Main Home, detached 1/1 Guest House (750 sq. ft.) & Furnished Office Building. This Estate offers: 4 Terraces, full Summer Kitchen, Pool, Hot Tub, equipped Gym, 60KW Generator & expansive Front & Rear Yards. Whether you're hosting guests or working from home, this Captivating Compound is ideal for Entertaining & Entrepreneurship! Impeccably maintained! Move-in Ready with incredible potential to personalize, expand, or even rebuild on one of Sunshine Ranches' most prestigious streets. This estate is priced a tad over Land Value! A rare opportunity to own a true Gem! 5161 Thoroughbred Ln, Southwest Ranches $2,650,000 ACTIVE Status ⋅ 6 Beds ⋅ 4,142 SqFt. Renovated modern farmhouse in the Rolling Oaks community of Southwest Ranches. Situated on a private 2.33-acre lot, this 6-bedroom, 4-bathroom home spans over 4,142 sq ft of living area. Step outside to your own private oasis—complete with a sparkling pool, 2 stable horse barn, koi ponds, expansive screened patio and an outdoor kitchen, perfect for entertaining year-round. Inside, the upgraded kitchen flows seamlessly into open living & dining spaces complete with a cozy fireplace. The primary suite and one guest bedroom are located on the main level with four additional bedrooms upstairs. Custom farm doors and woodwork throughout. The property is fully fenced and gated for privacy. Separate shed for additional storage. This one-of-a-kind estate offers luxury, space, and serenity. 17531 SW 68th Ct, Southwest Ranches $2,600,000 ACTIVE Status Exquisite 2.49-acre parcel in the heart of prestigious Sunshine Ranches, Broward County's premier destination for luxury living. This rare gem offers unparalleled freedom to craft your dream estate with no HOA restrictions. Perfect for celebrities and athletes to design a modern or contemporary masterpiece. Ample space for a private basketball court, tennis court, or pickleball court, fruit gardens, equestrian stables, a separate garage for an extensive car collection, or a luxurious in-law suite. In an upscale community, enjoy proximity to top-rated schools, vibrant farm markets, world-class dining, and scenic equestrian trails. Create your dream home in a safe, connected neighborhood where sophistication meets tranquility. Seize this unmatched opportunity today! 5533 Sw 136th Ave, Southwest Ranches $2,600,000 ACTIVE Status ⋅ 6 Beds ⋅ 3,916 SqFt. ***MAJOR PRICE REDUCTION! STUNNING 1 ACRE ESTATE IN THE HEART OF SOUTHWEST RANCHES!!!*** TOTALING OVER 5,200 SF,THIS FULLY REMODELED 1-STORY HOME BOASTS 6 SPACIOUS BEDRMS& 5 LUXURIOUS FULL BATHRMS. EXPANSIVE OPEN LIVING AREAS W/VAULTED CEILINGS FINISHED W/DECORATIVE COFFER CEILINGS IN MAIN SOCIAL AREAS &HIDDEN LINEAR DIFFUSERS. DESIGNER KITCHEN W/CUSTOM CABINETRY,QUARTZ COUNTERS,HIGH-END APPLIANCE PACKAGE W/PANEL DOORS &SEPARATE ENTERTAINING BAR. A PRIVATE IN-LAW SUITE W/SEPARATE ENTRANCE,COMPLETED W/KITCHENETTE/LIVING ROOM,PERFECT FOR MULTI-GENERATIONAL LIVING. INLAW SUITE IS ATTACHED BY A JOINING LAUNDRY RM/MUDRM FOR INTERIOR ACCESS. SPACIOUS COVERED PATIO,OVERLOOKING NEW REMODELED POOL/RAISED SPA & HUGE YARD. ENJOY SLEEK, MODERN FINISHES THRUOUT,LARGE BEDRMS & A MOVE-IN READY LIFESTYLE. 15901 SW 54 PLACE, Southwest Ranches $2,599,900 ACTIVE Status ⋅ 4 Beds ⋅ 5,103 SqFt. 10% BELOW APPRIASED VALUE!!! - ***WELCOME TO SUNSHINE RANCHES, ONE OF SOUTHWEST RANCHES MOST SOUGHT OUT COMMUNITIES!!!*** EXPERIENCE LUXURY LIVING ON 2.44 ACRES WITH STUNNING 4 BEDROOM ESTATE (4TH ROOM USED AS DEN/OFFICE), 3 FULL BATHS & 2 HALF BATHS, SPANNING 5,103 SQ. FT. UNDER AIR (7,863 TOTAL), THIS HOME FEATURES 12-FT VOLUME CEILINGS, A SEPARATE BAR, AND GOURMET KITCHEN W/ CENTER ISLAND, SS APPLIANCES, BAR SEATING PLUS AN OFF THE KITCHEN DINING AREA. THE MASTER SUITE BOASTS TRAY CEILINGS, HIS & HERS WALK-IN CLOSTES. AN OVERSIZED SPA-LIKE BATHROOM MEETS YOU W/ AN XL ROMAN TUB & WRAP AROUND SHOWER WITH DUAL HEADS. A DETACHED 1,000 SQ. FT. GARAGE/WAREHOUSE WITH 20-FT CEILINGS & PADDOCK FOR HORSES COMPLETES THIS EXCEPTIONAL PROPERTY. ALL IMPACT WINDOWS AND DOORS THROUGHOUT THE HOME!!! 5290 SW 130TH AVE, Southwest Ranches $2,500,000 ACTIVE Status Build your dream home on a spectacular 2.76-acre rectangular lot.  The lot has a lake, sunshine exposure all day long and dreamy moonlight skies during the night.  The property is centrally located between Fort Lauderdale and Miami.  An outing to beaches and marinas, culture, and nightlife is approximately 30 minutes away so you can connect to the energy of major city life or simply retreat from it all. Many affluent buyers including celebrities are drawn to the secluded nature and spacious living provided by beautiful Southwest Ranches making this site an excellent investment.  Estate homes starting at 10M are located 2 miles away.  The pad fill from the pictures is included.  A full set of plans for the estate home pictured with this listing can be purchased for an additional amount 5650 SW 192nd Terrace, Southwest Ranches $2,500,000 ACTIVE Status PREMIUM LOT INSIDE LANDMARK RANCH ESTATES!!! Nestled within the quaint town of Southwest Ranches, this ultra-private and exclusive enclave is THE ONLY gated community in town, offering a true estate lifestyle experience. This expansive 1.9 acres property provides ample space for sport courts, car barn, resort sized pool, guest house, detached gym, among other. Just minutes away from FLL Intl Airport, at the Heart of South Florida! This 273'x495' cul de sac lot can accomodate estates ranging from 5000sf to over 15,000sf. The community has just 44 estate sites, of which only few remain, and this offering represent one of the last corners available! Landmark is the preferred location for VVIP buyers looking for PRIVACY, TRANQUILITY, ACCESIBILITY and VALUE. Lot sale requires building the home. 16700 Berkshire Ct, Southwest Ranches $2,499,000 ACTIVE Status ⋅ 4 Beds ⋅ 3,705 SqFt. SOUTHWEST RANCHES !!!! BRAND NEW CONSTRUCTION. AMAZING LOCATION!!!!!! 1 acre. ! Volume ceilings, neutral colors. Open plan with lots of windows, big living areas w large great room overlooking acreage. Huge Master Suite & Bath. Very spacious kitchen, Reversed osmosis water system through out the house. Huge Master Suite & Bath featuring huge walk-in closets. Big covered patio with salt water swimming pool, impact windows and doors. Must see 5000 Sw 159 Ave, Southwest Ranches $2,399,900 ACTIVE Status ***OPPORTUNITY IN SUNSHINE RANCHES!!!***LOOKING TO BUILD YOUR DREAM ESTATE IN THE HEART OF SUNSHINE RANCHES? LOOK NO FURTHER! THIS SPRAWLING 2.35-ACRE LOT (165' X 620') OFFERS PRIVACY & SECLUSION IN ONE OF SOUTH FLORIDA’S MOST DESIRABLE EQUESTRIAN NEIGHBORHOODS. AS THE LANDSCAPE OF SOUTHWEST RANCHES TRANSFORMS INTO WHAT'S BEING CALLED “THE HAMPTONS OF SOUTH FLORIDA,” THIS IS YOUR CHANCE TO SECURE A PRIME SPOT AMONG LUXURY ESTATES. OVER 17 HOMES—EACH OVER 20,000+ SQFT—ARE CURRENTLY BUILT, UNDER CONSTRUCTION,OR IN FOR PERMITTING. THE EXISITNG 3-BEDROOM, 2-BATH HOME W/A 2-CAR GARAGE & POOL NEEDS TO BE DEMOLISHED AND REMOVED. 14431 MUSTANG TRAIL, Southwest Ranches $2,399,900 ACTIVE Status ⋅ 3 Beds ⋅ 2,532 SqFt. ***OPPORTUNITY IN SUNSHINE RANCHES!!!***LOOKING TO TAKE ON A PROJECT OR BUILD YOUR DREAM ESTATE IN THE HEART OF SUNSHINE RANCHES? LOOK NO FURTHER! THIS COZY 3-BEDROOM,2-BATH HOME W/A 2-CAR GARAGE & PRIVATE POOL SITS ON A SPRAWLING 2.35-ACRE LOT(165' X 620'), OFFERING RARE PRIVACY& SECLUSION IN ONE OF SOUTH FLORIDA’S MOST DESIRABLE EQUESTRIAN NEIGHBORHOODS. AS THE LANDSCAPE OF SOUTHWEST RANCHES TRANSFORMS INTO WHAT'S BEING CALLED “THE HAMPTONS OF SOUTH FLORIDA,” THIS IS YOUR CHANCE TO SECURE A PRIME SPOT AMONG LUXURY ESTATES. OVER 17 HOMES—EACH OVER 20,000+ SQFT—ARE CURRENTLY BUILT, UNDER CONSTRUCTION,OR IN FOR PERMITTING. THIS PROPERTY PRESENTS TWO INCREDIBLE OPTIONS: RENOVATE AND EXPAND THE EXISTING HOME TO YOUR LIKING...OR TEAR DOWN AND BUILD YOUR CUSTOM DREAM ESTATE FROM THE GROUND UP. 14431 MUSTANG TRAIL, Southwest Ranches $2,399,000 ACTIVE Status ***2.38 PRIME ACRES IN SUNSHINE RANCHES...THE LOT HAS BEEN SPLIT AND IS READY TO GO!!!*** THE SURVEY IS ALREADY DONE AND THERE ARE \"NO WETLANDS\" ON THE PROPERTY! SUNSHINE RANCHES IN ONE OF THE MOST PRESTIGIOUS NEIGHBORHOODS IN BROWARD COUNTY! RECENTLY DUBBED “THE HAMPTONS OF SOUTH FLORIDA”, SOUTHWEST RANCHES IS OFFICIALLY ON THE MAP WITH OVER 19 MEGA MANSIONS CURRENTLY UNDER CONSTRUCTION, ALREADY BUILT OR IN FOR PERMIT WITH OVER 19,000 SQFT... THIS SECTION OF SOUTHWEST RANCHES HAS A STAGGERING RECENT SALE EXCEEDING 22 MILLION+! 6301 APPALOOSA TRAIL, Southwest Ranches $2,385,000 ACTIVE Status ⋅ 8 Beds ⋅ 3,671 SqFt. Welcome to your dream retreat—this stunning luxury family estate offers the perfect blend of comfort, entertainment, and tranquility. The main house features 5 spacious bedrooms and 3 full bathrooms, soaring high ceilings, and an open-concept layout flooded with natural light. The separate 3-bedroom, 1-bath guest house is equally impressive—perfect for guests or extended family.\r\nStep outside and take in the serene view of the private fish pond, complete with a bench for peaceful reflection. For ultimate relaxation, enjoy the dedicated meditation room, or have some fun in the game room.\r\nOutdoors, the estate truly shines with a private heated pool, mini-golf course, and a children’s playground—ideal for unforgettable family gatherings and special occasions. 16301 Sw 62nd St, Southwest Ranches $2,370,000 ACTIVE Status ⋅ 3 Beds ⋅ 1,555 SqFt. Welcome to this fully updated modern equestrian home, perfectly positioned at the end of a private cul-de-sac in Southwest Ranches. The home features a bright open-concept layout with 3 BD, 2.5 BA, beautiful marble flooring throughout, a gourmet kitchen, and a modern fireplace in the living room. Outdoors, equestrian enthusiasts will find everything they need, starting with a 1,575 SF horse stable featuring 12 stalls, a riding arena, exercise ring, and a large turnout paddock, ideal for lessons or personal riding. Additionally, a 904 SF covered pavilion with modern ceiling fans. Additional features: impact windows, solar panels, and a large pool with a jacuzzi. This is a rare opportunity to own a turnkey equestrian estate. Also available for lease! 18200 Sw 48th St, Southwest Ranches $2,300,000 ACTIVE Status ⋅ 8 Beds ⋅ 5,732 SqFt. Expansive estate featuring over 7,000 sq. ft. of living space across two residences and a detached guest suite, located in the highly sought-after Southwest Ranches. This property offers endless potential and flexibility to suit your needs. Refer to the attached addendum for a comprehensive list of features. All information provided is deemed reliable but not guaranteed; buyers are advised to independently verify. Sold As-Is. Cash or conventional financing offers will be considered. 16701 Sw 49th St, Southwest Ranches $2,300,000 ACTIVE Status ⋅ 4 Beds ⋅ 3,752 SqFt. Welcome to this exceptional one-story home in Southwest Ranches, set on a spacious builder’s acre lot. This 4 bed, 4.5 bath home features soaring ceilings, updated bathrooms, porcelain and tile floors, and a functional split floor plan. The fenced backyard offers canal views with dog run, an 8ft waterfall pool with a new pump, jacuzzi & 1,100 SF covered patio with an outdoor kitchen and fruit trees. Additional features include a 2-car A/C garage, tankless water heater and A/C (2018), and a circular driveway that fits 8–10 cars. With no HOA restrictions, this property offers excellent flexibility for short or long-term rentals and is currently operating as a successful Airbnb. Ideal as an investment, vacation home, or the opportunity to redesign and create your dream home 16541 Sw 62nd St, Southwest Ranches $2,300,000 ACTIVE Status ⋅ 5 Beds ⋅ 3,496 SqFt. Charming Country Retreat with Modern Luxury! Escape to this breathtaking 2-acre farmhouse estate, where country charm meets modern elegance. This fully renovated 4-bed, 4-bath home features a wraparound porch, perfect for enjoying serene mornings. The state-of-the-art pool with a poolside bar and outdoor covered kitchen makes every day feel like a vacation. A private pond, horse barn, and long gated driveway create a secluded oasis, while the mother-in-law suite offers extra space for guests or extended family. The 2-car garage provides convenience, and the entire property is designed for tranquility and relaxation. Take a break from city life--ride a horse, unwind by the pool, or simply enjoy the peace. Yet, you're still close enough to everything you need. Your country retreat awaits! 6402 SW 185th Way, Southwest Ranches $2,299,000 ACTIVE Status ***2.38 PRIME ACRES IN SUNSHINE RANCHES...THE LOT HAS BEEN SPLIT AND IS READY TO GO!!!*** SUNSHINE RANCHES IN ONE OF THE MOST PRESTIGIOUS NEIGHBORHOODS IN BROWARD COUNTY! RECENTLY DUBBED “THE HAMPTONS OF SOUTH FLORIDA”, SOUTHWEST RANCHES IS OFFICIALLY ON THE MAP WITH OVER 19 MEGA MANSIONS CURRENTLY UNDER CONSTRUCTION, ALREADY BUILT OR IN FOR PERMIT WITH OVER 19,000 SQFT... THIS SECTION OF SOUTHWEST RANCHES HAS A STAGGERING RECENT SALE EXCEEDING 22 MILLION+! THE SURVEY IS ALREADY DONE AND THERE ARE \"NO WETLANDS\" ON THE PROPERTY! 6341 APPALOOSA TRAIL, Southwest Ranches $2,199,900 ACTIVE Status ⋅ 5 Beds ⋅ 4,078 SqFt. ***NESTLED ON A BUILDER'S ACRE  IN THE PRESTIGIOUS COMMUNITY OF SOUTHWEST RANCHES!!!*** THIS STUNNING 5-BEDROOM, 3-BATHROOM RANCH-STYLE RESIDENCE OFFERS A PERFECT BLEND OF ELEGANCE, COMFORT, AND MODERN UPGRADES. AN OPEN FLOOR PLAN WELCOMES YOU INTO A BEAUTIFULLY REMODELED KITCHEN &BAR,IDEAL FOR ENTERTAINING,WHILE A PRIVATE STADIUM-SEATING MOVIE THEATER W/AN 8.1 SURROUND SOUND SYSTEM & 120-INCH HIGH-RESOLUTION PROJECTOR BRINGS THE CINEMATIC EXPERIENCE HOME. STEP OUTSIDE TO AN OVERSIZED POOL AREA,COMPLETE W/AQUALINK TECHNOLOGY & A SALTWATER SYSTEM,PERFECT FOR YEAR-ROUND ENJOYMENT. ROOF REPLACED IN 2017 W/3-D SHINGLE AND COPPER ACCENTS, KITCHEN & BAR REMODELED IN 2019, GAS WATER HEATER, VIKING STOVE PROFESSIONAL SERIES 6-BURNER FREESTANDING RANGE WITH OVEN, 3 FIREPLACES, AND BBQ GRILL HOOKUP. 17000 SW 63 MANOR, Southwest Ranches $2,190,000 ACTIVE Status ⋅ 5 Beds ⋅ 4,641 SqFt. Custom home sitting comfortably on more than 2 acres. Situated at the end of a private street bordered by a canal. Entering this home you are welcomed by a regale open ballroom area that can be used for festivities. You  will be amazed at the size of the living room delighting your eyes with two different sceneries. Right side with all impact glass doors boasts the pool area and large terrace. Left side shows off the Spanish style beautiful entrance with open ballroom area. You can have 2 parties going on at the same time. One in the back terrace, and another in the front open area. Remodeled kitchen, all wood, large pantry, informal dining area. Has an adjacent bar, but what catches your eyes are the large windows with beautiful pool and open land scenery. This home has too much to offer. 18901 Sw 53rd St, Southwest Ranches $1,995,000 ACTIVE Status ⋅ 6 Beds ⋅ 3,789 SqFt. Rare opportunity in the Green Meadows neighborhood of prestigious Southwest Ranches. This sprawling L-shape ranch estate situated on 1.13 acres offers endless opportunities for growth and privacy. This is an outstanding option for contractors, creatives or anyone seeking that work from home lifestyle or expansive multigenerational living. The main house features 5 large bedrooms, 5 full baths and 3 half. Countless options abound with 2 additional buildings, creating guest room, office or workshop. Enjoy a heated pool and gorgeous tropical sunsets steps from 1 of 2 primary suites or stroll further west to feed the fish in the “Koi pond”. The entirety of the estate is securely fenced. A 2nd hard surface driveway leads to a 20x40 workshop with ample parking for trucks, trailers, RVs, etc. 5521 SW 162nd Ave, Southwest Ranches $1,980,000 ACTIVE Status ⋅ 6 Beds Prime opportunity in the heart of Southwest Ranches! This ~2-acre corner lot on Griffin Rd and 126th Ave offers\r\nendless potential for a luxury estate or equestrian retreat. City-approved plans are in place for a stunning 7,000 sq\r\nft two-story residence plus a 6,000 sq ft garage/storage structure. The property includes lake access and an\r\nexisting fire-damaged structure, allowing for easier permitting or redevelopment. Located in sought-after Sunshine\r\nRanches, this parcel combines rural charm with close proximity to major highways, shopping, dining, and top\r\nschools. Rarely available land with approved plans makes this a unique investment and lifestyle opportunity in one\r\nof Broward County’s most desirable communities. 4650 Sw 126th Ave, Southwest Ranches $1,980,000 ACTIVE Status Prime opportunity in the heart of Southwest Ranches! This ~2-acre corner lot on Griffin Rd and 126th Ave offers endless potential for a luxury estate or equestrian retreat. City-approved plans are in place for a stunning 7,000 sq ft two-story residence plus a 6,000 sq ft garage/storage structure. The property includes lake access and an existing fire-damaged structure, allowing for easier permitting or redevelopment. Located in sought-after Sunshine Ranches, this parcel combines rural charm with close proximity to major highways, shopping, dining, and top schools. Rarely available land with approved plans makes this a unique investment and lifestyle opportunity in one of Broward County’s most desirable communities. 4650 Sw 126th Ave, Southwest Ranches $1,975,000 ACTIVE Status This 2 Acre Lot is located in an unrivaled location within the prestigious AKAI Estates Development, comprised of 44 tropical Acres. Residence and guests are greeted with a Staffed Security Guard 24/7.  Once inside, lakes and fountains shimmer in the sunlight, and provide a Royal Palm Tree lined road leading towards your Residence that includes a proposed private community Helipad and  two Putting Greens.  AKAI Estates is a boutique community with only 16 Luxury Estates.  Every Estate comes with its own Aquatic Center.   Several amenities upgrade options, such as tennis courts, pickleball court, putting green and outdoor and/or indoor basketball courts.  Sale of this exceptional lot is subject to building an  Akai Estates Model designed by Internationally Acclaimed, Architect Vasco Vieira. 4710 Akai Dr, Southwest Ranches $1,890,000 ACTIVE Status This expansive 2.24 acre lot in the highly desirable Southwest Ranches offers a prime opportunity to build your dream estate! The land has already been filled and thoughtfully improved with a private electric gate, offering both security and a head start for future development! Situated on a peaceful street with a cul-de-sac and minimal traffic. Please call to schedule an appointment to walk the lot. The neighboring home on an additional 2.24 acre lot is also available, presenting a rare opportunity to acquire both properties and ~4.5 acres in a combined sale!  Open House this SATURDAY & SUNDAY!! 70 Sw Pl, Southwest Ranches $1,890,000 ACTIVE Status This expansive 2.24 acre lot in the highly desirable Southwest Ranches offers a prime opportunity to build your dream estate! The land has already been filled and thoughtfully improved with a private electric gate, offering both security and a head start for future development! Situated on a peaceful street with a cul-de-sac and minimal traffic. Please call to schedule an appointment to walk the lot.  The neighboring home on an additional 2.24 acre lot is also available, presenting a rare opportunity to acquire both properties and ~4.5 acres in a combined sale!  Open House this SATURDAY & SUNDAY!!! 70 Sw Pl, Southwest Ranches $1,850,000 ACTIVE Status Stunning Mustang Trail plot of land, ready for development with approvals and full concept design. Design firm SKYWERK & DWF . Build your dream home on 2.24 acres of Prestine land.  This property will not last long! Schedule a private presentation with us. 14010 Mustang Trl, Southwest Ranches $1,825,000 ACTIVE Status ⋅ 5 Beds ⋅ 3,557 SqFt. NOW PRICED TO SELL! Nestled in sought-after SW Ranches, this SFLA 3,557; 5 Bedrooms/4.5 Baths home sitting on 2.5 acres ,very close to Weston. As you step inside, you'll be greeted by an expansive, light-filled space, accentuated by high ceilings, a seamless flow, and thoughtful features like a spacious pantry/laundry area, two A/C units, and a two-car garage. Fully updated with new flooring, Impact Windows, modern baths, and a 2016 roof. Step out of your bedroom onto a pro golf putting green—perfect for practicing your game! Enjoy a 900 SF covered patio with pergola for entertainment and a 900 SF barn with a 2023 roof. Spacious, private, and designed for indoor-outdoor living, this home offers the perfect blend of comfort and tranquility. Within the boundaries of A rated Public Schools. 17451 SW 46th St, Southwest Ranches $1,820,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,391 SqFt. Rarely Available, Stunning Fully Remodeled 4-Bedroom, 3.5 Bathrooms home in the desirable Ivanhoe Estates, Southwest Ranches most sought-after communities, nearly 1.5 acres, totally automated smart home, every detail in this home meticulously updated to brand new, featuring a pristine pool and jacuzzi, newly constructed pergola, new porcelain tile floors Impact-resistant windows. Solar panels to reduced energy costs, Remote smart entry gate.\r\n\r\nA backup power generator, convenient storage shed for added space. New A/C system (2025), roof replaced in 2009. Conveniently located near top-rated schools, popular dining options, Florida Turnpike.\r\n\r\nState of the art brand new Samsung appliances, wine cellar. new water heater, driveway for 20 vehicles, reset automated lighting, sprinklers system. 5020 Hawkhurst Ave, Southwest Ranches $1,800,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,790 SqFt. New in Southwest Ranches! Nestled on 1.1 acres, this fully renovated 4-bed, 3-bath turn-key gem offers luxury and privacy. The home features vaulted ceilings in the kitchen, family room, and master bedroom, creating a spacious and airy feel. Enjoy all-new impact windows, stunning porcelain tile wood look floors, a brand-new kitchen with high-end appliances, and a butler’s pantry/laundry room. Every bathroom has been upgraded with modern fixtures, and the master suite boasts a stand-alone tub and double walk-in closet. The beautifully renovated pool, fresh stucco, and new exterior paint make this home truly move-in ready—don’t miss it! 5811 SW 164th Ter, Southwest Ranches $1,799,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,692 SqFt. Fantastic 2-acre estate in Southwest Ranches featuring 4 beds, 3 baths, and a 3-car garage. This spacious home offers an open layout with tile flooring throughout, a large living room with a wood-burning fireplace, and a beautifully remodeled oversized chef’s kitchen with center island, granite countertops, snack bar, and stainless steel appliances. The master suite includes a walk-in closet and large bathroom with dual sinks, shower, and tub. Exterior upgrades include a brand-new metal roof, custom ES impact windows and front door, new stucco and paint, soffit lighting, gutters, new water filtration system, and RV hookup with electric and plumbing. Enjoy serene canal views from the back patio. Perfect for outdoor dining. Fully fenced lot with space to expand. A true gem in SWR. 5350 SW 198th Ter, Southwest Ranches $1,785,000 ACTIVE Status ⋅ 3 Beds ⋅ 2,372 SqFt. Horse country paradise in Southwest Ranches.  Totally upgraded 3/2 Ranch style home on 1.9 Acres of land with no HOA obligations.  Very large heated pool and full basketball court.  The house has a 7 year-old roof with two new AC units, tankless water heater, impact windows and doors, security cameras, slate floor in the garage and a fireplace. Tile flooring throughout. SW Ranches is known for its Equestrian atmosphere and with your two horse stalls you can become part of a community that keeps a rural flavor and have all the space you need for your dogs (They have their own AC Dog House) and farm animals. Rolling Oaks, where your future home is located is just minutes from multiple shopping and dining opportunities. 17500 Sw 68th Ct, Southwest Ranches $1,750,000 ACTIVE Status ⋅ 7 Beds ⋅ 3,762 SqFt. Exquisite 4,236 sqft estate in the prestigious Rolling Oak Estates community. Nestled on 1.93 acres of pristine buildable land, this remarkable 7-bedroom, 4-bathroom residence offers a sophisticated and spacious floor plan. Enjoy the serenity of the expansive backyard, ideal for outdoor gatherings, with plenty of room to add a pool, guest house, or create your own private oasis. Additional highlights include a large primary suite with a en-suite bath, walk-in closets, a dedicated home office, and ample parking space. This is a rare opportunity to own a sizable estate home of nearly 2 acres with both privacy and convenience, located just minutes from top-rated schools, shopping, dining, and major highways. Don’t miss out schedule your private showing today! Motivated Seller! 17550 Sw 59th Ct, Southwest Ranches $1,750,000 ACTIVE Status ⋅ 5 Beds ⋅ 2,998 SqFt. Welcome home to this rare opportunity in the heart of prestigious Southwest Ranches. Situated on nearly 2 acres of prime land, this expansive property offers endless potential for redevelopment or customization. Nestled among multi-million-dollar estates with recent closed sales exceeding $8 million, this is your chance to create your dream compound or luxury estate in one of South Florida’s most exclusive equestrian communities. The current home is fully livable and features 5 spacious bedrooms, 3 full bathrooms, and an open layout with plenty of natural light. The property also includes private pool, horse stables, lush greenery, and ample room for additional structures such as a guest house, tennis court, or equestrian amenities. 5310 Sw 172nd Ave, Southwest Ranches $1,750,000 ACTIVE Status ⋅ 5 Beds ⋅ 3,234 SqFt. THIS CAPTIVATING HOME, WITH HIGH-CEILINGS WITH AN EXPANSIVE 5 BEDROOM 4 BATH SPLIT FLOOR PLAN SITS ON A 51,209 SQUARE FOOT LOT OVERLOOKING A BEAUTIFULLY PRIVATE POOLSIDE OASIS. OWNERS INVESTED OVER $100,000 ON A SALT CHLORINATED POOL, BEAUTIFUL HEAT-RESISTANT TILE WHICH SURROUNDS THE POOL AREA AND SCREENED IN LARGE SEPARATE PATIO.  LARGE MASTER SUITE WITH A JACUZZI TUB. OPEN CONCEPT GOURMET KITCHEN FEATURING TOP OF THE LINE STAINLESS STEEL VIKING APPLIANCES, GRANITE COUNTERTOPS, HIGH WOOD BEAM CEILINGS. ELECTRIC FENCED GATE, EXPANSIVE DRIVEWAY. IMPACT WINDOWS, NEWER ROOF (APX 4 YEARS OLD). SEPARATE STAND ALONE OVERSIZED TWO CAR GARAGE WITH DUAL ENTRANCES, BARN AND OVERSIZED SHED. PRICED RIGHT WITH SO MANY PLUSES!!! THIS HOME WILL NOT DISAPPOINT. Southwest Ranches $1,750,000 ACTIVE Status BEAUTIFUL 2.5 ACRE PARCEL IN THE HEART OF SOUTHWEST RANCHES. ZONED A-1 WITH MANY DIFFERENT TYPES OF BUSINESS USES. THERE IS A SEPTIC TANK, 2 WELLS, 1 FOR MOBILE HOME W/WATER & ELECT, AND 1 FOR IRRIGATION. INCLUDES FULLY OPERATED PUMP FOR TRAILER, 2ND STAND BY OR IRRIGATION. ELECT THROUGHOUT THE WHOLE PROP., PAVED AREA COVERED FOR WORK SPACE & PARKING, SEC. CAMERAS THROUGHOUT THE PARCEL. ELEVATED BERMS AROUND FOR ADDED PRIVACY & IN THE BACK W/A 10Ft Wx15 Ft D POND FOR WATER RETENTION.*Developers, general/nursing contractors,nurseries & gardening,equestrian farms owners.* Lush acres of land ready to build your dream home. Plumbing & electricity in place w/a nice mobile home. 6453 Sw 185th Way, Southwest Ranches $1,699,000 ACTIVE Status Rare opportunity to own 2.24 acres on prestigious Mustang Trail in Southwest Ranches. This prime lot features a serene pond, lush greenery, and a peaceful, private setting—ideal for building a custom estate or high-end development. Zoned residential with a completed Phase 1 Environmental Study, it's ready for your vision. Enjoy a rural, equestrian-friendly lifestyle just minutes from Downtown Fort Lauderdale, top-rated schools, family attractions, and three international airports. Surrounded by luxury homes in a highly desirable area with limited inventory, this property offers both exceptional lifestyle appeal and strong investment potential. Build your dream home or a profitable spec estate in one of South Florida’s most sought-after communities. 14020 Mustang Trl, Southwest Ranches $1,650,000 ACTIVE Status SUNSHINE RANCHES 2.07 NET ACRES**BUILD YOUR LUXURY DREAM HOME**IF 2 ACRES IS NOT ENOUGH THERE IS 5 ACRES OR 10 ACRES AVAILABLE AS WELL** 12880 Luray Road, Southwest Ranches $1,640,000 ACTIVE Status Incredible Investment Opportunity in SW Ranches, with Sub dividable Acreage. Seize this rare chance to own prime land in the prestigious, horse friendly community with no HOA. This expansive property is a smart investment with the potential to subdivide into 2 separate parcels. Build 2 luxury homes, create multi generational compound, or develop and sell each lot individually, the possibilities are endless. Whether you're a homeowner, builder, or investor, this property offers exceptional value in a growing market. With zoning that allows for horses and agriculture, it's also ideal for a private estate/custom equestrian retreat. Enjoy the serenity of country living while staying close to A rated schools, shopping, dining, and major highways, a perfect balance of privacy and convenience. 5401 SW 160th Ave, Southwest Ranches $1,640,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,370 SqFt. This 4 bed 2 bath single family home sits on 2.91 acres, offering endless possibilities! located in Southwest Ranches, one of the last and most desirable horse friendly communities in South Florida! With no HOA and ultimate privacy, you can create your dream lifestyle, whether you’re looking for a private country retreat or a smart investment opportunity. The expansive land allows for subdividing into 2 separate parcels, making it perfect for building additional homes or creating a multi generational family compound. Animal lovers there is plenty of space for your private farm! Enjoy the best of both worlds, peaceful country living with easy access to A-rated schools, shopping, dining, and major highways. Acreage in Southwest Ranches is rare, don’t miss this unique opportunity! 5401 SW 160th Ave, Southwest Ranches $1,613,000 ACTIVE Status Public Auction to settle family estate. Appraisal for estate settlement and legal purposes was $1.9 Million. The family wants it sold on September 10th 2025 or Before. Southwest Ranches Buy. Bank. Build. Benefit. Renovate home or Rent property while planning your dream estate home. A VERY UNIQUE AUCTION OPPORTUNITY This exceptional estate lot in the highly coveted Southwest Ranches a rare piece of South Florida paradise. 5490 SW 128 Avenue, Southwest Ranches $1,613,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,478 SqFt. Sale to settle family estate. September 10th 2025 8:00 PM all Contracts Due. Appraisal for estate settlement and legal purposes was $1.9 Million. The family wants it sold on September 10th 2025  Buy. Bank. Build. Benefit. Renovate home or Rent property while planning your dream estate home. A VERY UNIQUE OPPORTUNITYThis exceptional estate lot in the highly coveted Southwest Ranches is a prestigious opportunity for serious buyers to secure a rare piece of South Florida paradise through a professionally managed and family-honoring process.This estate has been in the same family since 1973 5490 SW 128 Avenue, Southwest Ranches $1,575,000 ACTIVE Status ⋅ 4 Beds ⋅ 3,059 SqFt. Step into your own gated sanctuary on 1.25 lush acres in prestigious SW Ranches. This tropical estate blends privacy, scale, and endless potential. Three separate entrances offer space for guest houses, pickleball, or equestrian living. Inside, dramatic ceilings and expansive open spaces set a grand tone, with a garage conversion adding total sq ft to 3059 creating a spacious 4th bedroom. Mature, curated landscaping surrounds a resort-style pool. Zoned for horses and nurseries, with room to build your dream compound. The rectangular layout, privacy, and serene setting make this a true hidden gem. Minutes from elite shopping, dining, and highways—yet it feels a world away. A rare opportunity to own a home that lives like a private resort—bold, beautiful, and unforgettable. 6411 185th Way, Southwest Ranches $1,450,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,460 SqFt. This fully remodeled 4BR/3BA home in desirable Southwest Ranches offers unmatched privacy with forever-protected land behind—no rear neighbors ever. Enjoy a brand-new roof, AC, floors, and paint, plus a chef’s dream kitchen with oversized island and premium appliances. Remodeled baths, spacious laundry, and bright living spaces make it move-in ready. Step outside to an oversized screened terrace with a dipping pool overlooking a peaceful backyard. Wide paved driveway and 2-car garage fit RVs, boats & more. Horses and livestock allowed, the large barn is perfect for animals or to be converted into additional recreational areas. This rare blend of space, style, and privacy is ready for its next owner—don’t miss it! 5530 Sw 195th Ter, Southwest Ranches $1,370,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,280 SqFt. ***BEST LOCATION IN SOUTHWEST RANCHES*** BEAUTIFUL 4 BEDROOM 2.5 BATH HOME ON 1.2 ACRE LOT.\r\nTHERE IS AN EXTRA ROOM THAT COULD BE A 5TH BEDROOM. MASTER BEDROOM HAS A BONUS ROOM THAT COULD BE A HOME OFFICE OR GYM. REMODELED BATHROOMS AND RECENTLY UPDATED FLOORS, POOL PUMP AND BRAND NEW A/C SYSTEM. COMPLETELY FENCED. OVERSIZED KITCHEN WITH GRANITE COUNTERTOPS AND STAINLESS STEEL APPLIANCES. OVERSIZED ENTERTAINMENT AND POOL AREA. Southwest Ranches $1,350,000 ACTIVE Status ⋅ 4 Beds ⋅ 2,680 SqFt. EXQUISITE CUSTOM HOME in The Agricultural  Estate District of Southwest Ranches.\r\n4/2 Corner Home with garage and DETACHED 30X55 three car garage and/or workshop with office.\r\nFamily Room is 24 x 27...large enough for pool table, gym, movie theater! At last, a room large enough for a massive dining\r\nroom suite!  Perfect setting for entertaining...makes every family meal an occasion!\r\nOriginal owners made sure that their home was built with enough room inside and out. There's Plenty of parking for your RV, boats and trucks.\r\nFrench doors have high impact windows and  lead to open patio with pool. Hurricane panels available for others.\r\nHorses permitted.  \r\nNO HOA.  \r\nAll offers should be complete with \"Proof of Funds\" and \"Pre-Approval\"\r\nBeing sold \"AS-IS\" WITH RIGHT TO INSPECTIONS. 4841 SW 201st Ter, Southwest Ranches $1,349,000 ACTIVE Status ⋅ 5 Beds Beautiful Ranch Style 5 bedrooms 4 bathrooms with office and game room home on an acre in well sought after Southwest Ranches Ivanhoe Estates Community. Enjoy almost 4,000 square feet under air on private cul-de-sac. Two master bedrooms one of which would be great for in-laws. Marble floors in living areas and bathrooms. Wood floors in bedrooms. Mature fruit trees include, delicious mangoes (Bombay, East Indian, Julie, and others), Water Apples, Sour Sop, Sweet Sop, June Plum, Barbados Cherry, Papaya, Sugar Cane, Ackee, Coconuts. Other trees that are not yet fruiting include Lychee, Guinep, Star Fruit, and Star Apple. Come enjoy rural living yet still be in close proximity of supermarket and shopping. Motivated sellers. 15131 Whetstone Way, Southwest Ranches $1,348,000 ACTIVE Status ⋅ 3 Beds ⋅ 1,889 SqFt. Welcome to your private oasis in prestigious Southwest Ranches, Florida. This remarkable property sits on a sprawling 1-acre lot, offering tranquility, luxury, spaciousness, and NO HOA!!. Totally remodeled with new roof.  Upon entering, you'll be greeted by an abundance of natural light streaming in through the windows, illuminating the interior, and creating a warm and inviting atmosphere. The gourmet kitchen is a chef's delight, boasting a smart Samsung fridge, double range oven, and sleek countertops. In addition the home features, a versatile office space which blends function with style, providing ample natural light for a peaceful work environment. The master suite is a true retreat, featuring a generous bedroom, walk-in closet. Add on Pool permit and design available 17101 Sw 48th St, Southwest Ranches Start Your Search Popular Areas in Your Community Looking for the Perfect Home in the Perfect Place? Chances are you'll want to check here first Call Susan at 954-557-5993 Southwest Ranches, FL Homes For Sale Southwest Ranches Homes For Sale under $600,000 Southwest Ranches For Sale $600,000 -$800,000 Southwest Ranches For Sale $800,000 - 1 Million Southwest Ranches For Sale 1 Million - 3 Million Southwest Ranches For Sale 3 Million - 5 Million Southwest Ranches For Sale 5 Million - 7 Million Southwest Ranches For Sale 7 Million and above Southwest Ranches Neighborhoods Landmark Ranch Estates Sunshine Ranches Circle S Estates Akai Estates Rolling Oaks Estates Southwest Ranches, FL Interactive Map Southwest Ranches Market Report Mortgage Calculator Amount of Loan Annual Interest Rate % Term of Loan Years Calculate Does not include any taxes or fees. Please consult a financial professional. Open footer navigation menu HOME Instant Home Value Search Selling Buying Foreclosures About Us Blog Featured Properties Sus an J Penn PA Licensed Realtor ® London Foster, LLC - Experienced 20 Years susanjpennpa@gmail.com 954-557-5993 2645 Executive Park Dr #125 Weston Florida 33331 SL3133922 National Association of REALTORS® National Association of REALTORS® - Broward, Palm Beaches & St. Lucie Realtors® National Association of REALTORS® - Miami Realtors National Association of REALTORS® - Florida Realtors © All Rights Reserved Aventura Boca Raton Boynton Beach Cooper City Coral Ridge Coral Springs Davie Delray Beach Doral Fisher Island Fort Lauderdale Golden Beach Hollywood Jupiter Key Biscayne Las Olas Isles Lauderdale By The Sea Lighthouse Point Loxahatchee Miami Miami Beach Miramar Parkland Pembroke Pines Pinecrest Plantation Pompano Beach Southwest Ranches Star, Palm & Hibiscus Islands Sunny Isles Beach Sunset Islands Tamarac Venetian Islands Victoria Point Wellington Weston Westlake IDX Site Powered by Accessibility Terms Privacy"
    },
    {
      "url": "https://www.southwestranches.org/departments/parks-recreation-and-open-space/frequently-asked-questions/",
      "text": "Frequently Asked Questions – Southwest Ranches, Florida (954) 434–0008 Generic selectors Exact matches only Search in title Search in content Post Type Selectors Skip to content About Advisory Boards Emergency Services Additional Resources Information Mapping & GIS Southwest Ranches College Scholarship Southwest Ranches Historical Society, Inc. Calendar Advisory Boards Town Events Town Council Meetings Council Mayor Steve Breitkreuz Vice Mayor Bob Hartmann Council Member Jim Allbritton Council Member Gary Jablonski Council Member David S. Kuczenski, Esq. Ethics Report Lobbyist Registration District Map with Council Former Town Council Members Elections Departments Building Permitting and Inspections Code Compliance Emergency Management Financial Services Department Parks, Recreation and Open Space Planning and Quasi-judicial Public Safety Public Works & Engineering Southwest Ranches Volunteer Fire Department Town Administrator Town Attorney Town Clerk Zoning and Permitting Meeting / Agendas Procurement Town Resources Employment Opportunities Emergency Notification Signup Garbage and Recycling Household Hazardous Waste, Electronic Waste Disposal, Prescription Drug Drop Off, and Shredding Event Code of Ordinances and Town Charter New Resident Resources Notification of Public Camping and Sleeping Complaints About Our Town Advisory Boards Emergency Services Additional Resources Information Mapping & GIS Southwest Ranches College Scholarship Southwest Ranches Historical Society, Inc. Departments Building Permitting and Inspections Code Compliance Emergency Management Financial Services Department Parks, Recreation and Open Space Planning and Quasi-judicial Public Safety Public Works & Engineering Southwest Ranches Volunteer Fire Department Town Administrator Town Attorney Town Clerk Zoning and Permitting Council Mayor Steve Breitkreuz Council Member Gary Jablonski Council Member Jim Allbritton Vice Mayor Bob Hartmann Council Member David S. Kuczenski, Esq. Ethics Report Lobbyist Registration District Map with Council Former Town Council Members Elections Calendar Advisory Board Town Events Town Council Meetings Procurement Meeting / Agendas Frequently Asked Questions Home Departments Parks, Recreation and Open Space Frequently Asked Questions What are your days and hours of operation? The Southwest Ranches parks are open from dawn to dusk every day of the year. Park hours may vary according to the season. Contact Town Hall for more information. Is there an entrance fee? There is no charge for admission into the Southwest Ranches Parks. Entry fees may be charged for special events, if any held, in our parks. Contact Town Hall for more information. What amenities are available for children? Sunshine Ranches Equestrian Park and Country Estates Park both offer playgrounds. Stabilized grass fields are also available for miscellaneous play activities. Children must be attended at all times. Southwest Ranches Parks also offer Geocaching in various locations. Are pets allowed in the Parks? And, what are your rules and regulations? Pets are permitted in all areas subject to the following restrictions All pets must be confined, leashed, or otherwise under the physical control of a person at all times. Leashes may not exceed six feet in length Pets must be well behaved at all times. Pets may not be left unattended Pet owners shall pick up after their pets and properly dispose of all pet droppings Pets that are noisy, vicious, dangerous, disturbing or intimidating to other persons, and pets that damage park resources are considered to be nuisances and will not be permitted to remain in the park Owners of horses, dogs and other pets required by Florida Law to be vaccinated against rabies must be able to provide proof of vaccination upon demand of a Town official Domestic breeds of dogs, cats and all other pets, (except service animals) shall be excluded from playgrounds in Southwest Ranches Parks Are alcoholic beverages allowed in the parks? Alcoholic beverages are prohibited in the parks, except at the Rolling Oaks Park with an approved reservation and required insurance coverage. Where can I park my trailer? At Sunshine Ranches Equestrian Park, trailer parking is available for vehicles ranging in length from 20 to 76 feet in the center of the paved area and also in the northwest section of the stabilized grass area. At the Country Estates Park, trailer spaces are also provided. Is there fishing in the parks? Fishing is permitted in Southwest Ranches Parks in specifically designated areas. Fishing is not allowed in the Sunshine Ranches Equestrian Park. How can I become involved as a volunteer for Southwest Ranches Parks? Volunteers and community partners are encouraged to provide additional support for our parks. You, your family or service organization may volunteer to participate by donating time, money or supplies. Contact us at dlauretano@southwestranches.org to find out how you or your organization can help. Are park facilities accessible for persons using wheelchairs? Southwest Ranches Parks offer accessible facilities. If you need information about specific facilities, please call or write to us. Can I reserve the facilities for a family, business or church outing? Reservations are currently accepted for use of the shelters at Sunshine Ranches Equestrian Park and Country Estates Park. Riding rings in the Sunshine Ranches Equestrian Park may also be reserved. The Rolling Oaks Barn offers indoor meeting and event spaces available for rental. See the Policies and applications for rental facilities in Town parks. Where can I swim? There are no swimming facilities currently in Southwest Ranches Parks. Please be advised that under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone at (954) 434-0008 , or in writing at 13400 Griffin Road, Southwest Ranches, FL 33330. Legal: Disclaimer Home Index Contact Us: (954) 434 – 0008 or Send an Email Town Talk Self-Registration Form Copyright - 2025. Town of Southwest Ranches - All right reserved. SIGN UP FOR EMAIL UPDATES Subscribe to get our newsletter & stay updated Please leave this field empty. Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    }
  ]
}