{
  "fuentes": [
    {
      "url": "https://spacecoastpartyrentals.com/rentals/slides-combos/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://imagineairparty.com/about-us/",
      "email": "info@imagineairparty.com"
    },
    {
      "url": "https://nypartyrentalsllc.com/about-us/",
      "email": "sales@nypartyrentalsllc.com"
    },
    {
      "url": "https://spacecoastpartyrentals.com/bounce-house-palm-bay-in-palm-bay-fl/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://spacecoastpartyrentals.com/rentals/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://www.spacecoasthabitat.org/about-us/meet-the-team/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.spacecoasthabitat.org/about-us/meet-the-team/",
      "email": "info@spacecoasthabitat.com"
    },
    {
      "url": "https://spacecoastpartyrentals.com/tables-chairs-rental-in-melbourne-fl/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/melbourne/wedding-services/chairs-for-affairs-party-rentals/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "20kellie.mcdonald@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "agnes.rutkai@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "claudia.borja@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "gian.santomieri@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "james.venegas@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "kathryn.turner@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "michelle.fernandez@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "nicholas.cole@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "nidia.callejas@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "brigitte.dahrouj@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "conference@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "danielle.federico@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "jo.gonzalez@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "lauren.ballesteros@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "samantha.zendejas@lmu.edu"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "email": "scheduling@lmu.edu"
    },
    {
      "url": "https://spacecoastpartyrentals.com/bounce-house-near-me-in-melbourne-fl/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://members.spacecoastmls.com/contactus",
      "email": "communications@space321.com"
    },
    {
      "url": "https://spacecoastpartyrentals.com/rentals/water-rides/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://cosmo.org/visit/rentals/",
      "email": "rentals@cosmo.org"
    },
    {
      "url": "https://spacecoastpartyrentals.com/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://spacecoastpartyrentals.com/rentals/tents/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://www.showtime-eventrentals.com/about_us/",
      "email": "info@showtimeeventrentals.com"
    },
    {
      "url": "https://stillwaterspacewalk.com/contact_us/",
      "email": "spacewalksok@herecomesfun.com"
    },
    {
      "url": "https://spacecoastpartyrentals.com/bounce-house-palm-bay-in-melbourne-fl/",
      "email": "scpr@spacecoastpartyrentals.com"
    },
    {
      "url": "https://spacecoastdaily.com/about-us/",
      "email": "contact@spacecoastdaily.com"
    }
  ],
  "mails": [
    "20kellie.mcdonald@lmu.edu",
    "agnes.rutkai@lmu.edu",
    "brigitte.dahrouj@lmu.edu",
    "chosen-sprite@2x.png",
    "claudia.borja@lmu.edu",
    "communications@space321.com",
    "conference@lmu.edu",
    "contact@spacecoastdaily.com",
    "danielle.federico@lmu.edu",
    "gian.santomieri@lmu.edu",
    "info@imagineairparty.com",
    "info@showtimeeventrentals.com",
    "info@spacecoasthabitat.com",
    "james.venegas@lmu.edu",
    "jo.gonzalez@lmu.edu",
    "kathryn.turner@lmu.edu",
    "lauren.ballesteros@lmu.edu",
    "michelle.fernandez@lmu.edu",
    "nicholas.cole@lmu.edu",
    "nidia.callejas@lmu.edu",
    "rentals@cosmo.org",
    "sales@nypartyrentalsllc.com",
    "samantha.zendejas@lmu.edu",
    "scheduling@lmu.edu",
    "scpr@spacecoastpartyrentals.com",
    "spacewalksok@herecomesfun.com"
  ],
  "nombre_sitio": "spacecoastpartyrentals.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://spacecoastpartyrentals.com/rentals/slides-combos/",
      "text": "Slides & Combos - Space Coast Party Rentals Palm Bay FL (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Home » Inventory » Slides & Combos items Set Event Date Slides & Combos for Rent 120935 Slides & Combos is a dynamic rental attraction that mixes the fun of sliding with interactive play elements. It turns any event into an energetic playground where kids and families can enjoy a burst of excitement. Palm Bay , Melbourne, and surrounding cities in Brevard County Professional delivery to Indian Harbor Beach, FL , Melbourne, FL , Palm Bay , FL , Sebastian, FL , Grant, FL and surrounding areas. Please submit a quote or contact us to be sure we service your area. Get ready for an epic playtime with Slides & Combos—a rental that transforms any event into a memorable adventure. Imagine soaring down a thrilling slide and then switching gears to enjoy a mix of interactive play zones all packed into one setup. Designed to spark fun and laughter, these rentals blend excitement and safety, making them the perfect choice for backyard parties, school events, or community festivities. Whether you're reliving childhood joy or creating new memories, Slides & Combos offer a dynamic experience that keeps the fun rolling all day long. View Product 18ft Tropical Waterslide 18ft+Tropical+Waterslide https://spacecoastpartyrentals.com/rentals/water-rides/18ft-tropical-waterslide/ 1585669 Limited Dropdown 1 0 from $199.00 item unavailable (change date) View Product 19ft Blue Tsunami Waterslide 19ft+Blue+Tsunami+Waterslide https://spacecoastpartyrentals.com/rentals/water-rides/19ft-blue-tsunami-waterslide/ 2739683 Limited Dropdown 1 0 from $245.00 item unavailable (change date) View Product 19ft Orange Glacier Waterslide 19ft+Orange+Glacier+Waterslide https://spacecoastpartyrentals.com/rentals/water-rides/19ft-orange-glacier-waterslide/ 1711981 Limited Dropdown 1 0 from $245.00 item unavailable (change date) View Product 22ft Red Rush Waterslide 22ft+Red+Rush+Waterslide https://spacecoastpartyrentals.com/rentals/water-rides/22ft-red-rush-waterslide/ 1585673 Limited Dropdown 1 0 from $285.00 item unavailable (change date) View Product Octopus Waterslide Combo Bounce House Octopus+Waterslide+Combo+Bounce+House https://spacecoastpartyrentals.com/rentals/bounce-houses/octopus-waterslide-combo-bounce-house/ 1917771 Limited Dropdown 1 0 from $155.00 item unavailable (change date) View Product Wet/Dry Carnival Castle Combo Wet%2FDry+Carnival+Castle+Combo https://spacecoastpartyrentals.com/rentals/slides-combos/wet-dry-carnival-castle-combo/ 1585679 Limited Dropdown 1 0 from $175.00 item unavailable (change date) (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://imagineairparty.com/about-us/",
      "text": "About Us - Imagine Air Party Rentals LLC (404) 245-1222 Search for: Facebook Instagram Facebook Instagram Book Now Book Now Inventory View Products Bounce Houses Inflatable bouncers are great to get some energy out. We also have combination bouncers that have something like a basketball hoop or slide that is built in with a bounce space! We are experts in renting bounce houses and can be adapted to any occasion. View Products Concessions Concessions machines are essential for any event to provide snacks for guests or a option to cool down by having a snow cone following all the excitement. Concession machines are operated by staff or volunteers. View Products Bounce House w/ Slide View Products Tables & Chairs View Products Water Slides About Us FAQs Contact Us Home » About Us Nobody Knows Inflatable, Event, and Party Rentals Like We Do When you rent from us you’re not just renting the “stuff” you need to throw a great party or event, you’re gaining an experienced partner there to make your event a stress-free experience for you and an unforgettable, once in a lifetime experience for your guests. Contact Us Have questions? We have answers! Can’t find what you’re looking for or curious about one of our products? Don’t hesitate to give us a call or use our contact form to reach out to us anytime! (404) 245-1222 info@imagineairparty.com Conyers, GA 30012 Name Email Phone Message Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Copyright © 2022 Imagine Air Party Rentals LLC Conyers GA All Rights Reserved | Rental Software Powered By InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://nypartyrentalsllc.com/about-us/",
      "text": "About Us - Party Rentals NYC | New York Party Rentals LLC Have any questions? CALL US (212) 222-1185 (Since 1998) kathy.nylpr@gmail.com Products Tablecloth / Linens Dinner Napkins Spandex Hemstitch Napkins Electric Patio Heaters Coat Racks Bar Supplies Bars Chairs Bar- Stools Luxury Folding Chairs Bar Stools All Tables Cocktail Tables Retractable Stanchions Black Gold Stanchions Chrome Stanchions Red Carpet Runners Glassware Crystal Stemware Collection Podiums and Lecterns White Boards Platters Bowls Staging and Production Pipe And Drape Easels Dinner Plates Flatware Proofing Cabinets FAQ Glossary of Products About Blog Photos Photos Rental Policy Rental Tips C C Form PDF Email 0 SHOP The Khans, husband and wife, they both worked at a large party rental company for many years, its where they met and later married. After many years working together they realized how great a team they were and they wanted to invest in their own business. Always talking to each other about how they would do things different to improve customer satisfaction and productivity if they had a party rental business, they decided to stop talking take a risk and invest in themselves. After Kathy (The Linen Lady), a product of Fashion Institute of Technology in New York, majored in Production Techniques and Textile Design and Manufacturing and later worked in the Fashion Industry for many years developed and created 10 colors to the Solid Tablecloth line. SAGE/CELADON, CANTALOUPE/MELON, EGGPLANT/AUBERGINE, MOCHA/CAPPUCCINO, ANTIQUE GOLD/MUSTARD, SALMON/CORAL, FRENCH BLUE/SLATE, MANGO, CHARTREUSE, and finally her only not-so-good creation AQUA. What is special about this you may ask is that all the other party rental companies nationwide to this day copy and use these colors as part of their everyday line of colors. Table linens had been considered a simple selling tool and there was no real profit to be made. Kathy proved this to be wrong and uses this tool for New York Party Rentals success and it is as important as is glassware and tables products. So, with their talent, experience and life savings, they did just that and started a small linen rental company in the basement of their home in Queens, New York. Customers that had confidence in their abilities, suppliers and a few hard working, experienced party rentals workers all believed in the Khans and wanted them to succeed. Outcasts to the party rental industry because of false accusations from their previous employer, and being different from the ordinary industry owners, they persevered. Clients were ecstatic over their customer service, the quality of inventory and innovative style, they demanded more of them. They insisted they service them with glassware and china, tables and chairs to become a fully serviced operation to do house parties and other small venues. Mr. Khan who initially encouraged Kathy to take the risk to start their own company, moved them to the next level. Khan, as he is fondly known by is always taking risks. He risked his life to come to America by any means necessary. His goal was to become an American citizen for the freedom to use to his God given talents as an entrepreneur and businessman. Arriving in America with nothing but the cloths on his back he worked at a couple of low paying entry level jobs until he saved enough to start several small enterprises where he had the ability to earn and save money until he could establish a \"real\"  business. It was working at one of his businesses where he met Kathy. Twenty years later the Khans own and operate out of a 65,000 square foot warehouse in Irvington, New Jersey servicing New York City and the Tri State area. With the innovations of the internet we have had the opportunity to reach hundreds of new customers. We go out of the way to maintain that close comfortable relationship with new customers as well as maintain that same customer satisfaction that we served and still serve to some of the same clients for all these years. Clients who turned this little linen rental company into a premiere fully equipped party rental company. If you want to pick up the phone and speak to a rental expert and place your order over the phone without an automated answering machine and speak to someone directly and quickly you have that option. If you want to send your order by email and don’t have time to talk you have that option as well. Our new website makes finding what you want and ordering or getting quotes fast and easy. There is no need to sign in, and register, no credit cards or memberships, Simply browse, shop and get a hassle free quote. The index we developed is a helpful tool to help find an item quickly. If you want a cozy intimate cocktail party at home, or a massive fund raiser for 500 in a space in NYC, or a spectacular wedding at any premier venues in the Tri State area. The Khans at New York Party & Linen Rentals are here. SERVICE, QUALITY, & STYLE - ITS WHAT WE DO & WHO WE ARE New York City Location We Deliver Only No Will Call 610 West 26th Street New York, NY 10001 212-222-1185 New Jersey Warehouse 1126 Grove Street Irvington NJ 07111 973-399-4700 About Us About N Y Party Rentals Photo Gallery Photo Gallery 2 Blogs Glossary Online Help COVID-19 Advisory Rental Tips FAQ Credit Card Form Contact Us sales@nypartyrentalsllc.com kathy.nylpr@gmail.com johnnypr1126@gmail.com © 2021 New York Party Rentals, LLC. All Rights Reserved. Products FAQ About Photos Rental Policy Email × product(s) added to cart → × ×"
    },
    {
      "url": "https://spacecoastpartyrentals.com/bounce-house-palm-bay-in-palm-bay-fl/",
      "text": "Bounce house palm bay in Palm Bay , FL - Space Coast Party Rentals Palm Bay FL (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Home » Bounce house palm bay in Palm Bay , FL Bounce house palm bay Palm Bay , FL Discover the power of Bounce house palm bays in the heart of Palm Bay , FL. Space Coast Party Rentals has been providing the best inventory to the Palm Bay , FL area for a long time, so you can trust us with handling your bounce house palm bay needs. We’ve done a large amount of events in the past several years from small to big, but all are handled with the best care. So don’t hesitate to hire us for your next event. You may want to consider these other items in Palm Bay , FL: Bounce house rental , Water slide , Inflatable , Brevard County , Palm Bay , Florida , Fun , Water slide rental , Water slides , Melbourne , Party Rentals , Bounce House , Waterslide near me , Space Coast , Space Coast Party Rental , Bounce House Near Me , tables chairs rental , waterslide Palm bay Bounce house palm bay Palm Bay , FL In addition to offering #1 bounce house palm bays in Palm Bay , FL, we also offer: Brevard County . So if your kids are tired of this year, then you might consider Space Coast Party Rentals for your next event so they can have a party with their friends outside in the backyard. We have such a big selection so, be sure to check out all of our inventory. 5.0 of 5 “Thank you! A great company to work with!” – Joel A. Space Coast Party Rentals serves up the best bounce house palm bays. Space Coast Party Rentals has everything you need to throw awesome, once in a lifetime parties. Whether it’s in your backyard or a large company event, we want to make sure your event is a fun, relaxing experience from beginning to end. View Products Slides & Combos Slides & Combos is a dynamic rental attraction that mixes the fun of sliding with interactive play elements. It turns any event into an energetic playground where kids and families can enjoy a burst of excitement. Palm Bay , Melbourne, and surrounding cities in Brevard County View Products Bounce Houses Inflatable bounce houses are great to get some energy out. We also offer combo bouncers that will have thing like a basketball hoop or slide built right inside with a bounce area! We specialize in bounce house rentals and will be happy to accommodate your event needs. View Products Water Slides Water rides and water slides are a great way to cool down on a hot summer day! Get wet and have fun with these fun water slides and bouncers. Serving Palm Bay , Melbourne, and surround cities in Brevard & Indian River Counties. View Products Concessions Concession machines are a must for parties to provide a light snack or a way to cool off with a sno cone after all the fun. These machines can be operated by staff or volunteers. View Products Tables & Chairs Tables & Chairs provide a practical and stylish seating and dining setup, perfect for turning any event or gathering into a welcoming space. They’re all about taking the hassle out of hosting so you can focus on having fun. View Products Tents Large tents to provide shade or cover if it rains is a smart way to be prepared for all kinds of weather. Tables can be placed under the tents or away. We offer a huge variety of tents and all our equipment is cleaned and inspected regularly. View Products Foam Party Cannon Get ready to turn any event into a frothy, fun-filled extravaganza with the Foam Party Cannon! This fantastic rental blasts mountains of foam, perfect for dancing, playing, and making unforgettable memories. View Products Bartending Services by Salty Mama Enjoy professional bartending services that bring expertly mixed cocktails and a lively vibe to your event. Perfect for parties and gatherings, these services ensure every drink is crafted with care and flair to elevate your celebration. Are you planning an outdoor get together? Space Coast Party Rentals has everything you need to make it a huge success. Our selection of bounce house palm bays are unmatched in the area, and our staff is constantly available to assist you with delivery, set-up, and clean-up. Contact us today to learn more! Space Coast Party Rentals is your top notch source for bounce house palm bays. We pride ourselves in providing the absolute best for your money in the area. With every rental and every event, we focus in on providing world-class service so you can focus on hosting. We also pride ourselves in providing clean and safe equipment at the most competitive pricing around. Each rental is cleaned and sanitized after every usage ensuring satisfaction.  We always follow the strictest safety guidelines and we absolutely will not sacrifice your safety for more business. Space Coast Party Rentals rents all sorts of equipment, including: Bounce House . While we are focused on bounce house palm bays, you can also rent other items. If you just want a bounce house palm bay for your own house, at a park, or inside – we can do that. We also do larger event rentals for companies, schools, and festivals. Give us a call if you want a quote. Space Coast Party Rentals is redefining the potential of bounce house palm bay. (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://spacecoastpartyrentals.com/rentals/",
      "text": "Inventory - Space Coast Party Rentals Palm Bay FL (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Home » Inventory items Set Event Date Inventory for Rent Inventory Professional delivery to Grant, FL , Indian Harbor Beach, FL , Melbourne, FL , Palm Bay , FL , Sebastian, FL and surrounding areas. Please submit a quote or contact us to be sure we service your area. View Products Slides & Combos Slides & Combos is a dynamic rental attraction that mixes the fun of sliding with interactive play elements. It turns any event into an energetic playground where kids and families can enjoy a burst of excitement. Palm Bay , Melbourne, and surrounding cities in Brevard County View Products Bounce Houses Inflatable bounce houses are great to get some energy out. We also offer combo bouncers that will have thing like a basketball hoop or slide built right inside with a bounce area! We specialize in bounce house rentals and will be happy to accommodate your event needs. View Products Water Slides Water rides and water slides are a great way to cool down on a hot summer day! Get wet and have fun with these fun water slides and bouncers. Serving Palm Bay , Melbourne, and surround cities in Brevard & Indian River Counties. View Products Concessions Concession machines are a must for parties to provide a light snack or a way to cool off with a sno cone after all the fun. These machines can be operated by staff or volunteers. View Products Tables & Chairs Tables & Chairs provide a practical and stylish seating and dining setup, perfect for turning any event or gathering into a welcoming space. They’re all about taking the hassle out of hosting so you can focus on having fun. View Products Tents Large tents to provide shade or cover if it rains is a smart way to be prepared for all kinds of weather. Tables can be placed under the tents or away. We offer a huge variety of tents and all our equipment is cleaned and inspected regularly. View Products Foam Party Cannon Get ready to turn any event into a frothy, fun-filled extravaganza with the Foam Party Cannon! This fantastic rental blasts mountains of foam, perfect for dancing, playing, and making unforgettable memories. View Products Bartending Services by Salty Mama Enjoy professional bartending services that bring expertly mixed cocktails and a lively vibe to your event. Perfect for parties and gatherings, these services ensure every drink is crafted with care and flair to elevate your celebration. (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://www.spacecoasthabitat.org/about-us/meet-the-team/",
      "text": "Mission - Space Coast Habitat for Humanity Skip to content Search ... Results All Results (321) 728-4009 info@spacecoasthabitat.com Habitat Restore What’s a ReStore? Donate to the ReStore What We Accept Donation Pickups Donate Monetary Donations Cars for Homes Corporate Sponsorships Planned Giving Property ReStore Items Programs Homeownership Critical Home Repairs 1 Year Warranty Volunteer Individual Group Corporate Sponsorships Registration Home Builds Corporate Build Faith Build Veteran Build Women Build Events Current Past About Us Mission Staff & Board of Directors Frequently Asked Questions Financials Habitat Restore What’s a ReStore? Donate to the ReStore What We Accept Donation Pickups Donate Monetary Donations Cars for Homes Corporate Sponsorships Planned Giving Property ReStore Items Programs Homeownership Critical Home Repairs 1 Year Warranty Volunteer Individual Group Corporate Sponsorships Registration Home Builds Corporate Build Faith Build Veteran Build Women Build Events Current Past About Us Mission Staff & Board of Directors Frequently Asked Questions Financials Volunteer Donate Habitat Restore What’s a ReStore? Donate to the ReStore What We Accept Donation Pickups Donate Monetary Donations Cars for Homes Corporate Sponsorships Planned Giving Property ReStore Items Programs Homeownership Critical Home Repairs 1 Year Warranty Volunteer Individual Group Corporate Sponsorships Registration Home Builds Corporate Build Faith Build Veteran Build Women Build Events Current Past About Us Mission Staff & Board of Directors Frequently Asked Questions Financials Habitat Restore What’s a ReStore? Donate to the ReStore What We Accept Donation Pickups Donate Monetary Donations Cars for Homes Corporate Sponsorships Planned Giving Property ReStore Items Programs Homeownership Critical Home Repairs 1 Year Warranty Volunteer Individual Group Corporate Sponsorships Registration Home Builds Corporate Build Faith Build Veteran Build Women Build Events Current Past About Us Mission Staff & Board of Directors Frequently Asked Questions Financials Mission Space Coast Habitat offers a hand up, not a hand out. Our success in making the dream of homeownership a reality is a direct result of our volunteers and donors. Everyone Deserves... Space Coast Habitat for Humanity, Inc. (SCHFH), a locally run affiliate of Habitat for Humanity International, is a part of a global nonprofit housing organization operated on Christian principles that seeks to put God’s love into action by building homes, communities and hope. Our Mission: Seeking to put God’s love into action, Habitat for Humanity brings people together to build homes, communities and hope. Our Vision: A world where everyone has a decent place to live. Space Coast Habitat has served more than 607 families in 40 years and is designated as a Veteran Build affiliate - proudly serving the veterans in our community. Our Programs: First Time Homebuyer Program Critical Home Repair and Home Preservation Rock the Block For more information or to conduct a pre-screening contact our Neighborhood Revitalization Coordinator (321) 728 4009 x106 Annual Sponsors Facebook-f Instagram Youtube Linkedin-in Quick Links Habitat Restore Donate Programs Home Builds Volunteer Events About Us Habitat Restore Donate Programs Home Builds Volunteer Events About Us Contact (321) 728-4009 4515 S Babcock St. Palm Bay, FL 32905 Subscribe Sign up to receive the latest updates and news from Space Coast Habitat for Humanity. Email Address Subscribe Email (required) * Select list(s) to subscribe to Online Subscriptions Example: Yes, I would like to receive emails from Space Coast Habitat for Humanity. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: . You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact © 2025 Space Coast Habitat for Humanity, Inc. All Rights Reserved."
    },
    {
      "url": "https://spacecoastpartyrentals.com/tables-chairs-rental-in-melbourne-fl/",
      "text": "Tables chairs rental in Melbourne, FL - Space Coast Party Rentals Palm Bay FL (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Home » Tables chairs rental in Melbourne, FL Tables chairs rental Melbourne, FL Space Coast Party Rentals is redefining the possibilities of tables chairs rental. Our tables chairs rentals are available for rent around Melbourne, FL. So if you are planning to have a party in Melbourne, FL , you should definitely consider hiring us for your tables chairs rental. Perfect parties like the one you are planning need #1 equipment, and you can get that from Space Coast Party Rentals. When it comes to Tables chairs rentals, Space Coast Party Rentals is at the forefront in Melbourne, FL. We have everything needed to host incredible, once in a lifetime parties. Whether it’s in your backyard or a large corporate event, we specialize in making sure your event is a fun, relaxing experience from beginning to end. Space Coast Party Rentals rents out all sorts of stuff, including: Palm Bay . While we focus on tables chairs rentals, you can also rent other equipment. If you just want a tables chairs rental for your own back-yard, at a park, or indoor – we can do that. We also do larger event rentals for companies, schools, or festivals. Give us a call if you have questions. View Products Slides & Combos Slides & Combos is a dynamic rental attraction that mixes the fun of sliding with interactive play elements. It turns any event into an energetic playground where kids and families can enjoy a burst of excitement. Palm Bay , Melbourne, and surrounding cities in Brevard County View Products Bounce Houses Inflatable bounce houses are great to get some energy out. We also offer combo bouncers that will have thing like a basketball hoop or slide built right inside with a bounce area! We specialize in bounce house rentals and will be happy to accommodate your event needs. View Products Water Slides Water rides and water slides are a great way to cool down on a hot summer day! Get wet and have fun with these fun water slides and bouncers. Serving Palm Bay , Melbourne, and surround cities in Brevard & Indian River Counties. View Products Concessions Concession machines are a must for parties to provide a light snack or a way to cool off with a sno cone after all the fun. These machines can be operated by staff or volunteers. View Products Tables & Chairs Tables & Chairs provide a practical and stylish seating and dining setup, perfect for turning any event or gathering into a welcoming space. They’re all about taking the hassle out of hosting so you can focus on having fun. View Products Tents Large tents to provide shade or cover if it rains is a smart way to be prepared for all kinds of weather. Tables can be placed under the tents or away. We offer a huge variety of tents and all our equipment is cleaned and inspected regularly. View Products Foam Party Cannon Get ready to turn any event into a frothy, fun-filled extravaganza with the Foam Party Cannon! This fantastic rental blasts mountains of foam, perfect for dancing, playing, and making unforgettable memories. View Products Bartending Services by Salty Mama Enjoy professional bartending services that bring expertly mixed cocktails and a lively vibe to your event. Perfect for parties and gatherings, these services ensure every drink is crafted with care and flair to elevate your celebration. Embrace the progress with Tables chairs rental from Space Coast Party Rentals in Melbourne, FL. You may want to check-out these other items in Melbourne, FL: Bounce house rental , Water slide , Inflatable , Brevard County , Palm Bay , Florida , Fun , Water slide rental , Water slides , Melbourne , Party Rentals , Bounce House , Waterslide near me , Space Coast , Space Coast Party Rental , Bounce House Near Me 5.0 of 5 “Thank you! A great company to work with!” – Joel A. Are you organizing an outdoor party? Space Coast Party Rentals offers all the equipment you need to make it a huge success. Our selection of tables chairs rentals is  highly regarded in the area, and our staff is constantly ready to assist you with delivery, set-up, and clean-up. Contact us today to learn more! Space Coast Party Rentals: Leading the Tables chairs rental industry in Melbourne, FL. Thinking about throwing an unforgettable event? Look no further, we’ve got you covered! With everything needed, we can help make your event truly special. Whether it’s intimate get-togethers or big corporate parties, we have the equipment to suit your needs. In addition to offering the best tables chairs rentals in Melbourne, FL, we also offer: Inflatable . So if your children are tired of this year, then you should consider Space Coast Party Rentals for your next party so they can have fun with their friends outside in the backyard. We have a huge selection so, be sure to check out all of our rentals. (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/melbourne/wedding-services/chairs-for-affairs-party-rentals/",
      "text": "Chairs For Affairs Party Rentals - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Chairs For Affairs Party Rentals Add to Wishlist Chairs For Affairs Party Rentals Proudly serving the Space Coast since 1997, Chair for Affairs Party Rentals is your one-stop shop for all your event needs. The friendly and knowledgeable staff helps you plan your wedding, family reunion, corporate party, or any other event so everything goes off without a hitch. So whether you are planning ahead or trying to put something together last minute, Chairs for Affairs has you covered. Add to Trip Visit Website Direction 357 N Babcock Street Melbourne, FL 32935 Contact (321)-259-8252 Discover More nearMelbourne and the Beaches All Hotels Restaurants Events Add to Wishlist Drews Brews and Grille Melbourne and the Beaches We have just update our menu and want to promote our “Burger of the Month” along with our new menu that includes TONS of homemade foodie items! We are now hosting NFL Game nights and have special pricing and happy offerings to go along with that. Add to Trip Add to Wishlist Longboards Oceanfront Grille Melbourne and the Beaches Celebrate the tastes of the season with every ocean breeze and sizzling sunset! This fall, Longboards Oceanfront Grille invites food lovers to indulge in our newest dinner menu—and earn a complimentary treat to share. When you purchase two entrees from the new dinner lineup, choose from a free appetizer or… Add to Trip Add to Wishlist Hell ’n Blazes Brewing Company Melbourne and the Beaches Hell ’n Blazes is known for our smoked meats, juicy burgers, and elevated entrées—plus award-winning craft brews that earned us Best Medium Brewery in Florida. Our Ringer Burger, a fan-favorite 75/25 steak burger $21, is a must-try, and you’ll want to pair it with our decadent Brownie Skillet (shareable for… Add to Trip Add to Wishlist Jacqueline’s Bakery Melbourne and the Beaches Jacqueline’s Bakery brings the flavors of France to Melbourne, FL. Founded by Jacqueline & Christophe, Paris-trained chefs, the bakery is known for authentic croissants, éclairs, macarons, quiches, and baguette sandwiches. With locations in Historic Downtown Melbourne (906 E New Haven Ave, 32901 – (7:30am-8:30pm) & Suntree (6977 N. Wickham Rd,… Add to Trip Add to Wishlist Bistro Melbourne and the Beaches Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera Melbourne and the Beaches A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your… Add to Trip Add to Wishlist Rustic (Hilton Melbourne) Melbourne and the Beaches Celebrate the flavors of fall with a $49 prix fixe feast. Begin with comforting bites. For the main event, enjoy hearty seasonal dishes that balance savory richness with autumn’s warm, comforting notes. End on a sweet note with decadent chocolate cake or warm apple crumb cobbler à la mode. Each… Add to Trip Add to Wishlist Meg O’Malley’s Irish Pub & Restaurant Melbourne and the Beaches Lovely Beginning: SCOTCH EGG – Soft-boiled egg wrapped in ground sausage, breaded, fried, served with Dubliner cheese, pickled red onions, and Irish mustard horseradish sauce. Main: SMOKED SALMON & DUMPLINGS – Tender potato dumplings tossed in an Irish smoked salmon, rasher, bacon, and spinach cream sauce. Topped with imported parmesan… Add to Trip Add to Wishlist Osuki Sushi Melbourne and the Beaches Mon-Fri Lunch: $22.95 Dinner and Saturday,Sunday: $31.95 For All You Can Eat! Add to Trip Add to Wishlist The Mansion Melbourne and the Beaches At The Mansion, guests are invited to enjoy an unforgettable dining experience in one of Melbourne’s most unique and historic venues. For a limited time, we are offering a prix fixe menu that showcases some of our most popular items. Begin with your choice of a Mansion classic  Tavern Salad or… Add to Trip Add to Wishlist Hemingway’s Tavern Melbourne and the Beaches 3 for $50. No substitutions. Smoked Tavern Wings: Chicken wings seasoned, smoked, fried crispy, and tossed in your choice of guava BBQ, hot honey, buffalo jerk, Tuscan parmesan, or pineapple cilantro chili. Snapper Hemingway: Pan-fried panko-crusted snapper fillet topped with lump crab meat beurre blanc and served with rice caribe… Add to Trip Add to Wishlist Cedars Cafe Melbourne and the Beaches At Cedars Cafe, you can always expect the unexpected. Stop in this fall for a revolving Prix Fixe menu prepared from scratch with fresh, seasonal, local foods. Enjoy a new, artful 3-course menu for $45 that changes bi-weekly. Check out our Facebook page for updated menu offerings! Add to Trip Add to Wishlist American Cab Co Cocoa Beach American Cab is the trusted transportation partner for airports, train stations, bus stations, theme parks, or cruise terminals. Reliable and secure cab services are offered to all destinations in Brevard County and beyond. Enjoy door-to-door service, flat rates to local airports and attractions, and the peace of mind of traveling… Add to Trip Add to Wishlist The Glitz & Glam of Art Melbourne and the Beaches The Glitz & Glam of Art is a new glitter paint studio located in Melbourne Florida off US1. We offer glitter canvas painting, wine glass painting workshops & rock painting. These services are offered to families & customers of all ages. No Experience necessary as there will be a guided… Add to Trip Add to Wishlist Aves’ Place Melbourne and the Beaches Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Name This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://admin.lmu.edu/ue/contactus/",
      "text": "Contact Us - Loyola Marymount University Skip to Search Skip to Main Content Skip to Footer Links LMU - Loyola Marymount University logo Overnight Groups Overnight Groups Accommodations Meeting Spaces Plan a Conference Guest FAQs Catering & Food Services Area Attractions Welcome Guide Meetings & Events Meetings & Events Plan an Event Local Hotels Vendor Spaces Meeting Spaces Student Jobs Contact Us Apply Visit Give Menu Open Menu Close Search Open Search Close Apply Visit Give Overnight Groups Toggle Subnav Overnight Groups Accommodations Meeting Spaces Plan a Conference Guest FAQs Catering & Food Services Area Attractions Welcome Guide Meetings & Events Toggle Subnav Meetings & Events Plan an Event Local Hotels Vendor Spaces Meeting Spaces Student Jobs Contact Us Search Submit LMU - Loyola Marymount University logo Overnight Groups Overnight Groups Accommodations Meeting Spaces Plan a Conference Guest FAQs Catering & Food Services Area Attractions Welcome Guide Meetings & Events Meetings & Events Plan an Event Local Hotels Vendor Spaces Meeting Spaces Student Jobs Contact Us Apply Visit Give Menu Open Menu Close Search Open Search Close Apply Visit Give Overnight Groups Toggle Subnav Overnight Groups Accommodations Meeting Spaces Plan a Conference Guest FAQs Catering & Food Services Area Attractions Welcome Guide Meetings & Events Toggle Subnav Meetings & Events Plan an Event Local Hotels Vendor Spaces Meeting Spaces Student Jobs Contact Us Search Submit admin.lmu.edu > University Events > Contact Us Contact Us University Events Loyola Marymount University 1 LMU Drive, MS 8150 Los Angeles, CA 90045 310-338-2878 Option 1: Scheduling Option 2: Event Operations, Main Campus Option 3: Event Operations, University Hall Option 4: Inquiries for External Organizations View campus maps and directions For external organization inquiries, please contact conference@lmu.edu . For LMU scheduling/reservation inquiries, please contact scheduling@lmu.edu . In order to provide you with the most accurate information on our space rentals, availability, and pricing, we ask that you please send an email to conference@lmu.edu containing as much detailed information regarding your conference or event as soon as possible. Once submitted, you will be contacted by one of our staff members, who will be happy to assist you regarding your request. You can expect to hear back from us within 48 hours, or no later than the end of the work-week. Thank you for your interest in LMU and we look forward to working with you! Staff Our department runs on the efforts of a dedicated team of administrative, managerial, and logistical staff, including 100+ student employees who assist in our daily operations. From a small meeting to a large conference, you can always count on our team to provide complete and professional support for any on-campus event. TBD, Director of Conference and Event Services Nidia Callejas , Administrative Coordinator Kathryn Turner , Assistant Director of Event Management Claudia Borja , Event Manager James Venegas , Event Manager Michelle Fernandez , Event Manager Nicholas Cole , Event Manager Andrew Barth , Event Operations Coordinator Gian Santomieri , Event Operations Coordinator Jo Gonzalez , Assistant Director of Business Operations Brigitte Dahrouj , Business Operations Coordinator Kellie McDonald , Assistant Director of Event Scheduling Cloe Fields, Event Scheduling Coordinator Samantha Zendejas , Event Scheduling Coordinator Trish Carlson, Senior Director of Signature Events Agnes Rutkai , Senior Event Producer Danielle Federico , Senior Event Producer Lauren Ballesteros Rawlings , Senior Event Producer, Presidential Events LMU Logo Find Us Westchester Main Campus 1 LMU Drive Los Angeles, CA 90045 310.338.2700 Downtown Law Campus 919 Albany Street Los Angeles, CA 90015 213.736.1000 Playa Vista Campus 12105 E. Waterfront Drive, Suite 200 Playa Vista, CA 90094 310.338.2700 youtube facebook instagram linkedin tiktok Visit Campus Take Action Apply for Admission Apply for Employment Emergency Information Make a Gift Request Information Visit Campus Contact Us Colleges and Schools LMU Bellarmine College of Liberal Arts LMU College of Business Administration LMU College of Communication and Fine Arts LMU Frank R. Seaver College of Science and Engineering LMU Loyola Law School LMU School of Education LMU School of Film and Television Explore LMU Essentials Academic Calendar All Degrees and Programs Continuing Education Our Catholic Mission Student Affairs Division University Library Explore Athletics Event Calendar LMU Facts and Figures LMU Magazine Maps and Parking Newsroom Resources Information For Alumni Community and Neighbors Media Resources Prospective Students and Families Administrative Copyright En Español Directory MYLMU Site Index Terms of Service Text-Only View LMU.edu Title IX Web Accessibility Statement Privacy Policy © Loyola Marymount University"
    },
    {
      "url": "https://spacecoastpartyrentals.com/bounce-house-near-me-in-melbourne-fl/",
      "text": "Bounce house near me in Melbourne, FL - Space Coast Party Rentals Palm Bay FL (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Home » Bounce house near me in Melbourne, FL View Products Slides & Combos Slides & Combos is a dynamic rental attraction that mixes the fun of sliding with interactive play elements. It turns any event into an energetic playground where kids and families can enjoy a burst of excitement. Palm Bay , Melbourne, and surrounding cities in Brevard County View Products Bounce Houses Inflatable bounce houses are great to get some energy out. We also offer combo bouncers that will have thing like a basketball hoop or slide built right inside with a bounce area! We specialize in bounce house rentals and will be happy to accommodate your event needs. View Products Water Slides Water rides and water slides are a great way to cool down on a hot summer day! Get wet and have fun with these fun water slides and bouncers. Serving Palm Bay , Melbourne, and surround cities in Brevard & Indian River Counties. View Products Concessions Concession machines are a must for parties to provide a light snack or a way to cool off with a sno cone after all the fun. These machines can be operated by staff or volunteers. View Products Tables & Chairs Tables & Chairs provide a practical and stylish seating and dining setup, perfect for turning any event or gathering into a welcoming space. They’re all about taking the hassle out of hosting so you can focus on having fun. View Products Tents Large tents to provide shade or cover if it rains is a smart way to be prepared for all kinds of weather. Tables can be placed under the tents or away. We offer a huge variety of tents and all our equipment is cleaned and inspected regularly. View Products Foam Party Cannon Get ready to turn any event into a frothy, fun-filled extravaganza with the Foam Party Cannon! This fantastic rental blasts mountains of foam, perfect for dancing, playing, and making unforgettable memories. View Products Bartending Services by Salty Mama Enjoy professional bartending services that bring expertly mixed cocktails and a lively vibe to your event. Perfect for parties and gatherings, these services ensure every drink is crafted with care and flair to elevate your celebration. In addition to offering high quality bounce house near mes  in Melbourne, FL, we also offer: Waterslide near me . So if your children are bored this year, then you might want to consider Space Coast Party Rentals for your next rental so they can have a blast with their friends outside. We have such a big selection so, check out all of our inventory. You might want to check-out these other items in Melbourne, FL: Bounce house rental , Water slide , Inflatable , Brevard County , Palm Bay , Florida , Fun , Water slide rental , Water slides , Melbourne , Party Rentals , Bounce House , Waterslide near me , Space Coast , Space Coast Party Rental We have everything needed to throw unforgettable, once in a lifetime parties. Whether it’s in your backyard or a huge company event, we want to make sure your event is a fun, relaxing experience from start to finish. Are you planning a backyard event? Space Coast Party Rentals has everything you need to make it a huge success. Our inventory of bounce house near mes  are  highly regarded in the region, and our team is constantly ready to assist you with delivery, set-up, and clean-up. Contact us today to learn more! Our bounce house near mes  are available for rent around Melbourne, FL. So if you are planning to have a get-together in Melbourne, FL , you should definitely consider hiring us for your bounce house near me. High quality parties like the one you are planning need high quality equipment, and you can get that from Space Coast Party Rentals. Thinking about throwing a memorable party? Space Coast Party Rentals has got you covered! With all the resources needed, we can help make your event truly unique. Whether it’s small get-togethers or big company parties, we offer a wide range of equipment to suit your needs. Space Coast Party Rentals is your source for high quality bounce house near mes . (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://members.spacecoastmls.com/contactus",
      "text": "Contact Us - Space Coast Association of REALTORS® Launch Pad This website uses cookies to ensure you get the best experience on our website. By using our website, you consent to all cookies in accordance with our Cookie Policy. Learn more OK Skip to main content (Press Enter). Member Login Skip auxiliary navigation (Press Enter). Contact Us Terms and Conditions Launching News &  More for our Members Skip main navigation (Press Enter). Toggle navigation Home Communities All Communities Directory Member Directory Company Directory Events Upcoming Events Education Calendar Resources Space Coast MLS Policy Changes Government Resources Blogs The Facts for REALTORS® Rocket Pass Program Help About SpaceCoastMLS.com About Your Member Portal Access FAQs Return To Public Contact Us Contact Us Space Coast Association of REALTORS® 2950 Pineda Plaza Way Palm Shores FL 32940 U.S.A. Phone: 321-242-2211 FAX: 321-255-7669 email: communications@space321.com Contact Us Space Coast Association of REALTORS® 2950 Pineda Plaza Way Palm Shores, FL 32940 Office: 321-242-2211 | Fax: 321-255-7669 Stay Connected Privacy Policy Copyright 2019. Space Coast Association of REALTORS®. All rights reserved. Powered by Higher Logic"
    },
    {
      "url": "https://spacecoastpartyrentals.com/rentals/water-rides/",
      "text": "Water Slides - Space Coast Party Rentals Palm Bay FL (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Home » Inventory » Water Slides items Set Event Date Water Slides for Rent 120933 Water rides and water slides are a great way to cool down on a hot summer day! Get wet and have fun with these fun water slides and bouncers. Serving Palm Bay , Melbourne, and surround cities in Brevard & Indian River Counties. Professional delivery to Indian Harbor Beach, FL , Melbourne, FL , Palm Bay , FL , Sebastian, FL , Grant, FL and surrounding areas. Please submit a quote or contact us to be sure we service your area. Imagine cooling off on a water slide that turns any event into a splash-tastic party. This rental brings laughter, thrilling descents, and refreshing fun to birthdays, community events, or backyard gatherings. Easy to set up and safe for everyone, it’s the perfect way to beat the heat while making unforgettable memories with friends and family. View Product 17ft Electric Palm Double Lane Waterslide 17ft+Electric+Palm+Double+Lane+Waterslide https://spacecoastpartyrentals.com/rentals/bounce-houses/17-electric-palm-double-lane-waterslide/ 2404415 Limited Dropdown 1 0 from $265.00 item unavailable (change date) View Product 19ft Blue Tsunami Waterslide 19ft+Blue+Tsunami+Waterslide https://spacecoastpartyrentals.com/rentals/water-rides/19ft-blue-tsunami-waterslide/ 2739683 Limited Dropdown 1 0 from $245.00 item unavailable (change date) View Product 22ft Red Rush Waterslide 22ft+Red+Rush+Waterslide https://spacecoastpartyrentals.com/rentals/water-rides/22ft-red-rush-waterslide/ 1585673 Limited Dropdown 1 0 from $285.00 item unavailable (change date) View Product 19ft Orange Glacier Waterslide 19ft+Orange+Glacier+Waterslide https://spacecoastpartyrentals.com/rentals/water-rides/19ft-orange-glacier-waterslide/ 1711981 Limited Dropdown 1 0 from $245.00 item unavailable (change date) View Product 18ft Tropical Waterslide 18ft+Tropical+Waterslide https://spacecoastpartyrentals.com/rentals/water-rides/18ft-tropical-waterslide/ 1585669 Limited Dropdown 1 0 from $199.00 item unavailable (change date) (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://cosmo.org/visit/rentals/",
      "text": "Event Rentals - Cosmosphere Skip to content The Planetarium is currently closed for maintenance – all other venues are open. Events Support Support Cosmosphere Be a Volunteer Be a Member Corporate Partners About About the Cosmosphere Leadership Governing Board Foundation Board Staff World-Class Collection Blog News & Events SpaceWorks Careers Media Contact Us Annual Report Shop Events Support Support Cosmosphere Be a Volunteer Be a Member Corporate Partners About About the Cosmosphere Leadership Governing Board Foundation Board Staff World-Class Collection Blog News & Events SpaceWorks Careers Media Contact Us Annual Report Shop 800.397.0330 Search Today 9am-5pm Today 9am-5pm Visit Plan Your Visit Group Tickets Map FAQ Event Rentals Birthday Parties Shop Dine Special Offers Explore Attractions Hall of Space Museum Carey Digital Dome Theater Justice Planetarium Dr. Goddard’s Lab CosmoKids Upcoming Events Virtual Collection Learn Cosmosphere Education Field Trips LaunchLearning Resources Youth Organizations Camps Cosmosphere Camps CosmoCamps Alumni Meet the Crew Scholarships Camper Portal Support Support Cosmosphere Be a Volunteer Be a Member Corporate Partners About About the Cosmosphere Leadership Governing Board Foundation Board Staff World-Class Collection Blog News & Events SpaceWorks Careers Media Contact Us Shop Buy Tickets Donate Visit Plan Your Visit Group Tickets Map FAQ Event Rentals Birthday Parties Shop Dine Special Offers Explore Attractions Hall of Space Museum Carey Digital Dome Theater Justice Planetarium Dr. Goddard’s Lab CosmoKids Upcoming Events Virtual Collection Learn Cosmosphere Education Field Trips LaunchLearning Resources Youth Organizations Camps Cosmosphere Camps CosmoCamps Alumni Scholarships Camper Portal Camp Gear Store Visit Plan Your Visit Group Tickets Map FAQ Event Rentals Birthday Parties Shop Dine Special Offers Explore Attractions Hall of Space Museum Carey Digital Dome Theater Justice Planetarium Dr. Goddard’s Lab CosmoKids Upcoming Events Virtual Collection Learn Cosmosphere Education Field Trips LaunchLearning Resources Youth Organizations Camps Cosmosphere Camps CosmoCamps Alumni Scholarships Camper Portal Camp Gear Store Buy Tickets Donate Event Rentals Do you need event space? Cosmosphere is known for space…and rooms to rent! Out-of-this-world birthday parties? Absolutely! Transformative board retreats? Nothing like looking out the board room window over an SR-71 to put planning in perspective. Call 620.665.9304 and our event staff will help meet your event needs. Full Facility Rental Capacity: 430 Private access to the entire Cosmosphere! This includes the Hall of Space Museum, Carey Digital Dome Theater and Planetarium Theater. We’ll help you customize the options to create the perfect event.* Available from 5:00 pm to midnight. For rentals past midnight, additional fees will apply.** Price: $5,000 Grand Lobby Capacity: 250 seated round tables or 300 seated theater style Dimensions: 44’ x 110’ A majestic SR-71 mounted on pylons along with a T-38 suspended from the ceiling and a full-scale replica of the space shuttle Endeavour, create a sense of awe for your guests enjoying the 4,840 sq. ft. of inspiring space in the Grand Lobby minimizing the need for extensive decoration.* Price: $1,500 Banquet Room Capacity: 150 seated round tables or 200 seated theater style Dimensions: 41’ x 51’ Located just off the Grand Lobby, this 2,090 sq. ft. room with 20 ft. ceiling is equipped with a full range of audio/video capabilities, including Wi-Fi. A small kitchen is also available.* The Banquet Room is not available for rent April through the first week of August. Price: $400 Observation Deck Capacity: 30 +/- seated round tables Dimensions: 17’ x 56’ This 950 sq. ft. second floor balcony excites imagination with its terrific view of the Grand Lobby, the SR-71, T-38 and space shuttle Endeavour replica.* Price: $250 Fee Family Learning Center Capacity: 100 seated round tables or 150 seated theater style Dimensions : 24’ x 51’ Hold your event in front of a full-scale replica of the International Space Station and beneath a star-lit canopy. Located on the second level, this 1,224 sq. ft. private room is equipped with a full range of audio/video capabilities.* (Limited availability.) Price: $300 Neal Family Learning Center Capacity: 40 Dimension: 29′ x 35′ Hold your next work retreat in the only room in Kansas that features a Cosmonaut spacesuit in its décor! The Neal Family Classroom offers an AV Projection system and seating and work tables that can be configured for a variety of purposes. Price: $200 Executive Board Room Capacity: 16 Dimensions: 15′ × 30′ With a view overlooking the Grand Lobby, this 450 sq. ft. private room is perfect for meetings. A wet bar, large screen television with computer display access, media and broadcast capabilities, Wi-Fi, conference calling capability, full-length dry erase board and comfortable chairs complete this room.* Price: $200 Carey Digital Dome Theater Buyout Capacity: 110 The Carey Digital Dome Theater features a two-story Dome with a 4K digital projection system that creates an incredible movie-viewing experience for your  group.* Price: $660 Dr. Goddard's Lab Buyout Capacity: 80 What gathering is complete without an explosion? In the John and Billie Turner Dr. Goddard’s Lab, your group can experience an interactive live science demonstration based on the experiments of Dr. Robert Goddard, the father of modern rocketry.* Price: $500 Justice Planetarium Buyout Capacity: 110 The Walter and Velma Justice Planetarium is a state-of-the-art, digital dual projector experience that brings the science of the universe to life.* Price: $660 *Chairs and tables pictured are standard equipment. In-house equipment for rentals includes: tables, chairs, podium, built-in screens. Decor and linens are not included. Rentals also include setup and teardown at no charge. Other items are available at a nominal fee. You and your guests will receive complimentary passes into the Hall of Space Museum on the day of your rental. *After-hours fee: $50 per hour after 8:00 pm. **After Midnight fee: $50 per hour. Questions about Rentals? Call Us 620.665.9304 direct 800.397.0330 x304 toll-free Email Us rentals@cosmo.org or use below contact form \" * \" indicates required fields Contact Information First Name * Last Name * Contact Email * Phone * Event Information Name/Type of Event * First choice for the Event Date * MM slash DD slash YYYY Second choice for the Event Date MM slash DD slash YYYY Billing Address * Street Address Address Line 2 City Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah U.S. Virgin Islands Vermont Virginia Washington West Virginia Wisconsin Wyoming Armed Forces Americas Armed Forces Europe Armed Forces Pacific State ZIP Code What time will you plan to arrive? * Hours : Minutes AM PM AM/PM What time will your event start? * Hours : Minutes AM PM AM/PM What time will your event end? * Hours : Minutes AM PM AM/PM What time will you plan to leave? * Hours : Minutes AM PM AM/PM What is the total # of people expected at your event? Will there be a caterer? * No Yes Caterer Name * Will you be serving alcohol? * No Yes Please let us know if you have any other questions/comments about this future event. Inspire the future through space exploration. Sun 9am-5pm Mon-Tues Closed Wed-Thurs 9am-5pm Fri-Sat 9am-7pm 1100 N. Plum St. Hutchinson, KS 67501 800.397.0330 620.665.9312 Box Office Contact Us Online Sign Up for CosmoNews Facebook Instagram Youtube Linkedin Tripadvisor © 2025 Cosmosphere Sitemap Search Privacy Policy Sitemap Search Privacy Policy Interactive Agency: Howerton+White The renovated galleries in the Hall of Space are open. While many artifacts are on display during this time, the exhibits and graphics won’t be fully completed until Spring 2025. Learn More This website uses cookies and tracking technologies. By continuing, you agree to this use. View our Privacy Policy. Accept"
    },
    {
      "url": "https://spacecoastpartyrentals.com/",
      "text": "Space Coast Party Rentals Palm Bay FL - Party Rental and Bounce House Rental (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Palm Bay Party Rentals Bounce Houses Water Slides Combos We deliver CHECK FOR COUPONS What Our Customers Are Saying... Our Rentals We are your local go-to for inflatable, bounce house, and party rentals. Search for: View Products Slides & Combos Slides & Combos is a dynamic rental attraction that mixes the fun of sliding with interactive play elements. It turns any event into an energetic playground where kids and families can enjoy a burst of excitement. Palm Bay , Melbourne, and surrounding cities in Brevard County View Products Bounce Houses Inflatable bounce houses are great to get some energy out. We also offer combo bouncers that will have thing like a basketball hoop or slide built right inside with a bounce area! We specialize in bounce house rentals and will be happy to accommodate your event needs. View Products Water Slides Water rides and water slides are a great way to cool down on a hot summer day! Get wet and have fun with these fun water slides and bouncers. Serving Palm Bay , Melbourne, and surround cities in Brevard & Indian River Counties. View Products Concessions Concession machines are a must for parties to provide a light snack or a way to cool off with a sno cone after all the fun. These machines can be operated by staff or volunteers. View Products Tables & Chairs Tables & Chairs provide a practical and stylish seating and dining setup, perfect for turning any event or gathering into a welcoming space. They’re all about taking the hassle out of hosting so you can focus on having fun. View Products Tents Large tents to provide shade or cover if it rains is a smart way to be prepared for all kinds of weather. Tables can be placed under the tents or away. We offer a huge variety of tents and all our equipment is cleaned and inspected regularly. View Products Foam Party Cannon Get ready to turn any event into a frothy, fun-filled extravaganza with the Foam Party Cannon! This fantastic rental blasts mountains of foam, perfect for dancing, playing, and making unforgettable memories. View Products Bartending Services by Salty Mama Enjoy professional bartending services that bring expertly mixed cocktails and a lively vibe to your event. Perfect for parties and gatherings, these services ensure every drink is crafted with care and flair to elevate your celebration. Party Rentals Everything you need to throw the ultimate event. Browse Specials Combine rentals and accessories to save money. Browse Special Events We rent to events both big and small. Contact Us Who We Are Welcome to Space Coast Party Rentals, your GO TO SOURCE for inflatable and party rentals in Palm Bay, FL! As a proud family-owned small business, we understand the importance of creating unforgettable moments for you and your loved ones. Whether you’re planning a birthday party, community event, or any celebration, we have everything you need to make it a hit. Our extensive selection includes exciting waterslides, fun bounce houses, versatile tables and chairs, protective canopies, and even foam parties and snow cone machines to add that extra splash of fun! What sets us apart is our commitment to exceptional customer service. With over 145 FIVE-STAR reviews on Google, we take pride in ensuring that every event we service is not just successful, but memorable. Our team is dedicated to providing a smooth rental experience, from the moment you reach out to the final clean-up. Join us in creating joy and laughter at your next event. Let Space Coast Party Rentals help you make lasting memories that will be cherished for years to come! We service Palm Bay, Melbourne, West Melbourne, Grant , Sebastian, and surrounding cities in Brevard County! Satisfaction Guaranteed! When we say your satisfaction is guaranteed, we mean it . If we didn’t cover your type of party or event, please feel free to give us a call or message us on our Contact Us form. We will promptly respond with any necessary feedback. It's Party Time! We have everything you need to throw unforgettable, once in a lifetime events. Whether it’s in your backyard or a huge corporate event, we specialize in making sure your event is a fun, stress free experience from start to finish. Book Now! (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://spacecoastpartyrentals.com/rentals/tents/",
      "text": "Tents - Space Coast Party Rentals Palm Bay FL (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Home » Inventory » Tents items Set Event Date Tents for Rent 120943 Large tents to provide shade or cover if it rains is a smart way to be prepared for all kinds of weather. Tables can be placed under the tents or away. We offer a huge variety of tents and all our equipment is cleaned and inspected regularly. Professional delivery to Indian Harbor Beach, FL , Melbourne, FL , Palm Bay , FL , Sebastian, FL , Grant, FL and surrounding areas. Please submit a quote or contact us to be sure we service your area. View Product 10x10 Canopy Tent 10x10+Canopy+Tent https://spacecoastpartyrentals.com/rentals/equipment/10x10-tent/ 2063141 Limited Dropdown 1 0 from $15.00 item unavailable (change date) View Product 10x20 Canopy Tent 10x20+Canopy+Tent https://spacecoastpartyrentals.com/rentals/tents/10x20-canopy-tent/ 2975217 Limited Dropdown 1 0 from $100.00 item unavailable (change date) (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://www.showtime-eventrentals.com/about_us/",
      "text": "About Us | Showtime Event Rentals 772-237-0601 info@showtimeeventrentals.com 772-237-0601 info@showtimeeventrentals.com Toggle navigation Home About Us Tables Chairs Linens Tablecloths Napkins Runners Chair Covers Canopies Games Concessions Photo Booth Audio/Visual Marquees Marquee Numbers Marquee Letters Arbors Decor Pipe and Drapes Props/Backdrops Dinnerware Accessories All Rentals Order By Date Linens Canopies Arbors Games Concessions Audio/Visual Props/Backdrops Accessories Marquees Decor Photo Booth Pipe and Drapes Dinnerware Tables Chairs Service Area Photo Gallery Vendor Partners Cancellation Policy Info FAQs Privacy Policy Contact Us Search About Us Meet the team We are Nelson and Christina, and we moved from Boca Raton, FL, to the beautiful shores of Port St Lucie eight years ago. Our journey has been nothing short of amazing, and we've discovered that the heart of joy lies in celebrating life's special moments with the ones we love. Little did we know that this move would lead us to discover our passion for bringing joy and excitement to the Treasure Coast. From the moment we arrived in Port St Lucie, we fell in love with the warm embrace of the community. Our family has always had a knack for bringing people together, and hosting parties and events quickly became our favorite way to connect with our new neighbors and friends. The laughter, smiles, and shared memories have made every event a special occasion for us. After a few years of immersing ourselves in the vibrant culture of Port St Lucie, we noticed a need for a reliable party rental company that prioritized excellent customer service. Determined to fill this gap, we decided to turn our passion for hosting events into something more. And so, Showtime Event Rentals was born—a family-owned and operated business rooted in warmth, reliability, and a genuine love for celebrations. We believe that every event, big or small, deserves the attention and care that only a family-owned business can provide. At Showtime Event Rentals, we understand that every event is unique, and we are here to make it extraordinary. We aim to be more than just a party rental company; we want to be your partner in creating memories that everyone will cherish forever. From intimate family gatherings to grand events, we have the inventory and expertise to elevate your celebration. Our unwavering commitment to excellent customer service sets us apart at Showtime Event Rentals. Your experience with us should be just as memorable as your event. Our dedicated team is here to assist you every step of the way, ensuring that your rental process is smooth, stress-free, and tailored to your unique needs. Proudly based in Port St Lucie, Showtime Event Rentals is honored to serve the entire Treasure Coast community. We have had the privilege of being a part of countless celebrations, and we look forward to making your event the next unforgettable moment on our journey. Whether you're planning a wedding, a birthday bash, a corporate event, or a community festival, Showtime Event Rentals is ready to turn your vision into reality. Contact us today, and let's start planning the show of a lifetime! Thank you for considering Showtime Event Rentals—where every celebration is star-studded! Home About Us Tables Chairs Tablecloths Napkins Runners Chair Covers Canopies Games Concessions Photo Booth Audio/Visual Marquee Numbers Marquee Letters Arbors Decor Pipe and Drapes Props/Backdrops Dinnerware Accessories Order By Date Linens Canopies Arbors Games Concessions Audio/Visual Props/Backdrops Accessories Marquees Decor Photo Booth Pipe and Drapes Dinnerware Tables Chairs Service Area Photo Gallery Vendor Partners Cancellation Policy FAQs Privacy Policy Contact Us © 2025 Showtime Event Rentals Powered by Event Rental Systems"
    },
    {
      "url": "https://stillwaterspacewalk.com/contact_us/",
      "text": "Contact Us information for party rentals X 405-334-4639 StillwaterSpacewalk@gmail.com 405-334-4639 StillwaterSpacewalk@gmail.com Toggle navigation Home Open play Party Center FAQs and Hours Rentals Party Center Parties Event Tents Tables, Chairs & Linen Amusement Rides Obstacle Courses Interactives and inflatable Games Bounce House/Slide Combinations Basic Bounces Games and Concessions Water Slides Power Gift Cards Contact Privacy and Terms We'd Love To Hear From You! Send Message Location: 413 Kinnick Rd, Stillwater Ok, 74075 Mailing Address: P.O. BOX 2512 Stillwater, 74076 Email: SpaceWalkSok@herecomesfun.com Phone: 405-334-4639 © K&A Entertainment LLC  All rights reserved Powered by Event Rental Systems"
    },
    {
      "url": "https://spacecoastpartyrentals.com/bounce-house-palm-bay-in-melbourne-fl/",
      "text": "Bounce house palm bay in Melbourne, FL - Space Coast Party Rentals Palm Bay FL (321) 482-6131 Search for: Facebook Instagram Facebook Instagram Book Now Book Now All Rentals Bounce Houses Water Slides Foam Party Cannon Slides & Combos Tables & Chairs Concessions Tents Bartending Services by Salty Mama About Us FAQs Contact Us Home » Bounce house palm bay in Melbourne, FL Bounce house palm bay Melbourne, FL For premium bounce house palm bays, Melbourne, FL turns to Space Coast Party Rentals. You might want to consider these other items in Melbourne, FL: Bounce house rental , Water slide , Inflatable , Brevard County , Palm Bay , Florida , Fun , Water slide rental , Water slides , Melbourne , Party Rentals , Bounce House , Waterslide near me , Space Coast , Space Coast Party Rental , Bounce House Near Me , tables chairs rental , waterslide Palm bay We have everything needed to throw unforgettable, once in a lifetime parties. Whether it’s in your yard or a huge company event, we specialize in making sure your event is a fun, relaxing experience from beginning to end. Space Coast Party Rentals has been providing top notch rentals to the Melbourne, FL area for a long time, so you can trust us with handling your bounce house palm bay needs. We’ve provided for a big number of parties during the last few years from small to big, but all are handled with the utmost care. So don’t hesitate to think about us for your next event. In addition to offering perfect bounce house palm bays in Melbourne, FL, we also offer: Inflatable . So if your kids are tired of this year, then you might want to consider Space Coast Party Rentals for your next party so they can have fun with their friends outside in the yard. We have such a big selection so, be sure to check out all of our inventory. View Products Slides & Combos Slides & Combos is a dynamic rental attraction that mixes the fun of sliding with interactive play elements. It turns any event into an energetic playground where kids and families can enjoy a burst of excitement. Palm Bay , Melbourne, and surrounding cities in Brevard County View Products Bounce Houses Inflatable bounce houses are great to get some energy out. We also offer combo bouncers that will have thing like a basketball hoop or slide built right inside with a bounce area! We specialize in bounce house rentals and will be happy to accommodate your event needs. View Products Water Slides Water rides and water slides are a great way to cool down on a hot summer day! Get wet and have fun with these fun water slides and bouncers. Serving Palm Bay , Melbourne, and surround cities in Brevard & Indian River Counties. View Products Concessions Concession machines are a must for parties to provide a light snack or a way to cool off with a sno cone after all the fun. These machines can be operated by staff or volunteers. View Products Tables & Chairs Tables & Chairs provide a practical and stylish seating and dining setup, perfect for turning any event or gathering into a welcoming space. They’re all about taking the hassle out of hosting so you can focus on having fun. View Products Tents Large tents to provide shade or cover if it rains is a smart way to be prepared for all kinds of weather. Tables can be placed under the tents or away. We offer a huge variety of tents and all our equipment is cleaned and inspected regularly. View Products Foam Party Cannon Get ready to turn any event into a frothy, fun-filled extravaganza with the Foam Party Cannon! This fantastic rental blasts mountains of foam, perfect for dancing, playing, and making unforgettable memories. View Products Bartending Services by Salty Mama Enjoy professional bartending services that bring expertly mixed cocktails and a lively vibe to your event. Perfect for parties and gatherings, these services ensure every drink is crafted with care and flair to elevate your celebration. Join Melbourne, FL’s evolution in Bounce house palm bays with Space Coast Party Rentals. Interested in hosting a memorable event? Look no further, we’ve got you covered! With all the resources needed, we can help make your party completely unique. From small get-togethers to large-scale company parties, we offer a wide range of equipment to suit your needs. Experience the power of Bounce house palm bays in the heart of Melbourne, FL. We are your perfect source for bounce house palm bays. We enjoy providing the absolute best for your money in the area. With every customer and every event, we focus in on providing the best service so you can focus on having FUN. We also just love providing safe, clean rentals at the most competitive pricing around. Each item is cleaned and sanitized after every usage to ensure satisfaction.  We always follow safety rules and we absolutely will not ignore your safety for more business. Transforming Bounce house palm bays one step at a time – that’s Space Coast Party Rentals. (321) 482-6131 scpr@spacecoastpartyrentals.com Palm Bay, FL 32905 Copyright © 2022 Space Coast Party Rentals Palm Bay FL All Rights Reserved | Rental Software Powered By Event Hawk and InflatableOffice Days Single Day Overnight Multi-Day Start End Street Address City Zip Code Apply Cancel Change Date Provide an email address here to recieve our free party planner! Go Pleave provide a valid email address. Some items are not available for the selected delivery method. You may not be on the correct site. Click here to change location. Subtotal (estimate): Check Delivery Delivery Fee ( Change Address ): Continue Shopping Checkout Some items you may be interested in: powered by io Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Save Address Continue Shopping Enter Address Information (edit) Street Address City State AK AL AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VA VT WA WI WV WY Zip Code Locate If you are taking measurements for a structure such as a building or fence, please provide the height of the structure here. If height does not apply to the wash, for instance for a gutter wash, leave this field empty. Please note if you enter a value here after taking measurements, you will need to take measurements again. Height of structure: Done Clear Add New Line"
    },
    {
      "url": "https://spacecoastdaily.com/about-us/",
      "text": "About Us - Space Coast Daily Download App News Crime Mugshots Sports EFSC Florida Tech Prep Sports Space Coast Hall of Fame Health Health First Tres Vision Group Business Economic Development Commission of Florida’s Space Coast Real Estate Atlantic Group Real Estate Space Politics Entertainment Things to Do FLORIDA’S SPACE COAST Stay & Play Accommodations Attractions Restaurants & Bars Weather SCDTV Obituaries Adoptable Pets Receive Email Alerts Download App Things to Do FLORIDA’S SPACE COAST Stay & Play Accommodations Attractions Restaurants & Bars Weather SCD TV Local North Brevard Scottsmoor Mims Titusville Port St John Canaveral Groves Central Brevard Cocoa Merritt Island Viera Suntree Rockledge Cocoa Beach Port Canaveral Cape Canaveral Patrick Air Force Base South Brevard Satellite Beach Indialantic Melbourne Beach Melbourne West Melbourne Palm Bay Palm Shores Grant / Valkaria Barefoot Bay Sebastian More Adoptable Pets Obituaries Download Mobile App News Ticker [ September 11, 2025 ] NEVER FORGET: Where Were You 24 Years Ago on September 11, 2001? Join Our Conversation Brevard News [ September 11, 2025 ] FLASHBACK: Watch Full Television News Coverage of September 11, 2001 As It Happened Brevard News [ September 11, 2025 ] The Friday Night Locker Room Remembers 9/11 Victim Beth Quigley – NEVER FORGET! Brevard News [ September 11, 2025 ] FULL VIDEO: 9/11 Documentary From New York City Fire Department Perspective On September 11, 2001 Brevard News [ September 11, 2025 ] PUBLIC SERVICE SPOTLIGHT: Palm Bay Police Honors Volunteer Citizens on Patrol Member John Sena Brevard Crime News Search for: Home About Us About Us The Space Coast Daily team is a close-knit group of highly experienced, highly motivated, innovative people who want to make a positive impact in the community and on the rapidly changing media landscape. Dedicated to the highest levels of professionalism and excellence in all aspects of both printed and digital publishing, the Space Coast Daily team brings more than 120 years of collective experience in journalism to its rapidly expanding portfolio of high-quality, printed niche magazines and digital platforms. The mission of Space Coast Daily is to provide interesting and informative content in an to encourage the sharing of ideas and opinions among its readers to encourage constructive discourse and debate, to tell compelling stories that create thought, laughter and concern. Above all, the Space Coast Daily team strives to maintain high levels of integrity and honesty and to build a relationship with its readership of trust and reliability based on high ethics and social responsibility. EDITORIAL POLICY: Space Coast Daily provides an unbiased, non-agenda-driven venue for your information and engagement, and welcomes and encourages all points of view. For more information, or to send your comments and columns, e-mail Contact@SpaceCoastDaily.com Legal Notice and Disclaimer: While Maverick Multimedia Inc., with and through its publication, Space Coast Daily, makes every effort to present accurate and reliable information, it does not endorse, approve, or certify such information, nor does it guarantee the accuracy, completeness, efficacy, timeliness, or correct sequencing of such information. Use of such is voluntary, and reliance on it should only be undertaken after an independent review of its accuracy, completeness, efficacy, and timeliness. Reference herein to any specific commercial product, theory, process, or service by trade name, trademark, service mark, manufacturer, or otherwise does not constitute or imply endorsement, recommendation, or favoring by Maverick Multimedia Inc. Furthermore, Maverick Multimedia Inc. (including its officers, employees and agents) assumes no responsibility for consequences resulting from the use of the information herein, [or from the use of the information obtained at linked Internet addresses,] or in any respect for the content of such information, including (but not limited to) errors or omissions, the accuracy or reasonableness of factual or scientific assumptions, studies or conclusions, the defamatory nature of statements, ownership of copyright or other intellectual property rights, and the violation of property, privacy, or personal rights of others. Maverick Multimedia Inc. is not responsible for, and expressly disclaims all liability for, damages of any kind arising out of use, reference to, or reliance on such information. No guarantees or warranties, including (but not limited to) any express or implied warranties of merchantability or fitness for a particular use or purpose, are made by Maverick Multimedia Inc. with respect to such information. To contact Space Coast Daily call 321-615-8111 or 321-323-4460 or e-mail Contact@SpaceCoastDaily.com Loading... LATEST NEWS NEVER FORGET: Where Were You 24 Years Ago on September 11, 2001? Join Our Conversation FLASHBACK: Watch Full Television News Coverage of September 11, 2001 As It Happened The Friday Night Locker Room Remembers 9/11 Victim Beth Quigley – NEVER FORGET! FULL VIDEO: 9/11 Documentary From New York City Fire Department Perspective On September 11, 2001 PUBLIC SERVICE SPOTLIGHT: Palm Bay Police Honors Volunteer Citizens on Patrol Member John Sena We’re Halfway Through the 2025 Atlantic Hurricane Season, FPL Official Warns to Stay Vigilant Eastern Florida State College Golfers Jamie Smith, Ann Burel Win Individual Titles Do You Need to Stop? Melbourne Police Officials Share School Season Bus Safety Reminders FEATURED STORIES Enroll Now for Fall 2025 Mini-Mester Classes at Eastern Florida State College! HOT OFF THE PRESS! Enjoy Space Coast Daily, Brevard County’s Best and Most Read Magazine HOT OFF THE PRESS! August 25, 2025 Space Coast Daily News – Brevard County’s Best Newspaper HOT OFF THE PRESS! August 11, 2025 Space Coast Daily News – Brevard County’s Best Newspaper HOT OFF THE PRESS! July 28, 2025 Space Coast Daily News – Brevard County’s Best Newspaper HOT OFF THE PRESS! July 14, 2025 Space Coast Daily News – Brevard County’s Best Newspaper HOT OFF THE PRESS! Enjoy Space Coast Daily, Brevard County’s Best and Most Read Magazine HOT OFF THE PRESS! June 30, 2025 Space Coast Daily News – Brevard County’s Best Newspaper TOURISM TALK: Space Coast Office of Tourism Executive Director Peter Cranis Provides Update, Rapid Growth in Brevard County HOT OFF THE PRESS! June 16, 2025 Space Coast Daily News – Brevard County’s Best Newspaper ABOUT US CONTACT US THE SCD TEAM PRIVACY POLICY ADVERTISE TERMS OF USE ABOUT US CONTACT US THE SCD TEAM PRIVACY POLICY ADVERTISE TERMS OF USE GET THE FREE APP GET EMAIL ALERTS Search for: © 2025 Maverick Multimedia, Inc. All Rights Reserved  | Privacy Policy | Developed by Close this module Click Here to Sign Up for Text Alerts Or Signup Below For Email Alerts! Your email johnsmith@example.com Subscribe Now!"
    }
  ]
}