{
  "fuentes": [
    {
      "url": "https://busyscreenprinting.com/contact",
      "email": "contactus@busyscreenprint.com"
    },
    {
      "url": "https://www.groupon.com/deals/spavia-winter-park-1",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://winterparkfl.spaviadayspa.com/about-us",
      "email": "bestof2021round-logo@2x.png"
    },
    {
      "url": "https://winterparkfl.spaviadayspa.com/about-us",
      "email": "spavia_littleton_award@2x.png"
    },
    {
      "url": "https://winterparkfl.spaviadayspa.com/about-us",
      "email": "entrepreneur2021@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "asset-1@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "cservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "tkramer@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "you@domain.com"
    },
    {
      "url": "https://guidetoflorida.com/winter-park/beauty-spa/spavia-day-spa-winter-park",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/winter-park/beauty-spa/spavia-day-spa-winter-park",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://spaviadayspa.com/about-us",
      "email": "bestof2021round-logo@2x.png"
    },
    {
      "url": "https://spaviadayspa.com/about-us",
      "email": "spavia_littleton_award@2x.png"
    },
    {
      "url": "https://spaviadayspa.com/about-us",
      "email": "entrepreneur2021@2x.png"
    }
  ],
  "mails": [
    "asset-1@2x.png",
    "bestof2021round-logo@2x.png",
    "contactus@busyscreenprint.com",
    "cservice@thisistheplace.org",
    "customerservice@thisistheplace.org",
    "directory@guidetoflorida.com",
    "entrepreneur2021@2x.png",
    "name@yoursite.com",
    "spavia_littleton_award@2x.png",
    "tkramer@thisistheplace.org",
    "verify@r.groupon.com",
    "you@domain.com"
  ],
  "nombre_sitio": "spaviadayspa.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://busyscreenprinting.com/contact",
      "text": "Contact Busy Screen Printing LLC in Winter Park, FL | Busy Screen Printing LLC Home Services About Contact Home Services About Contact Contact Us Visit our screen printing shop in Winter Park for high-quality prints and exceptional customer service from our dedicated team. Address 6801 University Blvd. Ste 6 Winter Park, Florida 32792 Hours Monday -Friday 5am - 5pm Phone 386.478.8995 Quality Dedicated printers ensuring customer satisfaction and excellence. Contact Service contactus@busyscreenprint.com Your Email Address Submit Your Request Â© 2025. All rights reserved. 386.478.8995"
    },
    {
      "url": "https://www.groupon.com/deals/spavia-winter-park-1",
      "text": "Spavia Day Spa - Winter Park - From $85 - Winter Park | Groupon Download our app for exclusive deals Sell on Groupon English Select Location Sign In Beauty & Spas Beauty & Spas Things To Do Things To Do Auto & Home Auto & Home Food & Drink Food & Drink Gifts Gifts Local Local Travel Travel Goods Goods Coupons Coupons Local Beauty & Spas Face & Skin Care Facial Choice of Luxury Spa Facials at Spavia Day Spa - Winter Park Spavia Day Spa - Winter Park 110 South Orlando Avenue, Winter Park 4.7 ( 461 reviews ) Best Rated 100+ Bought +6 images Sign in and get Extra $19.51 off Promo ends Groupon reserves the right to end the promo at any time Select Option: Buy as a gift Select Option: Buy as a gift 50-Minute Signature Classic Refresh Facial (Valid Monday-Thursday) $ 109 $ 85 -22% $ 65 . 49 Sign in to apply discount 80+ bought 60-Minute Age Defense Facial (Valid Monday-Thursday) $ 129 $ 90 -30% $ 68 . 99 Sign in to apply discount 80+ bought Buy now Annette 188 days ago Wonderful flawless experience from start to finish\nEverything top rate Show More Show all reviews Amenities Parking Good for Kids Takes Reservations About Need To Know Info Where To Redeem Reviews Deeply hydrating facials aim to purify the complexion to help achieve a fabulous, youthful appearance and silk-like touch Book Online Through Groupon See availability and book your visit now, or book from desktop, phone or tablet by visiting MyGroupons and clicking Book Now! after your purchase. Spavia is all about you – you select treatments that best suit your needs and desires. Therapists and estheticians care about your well-being and provide each spa treatment in the most personalized, professional manner possible. Begin your relaxation by unwinding in our peaceful Spavia retreat room. Each guest is provided with a spa robe, spa sandals and a warmed aromatherapy neck pillow for the ultimate rest and relaxation. What to Expect Deeply relaxing facial Neck and shoulder massage Arm massage Deeply hydrating hand treatment Completed with Spavia dry mineral sunscreen Spavia Facials Signature Classic Refresh Facial: Refreshes and maintains all skin types for more hydrated, softer, and smoother skin. Our Spavia Signature Refresh facial begins with a thorough cleanse, exfoliation with Mandelic acid, and Mangosteen extracts to smooth and brighten your skin complexion. Rich Goji Berry antioxidants, hyaluronic acid and natural plant extracts will leave your skin hydrated and refreshed with a healthy glow. Age Defense Facial: Defend your skin from the aging process with a facial that hydrates, brightens, and tightens your skin. A blend of enzymes and alpha hydroxy acids, smooth, and tighten while a superior blend of active clinical brighteners gently fade discoloration for a radiant youthful glow. Infused with Vitamin C and hyaluronic acid to nourish and plump skin for the perfect anti-aging skincare treatment. Deeply hydrating facials aim to purify the complexion to help achieve a fabulous, youthful appearance and silk-like touch Book Online Through Groupon See availability and book your visit now, or book from desktop, phone or tablet by visiting MyGroupons and clicking Book Now! after your purchase. Spavia is all about you – you select treatments that best suit your needs and desires. Therapists and estheticians care about your well-being and provide each spa treatment in the most personalized, professional manner possible. Begin your relaxation by unwinding in our peaceful Spavia retreat room. Each guest is provided with a spa robe, spa sandals and a warmed aromatherapy neck pillow for the ultimate rest and relaxation. What to Expect Deeply relaxing facial Neck and shoulder massage Arm massage Deeply hydrating hand treatment Completed with Spavia dry mineral sunscreen Spavia Facials Signature Classic Refresh Facial: Refreshes and maintains all skin types for more hydrated, softer, and smoother skin. Our Spavia Signature Refresh facial begins with a thorough cleanse, exfoliation with Mandelic acid, and Mangosteen extracts to smooth and brighten your skin complexion. Rich Goji Berry antioxidants, hyaluronic acid and natural plant extracts will leave your skin hydrated and refreshed with a healthy glow. Age Defense Facial: Defend your skin from the aging process with a facial that hydrates, brightens, and tightens your skin. A blend of enzymes and alpha hydroxy acids, smooth, and tighten while a superior blend of active clinical brighteners gently fade discoloration for a radiant youthful glow. Infused with Vitamin C and hyaluronic acid to nourish and plump skin for the perfect anti-aging skincare treatment. Need To Know Info Promotional value expires 90 days after purchase. Amount paid never expires.    \n    Appointment required, contact by phone at (407)-670 3200. Not valid for clients active in the last 6 months Valid only for option purchased. Merchant's standard cancellation policy applies (any fees not to exceed Groupon price). Limit 1 per person. All goods or services must be used by the same person. \n    Merchant is solely responsible to purchasers for the care and quality of the advertised goods and services.\n    Learn about Strike-Through Pricing and Savings About Spavia Day Spa - Winter Park Company Website Explore more Nearby Beauty & Spas Facial Botox Shave Facial Peel Injectables & Fillers Permanent Makeup Facelift IPL Treatment"
    },
    {
      "url": "https://winterparkfl.spaviadayspa.com/about-us",
      "text": "Our Story | Spavia Winter Park | Winter Park, FL 32789 Book Now | CALL TO SCHEDULE Your Spa: Winter Park, FL 407.670.3200 My Account Careers Our Spa About Us Spavia Cares Spavia Green Spalosophy Blog Events Treatments Massage Therapy Men's Treatments Facials / Skin Care Body Treatments Beauty Packages Spalebrations New Spa Treatments Boost Membership Pricing Gift Cards Offers First Visit Our Offers Book Now Our Spa About Us Spavia Cares Spavia Green Spalosophy Blog Events Treatments Massage Therapy Men's Treatments Facials / Skin Care Body Treatments Beauty Packages Spalebrations New Spa Treatments Boost Membership Pricing Gift Cards Offers First Visit Our Offers Book Now CALL OUR SPA OUR SPA THE RIPPLING EFFECT OF WORKING TOGETHER AND MAKING A DIFFERENCE. EACH RIPPLE REPRESENTS ANOTHER LOCATION AND THE POWER OF GROWTH IN MAKING A DIFFERENCE. PURCHASE A GIFT CARD SPAVIA Winter Park DAY SPA IN Winter Park Relax. You deserve a break. Recenter. Immerse yourself in relaxation and tranquility. Renew. Recharged and refocused you can conquer all that the day has in store for you. Spavia Winter Park is all about you – you select treatments that best suit your needs and desires. Our therapists and estheticians care about your well-being and provide each spa treatment in the most personalized, professional manner possible. Begin your relaxation by unwinding in our peaceful Spavia retreat room. Each guest is provided with a spa robe, spa sandals and a warmed aromatherapy neck pillow for the ultimate rest and relaxation. Whether you desire a soothing massage or a rejuvenating body wrap, our specialists will assist you in creating the perfect day spa experience. Turn back the clock with a nourishing facial and finish your spa day with an all-natural beauty treatment. You will leave the spa looking – and feeling – your best. When you are looking for a break from the everyday stresses, we invite you to relax, recenter and renew at Spavia Winter Park . Schedule your relaxation today! SCHEDULE YOUR RELAXATION Spavia Winter Park 110 Orlando Avenue Suite 9 , Winter Park , FL 32789 407.670.3200 Hours of Operation Monday: 9am to 8pm Tuesday: 9am to 8pm Wednesday: 9am to 8pm Thursday: 9am to 8pm Friday: 9 to 8pm Saturday: 9am to 6pm Sunday: 11am to 6pm PURCHASE A GIFT CARD Spavia Memberships Available This year, say yes to self-care! Members enjoy special offers! LEARN MORE When the founders Allison and Marty Langenderfer created the Spavia brand, they wanted to create a name that reflected the products and services it offered and deliver results to help their guests relax, recenter, and renew. What’s in a name? Spavia- ‘via’ in many languages means route or pathway. Our interpretation of Spavia is the route or journey to wellness. Each of our guests have their own journey and at Spavia, it’s so important to create customized, result-driven treatments in a tranquil environment for our guests. It’s our guests’ journey and it begins at Spavia. It is such a humbling experience to know that since 2005, that has been our focus and today with our growth and owners, brand partners and Spavia team members, we are making a difference. Thank you for entrusting Spavia on your journey to wellness and being our guest. We are so grateful. OUR STORY On September 25, 2005, Spavia opened its doors with a mission and vision of making a positive difference in the world one guest at a time and delivering an exceptional experience our guests couldn’t live without. For us, it’s been about a journey, not a race to build a legacy and reputation of being the best, delivering the best and creating a Spavia culture that we are proud of each and every day. We are humbled and grateful for the opportunity to open our doors each day, create exceptional experiences and give back to our communities. Today, we are doing just that and our focus in creating the best experience with the best products and spa treatments is stronger than ever! Spavia is rapidly growing and with that comes great responsibility to ensure that we are offering the best to our guests, our teams, and our franchise owners. Thank you for being a part of the Spavia journey and welcome to the Spavia family! OUR AWARDS SlideShow JS/CSS Files Placed Here (Important) privacy policy | terms & conditions © Spavia. All Rights Reserved. BOOK NOW PURCHASE A GIFT CARD FIRST VISIT OFFER CORPORATE SITE BLOG ST. MORITZ ACADEMY Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "text": "Contact Us | This Is The Place Heritage Park Annual Pass Menu Annual Pass Menu Connect With Us Contact us via the form below and our team will respond within 48 hours. Support Form (#8) Contact First Name Last Name Email Department - Select Department - Dining Events Media / Press General Admission Weddings Corporate Groups Phone/Mobile Subject Description Submit Form Contact Info customerservice@thisistheplace.org 801-582-1847 Address 2601 E. Sunnyside Avenue Salt Lake City, Utah 84108 THIS IS THE PLACE VISIT TODAY! 2601 EAST SUNNYSIDE AVENUE, SALT LAKE CITY, UT, 84108 801-582-1847 cservice@thisistheplace.org Press Inquiries: Tresha Kramer- tkramer@thisistheplace.org Footer Subscription Form Newsletter Subscribe Follow Us About Hours & Admission Contact Us Terms & Conditions Blog Home Today’s Fun Summer Season Winter Season Plan Your Visit Activities Bonus Events Utah Trail Rides Childrens Parties Pioneer Trades Shopping Gift Shop Food Brigham’s Donuts Huntsman Grill General Info Hours & Admission Annual Pass Contact Us About Directions Partners & Sponsors Support The Park Heritage Village The Village The Pioneer Center Monuments Pioneers of 1847 Monument Statuary Walk The Mormon Battalion National Pony Express Walk of Pioneer Faiths Pioneer Children’s Memorial Building Rentals Weddings & Receptions Corporate Events Family Reunions Pricing Catering Bartenders Buildings The Garden Place Rental Pine Valley Chapel Rental Atkin Home Rental Brigham Young Farmhouse Kimball Home Rental Pioneer Center Rental Pack Home Rental Plaza Rental Ottinger Hall Rental Pioneer Pavilion Rental Emigration Room at the Pioneer Center Miller Pavilion Rental Education School Field Trips Blog"
    },
    {
      "url": "https://guidetoflorida.com/winter-park/beauty-spa/spavia-day-spa-winter-park",
      "text": "Spavia Day Spa - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Winter Park Beauty & Spa Spavia Day Spa Spavia Day Spa Share Day Spas 110 Orlando Ave Suite 9, Winter Park, Florida, 32789 Send Message 407-670-3200 Vote for Us! | Day Spas Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Are you Spavia Day Spa? Claim this listing now. Claim Listing Overview Get Directions View On Larger Map Company Name Spavia Day Spa Phone Number 407-670-3200 Location 110 Orlando Ave Suite 9 Winter Park , Florida , 32789 United States × Map View Get Directions Cancel FEATURED LISTINGS! Enchanted Medical Aesthetics Ormond Beach, FL 32174 Website 386-317-1449 Elegance By Dr A Davenport, FL 33837 Website 689-280-4746 Elysian Salon and Spa Vero Beach, FL 32967 Website 772-584-2241 READ AND REAP! Where Ancient Medicine Meets Modern Precision Good Hair, Glowing Skin, Zero Drama Unlock the Secret to Ageless Beauty at Enchanted Medical Aesthetics MORE TO EXPLORE! Best of Florida Voting Best Day Spas in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://spaviadayspa.com/about-us",
      "text": "Who We Are | Spavia Franchise FIND A SPA NEAR YOU Gift Cards Careers Our Story About Us Our Guests Spavia Cares Spavia Green Spalosophy Press & Awards Treatments Massage Therapy Men's Treatments Facials / Skin Care Body Treatments Beauty Packages New Spa Treatments Boosts Membership Spalebrations Own A Spa Franchise Gift Cards Careers Shop Online Find A Spavia Near You Our Story About Us Our Guests Spavia Cares Spavia Green Spalosophy Press & Awards Treatments Massage Therapy Men's Treatments Facials / Skin Care Body Treatments Beauty Packages New Spa Treatments Boosts Membership Spalebrations Own A Spa Franchise Gift Cards Careers Shop Online Find A Spavia Near You OUR STORY THE RIPPLING EFFECT OF WORKING TOGETHER AND MAKING A DIFFERENCE. EACH RIPPLE REPRESENTS ANOTHER LOCATION AND THE POWER OF GROWTH IN MAKING A DIFFERENCE. PURCHASE A GIFT CARD Relax. You deserve a break. Recenter. Immerse yourself in relaxation and tranquility. Renew. Recharged and refocused you can conquer all that the day has in store for you. Spavia is all about you – you select treatments that best suit your needs and desires. Our therapists and estheticians care about your well-being and provide each spa treatment in the most personalized, professional manner possible. Begin your relaxation by unwinding in our peaceful Spavia retreat room. Each guest is provided with a spa robe, spa sandals and a warmed aromatherapy neck pillow for the ultimate rest and relaxation. Whether you desire a soothing massage or a rejuvenating body wrap, our specialists will assist you in creating the perfect day spa experience. Turn back the clock with a nourishing facial and finish your spa day with an all-natural beauty treatment. You will leave the spa looking – and feeling – your best. When you are looking for a break from the everyday stresses, we invite you to relax, recenter and renew at Spavia. Schedule your relaxation today! SCHEDULE YOUR RELAXATION Allison Langenderfer Founder and President READ MORE Allison Langenderfer is President and Co-founder of Spavia. Allison is the passionate leader of Spavia focusing on design, creative and spa retail. Allison is a graduate of Cal Poly San Luis Obispo with an emphasis in marketing and a lifelong belief in ‘learning by doing’ attitude that has fueled personal growth throughout her career. Before founding Spavia, Allison was a professional buyer & regional manager for Macy's which was followed by a successful 12 year career in pharmaceutical sales. Allison drives the passion of Spavia from a focus on Spavia Cares to inspiring the community of franchise partners, team members around the nation. Allison has a personal passion for developing the curated retail experience of Spavia by building an amazing network of partners with world class products. Allison’s market driven approach includes skin care solutions along with relaxation products, and great gifts to make Spavia a go-to retail option in the community. Allison’s greatest personal success can be found at home with her three children who are now starting to forge careers of their own. Marty Langenderfer Founder and CEO READ MORE Marty Langenderfer is CEO and Co-founder of Spavia. Marty is driven to create innovative concepts that achieve excellence through technology, marketing, operating systems and scalable growth. As an entrepreneur, Marty has an unorthodox background starting first as a CPA at a big six accounting firm which then transitioned into an MBA at Cornell University’s Johnson Graduate School of Management. Shortly after, he joined American Airlines’ Sabre Division where he helped found Travelocity. Lessons learned from creating a world recognized brand helped Marty grow into his next venture as VP of DISH Network, where he focused on marketing, customer loyalty and customer service. During his tenure as an executive, the company grew from less than one million subscribers to over ten million. Marty’s years of expertise in finance, marketing, and operations enables him to lead the Spavia National team in delivering excellence. When the founders Allison and Marty Langenderfer created the Spavia brand, they wanted to create a name that reflected the products and services it offered and deliver results to help their guests relax, recenter, and renew. What’s in a name? Spavia- ‘via’ in many languages means route or pathway. Our interpretation of Spavia is the route or journey to wellness. Each of our guests have their own journey and at Spavia, it’s so important to create customized, result-driven treatments in a tranquil environment for our guests. It’s our guests’ journey and it begins at Spavia. It is such a humbling experience to know that since 2005, that has been our focus and today with our growth and owners, brand partners and Spavia team members, we are making a difference. Thank you for entrusting Spavia on your journey to wellness and being our guest. We are so grateful. OUR STORY On September 25, 2005, Spavia opened its doors with a mission and vision of making a positive difference in the world one guest at a time and delivering an exceptional experience our guests couldn’t live without. For us, it’s been about a journey, not a race to build a legacy and reputation of being the best, delivering the best and creating a Spavia culture that we are proud of each and every day. We are humbled and grateful for the opportunity to open our doors each day, create exceptional experiences and give back to our communities. Today, we are doing just that and our focus in creating the best experience with the best products and spa treatments is stronger than ever! Spavia is rapidly growing and with that comes great responsibility to ensure that we are offering the best to our guests, our teams, and our franchise owners. Thank you for being a part of the Spavia journey and welcome to the Spavia family! OUR AWARDS SlideShow JS/CSS Files Placed Here (Important) privacy policy | terms & conditions © Spavia. All Rights Reserved. Please ensure Javascript is enabled for purposes of website accessibility BOOK NOW PURCHASE A GIFT CARD OWN A SPA FRANCHISE CONTACT US BLOG ST. MORITZ ACADEMY"
    }
  ]
}