{
  "fuentes": [
    {
      "url": "https://www.spiritualcareassociation.org/",
      "email": "info@spiritualcareassociation.org"
    },
    {
      "url": "https://www.spiritualcareassociation.org/job-board/",
      "email": "info@spiritualcareassociation.org"
    },
    {
      "url": "https://www.soulsearch.io/",
      "email": "info@soulsearch.io"
    },
    {
      "url": "https://www.naropa.edu/about-naropa/naropa-healers-directory/",
      "email": "admissions@naropa.edu"
    },
    {
      "url": "https://www.trustpilot.com/review/blackmagicremoval.us",
      "email": "privacy@trustpilot.com"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "abby.hyman@healingtrust.org"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "adell.neal@healingtrust.org"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "catherine.smith@healingtrust.org"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "diana.andrew@healingtrust.org"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "info@healingtrust.org"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "jennifer.oldham@healingtrust.org"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "megan.davis@healingtrust.org"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "samuel.jackson@healingtrust.org"
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "email": "sumita.keller@healingtrust.org"
    }
  ],
  "mails": [
    "abby.hyman@healingtrust.org",
    "adell.neal@healingtrust.org",
    "admissions@naropa.edu",
    "catherine.smith@healingtrust.org",
    "diana.andrew@healingtrust.org",
    "info@healingtrust.org",
    "info@soulsearch.io",
    "info@spiritualcareassociation.org",
    "jennifer.oldham@healingtrust.org",
    "megan.davis@healingtrust.org",
    "privacy@trustpilot.com",
    "samuel.jackson@healingtrust.org",
    "sumita.keller@healingtrust.org"
  ],
  "nombre_sitio": "spiritualhealingsolutions.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.spiritualcareassociation.org/",
      "text": "Spiritual Care Association Skip to content About About Us Welcome Letter from President & CEO SCA Staff Strategic Partners International Partners Government Services Contact Us Membership SCA Membership Member Login Communities of Chaplains Communities of Chaplains FAQ Code of Conduct Prayer of Commitment Certification SCA Certification SCA’s Rationale for Certification Credentialing (CC) Board Certification (BCC) Advanced Practice Board Certification (APBCC) Hospice and Palliative Care Specialty Certification (APBCC-HPC) Spiritual Care Generalist Retired, Inactive and Lapsed Chaplains Renewal Requirements Code of Ethics Fees FAQs Simulated Patient Exam Standardized Clinical Knowledge Test Apply Education SCA Learning Center Health Care Chaplains Palliative Care Professionals Hospice Chaplaincy Certificate CMS Codes for Chaplains Nurses Chaplaincy Management Training Prep Course for Board Certification Clinical Pastoral Education (CPE) Spiritual Care Grand Rounds First Responder Chaplains Volunteer Training Social Workers SCA Faculty Chaplain Masterclass Divisions SCA Divisions Health Care Chaplains First Responder Chaplains First Response Chaplaincy Training Manual Nursing Foundations of Faith Community Nursing Leadership and Coordination Webinar Series Westberg Symposium Perspectives Hospice and Palliative Care Division Corporate Military Psychodynamic Chaplaincy Division Social Work Division Christian Chaplain Division Resources Resources Foundational Papers Resources for Nurses Resources for First Response Chaplains Resources to Train Chaplaincy Volunteers Consensus Statement Role of the Chaplain Job Board Evidence-Based Quality Indicators Scope of Practice Magazine Magazine Past Issues Interview with Authors Chappy Conference 2026 Conference Past Conferences Post Conference 2023 Post Conference 2022 Post Conference 2021 Post Conference 2020 About About Us Welcome Letter from President & CEO SCA Staff Strategic Partners International Partners Government Services Contact Us Membership SCA Membership Member Login Communities of Chaplains Communities of Chaplains FAQ Code of Conduct Prayer of Commitment Certification SCA Certification SCA’s Rationale for Certification Credentialing (CC) Board Certification (BCC) Advanced Practice Board Certification (APBCC) Hospice and Palliative Care Specialty Certification (APBCC-HPC) Spiritual Care Generalist Retired, Inactive and Lapsed Chaplains Renewal Requirements Code of Ethics Fees FAQs Simulated Patient Exam Standardized Clinical Knowledge Test Apply Education SCA Learning Center Health Care Chaplains Palliative Care Professionals Hospice Chaplaincy Certificate CMS Codes for Chaplains Nurses Chaplaincy Management Training Prep Course for Board Certification Clinical Pastoral Education (CPE) Spiritual Care Grand Rounds First Responder Chaplains Volunteer Training Social Workers SCA Faculty Chaplain Masterclass Divisions SCA Divisions Health Care Chaplains First Responder Chaplains First Response Chaplaincy Training Manual Nursing Foundations of Faith Community Nursing Leadership and Coordination Webinar Series Westberg Symposium Perspectives Hospice and Palliative Care Division Corporate Military Psychodynamic Chaplaincy Division Social Work Division Christian Chaplain Division Resources Resources Foundational Papers Resources for Nurses Resources for First Response Chaplains Resources to Train Chaplaincy Volunteers Consensus Statement Role of the Chaplain Job Board Evidence-Based Quality Indicators Scope of Practice Magazine Magazine Past Issues Interview with Authors Chappy Conference 2026 Conference Past Conferences Post Conference 2023 Post Conference 2022 Post Conference 2021 Post Conference 2020 Member Login Join Get Certified Learn Making Spiritual Care a Priority The Spiritual Care Association (SCA) is the first multidisciplinary, international professional membership association for spiritual care providers that establishes evidence-based quality indicators , scope of practice , and a knowledge base for spiritual care. The  SCA Difference 1 MEMBERSHIP SCA Membership is a vital resource for professionals, clergy and organizations interested in spiritual care Learn More 2 EDUCATION SCA Learning Center with evidence-based curriculum Learn More 3 CERTIFICATION Nationally Recognized Chaplaincy Certification: Advanced Practice Board Certification (APBCC), Board Certification (BCC) and Credentialing (CC) Learn More MEMBERSHIP SCA Membership is a vital resource for professionals, clergy and organizations interested in spiritual care Learn More EDUCATION SCA Learning Center with evidence-based curriculum Learn More CERTIFICATION Nationally Recognized Chaplaincy Certification: Advanced Practice Board Certification (APBCC), Board Certification (BCC) and Credentialing (CC) Learn More What SCA Offers Members Engages and offers education to multiple interest groups, so more people in need receive effective spiritual care Opens access to new evidence-based knowledge base: Online Learning Center Provides valuable resources to contribute significantly to career development Creates a powerful voice for spiritual care Offers new paths for chaplaincy credentialing and board certification Learn More Membership Is Open to: All individuals and organizations committed to the delivery of optimal spiritual care, as a vital component of whole person care. We offer three categories of membership, with specialized sub-categories: Professional Membership For Chaplains, Clergy, Nurses, EMS and First Responders, Social Workers, and other Professionals Clergy Membership For Community Clergy and Religious Leaders Organizational Membership For Organizations and Institutions The Spiritual Care Association is the International Leader for all Spiritual Care Providers ﻿ ﻿ As the Spiritual Care Association continues to grow and expand, we continue to offer our members with highly-specialized services tailored to their particular industry. Through the SCA Divisions, we are able to provide our members a platform to network among themselves and access their specialized member benefits. What's New? Approval of HCPCS Codes for Chaplains The Centers for Medicare and Medicaid (CMS), a division of the US Department of Health and Human Services (HHS), has for the first time, approved codes for chaplaincy and spiritual care. Click here to learn more! What's New? HealthCare Chaplaincy’s New Book Offers a Compiled Resource of Evidence-Based Research Join us for the 2024 Annual Caring for the Human Spirit Conference and Westberg Symposium on April 15-17, 2024. Click here to purchase. Approval of HCPCS Codes for Chaplains The Centers for Medicare and Medicaid (CMS), a division of the US Department of Health and Human Services (HHS), has for the first time, approved codes for chaplaincy and spiritual care. Click here to learn more! Caring for the Human Spirit Conference and Westberg Symposium Join us for our 12th Annual Conference! Join us for the 2024 Annual Caring for the Human Spirit Conference and Westberg Symposium on April 15-17, 2024. Click here to learn more! The 2024 Foundations of Fatih Community Nursing Curriculum is now available for pre-sale! Click here to learn more! Provide Virtual Chaplaincy Services to Your Patients On demand. Every day. Click here to learn more! 500 Seventh Avenue, 8th Floor New York, NY 10018 (212) 644-1111 info@SpiritualCareAssociation.org CONNECT WITH US First Name * Last Name * Email (required) * Select list(s) to subscribe to HCCN eMail List Example: Yes, I would like to receive emails from Spiritual Care Association. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: Spiritual Care Association. You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact KEEP IN TOUCH Facebook Twitter Linkedin Youtube First Name Last Name Email Address Join Our Mailing List The Spiritual Care Association, a 501(c)6 nonprofit organization, is an affiliate of the HealthCare Chaplaincy Network , a 501(c)3 nonprofit organization. Copyright © 2025 Spiritual Care Association, Inc. KEEP IN TOUCH First Name Last Name Email Address Join Our Mailing List CONNECT WITH US Facebook Twitter Youtube The Spiritual Care Association, a 501(c)6 nonprofit organization, is an affiliate of the HealthCare Chaplaincy Network , a 501(c)3 nonprofit organization. To learn more about SCA’s Learning Center, click here . Copyright © 2025 Spiritual Care Association, Inc. Scroll to Top"
    },
    {
      "url": "https://www.spiritualcareassociation.org/job-board/",
      "text": "Job Board - Spiritual Care Association Skip to content About About Us Welcome Letter from President & CEO SCA Staff Strategic Partners International Partners Government Services Contact Us Membership SCA Membership Member Login Communities of Chaplains Communities of Chaplains FAQ Code of Conduct Prayer of Commitment Certification SCA Certification SCA’s Rationale for Certification Credentialing (CC) Board Certification (BCC) Advanced Practice Board Certification (APBCC) Hospice and Palliative Care Specialty Certification (APBCC-HPC) Spiritual Care Generalist Retired, Inactive and Lapsed Chaplains Renewal Requirements Code of Ethics Fees FAQs Simulated Patient Exam Standardized Clinical Knowledge Test Apply Education SCA Learning Center Health Care Chaplains Palliative Care Professionals Hospice Chaplaincy Certificate CMS Codes for Chaplains Nurses Chaplaincy Management Training Prep Course for Board Certification Clinical Pastoral Education (CPE) Spiritual Care Grand Rounds First Responder Chaplains Volunteer Training Social Workers SCA Faculty Chaplain Masterclass Divisions SCA Divisions Health Care Chaplains First Responder Chaplains First Response Chaplaincy Training Manual Nursing Foundations of Faith Community Nursing Leadership and Coordination Webinar Series Westberg Symposium Perspectives Hospice and Palliative Care Division Corporate Military Psychodynamic Chaplaincy Division Social Work Division Christian Chaplain Division Resources Resources Foundational Papers Resources for Nurses Resources for First Response Chaplains Resources to Train Chaplaincy Volunteers Consensus Statement Role of the Chaplain Job Board Evidence-Based Quality Indicators Scope of Practice Magazine Magazine Past Issues Interview with Authors Chappy Conference 2026 Conference Past Conferences Post Conference 2023 Post Conference 2022 Post Conference 2021 Post Conference 2020 About About Us Welcome Letter from President & CEO SCA Staff Strategic Partners International Partners Government Services Contact Us Membership SCA Membership Member Login Communities of Chaplains Communities of Chaplains FAQ Code of Conduct Prayer of Commitment Certification SCA Certification SCA’s Rationale for Certification Credentialing (CC) Board Certification (BCC) Advanced Practice Board Certification (APBCC) Hospice and Palliative Care Specialty Certification (APBCC-HPC) Spiritual Care Generalist Retired, Inactive and Lapsed Chaplains Renewal Requirements Code of Ethics Fees FAQs Simulated Patient Exam Standardized Clinical Knowledge Test Apply Education SCA Learning Center Health Care Chaplains Palliative Care Professionals Hospice Chaplaincy Certificate CMS Codes for Chaplains Nurses Chaplaincy Management Training Prep Course for Board Certification Clinical Pastoral Education (CPE) Spiritual Care Grand Rounds First Responder Chaplains Volunteer Training Social Workers SCA Faculty Chaplain Masterclass Divisions SCA Divisions Health Care Chaplains First Responder Chaplains First Response Chaplaincy Training Manual Nursing Foundations of Faith Community Nursing Leadership and Coordination Webinar Series Westberg Symposium Perspectives Hospice and Palliative Care Division Corporate Military Psychodynamic Chaplaincy Division Social Work Division Christian Chaplain Division Resources Resources Foundational Papers Resources for Nurses Resources for First Response Chaplains Resources to Train Chaplaincy Volunteers Consensus Statement Role of the Chaplain Job Board Evidence-Based Quality Indicators Scope of Practice Magazine Magazine Past Issues Interview with Authors Chappy Conference 2026 Conference Past Conferences Post Conference 2023 Post Conference 2022 Post Conference 2021 Post Conference 2020 Member Login Job Opportunities The Spiritual Care Association is the perfect resource for employers looking for candidates in the area of chaplaincy and spiritual care, and for candidates seeking job opportunities. For Candidates Job opportunities are listed on our website as a free resource for chaplains, faith community nurses, CPE supervisors, and others seeking positions in the field of spiritual care. Job opportunities are posted by the potential employers themselves. Click on the link below to search through our job opportunities now. Find a Job For Employers The Spiritual Care Association welcomes your institution to post job openings in the areas of chaplaincy and spiritual care, faith community nursing, CPE supervision, and similar fields. Click on the link below for more information. Post a Job 500 Seventh Avenue, 8th Floor New York, NY 10018 (212) 644-1111 info@SpiritualCareAssociation.org CONNECT WITH US First Name * Last Name * Email (required) * Select list(s) to subscribe to HCCN eMail List Example: Yes, I would like to receive emails from Spiritual Care Association. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: Spiritual Care Association. You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact KEEP IN TOUCH Facebook Twitter Linkedin Youtube First Name Last Name Email Address Join Our Mailing List The Spiritual Care Association, a 501(c)6 nonprofit organization, is an affiliate of the HealthCare Chaplaincy Network , a 501(c)3 nonprofit organization. Copyright © 2025 Spiritual Care Association, Inc. KEEP IN TOUCH First Name Last Name Email Address Join Our Mailing List CONNECT WITH US Facebook Twitter Youtube The Spiritual Care Association, a 501(c)6 nonprofit organization, is an affiliate of the HealthCare Chaplaincy Network , a 501(c)3 nonprofit organization. To learn more about SCA’s Learning Center, click here . Copyright © 2025 Spiritual Care Association, Inc. Scroll to Top"
    },
    {
      "url": "https://www.soulsearch.io/",
      "text": "Spiritual and Holistic Practitioners Directory | SoulSearch Contact Us Directory Login Spiritual & Energetic Healers & Guides - Get Listed Today Home Login Join SoulSearch TV Practitioners Search Practitioners Practitioners Reviews Practitioners by Categories Content Hub Community Articles Videos Audio Files Blog Soulpedia Marketplace Enlightenment Expos Santa Cruz Expo Scottsdale Expo Burlingame Expo Reno Expo Palo Alto Expo Dublin Expo All Enlightenment Expos Vendor Application Vendor Information Book a Booth Calendar Upcoming Events Live Readings Weekly Meditations Radiant Mind Meditations Menu Home Login Join SoulSearch TV Practitioners Search Practitioners Practitioners Reviews Practitioners by Categories Content Hub Community Articles Videos Audio Files Blog Soulpedia Marketplace Enlightenment Expos Santa Cruz Expo Scottsdale Expo Burlingame Expo Reno Expo Palo Alto Expo Dublin Expo All Enlightenment Expos Vendor Application Vendor Information Book a Booth Calendar Upcoming Events Live Readings Weekly Meditations Radiant Mind Meditations GET CONNECTED Explore our resources and connect with our community today! Find a Practitioner Explore Resources Attend an Expo GET CONNECTED Explore our resources and connect with our community today! Find a Practitioner Explore Resources Attend an Expo START SEARCHING NOW Find the perfect practitioner for your need! What do you need: Search by location: Search Now Welcome to SoulSearch… We are a global community-driven platform designed to connect Spiritual Seekers with aligned and powerful Practitioners, Healers, and Teachers. Book one-on-one services, retreats & courses. Participate in online and in-person events such as our SoulSearch Enlightenment Expos. Engage in the enlightening & entertaining SoulSearchTV. Benefit from a variety of unique, signature experiences as we support one another on our SoulSearching journey. Join SoulSearch Today and expand your unique connection to all things Consciousness and Spirituality, all while finding and expanding your Tribe FIND PRACTITIONERS BY CATEGORY As a seeker, you can navigate through our website free of charge. If you are desiring to connect on a deeper level with specific experts, you may book one-on-one sessions, courses and retreats. Astrology Breathwork & Meditation Coaching Counseling & Therapy Creative Expression: Music & Art Energy & Healing Work Experiences Holistic Medicine Massage & Bodywork Movement Readings Spiritual Teachings View All BRINGING YOU THE WORLD'S TOP TRANSFORMATIVE PRACTIONERS Focused Life-Force Energy Specialty Energy & Healing Work Located in Nelson, BC View Listing Durek Verrett Specialty Creative Expression: Music & A... View Listing India Prema Specialty Coaching Located in Sedona, AZ View Listing Lisa McCardle Specialty Energy & Healing Work Located in Sedona, AZ View Listing Marcella Harting Specialty Coaching Located in Paradise Valley, AZ View Listing Ron Interpreter: \"Beeh Ji Zhon... Specialty Energy & Healing Work Located in Phoenix, AZ View Listing Mary Elizabeth Radecki Specialty Readings Located in Lancaster, CA View Listing Medium Kelley Eckhardt Specialty Energy & Healing Work Located in Sacramento, CA View Listing Galaxy Starborn Specialty Energy & Healing Work Located in Menlo Park, CA View Listing Circle of Consciousness & Happ... Specialty Breathwork & Meditation Located in Sunnyvale, CA View Listing Amanda Romania Specialty Energy & Healing Work Located in Sedona, AZ View Listing Joan of Angels Specialty Energy & Healing Work Located in Petaluma, CA View Listing Barbara Tintori Specialty Spiritual & Energy Healer View Listing Lee Osborne Specialty Energy & Healing Work Located in Grass Valley, CA View Listing Dannion Brinkley Specialty Readings Located in SC View Listing Harp Magic Music Specialty Energy & Healing Work Located in Sedona, AZ View Listing Moorea Specialty Energy & Healing Work Located in Sarasota, FL View Listing Positivity Matters Specialty Spiritual & Energy Healer View Listing Bob The Psychic Specialty Energy & Healing Work Located in Phoenix, AZ View Listing Lightworker Ministry Specialty Energy & Healing Work Located in Fairfax View Listing Suzanne Ross Transcendence Specialty Energy & Healing Work Located in Sedona, AZ View Listing Cheri Arellano Specialty Energy & Healing Work Located in Chandler, AZ View Listing Ronald Schlegel Specialty Energy & Healing Work Located in Addison, NY View Listing Tanjila Specialty Energy & Healing Work Located in Sedona, AZ View Listing View All JOIN OUR COMMUNITY Use SoulSearch as your \"go-to\" global platform to learn, connect, promote, and prosper. Join Our Facebook Group Sign Up for Our Email List Join Our Site Today! View All From Our Blog Was That My Thought… or My Intuition? Have you ever wondered: Was that just a thought… or w... Read More 3 Keys to Soul Awakening Can You Feel It? The Energy Is Rising.There’s a ... Read More A New Story for Friday the 13th If you looked at recent headline news, it might seem like th... Read More Global Free Trade of Love One of the many challenges that is triggering some anxiety i... Read More View All SoulSearch Client Testimonials Showcase Your Business Now! ☆ Life changing ☆ Kristi, and the Seven Rays of the Sun, have held tremendous space for my spiritual healing. I am forever grateful as these classes have transformed the course of my life and guided me to spiritually grow. Shadow work and processing unhealed emotional wounds have helped me find peace with my childhood and find forgiveness and unconditional love for my human journey. Kristi has helped me acknowledge the abusive relationship with my mother and given me the tools to keep going as a stronger individual. The teachings offer ancient out-of-this-world wisdom and insight. -Hailey ☆ Always Inspiring ☆ \" Just want to say that working with Annie is always a delight. Mentor, teacher, and advisor... so very grateful for her skills and ability to connect with divine spirit (and her witty sense of humor). Through the years I have needed her council and teachings for all \"life\" situations, and I'm always amazed with the answer that come through. - Gay Danjou ☆ 5 out of 5 stars ☆ I have had three readings with Amanda and have come away from each one amazed at her gifts. The first thing I notice is her beautiful, warm and compassionate energy touching me, holding me in what feels like a Divine embrace. She sees all of you without judgment and helps you navigate even the most painful places in the most gentle way. Her messages come through like poetry. In the moment I may not always understand them, but when I look back at my notes, like poetry, more of their essence is revealed. She also offers practical, real-world advice to help you on your path. I would recommend her guidance to anyone in search of clarity or healing. I believe her to be a blessing to each life she touches. - Kristin ☆ Highly Skilled Team ☆ After taking classes for a few months,I feel confident recommending these two great guys. They are informative, gracious, highly skilled and a great team. I was very comfortable and allowed to grow in my work without feeling pressured and with incredible grace and encouragement. So grateful for their guidance. - Pam D. ☆ My inner Journey ☆ India, has helped me to start on a path inward to enlightenment. I met India in LHC in January for one of her workshops. I felt a connection with her immediately. My journey inward has  just begun, but I truly am in a great place, and India in a very short time has been a huge part of it. She is somebody I know that I can go to at anytime for guidance, questions or understanding. India will be a part of my journey where ever it takes me, she encourages one to follow their path and live with love for yourself and others. thank you, India for all you have done and will do to help me on my road inward! - Geno Why Join SoulSearch ? Introducing SoulSearch, home for our fellow Soul Travelers on their Soul Searching journey. We are your one-stop Consciousness platform, inviting you to embark on a journey of Self-Discovery and Personal Growth, with an array of features designed to enlighten, elevate, and expand your mind, body, and soul.  Our community is your gateway to connecting with healers and guides who can assist you along your spiritual path. At SoulSearch, you can explore a wide variety of resources, including one-on-one sessions, courses, events, and SoulSearch TV, all mindfully curated to assist you on your Journey toward Self-Awareness and Inner Peace. Delve into the wisdom of renowned experts, participate in transformative workshops, and explore a wide range of metaphysical topics. Within the safe space of the SoulSearch Community, you can connect with like-minded individuals on their unique path of Self-Discovery. Engage in meaningful discussions, seek advice, and share your experiences with a supportive community that understands the importance of personal growth and spiritual development. Plus, don't miss out on our Enlightenment Expos, where you can explore the metaphysical realms and connect with gifted intuitives and healers. Whether seeking guidance, healing, or a deeper understanding of the spiritual realm, SoulSearch has everything you need to embark on a soulful journey. Join the SoulSearch Community today and discover a world of enlightenment and transformation. Join Our Community GET ON OUR MAILING LIST Stay up to date on our latest offerings About Finding Spiritual & Energetic Healers & Guides is easy by searching our trusted network and being a part of our vibrant spiritual community! Website How It Works List Your Business Search Browse Categories Browse Locations Support Member Login Contact Us Spiritual & Energetic Healers & Guides - Get Listed Today © 2025 SoulSearch All Rights Reserved Terms of Use Privacy Policy"
    },
    {
      "url": "https://www.naropa.edu/about-naropa/naropa-healers-directory/",
      "text": "Naropa Healers Directory | Naropa University Skip to content Request Info Visit Campus Apply Now Donate My Naropa Search Academics Close Academics Open Academics Academics Contemplative education brings together the best of Western scholarship and Eastern world wisdom traditions. Therefore, your pursuit of wisdom at Naropa means learning both about academic subjects and about your own place in the world. This innovative approach places Naropa on the cutting edge of the newest and most effective methods of teaching and learning. UNDERGRADUATE Undergraduate BA Art Therapy Online BA Art Therapy BA Creative Writing & Literature BA Environmental Studies Environmental Studies Online BA Interdisciplinary Studies Interdisciplinary Studies Online BA Psychology BA Psychology Online BA Religious Studies BA Visual Arts BA Yoga Studies Undergraduate BA Art Therapy Online BA Art Therapy BA Creative Writing & Literature BA Environmental Studies Environmental Studies Online BA Interdisciplinary Studies Interdisciplinary Studies Online BA Psychology BA Psychology Online BA Religious Studies BA Visual Arts BA Yoga Studies GRADUATE Graduate MA in Clinical Mental Health Counseling —Buddhism-Informed Contemplative Counseling —Mindfulness-Based Transpersonal Counseling —Mindfulness-Based Transpersonal Counseling (Low-Residency) —Somatic Counseling —Somatic Counseling: Dance/Movement Theories & Practice —Transpersonal Art Therapy — Nature-Based Transpersonal Counseling MFA in Creative Writing & Poetics MFA in Creative Writing (Low-Residency) Master of Divinity Master of Divinity (Low-Residency) MA in Ecopsychology (Low-Residency) MA in Yoga Studies (Low-Residency) Graduate MA in Clinical Mental Health Counseling —Buddhism-Informed Contemplative Counseling —Mindfulness-Based Transpersonal Counseling —Mindfulness-Based Transpersonal Counseling (Low-Residency) —Somatic Counseling —Somatic Counseling: Dance/Movement Theories & Practice —Transpersonal Art Therapy — Nature-Based Transpersonal Counseling MFA in Creative Writing & Poetics MFA in Creative Writing (Low-Residency) Master of Divinity Master of Divinity (Low-Residency) MA in Ecopsychology (Low-Residency) MA in Yoga Studies (Low-Residency) Academics Academic Calendar Course Catalog Undergraduate Academics Graduate Academics Online Bachelor’s Degree Programs Low Residency MA Degree Programs Extended Campus Academic Support Schools & Centers Admissions & Aid Close Admissions & Aid Open Admissions & Aid Admissions\n& Aid If you’re seeking an education that resonates with both personal fulfillment and global impact, Naropa could be your top choice. At Naropa, you will experience a comprehensive curriculum that integrates the best of Eastern and Western educational approaches. Explore how Naropa can fuel your journey of intellectual and spiritual development. Admissions & Aid How to Apply Visit Naropa Alternative Ways to Attend Meet the Admissions Team Costs & Aid Housing & Residence Life Virtual Tour Accepted Student Checklist for Undergraduate Students Life at Naropa Close Life at Naropa Open Life at Naropa Life at Naropa Through its incredibly vibrant and welcoming community,  “Naropa offers a home for those who aren’t willing to conform to convention—the mystic, the healer, the prophet, the rebel, the artist, the revolutionary, the oddball—those who are incredible contributors to the evolution of society and of our planet.”—Core Associate Professor Zvi Ish-Shalom Follow Us Life at Naropa Student Handbook Student Support Wellness Student Accountability Career & Life Development Parent & Family Resources Living in Boulder Campus Safety Alumnx Relations The Naropa Difference Close The Naropa Difference Open The Naropa Difference The Naropa Difference How is Naropa different from other universities? At Naropa, a liberal arts education balances rigorous academics with powerful interpersonal skills and self-awareness to educate the whole person. Naropa’s contemplative approach is inspired by Buddhist philosophy and the conviction that we can build a diverse, contemplative, enlightened society when we have transformed education to affirm the basic goodness of every person. The Naropa Difference Naropa Magazine Pilot Light Blog Mindful U Podcast About Naropa Close About Naropa Open About Naropa About Naropa Located in Boulder, Colorado, Naropa University is a Buddhist-inspired, nonsectarian liberal arts university that is recognized as the birthplace of the mindfulness movement. Naropa offers undergraduate and graduate degree programs that emphasize professional and personal growth, intellectual development, and cultivating compassion. About Naropa Purpose, Vision, Mission, and Values History of Naropa Preparing for the Next 50 Years Leadership Faculty/Staff Directory Campuses Naropa Tea House Alaya Preschool Naropa Community Art Studio Community Counseling Center Employment Accreditation Library Store Academics Close Academics Open Academics Admissions & Aid Close Admissions & Aid Open Admissions & Aid Life at Naropa Close Life at Naropa Open Life at Naropa The Naropa Difference Close The Naropa Difference Open The Naropa Difference About Naropa Close About Naropa Open About Naropa About Naropa › Naropa Healers Directory Naropa Healers Directory Program Information Accreditation Purpose, Vision, Mission, and Values Mission, Culture & Inclusive Community Mindfulness & Contemplative Education Diversity Sustainability History of Naropa Founding Vision The First Summer Sessions Psychology and Beyond Take Me To Your Poets Preparing for the Next 50 Years Leadership Office of the President Past Leaders Executive Leadership Council Board of Trustees Faculty/Staff Directory Campuses Naropa Tea House Tea Sessions Alaya Preschool Naropa Community Art Studio Community Counseling Center Career Opportunities Accreditation Purpose, Vision, Mission, and Values Mission, Culture & Inclusive Community Mindfulness & Contemplative Education Diversity Sustainability History of Naropa Founding Vision The First Summer Sessions Psychology and Beyond Take Me To Your Poets Preparing for the Next 50 Years Leadership Office of the President Past Leaders Executive Leadership Council Board of Trustees Faculty/Staff Directory Campuses Naropa Tea House Tea Sessions Alaya Preschool Naropa Community Art Studio Community Counseling Center Career Opportunities Welcome to Naropa’s Healing Directory, which includes Naropa alumnx who work in healing businesses. You can search this list by healing modalities and specialties, as well as other key words. Please note, this website is compiled from submissions directly given to Naropa University’s Office of Alumnx Engagement and contains a variety of resources, but is not intended to substitute or replace the professional medical advice you receive from your health care provider. The content provided here is for informational purposes only, and was not designed to diagnose or treat a health problem or disease. Please consult your health care provider with any questions or concerns you may have regarding your condition. We hope you find the information and links to other websites to be helpful, but please remember we do not control or endorse the information presented on these websites, nor do these sites endorse the information contained here. Healer Directory New Entry Search Search ABOUT NAROPA Purpose, Vision, Mission, and Values History of Naropa Preparing for the Next 50 Years Leadership Accreditation Employment Faculty/Staff Directory Campuses Naropa Tea House Alaya Preschool Naropa Community Art Studio Community Counseling Center Purpose, Vision, Mission, and Values History of Naropa Preparing for the Next 50 Years Leadership Accreditation Employment Faculty/Staff Directory Campuses Naropa Tea House Alaya Preschool Naropa Community Art Studio Community Counseling Center EVENTS & COMMUNITY Campus Events The Pilot Light Mindful U Podcast Naropa Shop Alumnx Relations Naropa Authors Directory Naropa Healers Directory Media Resources Mission, Culture & Inclusive Community CU Folsom Field Parking Campus Events The Pilot Light Mindful U Podcast Naropa Shop Alumnx Relations Naropa Authors Directory Naropa Healers Directory Media Resources Mission, Culture & Inclusive Community CU Folsom Field Parking USER INFORMATION COVID-19 Information Student Right to Know Office of Civil Rights & Title IX Privacy Policy Terms & Conditions GSC Licensure & Credentialing COVID-19 Information Student Right to Know Office of Civil Rights & Title IX Privacy Policy Terms & Conditions GSC Licensure & Credentialing SUPPORT NAROPA Why Give to Naropa Meet the Development Staff Make a Gift Today Why Give to Naropa Meet the Development Staff Make a Gift Today 2130 Arapahoe Avenue Boulder, CO 80302 1-800-772-6951 admissions@naropa.edu Worried about a Student? MyNaropa Facebook X-twitter Instagram Youtube Linkedin © 2025 Naropa University. All rights reserved. YOU ARE READY. This is where experiential learning meets academic rigor. Where you challenge your intellect and uncover your potential. Where you discover the work you’re moved to do—then use it to transform our world. “*” indicates required fields CLOSE Search Naropa University Search SEARCH Search Search Request Info Visit Campus Apply My Naropa Academics Contemplative education brings together the best of Western scholarship and Eastern world wisdom traditions. Therefore, your pursuit of wisdom at Naropa means learning both about academic subjects and about your own place in the world. This innovative approach places Naropa on the cutting edge of the newest and most effective methods of teaching and learning. UNDERGRADUATE Undergraduate BA Art Therapy Online BA Art Therapy BA Creative Writing & Literature BA Environmental Studies Environmental Studies Online BA Interdisciplinary Studies Interdisciplinary Studies Online BA Psychology BA Psychology Online BA Religious Studies BA Visual Arts BA Yoga Studies Undergraduate BA Art Therapy Online BA Art Therapy BA Creative Writing & Literature BA Environmental Studies Environmental Studies Online BA Interdisciplinary Studies Interdisciplinary Studies Online BA Psychology BA Psychology Online BA Religious Studies BA Visual Arts BA Yoga Studies GRADUATE Graduate MA in Clinical Mental Health Counseling —Buddhism-Informed Contemplative Counseling —Mindfulness-Based Transpersonal Counseling —Mindfulness-Based Transpersonal Counseling (Low-Residency) —Somatic Counseling —Somatic Counseling: Dance/Movement Theories & Practice —Transpersonal Art Therapy — Nature-Based Transpersonal Counseling MFA in Creative Writing & Poetics MFA in Creative Writing (Low-Residency) Master of Divinity Master of Divinity (Low-Residency) MA in Ecopsychology (Low-Residency) MA in Yoga Studies (Low-Residency) Graduate MA in Clinical Mental Health Counseling —Buddhism-Informed Contemplative Counseling —Mindfulness-Based Transpersonal Counseling —Mindfulness-Based Transpersonal Counseling (Low-Residency) —Somatic Counseling —Somatic Counseling: Dance/Movement Theories & Practice —Transpersonal Art Therapy — Nature-Based Transpersonal Counseling MFA in Creative Writing & Poetics MFA in Creative Writing (Low-Residency) Master of Divinity Master of Divinity (Low-Residency) MA in Ecopsychology (Low-Residency) MA in Yoga Studies (Low-Residency) Academics Academic Calendar Course Catalog Undergraduate Academics Graduate Academics Online Bachelor’s Degree Programs Low Residency MA Degree Programs Extended Campus Academic Support Schools & Centers Request Info Visit Campus Apply My Naropa Admissions & Aid If you’re seeking an education that resonates with both personal fulfillment and global impact, Naropa could be your top choice. At Naropa, you will experience a comprehensive curriculum that integrates the best of Eastern and Western educational approaches. Explore how Naropa can fuel your journey of intellectual and spiritual development. Admissions & Aid How to Apply Visit Naropa Alternative Ways to Attend Meet the Admissions Team Costs & Aid Housing & Residence Life Virtual Tour Accepted Student Checklist for Undergraduate Students Request Info Visit Campus Apply My Naropa Life at Naropa Through its incredibly vibrant and welcoming community,  “Naropa offers a home for those who aren’t willing to conform to convention—the mystic, the healer, the prophet, the rebel, the artist, the revolutionary, the oddball—those who are incredible contributors to the evolution of society and of our planet.”—Core Associate Professor Zvi Ish-Shalom Life at Naropa Student Handbook Student Support Wellness Student Accountability Career & Life Development Parent & Family Resources Living in Boulder Campus Safety Alumnx Relations Request Info Visit Campus Apply My Naropa The Naropa Difference How is Naropa different from other universities? At Naropa, a liberal arts education balances rigorous academics with powerful interpersonal skills and self-awareness to educate the whole person. Naropa’s contemplative approach is inspired by Buddhist philosophy and the conviction that we can build a diverse, contemplative, enlightened society when we have transformed education to affirm the basic goodness of every person. The Naropa Difference Naropa Magazine Pilot Light Blog Mindful U Podcast Request Info Visit Campus Apply My Naropa About Naropa Located in Boulder, Colorado, Naropa University is a Buddhist-inspired, nonsectarian liberal arts university that is recognized as the birthplace of the mindfulness movement. Naropa offers undergraduate and graduate degree programs that emphasize professional and personal growth, intellectual development, and cultivating compassion. About Naropa Purpose, Vision, Mission, and Values History of Naropa Preparing for the Next 50 Years Leadership Faculty/Staff Directory Campuses Naropa Tea House Alaya Preschool Naropa Community Art Studio Community Counseling Center Employment Accreditation Library Store Healer Directory New Entry Add a new author to the healers directory Featured Image (Required) Max. file size: 2 GB. Healer Name (Required) Description (Required) Website name (Required) Link to Healers's Website (Required) Licensing Credentials Relationship to Naropa University Alumnx Faculty Alumnx + Faculty Staff Student Class Year 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 2026 2027 Facebook This field is for validation purposes and should be left unchanged. Δ Emergency Notification Test July 10, 2025.  This is a test of the Naropa University emergency notification system. This is only a test. No response or action is required. Testing of our emergency notification system is required by the Jeanne Clery Disclosure of Campus Security Policy and Crime Statistics Act, a federal law. Apply Now"
    },
    {
      "url": "https://www.trustpilot.com/review/blackmagicremoval.us",
      "text": "Indian Astrologer Psychic And Spiritual Healer Reviews | Read Customer Service Reviews of blackmagicremoval.us Suggested companies Astrologer for Love problem solver loveproblemsolver.com • 36 reviews 4.8 Labyrinth Walking labyrinthwalking.net • 184 reviews 4.9 Mysticsense mysticsense.com • 1.4K reviews 4.7 Categories Blog Log in For businesses For businesses Log in Categories Blog Hobbies & Crafts Astrology & Numerology Astrologer Indian Astrologer Psychic And Spiritual Healer Summary About Reviews Visit website Write a review Visit website Claimed profile Indian Astrologer Psychic And Spiritual Healer Reviews 34 • 4.7 Astrologer Write a review Visit website Write a review Companies on Trustpilot aren't allowed to offer incentives or pay to hide reviews. See what reviewers are saying ZJ Zara Jane Jan 18, 2025 Verified I was able to release negative patterns that were holding me back. My life feels vibrant and full of potential again. Thank you, Black Magic Removal! BJ Brandon Joseph Jan 30, 2025 Verified I felt empowered to take control of my life again. Their methods for removing negativity were truly effective. Forever grateful for their help! ME Magnus Emil Jan 19, 2025 Verified I learned valuable techniques for maintaining my spiritual well-being. Their guidance helped me reclaim my power. Thank you for everything! FJ Felix John Jan 11, 2025 Verified The relief I felt after their cleansing was incredible. I no longer feel burdened by negative energy. Thank you for your amazing support! See all 34 reviews We perform checks on reviews Company details # 1 of 13 best companies in Astrologer # 1 of 2 best companies in Hindu Priest # 1 of 4 best companies in Hindu Temple # 2 of 14 best companies in Psychic Written by the company About Us\n\n\nOur astrologer balram is Coming from an astrological background of great Psychics, Astrologers, Pandiths, Spiritual Healers, and Palmists, he holds a vast experience and knowledge of the field of astrology. It has been, since the age of 20 that Pandith Ji is into the practice of astrology. Being surrounded by great and learned astrologers he is be en drilled with quality teachings of astrology and the branch that fall under this vast and complex field. Throughout the world, people hold immense faith and trust Pandith Ji for his astrological consultations. This is the reason that Master sri krishna Ji has gained this popularity and fame in the Babrbados, United States.\n\n\nPsychic Reader Astrology services which offer results in a very short period of time and astro balram humble behavior are the key factors that have attracted people around the world to take his assistance and guidance. Our Pandith ji is a great Indian Spiritual Healer who believes in helping people who suffer in their lives. Do you believe in astrology and the various and wonderful benefits of astrology? If not, then it’s time to start believing in astrology since with a 20-year experience and he is the Best horoscope reading in Borbodas, proves your astrological reading experience and is there to help you and solve all your problems related to it. personal. professional life or even love using his experience in Vedic astrology in U.S.A. He is to provide the various services of astrology such as Vashikaran Specialist, Expert in Black Magic, Psychic Reading, Specialist in Marriage of Love, Expert in Vedic Astrology, etc See more Contact info United States blackmagicremoval.us 4.7 Excellent 34 reviews 5-star 4-star 3-star 2-star 1-star How is the TrustScore calculated? How this company uses Trustpilot People also looked at Astrologer for Love problem solver loveproblemsolver.com 4.8 (36) Labyrinth Walking labyrinthwalking.net 4.9 (184) Mysticsense mysticsense.com 4.7 (1K) Indian Astrologer Pandit Kumar panditastrology.com 4.6 (53) Astrologer & Psychic reading by Ram Tulasi ji in USA astroramji.com 4.5 (38) Top & Best Indian Astrologer In New York USA indianastrologers.us 4.4 (12) SpiritualBlossom spiritualblossom.com 4.7 (194) Astrologer & Psychic Pandit Kumar californiaastrologer.com 4.3 (17) 4.7 All reviews 34 total ● Write a review 5-star 100% 4-star 0% 3-star 0% 2-star 0% 1-star 0% Advertisement How Trustpilot labels reviews More filters Most recent NC Nicole Cooper GB • 1 review Sep 3, 2025 My session with the Indian Astrologer… My session with the Indian Astrologer and Psychic Healer was a truly eye-opening experience. I went in feeling lost and uncertain about some major life decisions, but I left with a renewed sense of clarity and purpose August 4, 2025 Unprompted review Advertisement KW Katherine Ward US • 1 review Jan 31, 2025 Verified Black Magic Removal provided me with… Black Magic Removal provided me with the tools I needed to reclaim my energy. I feel renewed and hopeful. Thank you for everything! January 31, 2025 DF Diego F US • 1 review Jan 31, 2025 Verified Their compassionate approach helped me… Their compassionate approach helped me heal deep-rooted fears. I’m now living a more authentic and joyful life. Highly recommend this service! January 31, 2025 BJ Brandon Joseph US • 3 reviews Jan 30, 2025 Verified I felt empowered to take control of my… I felt empowered to take control of my life again. Their methods for removing negativity were truly effective. Forever grateful for their help! January 30, 2025 AC Ashton Cole US • 2 reviews Jan 30, 2025 Verified The support I received was nothing… The support I received was nothing short of amazing. I’m now living a life filled with positivity and light. Thank you for your incredible guidance! January 30, 2025 Advertisement AB Audrey Bennett US • 1 review Jan 27, 2025 Verified The team was incredibly understanding… The team was incredibly understanding and professional. I felt safe throughout the entire process. My life has transformed for the better! January 27, 2025 SA Sawyer Alexander FR • 3 reviews Jan 23, 2025 Verified I learned how to protect my energy and… I learned how to protect my energy and maintain balance. The support I received was both empowering and enlightening. Thank you, Black Magic Removal! January 23, 2025 MS Mikkel Søren US • 2 reviews Jan 22, 2025 Verified Their expertise in removing negative… Their expertise in removing negative influences is unmatched. I’m finally free to pursue my dreams without fear. Forever thankful for their help! January 22, 2025 JE Johan Erik US • 1 review Jan 22, 2025 Verified The positive changes in my life since… The positive changes in my life since their intervention have been incredible. I feel lighter and more at peace. Highly recommend Black Magic Removal! January 22, 2025 Advertisement ME Magnus Emil US • 1 review Jan 19, 2025 Verified I learned valuable techniques for… I learned valuable techniques for maintaining my spiritual well-being. Their guidance helped me reclaim my power. Thank you for everything! January 19, 2025 LH Lars Henrik US • 1 review Jan 19, 2025 Verified Their approach was both insightful and… Their approach was both insightful and effective. I felt an immediate shift in my energy. I’m so grateful for their support! January 19, 2025 ZJ Zara Jane US • 1 review Jan 18, 2025 Verified I was able to release negative patterns… I was able to release negative patterns that were holding me back. My life feels vibrant and full of potential again. Thank you, Black Magic Removal! January 18, 2025 JE Jeremiah US • 2 reviews Jan 16, 2025 Verified Their understanding of spiritual… Their understanding of spiritual disturbances is profound. I felt understood and supported throughout the process. Thank you for everything! January 16, 2025 Advertisement ZJ Zara Jane US • 1 review Jan 16, 2025 Verified The techniques used were both effective… The techniques used were both effective and empowering. I feel a renewed sense of purpose in my life. Highly recommend Black Magic Removal! January 16, 2025 AL Albie US • 1 review Jan 13, 2025 Verified I never imagined I could feel this… I never imagined I could feel this light again. Their compassionate approach made a significant difference. Forever thankful for their support! January 13, 2025 SA Samuel US • 1 review Jan 13, 2025 Verified Their insights into my situation were… Their insights into my situation were incredibly illuminating. I learned to protect my energy and live authentically. Thank you for your guidance! January 13, 2025 LG Levi George US • 1 review Jan 11, 2025 Verified Black Magic Removal helped me break… Black Magic Removal helped me break free from toxic influences. I’m now living a more positive and fulfilling life. Highly recommend their expertise! January 11, 2025 Advertisement FJ Felix John US • 1 review Jan 11, 2025 Verified The relief I felt after their cleansing… The relief I felt after their cleansing was incredible. I no longer feel burdened by negative energy. Thank you for your amazing support! January 11, 2025 WI Wilbur US • 1 review Jan 10, 2025 Verified I was amazed at the depth of their… I was amazed at the depth of their understanding of spiritual issues. Their techniques provided clarity and healing. Highly recommend this service! January 9, 2025 BA Bairstow US • 2 reviews Jan 7, 2025 Verified The changes I experienced were both… The changes I experienced were both immediate and lasting. I’m now living a life free from the shadows of negativity. Forever grateful for their help! January 7, 2025 Previous 1 2 Next page The Trustpilot Experience We're open to all Anyone can write a Trustpilot review. People who write reviews have ownership to edit or delete them at any time, and they’ll be displayed as long as an account is active . We champion verified reviews Companies can ask for reviews via automatic invitations. Labeled Verified, they’re about genuine experiences. Learn more about other kinds of reviews. We fight fake reviews We use dedicated people and clever technology to safeguard our platform. Find out how we combat fake reviews . We show the latest reviews Learn about Trustpilot’s review process . We encourage constructive feedback Here are 8 tips for writing great reviews . We verify reviewers Verification can help ensure real people are writing the reviews you read on Trustpilot. We advocate against bias Offering incentives for reviews or asking for them selectively can bias the TrustScore, which goes against our guidelines . Take a closer look are you human? Choose country United States Danmark Österreich Schweiz Deutschland Australia Canada United Kingdom Ireland New Zealand United States España Suomi Belgique België France Italia 日本 Norge Nederland Polska Brasil Portugal Sverige About About us Jobs Contact Blog How Trustpilot works Press Investor Relations Community Trust in reviews Help Center Log in Sign up Businesses Trustpilot Business Products Plans & Pricing Business Login Blog for Business Follow us on Legal Privacy Policy Terms & Conditions Guidelines for Reviewers System status Modern Slavery Statement © 2025 Trustpilot, Inc. All rights reserved."
    },
    {
      "url": "https://www.healingtrust.org/about-us/staff/",
      "text": "Staff & Board - The Healing Trust About Us History, Mission, and Reports Staff & Board Our Commitment to Equity Grant Programs Eligibility Criteria Application Details & Deadlines Types of Grants Operating Grant Resilient Families Thriving Communities Strengthening Democracy Culture and Care Fund Sabbatical Fund Participatory Grantmaking Recipients Extra Goodies Our Advocacy Retreats and Self-Care Leadership Programs Internships FAQs Resources & Blogs Press Kit Contact Select Page STAFF & BOARD Meet Our Team Abby Siegel Hyman Program Partner for External Partnerships As the Program Partner for External Partnerships, Abby manages our work beyond grantmaking that supports the care and capacity of our grantees, including technical assistance and workshops, leadership circles, and Healing for the Healer retreats. She also manages our Culture and Care grant portfolio and the Sabbatical Fund. She is a member of our Communications Team. She can be found wherever there is coffee or chocolate. ➔ LEARN MORE abby.hyman@healingtrust.org LinkedIn Adell Neal Operations Director Adell Neal is the Operations Director at The Healing Trust. In this role, she manages The Trust’s operations, including financial administration, human resources and benefits administration, and she oversees the facility’s management and operating budget.  She loves trivia and is challenged daily when watching, Jeopardy!® episodes. ➔ LEARN MORE adell.neal@healingtrust.org LinkedIn Catherine Smith Program Partner Catherine is a Program Partner at The Healing Trust. In this role, Catherine directs our grantmaking activities in Bedford, Maury, and Rutherford Counties. She also manages some of our Mental Health and Abuse Prevention grants in Davidson County and advises on our advocacy work. An avid live music fan, Catherine and her husband enjoy going to music festivals and seeing obscure bands in divey places. ➔ LEARN MORE catherine.smith@healingtrust.org LinkedIn Diana Andrew Office and Events Manager Diana Andrew is the Office & Events Manager for The Healing Trust. She oversees the operation and maintenance of facilities, manages event logistics, and provides administrative support to the Board of Trust and CEO. She is passionate about sustainability and enjoys cooking and hosting loved ones. ➔ LEARN MORE diana.andrew@healingtrust.org LinkedIn Jennifer Oldham Vice President for Communications and Partnerships As the VP for Communications and Partnerships, Jennifer leads our communications team, supports the 37208 Participatory Grantmaking program, directs our equity work, and manages the Thriving Communities grants in Davidson County. Jennifer also manages the Resilient Families Violence Prevention and statewide grants and continues to set our communications strategy and public affairs work. She is an avid reader of fiction and creates art using a needle and thread. ➔ LEARN MORE jennifer.oldham@healingtrust.org LinkedIn Megan Davis Program and Communications Associate As the Programs and Communications Associate, Megan oversees the management of the grants database and provides support to the Trust’s grantmaking and programmatic initiatives. She also assists with developing social media communications across all platforms to reflect the Trust’s mission and vision. Megan has a background in public health and is passionate about improving health equity in Tennessee. In her free time, Megan is a self-proclaimed foodie and enjoys finding new restaurants in Nashville. ➔ LEARN MORE megan.davis@healingtrust.org LinkedIn Samuel Jackson President and CEO Samuel Jackson is the President and CEO of The Healing Trust. He works closely with our Board of Trust, oversees the fiscal and administrative operations of The Healing Trust, and works collaboratively with the program team. On the weekends, he can be found in his garage woodworking or on the sidelines coaching basketball. ➔ LEARN MORE samuel.jackson@healingtrust.org LinkedIn Sumita Keller Vice President of Programs and Advocacy As VP of Programs and Advocacy, Sumita oversees the grantmaking and internship programs and directly supports the Strengthening Democracy portfolio and the Thriving Communities, Resilient Families and Participatory Grantmaking portfolios in Montgomery County. She is also responsible for identifying and engaging in systems change advocacy opportunities alongside grantees. Sumita enjoys cheesy movies and is always up for a good game night. ➔ LEARN MORE sumita.keller@healingtrust.org LinkedIn Board of Directors Our mission is to support and partner with communities to advance racial equity and eliminate health disparities through advocacy and strategic investments. In 2025-2026, The Healing Trust’s board consists of 16 voting members and four non-voting community members. Of these 20 board members, 50% are under the age of 50, 65% identify as Black, Indigenous, or People of Color, and 25% live outside of Davidson County. Additionally, 30% identify as male and 70% identify as female. THE BOARD Dr. Hana Ali , Sumner County Democratic Party Chair, Healthcare Professional Rev. Jennifer Bailey , Executive Director,  The Dan and Margaret Maddox Fund LaMel Bandy-Neal , Senior Vice President and Chief Financial Officer, Meharry Medical College Kristina Clark , President and Founder, KM Clark Consulting Group Magi Curtis, Executive Vice President, J.S. Held LLC Nicole Dunigan (Chair) , Senior Vice President, Pinnacle Bank Dr. Gilbert Gonzales , Assistant Professor, Dept. of Medicine, Health and Society, Vanderbilt University Valerie Guzman , Director of Corporate, Foundation & Government Giving, Operation Stand Down TN Anders Hall, Vice Chancellor for Investments and Chief Investment Officer, Vanderbilt University Craig Hargrow (Vice Chair) , Deputy Executive Director, Tennessee Commission on Children and Youth Cheryl Jones , Treasury Management Sales Officer, Bank of Tennessee Dr. Christa Martin , Executive Director of Access and Inclusion, Columbia State Community College Shannone Raybon , Deputy General Counsel, AdaptHealth Erica Saeger , Audit Principal, Crosslin, PLLC Katie Williams , Team Business Manager, UBS Private Wealth Management Ben Wolf , Financial Advisor, Growth & Development Director, Northwestern Mutual Community Members Tenia Clayton , Associate, Baker Donelson Valora Gurganious , Partner-Emeritus, Senior Management Consultant, DoctorsManagement LLC Joshua Ireland , Chief Executive Officer, Jefferson Bridge Capital Terry Looper , Retired Educator & Principal, Bedford County Newsletter Signup 2928 Sidco Drive Nashville, TN 37204 615.284.8271 Grant Programs About Us FAQs News and Blogs Contact Us Facebook Instagram LinkedIn YouTube Website Design by Powell Creative"
    }
  ]
}