{
  "fuentes": [
    {
      "url": "https://rnrgames.com/contactus",
      "email": "newproducts@rnrgames.com"
    },
    {
      "url": "https://rnrgames.com/contactus",
      "email": "newproducts@rnrgames.com"
    },
    {
      "url": "https://axescapetn.com/location/",
      "email": "info@axescapetn.com"
    },
    {
      "url": "https://splitoakaxescapegames.com/about",
      "email": "contact@splitoakaxescapegames.com"
    },
    {
      "url": "https://www.ticketor.com/ryagames/contactus?culture=en",
      "email": "ryagames@ticketor.com"
    },
    {
      "url": "https://splitoakaxescapegames.com/axe-throwing",
      "email": "contact@splitoakaxescapegames.com"
    },
    {
      "url": "https://splitoakaxescapegames.com/faqs",
      "email": "contact@splitoakaxescapegames.com"
    },
    {
      "url": "https://investments.supercell.com/contact/",
      "email": "media@supercell.com"
    },
    {
      "url": "https://splitoakaxescapegames.com",
      "email": "contact@splitoakaxescapegames.com"
    }
  ],
  "mails": [
    "contact@splitoakaxescapegames.com",
    "info@axescapetn.com",
    "media@supercell.com",
    "newproducts@rnrgames.com",
    "ryagames@ticketor.com"
  ],
  "nombre_sitio": "splitoakaxescapegames.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://rnrgames.com/contactus",
      "text": "Contact Us | R&R Games Menu Search Personal menu Search store Close Search My account My account Close Register Log in Compare products list Wishlist 0 Shopping cart Close 0 $0.00 You have no items in your shopping cart. All Categories Menu Close Products All Products Card Games Family Games Kids Games Party Games Strategy Games Expansion Sets Ding & Dented RANDY O GAMES BARN MADE GAMES Reseller Information News Contact Us FAQs Hall of Fame All Categories Back Products Back All Products Card Games Family Games Kids Games Party Games Strategy Games Expansion Sets Ding & Dented RANDY O GAMES BARN MADE GAMES Reseller Information News Contact Us FAQs Hall of Fame Contact Us Questions? Please contact us by email, phone, or complete the form below and we'll be in touch. NOTE: Please include your address and phone number if you are inquiring about a defective product. Want to submit your game idea to us for possible publication? Skip the form below and Email details to NewProducts@RnRgames.com Phone: 1-888-8RIDDLE (1-888-874-3353) Mail address: R&R Games, Inc. PO Box 130195 Tampa, FL 33681 Your name: * Your email: * Enquiry: * Submit Newsletter Send Subscribe Unsubscribe Wait... Information Sitemap Search New products Hall of Fame Hidden Hunts Shipping & Returns Reseller Information Privacy notice Conditions of Use About us My account My account Orders Addresses Recently viewed products Compare products list Shopping cart Wishlist Customer service Contact us Customer Care Follow us Payment options Powered by nopCommerce Copyright © 2025 R&R Games. All rights reserved."
    },
    {
      "url": "https://axescapetn.com/location/",
      "text": "Location – AxeScape AxeScape info@axescapetn.com 931-222-4205 Home About Us About Us Contact Us eGift Cards Gallery Booking Location FAQs Privacy Policy Terms of Use Escape Rooms Axe Throwing Hatchet Marathon Party & Corporate Events Waiver BOOK NOW Location About Us Escape Rooms Axe Throwing FAQ Contact Us Location Employee Page Jki-facebook-light Jki-instagram-1-light Copyright © 2025 AxeScape"
    },
    {
      "url": "https://splitoakaxescapegames.com/about",
      "text": "About Us | Discover Exhilarating Fun — SPLIT OAK AXESCAPE GAMES 0 Skip to Content About Us FAQs Parties Menu Drinks Food Gift Cards Jobs Leagues Membership book now Open Menu Close Menu book now About Us FAQs Parties Menu Drinks Food Gift Cards Jobs Leagues Membership Open Menu Close Menu About Us FAQs Parties Folder: Menu Back Drinks Food Gift Cards Jobs Leagues Membership book now ABOUT SPLIT OAK AXESCAPE GAMES Split Oak Axescape Games is the first axe throwing and escape room venue in St. Cloud, Florida. Our goal is to provide you with a new experience filled with action and excitement in a safe, friendly, and healthy environment. We serve small bites, an array of craft & domestic beer, wine, and hard seltzers. Split Oak Axescape Games is committed to providing the best axe throwing and escape room experience for all size groups. Whether you want to throw alone, with a friend, or with the whole family, we will ensure you have an axetraordinary time. We also have 2 one hour themed escape rooms to experience with your group if axe throwing isn’t your thing. We can accommodate group parties, private events as well as team-building and corporate events. Our team of Game Guides is here to keep our guests safe and create a fun and unforgettable experience. Our venue has a modern industrial vibe with relaxed seating and spans over 4,500 square feet of interior space that can be enjoyed with flat-screen TVs and lobby games. Split Oak Axescape Games were founded by Robert & Nichole, residents of Lake Nona, with the vision to provide a modern industrial community gathering place for all to enjoy. AXE THROWING TIPS & TECHNIQUES July 11, 2023 AXE THROWING STANCE The most important tip for axe throwing technique is your stance. There are two stances: two-handed and one-handed. Two-handed Stance: Align your feet with the bullseye and keep your body facing forward as you throw. ( Easiest for Beginners ) One-handed Stance: Align your shoulder with the bullseye and maintain a forward-facing stance, focusing on shoulder-to-target alignment. ( Advanced Approach ) AXE REMOVAL Taking an axe out of a target can be tricky. The best and safest way to do so is to grasp the handle and shift the axe blade up and down until it gradually falls loose from the target. Do not grab the axe and try to pull it straight out. This could result in it coming out quickly and potentially causing serious harm or injury. WATCH OUT FOR PEOPLE AND OBSTACLES Before you throw your axe at your intended wooden target, make sure there is no one and nothing in your way. You should be standing in front of the target, about 12 ft from it. Nobody, not even the most experienced axe thrower, should ever throw without double-checking their surroundings. Maintain a six-foot radius around where you are standing to assure you won’t harm anyone. HOW TO AIM YOUR AXE When aiming your axe, it is essential to maintain focus on the target. Keep your eyes locked onto the specific spot where you want the axe to land and throw with precision. Directing your gaze toward the desired destination increases your chances of hitting the mark accurately. By staying focused and aligning your vision with your intended target, you enhance your chances of achieving your desired outcome. DISTANCE ADJUSTMENTS Different outcomes can occur when throwing an axe at a target, and adjustments can be made to improve your throws: Top of Axe Hits Board: If the handle sticks out almost perpendicular to the board while the axe goes into the target, it indicates over-rotation. To compensate, take a half step closer to the target. Bottom of Axe Hits Board: When the bottom or handle of the axe hits the target, you are standing too close. It suggests under-rotation. To correct this, take a half step back from the target. Blade Hits Parallel to Board: This is the desired outcome. The axe handle will be nearly parallel to the target, and the front of the blade will be embedded in the target. It signifies the right distance from the target and excellent throwing form. ESCAPE ROOM TIPS & TRICKS DON’T JUST STAND THERE! Be active and engage with the environment. Explore and interact with objects to find clues. WORK FAST AND ASK FOR CLUES Don’t hesitate to ask for hints early and often. Waiting until the end might leave you short on time. WORK TOGETHER Work as a team but spread out to find clues throughout the room. COLLABORATE YOUR SKILL SETS Utilize the diverse skills within your team. Try different perspectives if stuck. THINK OUTSIDE THE BOX Get creative and think like a storyteller or director when stuck. Let the narrative guide your reasoning. SHARE WHAT YOU SEE AND FIND Communicate all findings and thoughts to the team. Sharing is the key to solving puzzles. POLICIES PLEASE READ AND UNDERSTAND THIS FULLY NO REFUNDS No refunds for late arrivals, no-shows, or cancellations. Strict adherence to the schedule is required. CHECK-IN Check-in is 15 minutes prior to booking time to allow time for briefs and rules video. CHANGES TO BOOKING Changes to bookings allowed up to 24 hours in advance . NO SHOWS No-shows are defined as failing to arrive within 15 minutes of the scheduled booking time. No-shows result in cancellation and fees are NOT refunded. LATE ARRIVALS Late arrivals lead to reduced throw/game time. Your time starts at the booked time, not when you arrive. The throw/game time is over when your allotted time runs out, regardless of the group’s tardy beginnings. Stay sharp and timely. sign waiver Axe Throwing Escape Rooms Arcade Games Beer, Wine, Seltzers & Bar Bites FIND US ON …. EMAIL SIGN UP Join our Mailing List to receive news & more. Email Address Sign Up Now! Thank you! Payment, Cancellation, and Rescheduling Policy Contact Us | Jobs | Privacy Policy"
    },
    {
      "url": "https://www.ticketor.com/ryagames/contactus?culture=en",
      "text": "CONTÁCTENOS | Rya Games | Rya Games Skip to main content High Contrast Accessibility Feedback Menu Navigation Empty Sign In / Sign Up User Menu Cookie Manager Is it Secure? Tickets My Tickets Print e-Tickets Return Tickets Exchange Tickets My Gift Cards My Seasons Passes Orders Order History My Account Balance Help FAQ Buy A Ticket Receive A Ticket Join our Newsletter Returns Policy Privacy & Cookie Policy Term of Use Term of Purchase ENG English Español ENTRADAS CONTÁCTENOS RESEÑAS BAR CONCESIÓN TARJETAS DE REGALO TIENDA DE REGALOS Rya Games ENTRADAS CONTÁCTENOS RESEÑAS BAR CONCESIÓN TARJETAS DE REGALO TIENDA DE REGALOS CONTÁCTENOS CONTÁCTENOS Contact Rya Games: We really care about our customers and we will reply to every message ASAP. If you have any questions or concerns about buying tickets or your purchased tickets, please fill the form and click 'Send Email' to send us an email. Frequently Asked Questions Search: Search • How do I know if my order went through? After placing a successful order, you should receive a confirmation number and/or confirmation email. You can also log in to your account and check \"User Menu > Order > Order History\" . • How can I print my tickets? When you complete the purchase, assuming that you have selected e-tickets as delivery method : You'll see the tickets on the confirmation page and can print them right away In your confirmation email, there is a link to the \"Print Tickets\" You can log in to your account and print tickets from \"User Menu > Tickets > Print Tickets\" . • I checked out as a guest and didn't create an account. Can I still login to manage, print or refund my tickets? Yes, click on the sign in button, enter the email you used for the purchase and you can claim your account by confirming your email address. • My credit card show a charge but I never received my tickets? Credit card dashboards often show Authorizations as charges and that confuses buyers. Authorization is not a charge and will go away automatically in a few days. A failed authorization means that the transaction was failed for some reason.  If you tried purchasing, but never received a confirmation number or confirmation email but you see a charge, that is most likely a failed authorization and not a charge. Before trying to purchase again, check \"User menu > Tickets > My Tickets\" to make sure your purchase did not go through. If your order has not gone through, you should try purchasing again. Your purchase is only successful when you see the confirmation page. • Why does my credit card show more than one charge for a single purchase? Am I double-charged? 1- Check \"User menu > Tickets > My Tickets\" to make sure your purchase went through only once. If you've made more than one purchase, you may want to return the duplicates. 2- If you've submitted your transaction with a wrong billing address, the AVS (address verification system, used by credit card processors to prevent fraud) will reject your payment but put a temporary hold on the amount, also known as \"authorization\". The authorization is not a charge and will drop off your statement in a few days. Check your statement again in a few days to confirm that the amount is gone. • Do I need to print my e-tickets, or can I just show on my phone? Most events accept mobile tickets, but some don't. Unless clearly instructed otherwise in the event information or the delivery method choices, you should try to print your tickets. • Can I change my ticket delivery method? Contact us right away, and we may be able to change your delivery method. • Can I change my seat or performance if I got the wrong tickets? If the exchange policy of the event allows exchanges or upgrades, you can use \"User Menu > Tickets > Exchange Tickets\" to exchange, upgrade or change the date of your tickets. If the return policy of the event allows returns, you can use \"User Menu > Tickets > Return Tickets\" to return your tickets for store credit and purchase a new set of tickets. Your store credit will be applied on the checkout page.your purchase went through only once. If you've made more than one purchase, you may want to return the duplicates. Otherwise, you can contact us. We may be able to exchange the tickets for you. • What if I didn't receive a confirmation email or invoice? First, check your spam folder. If the email isn't there, you've probably entered an invalid email address or are using a system that blocks our emails. To view, print, or receive the confirmation and email as an invoice, use the \"User menu > Orders > Order History\" and click on the icon for the invoice. • How do I sign in if I forgot my password? If you've entered the correct email address, you can simply reset your password. Click on the Sign In button, click Forgot Password, and wait a few minutes. You'll receive the password recovery code in your email, and you can then change your password. • I cannot sign in and I haven't gotten any emails (welcome email, order confirmation, password recovery) from you. What should I do? You've probably signed up with a wrong email address or made a typo in your email address. Try to sign up again with the correct email address. • I purchased Refund Protection. How can I file a claim? Refund protection is offered through XCover, an independent, 3rd party company. All claims and refunds should be processed directly and solely through XCover. We are not in any way involved or responsible in the refund protection process. Should you need to file a claim, create an account on https://www.xcover.com/en/login with the same email address that you used to purchase the tickets and file your claim online. If you have any questions or concerns, contact XCover.com  directly as XCover, and not the website you purchased tickets from, is solely in charge of the claims and refund protection. All the information that you need to file a claim with XCover is included in your sales confirmation email and you can access them again from the 'Order History' menu. Contact: Rya Games Your Name: * Email Address: * Email address is not valid Phone Number: * Phone number is not valid. Subject: * Message: Send Email Ticketing and box-office solution powered by: Ticketor (Ticketor.com) Ticketor reviews and ratings powered by TrustedViews.org Powered by Ticket or Ticketing and box-office system by Ticketor Efficient Night Club & Bar Ticketing Software – Easy Setup Build your own online box-office. Sell tickets on your own website. © All Rights Reserved. 67.225.221.40 Terms of Use Your computer time or time zone is not set properly. Set the time before you can login! We just sent an email to: . Check your email and the spam folder to get the code we sent you, then enter it here and choose a new password. We just sent an email with the verification code to your email: . Check your email and the spam folder to get the code we sent you, then enter it here to confirm your login. We just sent an email with the verification code to the administrator(s) email. Please contact any of the site administrators for assistant with your login. Sign in or sign up, so you can manage and print your tickets at any time. Login with Google Signup with Google New user? Sign up Have an account? Sign in Email: Go You will receive order confirmation, order status, tickets & announcements at this email. Enter the code from your email: First Name: Last Name: Cell Phone: We may need to text or call you in regards to the event or your account. Newsletter Preference: Keep me updated about new events & promotions by email and text (Join mailing list) Keep me updated about new events & promotions by email (Join mailing list) I don't want to join the mailing list We never spam you and you can always unsubscribe easily by clicking on the link at the footer of any email. By choosing this option, you agree to receive automated promotional text messages, and this agreement isn’t a condition of any purchase. You may receive about 4 text messages per month and you can stop at any time. Message and data rates may apply. I am over 18 years old and have read, fully understood and agreed to the terms of use and the privacy and cookie policy . Cookie Manager Enter password to log in or checkout as guest Choose a password or checkout as guest Password: Enter a new password: Minimum 5 characters. Choose a strong password to protect your account. Forgot password? Log In Agree & Continue Set a password so you can access the account. Set a Password OR No account needed. You can claim your account later by confirming your email. No login needed. You can checkout as a guest. Checkout as Guest Send the Email again Reset Password & Sign in Email the code again Log In Remember me on this computer This is a personal device. Don't challenge me on this device again."
    },
    {
      "url": "https://splitoakaxescapegames.com/axe-throwing",
      "text": "Axe Throwing | Unleash the Fun — SPLIT OAK AXESCAPE GAMES 0 Skip to Content About Us FAQs Parties Menu Drinks Food Gift Cards Jobs Leagues Membership book now Open Menu Close Menu book now About Us FAQs Parties Menu Drinks Food Gift Cards Jobs Leagues Membership Open Menu Close Menu About Us FAQs Parties Folder: Menu Back Drinks Food Gift Cards Jobs Leagues Membership book now ABOUT OUR AXE THROWING VENUE 1 HOUR $28 per person +tax Booking is Recommended Walk-ins are subject to availability 2 HOURS $46 per person +tax Booking is Recommended Walk-ins are subject to availability Welcome to an axe throwing experience unlike any other – where precision meets Axe-citement in an unforgettable setting! Our venue is thrilled to offer you the choice of 1-hour and 2-hour axe throwing sessions that promise to ignite your competitive spirit. With an impressive lineup of 8 meticulously designed axe lanes, you and your companions are in for a treat as you take on the challenge of hitting those bullseyes. What sets us apart is our dedication to enhancing your satisfaction. Our axe lanes feature auto-detect scoring, and projection targets, transforming the art of aiming into an engaging array of 18 various games. These dynamic targets are projected onto end grain wood, creating a perfect surface for your axe to stick with ease, ensuring that every throw delivers that satisfying thud you're craving. Safety is our top priority, which is why our venue provides 8 lanes with a patent-pending no-bounce-back border to create a secure environment, eliminating the risk of axes rebounding unexpectedly. You can focus on your throws with confidence. So, gather your friends, family, or colleagues and step into a world where axe throwing mastery is within your grasp. Our friendly staff is always on hand to offer guidance, tips, and a warm welcome. Whether you're a seasoned axe enthusiast or just trying it out for the first time, our venue guarantees an unforgettable experience. Book Now!! sign waiver Axe Throwing Escape Rooms Arcade Games Beer, Wine, Seltzers & Bar Bites FIND US ON …. EMAIL SIGN UP Join our Mailing List to receive news & more. Email Address Sign Up Now! Thank you! Payment, Cancellation, and Rescheduling Policy Contact Us | Jobs | Privacy Policy"
    },
    {
      "url": "https://splitoakaxescapegames.com/faqs",
      "text": "FAQs 2 — SPLIT OAK AXESCAPE GAMES 0 Skip to Content About Us FAQs Parties Menu Drinks Food Gift Cards Jobs Leagues Membership book now Open Menu Close Menu book now About Us FAQs Parties Menu Drinks Food Gift Cards Jobs Leagues Membership Open Menu Close Menu About Us FAQs Parties Folder: Menu Back Drinks Food Gift Cards Jobs Leagues Membership book now FAQs Can We Play Without a Reservation? Yes, we take walk-ins and will do our best to accommodate you and your party. However, advance bookings are done online and are highly recommended to secure a specific game and time-slot. Book Now We have various snacks, non-alcohol & alcohol beverages, lobby games and large-screen TVs while you wait for a time-slot to come available. Is There an Age Limit? Anyone 8 and up are allowed to participate. Participants under 18 must be accompanied by an adult to throw axes. Players under 14 must be accompanied by an adult to play our escape games, there MUST also be 1 adult for every 4 children. Anyone under 18 MUST have a parent or guardian sign waiver. Who Can Participate? Escape games and Axe throwing  are suitable for various social occasions and team building. Our facility and games are wheelchair  accessible. Any other mobility impairment we advise to call for game suitability. Are Waivers Required? Yes, waivers are required for all participants and spectators and will need to be done online. Please have waiver signed in advance to save time during the check-in process. Please sign your waiver here . What Should I Bring or Wear? All axe throwers MUST wear closed toe shoes to throw axes!! We recommend wearing something comfortable and loose enough to allow for full range of movement, and to avoid wearing high heels. Bring Government Issued Photo ID. Can I Reschedule my Booking? We require a minimum 24 hour notice to reschedule your booking to a later date or time. Please review our Cancellation & Rescheduling  Policies What is our Cancellation Policy? We do not allow refunds. You are always welcome to reschedule your booking for a later date. Please review our Cancellation & Rescheduling Polices What if I am Running Late for my Reservation? Your reservation time is your start time . Due to other groups having scheduled reservations throughout the day, we cannot allow late arrivals. It just wouldn’t be fair to make the group after yours have to wait. We ask that you show up 15 -minutes early to check-in and be briefed on rules and go to the restroom, etc. Please allow time for traffic and the unforeseen, as your game will start on time, with or without you!  Split Oak Axescape Games does not offer refunds, but we will allow you to reschedule.  We do try to accommodate same day rescheduling for late arrivals as much as possible, but due to other reservations, you may not be able to be rescheduled the same day. Please review our Cancellation & Rescheduling Policies Do We Serve Food and Alcohol? Yes, we have Craft & Domestic Beer, Seltzers, Wine, Small Bites, and non-alcoholic beverages for purchase. Outside food and drinks are not allowed inside our venue. Do We Sell Merchandise and Gift Cards? Absolutely, we have merchandise and you can purchase gift cards here . Is Tipping Your Game Guide Required? We do not require tipping, but it is very much appreciated by our game guides 🪓🔓😊 What Is Axe Throwing? Experience a unique and innovative axe throwing system that projects targets onto end grain wood, resembling bowling with scores displayed overhead with digital scoring. Unlike traditional axe throwing, this setup offers various interactive games like a moving bullseye, connect four and tic-tac-toe, elevating the fun and challenge. With multiple lanes in a warm and welcoming indoor environment, you and your friends can enjoy a one-of-a-kind experience while improving your axe throwing skills. This exclusive facility stands out as the only one of its kind in the area, promising a thrilling and unforgettable time with your group. Is Axe Throwing Safe? Split Oak Axescape offers thrilling and safe axe throwing for families and groups. Our targets are designed to stick easily, reducing the need for excessive force, and our anti-bounce system enhances safety. Enjoy a unique and enjoyable experience, create lasting memories, and engage in friendly competitions while having a great time together! Our game guides provide safety training before and during all axe throwing sessions. How Many Throwers Per Lane? You can have up to five throwers per lane. How Many Lanes Do We Have? We have eight lanes that are  projected targets with various games. Since each group booked is private, we allow up to five people per target. Do I Need Special Footwear for Axe Throwing? Closed toed shoes are required for the axe throwing experience. No Heels, Flip Flops or Sandals Do I Need to Bring my Own Axe? No, we provide the axe and they weigh less than 3lbs. Outside axes are not allowed at this time. Will Someone Show me How to Throw an Axe? Absolutely, a game guide will be available for instruction and advice. Are Leagues Available? In the near future we will be hosting recreational leagues. Make sure you sign up for our Mailing List to stay updated! What is an Escape Room? Escape games are an interactive thrilling unique experience, can you beat the clock? Each of our two themed escape rooms are a real-life adventure game in which players are figuratively locked in a room and have to use its objects and elements to solve a series of puzzles, discover hidden clues, and make logical connections in order to find the way out (hence, escape) within the allotted game time. Can I Bring my Cellphone in the Escape Game? Yes! We would love for you to share your photos and experience. Be sure to tag us on our IG & FB. 🤳 We just ask you to refrain from taking pictures of puzzles and clues to not ruin the experience for others. 🧐 Is the Door Really Locked? Players are metaphorically “locked” in a room, but the entry door remains unlocked for safety. Are the Escape Games Private? Yes, all escape games are played privately. Will We be Given Hints During the Game? Hints available at your discretion and with no time penalties. sign waiver Axe Throwing Escape Rooms Arcade Games Beer, Wine, Seltzers & Bar Bites FIND US ON …. EMAIL SIGN UP Join our Mailing List to receive news & more. Email Address Sign Up Now! Thank you! Payment, Cancellation, and Rescheduling Policy Contact Us | Jobs | Privacy Policy"
    },
    {
      "url": "https://investments.supercell.com/contact/",
      "text": "Contact Supercell Investments | Get in touch with our team Home Investments For Founders News Team Contact Building something legendary? Get in touch If youâre building a category-defining game phenomenonâone thatâs remembered foreverâreach out through our contact form and letâs talk. Just to be clear, we donât publish games made by other studios. Weâll get back to you as soon as we can. Company Information Company Name Company One-liner Short Description 0 / 200 Section 1 / 8 Next Press kit Find a collection of brand assets we've put together, including company background information, logos, and imagesâall available for download. Download Media and press inquiries only media@supercell.com Address Supercell Oy,\nJÃ¤tkÃ¤saarenlaituri 1, \n00180 Helsinki, Finland Why we invest Our vision is simple: build the very best teams in the world at making games, give them the resources and support they need, and then get out of their way. Contact us If youâre ready to start writing your own playbook with us, get in touch through our contact form. Home Investments For Founders News Team Contact supercell.com LinkedIn Investee job board Privacy policy Supercell Oy \nJÃ¤tkÃ¤saarenlaituri 1 \n00180 Helsinki \nFinland"
    },
    {
      "url": "https://splitoakaxescapegames.com",
      "text": "SPLIT OAK AXESCAPE GAMES | Join the Axe-citement 0 Skip to Content About Us FAQs Parties Menu Drinks Food Gift Cards Jobs Leagues Membership book now Open Menu Close Menu book now About Us FAQs Parties Menu Drinks Food Gift Cards Jobs Leagues Membership Open Menu Close Menu About Us FAQs Parties Folder: Menu Back Drinks Food Gift Cards Jobs Leagues Membership book now Axescape to Axe-citing Adventures: Experience Something New in St. Cloud, FL! Axe Throwing & Escape Rooms Looking for a thrilling and unique experience for your next date night or gathering with friends and family? Look no further than Split Oak Axescape Games in St. Cloud, FL. Whether you're eager to test your axe-throwing skills or enjoy the thrill of cracking codes and solving puzzles, we have it all. Challenge your friends to a competitive game of axe throwing, or team up to decipher intricate clues within our captivating escape rooms. And if you're in the mood for some relaxation, unwind and socialize with our wide range of beverages, perfect for relaxation and enjoyment. So, come on down to Split Oak Axescape Games and let the axes fly and the fun begin! ESCAPE ROOMS *ALL ESCAPE GAMES ARE PLAYED PRIVATELY *BOOKING ONLINE RECOMMENDED Sir Ripple Sugarton’s Candy Factory You and your team have been personally chosen by Sir Ripple Sugarton himself along with 4 other teams to compete in his new whacky competition , Sugarton’s Ultimate Candy Factory Challenge! … CANDY FACTORY    /    2-8 PPL Learn more Book Now Shipwreck Island Your day trip around this beautiful tropical paradise has just been interrupted by an incoming storm. Your tour boat was tossed side to side and broken into hundreds of pieces. … DESERTED SHACK   /   2-8 PPL Learn more Book Now AXE THROWING Book  Now *ALL AXE LANES ARE PLAYED PRIVATELY *BOOKING ONLINE RECOMMENDED Projection End Grain Targets Step into the most exciting axe throwing experience in St. Cloud, FL at Split Oak Axescape Games! Unlike anywhere else, we boast the only projection targets in the entire city, adding a thrilling twist to the traditional axe throwing fun. Get ready for an Axe-citing time as you aim at moving targets, engage in a variety of games, and throw on our high-quality end-grain wood. It's the ultimate blend of action, skill, and entertainment, making every moment unforgettable. Don't miss out on this unique adventure - come join the Axe-citement at Split Oak Axescape Games today! Want to know more about our projection axe targets and games? HOURS ***HOURS SUBJECT TO CHANGE*** Monday - Tuesday  CLOSED Wednesday - Thursday 5 PM - 10 PM Friday  5 PM - 11 PM Saturday  12 PM - 11 PM Sunday 12 PM - 8 PM COME VISIT US!! 1340 S. Narcoossee Rd Suites 103-105 Saint Cloud, FL 34771 📞 4073070005 Still unsure about visiting us? Check Out What Our Customers Have To Say! 👉 sign waiver Axe Throwing Escape Rooms Arcade Games Beer, Wine, Seltzers & Bar Bites FIND US ON …. EMAIL SIGN UP Join our Mailing List to receive news & more. Email Address Sign Up Now! Thank you! Payment, Cancellation, and Rescheduling Policy Contact Us | Jobs | Privacy Policy"
    }
  ]
}