{
  "fuentes": [
    {
      "url": "https://www.st-raphaels.org/contact-details/",
      "email": "admin@st-raphaels.ealing.sch.uk"
    },
    {
      "url": "https://www.st-raphaels.org/contact-details/",
      "email": "safeguarding@st-raphaels.ealing.sch.uk"
    },
    {
      "url": "https://www.st-raphaels.tameside.sch.uk/school-information/staff-list/",
      "email": "admin@st-raphaels.tameside.sch.uk"
    },
    {
      "url": "https://www.saintrays.org/",
      "email": "asset-2@3x-1200x2.png"
    },
    {
      "url": "https://www.saintrays.org/",
      "email": "asset-2@3x-200x1.png"
    },
    {
      "url": "https://www.saintrays.org/",
      "email": "asset-2@3x-400x1.png"
    },
    {
      "url": "https://www.saintrays.org/",
      "email": "asset-2@3x-600x1.png"
    },
    {
      "url": "https://www.saintrays.org/",
      "email": "asset-2@3x-800x1.png"
    },
    {
      "url": "https://www.saintrays.org/",
      "email": "asset-2@3x.png"
    },
    {
      "url": "https://www.nxne.com/delegates",
      "email": "info@nxne.com"
    }
  ],
  "mails": [
    "admin@st-raphaels.ealing.sch.uk",
    "admin@st-raphaels.tameside.sch.uk",
    "asset-2@3x-1200x2.png",
    "asset-2@3x-200x1.png",
    "asset-2@3x-400x1.png",
    "asset-2@3x-600x1.png",
    "asset-2@3x-800x1.png",
    "asset-2@3x.png",
    "info@nxne.com",
    "safeguarding@st-raphaels.ealing.sch.uk"
  ],
  "nombre_sitio": "st-raphaels.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.st-raphaels.org/contact-details/",
      "text": "Contact Details | Saint Raphael's Catholic Primary School Search D <script src=\"https://cse.google.com/cse.js?cx=018064204022535857943:oedpx1-qgwk\"></script>\n      <gcse:searchbox-only></gcse:searchbox-only> Translate F <script>\n        function googleTranslateElementInit() {\n          new google.translate.TranslateElement({\n            layout: google.translate.TranslateElement.InlineLayout.SIMPLE,\n            pageLanguage: 'en'\n          }, 'google_translate_element');\n        }\n      </script>\n\n      <script src=\"https://translate.google.com/translate_a/element.js?cb=googleTranslateElementInit\"></script>\n      <script src=\"https://primarysite-prod-sorted.s3.amazonaws.com/static/7.0.4/gen/google_translate.3323e9a6.js\"></script> Twitter H Twitter Facebook C Facebook Website Menu Back Home Catholic Life St. Raphael's Catholic Primary School Mission Statement Religious Education RE Parent Newsletters Reconciliation Lent and Easter Eucharist Local Church Advent to Christmas Baptism and Confirmation Catholic Life and Mission Catholic Life and Mission Policy Catholic Social Teaching Care of Creation Preferential Option for the Poor Solidarity and Peace Community and Participation Dignity of Workers Dignity Prayer Spaces Spiritual, Moral, Social and Cultural Development (SMSC) RE Catholic Ambassadors RE Newsletters Prayer and Liturgy October: The month of the Holy Rosary The Jubilee Year 2025: Pilgrims of Hope Our House Saints Prayer and Worship Guide Prayer and Liturgy Policy Prayer and Liturgy Directory The Year of Prayer 2024 Prayer and Liturgy Newsletters Praying the Mass Resources for Prayer and Liturgy Prayer Prayer and Reflection Afternoon Saints Board Pilgrims of Hope RE Pupil Chaplains Parish Links Crowning of Mary May 2023 The Sacrament of Reconciliation Advent and Lent 2023-2024 Stations of the Cross 2024 Racial Justice Equality and Diversity (RJED) RE Parent Survey Results Relationships Education About Us Welcome Contact Details Visions and Values Who's who Meet the Governors Minutes of Governor Meetings Governor Area Staff Area Opportunities to work with us Continuous School Improvement Financial Benchmarking Key Information Admissions SEND Mental Health and Wellbeing Offer Safeguarding Policies Catch-up Premium Congratulations from the Minister of State Ofsted Reports Performance Curriculum Financial Information E-Safety How to Guides Information Leaflets GDPR PE & Sport Premium Pupil Premium SOLO Taxonomy Music Development Plan News & Events Consultation for Catholic Academy Trust Newsletters School Council Minutes Eco-Council Parents Leaving School Form Year Groups Year 1 Year 2 Year 3 Year 4 Year 5 Year 6 Year 6 SATs School Opening Hours Gallery Term Dates Term Dates 2025-2026 Video Resource Centre School Uniform School Blog Site Attendance and Punctuality Leave of absence and medical forms Useful Links Wraparound Care School Clubs ISS Catering PSA Reading at St. Raphael's School App Thinking Schools Useful Links Year 6 Secondary Transfer Early Years Unforgettable Learning Adventures Culture Day Shrove Tuesday Come and Read EYFS Curriculum Reception Nursery EYFS Catholic Life Nursery children making the sign of the cross Month of the Rosary Crowning Mary Children in Reception praying Hail Mary May - the month of Mary Pentecost celebration Early Reading Early Maths EYFS Continuous Provision Reception Indoor Provision Outdoor Provision Our Learning Transition Nursery New Starters Reception New Starters Curriculum Curriculum Statements St Raphael's Curriculum Statement Curriculum Descriptors Autumn term 2025 Curriculum Subjects Religious Education Autumn Spring Summer Other Faiths Art Computing Design and Technology French English Writing Reading Geography History Maths Music Oracy Physical Education Science Metacognition EYFS Download Our App Log in Saint Raphael's Catholic Primary School As we walk with Jesus, we love, live and learn Get In Touch Get in touch Contact Details L Phone Us J Email Us K Get Directions Social Media H Follow Us C Like Us Admissions Admissions Prospectus Prospectus Vacancies Vacancies Contact Details Home About Us Contact Details St Raphael's Catholic Primary School Hartfield Avenue Northolt UB5 6NL Telephone: 020 8841 0848 Email: admin@st-raphaels.ealing.sch.uk Headteacher: Mrs Tracey Brosnan Chair of Governing Body: Mrs Barbara Amponsah-Abedi All general queries should be directed to our office staff: Ms McDermott, Mrs White or Mrs Biondi. Copies of any documents on our website are available free of charge, please request this at the school office. Please note that we have a car exemption zone between: 8.15 am – 9.15am and 2.30pm to 3.45pm Safeguarding at St. Raphael's Designated Safeguarding Lead: Mrs Tracey Brosnan: Designated Safeguarding Link Governor: Mr Pat Cornell Please address any safeguarding queries to the DSL at: safeguarding@st-raphaels.ealing.sch.uk Designated Safeguarding Leads Designated Safeguarding Staff Contact Form Extra info Name Email Message Captcha Send Sitemap Cookie Information Website Policy Log in All website content copyright © Saint Raphael's Catholic Primary School Website design by A PrimarySite  Top Cookies Unfortunately not the ones with chocolate chips. Our cookies ensure you get the best experience on our website. Please make your choice! Reject all Accept all Customise cookie settings Cookies Some cookies are necessary in order to make this website function correctly. These are set\n          by default and whilst you can block or delete them by changing your browser settings, some\n          functionality such as being able to log in to the website will not work if you do this.\n          The necessary cookies set on this website are as follows: Website CMS A 'sessionid' token is required for logging in to the website and a 'crfstoken' token is\n          used to prevent cross site request forgery. An 'alertDismissed' token is used to prevent certain alerts from re-appearing if they have\n          been dismissed. An 'awsUploads' object is used to facilitate file uploads. Matomo We use Matomo cookies to improve the website performance by capturing information such as browser and device\n          types. The data from this cookie is anonymised. reCaptcha Cookies are used to help distinguish between humans and bots on contact forms on this\n          website. Cookie notice A cookie is used to store your cookie preferences for this website. Cookies that are not necessary to make the website work, but which enable additional\n        functionality, can also be set. By default these cookies are disabled, but you can choose to\n        enable them below: Reject all Accept all Save"
    },
    {
      "url": "https://www.st-raphaels.tameside.sch.uk/school-information/staff-list/",
      "text": "Staff List - St Raphael's Catholic Primary School Skip to content Catholic Life St Peter’s & St Raphael’s Parish Mission, Aims & Partnerships Religious Education Wednesday Word Sacramental Programme School to home links Mini Vinnies Events gallery Statutory Information Prospectus Nursery and School Admissions School Performance – Results Ofsted, RE Inspection and Parent View St Raphael’s Governing Board School Policies & Guidance Safeguarding & Online Safety SEND Report and Offers Pupil Premium DFE Sports Funding Data Protection – GDPR School Information Staff List Term & Holiday Dates News Vacancies Contact Us Directions Curriculum & Support Class Information Curriculum Reading Phonics Maths Home Learning & Support Parent Information Frequently Asked Questions Before & After School Provision – Magic Booking School Meals Free School Meals – How to Apply School Money Online Payments The School Day School Uniform School Clubs Attendance Young Carers Newsletters Current Newsletter & Letters Newsletter Archive St. Raphael’s Catholic Primary School admin@st-raphaels.tameside.sch.uk 0161 338 4095 Catholic Life St Peter’s & St Raphael’s Parish Mission, Aims & Partnerships Religious Education Wednesday Word Sacramental Programme School to home links Mini Vinnies Events gallery Statutory Information Prospectus Nursery and School Admissions School Performance – Results Ofsted, RE Inspection and Parent View St Raphael’s Governing Board School Policies & Guidance Safeguarding & Online Safety SEND Report and Offers Pupil Premium DFE Sports Funding Data Protection – GDPR School Information Staff List Term & Holiday Dates News Vacancies Contact Us Directions Curriculum & Support Class Information Curriculum Reading Phonics Maths Home Learning & Support Parent Information Frequently Asked Questions Before & After School Provision – Magic Booking School Meals Free School Meals – How to Apply School Money Online Payments The School Day School Uniform School Clubs Attendance Young Carers Newsletters Current Newsletter & Letters Newsletter Archive Staff List HOME > School Information > Staff List Senior Leadership Team Mrs L. Lakner  Headteacher / Lead Safeguarding Officer Mr D. Matthews  Deputy Headteacher / Year 6 Teacher / Safeguarding Officer Mrs S. Murphy  Year 2 Teacher / SENDCO Mrs J. Lee  Year 4 Teacher / SENDCO Mrs C. Fletcher  School Business Manager Foundation Stage Mrs S. McLeod  Nursery Teacher / PSHE & RSE Lead Mrs C. Shields  Reception Teacher / EYFS Lead Mrs K. Neale  Nursery/Reception Teacher Mrs C. Melville-Terry  Teaching Assistant Reception Mrs Z. Wells  Teaching Assistant Nursery Key Stage 1 Miss C. Taylor   Teacher Mrs S. Murphy  Year 2 Teacher (SENDCO) Mrs J Stevenson  Teaching Assistant Year 1 Miss G. Unsworth Teaching Assistant Year 2 Key Stage 2 Miss L. Wilson  Year 3 Teacher Mrs J. Lee Year  4 Teacher (SENDCO) Miss G. Pollitt  Year 5 Teacher Mr D. Matthews  Year 6 Teacher / Deputy Headteacher Mrs K. Stoddard  Teaching Assistant  Year 3 / Year 5 Mrs M. Rankin  Teaching Assistant  Year 4 Miss L. Gavin  Teaching Assistant Year 6 Support Staff Miss G. Southworth  School Support Assistant / Inclusion Manager / Safeguarding Officer Mrs N. Reed  Teaching Assistant SEN / Nurture Mrs C. Fletcher  School Business Manager Mrs K. Kempster  Administration Assistant Mrs H. Potts  Administration Assistant Mr D. Higham  Site Manager Miss G. Schofield  Cleaner Mrs T. Norton  Welfare Assistant / Cleaner Mrs S. Thorp  Cook Miss S. Eckersall  Assistant Cook Miss L Done   Kitchen Assistant School Pastoral Care Father Philip Atkinson  Parish Priest Deacon Antony Zidan In addition to the above, school utilises specialist teachers for certain areas of the Curriculum. School Information Staff List Term & Holiday Dates News Vacancies Contact Us Directions St. Raphael’s Catholic Primary School Headteacher: Mrs L. Lakner School Office: Safeguarding Officers: Mrs L. Lakner, Miss G. Southworth, Mr D. Matthews SENCO: Mrs Murphy and Mrs Lee Huddersfield Road, Millbrook, Stalybridge, Cheshire SK15 3JL Directions St Raphael’s Catholic Primary School is in Millbrook, a short distance from Stalybridge Town Centre. Parking is available to all visitors at the adjacent St Raphael’s Church. 0161 338 4095 | admin@st-raphaels.tameside.sch.uk © Copyright 2025 St Raphael's Catholic Primary School. All Rights Reserved. Privacy Policy | Disclaimer Our Location"
    },
    {
      "url": "https://www.saintrays.org/",
      "text": "Saint Raphael Academy Skip to content Inquire Plusportals Give Inquire Plusportals Give Search for: About Welcome to Saint Rays Contact & Visit Us News Admissions Why SRA? Tuition & Financial Aid Visit Us Open Houses Shadow Day Visits How to Apply Transportation International Admissions Admissions FAQs Academics Student Life Activities, Clubs & Organizations Arts Program Campus Ministry School Store Athletics Alumni Apply Search for: About Welcome to Saint Rays Contact & Visit Us News Admissions Why SRA? Tuition & Financial Aid Visit Us Open Houses Shadow Day Visits How to Apply Transportation International Admissions Admissions FAQs Academics Student Life Activities, Clubs & Organizations Arts Program Campus Ministry School Store Athletics Alumni Apply About Welcome to Saint Rays Contact & Visit Us News Admissions Why SRA? Tuition & Financial Aid Visit Us Open Houses Shadow Day Visits How to Apply Transportation International Admissions Admissions FAQs Academics Student Life Activities, Clubs & Organizations Arts Program Campus Ministry School Store Athletics Alumni Apply Search for: Faith Service Community Family Success Legacy Home Imagine yourself at Saint Raphael Academy. WHERE STUDENTS ARE WELCOMED, INSPIRED & CHALLENGED Built on 100 years of tradition, Saint Raphael Academy is a vibrant, Catholic high school with an extraordinary spirit and a record of achievement in the classroom and beyond. Respected for its challenging academic curriculum, competitive athletics, distinguished arts programs, and wide range of extracurricular activities, Saint Raphael Academy is one of the finest college preparatory high schools in the region. Learn more about the application process, important deadlines, affording SRA, and what it means to be a Saint. Inquire Inquire Today Discover Saints through a variety of in-person and virtual events, including shadow visits. Visit Visit Today Our new students are inspired & challenged to build the foundation that is needed for future success. We are an amazing community of students, teachers, administrators, alumni & parents and we look forward to welcoming you to our family! Apply Apply Today Inquire We can’t wait to meet you! Join our mailing list to learn more about the application process, important deadlines, affording SRA, and what it means to be a Saint. You’ll also receive important admissions updates. Inquire Today Visit Discover Saints through a variety of  events, including shadow visits. Visit Today Apply Our new students are inspired & challenged to build the foundation that is needed for future success. We are an amazing community of students, teachers, administrators, alumni & parents and we look forward to welcoming you to our family! Apply Today Saint Raphael Academy’s Fast Facts 1924 Year Founded By The Brothers Of The Christian Schools 430 Students In Attendance #1 Most Diverse Catholic High School In RI 13:1 Student Faculty Ratio 7,000+ volunteer hours performed annually 8 Buildings part of our collegiate-style campus 100% Acceptance rate to institutions of higher education & Military 18 Average Class Size 1924 YEAR FOUNDED BY THE BROTHERS OF THE CHRISTIAN SCHOOL 450 Students in attendance #1 MOST DIVERSE CATHOLIC HIGH SCHOOL IN RI 13:1 STUDENT FACULTY RATIO 3/4 STUDENTS RECEIVE FINANCIAL AID 8 BUILDINGS PART OF OUR COLLEGIATE-STYLE CAMPUS 99% ACCEPTANCE RATE TO INSTITUTIONS OF HIGHER EDUCATION & MILITARY 18 AVERAGE CLASS SIZE SRA’s wide range of opportunities provide students with lifelong lessons in the value of competition, perseverance, hard work and the true meaning of teamwork. Campus Learn about our 8-building, college-style campus that you’ll soon start calling ‘home’. Learn More Academics Faculty assist students in reaching their fullest academic potential, while infusing the tenets of a Lasallian education. Learn More Athletics Our student-athletes learn the fundamentals of their sport and the value of teamwork and sportsmanship. Learn More Arts Our fine arts program has a long-standing tradition of including creative expression in the curriculum and extracurricular activities. Learn More Activities & Clubs We offer a wide variety of co-curricular activities that enhance the curriculum and provide our students with opportunities to explore areas of interest. Learn More Campus Ministry The Academy invites and challenges students to make his or her faith a living reality preparing them for leadership and service in the Church and the world. Learn More New To SRA? Admissions Thank you for your interest in Saint Raphael Academy. We encourage families to complete the inquiry form to be added to our mailing list. The journey begins here, and we can’t wait to welcome you! Learn More Latest News & Announcements View All Articles SRA Anniversary Gala Entertains and Inspires School colors never go out of style, which was especially true at the Saint Raphael Academy 100th anniversary gala. The ballroom at the Rhodes on the Pawtuxet was backlit in purple, and the floral [...] Saint Raphael Academy Announces Fourth Quarter Honor Roll 2024-2025 Kindness and Love Characterize Class of 2025 Costello and Ramos are Tops at SRA Year-Long Centennial Celebration to Conclude with Gala Be Part of Something Bigger Giving Opportunities Our vibrant school community is supported by teachers, parents, alumni, and the Diocese of Providence. Learn more about being part of something bigger than yourself. Learn More Take the next step towards your child’s future Apply Today SRA is a Catholic, Lasallian, Diocesan high school serving grades 9 – 12. 123 Walcott Street Pawtucket, RI 02860 PHONE: 401-723-8100 FAX: 401-723-8740 Inquire About Welcome to Saint Rays Contact & Visit Us News Admissions Why SRA? Tuition & Financial Aid Visit Us Open Houses Shadow Day Visits How to Apply Transportation International Admissions Admissions FAQs Academics Student Life Activities, Clubs & Organizations Arts Program Campus Ministry School Store Athletics Alumni Apply Give to SRA Statewide Bullying Policy Privacy Policy SRA Brand Guidelines Sitemap ©2025 SAINT RAPHAEL ACADEMY. ALL RIGHTS RESERVED. Website Designed by Ally Marketing Page load link \" * \" indicates required fields I am contacting you about... * Quick Question Admissions Academic Alumni Athletics Name * First Last Parent's Name * First Last Graduation Year * Maiden Name (if applicable) Parent's Email * Parent's Mobile Phone * Mobile Phone * Email * Subscribe me to your SMS/email list for updates and news. * Yes No Sport(s) of interest * Football Cheerleading Cross Country Boys Soccer Girls Soccer Girls Tennis Girls Volleyball Boys Basketball Girls Basketball Competition Cheerleading Ice Hockey Indoor Track Swimming Baseball Softball Outdoor Track Boys Volleyball Boys Tennis Co-ed Golf Student's Name First Last Current School * Current Grade * 11th Grade 10th Grade 9th Grade 8th Grade 7th Grade Comments * CAPTCHA The Saint Raphael Academy Class of 2018 & 2022 Hall of Fame Members Class of 2018: Thomas E. Burgess ‘29 (Posthumous) David A. Duffy ‘57 William F. Farley ‘60 Br. Lawrence D. Goyette, F.S.C. ‘67 James M. Leahy ’44 (Posthumous) James A. MacDougald ’46 (Posthumous) Joseph J. MarcAurele ‘69 Joseph T. McHale ’62 (Posthumous) John J. Partridge ‘57 Class of 2022: Dr. Paul J. Healey ’49 (Posthumous) Dennis M. Lynch, Jr. ’74 (Posthumous) Robert A. Magill ’29 (Posthumous) James J. Noonan ‘54 Martin J. Payton, Jr. ‘54 Br. Edmond P. Precourt, F.S.C. ‘63 Dr. Dennis M. Tracey ‘63 Congressman Robert A. Weygand ‘66 2022 Golf Tournament Alumni , Golf Join Us for Our Open House on 10/5/2025 At Open House, you’ll tour campus with a Saints Ambassador and hear about their experience as a current student here. Register Transcript Request Transcript Release Form Prefer to print and mail a form? No problem, click here. \" * \" indicates required fields Name * First Last Maiden Name Phone * Year of Graduation * Email * How would you like your transcript sent? * Mail Email Address * Street Address Address Line 2 City Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah U.S. Virgin Islands Vermont Virginia Washington West Virginia Wisconsin Wyoming Armed Forces Americas Armed Forces Europe Armed Forces Pacific State ZIP Code Number of Transcripts Requested Quantity * Price: $4.00 Quantity If they will be sent to multiple institutions, one form must be completed for each institution. Consent * Authorization I authorize Saint Raphael Academy to send my official transcript (SEAL) to the institution/place of employment listed. Institution Name * To the Attention of Institution Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Fax Number Institution Email Please upload a picture or scan of your license. * Max. file size: 6 MB. To prevent identity theft, we need to verify your identify. Comments Signature * Total Credit Card * Cardholder Name Card Details CAPTCHA Facebook This field is for validation purposes and should be left unchanged. We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT Go to Top"
    },
    {
      "url": "https://www.nxne.com/delegates",
      "text": "2025 DELEGATES — NXNE Music Festival Skip to Content Open Menu Close Menu ABOUT General FAQ History Commitment to EDI Meet The Team! Meet Our Advisory Board! 2024 HIGHLIGHTS PARTNER WITH US ARTISTS ARTIST FAQ NXNE 2026 Artist Application 2025 RECAP ARTISTS 2025 HIGHLIGHTS NEXT LEVEL PANELS SPOTLIGHT CITY MISSISSAUGA 2025 DELEGATES 2025 PARTNERS Venues Baby G Bovine Sex Club Burdock Cafe Pamenar Cameron House Collective Arts Dance Cave Death & Taxes Drake Hotel Drake Underground Duffy's Tavern Future (Infinity Room) Garrison Handlebar Horseshoe Tavern Illuminarium Jean Darlene Piano Room Lee's Palace The Mod Club Paddock Tavern Painted Lady The Pilot Poetry Jazz Cafe Rivoli Supermarket The Redwood Theatre The Theatre Centre The Vatican Gift Shop People's Choice 2025 Garage Band People's Choice Awards Terms + Conditions Info Centre ACCOMMODATIONS Sponsorship Emergency Services Good Eats Getting Around TO MAP Neighbourhood Guide SHOPPING Tourist Attractions NXNE APP Merch 0 0 0 0 ABOUT General FAQ History Commitment to EDI Meet The Team! Meet Our Advisory Board! 2024 HIGHLIGHTS PARTNER WITH US ARTISTS ARTIST FAQ NXNE 2026 Artist Application 2025 RECAP ARTISTS 2025 HIGHLIGHTS NEXT LEVEL PANELS SPOTLIGHT CITY MISSISSAUGA 2025 DELEGATES 2025 PARTNERS Venues Baby G Bovine Sex Club Burdock Cafe Pamenar Cameron House Collective Arts Dance Cave Death & Taxes Drake Hotel Drake Underground Duffy's Tavern Future (Infinity Room) Garrison Handlebar Horseshoe Tavern Illuminarium Jean Darlene Piano Room Lee's Palace The Mod Club Paddock Tavern Painted Lady The Pilot Poetry Jazz Cafe Rivoli Supermarket The Redwood Theatre The Theatre Centre The Vatican Gift Shop People's Choice 2025 Garage Band People's Choice Awards Terms + Conditions Info Centre ACCOMMODATIONS Sponsorship Emergency Services Good Eats Getting Around TO MAP Neighbourhood Guide SHOPPING Tourist Attractions NXNE APP Merch Open Menu Close Menu Folder: ABOUT Back General FAQ History Commitment to EDI Meet The Team! Meet Our Advisory Board! 2024 HIGHLIGHTS PARTNER WITH US Folder: ARTISTS Back ARTIST FAQ NXNE 2026 Artist Application Folder: 2025 RECAP Back ARTISTS 2025 HIGHLIGHTS NEXT LEVEL PANELS SPOTLIGHT CITY MISSISSAUGA 2025 DELEGATES 2025 PARTNERS Folder: Venues Back Baby G Bovine Sex Club Burdock Cafe Pamenar Cameron House Collective Arts Dance Cave Death & Taxes Drake Hotel Drake Underground Duffy's Tavern Future (Infinity Room) Garrison Handlebar Horseshoe Tavern Illuminarium Jean Darlene Piano Room Lee's Palace The Mod Club Paddock Tavern Painted Lady The Pilot Poetry Jazz Cafe Rivoli Supermarket The Redwood Theatre The Theatre Centre The Vatican Gift Shop Folder: People's Choice Back 2025 Garage Band People's Choice Awards Terms + Conditions Folder: Info Centre Back ACCOMMODATIONS Sponsorship Emergency Services Good Eats Getting Around TO MAP Neighbourhood Guide SHOPPING Tourist Attractions NXNE APP Merch 2025 DELEGATES Take a peek at just some of the industry folks that will be attending NXNE 2025. Sabrina Cousineau Manager, Bravo Musique We’re Bravo musique, a “music and talent label” that represents complex and complete homegrown artists, allowing them to shine on local stages and beyond. Bravo wants to give outstanding artists a chance by offering them the opportunity to perform and to exist. To do so, we provide them with sustained support, while cultivating relationships based on authenticity and a strong bond of trust. Bravo takes pride in being a vehicle for progress in its industry, by fostering inclusion, empathy, and respect for artists and their work. https://www.bravomusique.com/en/ Susan de Cartier Manager, Starfish Entertainment Starfish Entertainment is an independent music and artist development company based out of Toronto, ON. Established in 1995, Starfish is one of Canada’s premiere artist management firms. Starfish boasts internationally recognized, award-winning talent including multi-platinum selling artists Blue Rodeo and Jim Cuddy, Juno Award winning artists The Sadies, Elliott BROOD and Skydiggers and Gemini Award winning artist Suzie Ungerleider.  Starfish also manages The Woodshed, a premiere recording studio based in the heart of Toronto. https://starfishentertainment.com/ Amal Farhat Manager, Secret Agent Man Music Secret Agent Man Music (SAMM) is a small, but wildly passionate label & talent management agency dedicated to finding, nurturing, & promoting new talent in underserved markets in & around the indie/alt rock scene. Currently based in Aruba, with a division in Canada. Michael Religa Assistant Program Director/Music Director, Indie88 Indie88 - Toronto’s Modern Music 88.1FM @indie88toronto Home to mornings with @carlinburton_ & @radiobrent & @jackiepirico | @imadamtr @lanagay @therealbobwillette @danielwell 20 Hanna Ave, Toronto, Ontario M6K 0B7 https://www.indie88.com/ Alen Vitasovic Manager, Play MPE Play MPE® is the world’s leading provider of music promotional delivery services, dedicated to empowering artists and industry professionals with innovative solutions for success in the digital age. With a passion for creativity and a commitment to excellence, Play MPE® is shaping the future of the industry, one breakthrough at a time. The Play MPE platform was built for the music industry. Artists, promoters, and record labels promote music to verified curators with Caster and track radio airplay with MTR. Top curators in radio, media/blogs, music supervision and more discover releases and access assets from major labels and independents 24/7 in Player. Catherine Harrison Founder & President, Revelios [Mental Health Works] Revelios helps organizations design, implement, measure, and sustain meaningful mental health strategies — with a specialized focus on high-performance environments in the creative industries and life sciences. We help music industry workers develop individual and collective mental health through research, education, consulting, coaching, and advocacy. https://www.revelios.com/ Marvin Chan Artist, Trifecta Sound Co. Trifecta Sound Co. is an award-winning Canadian music label based in Saskatchewan and Toronto, with its artist and DJ roster spread across Canada. Their work in music-driven community building has been presented at festivals and conferences such as Wavelength Toronto, BreakOut West, MoSo Fest, and the Congress of Humanities and Social Sciences. Their efforts have also been featured in media outlets including Exclaim!, Gigwise, CBC Canada, and VICE Noisey. Most recently, their Artistic Director, Marvin Chan—also known by his stage name Merv xx Gotti—won Music Professional of the Year at the Saskatchewan Music Awards. The year prior, Trifecta Sound Co. secured a double win, earning both Industry Achievement and Music Organization of the Year. https://www.instagram.com/trifectasoundco/?hl=en David Tysowski Independent Radio Promoter, Canvas Media David Tysowski, owner of Canvas Media, is a University of Saskatchewan graduate with 30 years in the music industry. He spent over 12 years at Warner Music Canada in marketing roles across Saskatoon, Vancouver, and Toronto. In 2007, he joined Arts & Crafts as Director of National Promotion, handling campaigns in Canada and the U.S. for artists like Feist, Dan Mangan, and Broken Social Scene. In 2012, David launched Canvas Media, a Toronto-based radio promotion company, allowing him to work independently with a wide range of artists including The Lumineers, City and Colour, The Beaches, Royel Otis, Chvrches, and many more. Canvas Media marked its 13th anniversary in January 2025, continuing to support both emerging and established talent. Siobhan Woodrow Music Director, SiriusXM Siobhan Woodrow is a music director with 15 years of experience in radio, working across a wide range of genres—from country to South Asian music. She is currently the Senior Music Director at SiriusXM Canada, where she oversees 15 channels broadcast across North America. Barnaby Marshall Chief Technology Officer, Slaight Music Barnaby Marshall is the Chief Technology Officer at Slaight Music, where he oversees digital investments and web properties. With over 25 years in media, he began in TV journalism before moving to digital in 1996, leading Shift Magazine’s interactive department for five years. In 2002, he joined the creative team behind Toronto’s Drake Hotel, contributing to its design and relaunch, later managing its entertainment venue. He consulted for Standard Broadcasting in 2006 and joined Slaight Music at its 2011 launch. Marshall has hired and led numerous creative teams and developed many websites. He’s also mentored at the Canadian Film Centre’s ideaBOOST accelerator, moderated and spoken on tech and music panels, and appeared on TV and radio as a media commentator. Kelly Wilhelm Head of Cultural Policy Hub, OCAD Kelly Wilhelm (she/her) is a consultant and strategist with more than 25 years’ experience leading policy and innovation in government, the arts, media, creative industries, and the not-for-profit sector. As an independent consultant, Kelly leads a portfolio of projects, and is a sought-after speaker and facilitator. She is an Adjunct Professor and Head of the Cultural Policy Hub at OCAD University, a new partnership to build a national network to build informed, inclusive and integrated cultural policy at all levels in Canada. She is a member of the Global Creative Economy Council, an international forum on to advance the creative economy supported by the UK Creative Industries Policy Evidence Centre and the British Council. Previous roles include Chief of Staff to the federal Minister of Sport and Minister responsible for the Economic Development Agency for the regions of Quebec, Chief Strategy Officer at the Canada Media Fund, Senior Policy Advisor to the Minister of Canadian Heritage, and Director of Policy, Planning and Strategic Foresight at the Canada Council for the Arts. Dr. Richard Lachman Professor, Toronto Metropolitan University Dr. Richard Lachman directs the Zone Learning network of incubators for Toronto Metropolitan University, is a Professor in the RTA School of Media, and serves as a Technology and Creative Consultant for entertainment and software-development projects. He is a Gemini and CNMA award winner, and a frequent media commentator on technology issues. Lachman completed his doctorate at UNE in Australia studying neural network recommendation engines, did his undergraduate work in Computer Science at MIT, and holds a Master’s degree from the MIT Media Lab’s “Interactive Cinema” group. He was part of a startup acquired by Mattel, ending as Lead Designer and Lead Engineer for the Petz software with over 3 million units shipped worldwide. His areas of research include technology ethics, creative AI, transmedia storytelling, digital documentaries, mixed realities, and collaborative design thinking. His book “Digital Wisdom: Rethinking Innovation in the Age of AI” is forthcoming Fall 2025. Denny O'Dowd Chief Product Officer, NEWM Denny was recently named NEWM’s Chief Product Officer, responsible for overseeing the company's product strategy, from vision to execution, and leads the Product, Engineering, and Customer Support teams. He joined NEWM in the fall of 2023, facilitating the launch of two of NEWM’s web-based products, NEWM Studio and NEWM Marketplace. Prior to NEWM, he spent several years in product delivery management for the enterprise AI company, C3 AI, and in EY’s Analytics Consulting practice. Based in Detroit, MI, he graduated from Albion College with a BA in Economics & Management, and spent several years in the institution’s Music Performance program. Zack Werner Head of Business Development, LyricFind Winnipeg native Zack Werner has built a diverse career as an artist, producer, executive, lawyer, educator, and manager. He now leads business development at LyricFind and Rotor Videos. Zack was a judge on Canadian Idol for six seasons and also appeared on World Idol. In St. John’s, NL, he launched popular initiatives like SING NL and KIDZROCK NL. He previously led Venus Management and Venus Records, developing artists like esthero, Len, and Down With Webster. A former Capitol and MCA recording artist, he also practiced entertainment law, representing acts like Finger Eleven and Ron Sexsmith. Post-Idol, he founded Zack Werner’s Idol School, with students achieving success in music and TV. He holds degrees from the University of Minnesota and UBC Law. Gina Kennedy Artist, Altered by Mom Gina Kennedy (she/they) is a Toronto-based musician and songwriter known for her sharp lyrics, genre-blending alt-rock sound, and fearless stage presence. As the frontwoman of the award-winning band Altered by Mom, she crafts songs that hit with both emotional honesty and an irresistible edge. Altered by Mom is proudly independent so Gina handles the day to day like Social Media, Booking requests, and management duties. She not only pitches music to TV and commercials, she's also a Voice Actor, so whether you know it or not, you've likely heard her voice one way or another. Sebastian Mair President & Co-Founder, Music Solutions Sebastian Mair is a co-founder of Music Solutions and has been a key figure in the Asian music industry since moving from Toronto to Tokyo in 1996. Prior to launching the company, he worked as a Cultural Officer at the Embassy of Canada in Japan. Music Solutions specializes in brand partnerships and VIP packages for major artists touring Asia, with clients including Creativeman Productions, Ubisoft, Fujipacific Music, Live Nation Japan, and AEG Presents. Mair also works as a music supervisor for film and TV projects and curates music programming for brands like Starbucks, Hilton Hotels, Ritz-Carlton, and Bath & Body Works. He recently served as licensing supervisor for A Century Sound, a documentary on Tokyo’s 100-year history of music cafes known as ongaku kissa. Michael Lin General Manager, Arts for Canadians Tomorrow Society Michael, a Toronto native, has spent nearly a decade in the public arts and culture sector across Vancouver, Toronto, and Taiwan. He is the General Manager of the Arts for Canadians Tomorrow Society, overseeing production and artist management for Jade Music Fest in both Vancouver and Taipei. Since launching in 2022 and expanding to Taiwan in 2024, Jade Music Fest has become a vital platform for promoting Chinese-language and mother-tongue-based music in Canada and globally. Jay Dufour Recording Engineer Nine-time JUNO winner Jay Dufour is one of the most in-demand mixers in Canada. In May 2025, he scored a #1 at Canadian Country radio with James Barker Band’s “You Didn’t Hear It From Me.” Earlier this year, he won his ninth JUNO for Sebastian Gaskin’s Brown Man. Past JUNO wins include work with July Talk, Donovan Woods, and Protest The Hero. Recent credits include The Reklaws, Tyler Shaw, SB19’s Josh Cullen and Stell, Shawn Hook, Aaron Goodvin, and Phillip Phillips. In 2024, he mixed Tyler Shaw’s #1 pop single “What Christmas Means To Me” and Jade Eagleson’s #1 Country hit “Telluride.” Jay’s unmatched versatility, relentless work ethic, and radio-ready mixes have made him a trusted name across Country, Rock, Pop, and R&B. DJ ACE DJ, Kiss FM DJ Ace is a powerhouse in UK music, known for championing R&B and spotlighting the genre globally. With over 20 years at BBC Radio 1Xtra, he earned a Sony Gold Award and played a key role in R&B’s resurgence. In 2024, he joined Kiss FM to host its flagship R&B show, reaching 2.3 million listeners weekly. He co-founded The RecordBox/ERNB in 2015, supporting UK R&B artists. His work has earned him a 2025 Music Week Awards nomination. A three-time SXSW host, Ace remains a vital force, celebrating R&B’s roots while shaping its future on air and beyond. Victoria Lord Senior PR Consultant, Victoria Lord PR Victoria Lord is a seasoned expert in media relations, strategy, and marketing communications, known for leading high-profile campaigns for some of the world’s most iconic talents. Starting her career at Universal Music Group, she has built a strong reputation across the entertainment, music, arts, tourism, and hospitality sectors. For over 30 years, she’s worked with major names like Dolly Parton, Jim Belushi, and the late Gordon Lightfoot. In 2002, she founded her own public relations agency, representing clients such as Sony Music Canada, Massey Hall, and AEG Live. She has supported the Canadian Federation of Musicians, the Songwriters Association of Canada, and initiatives like Music Monday. Her work extends to Oscar-winner Rodriguez and tours for Van Morrison and Andrea Bocelli, as well as speakers like Bill Clinton, John Cleese, and Neil deGrasse Tyson. Victoria serves on the Canadian Live Music Association board and FACTOR’s Diversity Committee, and frequently mentors students through speaking engagements. Cameron Carpenter Publicist, Music Festival Programmer Cameron Carpenter is a veteran of the Canadian music industry having held senior positions at Quality Records, MCA Records, BMG and Sony Music in A&R, Marketing, Artists Relations and International. He was on the team that brought XM Satellite Radio to Canada and has worked at Indie Week and NXNE. Cameron has also worked as a freelance journalist, artist manager and publicist and was twice awarded \"Major Label Publicist\" at the Canadian Music Industry Awards. Jodie Ferneyhough President, CCS Rights Management In 2011, Jodie founded CCS Rights Management with a vision of a dynamic global independent company that puts artists and songwriters first, providing individualized attention and a full range of services to maximize income, elevate careers, and protect the value of their works. Under his leadership, CCS has experienced continuous growth and significantly expanded its global reach and scope of services provided to a growing roster of award-winning and up-and-coming songwriters, artists, musicians, producers, and labels, as well as major corporate brands and other rights holders. Mike Krompass CEO, BCMG Recordings Mike Krompass (Mike K) is a multi-platinum producer, songwriter, mixer, engineer, multi-instrumentalist, and music executive. With over 800 million streams and 12 billion views, he ranks among the top 1% of producers and songwriters globally. As CEO of BCMG Recordings Inc., he holds the exclusive Canadian license to Extreme Music/Sony ATV, which includes works by Hans Zimmer, Snoop Dogg, Timbaland, and more—including the Death Row Records catalogue. Mike began as a top session/touring guitarist in Toronto before moving to Nashville and Los Angeles. With his wife Anissa Krompass, BCMG operates as a full-service label and publishing company distributed by Sony Music’s The Orchard. His credits span artists like Meghan Trainor, Smash Mouth, Fifth Harmony, Kelsea Ballerini, and Steven Tyler. His music has appeared in major films and TV globally. He’s also performed live with Nelly Furtado and others on SNL, Letterman, and The Tonight Show. Heather Gardner President, Guild of Music Supervisors, Canada As Head of Music Supervision + Licensing at Vapor Music and Long Division, Heather balances her right brain creativity with extensive left brain attention to detail, allowing for a seamless licensing process from concept to contract to cue sheet. Her credits span television series, feature films, TV movies, advertising campaigns and video games that have been seen worldwide, including the globally trending series BET for Netflix (an adaptation of the Japanese manga Kakegurui), season 2 of Mistletoe Murders for Hallmark, and feature films Hell of a Summer (directed by Stranger Things’s Finn Wolfhard and Billy Bryk), Young Werther (dir. José Lourenço), Paying For It (dir. Sook-Yin Lee) and Drive Back Home (dir. Michael Clowater). She is a multi-Canadian Sync Award winner, and led in nominations at the 2024 awards alongside the Vapor Music/Long Division team. Heather currently serves as the President of the Guild of Music Supervisors, Canada. Luther Mallory Performance Coach, Luthur Mallory Productions Luther Mallory is a renowned Artist Performance Coach, Keynote Speaker, and Music Artist. He specializes in teaching stage presence to performing artists and business professionals by helping them break through psychological barriers to access their most fearless, confident selves. After spending 10 years touring in a band—playing 1,000 shows across North America and living out of a van in Canadian winters—Luther developed powerful methods to manage pressure, nerves, and self-judgment on stage. He began sharing these tools with salespeople, executives, and high-achievers, helping them transform how they perform in both their careers and lives. Luther is the Performance Coach for two of Canada’s top music development programs: the JUNO Masterclass and CMI’s Artist Entrepreneur programs in Toronto and Calgary. Over the past decade, he has coached more than 1,000 artists, including JUNO Award and Polaris Prize winners, major label acts, and over 50 artists who have surpassed one million Spotify streams. Keziah Myers Executive Director, ADVANCE Music Canada Keziah Myers is a national leader advocating for diversity and radical intentionality as drivers of business success. She was named Changemaker of the Year by The Globe and Mail (2022), Distinguished Leader by Women in Music Canada (2023), and featured on Billboard Canada’s Women in Music list. In 2025, she will be honoured by The Hollywood Reporter on its Women in Entertainment Power List. Keziah has built a dynamic career in PR, marketing, royalties, copyright, and label operations, working with LU KALA, Maroon 5, OVO, Deborah Cox, XO, Jessie Reyez, Boi-1da, and others. As Executive Director of ADVANCE, she partners with government and industry to champion Black professionals in Canada’s music business. She is also a professor, speaker, workshop facilitator, and sits on three boards, mentoring the next generation and driving impact. Paul Eastwood Director of Marketing & Business Development, Soundpays Corp Paul Eastwood is an entrepreneur and an entertainment executive with extensive experience in brand and business development across the sectors of recorded music, apparel/sportswear, merchandising, sponsorship, music publishing, and entertainment technologies. He is currently the Director of Marketing & Business Development at Soundpays Corp where he spearheads all business initiatives in the live music, sports, and entertainment industries, and oversees the company’s branding, content and communications. Prior to joining Soundpays, Paul held positions with Anthem Entertainment, The Feldman Agency and Showtech Merchandising. A long time ago in a galaxy far, far away … he was Vice President of Marketing & Promotion at Universal Music. Angela White Senior Director, EDI, MLSE Angela White is Senior Director, Equity, Diversity & Inclusion at Maple Leaf Sports & Entertainment, where she leads the Corporate EDI center of expertise. She drives the organization’s commitment to a diverse, equitable, and inclusive workplace. Angela and her team collaborate with stakeholders through a four-pronged strategy: integrating EDI into business KPIs, implementing inclusive policies, supporting employee inclusion groups, and building strategic partnerships with communities and experts. Previously, Angela spent 18 years at RBC in various sales leadership and strategy roles, where she also championed diversity programs to disrupt bias and foster belonging. Deeply committed to inclusion, Angela serves as an EDI advisor, consultant, and mentor—devoting her time to empowering under-represented youth and helping them navigate their career paths. Alex Exists Artist, Songwriter, Producer Alex Exists is a Canadian alt-pop provocateur, songwriter, producer, and filmmaker from Toronto. He creates genre-blending anthems fusing neo-glam pomp, post-punk sneer, and classic pop with experimental edge. His beat-heavy, sharp sound explores rebellion, obsession, and desire with a darkly hopeful twist. His 2023 solo album Everybody’s Famous drew praise for its lush melodies and standout songwriting (Chris Buxton, Banger of the Day). A dynamic performer, Alex has shared stages with Ian Hunter, Jesus and Mary Chain, Gord Downie, and Mother Mother at venues like Toronto’s Mod Club and NYC’s Bowery Ballroom. He connects deeply with fans and is now crafting bold new music and visuals for 2025. David \"Click\" Cox Manager/Consultant, CLK Creative Works David \"Click\" Cox is a seasoned entertainment professional with over 25 years of experience in the music industry. Starting as an artist and concert promoter, he has worked across retail, radio, marketing, management, and A&R at Universal Music Canada. His company, CLK Creative Works, offers consulting services and is producing a documentary on King Reign. David teaches at The Remix Project and produced the acclaimed TV series Ultimate MC and the film The Onyx Experience, a tribute to Black rock artists. He is also the founder of Breaking Down Racial Barriers, an initiative to end anti-Black racism and promote equity in the industry. David’s enduring impact reflects his deep commitment to music, mentorship, and meaningful change in entertainment. Joe D'Ambrosio Head, Joe D’Ambrosio Management Joe D’Ambrosio, a 44-year entertainment industry veteran, heads Joe D’Ambrosio Management, Inc. (JDMI), which represents top behind-the-glass talent including Grammy-winning producers Tony Visconti, Hugh Padgham, Kevin Killen, and Jay Newland, mixers Joe Zook and Jay Dufour, and arrangers Rob Mounsey and Larry Gold. Now in its 23rd year, JDMI manages leading producers, engineers, writers, and musicians. Joe is also managing partner of Audiosmith Digital Solutions, a nine-year-old recording services company based at the DiMenna Center for Classical Music. Audiosmith has recorded 38 Original Broadway Cast albums—such as Hadestown, Moulin Rouge, and Hello, Dolly!—and original scores for 46 films, including Joker, Little Women, and The Girl on the Train, plus songs from The Greatest Showman. Denz McFarlane Artist, OBGMs Densil McFarlane is the lead vocalist, guitarist, and principal songwriter of The OBGMs, a genre-pushing punk band based in Toronto. Known for their explosive live shows and commanding stage presence, The OBGMs have toured internationally and shared stages with acts like Sum 41, Billy Talent, and Death From Above 1979. Under Densil’s leadership, the band earned a Polaris Music Prize shortlisting and continues to grow a global fanbase through raw authenticity and relentless energy. In addition to performing, Densil is the founder of Burn Industry, a creative company focused on artist development and cultural impact. Denise De'ion Producer/Songwriter Denise De’ion is a Juno Award Winning Producer/Artist/Songwriter. She has worked with artists such as Boi1da, Haviah Mighty, Leila Dey, Phoenix Pagliacci and more. In addition to her work with other artists, she has also released her own musical projects (Peace of My Soul and Last Call). Her music has also been heard in episodes of Ginny and Georgia and Kim’s Convenience and through brand placements with Bacardi and Bulleit Whiskey. Joel Fowler Owner/Promoter, Xerox Arcade/Bar With over 30 retro arcades, pinball and many other types of games Xeroz Arcade/Bar is the ultimate fun place to go in Moncton N.B to see music, comedy, play games and many other types of events. Named venue of the year for New Brunswick by Music NB in 2023 Xeroz Arcade/Bar has hosted bands and performers from Indonesia, India, Canada, USA, UK and Pakistan. Names such as Holy F*ck, Cancer Bats, Cry Wank, Comeback Kid, D.O.A. and more! We are a designated safer space in the city and welcome all people no matter what gender( or no gender) sex, race or religion etc.... ALL ARE WELCOME linktr.ee/xerozarcadebar Hill Kourkoutis Producer Hill Kourkoutis is a JUNO Award-winning producer, songwriter, mixer, engineer, multi-instrumentalist, and director. She has worked with Aysanabee (JUNO-nominated Watin), Leela Gilday (JUNO-winning North Star Calling), Digging Roots (Zhawenim), SATE, Royal Wood, and Cassie Dasilva, among others. Her songs have charted across CBC, Alternative Rock, and Folk charts. She’s created music for children’s TV shows (Remy and Boo, Dino Ranch) and placements for Station 19, Degrassi, Cadillac, and more. As a performer, she’s played with The Weeknd and Serena Ryder, and appeared on CTV’s The Launch. She has directed videos for Mother Mother and Serena Ryder. In 2022, she became the first woman to win a JUNO for Recording Engineer of the Year. Hill works from her Toronto studio, The Lair. Vincent Degiorgio CEO/Publishing, Cymba Music Publishing Toronto, ON Vincent Degiorgio is the CEO of Cymba Music Publishing. His company, Cymba, is an acronym for ‘Crushing Your Music Business Apathy is one of the most pro-active, creative music publishing entities in Canada. With unprecedented global reach and a focus on the international market for recorded music and synch, it is home for writers and artists such as Monowhales, Keshia Chante, Talltale, Barbra Lica and Rachel Cousins. Songs written Cymba’s songwriters have been recorded in over a dozen languages and synchronized around the world. Cymba’s writer/producer roster includes Daniel Adams and Davor Vulama. Aside from being president of the company, Vincent is also a songwriter. His work with Dutch pop star Caro Emerald recently eclipsed the two million album threshold. He has also co-written seminal classics like Love Inc’s “You’re A Superstar”. He most recently wrote four songs with Juno nominated Matt Dusk on his “Jet Set Jazz” album. Working on the major label side as an A&R executive at RCA Records, Vincent signed N Sync to the label. He is currently on board of the Canadian Songwriters Hall of Fame and is the current chair of Music Publishers Canada. Sarah Falzon Lawyer, Taylor Oballa Murray Leyland LLP. Sarah Falzon is a lawyer at Taylor Oballa Murray Leyland LLP. She has been practicing music and entertainment law since 2015, primarily working with and representing artists and music services companies navigating through varying stages of their careers and businesses. Sarah is a graduate of McMaster University (Hons. B.Sc . in Mathematics & Statistics) and Osgoode Hall Law School (J.D.). She has been a guest speaker for various events and organizations, including Women In Music Canada, Canadian Music Week, Canada’s Music Incubator, Honey Jam, Law in Action Within Schools, and Toronto Metropolitan University. Sarah is passionate about helping artists and arts workers, and about corporate social responsibility in these spaces. Carmen Ford Manager - Creative Industries Office, City of Mississauga City of Mississauga Film, Television and Music Office. Sector development Maxime Fremy Founder, FEST App Ready to elevate your festival experience? Meet FEST! We're not just an app; we're your ultimate guide to your festival journey, whether you're rocking out in the crowd or orchestrating the magic behind the scenes. FEST is the app that eliminates festival stress for both fans and organizers. Instantly access real-time schedules, artist lineups, interactive maps (no more getting lost!), personalized notifications, sponsor integrations, and even a built-in audio player. More than an app, FEST is your strategic marketing tool to maximize event visibility, activations and fan engagement. And that's not all! We're building the biggest global community of festival lovers, already connecting 150,000 enthusiasts. We're proudly powering events in over 5 countries, including iconic ones like NXNE, POP Montréal, Rototom Festival, and Pride Montreal. Dive into the FEST experience: festapp.io ! Linda Noelle Bush Music Business Professor, Durham College Linda Noelle Bush has over 30 years of experience in the Canadian music industry, beginning in A&R at Attic Music Group under Alexander Mair and Maestro Fresh Wes. She later joined Universal Music Publishing as Creative Manager/A&R, where she supported artists like K-OS and Sam Roberts. In 2004, she launched New Romantic, a management company and label with artists including controller.controller and The Organ. Her work expanded into Film & TV, including roles as music supervisor and licensing manager. As Music Manager at WildBrain, she oversaw music rights for iconic family brands like Yo Gabba Gabba! and Teletubbies. Later, as VP of Artist and Label Services at Cadence Music Group, she led Fontana North distribution and worked with artists like Jeremy Dutcher and Lido Pimienta. Today, Linda mentors emerging talent and teaches at Humber and Durham Colleges, sharing her industry insight and passion for helping artists build sustainable careers. Annie Hébert Director of Business Development, FEST App Ready to elevate your festival experience? Meet FEST! We’re not just an app; we’re your ultimate guide to your festival journey, whether you’re rocking out in the crowd or orchestrating the magic behind the scenes. FEST is the app that eliminates festival stress for both fans and organizers. Instantly access real-time schedules, artist lineups, interactive maps (no more getting lost!), personalized notifications, sponsor integrations, and even a built-in audio player. More than an app, FEST is your strategic marketing tool to maximize event visibility, activations and fan engagement. And that’s not all! We’re building the biggest global community of festival lovers, already connecting 150,000 enthusiasts. We’re proudly powering events in over 5 countries, including iconic ones like NXNE, POP Montréal, Rototom Festival, and Pride Montreal. Dive into the FEST experience: festapp.io ! Yafania Artist Vancouver, BC Yafania is a dream romance pop artist, utilizing her signature storytelling to craft unforgettable immersive music and music video experiences. As a newly-minted nineteen year old, this singer-songwriter possesses a ferocious drive and unrelenting passion for creating music rooted in romance. Each song she writes is a carefully crafted narrative, capturing exact moments and the realizations that accompany them. Her sound resonates with friends and lovers across generations. Coming into her own as a visual storyteller, each song and accompanying music video is a chapter in a larger story, filled with the kind of romantic idealism and emotional depth that sets her apart from her peer Yafania’s music video saga continues with the highly anticipated release of “Don’t You Want to Be With Me?” the second chapter in a cinematic love story that began with “The Right Guy.” The saga seamlessly blends Yafania’s captivating vocal artistry with the on-screen charisma of Disney star Pearce Joza, weaving a heartfelt tale of youthful love and transformation. Her signature approach has earned her a dedicated following, with over 100,000 YouTube subscribers and millions of views across platforms since June 2024. Now hitting her stride, she connects with listeners on a personal level through relatable stories and messages of encouragement, driven by her dynamic personality and unwavering drive. Already having showcased her unique ability to capture exact moments and the emotions that accompany them, Yafania has proven to be one of the most exciting young artists to watch. https://yafania.com Emma Barnett Program Administrator, FACTOR The Foundation Assisting Canadian Talent on Recordings – FACTOR – is a private, non-profit organization dedicated to providing investment support toward the career development of Canadian artists, entrepreneurs, and organizations to produce and promote a diversity of Canadian music in a world of choice, be competitive at home and abroad, and to contribute to Canada’s creative economy. Funding for our programs is contributed by the Department of Canadian Heritage’s Canada Music Fund and from Canada’s private radio broadcasters. Michelle Perkins-Zalik Marketing Coordinator, Play MPE Vancouver, BC Play MPE® is the world’s leading provider of music promotional delivery services, dedicated to empowering artists and industry professionals with innovative solutions for success in the digital age. With a passion for creativity and a commitment to excellence, Play MPE® is shaping the future of the industry, one breakthrough at a time. The Play MPE platform was built for the music industry. Artists, promoters, and record labels promote music to verified curators with Caster and track radio airplay with MTR. Top curators in radio, media/blogs, music supervision and more discover releases and access assets from major labels and independents 24/7 in Player. Adam Tumilson Radio and Media Engagement Manager, Play MPE Play MPE is the world’s leading provider of music promotional delivery services, dedicated to empowering artists and industry professionals with innovative solutions for success in the digital age. With a passion for creativity and a commitment to excellence, Play MPE is shaping the future of the industry, one breakthrough at a time. Jason MacIntyre Technology NEWM is a blockchain-powered music ecosystem that gives artists full ownership and control over their royalties. Built on the transparent Cardano blockchain, we eliminate intermediaries, empowering musicians to monetize their work from creation to retirement. NEWM’s vision is to reshape the music industry by fostering direct, seamless connections between artists and fans. Our flagship product, NEWM Studio, bridges Web2 and Web3 by allowing artists to tokenize and distribute streaming royalties with automated royalty splits. The NEWMiverse will also include a music streaming platform, rights marketplace, direct tipping, and more – redefining music ownership and fan engagement. Learn more at newm.io . Duncan Boudreau Director & Co-Founder, Gemini Music Group Duncan Reid Boudreau is a Toronto-based producer, mix engineer, and co-founder of Gemini Music Group, a publishing and production company focused on artist development, sync licensing, and catalog growth. With a background as a trained vocalist and multi-instrumentalist, Duncan approaches production with a deep understanding of both artistry and execution. His work is rooted in collaboration, clarity, and emotional connection, helping artists finish records that feel authentic and industry-ready. Through Gemini, he is building a creative home for artists looking to scale their sound and expand their reach. Nevena Stajcic Manager, Asahi Canada Asahi Canada is the Canadian subsidiary of Asahi Europe and International. Asahi Canada's collection of premium beers each tell their own brand story and share a passion for craftsmanship, authenticity and using only the finest ingredients. Our iconic premium beers include Peroni Nastro Azzurro, Grolsch, Asahi Super Dry, Pilsner Urquell, Fuller’s London Pride, Tyskie, Kozel, Lech and Zubr. With a business that has unmatched expertise in the category, Asahi Canada differentiates its brands through experience led marketing that creates emotional connections with customers through community building events and premium partnerships. Our distribution disciplines and innovative ways of working allow us to offer more value to our customers, ultimately helping to change the way people think about beer. We are continuously making strides to lead the super-premium beer space, and our unique collection of brands allow us to deliver the perfect beer for every occasion. Corey Poole Music Development Coordinator, City of Mississauga Corey Poole is a cultural policy expert currently leading the City of Mississauga’s award-winning efforts to grow its music sector. He’s spent the last decade helping build better regulatory frameworks for creators through cross-sectoral research and policy projects aimed at all three levels of government in Canada. He’s happiest when leading innovative projects that get artists paid and build new audiences. Before diving full-time into policy, he worked as a DJ and musician in an electro-punk band signed to a rap label. Amie Therrien Manager, MMF Canada Amie Therrien leads the MMF Canada team, supporting managers and self-managed artists with professional development, networking and mentorship opportunities, and advocacy. Amie also ran Balsam Pier Music, an artist management and development company where she primarily worked with folk, roots, and Americana artists. She is a member of the Toronto Music Advisory Council, served nine years on the Folk Music Ontario board, worked for Coalition Music, Folk Alliance International, and is an alumni of the Artist Manager Program with Canada’s Music Incubator. Amie is based in Toronto and is the President of the Toronto & York Region Métis Council, a kayaker, a meditator, a beading artist, a newbie jigsaw puzzler, and a recovering civil engineer. Grant Paley Agent, Midnight Agency Toronto A stalwart in the Canadian music industry, Grant embodies a profound connection to music as both an award-winning artist and agent. His musical journey commenced on stage as the dynamic frontman and DJ of the electrifying Moses Mayes. After a decade of captivating performances, he seamlessly transitioned behind the scenes to become a music agent and he’s never looked back. With 12 enriching years at Paquin Artists Agency, Grant curated a distinctive roster of live and electronic acts before taking a bold step in 2020 to co-found Midnight Agency. Under the Midnight banner, he represents award-winning clients in Canada, the USA, Australia, and New Zealand. In a testament to his unwavering dedication, Grant was honored as the 2023 Canadian Live Music Association's Agent of the Year, solidifying his status as one of the most influential agents in the industry. Paige Guscott Program Coordinator, Ontario Creates Paige Guscott is a music industry professional who has spent the past decade working in cultural sector economic development. She has worked at various advocacy and funding agencies like Music BC, FACTOR, and Ontario Creates, managing programs and improving access to funding. As a Program Coordinator at Ontario Creates, she helps administer funding to music companies across Ontario, and she loves celebrating the impact that the music industry has on culture and the economy. Lisa Persaud Publicist, INK Entertainment and LPR Lisa Persaud is a powerhouse public relations professional and a driving force in the entertainment and cultural landscape. With over 20 years of experience, she has built a dynamic career at the intersection of music, hospitality and film. Now based in Toronto as Head of PR at INK Entertainment, Lisa brings her global expertise in public relations and brand development to shape some of the city's most iconic brands, talent and experiences. At just 19, Lisa made history as the founder and editor-in-chief of Industry Mag, the first female-led urban entertainment publication to spotlight emerging talent on a global scale. She went on to hold high-impact roles at leading companies such as Diageo, Interscope Records, Tyler Perry Studios, the NBA, the NHL, and Def Jam, spearheading campaigns, press tours, and brand partnerships across North America and United Kingdom. Beyond her professional accomplishments, Lisa is deeply committed to community impact. She founded the LCP Foundation, a non-profit supporting survivors of domestic violence through mentorship and career development, and launched a mentorship program pairing students from underserved communities with industry leaders. Known for her bold vision and steadfast purpose, Lisa continues to use her platform to elevate others and influence culture for the better. Sarah Power Producer, An Exploration Of Hypnotic Sound Sarah Power is a producer known for her innovative work in live entertainment and music production. As founder of Initiated Entertainment, she produced the acclaimed album An Exploration of Hypnotic Sound by Asad Mecci and Rufus Wainwright, blending hypnotic techniques with immersive soundscapes for a transformative listening experience. Sarah also serves as lead producer for HYPROV: Improv Under Hypnosis, co-created by Asad Mecci and Colin Mochrie. Under her leadership, the show has achieved major success Off-Broadway, in Las Vegas, and on tour across North America, earning praise from top media outlets. With a background in corporate strategy and an MBA from the Rotman School of Management, Sarah brings a unique blend of business acumen and creative vision to her projects. Her work continues to push boundaries at the intersection of performance, wellness, and immersive media. Asad Mecci Artist, An Exploration Of Hypnotic Sound Asad Mecci is a world-renowned hypnotist and the creative mind behind the new album “An Exploration of Hypnotic Sound” with Grammy-nominated artist Rufus Wainwright. This groundbreaking project blends original music with hypnotic techniques and guided vocal suggestions, offering a deeply immersive listening experience designed for relaxation, introspection, and creativity. With over 20 years on stage, Asad’s performances have captivated millions worldwide and earned features in The New York Times, Time Out New York, The New Yorker, Forbes, The Wall Street Journal, and more. Now, he brings his expertise in hypnosis to the music world—inviting listeners to tune in, relax, and discover the power of sound. Koral Captain Content Marketing Manager, L-Acoustics Koral Captain is a digital marketing professional with a strong background in content strategy, social media, and brand storytelling. She currently serves as the Content Marketing Manager at L-Acoustics, where she leads the creation and execution of content strategies that celebrate sound as an art form and elevate the brand across platforms. Prior to joining L-Acoustics, Koral was on the digital marketing team at Paramount Pictures, where she contributed to award-winning campaigns for major film releases including Scream VI, Mission: Impossible – Dead Reckoning, and Teenage Mutant Ninja Turtles: Mutant Mayhem. Catherine Moore Adjunct Professor and Partnerships Advisor, University of Toronto Faculty of Music Catherine Moore, currently Adjunct Professor of Music Technology & Digital Media at the University of Toronto’s Faculty of Music, emphasizes creating (and pitching!) value in business courses, workshop coaching, and consulting work. In her teaching, the focus is on new technologies for digital media distribution, music startups, and collaborative courses that bring students in user-experience design, computer science, and music together. Catherine taught at NYU from 1995 to 2016, directing the Music Business Program for many years. Her focus there was on price strategy, strategic marketing, business development, A&R music evaluation, and international expansion. Catherine’s first music-business job was managing a record store in Liverpool, England, and she is a music critic for American Record Guide magazine. She continuously seeks parallels and inspirations from other industries -- such as food production -- and tells anyone who’ll listen that it’s a vital way to protect against sector insularity. Amie Therrien Manager, MMF Canada Amie Therrien leads the MMF Canada team, supporting managers and self-managed artists with professional development, networking and mentorship opportunities, and advocacy. Amie also ran Balsam Pier Music, an artist management and development company where she primarily worked with folk, roots, and Americana artists. She is a member of the Toronto Music Advisory Council, served nine years on the Folk Music Ontario board, worked for Coalition Music, Folk Alliance International, and is an alumni of the Artist Manager Program with Canada’s Music Incubator. Amie is based in Toronto and is the President of the Toronto & York Region Métis Council, a kayaker, a meditator, a beading artist, a newbie jigsaw puzzler, and a recovering civil engineer. NXNE INC. 115 Danforth Avenue, Suite 302 Toronto, Ontario M4K 1N2, Canada 416-901-6963 info@nxne.com ©NXNE 2025, All Rights Reserved"
    }
  ]
}