{
  "fuentes": [
    {
      "url": "https://www.staaa.org/permanent-collection/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/st-augustine-art-association",
      "email": "info@staaa.org"
    },
    {
      "url": "https://www.usa.edu/about/contact-us/",
      "email": "whit-logo-usa@4x.png"
    },
    {
      "url": "https://www.staaa.org/visit/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://www.staaa.org/donate/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://historiccoastculture.com/venue/st-augustine-art-association/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/venue/st-augustine-art-association/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://historiccoastculture.com/venue/st-augustine-art-association/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.staaa.org/touch/sculpture-garden/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://www.staaa.org/touch/sculpture-garden/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://www.staaa.org/contact/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://www.visitstaugustine.com/event/first-friday-art-walk",
      "email": "info@staaa.org"
    },
    {
      "url": "https://maymgt.com/contact-us/",
      "email": "sales@maymgt.com"
    },
    {
      "url": "https://maymgt.com/contact-us/",
      "email": "sales@mayresort.com"
    },
    {
      "url": "https://business.sjcchamber.com/member-directory/Details/st-augustine-art-association-3413504",
      "email": "info@sjcchamber.com"
    },
    {
      "url": "https://www.staaa.org/art-galleries-of-st-augustine/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://www.bozardford.net/contactus.aspx",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.historiccoastculture.com/organization/st-augustine-art-association/",
      "email": "x@2x.png"
    },
    {
      "url": "https://www.historiccoastculture.com/organization/st-augustine-art-association/",
      "email": "info@staaa.org"
    },
    {
      "url": "https://www.historiccoastculture.com/organization/st-augustine-art-association/",
      "email": "sjcc@historiccoastculture.com"
    }
  ],
  "mails": [
    "flags@2x.png",
    "info@sjcchamber.com",
    "info@staaa.org",
    "sales@maymgt.com",
    "sales@mayresort.com",
    "sjcc@historiccoastculture.com",
    "whit-logo-usa@4x.png",
    "x@2x.png"
  ],
  "nombre_sitio": "staaa.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.staaa.org/permanent-collection/",
      "text": "Permanent Collection – St. Augustine Art Association Skip to content Skip to footer GALLERY HOURS: TUE - SUN, 12PM TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour DONATE About About STAAA Staff & Board Planned Giving Sponsors & Partners News Careers Join Membership Volunteer Art Gallery Membership Join our Mailing List Shop Original Artwork Visit GALLERY HOURS: TUE - SUN, 12pm TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour Visit SHOP DONATE Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour ABOUT VISIT Plan Your Trip Around the Arts HISTORY STAFF & BOARD Planned Giving ART CURRENT EXHIBIT: Fall Members Show STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work CALLS FOR ART Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibition All Calls for Art EXHIBIT GUIDELINES EVENTS FIRST FRIDAY ART WALK Plein Air in the Park 2026 French River Cruise ADULT PROGRAMS MONDAY NIGHT FIGURE DRAWING Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air YOUTH PROGRAMS Kids Summer Art Camps PERMANENT COLLECTION DRAKE’S RAID EXHIBIT MARGUERITE CASTAING JEAN TROEMEL JOIN MEMBERSHIP VOLUNTEER SPONSORS / PARTNERS Gallery Membership SHOP PERMANENT COLLECTION The St. Augustine Art Association Permanent Collection consists primarily of local subjects and is represented by well-known artists dating from the 1930s to the present. The works are displayed periodically in the Marguerita Phillips Wing, which was constructed in the 1990s thanks to the generosity of Faith and Joseph Tiberio. (A book of the entire Permanent Collection is available for viewing on site.) THE ST. AUGUSTINE LOST ART COLONY During the period of 1930-1950, in the midst of the Great Depression and outbreak of World War II, a dedicated group of professional and amateur artists who formed the St. Augustine Art Association (originally the St. Augustine Arts Club) helped transform the historic town of St. Augustine, Florida, into a thriving winter art colony that attracted hundreds of American artists, many from the northern art colonies of Rockport, Provincetown, Woodstock, Ogunquit and others. The work of these early/mid-century “Lost Colony” artists has been recognized as an important contribution to American regional art. While the story of St. Augustine’s art colony is largely forgotten, this online gallery of selected works from the St. Augustine Art Association permanent collection offers an opportunity to connect with the artists and discover a remarkably unique and diverse aesthetic from years gone by. This online gallery and research project was sponsored by a grant from the JoAnn Crisp-Ellert Appreciation of the Arts in St. Augustine Fund through the Community Foundation of Jacksonville. Special thanks to Robert Torchia, author of Lost Colony: The Artists of St. Augustine 1930-1950. Selected Artists from Permanent Selection: Celia Cregor Reid E.B. Warren Emmett Fritz Frances Howatt Gladys V. Mitchell Harold Etter Harold S. Maddocks Heinrich Pfeiffer J. Courtenay Hunt John Pratten Lorena Rogers Louis Kronberg Louise W. Shanks Nunzio Vayana Ralph Hillbom Rosalie Barclay Walter Cole Robert Hamilton W.F. Krondorf William L’Engle Tod Lindenmuth View full image This painter and printmaker from Springfield, Kentucky, was trained in the United Kingdom and later studied at the Art Institute of Chicago, the Carnegie Institute and the Maryland Art Institute. In 1926, Celia Gregor Reid moved to Saint Augustine, Florida, and became one of the leading members of the art colony. Beginning in 1935, Reid contributed her artistic talents to the production of the Saint Augustine street festivals. This particular print commemorates the Aviles Street Festival held March 19-20, 1948. The theme of the festival was a “Day in Spain.” Reid served as the chairman of festival design and decoration. In creating this blockprint, Reid placed the emphasis on surface design and patterns. The effect is a strong contrast of black and white. Reid offered this print to artist Tod Lindenmuth as a souvenir of the event. The Lindenmuths later donated “Fiesta” to the Saint Augustine Art Association to add to its permanent collection. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Elizabeth Boardman (E.B) Warren, artist and illustrator, was a student of the Massachusetts School of Art and the Vesper George’s School of Art. She was trained as an illustrator and etcher, but her early medium of choice was watercolor. Warren created numerous watercolor views of New England and Florida. She and her husband, artist Tod Lindenmuth, were active members of the Provincetown Art Association and the Saint Augustine Art Association. During the late 1930s, Warren began to paint pastel portraits of children. The artist became best known in Saint Augustine, Florida, for her exquisite pastel portraits of young girls. It was a “social must” to commission her for a portrait. These works were greatly treasured and became heirlooms within the families. During her later years, Warren took up ink and brush drawing, etching and book illustration. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Emmett Fritz was born in Kansas City, Missouri, in 1917. He attended the Phoenix Art Institute in New York and graduated from the Pratt Institute of Art. Fritz began his career as a commercial artist. After serving in the Army during WWII, he became a cartoonist and caricaturist. Fritz had the opportunity to study under the iconic American illustrator Norman Rockwell through the correspondence course “Famous Artists.” Fritz was required to submit sketches, which were reviewed and critiqued by the instructor, Rockwell. Around 1950, Fritz moved to Saint Augustine, Florida, joined the Saint Augustine Art Association and quickly became integrated into the artist community. Fritz painted in the Impressionist style. Using acrylics and oils, his subject matter was often the historic streets and landscapes of Saint Augustine. The artist operated a studio in the Riberia House on St. George Street where he personally greeted visitors who snatched up his affordable, colorful paintings. Over his forty-five year career in Saint Augustine, Fritz amazingly produced some 10,000 paintings. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Frances (Franny) Howatt first trained in art at the Chaffee School For Girls under Madame Cheruy in her hometown of Windsor, Connecticut. She continued her studies as a pupil of Umberto Romano of the Umberto Romano School of Art in Gloucestor, Massachusetts. In 1946 Howatt relocated to Saint Augustine, Florida, and became the student of John Pratten, formerly of Elizabethtown, New York, studying portraiture under him for three years. She received still life and landscape instruction from Charles Johnston. The scenes of Saint Augustine appear in many of her paintings. In 1962, Howatt was credited with developing a new painting technique she tagged “intalgios in oil.” This process involved a combination of carving and painting. Howatt distressed wood panels by gouging and scraping with chisels. The rough surfaces were painted complementary to the designs created in the panels. The works were suitable for interior or exterior and most had historical or literary themes. Howatt was invited to show her intalgios in an invitational exhibit at the Lillian Phipps Gallery in Palm Beach, Florida. An ardent supporter of the Saint Augustine Arts Club, Howatt and artist Tod Lindenmuth were members of the council that sponsored the first Arts and Crafts Festival in 1966. The festival’s mission was to foster the growth and development of the arts in Saint Augustine by providing a reciprocal exhibition to the public. The Arts and Crafts Festival continues to be a major event sponsored biannually by the Saint Augustine Art Association. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Gladys V. Mitchell was born in Albuquerque, New Mexico, and was a member of the Santa Fe Artist Colony. She is best known for her Modernist landscape paintings of pueblos and figurative paintings of Native Americans. She worked in oil, watercolor and woodcut/woodblock. Mitchell experimented with material, color and texture. She painted with a vivid palette and began to introduce sand into her oils. This still life is printed from etched lucite. Unlike etching on traditional materials like copper, etching on lucite creates a strong textural effect; the image appears almost embossed. While a resident of Saint Augustine, Florida, Mitchell molded plastics into jewelry, which she sold from her home on Charlotte Street in the historic downtown. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Originally from Pennsylvania, Harold Etter was a member of the Saint Augustine Art Association, and one of the Lost Colony artists. He worked in oils and watercolors, most often painting coastal landscapes. Though not well known outside of Saint Augustine, Florida, Etter taught classes in drawing and composition, and lectured on “Planning a Picture” at the Arts Club (now known as the Saint Augustine Art Association). His Impressionistic style coincided with the new direction taken by the Arts Club in the 1940s. Robert Torchia states in Lost Colony: The Artists of St. Augustine, 1930-1950 that “the modernist faction’s influence [had] declined… as the Arts Club leadership became more conservative and the business community sought to attract more traditional artists to St. Augustine.” The Arts Club members tended to favor Impressionism and Regionalism. They found the landscapes and cityscapes appealed to the tourist market of Saint Augustine. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Harold S. Maddocks’ oil painting of Spuds represents a small potato-farming community west of Saint Augustine, Florida. The artist was a landscape and seascape painter who worked in the conservative Impressionist style. Born in Gloucester, Massachusetts, Maddocks was educated at the Massachusetts Normal School in Boston. Maddocks was an active member of both the Rockport Art Association and the Saint Augustine Arts Club. The artist offered weekly outdoor sketch classes at the Arts Club (now known as the Saint Augustine Art Association). © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Heinrich Pfeiffer was born in Pennsylvania and studied at the Art Students League of New York with traditional landscape painter John Carlson. He continued his studies at the Pennsylvania Academy of Fine Arts. Pfeiffer is best known for his colorful landscapes and coastal views painted in an Impressionist style. Pfeiffer maintained a strong presence in both the Florida and Provincetown, Massachusetts, art communities. The winters were spent in temperate Saint Augustine, Florida, where the artist worked from his studio located within the Old Fatio House garden in the historic downtown. Later in life, Pfeiffer offered outdoor oil and watercolor painting instruction at the Norton Art School in Palm Beach, Florida. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image J. (Julian) Courtenay Hunt was a versatile artist who worked in oils, pen and ink and pastels. His works include portraits, still lifes and landscapes. His color palette often explored the vivid shades of purple and red, as exemplified in this oil painting. Hunt received his art education at the Ringling College of Art and Design and art training under Jerry Farnsworth in Cape Cod. Hunt exhibited one-man shows at the Palm Beach Gallery and at the Cummer Museum of Art and Gardens in Jacksonville, Florida. He contributed to shows at the Norton Gallery in Palm Beach, the National Academy Gallery in New York and the Society of the Four Arts in Palm Beach, Florida. Hunt has pieces in the collection of the University of Florida and the Jacksonville Historical Society. The artist was also commissioned to paint a portrait of Andrew Jackson for the Jacksonville City Hall. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image John Pratten was a college professor and painter whose work decorates the Sea World entrance in Orlando, Florida. He married Daisy Bruce in 1924, and they settled in Poughkeepsie, New York. The Prattens were very active supporters of the Duchess County Art Association in New York. John Pratten created display advertising and taught portrait and landscape painting. During the 1940s and 50s, the couple managed the Wayman Adams summer art school in Elizabethtown, New York. The Prattens later moved to Saint Augustine, Florida, where John conducted art classes (which were attended by the painting’s model Frances Howatt) and was active in the city’s Art Association. Pratten served on the jury of many competitive shows held at the Association. Throughout his career, he garnered many awards for his excellence in portraiture. In 1955, he authored the book Portrait Painting for Beginners. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Lorana Rogers was a scholarly artist. She studied at the Pratt Institute of New York, New York University, Columbia University and Cornell University. Until her retirement, Rogers spent twenty-five years as an art teacher in the New York City public schools. The artist exhibited her work at her studio in Alcott, New York. As a winter resident of Saint Augustine, Florida, Rogers was a member of the Saint Augustine Art Association and offered watercolor painting classes while in town. She exhibited her works at The Brush and Palette gallery, alongside other Lost Colony artists such as Tod Lindenmuth, William L’Engle and E.B. Warren. The Spanish coquina fort (Castillo de San Marcos) was a favored spot for the Lost Colony artists’ plein air excursions. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Bostonian Louis Kronberg studied art at the School of the Museum of Fine Arts in Boston and the Art Students League in New York. He spent much of his career in France, purchasing art for Isabella Stewart Gardner of the Gardner Museum in Boston. Upon returning to the States, he became a prominent artist in Cape Ann, Massachusetts. One can’t help but surmise that Kronberg visited the exhibits of Frenchman Edgar Degas. This pastel draws direct comparisons to Degas’ Ballet series in both style and subject matter. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Louise W. Shanks was born in Massachusetts and schooled in New England. Shortly after the premature death of her husband, she moved to Saint Augustine, Florida and became a member of the Saint Augustine artist colony. Shanks worked in oils and is notable for her landscape and figurative paintings. She was a Representational artist until the 1940s, when she joined the Modernist faction of the Saint Augustine Arts Club (now known as the Saint Augustine Art Association), along with fellow local artists William L’Engle and Tod Lindenmuth. The “Bal Masque” represents the first annual Beaux Art Ball, held in the Lightner Museum in 1949. The event was sponsored by the Association to raise money for its building fund. The theme of the ball was “A Night in Fairyland.” The figure in the red suit in the foreground won the prize for “most amusing costume” for her rendition of the Devil’s wife. This painting of Shanks’ is featured on the cover of Robert Torchia’s book Lost Colony: The Artists of St. Augustine, 1930-1950. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Nunzio Vayana was born in Castelvetrano, Italy. He studied medicine and then art at the University of Rome. He immigrated to the United States in 1903, initially settling in Hartford, Connecticut. In the 1920s, Vayana founded the Ogunquit Art Center in Maine and served as its director for many years. Vayana made his debut in Saint Augustine, Florida, in 1932. Then-President of the Saint Augustine Arts Club, Ralph Hillbom extended an invitation for the artist to hold a private two-week exhibition. This exclusive showing was held in the Davenport Park Clubhouse and featured 100 of Vayana’s paintings. After the exhibition, Vayana continued to be relevant in Saint Augustine; however, his efforts were directed southward to Palm Beach, Florida, where he established the Palm Beach Art Center in the late 1930s. His intention for the art center was to provide assistance to other artists and a cultural outlet for the public. Throughout his prolific career, Vayana remained an Impressionist painter, working primarily in small scale. The images in his art are pleasant, idyllic marine scenes, landscapes and portraits. A tell-tale identifier of a Vayana painting is his signature, which appears in red paint. Vayana immersed himself in the art lifestyle as a painter, etcher, teacher, promoter and fine art collector. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. View full image Ralph Hillbom was employed as a commercial artist for the Saint Augustine, Florida, local daily newspaper The Record. In the 1920s, Hillbom settled in Florida, and through the Arts Club (now known as the Saint Augustine Art Association), produced and promoted art. He has the distinction of serving as the Saint Augustine Arts Club’s first president, beginning his term in late 1931. He delivered the mission of the Arts Club, announcing, “Painters, sculptors, writers, musicians, all the arts are welcome in the membership of the club. They will be most welcome, either local artists or those from out of the city. It will be our particular duty to attract outsiders here, and give them opportunities for local acquaintanceships, and a club home.” (Torchia, Robert. Lost Colony: The Artists of St. Augustine, 1930-1950, p.11) Earlier in his career, Hillbom had been associated with the Woodstock artists. He painted the landscapes of Monhegan Island off the coast of Maine with other Woodstock artists, such as Walter Koeniger. The Woodstock community was regarded as a source of high-quality art during the decade of the Great Depression. His painting style was Realistic and Representational. The subject of his oils was most often natural inland or coastal scenery. Hillbom’s work is also represented in the Lightner Museum, a collection that showcases the works of America’s Gilded Age. © All images owned and copyright protected by the St. Augustine Art Association. Reproductions for educational use by written permission of the St. Augustine Art Association only. Please contact info@staaa.org or 904.824.2310 to place a request. 22 Marine Street, St. Augustine, FL 32084 info@staaa.org 904.824.2310 ABOUT ABOUT STAAA Board Become a Member LINKS Donate Join our Mailing List Privacy Policy TERMS of SERVICE CAREERS ART Current Exhibit Permanent Collection SHOP First Friday Art Walk LEARN TOUCH ST. AUGUSTINE Figure Drawing Workshops & Classes The St. Augustine Art Association is partially funded by grants from the St. Johns County Tourist Development Council, the St. Johns Cultural Council , the Community Foundation for Northeast Florida ‘s Crisp-Ellert Fund, and the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, the National Endowment for the Arts, and the Benjamin & Jean Troemel Arts Foundation. © 2021 ST. AUGUSTINE ART ASSOCIATION, A 501 (C)(3) NONPROFIT ALL RIGHTS RESERVED. SITE BY:  AVID DESIGN GROUP LLC"
    },
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/st-augustine-art-association",
      "text": "St. Augustine Art Association | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search St. Augustine Art Association A gallery and museum promoting artistic excellence for 100 years. St. Augustine Art Association (904) 824-2310 At the corner of Cadiz & Marine. 22 Marine Street St. Augustine, FL 32084 Currently open. Mon: Closed Tue - Sun: 12:00 pm - 4:00 pm Open from 5:00 to 7:30 p.m. during First Friday Art Walks View Google Map Share This +2 more The St. Augustine Art Association, established in 1924, continues a history of local art that dates back to the 1500s when Jacques LeMoyne used his artistic talents to document the new world for the French king. Much later, artists who wintered in Florida were encouraged to form the Pen and Brush Club, founded by Nina Hawkins, Editor of the St. Augustine Record . Later the organization became known as the Galleon Club and eventually, they were allowed to use the Waterworks Building as a gallery. This group of local artists and business owners successfully promoted the city as a destination for artists in the 1930s, and moved to their present location in 1954. Now, hosting a variety of exhibits and programs throughout the year — including juried exhibits of local art, a plein air painting event, and summer art camps — the Association is foundational to local, national, and international artists. Located at 22 Marine Street, it is both a gallery and a museum, and continues to promote the arts and draw artists to the region. This 5,000 square-foot gallery is open to the public and serves as the community's premier art center, providing a gathering place for art workshops, lectures, children's programs, art camps, concerts, art walks, and special events. Their permanent collection includes works by the \"Lost Colony,\" founders of the Galleon Club, as well as art featuring people and places in St. Augustine. Many of the works in their permanent collection are periodically featured to complement juried exhibits. Each year in November, the organization presents the St. Augustine Art Association Art and Craft Festival , attracting artists and visitors from around the country. Every month throughout the year, STAAA participates in the city's First Friday Art Walk . Admission to the St. Augustine Art Association is free. Upcoming Live Music Jeremy Price Monday, September 15th, 2025 5:00 pm - 7:00 pm Upcoming Events Event Date Time Fall Members Art Show Today, September 11th, 2025 12:00 pm - 4:00 pm Fall Members Art Show Tomorrow, September 12th, 2025 12:00 pm - 4:00 pm Fall Members Art Show Saturday, September 13th, 2025 12:00 pm - 4:00 pm Plein Air in the Park Sunday, September 14th, 2025 12:00 pm - 5:00 pm Fall Members Art Show Sunday, September 14th, 2025 12:00 pm - 4:00 pm Fall Members Art Show Tuesday, September 16th, 2025 12:00 pm - 4:00 pm Fall Members Art Show Wednesday, September 17th, 2025 12:00 pm - 4:00 pm Fall Members Art Show Thursday, September 18th, 2025 12:00 pm - 4:00 pm The Making of St. Augustine's Artist Community Thursday, September 18th, 2025 6:30 pm - 8:00 pm Fall Members Art Show Friday, September 19th, 2025 12:00 pm - 4:00 pm Pagination Page 1 Next page Next › St. Augustine Art Association (904) 824-2310 At the corner of Cadiz & Marine. 22 Marine Street St. Augustine, FL 32084 Currently open. Mon: Closed Tue - Sun: 12:00 pm - 4:00 pm Open from 5:00 to 7:30 p.m. during First Friday Art Walks Share This Profile Keywords Museums Art Galleries Historic Downtown First Friday art. local classes camps Restaurants nearby O.C. White's Restaurant within 1 block Chatsworth Pub and Tea Room within 1 block Gaufre's & Goods 0.1 miles South-A-Philly Steaks & Hoagies 0.1 miles Places to Stay nearby Victorian House within 1 block Marion Motor Lodge within 1 block Casa de Solana within 1 block Bella Bay Inn within 1 block Related categories Attractions Tour Services Shopping Live Music Nightlife Recreation Weddings Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    },
    {
      "url": "https://www.usa.edu/about/contact-us/",
      "text": "Contact Us | USAHS Featured Programs Pages Events Faculty University Administration Posts Programs Pages Events Faculty University Administration Posts Careers @ USA For Alumni For Current Students Request Information Apply Now Featured Programs Pages Events Faculty University Administration Posts Programs Pages Events Faculty University Administration Posts Explore Our Programs College of Rehabilitative Sciences Occupational Therapy Programs Master of Occupational Therapy (MOT) Doctor of Occupational Therapy (OTD) Post-Professional Doctor of Occupational Therapy (PPOTD) College of Health Sciences Master of Health Administration (MHA) Doctor of  Education (EdD) Graduate Certificates Continuing Professional Education Clinical Orthopedic Residency (OCS) Continuing Professional Education (CPE) Physical Therapy Programs Doctor of Physical Therapy (DPT) Non-Degree Physical Therapy Online Courses Speech-Language Pathology Program (MS-SLP) School of Nursing Post-Graduate Nursing Certificates Master of Science in Nursing (MSN) Doctor of Nursing Practice (DNP) Browse All Degree-Programs Student Experience Student Services For Prospective Students For Admitted Students For Current Students For Alumni Campus Life San Marcos, California St. Augustine, Florida Miami, Florida Austin, Texas Dallas, Texas Why USAHS EdTech Tools Immersive Clinical Simulation Labs Modern Learning Spaces Dynamic Blended Learning Module Interprofessional Education Pro Bono Experiences National Network of Faculty Admissions & Aid Admissions & Aid Home Scholarships & Grants How to Apply Cost of Attendance Financial Aid Application Deadlines Academic Calendar Admissions FAQs Catalog/Handbook About Essential Information Our History Accreditation B Corp Certified Student Achievement Data Institutional Learning Outcomes (ILOs) News USAHS Shop Explore All Campuses San Marcos, California St. Augustine, Florida Miami, Florida Austin, Texas Dallas, Texas People Our Faculty Leadership Board of Directors Alumni Careers Events Blog Request Information Apply Now Featured Programs Pages Events Faculty University Administration Posts Programs Pages Events Faculty University Administration Posts Search for: Search Close Explore Our Programs College of Rehabilitative Sciences Occupational Therapy Programs Master of Occupational Therapy (MOT) Doctor of Occupational Therapy (OTD) Post-Professional Doctor of Occupational Therapy (PPOTD) College of Health Sciences Master of Health Administration (MHA) Doctor of  Education (EdD) Graduate Certificates Continuing Professional Education Clinical Orthopedic Residency (OCS) Continuing Professional Education (CPE) Physical Therapy Programs Doctor of Physical Therapy (DPT) Non-Degree Physical Therapy Online Courses Speech-Language Pathology Program (MS-SLP) School of Nursing Post-Graduate Nursing Certificates Master of Science in Nursing (MSN) Doctor of Nursing Practice (DNP) Browse All Degree-Programs Student Experience Student Services For Prospective Students For Admitted Students For Current Students For Alumni Campus Life San Marcos, California St. Augustine, Florida Miami, Florida Austin, Texas Dallas, Texas Why USAHS EdTech Tools Immersive Clinical Simulation Labs Modern Learning Spaces Dynamic Blended Learning Module Interprofessional Education Pro Bono Experiences National Network of Faculty Admissions & Aid Admissions & Aid Home Scholarships & Grants How to Apply Cost of Attendance Financial Aid Application Deadlines Academic Calendar Admissions FAQs Catalog/Handbook About Essential Information Our History Accreditation B Corp Certified Student Achievement Data Institutional Learning Outcomes (ILOs) News USAHS Shop Explore All Campuses San Marcos, California St. Augustine, Florida Miami, Florida Austin, Texas Dallas, Texas People Our Faculty Leadership Board of Directors Alumni Careers Events Blog Request Information Apply Now Careers @ USA For Alumni For Current Students Request Information Apply Now USAHS Contact Us Please complete our contact form. Our dedicated staff will reach out to provide information and answer your questions. San Marcos, CA Campus 700 Windy Point Drive San Marcos, CA 92069 St. Augustine, FL Campus 1 News Place St. Augustine, FL 32086 Miami, FL Campus Douglas Entrance North Tower 800 S. Douglas Road, Suite 149 Coral Gables, FL 33134 Austin, TX Campus 5401 La Crosse Ave Austin, TX 78739 Dallas, TX Campus 901 W Walnut Hill Lane, Suite 210A Irving, Texas 75038 General Inquiries : (800) 241-1027 Enrollment and Admissions : (855) 481-9203 Media Inquiries : (737) 202-3234 Fax : (904) 826-0085 Why USAHS Our History Innovative Learning Model B Corp Certified Leadership Our Faculty Explore Our Programs College of Rehabilitative Sciences College of Health Sciences Continuing Professional Education Student Services For Prospective Students For Admitted Students For Current Students For Alumni Admissions & aid How to Apply Admissions FAQs Application Deadlines Financial Aid Important Resources Contact Us MyUSA Webmail Library USAHS Shop Complaints Catalog/Handbook Careers @ USA Media Resources State Licensure © Copyright 2025 University of St. Augustine for Health Sciences Legal and Consumer Disclosures Title IX / Safety & Security Privacy Policy Program Data Accreditation"
    },
    {
      "url": "https://www.staaa.org/visit/",
      "text": "Visit – St. Augustine Art Association Skip to content Skip to footer GALLERY HOURS: TUE - SUN, 12PM TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour DONATE About About STAAA Staff & Board Planned Giving Sponsors & Partners News Careers Join Membership Volunteer Art Gallery Membership Join our Mailing List Shop Original Artwork Visit GALLERY HOURS: TUE - SUN, 12pm TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour Visit SHOP DONATE Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour ABOUT VISIT Plan Your Trip Around the Arts HISTORY STAFF & BOARD Planned Giving ART CURRENT EXHIBIT: Fall Members Show STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work CALLS FOR ART Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibition All Calls for Art EXHIBIT GUIDELINES EVENTS FIRST FRIDAY ART WALK Plein Air in the Park 2026 French River Cruise ADULT PROGRAMS MONDAY NIGHT FIGURE DRAWING Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air YOUTH PROGRAMS Kids Summer Art Camps PERMANENT COLLECTION DRAKE’S RAID EXHIBIT MARGUERITE CASTAING JEAN TROEMEL JOIN MEMBERSHIP VOLUNTEER SPONSORS / PARTNERS Gallery Membership SHOP Welcome to the St. Augustine Art Association MAKING ART HISTORY 22 Marine Street, St. Augustine, FL 32084 (904) 824-2310 info@staaa.org Find With Google Map Visitor Info Gallery Hours Tues – Sun Free Admission 12 p.m. – 4 p.m. First Friday Art Walk Every First Friday of the Month 5 p.m. – 8 p.m. Parking: Metered parking along Marine Street and Bayfront, downtown public & private lots For information on exhibits, events and activities taking place at the St. Augustine Art Association, see below or click here to jump to our Exhibit & Event Calendar. Upcoming Exhibitions View All Exhibitions Out of Place February 6, 2026 - March 1, 2026 Something doesn’t quite look right…trying to fit in, but just not getting footing, social narratives, seemingly unnatural acts of nature, humorous or serious. A cat at doggy daycare. A fish in the desert. For this exhibit, artists are encouraged to create images that question the normal, that push the boundaries of what “should” be and build a world of acceptance, letting go of apprehension. More info Faces & Figures January 2, 2026 - February 2, 2026 Expressions of the human form bring personality to this exhibit. Drawing studies, formal portraits, everyday life subjects and other figures are presented in 2D & 3D media. More info Fantastic Florida November 7, 2025 - December 28, 2025 The Sunshine State shines here! This vivid display explores a wide range of artistic interpretations and scenes of Florida, from the plants and animals to the wilderness and waterways, to the people and places. Gallery Closed: Nov. 27; Dec. 23-26, January 1. More info 22 Marine Street, St. Augustine, FL 32084 info@staaa.org 904.824.2310 ABOUT ABOUT STAAA Board Become a Member LINKS Donate Join our Mailing List Privacy Policy TERMS of SERVICE CAREERS ART Current Exhibit Permanent Collection SHOP First Friday Art Walk LEARN TOUCH ST. AUGUSTINE Figure Drawing Workshops & Classes The St. Augustine Art Association is partially funded by grants from the St. Johns County Tourist Development Council, the St. Johns Cultural Council , the Community Foundation for Northeast Florida ‘s Crisp-Ellert Fund, and the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, the National Endowment for the Arts, and the Benjamin & Jean Troemel Arts Foundation. © 2021 ST. AUGUSTINE ART ASSOCIATION, A 501 (C)(3) NONPROFIT ALL RIGHTS RESERVED. SITE BY:  AVID DESIGN GROUP LLC"
    },
    {
      "url": "https://www.staaa.org/donate/",
      "text": "Donate – St. Augustine Art Association Skip to content Skip to footer GALLERY HOURS: TUE - SUN, 12PM TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour DONATE About About STAAA Staff & Board Planned Giving Sponsors & Partners News Careers Join Membership Volunteer Art Gallery Membership Join our Mailing List Shop Original Artwork Visit GALLERY HOURS: TUE - SUN, 12pm TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour Visit SHOP DONATE Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour ABOUT VISIT Plan Your Trip Around the Arts HISTORY STAFF & BOARD Planned Giving ART CURRENT EXHIBIT: Fall Members Show STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work CALLS FOR ART Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibition All Calls for Art EXHIBIT GUIDELINES EVENTS FIRST FRIDAY ART WALK Plein Air in the Park 2026 French River Cruise ADULT PROGRAMS MONDAY NIGHT FIGURE DRAWING Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air YOUTH PROGRAMS Kids Summer Art Camps PERMANENT COLLECTION DRAKE’S RAID EXHIBIT MARGUERITE CASTAING JEAN TROEMEL JOIN MEMBERSHIP VOLUNTEER SPONSORS / PARTNERS Gallery Membership SHOP Make a Donation The St. Augustine Art Association appreciates support from corporate sponsors, individuals and grant makers. View the different ways that you can make a donation below — and complete the online donation form at the bottom of the page. Donations in the form of a check can be made out to the St. Augustine Art Association and mailed to 22 Marine Street, St. Augustine, FL 32084. Click Here to Jump to the Donation Form 100th Anniversary Founders Fund for the Future Consider making your mark on St. Augustine’s Art History by contributing to our Founders Fund for the Future. Through this fund, we will establish support revenue for exhibit awards, educational programs, new exhibits, staffing, and so much more. When completing the online donation form, type “Founders Fund for the Future” into the donation memo. Planned Giving Through the Art of Giving , you can join your legacy to ours by providing support that will ensure the continuation of this vibrant, living cultural institution. Click to Learn More About Planned Giving Sponsorship Opportunities The St. Augustine Art Association is always looking to guide the advancement of art in partnership with the community. Support the arts and our yearly programming through our Gallery Sponsorships! Click to Learn More About Sponsorships Online Donation Form The St. Augustine Art Association is a 501(c)(3) tax-exempt nonprofit organization. For more information about planned giving and donations, please e-mail us: info@staaa.org , or call us directly at 904-824-2310, and we’d be glad to speak to you. *Consult your tax advisor for all deductions. Name * First Last Address * Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Phone * Email * Donation Amount * Donation Memo Credit Card * If you have trouble inputting the Cardholder Name, click the very far left of the field or press the \"tab\" key on your computer keyboard. For mobile devices and tablets, click on the words \"Cardholder Name\". Card Details Cardholder Name Facebook This field is for validation purposes and should be left unchanged. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-HELP-FLA OR ONLINE AT www.FloridaConsumerHelp.com , REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.” REGISTRATION #: CH 26748 This organization is a platinum-level GuideStar participant, demonstrating its commitment to transparency. 22 Marine Street, St. Augustine, FL 32084 info@staaa.org 904.824.2310 ABOUT ABOUT STAAA Board Become a Member LINKS Donate Join our Mailing List Privacy Policy TERMS of SERVICE CAREERS ART Current Exhibit Permanent Collection SHOP First Friday Art Walk LEARN TOUCH ST. AUGUSTINE Figure Drawing Workshops & Classes The St. Augustine Art Association is partially funded by grants from the St. Johns County Tourist Development Council, the St. Johns Cultural Council , the Community Foundation for Northeast Florida ‘s Crisp-Ellert Fund, and the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, the National Endowment for the Arts, and the Benjamin & Jean Troemel Arts Foundation. © 2021 ST. AUGUSTINE ART ASSOCIATION, A 501 (C)(3) NONPROFIT ALL RIGHTS RESERVED. SITE BY:  AVID DESIGN GROUP LLC"
    },
    {
      "url": "https://historiccoastculture.com/venue/st-augustine-art-association/",
      "text": "St. Augustine Art Association - HistoricCoastCulture.com St. Augustine Art Association - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Venue Type Amphitheatre Amusement Park Bar/Tavern Bookstore Business/Company Campground Church College/University Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Golf Club Historic Building/Landmark Hotel/Inn Library Meeting Space Movie Theater Museum Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater Zoo State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue St. Augustine Art Association Facebook Twitter Linkedin Print St. Augustine Art Association Located in the Historic District of the nation’s oldest city, the Association produces monthly juried exhibits of works by emerging and professional artists as well as the annual Thanksgiving Art & Craft Festival. The art gallery serves as the community’s cultural hub, housing a collection of “Lost Colony” art and providing a gathering place for workshops, lectures, children’s programs, concerts and special events. Located in the Historic District of the nation’s oldest city, the Association produces monthly juried exhibits of works by emerging and professional artists as well as the annual Thanksgiving Art & Craft Festival. The art gallery serves as the community’s cultural hub, housing a collection of “Lost Colony” art and providing a gathering place for workshops, lectures, children’s programs, concerts and special events. View less MORE ABOUT THIS VENUE Venue Type: Gallery LOCATION St. Augustine Art Association 22 Marine Street, St. Augustine, FL 32084 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette UPCOMING EVENTS PAST EVENTS Pastel Landscape Painting Workshop (with Cynthia Pierson) Presented by St. Augustine Art Association at St. Augustine Art Association Sep 23 - Sep 24, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Annual Fall Members Show Presented by St. Augustine Art Association at St. Augustine Art Association Sep 5 - Sep 28, 2025 Facebook Twitter Linkedin Séance Sketches Workshop (with Nikki Rakov) Presented by St. Augustine Art Association at St. Augustine Art Association Oct 30, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Tactile Art Show Presented by St. Augustine Art Association at St. Augustine Art Association Oct 3 - Nov 2, 2025 Facebook Twitter Linkedin Painting Fall en Plein Air Workshop (with Martha Ferguson) Presented by St. Augustine Art Association at St. Augustine Art Association Nov 13 - Nov 15, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION SHOW MORE Founders Day St. Augustine Plein Air Paint Out Presented by St. Augustine Art Association and St. Johns Cultural Council at St. Augustine Art Association Sep 5 - Sep 8, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION What We See in the Shadows Presented by St. Augustine Art Association at St. Augustine Art Association Jul 17 - Aug 31, 2025 Facebook Twitter Linkedin Summer Art Camps Presented by St. Augustine Art Association at St. Augustine Art Association Jun 16 - Aug 1, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Annual Honors Show Presented by St. Augustine Art Association at St. Augustine Art Association Jun 6 - Jul 6, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Here and There Presented by St. Augustine Art Association at St. Augustine Art Association May 2 - Jun 1, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION SHOW MORE Contact information Email / Website / 22 Marine Street, St. Augustine, FL 32084 904-824-2310 Find A Venue Search by Keyword Venue Type Amphitheatre Amusement Park Bar/Tavern Bookstore Business/Company Campground Church College/University Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Golf Club Historic Building/Landmark Hotel/Inn Library Meeting Space Movie Theater Museum Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater Zoo State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access Featured Venues Lightner Museum With sparkling crystal chandeliers, intricate mosaic tile flooring, majestic arched windows, and carved wooden staircases, Lightner Museum is a show-stopper! The museum opened in 1948, displaying the collections of Otto C. Lightner, which include 19th-century artwork, glassware, sculpture, furniture, stained glass, and antique chandeliers throughout the three floors of exhibits. Originally built as the Hotel Alcazar in 1888 by Standard Oil co-founder Henry Flagler, this beautiful structure was created in the Spanish Renaissance Revival Style. In addition to the Lightner Museum, it also houses St. Augustine City Hall, several antique shops, and Cafe Alcazar, a restaurant that sits in the location of what was once the world’s largest indoor swimming pool. Beluthahatchee Park Beluthahatchee Park is a four-acre park located within the 70-acre tract of land purchased by Stetson Kennedy in 1948 after the 18-acre Beluthahatchee Lake was created by impounding Mill Creek in 1945. This lake meanders through a natural basin and is surrounded by high bluffs, currently owned by the Lake Dwellers Association, a non-profit Florida corporation formed by the lakefront residents. In 1949, the 70-acre tract was subdivided and platted by the owner/developer Stetson Kennedy who recorded the restrictive covenants setting aside land in perpetuity as a wildlife refuge, and stipulating that residential construction be consistent with the developer’s goal of “serving as a working demonstration that human and natural habitat need not be mutually exclusive, but can coexist in harmony.” DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.staaa.org/touch/sculpture-garden/",
      "text": "Sculpture Garden – Touch STA Primary Menu Skip to content Audio Tour About Sculpture Garden Support STAAA Touch STA Enhancing Public Art Accessibility in the Nation's Oldest City Primary Menu Skip to content Audio Tour About Sculpture Garden Support STAAA SAINT AUGUSTINE ART ASSOCIATION TOUCH SCULPTURE GARDEN The seed for the TOUCH Saint Augustine Sculpture Garden at the Saint Augustine Art Association was planted over 15 years ago when the first Tactile Art Show was installed in the gallery. The exterior renovation was undertaken in 2015 as a legacy project for Saint Augustine’s 450th Anniversary. Two public sculptures that honor the past and embrace the future were commissioned for the project. The first stop on the citywide TOUCH Saint Augustine Braille Trail, the outdoor gathering space engages the senses and inspires all to explore the town’s rich artistic heritage. Visit the Saint Augustine Art Association at 22 Marine Street, Saint Augustine, FL 32084. Admission is free. Take a closer look! Spaces in the Sculpture Garden represent the phases of the creative process: Inspiration, Exploration, Realization. The Inspiration Gathering Garden offers curved benches to rest, reflect and interact. The Exploration Plaza architecturally connects the interior and exterior spaces. Sphere-shaped planters, modeled after the “Old Spanish Trail” marker, represent the four corners of the globe. The gallery wings embrace visitors as they approach the entry, and the arched windows frame the historic Art y Facts of Drake’s Raid archaeology exhibit within. The two large sculptures perched above Rain Gardens in the public landscape represent the Realization of an idea. The contrasting works symbolize the past and future. Interpretive TOUCH Braille markers for each sculpture provide descriptions for the blind. Doorways to Creativity ADA pathways and stairs along Marine Street lead to the Loggia Galleria, a covered breezeway and intimate space for temporary exhibitions. The Old Town Landing on Charlotte Street attracts pedestrians from Aviles Street and the popular monthly Art Walks. Sculptures in the Garden “Heavenly Bodies” Flagler College Professor Emeritus, Enzo Torcoletti’s “Heavenly Bodies” is an abstract figurative stone sculpture that is a metaphor for the creative process and a symbol of the first contact between the Old and New Worlds. It is a bold statement that challenges the viewer to contemplate how ideas are formed and new worlds are born. “Signal From Shore” Acclaimed sculptor, Richard Weaver’s vision of a young Native American child eagerly signaling a boat to shore comes to life in his figurative bronze sculpture. “Signal From Shore” is a poignant tribute to the native people whose labors and sacrifice helped shape a new civilization. These public works of art transform the landscape and serve as beacons, guiding all to the Saint Augustine Art Association, the town’s cultural epicenter. From here, visitors may begin their exploration of St. Augustine’s rich artistic heritage and the citywide Braille Trail. Footer Menu Audio Tour About Sculpture Garden Support STAAA CONTACT US 22 MARINE STREET, ST. AUGUSTINE, FL 32084 904.824.2310  | WWW.STAAA.ORG | INFO@STAAA.ORG A 501(C)3 NON PROFIT ART ORGANIZATION © 2016 St. Augustine Art Association GALLERY HOURS TUE - SAT 12-4PM SUN 2-5PM MON CLOSED"
    },
    {
      "url": "https://www.staaa.org/contact/",
      "text": "Contact – St. Augustine Art Association Skip to content Skip to footer GALLERY HOURS: TUE - SUN, 12PM TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour DONATE About About STAAA Staff & Board Planned Giving Sponsors & Partners News Careers Join Membership Volunteer Art Gallery Membership Join our Mailing List Shop Original Artwork Visit GALLERY HOURS: TUE - SUN, 12pm TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour Visit SHOP DONATE Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour ABOUT VISIT Plan Your Trip Around the Arts HISTORY STAFF & BOARD Planned Giving ART CURRENT EXHIBIT: Fall Members Show STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work CALLS FOR ART Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibition All Calls for Art EXHIBIT GUIDELINES EVENTS FIRST FRIDAY ART WALK Plein Air in the Park 2026 French River Cruise ADULT PROGRAMS MONDAY NIGHT FIGURE DRAWING Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air YOUTH PROGRAMS Kids Summer Art Camps PERMANENT COLLECTION DRAKE’S RAID EXHIBIT MARGUERITE CASTAING JEAN TROEMEL JOIN MEMBERSHIP VOLUNTEER SPONSORS / PARTNERS Gallery Membership SHOP Our Location: 22 Marine Street St. Augustine, FL 32084 www.staaa.org 904-824-2310 info@staaa.org Gallery Hours: Tue-Sun: 1pm to 4pm Closed on Mondays Free Admission 22 Marine Street, St. Augustine, FL 32084 info@staaa.org 904.824.2310 ABOUT ABOUT STAAA Board Become a Member LINKS Donate Join our Mailing List Privacy Policy TERMS of SERVICE CAREERS ART Current Exhibit Permanent Collection SHOP First Friday Art Walk LEARN TOUCH ST. AUGUSTINE Figure Drawing Workshops & Classes The St. Augustine Art Association is partially funded by grants from the St. Johns County Tourist Development Council, the St. Johns Cultural Council , the Community Foundation for Northeast Florida ‘s Crisp-Ellert Fund, and the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, the National Endowment for the Arts, and the Benjamin & Jean Troemel Arts Foundation. © 2021 ST. AUGUSTINE ART ASSOCIATION, A 501 (C)(3) NONPROFIT ALL RIGHTS RESERVED. SITE BY:  AVID DESIGN GROUP LLC"
    },
    {
      "url": "https://www.visitstaugustine.com/event/first-friday-art-walk",
      "text": "First Friday Art Walk | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search First Friday Art Walk A monthly celebration of art throughout St. Augustine's galleries. First Friday of each month | 5:00 p.m. - 9:00 p.m. First Friday Art Walk (904) 373-8697 Downtown and Anastasia Share This +2 more The next First Friday Art Walk is Friday, October 3, 2025. First Friday Art Walk On the first Friday of every month, more than 25 art galleries across St. Augustine open their doors for a city-wide celebration of art. From traditional oil paintings to metalwork, textiles, and photography, the First Friday Art Walk invites locals and visitors to explore the creativity of the nation's oldest city. Many participating galleries feature live demonstrations or have artists on hand to talk about their work. First Friday Art Walk runs from 5:00 to 9:00 p.m. in Historic Downtown and beyond—including King Street, Aviles Street, St. George Street, Uptown, Anastasia Island, and the San Sebastian District. The St. Augustine Art Association coordinates the event, in collaboration with local galleries and creative spaces. Have a featured artist or exhibit coming up? Email us to be included in our monthly highlights. September Highlights CEAM: Department of Visual Arts Faculty Exhibit Crisp-Ellert Art Museum presents the paintings of Flagler College Department of Arts faculty during this month's First Friday Art Walk. The exhibition features work by artists: Sarah Alexander, Luke Brodersen (and Future Friends), Diana Lodi, Jenna McDonald, Russell Maycumber, Laura Mongiovi, Patrick Moser, Natalie Novak, Sara Pedigo, Bernadette Rivell, Leslie Robison, Jason Schwab, and Chris Smith. The show also introduces new faculty members Samuel Aye-Gboyin, Ida Moraghebati, and Ron Edelen. Honoring Our Heritage at PAStA Fine Art Gallery PASta Fine Art Gallery presents a special \"Honoring Our Heritage\" exhibit during September's First Friday Art Walk. PAStA artists will display art work reflective of the city's Spanish heritage, old St. Augustine, and Aviles Street. Doorway of Dreams at Butterfield Garage Art Gallery Butterfield Garage Art Gallery presents \"Doorway of Dreams\" during September, showcasing the artwork of featured artist, Nikki Rakov. The exhibit explores the interplay between the seen and unseen and debuts during First Friday Art Walk from 5:00 to 9:00 p.m., with an artist talk at 6:00 p.m. Cathedral Basilica Concert 38 Cathedral Place | (904) 824-2806 Stop by the Cathedral Basilica between 6:00 and 7:00 p.m. for a free concert during Art Walk. These monthly performances offer a peaceful and inspiring break during your gallery stroll. Note: Exhibits featured on First Friday typically remain available during regular gallery hours throughout the month. Getting Around Free Shuttle with Old Town Trolley Enjoy the Art Walk without the parking hassle—Old Town Trolley provides **free transportation** from 6:00 to 9:00 p.m. during the First Friday Art Walk. Shuttles operate on a continuous 20 to 30-minute loop, connecting major gallery districts and key stops. To ride, just pick up a shuttle sticker at any participating gallery. Hop on or off at any of the following locations: San Sebastian Winery – 157 King Street Butterfield Garage & ArtBox – 137 King Street The Lightner Museum – 75 King Street Treasury on the Plaza – 24 Cathedral Place Shuttle service is available from February through November. Please note there is no shuttle in December or January. Parking Free and paid parking is available at San Sebastian Winery , the City Parking Garage , and various metered spots downtown. Metered parking now extends to 9:00 p.m. Participating Galleries Acacia Tree Gallery 11C Aviles Street Hours: 5:00 – 9:00 p.m. Gallery of oils, acrylics, photography, pastels, jewelry, and more. An Art Affair 11 14th Lane, Suite B Hours: 5:00 – 9:00 p.m. Work from renowned artists alongside pieces by local artist and owner Melodye Rouisse-Stimpel. Art Collective St. Augustine 51 Cordova Street Hours: 5:00 – 9:00 p.m. A collective with works in oil, pastel, clay, collage, and paper art. ArtBox 137 King Street Hours: 5:00 – 9:00 p.m. A creative space featuring fine art, jewelry, sculpture, furniture, and more. The Art Studio of St. Augustine Beach 370 A1A Beach Blvd Hours: 5:00 – 8:00 p.m. Beachside studio and gallery with paintings, pottery, and stained glass near the pier. Butterfield Garage Art Gallery 137A King Street Hours: 5:00 – 9:00 p.m. Contemporary art in a restored 1920s garage featuring a wide range of styles and media. CJK Art Gallery & Studio 212C Charlotte Street Hours: 5:00 – 8:00 p.m. Claire Kendrick's studio and gallery, featuring landscape, seascape, and still life paintings. Grand Bohemian Gallery 49 King Street Hours: 5:00 – 8:30 p.m. Part of the Kessler Collection, showcasing award-winning local and international artists. High Tide Gallery – Downtown 2 St. George Street #109 Hours: 5:00 – 9:00 p.m.. Showcasing the work of more than 40 local artists across a range of creative styles. James Coleman Signature Gallery 65 King Street Hours: 5:00 – 9:00 p.m. A signature series gallery showcasing international artists and jewelry designs. Joel Bagnal Goldsmith 11C Aviles Street Hours: 5:00 – 9:00 p.m. Handmade gold and silver jewelry for weddings, anniversaries, and special occasions. Maria Reyes-Jones Gallery 134 Riberia Street #103 Hours: 5:30 – 8:00 p.m. Joyful acrylic paintings by local artist Maria Reyes-Jones in her working studio. PASTA Fine Art Gallery 214 Charlotte Street Hours: 5:00 – 9:00 p.m. Artist-run space with a variety of media from oil and acrylic to glass and pottery. Plum Contemporary Gallery 10 Aviles Street Hours: 5:00 – 9:00 p.m. Gallery featuring more than 30 artists with a focus on bold, contemporary styles. Sea Spirits Gallery & Gifts 210 St. George Street C-2 Hours: 5:00 – 9:00 p.m. Blown glass, sea-themed fine art, sculptures, and coastal gifts. St. Augustine Art Association 22 Marine Street Hours: 5:00 – 8:00 p.m. Nonprofit gallery with monthly juried shows, art education programs, and historic works. First Friday Art Walk (904) 373-8697 Downtown and Anastasia Share This Profile Keywords Free Featured Events Arts & Culture Local Things to Do Historic Downtown Have a Question? Your Name Your Email Address Your Message Related Events Today Sep 11 CEAM: Department of Visual Arts Faculty Exhibit Monday - Saturday, Sep. 5 - Nov. 8, 2025 | Times Vary Experience the talents of Flagler College's visual arts faculty. Today Sep 11 Doorway of Dreams Exhibit Daily, Sept. 5 - 30, 2025 | Times Vary Explore the interplay between the seen and unseen. Tomorrow Sep 12 Ancient City Con 2025 Friday - Sunday, Sep. 12-14, 2025 | Times Vary Annual celebration of science fiction, anime, fantasy, horror, and gaming. Tomorrow Sep 12 Sing Out Loud Music Festival Sep. 5 - 28, 2025 | Select Days An annual September festival presenting local and national musicians around town. Tomorrow Sep 12 A Sing Out Loud Concert with Remedy Tree and Cori Moore Friday, Sep. 12, 2025 | 7:00 p.m. to 9:00 p.m. The first in a weekend of Sing Out Loud concerts celebrating Gamble Rogers. Saturday Sep 13 Two Days of Music Celebrating Gamble Rogers Saturday and Sunday, Sep. 13 and 14, 2025 | Times Vary Listen to local and regional musicians performing over two days. Related categories Featured Events Festivals Live Entertainment Arts & Culture Sports & Outdoors For Kids Historical Seasonal Show 3 more Show 3 less Food Local Things to Do Fundraisers Editor's Note: We encourage you to verify event times and details with the organizers, as they may change. Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    },
    {
      "url": "https://maymgt.com/contact-us/",
      "text": "Contact Us - May Management Services Inc. Skip to content Call Us: 904-461-9708 Email Us: sales@maymgt.com Resident Web Portal Access Access Your Account Services Community Association Management Community Association Financial Management Association Project Management Association Training Programs Contact Us About Us Vantaca FAQ’s Homeowner Resources MAY Management + Signal Restoration About MAY MAY Cares Careers Our Testimonials AvidPay-Strongroom Services Blog Location Jacksonville Management Services Jacksonville Florida Community Association Financial Management Services Jacksonville FL Association Project Management Services Jacksonville FL Training Programs Jacksonville FL Ponte Vedra Management Services Ponte Vedra FL Community Association Financial Management Services Ponte Vedra FL Association Project Management Services Ponte Vedra FL Training Programs Ponte Vedra FL St. Augustine Management Services St. Augustine FL Community Association Financial Management Services St. Augustine FL Association Project Management Services St. Augustine FL Training Programs St. Augustine FL Palm Coast Management Services Palm Coast FL Community Association Financial Management Services Palm Coast FL Association Project Management Services Palm Coast FL Training Programs Palm Coast FL Daytona Management Services Daytona FL Community Association Financial Management Services Daytona FL Association Project Management Services Daytona FL Training Programs Daytona FL Daytona Beach Management Services Daytona Beach FL Community Association Financial Management Services Daytona Beach FL Association Project Management Services Daytona Beach FL Training Programs Daytona Beach FL Orlando Management Services Orlando FL Community Association Financial Management Services Orlando FL Association Project Management Services Orlando FL Training Programs Orlando FL Apopka Management Services Apopka FL Community Association Financial Management Services Apopka FL Association Project Management Services Apopka FL Training Programs Apopka FL Cape Canaveral Management Services Cape Canaveral FL Community Association Financial Management Services Cape Canaveral FL Association Project Management Services Cape Canaveral FL Training Programs Cape Canaveral FL Vero Beach Management Services Vero Beach FL Community Association Financial Management Services Vero Beach FL Association Project Management Services Vero Beach FL Training Programs Vero Beach FL Melbourne Management Services Melbourne FL Community Association Financial Management Services Melbourne FL Association Project Management Services Melbourne FL Training Programs Melbourne FL Lake Mary Management Services Lake Mary FL Community Association Financial Management Services Lake Mary FL Association Project Management Services Lake Mary FL Training Programs Lake Mary FL Sanford Management Services Sanford FL Community Association Financial Management Services Sanford FL Association Project Management Services Sanford FL Training Programs Sanford FL Winter Garden Management Services Winter Garden FL Community Association Financial Management Services Winter Garden FL Association Project Management Services Winter Garden FL Training Programs Winter Garden FL Fort Myers and Naples Marco Island Management Services Marco Island FL Community Association Financial Management Services Marco Island FL Association Project Management Services Marco Island FL Training Programs Marco Island FL Naples Management Services Naples FL Community Association Financial Management Services Naples FL Association Project Management Services Naples FL Training Programs Naples FL Bonita Springs Management Services Bonita Springs FL Community Association Financial Management Services Bonita Springs FL Association Project Management Services Bonita Springs FL Training Programs Bonita Springs FL Estero Management Services Estero FL Community Association Financial Management Services Estero FL Association Project Management Services Estero FL Training Programs Estero FL Fort Myers Management Services Fort Myers FL Community Association Financial Management Services Fort Myers FL Association Project Management Services Fort Myers FL Training Programs Fort Myers FL Captiva Management Services Captiva FL Community Association Financial Management Services Captiva FL Association Project Management Services Captiva FL Training Programs Captiva FL Sanibel Island Management Services Sanibel Island FL Community Association Financial Management Services Sanibel Island FL Association Project Management Services Sanibel Island FL Training Programs Sanibel Island FL Services Community Association Management Community Association Financial Management Association Project Management Association Training Programs Contact Us About Us Vantaca FAQ’s Homeowner Resources MAY Management + Signal Restoration About MAY MAY Cares Careers Our Testimonials AvidPay-Strongroom Services Blog Location Jacksonville Management Services Jacksonville Florida Community Association Financial Management Services Jacksonville FL Association Project Management Services Jacksonville FL Training Programs Jacksonville FL Ponte Vedra Management Services Ponte Vedra FL Community Association Financial Management Services Ponte Vedra FL Association Project Management Services Ponte Vedra FL Training Programs Ponte Vedra FL St. Augustine Management Services St. Augustine FL Community Association Financial Management Services St. Augustine FL Association Project Management Services St. Augustine FL Training Programs St. Augustine FL Palm Coast Management Services Palm Coast FL Community Association Financial Management Services Palm Coast FL Association Project Management Services Palm Coast FL Training Programs Palm Coast FL Daytona Management Services Daytona FL Community Association Financial Management Services Daytona FL Association Project Management Services Daytona FL Training Programs Daytona FL Daytona Beach Management Services Daytona Beach FL Community Association Financial Management Services Daytona Beach FL Association Project Management Services Daytona Beach FL Training Programs Daytona Beach FL Orlando Management Services Orlando FL Community Association Financial Management Services Orlando FL Association Project Management Services Orlando FL Training Programs Orlando FL Apopka Management Services Apopka FL Community Association Financial Management Services Apopka FL Association Project Management Services Apopka FL Training Programs Apopka FL Cape Canaveral Management Services Cape Canaveral FL Community Association Financial Management Services Cape Canaveral FL Association Project Management Services Cape Canaveral FL Training Programs Cape Canaveral FL Vero Beach Management Services Vero Beach FL Community Association Financial Management Services Vero Beach FL Association Project Management Services Vero Beach FL Training Programs Vero Beach FL Melbourne Management Services Melbourne FL Community Association Financial Management Services Melbourne FL Association Project Management Services Melbourne FL Training Programs Melbourne FL Lake Mary Management Services Lake Mary FL Community Association Financial Management Services Lake Mary FL Association Project Management Services Lake Mary FL Training Programs Lake Mary FL Sanford Management Services Sanford FL Community Association Financial Management Services Sanford FL Association Project Management Services Sanford FL Training Programs Sanford FL Winter Garden Management Services Winter Garden FL Community Association Financial Management Services Winter Garden FL Association Project Management Services Winter Garden FL Training Programs Winter Garden FL Fort Myers and Naples Marco Island Management Services Marco Island FL Community Association Financial Management Services Marco Island FL Association Project Management Services Marco Island FL Training Programs Marco Island FL Naples Management Services Naples FL Community Association Financial Management Services Naples FL Association Project Management Services Naples FL Training Programs Naples FL Bonita Springs Management Services Bonita Springs FL Community Association Financial Management Services Bonita Springs FL Association Project Management Services Bonita Springs FL Training Programs Bonita Springs FL Estero Management Services Estero FL Community Association Financial Management Services Estero FL Association Project Management Services Estero FL Training Programs Estero FL Fort Myers Management Services Fort Myers FL Community Association Financial Management Services Fort Myers FL Association Project Management Services Fort Myers FL Training Programs Fort Myers FL Captiva Management Services Captiva FL Community Association Financial Management Services Captiva FL Association Project Management Services Captiva FL Training Programs Captiva FL Sanibel Island Management Services Sanibel Island FL Community Association Financial Management Services Sanibel Island FL Association Project Management Services Sanibel Island FL Training Programs Sanibel Island FL Resale Documents Homeowner Login Request a Proposal GET IN TOUCH Office Locations and Service Areas MAY Management Services Inc. SINCE 1988 REACH US Association Management Services In Florida Industry leaders in Community Association Management and Association Office Solutions. Subheading: Providing professional property and financial management to homeowners and condominium associations for over 33 years. Servicing: North Florida Jacksonville and all surrounding areas including Ponte Vedra, St. Augustine, Palm Coast, Daytona and Daytona Beach. Central Florida Apopka, Orlando, Cape Canaveral Southwest Florida Marco Island, Naples, Bonita Springs, Estero, Fort Myers, Captiva and Sanibel Island. Locations World Golf Village 475 West Town Place #112 St. Augustine, FL 32092 Phone: 904-940-1002 Fax: 904-940-1202 St. Augustine 5431 A1A S Ste 103 St. Augustine, FL 32080 Phone: 904-461-9708 Fax: 904-461-0335 Ponte Vedra Beach 240 Canal Blvd Ste 2 Ponte Vedra Beach, FL 32082 Phone: 904-273-9832 Fax: 904-273-4851 Palm Coast 1 Hammock Beach Parkway Ste 102 Palm Coast, FL 32137 Phone: 386-446-0085 Fax: 386-246-4071 Julington Creek Area 240 Canal Blvd Ste 2 Ponte Vedra Beach, FL 32082 Phone: 904-880-8796 Fax: 904-273-4851 Corporate Headquarters 5455 A1A S Ste 103 St. Augustine, FL 32080 Phone:904-461-9708 Toll Free: 855-629-6481 Fax: 904-461-0335 Bonita Springs 11100 Bonita Beach Rd SE #101 Bonita Springs, FL 34135 Phone: 239-262-1396 Ready to Elevate Your Community’s Management? Let’s explore if we’re the right fit. Click below to get started with a quick discovery call. Request a Proposal Ready to Elevate Your Community’s Management? Let’s explore if we’re the right fit. Click below to get started with a quick discovery call. Request a Proposal Contact US Contact Us Resale Documents Request a Proposal MAY Cares Careers FAQ Terms Of Use Privacy Policy Contact Us Resale Documents Request a Proposal MAY Cares Careers FAQ Terms Of Use Privacy Policy INFORMATION 5455 A1A S. Suite 103 St. Augustine, FL 32080 904-461-9708 REACH US Northeast Florida Jacksonville and all surrounding areas including Ponte Vedra, St. Augustine, Palm Coast, Daytona and Daytona Beach. Central Florida Apopka, Orlando, Cape Canaveral. Southwest Florida Marco Island, Naples, Bonita Springs, Estero, Fort Myers, Captiva and Sanibel Island. Hours of Operation Office Hours: Mon To Thurs : 9 AM – 5 PM | Fri : 8:30 AM -4 PM Closed On Weekends And Major Holidays After Hours Support - Available 24/7 After Hours, We Have A Dedicated On-Call Team To Provide Emergency Response For Your Community. Non-Emergency Inquiries Are Responded To Within 24 Hours Or Next Business Day. © Copyright – ALL RIGHTS RESERVED​- May Management Services"
    },
    {
      "url": "https://business.sjcchamber.com/member-directory/Details/st-augustine-art-association-3413504",
      "text": "St. Augustine Art Association Member Directory - St. Johns County Chamber of Commerce Skip to content Membership Become a Member Member Directory Member Groups Member Login Events Chamber Calendar Community Events Host a Chamber Before or After Hours What We Do Advocacy Local Advocacy Agenda State Advocacy Agenda Attainable Housing Meet the Candidates at PISJ Economic Development Business Environment Real Estate Permitting Procurement Autism Certification Matching Grant Pitch Factory Hurricane Preparedness for Businesses About the Chamber Who We Are Staff Board of Directors Board of Advisors Foundation Leadership St. Johns News Chamber Radio Hour Member News Research and Reports Strategic Plan Chamber Store St. Johns County Visit St. Augustine Ponte Vedra Live Here Welcome Home Job Openings Hot Deals Map Back to Search St. Augustine Art Association Categories Art Instruction 22 Marine Street , St. Augustine , FL , 32084 (904) 824-2310 (904) 824-0716 Send Email http://www.staaa.org Member News St. Augustine Art Association 100th Anniversary Celebration Share × Print Email Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 St. Johns County Chamber of Commerce | Site by GrowthZone St. Johns County Chamber of Commerce phone number (904) 829-5681 email info@sjcchamber.com map and address 100 Southpark Blvd. #405 St. Augustine, FL 32086 Quick Links Become a Member Member Directory Member Login Privacy Policy Facebook icon LinkedIn icon Instagram icon YouTube icon © 2025 St. Johns County Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.staaa.org/art-galleries-of-st-augustine/",
      "text": "First Friday Art Walk – St. Augustine Art Association Skip to content Skip to footer GALLERY HOURS: TUE - SUN, 12PM TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour DONATE About About STAAA Staff & Board Planned Giving Sponsors & Partners News Careers Join Membership Volunteer Art Gallery Membership Join our Mailing List Shop Original Artwork Visit GALLERY HOURS: TUE - SUN, 12pm TO 4PM | FREE ADMISSION 22 MARINE ST., ST. AUGUSTINE, FL 32084 | (904) 824-2310 $ 0.00 0 Cart Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour Visit SHOP DONATE Art STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work Calls for Art Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibit All Calls for Art Exhibit Guidelines Events First Friday Art Walk Plein Air in the Park 2026 French River Cruise Touch Braille Tour First Friday Art Walk Plein Air in the Park 2026 French River Cruise Permanent Collection Permanent Collection Drake’s Raid Exhibit Marguerite Castaing Jean Wagner Troemel Plan Your Trip Around the Arts Current Exhibit Fall Members Show Learn Adult Programs Monday Night Figure Drawing Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air All Workshops & Classes Youth Programs Kids Summer Art Camps All Workshops & Classes Touch Braille Tour ABOUT VISIT Plan Your Trip Around the Arts HISTORY STAFF & BOARD Planned Giving ART CURRENT EXHIBIT: Fall Members Show STAAA Calendar Exhibit Calendar Event Calendar Art Galleries of St. Augustine Calendar Show Your Work CALLS FOR ART Historic Impressions on a Modern Canvas Ximenez-Fatio Nights of Lights Exhibition All Calls for Art EXHIBIT GUIDELINES EVENTS FIRST FRIDAY ART WALK Plein Air in the Park 2026 French River Cruise ADULT PROGRAMS MONDAY NIGHT FIGURE DRAWING Pastel Landscape Painting Séance Sketches Painting Fall en Plein Air YOUTH PROGRAMS Kids Summer Art Camps PERMANENT COLLECTION DRAKE’S RAID EXHIBIT MARGUERITE CASTAING JEAN TROEMEL JOIN MEMBERSHIP VOLUNTEER SPONSORS / PARTNERS Gallery Membership SHOP Art Galleries of St. Augustine & First Friday Art Walk Art Galleries of St. Augustine (AGOSA) The Art Galleries of St. Augustine (AGOSA) comprises the diverse art galleries, museums and art-related businesses located in historic St. Augustine, Florida. Each one showcases outstanding collections of local, regional, national & international artists. Gallery events, especially the First Friday Art Walk, have cultivated a reputation for St. Augustine as an “Art Destination” among both locals and visitors. AGOSA has become a part of the St. Augustine Art Association with the goal to promote and enhance the visual arts in the area through involvement in community projects, publicity, networking and other opportunities for artists. O n the first Friday of every month, galleries open their doors from 5-9pm, offering new art exhibits and lively receptions to the public. Please note, not all galleries stay open until 9pm. Start the self-guided tour at any of the galleries on the map . Most galleries are within walking distance of each other; some are just a short ride away. Hop aboard the FREE Art Walk trolleys that run throughout downtown. Feast on great arts and eats and the sounds of live music–rain or shine! Parking locations are shown on the map–parking is FREE after 5pm except at the Historic Parking Garage and Fort. First Friday Art Walk Start the month (and weekend) off with the Art Galleries of St. Augustine! Every first Friday of the month galleries open their doors from 5-9:00pm, offering new art exhibits and lively receptions to the public. Start the Art Walk at any of the Art Galleries of St. Augustine galleries. Most galleries are within close walking distance of each other; some are just a short trolley ride away. Many galleries offer refreshments and have live music or other special programs. Check their websites for details each month. Trolley Details Below. Please note, not all galleries stay open until 9pm. Are you planning a trip to visit? Click here for suggested Hotels & Places in the area to stay ! VIEW THE INTERACTIVE ART WALK MAP DOWNLOAD THE ART WALK MAP First Friday Shuttles The Old Town Trolleys provide free transportation during First Friday Art Walk from 6-9pm. Art Walk Shuttle Stickers are required to ride and can be picked up at participating galleries, including the Art Association. The shuttles run every 20-30 minutes on a continuous loop. They may be boarded at any of the following stops: in front of the San Sebastian Winery, Butterfield Garage and ArtBox, the Lightner Museum, as well as Cathedral Place. These Trolley Stops are marked on the interactive map below. This shuttle service is not available during December and January Art Walks. Programs & Exhibits of the St. Augustine Art Association, including the Art Galleries of St. Augustine, are funded in part by grants from the St. Johns County Tourist Development Council, the St. Johns Cultural Council, the Community Foundation of Northeast Florida, and the Benjamin & Jean Troemel Arts Foundation. Galleries in the Historic Art District Acacia Tree Gallery – 11C Aviles Street – (904) 788-6332 | Website | The Acacia Tree Gallery has 13 local and regional award winning artists in multiple styles and mediums. There is something for everyone with sculpture, woodturning, landscapes, wildlife, surrealism, figurative, and surfboard art. We believe art should be accessible to everyone and build connections. Open Wed-Mon. 11-6, Closed Tue . First Friday Art Walk: 5-9pm PAStA Fine Art Gallery – 214 Charlotte Street – (904) 824-0251 | Website | P.A.St.A. Fine Art Gallery features all local artists and a variety of art—oil, acrylic, woodturning, stained glass, photography, pottery, and jewelry. Open every day 11-5pm. First Friday Art Walk: 5-9pm The St. Augustine Art Association – 22 Marine Street – (904) 824-2310 | Website | Founded in 1924, we are a nonprofit art organization that produces monthly juried exhibitions, programs for children and adults, and holds a Permanent Collection of important St. Augustine Art. Open Tue-Sun. 1-4pm. First Friday Art Walk: 5-8pm; Awards presented at 7pm; cash bar, music CJK Studio & Gallery – 212C Charlotte Street – (904) 238-8900 | Website | Art Studio and Gallery featuring works by plein air and studio painter Claire Kendrick. Claire specializes in landscapes, seascapes, and still life. Open Mon-Fri 9am-2pm. First Friday Art Walk: 5-8pm Plum Contemporary Gallery – 10 Aviles Street – (904) 825-0069 | Website | Plum Gallery exhibits contemporary artworks from 30+ local & regional artists, Plum Gallery has a refreshing mix of painters, sculptors and glass blowers that are willing to take on commissions and commercial projects. Open Wed-Sun 11-6, and by appointment Mon-Wed. First Friday Art Walk: 5-9pm. Galleries in the San Sebastian District Butterfield Garage – 137A King Street – (904) 825-4577 | Website | This 1920’s Garage was restyled into a fine art gallery exhibiting a wide variety of traditional and contemporary works. The original sign is outside. Parking for patrons available in front and back of gallery. Open Daily 11-5, First Friday Art Walk: 5-9pm. ArtBox – 137 King Street – (904) 704-1121 | Website | ArtBox is an inclusive artist gallery – an eclectic, mixed experience. In addition to paintings and fine art photography, ArtBox presents jewelry, pottery, sculpture, and artisan furniture. They also offer art classes, Indie Film Night, and monthly special events! Open Tue-Sun, 11-5, First Friday Art Walk: 5-9pm. Maria Reyes Jones Gallery – 134 Riberia Street #103 – (407) 619-1338 | Website | Maria Reyes Jones Gallery is an artist studio featuring the joyful and welcoming acrylic works of local artist Maria Reyes-Jones. Open Thu-Sat, 11-5, First Friday Art Walk: 5:30-8pm. Galleries in the Flagler District Crisp-Ellert Art Museum – 48 Sevilla Street – (904) 826-8530 | Website | The Crisp-Ellert Art Museum (CEAM) at Flagler College offers the Northeast Florida community a venue for fostering knowledge and a deep appreciation of contemporary art. As an educational resource for the College, the Museum exhibits regional, national and international artists, and provides opportunities for critical engagement and exposure to a variety of exhibitions and personal interactions with visiting artists. Open Mon-Fri 10am-4pm; Sat 12-4pm, while classes are in session. Closed July and August. Open most First Friday Art Walks 5-8pm. Grand Bohemian Gallery – 49 King Street – (904) 829-6880 | Website | A Kessler Collection gallery that exclusively features multi-award winning local and international artists. Open Sun-Thurs 10am-46m; Fri-Sat 10am-9pm. First Friday Art Walk: 5:30-8:30pm. Galleries on Anastasia Island, US-1 & SR-206 The Art Studio – 370 A1A Beach Blvd – (904) 295-4428 | Website | Art studio and gallery space located on St. Augustine Beach by the pier. Paintings, pottery, stained glass. Open Daily, 12-5, First Friday Art Walk 5-8pm. An Art Affair – 11 14th Lane, Suite B – (904) 907-5720 | Website | An Art Affair offers a selection of works from a variety of world renowned artists who are collected by museums, galleries, celebrities, and in boardrooms across the globe… plus the vibrant and colorful impressionist creations of local artist and gallery owner Melody Rouisse-Stimpel. Open Wed-Fri Noon-6pm, Sat 11-6pm, Sun 11-5pm, First Friday Art Walk 5-9pm. Annagem Jewelry & Art Gallery – 1054 FL-206, Suite A – (904) 599-5911 | Website | Discover a curated blend of local artistry and timeless charm at our gallery. We showcase captivating wall art in acrylic, oil and textured mediums by talented local artists. Complementing the visual experience are handpicked vintage pieces, unique decor, and artisan jewelry- each selected to inspire and elevate your space. Open Tue-Sat 10-5pm, First Friday Art Walk 10-7pm. Galleries in the Mid & Uptown Districts Art Collective St. Augustine – 51 Cordova Street – (904) 792-4500 | Website | Art Collective St. Augustine is the newest gallery in STA, located right in the center of the downtown historic district. We’ve assembled the most unique and diverse group of local Artists, creating in a wide array of mediums, styles and genres. Our goal is to showcase the wide variety of extraordinary talent we have here in St. Augustine – to tourists, locals and the business community around us. Resident Artists at Art Collective range the full gamut of creative works – everything from traditional oil paintings to modern acrylics, pastels, mixed medium collage, paper quilling, pit fired pottery as well as exquisite jewelry makers. We’re open late on Friday and Saturday nights – and even more evening hours during the city’s Nights of Lights celebration, for those strolling the town to pop in and make Local Art a part of their evening. Sun-Mon 11am-5pm; Wed-Thurs 11am-5pm; Fri-Sat 11am-8:30pm. First Friday Art Walk 5-9pm. High Tide Gallery – 2 St. George Street #109 (primary) and 850 Anastasia Blvd (secondary)– (904) 829-4705 | Website | FUN. LOCAL. COASTAL. CREATIVE. Nestled in the heart of the historic downtown district on St. George Street near the iconic City Gates, our art gallery features the works of over 60 talented local artists! Discover a stunning collection of stained glass, seaglass, handcrafted jewelry, original paintings, photography, pottery, metal creations, woodwork and whimsical keepsakes—all designed to capture the charm of our magical seaside city. Many of our artists offer custom artwork. Don’t miss our second location on Anastasia Island, in the shadows of the St. Augustine Lighthouse. You can also visit our gallery online to learn more about us and our wonderful artists. Soon you will be able to shop most of our artwork for sale from our website — launching in June! Shipping available anywhere in the U.S. from all of our galleries. Contact us to learn more about what we can do to personalize your art shopping experience! 2 St. George Street location: Open daily, Sun-Sat 10am-7pm, First Friday Art Walk 5-9pm. 850 Anastasia Blvd: Open Tues-Sat 10am-2pm. Neff Jewelry & Gallery – 7 Rhode Ave – (904) 829-5003 | Website | Visit this restored vintage home that houses 2 floors of artwork by award-winning artists Jan Neff & Teri Tompkins, and finely crafted custom jewelry in gold, platinum, diamonds and gemstones by master goldsmith Dan Neff. Open Tue-Sat, 11-4. Saint Augustine Art Gallery – 162 Saint George St #28 – (904) 209-5968 | Website | We feature local artist and display a diverse collection of the new and upcoming talent in our beautiful historic town. Featured artists include Obie Hunter and Jack Beam. Open Mon-Thurs 11-5, Fri-Sun 11-8. First Friday Art Walk 11-8pm. AGOSA Map w/Parking Info Gallery Tours During the Week Jule’s Art Tours – Website – Jule’s Art Tours connects visitors and locals to artists in their studios and galleries. Other tours focus on shopping for art, and many tours share the history of art in St. Augustine. Tours led by Jule often connect the artists with their special shows in local museums: at the Lightner Museum, Oldest House Museum, Lincolnville Museum, and the Crisp Ellert Museum, to name just a few venues. Gallery Membership & Art Walk Sponsorships Galleries and art businesses can be listed here and on the maps! Click the button below to find out about a Gallery Membership to the St. Augustine Art Association. Businesses looking to participate in Art Walk can have their events promoted by being Art Walk Sponsors. Contact our Executive Director, Jennifer Flynt, to find out about sponsorship opportunities: info@staaa.org . Gallery Membership 22 Marine Street, St. Augustine, FL 32084 info@staaa.org 904.824.2310 ABOUT ABOUT STAAA Board Become a Member LINKS Donate Join our Mailing List Privacy Policy TERMS of SERVICE CAREERS ART Current Exhibit Permanent Collection SHOP First Friday Art Walk LEARN TOUCH ST. AUGUSTINE Figure Drawing Workshops & Classes The St. Augustine Art Association is partially funded by grants from the St. Johns County Tourist Development Council, the St. Johns Cultural Council , the Community Foundation for Northeast Florida ‘s Crisp-Ellert Fund, and the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, the National Endowment for the Arts, and the Benjamin & Jean Troemel Arts Foundation. © 2021 ST. AUGUSTINE ART ASSOCIATION, A 501 (C)(3) NONPROFIT ALL RIGHTS RESERVED. SITE BY:  AVID DESIGN GROUP LLC"
    },
    {
      "url": "https://www.bozardford.net/contactus.aspx",
      "text": "Contact Bozard Ford | St Augustine Ford dealership in Saint Augustine FL Bozard Ford Sales 904-441-6152 Service 904-592-3355 Parts 904-592-3347 Quick Lane 904-966-4203 540 Outlet Mall Blvd. Saint Augustine, FL 32084 Service Map Contact Saved Saved Bozard Ford Saved Call 904-441-6152 Directions Home New New Vehicles Model Showroom Schedule Test Drive Value Your Trade Seamless Delivery Online Purchasing with Home Delivery Used Pre-Owned Vehicles Certified Pre-Owned Vehicles Certified Pre-Owned Overview Value Your Trade Schedule Test Drive Commercial Commercial Inventory Ford Pro™ Specials New Specials Pre-Owned Specials Service Specials Ford Incentives Finance Finance Finance Department Get Pre-approved Value Your Trade Sell Your Vehicle Payment Calculator Ford Incentives Service & Parts Service & Parts Schedule Service Service Department Quick Lane Mobile Service Ford Pickup & Delivery FordPass Tires Parts Department Ford Accessories Order Accessories Accessories & Performance About Us About Us Our Dealership Contact Us Meet Our Staff Hours & Directions Customer Testimonials Driven to Inspire Bozard Gives Back Ford's Garage Restaurant & Bar EV Charging Research Electric Vehicles Electric Vehicle Lifestyle Mustang Mach E F-150 Lightning Home New New Vehicles Model Showroom Schedule Test Drive Value Your Trade Seamless Delivery Online Purchasing with Home Delivery Used Pre-Owned Vehicles Certified Pre-Owned Vehicles Certified Pre-Owned Overview Value Your Trade Schedule Test Drive Commercial Commercial Inventory Ford Pro™ Specials New Specials Pre-Owned Specials Service Specials Ford Incentives Finance Finance Finance Department Get Pre-approved Value Your Trade Sell Your Vehicle Payment Calculator Ford Incentives Service & Parts Service & Parts Schedule Service Service Department Quick Lane Mobile Service Ford Pickup & Delivery FordPass Tires Parts Department Ford Accessories Order Accessories Accessories & Performance About Us About Us Our Dealership Contact Us Meet Our Staff Hours & Directions Customer Testimonials Driven to Inspire Bozard Gives Back Ford's Garage Restaurant & Bar EV Charging Research Electric Vehicles Electric Vehicle Lifestyle Mustang Mach E F-150 Lightning Contact Us Fill out the form below and we'll contact you shortly. * Contact Name: *First Name *Last Name *E-Mail Address *Phone Zip Code *Department Select Department Sales Service Parts Comments: By clicking this box, I agree to receive in-person or automated telemarketing calls and texts from Bozard Ford at the number I entered. I understand that my consent is not required for purchase. Let's Talk *Required Fields Phone Sales: 904-441-6152 Service: 904-592-3355 Parts: 904-592-3347 Quick Lane: 904-966-4203 Address Bozard Ford 540 Outlet Mall Blvd. Saint Augustine, FL 32084 Hours and Directions Although every reasonable effort has been made to ensure the accuracy of the information contained on this site, absolute accuracy cannot be guaranteed. This site, and all information and materials appearing on it, are presented to the user \"as is\" without warranty of any kind, either express or implied. All vehicles are subject to prior sale. Price does not include applicable tax, title, and license charges. ‡Vehicles shown at different locations are not currently in our inventory (Not in Stock) but can be made available to you at our location within a reasonable date from the time of your request, not to exceed one week. Copyright © 2025 by DealerOn | Sitemap | Privacy | Additional Disclosures Bozard Ford | 540 Outlet Mall Blvd., Saint Augustine, FL 32084 | Sales: 904-441-6152 |"
    },
    {
      "url": "https://www.historiccoastculture.com/organization/st-augustine-art-association/",
      "text": "St. Augustine Art Association - HistoricCoastCulture.com St. Augustine Art Association - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 SEARCH Advanced Filters Home Organization St. Augustine Art Association Facebook Twitter Linkedin Print St. Augustine Art Association The St. Augustine Art Association has been promoting excellence in the arts since 1924. Located in the Historic District of the nation’s oldest city, the Association produces monthly juried exhibits of works by emerging and professional artists as well as the annual Plein Air Paint Out in April. The art gallery serves as the community’s visual art hub, housing a collection of “Lost Colony” art and providing a gathering place for workshops, lectures, children’s programs, concerts and special events. The St. Augustine Art Association has been promoting excellence in the arts since 1924. Located in the Historic District of the nation’s oldest city, the Association produces monthly juried exhibits of works by emerging and professional artists as well as the annual Plein Air Paint Out in April. The art gallery serves as the community’s visual art hub, housing a collection of “Lost Colony” art and providing a gathering place for workshops, lectures, children’s programs, concerts and special events. View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: Association/Club/Group ; Gallery/Museum ; Nonprofit ; Traditional Arts ; Visual Arts UPCOMING EVENTS PAST EVENTS Plein Air in the Park Presented by St. Augustine Art Association and St. Johns Cultural Council at Lakeside Park Sep 14, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Pastel Landscape Painting Workshop (with Cynthia Pierson) Presented by St. Augustine Art Association at St. Augustine Art Association Sep 23 - Sep 24, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Annual Fall Members Show Presented by St. Augustine Art Association at St. Augustine Art Association Sep 5 - Sep 28, 2025 Facebook Twitter Linkedin Séance Sketches Workshop (with Nikki Rakov) Presented by St. Augustine Art Association at St. Augustine Art Association Oct 30, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Tactile Art Show Presented by St. Augustine Art Association at St. Augustine Art Association Oct 3 - Nov 2, 2025 Facebook Twitter Linkedin SHOW MORE Founders Day St. Augustine Plein Air Paint Out Presented by St. Augustine Art Association and St. Johns Cultural Council at St. Augustine Art Association Sep 5 - Sep 8, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION What We See in the Shadows Presented by St. Augustine Art Association at St. Augustine Art Association Jul 17 - Aug 31, 2025 Facebook Twitter Linkedin Summer Art Camps Presented by St. Augustine Art Association at St. Augustine Art Association Jun 16 - Aug 1, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Annual Honors Show Presented by St. Augustine Art Association at St. Augustine Art Association Jun 6 - Jul 6, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Plein Air Painting Social at Fort Mosé Presented by St. Augustine Art Association and Fort Mose Historical Society and St. Johns Cultural Council at Fort Mose Historic State Park Jun 14, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION SHOW MORE PHOTOS Contact information Email / Website / Facebook / Instagram / LinkedIn / Donate / Primary address: 22 Marine Street, St. Augustine, FL 32084 904-824-2310 Find An Organization Search by Keyword Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Featured Organizations EMMA Concert Association Presenting beautiful music in beautiful St. Augustine at the Lewis Auditorium at Flagler College! EMMA’s mission is to offer quality music and dance performances by national and international artists. They also aim to encourage interest in classical music and to provide opportunities for the youth of St. Johns County. EMMA accomplishes this by offering school concerts in local schools and funding requests from music teachers for instruments and equipment. Historic Florida Militia The Historic Florida Militia (HFM) is a non-profit umbrella organization supporting re-created historic interpretive units and representing a number of cultures and time periods. \"We are not street performers, we are educators. We are not parades, we are historic programs. This is not an exercise in free speech, this is an opportunity to educate. We are not promoting a political agenda, we are promoting the city's history through a practical and factual teaching method\". Crisp-Ellert Art Museum at Flagler College Built in honor of Dr. JoAnn Crisp-Ellert and her husband, Dr. Robert Ellert, the Crisp-Ellert Art Museum offers Flagler College students and the Northeast Florida community a venue for fostering knowledge and a deep appreciation of contemporary art. As an educational resource for the College, the Museum exhibits regional, national and international artists, and provides opportunities for critical engagement and exposure to a variety of exhibitions and personal interactions with visiting artists. The Museum challenges students, the Flagler community and the public to cultivate individual creativity, critical reflection, historical consciousness and respect for the free exchange of ideas. In this spirit, the Museum also hosts public programs, including artist talks, readings, panel discussions and film series that provide a platform for vital interdisciplinary dialogue. DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    }
  ]
}