{
  "fuentes": [
    {
      "url": "https://www.standardhotels.com/careers/SLH",
      "email": "highlinejobs@standardhotels.com"
    },
    {
      "url": "https://www.standardhotels.com/careers/SHLServerLRP",
      "email": "highlinejobs@standardhotels.com"
    },
    {
      "url": "https://www.standardhotels.com/careers/SHLSGR",
      "email": "highlinejobs@standardhotels.com"
    },
    {
      "url": "https://www.tripadvisor.co.uk/Restaurant_Review-g34439-d28664966-Reviews-Monterrey_Bar-Miami_Beach_Florida.html",
      "email": "miami@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/privacy",
      "email": "dpo@standardhotels.com"
    },
    {
      "url": "https://www.standardhotels.com/privacy",
      "email": "dpo@standardhotels.com"
    },
    {
      "url": "https://monterreymexican.com/contact-us/",
      "email": "contact@monterreymexican.com"
    },
    {
      "url": "https://monterreymexican.com/contact-us/",
      "email": "creditcard@2x.png"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach/faqs",
      "email": "crispy@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach/faqs",
      "email": "membership@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach/faqs",
      "email": "miami@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach/faqs",
      "email": "miami@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach/faqs",
      "email": "miamievents@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach/faqs",
      "email": "membership@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach/faqs",
      "email": "miami@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/contacts/new",
      "email": "press@standardhotels.com"
    },
    {
      "url": "https://www.standardhotels.com/legal",
      "email": "dpo@standardhotels.com"
    },
    {
      "url": "https://leadiq.com/c/the-standard-hotels/5a1d843f24000024005eb404/employee-directory",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/the-standard-hotels/5a1d843f24000024005eb404/employee-directory",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://monterreymexican.com/the-owners/",
      "email": "contact@monterreymexican.com"
    },
    {
      "url": "https://monterreymexican.com/the-owners/",
      "email": "creditcard@2x.png"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "advertising@imbibemagazine.com"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "cropped-cropped-new-icon-76@2x-180x180.png"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "cropped-cropped-new-icon-76@2x-192x192.png"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "cropped-cropped-new-icon-76@2x-270x270.png"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "cropped-cropped-new-icon-76@2x-32x32.png"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "editorial@imbibemagazine.com"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "info@imbibemagazine.com"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "negroniweek@imbibemagazine.com"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "email": "subscriptions@imbibemagazine.com"
    },
    {
      "url": "https://www.standardhotels.com/new-york/properties/east-village/faqs",
      "email": "sev.sales@standardhotels.com"
    },
    {
      "url": "https://www.standardhotels.com/new-york/properties/east-village/faqs",
      "email": "u003esev.sales@standardhotels.com"
    },
    {
      "url": "https://www.standardhotels.com/careers/SHLBBLRP",
      "email": "highlinejobs@standardhotels.com"
    },
    {
      "url": "https://monterreymexgrill.com/",
      "email": "info@avvamarketing.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "email": "crispy@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "email": "membership@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "email": "miami@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "email": "miami@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "email": "miami@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "email": "miamievents@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "email": "membership@standardmiami.com"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "email": "miami@standardmiami.com"
    }
  ],
  "mails": [
    "advertising@imbibemagazine.com",
    "contact@monterreymexican.com",
    "creditcard@2x.png",
    "crispy@standardmiami.com",
    "cropped-cropped-new-icon-76@2x-180x180.png",
    "cropped-cropped-new-icon-76@2x-192x192.png",
    "cropped-cropped-new-icon-76@2x-270x270.png",
    "cropped-cropped-new-icon-76@2x-32x32.png",
    "dpo@standardhotels.com",
    "editorial@imbibemagazine.com",
    "highlinejobs@standardhotels.com",
    "info@avvamarketing.com",
    "info@imbibemagazine.com",
    "membership@standardmiami.com",
    "miami@standardmiami.com",
    "miamievents@standardmiami.com",
    "name@company.com",
    "negroniweek@imbibemagazine.com",
    "press@standardhotels.com",
    "sales@leadiq.com",
    "sev.sales@standardhotels.com",
    "subscriptions@imbibemagazine.com",
    "u003esev.sales@standardhotels.com"
  ],
  "nombre_sitio": "standardhotels.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.standardhotels.com/careers/SLH",
      "text": "Bar Back - The Biergarten | New York Career | The Standard Hotels Hotels High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Bar Back - The Biergarten Our Story The simple premise behind The Standard is that\r\n it is anything but. Founded in 1999, the goals of every Standard are to\r\n up the aesthetic stakes and defy convention while attending to every \r\ndetail, embracing our local communities, providing a welcoming and \r\ninclusive environment for our teams, and, of course, delivering a \r\nsmashing good time for our guests. The Standard’s unique \r\nsensibility and voice combine with careful consideration of design and \r\nservice to deliver experiences that define neighborhoods and create \r\ndestinations renowned globally. We believe in hospitality fueled \r\nby culture. As we take The Standard to new markets around the world, we \r\nretain and enhance our mission of creating hotels layered with \r\npersonalities, collaborators, and amusements from culinary and nightlife\r\n to retail and wellness that surprise and delight our guests. The Standard, High Line Rising\r\n above a former elevated train line that has become downtown’s favorite \r\npublic park, The Standard, High Line is in New York City’s Meatpacking \r\nDistrict. Every one of the 338 hotel rooms features a full wall of \r\nfloor-to-ceiling windows with sweeping views of Manhattan and/or the \r\nmighty Hudson River. The hotel’s inviting and scintillating public \r\nspaces include a bustling German beer garden at ground level, the \r\nrooftop discotheque Le Bain, the legendary Top of The Standard, and an \r\noutdoor public plaza with rotating art installations and activation's. A \r\nneighborhood staple, The Standard Grill is classic New York blending \r\ntraditional steakhouse with New American cuisine. Mission Statement Our\r\n mission is to create experiences by embracing and empowering a diverse \r\ncollective of team members, collaborators, and guests, who chose to call\r\n The Standard home. #StandardFamily Job Purpose The bar back is responsible for the complete set up of the bar\r\narea, restocking and breaking down at closing, and other tasks to assist the\r\nbartender before and during the shift. Duties and Responsibilities Main par level stocks and assist bartender whenever necessary Open and set up bar, including stocking liquor bottles Stock all glassware and ashtrays Fill all ice wells with ice Maintain and upkeep inventory of fruits, juices, water, beer, liquor, garnishes, coffee/tea, silverware, napkins, salt & pepper, and other bar related items Stock all paper and plastic needs for bar such as napkins, straws, stirrers and micros paper Make sure the bar is neat and clean at all times Perform other duties as requested per manager or bartender Skills and Qualifications Knowledgeable of bar products, drink list, and menu Working knowledge of POS system Customer service oriented Ability to work in team and independently Excellent organization and communication skills Ability to work successfully in a fast paced environment Ability to maintain composure in a potentially stressful environment Understanding: Ability to read, comprehend and carry out\r\ninstructions according to established procedures Comprehension: Fluent in the English language Organizational Skills: Work efficiently, utilize multi-tasking,\r\nprioritize tasks Hygiene and Sanitation: Adherence to uniform, grooming and\r\npersonal hygiene standards and expectations per Standard of Operating\r\nProcedures Punctuality: Adherence to posted schedule and arrival time and\r\nattendance at mandatory meetings Responsibility: Personal comportment in line\r\nwith Standard, New York policies, standards, and expectations Physical Requirements Able to work standing for a minimum period of 8 hours a day Periodical bending, kneeling, and stretching Able to pull, push, carry and lift at least 40 pounds of force Must be able to seize, grasp, turn and hold objects with hands Compensation and Benefits Pay Rate $15/hour + TIPS Excellent and Affordable Health care coverage Life Insurance, Disability Insurance, Pet Insurance 401k with Company match 160 hours of PTO / year and Company recognized holidays Employee Discounts on Rooms, F&B, Retail, and The Standard Marketplace Employee Meals, Employee Referral Program, Commuter Discounts Regular fun staff events and celebrations!!! This job description is not an exclusive or exhaustive list of all job functions that an employee in this position may be asked to perform from time to time. Due to the nature of the hospitality industry, employees may be required to work varying schedules to reflect the business needs of the hotel which may include overtime, weekends and holidays. Standard High Line Employer, LLC (the “Company”) is an Equal Opportunity Employer Submit Your Resume. Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://www.standardhotels.com/careers/SHLServerLRP",
      "text": "Server - The Living Room and Plaza | New York Career | The Standard Hotels High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Server - The Living Room and Plaza Our Story The simple premise behind The Standard is that it is anything but.\r\nFounded in 1999, the goals of Every Standard are to up the aesthetic stakes and\r\ndefy convention while attending to every detail, embracing our local\r\ncommunities, providing a welcoming and inclusive environment for our teams,\r\nand, of course, delivering a smashing good time for our guests. The Standard’s unique sensibility and voice combine with careful\r\nconsideration of design and service to deliver experiences that define neighborhoods\r\nand create destinations renowned globally. We believe in hospitality fueled by culture. As we take The Standard\r\nto new markets around the world, we retain and enhance our mission of creating\r\nhotels layered with personalities, collaborators, and amusements from culinary\r\nand nightlife to retail and wellness that surprise and delight our guests. The Standard, High Line Rising above a former elevated train line that has become downtown’s\r\nfavorite public park, The Standard, High Line is in New York City’s Meatpacking\r\nDistrict. Every one of the 338 hotel rooms features a full wall of\r\nfloor-to-ceiling windows with sweeping views of Manhattan and/or the mighty\r\nHudson River. The hotel’s inviting and scintillating public spaces include a\r\nbustling German beer garden at ground level, the rooftop discothèque Le Bain,\r\nthe legendary Top of The Standard, and an outdoor public plaza with rotating\r\nart installations and activations. A neighborhood staple, The Standard\r\nGrill is classic New York blending traditional steakhouse with New\r\nAmerican cuisine. Mission\r\nStatement Our mission is to\r\ncreate experiences by embracing and empowering a diverse collective of team\r\nmembers, collaborators, and guests, who chose to call The Standard home. #StandardFamily Job Overview The server is responsible for all aspects of guest relations, service,\r\nand general upkeep of the restaurant and related areas. Duties and Responsibilities Interact with and provide food and drinks for guests in the restaurant Keep the dining room area clean and organized Maintain a properly set wait station (see SOPs) Make sure all side work is complete Review the menu daily for changes and specials Describe menu items and wine as requested, per training Follow the service and house standards and expectations at all times Open all wine/water bottles Take orders properly Make sure tickets are neat and organized Put order through in Micros properly Handle all payment methods Ensure that all closing side work is thoroughly completed Clean and set up tables and trays Clean, set up, and breakdown tables, trays, and stations per SOPs Check, clean, and maintain all F&B areas constantly Polish silverware and glassware in the service stations and kitchen\r\nthroughout the service Assist the bartenders in side work including emptying trash from the bar\r\nand waiting for station areas Complete all side work duties per SOPs including pre and post-shift,\r\ndaily, weekly, and monthly duties Deliver food from kitchen to floor efficiently Ensure guest tables are maintained at all times to company standards and\r\nexpectations Describe food items presented to guests when necessary Assist in setting up tables properly Work closely with the management team to assess and achieve the daily\r\nneeds of each outlet and meet the necessary parts for the individual services.\r\nThis will include but is not limited to: Napkin folds – specific design determined by\r\nthe outlet, store properly in each outlet Refill salt and pepper shakers Polish and stock glassware Polish and stock silverware Ensure linen is retrieved and stored properly\r\nfor each outlet Retrieve candles, store them properly, and load votives for each F&B\r\noutlet Perform other duties as requested Skills and Qualifications 1+ years’ serving experience in an upscale, high-volume restaurant Knowledge of classic cocktails and general wine knowledge Working knowledge of POS systems and cashiering Ability to read, comprehend and carry out instructions according to\r\nestablished procedures Fluent in the English language, write, read and speak. Bi or Multi-lingual\r\na plus Work efficiently, utilize multi-tasking, prioritize tasks Adherence to uniform, grooming, and personal hygiene standards and\r\nexpectations per SOPs Adherence to posted schedule and arrival time and attendance at\r\nmandatory meetings when scheduled Personal comportment in line with Standard, New York policies,\r\nstandards, and expectations Physical Requirements Able to work standing for a minimum period of 8 hours a day Periodical bending, kneeling, and stretching Able to pull, push, carry, and lift at least 40 pounds of force Must be able to seize, grasp, turn, and hold objects with hands Compensation and Benefits Pay Rate $ 15 /\r\nHour Plus Tips Excellent and\r\nAffordable Health care coverage Life Insurance,\r\nDisability Insurance, Pet Insurance 401k with Company\r\nmatch 160 hours of PTO /\r\nyear and Company recognized holidays Employee Discounts\r\non Rooms, F&B, Retail, and The Standard Marketplace Employee Meals,\r\nEmployee Referral Program, Commuter Discounts Regular fun staff\r\nevents and celebrations!!! This job description is not an exclusive or exhaustive list of all\r\njob functions that an employee in this position may be asked to perform from\r\ntime to time. Due to the nature of the hospitality industry, employees may\r\nbe required to work varying schedules to reflect the business needs of the\r\nhotel which may include overtime, weekends, and holidays. Standard High Line Employer, LLC (the “Company”) is an Equal\r\nOpportunity Employer. Submit Your Resume. Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://www.standardhotels.com/careers/SHLSGR",
      "text": "Server - The Standard Grill | New York Career | The Standard Hotels Hotels High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Server - The Standard Grill Our Story The simple premise behind The Standard is that it is anything but. Founded in 1999, the goals of Every Standard are to up the aesthetic stakes and defy convention while attending to every detail, embracing our local communities, providing a welcoming and inclusive environment for our teams, and, of course, delivering a smashing good time for our guests. The Standard’s unique sensibility and voice combine with careful consideration of design and service to deliver experiences that define neighborhoods and create destinations renowned globally. We believe in hospitality fueled by culture. As we take The Standard to new markets around the world, we retain and enhance our mission of creating hotels layered with personalities, collaborators, and amusements from culinary and nightlife to retail and wellness that surprise and delight our guests. The Standard, High Line Rising above a former elevated train line that has become downtown’s favorite public park, The Standard, High Line is in New York City’s Meatpacking District. Every one of the 338 hotel rooms features a full wall of floor-to-ceiling windows with sweeping views of Manhattan and/or the mighty Hudson River. The hotel’s inviting and scintillating public spaces include a bustling German beer garden at ground level, the rooftop discothèque Le Bain, the legendary Top of The Standard, and an outdoor public plaza with rotating art installations and activations. A neighborhood staple, The Standard Grill is classic New York blending traditional steakhouse with New American cuisine. Mission Statement Our mission is to create experiences by embracing and empowering a diverse collective of team members, collaborators, and guests, who chose to call The Standard home. # StandardFamily Duties and Responsibilities Interact\r\nand provide food and drinks for guests in restaurant Keep\r\ndining room area clean and organized Maintain\r\na properly set wait station (see SOP’s) Make\r\nsure all side work is complete Review\r\nmenu daily for changes and specials Describe\r\nmenu items and wine as requested, per training Follow\r\nthe service and house standard and expectations at all times Open\r\nall wine/water bottles Take\r\norder properly Make\r\nsure tickets are neat and organized Ensure that\r\nall closing side work is thoroughly completed Skills and Qualifications 2+ years' experience in a NYC upscale, fast paced and high-volume restaurant Must be at least 18 years old Excellent knowledge of POS systems Ability to read, comprehend and carry out instructions according to established procedures Fluent in the English, write, read and speak. Bi or Multi-lingual a plus Work efficiently, utilize multi-tasking, prioritize tasks Personal comportment in line with Standard, New York policies, standards, and expectations Physical Requirements Able to work standing for a minimum period of 8 hours a day Periodical bending, kneeling, and stretching Able to pull, push, carry and lift at least 40 pounds of force Must be able to seize, grasp, turn and hold objects with hands Able to work in a loud environment Compensation and Benefits $15.00/hour + TIPS Excellent and Affordable Health care coverage Life Insurance, Disability Insurance, Pet Insurance 401k with Company match 160 hours of PTO / year and Company recognized holidays Employee Discounts on Rooms, F&B, Retail, and The Standard Marketplace Employee Meals, Employee Referral Program, Commuter Discounts Regular fun staff events and celebrations! This job description is not an exclusive or exhaustive list of all job functions that an employee in this position may be asked to perform from time to time. Due to the nature of the hospitality industry, employees may be required to work varying schedules to reflect the business needs of the hotel which may include overtime, weekends and holidays. Standard High Line Employer, LLC (the “Company”) is an Equal Opportunity Employer Submit Your Resume. Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://www.tripadvisor.co.uk/Restaurant_Review-g34439-d28664966-Reviews-Monterrey_Bar-Miami_Beach_Florida.html",
      "text": "MONTERREY BAR, Miami Beach - 2025 Reviews & Information Skip to main content Discover Trips Review GBP Sign in Miami Beach Hotels Things to Do Restaurants Flights Cruises Holiday Rentals Forums United States Florida (FL) Miami Beach Miami Beach Restaurants Monterrey Bar Monterrey Bar Unclaimed This business is unclaimed. Owners who claim their business can update listing details, add photos, respond to reviews, and more. Claim your free listing now Share Review Save 5.0 5 of 5 bubbles ( 2 reviews ) #543 of 884 Restaurants in Miami Beach 1 What is Travellers’ Choice? Tripadvisor gives a Travellers’ Choice award to accommodations, attractions and restaurants that consistently earn great reviews from travellers and are ranked within the top 10% of properties on Tripadvisor. Monterrey Bar Share Review Save Reserve a table At a glance Open until 00:00 See all hours 40 Island Ave The Standard Spa, Miami Beach, FL 33139 Website +1 305-673-1717 Email Improve this listing About Features Meal types Dinner Location 40 Island Ave The Standard Spa, Miami Beach, FL 33139 Is this an Asian restaurant? Yes No Unsure Reserve a table Save this restaurant Save Hours Suggest an edit Open until 00:00 Sunday 17:00 - 00:00 Monday 17:00 - 00:00 Tuesday 17:00 - 00:00 Wednesday 17:00 - 00:00 Thursday 17:00 - 00:00 Friday 17:00 - 00:00 Saturday 17:00 - 00:00 Reviews Tips/Q&A All reviews Write a review Traveller photos All reviews We perform checks on reviews. Tripadvisor’s approach to reviews Before posting, each Tripadvisor review goes through an automated tracking system, which collects information, answering the following questions: how, what, where and when. If the system detects something that potentially contradicts our community guidelines , the review is not published. When the system detects a problem, a review may be automatically rejected, sent to the reviewer for validation, or manually reviewed by our team of content specialists, who work 24/7 to maintain the quality of the reviews on our site. Our team checks each review posted on the site disputed by our community as not meeting our community guidelines . Learn more about our review moderation. Write a review Reviews are the subjective opinion of Tripadvisor members and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. No reviews for this property yet. Write a review As Featured In By Nicholas DeRenzo Destination-worthy boutique hotels for every type of traveler Here, the rooms are destinations unto themselves. Is This Your Listing? Own or manage this property?  Claim your listing for free to respond to reviews, update your profile and much more. Claim Your Free Listing MONTERREY BAR, Miami Beach - 2025 Reviews & Information Miami Beach Miami Beach Tourism Miami Beach Hotels Bed and Breakfast Miami Beach Miami Beach Holiday Rentals Flights to Miami Beach Miami Beach Restaurants Miami Beach Attractions Miami Beach Travel Forum Miami Beach Photos Miami Beach Map Hotels All Miami Beach Hotels Miami Beach Hotel Deals Last Minute Hotels in Miami Beach Hotels Near Me By Hotel Type Miami Beach Motels Miami Beach Hostels Miami Beach Resorts Business Hotels Miami Beach Miami Beach Green Hotels Family Hotels Miami Beach Casinos in Miami Beach Romantic Hotels in Miami Beach Luxury Hotels in Miami Beach Miami Beach Beach Hotels Spa Hotels in Miami Beach By Hotel Class 4-Star Hotels in Miami Beach 3-Star Hotels in Miami Beach 5-Star Hotels in Miami Beach By Hotel Brand Iberostar Hotels & Resorts in Miami Beach Curio Collection by Hilton Hotels in Miami Beach The Leading Hotels Of The World in Miami Beach Kimpton Hotels in Miami Beach Best Western Hotels in Miami Beach Hyatt Hotels in Miami Beach InterContinental (IHG) Hotels in Miami Beach Hilton Hotels in Miami Beach Marriott Hotels in Miami Beach Sonder Hotels in Miami Beach Hilton Grand Holidays Hotels in Miami Beach Popular Amenities Miami Beach Hotels with a Pool Miami Beach Hotels with Parking Pet Friendly Hotels in Miami Beach Popular Neighbourhoods Oceanfront Hotels South Pointe Hotels City Center Hotels West Avenue Hotels North Shores Hotels Flamingo / Lummus Hotels Hotels near Nautilus Hotels near Venetian Islands Hotels near Biscayne Point Popular Miami Beach Categories Boutique Hotels in Miami Beach Apartment Hotels Miami Beach Discount Hotels in Miami Beach Quiet Hotels in Miami Beach Hotels with Balconies in Miami Beach Miami Beach Party Hotels Backpacker Hostels Miami Beach Luxury Family Resorts Miami Beach Luxury Bed and Breakfast Miami Beach Family Bed and Breakfast Miami Beach Near Landmarks Hotels near Lincoln Road Hotels near Ocean Drive Hotels near Miami Beach Boardwalk Hotels near Art Deco Historic District Hotels near Collins Avenue Hotels near South Pointe Park Hotels near Española Way Hotels near Holocaust Memorial Miami Beach Hotels near Lummus Park Hotels near Miami Beach Botanical Garden Near Train Stations Hotels near Adrienne Arsht Center Hotels near Museum Park Hotels near Eleventh St Hotels near Park West Hotels near School Board Hotels near Santa Clara Hotels near Culmer Hotels near Civic Center Hotels near Allapattah Hotels near Earlington Heights Near Airports Hotels near Miami Intl Airport (MIA) Hotels near Fort Lauderdale-Hollywood International Airport (FLL) Motels near Fort Lauderdale-Hollywood International Airport (FLL) Motels near Miami Intl Airport (MIA) Near Colleges Hotels near Yeshiva Gedolah Rabbinical College Hotels near Talmudic College of Florida Hotels near Hollywood Institute - Miami Miami Beach, FL Hotels near Miami International University of Art & Design Hotels near Lindsey Hopkins Technical Education Center Hotels near Miami Ad School Hotels near D. A. Dorsey Educational Center Hotels near Beauty Schools of America South Beach Campus Hotels near Miami Dade College Hotels near South Florida Institute-Tech Popular Hotel Categories Popular All-Inclusive Resorts Popular Singles Resorts Popular Spa Resorts Popular Cheap Resorts Popular Hotels With Waterparks Popular All-Inclusive Family Resorts Popular All-Inclusive Hotels Popular Boutique Hotels Popular Spa Hotels Popular Hostels Things to Do Restaurants All Miami Beach Restaurants Restaurants near Monterrey Bar Popular Types of Food Latin Restaurants in Miami Beach Healthy Restaurants in Miami Beach Fast Food Restaurants in Miami Beach Cuban Restaurants in Miami Beach Argentinian Restaurants in Miami Beach Peruvian Restaurants in Miami Beach Turkish Restaurants in Miami Beach Vegetarian Restaurants in Miami Beach Vegan Restaurants in Miami Beach Gluten Free Restaurants in Miami Beach Chinese Restaurants with Outdoor Seating in Miami Beach Delis for Lunch in Miami Beach Fusion Restaurants for Families in Miami Beach Popular Dishes Best Nachos in Miami Beach Best Mac and cheese in Miami Beach Best Pad Thai in Miami Beach Best Cannelloni in Miami Beach Best Kale Salad in Miami Beach Best Shrimp in Miami Beach Best Peking Duck in Miami Beach Best Pasta in Miami Beach Best Ramen in Miami Beach Best Beef Bourguignon in Miami Beach Best Udon & Soba (Wheat & Buckwheat Noodle) in Miami Beach Best Chicken And Waffles in Miami Beach Best Risotto in Miami Beach Best Curry in Miami Beach Best Tiramisu in Miami Beach Popular Restaurant Categories Breakfast Restaurants in Miami Beach Lunch Restaurants in Miami Beach Dinner Restaurants in Miami Beach Private Dining Restaurants in Miami Beach Restaurants with Outdoor Seating in Miami Beach Late Night Restaurants in Miami Beach Kid Friendly Restaurants in Miami Beach Restaurants for Group Dining in Miami Beach Restaurants with a View in Miami Beach Restaurants for Special Occasions in Miami Beach Desserts in Miami Beach Coffee & Tea in Miami Beach Bakeries in Miami Beach Popular Neighbourhoods Flamingo / Lummus Restaurants City Center Restaurants North Shores Restaurants Oceanfront Restaurants South Pointe Restaurants Bayshore Restaurants Nautilus Restaurants Flights Holiday Rentals Travel Stories Cruises More Tours Add a Place Travel Forum Airlines Travellers' Choice Help Centre Trip Planner © 2025 Tripadvisor LLC All rights reserved. Terms of Use Privacy and Cookies Statement Cookie consent Site Map How the site works Contact us Accessibility Statement This is the version of our website addressed to speakers of English in United Kingdom . If you are a resident of another country or region, please select the appropriate version of Tripadvisor for your country or region in the drop-down menu. Tripadvisor   LLC makes no guarantees for availability of prices advertised on our sites and applications. Listed prices may require a stay of a particular length or have blackout dates, qualifications or other applicable restrictions. Tripadvisor   LLC is not responsible for any content on external web sites that are not owned or operated by Tripadvisor  . Tripadvisor LLC is not a booking agent or tour operator. When you book with one of our partners, please be sure to check their site for a full disclosure of all applicable fees. Read more £ GBP United Kingdom"
    },
    {
      "url": "https://www.standardhotels.com/privacy",
      "text": "NYC & Miami Hip Hotels | The Standard Hotels - Privacy Hotels High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Privacy Print STANDARD INTERNATIONAL GLOBAL PRIVACY POLICY Last Updated: August 24, 2021 Standard International Management, LLC, Standard Asia Co., Ltd. and each of their affiliates (“The Standard”, “we”, “our”, or “us”) recognize the importance of protecting the personal information we may collect from guests, visitors and any other individual or entity (“Users”, “you”, or “your”). This Privacy Policy applies to data collection and privacy practices of The Standard and when we collect personal information through your use of The Standard website, www.standardhotels.com , and any of our other related sites, software and applications accessible on or by any domain owned by us (including any translations of the same, the “Site” or “Sites”), through our social media pages or mobile applications that we control, through email messages that we may send to you, and when you visit or stay as a guest at one of our properties or purchase related services (collectively, the “Services”).  Please note that this Privacy Policy excludes services that state that they are offered under a different privacy policy. For residents of California, please see “ PRIVACY NOTICE FOR RESIDENTS OF CALIFORNIA “ below. IF YOU WISH TO EXERCISE YOUR RIGHTS UNDER APPLICABLE DATA PRIVACY LAWS, PLEASE EMAIL DPO@STANDARDHOTELS.COM OR SUBMIT A REQUEST HERE AND READ BELOW FOR MORE INFORMATION. This Privacy Policy covers the following topics: When this Privacy Policy Applies Website Terms of Use Information We Collect How We Obtain Personal Information Cookies and Similar Technologies How We Use Personal Information We Collect Our Legal Basis for Collecting Personal Information Sharing Personal Information International Transfer Your Privacy Choices PRIVACY NOTICE FOR RESIDENTS OF CALIFORNIA Information Collected Related to California Residents Use and Disclosure of Information Collected Related to California Residents “Sale” of Personal Information Direct Marketing Privacy Rights Specific to California Residents Privacy Rights Specific to Certain Residents of Europe Privacy Rights Specific to Certain Residents of Thailand OTHER IMPORTANT INFORMATION Your Failure to Provide Personal Information Our Retention of Your Personal Information How We Protect Personal Information Your Marketing Choices Links to Other Websites Children’s Privacy Privacy Policy Modifications How to Contact Us Please familiarize yourself with our privacy practices. As one of our guests or as a visitor using the Sites or Services, you understand and agree that we collect, use and disclose your Personal Information in accordance with this Privacy Policy and applicable data privacy laws. By accessing or using the Sites or Services in any manner, you agree to the terms and conditions in this Privacy Policy.  If you have any questions or comments about this Privacy Policy, please contact us at DPO@standardhotels.com . When this Privacy Policy Applies Our Privacy Policy applies to all of the Services offered by The Standard to our guests and other individuals who visit our properties, use our Services or use our Sites, including contact persons and/or authorized representatives of our corporate clients, suppliers or vendors and/or prospective clients, suppliers or vendors. Our Privacy Policy is intended to describe our data collection practices globally and applies unless there is a specific country privacy policy which applies to you or to the location where you are staying or visiting as a guest. However, because the data protection and privacy laws in some jurisdictions where our hotels and Services are located may restrict our data collection and processing practices, our practices may be more restrictive subject to local laws. Our Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you, or other sites linked from our Sites or Services. For example, this Privacy Policy does not apply to our processing of your Personal Information on behalf of third parties such as companies that offer packaged travel arrangements. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our Services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads. Website Terms of Use By accessing or using the Sites or Services in any manner, you also agree to be bound by our Terms of Use (the “Terms”) available at https://www.standardhotels.com/legal . Please read the Terms carefully. If you do not accept all of the terms and conditions contained in or incorporated by reference into the Terms, please do not use the Sites or Services. Information We Collect We collect information, including Personal Information, to provide better Services to all our guests and visitors. We use the term “Personal Information” to refer to any information that identifies or can be used to identify you, whether directly or indirectly, such as your name, email address, payment data and the information described below. The Personal Information which we collect includes, but is not limited to, the following circumstances and data elements: If you express an interest in obtaining additional information about our Services, request customer support, use the \"Contact Us\" or similar features on our Site or Services, register to use our Sites or Services, or download certain content, we may require that you provide to us your contact information as specified at the time, including your name, organization, phone number, or email address, and in some instances, you may elect to provide us with location and address information; If you voluntarily submit certain information in connection with the use of the Sites or other Services, such as making a booking reservation, purchase or other transaction, using our WiFi, filling out a survey about your guest experience or entering a contest or promotion, we collect the information you have provided as part of such Services; If you report a problem or have a question about our Services, you may provide us with contact information, such as a phone number or email address; If you stay at one our properties, we may collect: Your name, contact details and demographic information (for example, gender or age); Your financial and billing information, such as credit card details; Information about your travel details, preferences and history, or relating to your reservation, for example your arrival and departure information, special requests, vehicles brought onto the property, concierge, health club, spa, room delivery and other services; Information collected through the use of a closed circuit television system, internet systems, smart or mobile device, card key and other security and technology systems, used in connection with, for example, responding to emergencies and incidents; If you or your organization plans an event or meeting at one our facilities, we may collect Personal Information related to the event or meeting such as the guest list and information about the guests at your event; If you use and interact with our Sites or Services (including email), we may automatically collect information about your device and your usage of our websites or emails through cookies, web beacons or similar technologies, such as Internet Protocol (IP) addresses or other identifiers, which may qualify as Personal Information under applicable law; and In some instances, you may provide to us Sensitive Personal Information. We use the term “Sensitive Personal Information” as defined by the privacy laws in some countries, which means personal information from which we can determine or infer an individual’s racial or ethnic origin, political opinions, religious beliefs, trade union membership or professional association, physical or mental health condition, medical treatment, genetic data, biometric information, and information about an individual’s sexual life or sexual orientation. We only process Sensitive Personal Information in your jurisdiction to the extent permitted by applicable law. You are not required to provide The Standard with any of your Sensitive Personal Information, and choosing not to do so will not prevent you from purchasing any Services from The Standard. We do not generally collect Sensitive Personal Information unless it is volunteered by you. For example, we may use health information provided by you to serve you better and meet your particular needs, such as for the provision of disability access. If you provide us or our service providers with any Personal Information relating to other individuals, you represent that you have the authority to do so and acknowledge that it will be used in accordance with this Privacy Policy. If you believe that your Personal Information has been provided to us improperly, or to otherwise exercise your rights relating to your Personal Information, please contact us by using the information set out in the “How to Contact Us” section below. How We Obtain Personal Information We obtain the categories of Personal Information listed above from the following categories of sources: Directly from our guests or their agents. For example, from information that our guests provide to us in order to reserve a room at a hotel. Indirectly from our guests or their agents. For example, through information we collect from our clients in the course of providing Services to them. Directly and indirectly from activity on our Sites and Services. For example, from website usage details that are collected as described in this Privacy Policy or by cookies (described below). From social media websites, such as Facebook, LinkedIn, and Instagram. From third parties that assist us in providing certain transactions and services, even though it appears that you may not have left our Site, for example reservations, online travel agencies, payment processing, and hosting. Cookies and Similar Technologies We and our partners use various technologies to collect and store information when you visit one of our Sites or Services, and this may include using cookies or similar technologies to identify your browser or device. We may also use these technologies to collect and store information when you interact with services from our partners, such as advertising services. Our third-party advertising and analytics partners include Google and similar partners. The technologies we use for this automatic data collection may include: Cookies : A cookie is a small text file stored directly on your device that a website can use to recognize repeat users, facilitate the User’s ongoing access to and use of the Site and to track usage behavior of, for example, the webpages you visit. You may refuse to accept browser cookies by activating the appropriate setting on your browser. However, if you select this setting you may be unable to access certain parts of our services. Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our services. Web Beacons : Pages of our services or our e-mails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags and single-pixel gifs) that permit us, for example, to count Users who have visited those pages or opened an e-mail and for other related website statistics (for example, recording the popularity of certain website content and verifying system and server integrity). Clickstream Data : Clickstream data is information collected by our computers when you request webpages from the Sites. Clickstream data may include information such as the page served, the time spent viewing the page, source of the request, type of browser making the request, the preceding page viewed and similar information. Clickstream data permits us to analyze, for example, how visitors arrive at the Sites, what type of content is popular, and what type of visitors in the aggregate are interested in particular kinds of content on the Sites. Location-Based Services : We may collect the location of the device used to access the Site or Services, for example by using WiFi signals or other technologies. This information will be collected only if you consent to enable location-based capabilities on your device. You can decide at any time not to share your location, or to limit when your location is collected, by choosing the applicable setting on your device. “Do Not Track” Signals: The Standard does not track its Users across third-party websites but may track your actions regarding our advertisements on third-party websites. Some third-party websites do keep track of your browsing activities when they serve you content, however, which enables them to tailor what they present to you. If you are visiting such sites, your browser may include controls to block and delete cookies, web beacons and similar technologies, to allow you to opt out of data collection through those technologies.  We do not honor browser do-not-track signals at this time. How We Use Personal Information We Collect We use your Personal Information in ways that are compatible with the purposes for which it was collected or authorized by you, including for the following purposes: To present, operate or improve the Site and Services, including analysis of activity; To inform you about Services and products available from The Standard or that may otherwise be of interest to you; To fulfill the services, reservations, purchases and other transactions that you  (or, if applicable, anyone involved in the process of making your travel arrangements) request from us, including facilitating your requests to plan and purchase hotel accommodations or other travel services such as transportation and to reserve dining, lounge and spa services; To authorize access to our Sites and Services; To validate your identity or verify communications from you; To offer and administer programs; To customize or tailor your experience of the Services; To manage, store and enhance guest data and preferences; To communicate about, and administer your participation in, special programs, surveys, contests, online campaigns, online programs, sweepstakes, prize draws and other offers or promotions, and to deliver pertinent emails; To send you confirmations, updates, security alerts, and support and administrative messages and otherwise facilitate your use of, and our administration and operation of, the Services; For marketing purposes, including but not limited to, facilitating interest-based advertising, creating traveler profiles, creating custom audiences to target online and mobile advertising, sending integrated marketing messages across channels and devices, personalizing email marketing that we send to you, sending you other promotional materials, and notifying you about special promotions, offers, events or opportunities that may be of interest to you; To facilitate social sharing functionality; To improve our customer service, conduct customer satisfaction, market research, and quality assurance reviews; To respond to and support Users regarding their use of the Sites and Services; To process applications for employment that you submit through the Sites (or third-party sites); For our legitimate business purposes, such as data analysis, audits, operating and expanding our business activities; To administer general recordkeeping; To comply with all applicable legal requirements, codes of practice, guidelines, or rules, or to assist in law enforcement and investigations conducted by any governmental and/or regulatory authority, or courts; To investigate possible fraud or other violations of our Terms of Use or this Privacy Policy and/or attempts to harm our guests or visitors; and For any other purpose that is disclosed to you at the point of collection of the personal information, for any purpose for which you provide your prior consent, or for any other lawful purpose. We and our service providers may use IP addresses to understand the locations from which our guests and visitors are accessing the Services.  Except where prohibited by applicable law or regulation, we may combine information collected through one source with information obtained through other resources. We also may supplement the information we collect with information obtained from third parties. We will treat any information that we combine with your personal information as Personal Information pursuant to this Privacy Policy. We may use your Personal Information in furtherance of our legitimate interest to provide you with the Services offered by us. We may also use your information to manage our contractual relationship with you, to proceed with your request to entering into a contractual relationship with us, or to comply with our legal obligations. To the extent we rely on consent for the processing of your Personal Information, we will seek such consent at the time we collect your Personal Information. We may also use the Personal Information we obtain about you in other ways for which we provide specific notice at the time of collection. Our Legal Basis for Collecting Personal Information Whenever we collect Personal Information from you, we may do so on the following legal bases: Your consent to such collection and use; Out of necessity for the performance of an agreement between us and you, such as your agreement to use our Services or your request for Services; Our legitimate business interest, including but not limited to the following circumstances where collecting or using Personal Information is necessary for: Intra-organization transfers for administrative purposes; Product development and enhancement, where the processing enables The Standard to enhance, modify, personalize, or otherwise improve our Services and communications for the benefit of our visitors and guests, and to better understand how people interact with our Sites and Services; Fraud detection and prevention; Enhancement of our cybersecurity, including improving the security of our network and information systems; and General business operations and diligence. When we need to comply with our legal obligations under applicable laws, rules or regulations, including without limitation, to the order of governmental authorities or courts. Provided that, in each circumstance, we will weigh the necessity of our processing for the purpose against your privacy and confidentiality interests, including taking into account your reasonable expectations, the impact of processing, and any safeguards which are or could be put in place. In all circumstances, we will limit such processing for our legitimate business interest to what is necessary for its purposes. Sharing Personal Information We disclose your Personal Information for a business purpose to the following categories of third parties: Our affiliates, both within and outside your jurisdiction; Owners and franchisees of properties operating under our family of trademarks and brands, who may use that information for the purposes disclosed in or consistent with the terms of this Privacy Policy, including without limitation those uses identified in the “ How We Use Personal Information We Collect ” section above and to provide you with information or Services relating to those properties, as well as marketing information relating to their products, services, and other opportunities; New owner and/or manager of a hotel or other property previously operated under our family of trademarks and brands following a change in management or ownership of the hotel or other property; Strategic business partners who provide goods, services and offers that enhance your experience at our properties, or that we believe will be of interest to you; Third parties and commercial providers to whom you or your agents authorize us to disclose your Personal Information in connection with the Services we provide to you. These third parties may include accommodation and food service providers, transportation services, health club, spa, concierge and other outlets and similar vendors in order to provide our Services and programs to you; and Service providers and other third parties we use to support our business, including without limitation those performing core services  (such as reservations, billing, credit card processing, customer support services, customer relationship management, property management, accounting, auditing, processing insurance claims, administering sweepstakes, surveys, advertising and marketing, analytics, email and mailing services, data storage, and security) related to the operation of our business and/or the Services, the operation of our properties, the provision of services at those properties, the processing and fulfillment of your reservations and requests, participation in and the administration of sweepstakes, contests and other promotions, and making certain functionalities available to our Users. We may disclose your Personal Information for legal reasons. Specifically, we will share Personal Information with companies, organizations or individuals outside of The Standard, including legal advisors, consultants, insurers and insurance brokers, governmental authorities, arbitration institutions and courts if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to: Fulfill any purpose for which you provide it as described in this Privacy Policy; Meet any applicable law, regulation, legal process or enforceable governmental request; Enforce applicable Terms of Use, including investigation of potential violations; Detect, prevent, or otherwise address fraud, security or technical issues; Protect against harm to the rights, property, assets or safety of The Standard, our guests or the public,  content found on the Services, or to protect the Services from unauthorized use or misuse, as required or permitted by law; Facilitate a business transfer, such as to a buyer or other successor in the event of merger, acquisition, consolidation, divestiture, change in control, dissolution or other sale or transfer of some or all of The Standard's assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which Personal Information held by The Standard about its guests and users will be among the assets to be transferred, and any such successor may use your information for the same purposes set forth in the Privacy Policy. For any other purpose disclosed when you provide the information; and When we obtain your consent to do so. We attempt to notify visitors and guests about legal demands for their Personal Information when appropriate in our judgment, unless prohibited by law or court order or when the request is an emergency. We may dispute such demands when we believe, in our discretion, that the requests are overbroad, vague or lack proper authority, but we have no obligation to do so. International Transfer We have centralized some of our data processing activities and, as a result, we may, directly or indirectly through our organization and affiliates, and through third-party entities around the world, process, store, and transfer the information you provide, including your Personal Information, as described in this Privacy Policy and in accordance with applicable data privacy laws. Specifically, such information and Personal Information may be transferred to, and stored at, a location outside of your jurisdiction, such as the United States or the location of the hotel where you are staying. The jurisdiction where your Personal Information will be processed may or may not have laws that seek to preserve the privacy of Personal Information. Your Personal Information may also be processed by staff operating outside of your jurisdiction who work for us or for one of the organizations outlined in this Privacy Policy in connection with the activities outlined in this Privacy Policy. By submitting your Personal Information using the Sites or Services, you understand and agree to this transfer, storing or processing. As described below in “ How We Protect Personal Information “, we have put in place commercially reasonable technical and organizational procedures to safeguard the treatment of information and Personal Information, in accordance with applicable law. Your Privacy Choices You may have certain rights relating to your Personal Information under local data privacy and protection laws. Subject to applicable law, you may make requests regarding your Personal Information, such as deleting your Personal Information, correcting your Personal Information, and obtaining a copy of your Personal Information. To make such a request, please email DPO@standardhotels.com or submit a request here , or write us at the address indicated in “ How to Contact Us ” below.  To help protect your privacy and maintain security, we will take steps to verify your identity before granting you access to the information. For California residents, please see Privacy Rights Specific to California Residents below. For residents of the European Union, United Kingdom and Switzerland, please see Privacy Rights Specific to Certain Residents of Europe below. For residents of Thailand, please see Privacy Rights Specific to Certain Residents of Thailand below. When permitted by law, we may charge an appropriate fee to cover the costs of responding to your request and refuse to comply with requests that are clearly unfounded, repetitive or excessive. PRIVACY NOTICE FOR RESIDENTS OF CALIFORNIA Pursuant to the California Consumer Privacy Act of 2018 (“CCPA”), we are providing California residents with the following additional information regarding the categories of their Personal Information that we have collected or disclosed in the previous twelve months: Information Collected Related to California Residents We collect the following categories of Personal Information: Category of Personal Information Examples A. Identifiers. First and last name, postal address, unique personal identifier, online identifier. B. Personal information categories defined in California safeguards law. Name, address, telephone number, financial information. C. Characteristics of protected classifications under federal and California law Gender, age, citizenship, national origin, marital status, medical conditions, primary language. D. Commercial information. Records of products or services purchased, obtained, or considered, financial details, purchasing or consuming histories or tendencies. From time-to-time we may also collect the following categories of Personal Information: Category of Personal Information Examples E. Internet or other similar network activity. Interaction with the Sites. F. Geolocation Data Device location, IP location. G. Sensory data. Audio, electronic, visual or similar information recorded in connection with our business activities. H. Inferences drawn from other personal information. Profile reflecting a person's preferences, behavior, and attitudes. Use and Disclosure of Information Collected Related to California Residents The Standard may use your Personal Information for the purposes described above in “ How We Use Personal Information We Collect ”, and may disclose your Personal Information to third-party commercial providers for a legitimate business purpose, which include, for example, verifying your identity when making a payment. When we disclose Personal Information for these reasons, the provider is generally required both to keep that Personal Information confidential and not use it for any purpose except for the purposes set forth in the contract with such provider. In the preceding twelve (12) months, we have disclosed the following categories of Personal Information for one or more business purposes: Identifiers, such first and last name, postal address, unique personal identifier, online identifier; Personal information categories defined in California safeguards law, such as name, address, telephone number, financial information; Characteristics of protected classifications under federal and California law, such as gender, age, citizenship, national origin, marital status, medical conditions, primary language; Commercial information, such as records of products or services purchased, obtained, or considered, financial details, purchasing or consuming histories or tendencies; Internet or other network activity information, such as interaction with the Sites; Geolocation data, such a device location, IP location; Sensory data, such as audio, electronic, visual or similar information recorded in connection with our business activities; Inferences drawn from other personal information, such as a profile reflecting a person's preferences, behavior, and attitudes. “Sale” of Personal Information As described above, we have disclosed your Personal Information to third parties in connection with providing you with certain Services and for other business purposes.  Under the broad definition of what constitutes a “sale” under CCPA, such disclosure may constitute a “sale” of your Personal Information. Direct Marketing California residents are entitled to contact us to request information about whether we have disclosed Personal Information to third parties for the third parties’ direct marketing purposes and may choose to opt-out of the sharing of Personal Information with third parties for direct marketing purposes by (a) sending an email to DPO@standardhotels.com with the subject heading “California Privacy Rights,” (b) submitting a request here or (c) sending a letter addressed to Standard International, Attention: DPO/Legal, 23 East 4th Street, 5th Floor, New York, NY 10003.  In your request, please attest to the fact that you are a California resident and provide a current California address for our response. Please be aware that not all information sharing is covered by the California privacy rights requirements and only information on covered sharing will be included in our response.  We reserve our right not to respond to requests submitted to addresses other than the addresses specified in this paragraph. Privacy Rights Specific to California Residents Under the CCPA, California residents have specific rights regarding their personal information. This section describes Californians’ rights and explains how California residents can exercise those rights. Right to Delete Your Data. You have the right to request that we delete any of your Personal Information that we collected from you and retained, subject to certain exceptions. Once we receive and confirm your verifiable consumer request, we will delete (and direct our service providers to delete) your Personal Information from our records, unless an exception applies. Right to Access Your Data . You have the right to request that we disclose certain information to you about our collection, use and disclosure of your Personal Information over the past twelve (12) months. Any disclosures we provide will only cover the 12-month period preceding the receipt of your request.  The response we provide will also explain the reasons we cannot comply with a request, if applicable. Right to Data Portability. You have the right to a “portable” copy of your Personal Information that you have submitted to us.  Generally, this means you have a right to request that we move, copy or transmit your Personal Information stored on our servers or information technology environment to another service provider’s servers or information technology environment. Right to Non-Discrimination for the Exercise of Your Privacy Rights. You have the right not to receive discriminatory treatment by us for exercising your privacy rights conferred by the California Consumer Privacy Act. If you are a California resident who chooses to exercise your rights, you can: Submit a request via email to DPO@standardhotels.com , or Submit a request here , or Call (212) 965-4309 to submit your request. You may also designate an agent to exercise your privacy rights on your behalf. In order to designate an authorized agent to make a request on your behalf, you must provide a valid power of attorney, the requester’s valid government-issued identification, and the authorized agent’s valid government issued identification. Upon receiving your request, we will confirm receipt of your request by sending you an email. To help protect your privacy and maintain security, we may take steps to verify your identity before granting you access to the information. In some instances, such as a request to delete personal information, we may first separately confirm that you would like for us to in fact delete your personal information before acting on your request. We will respond to your request within forty-five (45) days. If we require more time, we will inform you of the reason and extension period in writing. In some cases our ability to uphold these rights for you may depend upon our obligations to process Personal Information for security, safety, fraud prevention reasons, compliance with regulatory or legal requirements, listed below, or because processing is necessary to deliver the services you have requested. Where this is the case, we will inform you of specific details in response to your request. We may deny your deletion request if retaining the information is necessary for us or our service providers to: Complete the transaction for which we collected the Personal Information, provide a good or service that you requested, take actions reasonably anticipated within the context of our ongoing business relationship with you, or otherwise perform our contract with you; Detect security incidents, protect against malicious, deceptive, fraudulent, or illegal activity, or prosecute those responsible for such activities; Debug products to identify and repair errors that impair existing intended functionality; Exercise free speech, ensure the right of another consumer to exercise their free speech rights, or exercise another right provided for by law; Comply with the California Electronic Communications Privacy Act; Engage in public or peer-reviewed scientific, historical, or statistical research in the public interest that adheres to all other applicable ethics and privacy laws, when the information's deletion may likely render impossible or seriously impair the research's achievement, if you previously provided informed consent; Enable solely internal uses that are reasonably aligned with consumer expectations based on your relationship with us; Comply with a legal obligation; or Make other internal and lawful uses of that information that are compatible with the context in which you provided it. Privacy Rights Specific to Certain Residents of Europe The European Union’s General Data Protection Regulation (“ GDPR ”), and corresponding legislation in the United Kingdom and Switzerland, provide residents of the EU, United Kingdom and Switzerland with certain rights in connection with Personal Information you have shared with us. If you are such a resident, you may have the following rights: The right to be informed. You are entitled to be informed of the use of your Personal Information.  This Privacy Policy provides such information to you. The right of access . You have the right to request a copy of your Personal Information which we hold about you. The right of correction . You have the right to request correction or changes of your Personal Information if it is found to be inaccurate or out of date. The right to withdraw consent. You have the right to withdraw a previously given consent for processing your Personal Information for a specific purpose. The right to be forgotten. You have the right to request us, at any time, to delete your Personal Information from our servers and to erase your Personal Information when it is no longer necessary for us to retain such data.  Note, however, that deletion of your Personal Information will likely impact your ability to use our services. The right to object (opt-out). You have the right to opt-out of certain uses of your Personal Information, such as direct marketing, at any time. The right to data portability. You have the right to a “portable” copy of your Personal Information that you have submitted to us.  Generally, this means your right to request that we move, copy or transmit your Personal Information stored on our servers or information technology environment to another service provider’s servers or information technology environment. The right to refuse to be subjected to automated decision making, including profiling. You have the right not to be subject to a decision and insist on human intervention if the decision is based on automated processing and produces a legal effect or a similarly significant effect on you. The right to lodge a complaint with a supervisory authority . You have the right to lodge complaints about our data processing activities by filing a complaint with us or with the relevant Supervisory Authority. A list of Supervisory Authorities is available here: http://ec.europa.eu/justice/data-protection/bodies/authorities/index_en.htm . You may exercise any of the rights described in this section by sending an email to DPO@standardhotels.com or by submitting a request here . Please note that we may ask you to verify your identity and request before taking further action on your request. We may respond to your request by letter, email, telephone or any other suitable method. GDPR Representative Osano International Compliance Services Limited ATTN: PGX4 25/28 North Wall Quay Dublin 1, D01 H104 IRELAND Privacy Rights Specific to Certain Residents of Thailand Subject to limitations and conditions of applicable law, you are entitled to the following rights to your Personal Information: (a) Request to have access to and obtain a copy of your Personal Information, and to request the disclosure of the source of the Personal Information, in the event that your Personal Information was collected without your consent; (b) To request to obtain your Personal Information in a format which is generally readable or usable by automatic tool or device, if any, and to request that your Personal Information in such format be transmitted to another data controller; (c) request that your Personal Information be deleted, destructed or de-identified where: (i) your Personal Information is no longer necessary for the purpose of which your Personal Information has been collected, used or disclosed; (ii) you have withdrawn your consent and we do not have any other legal authorization to continue to collect, use or disclose your Personal Information; (iii) you have exercised the right to object; or (iv) your Personal Information has been unlawfully collected, used or disclosed; (d) object to the collection, use or disclosure of your Personal Information in particular circumstances, including, without limitation, where your Personal Information is processed by relying on legitimate interest as a legal basis, or where your Personal Information is processed for the direct marketing purpose; (e) request that the processing of your Personal Information be suspended where: (i) you have requested to exercise the right to correction and such request is under examination; (ii) your Personal Information has been unlawfully collected, used or disclosed, but you do not want to have it deleted or destructed; (iii) your Personal Information is no longer necessary, but you would like to have it retained for the purpose of establishing, complying, exercising or defending a legal claim; or (iv) you have requested to exercise the right to objection and such request is under examination; (f) Request that your Personal Information be corrected, updated, or completed; (g) Withdraw your consent at any time, provided that there is no other legal ground for us to continue with the processing of your Personal Information (if applicable); and (h) Lodge complaints to the competent authority. You may exercise any of the rights described in this section by sending an email to DPO@standardhotels.com or by submitting a request here . Please note that we may ask you to verify your identity and request before taking further action on your request. We may respond to your request by letter, email, telephone or any other suitable method. OTHER IMPORTANT INFORMATION Your Failure to Provide Personal Information Your provision of Personal Information is required in order to use certain Services and programs.  In some instances, if you fail to provide such Personal Information, you may not be able to access and use our Services, or parts of our Services. In addition, we may not be able to perform our contractual obligation, either in whole or in part, or to proceed with you request to entering into a contractual relationship with us, as the case may be.  Moreover, where our processing of your Personal Information is based on legal obligation, failure to provide your Personal Information under such circumstance may result in your and/or our violation of applicable law or regulations. Our Retention of Your Personal Information We use and retain your Personal Information for as long as necessary to fulfill the purpose for which it is being processed, to carry out legitimate business interests, as well as on the basis of applicable legal requirements (such as applicable statutes of limitation). After expiry of the applicable retention periods, your Personal Information will be deleted. If there is any data that we are unable, for technical reasons, to delete entirely from our systems, we will put in place appropriate measures to prevent any further use of such data. How We Protect Personal Information The Standard maintains commercially reasonable technical and organizational safeguards designed to protect the User's Personal Information against accidental, unlawful or unauthorized destruction, loss, alteration, access, disclosure or use. For example, we and/or our service providers use commercially reasonable security measures such as encryption, firewalls, Secure Socket Layer software (SSL) or hypertext transfer protocol secure (HTTPS) to protect Personal Information. Although we take reasonable steps designed to protect your Personal Information, please be advised that no security system or means of transmitting data over the Internet can be guaranteed to be entirely secure (including without limitation with respect to computer viruses, malicious software and hacker attacks).  We cannot and do not guarantee or warrant the security of your Personal Information or any other information you disclose or transmit to us.  We are not responsible for the acts of those who gain unauthorized access, and we make no warranty, express, implied or otherwise, that we will prevent such access, and we are not responsible for any damages or liabilities relating to any such incidents to the fullest extent permitted by law. Where required under law, we will notify you of any such loss, misuse or alteration of Personal Information that may affect you so that you can take the appropriate actions. For your own privacy protection, we urge you to keep all passwords confidential.  We also recommend that you do not include sensitive information such as passwords, social security numbers or payment information, in any emails that you send to us. If you become aware of any breach of the terms of this Privacy Policy or of the security of the Services, please notify us by email at DPO@standardhotels.com . Your Marketing Choices You may have certain choices when it comes to how we use your data and we want to provide you with information to make the choices that are right for you. Interest-Based Ads and Other Online Advertising. Visit www.networkadvertising.org or www.aboutads.info to learn more about your options for opting out of interest-based advertising. We do not guarantee that all of the third parties we work with will honor the elections you make using those options.  Please also keep in mind that even if you opt-out of receiving ads tailored to your apparent interests, you will continue to see online ads, but the ads that you see therefore may be less relevant to your interests. Mobile Devices. Your mobile device may offer settings relating to cookies, pixel tags, Flash, cookies, and other similar technologies.  We encourage to you to visit your device’s help menu to learn about your options to limit tracking when using your device. For some information on controlling your mobile choices, please visit https://www.networkadvertising.org/mobile-choices . Social Media Platforms and Networks. We encourage you to review your privacy options and settings with the social media platforms and networks you use to understand what choices you have about sharing information from those platforms and networks with us. Email Marketing. You can opt-out of receiving marketing emails from us by sending us an email stating your request to DPO@standardhotels.com or by submitting a request here . If we or one of our service providers acting on our behalf have sent you a promotional email, you may use the “unsubscribe” link. Please keep in mind that opting out of marketing emails may impact our ability to allow you access to certain offers, benefits and features. Please also note that even if you opt out of receiving certain marketing emails, that opt-out may not apply to other transactional or legal communications that you may continue to receive from us, such as customer service messages, messages about transactions with us, notices about our policies and terms, and emails responding to your communications with us or requests for information that we receive from you. Notwithstanding anything else in this Privacy Policy, please note that we always reserve the right to contact you in the event of a change in this Privacy Policy, or to provide you with any service-related notices. Links to Other Websites The Sites or Services may contain links to webpages operated by parties other than The Standard. We do not control such websites and are not responsible for their contents or the privacy policies or other practices of such websites. Our inclusion of links to such websites does not imply any endorsement of the material on such websites or any association with their operators. Further, you access linked sites at your own risk and, by accessing them, you are leaving the Sites, and you understand it is up to the User to take precautions to ensure that whatever links the User selects or software the User downloads (whether from this Site or other websites) is free of such items as viruses, worms, trojan horses, defects and other items of a destructive nature. These websites and services may have their own privacy policies, which the User will be subject to upon linking to the third party’s website. The Standard strongly recommends that each User review the third party’s terms and policies. If you have any questions about the privacy practices of other websites, you should contact the relevant parties controlling these websites for more information. Children’s Privacy The Sites and Services are not designed or intended to be used by anyone under the age of 18. If you are under the age of 18 (or an age that is considered a minor in the jurisdiction in which you are accessing our Sites or Services), please do not use the Sites or Services, make reservations or other purchases via the Services, use any interactive features of the Services, or post any Personal Information to our Sites or submit any Personal Information via the Services. We do not knowingly or intentionally gather Personal information about children.  If a child has provided us with Personal Information, a parent or guardian of that child may contact us to have the information deleted from our records. If you believe that we might have any information from a child, please contact us DPO@standardhotels.com . If we learn that we have inadvertently collected the Personal Information of a child, we will take steps to delete the information as soon as possible and cease the use of that information in accordance with applicable law. Privacy Policy Modifications Our Privacy Policy may change from time to time. We will post any privacy policy changes on this page and will keep prior versions of this Privacy Policy in an archive for your review upon request to DPO@standardhotels.com . We will inform you if we make substantial changes to this Privacy Policy, and if required by applicable law or regulation, obtain your consent prior to such changes become effective. How to Contact Us If you have any questions, comments or concerns about this Privacy Policy, or if you would like to exercise your rights discussed above, please contact us: Via e-mail: DPO@standardhotels.com By submitting a request here (only for exercising rights under applicable data privacy laws) By writing to us: Standard International Management, LLC Attn: DPO/Legal 23 East 4th Street, 5th Floor New York, NY 10003 USA Standard Asia Co., Ltd. Attention:  DPO/Legal 59 Soi Rim Khlong Phra Khanong, Phra Khanong Nuea, Vadhana, Bangkok 10110 Thailand Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://monterreymexican.com/contact-us/",
      "text": "Contact Us | Monterrey Mexican Bar & Grill (574) 204-2281 contact@monterreymexican.com 0 Items Home About Us Menu Main Menu Drink Menu Specials Monterrey Coffee Blend Catering & Events Event Space Catering Get In Touch Monterrey Cares APPLICATION Contact Us Order Carryout Select Page Questions, Comments, Concerns? If so, please do not hesitate to contact us below. We look forward to hearing from you! DROP US A LINE HERE & WE WILL BE IN TOUCH! Name Email Address Message 12 + 6 = Submit Hours of Operation Monday 10am – 9pm Tuesday – Wednesday 10am – 9pm Thursday – Saturday 10am -10pm Sunday 10am – 9pm Contact Us Today LOCATED AT: 507 E McKinley Ave, Mishawaka, IN 46545 PHONE: (574) 204-2281 JOIN OUR VIP LIST! Join our VIP email list to receive regular monthly offers with coupons and specials. Success! First Name Last Name Email Subscribe Drop Us a Line Don’t be shy. Let us know if you have any questions! Contact Us We are located at 507 E. McKinley Rd., Mishawaka, IN. 46545 Get Directions © Monterrey Mexican Bar & Grill 2016-2024  Designed By ELITE RED MEDIA This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach/faqs",
      "text": "FAQs for The Standard, Miami Beach | The Standard Hotels Miami Beach High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Frequently Asked Questions Spa/Pool How much is a Day Pass? For a limited time, you can reserve Day Passes through ResortPass , Monday-Thursday, which grants you access to the Pool area only . If you're looking to enjoy full access of all amenities including the spa, when you book any Spa service from Monday to Thursday that is over $125 or from Friday to Sunday that is over $250, we'll give you exclusive access to enjoy our hydrotherapy amenities. These offers are based on availability. You can browse our services here: https://www.standardhotels.com/miami/properties/miami-beach#spa What are the hours of the Gym? The Standard, Miami Gym is open daily from 06:00 AM to 10:00 PM, offering classes taught by world-class instructors, spanning everything from yoga and fitness to meditation and integrated wellness. Find more information here: https://www.standardhotels.com/miami/properties/miami-beach#spa How do I book a Spa service? To book a Spa Service at The Standard, Miami Spa simply go to https://www.standardhotels.com/miami/properties/miami-beach#spa for our service menu and to book an appointment. You can select from hydrotherapy, Turkish-style hammam, aroma steam room, sauna, ice room, Roman waterfall hot tub, arctic plunge, treatment baths, and an infinity pool. What areas are clothing optional? At The Standard, Miami guests are allowed to be topless in our pool area and spa amenity rooms only. Bottoms must be worn at all times. Can women be topless? At The Standard, Miami, our female guests can be topless while at the pool or in our third floor Spa amenities. Clothing is required in all public areas. Is your Spa closed? When will it reopen? The Spa at The Standard, Miami is open and better than ever. The indoor and outdoor hydrotherapy playground amenities including the infinity pool, arctic plunge, hot tub, hamam, steam room, sauna, and ice room are complimentary to hotel guests. Find more information here: https://www.standardhotels.com/miami/properties/miami-beach#spa Do you have WiFi at the pool? The Standard, Miami offers free Wifi access across the entire property, including our pool, spa and gym area. Can anyone use the pool? Access to the pool at The Standard, Miami is only for members and hotel guests. If you would like to have access to our hydrotherapy playground you can contact Membership@StandardMiami.com to learn more about our Membership program. What are your boat docking fees? Looking for boat docking at The Standard, Miami? For visitors, boat docking is $100 for the first four hours and $50 per additional hour. What are the hours of the Spa? The Standard, Miami Spa is open daily from 08:00 AM to 10:00 PM, offering hydrotherapy, Turkish-style hammam, aroma steam room, sauna, ice room, roman waterfall hot tub, arctic plunge, treatment baths, ice room, and an infinity pool. Find more information here: https://www.standardhotels.com/miami/properties/miami-beach#spa Rooms Is there a porterage fee for boxed deliveries to the hotel? Yes, there is a porterage fee of $5 per boxed delivery to the hotel. This fee covers the handling and delivery of boxed items to your room or designated area within the hotel premises. Do I get access to the Spa? Our hotel guests enjoy full access to our hydrotherapy playground. Not a guest? When you book any Spa service from Monday to Thursday that is over $125 or from Friday to Sunday that is over $225, we'll give you exclusive access to enjoy our hydrotherapy amenities. This offer is based on availability. You can browse our services here: https://www.standardhotels.com/miami/properties/miami-beach#spa Can I use the amenities before check in and after check out? Want to use the Pool, Spa or The Gym at The Standard, Miami before checking in or after checking out? You are welcome to arrive as early or stay as late as you'd like during your stay. How many people can stay in one room? All of the rooms at The Standard, Miami are suitable for sleeping up to 3 guests. The first 2 guests are included within your reservation rate, but a 3rd guest is an additional $100 per day. If you are traveling with more than two friends and want to stay close, you can contact our reservations team at Miami@StandardMiami.com so we can reserve rooms in closer proximity, if available. Link: https://www.standardhotels.com/miami/properties/miami-beach#room_viewer_1685 Can I bring my pet? The Standard, Miami is a pet friendly hotel and welcomes all type of pets. Our furry friends stay for free. When is check in/check out? Check in at The Standard, Miami is at 04:00 PM and check out is at 12:00 PM. Do you have room with tubs? Looking for a room with a bathtub? Our Bath Terrace rooms have outdoor soaking tubs on your own private terrace. Click here to find out more about our rooms. Can I have guests to the pool? For a room reservation with occupancy of one person, you are permitted two guests to use the amenities at The Standard, Miami. If your room already has a two-person occupancy reserved then one additional guest may be permitted. Up to one additional guests can be included for $100+tax per day. Do you have disabled rooms? The Standard, Miami offers a few different ADA accessible rooms. If they're available for booking, you'll see them listed on our booking page as \"with ADA Accessible Shower.\" Link: https://www.standardhotels.com/miami/properties/miami-beach#room_viewer_1685 Do you have connecting rooms? Looking to be close with your travel buddies? Even though we don't offer connecting rooms, you can contact our reservations team at Miami@StandardMiami.com so we can reserve rooms in closer proximity, if available. Link: https://www.standardhotels.com/miami/properties/miami-beach#room_viewer_1685 What are your resort fees and incidental charges? With your stay, a daily $55+tax resort fee which includes access to our hydrotherapy playground, health & wellness classes, bikes, gym access, wi-fi, watersports, Tesla chargers, and more. When you check in, the hotel will take an authorization for room and tax plus $250 per night to cover incidentals (e.g. the minibar, mattresses on the roof, etc.). If you use a debit or check card, your bank may place a hold on your account in that amount for up to two weeks after departure. Do you have rooms with double beds? Looking for a room with a double bed? All of our rooms have either one queen or king-sized bed along with a daybed. Click here to find out more about our rooms. Can I bring my children? The Standard, Miami is an adult-only hotel so guests must be 18+ to stay and 21+ to check-in. The Lido Bayside Grill and Cafe Standard are the only areas on property where guests under 18 are allowed. Sales/Events/Misc Can I do a photoshoot on your property? Want to do a photoshoot at The Standard, Miami? you can arrange a shoot (fashion, ad, corprorate of any other photo shoot) with prior approval and with a location fee. Please contact miami@standardmiami.com for additional information. Do you have any upcoming events? There are always events, talks, parties, and happenings at the Standard, Miami. The best place to see our full events calendar is our happenings page here . How much is valet? The Standard, Miami offers a valet parking service so you can relax and get your stay started right. The first five hours is $45 and each additional hour is $5. Overnight parking for guests is $60. Excludes tax. Members enjoy special discounted rates. Looking for an airport shuttle or transportation to The Standard, Miami? Our concierge will be happy to assist in arranging car service. Simply contact them Crispy@StandardMiami.com Are you on the beach? The Standard, Miami is at a perfect distance from South Beach, situated on Biscayne Bay with waterfront views. You can drive or walk to the beach as it is only a mile away. Find us here: https://goo.gl/maps/7pguQupgFAqYuyk47 How do I make a reservation for a group of rooms? Group reservations for the Standard, Miami couldn't be easier: simply email us at Miami@StandardMiami.com with how many rooms you would like to book and the dates you will be staying with us. Can I host a private event? If you are looking to host a private event with the Standard, Miami (corporate, brand, social, or any other event!) you are in the right place - our team will find the perfect space for you. Get in touch with them at MiamiEvents@StandardMiami.com or find out more information here. Link: https://www.thestandardevents.com/miami Do you offer any special rates for Corporate clients? Looking for The Standard Miami Corprorate rates and perks? Simply email Miami@Standardmiami.com and we will be able to tell you if your company is currently included in The Standard Miami corproate program or give you information on how to sign up for corporate discounts and perks. Do you have self-parking? Looking for parking at The Standard, Miami? We offer a valet parking service so you can relax and get your stay started right. Please be advised we don't offer self-parking. How do I apply to be a Member? Want to become a member at The Standard, Miami? Simply contact membership@standardmiami.com to learn more about our Membership program. How far is the beach? The Standard, Miami is located just 10 minutes away from South Beach in Miami by car, as it is only a mile away. Prefer to walk? South Beach is 20 minutes away from The Standard, Miami on foot. Find us here: https://goo.gl/maps/7pguQupgFAqYuyk47 Food and Beverage What are the hours of the restaurant? The Lido Bayside Grill restaurant at The Standard, Miami is open daily from 08:00 AM to 12:00 AM. You can find out more here: https://www.lidobayside.com/ Whar are the hours of the cafe? Cafe Standard at The Standard, Miami is open daily from 07:00 AM to 05:00 PM You can find out more here: https://www.standardhotels.com/miami/features/cafe-standard-miami What are the hours of the bar? At The Standard Spa, Miami we have three bars: Monterrey Bar is open daily from 05:00 PM to 12:00 AM. You can find out more here: https://www.standardhotels.com/miami/features/monterrey-bar Lido Bayside Bar is open daily from 08:00 AM to 12:00 AM. You can find out more here: https://www.standardhotels.com/miami/features/bayside-grill Belle Bar is open Thursdays - Mondays, 11:15 AM - 8:00 PM You can find out more here: https://www.standardhotels.com/miami/features/belle Can I make a reservation for a large group? Want to make a reservation for a large group at Lido Bayside Grill or Monterrey Bar? If your party is larger than 10 guests please contact MiamiEvents@StandardMiami.com. Otherwise, you can make a reservation directly at Lido Bayside Bar, and Monterrey Bar is first come, first serve. When is your happy hour? High Tides Happy Hour takes place from Monday to Thursday from 04:00 PM to 06:00 PM at Belle Bar at The Standard, Miami. Do you have a brunch menu? Breakfast is offered Monday throught Friday at Lido Bayside Grill of The Standard, Miami from 08:00 AM to 11:15 AM. Our All Day menu is available 12PM-11PM. Brunch is available on Saturday and Sunday from 08:00 AM to 3:30 PM. Do you allow children at the restaurant? Lido Bayside Grill and Cafe Standard are the only two dining areas on property where guests under 18 are allowed. Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://www.standardhotels.com/contacts/new",
      "text": "Contact Us – Hotel & Property Inquiries | The Standard Hotels Hotels High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Contact Send a hotel inquiry Fields marked with asterisk (*) are required Property High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Name Email Message I agree to receive emails from The Standard about promotions, news and special events. I agree to The Standard's Terms of Use and have read and understood the Privacy Policy . Press Inquiries Contact Us Get on the List and Get Up To 15% Off Wanna be the first to know about exclusive offers, events and happenings? Sign up for our mailing list and get 15% off your stay. Email First name Last name Country Country Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, The Democratic Republic of the Cook Islands Costa Rica Côte d'Ivoire Croatia Cuba Curaçao Cyprus Czechia Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Minor Outlying Islands United States Uruguay Uzbekistan Vanuatu Venezuela Vietnam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe State State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming City Date of birth All Properties The Standard, High Line, NYC The Standard, East Village, NYC The Standard, Miami Beach The Standard, London The Standard, Ibiza The Standard, Brussels The Standard, Maldives The Standard, Hua Hin The Standard, Singapore The Standard, Bangkok The Standard, Pattaya Na Jomtien I would like to receive emails from The Standard about promotions, news and special events. I agree to The Standard's Terms of Use and have read and understood the Privacy Policy . Submit Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://www.standardhotels.com/legal",
      "text": "New York, London, Maldives, Miami Beach Hotels | The Standard Hotels - Hotels High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Legal Print GUEST POLICY The Standard Hotel is a welcoming environment and does not tolerate discrimination against, or harassment of, its guests. Federal, state and local laws prohibit discrimination on the basis of race, color, and military status. The Standard Hotels are subject to these laws.   Patrons may file a complaint for alleged discrimination with The Standard Hotels' management. Patrons of The Standard, High Line may also file a complaint with the New York State Office of the Attorney General. TERMS OF USE (\"TERMS\") Last updated:  December 21, 2022 Please read these Terms of Use (\"Terms\") carefully before using the Standard International website, www.standardhotels.com , and any of our other related sites, communications, capabilities, mobile or web applications and services (including any translations of the same, the “Site” or “Sites”) accessible on any domain owned or operated by Standard International Management, LLC or its affiliates in the jurisdiction where the property you wish to obtain services is located (“The Standard”, “us”, “we”, or “our”). Our Sites are controlled and operated from the United States and are subject to United States law. Your access to and use of the Sites are conditioned upon your acceptance of and compliance with these Terms. These Terms apply to all visitors, users and others who wish to access or use the Sites. THESE TERMS INCLUDE A MANDATORY AGREEMENT TO ARBITRATE, WHICH MEANS THAT YOU AGREE TO SUBMIT ANY DISPUTE RELATED TO YOUR USE OF THE SITE TO BINDING INDIVIDUAL ARBITRATION RATHER THAN PROCEED IN COURT. THESE TERMS ALSO INCLUDE A CLASS ACTION WAIVER, WHICH MEANS THAT YOU AGREE TO PROCEED WITH ANY DISPUTE INDIVIDUALLY AND NOT AS PART OF A CLASS ACTION. DO NOT ACCESS OR USE THE SITE IF YOU DO NOT AGREE TO THESE TERMS IN THEIR ENTIRETY. By accessing or using the Site in any manner you agree that (1) you have read and familiarized yourself with these Terms and our Privacy Policy, (2) you understand these Terms and our Privacy Policy, and (3) you are bound by these Terms by your use of the Site. You are entering into this agreement with The Standard to be bound by the Terms. If you disagree with any part of the Terms then you do not have permission to access the Sites. Modification of These Terms We reserve the right at any time, at our sole discretion, to change or otherwise modify the Terms without prior notice, and such changes will be effective immediately upon posting.  Unless otherwise indicated, any new material added to the Site will also be subject to the Terms. Be sure to return to this page periodically to review the most current version of the Terms, as they are binding on you. Notwithstanding the above, if the change is substantial and may cause an adverse effect to you, we may notify you of such change, where applicable, prior to it becoming effective.  In any event, your continued access or use of the Site signifies your acceptance of the updated or modified Terms. Who Can Use the Site The services of the Sites are available only to individuals who can form legally binding contracts under applicable law. By using the Sites, you represent that you are not considered a minor and are of sufficient legal age to use the Sites and to create binding legal obligations for any liability you may incur as a result of the use of the Sites. If you are submitting information for a business entity, by doing so, you represent that you have the authority to bind that business entity to the Terms. We may, in our sole and absolute discretion, refuse to allow use of the Sites or accept a person’s or entity’s information and may, at any time, refuse to permit a person’s, or entity’s, continuing use of the Sites for any reason or for no reason, in our sole discretion. Limited Permitted Uses You may use the Site or related mobile or web applications for the purpose of booking hotel reservations or using  the other functions we make available on the Site or such applications for their intended purposes.  Any other uses are strictly prohibited, including but not limited to as described in the Interactive Areas and User Conduction and Obligations sections. When booking a hotel reservation, you agree to the guest reservation policy provided at the time of booking. Interactive Areas Please be aware that by submitting any message, data, information, text, music, sound, photos, graphics, code or any other content to the Site by electronic mail, postings on the Site, or to social network platforms operated by The Standard, including any questions, comments, suggestions, ideas or the like contained in any submissions (collectively, “Submissions”), you are certifying that you are the rightful owner or licensee of the Submission and you grant The Standard a worldwide, nonexclusive, royalty-free, perpetual, transferable, irrevocable and fully sublicensable right and license, without additional consideration to you or any third party, to (a) use, reproduce, modify, adapt, translate, distribute, publish, create derivative works from and publicly display, perform and otherwise exploit such Submissions in any media, now known or hereafter devised; and (b) use the name that you submit in connection with such Submission. You acknowledge that The Standard may choose to provide attribution of your comments or reviews at our discretion. You acknowledge and agree that Submissions are non-confidential and non-proprietary. The Site may contain forums or other means where you or third parties may post content, messages, materials or other items on the Site (“Interactive Areas”). If The Standard provides such Interactive Areas, you are solely responsible for your use of such Interactive Areas and use them at your own risk. By using any Interactive Areas, you expressly agree not to post, upload to, transmit, distribute, store, create or otherwise publish through the Site any of the following: 1.     Any Submission that is false, unlawful, libelous, defamatory, obscene, pornographic, indecent, lewd, suggestive, harassing, threatening, invasive of privacy or publicity rights, abusive, inflammatory, fraudulent or otherwise objectionable; 2.     Submissions that would constitute, encourage or provide instructions for a criminal offense, violate the rights of any party, or that would otherwise create liability or violate any local, state, national or international law; 3.     Submissions that may infringe any patent, trademark, trade secret, copyright or other intellectual or proprietary right of any party; 4.     Submissions that impersonate any person or entity or otherwise misrepresents your affiliation with a person or entity, including The Standard; 5.     Unsolicited promotions, political campaigning, advertising, contests, raffles, or solicitations; 6.     Private information of any third party, including, without limitation, names, addresses, phone numbers, email addresses, Social Security numbers, credit card numbers and any other personally identifiable information; 7.     Viruses, corrupted data or other harmful, disruptive or destructive files; 8.     Any Submission that is unrelated to the topic of the Interactive Area(s) in which such Submission is posted; or 9.     Submissions or links to content that, in the sole judgment of The Standard, (a) violates the previous subsections herein, (b) is objectionable, (c) restricts or inhibits any other person from using or enjoying the Interactive Areas or the Site, or (d) exposes or could expose The Standard to any harm or liability of any type. To the extent permitted by applicable laws, The Standard takes no responsibility and assumes no liability for any Submissions posted, stored or uploaded by you or any third party, or for any loss or damage thereto, nor is The Standard liable for any mistakes, defamation, slander, libel, omissions, falsehoods, obscenity, pornography or profanity you may encounter. The Standard is not liable for any statements, representations or Submission provided by its Users in any public forum, personal home page or other Interactive Area. If you choose to make any of your personally identifiable or other information publicly available through the Site, you do so at your own risk.  Although The Standard has no obligation to screen, edit or monitor any of the Submissions posted to or distributed through any Interactive Area, The Standard reserves the right, and has absolute discretion, to remove, screen or edit without notice any content posted or stored on the Site at any time and for any reason. To the extent permitted by applicable law, you hereby waive any moral rights or other rights with respect to attribution of authorship or integrity of materials regarding each Submission that you may have under any applicable law.  If it is determined that you retain moral rights in Submissions, you hereby declare that (a) you do not require that any personally identifying information be used in connection with the Submission, or any derivative works of or upgrades or updates thereto; (b) you have no objection to the publication, use, modification, deletion and exploitation of the Submission by The Standard or its licensees, successors and assigns; (c) you forever waive and agree not to claim or assert any entitlement to any and all moral rights of an author in any of the Submission; and (d) you forever release The Standard, and its licensees, successors and assigns, from any claims that you could otherwise assert against The Standard by virtue of any such moral rights. Any violation of the foregoing violates the Terms and may result in, among other things, termination or suspension of your rights to use the Interactive Areas and/or the Site. See “Termination”, below. User Information and The Standard Privacy Policy In the course of using the Site, you may provide or we may collect or otherwise receive information about you. We are committed to protecting the privacy of our users’ information. The Standard Privacy Policy governs the use of information collected from or provided by you through the Site. Please click here to review our current Privacy Policy. You may need to register to use all or part of the Site. We may reject, or require that you change, any user name, password or other information that you provide to us in registering. Your user name and password are for your personal use only and should be kept confidential. You should use particular caution when accessing your Site account from a public or shared computer so that others are not able to view or record your password or other personal information. You, and not The Standard, are responsible for any use or misuse of your user name or password, and you must promptly notify us of any confidentiality breach or unauthorized use of your user name or password, or your Site account. User Conduct and Obligations The content and information on the Site (including, but not limited to, messages, data, information, text, music, sound, photos, graphics, video, maps, icons, software, code or other material), as well as the infrastructure used to provide such content, is proprietary to The Standard. Without our prior written permission, you may not use, copy, reproduce, republish, upload, post, transmit, distribute or modify our trademarks or other proprietary information in any way. You agree to follow all applicable laws and regulations when using the Site. You may not use the Site in any manner that could damage, disable, overburden, or impair the Site or interfere with any other party’s use and enjoyment of the Site. Additionally, you agree not to: 1.     Provide false or misleading information about yourself to The Standard, impersonate any other person, or otherwise attempt to mislead others about your identity or the origin of any content, message or other communication; 2.     Register, subscribe, attempt to register, attempt to subscribe, unsubscribe, or attempt to unsubscribe any party for any services if you are not expressly authorized by such party to do so; 3.     Collect information about other visitors to our Site without their consent or otherwise systematically extract data or data fields, including without limitation any financial data or email addresses; 4.     Probe, scan, test the vulnerability of or breach the authentication measures of the Site or any related web pages, networks or systems; 5.     Use any robot, spider, scraper, deep link or other automated or manual means to access the Site, or copy and/or redistribute any content, information or software on the Site; 6.     Manipulate or otherwise display the Site by using framing, creating deep-links to the Site by bypassing the Site’s home page, mirroring or similar navigational technology or directly link to any portion of the Site other than the main home page; 7.     Attempt to modify, translate, adapt, edit, decompile, disassemble, or reverse engineer any software programs used by The Standard in connection with the Site; 8.     Input or upload to the Site any information that contains viruses, Trojan horses, worms, time bombs or other computer programming routines that are intended to damage, interfere with, intercept or expropriate any system, the Site or information or that infringes the intellectual property rights of another; 9.     Input or upload to the Site any information that is prohibited by applicable laws or regulations, or which is contrary to public order or good morals; 10.   Use or access the Site for any unlawful or illegal activities; 11.   Use or access the Site in any way that, in The Standard’s sole judgment, adversely affects the performance or function of the Site or interferes with the ability of authorized parties to access the Site, including but not limited to any action that imposes, or may impose, in The Standard’s sole discretion, an unreasonable or disproportionately large load on our infrastructure; or 12.   Engage in, perform or conduct any of the prohibited actions or activities described in these Terms or otherwise identified by us from time to time. Electronic Communications When you visit the Site or send or accept electronic messages through the Site, you are communicating with us electronically, and as a result, you consent to receive communications from us electronically. We may communicate with you by email or other authorized form of electronic message or by posting notices on the Site. You agree that all agreements, notices, disclosures and other communications that we provide to you electronically satisfy any legal requirement that such communications be in writing. You further agree that any notices provided by us electronically are deemed to be given and received on the date we transmit any such electronic communication as described in the Terms. You have a right to withdraw your consent to receive electronic communications at any time, and may assert other rights available to you by applicable law, as set forth in our Privacy Policy. You acknowledge that such withdrawal of consent will prohibit you from accessing and using core functionalities of the Site. Intellectual Property Except for public domain material, the Site is protected by intellectual property laws, including U.S. copyright laws and your local copyright laws. You are hereby granted a non-exclusive license to use the Content at the Site while connected to the Site (including, where available, to email individual Content to others directly from the Sites), but only for your personal, non-commercial use. Except as expressly provided above, all other rights are reserved. Among other things, except to the extent required for the limited purpose of reviewing material on the Site, electronic reproduction, adaptation, distribution, performance or display is prohibited. Commercial use of any of the Content is strictly prohibited. Use of any of our trademarks such as metatags on other web sites also is strictly prohibited. You may not display the Site in frames (or any of the Content via in-line links) without our express written permission, which may be requested by contacting us. In addition to the intellectual property rights mentioned above, for purposes of these Terms, “Content” is defined as all information such as the “look and feel” of the Site, data files, graphics, text, photographs, drawings, logos, images, sounds, music and video and audio files on the Site. The Standard tries to ensure that the Content is accurate and complete. Your use of the Site is at your risk. The Standard does not warrant that the functional aspects of the Site or the Content will be error free or that the Site, the Content or the server that makes it available are free of viruses or other harmful components. The Standard and its suppliers make no warranties about the Content or about results to be obtained from using the Site. You bear the entire risk of the completeness, accuracy or usefulness of any Content found on the Site. The Standard reserves the right to withdraw, temporarily or permanently, any Content from the Site at any time and for any reason and such removal may be immediate and without notice. As an express condition to your use of and access to the Site, you acknowledge, agree and confirm that The Standard is not liable to you or any third party for any such withdrawal. Copyright and Trademark Notices All trademarks, trade names, logos, images, typefaces, graphics, service marks and trade dress displayed on the Site (collectively, the “Marks”) are the property of The Standard or its licensors, content providers or other third parties. Nothing in these Terms or on the Sites shall be construed as granting, by implication, estoppel or otherwise, any license or right to use any Mark without the prior written consent of The Standard or the owner of the Mark. In addition, the look and feel of the Site, including all page headers, custom graphics, button icons and scripts, is the service mark, trademark and/or trade dress of The Standard and may not be copied, imitated or used, in whole or in part, without the prior written permission of The Standard. All other trademarks, registered trademarks, product names and company names or logos mentioned in the Site are the property of their respective owners. Reference to any products, services, processes or other information, by trade name, trademark, manufacturer, supplier or otherwise, does not constitute or imply endorsement, sponsorship or recommendation thereof by The Standard. If you are aware of an infringement of The Standard’s intellectual property rights, please let us know by emailing us at DPO@standardhotels.com . Digital Millennium Copyright Act Notice The Standard respects the intellectual property rights of others. The Standard may, in appropriate circumstances and at its sole discretion, terminate the access of Users who infringe the copyrights or intellectual property rights of others. If you believe your work has been copied and is accessible at the Site, or other social network platforms operated by The Standard, in a way that constitutes copyright infringement, or that the Site contains links or other references to another online location that contains material or activity that infringes your copyright, you may notify us by providing our copyright agent the information required by the U.S. Online Copyright Infringement Liability Limitation Act of the U.S. Digital Millennium Copyright Act (“DMCA”). Our agent for notice of claims of copyright infringement on or regarding the Site can be reached by mail at 23 East 4th Street, 5th Floor, New York, NY 10003, Attn:  Legal, with a copy by email to DPO@standardhotels.com . Your notice must satisfy the requirements of the DMCA and include the following information: 1.     Your name, mailing address, and email address; 2.     A statement identifying the copyrighted material you claim is infringed, such as a URL linking to an authorized version of the copyrighted material; 3.     A statement identifying where the allegedly infringing material is located, such as URL linking to the allegedly infringing material; 4.     A statement that you have a good faith belief that the allegedly infringing material identified in section (2), above, is not authorized by the copyright owner, its agent, or the law; 5.     A statement, made under penalty of perjury, that the information in this notice is accurate and that you are the owner of the copyrighted material or are authorized to act on behalf of the owner of the copyrighted material; and 6.     An electronic or physical signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed. Limitation of Liability TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAWS, IN NO EVENT SHALL THE STANDARD OR ITS DIRECTORS, OFFICERS, AGENTS, PARTNERS, INVESTORS, EMPLOYEES, SUCCESSORS OR ASSIGNS BE LIABLE FOR ANY INCIDENTAL, INDIRECT, EXEMPLARY, SPECIAL, PUNITIVE AND CONSEQUENTIAL DAMAGES, LOST PROFITS, OR ANY KIND OF DAMAGES WHATSOEVER (INCLUDING, WITHOUT LIMITATION, ATTORNEYS’ FEES AND LOST PROFITS OR SAVINGS) RESULTING FROM LOST DATA OR BUSINESS INTERRUPTION RESULTING FROM THE USE OF OR INABILITY TO USE THE SITE, INTERACTIVE AREAS, OR RELATED SERVICES, WHETHER BASED ON WARRANTY, CONTRACT, TORT, OR ANY OTHER LEGAL THEORY, AND WHETHER OR NOT THE STANDARD IS ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. TO THE FULLEST EXTENT PROVIDED BY LAW, IN NO EVENT WILL THE STANDARD OR ITS DIRECTORS, OFFICERS, AGENTS, PARTNERS, INVESTORS, EMPLOYEES, SUCCESSORS OR ASSIGNS BE LIABLE IN THE AGGREGATE FOR ANY AMOUNT IN EXCESS OF ONE HUNDRED DOLLARS ($100). THE FOREGOING DOES NOT AFFECT ANY LIABILITY THAT CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. Disclaimer of Warranties The material on the Site could include technical inaccuracies or other errors. Your use and browsing of the Site are at your own risk. Neither The Standard nor any other party involved in creating, producing or delivering the Site shall be liable for any direct, incidental, consequential, indirect, or punitive damages arising out of your access to, or use of, the Site. The Standard does not warrant that the functional aspects of the Site will be uninterrupted or error free or that the Site or the server that makes it available are free of viruses or other harmful components. If your use of the Site or the material contained on the Site results in the need for servicing or replacing property, material, equipment, or data, The Standard is not responsible for those costs. THE STANDARD MAKES NO REPRESENTATIONS ABOUT THE SUITABILITY OF THE INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES, CONTAINED ON THE SITE FOR ANY PURPOSE, AND THE INCLUSION OR OFFERING OF ANY PRODUCTS OR SERVICES ON THE SITE DOES NOT CONSTITUTE ANY ENDORSEMENT OR RECOMMENDATION OF SUCH PRODUCTS OR SERVICES BY THE STANDARD. ALL SUCH INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES ARE PROVIDED “AS IS” AND “AS AVAILABLE” WITHOUT WARRANTY OF ANY KIND. THE STANDARD DISCLAIMS ALL WARRANTIES AND CONDITIONS THAT THE SITE, ITS SERVERS OR ANY EMAIL SENT FROM THE STANDARD, ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. THE STANDARD HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS WITH REGARD TO THIS INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES, INCLUDING ALL IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NONINFRINGEMENT. THE FOREGOING DOES NOT AFFECT ANY WARRANTIES THAT CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. Indemnification and Release You agree to defend and indemnify The Standard and each of its subsidiaries, affiliates, directors, officers, agents, partners, investors, employees, successors and assigns from and against any claims, causes of action, demands, recoveries, losses, damages, fines, penalties or other costs or expenses of any kind or nature, including but not limited to reasonable legal and accounting fees, arising from: 1.     Your breach of these Terms; 2.     Your violation of any law or the rights of a third party; or 3.     Your use of the Site. You and each of your successors, assigns, subsidiaries and affiliates, hereby unconditionally release and forever discharge The Standard and its directors, officers, agents, partners, investors, employees, successors and assigns harmless from any and all complaints, claims, charges, damages, demands, suits, actions and causes of action, whether at law or in equity (including attorneys’ fees, costs and expenses), known and unknown, suspected and unsuspected, disclosed and undisclosed, arising out of or in any way connected with your use of the Site. Termination You agree that The Standard, in its sole discretion, may terminate or suspend your use or access to the Site, Interactive Areas, Submissions, and related services at any time and for any or no reason, in its sole discretion, and without prior notification, even if access and use continues to be allowed to others. Upon such suspension or termination, you must immediately (a) discontinue use of the Site, and (b) destroy any copies you have made of the Site. Accessing the Site, Interactive Areas, Submissions, and related services after such termination, suspension or discontinuation shall constitute an act of trespass. Further, you agree that The Standard shall not be liable to you or any third party for any termination or suspension of your access to the Site, Interactive Areas, Submissions and related services. Third Party Services and Content The Site may contain links to Sites, pages, accounts or other electronic media owned or controlled by parties other than The Standard. Such links are provided for your reference and convenience only. We do not control such Sites and are not responsible for their contents or the privacy or other practices of such Sites. We make no representations or warranties about the content, completeness, accuracy or security of third party sites. Further, it is up to you to take precautions to ensure that whatever links you select or apps, files or software you download (whether from the Site or such other sites) are free of such items as viruses, worms, Trojan horses, defects and other items of a destructive nature. Our inclusion of links to such sites does not imply any endorsement of the material on such sites or any association with their operators. In some cases you may be asked by a third-party site to link your profile on The Standard to a profile on another third-party site. Choosing to do so is purely optional, and the decision to allow this information to be linked can be disabled (with the third-party site) at any time. General You agree to use the Site in strict compliance with all applicable laws, rules, rulings and regulations and in a fashion that does not, in the sole judgment of The Standard, negatively reflect on the goodwill or reputation of The Standard and shall take no actions that would cause The Standard to be in violation of any laws, rules, rulings or regulations applicable to The Standard.  It is your responsibility to understand and obey all applicable local, state, federal and foreign laws (including minimum age requirements) regarding the possession, use and sale of any product for sale on the Site, including regarding any Transaction (defined below). The Standard and the Site are based in the United States. The Standard controls and operates the Site through its headquarters in New York, New York, and makes no representation that these materials are appropriate or available for use in other locations. If you use the Site from other locations, you are responsible for compliance with applicable local laws. The Site may describe products that are not available worldwide. If any provision of these terms or conditions is held to be unenforceable, the unenforceable portion shall be construed in accordance with applicable law to the greatest extent possible and the remainder of the provisions shall remain in full force and effect. The Standard makes all reasonable attempts to keep the information on the Site updated, complete, and accurate. The information is intended for general purposes and nothing contained in the Site is intended to be used as medical advice.  We make reasonable efforts to accurately display the attributes of the Content and products for sale on the Site, including applicable colors, however the actual colors you see will depend on your computer system, and we cannot guarantee that your computer will accurately display such colors. The Standard reserves the right to investigate any suspected breaches of the Site security or these Terms and involve law enforcement authorities in investigating any such matters and prosecute violators to the full extent of the law. YOU WAIVE AND HOLD HARMLESS THE STANDARD AND ITS AFFILIATES FROM ANY CLAIMS RESULTING FROM ANY ACTION TAKEN BY THE STANDARD DURING, OR TAKEN AS A CONSEQUENCE OF, INVESTIGATIONS BY EITHER THE STANDARD OR LAW ENFORCEMENT AUTHORITIES. Transactions We may make available the ability to purchase or otherwise obtain certain products through the Sites (a “Transaction”). If you wish to make a Transaction, you may be asked to supply certain relevant information, such as your credit card number and its expiration date, your billing address, your shipping information and other personally identifiable information. You represent and warrant that you have the right to use any credit card that you submit in connection with a Transaction. By submitting such information, you grant to us the right to provide such information to third parties for purposes of facilitating Transactions. Verification of information may be required prior to the acknowledgment or completion of any Transaction. By making a Transaction, you represent that the applicable products will be used only in a lawful manner. The Standard reserves the right, including without prior notice, to limit the available quantity of or discontinue making available any product; to impose conditions on the honoring of any coupon, discount or similar promotion; to bar any user from making any Transaction; and to refuse to provide any user with any product. Refunds and exchanges will be subject to The Standard’s applicable refund and exchange policies. You agree to pay all charges incurred by you or on your behalf through the Site, at the prices in effect when such charges are incurred, including all shipping and handling charges. In addition, you are responsible for any taxes applicable to your Transactions. While it is our practice to confirm orders by e-mail, the receipt of an e-mail order confirmation does not constitute our acceptance of an order or our confirmation of an offer to sell a product or service. Products will be shipped to an address designated by you, if applicable, so long as such address is complete and complies with the shipping restrictions contained on the Site. All Transactions are made pursuant to a shipment contract and, as a result, risk of loss and title for products pass to you upon delivery of the products to the carrier. You are responsible for filing any claims with carriers for damaged and/or lost shipments. Promotions Any sweepstakes, contests, raffles, surveys, games or similar promotions (collectively, “Promotions”) made available through the Site may be governed by rules that are separate from these Terms. If you participate in any Promotions, please review the applicable rules as well as our Privacy Policy. If the rules for a Promotion conflict with these Terms, the Promotion rules will govern. Entire Agreement/Waiver These terms constitute the entire agreement between you and The Standard regarding your use of the Site. The failure of The Standard to exercise or enforce any right or provision of these Terms shall not constitute a waiver of such right or provision. If any provision of these Terms is found to be invalid by any court having competent jurisdiction, the invalidity of such provision shall not affect the validity of the remaining provisions of these Terms, which shall remain in full force and effect. Arbitration Agreement – Legal Disputes By using the Site you unconditionally agree that all claims relating to your access or use of our Site (including any claim that any provision of these Terms are invalid, illegal, or otherwise voidable or void) will be resolved entirely through binding individual arbitration before the American Arbitration Association (“AAA”) or the Judicial Arbitration and Mediation Services (“JAMS”), rather than in court. The Standard shall have the right in a proper case to obtain equitable relief (including restraining orders, injunctive relief and/or certain declaratory relief) from a court of competent jurisdiction. The arbitration proceedings shall be heard by one qualified,  independent arbitrator who shall be a licensed attorney in good standing. The arbitration shall be held in New York, New York and in accordance with, as applicable, the Commercial Arbitration Rules of the AAA or Comprehensive Arbitration Rules and Procedures of the JAMS (or successor rules).  All matters within the scope of the U.S. Federal Arbitration Act will be governed by such act and not by any state law.  Other than as described in these Terms, you and The Standard waive any rights to maintain a court action, administrative proceeding or other available resolution processes for to settle disputes under these Terms. YOU UNDERSTAND THAT ABSENT THIS AGREEMENT TO ARBITRATE, YOU WOULD HAVE THE RIGHT TO SUE IN COURT AND HAVE A JURY TRIAL. YOU HEREBY WAIVE ANY RIGHT TO A JURY TRIAL FOR ANY DISPUTES. The rules in arbitration are different from the rules that apply in court. There is no judge or jury, and review is limited, but an arbitrator can award the same damages and relief, and must honor the same limitations stated in these Terms as a court would. In reaching the decision, the arbitrator shall abide by these Terms, apply applicable law and shall not rule inconsistently with these Terms or applicable law. The arbitration shall be conducted on an individual basis, and not as a consolidated, common, representative, group or class. The award of the arbitrator shall be conclusive and binding upon all parties hereto and judgment upon the award may be entered in any court of competent jurisdiction. Other than as may be required by law, the entire arbitration proceedings (including, but not limited to, any rulings, decisions or orders of the arbitrator), shall remain confidential and not be disclosed to anyone other than you and The Standard and their respective legal counsel. To the extent permitted by applicable law, any and all claims and actions arising out of or relating to the Sites must be commenced within one (1) year after the occurrence of the facts giving rise to such claim or action; otherwise, such claim or action shall be barred. To begin an arbitration proceeding, you may send a letter requesting arbitration and describing your claim to: STANDARD INTERNATIONAL, Attn: Legal, 23 East 4th Street, 5th Floor, New York, NY 10003, with an email copy to DPO@standardhotels.com . Class Action Waiver You agree that you will not file, or participate, in any class action against The Standard.  You also agree that you will not file or seek a class arbitration, or participate in a class arbitration, against The Standard. You expressly waive their right to file a class action, or participate in a class action, against The Standard, or seek any type of relief against The Standard on a class basis. You agree not to file, seek, or participate, in a class arbitration against The Standard. Applicable Law These Terms, and all matters and disputes related to access and use of the Sites, will be governed by the laws of the State of New York and, as applicable, the federal laws of the United States (including the Federal Arbitration Act). Exclusive Venue for Litigation Solely to the extent the arbitration provisions set forth above do not apply, or for purposes of enforcing an award granted to it pursuant to arbitration, any litigation shall be filed exclusively in state or federal courts located in New York, New York, and you expressly consent to exclusive jurisdiction in New York, New York, for any litigation. The foregoing shall not apply to the extent that applicable law in your country of residence requires application of another law and/or jurisdiction and this cannot be excluded by contract. Miscellaneous These Terms do not, and shall not be construed to, create any partnership, joint venture, employer-employee, agency or franchisor-franchisee relationship between you and The Standard. You may not assign, transfer or sublicense any of your rights or obligations under these Terms without our express prior written consent. We may assign, transfer or sublicense any or all of our rights or obligations under these Terms without restriction. No waiver by us of any breach of these Terms will be deemed to be a waiver of other breach. Any heading, caption or section title contained herein is for convenience only. All terms defined in the singular shall have the same meanings when used in the plural, where appropriate and unless otherwise specified. Any use of the term “including” or variations thereof in this Agreement shall be construed as if followed by the phrase “without limitation.” A printed version of this Agreement and of any notice given in electronic form shall be admissible in judicial or administrative proceedings based upon or relating to these Terms to the same extent and subject to the same conditions as other business documents and records originally generated and maintained in printed form. The Standard will not be responsible for any failure to fulfill any obligation due to any cause beyond its control. How to Contact The Standard If you have any questions or comments about the Terms, or your dealings with the Site, please contact us by email sent to DPO@standardhotels.com or by mail at 23 East 4th Street, 5th Floor, New York, NY 10003, Attn:  Legal. Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://leadiq.com/c/the-standard-hotels/5a1d843f24000024005eb404/employee-directory",
      "text": "The Standard Hotel Employee Directory, Headcount & Staff | LeadIQ Learn more at LeadIQ.com Start free The Standard Hotel Employee Directory Hospitality New York, United States 5001-10000 Employees The Standard is the most powerful brand in the lifestyle hotel business.\n\nFounded in 1999, The Standard's irreverent and playful sensibility, combined with a careful consideration of design, detail and service, have established its reputation as a pioneer of hospitality, travel, dining, nightlife, and beyond.\n\nLaunched originally in Hollywood, The Standard has now opened properties in marquee locations across the globe including in New York, Miami, London, the Maldives, Hua Hin, Ibiza, Singapore, Melbourne and Bangkok. Standard hotels in Lisbon, Brussels, Vienna, Dublin, Brooklyn, Pattaya, Mexico, and Austin are under development. \n\nStandard International has expanded their portfolio with branded residences under development in Miami, Brickell, Lisbon, Phuket and Hua Hin. \n\nThe goal of every Standard projectâbe it a city hotel, a seaside resort, or a rooftop barâis to defy convention, up the aesthetic stakes, and deliver an experience that only The Standard can. Sign up for free to view info Company overview Email format Find The Standard Hotel employees' phone numbers or email addresses Find Employee The Standard Hotel Global Highlights Location Employees North America 378 United States Of America 377 Canada 1 Europe 132 United Kingdom Of Great Britain And Northern Ireland 113 Spain 16 France 1 Belgium 1 Netherlands 1 Asia 98 Thailand 52 Maldives 24 Singapore 9 India 5 Sri Lanka 4 Oman 1 Cambodia 1 United Arab Emirates 1 Philippines 1 Oceania 6 Australia 6 Africa 3 Nigeria 2 Zimbabwe 1 South America 2 Brazil 1 Argentina 1 The Standard Hotel 's Leadership A. L. Chief Executive Officer Mobile Phone Email V. H. Chief Design Officer Mobile Phone Email J. S. Chief Revenue Officer Mobile Phone Email C. L. Vice President Sales Middle East & Asia Pacific Mobile Phone Email D. W. Vice President Project Development, Apac & Me Mobile Phone Email J. A. Vice President Of It Mobile Phone Email J. F. Co-Owner Mobile Phone Email W. S. Owner Mobile Phone Email The Standard Hotel Employee Metrics 100% 50% 0% 2025 2024 Finance Sales Engineering Human Resources Administrative Other Contact profiles from The Standard Hotel Name Title Contact Info Location Last Update V. H. Chief Design Officer Mobile Phone Email United States New York Jul 25, 2025 A. L. Chief Executive Officer Mobile Phone Email Feb 14, 2024 J. F. Co-Owner Mobile Phone Email Oct 18, 2024 J. S. Chief Revenue Officer Mobile Phone Email UNITED STATES Jun 25, 2025 W. S. Owner Mobile Phone Email Oct 16, 2024 P. K. Vice President, Human Resources - Middle East And Asia Pacific Mobile Phone Email Thailand Jul 21, 2025 C. L. Vice President Sales Middle East & Asia Pacific Mobile Phone Email Thailand Jun 25, 2025 F. A. Executive Vice President Of Operations Mobile Phone Email Aug 11, 2025 E. J. Global Head, Guest Experience + Performance Mobile Phone Email United Kingdom England Aug 09, 2025 L. B. Vp, Pr & Communications Mobile Phone Email United States New York Jul 25, 2025 1 2 3 â¦ Next > Frequently Asked Questions What is The Standard Hotel known for? The Standard Hotel operates in the Hospitality industry . The company's main headquarters is located in 23 East 4th Street 5th Floor New York, New York 10003 US ; you can contact the main corporate office by phone at +1-212-226-**** . Explore The Standard Hotel 's company overview page for more information. What is The Standard Hotel 's most common email format? The Standard Hotel employees' email format typically follows the pattern of . Trying to find reliable and up-to-date employee contact data? Find more The Standard Hotel email formats with LeadIQ. How many employees does The Standard Hotel have currently? The Standard Hotel has approximately 5K employees as of August 2025 . These team members are located across 6 continents, including North America Europe Asia . Who are The Standard Hotel 's key employees and leadership? As of August 2025 , The Standard Hotel 's key employees include: Chief Executive Officer: A. L. Chief Design Officer: V. H. Chief Revenue Officer: J. S. Vice President Sales Middle East & Asia Pacific: C. L. Vice President Project Development, Apac & Me: D. W. Looking for contact data? Unlock accurate emails and phone numbers for your ideal prospects with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://monterreymexican.com/the-owners/",
      "text": "About Us - Monterrey Mexican Bar & Grill (574) 204-2281 contact@monterreymexican.com 0 Items Home About Us Menu Main Menu Drink Menu Specials Monterrey Coffee Blend Catering & Events Event Space Catering Get In Touch Monterrey Cares APPLICATION Contact Us Order Carryout Select Page About Us Join us at Monterrey and experience the heart and soul of family, food, and giving back. Family Owned Monterrey Mexican Bar & Grill at 507 E. McKinley Ave in Mishawaka is a local, family-owned gem that thrives on serving our community. We’re passionate about creating delicious, authentic Mexican cuisine and providing a warm, welcoming atmosphere for all. Beyond our restaurant, we are dedicated to supporting local organizations and nonprofits to make a positive impact in our community. Join us at Monterrey and experience the heart and soul of family, food, and giving back. “We can’t wait to see you soon!” Megan Ramirez In the Spotlight Quality and Service We pride ourselves in offering Authentic Mexican Cuisine prepared fresh daily by our incredible staff and cooks with an amazing amount of variety to choose from and daily specials. Specials Menu Items Owner Cooks Welcome To Monterrey We invite you to stop in and enjoy Authentic Mexican Food Served Fresh Daily “We can’t wait to see you soon!” Megan Ramirez order carryout View menu Features What We Offer  Daily Menu Specials Enjoy a variety of different specials throughout the week from our menu including lunch specials, dinner specials, and drink specials.  Fresh Ingredients We work to provide fresh and quality ingredients in our kitchen daily to provide you with delicious fresh food.  Tasty Meals Enjoy a variety of delicious dishes and combinations including a 130 different options on our menu served fresh daily.  Excellent Cooks We have four incredible cooks at Monterrey that work very hard on a daily basis to prepare our dishes with consistency and quality.  Authentic Cuisine Enjoy delicious Authentic Mexican dishes created and customized by our cooks giving you the taste of South America you desire.  Family Oriented We pride ourselves on providing a family atmosphere on the family side of the restaurant for families to enjoy an evening out with each other. Hours of Operation Sunday – Wednesday 10am – 9pm Thursday – Saturday 10am – 10pm Contact Us Today LOCATED AT: 507 E McKinley Ave, Mishawaka, IN 46545 PHONE: (574) 204-2281 JOIN OUR VIP LIST! Join our VIP email list to receive regular monthly offers with coupons and specials. Success! First Name Last Name Email Subscribe Drop Us a Line Don’t be shy. Let us know if you have any questions! Contact Us © Monterrey Mexican Bar & Grill 2016-2024  Designed By ELITE RED MEDIA This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://imbibemagazine.com/where-to-drink-monterey-california/",
      "text": "Where to Drink in Monterey, California - Imbibe Magazine Subscribe + Save Skip to content Imbibe-Logo-LIQUID-CULTURE2-10 Recipes Cocktails + Spirits Wine + Beer Food Alcohol-Free Mixers + Garnishes How-To Negroni Week Imbibe 75 Cocktails + Spirits Articles Recipes How-To People Destinations Imbibe 75 Wine + Beer Articles Recipes People Destinations Imbibe 75 Alcohol-Free Articles Recipes People Destinations Imbibe 75 Magazine Current Issue Explore Past Issues Where to Buy Subscribe arrow Get a Subscription Give a Gift Renew/Pay Invoice Manage Subscription Customer Service FAQ icons icons icons Shop Events + Promotions Negroni Week Podcast Newsletter Recipes Cocktails + Spirits Wine + Beer Food Alcohol-Free Mixers + Garnishes How-To Negroni Week Imbibe 75 Cocktails + Spirits Articles Recipes How-To People Destinations Imbibe 75 Wine + Beer Articles Recipes People Destinations Imbibe 75 Alcohol-Free Articles Recipes People Destinations Imbibe 75 Magazine Current Issue Explore Past Issues Where to Buy Subscribe Get a Subscription Give a Gift Renew/Pay Invoice Manage Subscription Customer Service FAQ Shop Events + Promotions Negroni Week Podcast Newsletter icons icons icons Where to Drink in Monterey, California Story: Caroline Pardilla August 23, 2023 Hula's Island Grill virgin piña colada and a dog-friendly patio. | Photo by Caroline Pardilla The beautiful Central Coast town of Monterey, California, has always held a special place in my heart. It’s where I spent my early childhood. But it was only as an adult that I could truly learn to appreciate it, especially where drinking was concerned. Even though Monterey is an established AVA with a noteworthy wine scene, I tend to visit for the tropical libations, craft cocktails, and whiskey. Considering how much there is to do there—from sightseeing to Laguna Seca car events to wine tasting—it’s good to have options to suit every mood and craving. Here are my favorite places to imbibe in Monterey. The Crown & Anchor When I’m in the mood for a casual night with a Black and Tan, a shot of whiskey, and some fish and chips, I head to this underground British pub, located in historic Downtown Monterey. It opened in 1998 and has been voted the best pub in Monterey County Weekly for 19 years. (They first won in 2003, winning every year until 2014, then won again in 2015 and held the crown ever since.) There’s plenty on offer: about 20 beers on tap, including English ales and Irish stouts, plus a list of Irish whiskey and scotch. On dreary nights when the fog rolls in, there’s something comforting about sitting at the bar and digging into a bowl of chowder between sips of ale. Cella Restaurant & Bar Like Stokes Adobe, which is just up the street on Polk, this restaurant features excellent cocktails and food and is also situated in a beautiful historic building. But while Stokes feels a bit more like a special occasion spot, Cella, which sits in the National Trust Historic Site Cooper Molera Gardens , has a neighborhood restaurant vibe. For food, you can stay low-key with burger or opt for scallops or duck breast. And beverage manager Joshua Perry’s creative, culinary-inspired cocktail menu is compelling enough to grab a drink before dinner or even just as a jumping-off point for the night. Explore his original cocktails, such as the Golden Elote with butter-washed mezcal, Amaro Montenegro, corn distillate, piloncillo, and lemon juice. Piña Colada Mai Tai The Zombie Hula’s Island Grill Wherever I travel, I always look up the tropical bar scene; it just doesn’t feel like a getaway without a Piña Colada . Fortunately, Monterey has Hula’s, with a second location up the coast in Santa Cruz. It may not be at the level of Smuggler’s Cove in San Francisco or False Idol in San Diego, but it’s still a welcome respite. I usually like to stop here during a scenic walk along the coast from Fisherman’s Wharf to Pacific Grove. I’ll park myself and my dog on the patio out back and order pupus of coconut shrimp rolls and seared ahi wontons or a slow-roasted pulled pork sandwich. The drink menu features original cocktails as a well as standards, such as the Mai Tai , Zombie , and Tropical Itch, but my go-to is the Painkiller or the virgin Piña Colada if I still have sightseeing to do. Pearl Hour Pearl Hour is a must for a nightcap of creative cocktails and live jazz. The bar by Katie Blandin, owner of cocktail catering company Bar Cart Cocktail Co ., is located up the street from Hula’s on Lighthouse Avenue. On Wednesday and Sunday nights, a live band packs the bar. Fortunately, the large patio out back, which is illuminated by candles, a firepit, and hanging lights, presents plenty of seating away from the crowds. Peruse the extensive cocktail menu of classics, signatures, seasonal drinks, shots, spritzes, spirit-free options, and even a monthly zodiac-inspired drink. Just keep in mind that on nights when there’s live music, to keep service quick, the menu isn’t available. Stokes Adobe’s Crocodile Tail : blanco tequila, dry vermouth, blanc vermouth, mezcal, amaro. | Photo by Kory James/WDS Visuals Stokes Adobe For ghost stories and well-crafted cocktails, stop by this historic two-story adobe townhouse, which was built in 1833. Originally constructed to be a private residence, it has housed several different restaurants over the years, including Gallatin’s and Restaurant 1833. But after a four-year vacancy, it’s now a Michelin-recommended modern cuisine restaurant with the ghost stories intact. Just order Hattie’s Old Fashioned (Elijah Craig Small Batch Bourbon, apricot, aromatic bitters, and citrus essence), named for Hattie Gragg, a socialite who was the last person to have lived in the adobe before passing away in 1948. Even though the menu by beverage manager Matty Eggleston is constantly being updated, this Old Fashioned will stick around. Like Hattie, apparently. The Whisky Club This whisky den on downtown’s Alvarado Street welcomes every kind of whisk(e)y drinker, from straight-sipping aficionados to casual cocktail imbibers. A serious scotch collector himself, owner Michael Sawhney wanted to share his extensive collection, knowledge, and passion for the spirit with the world. After a couple of years building the bar, with delays courtesy of the pandemic, he and his wife LisAnne finally opened the doors in 2022. The bar, which includes a bottle shop in the back, offers flights categorized by price and region. Take a $100 Glenrothes tour or a $27 one featuring California whiskeys by Redwood Empire Distillery in Russian River Valley. Or stop by for a Sazerac or Manhattan . They also welcome dogs, even keeping a stock of dog biscuits behind the bar. Share this article: Caroline Pardilla Caroline Pardilla was one of the first cocktail bloggers in Los Angeles. She was then recruited to further cover the city’s bars and bartenders for publications, such as Eater, Liquor, and Los Angeles Magazine . Now she’s living her dream as the digital content editor for Imbibe and author of Margarita Time . icons On the Menu: Manor Bar Santa Barbara Q&A: Bobby Stuckey of Frasca Food and Wine Inside Look: Daisy Margarita Bar, Los Angeles You Might Also Enjoy Articles Favorite Spots for Martinis in Los Angeles Our resident Angeleno shares her favorite places to enjoy a Martini. Story Caroline Pardilla Articles Where to Drink in Palm Springs, California Tour some of Palm Springs' top drinking destinations. Story Penelope Bass Articles Whisky Dens Around the World Bars and shops that have a special affinity for Scotch whisky. Articles The Soundtrack of Smuggler’s Cove How music helps define the vibe of San Francisco's beloved tiki bar. Story Emma Janzen arrow arrow Subscribe and Save Up to 50% Sign Up Today! Enjoy This Article? Sign up for our newsletter and get biweekly recipes and articles delivered to your inbox. arrow About Imbibe Imbibe is liquid culture. In every issue of the James Beard award-winning magazine and on our website, we celebrate drinks as a distinct culinary category, deserving in-depth exploration of the people, places, cultures and flavors that make the world of drinks so fascinating. Sign Up For Imbibe's Newsletter arrow Column 1 About Advertise Privacy Policy Terms of Use Terms of Sale Contact Us FAQ Job Opportunities Column 2 Subscribe Give a Gift Renew/Pay Invoice Back Issues Books + Merchandise Where to Buy Advertising Inquiries Subscription Inquiries Editorial Inquiries Negroni Week Inquiries Contact info@imbibemagazine.com Call Us Toll-Free 1-877-246-2423 or 503-595-0144 About Subscribe Advertise Service icons icons icons © 2025 Imbibe Media, Inc Privacy Policy Terms & Conditions We use cookies to improve your experience on this website. By using the site, you agree to our privacy policy and use of cookies, but you can adjust your cookie settings. Cookie settings Accept Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT Send this to a friend Send Cancel"
    },
    {
      "url": "https://www.standardhotels.com/new-york/properties/east-village/faqs",
      "text": "FAQs for The Standard, East Village, NYC | The Standard Hotels East Village, NYC High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Frequently Asked Questions Sales, Events, Groups How far are you from NYU and do you offer discounted rates? Looking for the best hotel near NYU? The Standard, East Village is just a short 5-minute walk to NYU's Washington Square campus. The Standard, East Village offers an NYU preferred rate for faculty, students, parents and alumni. Reach out to sev.sales@standardhotels.com and a member of our sales team will get back to you with current pricing. Can I produce a photoshoot at your property? Please note that commercial photo shoots (film & still) are not permitted anywhere in & around The Standard, East Village without approval via email from marketing. Please contact sev.sales@standardhotels.com with any inquiries. If approved, all fees will be included in a location agreement which must be signed and returned with a COI. Do you offer group rates? Looking to make a group reservation for The Standard, East Village? If you are thinking of booking 10 or more rooms, simply reach out to sev.sales@standardhotels.com with the number of rooms needed and your requested dates and a member of our sales team will get back to you. Do you offer any special rates for Corporate clients? The Standard, East Village offers special rates for our corporate partners. Contact sev.sales@standardhotels.com to find out if your company is currently included in our partner list or to sign up as a corporate partner. Do you have meeting and event space? Looking for the perfect meeting space at The Standard, East Village? Check out our amazing Penthouse, with sweeping New York City skyline views, as well as The Overlook, The Perch, and our private dining rooms. Each unique space can be customized for meetings, private events, and intimate weddings. Simply reach out to sev.sales@standardhotels.com and a member of our events team will get back to you. General What is the facility fee? & Can I opt out of paying the fee ? The facility fee at The Standard, East Village includes: Wi-Fi, fitness center access, bicycle rentals, 2 daily bottles of water, long-distance calls, coffee & tea upon request, hand sanitizer, and an online newspaper service. Please note that the facility fee cannot be waived. Can I send a package to the hotel ? The Standard, East Village is happy to accept your package(s). Please ensure the name on the package matches the name on the reservation. If the package arrives during your stay, you will receive a call for pick up or delivery. Packages received after your departure will be return to sender unless you made prior arrangements with the front desk. Is reservation needed for the rooftop ? The Standard, East Village rooftop is open for private events only. We do recommend our sister property The Standard, High Line for rooftop access. Is there a laundry facility ? The Standard, East Village partners with a dry cleaning service for an additional charge. You may request pick up prior to 9 a.m. for same day return. The laundry slip & bag is located in your room. Looking to do your own laundry? There is a laundromat at East 5th & 1st Ave. Where is the fitness center ? The Standard, East Village partners with Crunch Fitness for all of your fitness needs. Crunch Fitness is only half a block away from the hotel. Please stop by the front desk for a complimentary day pass. A valid ID is required to enter the facility. Are there ice machines on the floor ? The Standard, East Village does not have ice machines on the floors, however, we're happy to deliver ice to your room upon request. Simply dial 0 on your in-room phone and let us know. Do you provide complimentary umbrellas ? The Standard, East Village provides complimentary umbrellas when you need one - simply pick one up at the front desk. Do you provide valet parking ? The Standard, East Village provides the option of self parking at Park It Garage at 403 Lafayette Street. Our hotel discounted rate is $40 + tax for a sedan and $55 + tax for a SUV for 24 hours with no in & out access. Payment is made through the hotel upon check out. How do I upgrade the Wi-Fi? Looking to upgrade your Wi-Fi at The Standard, East Village? Simply visit www.dciupgrade.com . What time is check out? Check out from The Standard, East Village is at noon. We offer late check out at an additional cost. You may also request luggage storage upon departure. What is the hotel's pet policy ? The Standard, East Village is pet-friendly. You may request a dog bowl, bed and treats upon arrival. We do have a pet waiver form that is presented at check in. We do not have a weight limit. Does the hotel require vaccination ? The Standard, East Village does not require vaccination to check in or to dine at any of our outlets. What time is check in? Check in at The Standard, East Village is any time after 3 p.m. If you arrive prior & your room isn't available, we're happy to store your luggage for free. Room Specifics Where are the outlets? Outlets at The Standard, East Village are located under the bed, on the desk, behind the TV and in the bathroom. The USB outlet is located under the bed. Can someone come & empty my mini bar ? If you would like to empty your mini bar at The Standard, East Village, housekeeping will be able to visit your room and empty your mini bar. Please keep in mind that if you need either the snacks or beverages removed, there is a $25 fee. If you need all items removed, the fee is $51. Is room service available? Room service at The Standard, East Village is served daily from 7 a.m. to 9:30 p.m. Dial 0 to place an order. Hours may vary, so make sure you confirm upon check in. Does my room include breakfast ? Breakfast at The Standard, East Village is not included in all reservations. You can add breakfast to your reservation when you are booking online: simply select the breakfast rate, or any other offer that includes breakfast in the description. If you haven't had the chance to do so before you arrive, don't worry - we still have delicious a la carte options at Café Standard or through room service. Do you have phone chargers ? The Standard, East Village does not provide phone chargers. We recommend ordering one online for delivery or steping outside to a nearby store. How do I turn on the desk lights ? The desk lights at The Standard, East Village can be turned on by pulling on the black cord. Does my room come with a tub ? Looking for a room with a tub at The Standard, East Village? Keep in minds that our room types have various layouts. If you would like an increase chance of staying in a room with a tub, we recommend booking a Deluxe King, Corner King, Junior Suite or Downtown Studio. All other room types are not designed with tubs. Will my room have a city view ? Looking for a room with a city view at The Standard, East Village? You may request one at the front desk when you check in, however, keep in mind that our rooms have a combination floor layout for all categories, therefore, we cannot guarantee a city view. Hours The operating hours of The Garden at East Village can be found here. The operating hours of The Garden at East Village can be found here . What date and time is NO BAR open? The operating hours of NO BAR can be found here . What date and time is Cafe Standard open? The operating hours of Cafe Standard can be found here . Rooms Do you have any age restrictions? All guests of The Standard, East Village must be 21+ to reserve a room. Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://www.standardhotels.com/careers/SHLBBLRP",
      "text": "Box Bartender - The Living Room and Plaza | New York Career | The Hotels High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX Box Bartender - The Living Room and Plaza Our Story The simple premise behind The Standard is that\r\n it is anything but. Founded in 1999, the goals of every Standard are to\r\n up the aesthetic stakes and defy convention while attending to every \r\ndetail, embracing our local communities, providing a welcoming and \r\ninclusive environment for our teams, and, of course, delivering a \r\nsmashing good time for our guests. The Standard’s unique \r\nsensibility and voice combine with careful consideration of design and \r\nservice to deliver experiences that define neighborhoods and create \r\ndestinations renowned globally. We believe in hospitality fueled \r\nby culture. As we take The Standard to new markets around the world, we \r\nretain and enhance our mission of creating hotels layered with \r\npersonalities, collaborators, and amusements from culinary and nightlife\r\n to retail and wellness that surprise and delight our guests. The Standard, High Line Rising\r\n above a former elevated train line that has become downtown’s favorite \r\npublic park, The Standard, High Line is in New York City’s Meatpacking \r\nDistrict. Every one of the 338 hotel rooms features a full wall of \r\nfloor-to-ceiling windows with sweeping views of Manhattan and/or the \r\nmighty Hudson River. The hotel’s inviting and scintillating public \r\nspaces include a bustling German beer garden at ground level, the \r\nrooftop discothèque Le Bain, the legendary Top of The Standard, and an \r\noutdoor public plaza with rotating art installations and activations. A \r\nneighborhood staple, The Standard Grill is classic New York blending \r\ntraditional steakhouse with New American cuisine. #StandardFamily Mission Statement Our\r\n mission is to create experiences by embracing and empowering a diverse \r\ncollective of team members, collaborators, and guests, who chose to call\r\n The Standard home. Duties and Responsibilities Serve and assist bar guests in a warm, sincere, accommodating and professional manner Serve beverage and menu items uniformly according to established  standards, expectations and recipes Stock daily inventory taken Fill requisition sheet and give to manager Prep all fruits, garnishes, and juices and ensure its freshness Maintain cleanliness and design aesthetics of all areas, especially those visible to guests including: bar top, glass selves, bar back, and service bar Complete all side work requirements, including pre and post shift, daily, and monthly duties Answer specific questions about food prep using culinary terminology and about Standard drink s in an articulate and detailed manner using technical and service aspects Swift, efficient, and uniform service of orders per drink ticket Provide level of service consistent with established standards in every aspect Perform other duties as requested by manager Skills and Qualifications 2+ years' experience in a NYC upscale, fast paced and high-volume restaurant or night club Must be at least 18 years old Excellent knowledge of all bar products with a focus on wine and menu products Excellent knowledge of POS systems Ability to read, comprehend and carry out instructions according to established procedures Fluent in the English, write, read and speak. Bi or Multi-lingual a plus Work efficiently, utilize multi-tasking, prioritize tasks Personal comportment in line with Standard, New York policies, standards, and expectations Physical Requirements Able to work\r\nstanding for a minimum period of 8 hours a day Periodical\r\nbending, kneeling, and stretching Able to pull,\r\npush, carry and lift at least 40 pounds of force Must be able\r\nto seize, grasp, turn and hold objects with hands Compensation and Benefits Pay Rate $24/hour Excellent and Affordable Health care coverage Life Insurance, Disability Insurance, Pet Insurance 401k with Company match 160 hours of PTO / year and Company recognized holidays Employee Discounts on Rooms, F&B, Retail, and The Standard Marketplace Employee Meals, Employee Referral Program, Commuter Discounts Regular fun staff events and celebrations!!! This job description is not an exclusive or exhaustive list of all job functions that an employee in this position may be asked to perform from time to time. Due to the nature of the hospitality industry, employees may be required to work varying schedules to reflect the business needs of the hotel which may include overtime, weekends and holidays. Standard High Line Employer, LLC (the “Company”) is an Equal Opportunity Employer. Submit Your Resume. Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    },
    {
      "url": "https://monterreymexgrill.com/",
      "text": "Monterrey Mexican Grill | Mexican Food | Braselton & Mall of Georgia Home Photo Gallery Menu Locations Order Online DELICIOUS MEXICAN FOOD IN LAWRENCEVILLE & BRASELTON, GA ORDER ONLINE ORDER CATERING MONTERREY MEXICAN GRILL With two convenient locations, we are proud to provide delicious, authentic Mexican food for the communities of Lawrenceville and Braselton, Georgia. Our menu is full of flavor dishes made from treasured family recipes. From cheese dip to fajitas, classic lunch combinations to decadent desserts, Monterrey brings you the authentic, vibrant flavors of Mexico. authentic mexican cuisine full bar creative cocktails desserts sweet treats about us We take pride in our people as well as our food. Whether you choose our Lawrenceville location near Mall of Georgia, or our Braselton location near Chateau Elan, you can always expect fast, friendly service. Order your favorite Monterrey dishes online, and we’ll have them hot and ready for you to pick up! At Monterrey Mexican Grill, nuestra casa es su casa! © 2025, Monterrey Mexican Grill. All Rights Reserved Website developed by avvaeats.com | Privacy | Terms & Conditions These Terms of Use affect your rights and you should read them carefully. Acceptance of Terms of Use These Terms of Use govern your use of the content and functions available through our website and online ordering and payment functionality (collectively the “Platform”). By using, visiting, or browsing the Platform, you accept and agree to be bound by these Terms of Use. If you do not agree to these Terms of Use, you should not use the Platform. Changes to Terms of Use We reserve the right, from time to time, with or without notice to you, to change these Terms of Use in our sole and absolute discretion. The most current version of the Terms of Use will supersede all previous versions. Your use of the Platform after changes are made means that you agree to be bound by such changes. Privacy and Personal Information On certain areas of our Platform, you may be given the ability to provide us with personally identifiable information. Please read our Privacy Policy for more information about our information collection and use practices, which Policy applies to information you submit on this Platform. Your Account If you register an account on the Platform, you are responsible for maintaining the confidentiality of your account and password and for restricting access to your account, and you agree to accept responsibility for all activities that occur under your account or password. When creating your account, you must provide accurate and complete information. You may never use another’s account without permission. You must notify us immediately of any breach of security or unauthorized use of your account. Although we will not be liable for your losses caused by any unauthorized use of your account, you may be liable for our losses due to such unauthorized use. The Platform sells products to adults, who can purchase with a credit card. If you are under 13, you may browse the Platform but you may not register an account, purchase goods or participate in any offers or promotions. We reserve the right to refuse service, terminate accounts, remove or edit content, or cancel orders in its sole discretion. Third-Party Content These Terms of Use apply to all users of the Platform. The Platform may contain links to third party Platforms that are not owned or controlled by us. We have no control over, and assume no responsibility for, the content, privacy policies, or practices of any third party platforms. In addition, we will not and cannot censor or edit the content of any third-party site. By using the Platform, you expressly release us from any and all liability arising from your use of any third-party Platform. Accordingly, when you leave the Platform or submit information to a third-party platform accessible from this Platform, the terms and conditions and privacy policy of that other platform will apply. Platform Access We hereby grant you permission to use the Platform as set forth in these Terms of Use, provided that: your use of the Platform as permitted is solely for your personal, noncommercial use; you will not copy or distribute any part of the Platform, including graphics, images, text, digitally downloadable files, trademarks, logos, product and program names, or slogans, in any medium without our prior written authorization; you will otherwise comply with the terms and conditions of these Terms of Use. Limitation of Liability THIS PLATFORM (INCLUDING, WITHOUT LIMITATION, ALL INFORMATION CONTAINED HEREON) IS PROVIDED ON AN “AS IS, AS AVAILABLE” BASIS. NO WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THOSE OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, ARE MADE WITH RESPECT TO THIS PLATFORM OR ANY INFORMATION OR SOFTWARE THEREIN. IN NO EVENT SHALL OUR COMPANY, ITS OFFICERS, DIRECTORS, EMPLOYEES, OR AGENTS, BE LIABLE TO YOU FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, PUNITIVE, OR CONSEQUENTIAL DAMAGES WHATSOEVER RESULTING FROM ANY (I) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT, (II) PERSONAL INJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF OUR PLATFORM, (III) ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN, (IV) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM OUR PLATFORM, (IV) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE, WHICH MAY BE TRANSMITTED TO OR THROUGH OUR PLATFORM BY ANY THIRD PARTY, AND/OR (V) ANY ERRORS OR OMISSIONS IN ANY CONTENT OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF YOUR USE OF ANY CONTENT POSTED, EMAILED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THIS PLATFORM, WHETHER BASED ON WARRANTY, CONTRACT, TORT, OR ANY OTHER LEGAL THEORY, AND WHETHER OR NOT OUR COMPANY IS ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. THE FOREGOING LIMITATION OF LIABILITY SHALL APPLY TO THE FULLEST EXTENT PERMITTED BY LAW IN THE APPLICABLE JURISDICTION. We make no representations about the reliability of the features of this Platform, the content, or any other Platform feature, and disclaim all liability in the event of any service failure. You acknowledge that any reliance on such material or systems will be at your own risk. We make no representations regarding the amount of time that any content will be preserved. You agree to defend, indemnify and hold harmless the company who owns this website, its parent corporations, affiliates officers, directors, employees and agents, from and against any and all claims, damages, obligations, losses, liabilities, costs or debt, and expenses (including but not limited to attorney’s fees) arising from: your use of and access to the Platform; your violation of any term of these Terms of Use; your violation of any third party right, including without limitation any copyright, property, or privacy right; or any claim that one of your user submissions is offensive, defamatory, obscene or otherwise objectionable or caused damage to a third party. This defense and indemnification obligation will survive these Terms of Use and your use of the Platform. Ability to Accept Terms of Use. You affirm that you are either more than 13 years of age, or an emancipated minor, or possess legal parental or guardian consent, and are fully able and competent to enter into the terms, conditions, obligations, affirmations, representations, and warranties set forth in these Terms of Use, and to abide by and comply with these Terms of Use. X Effective Date January 1, 2018 (last updated January 1, 2020) This Privacy Policy applies to the sites and apps where it appears, and any location or interaction where we collect personal information from you. This Policy describes how we treat personal information. This includes our website. It also applies to our mobile sites and apps, all ordering channels, our social media pages, and your interactions with us offline, including information we obtain through phone or in-person orders. It also describes your choices regarding how we use and disclose your information. By interacting with us on our sites, platforms and locations, you agree to the terms in this Policy. We will never sell any information we collect from you. We collect information needed to process your orders and for other purposes, as described below. We may use this information to deliver communications and services to you, as described below. Your information may be shared as needed with third parties required to provide services (e.g., credit card processing), as described below. We collect information from and about you. We collect contact and profile information. For example, we might collect your name, address, profile preferences and favorites if you register on our site. We might also collect your phone number or email address. We collect transaction data. For example, we may collect items purchased, amount purchased, transaction date/time and whether you used a discount or promo code when making in-store or online purchases. We collect payment information. For example, we collect your credit/debit card number, expiration date and security code if you make a purchase. We collect information you submit or post. For example, we may collect the information you post in a public space on our site. We also collect information when you contact us or complete a survey. We collect information about your device’s location. For example, we may approximate your location based on your IP address. We may also collect location data through GPS or other similar methods. We collect information about your interactions and use of our website. For example, we may collect the date/time you access our website, the pages you access and the web site you came from, or visit when you leave. We may also collect information about your interactions with our emails and advertisements. We collect information about the connectivity and configuration of your device. For example, we may collect data about the type of device you use, the operating system and browser you use, your internet service provider, your device’s regional and language settings, and other similar information. We may also collect your IP address or other device identifiers. We collect information from social media platforms. For example, when you “Like/Follow” us or share our content on social media platforms, we may collect information about your social media profile. The information we collect is dependent upon your privacy settings with the social network. We collect information in different ways. We collect information directly from you. For example, if you register with us, sign up for our emails, enter a promotion or participate in a survey. We also collect information if you contact us. We collect information if you submit orders through our website. We collect information from you passively. We may use tracking tools like browser cookies and tracking pixels. We collect information about users over time when you use this website. We get information about you from third parties.For example, our business partners may give us information about you. Social media platforms may also give us information about you. We combine information. For example, we may combine information that we have collected offline with information we collect online. Or we may combine information we get from a third party with information we already have. We use information as disclosed and described here. We use information to deliver our products and services to you. We may use your information to complete your order, process your payments and deliver your orders to you. We may also use your information to verify your identity, maintain your account, or personalize your experience. We use information to respond to your requests or questions. For example, we might use your information to provide customer service and respond to your customer feedback. We may use your information to contact you about your orders or rewards. We use information to improve our products and services. We may use your information to make our website and products better. We might use your information to debug and repair system errors. We may use your information to customize your experience with us. We use information for security purposes. We may use information to protect our company, our customers, and our website from malicious or fraudulent activity and prosecute those responsible. We use information for marketing purposes. For example, we might provide you with information about new products and special offers. We might also use your information to serve you ads about products and offers. We use information to communicate with you about your account or our relationship. We may contact you about your account or feedback, including transaction confirmations, technical notices and security alerts. We might also contact you about this Policy or our website Terms of Use. We use information to comply with legal requirements and obligations, or as otherwise permitted by law or as we may notify you. We may share information with third parties. We will share information with our affiliates. For example, we share information with our affiliates to complete your orders and process your payments. We will share information with third parties who perform services on our behalf. For example, we share information with vendors who provide mailing or email services, delivery services, payment processing, and other business purposes. We will share information if we think we have to in order to comply with the law or to protect ourselves. For example, we will share information to respond to a court order or subpoena. We may share it if a government agency, investigatory body, or law enforcement requests it. We might share information when we are enforcing our Terms of Service or protecting the security or integrity of our Systems or investigating potential fraud. We may share information for other reasons we may describe to you. You have certain choices about how we use your information. You can review and update your account information. You can correct, update or delete your account information by accessing and making the change within your online account. You can opt out of receiving marketing communications. To stop receiving our marketing communications, log in to your account and change your settings or follow the instructions in any promotional message you get from us. Even if you opt out of getting marketing messages, we will still send you transactional messages. These include responses to your questions. You can control cookies and tracking tools. Your browser may give you the ability to control cookies. How you do so depends on the type of cookie. Certain browsers can be set to reject browser cookies. Options you select are browser and device-specific. Our website is not intended for children. Our website is meant for adults. We do not knowingly collect or solicit personal information from children under 13 without permission from a parent or guardian. If you are a parent or legal guardian and think your child under 13 has given us information without your permission, you can email us and request that your child’s information be corrected or deleted. You can also write to us at the address listed at the end of this Policy. You may seek an alternative format. Alternative formats of this Privacy Statement are available to individuals with a disability. Please contact info@avvamarketing.com for assistance. We use standard security measures. Security of your information is very important to us, and we have put in place reasonable safeguards to preserve the integrity and security of information we collect and share with our service providers. However, the Internet is not 100% secure. We cannot promise that your use of our sites will be completely safe. We encourage you to use caution when using the Internet. This includes not sharing your passwords. We keep personal information as long as it is necessary or relevant for the practices described in this Policy. We also keep information as otherwise required by law. We store information both within and outside the United States. Information we maintain may be stored both within and outside of the United States. If you live outside of the United States, you understand and agree that we may transfer your information to the United States. This site is subject to U.S. laws, which may not afford the same level of protection as those in your country. Your use of our Web Site and Applications or provision of any information constitutes your consent to the transfer, processing, usage, sharing, and storage of your information in the U.S. and other jurisdictions as set forth in this Privacy Policy. We may link to other sites or apps or have third party services on our platforms we don’t control. If you click on a third party link, you will be taken to platforms we do not control. This Policy does not apply to the privacy practices of those platforms. Read the other companies’ privacy policies carefully. We are not responsible for these third parties. Feel free to contact us if you have more questions. If you have any questions about this Policy or want to correct or update your information, please contact us at the address on the website. X CLOSE X"
    },
    {
      "url": "https://www.standardhotels.com/miami/properties/miami-beach",
      "text": "Miami Beach Hotel with Spa | The Standard Hotels Miami Beach High Line, NYC East Village, NYC Bangkok Miami Beach Ibiza Hua Hin Maldives London Singapore Melbourne X Bangkok X Brussels Pattaya Na Jomtien Book Now Culture Offers Happenings Meetings & Events Upcoming Hotels Residences Shop The StandardX English English English Español Deutsch Overview Rooms Offers Food & Drink Spa Happenings Meetings & Events FAQ Overview Overview Rooms Offers Food & Drink Spa Happenings Meetings & Events FAQ Miami Beach Local time 6:01PM +1 (305) 673-1717 40 Island Ave, Miami Beach, FL 33139 Miami@standardmiami.com Overview Located on Belle Isle, steps away\r\nfrom the action on South Beach,\r\nThe Standard Spa, Miami Beach is\r\nless a “hotel,” and more an adults-only spa with\r\nguest rooms. Set amidst peaceful\r\ntropical gardens, the breezy,\r\nsoothing rooms feature private\r\nterraces, many with outdoor\r\nsoaking tubs, as well as an indoor\r\nand outdoor hydrotherapy\r\nplayground, complimentary to hotel\r\nguests. The Spa encourages the\r\ncommunal rituals of ancient\r\nbathing traditions and serves as\r\na hub for sessions by some of the\r\nworld’s top yogis and treatments by\r\nexpert practitioners. Lido Bayside Grill offers the perfect\r\nwarm-weather, sun-kissed\r\nglobal-inspired menu.\r\nThere’s also a café, gym, boutique,\r\nnail salon and intimate indoor bar. Guide: Must-Taste, Must-Do Miami From days staring at mesmerizing art to sexy nights out on the town, these Miami recommendations come straight from our Culture team on Belle Isle. Read More Explore the Spa Book Service \"A spa hotel unlike any other\" American Spa \"The most magical spot in South Beach\" Esquire \"A holistic paradise\" The Miami Herald \"Stunning Scandinavian inspired spa resort\" Forbes Travel \"The crown jewel of the spa empire\" Florida Travel + Life \"Bathing aficionados have a new lure\" WWD \"An innovative spa unlike anything yet seen in the U.S.\" Ocean Drive \"A holistic oasis...A city hotel that feels like it's on a tropical island\" The New York Times Work It Out View Classes Rooms All Rooms Feature Comfy Beds • Egyptian Cotton Sheets • Fluffy Down Pillows • Daybeds • Spa Rain Showers • Cozy Hooded Robes • Custom Organic Bath Amenities • Wifi • Bluetooth Audio Speakers • Flatscreen Tvs • Overstocked Minibars With Organic Treats • 24/7 Room Service • Pet Friendly • Biscayne Bay Side Main Pool • Waterfall Hot Tub • Arctic Plunge • 18+ To Stay • 21+ To Check In • Rooms With Ada Compliant Features Available Standard Medium Standard Large Garden Medium Garden Large Bath Terrace Medium Bath Terrace Large Bath Extra Large Bay View Suite Standard Medium See Details Standard Medium × Located on the second floor overlooking the lush\r\ninterior or exterior gardens, the 230-square-foot Standard Medium is\r\nthe perfect place to rest and recoup after a day of sunning and spa-ing. It\r\nfeatures a super comfy queen-size bed, drenching spa rain shower, and a daybed\r\nfor lounging, in addition to the creature comforts like extra soft linens, cozy\r\nhooded robes, and an overstocked minibar with organic treats. Standard Large See Details Tour Room FYI, your room's layout might be a little different, but the style's the same. Standard Large × With more space than the Standard Medium, the\r\n300-square-foot Standard Large is located on the second floor\r\noverlooking the lush interior or exterior gardens. It features a seriously\r\ncomfy king-size bed, a daybed for lounging, and a spa rain shower, in addition\r\nto the creature comforts that come standard in every room, like super soft\r\nlinens, cozy hooded robes, and an overstocked minibar with organic\r\ntreats. Garden Medium See Details Garden Medium × Step out of your room and into our hydrotherapy\r\nplayground. Located on the ground floor, overlooking the lush gardens, the\r\n345-square-foot (including outdoor) Garden Medium has a semiprivate outdoor\r\nterrace, supremely comfy queen-size bed, a daybed for lounging, a drenching spa\r\nrain shower, in addition to the Standard amenities like extra soft linens, cozy\r\nhooded robes, and an overstocked minibar with organic treats. Garden Large See Details Garden Large × Quite spacious and situated on the ground floor\r\nlooking out into the lush interior gardens, the 415-square-foot (including outdoor) Garden\r\nLarge features a comfy king-size bed, spa rain shower, living area\r\nwith daybed for lounging, and an outdoor terrace, in addition to the Standard\r\ncreature comforts like super soft linens, extra large towels, Bluetooth speaker, and a minibar\r\nstocked with organic treats. Bath Terrace Medium See Details Tour Room FYI, your room's layout might be a little different, but the style's the same. Bath Terrace Medium See Details Tour Room FYI, your room's layout might be a little different, but the style's the same. Bath Terrace Medium × The perfect room to rest, relax, and indulge\r\nyourself. Located on the garden level, the 345-square-foot (including outdoor) Bath Terrace\r\nMedium has a cozy queen-size bed, spa rain shower, and a daybed for\r\nlounging. In addition to the\r\ncreature comforts that come with every room, there’s a private outdoor terrace\r\nenclosed by curtains with your own personal soaking tub. Previous Next Bath Terrace Large See Details Bath Terrace Large See Details Bath Terrace Large × The more spacious counterpart to the Bath Terrace\r\nMedium, the 415-square-foot (including outdoor) Bath Terrace Large has a comfy\r\nking-size bed, living area with daybed, and an outdoor terrace with a soaking\r\ntub overlooking the exterior gardens. The spa experience continues inside your\r\nroom with the spa rain shower, cozy robes, and plenty of space for outdoor DIY treatments on your private patio. Previous Next Bath Extra Large See Details Tour Room FYI, your room's layout might be a little different, but the style's the same. Bath Extra Large × Because sometimes relaxation is better shared\r\nwith a special someone or multiple special someones. The spacious\r\n515-square-foot (including outdoor) Bath Extra Large features a four-person\r\njacuzzi and soaking tub on the private wrap-around terrace overlooking our lush\r\ngardens. If time indoors is what you crave, you’ll have a comfy king-size bed,\r\nas well as living area with a daybed for lounging. Bay View Suite See Details Tour Room FYI, your room's layout might be a little different, but the style's the same. Bay View Suite See Details Tour Room FYI, your room's layout might be a little different, but the style's the same. Bay View Suite See Details Tour Room FYI, your room's layout might be a little different, but the style's the same. Bay View Suite × A sanctuary above the bay, the\r\n555-square-foot Bay View Suite with sweeping water views could\r\nquickly become your new Miami vice. Situated on the second floor, the suite is\r\ncomprised of a bedroom with comfy king-sized bed, bathroom with freestanding\r\nclaw-foot soaking tub, separate living area and wrap around outdoor terrace\r\noverlooking Biscayne Bay. Go ahead, treat yourself. Previous Next Offers Monthly Spa Specials Eat, Sleep, Repeat Stowaway Rest Assured: Longer, Happier Pamper & Play Staycation Suite Escape Lock It In Last Licks Monthly Spa Specials Extra special pricing available Mondays-Thursdays. See Details Book Now Eat, Sleep, Repeat Feast your eyes (and hunger pangs) on $100 of daily dining credit. See Details Book Now Stowaway Sneak away for a longer stay (7+ nights) & save big, with special perks on us. See Details Book Now Rest Assured: Longer, Happier Stay with us two nights to enjoy 15% off. Too short? Fine, we’ll dish out 20% on three nights. Need More? Here’s 25% off four nights. See Details Book Now Pamper & Play Melt away with $100 of daily spa credit. See Details Book Now Staycation Local lovin' and perks for Florida & Georgia residents. See Details Book Now Suite Escape Enjoy a daily $100 food & beverage credit, plus up to 20% off your stay in our biggest room categories. See Details Book Now Lock It In Quit being a commitment phobe, it pays not to be. See Details Book Now Last Licks Last licks of summer, sweetest deals of the year. Up to 15% off See Details Book Now Food & Drink Lido Bayside Hours: Daily, 8AM-12AM Breakfast: Mon-Fri, 8AM-11:15AM All Day: Mon-Fri, 12PM-11PM Dinner: Sat & Sun, 5PM-11PM Brunch: Sat & Sun, 8AM-3:45PM Happy Hour: Mon-Thurs, 4PM-6PM Reservations are recommended on OpenTable or by calling us at (786) 245-0880. Sun-kissed, global-inspired dining on the bay. See Details View Menu Tour Room Monterrey Bar Daily: 5pm - 12am Our intimate indoor bar and lounge with elevated cocktails and indulgent bites that are perfect for kicking off your night or getting into a little late-night naughtiness. See Details Reserve Tour Room Café Standard Daily: 7am - 5pm Our colorful, all-day indoor café with everything you need to get yourself going from start to finish. See Details Order Online Tour Room Belle Thursdays - Mondays, 12 PM - 8 PM Happy Hour: Monday - Thursday, 4 - 6PM Exclusively for hotel guests and members only. Originally named Bull Island, Belle Isle is the only natural island that makes up the Venetian Islands, home of our tropical oasis. Celebrating its rich history, we've introduced our newest dining destination, Belle. See Details The Lobby An oasis of calm, the Lobby is a perfect place to escape the heat in a unique setting. It also plays host to events, such as talks and readings, as well as pop-ups. Tour Room The Shop at The Standard, Miami DAILY 10AM-7PM The Shop at The Standard Spa, Miami Beach offers all things surf and sun, from bikinis to bronzer to board shorts. You can also find drugstore basics alongside art shop curiosities. The shop carries designers like Persol, Oliver Peoples, Vacation, Devon Windsor, Mikoh, DanWard, and local Miami brands in addition to limited-edition Standard collaborations. Gym at The Standard Spa, Miami Beach DAILY 6AM -10PM The colorful gym at The Standard Spa, Miami Beach features modern cardio and fitness machines, including state-of-the-art Peloton bikes, treadmills, weightlifting, as well as dumbbells, kettle bells, and free weights. Tour Room Spa Part recovery center, part\r\nnew-age ashram, The Standard reimagines the modern spa\r\nexperience. An adults-only (18+) hydrotherapy\r\nplayground, complimentary to\r\nhotel guests, there’s a Turkish-style\r\nhammam, aroma steam room, hemlock sauna, ice room, roman waterfall hot tub, arctic plunge, treatment baths, and an infinity\r\npool. It’s also a hub for classes\r\ntaught by world-class instructors, spanning everything\r\nfrom yoga and fitness to meditation\r\nand integrated wellness. Last, but\r\nnot least, guests are invited to\r\npartake in treatments from nails and\r\nskincare to massage and\r\nacupuncture. Bottom line, if you\r\nhave to go home, you’ll be feeling\r\nbetter, calmer, more grounded...\r\nthe ideal cure for this\r\ntopsy-turvy world. Daily, 8AM-10PM Book Now Spa Treatments Membership Wellness & Fitness The Grounds Integral Living, Health & Workshops Spa Treatments The Standard Spa takes a holistic approach to uniting mind, body and spirit. But sometimes you need a bit (or quite a bit) of special attention, which is where our treatments come in. See Details Tour Room × BOOK NOW Massage & Bodywork: Your body is unique 24-hours a day. We honor this complexity with treatments that reach far beyond a classic Swedish or deep-tissue massage. All of our treatments can be customized, using multiple bodywork techniques that support your whole system. Facials: All treatments have been created to address specific skin conditions and personal beauty needs. Our holistic health counselors are also on hand to help suggest diets and cleansing regimes to address skin and health issues. Nails: Our manicures and pedicures are all about healthy natural nails and hands-on attention using environmentally friendly products. Body Treatments: From head to toe, you'll be bathed and gently exfoliated or oiled up on the delicious heated marble of the Hamam or in our sensual Scrub Room. Combination Therapy: Relax and restore your wellbeing through immersion in our holistic, hydrotherapy centered spa. Be inspired and learn the ageless art of bathing indoors and out. Customize your spa cures designed with your lifestyle goals in mind. Select from our wide range of treatments, yoga, wellness, detox juicing, one-on-one training, workshops and more. Membership Are you a Member? Make wellness a way of life and find some peace in this topsy-turvy world. See Details Apply Now × Get your feet wet and enjoy the perks of Standard with exclusive access to our private events, including yoga and fitness classes, dive-in movies, creative workshops, curated dinners, and field trips, just to name a few. And that’s on top of access to all of our amenities including the Infinity Pool, Roman Waterfall Hot Tub, Arctic Plunge, Hammam, Eucalyptus Steam Room, Hemlock Sauna, Ice Room, and Gym. Plus, receive discounts on food and drinks, spa services, valet parking, hotel rooms, and more. Submit Your Application Wellness & Fitness We offer rich programming that invites exploration to personal wellbeing through many paths. Integrating the ancient and the modern, our daily schedule workshop series, along with our dedicated in-house staff, international teachers and guides create an inspired, connected community exploring the full spectrum of human potential. See Details Sign Up × From yoga to bootcamp to pilates, we have your fitness journey covered for whatever ways you like to get fit. The Grounds Hydrotherapy is an age-old preventative health system for cleansing the body and refreshing the mind. Explore and indulge in our indoor and outdoor hydrotherapy playground. Complimentary for hotel guests. See Details × Infinity Pool Float, relax, swim...in our huge Infinity Pool with underwater jet therapy system and ozonated water, overlooking the bay. Arctic Plunge 50° of chillification! These icy waters will increase your heart rate and kick start your circulation. Muscle contractions get circulation and lymphatic fluid pumping to clean out bodily impurities. For an optimal effect, 30 seconds to one minute is sufficient. Turkish-Style Hamam Literally meaning “spreader of warmth,” the Hamam raises\r\nyour body temperature very slowly while you stretch and lounge on heated\r\nmarble and bellystone. De-stress while the warmth sinks deep into your\r\nbones, relaxing sore muscles and joints and easing overall tension. Aroma Steam Room Steam, the original foundation of hydrotherapy, is\r\nexcellent for your lungs and even better for your skin. Sweat it out, clear\r\nyour pores and eliminate toxins, while enjoying the soothing aroma of\r\neucalyptus. Hemlock Sauna The dry heat of the sauna relaxes, calms, cleanses and\r\nrefreshes. As the core temperature of your body rises, it increases the\r\nproduction and activity of white blood cells, enhancing your body’s\r\nnatural defense against disease. Scrub Room Our decadent Scrub Room features quartz slabs and high\r\npressure hoses. You and your bath buddy can scrub each other down or schedule one of the special scrub treatments - administered by our\r\nprofessional scrubbers. Sound Showers Enjoy the lush sensation of free falling water in this\r\ncircular shower room. A rotating selection of vibrational sounds will change the way you think about singing in the shower forever. Ice Room Step into the Ice Room for stress reduction, muscle recovery, and a reduction in inflammation. Don't forget to bundle up afterwards. Relaxation Lounge Post-treatment, relax in the Spa Lounge while reclining in a Danish rattan daybed, under vintage, free-form, shell-shaped, glass sconces, while enjoying views of the bay. Tropical palms and botanical vistas adorn the walls, window treatments and ceiling, enveloping you in an immersive painterly, flora interior landscape. Play Space Our central sculpture, The Warrior, is a fitting metaphor for the adventures you can find here if you are willing and fearless enough to let go, participate and explore. Solar Circle This grassy open space is for you to read, sunbathe, exercise, picnic or just relax. Garden Fire Lounge Snack, sip, relax, nap or sneak a kiss in our shady wicker loungers. Shady Swing Lounge Suspend yourself in time and while away the day under this shadowy trellis. Falling Water Column Three inches wide and twelve feet high, an invigorating stream of water designed to relieve your tight neck, shoulders and back. Outdoor Baths Infinity Pool 80°F – 86°F, 27°C – 30°C Roman Waterfall Hot Tub Arctic Plunge 100°F – 103°F, 38°C – 40°C Arctic Plunge 50°F – 60°F, 10°C – 15°C Falling Water Column Variable temperature Integral Living, Health & Workshops With our comprehensive series of retreats, lectures, classes, seminars and events led by local, national and international luminaries in health, fitness, spirituality, sexuality, art, science, business and more, this is your “in” to the people, practices and ideas that can inspire you to achieve balance and perspective in your daily life. Ask us how we can organize your spa day or retreat. See Details × Based on availability. Acupuncture By supporting our nature, we can achieve our destiny! The wisdom of Chinese Medicine has three realms, heaven, human and earth and three levels addressing the body, mind and spirit. The stress of everyday life creates blockages in our 14 energy meridians, located throughout the body. Restoring complete balance to these meridians is key to promoting ultimate health and feeling good. Acupuncture will help the Qi in your body flow more smoothly, reveal and enhance your energy potential unveiling the layers of your body, mind and spiritual wellbeing to nourish your destiny. B-12 Shot Helps to increase energy, rev metabolism, enhance mood, boost the immune system, provide mental clarity, promote deeper sleep, and improve stamina. Acupuncture Facial Rejuvenation Ditch the botox, stop the fillers and try acupuncture instead for a natural, healthy “facelift.”  Acupuncture’s gentle use of fine needles, microcurrents, and herbs can achieve dramatic anti-aging results, which work from the inside out. Each person shows age differently. Individual life stories, ailments, joys, and successes are reflected like a canvas on our faces. Why not opt to share these experiences yourself rather than having your face reveal them? Acupuncture Facial Rejuvenation can help turn back the aging clock. This practice dates to the 9th Century Chinese Sung Dynasty, where it was used as part of the health and beauty regimen among empresses and royal consorts. Facial acupuncture starts with a constitutional treatment, a 5-element assessment to address underlying imbalances – reducing stress, improving digestion and sleep quality, as well as strengthening your immune system. You get to look beautiful and feel great! Celestial & Acupuncture Alignment The Ancient Chinese Alchemists knew that man is the mediator between heaven and earth - in our lives we deal with a constant interplay of transitions. Reading the celestial bodies and receiving an acupuncture alignment can help you achieve a broader understanding. We begin with a view of your celestial chart which provides insight into the celestial mechanics you are being affected by and then a Chinese five element reading and acupuncture treatment which includes pulse and a short question and answer, processing things that are happening at the time. Personal alchemy and seeking harmonious transformation, harmony within the cosmos and harmony within the self. Spot On Need a little tough love? We got you. Tell us where it hurts and we will focus on that area with a customized combination of techniques, along with a dose of anti-inflammatory CBD infused oil to give you the relief you need. All better. Astrology Session Take a deep dive into your natal chart to learn your planetary DNA. It reveals your crazies, gifts and karma. Gain a deeper awareness of who you are and who you are meant to be. Don’t you want to know? It is all about timing when to retreat or push ahead because the celestial cycles are an opportunity for growth. Think of it as your own heavenly weather report to prepare for approaching storms or glorious days. Know the best time to start new projects, determine pitfalls, or find out when love is in the air. Date, time, and a place needed. Health Coaching Are you ready to cultivate positive health choices? Meet with our Health Coach to achieve your health goals and feel your best with individual customized sessions and Integral Living Programs. A holistic approach creating healthy lifestyle changes and food choices to support balancing career, relationships, exercise and mindfulness as it relates to your life and connect to overall wellbeing, inside out. Hypno-Coaching “There are no coincidences or accidents; there are just occurrences orchestrated by our thoughts and life’s magic to deliver us the things we have been thinking.” By creating synergy between hypnosis and life-coaching, this is a powerful approach based on Self-Mastery, which brings out the person you would be if you freed yourself of negative, limiting beliefs. You know who that person is, it’s the one living your dreams. Life Coaching Imagine someone totally on your side. Someone who sees your potential and holds a vision for who you want to be, while completely accepting and seeing you for how amazing you already are. With a combination of gentle support, objective feedback, intuitive insight and useful tools, your personal life coach brings out the best in you. Whether it’s for a motivational boost during your spa getaway, transforming your relationship to your work or home life, or simply having an increased quality of life, personal life coaching can be an empowering avenue to greater fulfillment. One-on-one confidential coaching sessions provide the opportunity for you to manifest more of what you want in life, and in the process, gain self-awareness, insight, and personal and spiritual growth. My Meditation Beware, stress also may become an addiction! Are you aware that for anything that you do in your daily life, stress is optional? Meditation is an available path to gain clarity by allowing you access to a source of wisdom that goes beyond your intelligence, and intellect – even habits and routine. As clarity grows within you, you become able to handle all your daily tasks and events, while remaining free from stress. The silence experienced in the meditative state is natural and comforting to us, it is like what we experience during the state of deep sleep. There is no one technique to suit everyone. But certainly everyone can find a technique that suits him or her. Join us to learn about and explore different meditation techniques and get recommendations on how to find your own technique, one which you will call “my meditation.” Past Life Regression Hypnosis The soul is eternal, and we have all lived many lives, often reincarnating within the same close circle of people. Our souls have experienced those lives in different bodies, different cultures and in different times. Past-life regression is the process of going back to these earlier lives through hypnosis. You will most likely feel as if a tremendous weight has been lifted through the powerful insights and messages you receive, that life has greater meaning, and you will feel a wonderful sense of peace and calm. This is because healing takes place when you are able to shed light and understanding on the source of your present day challenges and unhappiness. (traumas, phobias, health issues, relationship dynamics and more...) Custom Retreats & Workshops We welcome you to experience a blissful and playful retreat immersed in our oasis, just the way you imagined and more. Create a workshop, retreat or seminar just for you. Our in-house curriculum experts and our eclectic team of teachers can create an amazing retreat or workshop designed especially for your needs. Whether you are a group of friends that want to have fun, a couple who wants to bond, or an office crew that needs soft-skills training, we create the method, the means, the atmosphere and structure and provide qualified facilitators. Let the learning soak in… allow our lush grounds and restorative amenities to inspire you. This unique offering can be customized for an individual or a group (up to 25 people) – with durations anywhere from one day to six weeks. See program for price. Happenings View All Aperitivo Happy Hour High Tides Happy Hour Spring Flings & Summer Lovin' Tarot Reading: Fate & Desire Yoga, Pilates, Bootcamp & More January 1 to December 1 Aperitivo Happy Hour See Details Weekly (Next: September 15 ) High Tides Happy Hour See Details June 1 to October 31 Spring Flings & Summer Lovin' See Details Apply Weekly (Next: September 12 ) Tarot Reading: Fate & Desire See Details Join Us Weekly (Next: September 15 ) Yoga, Pilates, Bootcamp & More See Details View Classes Meetings & Events Whether you’re looking to work or play, we host a variety of private events including receptions, workshops, productions, socials, pop-ups, and more. More Info Contact Us Bayside Dock The Gardens Lido Dock Large Studio Small Studio Lido Bayside Grill The Bayview Suite Bayside Dock Details Tour Room Bayside Dock × With unparalleled views of Biscayne Bay, our Bayside Dock is the ideal spot to host a sizable soiree for all of your “closest friends.” Plus, panoramic sunsets don’t hurt either. The Gardens Details Tour Room The Gardens × Lush and fabulously landscaped greenery envelop The Standard Spa’s Meditation Garden. Dine under the stars beneath the terrace of the Swing Garden or sip cocktails in the grassy play circle. Lido Dock Details Tour Room Lido Dock × Enjoy healthy, sun kissed, farm to table dining so close to the water that you could roll in for a swim.  We can’t guarantee that your party will see dolphins, but there will definitely be a memorable sunset. Large Studio Details Tour Room Large Studio × Perfect for your next conference meeting, team building, or production headquarters, the 756 square foot Large Studio can be arranged to fit your needs with a customized catering menu to keep those creative juices flowing. Small Studio Details Small Studio × Our coziest conference room, the 288 square foot Small Studio is the ideal setting for a meeting of the minds, seating up to 16 guests or just a handful of your VIPs. Lido Bayside Grill Details Tour Room Lido Bayside Grill × Looking for something more low-key for a small group? Whether it's just cocktail hour or you're celebrating a special occasion, we can host tables up to 10 in our restaurant, Lido Bayside Grill. The Bayview Suite Details Tour Room The Bayview Suite × The Bayview Suite is the perfect setting for an intimate cocktail party of up to 15 guests.  Overlooking the breathtaking Miami skyline and Biscayne Bay, the suite features hardwood floors, mid century vintage furnishings, a claw foot bathtub, and a private wrap around terrace. View Property Map Frequently Asked Questions View All How much is a Day Pass? For a limited time, you can reserve Day Passes through ResortPass , Monday-Thursday, which grants you access to the Pool area only . If you're looking to enjoy full access of all amenities including the spa, when you book any Spa service from Monday to Thursday that is over $125 or from Friday to Sunday that is over $250, we'll give you exclusive access to enjoy our hydrotherapy amenities. These offers are based on availability. You can browse our services here: https://www.standardhotels.com/miami/properties/miami-beach#spa See More How do I apply to be a Member? Want to become a member at The Standard, Miami? Simply contact membership@standardmiami.com to learn more about our Membership program. See More How do I book a Spa service? To book a Spa Service at The Standard, Miami Spa simply go to https://www.standardhotels.com/miami/properties/miami-beach#spa for our service menu and to book an appointment. You can select from hydrotherapy, Turkish-style hammam, aroma steam room, sauna, ice room, Roman waterfall hot tub, arctic plunge, treatment baths, and an infinity pool. See More Do I get access to the Spa? Our hotel guests enjoy full access to our hydrotherapy playground. Not a guest? When you book any Spa service from Monday to Thursday that is over $125 or from Friday to Sunday that is over $225, we'll give you exclusive access to enjoy our hydrotherapy amenities. This offer is based on availability. You can browse our services here: https://www.standardhotels.com/miami/properties/miami-beach#spa See More Can I use the amenities before check in and after check out? Want to use the Pool, Spa or The Gym at The Standard, Miami before checking in or after checking out? You are welcome to arrive as early or stay as late as you'd like during your stay. See More Miami Beach +1 (305) 673-1717 40 Island Ave, Miami Beach, FL 33139 Miami@standardmiami.com Careers Giving Back Health & Safety Accessibility Sitemap Contact Book Now"
    }
  ]
}