{
  "fuentes": [
    {
      "url": "https://www.floridashistoriccoast.com/events/annual/",
      "email": "ssather@floridashistoriccoast.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "administrativedirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "communications@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "culturalengagement@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "innovationliaison@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "managingdirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "programcoordinator@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "sponsorship@communityartsmentorship.com"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/st-augustine-greek-festival-2023",
      "email": "mindy@kidsoutandabout.com"
    },
    {
      "url": "https://oldcity.com/st-augustine-greek-festival/",
      "email": "sing-out-loud-festival-500x383@2x.jpg"
    },
    {
      "url": "https://oldcity.com/st-augustine-greek-festival/",
      "email": "songwriters-festival-featured-image-500x383@2x.jpg"
    },
    {
      "url": "https://oldcity.com/st-augustine-greek-festival/",
      "email": "pumpkin-patch-2873348_1280-500x383@2x.jpg"
    },
    {
      "url": "https://oldcity.com/st-augustine-greek-festival/",
      "email": "st-augustine-neighborhood-480x270-1-500x383@2x.jpg"
    },
    {
      "url": "https://oldcity.com/st-augustine-greek-festival/",
      "email": "trolley-1-500x383@2x.jpg"
    },
    {
      "url": "https://www.oeko.de/en/institute/team/?tx_wwt3list_recordlist%5Baction%5D=index&tx_wwt3list_recordlist%5Bcontroller%5D=Recordlist&tx_wwt3list_recordlist%5Bpage%5D=7&cHash=4f64d34c515e99528f5a7285cc8d27c4",
      "email": "a.herold@oeko.de"
    },
    {
      "url": "https://www.oeko.de/en/institute/team/?tx_wwt3list_recordlist%5Baction%5D=index&tx_wwt3list_recordlist%5Bcontroller%5D=Recordlist&tx_wwt3list_recordlist%5Bpage%5D=7&cHash=4f64d34c515e99528f5a7285cc8d27c4",
      "email": "a.nelius@oeko.de"
    },
    {
      "url": "https://www.oeko.de/en/institute/team/?tx_wwt3list_recordlist%5Baction%5D=index&tx_wwt3list_recordlist%5Bcontroller%5D=Recordlist&tx_wwt3list_recordlist%5Bpage%5D=7&cHash=4f64d34c515e99528f5a7285cc8d27c4",
      "email": "c.timpe@oeko-consult.de"
    },
    {
      "url": "https://www.oeko.de/en/institute/team/?tx_wwt3list_recordlist%5Baction%5D=index&tx_wwt3list_recordlist%5Bcontroller%5D=Recordlist&tx_wwt3list_recordlist%5Bpage%5D=7&cHash=4f64d34c515e99528f5a7285cc8d27c4",
      "email": "info@oeko.de"
    },
    {
      "url": "https://staugustinescentrehalifax.org.uk/contact-us/",
      "email": "info@staugustinescentrehalifax.org.uk"
    },
    {
      "url": "https://sasyorks.org/contact-us",
      "email": "admin@sasyorks.org"
    },
    {
      "url": "https://sasyorks.org/contact-us",
      "email": "nqzva@fnflbexf.bet"
    },
    {
      "url": "https://historiccoastculture.com/event/st-augustine-greek-festival/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/event/st-augustine-greek-festival/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.usa.edu/about/contact-us/",
      "email": "whit-logo-usa@4x.png"
    }
  ],
  "mails": [
    "a.herold@oeko.de",
    "a.nelius@oeko.de",
    "admin@sasyorks.org",
    "administrativedirector@communityartsmentorship.com",
    "c.timpe@oeko-consult.de",
    "communications@communityartsmentorship.com",
    "culturalengagement@communityartsmentorship.com",
    "info@oeko.de",
    "info@staugustinescentrehalifax.org.uk",
    "innovationliaison@communityartsmentorship.com",
    "managingdirector@communityartsmentorship.com",
    "mindy@kidsoutandabout.com",
    "nqzva@fnflbexf.bet",
    "programcoordinator@communityartsmentorship.com",
    "pumpkin-patch-2873348_1280-500x383@2x.jpg",
    "sing-out-loud-festival-500x383@2x.jpg",
    "sjcc@historiccoastculture.com",
    "songwriters-festival-featured-image-500x383@2x.jpg",
    "sponsorship@communityartsmentorship.com",
    "ssather@floridashistoriccoast.com",
    "st-augustine-neighborhood-480x270-1-500x383@2x.jpg",
    "trolley-1-500x383@2x.jpg",
    "whit-logo-usa@4x.png",
    "x@2x.png"
  ],
  "nombre_sitio": "staugustinegreekfestival.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.floridashistoriccoast.com/events/annual/",
      "text": "Annual Events & Festivals | St. Augustine & Ponte Vedra, FL Skip to content 80 ° F Trip Planner Radio 0 Saved Navigation Things to Do & Attractions History Outdoor Activities Family Fun Free Things to Do Shopping Arts & Culture Golf Sightseeing & Tours Spas & Wellness Paranormal Activities Must-Do Experiences on Florida's Historic Coast Discover the Trails of Florida’s Historic Coast: A Journey of Flavor, Spirits, and History Beaches St. Augustine Beach Ponte Vedra Beach Anastasia State Park Crescent Beach Vilano Beach Mickler’s Landing Butler Beach Explore the Beaches Places to Stay Hotels and Motels on Florida’s Historic Coast Resorts on Florida’s Historic Coast Condos & Private Rentals Campgrounds & RV Parks Bed & Breakfasts Vacation Deals Lodging with Meeting Space Sunkissed Staycations on Florida’s Historic Coast Girlfriend Getaways on Florida’s Historic Coast Golf Food & Drink Restaurants Breweries, Wineries & Distilleries Nightlife Sweet Spots Live Music on Florida’s Historic Coast Music Festivals Live Music Venues Events Submit Event Annual Events Music Festivals Major Holidays This Weekend in St. Augustine: Events & Things to Do Visitor Information Order Guide Subscribe to E-Newsletter Maps Deals Getting Here Parking Visitor Services Weather & Average Temperature Accessibility Medical Assistance Healthy Travel Information & How We Are Open Trip Planner Radio Meetings Religious & Spiritual Retreats Reunions Weddings Tour & Travel Planners Sports Planners Blogs Sing Out Loud Festival Home Events Annual Events First Friday Art Walk Saint Augustine Film Festival Black History Month in St. Augustine Spanish Food & Wine Festival Florida’s Photo Fest The PLAYERS Championship St. Augustine Food + Wine Festival St. Augustine Craft Brewers' Festival Founder’s Day in St. Augustine Sing Out Loud St. Augustine Greek Festival Welcome 2025 Daytona Beach Biketoberfest Whiskey, Wine & Wildlife Festival Ponte Vedra Auto Show Nights of Lights Taxslayer Gator Bowl Gear Up for Family Fun at the Hastings Cabbage, Potato, and Bacon Festival! Florida Skimboarding Pro/Am Tournament Share Annual Events Florida’s Historic Coast has an annual calendar chock full of events that appeal to a wide variety of interests. Editor's Note: Please call to confirm before driving long distances as some times and details may vary. The following are just a sampling of some of the most popular events in St. Augustine, Ponte Vedra & The Beaches. ONGOING: First Friday Art Walk First Friday Every Month From 5-9 p.m. on the first Friday of every month, new exhibits, music, entertainment and refreshments are featured at over 20 galleries in St. Augustine. Learn More January Jimmy Jam BBQ Slam & Car Show Outstanding BBQ competition, classic cars, cornhole championships, live music, arts and crafts – this event has it all! Learn More Saint Augustine Film Festival The St. Augustine Film Festival presents more than 20 outstanding films with filmmakers’ panel discussions. Learn More Matanzas 5000 5K & Fun Run One of Florida’s fastest 5K races on a scenic USATF-certified course. Learn More February Flight to Freedom Flight to Freedom recreates the experience of the hundreds of slaves who traveled to Fort Mose in search of freedom… Learn More Fort Mose Jazz & Blues Series Grammy Award-Winning Jazz and Blues Artists perform over the two week series. Learn More St. Augustine Spanish Food & Wine Festival Various food & wine events over two days, showcasing the Spanish influence on the culinary scene in St. Augustine. Learn More March Searle’s Sack of St. Augustine This authentic reenactment portrays Captain Robert Searle’s 1668 attack on St. Augustine to loot the silver ingots held in the… Learn More St. Augustine Celtic Music & Heritage Festival Did you know St. Augustine is America’s oldest Celtic city? The ancient city hosted the original St. Patrick Parade in… Learn More THE PLAYERS Championship Come see your favorite golf pros compete at the world-famous PLAYERS Stadium Course at TPC Sawgrass in Ponte Vedra Beach… Learn More St. Augustine Lions Seafood Festival Good food and good times for a great cause. Enjoy this weekend festival filled with live music, vendors and delictable… Learn More April Florida’s Birding & Photo Fest One of the most popular events among birding, nature, and photography enthusiasts in the southeast will take place on Florida’s… Learn More Cabbage, Potato and Bacon Festival Come celebrate Hastings' rich agricultural heritage with a weekend filled with delicious food, live music, family-friendly activities, Lawn Mower races… Learn More Blessing of the Fleet This annual event has watercraft from trawlers, yachts, sailboats and motor craft all decorated to receive a blessing from the… Learn More St. Augustine Easter Parade St. Augustine’s Easter Parade features marching bands, floats, drill teams, the Easter Bunny, and the St. Augustine Royal Family with… Learn More Taste of St. Augustine Celebrate 25+ years of culinary excellence, local flavor, and community spirit—all while supporting a great cause! Learn More May St. Augustine Food & Wine Festival A culinary weekend celebration at World Golf Village with celebrity guest chefs, winemakers and beverage experts in spirits and beers… Learn More Annual Craft Brewer’s Fest Great food, great music and great craft brews. What can be better? Enjoy unlimited samples from more than 25 local… Learn More Drake’s Raid The English corsair Sir Francis Drake and his raiders return to St. Augustine in an authentic recreation of the 158… Learn More May through September Every Wednesday Music by The Sea Concert Series Every Wednesday evening through September, a free live concert takes place from 7-9 p.m. at the St. Johns County Ocean… Learn More Every Thursday Concerts in the Plaza Throughout the summer months, every Thursday evening a free live concert takes place from 6-8 p.m. in St. Augustine’s historic… Learn More June St. Augustine Music Festival The St. Augustine Music Festival is a series of six free concerts held throughout two weekends in the historic Cathedral… Learn More Battle of Bloody Mose This annual reenactment of the June 26, 1740, Battle of Bloody Mose, a pivotal battle between the British and… Learn More July July 4th St. Augustine Fireworks and Concert The All Star Orchestra performs in the Plaza de la Constitucion then one of the largest fireworks displays on the… Learn More Ancient City Kingfish Challenge This exciting competition offers cash and prizes for the biggest catch. This annual tournament takes place from the St. Augustine… Learn More August Florida Skimboarding Pro/​Am Tournament August 2026 Every August on Vilano Beach, the Florida Skimboarding Pro/Am Tournament draws athletes from around the world to showcase their skills… Learn More September St. Augustine Founder’s Day Celebration This day honors the founding of America’s First Parish, the Cathedral of St. Augustine, and St. Augustine, the nation’s oldest… Learn More Sing Out Loud Festival One of the largest music celebration in Florida offering hundreds of live performances at multiple venues throughout St. Augustine and… Learn More October St. Augustine Greek Festival Celebrate all things Greek - food, dancing, music and heritage - at this annual festival celebrating St. Augustine’s Greek heritage… Learn More Halloween You won’t find a more haunted Halloween destination than the Nation’s oldest city, St. Augustine, Florida. Learn More November Whiskey, Wine & Wildlife Whiskey, Wine & Wildlife celebrates the best of St. Augustine's Vilano Beach and Florida's Historic Coast, from its culinary superstars… Whiskey, Wine & Wildlife Festival Ponte Vedra Auto Show The Ponte Vedra Auto Show showcases classic and new collectors' cars from 9 a.m.-3 p.m. The auto show and parking… Learn More Mid-November through January Nights of Lights Selected by National Geographic Traveler as one of the ten best holiday lighting displays in the world, St. Augustine glows… Learn More December St. Augustine Christmas Parade St. Augustine’s Annual Christmas Parade, the largest in North Florida, includes floats, marching bands, horses and the arrival of Santa… Learn More Garden Club Christmas Tour of Homes This annual tour showcases holiday decorations at a selection of St. Augustine’s most outstanding private homes. Enjoy a taste of… Learn More Regatta of Lights Brilliantly lighted boats glide through St. Augustine’s Matanzas Bay between the Bridge of Lions and Castillo de San Marcos during… Learn More Light Up the NIGHT! New Year’s Eve Firework Show Kick off the New Year in seaside style at this St. Augustine Beach event! Enjoy fireworks, festivities and food. Learn More Visitor Guide Newsletter 29 Old Mission Ave St. Augustine, FL 32084 (904) 829-1711 Things to Do & Attractions History Outdoor Activities Family Fun Free Things to Do Shopping Arts & Culture Golf Sightseeing & Tours Spas & Wellness Paranormal Activities Must-Do Experiences on Florida's Historic Coast Discover the Trails of Florida’s Historic Coast: A Journey of Flavor, Spirits, and History Beaches St. Augustine Beach Ponte Vedra Beach Anastasia State Park Crescent Beach Vilano Beach Mickler’s Landing Butler Beach Explore the Beaches Places to Stay Hotels and Motels on Florida’s Historic Coast Resorts on Florida’s Historic Coast Condos & Private Rentals Campgrounds & RV Parks Bed & Breakfasts Vacation Deals Lodging with Meeting Space Sunkissed Staycations on Florida’s Historic Coast Girlfriend Getaways on Florida’s Historic Coast Golf Food & Drink Restaurants Breweries, Wineries & Distilleries Nightlife Sweet Spots Live Music on Florida’s Historic Coast Music Festivals Live Music Venues Events Submit Event Annual Events Music Festivals Major Holidays This Weekend in St. Augustine: Events & Things to Do Visitor Information Order Guide Subscribe to E-Newsletter Maps Deals Getting Here Parking Visitor Services Weather & Average Temperature Accessibility Medical Assistance Healthy Travel Information & How We Are Open Meetings Religious & Spiritual Retreats Reunions Weddings Tour & Travel Planners Sports Planners Blogs © 2025 St. Augustine Ponte Vedra. All Rights Reserved. Media & Press About Us Contact Us Privacy Policy Accessibility GDPR FAQ This website uses cookies to ensure you get the best experience on our website. Learn More Accept Experience Builder Quick Search Search Location Map"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "text": "OUR TEAM | CAMP top of page Home ABOUT OUR TEAM JOIN THE TEAM PROGRAMS TACT URBAN ARTS NORTHERN LIGHTS BLUEGRASS MUSIC CAMP GIRLS ROCK THE NORTH YOUTH MUSIC CAMPS RESIDENCIES CULTURAL FOUNDATIONS MUSIC IN SCHOOLS ARTS EXPLORATION TOUR SOA FIDDLE MENTORSHIP CURRICULUM DEVELOPMENT HIP HOP COLLABORATION MUSIC TEACHER MENTORSHIP CONTACT NEWS DOYLEFEST LINEUP AND TICKETS ABOUT GET INVOLVED GALLERY CONTACT PAST PERFORMERS DONATE Our Team. Rooted in the arts. Experts in various fields, working together to share their talents in communities across Saskatchewan. Eliza Doyle managingdirector@communityartsmentorship.com Co - Founder / Managing Director Eliza is a professional musician, songwriter and recording artist, teacher, community advocate, leader and is the co-founder behind Saskatchewan’s arts organization, C.A.M.P; Community Arts Mentorship Program. Her focus on fostering the arts while supporting local community capacity to deliver arts programming has been welcomed throughout communities in Saskatchewan. Offering services to remote and under-served communities presents new challenges, and all of CAMP programming serves to mitigate these obstacles. Familiar with the arts and music industry in Saskatchewan, she also aims to provide the opportunity and mentorship available to people with challenges in access due to location and lack of resources. Holly Rae Yuzicapi culturalengagement@communityartsmentorship.com Co - Founder / Cultural Consultant The co-founder of CAMP and a proud Dakota/Lakota from the Standing Buffalo Dakota Nation in Treaty 4 Territory, Saskatchewan.  Holly grew up in the beautiful Qu'Appelle valley.  Coming from a large family, Holly has been able to observe and learn from many generations of the Goodwill and Yuzicapi families.  The strength of her sense of identity was nurtured and shaped by her family and community.  Without realizing it at the time, Holly started doing cultural arts sharing from a young age which really is rooted in participating in powwow dancing and attending other cultural events on a regular basis.  She has evolved into an independent natural materials artist that loves to facilitate cultural arts engagement opportunities to all audiences.  Holly is proud of how she was raised and is very thankful for all that her family has taught her.  Respectfully representing the spirit and potential of those teachings is why Holly does the work that she does.  It is how she chooses to honour her family. LJ Tyson Kimbley innovationliaison@communityartsmentorship.com Innovation Liaison LJ Tyson is a singer-songwriter from Prince Albert, Saskatchewan. The has used his identity as inspiration for creating lyrics and melodies. LJ has had music played across Canada and beyond. His latest release Home On A Rainbow was critically acclaimed and awarded a prize from SOCAN TD Indigenous Songwriter Awards. LJ currently works as Innovation Liaison for Community Arts mentorship program, bringing music to remote and underserved communities. Steph Cameron administrativedirector@communityartsmentorship.com Administrative Director Saskatchewan-based artist Steph Cameron has gained recognition for her unique take on contemporary Americana music, lively instrumentation, and captivating lyrics. From her early days of busking, she has become an internationally touring professional recording artist. Her critically acclaimed debut album, Sad-Eyed Lonesome Lady, released on Pheromone Recordings in 2014, was nominated for the Polaris Music Prize and praised as the #1 Canadian album of that year by PopMatters, while No Depression called it \"a stunning debut.\" This success led her to join the Paquin Artist Agency and embark on national tours. Her expertise in performing is the real world experience CAMP participants benefit the most from . Zoe Slusar programcoordinator@communityartsmentorship.com Program Coordinator Zoe Slusar was the voice actress for Kid Goku in the English dubs of the Dragon Ball and Dragon Ball GT anime, done by Blue Water Studios. She also provided the voice of Sai Saici in Kidou Butouden G Gundam, as well as the video game Gundam: Battle Assault 2.\n\nZoe also voiced the character Jungo in the Flemish created series.\n\nZoe, also known by her stage name ZHE the Free, released her first rap EP album titled The Love EP in September 2020. This album charted #1 on 90.9 CJSW in Calgary, Alberta in November 2020. Mitchell Dureault programcoordinator@communityartsmentorship.com Program Coordinator Mitch Dureault is a seasoned professional music instructor and traditional musician, who comes from the Treaty 4 Territory of the southern Saskatchewan prairies. Currently sitting as a board member, and working instructor for C.A.M.P., Mitch is an advocate for the arts and has a strong focus on decolonizing his own music & teaching practices. He regularly draws from his B.A. in International Studies while working with and aiding organisations, communities, and schools in the development and implementation of equitable and continual art programming throughout the province. Mitch is also very passionate about the promotion and preservation of the local culture of Saskatchewan fiddling and has been making efforts to visit and interview as many fiddlers as possible from across the province for his Saskatchewan Fiddle History Project, a multi-year project in which he collects stories, tunes, and histories from these individuals in an attempt to preserve and document the ever evolving diverse intricacies of the provinces fiddling culture. Jille Shotton communications@communityartsmentorship.com sponsorship@communityartsmentorship.com​ Marketing and Communications Director\\ Sponsorship Jille Shotton joined the Community Arts Mentorship Program in 2024 as the Marketing and Communications Director, bringing a decade of experience in festival marketing, promotions, and community building within Saskatchewan's arts and culture sector. Her background includes managing marketing, communications, sponsorship, and onsite operations for events such as the Northern Lights Bluegrass & Old Time Music Festival, Winterruption, Ness Creek Music Festival, Fiddlyness, Shivering Strings and the Children's Festival of Saskatchewan. Jille is passionate about strengthening communities through the arts, having organized open jams, Bluegrass Brunch, radio shows, and various events and festivals. Her work focuses on creating inclusive, vibrant spaces where the community can connect and thrive. Lillanohna Naytowhowcon President LILI, an Indigenous singer, songwriter, and recording artist hailing from Sturgeon Lake First Nation in Saskatchewan, blends her passion for music and independent songwriting. She is actively engaged in community projects that celebrate and honour Indigenous culture through a fusion of traditional Cree songs, indie rock, folk, hip-hop, and dance music. In 2024, expect the release of her music under the esteemed blessed-street record label, marking a significant chapter in her musical journey. The album includes collaboration with recording artist Lancelot Knight in Six Underwater, showcasing her versatility. Proudly identifying as a nehiyaw iskwew, she seamlessly weaves her creative pursuits into a traditional lifestyle, contributing to a First Nation Healing Lodge under the guidance of elders and knowledge keepers. The past year has been a transformative period characterized by healing and growth, with her music echoing the spirit of loss, hope, and perseverance. Her vocal style is both distinctive and heartfelt, drawing inspiration from grassroots music festivals, independent artists, and the eclectic vibes of the city. A nomadic spirit with a touch of witchy charm, LILI invites all to partake in the enchantment of her melodies. Travis Beatty Board Member Travis Beatty is from Timber Bay, Saskatchewan and is instrumentalist. He has a studio in Saskatoon, Saskatchewan called Rez Rat Recording, and is passionate about helping community and youth in Saskatchewan. He joined the CAMP Sask Arts Board of Directors in October 2023, and we are very lucky to have him! JOIN THE MAILING LIST SIGN UP NOW Thanks to our supporting organizations Email: managingdirector@communityartsmentorship.com Tel: 306-774-5888 bottom of page"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/st-augustine-greek-festival-2023",
      "text": "St. Augustine Greek Festival 2023 | Kids Out and About Jacksonville Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Jacksonville's online guide to everything for kids, teens, & families! Menu FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Search form Search Secondary menu Master Guide to Fall Fun 101 Family Day Trips St. Augustine Greek Festival 2023 *The event has already taken place on this date: Sun, 10/08/2023 Be Greek for a Weekend! Immerse yourself in authentic Greek culture and heritage October 7th and 8th at the Holy Trinity Greek Orthodox Church of St. Augustine during the 25th Annual Greek Festival! Transport your senses to Greece as you taste authentic homemade foods, drinks and pastries. This is a FREE event, open to the public. Take out or eat in and enjoy the festivities... or better yet, eat in AND take out to enjoy later. Click here for more information about this activity Please help us keep this calendar up to date! If this activity is sold out, canceled, or otherwise needs alteration, email mindy@kidsoutandabout.com so we can update it immediately. If you have a question about the activity itself, please contact the organization administrator listed below. Explore the online menu to begin your Greek culinary journey. For one weekend, surround yourself with the sounds of Greek music, enjoy live performances and participate in traditional Greek folk dancing. The 25th annual event also features an arts and crafts market showcasing Greek products as well as handcrafted items created by local artists, artisans and makers. And, you can even take a guided church tour and attend Sunday morning liturgy. This is a FREE event, open to the public. Festival hours are Saturday from 11 a.m. to 7 p.m. and Sunday from noon to 6 p.m. Pre-ordering for whole specialty pans is now available. Click here to order pans online now. Then, pick-up via drive thru at Holy Trinity Greek Orthodox Church on Friday, October 6th between 4 and 7 p.m. St. Augustine Greek Festival *Times, dates, and prices of any activity posted to our calendars are subject to change. Please be sure to click through directly to the organization’s website to verify. Organization: St. Augustine Greek Festival Location: 2940 County Road 214 Saint Augustine , FL , 32084 United States See map: Google Maps Phone: 904-829-0504 Contact name: Information Email address: staugustinegreekfest@gmail.com Click for more information The event has already taken place on this date: 10/08/2023 Time: PAN PICK UP ONLY: Friday, October 6th between 4 and 7 p.m. | Saturday 11AM-7PM | Sunday 12PM-6PM Price: FREE Ages All Ages Adults & kids together Adults without kids Tags: Event Celebration Festival/fair Food event Food festival (barbecue, food truck rodeo, winery celebration, etc) Performance Concert Arts Outdoors Arts: Performance Nature/Outdoors Web Service Pinterest Share on Facebook Tweet Widget Featured in Jacksonville Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://oldcity.com/st-augustine-greek-festival/",
      "text": "St. Augustine St. Augustine Greek Festival | OldCity.com Skip to content Search for: HOME WHERE TO STAY BED & BREAKFASTS CAMPGROUNDS, FISH CAMPS CONDOMINIUMS & RESORTS HISTORIC DISTRICT HOTELS & MOTELS OCEANFRONT RENTALS SHORT-TERM VACATION RENTALS ST. AUGUSTINE PET-FRIENDLY INFORMATION ALL ACCOMMODATIONS LISTINGS ST. AUGUSTINE PARKING ST. AUGUSTINE PET FRIENDLY PLACES TO STAY ST. AUGUSTINE NIGHTS OF LIGHTS THINGS TO DO 4TH Of JULY ATTRACTIONS BEACHES FESTIVALS HISTORY & CULTURE MUSIC & ART NIGHT LIFE SHOPPING SIGHTSEEING SPORTS & RECREATION WEDDINGS ST. AUGUSTINE PARKING ST. AUGUSTINE CELTIC MUSIC & HERITAGE FESTIVAL LIGHT-UP! NIGHT ST. AUGUSTINE ST. AUGUSTINE NIGHTS OF LIGHTS Nights of Lights Tours WHERE TO EAT FINE DINING ST. AUGUSTINE RESTAURANT LISTINGS ST. AUGUSTINE NIGHTS OF LIGHTS Nights of Lights Tours THE COMMUNITY AREA BUSINESSES MAP & DIRECTIONS ONLINE ARTS PLACES OF WORSHIP REAL ESTATE WEATHER CALENDAR HAPPENINGS 4TH Of JULY MUSIC CALENDAR ST. AUGUSTINE FESTIVALS ST. AUGUSTINE CELTIC MUSIC & HERITAGE FESTIVAL LIGHT-UP! NIGHT ST. AUGUSTINE ST. AUGUSTINE NIGHTS OF LIGHTS Nights of Lights Tours CITY BLOG St. Augustine Greek Festival Photos provided by Greek Festival Facebook page Mark Your Calendar Date: October 11 & 12, 2025 Time: Saturday: 11:00am-9:00pm Sunday:   12:00pm-5:00pm Location: Holy Trinity Greek Orthodox Church Visit The Wesbite Get Directions About St. Augustine Greek Festival Immerse yourself in Greek culture and heritage at this annual event celebrating All Things Greek … authentic Greek food, pastry, music, dancing and more! There are plenty of shopping opportunities at the Holy Trinity Agora (market), St. Theodora’s Gift Shop and Bookstore, and the Zaharoplastio (for pastries and treats to take home!) Stop by the Kafenio where they will be serving up Greek frappes and friendly bartenders will have plenty of ouzo lemonada, beer and wine available for purchase. It’s a great way to experience and celebrate Greek Culture and Heritage! Photos provided by Greek Festival Facebook page Greek Food The Greek food offered at the festival has ranged from appetizers to desserts … and even Greek liquor.  All delicious!  Meals have started with the traditional Greek salad, then you choose from entrees like roasted lamb or moussaka (similar to shepherd’s pie but with eggplant and béchamel sauce).  Or, festival goers could opt for an item off the grill like a gyro or pork or chicken Souvlaki dinner or sandwich. Afterward, take your pick from baklava (a filo pastry with walnuts and spice and topped with honey), kataifi (rolled shredded filo filled with walnuts and dipped in honey), melomakarona (honey dipped spice cookies with ground nuts), and a variety of other tasty pastries for dessert.   Of course, you could eat your dessert there or take it home … if it made it that far. Photos provided by Greek Festival Facebook page Places to Stay Back to Festivals Disclaimer: Every effort is made to ensure the accuracy of the information in this article. Please credit OldCity.com when sharing and re-posting. ocws 2025-08-27T10:18:38-04:00 August 27th, 2025 | Community , Fall Activities , Family Friendly , Food , History & Heritage , Kid Friendly , Special Events , St. Augustine Festivals , Things to Do | About the Author: ocws Related Posts WHERE TO STAY Bed & Breakfast Campgrounds, Fish Camps Condominiums & Resorts Historic District Hotels & Motels Oceanfront Rental Short Term Rentals St. Augustine Pet Friendly  Information All Accommodations Listings St. Augustine Parking St. Augustine Pet Friendly Places To Stay St. Augustine Nights of Lights THINGS TO DO Attractions Beaches Festivals History & Culture Music & Art Night Life Shopping Sightseeing Sports & Recreation Weddings St. Augustine Parking St. Augustine Celtic Music & Heritage Festival 4th of July 2025 Light-Up! Night St. Augustine St. Augustine Nights of Lights WHERE TO EAT Fine Dining St. Augustine Restaurant Listings St. Augustine Nights of Lights CALENDAR Happenings Music Calendar St. Augustine Festivals St. Augustine Celtic Music & Heritage Festival 4th of July 2025 Light-Up! Night St. Augustine St. Augustine Nights of Lights THE COMMUNITY Area Businesses City Blog Map & Directions Online Arts Places of Worship Real Estate Weather ABOUT OLDCITY How to Advertise Contact Us Submit An Event © Old City Web Services, Inc. providing St. Augustine Web Design. All Rights Reserved. Page load link Go to Top"
    },
    {
      "url": "https://www.oeko.de/en/institute/team/?tx_wwt3list_recordlist%5Baction%5D=index&tx_wwt3list_recordlist%5Bcontroller%5D=Recordlist&tx_wwt3list_recordlist%5Bpage%5D=7&cHash=4f64d34c515e99528f5a7285cc8d27c4",
      "text": "Team | oeko.de Jump to main content Jump to the search Full text search Search Open search Menü Institute Mission Statement Organisation Team Jobs Expertise Research Methodologies Networks Topics Digitalisation Data governance Digital infrastructure End devices IT applications Artificial intelligence and software Energy transition and climate policy Carbon pricing Germany Renewable energies EU Gas phase-out International Coal phase-out Power grids Green transition of the heating sector Hydrogen and e-fuels Just transition Governance Participation Socially just energy transition Socially just transition of the mobility sector Socially just transition of the heating sector Transdisciplinary research Nuclear technology Plant safety Decommissioning nuclear power plants Final storage International nuclear policy Radiation protection Interim storage Land-use transition Biodiversity Bioeconomy Food systems Agriculture Forests Green transition of the mobility sector Electromobility Climate policy in transport Aviation and maritime transport Sustainability goals and assessment Public transport and new mobility solutions Sustainable production and consumption Procurement Chemicals and hazardous substances Finance Consumption and sufficiency Products and technologies Sports and culture Businesses and supply chains Resources transition Waste management Batteries Building materials Circular economy Plastics Resource and product policy Raw materials and mining Environmental law Emission prevention and control law Climate and energy law Natural resource law Chemicals law Environmental litigation Projects Publications Mitglied werden Blog Magazine Events Press Contact Newsletter DE Become a member Blog Magazine Events Press Contact Newsletter DE Become a member Institute Mission Statement Organisation Team Jobs Expertise Research Methodologies Networks Topics Digitalisation Data governance Digital infrastructure End devices IT applications Artificial intelligence and software Energy transition and climate policy Carbon pricing Germany Renewable energies EU Gas phase-out International Coal phase-out Power grids Green transition of the heating sector Hydrogen and e-fuels Just transition Governance Participation Socially just energy transition Socially just transition of the mobility sector Socially just transition of the heating sector Transdisciplinary research Nuclear technology Plant safety Decommissioning nuclear power plants Final storage International nuclear policy Radiation protection Interim storage Land-use transition Biodiversity Bioeconomy Food systems Agriculture Forests Green transition of the mobility sector Electromobility Climate policy in transport Aviation and maritime transport Sustainability goals and assessment Public transport and new mobility solutions Sustainable production and consumption Procurement Chemicals and hazardous substances Finance Consumption and sufficiency Products and technologies Sports and culture Businesses and supply chains Resources transition Waste management Batteries Building materials Circular economy Plastics Resource and product policy Raw materials and mining Environmental law Emission prevention and control law Climate and energy law Natural resource law Chemicals law Environmental litigation Projects Publications Full text search Search Open search Menü Team At the Oeko-Institut, we work on an interdisciplinary basis in a team of more than 200 staff. Share Facebook LinkedIn [Translate to English:] You are here: Home Institute The Oeko-Institut employs more than 210 staff, including around 150 researchers. There is close collaboration between natural scientists, economists, social scientists, engineers, lawyers and communications experts within the project teams. Executive Board Anke            Herold Executive Board Oeko-Institut e.V. CEO Tel.: Phone: +49 30 405085-386 a.herold@oeko.de Berlin André            Nelius Executive Board Oeko-Institut e.V. Executive Director Tel.: Phone: +49 761 45295-273 a.nelius@oeko.de Freiburg Christof            Timpe Executive Board Oeko-Institut Consult GmbH limited company CEO Tel.: Phone: +49 30 405085-355 c.timpe@oeko-consult.de Berlin Our Team Themen All Research Divisions Staff Energy & Climate Environmental Law & Governance Executive Board Oeko-Institut Consult GmbH limited company Executive Board Oeko-Institut e.V. Finance & Accounting Inter-divisional IT Department Nuclear Engineering & Facility Safety People & Development Public Relations & Communications Resources & Transport Site & Office Management Sustainable Products & Material Flows Tenders & Contracts Search for names Themen All Organizations Oeko-Institut Consult GmbH Oeko-Institut e.V. filter Ich habe keine Datensätze gefunden Further information © Öko-Institut Jobs Join our team! Apply to the Oeko-Institut now. © Öko-Institut ©plainpicture / Elektrons08 Mission Statement These visions and values inform our work. ©plainpicture / Elektrons08 © Öko-Institut Organisation The Oeko-Institut comprises two operational sections: a non-profit association (Oeko-Institut e.V.) and a limited company (Oeko-Institut Consult GmbH). The limited company is a wholly owned subsidiary of the association. © Öko-Institut Still haven't found what you´re looking for? Search search Öko-Institut e.V. Postfach 17 71 79017 Freiburg Merzhauser Straße 173 D-79100 Freiburg Tel. +49 761 45295-0 Fax +49 761 45295-933 E-Mail: info(at)oeko.de Oeko-Institut e.V. PO Box 17 71 79017 Freiburg Germany Merzhauser Straße 173 79100 Freiburg Germany Phone +49 761 45295-0 Fax +49 761 45295-933 E-Mail: info(at)oeko.de Öko-Institut e.V. Rheinstraße 95 D-64295 Darmstadt Tel. +49 6151 8191-0 Fax +49 6151 8191-933 Oeko-Institut e.V. Rheinstraße 95 64295 Darmstadt Germany Phone +49 6151 8191-0 Fax +49 6151 8191-933 Öko-Institut e.V. Borkumstraße 2 D-13189 Berlin Tel. +49 30 405085-0 Fax +49 30 405085-433 Oeko-Institut e.V. Borkumstraße 2 13189 Berlin Germany Phone +49 30 405085-0 Fax +49 30 405085-433 Subscribe to our monthly newsletter: E-Mail * submit Contact Imprint Sitemap Privacy Manage cookies © 2025 Öko-Institut e.V. About Cookies This website uses cookies that process personal data. Some are technically necessary in order to offer you our website without errors or to save your data protection preferences. Other cookies are only set by us after your consent and are used to evaluate and optimize the website. We use the services of YouTube to display videos. You can revoke your consent at any time on the Privacy page with effect for all future visits. Find more information regarding cookies in our Data Protection Declaration Mandatory These cookies are needed for a smooth operation of our website. CookieConsent Purpose Saves your consent to using cookies. Lifetime 1\n                                                            year Type HTML Provider TYPO3 fe_typo_user Purpose Assigns your browser to a session on the server. Lifetime session Type HTTP Provider Website Spendino Purpose Spendino Lifetime session Type Connection Provider GRÜN Software/spendino Mandatory Analysis We analyze visits to the website in a fully privacy-compliant and anonymized manner using Matomo cookieless tracking. In this consent banner, we ask you to allow us to perform further analysis by setting cookies. This enables us to evaluate data on repeated visits to the page. _pk_id Purpose Used to store a few details about the user such as the unique visitor ID. Lifetime 13\n                                                            months Type HTML Provider Matomo (selbstgehostet) _pk_ses Purpose Short lived cookie used to temporarily store data for the visit. Lifetime session Type HTML Provider Matomo (selbstgehostet) Analysis YouTube We use YouTube services for the technical display of videos. YouTube Purpose We use YouTube, which sets cookies, uses browser storage, and also transfers personal data to YouTube. The service loads additional Google services as needed, such as fonts, and transfers your user behavior to the provider Google. Lifetime none Type HTTP Connection Provider Youtube, LLC, 901 Cherry Ave., San Bruno, CA 94066, USA und Google LLC, 901 Cherry Ave. San Bruno, CA 94066, USA YouTube Save Deny all cookies Accept all cookies Data Protection Declaration Imprint"
    },
    {
      "url": "https://staugustinescentrehalifax.org.uk/contact-us/",
      "text": "Contact St. Augustine's Centre: Discover our contact details, location, and how to join our mailing list. Skip to main content I Need Help English English Classes Podcast Advice and Support Asylum and Immigration Housing Health Families and Children Refugee Move On Activities Events and Trips Sports Arts & Music Befriending Cycle Club Chill Out Room Other ways we help Food Free Shop and Salon I Can Help Donate Jobs Volunteer Partner With Us Fundraise Campaign Latest News and Stories Podcasts Content Library About What We Do Our Funders Safeguarding Find Us Donate Now Search Contact Subscribe × Search the site Search for: × Contact St Augustine's Centre Your Name (Required) First Last Your Phone (Required) Your Email (Required) Your Enquiry (Required) CAPTCHA URL This field is for validation purposes and should be left unchanged. × Subscribe to our Newsletter CAPTCHA Email Address Contact us info@staugustinescentrehalifax.org.uk St Augustine’s Centre Hanson Lane Halifax HX1 5PG what3words: ///pumps.popped.fallen For general enquiries please call 01422 352492. We are open Monday-Thursday 9:30am – 3:30pm. For advice and support, come along to our advice drop-in on Tuesday, Wednesday and Thursday, from 9.30 – 11.30am. How to find us By bike Please use the Google Map at the top of this page for directions. Use the postcode HX1 5PG. We have bike racks you can use. They are behind the fence near the containers. Please speak to reception if you need help. By bus If you are travelling by bus to Halifax, you can walk from the bus station, please look at the Google Map at the top of this page for directions. Alternatively, you can take bus 21 from Halifax directly to St Augustine’s Centre. The bus leaves Market Street, stand number 15, every half an hour in the direction of Pellon. The bus takes 7 minutes. You should get off the bus on it’s 6th stop, called Hanson Lane Bowman Grove. This bus stop is opposite St Augustine’s Centre. By car We have some car parking spaces and road side parking. We recommend you park your car on the road in front of the centre. Our postcode for your SatNav is HX1 5PG. Please use the Google Map at the top of this page for directions. By train It’s a 30 minute walk from Halifax train station to St Augustine’s Centre. Or a 10 minute taxi ride for about £5. Walk straight forward from the train station up the hill on Horton Street. When you get to the Victoria Theatre continue on Fountain Street. The road bears to the right, then you reach Barum Top roundabout. At the roundabout walk forward on Cow Green. When you reach the traffic lights in front of New Ebeneezer Church turn left and walk up the hill on Pellon Lane. Continue on this road for 0.3 miles, then turn left on Hanson Lane. Continue on Hanson Lane for 0.4 miles, continue on the road at the roundabout. Our centre is on the right just after Bowman Grove. The building nearest the road is our Support Building. The building set back behind the fence is our Activities Building. Accessibility Interpreters available, so please ask. We have an access ramp into our centre grounds and the ground floors in both our Support building and Activities building are accessible. There is an accessible toilet in our Support building. Please let us know if you have any specific access needs and we will always try meet your needs. Contact info@staugustinescentrehalifax.org.uk 01422 352492 St Augustine’s Centre Hanson Lane Halifax HX1 5PG Send us a message Quick links Jobs Volunteer Financial Report 2023 Articles of Association (Governance) Site Credits Privacy Statement Cookie Policy Accreditation St. Augustine’s Centre, Halifax is a company limited by guarantee (number 06819800) and a registered charity (number 1131784) St. Augustine’s Centre, Halifax is regulated in the UK by the IAA with the authorisation number N201900079 MyLivingWage accreditation: 3 August 2023 ILPA member: 9056 AgencyForGood Copyright 2025. All Rights Reserved"
    },
    {
      "url": "https://sasyorks.org/contact-us",
      "text": "St Augustine’s School | Contact Us Skip to main content Your browser is unsupported and may have security vulnerabilities! Upgrade to a newer browser to experience this site in all it's glory. Menu Contact Us Home Contact Us St Augustine's School, Sandybed Lane, Scarborough, North Yorkshire. YO12 5LH Telephone : 01723 363280 Email: admin@sasyorks.org Web: www.sasyorks.org For all media enquiries please contact: Mr Ben Peck +44 7713 517393 Enquiries / Head of School: Miss R Flanagan Chair of the Board of Trustees: Mr David Laws CEO: Mrs Rachel McEvoy St Augustine's School is a member of the St Cuthbert's Roman Catholic Academy Trust Registered office: c/o. St Mary's College, Cranbrook Avenue, HULL. HU6 7TN Company Number: 09023802 (England & Wales) School opening hours The school Reception is open at the following hours: Monday - Thursday: 8.15am-4.30pm Friday: 8.15am-4.00pm PUPILS SHOULD NOT ARRIVE ON SITE IN THE MORNING BEFORE 8.30AM FOR SAFETY REASONS. Thank you for your cooperation. Requests for copies Paper copies or translations of the information on our website can be made available on request. Please email admin@sasyorks.org and reference the page of the document that you wish. Your details Please use the form below to get in touch with us. We aim to respond to all enquiries within one business day. Leave this field blank Your Query Title Please Select Mr Mrs Miss Dr First Name Last Name Telephone Number Email Address Line 1 Address Line 2 Town/City Country Please Select UK Postcode Submit We will not pass your details on to third parties. See our privacy policy for more information. St Mary’s College Sandybed Lane, Scarborough YO12 5LH North Yorkshire, 01723 363280 Office Manager: Mrs S Brown About Us Parents Our School News Admissions Information Exams Calendar Transition 2025 Teaching School Chaplaincy Contact Us Useful links Google Translate Accessibility Terms & Conditions Privacy Policy Site Map © 2025 St Augustines School Web Design by About Us Headteacher welcome Governance Job vacancies Pastoral Care Policies GDPR Privacy Notices Reports & Statutory Information Pupil Premium Safeguarding Student wellbeing Special Educational Needs and/or Disabilities (SEND) and Pupil Support Parent Support Values & Ethos Videos Parents Catering Letters 2025 Term dates The School Day Transport & Travel Information Uniform Health & Wellbeing for Children Our School Calendar Careers Chaplaincy Curriculum Design Technology & ICT English Geography History Mathematics Media Studies Modern Foreign Languages Music PE, Games & Sports Studies Personal Development Religious Education Science Travel & Tourism Download prospectus Library Library News Extra Curricular Study Support & Revision Activities Music Tuition News Student Hall of Fame Sports News SAS Alumni Admissions Information Exams Calendar Transition 2025 Teaching School Chaplaincy Contact Us Useful links SAS Remote Education -Learning from Home Parent Pay Bedrock Learning Accelerated Reader St Cuthbert's Download Prospectus Google Translate Search Submit"
    },
    {
      "url": "https://historiccoastculture.com/event/st-augustine-greek-festival/",
      "text": "Culture Around Every Corner - HistoricCoastCulture.com Culture Around Every Corner - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Discover Public Art » Samantha Brown's Places to Love » Savor Local Flavors » Explore 450 Years of History » Search historiccoastculture.com Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Culinary Family-Friendly Festivals Free History & Heritage Literary Arts & Film Many Cultures Online/Streaming Performing Arts Visual Arts Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue Select City: City/Town combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select City/Town City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Quick Search Today Weekend Tomorrow The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Search by date range: Today Tomorrow Weekend next 7 14 30 Advanced Search SEARCH Featured Stories Family-Friendly , FREE , Press Releases , Spotlight , Visual Arts Summer in St. Johns Photo Contest By sjcadmin Culinary Arts , Things To See 10 St. Augustine Restaurants with a View By sjcadmin These bars and restaurants pair exceptional culinary experiences with stunning panoramic rooftop views and serene waterfront vistas. VIEW ALL STORIES Family-Friendly , FREE , Things To See , Visual Arts Interactive Mural in Hastings Celebrates Florida Farming By sjcadmin Culinary Arts , Family-Friendly , Things To See Best Brunch Spots in St. Augustine By sjcadmin Performing Arts , Press Releases GRAND REOPENING: Ponte Vedra Concert Hall By sjcadmin VIEW ALL STORIES FEATURED EVENTS Upcoming Events Performing Arts Visual Arts Literary Arts & Film Festivals History & Heritage Sep 13 Ancient City Poets at Sing Out Loud Presented by Ancient City Poets Spinster Abbott's, St. Augustine Sep 13 Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 14 Art and Bark In the Park Presented by City of St. Augustine Beach and The Saint Augustine Art Studio and Gallery and St. Johns Cultural Council Lakeside Park, St. Augustine Sep 14 Plein Air in the Park Presented by St. Augustine Art Association and St. Johns Cultural Council Lakeside Park, St. Augustine TICKETS / REGISTRATION Sep 14 Al Canali Project - Blues Jam 2 Presented by Romanza and St. Augustine Jazz Society Royal St. Augustine Golf & Country Clubhouse, St. Augustine TICKETS / REGISTRATION Jun 06 - Sep 14 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four Lightner Museum, St. Augustine Accessibility Info Sep 19 Comedy Smackdown Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 20 St. Augustine Book Festival Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine Sep 23 - 24 Pastel Landscape Painting Workshop (with... Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine TICKETS / REGISTRATION Sep 13 Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 19 Comedy Smackdown Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info May 09 - Sep 24 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association St. Johns County Ocean Pier, St. Augustine Beach TICKETS / REGISTRATION Sep 27 Romanza Collage presents A Swing and a Miss! Presented by Romanza The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 11 - Oct 05 Nunsense Presented by Limelight Theatre Limelight Theatre TICKETS / REGISTRATION Accessibility Info Oct 10 First Coast Opera - Fanfare! Presented by First Coast Opera St. Anastasia Catholic Church, St. Augustine TICKETS / REGISTRATION Accessibility Info Oct 11 Voctave - The Corner of Broadway and Main... Presented by EMMA Concert Association Flagler College - Lewis Auditorium, St. Augustine TICKETS / REGISTRATION Sep 06 - Oct 11 Comedy Carousel Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info VIEW MORE PERFORMING ARTS View All Performing Arts » Sep 14 Plein Air in the Park Presented by St. Augustine Art Association and St. Johns Cultural Council Lakeside Park, St. Augustine TICKETS / REGISTRATION Jun 06 - Sep 14 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four Lightner Museum, St. Augustine Accessibility Info Sep 23 - 24 Pastel Landscape Painting Workshop (with... Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine TICKETS / REGISTRATION Sep 25 Charlie Cawley | Pathways: A Career in the... Presented by St. Johns Cultural Council The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 05 - 28 Annual Fall Members Show Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine Sep 05 - 30 \"Doorway of Dreams\" Works by Nikki Rakov Presented by Butterfield Garage Art Gallery Butterfield Garage Art Gallery, St. Augustine TICKETS / REGISTRATION Accessibility Info Aug 12 - Oct 06 High Tide Gallery | Rotunda Spotlight Presented by St. Johns Cultural Council St. Johns County Administration Building, St. Augustine Oct 09 Best of Juried Artist Member (JAM) Exhibiton Presented by First Coast Cultural Center First Coast Cultural Center, Ponte Vedra Beach TICKETS / REGISTRATION Accessibility Info VIEW MORE VISUAL ARTS View All Visual Arts » Sep 13 Ancient City Poets at Sing Out Loud Presented by Ancient City Poets Spinster Abbott's, St. Augustine Sep 26 AAUW Film Festival The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 28 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council The Waterworks, St. Augustine Accessibility Info Sep 28 \"Ciao Professore\" Film Screening Presented by St. Augustine Film Society Unitarian Universalist Fellowship, St. Augustine Oct 26 The Ghost in You - Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council The Waterworks, St. Augustine Accessibility Info VIEW MORE LITERARY ARTS FILM View All Literary Arts Film » Sep 20 St. Augustine Book Festival Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine Sep 05 - 28 St. Augustine Songwriters Festival Presented by Sing Out Loud Festival Francis Field, St. Augustine TICKETS / REGISTRATION Sep 05 - 28 Sing Out Loud Festival Presented by Sing Out Loud Festival Francis Field, St. Augustine TICKETS / REGISTRATION Oct 18 Vibe-Rations Music Festival Presented by Vilano Beach Main Street, Inc. Hampton Inn & Suites, St. Augustine TICKETS / REGISTRATION Dec 06 SEA Community's 12th Annual Gullah Geechee... Presented by SEA Community Help Resource Center, Inc. Armstrong Park, Elkton Apr 25 Florida's Photo Fest - Keynote Reception Presented by Florida Photo Fest The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info VIEW MORE FESTIVALS View All Festivals » Oct 03 - 31 Mortality and Mourning: Women in Black Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine TICKETS / REGISTRATION Aug 21 - Dec 20 Historic House Tours Presented by Woman's Exchange of St. Augustine Peña-Peck House, St. Augustine Aug 20 - Dec 20 Family Scavenger Hunt at the Peña-Peck House Presented by Woman's Exchange of St. Augustine Peña-Peck House, St. Augustine Nov 15 - Jan 05 A Celebration of Art and History: The... Presented by Ximenez-Fatio House Museum and St. Augustine Art Association Ximenez-Fatio House Museum, St. Augustine TICKETS / REGISTRATION Ongoing Militia Muster at Fort Mose Presented by Fort Mose Historical Society Fort Mose Historic State Park, St. Augustine VIEW MORE HISTORY HERITAGE View All History Heritage » Most Viewed Events Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv at Third Space Improv Sep 13, 2025 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four at Lightner Museum Jun 06 - Sep 14, 2025 Comedy Smackdown Presented by Third Space Improv at Third Space Improv Sep 19, 2025 Pastel Landscape Painting Workshop (with Cynthia Pierson) Presented by St. Augustine Art Association at St. Augustine Art Association Sep 23 - Sep 24, 2025 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association at St. Johns County Ocean Pier May 09 - Sep 24, 2025 Romanza Collage presents A Swing and a Miss! Presented by Romanza at The Waterworks Sep 27, 2025 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council at The Waterworks Sep 28, 2025 Annual Fall Members Show Presented by St. Augustine Art Association at St. Augustine Art Association Sep 05 - Sep 28, 2025 Fiber Arts and Flicks Presented by Southeast Branch Library at Southeast Branch Public Library Sep 29, 2025 SUBMIT A LISTING DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.usa.edu/about/contact-us/",
      "text": "Contact Us | USAHS Featured Programs Pages Events Faculty University Administration Posts Programs Pages Events Faculty University Administration Posts Careers @ USA For Alumni For Current Students Request Information Apply Now Featured Programs Pages Events Faculty University Administration Posts Programs Pages Events Faculty University Administration Posts Explore Our Programs College of Rehabilitative Sciences Occupational Therapy Programs Master of Occupational Therapy (MOT) Doctor of Occupational Therapy (OTD) Post-Professional Doctor of Occupational Therapy (PPOTD) College of Health Sciences Master of Health Administration (MHA) Doctor of  Education (EdD) Graduate Certificates Continuing Professional Education Clinical Orthopedic Residency (OCS) Continuing Professional Education (CPE) Physical Therapy Programs Doctor of Physical Therapy (DPT) Non-Degree Physical Therapy Online Courses Speech-Language Pathology Program (MS-SLP) School of Nursing Post-Graduate Nursing Certificates Master of Science in Nursing (MSN) Doctor of Nursing Practice (DNP) Browse All Degree-Programs Student Experience Student Services For Prospective Students For Admitted Students For Current Students For Alumni Campus Life San Marcos, California St. Augustine, Florida Miami, Florida Austin, Texas Dallas, Texas Why USAHS EdTech Tools Immersive Clinical Simulation Labs Modern Learning Spaces Dynamic Blended Learning Module Interprofessional Education Pro Bono Experiences National Network of Faculty Admissions & Aid Admissions & Aid Home Scholarships & Grants How to Apply Cost of Attendance Financial Aid Application Deadlines Academic Calendar Admissions FAQs Catalog/Handbook About Essential Information Our History Accreditation B Corp Certified Student Achievement Data Institutional Learning Outcomes (ILOs) News USAHS Shop Explore All Campuses San Marcos, California St. Augustine, Florida Miami, Florida Austin, Texas Dallas, Texas People Our Faculty Leadership Board of Directors Alumni Careers Events Blog Request Information Apply Now Featured Programs Pages Events Faculty University Administration Posts Programs Pages Events Faculty University Administration Posts Search for: Search Close Explore Our Programs College of Rehabilitative Sciences Occupational Therapy Programs Master of Occupational Therapy (MOT) Doctor of Occupational Therapy (OTD) Post-Professional Doctor of Occupational Therapy (PPOTD) College of Health Sciences Master of Health Administration (MHA) Doctor of  Education (EdD) Graduate Certificates Continuing Professional Education Clinical Orthopedic Residency (OCS) Continuing Professional Education (CPE) Physical Therapy Programs Doctor of Physical Therapy (DPT) Non-Degree Physical Therapy Online Courses Speech-Language Pathology Program (MS-SLP) School of Nursing Post-Graduate Nursing Certificates Master of Science in Nursing (MSN) Doctor of Nursing Practice (DNP) Browse All Degree-Programs Student Experience Student Services For Prospective Students For Admitted Students For Current Students For Alumni Campus Life San Marcos, California St. Augustine, Florida Miami, Florida Austin, Texas Dallas, Texas Why USAHS EdTech Tools Immersive Clinical Simulation Labs Modern Learning Spaces Dynamic Blended Learning Module Interprofessional Education Pro Bono Experiences National Network of Faculty Admissions & Aid Admissions & Aid Home Scholarships & Grants How to Apply Cost of Attendance Financial Aid Application Deadlines Academic Calendar Admissions FAQs Catalog/Handbook About Essential Information Our History Accreditation B Corp Certified Student Achievement Data Institutional Learning Outcomes (ILOs) News USAHS Shop Explore All Campuses San Marcos, California St. Augustine, Florida Miami, Florida Austin, Texas Dallas, Texas People Our Faculty Leadership Board of Directors Alumni Careers Events Blog Request Information Apply Now Careers @ USA For Alumni For Current Students Request Information Apply Now USAHS Contact Us Please complete our contact form. Our dedicated staff will reach out to provide information and answer your questions. San Marcos, CA Campus 700 Windy Point Drive San Marcos, CA 92069 St. Augustine, FL Campus 1 News Place St. Augustine, FL 32086 Miami, FL Campus Douglas Entrance North Tower 800 S. Douglas Road, Suite 149 Coral Gables, FL 33134 Austin, TX Campus 5401 La Crosse Ave Austin, TX 78739 Dallas, TX Campus 901 W Walnut Hill Lane, Suite 210A Irving, Texas 75038 General Inquiries : (800) 241-1027 Enrollment and Admissions : (855) 481-9203 Media Inquiries : (737) 202-3234 Fax : (904) 826-0085 Why USAHS Our History Innovative Learning Model B Corp Certified Leadership Our Faculty Explore Our Programs College of Rehabilitative Sciences College of Health Sciences Continuing Professional Education Student Services For Prospective Students For Admitted Students For Current Students For Alumni Admissions & aid How to Apply Admissions FAQs Application Deadlines Financial Aid Important Resources Contact Us MyUSA Webmail Library USAHS Shop Complaints Catalog/Handbook Careers @ USA Media Resources State Licensure © Copyright 2025 University of St. Augustine for Health Sciences Legal and Consumer Disclosures Title IX / Safety & Security Privacy Policy Program Data Accreditation"
    }
  ]
}