{
  "fuentes": [
    {
      "url": "https://www.usms.org/clubs/swim-like-a-pro-2148",
      "email": "sara@swim-like-a-pro.com"
    },
    {
      "url": "https://perfectaquatics.com/pages/contact-us",
      "email": "perfect_aquatics_gif_opt_100x@2x.webp"
    },
    {
      "url": "https://perfectaquatics.com/pages/contact-us",
      "email": "info@perfectaquatics.co.uk"
    },
    {
      "url": "https://www.arcinvestments.com/news/T1851",
      "email": "sugarmill@arcinvestments.com"
    },
    {
      "url": "https://www.arcinvestments.com/news/T1851",
      "email": "sugarmill@arcinvestments.com"
    },
    {
      "url": "https://aquaticliving.co.uk/pages/contact",
      "email": "info@aquaticliving.co.uk"
    },
    {
      "url": "https://www.stcloudfl.gov/25/Human-Resources",
      "email": "human.resources@stcloudfl.gov"
    },
    {
      "url": "https://www.stcloudfl.gov/25/Human-Resources",
      "email": "humanresources@stcloudfl.gov"
    },
    {
      "url": "https://www.stcloudfl.gov/25/Human-Resources",
      "email": "justin.kluesner@stcloudfl.gov"
    },
    {
      "url": "https://stcloudfl.gov/33/Committees-Boards",
      "email": "stacey.wilde@stcloudfl.gov"
    }
  ],
  "mails": [
    "human.resources@stcloudfl.gov",
    "humanresources@stcloudfl.gov",
    "info@aquaticliving.co.uk",
    "info@perfectaquatics.co.uk",
    "justin.kluesner@stcloudfl.gov",
    "perfect_aquatics_gif_opt_100x@2x.webp",
    "sara@swim-like-a-pro.com",
    "stacey.wilde@stcloudfl.gov",
    "sugarmill@arcinvestments.com"
  ],
  "nombre_sitio": "stcloudfl.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.usms.org/clubs/swim-like-a-pro-2148",
      "text": "Swim Like A Pro | U.S. Masters Swimming Menu My Account Community/Forums USMS Website Logout Training Events Club Finder Workout Library About Us Join Search Log In Home Club Finder Swim Like A Pro + View Full Image × Swim Like A Pro A fun, social, and competitive Masters Swimming and Triathlon Team located in multiple cities and pools in Central Florida. We provide group swim practices, stroke technique sessions, swim meet competition, triathlon training, open water races, and fun team adventure challenges! Practice Information NATIONAL TRAINING CENTER (1935 Don Wickham Dr, Clermont): Monday/Wednesday/Friday - 6:00a-7:00a Tuesday/Thursday - 12:00-1:00p Tuesday/Thursday - 7:00-8:00p ~~~~ WATERFRONT PARK OPEN WATER (330 3rd St, Clermont): Saturday - (winter) 10:00a-11:30p, (summer) 7:00-8:30a ~~~~ CELEBRATION FITNESS CENTER (400 Celebration Place): Tuesday & Thursday - 6:30-7:30p ~~~~ Fees: $10 for a single drop-in swim $75 per month for unlimited swims **COVID CANCELATIONS: We are still waiting for these locations to allow us to resume practices. Stay tuned on our website for updates (swim-like-a-pro.com): ~~~~ WINDERMERE PREP SCHOOL (6189 Winter Garden-Vineland Rd) ST. CLOUD CHRIS LYLE AQUATIC CENTER (3001 17th St, St. Cloud) 92 AdventHealth Wellness Center - Celebration 400 Celebration Boulevard Celebration, FL 34747 25m Indoor Pool 98 Chris Lyle Aquatic Center 2991 17th Street St Cloud, FL 34769 25y Outdoor Pool 98 National Training Center 1935 Don Wickham Drive Clermont, FL 34711 25y Outdoor Pool 98 Waterfront Park 330 3rd Street Clermont, FL 34711 Lake Open Water Contact Swim Like A Pro First Name Last Name Email Address Phone Number Are you a current USMS member? Yes No What are you looking for? Attend a practice Find a coach Join a club Message Sign up for updates from USMS Join USMS Now Club Contact Sara McLarty 386-747-4324 sara@swim-like-a-pro.com Visit Club Website Club Designations USMS Certified Coach USMS Certified Gold Club Connect With Us × USMS Certified Coaches The U.S. Masters Swimming–Certified Coach logo identifies swim clubs near me where you can find a USMS-certified coach. These coaches have furthered their Masters coaching education and have passed the certification exam. Note: A certified coach might not be at all locations or workouts. × Gold Club Designation The Gold Club logo identifies Masters clubs and workout groups that provide members with the best Masters Swimming experience possible. Gold Clubs have a U.S. Masters Swimming–certified coach on staff, participate in fitness events, and offer a free trial to potential members, among many other benefits. × USMS Certified Adult Learn-to-Swim Instructors The Certified Adult Learn-to-Swim Instructor logo identifies swim teams near me that have a U.S. Masters Swimming–certified ALTS instructor. These instructors have furthered their swim-lessons instruction education and have passed the certification exam. Note: A certified ALTS instructor might not be at all locations or workouts. × USA Swimming Foundation The USA Swimming Foundation logo identifies clubs that receive support from the foundation for their adult swim-lessons program. These grant programs offer adult learn-to-swim lessons at a reduced cost. Most also are led by a USMS-certified adult learn-to-swim instructor. About USMS What is Masters Swimming? Mission Vision Values Organizational Structure National Office Diversity & Inclusion SWIMMER magazine STREAMLINES Newsletters Community USMS History Logo Merchandise Partners Donate to ALTS Grants Try Masters Swimming College Club Swimming Grown-Up Swimming Pool and Open Water Events Calendar of Events Event Central Event Development Program Sanction an Event Open Water Central Fitness Events National Championships Event Results Rankings Records Top 10 All-American All-Stars World Aquatics Masters Championships Pan Am Masters Championships Stroke Development Clinic Join Join or Renew Membership Benefits Trial Membership Form USMS+ Membership Comparison Club Central Club Central How to Start a Club Register - Renew - Update Club Club Resources Gold Club Designation Insurance Club Development Program Membership Lists Coach Central Coach Central Become a Coach National Coaches Clinic Coach Certification Certified Coaches Designated Coach Resources Continuing Education Mentor Coach Program Coaching Jobs ALTS Central ALTS Central April Is Adult Learn-to-Swim Month Donate to ALTS Grants ALTS Grants How to Apply for a Grant Adult Learn-to-Swim Initiatives Instructor Certification Fitness and Training Club Finder Freestyle Guide Video Stroke Analysis Workout Library Training Plans Fitness Logs Swim.com Integration Articles and Videos Swimming 101 Learn to Swim Triathletes Volunteers Volunteer Central Development Programs Relay 2025 Guide to Local Operations Policy and Governance Finance and Oversight LMSC Resources Officials BOD and Committees Meeting Minutes Annual Meeting Elections Awards Rule Book Join Now © 2025 U.S. Masters Swimming Contact Us USMS Privacy Policy We see you are using Internet Explorer as your browser. Microsoft no longer supports Internet Explorer so you will experience issues on our website and others. Please use another browser like: Google Chrome, Mozilla Firefox, or Apple Safari. Accept {\r\n  \"ContactInfo\": {\r\n    \"FirstName\": null,\r\n    \"MiddleInitial\": null,\r\n    \"LastName\": null,\r\n    \"Email\": null,\r\n    \"Address\": null,\r\n    \"City\": null,\r\n    \"State\": null,\r\n    \"Zip\": null,\r\n    \"Gender\": null,\r\n    \"Month\": 0,\r\n    \"Day\": 0,\r\n    \"Year\": 0,\r\n    \"Phone\": null,\r\n    \"Country\": null,\r\n    \"BirthDate\": null,\r\n    \"SalesforceId\": null\r\n  },\r\n  \"Club\": {\r\n    \"SelectedClub\": null,\r\n    \"SelectedLmsc\": null,\r\n    \"SelectedWorkoutGroup\": null\r\n  },\r\n  \"Interests\": {\r\n    \"SelectedInterests\": null,\r\n    \"Magazine\": null,\r\n    \"Coach\": false,\r\n    \"SelfIdentifiedCoach\": false\r\n  },\r\n  \"RegistrationStatus\": {\r\n    \"Active\": false,\r\n    \"Renewal\": false,\r\n    \"SwimmerId\": null,\r\n    \"IsLapsed\": false,\r\n    \"TrialCount\": 0,\r\n    \"PendingMember\": false,\r\n    \"InRecurringBilling\": false\r\n  }\r\n}"
    },
    {
      "url": "https://perfectaquatics.com/pages/contact-us",
      "text": "Contact Us | Biggest Koi Store in Henlow Bedfordshire Skip to content Free Delivery over £50* - 1000's of Products In-Stock - Exclusive Lines - Shop Now! Home Events Japanese Koi Pond Tropical Marine Gift Cards Blog Posts Perfect Aquatics Competitions Need help? Call us 01462 850822 info@perfectaquatics.co.uk Follow Us Facebook Twitter Instagram YouTube Back Japanese Koi Japanese Koi Koi Auction - Winners Back Pond Preformed Ponds & Liner Pond Plants Filters UV Filters UV Bulbs Foods Treatments Pumps and Fountains Pipework and Fittings Outdoor Lighting Accessories Spares Back Tropical Aquariums Accessories Filters / Pumps Foods Lighting and Heaters Spares Treatments Back Marine Aquariums Lighting Protein Skimmers Filters / Pumps Rockwork / Sand Foods Accessories Spares Frozen Food Back Blog Posts News Ultimate Fishkeeping Guides Back Preformed Ponds & Liner Preformed Ponds and Liner Liner Calculator Pond Volume Calculator Back Pond Plants Deep Water Pond Plants Oxygenating Pond Plants Marginal Pond Plants Floating Pond Plants Lilies Pond Snails All Pond Plants Back Filters Evolution Aqua Oase PondXpert Laguna Superfish Blagdon All Pond Filters Filter Media/Foams Back UV Filters Evolution Aqua Oase PondXpert All UV Filters Back Foods Hikari NT Labs Saki Hikari Shark Tetra Takazumi All Pond Food Back Treatments Aqua Utopia Algae Treatments Bactoplus Blagdon Cloverleaf Colombo Evolution Aqua Kusuri NT Labs All Pond Treatments Back Pumps and Fountains Oase Evolution Aqua FujiMac Laguna PondXpert Superfish Blagdon Bermuda All Pumps and Fountains Back Pipework and Fittings Pressure Waste Eazy Connectors Back Outdoor Lighting Oase PondXpert Blagdon Bermuda All Outdoor Lighting Back Accessories Air Accessories Filter Media Hose Accessories Nets Koi Bowls Pond Heaters Pond Vacuums Pond Feeders Pond Skimmers Pond Testing Kits Pond Covers Posters Switch Boxes Spawning Brushes All Pond Accessories Back Spares Bermuda Blagdon Evolution Aqua Laguna Oase PondXpert Superfish Back Aquariums Aqua One AquaEl Aquatlantis BiOrb D-D Aqua Pro D-D Aqua Pro Aquascaper Eheim Fluval Juwel Oase Redsea Desktop Aquariums Superfish TMC Freshwater Aquariums Aquarium Cabinets All Aquariums Back Accessories Aquarium Decor Aquarium Background Aquascaping Tools Air Accesories Aquarium Gravel Breeding Traps Cleaning Equipment CO2 Kits Nets Plant Food Testing Kits Extra Accessories Back Filters / Pumps Air Pumps Aquarium Filter Media Internal Filters External Filters Hang On Filters Air Sponge Filters Return Pumps UV Filters Wavemakers All Filters / Pumps Back Foods Automatic Feeders Cloverleaf Hikari Holiday Food King British NT Labs Ocean Nutrition Superfish Tetra Vitalis Frozen Food All Tropical Foods Back Lighting and Heaters Aquael Lighting Superfish Lighting Interpet Lighting Juwel Lighting NT Labs Lighting All Aquarium Lighting Heaters, Chillers and Fans Back Spares AquaEl BiOrb Eheim Fluval Juwel Superfish Back Treatments API Colombo Evolution Aqua Esha Fluval Interpet NT Labs Seachem Tetra Waterlife Back Aquariums Aqua One AquaEl Aquaforest D-D Reef Pro D-D Reef Pro Deluxe Fluval Neptunian Nyos Red Sea TMC All Marine Aquariums Back Lighting Ecotech Marine RedSea Aqua Illumination TMC Lighting Back Protein Skimmers Aqua One Aquavitro Deltec RedSea Reef Octopus Nyos Fluval SEA TMC D-D Back Filters / Pumps Algae Reactors Automatic Top Offs Dosing Pumps External Filters Fluidized Reactors Roller Mats Return Pumps UV Filters Wavemakers Back Rockwork / Sand Aquaforest Rock Caribsea Rock D-D Marco Rock Hugo Rock TMC Rock Aqua One Sand Aquaforest Sand Colombo Sand Caribsea Sand TMC Sand Back Foods Aquaforest NT Labs Nyos Ocean Nutrition Vitalis Back Accessories Cleaning Cover Nets Cabinet Management Control & Monitoring Fragging Heaters, Chillers & Fans Marine Treatments Marine Salt Media Refractometers Testing Kits Back Spares Redsea D-D TMC Ecotech Marine Nyos Aqua Illumination Deltec Kamoer Jecod Fluval SEA Tunze Reef Octopus Perfect Aquatics Ltd Clear Close Login / Signup My account 0 Cart Spend £50.00 more and get free shipping! Your cart is empty Shop our products Home Events Japanese Koi Japanese Koi Koi Auction - Winners Pond Preformed Ponds & Liner Preformed Ponds and Liner Liner Calculator Pond Volume Calculator Pond Plants Deep Water Pond Plants Oxygenating Pond Plants Marginal Pond Plants Floating Pond Plants Lilies Pond Snails All Pond Plants Filters Evolution Aqua Oase PondXpert Laguna Superfish Blagdon All Pond Filters Filter Media/Foams UV Filters Evolution Aqua Oase PondXpert All UV Filters UV Bulbs Foods Hikari NT Labs Saki Hikari Shark Tetra Takazumi All Pond Food Treatments Aqua Utopia Algae Treatments Bactoplus Blagdon Cloverleaf Colombo Evolution Aqua Kusuri NT Labs All Pond Treatments Pumps and Fountains Oase Evolution Aqua FujiMac Laguna PondXpert Superfish Blagdon Bermuda All Pumps and Fountains Pipework and Fittings Pressure Waste Eazy Connectors Outdoor Lighting Oase PondXpert Blagdon Bermuda All Outdoor Lighting Accessories Air Accessories Filter Media Hose Accessories Nets Koi Bowls Pond Heaters Pond Vacuums Pond Feeders Pond Skimmers Pond Testing Kits Pond Covers Posters Switch Boxes Spawning Brushes All Pond Accessories Spares Bermuda Blagdon Evolution Aqua Laguna Oase PondXpert Superfish Tropical Aquariums Aqua One AquaEl Aquatlantis BiOrb D-D Aqua Pro D-D Aqua Pro Aquascaper Eheim Fluval Juwel Oase Redsea Desktop Aquariums Superfish TMC Freshwater Aquariums Aquarium Cabinets All Aquariums Accessories Aquarium Decor Aquarium Background Aquascaping Tools Air Accesories Aquarium Gravel Breeding Traps Cleaning Equipment CO2 Kits Nets Plant Food Testing Kits Extra Accessories Filters / Pumps Air Pumps Aquarium Filter Media Internal Filters External Filters Hang On Filters Air Sponge Filters Return Pumps UV Filters Wavemakers All Filters / Pumps Foods Automatic Feeders Cloverleaf Hikari Holiday Food King British NT Labs Ocean Nutrition Superfish Tetra Vitalis Frozen Food All Tropical Foods Lighting and Heaters Aquael Lighting Superfish Lighting Interpet Lighting Juwel Lighting NT Labs Lighting All Aquarium Lighting Heaters, Chillers and Fans Spares AquaEl BiOrb Eheim Fluval Juwel Superfish Treatments API Colombo Evolution Aqua Esha Fluval Interpet NT Labs Seachem Tetra Waterlife Marine Aquariums Aqua One AquaEl Aquaforest D-D Reef Pro D-D Reef Pro Deluxe Fluval Neptunian Nyos Red Sea TMC All Marine Aquariums Lighting Ecotech Marine RedSea Aqua Illumination TMC Lighting Protein Skimmers Aqua One Aquavitro Deltec RedSea Reef Octopus Nyos Fluval SEA TMC D-D Filters / Pumps Algae Reactors Automatic Top Offs Dosing Pumps External Filters Fluidized Reactors Roller Mats Return Pumps UV Filters Wavemakers Rockwork / Sand Aquaforest Rock Caribsea Rock D-D Marco Rock Hugo Rock TMC Rock Aqua One Sand Aquaforest Sand Colombo Sand Caribsea Sand TMC Sand Foods Aquaforest NT Labs Nyos Ocean Nutrition Vitalis Accessories Cleaning Cover Nets Cabinet Management Control & Monitoring Fragging Heaters, Chillers & Fans Marine Treatments Marine Salt Media Refractometers Testing Kits Spares Redsea D-D TMC Ecotech Marine Nyos Aqua Illumination Deltec Kamoer Jecod Fluval SEA Tunze Reef Octopus Frozen Food Gift Cards Blog Posts News Ultimate Fishkeeping Guides Perfect Aquatics Competitions Contact Us Please use our contact form below or use our Live Chat service to contact us. *PLEASE NOTE* if you are not price matching a product, please leave the requested information blank. Your name Your email Your message Send message Find us Perfect Aquatics, Hitchin Road, Henlow, Bedfordshire, SG16 6BB Visit our Store Perfect Aquatics Hitchin Road, Henlow Bedfordshire SG16 6BB 100% Satisfaction If you have any problem with the products you have purchased, get in touch! Caring for our Customers Call us for any advice you need on  01462 850 822 Open 7 Days a Week Monday - Saturday: 9am - 5.30pm Sunday: 11am - 5pm Klarna Finance Klarna Finance FAQ's Klarna Terms and Conditions Loyalty Scheme LoyalZoo - COMING SOON Hey, Don't forget about us down here! Terms and Conditions About us News Contact us Orders Order Tracking Price Match Shipping Returns Warranty Perfect Aquatics Store Opening Hours Monday: 9AM - 5:30PM Tuesday: 9AM -5:30PM Wednesday: 9AM - 5:30PM Thursday: 9AM - 5:30PM Friday: 9AM - 5:30PM Saturday: 9AM - 5:30PM Sunday: 11AM - 5PM Pet License CB/LANW/16/055849 © 2025 Perfect Aquatics Ltd Powered by Shopify Follow Us We Accept Apple Pay Google Pay Mastercard PayPal Shop Pay Visa © 2025 Perfect Aquatics Ltd Powered by Shopify Opens in a new window."
    },
    {
      "url": "https://www.arcinvestments.com/news/T1851",
      "text": "Chris Lyle Aquatic Center About Sugar Mill Amenities Testimonials Community News Request Info Request Info for Sugar Mill Your Message* * Required Fields Chris Lyle Aquatic Center April 29, 2013 Chris Lyle Aquatic  Center 3001 17th St., St. Cloud , FL , 34769 Aqua-Fit Aqua-Fit class is only held if weather permits. Three participants must be present to hold a class. Monday – Friday @ 8:00 am and 11:00 am Monday - Thursday @ 6:00 pm Saturday @ 11:00 am Cost - $1.00 for pool members, $2.50 for non-pool members, $3.50 non-pool, non-county residents Water Pilates Resuming April 30 th this thirty minute class offers a challenging, mind-body workout for everyone – especially aqua exercisers, fitness swimmers, Pilate’s enthusiasts and dancers! Tuesday and Thursday’s Noon Cost - $1.00 for pool members, $2.50 for non-pool members, $3.50 non-pool, non-county residents Return to Community News Return to Sugar Mill Home Page Sugar Mill 3130 A Sugar Mill Lane Saint Cloud, FL 34769 (407) 957-3055 SugarMill@ARCinvestments.com Community Brochure Home | Communities | News | About ARC | Contact Us | Site Map | Privacy Policy Communities: California | New Mexico | Michigan | Florida © 2025 ARC Investments."
    },
    {
      "url": "https://aquaticliving.co.uk/pages/contact",
      "text": "Contact Us – Aquatic Living Browse Close menu Your Cart ( ) \"Close Cart\" GUARANTEED SAFE & SECURE CHECKOUT Spend £300 to Unlock Free Shipping to United Kingdom 0 0 Your cart is currently empty. Shop Now Water Tanks Non Potable Water Tanks (Vertical) Potable Drinking Water Tanks (Vertical) Fluid Category 5 AB Air Gap Break Tank Baffled Water Tanks Sprayer Water Tanks Horizontal Sprayer Tank Vertical Sprayer Water Tanks Transport Tanks & Bowsers Horizontal Transport Tanks Rainwater Harvesting Tanks Insulated Water Tanks Static Water Tanks (Horizontal) Static Water Bowsers Static Tanks Non-Potable Static Water Bowsers Potable Static Drinking Water Bowsers With Bauer Filler Water Features All Water Features Durable Lightweight Resin Waterfalls Metal Water Features Lightweight Concrete Waterfalls Water Harvesting Garden Pools Premium Wooden Pools Knightsbridge Pool Belgravia Pool Bayswater Pool Westminster Pool Chelsea Pool Exercise Pool Nazca Wooden Pools Nazca 4m x 2m Exercise Pool Nazca 6m x 3m Pool Nazca 6m x 4m Pool Nazca 8m x 2m Pool Nazca 8m x 4m Pool Eco Pool Small Eco Pool Large Eco Pool Large Stretched Eco Pool Splasher Pools Wooden Fun Pools Intex Easy Set Pools Intex Metal Frame Pools Paddling Pools Fun & Games Pool Ride-On Inflatables Solar Covers EnergyGuard 500 Micron Sol+Guard 500 Micron CoolGuard Ultra 500 Micron Midas 500 Micron Apollo 400 Micron Blue 400 Micron Black 400 Micron Blue 200 Micron Leading Edge Winter Debris Covers Deluxe Debris Covers Deluxe Criss Cross Debris Covers Flush-Fix Debris Covers Premium Debris Covers Low Profile Decking Debris Covers Opaque Debris Covers Above Ground Pool Debris Covers Accessories Commercial Brands The FirePit Company Mon-Sat 9am-6pm GMT 020-3004-1152 Close Menu Water Tanks Non Potable Water Tanks (Vertical) Potable Drinking Water Tanks (Vertical) Fluid Category 5 AB Air Gap Break Tank Baffled Water Tanks Sprayer Water Tanks Horizontal Sprayer Tank Vertical Sprayer Water Tanks Transport Tanks & Bowsers Horizontal Transport Tanks Rainwater Harvesting Tanks Insulated Water Tanks Static Water Tanks (Horizontal) Static Water Bowsers Static Tanks Non-Potable Static Water Bowsers Potable Static Drinking Water Bowsers With Bauer Filler Water Features All Water Features Durable Lightweight Resin Waterfalls Metal Water Features Lightweight Concrete Waterfalls Water Harvesting Garden Pools Premium Wooden Pools Knightsbridge Pool Belgravia Pool Bayswater Pool Westminster Pool Chelsea Pool Exercise Pool Nazca Wooden Pools Nazca 4m x 2m Exercise Pool Nazca 6m x 3m Pool Nazca 6m x 4m Pool Nazca 8m x 2m Pool Nazca 8m x 4m Pool Eco Pool Small Eco Pool Large Eco Pool Large Stretched Eco Pool Splasher Pools Wooden Fun Pools Intex Easy Set Pools Intex Metal Frame Pools Paddling Pools Fun & Games Pool Ride-On Inflatables Solar Covers EnergyGuard 500 Micron Sol+Guard 500 Micron CoolGuard Ultra 500 Micron Midas 500 Micron Apollo 400 Micron Blue 400 Micron Black 400 Micron Blue 200 Micron Leading Edge Winter Debris Covers Deluxe Debris Covers Deluxe Criss Cross Debris Covers Flush-Fix Debris Covers Premium Debris Covers Low Profile Decking Debris Covers Opaque Debris Covers Above Ground Pool Debris Covers Accessories Commercial Brands The FirePit Company Got a Question? Call Us 020-3004-1152 Mon-Sat 9am-6pm GMT Home / Contact Us Get in Touch – We're Here to Help! Our team of aquatic experts is ready to help. Choose the best way to reach us! Contact Form I agree to subscribe to updates from Aquatic Living Privacy Policy Contact Us Availability: Mon-Sat 9am-6pm GMT 020-3004-1152 info@aquaticliving.co.uk Live Chat"
    },
    {
      "url": "https://www.stcloudfl.gov/25/Human-Resources",
      "text": "Human Resources | City of St. Cloud, Florida - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government Services Business Community How Do I... Search Home City Government Departments Human Resources Human Resources Human Resources Mission Our mission is to develop and implement effective policies while providing quality services which are in the best interest of the City; recruit and retain a trained, qualified, and diverse workforce that exceeds community expectations; provide a safe and healthy work environment; identify and minimize risks of loss associated with the provision of City services. Human Resources Vision Our vision is to be responsive, courteous and supportive and to continuously develop and seek to improve our quality of customer service through constant self-evaluation and professional growth. Why St. Cloud? Join the City of St. Cloud, where our core values of accountability, empowerment, innovation, and ownership shape everything we do. Here's what we offer: Meaningful Work: Be part of projects that truly impact our community, knowing your contributions make a difference. Work-Life Balance: We prioritize a healthy balance between your career and personal life, empowering you to thrive in both. Generous Benefits: Enjoy a comprehensive benefits package that supports your well-being and offers peace of mind for you and your family. Job security: Build a stable and rewarding career with a city that values accountability and dedication. Technical Skill Development: Gain hands-on experience and develop expertise while exploring innovative approaches to your work. Countless Opportunities: Discover diverse career paths and grow with us as you take ownership of your professional journey. Community Investment: Play an active role in enhancing and strengthening our community and take pride in seeing the tangible results of your efforts. Make your career matter. Join our team and contribute to a city that is as committed to growth and excellence as you are! To Apply: https://www.governmentjobs.com/careers/stcloud For more information, reach out to us at human.resources@stcloudfl.gov Contact Us Justin Kluesner Senior Director, Human Resources & Administrative Services Email Justin Kluesner Phone: 407-957-7359 Equal Employment Officer Justin Kluesner St Cloud, FL 34769 Human Resources Director 407-957-7359 Report a Concern Justin Kluesner Human Resources Director 407-957-7359 Contact Us Human Resources Department Email Human Resources Physical Address 1300 9th Street Building A - 2nd Floor St. Cloud , FL 34769 Phone: 407-957-8420 Fax: 407-957-7273 ADA Committee Information Benefits Employee Health Clinic City of St. Cloud Retirement System Division of Retirement's Actuarial Summary Resources for the City of St. Cloud Retirees Come Grow With St. Cloud Employee Assistance Program Employee Self Service - ESS Employment Opportunities Frequently Asked Questions Internship/Volunteer Programs Notify Me Risk Management Residents Visitors Businesses Residents Burn Permit City Council City Manager Public Safety Solid Waste Services Recycling Information Public Records Request /QuickLinks.aspx Visitors Burn Permit City Council City Manager Public Safety Solid Waste Services Recycling Information /QuickLinks.aspx Businesses Burn Permit City Council City Manager Public Safety Solid Waste Services Recycling Information /QuickLinks.aspx GIS Maps Floodplain Management City Meeting / Event Calendar View community events & meetings Return to City of St. Cloud home page. Contact City Hall 1300 9th Street St. Cloud, FL 34769 Phone: 407-957-7300 Popular Pages Burn Permit City Council City Manager Public Safety Solid Waste Services Recycling Information /QuickLinks.aspx Site Links Home Contact Us Accessibility Site Map Copyright Notices /QuickLinks.aspx Under Florida Law, email addresses are public records If you do not want your email address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. (SB 80 Florida State Law.) Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://stcloudfl.gov/33/Committees-Boards",
      "text": "Committees & Boards  | City of St. Cloud, Florida - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government Services Business Community How Do I... Search Home City Government Committees & Boards Committees & Boards Board Structure Duties Vacancies Board of Appeals Location / Date TBD • 5 members • Experience with building and property maintenance • At-large To hear appeals of decisions made by the Building Official 0 Community Redevelopment Agency Meets every other month; 1st Thursday 3 PM Building Department Conference Room • Five elected City Council members and two appointed volunteer members • …Must reside or be engaged in business within the area of operation of the agency, which shall be coterminous with the area of operation of the county or municipality… • Carry out activities within the CRA area; developing budgets, creating contracts with service providers, implementing elements of the CRA master plan and approving CRA related expenses 0 Economic Development Advisory Committee Meets 3rd Wednesday each month 5 PM Community Development Conference Room • Must be registered voter Osceola County • Must meet one or more of the following: 1) Resident of the City of St. Cloud 2) Own real property within the City of St. Cloud 3) Own and operate a business with a business location within the City of St. Cloud • Provide the City Manager and City Council with business related recommendations on sustaining, generating and developing economic growth within the City of St. Cloud 0 Finance Committee Meets quarterly (January, April, July, and October); 4th Tuesday 6 PM Council Chambers •\tMembers must be city residents •\tFive voting members – coterminous with Council terms •\tMake recommendations to the City Council regarding budgets, debt service, financial policies, and capital expenditures •\tReview the fiscal activities of the City 0 General Employee Pension Board of Trustees Meets quarterly; 2nd Tuesday 1:30 PM City Hall Bldg A -  DRC Conference Room •\tSeven voting members •\tThree members are appointed by City Council;  four members are elected by employees •\tOversee the asset management of the General Employee Pension Funds 0 Historic Preservation Board Meets 1st Tuesday of every other month 6 PM Council Chambers • Seven voting members and two alternates appointed by Council • Preference to individuals who reside or have principal place of business in City of St. Cloud • Members chosen from among disciplines of architecture, archaeology history, architectural history, landscape architecture, construction, construction management, engineering, planning, general contractor, commercial development, real estate, banking or law • Reviews all changes to historically significant structures within the historic district. Holds public hearings and issues Certificates of Appropriateness. • Coordinates with the State of Florida’s Division of Historical Resources Certified Local Government program • Collaborates with the St. Cloud Main Street organization and any other organization to inform and educate citizens concerning the historic, cultural, archaeological and architectural heritage of the City 2 Planning Commission Meets 3rd Tuesday each month; 6:00 PM Council Chambers •\tFive voting members and two alternates •\tMembers cannot serve on the Zoning Board of Adjustment simultaneously •\tMembers must be city residents and registered voters – Non coterminous with Council terms •\tAct in an advisory capacity to the City Council relating to zoning, land use, and the Comprehensive Plan 0 Police and Firefighters Pension Board of Trustees Meets quarterly; 3rd Tuesday 4:00 PM City Hall Bldg A -  DRC Conference Room •\tFive voting members •\tTwo members are appointed by Council; one by the Fire Department,  one by the Police Department and one is Board appointed •\tOversee the asset management of the Police Department and Fire Department pension funds 0 Recreation Advisory Committee Meets 3rd Wednesday each month; 5:30 PM Civic Center •\tFive voting members, coterminous with Council terms. •\tTwo alternate members with 1 year calendar terms •\tNo more than 2 voting members can be County residents. •\tAlternates move into vacancies of regular seats except at expiration of terms. •\tWork in cooperation with the Parks and Recreation Department to plan and implement programs and facilities for all residents 1 Veterans Council NOTE: Applications to this board are accepted only if appointed by City Council 0 Zoning Board of Adjustment Meets 2nd Wed. each month 6:30 PM Council Chambers • Members cannot serve on the Planning Commission simultaneously • Members must be city residents and registered voters • Five voting members and two alternates – Non coterminous with Council terms • Grant variances • Perform the administrative review • Reverse the decisions of the Building Official as it relates to zoning codes 0 To apply, click the name of the board / committee to complete the online application.  Interested in applying? If you have questions, please contact Stacey Wilde, City Clerk's Office, 407-957-7388 or by email at stacey.wilde@stcloudfl.gov Residents Visitors Businesses Residents Burn Permit City Council City Manager Public Safety Solid Waste Services Recycling Information Public Records Request /QuickLinks.aspx Visitors Burn Permit City Council City Manager Public Safety Solid Waste Services Recycling Information /QuickLinks.aspx Businesses Burn Permit City Council City Manager Public Safety Solid Waste Services Recycling Information /QuickLinks.aspx GIS Maps Floodplain Management City Meeting / Event Calendar View community events & meetings Return to City of St. Cloud home page. Contact City Hall 1300 9th Street St. Cloud, FL 34769 Phone: 407-957-7300 Popular Pages Burn Permit City Council City Manager Public Safety Solid Waste Services Recycling Information /QuickLinks.aspx Site Links Home Contact Us Accessibility Site Map Copyright Notices /QuickLinks.aspx Under Florida Law, email addresses are public records If you do not want your email address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. (SB 80 Florida State Law.) Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}