{
  "fuentes": [
    {
      "url": "https://www.stjamesbayrestaurant.com/contact-us",
      "email": "info@stjamesbayrestaurant.com"
    },
    {
      "url": "https://www.beaconjournal.com/story/news/local/stow-sentry/2011/11/20/another-longtime-restaurant-closes-its/19722756007/",
      "email": "msilva@recordpub.com"
    },
    {
      "url": "https://www.stjamesbayrestaurant.com/",
      "email": "info@stjamesbayrestaurant.com"
    },
    {
      "url": "https://recoverphysicaltherapy.com/contact-us/",
      "email": "contact@recoverphysicaltherapy.com"
    },
    {
      "url": "https://recoverphysicaltherapy.com/contact-us/",
      "email": "slidell@recoverphysicaltherapy.com"
    },
    {
      "url": "https://www.stjamesbayrestaurant.com/carrabelle-events",
      "email": "info@stjamesbayrestaurant.com"
    },
    {
      "url": "https://www.crookedcreekrestaurant.com/contact",
      "email": "craig@marketsmart365.com"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://www.stjamesbayrestaurant.com/places-to-eat-in-carrabelle-fl",
      "email": "info@stjamesbayrestaurant.com"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "email": "info@secureitsecurities.com"
    },
    {
      "url": "https://www.frenchriveratvtours.com/contactus.html",
      "email": "info@frenchriveratvtours.com"
    },
    {
      "url": "https://www.floridasforgottencoast.com/business/crooked-river-grill/",
      "email": "franklin-county-florida@2x.png"
    },
    {
      "url": "https://www.floridasforgottencoast.com/business/crooked-river-grill/",
      "email": "info@stjamesbayresort.com"
    },
    {
      "url": "https://www.floridasforgottencoast.com/business/crooked-river-grill/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://www.floridasforgottencoast.com/business/crooked-river-grill/",
      "email": "mobileapp@2x-257x90.jpg"
    },
    {
      "url": "https://www.floridasforgottencoast.com/business/crooked-river-grill/",
      "email": "mobileapp@2x-300x105.jpg"
    },
    {
      "url": "https://www.floridasforgottencoast.com/business/crooked-river-grill/",
      "email": "mobileapp@2x.jpg"
    },
    {
      "url": "https://www.jamesbayinn.com/",
      "email": "frontdesk@jamesbayinn.com"
    }
  ],
  "mails": [
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "contact@recoverphysicaltherapy.com",
    "craig@marketsmart365.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "franklin-county-florida@2x.png",
    "frontdesk@jamesbayinn.com",
    "info@frenchriveratvtours.com",
    "info@rivervillegrill.com",
    "info@secureitsecurities.com",
    "info@stjamesbayresort.com",
    "info@stjamesbayrestaurant.com",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "logo@2x.png",
    "mobileapp@2x-257x90.jpg",
    "mobileapp@2x-300x105.jpg",
    "mobileapp@2x.jpg",
    "msilva@recordpub.com",
    "productions@diamondheadtheatre.com",
    "rtandal@diamondheadtheatre.com",
    "slidell@recoverphysicaltherapy.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "stjamesbayrestaurant.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.stjamesbayrestaurant.com/contact-us",
      "text": "Contact Crooked River Grill | Carrabelle, Florida Restaurant Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE <-  TAKE ME BACK TO THE HOTEL SITE Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE Contact Us FEEL FREE TO REACH OUT Crooked River Grill 151 Laughing Gull Lane Carrabelle, FL 32322 (850) 697-5050 Drop A Line Please complete all required fields! Name * Invalid Input Phone * Invalid Input Email * Invalid Input Subject * Invalid Input Message * Invalid Input Submit (850) 697-5050 St James Bay Golf & Pickleball Resort 151 Laughing Gull Ln Carrabelle, Florida 32322 [email protected] Accessibility Privacy Policy Sitemap Consent Preferences 850-697-9606 Dashboard Website designed & hosted by CourseLogix"
    },
    {
      "url": "https://www.beaconjournal.com/story/news/local/stow-sentry/2011/11/20/another-longtime-restaurant-closes-its/19722756007/",
      "text": "Another longtime restaurant closes its doors in Munroe Falls News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals STOW SENTRY Another longtime restaurant closes its doors in Munroe Falls Staff Writer Kent Weeklies by Mariana Silva | Reporter Munroe Falls -- A sign directing customers to the Crooked River Grill is gone and a lease sign is up on the lawn at 403 N. Main St. in Munroe Falls. The restaurant, which recently served as a location for the Board of Education community engagement meetings, is now closed, said Dave Waskowski, husband of the owner, Susanne Waskowski. She was out of town and not available to comment. \"We decided it was time to close and that's it,\" Waskowski said. Waskowski said the restaurant has been officially closed for about three weeks. He said he would not comment whether the Crooked River Grill would open at another location. The building's owner, Frank Mastroine of Munroe Falls, said the restaurant's keys were turned in on Nov. 15 and that five people have inquired about leasing the location. Mastroine said Susanne Waskowski had been leasing the location for Crooked River Grill for 11 years. \"It is a shame [that the restaurant] closed,\" said Mike Barnes of Munroe Falls, owner of Professional Technical Sales Associate Inc. and co-chair for the 2011 levy committee for Stow-Munroe Falls City Schools District. \"They were always a big help for local activities and a good place for good food. \"[They] were very supportive of the school-related events and clubs. They were a big contributor not only with time but with resources, too,\" Barnes said. \"Obviously we are disappointed to see [Crooked River Grill] close but business is tough nowadays,\" Mayor Frank Larson said. \"I was surprised because you go by [the restaurant] and it seemed like it was crowded every night. They served the best ribs I've ever had,\" Larson said. \"And I'm sorry to see it go.\" Email: msilva@recordpub.com Phone: 330-686-3916 Careers Staff Directory Accessibility Sitemap Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper NIE Archives Akron Classifieds Kent Classifieds Jobs Real Estate Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.beaconjournal.com. All rights reserved."
    },
    {
      "url": "https://www.stjamesbayrestaurant.com/",
      "text": "Crooked River Grill | Carrabelle, Florida Dining Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE <-  TAKE ME BACK TO THE HOTEL SITE Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE Unexpected Flavors Unexpected Flavors Unexpected Flavors Crooked River Grill Carrabelle, FL Forgotten Coast Delights Take winding roads past lush maritime forests and scenic marshes to the Crooked River Grill. The menu here is marked by sophisticated takes on everything from locally caught shrimp and succulent steaks to bold cocktails made with the most generous pour on the Forgotten Coast — two ounces of premier liquor. With its direct views of our Audubon Signature golf course, this is the kind of dining experience best enjoyed with good friends. VIEW MENUS Hours of Operation Monday: 8:00 AM – 6:00 PM Tuesday: 8:00 AM – 8:00 PM Wednesday: 8:00 AM – 8:00 PM Thursday: 8:00 AM – 8:00 PM Friday: 8:00 AM – 9:00 PM Saturday: 8:00 AM – 9:00 PM Sunday: 8:00 AM – 5:00 PM CROOKED RIVER HIGHLIGHTS Spirited Selections From the impressive display wall of top-shelf spirits to our extensive bourbon collection, our bar serves up an experience worth savoring. Come try the Cocktail of the Month and enjoy a wide selection of wines, beers, and mixed drinks — all made with two ounces of liquor. LEARN MORE PRIVATE EVENTS Gather With Intention Whether you’re hosting your son’s wedding, celebrating your daughter’s graduation party, or closing out a pickleball tournament with a grand dinner, Crooked River Grill has flexible indoor and scenic outdoor spaces ideally suited for any kind of gathering. Pair that with a flavorful catering menu and an extensive wine list for an event that will linger in your guests’ memories. START PLANNING Tasty Tidbits Love this place and their staff I’m usually in town every other weekend with family and friends and this place is my favorite place to dine. The staff is always on point and friendly and the food never disappoints….. Their bar also serves up the best margaritas I have ever had! tamie788 | TripAdvisor Great brunch! Very relaxed atmosphere! Great service and a good selection for brunch food. We ate here several times and fully intend to be back. retiredexteacher | TripAdvisor Pleasant and yummy! On the St. James Country Club property. Very reasonable lunches and a great Chef. Salads, sandwiches, specials. Always fresh and delicious. PatriciaAnnBl | TripAdvisor (850) 697-5050 St James Bay Golf & Pickleball Resort 151 Laughing Gull Ln Carrabelle, Florida 32322 [email protected] Accessibility Privacy Policy Sitemap Consent Preferences 850-697-9606 Dashboard Website designed & hosted by CourseLogix"
    },
    {
      "url": "https://recoverphysicaltherapy.com/contact-us/",
      "text": "Contact Us - Recover Physical Therapy PROVIDING ONE-ON-ONE HANDS-ON CARE Accepted Insurances Bill Pay Home Conditions Sports Injuries Joint Replacements Spinal Fusions Rotator Cuff tears Arthroscopic Surgeries Low Back Pain Neck Pain Shoulder Pain Rotator Cuff injuries Wrist and Hand Pain Elbow Pain Knee Pain Foot and Ankle Pain TMJ Dysfunction Migraines Tension Headaches Whiplash Motor Vehicle Collisions Work Related Injuries Balance training Treatments Joint Replacement Rehab Low Back School Cupping Blood Flow Restriction Training Rotator Cuff Conditions Workman’s Compensation Cases Dry Needling Balance Training Instrument Assisted Soft Tissue Mobilization Spinal Manipulation Work Screenings Mckenzie Method Manual Therapy Patient Info My First Visit FAQ Page Accepted Insurances Online Payment Book Appointment Patient Portal About Pearl River, LA Location Slidell, LA Location Staff Dr. Brandon Callais Dr. Chaise Bennett Devin Parker Jessica Rigaud Leigha Suarez Marci Forster Blog Contact Bill Pay Pearl River Location 64167 LA 41, STE A Pearl River, LA 70452 (985) 250-9727 contact@recoverphysicaltherapy.com Slidell Location 2040 Gause E., Ste. 6 Slidell, LA 70461 (985) 201-8075 slidell@recoverphysicaltherapy.com Opening Hours Mon, Tues & Thurs 7-5 Wed & Fri 7-12 Sat. & Sun. Closed Contact Us Slidell Location 2040 Gause E. Ste. 6 Slidell, LA 70461 Phone Number 985-201-8075 Fax Number 985-201-8041 Email Address slidell@recoverphysicaltherapy.com Social Media Opening Hours Monday 7:00 AM-5:00 PM Tuesday 7:00 AM-5:00 PM Wednesday 7:00 AM-12:00 PM Thursday 7:00 AM-5:00 PM Friday 7:00 AM-12:00 PM Saturday CLOSED Sunday CLOSED Send us a Message Feel free to ask any questions over the phone, or get in touch via our contact form below. Your message will be dispatched directly to our staff who will answer as soon as they can. Name * Email * Phone Number * The Subject Your Message * Recover Physical Therapy Pearl River Location 64167 LA 41, STE A Pearl River, LA 70452 Phone Number 985-250-9727 Fax Number 985-250-9728 Email Address contact@ recoverphysicaltherapy.com Pearl River Location 64167 LA 41, STE A Pearl River, LA 70452 Phone: 985-250-9727 Fax: 985-250-9728 Email: contact@recoverphysicaltherapy.com Slidell Location 2040 Gause E. Ste. 6 Slidell, LA 70461 Phone: 985-201-8075 Fax: 985-201-8041 Email: slidell@recoverphysicaltherapy.com Pearl River Location 64167 LA 41, STE A Pearl River, LA 70452 (985) 250-9727 contact@recoverphysicaltherapy.com Slidell Location 2040 Gause E., Ste. 6 Slidell, LA 70461 (985) 201-8075 slidell@recoverphysicaltherapy.com About Us We strive to provide an experience unlike any other. We are attention to detail oriented and will put YOU, the patient first in our treatment plan. Contact Us Extra Navigation About Us FAQ Page Accepted Insurances Dr. Chaise Bennett Opening Hours Monday 7:00 AM-5:00 PM Tuesday 7:00 AM-5:00 PM Wednesday 7:00 AM-12:00 PM Thursday 7:00 AM-5:00 PM Friday 7:00 AM-12:00 PM Saturday CLOSED Sunday CLOSED © Copyright - 2024   |   Web Design by Bayou Web Design + © Copyright - 2024   |   Web Site Hosting & Maintenance by Rhino Web Studios"
    },
    {
      "url": "https://www.stjamesbayrestaurant.com/carrabelle-events",
      "text": "Host Private Events at Crooked River Grill | near Tallahassee, FL Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE <-  TAKE ME BACK TO THE HOTEL SITE Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE Private Events Carrabelle Events Lavish Southern Celebrations Whether you're planning an intimate gathering, a family celebration, or a corporate event, Crooked River Grill will elevate your Carrabelle event with a warm, inviting atmosphere and exquisite cuisine. Impress your guests at a restaurant that offers a unique and memorable venue for any special occasion. Weddings Add a touch of sweetness to your wedding day by having your ceremony under the shade of a mature oak and then spice things up with a reception at our beer garden. Meetings From finding the ideal venue and ordering just the right dishes to organizing fun activities for your group, a well-planned meeting commands attention and leaves a lasting impression. a few people drinking wine Special Occasions Come together to celebrate your most important moments at a place designed for good times. Enjoy your gathering in a vibrant setting, where the delicious catering options steal the show. a knife and a fork on a table Catering To Your Liking Our culinary team is dedicated to creating a bespoke dining experience tailored to your preferences. Let us help you make your event truly unforgettable with charm, elegance, and flavor. Plan Your Event Let's Start Planning St James Bay Golf & Pickleball Resort 151 Laughing Gull Ln . Carrabelle, Florida 32322 850-697-9606 Share A Few Details First Name (*) Invalid Input Email Address (*) Invalid Input Date of Event (*) ... Invalid Input Type of Event Wedding Meeting Special Occasion Invalid Input Room Block Yes No Invalid Input Last Name (*) Invalid Input Phone Number (*) Invalid Input Number of Guests (*) Invalid Input Comments Invalid Input I have read and agree to the Privacy Policy. Invalid Input Yes, I would like to receive emails with exclusive specials and offers. Invalid Input Submit (850) 697-5050 St James Bay Golf & Pickleball Resort 151 Laughing Gull Ln Carrabelle, Florida 32322 [email protected] Accessibility Privacy Policy Sitemap Consent Preferences 850-697-9606 Dashboard Website designed & hosted by CourseLogix"
    },
    {
      "url": "https://www.crookedcreekrestaurant.com/contact",
      "text": "Contact The Crooked Creek Your choices regarding cookies on this site Oracle and our third party partners may use cookies for the following purposes: required cookies are necessary for the site to function functional cookies help us to prefill your details on your next order and to optimize the site for easy reordering advertising cookies allow for interest-based advertising and tailored content across your browsers and devices Please visit our Cookie policy for more information. Accept all Reject all Change preferences Cookie Preferences Required These cookies are essential in order to enable you to move around Controller's web application and use its features, such as accessing secure areas. Without these cookies services like shopping baskets or e-billing cannot be provided. View cookies. Company Domain Akamai *.akamaihd.net, *.akstat.io, s.go-mpulse.net Oracle *.globalfoodsoft.com, *.restaurantlogin.com Stripe *.stripe.com Paypal *.paypal.com Functional These cookies allow the Controller’s web application to remember choices you make while browsing and/or using the application (such as your user name, language or the region you are in) and provide enhanced, more personal features. These cookies can also be used to remember changes you have made to text size, language and other parts of web pages that you can customize. The information these cookies collect will not personally identify you, and they cannot track your browsing activity on non Controller’s websites. For reliable review of your order status, on-screen on the application, in real-time, and also for easy reordering, your data may be saved on your device, serving a cookie locally. View cookies. Company Domain Oracle *.globalfoodsoft.com, *.restaurantlogin.com Accept all Reject all Confirm selection The Crooked Creek Open navigation Close navigation Menu Contact us Table Reservation See MENU & Order Contact The Crooked Creek We offer Takeout Table Reservation See MENU & Order Contact us 756 State Route 118, Sweet Valley, PA 18656, United States +1 570-477-3224 Name Name is required. Email Email is not valid. Email is required. Your message Message is required. Captcha is required. Submit Opening hours Monday, Wednesday - Thursday 04:00 PM - 12:00 AM Friday - Sunday 12:00 PM - 02:00 AM Pickup service Monday, Wednesday - Thursday 04:30 PM - 10:45 PM Friday - Sunday 12:45 PM - 10:45 PM Social media Facebook link for The Crooked Creek Instagram link for The Crooked Creek Select language English Privacy policy . Terms of service . Cookie Policy Changes Contact us Address 756 State Route 118, Sweet Valley, PA 18656, United States Phone +1 570-477-3224 Links Menu Table reservation Order ahead Contact us Table Reservation See MENU & Order Accepted Payment Methods . American Food Takeout Sweet Valley Supported by: MarketSmart365.com | craig@marketsmart365.com | +1 570-650-5021 Table Reservation See MENU & Order"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://www.stjamesbayrestaurant.com/places-to-eat-in-carrabelle-fl",
      "text": "Crooked River Grill Menu | Seafood, Steaks & Cocktails in North Florida Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE <-  TAKE ME BACK TO THE HOTEL SITE Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE Mobile Menu Toggle Home Menus Private Events Gallery Contact Us RESERVE Menus CARRABELLE, FL Bring The World To Your Table Delight in a sophisticated approach to casual dining that celebrates internationally beloved recipes made with fresh local ingredients. From classically crafted dishes and sushi rolls to Asian and Indian favorites, our eclectic menus make Crooked River Grill one of the best places to eat in Carrabelle, FL. CRG COCKTAILS CRG LIQUOR CRG WINE & BEER MONDAY & POOL MENU CRG LUNCH CRG DINNER CRG DESSERTS CRG GRAB & GO CRG BREAKFAST (850) 697-5050 St James Bay Golf & Pickleball Resort 151 Laughing Gull Ln Carrabelle, Florida 32322 [email protected] Accessibility Privacy Policy Sitemap Consent Preferences 850-697-9606 Dashboard Website designed & hosted by CourseLogix"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "text": "Contact Us - Get In Touch With Our Security Systems Company 24/7 845-445-6446 info@secureitsecurities.com 24 Hour Emergency Service About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Buy Now About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Login Register | Login | My Cart 0 24 Hour Emergency Service Contact Us for Security Services in Rockland County, NY Home › Contact Us for Security Services in Rockland County, NY Contact Us for Security Services in Rockland County, NY Contact Secure IT Securities for Security Solutions in Rockland County Whether you're a homeowner in Pearl River or a business owner in Rockland County, Secure IT Securities\nCorp. offers security solutions to meet your specific needs. Reach out to us for a security consultation or to request a security quote . Our staff will work closely with\nyou to understand your needs and provide the best possible security solution. You can also schedule a\nsecurity assessment, to have our experts evaluate your property and recommend the most suitable\nsecurity measures. To get started, give us a call at (845) 445-6446 or fill out form below, and we'll be in touch with you. 24 Hour Emergency Service 1 Blue Hill Plaza, Suite 1509 Pearl River, NY 10965 845-445-6446 info@secureitsecurities.com Hours Monday - Friday: 8:00 AM - 5:00 PM Saturday : 9:00 AM - 3:00 PM Sunday : CLOSED Leave A Message Contact First Name: * Last Name: * City: * Phone Number : * Email: * Message: Contact Us Secure IT Securities Corp. 1 Blue Hill Plaza #1509 Pearl River, NY 10965 info@secureitsecurities.com 845-445-6446 About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Return Policy Standard Service Agreement Accessibility Statement Privacy Policy Our Partners Terms Of Services Smart Home Store Contact Us Blog About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Blog Our Partners Return Policy Cookie Policy Contact Us New York State Fire & Security License #12000295002 | Smart Home Security Solutions in Pearl River, NY My Cart 0 By using our website, you agree to the use of cookies as described in our Cookie Policy Accept × Shopping Cart × Your cart is empty. Continue Shopping"
    },
    {
      "url": "https://www.frenchriveratvtours.com/contactus.html",
      "text": "ï»¿ Contact French River ATV Tours | Alban, Ontario f RENCH RIVER ATV Tours Home About Rates & Tours Gallery FAQs Contacts Primary Contacts Contact us today to get your adventure started! Bookings are essential, especially in peak holiday periods. All questions are welcome â just call or email us. ATV season runs from May 1 to November 15. 1203 Highway 64, RR #1, Alban, ON P0M 1A0 705.677.7612 1203 Highway 64, RR #1, Alban, ON P0M 1A0 Coordinates: 46°06'02.6\"N    80°35'15.6\" W Telephone: +1 705 677 7612 E-mail: info@frenchriveratvtours.com feedback Submit Reset French River ATV Tours Â© . Privacy Policy"
    },
    {
      "url": "https://www.floridasforgottencoast.com/business/crooked-river-grill/",
      "text": "Crooked River Grill Carrabelle Florida (Restaurants) Skip to content FREE VISITOR'S GUIDE | WIN A GETAWAY | WEBCAMS | MOBILE APP Tag Us! #FORGOTTENCOAST Facebook Instagram YouTube Discover the Forgotten Coast Alligator Point Apalachicola Carrabelle Eastpoint St. George Island Places to Stay Vacation Rentals Hotels & Inns Bed & Breakfasts Campgrounds Special Offers & Packages Things to See & Do Interactive Map Beaches Fishing Boating Paddling Shopping Lighthouses Museums Art & Theatre Maritime Heritage Museum Food & Drink Breweries & Nightlife Golfing Birding Hiking Parks & Sites Self-Guided Tours Scenic Tours Bicycle & Golf Cart Rentals Fitness & Wellness Geocaching Pet Friendly Activities Weddings Calendar of Events Resources Interactive Map Plan Your Trip Webcams Press & Media FREE Mobile App Visitor Centers Videos Administration Type of Lodging All Lodging Bed & Breakfasts Campgrounds Hotels & Inns Vacation Rentals Area of Interest Any Area Alligator Point Apalachicola Carrabelle Eastpoint St. George Island You are here: Home > Things to See & Do > Restaurants > Crooked River Grill Crooked River Grill Enjoy Coastal Comfort Food at Crooked River Grill. Take winding roads past lush maritime forests and scenic marshes to the Crooked River Grill. The menu here is marked by sophisticated takes on everything from locally caught shrimp and succulent steaks to bold cocktails made with the most generous pour on the Forgotten Coast — two ounces of premier liquor. With its direct views of our Audubon Signature golf course, this is the kind of dining experience best enjoyed with good friends. Crooked River Highlights Spirited Selections: From the impressive display wall of top-shelf spirits to our extensive bourbon collection, our bar serves up an experience worth savoring. Come try the Cocktail of the Month and enjoy a wide selection of wines, beers, and mixed drinks – all made with two ounces of liquor. 151 Laughing Gull Lane Carrabelle, Florida 32322 Website: Visit Website Phone: 850-697-5050 Email: info@stjamesbayresort.com Facebook Lodging Info Request Receive special offers from lodging providers for your trip to Florida's Forgotten Coast. Notice: JavaScript is required for this content. Get the Newsletter Want to learn more about Florida's Forgotten Coast? Get our monthly newsletter packed full of upcoming events, special offers and more. Notice: JavaScript is required for this content. Newsletter Sign Up E-Newsletter Sign Up Visitor's Guide Get a FREE Visitor's Guide Special Offers Special Offers & Packages Mobile App Get our FREE Mobile App Tag Us! #FORGOTTENCOAST Facebook Instagram YouTube Contact | Press & Media | Administration | Grants | List Your Business Franklin County Tourist Development Council 731 Highway 98, Eastpoint, Florida 32328 | (850) 670-3474 | Email Us © 2025 Florida's Forgotten Coast - Franklin County Tourist Development Council | All Rights Reserved | Privacy Website by 2K Web Group Request a FREE Visitor's Guide Download or request guides and maps Visiting Soon? Special Offers View special offers & packages on lodging Subscribe to our Email Newsletter Get the latest news, events, and travel deals We're Social! #ForgottenCoast Follow us for giveaways and more Scroll To Top"
    },
    {
      "url": "https://www.jamesbayinn.com/",
      "text": "Welcome to James Bay Inn | Historic Hotel in Victoria, BC Home Rooms Our History Dine Blog Contact Book Now 800-836-2649 BOOK NOW Welcome to the Historical James Bay Inn Hotel, Suites & Cottage A landmark of Edwardian Architecture Helping you relax since 1911 Slide title Quaint & Cozy with Lush Grounds Button A Landmark of Edwardian Architecture Your Home Away from Home Book Now Located in the flower capital of Vancouver Island, Victoria, B.C and nestled in the heart of the exquisite district of James Bay. Quaint, Quiet, Cozy and Affordable. Lush, Environmentally friendly with a Green Key Global Eco rating of 3. Fresh air flowing  from the north via the Inner Harbour and from the south via the southern coast. Bicycle friendly with video monitored street bike lockup for residents/guests and secure indoor bike storage for guests. No air conditioning & no elevators. Access to a sunny verandah on floor 2 & 3.. Art Deco Cafe & Restaurant and a friendly pub on site. All guests are required to have a credit card upon arrival for incidentals. Cancellations less than 48 hours in advance will be charged no less than one night's stay. Please Note: No smoking and no pets are permitted. Hairdryers, iron & board and other conveniences are available at our friendly front desk. Need something? Please ask! You are at home with the James Bay Inn Hotel. Warning : Frequent tweeting from birds & hypnotic sounds of horse drawn carriages trotting by. We are a short pleasant leisurely walk to the Ocean, Beacon Hill Park, The Inner Harbour, Fisherman's Wharf & Downtown Victoria B.C. HOTEL ROOMS Hotel Rooms STUDIO & SUITES Button PRIVATE COTTAGE Button Book Direct: Special ABOUT US DINE Button CONTACT Button Guest Reviews Perfect location and very clean! The front desk staff are super helpful and friendly. Parking is included. Breakfast diner downstairs was amazing. Would definitely stay here again! There is no elevator though, so make sure you can handle your luggage up the stairs. We were prepared for this :) Morgan - Tripadvisor Made wedding family accommodation a great success ...!!! family group of 4 couples last week for my daughters wedding , great little rooms , enjoyable pub , wonderful cafe , will stay again .....easy walk to sight see , and the Empress for the ceremony ,...thank -you all...!! Rick Stone Richard S Outstanding staff, great location. I loved staying at this hotel. It is conveniently located to walk to the parliament buildings, Beacon Hill Park and downtown area restaurants, stores and waterfront. My room was spacious with two comfortable queen beds. Barb N I would not stay anywhere else. This 100+ year old hotel has charm and character with antiques throughout the building. Great location too. The pub and cafe in the basement are a locals hangout, so what does that tell you? The food and service was the best! Thanks Rick, Roy and the Front desk manager (never got your name...) for your service. Bar Manager was great to talk to. I'll be back!! Alberta Traveller We decided on the JBI late morning wondering if Breakfast was still on. It was. Excellent choice and we enjoyed. Very good meals with excellent service. We like this place. Plenty of parking on site. The staff seem to enjoy one another and the local clientele is obvious. When an establishment has locals mix with tourists they have a winner. These folks have it nailed. Harold W JAMESBAYINN Button Button Button Button Button Button Button Button Button Button View more BOOK NOW CALL US FOLLOW BLOG Home Rooms Our History Dine Contact © 2025 James Bay Inn | All Rights Reserved BOOK A ROOM Privacy & Cookies Share by:"
    }
  ]
}