{
  "fuentes": [
    {
      "url": "http://www.stjosephbaypreserve.org/category/activities/",
      "email": "sandra.chafin@dep.state.fl.us"
    },
    {
      "url": "https://floridadep.gov/RCP/State-Buffer-Preserve/content/28350-first-day-hike-st-joseph-bay-state-buffer-preserve",
      "email": "public.services@floridadep.gov"
    },
    {
      "url": "https://floridadep.gov/RCP/State-Buffer-Preserve/content/28350-first-day-hike-st-joseph-bay-state-buffer-preserve",
      "email": "sophia.fonseca@floridadep.gov"
    },
    {
      "url": "https://tallahasseearts.org/venue/st-joseph-bay-buffer-preserve-center/",
      "email": "dylan.shoemaker@floridadep.gov"
    },
    {
      "url": "https://tallahasseearts.org/venue/st-joseph-bay-buffer-preserve-center/",
      "email": "info@tallahasseearts.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "frraj@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "frsimon@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "bbeauvais@gosaintjoseph.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "cbauer@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "dsullivan@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "edvorak@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "frsimon@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "gcreynolds@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "jbertles@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "jcoleman@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "jhanson@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "jkraft@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "kcallahan@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "ktallman@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "lcarroll@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "ldaniel@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "mcastaneda@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "mfailing@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "oknudson@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "parishcenter@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "phall@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "sshortridge@stjosephfc.org"
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "email": "trosales@stjosephfc.org"
    },
    {
      "url": "http://www.stjosephbaypreserve.org/2020/10/",
      "email": "sophia.fonseca@floridadep.gov"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "http://www.stjosephbaypreserve.org/tag/seagrass/",
      "email": "jonathan.brucker@dep.state.fl.us"
    },
    {
      "url": "http://www.stjosephbaypreserve.org/preserve-accommodations/",
      "email": "sandra.chafin@dep.state.fl.us"
    },
    {
      "url": "http://www.stjosephbaypreserve.org/tag/bay-day/",
      "email": "rtrahan@comcast.net"
    }
  ],
  "mails": [
    "bbeauvais@gosaintjoseph.org",
    "cbauer@stjosephfc.org",
    "dsullivan@stjosephfc.org",
    "dylan.shoemaker@floridadep.gov",
    "edvorak@stjosephfc.org",
    "frraj@stjosephfc.org",
    "frsimon@stjosephfc.org",
    "gcreynolds@stjosephfc.org",
    "info@tallahasseearts.org",
    "info@theatrenantucket.org",
    "jbertles@stjosephfc.org",
    "jcoleman@stjosephfc.org",
    "jhanson@stjosephfc.org",
    "jkraft@stjosephfc.org",
    "jonathan.brucker@dep.state.fl.us",
    "kcallahan@stjosephfc.org",
    "ktallman@stjosephfc.org",
    "lcarroll@stjosephfc.org",
    "ldaniel@stjosephfc.org",
    "mcastaneda@stjosephfc.org",
    "mfailing@stjosephfc.org",
    "oknudson@stjosephfc.org",
    "parishcenter@stjosephfc.org",
    "phall@stjosephfc.org",
    "public.services@floridadep.gov",
    "rtrahan@comcast.net",
    "sandra.chafin@dep.state.fl.us",
    "sophia.fonseca@floridadep.gov",
    "sshortridge@stjosephfc.org",
    "trosales@stjosephfc.org"
  ],
  "nombre_sitio": "stjosephbaypreserve.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://www.stjosephbaypreserve.org/category/activities/",
      "text": "Activities | Friends of St. Joseph Bay Preserves Skip to content Friends of St. Joseph Bay Preserves Search Primary Menu Welcome Our Mission Our Membership Board of Directors Code of Ethics Volunteering Join Us The Preserves Aquatic Preserve Projects Research Prescribed Fire Visit Visitor Center Guided Tram Tours Explore the Preserves Birding Around the Bay Preserve Center Accommodations Maps Links News & Events News Events Activities Educational Activities Bay Day Join Us Contact Us Search for: Category Archives: Activities Activities , Events Summer Art Camp Visit, Wednesday, June 24th, 2025 June 24, 2025 Tim Nelson We here at the St. Joseph Bay State Buffer Preserve had the opportunity to host a summer camp this past Wednesday! This art camp for students in elementary school visited the Buffer to work on creating masterpieces that combined nature with printmaking and sketching.  Students first arrived early in the morning and began a drawing assignment that was meant to get them thinking about all the things they might see at the Buffer Preserve. Artistic interpretations and expectations ranged from trees to bears to buried treasure! We then went on a tram tour just for this group of students and decided that we would put our theories to the test and see what we could find. We started out on Treasure Road but unfortunately didn’t find any gold coins, but we did see a variety of birds and a 170-year-old longleaf pine! We continued on our journey and saw an eagle nest, a recently burned area, and even our resident alligator, Surly! We then got out of the heat for a little bit and took a break for lunch. After a nice meal and a little time to cool off, we set back out on a nature hike to see what else we could find. We collected all sorts of specimens to practice sketching and making prints. We then went back to the visitor center and the students set out on making their beautiful artist creations. Unfortunately, all good things must come to an end and our students left for the day, bringing with them all of their newfound knowledge and appreciation of our preserve’s natural resources! buffer preserve St. Joseph Bay Preserves summer art camp Activities , Events Animal Track Hike, Saturday, June 28th, 2025, 9:00 a.m. EDT June 24, 2025 Tim Nelson animal track hike buffer preserve guided tour St. Joseph Bay Preserves Activities , Events Wildflower Walk, Monday, May 5th, 2025, 9:00 a.m. EDT April 9, 2025 Tim Nelson buffer preserve guided tour St. Joseph Bay Preserves wildflower walk Activities , Events Animal Track Hike, Saturday, April 19th, 2025, 10:00 a.m. EDT April 9, 2025 Tim Nelson animal track hike buffer preserve guided tour St. Joseph Bay Preserves Activities , Events Birding at the Buffer, Thursday, April 10, 2025 March 23, 2025 Tim Nelson bird watching birding buffer preserve guided tour st joseph bay Activities , Events Join Us for our Winter Bay Day Celebration – Saturday, February 1st, 2025 January 19, 2025 Tim Nelson Join Us Saturday, February 1st, 2025 for our popular Winter Bay Day!    9am – 3pm EST Friends of St. Joseph Bay Preserves present a day of education, shrimp and music.  Learn about the preserves and life along the bay.  There will be lots to see and lots to do. Best of all, the Low Country Shrimp Boil will be delicious – as always! Meet you on the deck of the Visitor Center ! … no admission fee! 3915 State Road 30A, Port St. Joe, Florida 32456 On the Deck: The Visitor Center Deck will have the low country boil and drinks, picnic tables, a silent auction, live music, and stunning views of St. Joseph Bay. Low Country Shrimp Boil:   11am – 2pm EST $15 Donation Live Music Throughout the Day: Crossroad Bluegrass Band – music for saints and sinners. Guided Tram Tours: The Buffer Preserve staff will have tram rides throughout the day that will showcase the backwoods trails of the Buffer Preserve. Explore the preserves on a guided tram tour through the backwoods trails of the Buffer Preserve and learn about the native animal and plant life. Tours depart from the Visitor Center. Reservations are recommended and will be available on the deck at the Bay Day event. Bay Day tram tour seating will be first come first served. Departure Times: 9:00am, 10:00 am, 11:00am, 12:00pm, & 1:00pm EST. Exhibitors & Demonstrations: Exhibitors at Bay Day will have displays set up to share information about water quality, recreational opportunities, seagrass research and monitoring, urchins, scallops (touch tank), updates to the State Park, turtles, fossils, shorebirds, and so much more of the great environmental work that is done in and around St. Joseph Bay! All the environmental displays will be located down on the grass by the observation tower and along the back of the lodge. Winter Bay Day Exhibitors Include: Central Panhandle Aquatic Preserves, St. Andrews & St. Joseph Bays Estuary Program, St. Joseph Peninsula State Park, Rish State Park, Gulf County UF/IFAS, Audubon Florida, Indian Pass Turtle Patrol, Florida Coastal Conservancy/Forgotten Coast Sea Turtle Center, Friends of Gulf County Library, International Dark Sky/Capture the Dark, FWC/Fish and Wildlife Research Institute – Bay Scallops FWC/Fisheries-Independent Monitoring Program. Silent Auction and Raffle: Our silent auction and fun raffle have lots of donations from our community partners that support our Mission to advocate for the St. Joseph Bay Aquatic Preserve and State Buffer Preserve, and to support the education on those key issues that are important in keeping the bay and preserve one of the most pristine areas in the world. These silent auction items cover a wide range of things such as chef at home experiences, fishing charters, art, dining gift certificates and much more! We have options to bid on the specific item or buy it now pricing.  Either way, you take all items home that day and have a chance to be a raffle winner. Silent Auction and Raffle: Our silent auction and fun raffle have lots of donations from our community partners that support our Mission to advocate for the St. Joseph Bay Aquatic Preserve and State Buffer Preserve, and to support the education on those key issues that are important in keeping the bay and preserve one of the most pristine areas in the world. These silent auction items cover a wide range of things such as chef at home experiences, fishing charters, art, dining gift certificates and much more! We have options to bid on the specific item or buy it now pricing.  Either way, you take all items home that day and have a chance to be a raffle winner. Birding Tour at Salinas Park Bayside: Collette Lauzau , Shorebird Program Manager-Audubon Florida, will be leading the 2 hour bird tour around St. Joseph Bay during Bay Day. Participants meet at Salinas Park Bayside ( 280 Cape San Blas Rd, Port St. Joe, FL 32456 ) at 8:30am EST . “ We will bird that area and potentially drive a short distance to a second location that I will scout before the birding walk just to see if there will be birds foraging the flats. The meeting time will be at 8:30 am and if the second location is active, we will probably end at 10:30 am. Regular walking shoes should be fine.  It would be great for participants to bring binoculars.” The Bay Day events are located at the St. Joseph Bay State Buffer Preserve Visitor Center , 3915 State Road 30-A (C-30), Port St. Joe, Florida 32456 . Bay Day is presented by Friends of St. Joseph Bay Preserves, Inc., Central Panhandle Aquatic Preserves, and the St. Joseph Bay State Buffer Preserve. All proceeds to benefit the Friends of St. Joseph Bay Preserves. For more information: Call 850-229-1787 or Send Us an Email buffer preserve festival st joseph bay St. Joseph Bay Preserves Winter Bay Day Activities , Events Join us for our Fall Fest in the Preserve – Saturday, November 16th, 2024 November 4, 2024 Tim Nelson Fall Fest in the Preserve Join Us Saturday, November 16 th , 2024, for our Fall Festival in the heart of the St. Joseph Bay State Buffer Preserve. 3pm – 6pm EST Friends of St. Joseph Bay Preserves present an afternoon of outdoor fun and activities including hay rides through the preserve, interpretive hiking, scavenger hunt, face painting, hot apple cider,  campfire with marshmallow roast, walking tacos and more … no admission fee! Live Music Throughout the Afternoon: The “mixed acoustic” sounds of Marilyn and Tyler Freeman, …. “a little old country, blue grass, and rock n’ roll”. The Fall Festival events are located within the Buffer Preserve on Treasure Road. Turn in at Treasure Rd off 30A, “across the street” from the Buffer Preserve Visitor Center (3915 State Road 30-A, Port St. Joe, Florida 32456). Follow the signs and volunteer parking guides. The Fall Festival is sponsored by The Friends of the St. Joseph Bay Preserves in Partnership with Buffer and Aquatic Preserves staff. For more information: Call 850-229-1787 or Send Us an Email buffer preserve Fall Fest Hay Rides St. Joseph Bay Preserves Activities , Events Join the Sea Urchin Roundup – Saturday, September 9, 2023 April 28, 2023 Tim Nelson HELP DEP AND FWC REHOME SEA URCHINS – SEPT. 9, 2023 St. Joseph Bay, located in Gulf County in the Panhandle, once contained extensive beds of seagrass and supported an abundant scallop fishery. Residents and visitors enjoyed extensive, pristine seagrass beds and clear bay waters. Summertime recreational scallop harvesting contributed greatly to the local economy. Seagrass beds in the bay are dominated by turtle grass which also provide food for abundant green sea turtles. The scallop fishery has become depleted in recent years, algal blooms are more frequent, and the acreage of seagrass beds has decreased. An overabundance of sea urchins ( Lytechinus spp. ) continues to destroy turtle grass beds through overgrazing. This project will jump start natural recovery of seagrass by installing exclosures over grazed areas to allow seagrasses to grow back without sea urchin grazing pressure. In addition, sea urchin roundups, public outreach events, will involve citizens to remove sea urchins from active grazing fronts. The animals will be released in deeper areas of the bay at a distance from grazed areas. sea urchins seagrass st joseph bay urchin roundup urchins Activities , Events Festival of Trees at The Joe Center for the Arts, through Dec. 12, 2021 December 4, 2021 March Ard See the Friends of St. Joseph Bay Preserves Christmas tree at the Festival of Trees, at The Joe Center for the Arts !  Many organizations and businesses have decorated beautiful and original trees for this display.  Vote for your favorite!  Plus there are special events including a Silent Auction.  For the schedule, see https://thejoecenterforthearts41.wildapricot.org/ 201 Reid Avenue, Port Saint Joe/ Wednesday-Saturday, 11-6, except Thanksgiving weekend (closing at 3 on Weds., reopening on Sat.) Friends of the Preserves 2021 Festival of Trees Activities , Events Guided Tram Tours May 28, 2021 March Ard The third Thursday of every month, the Buffer Preserve offers a tram tour through the preserve. The tour will begin with a separate history talk inside the Visitor Center at 8:00 a.m. EDT. Attendees will then proceed to the Main Gate parking lot (across the street from the visitor center) to board the tram. The tram moves slowly, and our staff will interpret the surroundings while you ride down Treasure Road and Sandridge Road. Remember to bring anything that will make your ride more comfortable: hat, sunscreen, water, insect repellent, raincoat, camera, binoculars, etc. The tram has no roof so be prepared for sun or possibly a light shower. We will not cancel if the rain is light and no lightning is present. To reserve your spot please email Sandra Chafin at Sandra.Chafin@dep.state.fl.us , or phone her at 850-229-1787. Include the names and number of people in your party. Masks are suggested on the tram. Tram Tour Posts navigation 1 2 3 Next → Recent Posts: News & Events Summer Art Camp Visit, Wednesday, June 24th, 2025 Animal Track Hike, Saturday, June 28th, 2025, 9:00 a.m. EDT Wildflower Walk, Monday, May 5th, 2025, 9:00 a.m. EDT Animal Track Hike, Saturday, April 19th, 2025, 10:00 a.m. EDT Birding at the Buffer, Thursday, April 10, 2025 categories: news & events categories: news & events Select Category Activities Announcements Events Lectures Meetings News Archives: News & Events Archives: News & Events Select Month June 2025 April 2025 March 2025 January 2025 December 2024 November 2024 September 2024 July 2024 May 2024 March 2024 November 2023 April 2023 January 2022 December 2021 June 2021 May 2021 March 2021 January 2021 December 2020 October 2020 March 2020 January 2020 November 2019 August 2019 April 2019 September 2018 July 2018 April 2018 March 2018 December 2017 July 2017 April 2017 March 2017 January 2017 November 2016 June 2016 April 2016 March 2016 Friends of the Preserves Facebook Friends of the Preserves Facebook A Citizen Support Organization established to protect and preserve one of the most ecologically significant areas in the Southeastern United States Buffer Preserve News Florida DEP Happenings Visitor Center Explore The Preserves Guided Tram Tours Birding Around the Bay Photo Gallery Bay Dayz Bird Gallery Deal Tract Island Road Trail North Spur Trail Sandridge Trail Treasure Rd to Depot Run Video Gallery Deal Tract Drone Video Maps Contact Us Friends of St. Joseph Bay Preserves 2025 Proudly powered by WordPress"
    },
    {
      "url": "https://floridadep.gov/RCP/State-Buffer-Preserve/content/28350-first-day-hike-st-joseph-bay-state-buffer-preserve",
      "text": "First Day Hike At St. Joseph Bay State Buffer Preserve | Florida Department of Environmental Protection Skip to main navigation Florida Department of Environmental Protection A-Z Index Forms News Events Contact Us MENU About DEP How Do I Toggle submenu Apply for a Permit Apply for a Job with DEP Access the DEP Business Portal Clean Up Sites Contaminated by Petroleum Contact Geographic Information Systems (GIS) Contact the GIO Dispose of Unwanted Medicine Find DEP Standard Operating Procedures Find a Permit Find a Spring Find Hurricane Information Find Parks, Trails & Recreation Areas Find Water Supply Plans Florida Beach Access Get GIS Data Get Information About the Volkswagen Settlement, Florida Mitigation Fund Get Training and Certifications Learn about Florida’s Coral Reefs Learn about Septic Tanks Learn about Sinkholes Learn about Wastewater Management Protect the Environment from Solid and Hazardous Wastes Purchase Property Receive Analytical Lab Services Report Algal Blooms Report Suspected Weather Modification Activities Research Florida Geology Review Agency Rules See Pollution Notices Submit a Nondiscrimination Complaint View DEP's Interactive Maps Divisions Toggle submenu Administrative Services Air Resource Management Cabinet Affairs Communications Ecosystems Restoration Environmental Accountability and Transparency Environmental Assessment and Restoration Florida Geological Survey General Counsel Inspector General Intergovernmental Programs Land and Recreation Law Enforcement Legislative Affairs Office of the Secretary Ombudsman and Public Services Recreation and Parks Regulatory Programs Resilience and Coastal Protection Springs State Lands Sustainable Initiatives Programs Technology and Information Services Waste Management Water Policy and Ecosystems Restoration Water Resource Management Water Restoration Assistance Districts Central District Northeast District Northwest District South District Southeast District Southwest District Air Lands Parks & Rec Waste Water Your JavaScript is turned off limiting this website’s functionality Search First Day Hike At St. Joseph Bay State Buffer Preserve Home Office of Resilience and Coastal Protection State Buffer Preserve Program Events & Public Notices First Day Hike At St. Joseph Bay State Buffer Preserve State-Buffer-Preserve Quick links St. Joseph Bay State Buffer Preserve All State-Buffer-Preserve content Scroll for More Quick Links Event Date Friday, January 01, 2021 - 10:00am EST - Friday, January 01, 2021 - 12:00pm EST Division Office of Resilience and Coastal Protection Program Area State Buffer Preserve Program Is this a Public Notice? No County Gulf Location County Rd. 30A Port St. Joe , FL 32456 United States Type Activity-Outreach-Education Details Get the new year started off on the right foot with a hike! We will meet at the South Gate Trail Entrance and traverse Sandridge Loop for roundtrip that's about 2 miles long.  Please contact us if you need directions to this lesser known entrance to the preserve. (The South Gate entrance does not have an exact address, but it is on County Road 30A, slightly east of Cape San Blas.)\n\nRemember to bring and wear anything that will make you the most comfortable for hiking! Good walking shoes, insect repellent, water, etc.\n\nDue to COVID-19, the hike will be limited to 10 people, and masks are suggested. Contact Name Fonseca, Sophia Contact Email sophia.fonseca@floridadep.gov Contact Phone 850-670-7727 Last Modified: Friday, Dec 13, 2024 - 05:53pm Interested in subscribing to DEP newsletters or receiving DEP\n                        updates through email? Sign Up About DEP The Florida Department of Environmental Protection is the\n                        state’s lead agency for environmental management and\n                        stewardship – protecting our air, water and land. The\n                        vision of the Florida Department of Environmental\n                        Protection is to create strong community partnerships,\n                        safeguard Florida’s natural resources and enhance its\n                        ecosystems. Learn More Links Air A-Z Index Lands Forms Parks\n                                & Rec How Do I Waste News Water Events Divisions Contact\n                                Us Contact 3900 Commonwealth Boulevard Tallahassee, Florida 32399-3000 Public.Services@FloridaDEP.gov 850-245-2118 Top Some content on this site is saved in an alternative format. The\n                following icons link to free Reader/Viewer software: PDF: | Word: | Excel: © Copyright 2025 Florida Department of Environmental Protection Accessibility Disclaimer Privacy Sitemap The content on the Florida Department of Environmental Protection's (DEP's) website was written and\n                    published in\n                    English, and English is the sole authoritative language for all such content. As an aid to site\n                    visitors\n                    who\n                    might benefit from multiple language options, the website offers an automated translation feature\n                    for\n                    browser\n                    content in the footer. The translation link will not convert attached or linked files, such as\n                    PDFs. The website translation feature uses Gtranslate® (https://www.drupal.org/project/gtranslate).\n                    Gtranslate®\n                    is a\n                    third-party tool which is not owned, maintained, modified, or controlled in any way by DEP, and\n                    which is\n                    not\n                    endorsed by DEP as preferable to either human-generated translations, or any other automated\n                    translation\n                    options. Translation is a nuanced and complex activity and computer-generated translations cannot be expected\n                    to be perfectly accurate. Automated translations of this site are not reviewed in advance by DEP and\n                    could convey incorrect or offensive language. DEP disclaims any liability for errors, omissions, or\n                    interpretive inconsistencies arising in the context of such translation. Site users assume all risk\n                    in using\n                    translated text.\n                    DEP is not responsible for any loss, damage, or harm resulting from reliance on translated text. Use\n                    of\n                    the\n                    translation tool in this website implies understanding and agreement with this assumption and\n                    disclaimer. Ok"
    },
    {
      "url": "https://tallahasseearts.org/venue/st-joseph-bay-buffer-preserve-center/",
      "text": "St. Joseph Bay Buffer Preserve Center English English French German Italian Portuguese Russian Spanish SUBMIT YOUR INFO LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. subscribe follow capture tweet watch connect access Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT SEARCH MENU EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates Venue Type Amusement Park Arena/Stadium Bar/Tavern Bookstore Business/Company Campground Church Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Government Historic Building/Landmark Hotel/Inn Library Museum Nightclub Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue St. Joseph Bay Buffer Preserve Center Comment Facebook Twitter Linkedin Print St. Joseph Bay Buffer Preserve Center Visitor Center & Observation Tower Visitor Center & Observation Tower View less MORE ABOUT THIS VENUE Venue Type: Park/Garden LOCATION St. Joseph Bay Buffer Preserve Center 3915 State Rd. 30A, Port Saint Joe, FL 32456 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette PUBLIC HOURS Open Weekdays 9AM-4:30PM Contact information Email / Website / 3915 State Rd. 30A, Port Saint Joe, FL 32456 850-229-1787, Ext.1 COMMENTS Leave a comment Your email address will not be published. Required fields are marked * * Email address is required! * This is not email address! * Author name is required! * Comment content is required! Your name * Your email * Comment * You may use these HTML tags and attributes : <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <cite> <code> <del datetime=\"\"> <em> <i> <q cite=\"\"> <s> <strike> <strong> * Please check the box to prove you are not a robot Find A Venue Search by Keyword Venue Type Amusement Park Arena/Stadium Bar/Tavern Bookstore Business/Company Campground Church Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Government Historic Building/Landmark Hotel/Inn Library Museum Nightclub Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access OUR PARTNERS COCA's programs are sponsored in part by the City of Tallahassee, Leon County, the State of Florida, Department of State, Division of Cultural Affairs, Community Foundation of North Florida, Knight Foundation, National Endowment for the Arts, and the Tallahassee Community Redevelopment Agency. COCA, the Council on Culture & Arts, is a non-profit organization that serves as the facilitator and voice for the arts and cultural industry in Florida's capital area. COCA provides information and promotes the arts and culture to both citizens and visitors. ABOUT US DIRECTORIES CLASSIFIEDS PARTNERS CONTACT US 114 S DUVAL STREET TALLAHASSEE, FL 32301 LOCAL NUMBER: (850) 224-2500 EMAIL: info@tallahasseearts.org © Copyright 2025 - Council on Culture & Arts | Contact Us | Site Map | Privacy Policy Powered by ARTSOPOLIS The COCA office currently has adjusted office hours to 1 PM – 5 PM to accommodate pickup for Winterfest. These hours will be adjusted from Tuesday, February 11, through Friday, February 28 . Regular office hours will return on Monday, March 3. For questions, feel free to contact staff via phone or email. In addition, access to Railroad Avenue between Gaines Street & FAMU Way is down to one lane heading south. For access to the COCA office, please take Gaines Street as currently, the COCA office is not accessible off of FAMU Way."
    },
    {
      "url": "https://stjosephfc.org/staff/",
      "text": "Our Staff - Saint Joseph Catholic Parish Skip to main content Hit enter to search or ESC to close Close Search search Menu About Get Involved Liturgy Formation Sacraments Forms Donate Our School search About Get Involved Liturgy Formation Sacraments Forms Donate Our School About Us A Note From The Padre Upon my arrival at St. Joseph Parish, I witnessed with great pleasure a faith-filled community, centered on the Eucharist and service. What a blessing it is for me to be part of this family and to serve all of you. My hope is to see all of us join hands and efforts together to build a strong Catholic Culture in our parish. With eyes fixed on our caring patron, St. Joseph, let us walk with resolve to invigorate our families and our parish life. Strong families, strong parish! We are a parish built on… Liturgy Formation Community Jubilee Mission: Enabling pathways to salvation; bringing the presence of Jesus to the world. Our Staff Very Rev. Simon Kalonga Pastor 970.482.4148 FrSimon@stjosephfc.org Email Rev. Raj Adaikaladoss Parochial Vicar 970.482.4148 FrRaj@stjosephfc.org Email Dcn. Greg Reynolds Deacon 970.482.4148 x230 gcreynolds@stjosephfc.org Email Dcn. Jerome Kraft Deacon 970.482.4148 x275 jkraft@stjosephfc.org Email Jeanette Coleman Interim Pastoral Assistant 970.482.4148 x278 jcoleman@stjosephfc.org Email Jean Hanson Business Manager 970.482.4148 x216 jhanson@stjosephfc.org Email Leslie Daniel Office Manager 970.482.4148 x217 ldaniel@stjosephfc.org Email Sue Shortridge Front Office Administrative Assistant 970.482.4148 x 276 sshortridge@stjosephfc.org Email Lois Carroll Liturgy Coordinator 970.482.4148 x282 lcarroll@stjosephfc.org Email Kimberly Tallman Director of Weddings 970.482.4148 x204 ktallman@stjosephfc.org Email Kelly Callahan Communications Coordinator 970.482.4148 x229 kcallahan@stjosephfc.org Email Destinie Sullivan Coordinator of Elementary Faith Formation 970.482.4148 x202 dsullivan@stjosephfc.org Email Chad Bauer Coordinator of Middle School Faith Formation 970.482.4148 x218 cbauer@stjosephfc.org Email Ben Beauvais Technology Coordinator 970.482.4148 x246 bbeauvais@gosaintjoseph.org Email Oliver Knudson Director of Music Ministry 970.482.4148 x274 oknudson@stjosephfc.org Email Michael Failing Facility Security and Support Staff 970.482.4148 x212 mfailing@stjosephfc.org Email Joe Bertles Maintenance Supervisor 970.482.4148 x225 jbertles@stjosephfc.org Email Pete Hall Maintenance Team 970.482.4148 x225 phall@stjosephfc.org Email Sam Degroot Maintenance Team 970.482.4148 x225 sdegroot@stjosephfc.org Email Ellie Dvorak Gardener 970.482.4148 x225 edvorak@stjosephfc.org Email Tony Rosales Custodial Team 970.482.4148 x225 trosales@stjosephfc.org Email Mary Castaneda Custodial Team 970.482.4148 x225 mcastaneda@stjosephfc.org Email St. Joseph Parish In 1879 St. Joseph Catholic Parish was founded. In 1900 the Church moved to its current location. Parish Center In 1979 the Rectory and Parish Center were brought into fruition. Stop in and say hello! Home Becoming Catholic Community Formation Opportunities Events Calendar Register as a Parishioner Our School Sign up for Flocknote to receive weekly parish news. Sign Me Up Parish Office Hours Monday – Thursday: 8:30 a.m. – 4:00 p.m. Friday: 8:30 a.m. – 3:30 p.m. 101 N. Howes St., Fort Collins CO, 80521 parishcenter@stjosephfc.org 970-482-4148 Find Us On Facebook & YouTube 970-482-4148 | © Archdiocese of Denver & St. Joseph Catholic Parish & School"
    },
    {
      "url": "http://www.stjosephbaypreserve.org/2020/10/",
      "text": "October | 2020 | Friends of St. Joseph Bay Preserves Skip to content Friends of St. Joseph Bay Preserves Search Primary Menu Welcome Our Mission Our Membership Board of Directors Code of Ethics Volunteering Join Us The Preserves Aquatic Preserve Projects Research Prescribed Fire Visit Visitor Center Guided Tram Tours Explore the Preserves Birding Around the Bay Preserve Center Accommodations Maps Links News & Events News Events Activities Educational Activities Bay Day Join Us Contact Us Search for: Monthly Archives: October 2020 Activities , Events Halloween at the Buffer Preserve October 27, 2020 March Ard Friday, October 30, 6:00-9:00 Eastern Time St. Joseph Bay State Buffer Preserve, 3915 State Road 30A, Port St. Joe, FL Full Moon Tram Tour and Treats The Friends of St. Joseph Bay Preserves welcome you to our first Halloween event! At the base of the observation tower, Preserve Manager Dylan Shoemaker will host a marshmallow roast around a campfire. Up on the deck, Friends will be serving hot chocolate and candy! Across the street, Environmental Specialist Sophia Fonseca will lead visitors on a haunted tram tour. Experience the preserve after hours in the light of the oh-so-convenient full moon, actually a blue moon! There will be scary history about the preserve and maybe some views of creatures that only come out at night. Reservations are required for the Haunted Tram. While we are limiting the number of people on the tram to abide by CDC guidelines, we will be offering the tour at two times: 6pm and 7:30pm. In your reservation, please list the number of people in your group as well as your chosen tour time. Tram reservations can be made by contacting Sophia Fonseca at sophia.fonseca@floridadep.gov Meet at the Main Gate parking lot at the time of your tour. We suggest driving across the street for safety reasons. Masks are required inside the visitor center. Outside, they are required if 6ft of distance cannot be maintained. COSTUMES ARE ENCOURAGED! Recent Posts: News & Events Summer Art Camp Visit, Wednesday, June 24th, 2025 Animal Track Hike, Saturday, June 28th, 2025, 9:00 a.m. EDT Wildflower Walk, Monday, May 5th, 2025, 9:00 a.m. EDT Animal Track Hike, Saturday, April 19th, 2025, 10:00 a.m. EDT Birding at the Buffer, Thursday, April 10, 2025 categories: news & events categories: news & events Select Category Activities Announcements Events Lectures Meetings News Archives: News & Events Archives: News & Events Select Month June 2025 April 2025 March 2025 January 2025 December 2024 November 2024 September 2024 July 2024 May 2024 March 2024 November 2023 April 2023 January 2022 December 2021 June 2021 May 2021 March 2021 January 2021 December 2020 October 2020 March 2020 January 2020 November 2019 August 2019 April 2019 September 2018 July 2018 April 2018 March 2018 December 2017 July 2017 April 2017 March 2017 January 2017 November 2016 June 2016 April 2016 March 2016 Friends of the Preserves Facebook Friends of the Preserves Facebook A Citizen Support Organization established to protect and preserve one of the most ecologically significant areas in the Southeastern United States Buffer Preserve News Florida DEP Happenings Visitor Center Explore The Preserves Guided Tram Tours Birding Around the Bay Photo Gallery Bay Dayz Bird Gallery Deal Tract Island Road Trail North Spur Trail Sandridge Trail Treasure Rd to Depot Run Video Gallery Deal Tract Drone Video Maps Contact Us Friends of St. Joseph Bay Preserves 2025 Proudly powered by WordPress"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "http://www.stjosephbaypreserve.org/tag/seagrass/",
      "text": "seagrass | Friends of St. Joseph Bay Preserves Skip to content Friends of St. Joseph Bay Preserves Search Primary Menu Welcome Our Mission Our Membership Board of Directors Code of Ethics Volunteering Join Us The Preserves Aquatic Preserve Projects Research Prescribed Fire Visit Visitor Center Guided Tram Tours Explore the Preserves Birding Around the Bay Preserve Center Accommodations Maps Links News & Events News Events Activities Educational Activities Bay Day Join Us Contact Us Search for: Tag Archives: seagrass Activities , Events Join the Sea Urchin Roundup – Saturday, September 9, 2023 April 28, 2023 Tim Nelson HELP DEP AND FWC REHOME SEA URCHINS – SEPT. 9, 2023 St. Joseph Bay, located in Gulf County in the Panhandle, once contained extensive beds of seagrass and supported an abundant scallop fishery. Residents and visitors enjoyed extensive, pristine seagrass beds and clear bay waters. Summertime recreational scallop harvesting contributed greatly to the local economy. Seagrass beds in the bay are dominated by turtle grass which also provide food for abundant green sea turtles. The scallop fishery has become depleted in recent years, algal blooms are more frequent, and the acreage of seagrass beds has decreased. An overabundance of sea urchins ( Lytechinus spp. ) continues to destroy turtle grass beds through overgrazing. This project will jump start natural recovery of seagrass by installing exclosures over grazed areas to allow seagrasses to grow back without sea urchin grazing pressure. In addition, sea urchin roundups, public outreach events, will involve citizens to remove sea urchins from active grazing fronts. The animals will be released in deeper areas of the bay at a distance from grazed areas. sea urchins seagrass st joseph bay urchin roundup urchins Activities , Events Join the Sea Urchin Roundup – May 22nd May 6, 2021 Tim Nelson Participate in the Sea Urchin Roundup on May 22, 2021 The FDEP/Central Panhandle Aquatic Preserves and FWC/FWRI are hosting the St. Joseph Bay Urchin Roundup on May 22 nd . We are looking to recruit volunteers to help collect urchins to relocate out to deeper water to help reduce grazing pressure on seagrasses in St. Joseph Bay. See the information flyer. Check-in is at the Frank Pate Public Boat Ramp in Port St. Joe. We will also have a registration tent and outreach tent at Frank Pate Boat Ramp all day for the event. Bring your own boat, gloves and snorkeling gear and join us in removing sea urchins from seagrass beds! We will provide maps and gps locations showing where to collect urchins and buckets to put them in. Return buckets filled with urchins to our check-in station and get some swag. We will relocate the urchins to deeper water away from seagrass. Check-in begins at 8:00 AM , and all urchins must be turned in by 5:00 PM . Please check in with an FWC or DEP employee to get your bucket and sign a volunteer waiver. Urchins should be returned in this bucket with seawater to be safely relocated by FWC or DEP employees. Rain date is June 5, 2021. St. Joseph Bay, located in Gulf County in the Panhandle, once contained extensive beds of seagrass and supported an abundant scallop fishery. Residents and visitors enjoyed extensive, pristine seagrass beds and clear bay waters. Summertime recreational scallop harvesting contributed greatly to the local economy. Seagrass beds in the bay are dominated by turtle grass which also provide food for abundant green sea turtles. The scallop fishery has become depleted in recent years, algal blooms are more frequent, and the acreage of seagrass beds has decreased. An overabundance of sea urchins ( Lytechinus spp. ) continues to destroy turtle grass beds through overgrazing. This project will jump start natural recovery of seagrass by installing exclosures over grazed areas to allow seagrasses to grow back without sea urchin grazing pressure. In addition, sea urchin roundups, public outreach events, will involve citizens to remove sea urchins from active grazing fronts. The animals will be released in deeper areas of the bay at a distance from grazed areas. This project is a partnership between FWRI and the Central Panhandle Aquatic Preserves of the Florida Department of Environmental Protection. Staff from both agencies are maintaining the exclosures, monitoring the abundance of sea urchins quarterly, assessing sea grass abundance by in-water and mapping surveys, and measuring water quality monthly. sea urchins seagrass st joseph bay urchin roundup urchins News Scars Hurt Signs Are Up April 29, 2018 March Ard Boat Launch at Frank Pate Park, Port St. Joe Jon Brucker, Manager of the Aquatic Preserve, suggested a set of new signs from the Be Seagrass Safe organization to attract boaters’ attention to the need to protect seagrass in the St. Joseph Bay. The large, colorful signs were purchased by the Friends and installed by Aquatic Preserves staff at  popular boat launch sites. The seagrass growing in the St. Joseph Bay is mostly the type called turtle grass. It provides shelter for small salt water animals and for young, growing fish and shellfish. It is also a favorite food source for juvenile green sea turtles. scars seagrass signs News Friends Post Signs to Protect Seagrass April 1, 2017 March Ard John Brucker, Manager of the Aquatic Preserve, suggested a set of new signs from the Be Seagrass Safe organization to attract boaters’ attention to the need to protect seagrass in the St. Joseph Bay. The large, colorful signs will be purchased by Friends and installed by Aquatic Preserves staff at three popular boat launch sites: George Pate Park in downtown Port St. Joe, Presnell’s Landing on State Road 30A (if the owner permits), and St. Joseph Peninsula State Park at Eagle Harbor. The seagrass growing in the St. Joseph Bay is mostly the type called turtle grass. It provides shelter for small salt water animals and for young, growing fish and shellfish. It is also a favorite food source for juvenile green sea turtles. seagrass turtles Meetings , News Annual Meeting News & Reports January 1, 2017 March Ard Annual Membership Meeting, January 7 First, the nearly 30 members present voted by acclamation to install two new Directors on the Board. They are Linda Palma and Tim Nelson. Both Linda and Tim spend a lot of time volunteering at the Buffer center, helping with ongoing projects and creating new enhancements for the Visitor Center. Among their many contributions, Linda has recorded a self-guided audio tour of the exhibits by Sandra  Chafin, now available any time in the Visitor Center. Tim and Allix North have produced a beautiful drone fly-over tour of the Buffer Preserve. You can watch it on the television in the Visitor Center. A $500 check from the Florida Scallop and Music Festival of Port St. Joe was presented by Guerry Magidson, Chairman of the Board of Gulf County Chamber of Commerce, to Friends President Lynda White. Buffer Preserve Manager Dylan Shoemaker presented a PowerPoint talk on the issues facing the Buffer Preserve this year. He reminded us that the mandate of the Preserves is “To Conserve and Protect.” Six current issues were discussed: I. Restoring the hydrology (natural water flow) within the Buffer’s three watersheds. The focus now is on the Money Bayou watershed. II. Protecting plant and animal resources. III. Controlling invasive species, both plants and animals. IV. Protection of the 18 cultural and historical archaeological sites in the Preserve. V. Promoting conservation and responsible use of the natural area by the public. The Preserve has recently added a new staff member, Shana Hale, who specializes in education and outreach. VI. Promoting scientific research that contributes to conservation and protection of native ecosystems. Central Panhandle Aquatic Preserves Manager Jonathan Brucker presented a talk about current projects of the Aquatic Preserves. Volunteer opportunities were emphasized. Aquatic Preserves volunteers are needed to help with water quality monitoring in the four bays, St. Joseph Bay, Apalachicola Bay, Alligator Harbor, and St. Andrews Bay. The water is tested for nutrients and for harmful algal blooms. Volunteers may also help with seagrass monitoring at around 25 sites in St. Joseph Bay and others in Alligator Harbor and Apalachicola Bay. If you want to volunteer, please email Jonathan.Brucker@dep.state.fl.us , or call the Aquatic Preserves, 850-670-7723. Several important restoration projects are underway in the bays of the Preserves. Seagrass restoration is an important one since many marine animals depend on the seagrass. Scars in seagrass beds will be filled in using a sediment tube method, beginning this summer, and 49 buoys have been deployed to prevent motor boats entering shallow areas of the bays. Other restoration projects include oyster clutch replacement and the Living Shoreline Project, funded by BP oil spill payments, which will add beneficial vegetation along shorelines. algal blooms annual buffer hydrology meeting seagrass watersheds Recent Posts: News & Events Summer Art Camp Visit, Wednesday, June 24th, 2025 Animal Track Hike, Saturday, June 28th, 2025, 9:00 a.m. EDT Wildflower Walk, Monday, May 5th, 2025, 9:00 a.m. EDT Animal Track Hike, Saturday, April 19th, 2025, 10:00 a.m. EDT Birding at the Buffer, Thursday, April 10, 2025 categories: news & events categories: news & events Select Category Activities Announcements Events Lectures Meetings News Archives: News & Events Archives: News & Events Select Month June 2025 April 2025 March 2025 January 2025 December 2024 November 2024 September 2024 July 2024 May 2024 March 2024 November 2023 April 2023 January 2022 December 2021 June 2021 May 2021 March 2021 January 2021 December 2020 October 2020 March 2020 January 2020 November 2019 August 2019 April 2019 September 2018 July 2018 April 2018 March 2018 December 2017 July 2017 April 2017 March 2017 January 2017 November 2016 June 2016 April 2016 March 2016 Friends of the Preserves Facebook Friends of the Preserves Facebook A Citizen Support Organization established to protect and preserve one of the most ecologically significant areas in the Southeastern United States Buffer Preserve News Florida DEP Happenings Visitor Center Explore The Preserves Guided Tram Tours Birding Around the Bay Photo Gallery Bay Dayz Bird Gallery Deal Tract Island Road Trail North Spur Trail Sandridge Trail Treasure Rd to Depot Run Video Gallery Deal Tract Drone Video Maps Contact Us Friends of St. Joseph Bay Preserves 2025 Proudly powered by WordPress"
    },
    {
      "url": "http://www.stjosephbaypreserve.org/preserve-accommodations/",
      "text": "Preserve Center Accommodations | Friends of St. Joseph Bay Preserves Skip to content Friends of St. Joseph Bay Preserves Search Primary Menu Welcome Our Mission Our Membership Board of Directors Code of Ethics Volunteering Join Us The Preserves Aquatic Preserve Projects Research Prescribed Fire Visit Visitor Center Guided Tram Tours Explore the Preserves Birding Around the Bay Preserve Center Accommodations Maps Links News & Events News Events Activities Educational Activities Bay Day Join Us Contact Us Search for: Preserve Center Accommodations St. Joseph Bay State Buffer Preserve Center, 3915 State Rd. 30A, Port St. Joe, FL 32456 Maps The St. Joseph Bay Preserves Center provides support and overnight accommodations to individuals conducting research, education, resource management and other projects consistent with the goals and objectives of the St. Joseph Bay State Buffer and Aquatic Preserves and the Florida Department of Environmental Protection. The following provides information on facilities, usage and reservations. ACCOMMODATIONS Rooms 1A – 1B have  5 extra-long single beds, desks, and a bathroom with tub/shower. Rooms 7A – 7B have 6 extra-long single beds, desks, and a bathroom with tub/shower. Room 6 has 3 extra-long single beds a desk, and a bathroom with tub/shower. Room 4 has an extra bath and can be used as Quiet room. Room 2 has laundry facilities and extra bath. Guests provide their own laundry supplies.  No coins needed. Guest Kitchen in Room 5 has a dining table with 4 chairs, refrigerator with freezer, stove, oven, sink, microwave, coffeepot, and kitchenware. Lodge has Wi-Fi internet access, 2 restrooms, 61 person capacity for meetings, meeting tables and chairs, and a lounge area with sofa and armchairs. The Lodge is always open when there are overnight guests. Lodge Kitchen has 2 refrigerator/freezers, 2 stoves, 2 ovens, 2 sinks, 1 microwave, dishwasher, coffeepot and kitchenware. The Lodge kitchen is always open when there are overnight guests. Rooms 1 A&B                                                               Room 4 Room 6                                                                            Rooms 7 A&B Room 5                                                                                     Room 2 Lodge Kitchen Lodge Lodge Lodge FACILITY USE & GUIDELINES* Guests must bring their own towels and bed linens including pillows. Please leave rooms in the condition you found them or better. Cleaning supplies are available in the Guest Kitchen, Room 5. All food and beverages must be removed from the premises upon departure. All trash must be removed to the dumpster in the parking area. All dishes and cookware should be washed and stored properly. Turn off lights and air conditioning, and close blinds upon departure. *Failure to comply with these guidelines may revoke future reservations at the Preserve Center facilities. DONATIONS The Friends of St. Joseph Bay Preserves, Inc., a non-profit citizen support organization for the St. Joseph Bay State Buffer Preserve and the St. Joseph Bay State Aquatic Preserve, facilitates the operation of the Preserves Center accommodations. Our overnight facilities are available to eligible individuals and groups conducting research. Donations (tax deductible) are accepted to help offset the costs associated with maintenance and operation of the facilities. $20 per night per bed. Donations will automatically initiate membership to the Friends of St. Joseph Bay Preserves, Inc. Make Check to:  Friends of St. Joseph Bay Preserves, Inc. Mailing Address: Friends of St. Joseph Bay Preserves, Inc. 3915 State Road 30-A Port St. Joe, FL 32456 RESERVATIONS Reservations must be made at least one week in advance and approved by the Buffer Preserve Manager. Space is available on a first-reserve, first-serve basis. Please provide a minimum of 2 days notice should you need to cancel your reservation. Before making a reservation, please review the Facility Use & Maintenance Guidelines. Note: A combination to access the facilities can be obtained prior to arrival should overnight guests arrive before or after regular business hours (Monday – Friday, 9 a.m. to 4 p.m. EST). To make a reservation, please call Sandra Chafin at the St. Joseph Bay State Buffer and Aquatic Preserves Center at 850-229-1787. In order to better accommodate our guests, we ask that you please submit a Guest Registration Form prior to your arrival. Return completed forms via e-mail to Sandra Chafin (Sandra.Chafin@dep.state.fl.us). Guest Registration Form PDF Guest Guidelines PDF Recent Posts: News & Events Summer Art Camp Visit, Wednesday, June 24th, 2025 Animal Track Hike, Saturday, June 28th, 2025, 9:00 a.m. EDT Wildflower Walk, Monday, May 5th, 2025, 9:00 a.m. EDT Animal Track Hike, Saturday, April 19th, 2025, 10:00 a.m. EDT Birding at the Buffer, Thursday, April 10, 2025 categories: news & events categories: news & events Select Category Activities Announcements Events Lectures Meetings News Archives: News & Events Archives: News & Events Select Month June 2025 April 2025 March 2025 January 2025 December 2024 November 2024 September 2024 July 2024 May 2024 March 2024 November 2023 April 2023 January 2022 December 2021 June 2021 May 2021 March 2021 January 2021 December 2020 October 2020 March 2020 January 2020 November 2019 August 2019 April 2019 September 2018 July 2018 April 2018 March 2018 December 2017 July 2017 April 2017 March 2017 January 2017 November 2016 June 2016 April 2016 March 2016 Friends of the Preserves Facebook Friends of the Preserves Facebook A Citizen Support Organization established to protect and preserve one of the most ecologically significant areas in the Southeastern United States Buffer Preserve News Florida DEP Happenings Visitor Center Explore The Preserves Guided Tram Tours Birding Around the Bay Photo Gallery Bay Dayz Bird Gallery Deal Tract Island Road Trail North Spur Trail Sandridge Trail Treasure Rd to Depot Run Video Gallery Deal Tract Drone Video Maps Contact Us Friends of St. Joseph Bay Preserves 2025 Proudly powered by WordPress"
    },
    {
      "url": "http://www.stjosephbaypreserve.org/tag/bay-day/",
      "text": "bay day | Friends of St. Joseph Bay Preserves Skip to content Friends of St. Joseph Bay Preserves Search Primary Menu Welcome Our Mission Our Membership Board of Directors Code of Ethics Volunteering Join Us The Preserves Aquatic Preserve Projects Research Prescribed Fire Visit Visitor Center Guided Tram Tours Explore the Preserves Birding Around the Bay Preserve Center Accommodations Maps Links News & Events News Events Activities Educational Activities Bay Day Join Us Contact Us Search for: Tag Archives: bay day News Friends Newsletter, March 2024 March 3, 2024 Tim Nelson bay day buffer preserve Newsletter St. Joseph Bay Preserves Winter Bay Day News Friends Newsletter, November 2023 November 12, 2023 Tim Nelson BAY DAY Warm sunny weather helped to bring out visitors On Saturday October 7 th for our annual Fall Bay Day fund raiser.  Our famous Low Country Shrimp Boil served 160 hungry visitors who also enjoyed live music, a silent auction, guided tours through the backwoods trails of the Buffer Preserve, and an Audubon bird walk.  Additional informative environmental presentations were held in the Visitor Center. Among the many exhibitors present were the Central Panhandle Aquatic Preserve, Saint Joseph State Park, Saint Andrews & Saint Joseph Bays Estuary Program, BaySavers, Aquatech/Aquaticus, Indian Pass Turtle Patrol, Fish and Wildlife Commission/FWRI Scallops, Florida Native Plant Society, SJP Turtle Patrol, Friends of St. Vincent Wildlife Reserve, International Dark Sky Association, and various area governmental and nonprofit environmental organizations. We surveyed a number of our visitors asking them how they would rate their Bay Day experience based on a 1 to 5 scale with 1 being very poor and 5 being very good .  They responded with a 4.83 average. In general, their comments were overwhelmingly positive with statements like: “Great, Fun, Love all the information and people, Nice people, Good tour, Enjoyed the band, Would like to come back, Enjoyable Day, Well organized and interesting, Will be back, Best yet, Best so far, Very organized, Excellent,” and so forth. As you know, The Friends of the St. Joseph Bay Preserves hold two Bay Day events each year on the first Saturday in October and February.  If you missed it, please join us for the fun in February and if it works for you consider volunteering to assist us with this major fund-raising project. INTERPRETATIVE TRAIL PROJECT The Friends, with the assistance of the Buffer staff, have begun an interpretative trail project that has completed its first phase of construction.  The base material for the trail meeting ADA standards has been laid down as a short loop trail that runs along the Bay just north of the observation tower. The Bay views from the trail are stunning. When finished the trail will be an important educational addition congruent with the Buffer Visitor Center and the Bay Observation Tower.  The next major focus of this project will be creating visitor usage locations and interpretive signage. We are also looking for interested people who would like to assist us with this project in regard to fund raising support and continuing trail design. CHANGES IN BOARD MEMBERSHIP AND HELP NEEDED This year the Friends Board of Directors have added three new members.  Brenda Burnett, Patrick Foy and Kelly Houk.  Each of them brings important skills and perspectives to the Board.  The Board currently consists of thirteen elected members and two exofficio non-voting members who are the Site Managers of the Aquatic and Buffer State Preserves. Unfortunately, our current Treasurer is leaving the Board. We want to recognize the dedication and hard work that March Ard has done in that position. The Treasurer serves as a Board officer who works closely with the Board President and Secretary to help the Board fulfill its fiduciary responsibilities.  This is a critical role within the Friends. If you or someone you know would be a good candidate for this important position, please contact me at the number below. Hope all is well in your life, Richard Trahan, President Friends of St. Joseph Bay Preserves (970) 744-9801. rtrahan@comcast.net bay day environmental presentations Fall Bay Day Newsletter Trail Project News Friends Newsletter, January 2022 January 25, 2022 March Ard bay day buffer preserve friends meeting Newsletter st joseph bay Winter Bay Day News 18th Winter Bay Day – A HUGE SUCCESS! March 10, 2020 Sandra Chafin Everyone working together . . . makes any event successful! This was certainly the case for the 18 th Winter Bay Day held on February 8 th at the St. Joseph Bay Buffer Preserve. Just 5 plates less than 500 served made the day outstanding and even record-breaking in some areas. Board members, volunteers and staff at the Preserve were ecstatic at the number of participants, dedicated volunteers, and supporting agencies and organizations setting up informational displays. Winter and Fall Bay Day events have returned after a year following Hurricane Michael. It has been a long road back and thankfully a successful one. Dylan Shoemaker, Manager of the Preserve, proudly expressed with great enthusiasm, “how pleased we are with such a great turnout. After having to postpone Bay Day for over a year we were a little apprehensive about its return to the area. Attendance exceeded our expectations for which we are thankful. Our returning volunteers, year after year, provide consistency and allows us to grow and improve. Thanks to everyone for making Winter Bay Day 2020 one of the best ever!” Four TRAM Tours were offered and were filled to capacity. The regularly scheduled Third Thursday on February 20 th was also filled to capacity. If you have not experienced the tour join us. Twenty-six lucky people who have registered tour the heart of the preserve. For Fall and Winter Bay Day there is no early registration. If interested in the March TRAM Tour call 850-229-1787 as quickly as possible as several seats are already reserved. Jonathan Brucker, St. Joseph Bay Aquatic Preserve Manager, was also excited with the turnout and the interest in St. Joe Bay and the concern for continued watching and protecting the bay. Jon and his staff cheerfully explained maps, brochures and the mission of the Aquatic Preserve to any and all who wanted to listen. He had this to say about the event, “Educating the public is first and foremost in our mission at the St. Joseph Bay Aquatic Preserve. Bay Day visitors and locals want to know how they can help us recover from the effects of Hurricane Michael. We have been so impressed with everyone’s sincere offers to assist clean-up in any way possible. Jon reported that signage for the bay will be replaced as quickly as possible. “What a great day we had Saturday! The weather was perfect, the music was toe-tapping wonderful, the beer was cold, the shrimp were delicious and what a crowd! I had so many compliments on our event, with most saying they had missed us and were so glad we were back”, says Board President, Lynda White. 2020 bay day St. Joseph Bay Preserves Winter Bay Day Activities , Events Winter Bay Day – Saturday, February 8, 2020 November 25, 2019 Tim Nelson Join Us on Saturday, February 8, 2020 for our popular WINTER BAY DAY! There will be lots to see and lots to do. Best of all, the Low Country Shrimp Boil will be delicious – as always! Meet you on the deck of the Visitors Center! … no admission fee! Learn More bay day buffer preserve Activities , Events , News 15th Bay Day! Outstanding Sponsors! September 25, 2018 Sandra Chafin It all started in 2003 when the first Board of the Friends of the Preserves decided to have a thank you for those who had supported their tireless efforts of establishing a committed group of citizens concerned with helping the health of the bay. Charla Boggs was the first president of this illustrious group of citizens. That first group and each group who have followed have displayed extraordinary desires to restore the land, protect the water, and preserve for the future. Lynda White is the current president who has been blessed with an outstanding board and wonderful opportunities during her term in office. Purchasing 25 lots contiguous to the Buffer Preserve will help continue to help protect the quality of the water and wildlife in and near St. Joe Bay. Lynda says, “It has been a privilege to serve on the board and as its president. Opportunities have been presented and funds from our previous Bay Days allowed us to make these purchases. The 5,025+ acres benefit the entire community. Improvements made in the buffer and aquatic preserves contribute to the mission of the Friends.” Would you believe that over 300 attended the first “Low Country Boil”? How about this fact? There were 7 prizes donated to be given away in a drawing at that first event. Yes, you read it correctly. Seven prizes were given and of that seven — four of them are still donating prizes for the Bay Day Live Auction, Silent Auction or for the Raffle. Original sponsors were: Dead Fish Charters at the Indian Pass Campground, The Entrance, Happy Ours, Debbie Hooper Photography, Indian Pass Raw Bar, St. Vincent Island Shuttle Service and Richard and Anne Ingram. THANK YOU to the 200+ local business sponsors for 2018! Our Fall Bay Day, Silent Auction and Live Auction would not be possible without the generous donations of desirable goods and services made by our local business sponsors. When you are considering making a purchase use a business who knows the value of the bay to the citizens of Gulf County and the surrounding area. Go to the Donors & Sponsors page on this website for a complete list of our donors and sponsors. For an authentic experience (the Atlanta Magazine says), come on out to the St. Joseph Bay Buffer Preserve on Saturday, October 13 th . You can participate in a great Birding Tour led by Ron Houser of the Bay County Audubon Society, beginning at 8:00 am ET. There will be four TRAM Tours: 9:30 am, 11:00 am, 12:30 pm, 2:00 pm. Twenty-four seats for each time. Both are free however, you must sign up to participate. We will ask for a $10 donation for each shrimp plate and what a bargain that is. The first plates in 2003 were $7 so you can see they are still reasonable and most delicious. While you are enjoying Bay Day, stop by our Silent Auction tables and check out the Silent Auction Bid Items . You will not want to miss our Live Auction event Thursday October 11th starting at 6:30 pm ET at the Preserve Visitor Center . This is an excellent opportunity to make donations to the preserves while having a lot of fun. Our Auctioneer Frank will entertain you while encouraging you to go ahead and plan that charter fishing trip or enjoy that stay at the beach, take a day to recharge and be pampered. You can find a multitude of choices for that experience. Your house needing some repairs? Look at our home improvement section for help. Want to see what your choices are? Go to the Live Auction Bid Items page on this website and see the entire list of donations made by our awesome sponsors. All to help protect the bay, the natural communities and wildlife in the preserve. Look for hand-outs of the Live Auction items in retail stores in the area and check them out online. Christmas is right around the corner and you can get started early. You will be so proud of yourself for getting that head start and in such an outstanding way – helping the preserves. If you have questions please call 850-229-1787, Ext. 1 for more information. bay day donors live auction sponsors Activities , Events , News Volunteers Help Businesses and Preserves September 16, 2018 Sandra Chafin They did it again, volunteers at the St. Joseph Bay Buffer Preserve thanked local business owners for their help in the last two previous Bay Day Celebrations. They also happily accepted donations for the Fall Bay Day and Live Auction which will be on Oct. 11 th and Oct. 13 th . The gift certificates are under lock and key for next February. Pat Caruana and Carl Janish have performed their magic – helping to promote local businesses with an outstanding Sponsors Display in the Visitor Center. All donations are used to raise funds for various projects during the year by the Friends of the Preserves Citizen Support Organization. Many locals are members of the group and membership is encouraged. Attending the Live Auction on Thursday before the Saturday Bay Day event helps the CSO even more. Come on out and be ready to be floored by the gifts and services available. Donations will be accepted in the form of cash or credit card. Board President Lynda White “sincerely hopes everyone will attend the Live Auction on Thursday night and Bay Day on Saturday.  Birding and TRAM Tours, Low Country Shrimp Boil, Live Bluegrass music, Silent Auction and Raffles. You will have a great day and be glad you got out to enjoy the beauty of the preserves.” This is an excellent opportunity to give unique gifts to family and friends for birthdays, anniversaries, or Christmas. Think how relaxed you will be in December when your Christmas shopping is almost complete! Shirts and ties are out of vogue and charter fishing trips are in. Your spouse will thank you profusely and you will make points for the whole year. Want to know what kind of items you might find at the Live Auction , Silent Auction or Raffle? These items are listed on the Friends of the Preserves website. So, if you have a fear of attending auctions just relax. Friends of the Preserves Board Members will help you so you can enjoy the night. Another site volunteer, Frank Hermanek will serve as auctioneer for the second time and he makes the event enjoyable even if someone outbids you on an item. There is wine and cheese to enjoy also. Remember, your donations by membership or participation in the auctions, raffles, or by attending Bay Day are used to assist the Aquatic and Buffer Preserves exclusively. Keeping St. Joseph Bay in outstanding condition is a priority for the CSO. The 5,025 acres surrounding the bay serve as a water recharge area naturally cleaning the waters coming down the watershed before it reaches the bay. We are not just talking about the bay for our use now but for the next generations to follow. Dylan Shoemaker, Preserve Manager “invites everyone to come to the preserve and enjoy being outside. Listen to bluegrass music and enjoy an authentic experience with a Low Country Shrimp Boil prepared right on the deck. Local wild-caught shrimp make the boil extraordinary for a mere $10 donation.” The mission of the Friends of the Preserves is: Restoring the Land, Protecting the Water, and Preserving the Future! How can you help? Attend the Live Auction on Thursday, October 11th and Bay Day on October the 13 th ! The LIVE Auction on October 11 th and the Fall Bay Day on October 13 th are two events it will be worth your while to participate in while you are helping the Aquatic and the Buffer Preserves. Raising funds to help in YOUR backyard! The mission of the Friends of the Preserves: Restore the Land, Protect the Water, Preserve for the Future. You can help!! auction bay day volunteers News Bay Day a Terrific Fund-Raiser April 1, 2017 March Ard The Live Auction, Feb. 2, and Winter Bay Day ,Feb. 4, brought in over $9,000 in net donations, after deducting our costs. Please be sure to thank our commercial sponsors who gave items for the auctions and raffle! Business owners from Mexico Beach to Apalachicola responded to requests by site volunteers Pat Caruana and Carl Janish, and most local businesses donated valuable merchandise or services for our auctions. You can find their business cards and brochures on display at the Buffer Visitors’ Center. Please thank our sponsors! All of you volunteers deserve a huge Thank You, too! Here’s a breakdown of net funds received from some of the Winter Bay Day activities you helped with: Shrimp Boil, 491 plates sold, $4,911 Live Auction, $3,648 T-shirt sales, $1,091 Silent Auction, $872 Memberships, $860 Raffle, $696 Cookie Sales, $287 auction bay day Activities , Events , News Big Bay Day March 1, 2016 March Ard Winter Bay Day on Feb. 6 The Winter Bay Day this year was a huge success! We had lots of visitors, plenty of Low Country Shrimp Boil to go around, 57 Friends volunteers, and a great band playing on the deck, the Mary and Aaron Band from Tallahassee. Displays from the Aquatic Preserve, the Audubon Society, the Florida Native Plant Society, Apalachicola National Estuarine Research Reserve, the Constitution State Museum, St. Joseph Peninsula State Park, and others were popular. And for the first time, thanks to kitchen coordinator and baker Pam and two young volunteer salesladies, there were homemade cookies for sale. They were scrumptious, and very profitable! There was also a 50/50 Raffle and a Silent Auction with some very special goods donated by local businesses and craftsmen. Overall, Winter Bay Day netted $4,115 for Friends! THANK YOU TO ALL WHO VOLUNTEERED, INCLUDING THE CONSERVATION CORPS OF FRANKLIN COUNTY, AND TO OUR SILENT AUCTION DONORS TOO! bay day winter Recent Posts: News & Events Summer Art Camp Visit, Wednesday, June 24th, 2025 Animal Track Hike, Saturday, June 28th, 2025, 9:00 a.m. EDT Wildflower Walk, Monday, May 5th, 2025, 9:00 a.m. EDT Animal Track Hike, Saturday, April 19th, 2025, 10:00 a.m. EDT Birding at the Buffer, Thursday, April 10, 2025 categories: news & events categories: news & events Select Category Activities Announcements Events Lectures Meetings News Archives: News & Events Archives: News & Events Select Month June 2025 April 2025 March 2025 January 2025 December 2024 November 2024 September 2024 July 2024 May 2024 March 2024 November 2023 April 2023 January 2022 December 2021 June 2021 May 2021 March 2021 January 2021 December 2020 October 2020 March 2020 January 2020 November 2019 August 2019 April 2019 September 2018 July 2018 April 2018 March 2018 December 2017 July 2017 April 2017 March 2017 January 2017 November 2016 June 2016 April 2016 March 2016 Friends of the Preserves Facebook Friends of the Preserves Facebook A Citizen Support Organization established to protect and preserve one of the most ecologically significant areas in the Southeastern United States Buffer Preserve News Florida DEP Happenings Visitor Center Explore The Preserves Guided Tram Tours Birding Around the Bay Photo Gallery Bay Dayz Bird Gallery Deal Tract Island Road Trail North Spur Trail Sandridge Trail Treasure Rd to Depot Run Video Gallery Deal Tract Drone Video Maps Contact Us Friends of St. Joseph Bay Preserves 2025 Proudly powered by WordPress"
    }
  ]
}