{
  "fuentes": [
    {
      "url": "https://portlabelleinn.com/contact/",
      "email": "booking@stmatthewshouse.org"
    },
    {
      "url": "https://portlabelleinn.com/about/",
      "email": "booking@stmatthewshouse.org"
    },
    {
      "url": "https://www.linkedin.com/company/labelle-winery",
      "email": "erin@experiencelabelle.com"
    },
    {
      "url": "https://www.linkedin.com/company/labelle-winery",
      "email": "stephanie@experiencelabelle.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "hr@team.spruko.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "legaldept@team.spruko.com"
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "email": "sales@team.spruko.com"
    },
    {
      "url": "https://hotel-heritage-inn-port-blair.hotelsgds.com/contact-us/",
      "email": "hotel-heritage-inn-port-blair-4@hotelsgds.com"
    },
    {
      "url": "https://hotel-heritage-inn-port-blair.hotelsgds.com/contact-us/",
      "email": "info-4@hotelsgds.com"
    },
    {
      "url": "https://coffee-inn-hostel.com/contact-us/",
      "email": "info@coffee-inn-hostel.com"
    },
    {
      "url": "https://portlabelleinn.com/",
      "email": "booking@stmatthewshouse.org"
    }
  ],
  "mails": [
    "booking@stmatthewshouse.org",
    "erin@experiencelabelle.com",
    "hotel-heritage-inn-port-blair-4@hotelsgds.com",
    "hr@team.spruko.com",
    "info-4@hotelsgds.com",
    "info@coffee-inn-hostel.com",
    "legaldept@team.spruko.com",
    "sales@team.spruko.com",
    "stephanie@experiencelabelle.com"
  ],
  "nombre_sitio": "stmatthewshouse.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://portlabelleinn.com/contact/",
      "text": "Contact Us | Port LaBelle Inn & Conference Center (863) 675-4411 Booking@stmatthewshouse.org 1563 Oxbow Dr. LaBelle Fl 33935 0 Items Home About Us Port LaBelle Inn Catering Booking Contact Us Select Page Contact us We are here to meet your needs. Call or message us with any questions you may have! About us! Name Email Address Phone Number Message What would you like more information on? What would you like more information on? Events Catering Hotel 7 + 15 = Submit Stay Connected! (863) 675-4411 | Booking@stmatthewshouse.org"
    },
    {
      "url": "https://portlabelleinn.com/about/",
      "text": "About Us | Port LaBelle Inn & Conference Center (863) 675-4411 Booking@stmatthewshouse.org 1563 Oxbow Dr. LaBelle Fl 33935 0 Items Home About Us Port LaBelle Inn Catering Booking Contact Us Select Page About US At the Port LaBelle Inn and Conference Center, we focus on the critical details so you are able concentrate on your retreat or conference. The logistics, environment, meals and more will all be managed for you by our professional staff and full-service on-site food & beverage team. Let our catering team execute the work for you so you can focus on the business that matters. Our full-service, on-site, professional F&B team offers a variety of menus to suit your catering needs. From breakfast buffets to prime rib dinners – allow us to custom-build your perfect event.  As always, our catering menus can act as simply a suggestion – we are happy to build a menu to suit your palette. We are a drug and alcohol-free facility. Unfortunately, pets are not accepted. Service animals only. Book Now! Find moments of joy wherever your travels take you! Come visit and stay in our luxurious rooms! Reserve a room! Sprout Catering Established in 2015 as a social enterprise to support the efforts of St. Matthew’s House, Sprout Catering provides the freshest food possible to its catering customers in Southwest Florida. Learn More About Sprout Catering! Events We host events which include weddings, birthday, and business meetings. Check Event Availability! Stay Connected! (863) 675-4411 | Booking@stmatthewshouse.org"
    },
    {
      "url": "https://www.linkedin.com/company/labelle-winery",
      "text": "LaBelle Winery | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now LaBelle Winery Hospitality Amherst, New Hampshire 1,383 followers Offering an Unrivaled NH Winery Experience See jobs Follow Discover all 94 employees Report this company About us Plan your visit to one of our beautiful locations in Amherst or Derry, NH!\n\nExperience our state-of-the-art, award-winning winery in Amherst and enjoy a fun, educational and relaxed visit.  Whether you join us for a wine tasting & tour, view our fine art gallery, shop in our Wine and Gift Shop or dine in our Bistro restaurant, we're sure you'll enjoy every moment of your time with us.  Sign up for an enrichment program such as yoga or wine and culinary classes (to name a few) that will enhance your visit.  LaBelle Amherst is home to an event center for hosting private corporate, social or non-profit events.\n\nPlan a day at LaBelle Derry, our newest location. In addition to an event center and Americus Restaurant, our Derry property features a beautiful 9-hole par-3 golf course and miniature golf course. Stop by LaBelle Market for delicious coffee, homemade pastries, delicious food on-the-go, snacks and more; plus all of our wine and The Winemaker's Kitchen culinary line for shopping.\n\nLaBelle Winery consistently receives the awarded distinction of Best New Hampshire Winery; Best Tasting Room; Best Local Winery and Vineyard; and Best Wine Selection, year after year by numerous independent polls.  TripAdvisor has awarded LaBelle Winery the Certificate of Excellence and Open Table's Diners' Choice Award for The Bistro.  All ages are welcome, as well as dogs on our outdoor spaces in Amherst and Derry (including outdoor dining).\n\nVisit our website for the most current hours of operation in each location, as well as directions. Website http://www.labellewinery.com External link for LaBelle Winery Industry Hospitality Company size 51-200 employees Headquarters Amherst, New Hampshire Type Privately Held Founded 2005 Specialties Wine, Restaurant, Private Events, Wine Tasting Room, Retail & Gift Shop, Weddings, Winery, Golf Course, Miniature Golf, Vineyard, and Corporate Events Locations Primary 345 Route 101 Amherst, New Hampshire 03031, US Get directions 14 NH-111 Derry, New Hampshire 03038, US Get directions Employees at LaBelle Winery Danielle Mojonnier Program Manager Marti Woodmansee La Belle Winery / President joe guarino Chef de cuisine at Labelle winery. I run all culinary operations Michelle Thornton See all employees Updates LaBelle Winery 1,383 followers 7mo Report this post Want to WOW your hardworking team members? Book your next corporate and non-profit event at LaBelle Winery! 😁🍷 Choose from various event packages and activities like golf & mini golf events, outdoor summer outings, fundraisers, and so much more.\n\nContact Stephanie Fournier at stephanie@experiencelabelle.com for more information and start planning your event with us today!\n\nCheck out our full list of programs via the link below: https://lnkd.in/g3SKDfqF 8 Like Comment Share LaBelle Winery 1,383 followers 1w Report this post LaBelle Lights is back for its fifth season beginning November 14th! ✨ With over 1,000,000 sparkling lights and whimsical winter-themed displays, this holiday tradition draws families and friends from across New England. Sponsorship opportunities give your business the chance to shine with logo placement, social media shoutouts, on-site signage, and more. Join us and connect with thousands of visitors, offering great visibility for your business. \n\nTo learn more, email Erin Fitzgerald Rock at Erin@experiencelabelle.com , or view our available sponsorship packages here: https://lnkd.in/emMN--3V 6 Like Comment Share LaBelle Winery 1,383 followers 1mo Report this post Join a supportive and friendly team at LaBelle Winery! 🍽️ We're hiring full-time and part-time Dishwashers at our Derry, NH location. Enjoy competitive pay, great benefits, and a welcoming work environment!\n\nLearn more & apply now on our website: https://lnkd.in/e-ifT4AC 8 1 Comment Like Comment Share LaBelle Winery 1,383 followers 1mo Report this post ✨ Looking to build visibility, increase engagement, or align your brand with a beloved holiday tradition? Partner with LaBelle Lights and make a lasting impression this season!\nLaBelle Lights returns for the 2025-2026 season with over 1 million lights in stunning winter displays, and an atmosphere that draws more than 70,000 visitors each year. Sponsorship benefits include logo placement, on-site signage, social media features, and more - putting your business in front of engaged guests who value community and memorable experiences!\n\nVisit our website to learn more & inquire! https://lnkd.in/eAe985ie 1 Like Comment Share LaBelle Winery reposted this Stephanie Fournier Experienced Hospitality & Non‑Profit Event Specialist| Open to New Hospitality Leadership Roles 1mo Report this post What an awesome day at LaBelle Winery SummerFest! \n\nA huge thank you to everyone who helped make it such a fun and memorable event. We had live music, lawn games, amazing local vendors, delicious food and drinks, and tons of activities for families.\n\nI reached out and asked for support from some of my favorite businesses and groups in the New Hampshire community for this fun, free event—and wow, did you all come through. I’m so grateful!\n\nSpecial shoutouts to:\n 🥄 Stonyfield for the yummy yogurt samples (kids and adults alike loved them!)\n 🏀 Dick’s House of Sport & 🎯 YMCA of Greater Londonderry for keeping the fun going with awesome games \n 🚒 Derry Fire Department for bringing the fire truck for a hit Touch-a-Truck experience\n 👋 NH Granite State Ambassadors for being the perfect team to welcome our guests with warm smiles Kelly Bryer ⚾️ New Hampshire Fisher Cats and the one-and-only Fungo for visiting and snapping pics with guests (I might be biased, but he’s the BEST mascot around!) Sydney Peterson, M.S. And to our incredible LaBelle team—you truly went above and beyond. With this being our first-ever SummerFest, your hard work, energy, and teamwork made it all come together. So proud of what we accomplished! Especially our \"SummerFest Captain\", Danielle Mojonnier , you absolutely crushed it and made SummerFest unforgettable! \n\nThanks to everyone who came out—we loved celebrating with you and can’t wait to see you back again at LaBelle Winery soon! #LaBelleWinery #SummerFest #OneLaBelle #NewHampshireEvents #CommunitySupport 22 5 Comments Like Comment Share LaBelle Winery 1,383 followers 1mo Report this post The holidays will be here before you know it! 💫 Book your company party or gathering at LaBelle Winery before October 31st and receive complimentary holiday-themed centerpieces for your event. With planning support, on-site catering, and day-of coordination, we make hosting feel effortless. And if you're celebrating at our Derry location, you can add in a magical stroll through LaBelle Lights for your guests! \n\nLet us help you create a celebration to remember - inquire with Stephanie Fournier for promotion details or submit an event inquiry form here: https://lnkd.in/etcXnqBj 6 Like Comment Share LaBelle Winery 1,383 followers 2mo Report this post Dinner, a show, and a magical light experience, all in one night! ✨ Host your company’s holiday outing with a group dinner at Americus or The Bistro, followed by a LaBelle Winery performance, and receive complimentary tickets to LaBelle Lights for your group.\n\nTo learn more and book your outing, contact Stephanie Fournier at stephanie@experiencelabelle.com . We look forward to hosting you! 3 Like Comment Share LaBelle Winery 1,383 followers 2mo Report this post We’re thrilled to share that LaBelle Winery has earned top honors in the 2025 New Hampshire Union Leader Readers’ Choice Awards! \n\nA huge congratulations to our Executive Chef, Justin Bernatchez, who was named Best NH Chef for the second year in a row — a well-deserved recognition of his leadership and culinary excellence at Americus, The Bistro, and our events.\nWe’re also honored to be voted:\n🥇 Best NH Vineyard/Winery\n🥇 Best Wine Bar\n🥈 Best NH Wedding Venue\n🥈 Best Banquet/Event Facility\nThank you to everyone who voted and continues to support what we do — your recognition means the world to us! \n\nPhotographers- \nGenevieve Photography\nMarina Zinovyeva Photography LLC +1 18 4 Comments Like Comment Share LaBelle Winery 1,383 followers 2mo Report this post We’re proud to share that our Amherst Vineyard Estate White has been named one of Visit NH’s Top 10 Summer Wines of the season!\nCrafted by Winemakers Amy LaBelle and Melaney Shepard using grapes harvested from The Vineyards at LaBelle Winery in Amherst, this limited-release wine is a seasonal favorite. Its fresh, crisp, and beautifully balanced profile makes it a perfect pairing for seafood, salads, and summer gatherings.\nExplore more about this wine and our vineyards at https://labellewinery.com/ 11 2 Comments Like Comment Share LaBelle Winery 1,383 followers 2mo Report this post Join a creative and supportive team by working at LaBelle Winery! 🧑🍳 We're hiring for Sous Chefs and Line Cooks to join our Amherst and Derry restaurant teams. Enjoy competitive pay, great benefits, and a welcoming atmosphere!\nLearn more & apply now on our website: https://lnkd.in/e-ifT4AC 7 2 Comments Like Comment Share Join now to see what you are missing Find people you know at LaBelle Winery Browse recommended jobs for you View all updates, news, and articles Join now Similar pages The Bedford Village Inn Hospitality Bedford, NH Zorvino Vineyards Hospitality Sandown, New Hampshire RiverWoods Hospitals and Health Care Exeter, New Hampshire Greater Manchester Chamber - NH Non-profit Organizations Manchester, New Hampshire Exeter Hospital Hospitals and Health Care Exeter, NH Opus One Winery LLC Wine & Spirits Oakville, CA Lindt & Sprüngli USA Manufacturing Stratham, New Hampshire Greater Concord Chamber of Commerce (NH) Non-profit Organizations Concord, NH Renault Winery Resort Hospitality Egg Harbor City, NJ Tri Sigma National Sorority Higher Education Chapel Hill, North Carolina Show more similar pages Show fewer similar pages Browse jobs Antenna Engineer jobs 1,585 open jobs Culinary Instructor jobs 32,153 open jobs Assistant jobs 711,811 open jobs Event Manager jobs 35,306 open jobs Facilities Manager jobs 75,132 open jobs Yield Engineer jobs 9,445 open jobs Copy Director jobs 2,705 open jobs Relocation Specialist jobs 38,730 open jobs Urban Designer jobs 64,196 open jobs Nursing Manager jobs 208,594 open jobs Project Superintendent jobs 97,078 open jobs Delivery Specialist jobs 107,168 open jobs Clinic Manager jobs 32,395 open jobs Clinical Project Manager jobs 11,297 open jobs Behavior Analyst jobs 12,694 open jobs Clinical Manager jobs 86,720 open jobs Clinical Director jobs 49,336 open jobs Registered Nurse jobs 466,098 open jobs Maintenance Supervisor jobs 89,378 open jobs Scheduler jobs 29,009 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Computer Aided Design Drafter jobs Mechanical Designer jobs Computer Numerical Control Operator jobs Surveyor jobs Production Supervisor jobs Quality Engineer jobs Design Engineer jobs Designer jobs Analyst jobs Director of Event Operations jobs Culinary Instructor jobs Courier jobs Assistant jobs Plant Controller jobs Plant Manager jobs Graphic Designer jobs Controller jobs Manager jobs Engineer jobs Event Assistant jobs Operations Assistant jobs Event Planner jobs Event Manager jobs Sales Manager jobs Human Resources Specialist jobs Food Server jobs Hunter jobs Marketing Specialist jobs Associate Director of Operations jobs Coordinator jobs Producer jobs Facilities Technician jobs Facilities Manager jobs Director jobs Intern jobs Project Manager jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at LaBelle Winery Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://demo.spruko.com/website/contact-us.html",
      "text": "Contact Us - Spruko Technologies | Get in Touch with Us Today sales@team.spruko.com +91 888-613-3855 | +91 888-613-3955 Home IT Services Business Consulting Company About Us Careers Why Choose Us? Events Technology Web Technologies PHP Laravel Codeigniter Combined Shape Cake PHP Node.js Frontend Technologies React JS Angular JS Next JS JavaScript Typescript Vue JS Nuxt JS Svelte Backend Technologies Node.js PHP ASP.NET Microsoft Technologies ASP.NET Core & MVC Blazor Frameworks Bootstrap Tailwind Django Laravel Flask Symfony Ready to take your business to the next level? Contact us today and let's build the future together. Contact Us Products Web Applications Innovative software solutions to boost productivity and streamline your operations. Dashboard Templates Customizable templates for quick, professional designs and creative projects. Explore our successful projects Showcasing our successful projects and client solutions. View Portfolio Introducing LivaChat LivaChat, our latest live chat solution for seamless communication. View Details Hosting Shared Hosting Linux Shared Hosting WordPress Hosting Windows Shared Hosting Hosting Servers Linux KVM VPS Dedicated Servers Windows Dedicated Servers Reseller Hosting Linux Reseller Hosting Windows Reseller Hosting Cloud Hosting Cloud Hosting Security SSL Certificates SiteLock Malware Detector Domain Register a Domain Hosting Starter Combo Choose your bundle & be on your way View Combo Offers Email & Productivity : Business Email Google Workspace Enterprise Email Titan Business Email Grow your business with our private-labeled services Join Reseller Program Services Development Web Development Custom Software Development SaaS Product Development API Development and Integration Custom CRM Development Custom E-commerce Development Educational Technology (EdTech) Development Healthcare Software Development AI Integration Services Chatbot Services Whatâs App Business API Services Digital Marketing Social Media marketing Content Marketing on Social platforms Meta Ads/ Paid Marketing Search Engine optimization Generative content optimization Google Analytics Search and Display Ads Performance Marketing Remarketing & Retargeting Ads Branding Brand Nomenclature Logo design and Brand story Brand Guidelines Collateral designs and Branding Brand Identity designs Iconography and Visual identity Other Services Technology Consulting UI/UX Design UI/UX Consulting Technical Support Installation Services Hosting Services Domain Registration Contact Us Request Quote Contact Us Get in Touch Seeking innovative solutions, exciting opportunities, or a trusted digital partner? You've found the right place. Reach out to us, and our dedicated team will address all your inquiries. To kickstart the conversation, simply share your details with us, and weâll respond promptly to help you explore. Pre-Sales Expert advice before you buy sales@team.spruko.com Support Mon-Fri from 10am to 5pm. https://support.spruko.com Careers Mon-Fri from 10am to 5pm. hr@team.spruko.com Legal Business protection and compliance. legaldept@team.spruko.com Sales Contact Quick help, just a call away. +91 888â613â3855 , +91 888â613â3955 Contact Lets get in touch You can reach us anytime via https://support.spruko.com First Name Last Name Email Phone Number Country Message You agree to our terms and conditions. Get Started 7+ Years Field Experience 200+ Projects Done Around World 24/7 Customer support +20K Happy customers 1 Day Response Time Visit our office SPRUKO TECHNOLOGIES PRIVATE LIMITED\n                                Hyderabad Corporate Office : H.NO.1, LIG 215, 8-67/83, near Tulasi Hospitals Ecil, APIIC Colony, Kushaiguda,Telangana, Hyderabad â 500062. India. Support: Email: support@team.spruko.com Mobile : +91 888-613-3855 Mobile : +91 888-613-3955 Phone: 040 2712 2233 Pre Sales: Email: sales@team.spruko.com Mobile : +91 888-613-3855 Mobile : +91 888-613-3955 Phone: 040 2712 2233 We offer the expertise and strategic guidance to drive your business forward and achieve sustained growth. Get Started Embark on your next big success Our Team is ready to provide tailored strategies to accelerate your business growth. Get an appointment now 1 Day Response Time 100% Client Satisfaction 7+ Years Field Experience Services Development Digital Marketing Branding Hosting Company About Us Why Choose Us? Careers Events Products Uhelp LivaChat Primo Slider SPK Editor Legal Licenses License Faq's Terms & Conditions Privacy Policy Phone +91 888-613-3855 +91 888-613-3955 Mail support@team.spruko.com sales@team.spruko.com © 2024 All rights reserved by Spruko Technologies Private Limited"
    },
    {
      "url": "https://hotel-heritage-inn-port-blair.hotelsgds.com/contact-us/",
      "text": "Reach Us at Hotel Heritage Inn Port Blair Port Blair India for Bookings Asia Hotels and Resorts 📞+917303231118 Hotel Heritage Inn Port Blair Toggle navigation Home About Hotel About Us Amenities Restaurants Rooms Tariffs Packages Photos Contact Us Contacts Home Contacts Welcome to Asia Hotels and Resorts, India Hotel Name: Hotel Heritage Inn Port Blair Address: Pahargaon, Port Blair, Andaman and Nicobar Islands 744103 For Enquiry and Booking Contact Asia Hotels and Resorts 2nd Floor, Plot No 921, Gali No 1, Mahipalpur Bypass, Near Water Booster, Mahipalpur, New Delhi 110037,India info-4@hotelsgds.com +917303231118 Fill below form for Enquiry Check in Check out Name Email Mobile no. Adults 1 2 3 4 5 6 7 8 8+ Kids 0 1 2 3 4 4+ Requirement Hotel Heritage Inn Port Blair Get in touch at Port Blair, Hotel Heritage Inn Port Blair, on the contact no. given at website. Hotel Heritage Inn Port Blair provides online booking rooms from anywhere.  Port Blair, Hotel Heritage Inn Port Blair has round the clock active contact number. Location: Pahargaon, Port Blair, Andaman and Nicobar Islands 744103 For Enquiry and Booking Contact Asia Hotels and Resorts 2nd Floor, Plot No 921, Gali No 1, Mahipalpur Bypass, Near Water Booster, Mahipalpur, New Delhi 110037,India Our Other Hotels || Hotel Heritage Inn Port Blair at Port Blair | Banquets in Hotel Heritage Inn Port Blair Port Blair | Book Hotel Heritage Inn Port Blair in Port Blair | Hotel in Port Blair Tariff || This website managed by Asia Hotels and Resorts not from Hotel Heritage Inn Port Blair. Home About us Policies Terms and Conditions Sitemap Contact Us"
    },
    {
      "url": "https://coffee-inn-hostel.com/contact-us/",
      "text": "Contact us - Coffee Inn Hostel Skip to content Homepage Link Open Mobile Menu Homepage Link Home Rooms Private Room Family Room Multi-Bed room Female Dorms Groups The Coffee & Bar Contact us Deutsch Book Home Rooms Private Room Family Room Multi-Bed room Female Dorms The Coffee & Bar Groups Contact us Deutsch Book Get in touch with Coffee Inn Hostel! Get in touch with Coffee Inn Hostel! We are delighted to welcome you in Berlin-Schöneberg ADDRESS Pallasstrasse 35, 10781 Berlin, Germany RECEPTION EMAIL info@coffee-inn-hostel.com BOOKING EMAIL info@coffee-inn-hostel.com PHONE +49 173 7096087 For more information about our facilities or services please contact us via phone or email and we will get back to you within 24 hours. For group booking request (more than 10 people), please use the form in our Groups page. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. NAME * EMAIL * MESSAGE POLICY CONSENT MESSAGE * PRIVACY POLICY CONSENT * By submitting the form you consent to our privacy policy. I agree that my details from the contact form will be collected and processed to answer my request. The data will be deleted after your request has been processed. Note: You can revoke your consent at any time for the future by sending an email to info@coffee-inn-hostel.com. You can find detailed information on handling user data in our data protection declaration . Submit Experience the City in another way Enjoy Berlin! Enjoy Coffee Inn Hostel! Book now Pallasstraße 35 10781 Berlin GERMANY Tel. +49 173 7096087 info@coffee-inn-hostel.com Navigation Home Rooms The Coffee & Bar Groups Contact us The Coffee Inn Hostel Song Booking Deutsch LEGAL Imprint GTC Privacy policy All rights reserved. 2025 © by COFFEE INN HOSTEL in Berlin"
    },
    {
      "url": "https://portlabelleinn.com/",
      "text": "Port LaBelle Inn & Conference Center | Hotel & Conference Center (863) 675-4411 Booking@stmatthewshouse.org 1563 Oxbow Dr. LaBelle Fl 33935 0 Items Home About Us Port LaBelle Inn Catering Booking Contact Us Select Page The Port LaBelle Inn and Conference Center is nestled in historic LaBelle , with restaurants, golfing, shopping and much more. Guests will enjoy spacious rooms with free WiFi, an outdoor pool, and sports courts on property. More About Us! We’re Under Renovation to Serve You Better! The Port LaBelle Inn is currently closed for renovations as we make exciting upgrades to enhance your future stay. We are not accepting new reservations at this time. Thank you for your patience and support as we invest in a refreshed guest experience. We can’t wait to welcome you back soon with improved amenities and upgraded comfort. Stay tuned for updates and reopening dates. For inquiries, please contact us at 863-675-4411. Pool Come swim in beautiful Florida weather as you get that perfect tan! Outdoor Activities We offer numerous outdoor activities that includes tennis courts, volleyball, basketball, and canoeing. Learn More! Beautiful Views Wake up to an amazing view out your hotel room window. How May We Help You? Name Email Address Phone Number Message 3 + 12 = Submit Stay Connected! (863) 675-4411 | Booking@stmatthewshouse.org"
    }
  ]
}