{
  "fuentes": [
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.visitnapavalley.com/about-us/our-board/",
      "email": "concierge@visitnapavalley.com"
    },
    {
      "url": "https://www.themanortavern.com/about",
      "email": "info@manortavern.com"
    },
    {
      "url": "https://www.themanortavern.com/about",
      "email": "jerryedwards@chefsexpressions.com"
    },
    {
      "url": "https://www.linkedin.com/company/streamsongresort",
      "email": "craig.falanga@streamsongresort.com"
    },
    {
      "url": "https://www.linkedin.com/company/streamsongresort",
      "email": "taryn.parker@kemperlesnik.com"
    },
    {
      "url": "https://www.linkedin.com/company/streamsongresort",
      "email": "ncraig.falanga@streamsongresort.com"
    },
    {
      "url": "https://www.linkedin.com/company/streamsongresort",
      "email": "ntaryn.parker@kemperlesnik.com"
    },
    {
      "url": "https://blinkerstavern.com/contact-us",
      "email": "sebastian@aldusleaf.org"
    },
    {
      "url": "https://blinkerstavern.com/contact-us",
      "email": "svolpenhein@blinkerstavern.com"
    }
  ],
  "mails": [
    "concierge@visitnapavalley.com",
    "craig.falanga@streamsongresort.com",
    "info@inzmo.com",
    "info@manortavern.com",
    "jerryedwards@chefsexpressions.com",
    "ncraig.falanga@streamsongresort.com",
    "ntaryn.parker@kemperlesnik.com",
    "sebastian@aldusleaf.org",
    "svolpenhein@blinkerstavern.com",
    "taryn.parker@kemperlesnik.com"
  ],
  "nombre_sitio": "streamsongresort.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.visitnapavalley.com/about-us/our-board/",
      "text": "Visit Napa Valley Board of Directors | Member Details Skip to main content Weddings Weddings Venues Wedding Planning Assistance Proposals Bachelor & Bachelorette Parties Honeymoons Gift Ideas Marriage Licenses FAQs Meetings Meetings Request for Proposal Meetings & Event Venues Meeting Planning & Resources Group Experiences Sales Contacts Meeting Planner Tools Group Offers Travel Trade Travel Trade Planning Toolkit What's New in Napa Valley Contact Us Napa Valley Destination Training Press Press Room Press Releases Blogger Assistance Form Media Assistance Form Image Gallery Filming in Napa Valley Research What's New in Napa Valley About Us About Visit Napa Valley Our Board Our Staff Careers Research & Statistics In Our Community The Napa Valley TID Contact Us Partners Partners Benefits Join FAQs Calendar Partner Portal Industry Associate Partners Weddings Sure to sweep you off your feet in any season, Napa Valley is the ultimate destination for romance Meetings Visit Napa Valley for the perfect conference, incentive trip, social group event, corporate event or team building meeting. Unique meeting spaces create an inspiring atmosphere. Travel Trade Give Your Clients the Ultimate Napa Valley Experience - information for lodging, wineries, restaurants, arts, transportation, special offers, events and more Press About Us Learn all about Visit Napa Valley the organization, our mission, our strategy, partners and much more while promoting our area as the premier destination it is Partners Weddings Sure to sweep you off your feet in any season, Napa Valley is the ultimate destination for romance Meetings Visit Napa Valley for the perfect conference, incentive trip, social group event, corporate event or team building meeting. Unique meeting spaces create an inspiring atmosphere. Travel Trade Give Your Clients the Ultimate Napa Valley Experience - information for lodging, wineries, restaurants, arts, transportation, special offers, events and more Press About Us Learn all about Visit Napa Valley the organization, our mission, our strategy, partners and much more while promoting our area as the premier destination it is Partners Where To Stay All Lodging Luxury Boutique Inns Hotels Resorts 5-Star Hotels Short Term Rentals Find Your Lodging Personality Special Offers Wineries Wineries Wine Tasting Rooms Winery Map Wine Tours & Transportation Find Your Winery Personality Wine Tasting Tips Wine Shipping Appellations Grape Varieties Restaurants All Restaurants Michelin-Rated Restaurants Coffee Shops, Bakeries & Takeaway Breweries & Cocktail Bars Al Fresco Dining Find Your Dining Personality Things To Do Explore by Towns & Regions Calistoga St. Helena Yountville Napa American Canyon Angwin Lake Berryessa Rutherford Oakville All Things to Do Arts & Culture Bike Tours Golf Hiking Hot Air Balloons Kid Friendly Live Music & Entertainment Outdoors Shopping Spas & Wellness Unique Tours & Tastings Wine & Culinary Classes Things to Do Besides Wine Tasting Trip Ideas & Itineraries Pet Friendly LGBTQ+ Art Lovers Itinerary First Timer's Guide Girls' Getaway Guide Group Itinerary Guys' Getaway Guide Kid-Friendly Itinerary Romance Itinerary Solo Traveler Itinerary Splurge or Save Itinerary Perfectly Packaged Itinerary Special Offers Events Event Calendar Annual Events Festival Napa Valley (Jul. 6–21, 2024) Music in the Vineyards (Aug. 2–25, 2024) Harvest Season (Aug.–Oct.) PGA Tour Procore Championship (Sep.) Holidays in Napa Valley Napa Truffle Festival (Jan.) Restaurant Month (Jan. - Feb.) Napa Lighted Art Festival (Jan.–Feb.) Mustard Season (Jan.–Mar.) Napa Valley Marathon (Mar.) BottleRock Music Festival (May) La Onda Music Festival (May) Auction Napa Valley (Jun.) Napa Valley StreamFest (April) Local Events Submit an Event Maps & Travel Info Getting to Napa Valley Nearby Airports Transportation Where is Napa Valley? Weather Seasons Events & Things to Do this Spring Events & Things to Do this Summer Events & Things to Do this Fall Events & Things to Do this Winter Sustainable Travel Welcome Center Winery Map Zoom Backgrounds Visitor Magazine E-Newsletter Sign Up Where To Stay From intimate boutique inns to full-service luxury resorts, and everything in between, Napa Valley properties welcome you with world-class hospitality. Wineries Napa Valley's deep roots produce world-class wine. Enjoy intimate winery tastings, expansive outdoor spaces, and behind-the-scenes private tours of wine cellars and caves. Restaurants With farm-fresh cuisine ranging from casual food trucks to Michelin-Star fare, you’ll find unforgettable meals to complement our world-class wines around every corner. Things To Do Napa Valley is better than ever, and we’re excited to invite you to explore all that our legendary valley has to offer. Discover hot air balloons, outdoors, shopping, art walks, personal tours, wine & cooking classes, and more. Events From winery parties and winemaker dinners, to concerts and farmers markets – there are so many ways to experience a taste of the good life in Napa Valley wine country Maps & Travel Info Find all the resources you will need to plan a relaxing and fun filled getaway to Napa Valley Where To Stay From intimate boutique inns to full-service luxury resorts, and everything in between, Napa Valley properties welcome you with world-class hospitality. Wineries Napa Valley's deep roots produce world-class wine. Enjoy intimate winery tastings, expansive outdoor spaces, and behind-the-scenes private tours of wine cellars and caves. Restaurants With farm-fresh cuisine ranging from casual food trucks to Michelin-Star fare, you’ll find unforgettable meals to complement our world-class wines around every corner. Things To Do Napa Valley is better than ever, and we’re excited to invite you to explore all that our legendary valley has to offer. Discover hot air balloons, outdoors, shopping, art walks, personal tours, wine & cooking classes, and more. Events From winery parties and winemaker dinners, to concerts and farmers markets – there are so many ways to experience a taste of the good life in Napa Valley wine country Maps & Travel Info Find all the resources you will need to plan a relaxing and fun filled getaway to Napa Valley Clear Your Favorites and Start Over Map Map Request a free copy* of the Napa Valley Visitor Magazine See More About Us Our Board Visit Napa Valley Board of Directors Fiscal Year 2026 Member Affiliation Term Officer Dave Elcon Solage, Auberge Resorts Collection Jun-27 Board Member David Shipman White House Napa Jun-27 Board Member Edward Costa Carneros Resort & Spa Jun-27 Chair Emma Swain St. Supéry Vineyards & Winery Jun-27 Past Chair Heidi Miersemann Alila Napa Valley Jun-28 Board Member Jason Scoggins Latitude 38 Entertainment, BottleRock Napa Valley Jun-27 Board Member Jenny Toomer River Terrace Inn Jun-27 Board Member Jeri Hansen Napa Chamber of Commerce Jun-27 Board Member Joe Leinacker The Meritage Resort and Spa Jun-27 Board Member Linsey Gallagher Visit Napa Valley Board Member Nathan Davis Napa Valley Wine Train Jun-27 Board Member Patrick Egan Boisset Collection Jun-27 Board Member Patrick Nayrolles Meadowood Napa Valley Jun-27 Chair Elect Rachel Wilson Napa Valley Marriott Hotel & Spa Jun-27 Board Member Rick Kaufman Harvest Inn Jun-27 Vice Chair Robby Delaney Four Seasons Napa Valley Jun-27 Board Member Todd Humphries Kitchen Door Jun-28 Board Member Todd Shallan Silverado Resort Jun-27 Secretary/Treasurer Edward Costa General Manager, Carneros Resort & Spa Ed has been Managing Director for Carneros Resort and Spa since 2016 and brings with him more than 35 years of experience in the hospitality industry. He spent many years leading operations for luxury hotels and resorts between Boston and NYC. Ed serves as the General Manager for Carneros Resort and Spa, where he oversees operations for the 28-acre luxury resort and has led the team to numerous awards and accolades during his tenure. Nathan Davis General Manager, Napa Valley Wine Train Before joining the Napa Valley Wine Train in 2021, Nathan served as Managing Director & General Manager at Harvest Inn in St. Helena, and prior to that was the General Manager at the Bodega Bay Lodge of the Woodside Hotel Group. From 2014-2017, he was the Resort Manager for the Silverado Resort and Spa in Napa. Previously, Nathan spent four years with Kimpton Hotels in San Francisco, and eight years with Starwood Hotels and Resorts. Robby Delaney General Manager, Four Seasons Resort and Residences As a San Diego native, Robby Delaney has 16 years in luxury hospitality, all with Four Seasons (San Diego, Denver, Scottsdale, Los Angeles, Seattle, and Maui). He is now the General Manager at the 5 star, 85 room, 20 residence Four Seasons in Calistoga. Patrick Egan Senior Vice President of Marketing & Communications, Boisset Collection Patrick Egan is the Senior Vice President of Marketing & Communications for the Boisset Collection, where he has shaped marketing, e-commerce and communications strategies since joining the company in 2004, including Napa Valley’s Raymond Vineyards, JCB, Oakville Grocery, Chateau Buena Vista, Elizabeth Spencer and the Calistoga Depot. A resident of Napa Valley since 2010, Patrick is an engaged member of the community, and a member of the first cohort of the Napa Valley Vintner’s Napa Leadership program. Dave Elcon General Manager, Solage, Auberge Resorts Collection Dave is the General Manager at Solage Resort where he oversees all facets of the 22 acre luxury property.  He previously served as the opening General Manager of The Inn at Mattei’s Tavern, an Auberge property located in Santa Barbara wine country.  With over 20 years of luxury hospitality experience, Dave has a proven track record of building exceptional teams that have garnered countless awards and accolades under his leadership. He has been with Auberge Resorts for the past 6 years and is passionate about contributing to the success of the Napa Valley. Linsey Gallagher President & CEO, Visit Napa Valley Linsey Gallagher is President and CEO of Visit Napa Valley (VNV), the official destination management organization for Napa County. VNV promotes the region as an attractive travel destination and enhances its reputation as a dynamic place to visit, live and work. Linsey serves on the Board of Directors of US Travel, CalTravel, and Visit California. Previously, she spent 10 years working at Wine Institute as Vice President of International Marketing, leading the California Wine Export Program with programs in more than 25 countries worldwide. She has also worked for E&J Gallo Winery, NBC TODAY Show, and GE Capital Services. Jeri Hansen President & CEO, Napa Chamber of Commerce Jeri Hansen joined the Napa Chamber of Commerce as President & CEO in January 2023. She was Principal at Jeri Hansen Company, specializing in community engagement, public policy, and strategic planning. Previous to starting her own firm in 2020, Jeri was CEO of Sustainable Napa County and was a member of the Napa County Planning Commission. She was appointed by Governor Jerry Brown to the Napa Valley Exposition (25th District Agricultural Association) Board of Directors in 2014 and is currently President of the Board. Rick Kaufman Owner, Harvest Inn Rick Kaufman, the founder of City-Core Development, Inc., has enjoyed a 30-year journey in commercial real estate investment, with a keen focus on successful planning and development. His diverse projects include the conversion of former shipyards, redevelopment of food factories, and a special dedication to hotels. In the Napa Valley, Rick is an owner of the Harvest Inn in St. Helena and the Old Soda Springs Winery. Joe Leinacker Managing Director, The Meritage Resort and Spa Joe Leinacker has been the Managing Director of The Meritage Resort, Vista Collina Resort, and Vino Bello Resort since 2020.  Before moving to Napa, Joe served as the General Manager of the award winning Pasea Hotel & Spa in Huntington Beach, CA.  Originally from Topeka, KS, Joe enjoys playing golf, dinner and drinks with friends, and spending time with his two dogs Willow and Miley Cyrus. Patrick Nayrolles General Manager, Meadowood Napa Valley As general manager of Meadowood Napa Valley, Patrick Nayrolles is the consummate host with his pulse on the day-to-day operations and guest relations of the historic estate. With a hospitality pedigree and a resume that includes overseeing some of the finest hotels and resorts worldwide, Patrick began his tenure as Meadowood’s general manager in 2015, a position his father held from 1986 to 1994. Jason Scoggins Co-founder & Partner, Latitude 38 Entertainment In 2001 Jason co-founded Jumpstart Automotive Media a vertical advertising network focused on the automotive industry and served as chief partnership officer until the company was acquired in 2007 by Hachette Filipacchi Media U.S., a Lagardere subsidiary, which owns the Car and Driver, Road & Track and Cycle World brands.  He was also an early employee at consumer Internet startup OpenAuto.com and AutoWeb.com. Jason co-founded Latitude 38 Entertainment (L38), a premium entertainment company located in the Napa Valley, producing world-class events including BottleRock Napa Valley. Jason holds a BA from Arizona State University. Jason was born, raised in Napa and currently lives in Yountville. Todd Shallan Vice President & Managing Director, Silverado Resort Todd Shallan is the Vice President and Managing Director of Silverado Resort, where he oversees all aspects of the resort, club, and spa operations. He previously served as Chief Operating Officer, Hospitality Division, at Alterra Mountain Company, where he was responsible for the overall operations of lodging, food & beverage, clubs, golf and retail for the 15 owned resorts in the company. He brings 40 years of resort, hospitality, and recreation industry experience from roles in housekeeping, front desk, guest services, restaurants, banquets, convention services and group sales at an extensive list of prestigious properties, including the St. Francis Hotel in San Francisco, Ritz- Carlton in Palm Springs and The Boca Raton Resort and Club in South Florida. David Shipman General Manager, White House Napa David R. Shipman, General Manager of The Citizen Hotel, an Autograph Collection Hotel in Sacramento, California, and the White House Inn in Napa, California is a well-respected “progressive” hospitality executive, with more than 25 years of luxury hotel expertise. Mr. Shipman has made his mark in several management positions, working at the luxury Auberge Du Soleil in Rutherford, California, and at the Ritz-Carlton Hotel Company in Aspen, Colorado.  In 1998, Shipman joined the opening team of Villagio Inn & Spa and Vintage Inn. Until 2013, Shipman held the role of Managing Director.  In 2016, Shipman was pre-opening General Manager of Las Alcobas a Luxury Collection Hotel in St Helena California.  A native of Washington State, Mr. Shipman has shown leadership abilities and expertise in developing and implementing strategic plans for hotel openings, re-structuring hotel operations, and ownership and guest relations, and has paved the way for highly successful property positioning and team building. Emma Swain CEO, St. Supéry Estate Vineyards and Winery Emma Swain, CEO of St. Supéry Estate Vineyards and Winery has worked in the wine industry for more than 20 years. Emma started in finance, before joining St. Supéry Estate Vineyards and Winery and became CEO in 2009. Emma is a past chair and currently serves on the Board for the Wine Market Council, and is a past board chair of the Napa Valley Vintners. Jenny Toomer General Manager, River Terrace Inn With over 25 years in the hospitality industry Jenny’s first hotel was at the Fairmont Hotel in San Francisco.  After spending 12 years in the city, working as a Sales & Marketing Leader, primarily with Kimpton Hotels,  she moved to Napa in 2011 to work in wine tourism and fell in love with hospitality even more. Through volunteer involvements with Festival Napa Valley, Jameson Animal Rescue and Auction Napa Valley she became deeply invested in the success of the valley. Today she continues to participate in key efforts that help support keeping the valley such a special place, along with making it a premier destination for visitors and for the community who is lucky enough to call it home. Rachel Wilson General Manager, Napa Valley Marriott Hotel & Spa Rachel Wilson is currently the General Manager for the Napa Valley Marriott Hotel and Spa, a beautiful 275 room property right off highway 29. A great location allowing guests to explore the Napa Valley and Sonoma with ease. Previously, Wilson lead The Source Hotel and Market Hall located in the RINO area in Denver, CO. Wilson joined the Sage Independent Collection in July 2021 in the role of Hotel General Manager for The Hotel Zags Portland. Prior to joining the Sage family, Wilson held multiple positions with Kimpton Hotels & Restaurants, including serving as General Manager for Oregon’s Hotel Vintage Portland. In this role, she won Best Director of 2020 from the Pebblebrook Hotel's Annual Pebby Awards, raised the guest satisfaction scores to reflect the hotel's exceptional service, and created a workplace culture that allowed its staff to learn and grow. Wilson is a graduate of California State University Channel Islands. BOOK YOUR STAY Location American Canyon Calistoga Napa St. Helena Yountville Search BOUTIQUE INNS Nestled among rolling hills, charming neighborhoods, and storied vineyards are the most charming boutique inns HOTELS From impeccable design to lavish landscapes, Napa Valley hotels have the creature comforts and amenities for you and your loved ones RESORTS A wonderland for grown-ups, Napa Valley resorts cater to outdoor and fitness enthusiasts, bon vivants and those seeking serenity Need more travel planning tips or recommendations for your Napa Valley trip? Email Us for Tips Be inspired year-round. Sign-up for our bi-monthly newsletter to get insider tips, travel inspiration and upcoming events Sign-up for the Newsletter Looking for more Napa Valley inspiration? You can request a free copy* of the Napa Valley Visitor Magazine Get your free copy VISIT NAPA VALLEY 1001 Second Street, Suite 330 Napa, CA 94559 (707) 226-5813 NAPA VALLEY WELCOME CENTER 1300 1st St #313 Napa, CA 94559 (707) 251-5895 | (855) 847-6272 © 2025 Visit Napa Valley Sitemap Privacy Policy Accessibility Blog © 2025 Visit Napa Valley E-Newsletter Sign Up Let us inspire you Subscribe to our bi-monthly e-newsletter to get Napa Valley insider tips, travel inspiration and upcoming event information. Sign Up View our Privacy Policy for details on use and storage of your personal data No Thanks Cookies are used for measurement, ads, and optimization. By continuing to use our site you agree to our privacy policy . Accept"
    },
    {
      "url": "https://www.themanortavern.com/about",
      "text": "About — MANOR TAVERN Menus About Catering and Events Reservations Gift Cards Contact Back Lunch Dinner Dessert Brunch Bar Menu Wine Bottle List Wine by the Glass Specialty Cocktails WEEKLY SPECIALS Back Manor Events & Wine Suppers Catering at Manor Tavern Catering Off Premise Menus Lunch Dinner Dessert Brunch Bar Menu Wine Bottle List Wine by the Glass Specialty Cocktails WEEKLY SPECIALS About Catering and Events Manor Events & Wine Suppers Catering at Manor Tavern Catering Off Premise Reservations Gift Cards Contact THE HISTORY Come Out to the Country, We’re Worth the Drive The Manor Tavern is a picturesque, 267 year old property dating back to the time of George Washington and is said to have housed the first president’s horse on occasion. In fact, the area began as a stable and over the years had evolved into a blacksmith shop, a general store and a saloon. Our logo, inclusive of a horse, is a hat tip to our historic roots here in Monkton. Today, it’s a country oasis in the heart of steeplechase land where friends and family gather for delectable food and exquisite service. Like our history here in Maryland, our patrons are loyal and longstanding. We value the relationships we have cultivated with all of you year after year. FARM-TO-TABLE At the Manor Tavern, taste is everything. Our grounds allow us to control all aspects of the growing process from our farm to your table. We are always open to suggestions so share with us any specific herbs or produce you’d like to see in our garden. Optimal Freshness Our produce is generally harvested when we need it. When a fruit or vegetable is given the time to completely ripen, it fully develops and retains its vitamins and minerals, giving it a more vibrant flavor and maximizing the nutritional content. Our large variety of items have a longer time to ripen “on the vine” ultimately eliminating travel time and processing and optimizing the taste and texture of our food. Community Each item that we grow has its own unique story. Growing and buying locally means you are supporting the family farmers and ranchers that raised your food. Connecting to the sources is a very meaningful part of the overall experience. Our selection of available produce changes weekly, dependent upon what is readily available in our area. This allows us to deliver items when they are at their peak, are most abundant, and in the case of farmers markets, least expensive. Managing Partner, The Manor Group Jerry Edwards, CPCE Founder of Chef’s Expressions at the Manor, NACE Hall of Fame Inductee, Hospitality Industry Icon Award Winner From 1981 to 2020, Jerry was Founder and Owner of Chef’s Expressions Catering and Events, which has twice been named The National Catering Company of the Year. Jerry holds an honorary doctorate in hospitality. In 2008, he was inducted into the NACE Hall of Fame. In 2015, Jerry was honored as a National Industry Icon by the hospitality community. He has won over 50 industry competitions including Baltimore’s Best Crab Soup, three ACF Gold Medals, the “Best Chef” for the Meals on Wheels Culinary Extravaganza, The Crystal Toque Award in the Nation’s Capitol, The Special Event Award for best event, Baltimore’s “Iron Chef” competition and the Mid-Atlantic Taste of Elegance competition. Today, Jerry leads the team of professionals at The Manor Tavern.  These outstanding individuals include Alicia Strawderman, Director of Chef’s Expressions at The Manor, Luis Banegas, Manor Tavern Restaurant Manager, Zoltan Dober-Huang and Executive Chef Sebastien Lemarre. Our team is here to serve you and create an unparalleled experience. Restaurant Manager, The Manor Tavern Luis Banegas Luis began his career with Chef’s Expressions in 1997. His infectious smile and dedication to serving guests quickly propelled him to become the top catering manager. He later managed the Chef’s Expressions operations team for over 10 years, honing his skills in leadership and customer service. With extensive experience in fine dining and exceptional hospitality, Luis is now the perfect choice to manage The Manor Tavern. This storied restaurant has undergone a renaissance under a new management team, bringing fresh enthusiasm and innovative ideas to the Tavern. Be sure to stop in and see Luis or Assistant Manager/ Sommelier Zoltan Dober -Huang, soon. Their warm welcome and exceptional service are sure to enhance your dining experience. Executive Chef, The Manor Tavern Restaurant Sebastien Lemarre Chef Sebastien brings a wealth of culinary expertise and leadership to The Manor Tavern, elevating its dining and catering experiences. With a distinguished career as both a Chef and Culinary Instructor, Sebastien has seamlessly integrated into The Manor Tavern team, sharing his knowledge in culinary arts and management. Under his leadership, he has built a talented team of chefs and cooks dedicated to delivering some of the finest restaurant and catering cuisine in the region. His impressive résumé includes serving as Executive Chef at Hunt Valley Country Club and contributing to World Central Kitchen as Director of Relief Training and Director of Culinary Training. His passion for culinary education has also been a significant asset to The Manor Tavern. He previously held roles as Culinary Arts Instructor and Coordinator in Mayagüez, as well as Culinary Arts Academy Director at Escuela Hotelera de San Juan. Sebastien’s dedication to culinary excellence and mentorship continues to shape and strengthen The Manor Tavern’s culinary offerings. Assistant Manager, The Manor Tavern Zoltan Dober - Huang Zoltán was born in Budapest, Hungary, and raised in San Jose, California. A recent Maryland transplant, he’s eager to explore everything the Chesapeake Bay State has to offer. With extensive experience in every Front of House role, Zoltán brings a deep understanding of hospitality to his managerial responsibilities. Having lived in California’s renowned wine regions, he developed a passion for winemaking and tasting, which he now shares as the leader of The Manor Tavern’s wine education program. He also curates weekly wine initiatives, including complimentary tastings and wine-by-the-glass specials, to enhance the guest experience. Zoltán’s ultimate dream is to own a chic cocktail and wine club featuring live jazz every night. In the meantime, he’s dedicated to bringing that same energy and creativity to The Manor Tavern. 410.771.8155 info@manortavern.com Hours VISIT US HOURS 15819 Old York Rd. Monkton, MD, 21111 410.771.8155 Inquiries RESTAURANT HOURS Lunch - 11:00-4:00 Wednesday to Saturday Dinner - Tuesday to Saturday 4:00-9:00 (last seating) Sunday Brunch - 11:00-3:00 Sunday Dinner - 3:00 - 8:00 BAR HOURS Tuesday open 4:00 until 9:00 Wednesday, Thursday open until 10:00 Friday and Saturday open until 11:00 Sunday open until 9:00"
    },
    {
      "url": "https://www.linkedin.com/company/streamsongresort",
      "text": "Streamsong Resort | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Streamsong Resort Hospitality Streamsong, Florida 3,079 followers A resort where golf is both a quest for perfection and an art form. Follow View all 284 employees Report this company About us Welcome to Streamsong, the only warm weather destination with three courses in the \"Top 40 You Can Play\" in the United States.  \nStreamsong is a resort where golf is both a quest for perfection and an art form. A place where the surrounding ecosystems are as deeply valued as the time you’ll spend with us.\n\nSituated amid thousands of acres of stunning scenery and hushed seclusion in Central Florida, Streamsong is a one-of-a-kind golf destination created in complete harmony with its natural surroundings. The uniqueness is immediately unveiled from the very moment you arrive and the memories you make here will surely last a lifetime. A quiet place far from the concrete, crowds, and chaos. Here you will experience the only place in the world with Coore/Crenshaw, Doak, and Hanse/Wagner designed courses in the same location along with a modern lakeside lodge offering spacious, luxurious accommodations, outstanding dining, a relaxing spa, and an array of exhilarating outdoor adventures unmatched in Florida.  It’s just you, your friends, and the game you love. For more information, visit www.streamsongresort.com. \n\nMedia Contacts:\nTaryn Parker\nKemperLesnik\nTaryn.Parker@kemperlesnik.com\n\nCraig Falanga\nDirector of Sales and Marketing\nCraig.Falanga@streamsongresort.com Website http://www.streamsongresort.com/ External link for Streamsong Resort Industry Hospitality Company size 201-500 employees Headquarters Streamsong, Florida Type Privately Held Founded 2012 Specialties Event Planning, Meeting Spaces, Hospitality, Golf, and Resort Locations Primary 1000 Streamsong Drive Streamsong, Florida 33834, US Get directions Employees at Streamsong Resort Stewart Smith Food and Beverage Manager at Streamsong Resort Jessica Cavolina Director of Retail at Streamsong Resort John Herrmann Creative & Profitable Manager Ryan Rea Restaurant Manager at Streamsong See all employees Updates Streamsong Resort 3,079 followers 1mo Report this post We’re hiring—and we want to meet you.\n\nJoin us at Streamsong Resort for our Job Fair on Thursday, August 14, and explore opportunities to be part of one of Florida’s most unique and award-winning golf destinations.\n\nWe’re seeking passionate professionals across multiple departments, including hospitality, golf operations, culinary, recreation, and more. If you’re looking to grow your career in an inspiring and team-driven environment, this is your chance.\n\n📍 Streamsong Resort\n📅 Thursday, August 14\n⏰ 12:00 PM – 4:00 PM\n\nBring your resume, meet our leadership team, and discover how you can be part of the extraordinary. 64 1 Comment Like Comment Share Streamsong Resort reposted this Florida of Tomorrow 9,489 followers 3mo Report this post Set on 16,000 acres of dramatic terrain shaped by former phosphate mines in Central Florida, Streamsong Resort defies expectations with a landscape that feels more like Scotland or Australia than the Sunshine State. It’s home to three nationally ranked golf courses—Red, Blue, and Black—designed by legends Coore & Crenshaw, Tom Doak, and Gil Hanse, each earning spots among the top courses in the country. A new short course, The Chain, adds a casual, match-play experience, while a recently announced fifth championship course by David McLay Kidd is now officially underway.\n\nAt the center of it all is Streamsong’s architecturally striking lodge, stacked with amenities including an infinity-edge pool, 360º rooftop bar, sports simulators, and a standout collection of restaurants. Beyond the fairways, the resort also offers bass fishing, clay shooting, archery, and nature trails—rounding out a destination that’s anything but ordinary.\n\nRead more: https://lnkd.in/ePgCb8-y 82 2 Comments Like Comment Share Streamsong Resort reposted this The Beyond Collection 8,317 followers 5mo Report this post 🏌️♂️🥂There’s nothing better than great golf with great company, and Streamsong Resort is built for unforgettable group experiences. Set on a stunning landscape of rolling dunes and native grasses, this is Central Florida like you’ve never seen it before. Once a working phosphate mine, Streamsong has been transformed into a golfer’s paradise, where nature and the game blend seamlessly. \n\nBut the experience doesn’t stop when the final putt drops. Unwind in luxury accommodations and indulge in outstanding dining. For those looking to recharge beyond the course, the AcquaPietra Spa offers world-class treatments, tranquil soaking pools, and a serene escape to relax and recover. Adventure extends beyond the fairways with outdoor recreation activities to explore, from guided bass fishing to archery and sporting clay shooting. 🎣\n\nMore than just golf—this is an unforgettable retreat. Plan your Streamsong getaway today. streamsongresort.com 69 1 Comment Like Comment Share Streamsong Resort reposted this Kat Felix, MA Talent Acquisition Manager @ Streamsong Resort | Acquisitions & LMS protocols 9mo Report this post Help Streamsong enlisting top talent! We're hosting a hiring event on Monday, December 16, from 12:00 pm to 4:00 pm! Please invite friends, family, and anyone interested in joining Streamsong. Share the event details and refer any great candidates to us. Please note that the start date for new hires is January 2025. Offers available day-of! Walk-ins welcome!\n\nPre-apply online to our career page at https://lnkd.in/eVGDwWm5 . 46 2 Comments Like Comment Share Streamsong Resort 3,079 followers 10mo Report this post We’re #hiring a new General Manager in Bowling Green, Florida. Apply today or share this post with your network. General Manager Streamsong Resort, Bowling Green, FL 92 1 Comment Like Comment Share Streamsong Resort reposted this Erica Espe Vice President of Marketing | Driving Growth for Golf Clubs & Sports Venues Through Revenue Strategy + AI Innovation 10mo Report this post 🌟 Exciting Career Opportunity at Streamsong Golf Resort! Streamsong Resort is looking for a Director of Sales & Marketing to lead our strategic vision and operational excellence in one of the most unique golf destinations in the country. This full-time, on-site role will be responsible for directing the resort’s sales and marketing efforts, inspiring a team of talented professionals, and delivering exceptional golfer and guest experiences.\n\nThe ideal candidate will bring:\n\t•\t10+ years of sales & marketing experience with a successful record of achieving revenue goals\n\t•\tAdvanced knowledge of the golf and hotel industry\n\t•\tStrong leadership and team-building skills to develop and motivate our sales and marketing team\n\nIf you’re passionate about creating unforgettable experiences and driving impact within a premier golf and resort environment, we’d love to hear from you!\n\nApply here 👇 recruiting2.ultipro.com 47 3 Comments Like Comment Share Join now to see what you are missing Find people you know at Streamsong Resort Browse recommended jobs for you View all updates, news, and articles Join now Similar pages KemperSports Hospitality Northbrook, IL Cabot Citrus Farms Hospitality Brooksville, Florida Bandon Dunes Golf Resort Hospitality Bandon, OR Augusta National Golf Club Hospitality Augusta, Georgia Kiawah Island Golf Resort Hospitality Kiawah Island, SC Dream Golf Hospitality Chicago, Illinois Pinehurst Resort Hospitality Pinehurst, NC Acushnet Company Manufacturing Fairhaven, MA Cabot Hospitality Toronto, Ontario Seminole Golf Club Juno Beach , Florida Show more similar pages Show fewer similar pages Browse jobs Underwriter jobs 27,490 open jobs Property Adjuster jobs 3,756 open jobs Manager jobs 1,880,925 open jobs Chief Officer jobs 82,500 open jobs Analyst jobs 694,057 open jobs Therapist jobs 159,889 open jobs Vice President jobs 235,270 open jobs National Sales Manager jobs 21,583 open jobs Fraud Analyst jobs 5,936 open jobs Area Sales Manager jobs 28,704 open jobs Director Sponsorship Sales jobs 4,617 open jobs Account Manager jobs 121,519 open jobs Director jobs 1,220,357 open jobs Insurance Sales Manager jobs 3,527 open jobs Commercial Account Manager jobs 48,086 open jobs Event Marketing Manager jobs 10,684 open jobs Sales Analyst jobs 58,859 open jobs Medical Specialist jobs 78,500 open jobs Regional Manager jobs 107,546 open jobs Relationship Manager jobs 95,340 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Therapist jobs Event Associate jobs Director of Food And Beverage jobs Streamsong Resort jobs Director jobs Sales Manager jobs Hospitality Manager jobs Real Estate Manager jobs Driver jobs Director of Operations jobs Coordinator jobs Associate jobs Analyst jobs Legal Director jobs General Counsel jobs Legal Counsel jobs Attorney jobs President jobs Athletic Director jobs Director of Learning and Development jobs Training and Development Manager jobs Training Manager jobs Principal Consultant jobs Risk Specialist jobs Consultant jobs Vice President Sales Marketing jobs Corporate Director jobs Sales Director jobs Regional Vice President jobs Hotel General Manager jobs Chef De Cuisine jobs General Manager jobs Marketing Director jobs Scout jobs Flight Attendant jobs Assistant Manager jobs Human Resources Specialist jobs Intern jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Streamsong Resort Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://blinkerstavern.com/contact-us",
      "text": "Contact Us - Get in Touch - Blinkers Tavern Home Contact us Gift Cards Private Parties Specials & Events Wine & Spirits About Us Free parking. Home Contact us Gift Cards Private Parties Specials & Events Wine & Spirits About Us Lunch Brunch Dinner Contact Us Do you have a Comment or Question?  Drop a line to Susan at svolpenhein@blinkerstavern.com Name* Email* Phone Number Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Blinkers Tavern 318 Greenup St,  Covington, KY 41011 859-360-0840 Hours Mon -Thur 10:30 -10pm Fri 10:30 am -11pm Sat 10 am -11pm - Brunch 10-3 Sun 10 am -9 pm - Brunch 10-3 Brunch Only Sat & Sun 10 am - 3pm -Serving Lunch & Dinner -Large Groups Welcome -Private Party Rooms Available Get directions Copyright © 2025 Blinkers Tavern - All Rights Reserved. Powered by Privacy Policy"
    }
  ]
}