{
  "fuentes": [
    {
      "url": "https://www.studiomyr.com/contact",
      "email": "info@studiomyr.com"
    },
    {
      "url": "https://www.adoristevents.com/about-us",
      "email": "info@adoristevents.com"
    },
    {
      "url": "https://blackframeniagara.com/contact/",
      "email": "studio@blackframecinema.com"
    },
    {
      "url": "https://ballers-crazy-golf.myshopify.com/pages/contact-us",
      "email": "ballers-logo-white-png-landscape_x60@2x.png"
    },
    {
      "url": "https://ballers-crazy-golf.myshopify.com/pages/contact-us",
      "email": "info@ballerscrazygolf.co.uk"
    },
    {
      "url": "https://www.birdcageandblushers.com/contact-chicago-wedding-planner",
      "email": "alyson.thompson@birdcageandblushers.com"
    },
    {
      "url": "https://www.birdcageandblushers.com/contact-chicago-wedding-planner",
      "email": "info@birdcageandblushers.com"
    }
  ],
  "mails": [
    "alyson.thompson@birdcageandblushers.com",
    "ballers-logo-white-png-landscape_x60@2x.png",
    "info@adoristevents.com",
    "info@ballerscrazygolf.co.uk",
    "info@birdcageandblushers.com",
    "info@studiomyr.com",
    "studio@blackframecinema.com"
  ],
  "nombre_sitio": "studio131orangelake.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.studiomyr.com/contact",
      "text": "CONTACT | Connect with Us — Studio Myr Skip to Content Open Menu Close Menu SHOP ABOUT CONTACT 0 0 Open Menu Close Menu SHOP ABOUT CONTACT 0 0 SHOP ABOUT CONTACT Contact STUDIO MYR Boutique Holstraat 15 6017AC Thorn Opening hours: Tuesday - Sunday 11.00 - 17.00 hour or by appointment Closed on Monday E info@studiomyr.com M +31(0)6 21 25 62 93 Name * First Name Last Name Email * Subject * Message * Thank you so much for contacting us. We will come back to you in a short while. In the meantime, have a wonderful day! Kindest greetings, Miriam Lenarts - director/designer Studio Myr ABOUT About Exposure Blog Sustainability Pricing Reviews to the webshop SERVICE Contact International Size Card FAQ Payment Return and Refund Policy Shipping Privacy Statement Terms and Conditions Opening Hours Boutique Subscribe to our newsletter Be the first to hear about new collections and events Email Address Sign Up We respect your privacy Thank you! ©2023 Studio Myr | Sustainable Luxury Knitwear | Designed by Miriam Lenarts - Studio Myr | Ethically made in The Netherlands"
    },
    {
      "url": "https://www.adoristevents.com/about-us",
      "text": "About | Adorist Weddings and Events | United States top of page Home About Us Testimonials More Use tab to navigate through the menu items. Contact Us Experience Matters Adorist : [uh-dohr-ist] noun -One who specializes in making things adorable -One who creates adoring emotions in others -StL’s most creative wedding and event planner Experience Matters Each person on our team has multiple years of experience planning weddings and events, from stadiums to backyards. We have the expertise, experience, and enthusiasm to make your special day the stress-free dream you've always wanted. It is our mission to design and create each celebration unique to our clients. Whether you need full hands-on planning, or just help the day of, we are here for you. Even if you just need advice, give us a call and we're glad to help in any way we can. Weddings and Events It's all we do! Our team has experience with all types of events throughout the nation, so we can do it all! Want to shoot t-shirts into the crowd at an arena? ...We've done that. Want to have a snowboard competition in the middle of downtown? ...We've done that too. Maybe you need an actual horse to dress up as a unicorn for your imagination-themed woman's event? ...Check - we've done that one too. Whether it's your dream wedding or a corporate retreat, a baby shower or Birthday party - Adorist is your expert that will make your event stress-free and amazing! ​ Meet The Team Jessica Zickgraf I'm Jessica. I've planned and executed all types of events - from backyards parties to giant stadiums and arenas, I've done it all.  Literally thousands of events, but weddings are my passion. I'm a creative butterfly that loves making and doing fun, creative stuff. Robin Zickgraf Hi, I'm Robin. I'm married to Jess (my best quality). I'm a big nerd, but I also have over 15 years experience with project and program management, so I handle a lot of the behind-the-scenes planning to make sure your day is flawless. Honestly though, I'm just muscle. They keep me around to carry heavy stuff and reach the top shelf. ;) Your Vision... ...Is Our Mission St. Louis - Kirkwood | info@adoristevents.com | ©2025 by Adorist bottom of page"
    },
    {
      "url": "https://blackframeniagara.com/contact/",
      "text": "Contact Weddings | Black Frame Studios Black Frame Studios Book your shoot with Black Frame Cinema & save on studio space Home Host Your Event Weddings Hire Our Team Media Production FAQ Contact Home Host Your Event Weddings Hire Our Team Media Production FAQ Contact Contact Us Need assistance or have feedback? Don’t hesitate to get in touch with us. Our team is readily available to answer your questions and address any concerns you may have. You can reach us via email, phone, or by filling out the contact form provided. We value your input and look forward to assisting you! Name Email Message Send studio@blackframecinema.com 114 Hartzel Rd, St. Catharines, ON L2P 1N5 Facebook Twitter Youtube Instagram © 2025 All Rights Reserved."
    },
    {
      "url": "https://ballers-crazy-golf.myshopify.com/pages/contact-us",
      "text": "Contact Us – Ballers Crazy Golf Skip to content Menu Home About Our Course Events Events menu Taste of London Summer Standon Calling England Rugby Pub in the Park - Marlow Arsenal FC Taste of London Festive Pricing FAQs Contact Us Search again View cart Contact Us Our course provides the perfect entertainment to a whole host of events and occasions. Whether it's private parties, weddings, corporate hire or events. Get in touch to discuss your requirements. info@ballerscrazygolf.co.uk Name Email Phone Number Message Sign up for updates Promotions, news and events. Directly to your inbox. Subscribe Copyright © 2025, Ballers Crazy Golf . Powered by Shopify Close Cart Shopping Cart Your cart is currently empty. Enable cookies to use the shopping cart t:\n\n                        \n                        \n                          e (- ) Remove Item Quantity Discount: - Subtotal £0.00 Tax included and shipping calculated at checkout Checkout Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection."
    },
    {
      "url": "https://www.birdcageandblushers.com/contact-chicago-wedding-planner",
      "text": "Connect with Birdcage & Blushers | Chicago Wedding Planner 0 Skip to Content Home About Services Corporate Events Contact Open Menu Close Menu Open Menu Close Menu Home About Services Corporate Events Contact Home About Services Corporate Events Contact Ready to experience seamless wedding planning designed around you? Birdcage & Blushers Weddings helps couples in Chicago and beyond create celebrations that are intentional, stylish, and truly personal. How To Reach Us Fill out our contact form or connect with us directly: 📧 [email protected] 📱 Call or text: +1 773-217-9006 Excited to start now? Schedule your complimentary consultation—we’ll talk through your vision, your needs, and how we can help you bring it all to life with calm and clarity. Schedule Your Consultation What To Expect When You Reach Out When should we reach out? The sooner the better! Most couples contact us 12–18 months in advance, but we’re also happy to support shorter timelines. If you're overwhelmed, unsure where to start, or thinking, “What’s a typical wedding planner cost?” —you’re in the right place. What happens after I submit the form? You’ll get a quick confirmation, and then we’ll personally review your details.  We’ll reach out as soon as possible to confirm availability and to schedule a call to explore which of our bespoke event planning options is the best fit. Do you work with destination or out-of-town clients? Yes! We regularly partner with couples who are planning from another city or state—or bringing loved ones together for a destination wedding. Whether you're local or long-distance, you'll get a seamless, supportive experience. What kind of weddings do you plan? From sophisticated city celebrations to backyard weddings full of personal charm, we specialize in intentional, elevated events. We offer full-service wedding planning, partial planning, and wedding design services—always tailored to your needs and values. Home Privacy Policy About Website Disclaimer Contact Terms and Conditions Services Made with Squarespace B&B Events Group produces intentional, hospitality-driven corporate events that reflect your brand, values, and goals. Birdcage and Blushers Weddings thoughtfully plans and designs sophisticated and deeply personal celebrations for couples in Chicago and beyond."
    }
  ]
}