{
  "fuentes": [
    {
      "url": "https://www.cactusjacksnh.com/menu",
      "email": "info@greatnhrestaurants.com"
    },
    {
      "url": "https://thebreaker.news/business/earls-cactusclub-recipe/",
      "email": "become_a_patron_button@2x.png"
    },
    {
      "url": "https://thebreaker.news/business/earls-cactusclub-recipe/",
      "email": "bob@thebreaker.news"
    },
    {
      "url": "https://www.tdtnews.com/news/business/article_b8f89b76-5821-578b-96cc-3598c106d7bd.html",
      "email": "webadmin@tdtnews.com"
    },
    {
      "url": "https://www.cactusjacksnh.com/news",
      "email": "info@greatnhrestaurants.com"
    },
    {
      "url": "https://www.greatnhrestaurants.com/cactus-jacks.html",
      "email": "bedford@t-bones.com"
    },
    {
      "url": "https://www.greatnhrestaurants.com/cactus-jacks.html",
      "email": "derry@t-bones.com"
    },
    {
      "url": "https://www.greatnhrestaurants.com/cactus-jacks.html",
      "email": "hudson@t-bones.com"
    },
    {
      "url": "https://www.greatnhrestaurants.com/cactus-jacks.html",
      "email": "info@greatnhrestaurants.com"
    },
    {
      "url": "https://www.greatnhrestaurants.com/cactus-jacks.html",
      "email": "laconia@t-bones.com"
    },
    {
      "url": "https://www.greatnhrestaurants.com/cactus-jacks.html",
      "email": "salem@t-bones.com"
    },
    {
      "url": "https://www.cactusindustrial.com/contact-us/",
      "email": "info@cactusindustrial.com"
    },
    {
      "url": "https://www.wyomingcarboncounty.com/peppermill-bar-cactus-jack-s",
      "email": "info@wyomingcarboncounty.com"
    },
    {
      "url": "https://www.cactusjacksnh.com/about-us.html",
      "email": "info@greatnhrestaurants.com"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "bus@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "caskmarque@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "disabledaccess@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "dogfriendly@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "eveningmeals@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "events@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "familyfriendly@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "functionroom@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "games@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "garden@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "livemusic@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "locale@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "lunchtimemeals@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "memberdiscountscheme@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "metro@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "norealale@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "quiet@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "realale@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "realheritagepub@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "smoking@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "sportstv@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "station@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "telephone@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "wifi@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "camra@camra.org.uk"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "close_button@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "down_arrow_divider@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "logo-new-header@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "email": "overlay_close_button@2x.png"
    },
    {
      "url": "https://www.cactusjacksnh.com/contact-us.html",
      "email": "info@greatnhrestaurants.com"
    },
    {
      "url": "https://foursquare.com/v/sundowners/4b92ec2cf964a520512734e3",
      "email": "icon-go_foursquare8@2x-8104e4d03ad47b81f079c1f043220e75.png"
    }
  ],
  "mails": [
    "become_a_patron_button@2x.png",
    "bedford@t-bones.com",
    "bob@thebreaker.news",
    "bus@2x.png",
    "camra@camra.org.uk",
    "caskmarque@2x.png",
    "close_button@2x.png",
    "derry@t-bones.com",
    "disabledaccess@2x.png",
    "dogfriendly@2x.png",
    "down_arrow_divider@2x.png",
    "eveningmeals@2x.png",
    "events@2x.png",
    "familyfriendly@2x.png",
    "functionroom@2x.png",
    "games@2x.png",
    "garden@2x.png",
    "hudson@t-bones.com",
    "icon-go_foursquare8@2x-8104e4d03ad47b81f079c1f043220e75.png",
    "info@cactusindustrial.com",
    "info@greatnhrestaurants.com",
    "info@wyomingcarboncounty.com",
    "laconia@t-bones.com",
    "livemusic@2x.png",
    "locale@2x.png",
    "logo-new-header@2x.png",
    "lunchtimemeals@2x.png",
    "memberdiscountscheme@2x.png",
    "metro@2x.png",
    "norealale@2x.png",
    "overlay_close_button@2x.png",
    "quiet@2x.png",
    "realale@2x.png",
    "realheritagepub@2x.png",
    "salem@t-bones.com",
    "smoking@2x.png",
    "sportstv@2x.png",
    "station@2x.png",
    "telephone@2x.png",
    "webadmin@tdtnews.com",
    "wifi@2x.png"
  ],
  "nombre_sitio": "sundownerskeylargo.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cactusjacksnh.com/menu",
      "text": "Cactus Jack's Grill & Watering Hole: Menu Menus Lunch & Dinner Dessert Drinks Order Online Cactus Jack's Laconia Looking for T-BONES Laconia? Promotions Ding Dong Deliver Gift Cards Loyalty About Join Our Team How'd We Do? Join Our Email Club Join Our Text Club Cactus Jack's 1182 Union Avenue, Laconia, NH 03246 (603) 528-7800 Laconia Email Us Hours Daily : 4PM-12AM Holiday Hours Donations News & Awards Photos Contact My Cart: 0 item(s) Your Shopping Cart Is Empty CAREER INTEREST JOB OPPORTUNITIES WITH GREAT NH RESTAURANTS! Apply Today! Our Brands Our Brands Secure Checkout … Home Menu Download a PDF of our Menu Ordering made easy with Take Out Ordering . Jack's Snacks All That & A Basket of Chips New Espinaca Con Queso, Artichoke & Spinach Dip, Guacamole, Tortilla Chips...18.99 Guac ‘n’ Chips Tortilla Chips, Guacamole, Fresh Salsa, Pico de Gallo...10.99 Buffalo Chicken Egg Rolls New Creamy Buffalo & Bleu Cheese Filling, Mixed Greens...12.99 Taquitos Chicken & Cheese “Chimi Crispas”, Cool Ranch Dip...10.99 CJ’s Trail Nachos Tortilla Chips, Cheese, Pico de Gallo, Jalapeño, Sour Cream. (Ground Beef, Chicken, or Both) ...15.99 Sweet & Spicy Chicken Tenders New Corn Flake Breaded Chicken, Sweet & Spicy Glaze, Sesame Dipping Sauce...14.99 Wing It! Choose a combination of any two. • Tangy Buffalo • Sweet & Spicy • Tiki Style (no sauce) ...15.99 Artichoke & Spinach Dip Artichoke Heart, Spinach, Parmesan, Grilled Cajun Bread, Tortilla Chips...13.99 Espinaca Con Queso Mexican Cheese & Spinach Dip, Pico de Gallo, Tortilla Chips...13.99 Boneless Buffalo Tenders Corn Flake Breaded Chicken, Buffalo Sauce, Carrot, Celery, Bleu Cheese Dip...14.99 Ribs & Chicken Sampler New BBQ Pork Ribs, Sweet & Spicy Chicken, Tiki Style Wings, Ranch Dip...22.99 Jack's Big Bites Add sliced avocado...1.99 Gluten intolerant friendly bun available, just ask! Chipotle Ranch Salad Salad Greens, Smoky Chipotle Ranch Dressing, Toasted Corn, Tomato, Cucumber, Cheddar, Signature Onion Ring • Grilled Chicken...6.99 • Steak...11.99 Nashville Hot Chicken Sandwich Fried Chicken, Cayenne Pepper Seasoning, Pickle Chips, Spicy Mayo, Bibb Lettuce, Grilled Bun, Sweet Potato Fries...16.99 B & B Salad Salad Greens, Grilled Chicken, Cucumber, Tomato, Onion, Green Pepper, Colby & Jack Cheese, Tortilla Thins (Blackened, Buffalo, or both B & B) ...17.99 Jack’s Fish ‘n’ Chips Fried Haddock, Fries, Signature Onion Ring, Coleslaw Garnish, Tartar Sauce...19.99 NH’s Best Burger ½ lb. Burger, Lettuce, Tomato, Onion, Pickle Chips, American or Cheddar, Fries • Sautéed mushrooms...1.49 • Bacon...1.49 • Both...1.99 ...17.99 Chicken Espinaca Fried Chicken, Mexican Rice, Espinaca Cheese Sauce, Pico de Gallo, Tortilla Thins...18.99 BBQ Beef Tips Reserve Premium Choice SM Marinated Sirloin Tips, Signature Onion Ring, Fries, Coleslaw Garnish...29.99 Steak 'n' Cheese Wrap Shaved Steak, Sautéed Pepper & Onion, Mushroom, Ranch Spread, American Cheese, Fries...17.99 Boneless Buffalo Chicken Platter Corn Flake Breaded Chicken, Fries, Coleslaw Garnish, Signature Onion Ring, Buffalo Sauce, Bleu Cheese...18.99 C.B.C. Rollup Corn Flake Breaded Chicken, Lettuce, Tomato, Ranch Spread, Mayo, Bacon, Cheddar, Flour Tortilla, Fries...16.99 Baby Back Ribs New Applewood Smoked Pork Ribs, BBQ Sauce, Fries, Coleslaw Garnish...28.99 Bueno Burritos Beef Burrito Ground Beef, Refried Beans, Cheddar, Ranchero Sauce, Flour Tortilla, Mexican Rice, Sour Cream...17.99 Chicken Burrito Shredded Chicken, Refried Beans, Cheddar, Ranchero Sauce, Flour Tortilla, Mexican Rice, Sour Cream (made vegetarian upon request...15.99) ...17.99 Beef Chimichanga Crispa Ground Beef, Stuffed and Fried Flour Tortilla, Cheddar, Smoked Salsa, Mexican Rice, Refried Beans, Sour Cream...17.99 Chicken Chimichanga Crispa Shredded Chicken, Stuffed and Fried Flour Tortilla, Cheddar, Smoked Salsa, Mexican Rice, Refried Beans, Sour Cream...17.99 Blazing Fajitas Chicken Fajitas Sliced Chicken, Sautéed Pepper & Onion, Flour Tortillas, Mexican Rice, Refried Beans, Sour Cream, Smoked Salsa, Shredded Lettuce, Pico de Gallo, Cheddar (Blackened, Buffalo, or BBQ) ...21.99 Vegetable Fajitas Mixed Vegetables, Sautéed Pepper & Onion, Flour Tortillas, Mexican Rice, Refried Beans, Sour Cream, Vegetarian Salsa, Shredded Lettuce, Pico de Gallo, Cheddar....16.99 Sirloin Fajitas Sliced Steak, Sautéed Pepper & Onion, Flour Tortillas, Mexican Rice, Refried Beans, Sour Cream, Smoked Salsa, Shredded Lettuce, Pico de Gallo, Cheddar...23.99 Dos Tacos Beef Tacos Ground  Beef, Lettuce, Pico de Gallo, Shredded Cheese, Mexican Rice, Refried Beans, Sour Cream...16.99 Buffalo Chicken Tacos Hard & Soft Shell Tacos, Espinaca Cheese Sauce, Buffalo Fried Chicken, Lettuce, Pico de Gallo, Melted Cheese, Fries, Coleslaw Garnish, Bleu Cheese Dip...17.99 Carne Asada Tacos Steak, Toasted Corn, Pico de Gallo, Cheddar, Hard & Soft Shell Tacos, Espinaca Cheese Sauce, Sour Cream, Mexican Rice, Refried Beans...17.99 Crispy Haddock Tacos Prime Fried Haddock, Hard & Soft Shell Taco, Crab-Dip, Lettuce, Pico de Gallo, Colby & Jack Cheese, Coleslaw Garnish, Fries, Tartar Sauce...18.99 Quesadillas Chicken or Beef Quesadilla Colby & Jack Cheese, Sour Cream, Lettuce, Mexican Rice, Refried Beans, Pico de Gallo (Choose Beef or Shredded Chicken) ...16.99 Vegetable Quesadilla Artichoke Dip, Mushroom, Garden Vegetables, Mexican Rice, Refried Beans, Cheddar, Sour Cream, Lettuce, Pico de Gallo...15.99 Steak & Cheese Quesadilla Shaved Steak, Sautéed Pepper & Onion, Mushroom, Colby & Jack Cheese, Sour Cream, Lettuce, Mexican Rice, Refried Beans, Pico de Gallo...17.99 Kids Served with fries, a Kid-size milk, juice, or soda, and a homemade chocolate chip cookie. Kids' Cheeseburger ...8.99 Kids' Chicken Tenders ...8.99 Kids' Cheese Quesadilla ...7.99 Kids' Mac 'n' Cheese (no fries) ...7.99 Sides Coleslaw ...3.99 Mexican Rice ...3.99 Fries ...5.99 Broccoli ...3.99 Onion Rings ...4.99 Mixed Veggies ...3.99 Refried Beans ...3.99 Sweet Potato Fries ...5.99 For your safety, we fully cook all meals. Requesting foods undercooked may impose health risks. Your safety is of the utmost importance to us. Please be aware that our made-from-scratch recipes involve shared cooking and preparation areas, including but not limited to common fryer oil. The possibility exists for food items to come in contact with other food products. Due to these circumstances, we are unable to guarantee that any menu item can be free of common food allergens. We can provide the most current ingredient information from our food suppliers with proper notice. Note that their stated absence of allergens within these items are not inclusive of every ingredient and may leave out trace elements. We can make no guarantees of the accuracy and disclaim liability for the use of this information. Please ask to speak with a manager if further assistance is needed. Before placing your order, please inform your server if a person in your party has a food allergy. Our fryers contain vegetable oil. We Love Great Taste ® We Love Great Taste We work harder, and you can taste it! When we say it's \"homemade,\" we mean made-from-scratch ® . We develop all of our recipes in our own kitchens, making every sauce, soup, salad dressing, and dessert, right down to hand-peeling potatoes for our own creamy mashed potatoes or our signature Yukon Gold Potato Chips! Now that's Good 'n' Fresh! ® A Great NH Restaurants Company Food Tastes Better With Family™ Breathe Easy, Eat Well.™ Live Free Eat Great™ Live It Up™ We Love Big Decks™ Helpful Links Helpful Links About Photo Gallery Gift Cards Payback$ Join Our Text Club Join Our Email Club In The News Catering Random Acts of Kindness Send Feedback Careers Contact Accessibility Terms & Conditions Location Location 1182 Union Avenue, Laconia, NH, 03246 (603) 528-7800 Laconia Email Us HOURS Open Daily Daily : 4PM-12AM HOLIDAY HOURS HOLIDAY HOURS Corporate Office - Great NH Restaurants, Inc. Corporate Office - Great NH Restaurants, Inc. 1182 Union Avenue, Laconia, NH, 03246 (603) 528-7800 Email Us Join Our Newsletter Join Our Newsletter Join Our Newsletter Our Family Connect With Us Connect With Us Safe & Secure © 2025 Great NH Restaurants, Inc. All Rights Reserved"
    },
    {
      "url": "https://thebreaker.news/business/earls-cactusclub-recipe/",
      "text": "Nothing casual about Earls, Cactus Club food fight as dispute sheds light on ownership intrigue - theBreaker Recent Posts News , Opinion thePodcast: Terry Fox’s legacy, 45 years later September 7, 2025 Business , News Confusion on the first day of the B.C. government workers’ strike September 5, 2025 Connect with: Wednesday / September 10. Cart (0) No products in the cart. SECTION Home News Opinion Miscellany Contact Home News Opinion Miscellany Contact Home News Opinion Miscellany Contact Home Business Nothing casual about Earls, Cactus Club food fight as dispute sheds light on ownership intrigue Business , Miscellany , News July 13, 2019 author: thebreaker 0 likes 12115 seen 0 Comments Nothing casual about Earls, Cactus Club food fight as dispute sheds light on ownership intrigue Bob Mackin A food fight that has erupted among the clan connected to four restaurant chains highlights how so few own so many of the biggest food and drink brands in Canada. A June 6 B.C. Supreme Court judgment, which was published last week, denied an application to waive the obligation for sole Cactus Club director Richard Jaffray to produce and publish audited financial statements to shareholders Earl’s Holdings, Stanley Fuller and a family trust, Rockefuller Holdings and Cacthold Holdings. “Cactus and Earl’s are competitors in the ‘premium’ casual dining market. Stanley and his brothers Stewart, Clayton and Jeffrey Fuller, are the directors of Earl’s. They are also the directors of Joey Restaurant Group,” wrote Justice Margot Fleming. “Jeffrey is Joey’s chief executive officer. Joey also operates multiple restaurants in Canada and the United States. Cactus describes Joey as a direct and active competitor that unlike Earl’s, has no economic interest in the success of Cactus.” Bus Fuller (the father of Stanley, Jeffrey, Clayton and Stewart Fuller) founded Earl’s in 1982 in Edmonton. Jaffray met Bus and Stanley Fuller while working at Earl’s in 1986 and, two years later, Jaffray and Scot Morison opened Cactus Club in North Vancouver with $180,000 in startup capital from Earl’s; Stanley and Julie Fuller were 60% shareholders in the Cactus Club startup. Jaffray now owns 35% interest in Cactus Club and Earl’s owns 45%, with Stanley Fuller, the Fuller Family Trust, Rockefuller and Cacthold holding the remaining 20%. Jaffray and the Fullers have traded legal barbs amid allegations that Jaffray has misspent company funds on travel and luxury items. Jaffray became sole director and president of Cactus Club indefinitely in September 2004, after a falling out with Morison, who founded the Browns Socialhouse chain. In June 2018, Cactus petitioned the court for an order to permanently relieve Jaffray of his obligation to publish financial statements to all shareholders. Cactus Club’s Richard Jaffray (left), Christy Clark and chef Rob Feenie in 2013. Clark is now a director of competitor Recipe Unlimited. (BC Gov) “Cactus complains that in recent years and in breach of the confidentiality clause, the respondents have refused to prevent Jeffrey and others associated with Joey from accessing the financial statements or the information they contain, providing Joey with a competitive advantage,” Fleming wrote. “Given these circumstances and the ‘the specific bargain struck’, Cactus takes the position that relieving Mr. Jaffray of his obligation to provide the financial statements to the respondents, so as to prevent their content from being disclosed to and used by Joey, is reasonable.” Fleming refused the Cactus application. “ The evidence does not show, despite the history of delivery to date and Cactus’ earlier disclosure of confidential information during meetings with Earl’s and Joey, however, a competitive disadvantage or any harm to Cactus. What this leaves is the mere possibility of a detriment for Cactus arising from Jeffrey and others having access to the information contained in the financial statements.” Earls Kitchen + Bar, the oldest of the group, has 56 locations from B.C. to Ontario, while Cactus Club has 31 and Joey 22. Browns, meanwhile, has 67. Meanwhile, publicly listed Recipe Unlimited (the former Cara Operations) boasts 1,382 restaurants operating under 22 brands (1,324 are in Canada). It says 82% of them are franchised or joint ventures in Canada and nine other countries (U.S., Bahrain, China, Macau, Oman, Panama, Qatar, Saudi Arabia and United Arab Emirates). Of the restaurants, 46 are joint venture, 208 are corporate and 1,128 franchised. Recipe reported system-wide sales of $3.4 billion for the 2018 fiscal year from Swiss Chalet, Harvey’s, St-Hubert, The Keg, Milestones, Montana’s, Kelsey’s, East Side Mario’s, New York Fries, Prime Pubs, Bier Markt, Landing, Original Joe’s, State & Main, Elephant & Castle, The Burger’s Priest, The Pickle Barrel, Marigolds & Onions, and 1909 Taverne Moderne. The board of directors includes former BC Liberal Premier Christy Clark, whose crowning achievement while in office for six years was the relaxation of laws and regulations around the retail, wholesale and service of beer, wine and spirits. A late 2013 Clark news conference about some of those amendments was held at the flagship Cactus Club at the Vancouver Convention Centre. Those at the top of the food chain with Cactus, Earls and Recipe were some of the biggest donors to the BC Liberals, before the NDP banned unlimited corporate political donations in fall 2017. From 2012 to 2017, Jaffray donated $123,600 to the BC Liberals, the lion’s share from Cactus Club accounts. In June 2017, after the provincial election, Cactus made two $25,000 donations to the BC Liberals. Stan Fuller donated $192,749 from 2005 to 2017, including $25,000 from Earls Head Office Canadian Inc. in June 2017, three days before the BC Liberals were toppled in a confidence vote by the Green-supported NDP. Joey Restaurants gave $38,650 from 2013 to 2017. Recipe Unlimited vice chairman David Aisenstat, the CEO of Keg Restaurants, donated $427,232.66 from 2005 to 2016, including $150,000 from the Keg Restaurants on May 17, 2013 — three days after Clark led the BC Liberals to a surprise re-election. Support the Breaker .news for as low as $2 a month on Patreon. Find out how. Click here. Tags B.C. Supreme Court BC Liberals British Columbia Browns Bus Fuller Cactus Club campaign finance Christy Clark David Aisenstat Earls foodservice Joey Justice Margot Fleming Keg liquor laws Milestones NDP Recipe Unlimited Richard Jaffray Stanley Fuller Swiss Chalet Share Exclusive: No conflict of interest for Vancouver councillor who sought public feedback on her website theBreaker.news Podcast: B.C. municipal association chooses China Related posts Business , News Confusion on the first day of the B.C. government workers’ strike September 5, 2025 Business , News BC Ferries refuses to release contract with Chinese state-owned shipyard September 5, 2025 Business , News , Opinion thePodcast: East Van music mogul Jonathan Simkin August 31, 2025 Business , News , Sports WATCH: FIFA manager refuses to let reporter photograph officials with World Cup trophy at public event August 24, 2025 News , Opinion thePodcast: How will FIFA World Cup 26 impact Vancouver’s working poor, seniors and the homeless? August 24, 2025 Business , News B.C. Place Stadium management told to open up and hand over more documents about FIFA World Cup 26 August 22, 2025 About Us theBreaker.news and theBreaker.news Podcast: your source for news, opinion and analysis about British Columbia issues, institutions and influencers. Contact theBreaker is located in Vancouver, British Columbia, Canada and published by Bob Mackin. Email: bob@thebreaker.news Send tips via secure Protonmail theBreakernews@protonmail.com Support theBreaker.news For as low as $2 a month, you can help support theBreaker.news on Patreon Find out how by clicking here! Follow on Twitter Couldn't connect with Twitter Free newsletter sign-up First Name Last Name Email address: Leave this field empty if you're human:"
    },
    {
      "url": "https://www.tdtnews.com/news/business/article_b8f89b76-5821-578b-96cc-3598c106d7bd.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://www.cactusjacksnh.com/news",
      "text": "Cactus Jack's Grill & Watering Hole: News & Awards Menus Lunch & Dinner Dessert Drinks Order Online Cactus Jack's Laconia Looking for T-BONES Laconia? Promotions Ding Dong Deliver Gift Cards Loyalty About Join Our Team How'd We Do? Join Our Email Club Join Our Text Club Cactus Jack's 1182 Union Avenue, Laconia, NH 03246 (603) 528-7800 Laconia Email Us Hours Daily : 4PM-12AM Holiday Hours Donations News & Awards Photos Contact My Cart: 0 item(s) Your Shopping Cart Is Empty CAREER INTEREST JOB OPPORTUNITIES WITH GREAT NH RESTAURANTS! Apply Today! Our Brands Our Brands Secure Checkout … Home News & Awards Promos Gift Cards Loyalty About Email Club Random Acts of Kindness Testimonials Photos News & Awards Contact Join Our Team Donations News & Awards Cactus Jack's Grill & Watering Hole has been making news. We have been featured in The Hippo Press , The Union Leader , New Hampshire Magazine , Phantom Gourmet and more! Latest News Lisa Allen, 2021 Outstanding Women in Business recipient - February 11, 2021 BEDFORD — Lisa Allen is the Chief Administrative Officer of Great NH Restaurants Within six months, Lisa Allen progressed from food server to bartender and then assistant manager of T-BONES restaurant in Bedford. Upon graduating from UNH Manchester, she wrote a five-page letter to Great NH Restaurants CEO Tom Boucher about her observations and ideas to grow the business. That’s how Lisa was offered a starting position in the home office for two hours per week in neighborhood marketing. Within one year, she had earned herself a full-time office position, handling payroll, marketing and assisting the company’s accountant. These events occurred more than 20 years ago, but they’re illustrative of Lisa’s personal investment in every aspect of the Great NH Restaurants organization, where she now oversees all administrative operations (for up to 600 employees at one time), and has been an owner and member of the executive team for a decade. Read Full Article The Union Leader - T-BONES’ first custom-built location coming to Concord - November 2019 CONCORD — After 35 years in business and multiple locations, T-Bones Great American Eatery will open its first custom-built restaurant early next year. T-BONES’ parent company, Great New Hampshire Restaurants, is also gearing up to open a new sports bar concept called Bull & Bear at the former Shorty’s in Bedford in the near future. Read Full Article The Nashua Telegraph - Company now offering paper straws - July 2019 BEDFORD — Recently, Great NH Restaurants stopped automatically handing out plastic straws and providing them only when guests ask. Searching for a better solution, Bob Sullivan, director of purchasing for Great NH Restaurants, found a paper straw that was a cut above the rest on the market, most of which don’t perform well. Read Full Article Union Leader - NH Voices - January 2019 NH Voices - Tom Boucher: NH Restaurants Pay It Forward As 2018 winds down many of us will look back on the year and think about all that has occurred in our own lives, our communities, our country, and our world. With regular emphasis on what’s wrong, and in hopes that you will also be focusing on the good, I thought I’d take this opportunity to focus on what’s good and share what some of New Hampshire’s restaurants have done. Did you know that 94 percent of restaurants make charitable contributions? Whether to assist with a crisis, boost a community project or start a charitable program of their own (more on this in a bit), America’s restaurants are there to help by contributing food, donating their time, and writing checks. The charitable giving of America’s restaurants adds up to a staggering $3 billion a year. Read Full Article CJ's Rebranding - November 2018 CJ's Great West Grill celebrates America's vast, regional cuisine! We serve up mouthwatering Texas BBQ, House Specialties like our famous Crispy Haddock Tacos, made-from-scratch Mexican dishes, all-American seafood, Butcher cut steaks and many more unique plates that are sure to please the whole family's palate. Awards & Recognition NH Business Review Names Lisa Allen of Great NH Restaurants as a 2021 Outstanding Women in Business Award Recipient Lisa Allen among six recipients to be honored at 16th annual award ceremony on February 11 Bedford, N.H. – February, 5th, 2021 – Great NH Restaurants is announcing Lisa Allen, CAO has been honored with a 2021 Outstanding Women in Business Award from NH Business Review. The annual awards celebrate the successes and achievements of women who have had a lasting impact on New Hampshire’s business community as leaders and role models. NH Business Review will be holding a virtual awards ceremony on Thursday, February 11, to honor this year’s six recipients. Best of NH Mag - Best Chili - 1yr (2017) We are proud to be awarded with the Best of New Hampshire Magazine award for Best Chili! CJ's is recognized by locals as the number one restaurant for chili. Come experience our signature Texas chili recipe made from scratch. Made with in butcher ground beef, beans, a smoky, savory stock with a slight kick! Topped with cheddar cheese and served with tortilla chips! Union Leader - Best Happy Hours - 1yr (2018) Union Leader - Best Nightlife - 1yr (2016) Union Leader Readers Have Spoken, Cactus Jack's Hosts Best Happy Hour in New Hampshire At Cactus Jack's, we don't limit happy hour to just one hour. We choose to celebrate each day with Happy Hours. And 2016 just got even happier! We are proud to be awarded the Union Leader Readers' Choice Award for Best Nightlife - Happy Hour in the state! From draft beer and mixed drink specials to our Jack's Snacks appetizers and tacos, our Happy Hours menu will keep your spirits high and your stomach full. Happy Hours at Cactus Jack's are Monday thru Thursday from 4pm until Close and All Day Sunday . Plus, our draft beer specials are always on tap during all Boston sports events! Take a peek at our Manchester and Laconia Happy Hours menus and we'll see you when the clock strikes happy! Best of Hippo Best Ribs - 3yrs (2010, 2011, 2012) Locals Say Cactus Jack's Serves the Best Ribs in New Hampshire The Hippo's Best of Awards are a celebration of all things local. We are proud to be awarded with The Hippo's Best Of award for Best Ribs in the state. For the third year in a row, Cactus Jack's is recognized by locals as the number one restaurant for ribs. Come experience our slow-roasted, tender, and juicy BBQ ribs for yourself. As a bonus to already amazing ribs, we serve up a 1 lb. Baby Back Rib Special every Wednesday! Stop by for a try at our Manchester and Laconia locations and remember, Food tastes better with friends. We Love Great Taste ® We Love Great Taste We work harder, and you can taste it! When we say it's \"homemade,\" we mean made-from-scratch ® . We develop all of our recipes in our own kitchens, making every sauce, soup, salad dressing, and dessert, right down to hand-peeling potatoes for our own creamy mashed potatoes or our signature Yukon Gold Potato Chips! Now that's Good 'n' Fresh! ® A Great NH Restaurants Company Food Tastes Better With Family™ Breathe Easy, Eat Well.™ Live Free Eat Great™ Live It Up™ We Love Big Decks™ Helpful Links Helpful Links About Photo Gallery Gift Cards Payback$ Join Our Text Club Join Our Email Club In The News Catering Random Acts of Kindness Send Feedback Careers Contact Accessibility Terms & Conditions Location Location 1182 Union Avenue, Laconia, NH, 03246 (603) 528-7800 Laconia Email Us HOURS Open Daily Daily : 4PM-12AM HOLIDAY HOURS HOLIDAY HOURS Corporate Office - Great NH Restaurants, Inc. Corporate Office - Great NH Restaurants, Inc. 1182 Union Avenue, Laconia, NH, 03246 (603) 528-7800 Email Us Join Our Newsletter Join Our Newsletter Join Our Newsletter Our Family Connect With Us Connect With Us Safe & Secure © 2025 Great NH Restaurants, Inc. All Rights Reserved"
    },
    {
      "url": "https://www.greatnhrestaurants.com/cactus-jacks.html",
      "text": "﻿ Cactus Jack's Grill & Watering Hole - A Great NH Restaurant Show content Copper Door T-BONES Cactus Jack's Laconia FEEDNH.org + CONTACT US Questions: If you need help or have any other questions, please email us or call: (603) 488-2820. Our Address: Great NH Restaurants Inc. 124 Bedford Center Road, Suite B Bedford, NH 03110 US Phone: (603) 488-2820 Map View Show map Cactus Jack's Laconia Visit Website Cactus Jack's Grill & Watering Hole serves up a taste of Americana with a distinctive Tex-Mex flair. Our menu specializes in Made-From-Scratch cuisine featuring unique appetizers, creative salads, Premium Reserve chargrilled steaks, Prime seafood, Award winning burgers, and authentic Mexican dishes. So gather 'round and experience the fresh tastes and warm welcomes of Cactus Jack's. Location Photos Virtual Tour Send Feedback Cactus Jack's Laconia 1182 Union Avenue Laconia, NH, 03246 (603) 528-7800 Daily : 4PM-12AM Holiday Hours Labor Day Closed Monday, September 1st Laconia Take Full Screen Tour Join the Conversation Stay tuned to the latest Great NH Restaurants' news, promotions, & special announcements! Like & follow Cactus Jacks Restaurant on our social channels to get involved. We Love Feedback We love hearing feedback from our guests! Become a Kriddik ® and tell us how we did! With Kriddik ® , you can send your comments, ratings, and even pictures privately and directly to the restaurant and managers. Your feedback helps us improve any weaknesses and maximize our strengths. The Good, The Bad, The Truth ℠ ."
    },
    {
      "url": "https://www.cactusindustrial.com/contact-us/",
      "text": "Contact Us | Cactus ONLINE SHOP Surface Preparation Composites Coating Service Repair MontiPower Bristle Blaster® Bristle Blaster® Cordless Bristle Blaster® Double Bristle Blaster® Axial Ultimate Zapper® Silicone Eraser Wheel Auto, Aviation, Rail & Transport Surface Technologies MBX® Vinyl Zapper® Die Blaster® Bristle Blaster® Subsea Prepper® Q4: Coming Soon Composites & Coatings Rapid-Curing PMMA Surface Repair, Waterproofing & Anti-Skid PMMA-Based Waterproof Coating PMMA-Based Self Levelling Mortar PMMA-Based Anti Slip Paint PMMA-Based Top Coat / Sealer Coat PMMA-Based Universal Primer Metal Repair & Rebuilding Compounds ARC 5 Emergency Metal To Metal Repair Epoxy ARC 5 ES Emergency Leak Sealing Putty Grade Coating ARC 10 Metal Compound ARC 858 Rebuilding and Faring Composite Live Leak Sealing Pipe Repair Kit Erosion and Corrosion Protection Epoxy Surface and Wet Tolerant Protective Coating Bioclean Antifoul Coating ARC S1PW Moderate Chemical Resistant Coating ARC S2 Ceramic Reinforced Coating ARC S4+ Severe Chemical-Resistant Coating ARC 855 Chemical and Corrosion Resistant Coating Drinking Water Approved Cleankeep 5000 DW/WRAS Rubber Repair and Protection Urethane 80 Rubber Repair and Protection Abrasion Resistant Linings ARC BX1 Coarse Abrasion Resistant Lining ARC BX2 Industrial Wear Resistant Coating ARC MX2 Fine Particle Coating High Strength Bonding Polymers Ceramic Polymer Adhesive ARC 858 Rebuilding and Faring Composite ARC 5 Emergency Metal To Metal Repair Epoxy ARC 5 ES Emergency Leak Sealing Putty Grade Coating Waterproofing Solutions PMMA-Based Waterproofing Coating Polyurethane Odourless Waterproofing Coating High Temperature Coatings ARC HT-S High Temperature Resistant Spray Coating ARC HT-T High Temperature Resistant Trowel Grade Coating Anti-Skid & High Visibility Coatings and Top Coats PMMA-Based Anti-Slip Paint Anti-Slip and Anti-Skid Rapid Curing Waterproofing Solution Polyaspartic High Visibility Coating PMMA Glow In The Dark Epoxy Day Glow High Visibility Fluorescent Coating PMMA-Based Top Coat / Sealer Coat Concrete Repair & Protection PMMA-Based Self-Levelling Mortar Epoxy High Strength Resin Screed Epoxy ARC 791 High Build Concrete Repair Chemical Resistant Screed PMMA-Based Top Coat / Sealer Coat Flange Repair & Preservation Flange Preservation Wrap ARC 10 Metal Compound Flange Face Forming Kit 234 Industries Case Studies Bristle Blaster Bristle Blasting 11,000 SqM Of Steel Coatings Removal in a Power Plant Bristle Blasting Pipeline in a Nature Reserve Composites & Coatings Live Leak Sealing a Drains Pipe Plate Bonding Offshore Impeller Protective Coating Repair About News contact us +44(0) 1698 591635 About News contact us × Speak To Our Experts Our high performance Surface Preparation and Composites and Coatings technology repairs and protects in the fight against erosion, corrosion and chemical attack. Click to Call: +44(0) 1698 591635 Click to Email: info@cactusindustrial.com Or complete the contact form below to learn how Cactus can repair and protect your operating equipment and structures. What is Your Enquiry Regarding? Bristle Blaster Subsea Bristle Blaster Ultimate Zapper MBX Composites and Coatings General Enquiry Please leave this field empty. Cactus Industrial Limited, Unit 11, Block 6 Trading Estate, Third Road, Blantyre Industrial Estate, Blantyre, G72 0UP. A Limited Company registered in Scotland No. SC468194 +44(0) 1698 591635 info@cactusindustrial.com About News contact us get expert advice: +44(0) 1698 591635 Intelligent Surface Solutions Unit 11, Block 6 Trading Estate, Third Road, Blantyre Industrial Estate, Blantyre, G72 0UP. A Limited Company registered in Scotland No. SC468194 Privacy Policy - Copyright © 2020 Cactus Industrial What is Your Enquiry Regarding? Bristle Blaster Subsea Bristle Blaster Ultimate Zapper MBX Composites and Coatings General Enquiry Please leave this field empty. Please leave this field empty. We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. OK Privacy Policy"
    },
    {
      "url": "https://www.wyomingcarboncounty.com/peppermill-bar-cactus-jack-s",
      "text": "Peppermill Bar & Cactus Jack’s Lodging Dining Visitors Guide Facebook Instagram YouTube Twitter Flickr Pinterest LinkedIn Home Places to Visit Back Rawlins Saratoga Encampment Riverside Elk Mountain Sinclair Back Baggs Savery Dixon Medicine Bow Hanna Places Directory Things to Do Back Hotsprings Museums Scenic Drives Parks & Outdoors Fishing Rafting & Boating Hiking Hunting Back Spot Wildlife Drinks & Dining Shopping Arts & Culture Rodeo Golf Courses Photo Contest Bird Watching Back RVing Camping Winter Recreation Snowmobiling Nordic Skiing Places Directory Frontier Forward Where to Stay Back Rawlins Saratoga Riverside Encampment Elk Mountain Back Baggs Savery Dixon Medicine Bow Hanna Resources Back Visitors Guide Videos Maps Places Group Venues Job Submissions Back Yellowstone Frontier Forward Links Directory Grant Applications Events Back Events Calendar Annual Events Blog Search ... Find Lodging Please enter a keyword All categories Lodging -- Bed & Breakfast -- Cabins & Cottages -- Campgrounds -- Hotels -- Lodges, Guest Ranches & Resorts -- Vacation Homes All cities Baggs Dixon Elk Mountain Encampment Hanna McFadden Medicine Bow Rawlins Riverside Saratoga Savery Sinclair Search Category List Home Where to Stay Places to Stay in Carbon County, Wyoming Drinks & Dining Peppermill Bar & Cactus Jack’s BBQ Peppermill Bar & Cactus Jack’s BBQ Peppermill Bar & Cactus Jack’s BBQ Tweet https://www.wyomingcarboncounty.com/media/com_jbusinessdirectory/pictures/companies/112/cropped-1531337351.png Address: 1602 Inverness Boulevard, Rawlins 82301, Carbon County Phone: 307-324-8100 Mobile: Cactus Jacks 307-324-7427 Website: http://www.peppermillbar.com/ Categories: Drinks & Dining Business Details Map Gallery The laid back environment allows you to choose what you most enjoy all while enjoying a refreshing drink and unwinding. Enjoy your favorite drink while unwinding with friends at Peppermill Bar & Cactus Jack’s Keywords Bar, Rawlins, Drinks, American, Food, BBQ Map Directions Maps detected! This page uses Google Maps. The map will be loaded from Google-Server and some of your data may be used by Google. In order to see the maps, please click accept. You can also click here to see further information related to this. Deny Accept INFO In order to perform this action you have to login Click here to login Some of the listing features are available only for registered users. Please login to view all listing details! INFO In order to perform this action you have to login Click here to login Communities Baggs Dixon Elk Mountain Encampment Hanna Medicine Bow Rawlins Riverside Saratoga Savery Activities Fishing Snowmobiling Hot Springs Hiking Boating Hunting Nordic Skiing Camping Museums Scenic Drives Rodeos Bird Watching Golfing Shooting Ranges Discover Dinos Information Visitors Guide Request County Directory Conference Venues Maps Video Library Download the Discover Carbon County App The Discover Carbon County app is designed to help you plan the perfect vacation, trip or weekend getaway in Carbon County! Discover activities and attractions that match your interests View upcoming events near you Add events and places to your custom trip Share events, places and your itinerary with friends and family Carbon County Visitors Council 1-800-228-3547 or 307-324-3020 PO Box 1017, Rawlins, WY 82301 info@wyomingcarboncounty.com Our administrative office is located at 105 E Cedar, Rawlins, WY Explore Our Communities Get a Visitors Guide The Carbon County Visitors Guide is a great resource for planning your visit. Download a digital version or have a printed guide mailed to you. Download Guide Get a Mailed Guide Privacy Policy Site Map Grants Travel Safe Press & Media Master Plan Wyoming Tourism Web Site Design by: Waves Web Design © Carbon County Visitors Council • All Rights Reserved."
    },
    {
      "url": "https://www.cactusjacksnh.com/about-us.html",
      "text": "Cactus Jack's Grill & Watering Hole: About Us Menus Lunch & Dinner Dessert Drinks Order Online Cactus Jack's Laconia Looking for T-BONES Laconia? Promotions Ding Dong Deliver Gift Cards Loyalty About Join Our Team How'd We Do? Join Our Email Club Join Our Text Club Cactus Jack's 1182 Union Avenue, Laconia, NH 03246 (603) 528-7800 Laconia Email Us Hours Daily : 4PM-12AM Holiday Hours Donations News & Awards Photos Contact My Cart: 0 item(s) Your Shopping Cart Is Empty CAREER INTEREST JOB OPPORTUNITIES WITH GREAT NH RESTAURANTS! Apply Today! Our Brands Our Brands Secure Checkout … Home About Us Promos Gift Cards Loyalty About Email Club Random Acts of Kindness Testimonials Photos News & Awards Contact Join Our Team Donations About Us Who We Are Welcome to Great New Hampshire Restaurants , a proud family of nine vibrant eateries that began with T-BONES Great American Eatery and CJ's Great West Grill. As we evolved, Cactus Jack's Grill & Watering Hole and Copper Door® joined our ranks, all rooted in the heart of six wonderful communities: Bedford , Concord , Derry , Hudson , Laconia , and Salem . Founded by the visionary duo Mark Fenske and Tom Boucher, our journey began in the dynamic world of Restaurant & Hospitality. Both partners discovered their passion for this industry while pursuing their education, trading textbooks for the excitement and camaraderie of restaurant life. T-BONES Great American Eatery opened its doors in 1984, setting the standard for Made-from-Scratch™ American cuisine served in a warm, welcoming atmosphere. Mark, alongside two partners, launched the first location in Salem, NH. In 1986, Tom took a food server role in Hudson during his holiday break, a decision that transformed his life and led to the opening of the Bedford location in 1989. Together, they created CJ's Great West Grill in 1995, followed by a series of successful ventures, including additional T-BONES locations and the unique Copper Door concept. Our commitment extends beyond delicious food. In 2014, we founded the Great NH Restaurants Charitable Trust, FEEDNH.org , and have proudly donated over $1 million to support families, the elderly, education, and the disadvantaged in our beautiful state. Our mission reflects our belief in giving back to the communities that have embraced us. At Great New Hampshire Restaurants, family is more than just a word; it’s the essence of who we are. Our culture fosters loyalty, and many of our employees have been with us for years because they feel valued and connected. Each restaurant carries its unique personality, shaped by the passionate individuals who bring it to life. In 2008, we established Great New Hampshire Restaurants as our managing company to uphold our commitment to excellence and transparency. We strive to deliver an exceptional dining experience to every guest, ensuring that our family spirit shines through in everything we do. We can’t wait to welcome you to our table! We Work Hard... And We Play Hard! Join Great NH Restaurants Inc. , excels in providing exceptional food, excellent service, and a friendly atmosphere to New Hampshire for over three decades! We are looking for reliable, motivated people with great attitudes. Experience is a plus, but personality is a NECESSITY! Apply Now! Great Stuff @Great NH Restaurants! A special thank you to all our loyal guests, employees, and FEEDNH.org supporters Our Core Values We Love Great Taste ® We Love Great Taste We work harder, and you can taste it! When we say it's \"homemade,\" we mean made-from-scratch ® . We develop all of our recipes in our own kitchens, making every sauce, soup, salad dressing, and dessert, right down to hand-peeling potatoes for our own creamy mashed potatoes or our signature Yukon Gold Potato Chips! Now that's Good 'n' Fresh! ® A Great NH Restaurants Company Food Tastes Better With Family™ Breathe Easy, Eat Well.™ Live Free Eat Great™ Live It Up™ We Love Big Decks™ Helpful Links Helpful Links About Photo Gallery Gift Cards Payback$ Join Our Text Club Join Our Email Club In The News Catering Random Acts of Kindness Send Feedback Careers Contact Accessibility Terms & Conditions Location Location 1182 Union Avenue, Laconia, NH, 03246 (603) 528-7800 Laconia Email Us HOURS Open Daily Daily : 4PM-12AM HOLIDAY HOURS HOLIDAY HOURS Corporate Office - Great NH Restaurants, Inc. Corporate Office - Great NH Restaurants, Inc. 1182 Union Avenue, Laconia, NH, 03246 (603) 528-7800 Email Us Join Our Newsletter Join Our Newsletter Join Our Newsletter Our Family Connect With Us Connect With Us Safe & Secure © 2025 Great NH Restaurants, Inc. All Rights Reserved"
    },
    {
      "url": "https://whatpub.com/pubs/SHF/220/cactus-jacks-honky-tonk-sheffield",
      "text": "Cactus Jacks Honky Tonk, Sheffield • whatpub.com WhatPub will be shut down from 1st October 2025. You don’t have to do anything,\n                but after this date whatpub.com will automatically redirect you to the CAMRA website. Try the new CAMRA website WhatPub will be shut down from 1st October 2025 We’ve brought all our data and pub-going tools together, so you can get the best of everything CAMRA has to offer in one convenient place. You don’t have to do anything, but after this date whatpub.com will automatically redirect you to the CAMRA website. Try the CAMRA website Prefer to stay on this page? No problem! Click here to remain on the current site. Join CAMRA | Member Login Home About Search FAQs Cookies Service Announcement Search > Cactus Jacks Honky Tonk New Search About Location Submit Updates Nearby Recently Viewed (1) NOTICE :Opening hours and services may be different from those displayed here. Before visiting, we advise that you check ahead by phone or via social media to avoid disappointment. If you see any details here that need updating, please let us know by submitting updates on the pub . Cactus Jacks Honky Tonk (formerly Bowery; Cornershop; Be at One; Zinc; Coco Lounge) 176 Devonshire Street City Centre Sheffield S3 7SG View on Map Real Ale is NOT Available None Opening Times Regular Monday Closed Tuesday Closed Wednesday 5.00 pm - 1.00 am Thursday 5.00 pm - 1.00 am Friday 4.00 pm - 1.00 am Saturday 3.00 pm - 1.00 am Sunday 5.00 pm - 1.00 am About\n                         the Pub A Nashville themed bar, with live country and western music Historic Interest A new build in 2009 as the Bowery, became Cornershop, then Be at One, then Zinc, then Coco Lounge, and now Cactus Jacks Honky Tonk. Regular ales No beers listed Add regular beers Add changing beers Updated on 31/07/2024\n                                                        Branch responsible is Sheffield & District Seen some incorrect or missing details? Send an email to the CAMRA branch with your updates. Email this pub to a friend Facilities Events DJs play county music. Wifi View on Larger Map Cactus Jacks Honky Tonk 176 Devonshire Street City Centre Sheffield S3 7SG Sat Nav Reference 53.379804, -1.479824 Transport Close to Bus Routes Close to Metro Nearby Bus Routes (< ½ mile) Closest\n                                                        Station (1100m) Sheffield Nearby\n                                                            Metro (150m) West Street Sheffield Submit Pub Updates to CAMRA We welcome the help of all users to contribute to this important campaigning project. Please use the form below to submit feedback or updates directly to the  CAMRA branch for consideration. Please note that any changes mentioned WILL NOT have an immediate effect on whatpub.com but will instead be emailed directly to the  CAMRA branch Pubs Officer for consideration. If you provide your name and/or email address this information will also be visible to the Pubs Officer, who may use this information to follow up your feedback. IF YOU WISH TO CONTACT THE PUB DIRECT, PLEASE DO NOT USE THIS FORM. Logged in CAMRA members do not need to enter their name, email or pass the captcha. Go to Login page Your Name:* Your Email Address:* Message:* Send to CAMRA Results are based on your filters selected. View or change them on the search page here Green Room 0.0 miles (0.1km) 150 Devonshire Street City Centre Sheffield S3 7SG Pub Features Wick at Both Ends 0.0 miles (0.1km) 149-151 West Street City Centre Sheffield S1 4EW Pub Features Red Deer 0.1 miles (0.1km) 18 Pitt Street City Centre Sheffield: Central S1 4DD Pub Features Forum Cafe Bar 0.1 miles (0.2km) 127-129 Devonshire Street City Centre Sheffield S3 7SB Pub Features Bath Hotel 0.1 miles (0.2km) 66-68 Victoria Street City Centre Sheffield: Central S3 7QL Pub Features Common Room 0.1 miles (0.2km) 127-129 Devonshire Street City Centre Sheffield S3 7SB Pub Features See all pubs Cactus Jacks Honky Tonk 176 Devonshire Street City Centre Sheffield S3 7SG Pub Features Submit Beer Scores The National Beer Scoring System has been upgraded and is now fully integrated with whatpub.com, making finding a pub and scoring your beers much easier. Beer scoring is only available to CAMRA members. To start scoring please login below or join CAMRA on the national website. Join CAMRA | Member Login Campaign for your local We campaign on a number of issues to help keep pubs open and pints affordable. If you love beer and pubs, get involved today! Find out more Nearby Pubs See All Green Room Sheffield Read More Wick at Both Ends Sheffield Read More Red Deer Sheffield: Central Read More Forum Cafe Bar Sheffield Read More Bath Hotel Sheffield: Central Read More Common Room Sheffield Read More Features Real Ale Available Disabled Access Live Music LocAle Accredited Events Close to Metro Close to Bus Routes Features Real Ale Available Evening Meals Disabled Access Function Room Live Music Events Close to Metro Close to Bus Routes Features Real Ale Available Garden Lunchtime Meals Evening Meals Smoking Area Function Room Dog Friendly Live Music Member Discount Scheme Events Close to Metro Close to Bus Routes Features Real Ale Available Family Friendly Garden Lunchtime Meals Evening Meals Disabled Access Smoking Area Live Music LocAle Accredited Events Close to Metro Close to Bus Routes Features Real Ale Available Cask Marque Accredited Quiet Pub Traditional Pub Games Dog Friendly Live Music Events Close to Metro Close to Bus Routes Historic Pub Interior Features Real Ale Available Lunchtime Meals Evening Meals Disabled Access Traditional Pub Games Function Room Sports TV LocAle Accredited Events Close to Railway Station Close to Metro Close to Bus Routes Features Home | About | Search | FAQs | Cookies | Service Announcement | Join CAMRA Campaign for Real Ale, 230 Hatfield Road, St Albans, Hertfordshire, AL1 4LW ( Map ) www.camra.org.uk | Email: camra@camra.org.uk | Tel: 01727 867201 | Fax: 01727 867670 This Web site is produced by the Campaign for Real Ale (CAMRA). All pages, their contents and related items are provided \"as is\". Thus no liability, consequential or otherwise, arising from them is accepted. Where not already belonging or assigned to others, all material remains our copyright."
    },
    {
      "url": "https://www.cactusjacksnh.com/contact-us.html",
      "text": "Cactus Jack's Grill & Watering Hole: Contact Us Menus Lunch & Dinner Dessert Drinks Order Online Cactus Jack's Laconia Looking for T-BONES Laconia? Promotions Ding Dong Deliver Gift Cards Loyalty About Join Our Team How'd We Do? Join Our Email Club Join Our Text Club Cactus Jack's 1182 Union Avenue, Laconia, NH 03246 (603) 528-7800 Laconia Email Us Hours Daily : 4PM-12AM Holiday Hours Donations News & Awards Photos Contact My Cart: 0 item(s) Your Shopping Cart Is Empty CAREER INTEREST JOB OPPORTUNITIES WITH GREAT NH RESTAURANTS! Apply Today! Our Brands Our Brands Secure Checkout … Home Contact Us Promos Gift Cards Loyalty About Email Club Random Acts of Kindness Testimonials Photos News & Awards Contact Join Our Team Donations Contact Us Your satisfaction is important to us! Our commitment to your dining or takeout experience is important to us. Use the form to email us your questions about our menus, Gift Card ordering, online orders, store experiences and more. Looking for T-BONES? Great NH Restaurants, Inc. 124 Bedford Center Road, Suite B Bedford, NH, 03110 (603) 488-2820 Cactus Jack's Grill & Watering Hole 1182 Union Avenue Laconia, NH 03246 (603) 528-7800 Visit Us At Our Sister Brand T-BONES Great American Eatery View Hours We Love Great Taste ® We Love Great Taste We work harder, and you can taste it! When we say it's \"homemade,\" we mean made-from-scratch ® . We develop all of our recipes in our own kitchens, making every sauce, soup, salad dressing, and dessert, right down to hand-peeling potatoes for our own creamy mashed potatoes or our signature Yukon Gold Potato Chips! Now that's Good 'n' Fresh! ® A Great NH Restaurants Company Food Tastes Better With Family™ Breathe Easy, Eat Well.™ Live Free Eat Great™ Live It Up™ We Love Big Decks™ Helpful Links Helpful Links About Photo Gallery Gift Cards Payback$ Join Our Text Club Join Our Email Club In The News Catering Random Acts of Kindness Send Feedback Careers Contact Accessibility Terms & Conditions Location Location 1182 Union Avenue, Laconia, NH, 03246 (603) 528-7800 Laconia Email Us HOURS Open Daily Daily : 4PM-12AM HOLIDAY HOURS HOLIDAY HOURS Corporate Office - Great NH Restaurants, Inc. Corporate Office - Great NH Restaurants, Inc. 1182 Union Avenue, Laconia, NH, 03246 (603) 528-7800 Email Us Join Our Newsletter Join Our Newsletter Join Our Newsletter Our Family Connect With Us Connect With Us Safe & Secure © 2025 Great NH Restaurants, Inc. All Rights Reserved"
    },
    {
      "url": "https://foursquare.com/v/sundowners/4b92ec2cf964a520512734e3",
      "text": "Log in Foursquare City Guide Sign Up Nearby: Get inspired: Top Picks Trending Food Coffee Nightlife Fun Shopping Log in to Foursquare Email or Phone Number: Password: (Forgot password?) Sign up for Foursquare Log in with Facebook You must enable JavaScript to use foursquare.com We use the latest and greatest technology available to provide the best possible web experience. Please enable JavaScript in your browser settings to continue. Download Foursquare for your smart phone and start exploring the world around you!"
    }
  ]
}