{
  "fuentes": [
    {
      "url": "https://www.westpalmbeach.com/westpalmbeach-com-spotlight-paul-jamieson-executive-director-of-sunfest-music-festival/",
      "email": "home@2x.png"
    },
    {
      "url": "https://www.wlrn.org/arts-culture/2024-05-02/sunfest-west-palm-beach-nelly-shaggy-dibut-music-festival",
      "email": "jmarch@wlrn.org"
    },
    {
      "url": "https://www.wlrn.org/arts-culture/2024-05-02/sunfest-west-palm-beach-nelly-shaggy-dibut-music-festival",
      "email": "wbrutus@wlrnnews.org"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.sunfestconcerts.com/faq/",
      "email": "boxoffice@laketownevents.com"
    },
    {
      "url": "https://www.sunfestconcerts.com/faq/",
      "email": "info@laketownevents.com"
    },
    {
      "url": "https://www.westpalmbeach.com/event/sunfest-music-festival-tickets-lineup-wpb/",
      "email": "home@2x.png"
    },
    {
      "url": "https://www.sunfest.org.au/about-us",
      "email": "info@sunfest.org.au"
    },
    {
      "url": "https://www.ohjeanrecords.com/blogs/news/orville-peck-biography",
      "email": "logo_colour_alt_5_3bc70474-31a7-4dee-ae7b-ba98f48154ba_120x@2x.jpg"
    },
    {
      "url": "https://www.ohjeanrecords.com/blogs/news/orville-peck-biography",
      "email": "zp@ohjeanrecords.com"
    },
    {
      "url": "https://www.sunfest.org.au/contact-us",
      "email": "info@sunfest.org.au"
    },
    {
      "url": "https://business.palmbeaches.org/list/member/sunfest-of-palm-beach-county-inc-8837",
      "email": "chamber@palmbeaches.org"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "email": "enquiries@mnsi.org.uk"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "email": "enquiries@mnsi.org.uk"
    },
    {
      "url": "https://www.sunfestconcerts.com/contact/",
      "email": "boxoffice@laketownevents.com"
    },
    {
      "url": "https://www.sunfestconcerts.com/contact/",
      "email": "corporate@laketownevents.com"
    },
    {
      "url": "https://www.sunfestconcerts.com/contact/",
      "email": "info@laketownevents.com"
    },
    {
      "url": "https://www.sunfestconcerts.com/contact/",
      "email": "media@laketownevents.com"
    },
    {
      "url": "https://www.sunfestconcerts.com/contact/",
      "email": "volunteer@laketownevents.com"
    },
    {
      "url": "https://www.yahoo.com/entertainment/articles/sunfest-gone-now-free-downtown-144750916.html",
      "email": "amarra@pbpost.com"
    },
    {
      "url": "https://www.yahoo.com/entertainment/articles/sunfest-gone-now-free-downtown-144750916.html",
      "email": "u003ebillhimself@yahoo.com"
    },
    {
      "url": "https://www.yahoo.com/entertainment/articles/sunfest-gone-now-free-downtown-144750916.html",
      "email": "u003eamarra@pbpost.com"
    }
  ],
  "mails": [
    "amarra@pbpost.com",
    "boxoffice@laketownevents.com",
    "chamber@palmbeaches.org",
    "corporate@laketownevents.com",
    "enquiries@mnsi.org.uk",
    "home@2x.png",
    "info@laketownevents.com",
    "info@reception-plus.de",
    "info@sunfest.org.au",
    "jmarch@wlrn.org",
    "logo_colour_alt_5_3bc70474-31a7-4dee-ae7b-ba98f48154ba_120x@2x.jpg",
    "media@laketownevents.com",
    "tstuder@astrosecuritymonitoring.com",
    "u003eamarra@pbpost.com",
    "u003ebillhimself@yahoo.com",
    "volunteer@laketownevents.com",
    "wbrutus@wlrnnews.org",
    "zp@ohjeanrecords.com"
  ],
  "nombre_sitio": "sunfest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.westpalmbeach.com/westpalmbeach-com-spotlight-paul-jamieson-executive-director-of-sunfest-music-festival/",
      "text": "WestPalmBeach.com Spotlight: Paul Jamieson, Executive Director of SunFest Music Festival Thursday , September 11 2025 Miami Dolphins, Kesha, Jason Aldean, Twenty One Pilots > BEST Seats & Tickets! WestPalmBeach.com Visitors Guide to West Palm Beach, FL Home Calendar Concert Tickets Hotels & Resorts Attractions Activities Fishing Golf History Jobs Real Estate Restaurants Shops Clematis CityPlace Weather Contact Ticket Support WestPalmBeach.com Spotlight: Paul Jamieson, Executive Director of SunFest Music Festival! Paul Jamieson is the Executive Director of the SunFest Music Festival and is passionate about promoting a growing community foundation in Palm Beach County. Paul moved to Florida in 1986 where his journey in creating what is now a nationally-recognized music festival began. Originally from Chicago, he now lives in the Historic District of Mango Promenade in West Palm Beach and is proud to proclaim that the vibrancy of this city is what makes him happy to call it home. Frankee Cuzzola: Please tell our readers a little about yourself. Paul Jamieson: I moved to Florida in 1986 to be the Special Events Coordinator at the City of Ft. Lauderdale. After two years there and another two with Winterfest (the Ft. Lauderdale Boat Parade), I joined the staff at SunFest as the Event Manager. I then had the good fortune to eventually move to the position of Executive Director. On a personal note I have three grown children who now live in other parts of the country but almost always get back for the festival. I live in a historic home in the Mango Promenade neighborhood of West Palm Beach. You’ve been the executive director of SunFest since 1996. What are some of the biggest positive impacts you have seen in West Palm Beach in coalition with SunFest? In that time SunFest has grown from a notable local arts festival to a nationally-recognized music festival. In 2018, we attracted visitors from every part of Florida, 49 states, and 20 foreign countries. Those visitors create a strong economic impact that grows every year. That’s the reason the festival was created and we’re proud to stay true to that mission. In a less visible, yet no less important way, SunFest has a number of initiatives that create a positive impact for the community. Our current programs include partnering with a number of charities on fundraising opportunities at the festival; offering a college scholarship as part of the Pathfinder Awards;distributing thousands of tickets to underserved audiences and creating a ‘mini-festival’ for special needs children who likely would never be able to attend the actual festival. When kicking off the event, what are some of the first steps you take? Planning and producing the festival is a total team effort that is really more of an ongoing process than something that has a ‘first step.’ We have a base of about 150 volunteers who are active year round as well as a full time professional staff of ten people. Things that need to be done differently or better are apparent to at least someone in this group before, during or after the festival. My job is mainly to prioritize and get everyone on the same page. When building the event, what is your main focus when you begin to create the lineup? Building the lineup is something that happens over a six month period and to a very large degree is based on who is available to us. Many performers are neither working nor plan to be in this part of the country on the festival dates, so it’s always a ‘do the best with what we have’ situation. That’s why the festival may take on some different characteristics from year to year. We really do try to make everyone happy, although we know that’s not at all possible. What have been some of your favorite performances? I have an affinity for performers who really put everything they have into providing a great experience for our patrons. Names that pop into my head come up across all genres from Jackson Browne to Nelly, Lindsey Sterling to Marshmello, to a Damien Marley and Nasshow on one scorching hot weekend afternoon. As you can see, my tastes are all over the place. What is your favorite part about building SunFest? The people. Patrons who come to enjoy the live music and the volunteers who put their lives on hold to make the festival a reality. Imagine working with a group of people who are doing what they do simply because they love to do it. Not many people can say that about their jobs. How do you manage or accommodate last minute changes, for example, if an act has to drop the show? We’ve been fortunate with very few cancellations over the years, but it does happen. Performers can experience the same things we do – they may become ill or get hurt or have some other type of emergency pop up. You try to do the best you can to replace the cancelling act with something that is similar but that’s not always possible. A few years ago we had to replace ZZ Top at the last minute and the best we could do was O.A.R. Great band, who did a great show, but it was not quite what classic rock fans were looking for. What do you think makes SunFest different than most music festivals? Three P’s. People – our volunteers give the festival a grass-roots community foundation that not many major music festivals can match. Price – what we offer at the price we charge is, by the standards of major music festivals, ridiculously inexpensive. Place – the downtown waterfront is as beautiful a place as any music festival can call home. Can you give our readers a taste of who might be performing this year? I can only say that we’re happy with what we have so far and are working hard to complete the full lineup. We do plan to announce in mid-January rather than mid-February so you won’t be in suspense that much longer. Paul Jamieson, what do you love most about West Palm Beach? Being originally from Chicago, the weather and tropical vibe are hard to take for granted though it seems expected from the Sunshine State. So when I look at West Palm Beach by comparison to other cities in the state, I connect and love the vibrancy it has. That’s created by the great people who make unique businesses and call this area home. I’ve had the good fortune to meet so many of them. So, people (yet again) has to be my number one. For more information about SunFest, please visit SunFest.com WestPalmBeach.com : The Complete Guide to West Palm Beach, FL! About David David J Castello is the Editor-in-Chief and Chief Operating Officer for the Castello Cities Internet Network (WestPalmBeach.com, Nashville.com, PalmSprings.com, etc). His debut novel, The Diary of an Immortal (1945-1959) was published in 2016.\r\nVisit: www.DavidCastello.com Previous Newsboys United & Michael W. Smith – Coral Sky Amphitheater – April 27th Next The Exonerated – May 10th & 11th – Actor’s Rep Theater Related Articles West Palm Beach Summer Activities! The Barefoot Mailman West Palm Beach Restaurants on the Water WestPalmBeach.com Spotlight: Audrey Gruss and Hope For Depression Check Also WestPalmBeach.com Spotlight: Bob Carter, Founder of Actors’ Rep Bob Carter is the founder and artistic director of Bob Carter’s Actor’s Workshop and Repertory … Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name Email Website West Palm Beach Concerts & Events! West Palm Beach Concerts & Events! West Palm Beach Hotels At The Best Rates! Best Rates For West Palm Beach Hotels! Miami Dolphins Tickets! Miami Dolphins Game Schedule, Tickets & Packages > BEST Premium Seats! West Palm Beach Attractions! Top 10 West Palm Beach Attractions! West Palm Beach Jobs! West Palm Beach Jobs! | WestPalmBeach.com Home | Activities | Attractions | Calendar of Events | CityPlace | Clematis Street | Concert Tickets | Fishing | Golf Courses | History | Hotels & Resorts | Jobs | Real Estate | Restaurants | Souvenirs | Weather | Contact Us WestPalmBeach.com may be for sale. Serious inquiries only. Guide to Boynton Beach, FL Guide to Jupiter Island, FL Guide to Nashville, TN Guide to North Las Vegas, NV Guide to Palm Springs, CA Guide to Singer Island, FL"
    },
    {
      "url": "https://www.wlrn.org/arts-culture/2024-05-02/sunfest-west-palm-beach-nelly-shaggy-dibut-music-festival",
      "text": "SunFest: Why local artists will shine alongside national acts in West Palm Beach | WLRN Search Query Show Search HOME News Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Radio & Podcasts Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Newsletters TV Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Support Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle About WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate MORE Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting © 2025 WLRN Menu Show Search Search Query DONATE Play Live Radio Next Up: 0:00 0:00 0:00 0:00 Available On Air Stations On Air Now Playing WLRN NPR News On Air Now Playing WLRN Classical All Streams HOME News Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Radio & Podcasts Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Newsletters TV Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Support Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle About WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate MORE Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Arts & Culture SunFest: Why local artists will shine alongside national acts in West Palm Beach WLRN Public Media | \n                    By Wilkine Brutus Published May 2, 2024 at 5:23 PM EDT Facebook Twitter LinkedIn Email Listen • 1:15 Leah Dibut After winning in her music category at the virtual \"Open for an Icon\" competition,  South Florida-based Pop-Hip Hop artist Leah Dibut is scheduled to open up for Hip Hop star Nelly and reggae star Shaggy at this year's SunFest in Downtown West Palm Beach. Three stages. Three days. More than twenty-five performers. It’s that time of the year when West Palm Beach's largest music festival attracts a swarm of music aficionados to its waterfront, feasting on food and drinks, and vibing to a diverse lineup of live bands — from Third Eye Blind and Billy Idol to Matisyahu and Cole Swindell. More than a dozen of South Florida's top-tier artists will be grooving through SunFest stages alongside national acts. That includes music competition winners who are scheduled to open up for legendary headliners — part of an assertive effort to spotlight rising local talent from the clutter of music streaming options, said festival organizers. After winning in her music category at the virtual \"Open for an Icon\" competition, Palm Beach County-based pop-R&B artist Leah Dibut is scheduled to open up for hip hop star Nelly and reggae legend Shaggy at this year's event along the Intracoastal Waterway in Downtown West Palm Beach. “It’s unbelievable,” said Dibut, who is originally from Miami. READ MORE: 'Death of a Salesman' at Palm Beach Dramaworks is still 'socially relevant' - 70 years later Dibut and Ocala-based country music artist Noah Hunton, who’s opening up for country staple Cole Swindell, beat out more than a thousand artist entrees. The virtual competition was held by Jupiter-based AirTab Music, an artist-discovery platform in partnership with SunFest. Fans got a chance to vote for their favorite artist through a series of rounds. Dibut, whose lead single Feeling Myself has more than 62,000 views, said the opportunity to perform alongside headliners is a career game changer. “And it honestly, truly made me look back to all that work that I put into my career and it's finally paying off now,” she told WLRN. SunFest/Airtab Music South Florida-based Pop-Hip Hop artist Leah Dibut and Ocala-based country music artist Noah Hunton won the virtual competition “Open for an Icon” at this year’s SunFest, beating out more than a thousand artist entrees. She said her new exposure is also a testament to efforts led by SunFest and AirTab Music. Dennis Cunningham, founder and CEO of AirTab Music, told WLRN that fans involved in music competitions and programs should be seen as lead tastemakers who hold more weight than competition judges or media. “So the people spoke,” Cunningham told WLRN. Fans get to say I “have a role in this. I could actually help get my artists, my musician on the stage,” he added. Cunningham said AirTab Music is there to “help discover talent that doesn't have a platform” because “there's a lot of noise in music on streaming,” referring to the increased amount of online music options on various social media platforms. “We're discovering new talent that otherwise wouldn't have a chance to get that discovery. People are going to go listen to Nelly. He's amazing. And Shaggy,\" Cunningham said. \"And now to have someone of an unknown, it's like a Rocky Balboa story. She comes out of nowhere all of a sudden, there she is.” Past \"Open for an Icon\" competition winners have shared the stage alongside artists such as Usher and Gwen Stefani. School bands among the local artists on stage In recent years, SunFest has made strides to support local musicians, part of the organization's ongoing effort to invest in homegrown musical talent. Organizers said the annual event is “shining a light on local Florida bands and bringing fresh sounds,” specifically through the “ Fresh Local Artist Series ” on SunFest’s Sandbar Stage. The diverse lineup covers everything from jazz to pop-rock, and includes Palm Beach County school bands John I. Leonard Jazz Band, Inlet Grove High School, New Phi Thang Drumline, and West Boca High School Jazz Band. Florida artist set to hit the stage include: Ben Krieger Brett Staska the Souvenirs Buko Boys Disbarred Hello Sister I’m Dru! Jutt Huffman NIGHTBREAKERS School of Rock, South Palm Beach House Band School of Rock, North Palm Beach House Band Shaw Davis & The Black Ties The Floridians Vern Daysel and the Burning Breeze The festival kicks off at 5 p.m. on May 3. IF YOU GO SunFest WHEN: May 3 to May 5 WHERE: Flagler Drive in West Palm Beach. For more information, visit sunfest.com Tags Arts & Culture News Local News Palm Beach County SunFest West Palm Beach Music Facebook Twitter LinkedIn Email Wilkine Brutus Wilkine Brutus is the Palm Beach County Reporter for WLRN. The award-winning journalist produces stories on topics surrounding local news, culture, art, politics and current affairs. Contact Wilkine at wbrutus@wlrnnews.org See stories by Wilkine Brutus Public funding is gone. But WLRN is still here—because of YOU. WLRN has lost over $3 million in federal and state support. Your donation today helps fill the gap and keeps trusted, local journalism alive. If you value the stories you read, please give now. Support WLRN Latest Stories Law & Justice Appeals court upholds Florida law restricting non-citizens from collecting petitions Government & Politics ‘Horrified’: Florida politicos respond to Charlie Kirk shooting Law & Justice Trial starts for a man accused of attempting to assassinate Trump in South Florida Environment Warm seas help stone crabs reach the Chesapeake. What does that mean for crabs in Florida? More On This Topic Andrew Huse, historian of the Cuban sandwich, dies at 52 Lights, Camera, Miami: Local film festival launches workshop for future filmmakers Miami's legendary Churchill's Pub stages a comeback after five-year hiatus Jayne Kennedy reflects on breaking NFL barriers, personal struggles, and her iconic Muhammad Ali moment Stay Connected twitter instagram youtube pinterest facebook linkedin © 2025 WLRN About Contact Us Donate Underwrite Shop Newsletters FCC Public Files WLRN-TV FCC Public File WLRN-FM FCC Public File WKWM-FM FCC Public File WLRN Public Files and Records EEO Report Station Public Files Contact - James March  (305) 995-2446 or JMarch@wlrn.org WLRN Management"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. E-Mail Nachricht Datenschutz First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.sunfestconcerts.com/faq/",
      "text": "FAQ | Sunfest Country Music Festival Tickets 2025 Lineup Festival Info FAQ Info Rules Maps Past Artists Getting Here Sponsors Connect Contact Newsletter Signup Artist Applications Volunteer Applications Staff Applications Vendor Applications Laketown Ranch Benevolent Society Tickets 2025 Lineup Festival Info FAQ Info Rules Maps Past Artists Getting Here Sponsors Connect Contact Newsletter Signup Artist Applications Volunteer Applications Staff Applications Vendor Applications Laketown Ranch Benevolent Society FAQ scroll Sunfest FAQ What time is quiet time in the campsites? Quiet time in the campground is from 12am-8am. Generators must be turned off during this time, and music must be turned off after 1am. Please be respectful and courteous of your neighbours! Excessive noise after 1am is grounds for eviction. I need help with ticketing, who do I call? Simply log into your Sunfest account to purchase camping or tickets online, or contact the box office at boxoffice@laketownevents.com or by calling (250) 710-5868 . What are the Sunfest Hours of Operation? Camping Load-In Wed-Sun 1pm-9pm (Wed/Thurs Early Entry Campers, be sure to only show up for your scheduled time) Entry Gate - Thurs-Sun 1pm-9:30pm Box Office - Wed-Sun 1pm-9:30pm Concert Bowl Gates - Thurs-Sun 4pm-1am (Must have valid wristband) Reserved Seating - Fri-Sun 5pm-12am Concert Bowl Pit Area - Fri-Sun 5pm-12am Lakenight Stage - Thurs-Sun 6pm-late Flats Stage - Thurs 6pm-1am & Fri-Sun 2pm-1am VIP Lounge - Fri-Sun 5pm-12am Lookout Lounge - Fri-Sun 5pm-12am Guest Services - Thurs-Sun 1pm-9pm Onsite Shuttles - Thurs-Sun 4pm-1am Showers/Ice (Lower & Upper) - Thurs-Sun 8am-8pm Camping Check-Out - Monday, August 4th by 11am Do I need a special wristband to access the campgrounds? Yes. In order to access the campgrounds at Sunfest, you must have the relevant single day or weekend festival wristband AND a camping wristband. Sunfest is a music festival that features camping, it is not a camping only event. Wristbands may be purchased online in advance of the festival, or at the Box Office in Laketown Flats over the festival weekend. What is the 'no re-entry after 8pm' policy? As a result of changes initiated by BC Liquor Control, our insurance provider, and supported by the RCMP and Sunfest Management, our Sunfest policy is:  “no re-entry into the main festival bowl after 8pm”. The majority of our fans are responsible and know their limits with alcohol, but we have to be mindful of ALL Sunfest fans on-site. When guests leave the bowl in between sets and drink at their campsites, then re-enter the festival bowl, this poses a risk to all guests. Over intoxication of patrons is a safety issue for all. As well, fines and/or the loss of our liquor license would have a major impact on the entire festival and all our responsible fans. Guests returning to the bowl, along with new arrivals at the gate, also leads to excessive lineups and wait times that security and the RCMP must negotiate. The security checks required have changed for everyone’s safety, including our artists, and it takes time to do properly. Waiting at the gate and missing part of the show is not enjoyable for anyone. Our Insurance provider has also expressed concerns regarding these issues and the festival promoters cannot risk losing insurance for events. Laketown encourages all Sunfesters to plan accordingly and bring a sweater as well as any personal items you may need for the last 3 hours of the show. Please note this policy is common at most large venues and we are now being held to the same standard. Do we make exceptions? Yes - see a Laketown Ranch gate director and explain your situation. Are kids free? Children aged 0-6 General Admission passes are free of charge. Children aged 7-12 General Admission passes are discounted (Please visit the ticketing site for details). This ticket comes with a free zipline pass for each day for your kiddos to enjoy! Note that VIP, Lookout Lounge, Stage Pit, & Lawn (Reserved Seating) area access requires a full-priced ticket for children under 6 years of age. How much do showers cost? $5 per person. Shower purchases are cash only.  ATMs are available throughout the site. Is there First Aid and Harm Reduction on Site? Festival Health Services is available 24/7 offering a variety of support and services for guests Guest Supplies and Information for Festival Health Safety First Aid for wound care, bone and joint injuries, environmental health concerns First Response for on site medical emergencies Peer Support for mental health Sanctuary and Safe Space for guests experiencing the non-desired effects of recreational substance use Where is the Lost & Found? Head over to the Guest Services building, where our Lost & Found is located. We have great volunteers there who will do their best to reunite you with anything you’ve lost. Please secure your valuables throughout the weekend. Post event, items are held on-site from 9am-5pm on Tuesday then transferred to the Wideglide Entertainment Ltd. office in Duncan. Please email info@laketownevents.com for information. How do I become a vendor? Please tell us about your business and your products by filling out a Vendor Application . Approved vendors will be chosen based on product/services, VIHA requirements, insurance compliance, menu offerings and many other factors. We limit the number of booths selling the same items so our patrons can have a variety of options. How do I become a volunteer? We are looking for fun, friendly and reliable Sunfest fans that want to be part of our team. Fill out our volunteer application . How do I become an artist? Are you ready to play the Sunfest stage? Apply to be an artist . How do I become an art installer? Are you an established or blossoming visual artist that wants to paint or build something amazing at Laketown Ranch? Apply to be an art installer . Does Sunfest do charitable work? Giving back to the community is part of who we are at Sunfest, and will continue to be a measure of our success. It is so important in fact, that we have an incorporated benevolent society. Our legacy of community alliance spans over a decade,  donating over $1,250,000 to over 50 charities, non-profits, schools, community partners and causes. To learn more about the Laketown Ranch Benevolent Society, go to www.laketownranch.com/benevolent-society/ . Can I bring a chair or blanket? Reserved Seating and General Admission areas are where you can put your chair down. In the Reserved Seating area you can keep it there all weekend. Please remove it from the General Admission area at the end of each night. Chairs with umbrellas, awnings or footrests (including “zero gravity” chairs) should be left at home. Chairs are not permitted in the Stage Pit. Please see Acceptable Chairs and Not Acceptable Chairs . Am I allowed to bring my own food and drinks on to the festival grounds? A small personal sized cooler for food is permitted. No outside liquids of any kind are permitted in the concert bowl or licensed areas. For the safety of police, security, and our guests, all bags and belongings are subject to search. Please feel free to bring a refillable drink container (no glass) to use at our water filling stations. Can I use my credit or debit card to purchase food and merchandise? Yes you can. Will I be able to use my cell phone on site? Yes. There is cell phone reception on site.  A charging station is located in general admission, provided by Telus. Is there a shuttle service available? There is!  Please visit the ‘ Getting Here ’ page for details. Do you have day parking? Yes! And any vehicle arriving with 5 or more guests, all in seat belts, can park for FREE. The day parking rate is $25 per day for a standard-sized vehicle and is payable upon arrival in the lower parking lot. Large passenger vans/busses parking available for fee. Entry gate hours of operation: Thurs-Sun 1pm-9:30pm What is the best time to arrive? See our Hours of Operation above. Sunfest is a large scale event; treat entry into the concert bowl like an airport and give yourself lots of time to get through security. Our staff and volunteers will do their best to get you in as quickly as possible, but please give yourself at least 30 minutes of lead time. Entry gate hours of operation: Thurs-Sun 1pm-9:30pm What are grounds for ejection? Invalid, tampered with, fraudulent or absent wristband (civil and/or criminal charges will be sought) Rowdy or disrespectful behaviour Excessive noise/noise after curfew Excessive garbage in campsite Sales of any unauthorized or illegal materials Possession of fireworks, weapons or illegal drugs Contributing to minor drinking Speeding on roadways Throwing cigarettes on the ground, or smoking in the forest Be respectful of yourself, other guests, staff, volunteers, vendors, security, RCMP, and the beautiful natural environment around you. Is there an age requirement to camp? Each campsite must have at least one adult (18+) responsible for the site. Are there refunds? Sorry to hear you can’t join us this year! As stated on our website and at the time of purchase, we do not offer refunds. SCAM ALERT: Beware of tickets being resold, they could be fake and you will not be granted access to the festival. Is ice available on site? Yes! Ice can be purchased at guest services in the Flats. Ice purchases are cash only.  ATMs are available throughout the site. sign up now to become a sunfest insider Get Sunfest announcements and updates first. Disclaimer Laketown Ranch and Wideglide Entertainment Ltd. assume no liability for personal loss, injury, death, property damage or any other harm suffered by participants, spectators, site owners, lessees or others who may be adversely affected by any event held at Laketown Ranch. All patrons entering Laketown Ranch may have their image or likeness reproduced for promotional and/or other purposes of Laketown Ranch or any event held on-site. By entering the grounds, patrons agree to allow such use of your image and/or likeness and accept the inherent risks in entering the outdoor property. Any criminal activity, violence, public inebriation, destruction of property or any other violation of these rules will not be tolerated. Any person found to be in violation of these rules may be ejected from the grounds and subject to arrest. Tickets 2025 Lineup Festival Info FAQ Info Rules Maps Past Artists Getting Here Sponsors Connect Contact Newsletter Signup Artist Applications Volunteer Applications Staff Applications Vendor Applications Laketown Ranch Benevolent Society Learn about the Laketown Ranch Benevolent Society here. Privacy Policy | Copyright © 2024 Wideglide Entertainment Ltd. | All rights reserved Site designed and built by Luminate."
    },
    {
      "url": "https://www.westpalmbeach.com/event/sunfest-music-festival-tickets-lineup-wpb/",
      "text": "BEST SunFest 2024 Tickets, 3 Day Pass! West Palm Beach Thursday , September 11 2025 Miami Dolphins, Kesha, Jason Aldean, Twenty One Pilots > BEST Seats & Tickets! WestPalmBeach.com Visitors Guide to West Palm Beach, FL Home Calendar Concert Tickets Hotels & Resorts Attractions Activities Fishing Golf History Jobs Real Estate Restaurants Shops Clematis CityPlace Weather Contact Ticket Support « All Events This event has passed. BEST SunFest 2024 Tickets, 3 Day Pass! West Palm Beach May 3, 2024 - May 5, 2024 « Okeechobee Music Festival 2024! Sunshine Grove “Six Perspectives” Residents’ Collective Art Exhibit » BEST SunFest Tickets SunFest 2024 in West Palm Beach , South Florida Friday, May 3 – Sunday, May 5, 2024. Tickets, 3 Day Passes on sale! The 2024 lineup includes NELLY (Fri), Cole Swindell (Sat), and Rebelution (Sun). See more of the lineup below. Find the BEST SunFest WPB Tickets! Buy TRUSTED Tickets on WestPalmBeach.com backed by a 100% Money-Back Guarantee > Your tickets will arrive before the event. Your tickets will be valid for entry. Safe & Secure Checkout. MORE of the 2024 SunFest lineup: (Fri) Billy Idol, Shaggy, The Fixx, Kritikal, Fox Maple Band, Slofunkpump (Sat) Yung Gravy, The Revivalists, Elle King, Dylan Scott, Bryce Vine, The Aces, Paul Russell, Hailey Whitters, Mat Corman, Killbillies, The Lubben Brothers (Sun) Third Eye Blind, Dashboard Confessional, Matisyahu, Boys Like Girls, The Elovaters, Valley, Little Stranger, Cassadee Pope, Brothers Within, Steven James, Seranation. Need ticket help? Contact customer support for assistance: 833-215-5118 Best SunFest 2024 Tickets WPB Concert & Event Tickets South Florida Music Festivals Need a Hotel while in West Palm Beach? Book EARLY for SunFest! GUARANTEED Lowest Rates for West Palm Beach Hotels! WestPalmBeach.com The Visitors Guide to West Palm Beach, Florida! Details Start: May 3, 2024 End: May 5, 2024 Event Tags: Florida Music Festivals , South Florida Events , South Florida Music Festivals , West Palm Beach Concerts Website: https://tickets.westpalmbeach.com/performers/sunfest Venue Downtown West Palm Beach Waterfront 100 N. Clematis Street West Palm Beach , FL 33401 United States Submitted By WestPalmBeach.com Tickets Phone 833-215-5118 Email ticketsupport@westpalmbeach.com View Submitted By Website Related Events Jason Aldean Tickets WPB > Best Seats & Deals! October 4 @ 7:30 pm - 11:00 pm Electric Daisy Carnival (EDC) Orlando 2025 > BEST Tickets! November 7 - November 9 Ultra Music Festival Miami 2026 > BEST Tickets! March 27, 2026 - March 29, 2026 « Okeechobee Music Festival 2024! Sunshine Grove “Six Perspectives” Residents’ Collective Art Exhibit » West Palm Beach Concerts & Events! West Palm Beach Concerts & Events! West Palm Beach Hotels At The Best Rates! Best Rates For West Palm Beach Hotels! Miami Dolphins Tickets! Miami Dolphins Game Schedule, Tickets & Packages > BEST Premium Seats! West Palm Beach Attractions! Top 10 West Palm Beach Attractions! West Palm Beach Jobs! West Palm Beach Jobs! | WestPalmBeach.com Home | Activities | Attractions | Calendar of Events | CityPlace | Clematis Street | Concert Tickets | Fishing | Golf Courses | History | Hotels & Resorts | Jobs | Real Estate | Restaurants | Souvenirs | Weather | Contact Us WestPalmBeach.com may be for sale. Serious inquiries only. Guide to Boynton Beach, FL Guide to Jupiter Island, FL Guide to Nashville, TN Guide to North Las Vegas, NV Guide to Palm Springs, CA Guide to Singer Island, FL"
    },
    {
      "url": "https://www.sunfest.org.au/about-us",
      "text": "ABOUT US | SunFest Sunbury top of page HOME ABOUT US HISTORY MEET THE COMMITTEE NOTIFICATIONS SUNFEST TERMS & CONDITIONS AT THE FESTIVAL SUNFEST SATURDAY SUNFEST SUNDAY FIREWORKS COLOUR RUN STALLS & FOOD TRUCKS RIDES & CARNIVAL FUN GRAND STREET PARADE BATTLE OF THE SCHOOL CHOIRS GETTING TO SUNFEST SUNFEST MAP PROGRAM & SCHEDULE STALL HOLDERS VOLUNTEER SPONSORSHIP CONTACT US ABOUT US Our Story Celebrating Music, Art & Culture in Sunbury From 1972 to 1974 Sunbury was host to Australia's most successful Pop / Rock Festival ever. After Sunbury Pop / Rock Festival finished in 1975, Sunbury was left with a void. After one year had lapsed with no festival the Sunbury community festival \"SunFest\" (originally Sunbury Fair) first began in 1976 by a group of Sunbury volunteers. ​ The group of volunteers wanted to bring to Sunbury an old fashioned community fair free of charge to the people of Sunbury and its surrounds.  Since this first event the festival has grown to Sunbury's largest event run by volunteers. With many thousands of people having attended out last couple of festivals, we will again offer great attractions that no other festival or show can offer in the Sunbury Region. Attractions include amusement rides and carival games, The Grand Street Parade (on Saturday), FIREWORKS (Saturday evening), live local bands, roving entertainers, Kid's entertainment, Sunbury Battle of the School Choirs, and a lot more. ​ 2025 will be the Sunbury Community Festival's 49 th year in serving the Community by providing a free 2 day festival full of fun and entertainment for all ages. The Sunbury Community is well supported by local traders, businesses and the community. Meet the Committee The Sunbury Community Festival - 'SunFest' Committee is entirely made up of volunteers. Angus President Craig Vice President Kate Secretary David Treasurer Adam Business Manager SunFest Executive Committee 2025/26 SunFest General Committee 2025/26 To play, press and hold the enter key. To stop, release the enter key. Join us! Become a SunFest Committee Member or Friend of SunFest! Join us and become a part of the SunFest Family! Whether you're interested in taking an active role as a committee member or simply want to support us as a Friend of SunFest on the festival weekend, your involvement helps make our festival shine. Join the fun, make lasting memories, and be a part of something big. We can't wait to have you on board! JOIN US! Fireworks A 5 to 10-minute fireworks display will begin at about 9pm on Saturday 15 March. Some pets may be affected by the noise. Please ensure that pets are kept in a secure area and are wearing identification. It is recommended that they be secured for a period before, during and after the fireworks. For further information on pets and fireworks visit the RSPCA’s website at rspcavic.org . Road Closures Road closures will be in place at various times and locations to ensure a spectacular and safe event for all residents and our community. Please see the road closures which are detailed below: All day road closures on Saturday 15 and Sunday 16 March on Brook Street between O’Shanassy Street and Barkly Street. All day road closures on O’Shanassy Street from Brook Street to Macedon Street will be closed on Saturday 15 March 2025. Grand Street Parade road closure on Saturday 15 March from 11.00am – 1.00pm on Harker Street, O’Shanassy Street & Brook Street. (Parade is held from 12.30pm – 1.00pm) Colour Run road closure on Sunday 16 March from 9.00am – 12.00pm on Harker Street, O’Shanassy Street & Brook Street (Colour run is held from 10.00am – 11.30am) Download Residence & Business Notification Letter Notifications The Terms and Conditions for the Sunbury Community Festival cover all aspects of the event, including the festival, colour run, stalls, parade, and general attendance. By participating, all visitors and vendors agree to adhere to all festival guidelines, safety protocols, and regulations set forth by the event organisers. These terms ensure a safe, enjoyable, and well-organised experience for everyone involved. Please review the full Terms and Conditions for detailed information regarding participation, responsibilities, and event rules. Download SunFest Terms & Conditions SunFest Terms & Conditions SunFest - Sunbury Community Festival Inc ​ SunFest is the largest volunteer-run community festival in Victoria ​ Incorporated Number : A0046389F ​ ABN: 72 544 779 910 EXPLORE Home At The Festival Stall Holders Colour Run Contact Us TOP WHO WE ARE About Us History Committee Photo Gallery Volunteer With Us Become a Sponsor CONTACT US info@sunfest.org.au Sunbury Village Green 12 Stawell St. Sunbury, VIC 3429 Be Part of Something Big! Become a SunFest Sponsor, Volunteer or Join the Committee JOIN US! bottom of page"
    },
    {
      "url": "https://www.ohjeanrecords.com/blogs/news/orville-peck-biography",
      "text": "Orville Peck Biography : Know About An Amazing Musician Skip to content FREE SHIPPING FOR PURCHASES OVER $150!!!! Home Catalog Preorders Sale Genres Labels 7\"s Cassette Tapes Gift Cards Merch Cleaning About Need help? Call us 03 9416 4768 zp@ohjeanrecords.com Back Genres African Afrobeat Australian Blues Bossa Nova Brazil Breaks Country Electronic Funk/Soul Heavy Heavy Metal Hip Hop House Japanese Jazz Latin Live New Zealand / NZ Pop Punk Rare & Collectable Reggae Rock Sale Soundtracks Used World Back Labels 1:12 Records Bedroom Suck Records Blue Note Captured Tracks Daptone Records Fat Wreck Chords Flightless Records Flying Nun Habibi Funk Impulse! Melted Ice Cream Mexican Summer Mississippi Records Now-Again Numero Group Poison City Records Post Present Medium Psychic Hysteria Sacred Bones Sub Pop We Release Jazz WRWTFWW WeWantSounds XL Recordings Oh! Jean Records Clear Close Country/region Australia (AUD $) Åland Islands (EUR €) Andorra (EUR €) Armenia (AMD դր.) Australia (AUD $) Austria (EUR €) Belarus (AUD $) Belgium (EUR €) Bosnia & Herzegovina (BAM КМ) Bulgaria (BGN лв.) Canada (CAD $) China (CNY ¥) Cook Islands (NZD $) Croatia (EUR €) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Estonia (EUR €) Faroe Islands (DKK kr.) Fiji (FJD $) Finland (EUR €) France (EUR €) French Polynesia (XPF Fr) Georgia (AUD $) Germany (EUR €) Gibraltar (GBP £) Greece (EUR €) Greenland (DKK kr.) Guadeloupe (EUR €) Guernsey (GBP £) Hong Kong SAR (HKD $) Hungary (HUF Ft) Iceland (ISK kr) Indonesia (IDR Rp) Ireland (EUR €) Isle of Man (GBP £) Italy (EUR €) Japan (JPY ¥) Jersey (AUD $) Kiribati (AUD $) Kosovo (EUR €) Latvia (EUR €) Liechtenstein (CHF CHF) Lithuania (EUR €) Luxembourg (EUR €) Malta (EUR €) Mayotte (EUR €) Mexico (AUD $) Moldova (MDL L) Monaco (EUR €) Montenegro (EUR €) Nauru (AUD $) Netherlands (EUR €) New Caledonia (XPF Fr) New Zealand (NZD $) Niue (NZD $) Norfolk Island (AUD $) North Macedonia (MKD ден) Norway (AUD $) Papua New Guinea (PGK K) Pitcairn Islands (NZD $) Poland (PLN zł) Portugal (EUR €) Réunion (EUR €) Romania (RON Lei) Samoa (WST T) San Marino (EUR €) Serbia (RSD РСД) Slovakia (EUR €) Slovenia (EUR €) Solomon Islands (SBD $) Spain (EUR €) Svalbard & Jan Mayen (AUD $) Sweden (SEK kr) Switzerland (CHF CHF) Timor-Leste (USD $) Tokelau (NZD $) Tonga (TOP T$) Türkiye (AUD $) Tuvalu (AUD $) Ukraine (UAH ₴) United Kingdom (GBP £) United States (USD $) Vanuatu (VUV Vt) Wallis & Futuna (XPF Fr) Login / Signup My account 0 Cart Your cart is empty Shop our products Home Catalog Preorders Sale Genres African Afrobeat Australian Blues Bossa Nova Brazil Breaks Country Electronic Funk/Soul Heavy Heavy Metal Hip Hop House Japanese Jazz Latin Live New Zealand / NZ Pop Punk Rare & Collectable Reggae Rock Sale Soundtracks Used World Labels 1:12 Records Bedroom Suck Records Blue Note Captured Tracks Daptone Records Fat Wreck Chords Flightless Records Flying Nun Habibi Funk Impulse! Melted Ice Cream Mexican Summer Mississippi Records Now-Again Numero Group Poison City Records Post Present Medium Psychic Hysteria Sacred Bones Sub Pop We Release Jazz WRWTFWW WeWantSounds XL Recordings 7\"s Cassette Tapes Gift Cards Merch Cleaning About Use this bar to show information about your cookie policy. Accept Decline Orville Peck Biography : Know About An Amazing Musician Oh! Jean Records May 29, 2022 Share Who is Orville Peck? Orville Peck is a South African country musician based in Canada. He is a singer-songwriter, guitarist, and pianist. His music style is folk-rock, and he has written songs popular in South Africa. He has released two albums. He sings and plays the guitar. He released a solo album, \"A Day In The Life,\" in 2013. He played in several bands in his hometown. Early life On March 21, 1965, Orville Peck was born in Johannesburg, South Africa. He was raised in a musical family. His father, Joe Peck, was a drummer and his mother, Carole, was a singer. He began playing the guitar at the age of 10. His first instrument was a steel-string acoustic guitar. He learned to play the guitar with his father. He attended high school in Johannesburg, where he learned to play the guitar. After graduating, he moved to Cape Town to attend the University of Cape Town. After graduation, he went back to Johannesburg to continue his music career. At the age of 15, he started playing the drums. At the age of 16, he joined a band called the Rockingbirds. At age 11, he left South Africa for Canada and moved to Toronto, Ontario. Peck's music career began in 2003 when he met a woman named Jody at a club. They started a relationship and later married. Therefore, He has been living in Canada since 2004. He has two children with Jody. He is a Canadian citizen. Musical Career Orville Peck has been a professional musician since he was a teenager. He has released two albums so far.  In 1993, he started his solo career. He has been a member of the band, The Rockingbirds since he was 16. The band released an album in 2007. He released his first solo album, \"A Day In The Life.\" He has performed at several venues. Furthermore, he has played in many festivals. These festivals include the Sunfest, the Cape Town Music Festival, and the Stellenbosch Jazz Festival. On the other hand, He has performed at many festivals. These festivals include the Sunfest, the Cape Town Music Festival, and the Stellenbosch Jazz Festival. He has also performed at the Blue Note Jazz Club, the Danforth Music Hall, and the Massey Hall. He has played with artists such as John Legend, Jimmy Buffett, and others. Likewise, he has released two albums so far. One of them is \"A Day In The Life,\" and the other is \"Letters From Home.\" Awards Orville Peck has been nominated for various awards. These awards include the Juno Award, Canadian Country Music Association Awards, and Western Canadian Music Awards. He has won the award for Best Male Artist at the Canadian Country Music Awards in 2015. Orville Peck has won the Juno Award for Roots & Traditional Album of the Year for his album, \"Letters from Home.\" Studio Albums Orville Peck has released two studio albums so far. One of them is \"A Day In The Life,\" and the other is \"Letters From Home.\" A Day In The Life The first album, \"A Day In The Life,\" was released in 2013. It is a solo album. The album is a collection of songs that were written by Peck. It includes 12 songs. Some of these songs are: \"All I Ever Wanted\", \"I'm Not The Same Girl You Used To Know,\" \"You Are The One,\" and \"All I Ever Wanted\". Letters From Home The second album, \"Letters From Home,\" was released in 2015. It is a solo album. Whereas, This album is a collection of songs written by Peck. The album includes 12 songs. Some of these songs are: \"I'll Never Let You Go,\" \"Letters From Home,\" \"What I Want\", \"All I Ever Wanted\", and \"You Are The One.\" Further, the latest one was Pony Album Orville Peck that he has released in 2019. Final Words Orville Peck is a talented musician. He has released two albums, including some of his best songs. He has been a member of The Rockingbirds since the age of 16. Peck has performed in many venues. Furthermore, he has also been nominated for several awards. Share Previous article Next article Join Us A short sentence describing what someone will receive by subscribing Your email Subscribe 100% free, Unsubscribe any time! Follow us Delivery worldwide We will ship it almost anywhere Satisfied or refunded We will help rectify any issues Top-notch support We will contact you within 24 hours Secure payments Amex, Mastercard, Apple Watch, Visa, Paypal, Afterpay Footer Search Terms & Conditions Privacy Policy Contact Shipping Newsletter Find out about goodies, exclusives and stuff about the store. We rarely send 'em but you never know what you miss!! Your email Subscribe © 2025 Oh! Jean Records POS and Ecommerce by Shopify Follow Us © 2025 Oh! Jean Records POS and Ecommerce by Shopify Opens in a new window."
    },
    {
      "url": "https://www.sunfest.org.au/contact-us",
      "text": "CONTACT US | SunFest Sunbury top of page HOME ABOUT US HISTORY MEET THE COMMITTEE NOTIFICATIONS SUNFEST TERMS & CONDITIONS AT THE FESTIVAL SUNFEST SATURDAY SUNFEST SUNDAY FIREWORKS COLOUR RUN STALLS & FOOD TRUCKS RIDES & CARNIVAL FUN GRAND STREET PARADE BATTLE OF THE SCHOOL CHOIRS GETTING TO SUNFEST SUNFEST MAP PROGRAM & SCHEDULE STALL HOLDERS VOLUNTEER SPONSORSHIP CONTACT US CONTACT US Get in Touch Send us an Email Thank you for emailing us! One of our team will answer your query as soon as we can! First Name Last Name Subject Email Message Thanks for submitting! Send Email Us info@sunfest.org.au PO Box PO Box 332 Sunbury Victoria 3429 Get Social Frequently asked questions... SunFest - Sunbury Community Festival Inc ​ SunFest is the largest volunteer-run community festival in Victoria ​ Incorporated Number : A0046389F ​ ABN: 72 544 779 910 EXPLORE Home At The Festival Stall Holders Colour Run Contact Us TOP WHO WE ARE About Us History Committee Photo Gallery Volunteer With Us Become a Sponsor CONTACT US info@sunfest.org.au Sunbury Village Green 12 Stawell St. Sunbury, VIC 3429 Be Part of Something Big! Become a SunFest Sponsor, Volunteer or Join the Committee JOIN US! bottom of page"
    },
    {
      "url": "https://business.palmbeaches.org/list/member/sunfest-of-palm-beach-county-inc-8837",
      "text": "SunFest of Palm Beach County Inc. | FESTIVALS - Chamber of Commerce of the Palm Beaches. Member Single Post. Join Us Member Login Membership Member Benefits Membership Levels Sponsorship Packages Advertising Opportunities Chamber Trustees New Member Signup Events Chamber Event Calendar Signature Events Power Networking After-Hours Community Calendar About Board of Directors Chamber Staff Purpose PBC Built Campaign Brand Standards Contact Programs Chamber Committees Ambassadors Women’s Leadership YPOP Leadership West Palm Beach Chamber Trustees Seminars & Workshops Executive Mentorship Newsroom Chamber News Business Watch Photo Gallery Join Newsletter Resources Business Directory Chamber Guide Ribbon Cuttings Advocacy Government Affairs Leadership PAC Member Board Community Calendar Press Releases Job Board Exclusive Deals Member Login Visit Chamber Calendar Signature Events Chamber News Newsroom August 13, 2025 Chamber Launches New Signature... All News Amplify your reach. Join the Chamber today! Directory SunFest of Palm Beach County Inc. Category Share Categories FESTIVALS PO Box 425 West Palm Beach FL 33402 (561) 659-5980 Visit Website About Us FESTIVALS Rep/Contact Info Troy Forte × Close Troy Forte Sponsorship Manager Send an Email Josh Weiner × Close Josh Weiner Special Events Coordinator Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Built for Business Sign up for news, events, and more. Subscribe 401 North Flagler Drive West Palm Beach, FL 33401 chamber@palmbeaches.org 561.833.3711 Facebook X-twitter Youtube Linkedin Instagram © 2025 Chamber of Commerce of the Palm Beaches.  All Rights Reserved. Privacy Policy Sitemap Join Our Newsletter Join Our Email List Email (required) * First Name Last Name Select list(s) to subscribe to Chamber Update Example: Yes, I would like to receive emails from CCPB. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: . You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact Heading Sub heading List items Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum. Ribbon Cuttings Preparation Ribbon Cutting time availabilities Monday- Thursday 9:00a.m, 12:00a.m. or 5:30p.m. at host location or area location. (Palm Beach County, FL) 1st Friday of the month 1:00p.m. after the Ambassador meeting. Pictures are always better with a banner, or sign and designated area to set up for photography. Identify the best place for the picture in advance to ensure a smooth event. The Chamber of Commerce Membership Services Associate will arrive 20 minutes before the start of the event with a camera, ribbon, and scissors. They will assist in choosing the best position for the photo, if necessary. The person selected to cut the ribbon will be directed and assisted as to where to stand during the picture and how to handle the scissors. Ambassadors of the Chamber of Commerce will hold the ribbon as the ribbon is cut. Ambassadors meet and greet your guests. Photographer will prompt you when to cut the ribbon, after several photos taken of the group are posed and ready. We look forward to a great event! Possible Participants: The Chamber Ambassadors can be invited to participate. Additional committees can be included as appropriate. Company staff including owner, CEO, CFO, COO, management, staff and invited guests. Food/Refreshments- Optional. Your event will be better attended with refreshment provided. The food preference and the theme for your Ribbon Cutting Ceremony is entirely up to you. Photos will be placed on the Chamber website, launched on the Chamber’s social media platforms and forwarded to the Ribbon Cutting host. For the Membership Services Associate: Please state if there are any special driving instructions, parking instructions, and if there are any special requests. Please submit the Ribbon Cutting Request Form one month in advance. Ribbon Cutting Request Form"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "text": "Contact Us | Get in touch | MNSI Contact Us | Get in touch | MNSI Skip to content Skip to main menu We're always looking to improve our website. If you spot an issue please email: Enquiries@mnsi.org.uk . News, events and blog Jobs Accessibility MNSI Menu Search Menu About us Our team Our governance HSIB legacy For families Investigation overview for families Consent Investigation process for families Information in other languages and formats Help and support for families NHS Resolution Early Notification scheme Family feedback For NHS Investigation overview for NHS Refer a case to us Investigation process for NHS Information collection Staff interviews Help and support for NHS staff Staff feedback Health Equity Assessment and Resource Toolkit (HEART) and Health Equity Warning Score (HEWS) Information sharing between MNSI and CQC For other professionals Coroners Police service Position statement for regulatory bodies Publications Work with us Jobs Subject Matter Advisors Contact us Make a complaint about MNSI About us Our team Our governance HSIB legacy For families Investigation overview for families Consent Investigation process for families Information in other languages and formats Help and support for families NHS Resolution Early Notification scheme Family feedback For NHS Investigation overview for NHS Refer a case to us Investigation process for NHS Information collection Staff interviews Help and support for NHS staff Staff feedback Health Equity Assessment and Resource Toolkit (HEART) and Health Equity Warning Score (HEWS) Information sharing between MNSI and CQC For other professionals Coroners Police service Position statement for regulatory bodies Publications Work with us Jobs Subject Matter Advisors Contact us Make a complaint about MNSI News, events and blog Jobs Home > Contact us Contact us You can contact us by email or using the form on this page. You can find out how to ask us for information we hold on our Information requests page. Email Enquiries@mnsi.org.uk Alternatively, please use this form. Name* Email* Subject* Message* Privacy policy accepted MNSI Get in touch Contact us Share family feedback Share NHS staff feedback Statements Accessibility Privacy notice Modern slavery and human trafficking statement enquiries@mnsi.org.uk Share this page: X Share on Twitter LinkedIn Share on LinkedIn Facebook Share on Facebook WhatsApp Share on whatsapp Email Share over email © 2025 MNSI. All rights reserved."
    },
    {
      "url": "https://www.sunfestconcerts.com/contact/",
      "text": "Contact Us | Sunfest Country Music Festival Tickets 2025 Lineup Festival Info FAQ Info Rules Maps Past Artists Getting Here Sponsors Connect Contact Newsletter Signup Artist Applications Volunteer Applications Staff Applications Vendor Applications Laketown Ranch Benevolent Society Tickets 2025 Lineup Festival Info FAQ Info Rules Maps Past Artists Getting Here Sponsors Connect Contact Newsletter Signup Artist Applications Volunteer Applications Staff Applications Vendor Applications Laketown Ranch Benevolent Society Contact Us scroll For General Inquiries info@laketownevents.com Please note : due to the high volume of emails we receive, we will not respond to emails regarding buying or selling tickets on third party sites. Ticketing Inquiries Contact the box office at boxoffice@laketownevents.com or by calling (250) 710-5868 . Volunteer Information For further questions about volunteering please email volunteer@laketownevents.com Press Information For all press inquiries please contact our PR Manager for Sunfest Country Music Festival: media@laketownevents.com Sponsorship Inquiries For all sponsorship inquiries please contact our Sponsorship Manager at: corporate@laketownevents.com Our Address 8811-2 Youbou Rd Lake Cowichan, BC V0R 2G1 Canada Contact Us Don’t fill this out if you're human: Tickets 2025 Lineup Festival Info FAQ Info Rules Maps Past Artists Getting Here Sponsors Connect Contact Newsletter Signup Artist Applications Volunteer Applications Staff Applications Vendor Applications Laketown Ranch Benevolent Society Learn about the Laketown Ranch Benevolent Society here. Privacy Policy | Copyright © 2024 Wideglide Entertainment Ltd. | All rights reserved Site designed and built by Luminate."
    },
    {
      "url": "https://www.yahoo.com/entertainment/articles/sunfest-gone-now-free-downtown-144750916.html",
      "text": "SunFest is gone. Now a free downtown music festival aims to ‘fill that void’ Search query Search the web Skip to main News Finance Sports More -1 Manage your account Help Add or switch accounts Sign out Search the web Advertisement Advertisement Return to Homepage Entertainment: 'It Ends With Us' author's new novel Who is Taylor Frankie Paul? Photographing a celeb wedding 'The Summer I Turned Pretty' Orlando Bloom's transformation Body found in D4vd's car Bucket List Family's new chapter Vanilla Ice reflects 'Only Murders in the Building' Season 5 Lorde gets personal Palm Beach Daily News SunFest is gone. Now a free downtown music festival aims to ‘fill that void’ Andrew Marra, Palm Beach Post Tue, April 29, 2025 at 2:47 PM UTC 4 min read Like thousands of Palm Beach County residents, local musician Hector Diaz was sad to learn SunFest would not hold its annual music festival this year on West Palm Beach’s downtown waterfront. But when the beloved 42-year event went dark, Diaz also saw an opportunity. For three years he and his bandmates had organized a small festival at a Lake Worth Beach brewery to promote local musical acts. Maybe, now, there was a chance to grow. Advertisement Advertisement Advertisement Advertisement “We’re not SunFest,” he said. “We’re not anywhere near the size and we’re not trying to replace SunFest. But we’re trying to fill that void.” Almost on a lark, Diaz called West Palm Beach’s city government to see if the Meyer Amphitheatre along Flagler Avenue downtown would be available the first Saturday in May, on the weekend when SunFest used to take place. The answer, it turned out, was yes. SUNFEST'S DOWNFALL: The festival's big music bet thrilled millions, then drove it out of business There was a 26-page permit application, a fee and a whole lot of logistical issues. But in the end Diaz found that he, his bandmates and a host of friends and volunteers were putting on the festival in a new, bigger locale. Advertisement Advertisement Advertisement Advertisement Thanks to their efforts, lovers of live music will have something to look forward to downtown on Saturday, May 3 – even with SunFest gone. 561 Music Festival: Twenty bands will play on two stages A logo for the 561 Music Festival, which will take place this year in downtown West Palm Beach. The 561 Music Festival will feature 20 bands on two stages in the Meyer Amphitheatre and will be free to attend. Obviously, it will be a far smaller event that SunFest, which paid top dollar for A-list musicians and occupied a much larger footprint along the downtown waterfront. But Diaz and bandmate Ben Childs said that their event harkens back to SunFest’s historic roots as a community-centered event. The entire lineup will be bands from South Florida and the Treasure Coast. Like earlier iterations of SunFest, it will feature art vendors, too. Advertisement Advertisement Advertisement Advertisement “That was absolutely by design,” said Diaz, who was born and raised in West Palm Beach and attended SunFest for decades. “When SunFest used to be a very local event for the locals, that’s kind of our grassroots.” WILL SUNFEST RETURN? First, ‘something’s got to change,’ director says The 561 Music Festival grew out of Diaz’s efforts to promote the local music scene. He is one part of a trio known as the Killbillies , a folk-roots band that has been performing since 2010. He and his bandmates also produce a weekly podcast called the 561 Music Podcast , which features interviews with local musicians and venue owners. Advertisement Advertisement Advertisement Advertisement Last year’s festival was a ticketed event held at Mathews Brewing Company in Lake Worth Beach, where it attracted around 800 people. This year’s event entails an entirely different level of complexity. SunFest year-by-year: A memory lane trip of all the West Palm waterfront festival's 40 years “All of a sudden, now we have to have off-duty police presence, we have to have the fire department, we have to have permits, we have to have a licensed-and-bonded janitor company,” he said. “Our costs jumped exponentially.” But expanding the event also drew a new level of support. The group drew financial backing from the Cultural Council for Palm Beach County and from The Palm Beaches, the county government’s tourism marketing arm. Advertisement Advertisement Advertisement Advertisement It also won a major sponsorship from local law firm Steinger, Greene & Feiner. All the financial support is allowing the festival to operate without charging for entry. As a free event in a larger, more high-profile venue, the organizers are expecting a larger turnout. But they’re not sure just how large. The Killbillies are a Palm Beach County-based folk-roots band. Members Hector Diaz (left) and Ben Childs (right), seen with fellow bandmate James Galiano, are organizing the 561 Music Festival in downtown West Palm Beach on May 3. “People have been talking about thousands of people, so we’re just going to have to see,” Childs said. Both Childs and Diaz called the planning nerve-wracking. But they said the possibility of expanding their event to meet a newfound community need was a special sensation. “It’s pretty amazing,” Diaz said. “It’s a whole different animal. We’re definitely at a different level. Anxiety aside, it’s overwhelming, exciting. We’re thrilled to be doing this.” 561 Music Festival: If you go Where: Meyer Amphitheatre, 104 Datura St., West Palm Beach When: 11 a.m.-11 p.m. Saturday, May 3 Cost: Free Children: Allowed Pets: Allowed but must remain leashed Entertainment: 20 local bands, art vendors and food trucks Access: Parking available in the city’s downtown parking garages nearby. Information: Visit 561musicfestival.com for more details. The 20 bands scheduled to perform Mason Pace Stryder Tiger Sunset Beeline Jutt Huffman Band Stony Fools Closer To The Ocean Slo Funk Pump Blabscam! Jakob Takos & The Connection Medicine Room Shakers ¡FUÁKATA! Billy Doom Is Dead Ryan Hopkins Band Wrasse Off Orbit Modern Odyssey The Little Things Reverse Oreo Do you have a fond memory of SunFest? We want to hear from you! We would love to hear about your favorite SunFest memory. Please fill out our poll below. Your submission may be used in a future story on West Palm Beach's favorite festival. Advertisement Advertisement Advertisement Advertisement Andrew Marra is a reporter at The Palm Beach Post. Reach him at amarra@pbpost.com . This article originally appeared on Palm Beach Post: 561 Music Festival to fill void left by SunFest in West Palm Beach Advertisement About Our Ads Solve the daily Crossword 22,504 people played the daily Crossword recently. Can you solve it faster than others? 22,504 people played the daily Crossword recently. Can you solve it faster than others? Crossword Play on Yahoo Advertisement Advertisement Advertisement Yahoo! Movies TV + Streaming How to Watch Music Celebrity Books The It List Interviews Yahoo Picks Help Suggestions About Our Ads Site Map Follow us on © 2025 Yahoo. All rights reserved."
    }
  ]
}