{
  "fuentes": [
    {
      "url": "https://journalstar.com/news/local/government-politics/article_818ed47e-331a-11ee-aa06-bb24bea0dea8.html",
      "email": "mreist@journalstar.com"
    },
    {
      "url": "https://suncrestgardens.com/site/contact-us/how-to-reach-us/",
      "email": "gardencenter@suncrestgardens.com"
    },
    {
      "url": "https://suncrestgardens.com/site/contact-us/how-to-reach-us/",
      "email": "gardencenter@suncrestgardens.com"
    },
    {
      "url": "https://sunkengardens.org/photography-policy/",
      "email": "sarah.carvalis@stpete.org"
    },
    {
      "url": "https://www.sunkengardens.net/contact",
      "email": "karenran@verizon.net"
    },
    {
      "url": "https://www.gardens.org.nz/contact",
      "email": "info@gardens.org.nz"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    }
  ],
  "mails": [
    "gardencenter@suncrestgardens.com",
    "info@communityaccessnaperville.org",
    "info@gardens.org.nz",
    "karenran@verizon.net",
    "mreist@journalstar.com",
    "sarah.carvalis@stpete.org"
  ],
  "nombre_sitio": "sunkengardens.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://journalstar.com/news/local/government-politics/article_818ed47e-331a-11ee-aa06-bb24bea0dea8.html",
      "text": "Lincoln parks employees who tended Sunken Gardens retire Skip to main content Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close 65° Log In Subscribe Guest Logout Read Today's E-edition News Local Crime Nebraska News Politics Records Business Nation & World Last 24 hours Markets & Stocks News TIp Obituaries Share a story Recent Obituaries Find an Obituary Archives Opinion Submit a letter Letters Editorial Columnists Sports Huskers High School College Stars Hockey Saltdogs Baseball Outdoors Professional Lifestyles Arts & Theatre Event Calendar Movies & TV Music Puzzles Comics Contests Play Food & Cooking Parenting Health Home & Garden People Pets Faith Announcements Join the community News tip Share video Send a story Share a photo Brand Ave. Studios Print Edition E-edition E-edition Archives Buy & Sell Place an Ad Jobs Auto Sales Marketplace Public Notices Shop Local Shopping Customer Service Manage Subscription Activate Digital Subscription Newsletter sign-up Subscribe Contact us Help Center Gift Subscriptions Mobile Apps Weather: Live Radar Facebook Twitter Bluesky YouTube Instagram © 2025 Lee Enterprises Terms of Service | Privacy Policy Subscribe Read Today's E-edition Subscribe Log In Welcome, Guest My Subscription Help Center My Account Dashboard Profile Saved items Logout E-edition News Obituaries Opinion Huskers Puzzles Lifestyles Public Notices Jobs Autos 65° Clear Share This Facebook Twitter Bluesky WhatsApp SMS Email Longtime designers of Sunken Gardens plantings no longer with the city 0 Comments Share this Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Alert Top Story Topical Longtime designers of Sunken Gardens plantings no longer with the city Margaret  Reist Aug 20, 2023 Aug 20, 2023 0 Recently retired master gardeners Alice Reed and Steve Nosal sit in the last Sunken Gardens they designed — a Beatles-inspired Magical Mystery Tour — in June. The pair were suspended before deciding to retire earlier this year. KENNETH FERRIERA, Journal Star Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Margaret  Reist Steve Nosal and Alice Reed decided — sometime last year when the creative juices moved them — that Lincoln could use a little more love. The kind that John, Paul, Ringo and George crooned about. The “Love, love, love, all you need is love” kind. So they took the Beatles’ Magical Mystery Tour album and its music — “Penny Lane,” “Strawberry Fields Forever,” “Octopus Garden” — combined it with Peter Max’s “hippie art” on the album cover, and made a plan. They’d been making such plans — theme-based designs for the Sunken Gardens’ lush flora and fauna — for nearly four decades. They did not realize it would be their last. Both retired this year, just as the annual “Wake Up the Beds” volunteer planting event at the Sunken Gardens was getting underway. People are also reading… 9 flights under $100 from Lincoln, Omaha airports Amie Just: From blowout win to 'she said yes'! — A Husker night to remember SouthPointe store closes. Owner cites problems with Lincoln. Plenty of beer left, but sales of Memorial Stadium concessions increased overall Husband, father of 2 young girls killed while running was nurse in Omaha Grades: Nebraska 68, Akron 0 Amid trade war, Nebraska farmers on 'verge of crisis' Enraged Swifties attack Husker Athletics after viral Taylor-Herbie post Charlie Kirk ignited push for Nebraska election change in 2024 Nebraska volleyball position battles heat up as No. 1 Huskers prepare for home weekend 100 jobs in Lincoln being eliminated as company transitions to distribution center Week 3 Nebraska high school football rankings sees another top team fall Murray, Ogbechie lead No. 1 Nebraska volleyball sweep of Wright State Where's the beef? Fast-food restaurant reports $8K theft. AVCA Poll: Nebraska still unanimous No. 1, Penn State plummets, Creighton still ranked Their sudden departure surprised many, and Reed’s sister Rosemary Reed — who’s helped with the gardens for years — said that although both decided to retire, what happened before that is no way to treat longtime, dedicated employees who have given so much to the city. “I’m shocked and appalled,” she said. Both were suspended without pay for 30 days while the city investigated complaints by some employees. When the investigation ended, their pay was reimbursed and they were notified of what’s called a pre-disciplinary hearing that would have allowed them to give their side. Both decided to retire instead. “Alice and I decided to part ways with the city and go in a different direction because the city has changed directions of how they want to do things,” Nosal said. Reed said the current administration seems more focused on recreational activities — bike paths, playgrounds, parks — than on landscaping and the passive enjoyment of gardens. Both are working with a group that hopes to bring a botanical garden to Lincoln, a private effort that involves discussions about locating it in a city park. Nosal, who began working for city parks in 1976, and Reed who started in 1984, have become well-known to those in Lincoln who love gardening and the city's gardens — especially the Sunken Gardens, which has been under their purview for years. They said there were disagreements about how things should be done and some employees resented the hard work involved. Both Nosal and Reed said they’d discussed issues they were having with their superiors before being suspended, and were caught off guard when that happened. They said the behavior they were accused of, such as bullying and giving punitive assignments — wasn’t true. The work is just hard, they said. Reed said some employees were disrespectful to her and, in the end, neither she nor Nosal felt anything was going to change, so they decided to retire rather than return to what had become an untenable situation. “We had a unique situation with our multi-generational workforce where they really were not wanting to work the program Alice and I had laid out for the last 40 years,” Nosal said. “They’d come in with ideas that were not in compliance with our wishes, and rather than sitting down and talking it out with us, they went ahead and rebelled.” Lincoln-Lancaster County Human Resources Director Barb McIntyre said she can’t comment on personnel matters and wouldn’t confirm whether Nosal and Reed were suspended, though she did confirm both retired. She didn’t address the situation with Nosal and Reed, but said her department investigates any workplace complaints. If the department decides to suspend without pay while an investigation is pending, the employee is paid back for that time if the investigation ends without a termination, though other discipline is possible. Maggie Stuckey-Ross, who replaced longtime director Lynn Johnson when he retired last year, said the two weren’t asked to resign. “We’re grateful for all they’ve done for public gardens,” Stuckey-Ross said. “They really put us on the map in so many ways.” Nosal, 73, and Reed, 66, said it’s important for them to thank the residents of Lincoln and all the donors over the years who helped keep the gardens going. “The citizens were the ones who supported Alice and myself, they paid taxes to pay our wages, came to events and applauded us,” Nosal said. Nosal, who was born in Columbus and started traveling with a rock band at 16, came to Lincoln in 1976 to work for the city as a park laborer. His first job was to maintain Van Dorn Park. “I made it look as good as the Sunken Gardens,” said Nosal, who grew up with a grandpa who was a gardener, as was his great-grandpa. He became a city horticulturist and began working on all the city’s gardens after that first summer, including the Sunken Gardens, and in the city’s greenhouse (which was located roughly where the cheetah run in the Lincoln Children’s Zoo today). Reed — who grew up in Lincoln and remembers going to the Sunken Gardens and to the city’s greenhouse each Mother’s Day — started working with the city in 1984, after graduating from the University of Nebraska-Lincoln, where she majored in psychology and minored in horticulture. Internships at the Lincoln Regional Center convinced her that psychology wasn't her path, and she was thrilled to become a gardener with parks and recreation. She and Nosal began supervising the greenhouse and worked on all the city’s public gardens. In 1988, the city’s greenhouse came down to make way for a parking lot and Nosal said they had to start buying many of their plants and renting greenhouses to store them, and that’s when the Sunken Gardens planning — and the themes — started in earnest. They used the themes to help them center on the colors and come up with conceptual plans, Reed said. People loved it and were eager to learn what they’d chosen each year —and they’d often make suggestions. The themes ran the gamut, from Dr. Seuss and beautiful butterflies to Alice in Wonderland and the Wizard of Oz (and those ruby slippers). They did one garden based on Jimi Hendrix’s “Purple Haze,” another on Prince’s “Purple Rain.” One year, they chose the Thunderbirds of Nebraska, a theme based on the mosaic bead designs of Native Americans who celebrate thunder and the return of migratory birds. “We just had a riot with that stuff,” Nosal said. “We researched it to no end.” Nosal calls their work \"garden art.\" “It was, basically, a painting with plants,” he said. They both spent time traveling to public gardens across the country to get ideas: Washington, D.C., Denver, Minneapolis, Oregon, Washington state, British Columbia. Even Europe. They learned about Van Gogh’s color blending, that Monet was a gardener as well as a painter. They included art museums in their quest for ideas. The two developed a strong partnership over the years, each with their own strengths. Reed could memorize plants — their colors and their names, what they needed to thrive; Nosal took charge of the ordering, buying. They’d both work on the conceptual design, Nosal would create the blueprint on paper. Both worked with the plants in the greenhouse. She’d wake up in the middle of the night with an idea and text him. He’d get it down on paper. “We know what the other’s going to do. It’s that kind of partnership. It’s a unique working partnership,” Nosal said. In the 1990s, they worried about the future of the Sunken Gardens, heard rumors the city might fill it in. They were determined to save it. Nosal, who’d already earned an undergraduate degree in landscape design from UNL, went back to school and got a master’s degree in public garden administration. His thesis was on the history of the Sunken Gardens — starting with its beginnings in the 1930s. Mayors and parks directors later used the thesis to help promote the importance of the gardens, Nosal said. Reed worked to get the backing of wealthy Lincoln residents so the gardens would continue to thrive. “Alice and I recognized somebody had vision in the 1930s and we needed to figure out a vehicle to keep it alive,” Nosal said. In the late '90s, the Sunken Gardens made National Geographic's list of the 300 best public gardens in the U.S. and Canada. It appeared in landscaping and gardening magazines through the years, and was once pictured on a state map. In 2004, the gardens were renovated, including a new pavilion, new sculptures, cascading water, restrooms and handicap-accessible entry and walkways. During the renovation, lots of people wanted to volunteer — and they needed the help, so Reed invited people to do so. At the suggestion of her sister, they decided to call the group Garden Gab. The group still helps weekly. Both were looking at retiring in about a year, and they’d already begun to think about the design for next year — a Native American-inspired theme, with the sun setting in the west, a nod to their own ride into the sunset. “We didn’t get to retire on our terms, but we sure gave it all we had,” Reed said. They were sorry they weren’t there, digging in the dirt when their Magical Mystery Tour began to come to life this spring. Some natural love, color and enjoyment for Lincolnites, Beatles style. “We were so happy to serve (the residents of Lincoln) and make these beautiful designs and draw people to Lincoln,” Reed said. “People knew this place. It was a mecca and I hope that can continue.” Top Journal Star photos for August 2023 Lincoln Southwest running back Ashton Traudt (2) runs the ball under defense by Columbus defensive end Caden Kapels (81) during the Silver Hawks' game against Columbus on Friday at UBT Stadium at Lincoln Northwest. Southwest was leading 14-6 at halftime. ARTHUR H. TRICKETT-WILE Journal Star Seward local Garin Metzger (left) drives his pontoon boat on Friday, Sept. 1, 2023 at Branched Oak Lake in Lancaster County during the start of Labor Day weekend. Pictured with him is his wife Linda Metzger (center-right), and their friends Shanda Laflin (center-left) and Pam Spicher (right). ARTHUR H. TRICKETT-WILE, Journal Star Nebraska's Mikai Gbayor (42) celebrates with teammate Brian Buschini after he limited Minnesota to a short yardage after a kickoff return on Thursday, Aug. 31, 2023, at Huntington Bank Stadium in Minneapolis. JUSTIN WAN Journal Star Nebraska head coach Matt Rhule points to the team during the first quarter against Minnesota on Thursday, Aug. 31, 2023, at Huntington Bank Stadium in Minneapolis. JUSTIN WAN Journal Star Nebraska volleyball celebrates a 3-0 victory against Omaha on Wednesday, Aug. 30, 2023, at Memorial Stadium during Volleyball Day in Nebraska. ARTHUR H. TRICKETT-WILE Journal Star Club team volleyball players, including Kenzie MacDonald of Omaha (left), 13, and her twin Kyra MacDonald, cheer during the final moments of the Nebraska volleyball match against Omaha on Wednesday at Memorial Stadium. JUSTIN WAN, Journal Star Nebraska head coach John Cook (left) takes the court with his team before taking on Omaha on Wednesday at Memorial Stadium. KENNETH FERRIERA, Journal Star Volleyball fans do the wave during a break in the action during the match between Omaha and Nebraska on Wednesday at Memorial Stadium. KENNETH FERRIERA, Journal Star Nebraska's Lexi Rodriguez (8) and Merritt Beason (13) lead the team to the court before the match against Omaha on Wednesday at Memorial Stadium. JUSTIN WAN, Journal Star The glare from the sun hits the court causing players to be silhouetted against the floor during the second set Wednesday at Memorial Stadium. KENNETH FERRIERA, Journal Star Noah Snurr of Nebraska State Education Association (left) and Molly Gross of Nebraska Parent Teacher Association deliver boxes of signatures Wednesday from the Support our Schools Nebraska petition drive to the Secretary of State's election office. JUSTIN WAN, Journal Star Cole Graham (center) and Scott Ryan (right) of Nebraska Sign Company set up the volleyball court at Memorial Stadium ahead of Volleyball Day in Nebraska, Tuesday, Aug. 29, 2023. JUSTIN WAN Journal Star Christopher Corbett Jr., 7, examines the cockpit of a T-38 Talon on Sunday, Aug. 27, 2023 at the Guardians of Freedom Airshow at Lincoln Airpark. ARTHUR H. TRICKETT-WILE Journal Star The U.S. Navy Blue Angels leave a smoke trail behind them as they perform aerial feats during the Guardians of Freedom Airshow at Lincoln Air Park on Saturday. KENNETH FERRIERA, Journal Star Spectators watch and photograph the U.S. Navy Blue Angels performing aerial feats over Lincoln's Air Park during the Guardians of Freedom Airshow on Saturday. More than 340,000 people attended the two-day show. JUSTIN WAN, Journal Star An F-35C long-range stealth strike fighter flies just under the sound barrier during the Guardians of Freedom Airshow at Lincoln Air Park on Saturday. KENNETH FERRIERA, Journal Star Seth Avett, Scott Avett and Joe Kwon play onstage during a performance The Avett Brothers at Pinnacle Bank Arena , on Thursday, Aug. 24, 2023, in Lincoln. KENNETH FERRIERA Journal Star Lincoln Lutheran's Ryan Bokelmann holds the Spirit Sword high as he leads his team in celebration after the Warriors defeated Lincoln Christian on Friday at Aldrich Field. KENNETH FERRIERA, Journal Star Farrah Plate practices yoga on her paddleboard at Holmes Lake Park on Thursday. Lincoln topped 100 degrees for the fifth day in a row on Friday, when the city's excessive heat warning expired. Relief is forecast on Saturday, where along with a chance of rain, the high is expected to be in the 80s. Those temps are to continue through Wednesday. ARTHUR H. TRICKETT-WILE, Journal Star Guests at the Duncan Aviation/Make-A-Wish Sixth Annual Charity Car Show walk through rows of cars on display at Duncan Aviation Components and Parts on Sunday near the Lincoln Airport. The event featured airplanes, firetrucks, food trucks and awards for a variety of car categories. Representatives from Duncan presented this year’s Make-A-Wish kid, 3-year-old James, with a trip to the \"Cars\" Suite at the Art of Animation Resort at Disney World. All event proceeds went to benefit Make-a-Wish Nebraska. ARTHUR H. TRICKETT-WILE, Journal Star Ta'mircle Washington (left) splashes water on Eliah Kruger as they keep cool at the Bicentennial Cascade Fountain, on Saturday, Aug. 19, 2023, in Lincoln. Starting on Saturday, the National Weather Service is forecasting five days with triple-digit heat out of the next six. If that proves correct, it will be the longest stretch of 100-degree highs in the city in more than a decade. Lincoln's forecast calls for heat indexes potentially topping 110 degrees on Saturday and Monday. KENNETH FERRIERA Journal Star Cornhusker Marching Band flag line member Alyssa Johnson, who is a reporting intern at the Lincoln Journal Star, twirls with her team during a routine on the field at the annual exhibition concert on Aug. 18, 2023, in Memorial Stadium at University of Nebraska–Lincoln. ARTHUR H. TRICKETT-WILE, Journal Star Lincoln Pius X's Jack Schafers celebrates after he scores a touchdown in the first quarter against Lincoln Northwest on Friday, Aug. 18, 2023, at Union Bank Stadium. KENNETH FERRIERA, Journal Star Lincoln Lutheran football players join hands in a pre-practice prayer before starting football practice at Lincoln Lutheran High School on Friday, Aug. 18, 2023, in Lincoln. KENNETH FERRIERA Journal Star Nova Trumler (left), 3, and Paxton Netsvetayer, 4, play as they build a house at Creative Minds Early Learning Center. JUSTIN WAN, Journal Star Asa Wegrzyn removes practice gear from a storage container before football practice at Lincoln Christian High School on Thursday, Aug. 17, 2023, in Lincoln. Kenneth Ferriera Preschooler Vihaan Idara (center) participates in playtime with his teacher and fellow classmates during the first day of the semester on Thursday, Aug. 17, 2023 in a new space at Standing Bear High School. ARTHUR H. TRICKETT-WILE Journal Star Lincoln Northeast's Landon Hoff (left) takes a handoff from Jacian Brown (right) during football practice Wednesday at Northeast High School. ARTHUR H. TRICKETT-WILE, Journal Star Becca Griebel (left) and her parents Tammy and Randy Griebel help her brother, University of Nebraska-Lincoln freshman Drew (second from left), move into his dorm room at Abel Hall on Tuesday in Lincoln. Around 5,000 students are moving into residence halls this week at UNL. Classes start on Monday. HAYDEN ROONEY, Journal Star A hover fly sits a top a black-eyed Susan at the Sunken Gardens. HAYDEN ROONEY, Journal Star Bull riders ready themselves for the competition ahead during the Extreme Bull Riding Tour at the Lancaster Event Center on Friday, Aug. 11, 2023, in Lincoln. Kenneth Ferriera Cassidy Krawczak-Kummrow pumps her fist in the air after walking across the graduation stage with hre masters degree during UNL's summer semester commencement ceremony at Pinnacle Bank Arena on Saturday. Kenneth Ferriera NATS detasslers work a seed corn field somewhere between Lincoln and Waverly, on Wednesday, July 19, 2023. Kenneth Ferriera Rachel Feldhaus, a 4 year detassler, pulls tassels from corn stalks on the final day of NATS season on Thursday, Aug. 3, 2023. Kenneth Ferriera Lincoln East head coach John Gingery talks tackling with a demonstration with Dash Bauman during a football practice Thursday at Seacrest Field. JUSTIN WAN, Journal Star Kipton Fankhauser loses his shoe as he falls off of \"War Dance\" during Mutton Bustin' at the Lancaster County Super Fair on Tuesday, Aug. 8, 2023, in Lincoln. KENNETH FERRIERA Journal Star Patrons enjoy the first weekend of the outdoor carnival during the Lancaster County Super Fair at the Lancaster Event Center on Saturday, Aug. 5, 2023, in Lincoln. KENNETH FERRIERA, Journal Star Syllas Daniels and Kaneka Taylor (right) hold on tight as they ride the Orbiter at the carnival during the Lancaster County Super Fair at Lancaster Event Center on Saturday, Aug. 5, 2023, in Lincoln. KENNETH FERRIERA Journal Star A nun peruses the animals on display at Rabbit Row during the Lancaster County Super Fair at the Lancaster Event Center on Saturday, Aug. 5, 2023, in Lincoln. KENNETH FERRIERA Journal Star Angelina Mojok waves to the camera as she rides the merry-go-round at the carnival during the at the Lancaster Event Center on Saturday, Aug. 5, 2023, in Lincoln. KENNETH FERRIERA Journal Star Cally Sullivan, Hannah Munk, Noah Schmoll and his sister Jocelyn (from left) let their rabbits hop from the starting line as they compete in a rabbit race during the Lancaster County Super Fair at the Lancaster Event Center on Saturday, Aug. 5, 2023, in Lincoln. KENNETH FERRIERA, Journal Star Offensive lineman Yahia Marzouk and Brady Eickhoff (from left) spring out from under the chute while running a drill during a practice at Lincoln Northwest on Wednesday. Kenneth Ferriera, Journal Star Nebraska middle blocker Andi Jackson blocks assistant coach Jaylen Reyes during practice Tuesday at Devaney Sports Center. KENNETH FERRIERA, Journal Star Lincoln Pius X's Hudson Schulz (left) tackles teammate Sebastian Morales during practice on Tuesday at Pius X High School. JUSTIN WAN, Journal Star A view of the Federal Legislative Summit on Tuesday at Strategic Air Command & Aerospace Museum in Ashland. JUSTIN WAN, Journal Star Nebraska's Bryce Benhart (left) and Brock Knutson practice on Tuesday, Aug. 8, 2023, at Hawks Championship Center. JUSTIN WAN Journal Star Lincoln Southwest's Zak Stark makes a throw during a football practice on Monday, Aug. 7, 2023, at Lincoln Southwest. JUSTIN WAN Journal Star An excavator tears bricks off Pershing Center on Monday as demolition work begins in earnest on the former civic auditorium. Bringing down the structure is expected to take two to three weeks. HAYDEN ROONEY, Journal Star Young dancers spin one another as they perform a traditional dance with Wilber Czech Dancers during the annual Wilber Czech Festival on Saturday. The celebration will continue Sunday with a parade, motorcycle show, eating contest and much more. Kenneth Ferriera photos, Journal Star Teams shoot around in the common area as they prepare to compete against one another during the three-on-three Railyard Rims basketball tournament at The Railyard in 2023 in Lincoln. The YMCA of Lincoln will host this year's event on Aug.1-2. Kenneth Ferriera, Journal Star File Photo Callum Anderson gets his first haircut from barber Dean Korensky as he sits with his mother, Courtney Anderson, on Thursday at 33 Street Hair Studio. Callum was the fifth generation of the Anderson family to get a haircut from Korensky. JUSTIN WAN, Journal Star Carter Worrell has a staring contest with a baby chick during the Lancaster County Super Fair at Lancaster Event Center on Aug. 3, 2023. HAYDEN ROONEY, Journal Star A Nowear BMX rider jumps from a high ramp while teammates watch during the Lancaster County Super Fair at Lancaster Event Center on Thursday. HAYDEN ROONEY, Journal Star Zack Mentzer peeks out from a trailer while he and his family unload their Hampshire cross breed pigs the day before the start of the Lancaster County Super Fair at the Lancaster Event Center on Aug. 2, 2023. Kenneth Ferriera, Journal Star Fair kids who show animals will set up in the stalls so they have a place to rest, the day before the start of the Lancaster County Super Fair at the Lancaster Event Center on Aug. 2, 2023. Kenneth Ferriera, Journal Star Jen Witherby (left) and Mary Weixelman, bought 3 Daughters, last month and just recently completed their first week as owners. JUSTIN WAN, Journal Star Cooper Jordan, 4, runs the spray of a soaker hose during Sprinkler Day at the Eiseley Branch Library on Monday. Kenneth Ferriera, Journal Star Protester Kari Wagner holds up a sign as Nebraska State Board of Education member Kirk Penner walks by in the Capitol on Monday. HAYDEN ROONEY, Journal Star Mack Splichal, 2, shows off his cheer moves to Nebraska cheerleaders Sidney Doty, Carly Janssen and Audrey Eckert (from left) during Nebraska Football's annual fan day at Hawks Championship Center on Sunday, July 30, 2023. Kenneth Ferriera Shoes lost by previous skydivers are hung above the exit to the runway at the Lincoln Sport Parachute Club on Saturday, July 29, 2023, in Weeping Water. Kenneth Ferriera Carpet Land players watch from the dugout as their team bats in the first inning during the Class A American Legion championship on Saturday at Den Hartog Field. Kenneth Ferriera, Journal Star Nebraska's Darian White (left) talks with teammate Callin Hake during a team practice Thursday at Hendricks Training Complex. JUSTIN WAN, Journal Star Ten-year-old Connor Horner plays in the sprinkler fountain at Centennial Mall across from the state Capitol on Monday, as temperatures reached the 90s and the heat index reached into triple digits. The Lincoln Parks and Recreation Department said it discourages people from playing in the Centennial Mall fountains because the water is not treated. HAYDEN ROONEY, Journal Star Contact the writer at mreist@journalstar.com or 402-473-7226. On Twitter at @LJSReist. 0 Comments Love 0 Funny 2 Wow 0 Sad 2 Angry 0 Get Government & Politics updates in your inbox! Stay up-to-date on the latest in local and national government and political topics with our newsletter. Sign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy . Margaret  Reist Local government reporter Author twitter Author email Follow Margaret  Reist Related to this story Most Popular Lancaster County farmland values see biggest increase in Nebraska Lancaster County ag land values increased 42% this year, the largest average increase in the state. Lincoln combines departments to streamline process for developers, homeowners The city is combining its planning and building and safety departments in an effort to streamline the inspection and permitting process for de… Despite landowner objections, Lancaster County Board OKs battery energy storage Lancaster County Board approves a zoning change that will allow companies to apply for a special permit to build battery energy storge systems… Lancaster County OKs budget boost, raises for deputies, corrections staff The Lancaster County Board on Tuesday approved its 2025-26 budget, which makes up for a mid-year budget gap and covers big pay increases for c… Lincoln neurosurgeon jumps into NU regents race with former governor's endorsement Jeremy Hosein of Lincoln, a neurosurgeon and former student regent, announced his campaign at the Capitol and was endorsed by a former governor. Watch Now: Related Video What to know about conservative activist Charlie Kirk Trump faces protesters at DC dinner as federalization effort nears expiration Trump faces protesters at DC dinner as federalization effort nears expiration New findings by NASA Mars rover provide strongest hints yet of potential signs of ancient life AP New findings by NASA Mars rover provide strongest hints yet of potential signs of ancient life Trump signature on Epstein check disputed in latest document dump Trump signature on Epstein check disputed in latest document dump × Facebook Twitter Bluesky YouTube Instagram Sites & Partners The Columbus Telegram The Fremont Tribune The Beatrice Daily Sun Place an ad Event Calendar Online Features Work here Inspire Lincoln Services Subscriber Services Advertise with us E-edition RSS Newsletters Contact us Become a Carrier Services Licensing Shopping © Copyright 2025 The Lincoln Journal Star , PO Box 81609 Lincoln, NE 68501 Terms of Use | Privacy Policy | Advertising Terms of Use | Do Not Sell My Info | Cookie Preferences Powered by BLOX Content Management System from bloxdigital.com . Notifications Settings You don't have any notifications. Get up-to-the-minute news sent straight to your device. Topics News Alerts Subscribe Breaking News Subscribe Husker News Subscribe Back × You are logged in Switch accounts Secure transaction. Cancel anytime. Have an account? Log In Back × Sign Up Account processing issue - the email address may already exist User information Username (Optional) This is the name that will be displayed next to your photo for comments, blog posts, and more. Choose wisely! * First name * Last name * Email Address Your email address will be used to confirm your account. We won't share it with anyone else. * Password Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address. * Confirm Password Confirm your password. CAPTCHA Create Account or Sign up with facebook Google Have an account? Log In × You're all set! Thank you . Your account has been registered, and you are now logged in. Check your email for details. OK Back × Log In Invalid password or account does not exist Email Address Password Forgot your password? Log In Email me a log in link or Sign in with facebook Google Admin login Subscribe Need an account? Sign Up Back × Reset Password Submitting this form below will send a message to your email with a link to change your password. Email or Screen Name CAPTCHA Reset Password × Forgot Password An email message containing instructions on how to reset your password has been sent to the email address listed on your account. Back × Email me a log in link Account Email CAPTCHA Send Email Back × Promotional Offers Enter Promo Code Redeem No promotional rates found. Back × Purchase Gift Purchase Access × An error occurred × Secure & Encrypted Sign in with Email Address Continue with Email Address or Continue with facebook Continue with Google What's your email address? Email Password Confirm password What's your name? First name Last name Who is this gift for? Recipient name Recipient email Optional message for the recipient Who is this gift from? Purchaser name Purchaser email Delivery date Delivery date What's your billing location? Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip Code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe What's your delivery address? Copy billing location Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe Phone Subtotal: Total: How would you like to pay? Add New Card I Agree to the Subscription Terms of Use. This service will be automatically renewed and your credit card billed once it nears expiration. Secure transaction. Secure transaction. Cancel anytime. × You're all set! Thank you . Your gift purchase was successful! Your purchase was successful, and you are now logged in. A receipt was sent to your email. OK × An error occurred This offer is currently unavailable. Close"
    },
    {
      "url": "https://suncrestgardens.com/site/contact-us/how-to-reach-us/",
      "text": "How to Reach Us - Suncrest Gardens ABOUT US LANDSCAPE GROUP Landscape Development Landscape Management GARDEN CENTER Shop Online About the Garden Center Meet the Staff Loyalty Program Return and Replacement Policy NEWS & PROMOTIONS CAREERS CONTACT US Select Page How to Reach Us Email, Map and Directions  Find Us 5157 Akron-Cleveland Road Peninsula, Ohio 44264  Email Landscaping Please fill out the contact form below Garden Center Gardencenter@SuncrestGardens.com Please provide a phone number so we can get in touch with you. Snow Removal & All Other Inquiries Email@SuncrestGardens.com  Phone Numbers Tel: 330-650-4969 Fax: 330-650-4981 Landscape Group Contact Form Please fill out the form below for Landscape Development or Landscape Maintenance related inquiries ONLY. Due to the ever-changing inventory at the Garden Center, please call for the current availability of any item. We will be happy to help you at 330-650-4969. Name * First Last Email * Enter Email Confirm Email Address Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Phone Interests Would you like to sign up for Suncrest's E-Mailings? * Yes No CAPTCHA WHERE WE'RE LOCATED 5157 Akron-Cleveland Road Peninsula, Ohio 44264 GET DIRECTIONS Contact Tel: 330-650-4969 Fax: 330-650-4981 Garden Center GardenCenter@SuncrestGardens.com Please Leave a Phone Number Landscaping | Snow | Other Email@SuncrestGardens.com GARDEN CENTER HOURS OF OPERATION Sunday: 10am to 5pm Monday - Friday: 9am to 6pm Saturday: 9am to 5pm Check out our portfolio of work on HOUZZ. HOUZZ is a website connecting homeowners and home professionals with the best tools, resources and vendors. GET INSPIRATION Get inspiration for your projects and news from Suncrest  via our social media channels and signup for our email newsletter . Follow Follow Follow Follow SHOP ONLINE Go to the Online Garden Center . LOYALTY PROGRAM Sign up for the Loyalty Program . © [wpsos_year] Suncrest Gardens / All Rights Reserved.  // Made by MONSTERS Career Opportunities Available CLICK HERE TO APPLY NOW! CLOSE Share This Facebook Twitter LinkedIn"
    },
    {
      "url": "https://sunkengardens.org/photography-policy/",
      "text": "Photography Policy - Sunken Gardens Plan Your Visit Tours & Group Visits Events Animals Plants History Weddings & Events Membership Volunteer Donate About Us Visit Plan Your Visit Tours & Group Visits Events Explore Animals Plants History Reserve Weddings & Events Support Membership Volunteer Donate About Plan Your Visit Tours & Group Visits Events Animals Plants History Weddings & Events Membership Volunteer Donate About Us Visit Plan Your Visit Tours & Group Visits Events Explore Animals Plants History Reserve Weddings & Events Support Membership Volunteer Donate About Photography & Filming Policy General Public Photography Policy Amateur, recreational, and hobbyist photographers are welcome to take photos for personal use only. Group or single posed photography (description below) is required to be pre-approved. Photography may not block, disrupt, or hinder visitor access or circulation of paths and walkways. Personal photographs and videos are not to be used for commercial purposes. Photo sessions are approved on a case-by-case basis. Maximum of 5 sessions permitted each day. Wedding photography is only permitted for clients contracted for a wedding at Sunken Gardens. Hours Photos sessions are scheduled during the hours of 10 a.m. and 3 p.m. Monday through Thursday. No after-hour shoots are available. Please observe all guidelines listed below and be aware of the nature of the facilities that you are using. Please be mindful that we are unable to reserve a specific garden area for photo sessions. Description Photo sessions include proposals, engagement sessions, family portraits, anniversaries, graduations, prom, maternity, blogs, birthdays, quinceaneras etc.  Balloons are not permitted in the Gardens.  Sessions must be scheduled 5 days in advance. Pricing The fee for a one-hour photo session is $250 for up to 10 persons, including your hired photographer. Additional time is available at the rate of $150 per hour, with a minimum increment of one hour. Additional adult guests are $20 per person. All prices are pre-tax. Payment is due upon arrival of session and entire party must be present at the time of check-in. Please note: Sunken Gardens reserves the right to turn away photographers who have not booked in advance and has the right of refusal based on community standards/content. Commercial Photography & Filming Sunken Gardens is home to tropical plants and trees in a subtropical environment. There are many backdrops that make beautiful photo and film opportunities. We allow the use of Sunken Gardens’ property for film, TV commercials, and still photography shoots based upon certain criteria. To discuss the use and the availability of the Gardens, please call 727.892.5715 or email sarah.carvalis@stpete.org to receive a copy of the reservation form. Drone Policy Sunken Gardens is a no-drone zone. Due to strong safety concerns and protection of our National Historic Landmark, drone flight or photography (or flight of unmanned, and/or remote-controlled aircraft of any kind) originating from or flying over Sunken Gardens property, is strictly prohibited, except in collaboration with Sunken Gardens’ Marketing Department and with express written permission. Guidelines •\tDo not climb or hang from trees, bushes, ponds, waterfalls or animal enclosures.  Such actions will result in removal from the Gardens. •\tPhotography must not block gateways, pathways, entrances or exits. Do not place equipment where it will block pathways or restrict access for other visitors. •\tWalking, standing, placing equipment, or taking photographs in planting beds and wooded areas is not permitted any time. •\tDo not attach, drape, lean or hang anything from trees, plants or gates. •\tSunken Gardens cannot guarantee that scheduled special events, programming, maintenance work, or construction work will not interfere aesthetically, logistically or physically with the photoshoot. •\tThere are no dressing room facilities. The restrooms are not to be used as a dressing room as they are the public facilities for the Gardens. •\tAppropriate attire is always required. Changing clothes or photography/videography of bathing suits or lingerie is not permitted. Nudity, in any form, is strictly prohibited. •\tThe permit is for photography only. Wedding ceremonies are not allowed unless contracted through Sunken Gardens. Performing a ceremony will result in the immediate termination of the photoshoot with no refund of the fee. •\tAll visitors should enjoy the Gardens while remaining on the designated paths and walkways.  If at any time a volunteer or staff member witnesses behavior that places the other visitors, the Gardens, or animals at risk, visitors may be asked to leave the premises and forfeit their garden experience. 1825 4th St. N. St. Petersburg, FL 33704 727-551-3102 Visit our Facebook Visit our Instagram Photo Credit: City of St. Petersburg & Julia Calvert Photography & Filming Policy hello world! linkedin facebook pinterest youtube rss twitter instagram facebook-blank rss-blank linkedin-blank pinterest youtube twitter instagram"
    },
    {
      "url": "https://www.sunkengardens.net/contact",
      "text": "Contact — Sunken Gardens About the Author Purchase a Book Blog Resources Contact Menu Sunken Gardens Street Address City, State, Zip Phone Number Your Custom Text Here Sunken Gardens About the Author Purchase a Book Blog Resources Contact Contact Contact If you have any questions about this site or about purchasing a book, please feel free to contact me! Name * First Name Last Name Email Address * Subject * Message * Thank you!"
    },
    {
      "url": "https://www.gardens.org.nz/contact",
      "text": "Contact Us - Get in Touch Today — New Zealand Garden Trust | North & South Island Gardens, NZ Skip to Content Open Menu Close Menu Search Gardens About Discover & Learn Membership + Events Become a friend Register your garden The Earth Star Upcoming Events Create a member Account Login Account 0 0 Donate Search Gardens About Discover & Learn Membership + Events Become a friend Register your garden The Earth Star Upcoming Events Create a member Account Login Account 0 0 Donate Open Menu Close Menu Search Gardens About Discover & Learn Folder: Membership + Events Back Become a friend Register your garden The Earth Star Upcoming Events Create a member Account Login Account Donate Discover Distinctive New Zealand Gardens Contact Discover Gardens Become a Friend Contacting Gardens To contact specific gardens for bookings, visits or enquiries, please use the contact details listed on individual garden pages. For enquiries related to NZ Gardens Trust, please either complete the contact enquiry form, or contact Trust Manager, Victoria Read as follows: Phone:+64276948778 Email: info@gardens.org.nz Name * First Name Last Name Email * Phone (###) ### #### What is your enquiry related to? * Registering my Garden NZGT Membership Friends of NZGT Donation or Bequest NZGT event Other/General Enquiry Message * Thank you! Additional Donations & Bequests Leave a Green Legacy Donate For donations over $400 or to obtain a tax invoice please contact us here to arrange a bank transfer. NZ Gardens Trust: Celebrating the best of New Zealand's horticultural heritage and fostering a community of garden enthusiasts. Explore Home Explore Gardens About Upcoming Events Discover and learn Become a Friend Register your Garden Member Portal Registration Connect Contact Us Member Portal Login Donate First Name Last Name Email Address Sign Up Thank you! Subscribe NZ Gardens Trust Copyright ©‎  2023 . All rights reserved. Privacy Policy info@gardens.org.nz Site Credit"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    }
  ]
}