{
  "fuentes": [
    {
      "url": "https://sunsetstaffingpros.com/",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://tampa.kidsoutandabout.com/content/sunsets-pier-60",
      "email": "jean@sunsetsatpier60.com"
    },
    {
      "url": "https://www.yahoo.com/news/clearwater-beach-pier-60-nightly-093000756.html",
      "email": "app-store-icon@3x.png"
    },
    {
      "url": "https://www.yahoo.com/news/clearwater-beach-pier-60-nightly-093000756.html",
      "email": "google-play-icon@3x.png"
    },
    {
      "url": "https://www.yahoo.com/news/clearwater-beach-pier-60-nightly-093000756.html",
      "email": "u003ebillhimself@yahoo.com"
    },
    {
      "url": "https://sunsetstaff.com/",
      "email": "bookings@sunsetstaff.com"
    },
    {
      "url": "https://www.mygulfcoastproperty.com/clearwater-beach-condos/pier-60-clearwater-beach/",
      "email": "cindy@mygulfcoastproperty.com"
    },
    {
      "url": "https://www.mygulfcoastproperty.com/clearwater-beach-condos/pier-60-clearwater-beach/",
      "email": "name@website.com"
    },
    {
      "url": "https://sunsetstaff.com/contactus/",
      "email": "bookings@sunsetstaff.com"
    },
    {
      "url": "https://pierhouse60.com/contact-us/",
      "email": "info@pierhouse60.com"
    }
  ],
  "mails": [
    "app-store-icon@3x.png",
    "bookings@sunsetstaff.com",
    "cindy@mygulfcoastproperty.com",
    "eben@eyebytes.com",
    "google-play-icon@3x.png",
    "info@pierhouse60.com",
    "jean@sunsetsatpier60.com",
    "name@website.com",
    "u003ebillhimself@yahoo.com"
  ],
  "nombre_sitio": "sunsetsatpier60.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sunsetstaffingpros.com/",
      "text": "Sunset Staffing LLC (570)98 NURSE Home About Contact Job Openings Files/Downloads Equal Opportunity Privacy Policy More Home About Contact Job Openings Files/Downloads Equal Opportunity Privacy Policy (570)98 NURSE Home About Contact Job Openings Files/Downloads Equal Opportunity Privacy Policy Welcome to Sunset Staffing LLC Welcome to Sunset Staffing LLC Welcome to Sunset Staffing LLC Welcome to Sunset Staffing LLC Our Partners About Us We have a growing team of dedicated healthcare professionals Sunset Staffing is always excited to add reliable and motivated professionals to our team! Our caring hands give you peace of mind We provide quality professional care to every long term care facility and resident that we encounter Reviews - (scroll and click to read) Mailing and Physical address: 155 South 2nd Street, Sunbury Pa 17801 Copyright © 2024 Sunset Staffing LLC - All Rights Reserved. Contact Powered by GoDaddy HIRING dependable and motivated RN'S, LPN'S & cNA'S Welcome! Check out our current  job openings page ! This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://tampa.kidsoutandabout.com/content/sunsets-pier-60",
      "text": "Sunsets At Pier 60 | Kids Out and About Tampa Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Tampa's online guide to everything for kids, teens, & families! Menu FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids LOCAL EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local places with memberships / season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Apple Picking Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local Classes Classes by Subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Corn Mazes Pumpkin Patches Tampa's Master Guide to Holiday Fun 101 Holiday Happenings around Tampa Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Tampa Favs Top 20 Places to Take Kids Around Tampa 101 Family Day Trips from Tampa Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign up for our fabulous FREE weekly e-newsletter Advertise in Our Weekly E-newsletter Search form Search Secondary menu Master Guide to Fall Fun 101 Family Day Trips Sunsets At Pier 60 Address: 10 Pier 60 Drive Clearwater , FL , 33767 Phone: (727) 434-6060 27° 58' 39.6876\" N , 82° 49' 56.0388\" W See map: Google Maps https://www.sunsetsatpier60.com/ jean@sunsetsatpier60.com Contact name: Info Business/organization type: Festival/Fair committee Beach What our organization offers: Items to purchase Items to purchase: Gifts, jewelry, & accessories Live performances Movies Subjects / Categories: Arts: Performance Music Arts: Visual Painting/sculpture Nature/Outdoors The Sunsets at Pier 60 Festival is a nightly sunset celebration that takes place in Pier 60 Park on Clearwater Beach, Florida. This free family event features artisans, crafters, street performers and live musical entertainment, weather permitting. Click For More Information - Web Service Pinterest Share on Facebook Tweet Widget Featured in Tampa Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids LOCAL EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local places with memberships / season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Apple Picking Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local Classes Classes by Subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Corn Mazes Pumpkin Patches Tampa's Master Guide to Holiday Fun 101 Holiday Happenings around Tampa Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Tampa Favs Top 20 Places to Take Kids Around Tampa 101 Family Day Trips from Tampa Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign up for our fabulous FREE weekly e-newsletter Advertise in Our Weekly E-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://www.yahoo.com/news/clearwater-beach-pier-60-nightly-093000756.html",
      "text": "At Clearwater Beach’s Pier 60, the nightly sunset celebration resumes Search query Search the web Skip to main News Finance Sports More -1 Manage your account Help Add or switch accounts Sign out Search the web Advertisement Advertisement Return to Homepage Top Stories: Charlie Kirk fatally shot Who was Charlie Kirk? Ellison surpasses Musk Pandemic pups Trump on N.C. train stabbing Harris on Biden's decision to run Trump barred from firing Lisa Cook Trump: Epstein note a 'dead issue' 2 Americans fly to Tunisia by mistake 'Phillies Karen' viral drama Tampa Bay Times, St. Petersburg, Fla. At Clearwater Beach’s Pier 60, the nightly sunset celebration resumes Nicolas Villamil, Tampa Bay Times Fri, June 20, 2025 at 9:30 AM UTC 4 min read At Clearwater Beach’s Pier 60, the nightly sunset celebration resumes Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways Nine months after hurricanes Helene and Milton ravaged Clearwater Beach’s Pier 60, regulars are striving for pre-storm normalcy — and to an extent, achieving it. Beachgoers from near and far have returned, and so have the vendors and performers. They make up the lifeblood of the pier’s nightly sunset celebration, a showcase of art and busking which dates back three decades. With rainbow umbrellas at their backs, artisans line the pier, greeting those who wander to their tables from nearby hotels and the sand. As another storm season begins, those who rely on the gathering for their livelihood are still feeling anxious. Advertisement Advertisement Advertisement Advertisement Lisa Chandler, a lifelong Clearwater resident who has coordinated the nonprofit Sunsets at Pier 60 with her husband Steve since 1995, said last summer’s storms were unprecedented for the area. “In at least my history of being a business owner on Clearwater Beach, nothing has ever compared to the magnitude of what we experienced last summer,” said Chandler, who owns Pier 60 Concessions and the Barefoot Beach House restaurant on the southern end of the barrier island. Most devastating, Chandler said, was the storm surge from Hurricane Helene. The Barefoot Beach House took on about 5 feet of water, and when Chandler and her husband visited afterward, kitchen equipment like fryers and commercial freezers were gone. Chandler believes they are lost in the gulf. “Everything inside the building was basically sucked out,” said Chandler, 54. Advertisement Advertisement Advertisement Advertisement The storm surge scattered the beach’s famed sugar sands and debris onto roads. Sunsets at Pier 60 could not return until the city cleared the roads, decontaminated the sand and replaced parts of the beach where the shoreline was left thin. Crews used the pier’s parking as a hub, Chandler said. While that played out, the pier’s animating characters were in limbo. Sunsets at Pier 60 started up again in mid-November, but the festivities were limited to the base of the main attraction, the pier, until it reopened Feb. 28. “We were really nervous that they were gonna shut down for good,” said Hailey Hasseltine, 29. She quit her job selling life insurance a year ago to launch a stand where customers can pick a pearl out of an oyster. Jeannie Young, a Clearwater mother who has been selling her handmade yarn creations for four years on Pier 60, said the hurricanes hindered her financially. Advertisement Advertisement Advertisement Advertisement “It was concerning,” Young, 43, said of the seven weeks away from the pier. “Last year was hard. We cut back on spending as a family to get through it.” Michelle Quigley has sold Zen gardens, wooden coasters and candles with gemstone bases at the pier for two years. She said she was grateful to return in November but that sales are better now that she can set up on the pier. Quigley, 53, who lives in Tarpon Springs, is among the artisans who rely on sales as their sole income. She said she typically works five days a week at the pier and relies on it as her “bread and butter,” though she also sells online and wholesale. Last year’s hurricanes marked the end for some at the pier because they could not afford to wait to return. Advertisement Advertisement Advertisement Advertisement “Some vendors had to get a regular day job,” Young said. “A lot of vendors went and looked at other weekend events … and that’s where they’re staying.” Problems persist for some who returned. Under their displays, merchants conceal the expensive generators they bought because electricity has not been restored at the pier. After about two months of not being able to work, this proved to be an unwelcome expense. And while the pier is drawing crowds, festival veterans estimate they are smaller. Nearby construction at the Clearwater Beach Marina limits access to a sidewalk that serves as an important pathway from hotels to the pier. The work is not slated to be completed until August 2026 . Advertisement Advertisement Advertisement Advertisement Pier 60 has still not opened beyond the bait shop, which is located about two-thirds of the way down the pier. The remaining third of the pier is a popular fishing and sightseeing spot with a separating revolving door visitors must pay to walk past. Access fees and bait shop sales brought in nearly $2 million in revenue in each of the last two years, Clearwater’s assistant director of parks and recreation Matthew Anderson told the City Council earlier this month. Three days later, the council authorized a contract worth more than $300,000 to a Dunedin-based construction company for repairs to the bait house and temporary repairs to the pier. With a reopening date of Sept. 1, Anderson estimates nearly an entire year of revenue has been lost since Helene. For now, the festivities and camaraderie at Clearwater’s most iconic landmark feel a far cry from last year’s scenes of destruction. A feeling of warmth has returned to Pier 60, and not only from the humidity and the buskers who perform daring acts with flames. But as another hurricane season begins, Lisa Chandler can’t help but keep memories of the last one front of mind. “Having experienced what we went through this past year, I will personally be more in tune to every storm.“ Chandler said. “But Mother Nature and the storm surge? Definitely not to be underestimated.” Advertisement About Our Ads Solve the daily Crossword 22,504 people played the daily Crossword recently. Can you solve it faster than others? 22,504 people played the daily Crossword recently. Can you solve it faster than others? Crossword Play on Yahoo Advertisement Advertisement Advertisement Yahoo! US Politics 2024 Election World Health Science The 360 Contact Us Originals Help Share Your Feedback About Us About Our Ads Site Map Follow us on Download our app © 2025 Yahoo. All rights reserved."
    },
    {
      "url": "https://sunsetstaff.com/",
      "text": "Sunset Staff Sunset Staff Follow Us: (424) 354-2274 Menu Home Services Open menu Model Staff Catering Staff Bartenders Brand Ambassadors Book Now Join Our Team Contact us About Us Partnerships Quality Selection Quality Service Services Model Staff Catering Staff Bartenders Brand Ambassdors Get an Instant Quote (424) 354-2274 bookings@sunsetstaff.com Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number * Comment or Message Submit Sunset Staff is a full servicing staffing company. WIth the intention to make any event run seamlessly. Whether it be a brand launch, corporate event, private party, dinner party, etc. Sunset Staff is the most reliable and most affordable full service staffing company. Useful Links Menu Book Now Join Our Team Contact us other Links Menu About Us Privacy Policy Terms and Conditions Information (424) 354-2274 bookings@sunsetstaff.com Copyright © 2025 Sunset Staff"
    },
    {
      "url": "https://www.mygulfcoastproperty.com/clearwater-beach-condos/pier-60-clearwater-beach/",
      "text": "Fun Things To Do On Pier 60 In Clearwater Beach MENU Areas CONDOS Anna Maria To Siesta Key Pinellas County Sarasota/Bradenton Tampa All Beachfront Condos All Downtown Condos HOMES Anna Maria To Siesta Key Apollo Beach Pinellas County Sarasota/Bradenton Tampa BEACHFRONT CONDOS All Beachfront Clearwater Beach To St Pete Beach Anna Maria To Siesta Key Condos BEACH Beachfront Condos Anna Maria Island Clearwater Beach Indian Rocks Beach Indian Shores Island Estates Longboat Key Madeira Beach Redington Beach Sand Key St Pete Beach Siesta Key Treasure Island See All Beachfront MAINLAND Mainland Condos Belleair Clearwater Dunedin Gulfport Largo Sarasota Downtown Seminole St Pete Downtown St Petersburg Tampa Tampa Downtown Tarpon Springs See All Mainland Condos LIFESTYLE Condos by Lifestyle 55+ Beachfront Downtown Golf Investment Non-Flood Zone Condos Pet-Friendly Tennis Waterfront Homes BEACH Anna Maria Island Clearwater Beach Indian Rocks Beach Indian Shores Island Estates Longboat Key Madeira Beach Redington Beach St Pete Beach Treasure Island See All Beachfront Homes MAINLAND Apollo Beach Belleair Clearwater Dunedin Gulfport Largo Oldsmar Seminole St Petersburg Tampa Tarpon Springs See All Mainland Homes LIFESTYLE Homes by Lifestyle Gated Golf Non-Flood Zone Homes Tennis Waterfront Lifestyles CONDOS Beachfront Downtown Condos 55+ Golf Investment Non-Flood Zone Condos Pet-Friendly Tennis Waterfront All Lifestyle Searches HOMES Gated Golf Non-Flood Zone Homes Tennis Waterfront All Lifestyle Searches MORE LIFESTYLES Fun For Kids Things To Do Videos Search Search Tips Advanced Search Search by Map Zip Code Search Property Tracker Featured Listings Contact About Meet The Team Testimonials Get Help From A Local Expert Buyers Sellers Communities Choose Condos Choose Homes More Login / Register Blog (727) 619-2799 ENGLISH 中文 FRANÇAIS 한국어 ITALIANO 日本語 DEUTSCH PORTUGUÊS РУССКИЙ ESPAÑOL TIẾNG VIỆT Home Clearwater Beach Condos Pier 60 Clearwater Beach Pier 60 Clearwater Beach The activities at Pier 60 Clearwater Beach include the daily Sunset Festivals, the Sunset Cinema Movies, street performers, crafters, food vendors, people watching, and more. Pier 60 is a great place to spend an afternoon or evening. It is located right in the heart of Clearwater Beach near the roundabout. Daily Sunset Festival - The Sunsets at Pier 60 Daily Festival operates 364 days a year from two hours before sunset until two hours after sunset, weather permitting.  When you go you will see artisans, crafters, street performers, and the world famous Pier 60 sunsets over the Gulf of Mexico. Street Performers - One of our favorite things is to watch the Street Performing.  There’s no telling who will show up on any given night, but we have seen some really talented people who enthralled the audience. There is no admission fee and no tickets sold, but the performers are not shy about asking for a well-deserved donation at the end in a nice way. Crafters - There is usually a good assortment of crafters selling their wares. It’s interesting stuff and the vendors are always happy to talk to you. You can usually find a unique gift to take home the family or loved ones. The crafters typically include braids and wraps, photography, makeup, paintings, artwork, jewelry, nautical items, candles, gift items, and much more. Fishing Pier - There is also the fishing pier which reaches out over a thousand feet into the Gulf of Mexico. You can walk part of the pier near the shoreline but there is a fee to go out to the end. It depends a lot on the season and tides, but the common fish that are caught include Spanish mackerel, trout, snook, redfish, tarpon, sheepshead, snappers, flounder, jacks and more. Interested in a Condo on Clearwater Beach? Save time and give us a call at 727-619-2799 or use our handy contact form . We hope you enjoyed this write-up about one of our favorite beach spots, Clearwater Beach Pier 60. If you have any questions or need help in any way please give us a call at 727-619-2799 . Location : 10 Pier 60 Drive Clearwater, FL 33767 Pier 60 Videos Pier 60 On A Beautiful Day Pier 60 on Clearwater Beach is one of the most popular sites to visit on our Gulf Beaches. See some short videos of Pier 60 and a few of the fun things to do while you are there. Pier 60 and Beach Walk - Aerial Views Get a quick aerial tour of popular Pier 60 and Beach Walk on Clearwater Beach. Beachfront Condos On Clearwater Beach All Clearwater Beach Investment Condos Aqualea Resort Avalon Club Clearwater Beach Clearwater Beach Beachfront Condos Clearwater Beach Condos Clearwater Beach Pet-Friendly Majestic Sand Condos Mandalay Beach Club Pura Vida Regatta Beach Club Sandpearl Residences Video Tours of Clearwater Beach White Sands Your Resources Waterfront Condos On Clearwater Beach All Clearwater Beach Waterfront Condos Belle Harbor Brightwater Blue Brightwater Point Clearwater Beach Condos Clearwater Beach Pet-Friendly Clearwater Point Continental Towers Harbor View Resort and Marina Condo Hotels Harborview Grande JW Marriott Residence The 440 West Bldgs Video Tours of Clearwater Beach Your Resources Other Nearby Beach Condos Clearwater Beach Condos Indian Rocks Beach Condos Indian Shores Condos Island Estates Condos Madeira Beach Condos Redington Beach Condos Sand Key Condos South Pasadena Condos St Pete Beach Condos Tierra Verde Condos Treasure Island Condos Use The Handy Contact Form Below to Get In Touch First Name: Last Name: Email Address: Phone: Questions / Comments: Submit By proceeding, you expressly consent to receive texts at the number you provided, including marketing, from MyGulfCoastProperty.com about real estate related matters, but not as a condition of purchase. Message frequency varies. You can text Help for help and Stop to cancel. You also agree to our Terms of Service and to our Privacy Policy regarding the information relating to you. Message and data rates may apply. Additionally, you expressly consent to receiving calls at the number you provided, including marketing by auto-dialer, pre-recorded or artificial voice, and email, from  MyGulfCoastProperty.com about real estate related matters, but not as a condition of purchase. This consent applies even if you are on a corporate, state or national Do Not Call list. Messages may be processed by an automated system. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Contact MyGulfCoastProperty.com Keller Williams St Pete 360 Central Avenue, Suite 600 St Petersburg, FL 33701 O: (727) 619-2799 E: Email Us Navigation Areas Condos Homes Lifestyles Search Contact About Buyers Sellers View All Popular Searches Beachfront Condos Intracoastal Waterfront Condos St Pete Downtown Condos Waterfront Homes 55+ Condos Accessibility | Terms of Service | Privacy Policy | DMCA Notice | Property Listings | Sitemap © Copyright 2025 My Florida Coastal Team. All Rights Reserved. Real Estate Websites by Sierra Interactive We're Here to Help Feel free to reach out any time: MyGulfCoastProperty.com Keller Williams St Pete 360 Central Avenue, Suite 600 St Petersburg, FL 33701 O: (727) 619-2799 E: Email Us Have a Question or Want a Free Market Report? Contact Us Home Blog Areas CONDOS Anna Maria To Siesta Key Pinellas County Sarasota/Bradenton Tampa All Beachfront Condos All Downtown Condos HOMES Anna Maria To Siesta Key Apollo Beach Pinellas County Sarasota/Bradenton Tampa BEACHFRONT CONDOS All Beachfront Clearwater Beach To St Pete Beach Anna Maria To Siesta Key Condos BEACH Beachfront Condos Anna Maria Island Clearwater Beach Indian Rocks Beach Indian Shores Island Estates Longboat Key Madeira Beach Redington Beach Sand Key St Pete Beach Siesta Key Treasure Island See All Beachfront MAINLAND Mainland Condos Belleair Clearwater Dunedin Gulfport Largo Sarasota Downtown Seminole St Pete Downtown St Petersburg Tampa Tampa Downtown Tarpon Springs See All Mainland Condos LIFESTYLE Condos by Lifestyle 55+ Beachfront Downtown Golf Investment Non-Flood Zone Condos Pet-Friendly Tennis Waterfront Homes BEACH Anna Maria Island Clearwater Beach Indian Rocks Beach Indian Shores Island Estates Longboat Key Madeira Beach Redington Beach St Pete Beach Treasure Island See All Beachfront Homes MAINLAND Apollo Beach Belleair Clearwater Dunedin Gulfport Largo Oldsmar Seminole St Petersburg Tampa Tarpon Springs See All Mainland Homes LIFESTYLE Homes by Lifestyle Gated Golf Non-Flood Zone Homes Tennis Waterfront Lifestyles CONDOS Beachfront Downtown Condos 55+ Golf Investment Non-Flood Zone Condos Pet-Friendly Tennis Waterfront All Lifestyle Searches HOMES Gated Golf Non-Flood Zone Homes Tennis Waterfront All Lifestyle Searches MORE LIFESTYLES Fun For Kids Things To Do Videos Search Search Tips Advanced Search Search by Map Zip Code Search Property Tracker Featured Listings Contact About Meet The Team Testimonials Get Help From A Local Expert Buyers Sellers Communities Choose Condos Choose Homes Other Get Help Questions? We're Here to Help Recently From Our Blog Waldorf Astoria Residences St. Petersburg Launch Sales – Downtown’s Tallest Luxury Tower By Rich Kisida 9/10/2025 What People Love About Clearwater Beach Condos | My Florida Coastal Team By Rich Kisida 9/5/2025 We're Here to Help Feel free to reach out any time: MyGulfCoastProperty.com Keller Williams St Pete 360 Central Avenue, Suite 600 St Petersburg, FL 33701 O: (727) 619-2799 E: Email Us Have a Question or Want a Free Market Report? Contact Us"
    },
    {
      "url": "https://sunsetstaff.com/contactus/",
      "text": "Contact us – Sunset Staff Sunset Staff Follow Us: (424) 354-2274 Menu Home Services Open menu Model Staff Catering Staff Bartenders Brand Ambassadors Book Now Join Our Team Contact us About Us Partnerships Contact us Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * Email * Phone * Subject Message * Submit (424) 354-2274 bookings@sunsetstaff.com Locations we Serve Los Angeles, CA | Phoenix, AZ | Miami, FL | New York City, NY | International Upon Request Sunset Staff is a full servicing staffing company. WIth the intention to make any event run seamlessly. Whether it be a brand launch, corporate event, private party, dinner party, etc. Sunset Staff is the most reliable and most affordable full service staffing company. Useful Links Menu Book Now Join Our Team Contact us other Links Menu About Us Privacy Policy Terms and Conditions Information (424) 354-2274 bookings@sunsetstaff.com Copyright © 2025 Sunset Staff"
    },
    {
      "url": "https://pierhouse60.com/contact-us/",
      "text": "Contact Pier House 60 | Clearwater Beach Hotel Skip to content 1-727-683-0002 Plan Ahead, Save Big – 20% Off with Advance Purchase Facebook-f Instagram Tripadvisor Yelp Rooms Special Offers Deals Passport to Paradise Amenities Gallery Dining Menu Rooms Special Offers Deals Passport to Paradise Amenities Gallery Dining Things To Do Nearby Live Web Cam Reviews Contact Us Location Menu Things To Do Nearby Live Web Cam Reviews Contact Us Location Book Now Book Now Home Rooms Special Offers Deals Passport to Paradise Amenities Gallery Dining Reviews Things To Do Nearby Live Web Cam Contact Us Location Menu Home Rooms Special Offers Deals Passport to Paradise Amenities Gallery Dining Reviews Things To Do Nearby Live Web Cam Contact Us Location Contact Us Get in touch with us today! Get in touch with us today! Name Email Phone Date Message Submit At Pier House 60 Clearwater Beach Marina Hotel, we are committed to ensuring that individuals with disabilities enjoy full access to our websites. In recognition of this commitment, Pier House 60 Clearwater Beach Marina Hotel is in the process of making modifications to increase the accessibility and usability of this website, using the relevant portions of the Web Content Accessibility Guidelines 2.0 (WCAG 2.0) as our standard. Please be aware that our efforts are ongoing. If, at any time, you have difficulty using this website, or with a particular web page or function on this site, please contact us by phone (727) 683-0002 or email info@pierhouse60.com and we will make all reasonable efforts to assist you. Any accessible rooms reserved by the reservation system will be held for the reserving guest with disabilities and blocked/removed from the reservation system. Our accommodating hotel rooms have everything needed to make your stay in Clearwater special. Rest with ease in a plush Serta mattress with premium bedding and stylish sheets, while watching your favorite show on a large flat-screen TV. Quick Links Home Rooms Deals Passport to Paradise Amenities Gallery Reviews Menu Home Rooms Deals Passport to Paradise Amenities Gallery Reviews Things To Do Nearby Live Web Cam Reviews Contact Us Location Book  Now Menu Nearby Live Web Cam Reviews Contact Us Location Book  Now Contact Us 1 727-683-0002 Toll free: 855-859-2952 info@pierhouse60.com 101 Coronado Dr,Clearwater Beach, Florida,33767,USA Facebook-f Instagram Tripadvisor Yelp Disclaimer: At Pier House 60 Clearwater Beach Marina Hotel, we are committed to ensuring that individuals with disabilities enjoy full access to our websites. In recognition of this commitment, Pier House 60 Clearwater Beach Marina Hotel is in the process of making modifications to increase the accessibility and usability of this website, using the relevant portions of the Web Content Accessibility Guidelines 2.0 (WCAG 2.0) as our standard. Please be aware that our efforts are ongoing. If, at any time, you have difficulty using this website, or with a particular web page or function on this site, please contact us by phone (727) 683-0002 or email info@pierhouse60.com and we will make all reasonable efforts to assist you. Any accessible rooms reserved by the reservation system will be held for the reserving guest with disabilities and blocked/removed from the reservation system. Escape to the tranquil sands of one of the best beaches in America! Pier House 60 Marina Hotel has it all and is located in the heart of Clearwater Beach , across the street from our sugary sand beach and directly on the Marina and close to local attractions . Visit our other amazing locations © Pier House 60 2025 | All rights reserved. Policy Accessibility"
    }
  ]
}