{
  "fuentes": [
    {
      "url": "https://swampfestweekiwachee.com/contests/",
      "email": "sponsors@swampfestweekiwache.com"
    },
    {
      "url": "https://www.gottagoorlando.com/post/get-in-touch-with-your-mossy-and-monstrous-side-at-swamp-fest-the-weeki-wachee-swamp-festival",
      "email": "info@gottagoorlando.com"
    },
    {
      "url": "https://www.flhistoriccapitol.gov/Pages/ExhibitsAndCollections/Exhibits/Mermaids.aspx",
      "email": "hc-logo@2x.png"
    },
    {
      "url": "https://www.flhistoriccapitol.gov/Pages/ExhibitsAndCollections/Exhibits/Mermaids.aspx",
      "email": "info@flhistoriccapitol.gov"
    },
    {
      "url": "https://www.tampabay.com/news/hernando/2020/03/02/a-romp-in-the-swamp-weeki-wachee-swamp-fest-returns/",
      "email": "lia@rocktheboatfl.com"
    },
    {
      "url": "https://www.tampabay.com/news/hernando/2020/03/02/a-romp-in-the-swamp-weeki-wachee-swamp-fest-returns/",
      "email": "pday@tampabay.com"
    },
    {
      "url": "https://www.suncoastnews.com/news/weeki-wachee-swamp-fest-to-be-held-march-3-5/article_341ce37e-b46d-11ed-a797-7331c0277446.html",
      "email": "dpleus@suncoastnews.com"
    },
    {
      "url": "https://swampfestweekiwachee.com/contact-us/",
      "email": "entertainment@swampfestweekiwachee.com"
    },
    {
      "url": "https://swampfestweekiwachee.com/contact-us/",
      "email": "info@swampfestweekiwachee.com"
    },
    {
      "url": "https://swampfestweekiwachee.com/contact-us/",
      "email": "president@swampfestweekiwachee.com"
    },
    {
      "url": "https://swampfestweekiwachee.com/contact-us/",
      "email": "sponsors@swampfestweekiwachee.com"
    },
    {
      "url": "https://swampfestweekiwachee.com/contact-us/",
      "email": "vendor@swampfestweekiwachee.com"
    },
    {
      "url": "https://swampfestweekiwachee.com/contact-us/",
      "email": "vicepresident@swampfestweekiwachee.com"
    },
    {
      "url": "https://www.floridatrend.com/article/29785/pods-founder-develops-new-fetchable-storage-concept/",
      "email": "custrelations@floridatrend.com"
    }
  ],
  "mails": [
    "custrelations@floridatrend.com",
    "dpleus@suncoastnews.com",
    "entertainment@swampfestweekiwachee.com",
    "hc-logo@2x.png",
    "info@flhistoriccapitol.gov",
    "info@gottagoorlando.com",
    "info@swampfestweekiwachee.com",
    "lia@rocktheboatfl.com",
    "pday@tampabay.com",
    "president@swampfestweekiwachee.com",
    "sponsors@swampfestweekiwache.com",
    "sponsors@swampfestweekiwachee.com",
    "vendor@swampfestweekiwachee.com",
    "vicepresident@swampfestweekiwachee.com"
  ],
  "nombre_sitio": "swampfestweekiwachee.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://swampfestweekiwachee.com/contests/",
      "text": "Contests – Swamp Fest Linda Pedersen Park: 6400 Shoal Line Blvd, Spring Hill, FL 34607 Facebook Swamp Fest Home About Gallery Contests Sponsors Vendors Forms & Applications Contact Us Menu back Contests You are here: Home Contests Swamp Monster Contest: Fill out the swamp monster contest form here! The Swamp Monster contest is a yearly costume contest where contestants of all ages come dressed as their version of a swamp monster. Sign in for the contest will be located at the information booth. Contestants must be at the stage dressed in their costumes, no later than 10:30am on SATURDAY. Contestants are encouraged to make as much of their costume as possible. You will be asked questions (see below) during the contest to help the judges make their final decisions. Contestants are encouraged to remain in costume and circulate throughout the Festival as much as possible. Photos of all contestants may be used in Swamp Fest promotions and advertising. Judges decision will be final. It is encouraged to show up early and interact with the community. Past Swamp Monsters Costumes! 2023 Swamp T-Shirt Design Swamp Fest T-Shirt Contest: Click here for information on the T-shirt Contest! Previous Swamp T-Shirt Designs Prize Booth Hundreds of prizes, donated from businesses and individuals around Hernando County, will be raffled off over the Festival. Winners will be announced hourly from the stage as well as displayed on a board on the side of the Prize Booth at the front of the park. You do not need to be present to win. Raffle Tickets are $1 each or 6 for $5 and can be purchased at the prize booth. If you would like to donate a prize or purchase your tickets early please contact sponsors@swampfestweekiwache.com Swamp Fest Weeki Wachee Where & When Location: 6400 Shoal Line Blvd. Spring Hill, FL 34607 Date of Event: March 6, 7, 8, 2026 Facebook Useful Links Home About Gallery Contests Sponsors Vendors Forms & Applications Contact Us Located at Linda Pedersen Park © Copyright - Swamp Fest Weeki Wachee ™ Web Development by"
    },
    {
      "url": "https://www.gottagoorlando.com/post/get-in-touch-with-your-mossy-and-monstrous-side-at-swamp-fest-the-weeki-wachee-swamp-festival",
      "text": "Get in touch with your mossy and monstrous side at Swamp Fest, the Weeki Wachee Swamp Festival! top of page Search News Orlando News Space Coast News Daytona Beach News Tampa Bay News Travel & Tourism News Orlando International Airport News Weather News Hotel & Resort News Retail News Deals & Special Offers Theme Parks Theme Park News Walt Disney World News Universal Orlando News Seaworld Orlando News Busch Gardens Tampa News Legoland Florida News Attractions Attraction News Water Park News Dinner Show News Entertainment Entertainment News Events & Festival News Concerts & Live Music News Stand-Up Comedy News Bar & Nightlife News Theater & The Arts News Museum & Gallery  News Film &  Movie Theater News Sports News Weekend Guide Events & Things To Do This Weekend Free  &  Cheap Things To Do This Weekend Food & Drink Events Event Calendar Submit Event Things To Do Top 10 Things To Do In Orlando Monthly Events Guide Theme Park Guide Attractions Guide Water Park Guide Dinner Show Guide Concerts & Music Guide Theater & The  Arts Guide Events & Festival Guide Restaurant Guide Bars & Nightlife Guide Movie Theater Guide Museums & Gallery Guide Shopping Guide Seasonal Valentine's Day Guide St Patrick's Day Guide Easter Guide Mother's Day Guide Father's Day Guide Memorial Day Guide 4th Of July Guide Halloween Guide Thanksgiving Guide Holiday & Christmas Guide New Year's Eve Guide What's New Contact Contact Us Newsletter About Us Advertise More Use tab to navigate through the menu items. The Latest News Get in touch with your mossy and monstrous side at Swamp Fest, the Weeki Wachee Swamp Festival! Alastair Mac Feb 28, 2024 2 min read Swamp Fest is a three day festival of music, arts, crafts, food and good times, an annual event drawing thousands of people to this authentic Florida style festival. Get in touch with your mossy and monstrous side at Swamp Fest, a 30-year tradition that grew from a parking lot party to what is now a major event celebrating Florida’s wetlands, wildlife and Weeki Wachee weirdness. Shop among hundreds of arts, crafts, food and gift vendors and sample state delicacies such as fried gator. Watch some clog dancing or dance to live folk music and more! A highlight of the festival is the Swamp Monster contest, a yearly costume contest where contestants of all ages come dressed as their version of a Florida swamp monster for a chance to win one of hundreds of prizes donated by local businesses. This year's Weeki Wachee Swamp Festival take place on March 1 - 3, 2024 at Linda Pederson Park, Spring Hill. Admission is $5 for Adults, $3 for Kids 6-12, and Kids 5 and under free. Pay at the gate, with cash and card accepted. Swamp Fest has grown from a small community fundraising festival to an annual event that draws thousands from all over. In 1994 Swamp Fest held its first annual festival in the parking lot at the Weeki Wachee Area Club, soon outgrowing the parking lot it moved around the corner to the Weeki Wachee Christian Camp. The festival remained there for a few years before moving even further down Shoal Line Boulevard to Linda Pedersen Park. In 2013 Swamp Fest moved to Weeki Wachee Springs State Park. In 2018  the festival took the trek back to the swamp and 2024 will be held, once again, at Linda Pedersen Park! To keep up to date with the very latest happenings in Orlando, sign up to the Gotta Go Orlando Newsletter , and follow us on our social accounts to find the best events: Twitter , Facebook , Instagram , and YouTube . Discover the best of Orlando with our daily updated news, featuring the Best Things To Do: Entertainment News , Live Music & Concerts News , Events & Festival News , Theater & The Visual Arts News , Bar, Club & Nightlife News , and Food & Drink News . For the latest events in Orlando, check out our events guides: Events & Things To Do In Orlando This Month , Events & Things To Do In Orlando This Weekend , and FREE Events & Things To Do In Orlando This Weekend . To feature your business with Gotta Go Orlando learn more about advertising with us , and to or list your events with us, submit your Orlando events here . Tags: Weeki Wachee Events & Festival News Florida News Central Florida News Meet The GGO Team Emma Walton News Producer Contact Shane Walton News Producer Contact Alastair Mac News Editor Contact The Latest Headlines Pop sensation Tate McRae brings her Miss Possessive Tour to Orlando's Kia Center for two nights! The Florida Vintage Market's Y2K Market returns to Orlando's Ivanhoe Park Brewing Company Mark your calendars Orlando - The very first DTO Local Line-Up is coming to Discover Downtown! Top 10 Things To Do in Orlando this Weekend, Sept. 12 - 14, 2025 Ivanhoe Village, Milk District, Mills 50, and Curry Ford West team up for The Golden Girls Gone Wild Pub Crawl Your Orlando Plans Are Here Orla n do Events This Weekend​ Orlando Events This Month Things To Do In Orlando Gotta Go Orlando is your local source for the latest entertainment news , events and things to do throughout Central Florida. We feature concerts , theater, arts & culture , nightlife , food & drink . theme parks & attractions, festivals, events , and more. © 2025  Gotta Go Orlando  -  All Rights Reserved Privacy Policy bottom of page"
    },
    {
      "url": "https://www.flhistoriccapitol.gov/Pages/ExhibitsAndCollections/Exhibits/Mermaids.aspx",
      "text": "Visit Paradise: Stories of Weeki Wachee and the Mermaids - \tFlorida Historic Capitol Museum Back to Top Hours Monday - Friday: 9:00 am-4:30 pm Saturdays: 10:00 am-4:30 pm Sundays and Holidays: Noon-4:30 pm Closed Thanksgiving Day and Christmas Donate Join the Museum Museum Classroom Museum Hours Monday - Friday: 9:00 am-4:30 pm Saturdays: 10:00 am-4:30 pm Sundays and Holidays: Noon-4:30 pm Closed Thanksgiving Day and Christmas Donate Join the Museum Home About About the Historic Capitol Mission Background Brochure Foundation Board of Directors Staff Visit Us Visit the Historic Capitol Hours and Admission Arrival Information Group Visits Self-Guided Tours Directions and Parking Capitol Amenities Exhibits & Collections Long-Term Exhibits Exterior & Grounds Past Exhibits Archival Exhibits Oral History Collection Virtual Tours About the Tours Interactive Floor Plan Audio Tour Video Tour Education Overview Online Resources Teacher Resources Capitol Visions: 2058 Support Us Historic Capitol Foundation Ways to Give Join the Museum Legislative Legacy Volunteer Rent the Museum Sponsorship Opportunities Museum Classroom Visitor Resources Visit Paradise: Stories of Weeki Wachee and the Mermaids Friday, December 2, 2011 6:00 p.m. – 9:00 p.m. FREE EVENT FIRST FRIDAY GALLERY HOP & TROLLEY RUN Author Presentations at 6:45 p.m. and 8:00 p.m. Have you ever wondered about the life of a Weeki Wachee mermaid? Local author Lu Vickers, one of the winners of the 2011 Florida Book Awards co-sponsored by The Florida Humanities Council, will present the amazing story of one of Florida's oldest roadside attractions. With her charming style of storytelling, she will describe the exotic crystal clear spring where mythical mermaids and mermen dwelled in the deep as she shares excerpts from her book Weeki Wachee, City of Mermaids , which she will also sign. Visitors will also be charmed by three of the original Weeki Wachee mermaids, as they share their personal stories of life underwater as they entertained thousands of tourists hungry for a taste of the real Florida dream. For more than sixty years, the mermaids of Weeki Wachee have performed underwater for countless tourists and film crews. Following World War II, Florida tourism was booming and the appeal of the roadside attraction offering crystal clear waters and alluring mermaids put this tiny town on the map as a must-see destination. Newt Perry had been the manager of the Wakulla Springs Lodge since 1941, and in 1946 he helped to develop and manage Weeki Wachee Spring, which first opened on October 12, 1947, and became the exotic fantasyland promoted as a city underwater where mermaids performed the normal activities of daily life such as making coffee, eating fruit and primping before a mirror. They also performed ballet, and after ABC bought the attraction in 1959, began performing musicals, such as Alice in Waterland . The mermaids went through extensive underwater training in order to perform these amazing stunts in what appeared to be effortless fashion. Lu Vickers was charmed by the image of mermaids as a child when she first got a glimpse of a faded billboard advertising Weeki Wachee Spring. As she sped down the Gulf Coast Highway on summer vacation with her family in their Ford Fairlane, she could only envision the life of a mermaid. Years later, as that childhood memory bubbled up to the surface and tugged her imagination, she returned to Weeki Wachee to meet the real mermaids themselves. Vicker's delightful prose weaves the remarkable tale of Weeki Wachee's history and its beautiful mermaids. We hope you will join us for this exciting evening with Lu Vickers and original Weeki Wachee mermaids. This event serves as the Closing Party for the temporary exhibit on Florida tourism, Remembering Paradise: Souvenirs of Historic Florida Attractions . The event is part of the First Friday Gallery Hop and Trolley Run. Music will be provided by The Bothys, a local folk group performing traditional and contemporary Celtic tunes. Refreshments will be provided. Funding for this program was provided in part through an award from the Florida Humanities Council with funds from the Florida Department of State, Division of Cultural Affairs. Visit www.flahum.org to learn more. The Florida Historic Capitol Foundation, as the Direct Support Organization for the Museum, extends its deepest appreciation to the following Partners for their support and efforts in making this event possible. About Lu Vickers Lu Vickers is a 2011 winner of the Florida Book Awards presented annually by the Florida Humanities Council. She won a Bronze Medal in the category of Florida Nonfiction for the publication of her recent book Cypress Gardens, America's Tropical Wonderland . Lu Vickers has published numerous essays and short stories in magazines such as Salon.com and Apalachee Review, and she has received three Individual Artist's Grants from the Florida Division of Cultural Affairs. In addition to the novel Breathing Underwater , she has published two books on Florida history, Weeki Wachee, City of Mermaids, a History of One of Florida's Oldest Roadside Attractions , and Cypress Gardens, America's Tropical Wonderland . With former mermaid Bonnie Georgiadis, Lu put together a collection of vintage photos, Deep in the Spring: 30 Years of Underwater Photography at Weeki Wachee, due out in 2012. She is currently working on a novel. About The Florida Humanities Council The Florida Humanities Council (FHC) is a private 501(3)C non-profit organization dedicated to building strong communities and informed citizens by providing Floridians with the opportunity to explore the heritage, traditions and stories of our state and its place in the world. Established in 1973, the FHC is the state affiliate of the National Endowment for the Humanities. FHC uses the disciplines of the humanities to develop public programs and resources that explore history, literary and artistic traditions, cultural values and ethics. About Wakulla Springs Lodge The beautiful Wakulla Springs Lodge sits amidst one of the world’s largest freshwater springs, shaded by grand southern oak trees. Founded by Edward Ball in 1937 and formerly managed by the Department of Environmental Protection, Cape Leisure Corp took over management of the lodge on July 1, 2011 and is recapturing the 1930's splendor through its programs. The lodge offers visitors a timeless glimpse into Florida's pristine and elegant past. Surrounded by nature, including canopies of oak, hickory and beech trees, the natural spring, and Florida wildlife, the Lodge offers up old southern charm and a peaceful get-away. A great place for family vacations and reunions, weddings, anniversaries, conferences, and other special events, the Lodge is also a perfect retreat for artists, writers, or those that just want to “get away from it all.” Visit www.wakullaspringslodge.com to learn more. View the Press Release Weeki Wachee Mermaids Photo Gallery Book Jacket, Weeki Wachee, City of Mermaids: A History of One of Florida’s Oldest Roadside Attractions Front cover, left: Bonita Colson rides “Bubbles” the seahorse, ca. 1960s. By permission of Weeki Wachee. Photo by Tel Lagerberg. Right: Bonita Colson checks her reflection in the mirror, ca. 1960. By permission of Weeki Wachee. Photo by Sparky Schumacher. Cover design by Larry Leshan. Published in cooperation with the USF Libraries' Florida Studies Center, by University Press of Florida. Mermaid in Green Bathing suit Top of Page Susan Backlinie performs in the Mermaid Follies, 1965 – 66. By permission of Weeki Wachee. Photo by Sparky Schumacher. The Weeki Wachee mermaids pose on the Queen conch shell, which also served as an airlock. Nancy Tribble Benda shows off the tail she wore in the movie Mr. Peabody and the Mermaid. Photo by Ted Lagerberg. Top of Page Nancy Tribble Benda and Sis Myers grace the cover of an early brochure, ca. 1947. By permission of Lu Vickers. Nancy Tribble Benda carries the tail she wore in Mr. Peabody and the Mermaid, 1948. Courtesy of the Florida State Archives. Top of Page The Weeki Wachee mermaids pose on the clamshell roof of the million dollar theater that ABC built in 1960. Female swimmer deep in the spring. Top of Page Contact Us Phone: (850) 487-1902 Fax: (850) 410-2233 Email: info@flhistoriccapitol.gov Museum Hours Monday - Friday: 9:00 am-4:30 pm Saturdays: 10:00 am-4:30 pm Sundays and Holidays: Noon-4:30 pm Closed Thanksgiving Day and Christmas Stay Connected Privacy Statement Florida Historic Capitol Museum • 400 South Monroe Street • Tallahassee, FL 32399-1100 Copyright © 2007-2025 Florida Historic Capitol Museum • Under the Management of the Florida Legislature"
    },
    {
      "url": "https://www.tampabay.com/news/hernando/2020/03/02/a-romp-in-the-swamp-weeki-wachee-swamp-fest-returns/",
      "text": "A romp in the swamp: Weeki Wachee Swamp Fest returns Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement News / Hernando A romp in the swamp: Weeki Wachee Swamp Fest returns Things to do in Pasco and Hernando counties Francesca Caropepe, a Swamp Monster contest favorite for a number of years, is now the official mascot of the Weeki Wachee Swamp Festival. This year's festival, which will be March 6-8 at Linda Pedersen Park, will not only include the Swamp Monster contest on Saturday, but also a new Kiddie Swamp Monster contest (for ages 2-6) on Sunday. [ Weekie Wachee Swamp Festival ] By Phyllis Day Former Times staffer Published Phyllis Day Former Times staffer MORE FOR YOU I became a Weeki Wachee mermaid at Sirens of the Deep camp, and you can too • History Camp staff, public urge Florida agency to not sell Chassahowitzka campground • Environment Advertisement Hernando County driver took out anger with mom by hitting random man, cops say • Crime Tampa Bay hospitals report rise in COVID-19 infections • Health Two Tampa Bay TV stations could merge under one company. What to know • Business Do you love where you work? Nominate your Tampa Bay business. • Business Top things to do in Tampa Bay this week: Dog Swim Day, Gabriel Iglesias, Monster Jam • Life & Culture A lesser known harm of hurricanes? More domestic violence • Environment Top things to do in Tampa Bay this week: Kesha, Fetish Con and ‘80s bands • Life & Culture Court records detail what led to 2023 arrest in Jennifer Odom cold case • Crime Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.suncoastnews.com/news/weeki-wachee-swamp-fest-to-be-held-march-3-5/article_341ce37e-b46d-11ed-a797-7331c0277446.html",
      "text": "Weeki Wachee Swamp Fest to be held March 3-5 | News | suncoastnews.com Skip to main content You have permission to edit this article. Edit Close Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Pasco Pinellas Hernando Sports Business Classifieds Local Events Promote Your Event Multimedia Legal Notices Site search Search About Us Contact Us Advertising Information Subscribe Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Facebook Twitter YouTube 84° Mostly Cloudy Port Richey, FL (34668) Today Considerable cloudiness. A stray shower or thunderstorm is possible. High 86F. Winds NNE at 5 to 10 mph.. Tonight Mostly cloudy skies this evening will become partly cloudy after midnight. Low 71F. Winds NE at 5 to 10 mph. Updated: September 11, 2025 @ 2:14 pm Full Forecast Site search Search Toggle navigation Pasco Pinellas Hernando Sports Business Classifieds Local Events Promote Your Event Multimedia Legal Notices Weeki Wachee Swamp Fest to be held March 3-5 By VINCENT F. SAFUTO, Hernando Today Feb 27, 2023 Feb 27, 2023 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save The Weeki Wachee Swamp Fest will be held March 3-5 at Linda Pedersen Park, 6400 Shoal Line Blvd., Spring Hill. On Friday and Saturday, the event will be from 9 a.m. to 5 p.m., and on Sunday from 9 a.m. to 4 p.m. The Swamp Monster contest is a yearly costume contest where contestants of all ages come dressed as their version of a swamp monster. Hundreds of prizes, donated from businesses and individuals around Hernando County, will be raffled off over the festival. Winners will be announced hourly from the Family Chiropractic Entertainment Stage as well as displayed on a board on the side of the Prize Booth at the front of the park. You do not need to be present to win. Admission is $5 for adults, $3 for children 6 to 12; kids under 5 are free. Cash and cards will be accepted at the gate, and there will be an ATM on the premises. There will be live entertainment on the Family Chiropractic Stage, featuring folk, country and instrumental music, as well as dance groups. There will be a professional sound tech as well as space for unloading and loading equipment (no parking in this area). Entertainers are offered a VIP invitation, parking, public exposure and advertising in the form of a program handout. There will be six to 10 food trucks and other vendors from all over the country. To find out more, visit the website at https://swampfestweekiwachee.com . Facebook Twitter WhatsApp SMS Email Print Copy article link Save Tags Weeki Wachee, Florida Tampa Bay Area Weeki Wachee River Weeki Wachee Springs Nick Stubbs Mikaila Mosses Ray Williams Latest News UPDATE: Tampa youth dies of injuries after collision with SUV Around town: Pasco news briefs The Pasco & North Pinellas Fishin’ Report: As water cools, redfish bite heats up Commission OKs rezoning for overlay district for WREC on Boy Scout land Brooksville woman charged with DUI manslaughter in fatal crash Things to do around Pinellas: Sept. 11-17 Commissioners rebuff call for more Splash Park staff Pets of the week News Briefs Central, Weeki Wachee go from winless to undefeated Most Popular Articles Images Videos Commented Articles UPDATE: Tampa youth dies of injuries after collision with SUV Driver dies in State Road 54 crash Brooksville hikes taxes 13% amid budget crunch Bathroom stickers become lifeline in fight against human trafficking Barclay Avenue: Ever busy with new housing, businesses School leaders react to Florida plan to axe vaccine mandates: ‘That’s so crazy’ Brooksville woman charged with DUI manslaughter in fatal crash County to Brooksville: Your move on fire merger Pasco to merge two under-capacity schools into one K-8 campus Commission OKs rezoning for overlay district for WREC on Boy Scout land Images Videos Commented Sorry, there are no recent results for popular commented articles. Latest e-Editions North Pinellas & Tarpon Springs Beacon To view our latest e-Edition click the image on the left. Hernando Today To view our latest e-Edition click the image on the left. Suncoast News To view our latest e-Edition click the image on the left. Special Sections Discover the Suncoast Best of the Suncoast Summer Lifestyles Sections Home News Sports Business Obituaries Local Events Multimedia Services Subscription Services Submission Forms Classifieds Place an Ad Promote Your Event Search Weather Legal Notices www.SuncoastNews.com 11321 U.S. Hwy 19 North Port Richey, FL. 34668 Phone: 727-815-1049 Email: dpleus@SuncoastNews.com Follow Us Facebook Twitter YouTube × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 suncoastnews.com 9911 Seminole Blvd., Seminole, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital ."
    },
    {
      "url": "https://swampfestweekiwachee.com/contact-us/",
      "text": "Contact Us – Swamp Fest Linda Pedersen Park: 6400 Shoal Line Blvd, Spring Hill, FL 34607 Facebook Swamp Fest Home About Gallery Contests Sponsors Vendors Forms & Applications Contact Us Menu back Contact Us You are here: Home Contact Us Contact Info Mailing Address: Weeki Wachee Swamp Fest: 6252 Commercial Way #191 Weeki Wachee, FL 34613 www.swampfestweekiwachee.com ADD US ON FACEBOOK When: March 6, 7, & 8, 2026 Direct Email President – Victor 352-345-5538 president@swampfestweekiwachee.com Vice-President – Jackie fARMER vicepresident@swampfestweekiwachee.com Vendors – Diana vendor@swampfestweekiwachee.com Food Vendors – Marybeth (352) 263-5085 Foodvendor@swampfestweekiwachee.com Entertainment – Annette entertainment@swampfestweekiwachee.com Sponsorship Chair  – Tabitha Allen (863) 581-5134 sponsors@swampfestweekiwachee.com Info / Volunteers – Diana (352) 596-6449 info@swampfestweekiwachee.com Swamp Fest Weeki Wachee Where & When Location: 6400 Shoal Line Blvd. Spring Hill, FL 34607 Date of Event: March 6, 7, 8, 2026 Facebook Useful Links Home About Gallery Contests Sponsors Vendors Forms & Applications Contact Us Located at Linda Pedersen Park © Copyright - Swamp Fest Weeki Wachee ™ Web Development by"
    },
    {
      "url": "https://www.floridatrend.com/article/29785/pods-founder-develops-new-fetchable-storage-concept/",
      "text": "PODS founder develops new 'fetchable storage' concept Free Florida Trend News Alerts Free Gift With Subscription News Health Care Education Real Estate Florida 500 Movers & Influencers Legal Elite NOTABLE Business Beat Exclusives Subscribe Best Companies to Work For 350 Biggest Companies Leadership Insights Florida Higher Education Business Florida Regional Portraits Nonprofit Florida Trend's NEXT Florida Small Business Sponsored Reports September 11, 2025 Articles PODS founder develops new 'fetchable storage' concept | 8/26/2020 INNOVATION Beyond PODS When Pete Warhurst founded PODS in 1998, he hit on a portable-storage innovation that has since become commonplace. The Clearwater company was purchased for $451 million in 2007 by the investment firm Arcapita, which sold the company eight years later for more than $1 billion to the Ontario Teachers’ Pension Plan. Warhurst now has come up with a concept he calls “fetchable storage” that’s available through a company he founded in Tampa called Red Rover. The service allows customers to use storage containers that are already placed on the back of a truck, which the customer then loads up and drives to a Red Rover storage facility, where the container can be stored. ECONOMIC DEVEOPMENT Engineering-support company Baymar Solutions is spending more than $2 million to open a facility in Pasco County, where it plans to hire five. The Pasco Economic Development Council plans to open a business incubator — called SMARTstart at The Grove — in Wesley Chapel this fall. EDUCATION The New College of Florida Foundation raised $1 million to strengthen its fundraising capabilities. The money will be used to hire a director of philanthropy and upgrade the foundation’s database. Saint Leo University in Pasco County has started offering “micro-credential courses” that the university says will enable adults to learn new skills quickly through short, highly focused classes. Topics include data analytics, computer applications, GED exam prep, web design and marketing. ENVIRONMENT An 800-square-mile portion of the Gulf of Mexico has been deemed the Nature Coast Aquatic Preserve, giving protection to about 400,000 acres of seagrass along the shores of Citrus, Hernando and Pasco counties. Among the protections for seagrass are limits on dredging and the size and location of dock construction. A $17.3-million beach renourishment project is underway along Manatee County’s Anna Maria Island. FINANCE PSCU, a St. Petersburg credit union service organization, purchased Massachusetts-based Primax from T.K. Keith Co. Primax designs and offers support services for payment card programs at credit unions and community banks throughout the U.S. and the Caribbean. Terms of the sale were not disclosed. GOVERNMENT Weeki Wachee, founded in 1966 as home to the mermaid attraction, is no longer a city. A bill signed in June by Gov. Ron DeSantis dissolved the municipality, which had fewer than 20 residents. The mermaid attraction remains under state jurisdiction as Weeki Wachee Springs State Park. HEALTH CARE Orlando Health is acquiring Bayfront Health, a 480-bed hospital in St. Petersburg, from Community Health Systems. HOSPITALITY Bob LaCasse is the new managing director of TradeWinds Island Resorts in St. Pete Beach. LaCasse had been managing director of both the Cheeca Lodge Resort and Spa in Islamorada and Tranquility Bay in Marathon. RETAIL Amazon spent $26.4 million to buy 82 acres in Temple Terrace, where the retailer plans to build a 633,000-sq.-ft. warehouse. Also, construction is underway on Amazon’s 110,825-sq.-ft. distribution center in Venice. TECHNOLOGY The $6-billion sale of Tech Data to Apollo Global Management, a New York private equity firm, has been completed. TRANSPORTATION Port Tampa Bay won a $19.8-million federal grant to help it expand its shipping container facilities. Naples-based Elite Jets appointed Mark London, who had been the charter air service company’s general manager, to president. Stephen Myers, who had been assistant chief pilot, was promoted to executive vice president. OBITUARY Ben Hill Griffin III A giant in the Florida citrus industry, Ben Hill Griffin III died July 25 at 78 of cancer. His citrus and cattle company owns 10,000 acres of groves and 85,000 acres of ranch and timberland in Central Florida. Chairman and CEO of agribusiness firm Alico from 1990 to 2004, he donated land valued at $50 million for the construction of Florida Gulf Coast University. He was inducted in the Florida Agricultural Hall of Fame and the Florida Citrus Hall of Fame in 2009. COVID-19 UPDATE Construction on Allegiant Air’s Sunseeker Resort in Charlotte County has been delayed. The Las Vegas-based airline cut its non-airline subsidiary spending due to COVID-19’s impact on air travel. The 800-room resort had been scheduled to open next year. Manatee County plans to spend $17.5 million to help residents, businesses and non-profits hurt by COVID-19. An estimated $5.25 million of the fund will target services to promote and improve public health. Hillsborough County Property Appraiser Bob Henriquez has proposed a task force to discuss tax relief ideas for property owners unable to pay property tax bills due to coronavirus losses. The University of South Florida has created a $20-million fund to help students remain on the path to graduation, even if they are experiencing financial hardships due to the COVID-19 pandemic. The university’s We Got U-SF Scholarship and Waiver program has helped nearly 22,000 students so far. Read more in Florida Trend's September issue . Select from the following options: ACCESS NOW Instant Access for Existing Digital Subscribers DIGITAL ISSUE Purchase a single DIGITAL copy of this issue SUBSCRIBE Purchase a one year PRINT, DIGITAL or ALL ACCESS Subscription PRINT SERVICES Purchase single PRINT copy or ADD digital access to a PRINT subscription Florida Trend Health Care Florida Trend Education Florida Trend Real Estate Florida’s a hot spot for shark research For Subscribers Read the September Issue » Access an Issue Florida Trend Magazine Last Month's Issue Subscribe Now! Buy a Single Issue Get Digital Access Florida Trend Video Pick Excitement growing as volunteers prepare for International Coastal Clean-Up Day Video Picks | Viewpoints@FloridaTrend About Us Contact Us Site Map Circulation Services Advertise Terms & Conditions Privacy Policy Florida Trend Media Company 801 Third Street South St Petersburg, FL 33701 727.821.5800 FREE News Alerts Stay on top of Florida business by signing up for any of our free eNewsletters. They are easy to read on any device, and always filled with timely news, insights and analysis. SUBSCRIBE and get a FREE GIFT! Now you can read Florida Trend anytime and anywhere. Subscribe today for the format that suits your lifestyle best: Print, Digital or All Access! © Copyright 2025 Trend Magazines Inc. All rights reserved."
    }
  ]
}