{
  "fuentes": [
    {
      "url": "https://sweetwaterinn.com/wedding-brochure/",
      "email": "info@sweetwaterinn.com"
    },
    {
      "url": "https://sweetwaterinn.com/weddings-and-receptions/",
      "email": "info@sweetwaterinn.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "beyou@moxietogo.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "blaine@shortmediagroup.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "clara-and-bradley-invitation@2x-3299068d7eaf55fe79c0.png"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "contact@beardedbrothersevents.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "david@keithwatsonevents.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "djwaynep@yahoo.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "guestservices@themodesalon.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "info@alwayseventfulplanning.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "info@gosiaandali.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "info@jimmyhophotography.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "info@marstonphotography.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "info@pranges.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "jaime@sweetserendipityphotography.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "jonathand@geniusdjs.com"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "rachel@masterpieceweddings.net"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "email": "weddingsbymadison@yahoo.com"
    },
    {
      "url": "https://sweetwaterinn.com/sweetwater-catering-co/",
      "email": "info@sweetwaterinn.com"
    },
    {
      "url": "https://www.sweetwaterspa.com/",
      "email": "lodging@sweetwaterspa.com"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/hotels/reviews/sweetwater-branch-inn-lodging-events-182315",
      "email": "facebook-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/hotels/reviews/sweetwater-branch-inn-lodging-events-182315",
      "email": "facebook-white@3x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/hotels/reviews/sweetwater-branch-inn-lodging-events-182315",
      "email": "instagram-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/hotels/reviews/sweetwater-branch-inn-lodging-events-182315",
      "email": "instagram-white@3x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/hotels/reviews/sweetwater-branch-inn-lodging-events-182315",
      "email": "pinterest-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/hotels/reviews/sweetwater-branch-inn-lodging-events-182315",
      "email": "pinterest-white@3x.png"
    },
    {
      "url": "https://sweetwaterinn.com/privacy-policy/",
      "email": "info@sweetwaterinn.com"
    },
    {
      "url": "https://sweetwaterinn.com/employment/",
      "email": "info@sweetwaterinn.com"
    },
    {
      "url": "https://sweetwaterinn.com/frequently-asked-questions-events/",
      "email": "info@sweetwaterinn.com"
    },
    {
      "url": "https://sweetwaterinn.com/contact-us/",
      "email": "info@sweetwaterinn.com"
    }
  ],
  "mails": [
    "beyou@moxietogo.com",
    "blaine@shortmediagroup.com",
    "clara-and-bradley-invitation@2x-3299068d7eaf55fe79c0.png",
    "contact@beardedbrothersevents.com",
    "david@keithwatsonevents.com",
    "djwaynep@yahoo.com",
    "facebook-white@2x.png",
    "facebook-white@3x.png",
    "guestservices@themodesalon.com",
    "info@alwayseventfulplanning.com",
    "info@gosiaandali.com",
    "info@jimmyhophotography.com",
    "info@marstonphotography.com",
    "info@pranges.com",
    "info@sweetwaterinn.com",
    "instagram-white@2x.png",
    "instagram-white@3x.png",
    "jaime@sweetserendipityphotography.com",
    "jonathand@geniusdjs.com",
    "lodging@sweetwaterspa.com",
    "pinterest-white@2x.png",
    "pinterest-white@3x.png",
    "rachel@masterpieceweddings.net",
    "weddingsbymadison@yahoo.com"
  ],
  "nombre_sitio": "sweetwaterinn.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sweetwaterinn.com/wedding-brochure/",
      "text": "Wedding Brochure - Sweetwater Inn Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 352.373.6760 | Gift Certificates 2 Tesla Superchargers Available Convenient Free Parking Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 2 Tesla Superchargers Available 352.373.6760 | Gift Certificates Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us Sweetwater Branch Inn Wedding Brochure Inquire about your wedding Home E Wedding Brochure Lodging & Events Plan Your Wedding Sweetwater Branch Inn Lodging & Events provides a reception hall, gardens, and intimate event space ideal for weddings, rehearsal dinners, and bridal showers. The property spans almost 2 acres, with 29 boutique rooms, complimentary WiFi, and parking, within walking distance to downtown. See our whole wedding brochure! Click through the document or download the Wedding Brochure pdf . Venue & Menu Info Wedding Inquiry Stunning Venue Photos “a memory that will last a lifetime” View Wedding Galleries Follow us on Instagram Follow @sweetwater.branch.inn Book Your Stay  (352) 373-6760  Gift Certificates 625 E. University Avenue Gainesville, Florida 32601 (352) 373-6760 [email protected] 2 Tesla Superchargers Available Useful Links Accommodations The Grounds Map Specials & Packages Events Catering Things to Do Blog Our Story Policies Employment Contact Us Join Our Newsletter Subscribe to our newsletter to learn more about upcoming events and specials in the area. Subscribe Today Earn Rewards Join Stash Hotel Rewards for free and earn free nights and a welcome bonus! Join Now Get Social With Us Follow Follow Follow Follow Follow Local Weather 2025 © Sweetwater Inn | A Vibrant Management Property 2025 © Sweetwater Inn A Vibrant Management Property Privacy Policy | Website Accessibility Policy"
    },
    {
      "url": "https://sweetwaterinn.com/weddings-and-receptions/",
      "text": "Wedding Venues - Sweetwater Inn Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 352.373.6760 | Gift Certificates 2 Tesla Superchargers Available Convenient Free Parking Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 2 Tesla Superchargers Available 352.373.6760 | Gift Certificates Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us Sweetwater Branch Inn Weddings Wedding Inquiry Watch Video Home E Wedding Venues Sweetwater Branch Inn The Most Romantic Venue If you’re looking for a romantic venue in Florida, then Sweetwater Branch Inn is here for you. Nestled in historic downtown Gainesville in North Central Florida, our lovely inn is the perfect place for charming weddings, gorgeous receptions, and classy rehearsal dinners. Sweetwater Branch Inn’s beautiful property features vintage charm and elegance as well as Victorian romance. We stand by this truth: Your wedding should be a memory that will last a lifetime. You are in good hands at Sweetwater Branch Inn! Whether you’re envisioning an inside or outside wedding in the courtyard, by the gazebo, or colonnade surrounded by the beautiful gardens, you can choose the space that best suits your needs and style. We have two fairytale-worthy venues for your reception, the historic and intimate McKenzie House, and the elegant McKenzie Hall. Wedding Brochure Wedding Inquiry Did we mention our stunning accommodations and amenities that make our properties the ideal spot for a wedding night and honeymoon? When you get married at Sweetwater Branch Inn, you get the whole experience. Please contact us to schedule an appointment for a guided tour for your special event. Tours are by appointment only and scheduled Monday through Friday from 9 a.m. to 5 p.m. Fill out our inquiry form to request a free tour or catering consultation. Choose Between Two Gorgeous Reception Venues Reception Venue McKenzie Hall McKenzie Hall combines all the charm and ambiance of a Victorian-era banquet room with the convenience of modern amenities. The Hall’s spacious central room, with its many glass doors, opens out to a large patio surrounded by lush Florida gardens and is the perfect wedding reception venue. Elegantly designed with high ceilings, Victorian light fixtures, and exposed trusses, the McKenzie Hall speaks of times past. This spacious hall is inspired by, and adjacent to, the historic McKenzie House, a magnificent three-story Victorian home listed on the National Registry of Historic Places. The Mckenzie Hall has a capacity of 250 people and seating for 150. Mckenzie Hall Virtual Tour Reception Venue The McKenzie House Do you want to have a small, more intimate reception? The McKenzie House is ideal. The first-floor banquet area is decorated with beautiful antique furniture, rugs, and accessories. The dining room opens to a large wrap-around front porch that is perfect for cocktails before dinner. If your big day calls for the elegance of private dining and the comforts of a historical setting, you have found your perfect match in the McKenzie House. Max seating of 40 people. Mckenzie House Virtual Tour Sweetwater Branch Inn Wedding Catering We take care of everything for you, and that includes the food for your wedding! Indeed, we pride ourselves on the charm and comfort of our inn as well as the delectable dishes we serve. Choose from light fare to buffets to full-service, sit-down dining, and dazzle the taste buds of your guests! Sweetwater can accommodate and provide menus for up to 250 people for hors d’oeuvres style and 150 people for sit-down dinners in the McKenzie Hall. Browse Wedding Menus Stunning Venue Photos “a memory that will last a lifetime” View Wedding Galleries Follow us on Instagram Follow @sweetwater.branch.inn Book Your Stay  (352) 373-6760  Gift Certificates 625 E. University Avenue Gainesville, Florida 32601 (352) 373-6760 [email protected] 2 Tesla Superchargers Available Useful Links Accommodations The Grounds Map Specials & Packages Events Catering Things to Do Blog Our Story Policies Employment Contact Us Join Our Newsletter Subscribe to our newsletter to learn more about upcoming events and specials in the area. Subscribe Today Earn Rewards Join Stash Hotel Rewards for free and earn free nights and a welcome bonus! Join Now Get Social With Us Follow Follow Follow Follow Follow Local Weather 2025 © Sweetwater Inn | A Vibrant Management Property 2025 © Sweetwater Inn A Vibrant Management Property Privacy Policy | Website Accessibility Policy"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/sweetwater-branch-inn",
      "text": "Sweetwater Branch Inn | Wedding Venues | Cost, Reviews & Photos | Zola Web Accessibility Find gifts, vendors, couples... Log in Get started Wedding websites Wedding venues Vendors Registry Invites and paper Guest list Budget Boutique Albums Mobile app Team-Z advisors Expert Advice Inspiration Honeymoons FAQs Contact us Find a couple Zola Baby Zola Home Zola for vendors Zola Baby Zola Home Zola for vendors Plan your wedding Expert advice Find a couple Log in Get started Wedding Vendors / Wedding and reception venues / Florida venues / Gainesville, FL venues / Sweetwater Branch Inn View all ( 45 +) 45 Sweetwater Branch Inn 5.0 ( 1 review ) All-inclusive venue The venue takes care of it all - food and beverage, rentals, the works! See services included Full wedding (ceremony and reception) pricing Starting at $6,000 for off-peak dates, and $10,000 for peak dates Guest capacity Up to 150 seated guests About this venue Congratulations on your recent engagement! We couldn’t be more thrilled for you and your future spouse. Now that you made the most of the initial excitement of the news, it’s time to start planning your big day. If you’re looking for a romantic and high-end venue in Florida, then Sweetwater Branch inn is here for you. Nestled in historic downtown Gainesville in North-Central Florida, our lovely inn is the perfect place for charming weddings, gorgeous receptions, and classy rehearsal dinners. Sweetwater Branch Inn’s beautiful property features vintage charm and elegance as well as Victorian romance. We stand by this truth: Your wedding should be a memory that will last a lifetime. Did we mention our stunning accommodations and amenities that make our properties the ideal spot for a wedding night and honeymoon? When you get married at Sweetwater Branch Inn, you get the whole experience. Get a quote Seated guest capacity 10-150 Venue type Ballrooms, Banquet Halls Historic Estates, Mansions Lodges, Retreats Parks, Gardens Venue setting Covered Outdoor Indoor Outdoor 625 E University Ave, Gainesville, FL 32601 Our event spaces McKenzie Hall The McKenzie Hall is a spacious banquet hall with its many glass doors and opens out to a large patio surrounded by lush Florida gardens. McKenzie Hall combines all the charm and ambiance of a Victorian-era banquet room with the convenience of modern amenities. The Hall’s spacious central room, with its many glass doors, opens out to a large patio surrounded by lush Florida gardens and is the perfect wedding reception venue. Elegantly designed with high ceilings, Victorian light fixtures, and exposed trusses, the McKenzie Hall speaks of times past. This spacious hall is inspired by, and adjacent to, the historic McKenzie House. Guest capacity 30-150 Seated 30-250 Standing Square footage 3,300 Ideal for Wedding ceremony, Wedding reception, Rehearsal dinner, Wedding shower, Farewell brunch, Cocktail hour Guests often feel this space is “Surprised and delighted” The McKenzie House Transport your guests back to the Victorian era in our Victorian McKenzie House founded in 1895. Do you want to have a small, more intimate reception? The McKenzie House is ideal. The first-floor banquet area is decorated with beautiful antique furniture, oriental carpets, and accessories. The dining room opens to a large wrap-around front porch that is perfect for cocktails before dinner. If your big day calls for the elegance of private dining and the comforts of a historical setting, you have found your perfect match in the McKenzie House. Guest capacity Up to 40 Seated Up to 65 Standing McKenzie Hall McKenzie Hall The McKenzie Hall is a spacious banquet hall with its many glass doors and opens out to a large patio surrounded by lush Florida gardens. McKenzie Hall combines all the charm and ambiance of a Victorian-era banquet room with the convenience of modern amenities. The Hall’s spacious central room, with its many glass doors, opens out to a large patio surrounded by lush Florida gardens and is the perfect wedding reception venue. Elegantly designed with high ceilings, Victorian light fixtures, and exposed trusses, the McKenzie Hall speaks of times past. This spacious hall is inspired by, and adjacent to, the historic McKenzie House. Guest capacity 30-150 Seated 30-250 Standing Square footage 3,300 Ideal for Wedding ceremony, Wedding reception, Rehearsal dinner, Wedding shower, Farewell brunch, Cocktail hour Guests often feel this space is “Surprised and delighted” The McKenzie House The McKenzie House Transport your guests back to the Victorian era in our Victorian McKenzie House founded in 1895. Do you want to have a small, more intimate reception? The McKenzie House is ideal. The first-floor banquet area is decorated with beautiful antique furniture, oriental carpets, and accessories. The dining room opens to a large wrap-around front porch that is perfect for cocktails before dinner. If your big day calls for the elegance of private dining and the comforts of a historical setting, you have found your perfect match in the McKenzie House. Guest capacity Up to 40 Seated Up to 65 Standing Available services that can be provided by Sweetwater Branch Inn Services & amenities Bar services Catering services Clean up Dance floor Event rentals Event staff On-site accommodations Pet friendly Service staff Set up Wheelchair accessible Wifi Transportation & access Self parking - free Wheelchair accessible Rentals Barware China Flatware Glassware Lighting Linens Standard Chairs Accommodations Bedroom suites Honeymoon suite Room blocks offered Single king rooms Single queen rooms Sweetwater Branch Inn menu options $60-80 per guest Sweetwater's Menu Cocktail Hour: - Selection of three hors d'oeuvres - Hot & Cold Options - Passed or Stationed Option Dinner Reception: - Soup or Salad Course - Selection of Up to Three Entrees - A Starch and a Vegetable - Dessert Station Options Available Beverages: - Full Bar with Liquor or Beer & Wine Bar - Bartender Provided - Coffee & Tea Station Available - Liquor Required to be Provided by Client Beer & wine only Plated desserts Cocktail hour Dessert station Coffee station Champagne toast Tableside wines service Seated dinner Buffet dinner Reviews Write a review 5.0 out of 5 1 review Write a review Our wedding at SWB! • Verified review • Ilyssa and J. • Mar 22, 2025 Sweetwater Branch Inn (SWB) went above and BEYOND to make my wedding weekend everything I had dreamed of—and more. If I could give SWB a million out of five stars, I absolutely would!  \n\nMy wedding was on March 16, 2025, and originally planned as an outdoor event. The team at SWB was incredibly flexible, allowing me to get creative with the venue and hold the ceremony and dinner in a different location than they usually do which was impressive in itself!  \n\nJust days before the wedding, a storm was predicted to hit. At the last minute, we ordered a tent for the gardens (something that had never been done before), completely reworked the layout we had spent over a year planning, and somehow, everything turned out perfectly!  \n\nAdrienne, the event coordinator, and Angel, the food and beverage coordinator, were nothing short of incredible. Adrienne went above and beyond, dedicating extra time and effort to ensure my vision came to life, even with the last-minute changes.  Every single member of the staff was truly wonderful.\n\nMy close family stayed at the Inn and didn’t want to leave! Guests traveled from Canada, New York City, and even Sydney, Australia—and every single one of them raved about their stay. From the friendly and helpful staff to the elegant decor and the delicious food (both at breakfast and the wedding!), they were beyond impressed.  \n\nI cannot say enough great things about Sweetwater Branch Inn and the amazing event venue they provide. They do everything with heart, which is so rare these days—and that, above all, meant the world to me and my guests. ( -2 +) ( -3 +) Preferred vendors of Sweetwater Branch Inn Quick responder Photographer Sweet Serendipity Photography 5.0 ( 3 ) Gainesville, FL Starts at $1,750 Planner Julie Herman Events 5.0 ( 1 ) Gainesville, FL Starts at $950 Quick responder Florist Garden And Grace Florals 5.0 ( 3 ) Gainesville, FL Starts at $3,000 Cakes & desserts Cake Crazzie Newberry, FL Frequently asked questions 10 Answers Ask them a question Where do my guests park? Sweetwater has full access to the Alachua County Public Schools District Office across University Avenue which has over 150 parking spots. There is also a private parking lot behind the gardens with additional parking. I picked my date, how do I book? What is the deposit? Please call or email us and we can set up a meeting time to talk about your details. Most contracts can also be done through email! The deposit amount varies depending on the day of week and other details, however, the typical deposit amount is $2,500. Can my guests book rooms at Sweetwater Inn? Absolutely! One of the many benefits of a Sweetwater wedding and reception are the guest rooms, suites and cottages available on-site with an option for a block booking of up to 15 rooms. For more information on booking rooms please contact info@sweetwaterinn.com. Can I bring in my own decorations? Yes, each wedding reception we host is unique to your preferences. Our beautiful McKenzie Banquet Hall is surrounded by beautiful gardens, warm market lights and boasts a beautiful high ceiling with trusses creating a neutral but intricate backdrop for your unique style. Can I bring in my own vendors? Sweetwater provides all venue and catering services, but you are able to bring in your own wedding coordinator, photographer, videographer, florist, cake , DJ or band, officiant and alcohol. Can we bring our own catering and alcohol? Sweetwater is famous for great food! For this reason, we provide all catering services and require these services for receptions. You can be confident your food will be delicious and these details will be taken care of for you on your big day! We do require outside alcoholic to be brought in and Sweetwater will provide the bar service and bartender. Will there be a Sweetwater coordinator on-site the day of the wedding? An event director will be on-site the day of the wedding to facilitate your reception details and ensure our venue and catering services are as discussed. Sweetwater does not coordinate ceremonies or décor and suggests hiring a wedding coordinator for this. Your event director is focused on your reception food and bar details during the ceremony. I’m on a budget, can I still have a wedding at Sweetwater? Absolutely! We are able to accommodate most budgets. We have many options available, including open buffet stations, discounted Friday & Sunday weddings and a smaller venue for weddings of up to 65 guests. Does Sweetwater provide tables, chairs and linens? Sweetwater provides all of your tables, basic linens and white garden chairs for the ceremony and reception. Sweetwater owns many different table sizes including: 48” round, 60” round, 4’ banquet, 6’ banquet, 8’ banquet, bar height and serpentine shapes. Your event director will help you create the perfect floor plan. What happens in case of inclement weather? Our beautiful McKenzie Hall becomes the ceremony location with the McKenzie Gardens as the back drop. Your guests then enjoy drinks and hors d’oeuvres on our covered patio while the room is reset. Ask them a question Want them for your wedding? Get a quote Want them for your wedding? Get a quote Book a vendor on Zola and get 65% off save the dates . Terms 26 Zola couples have booked Explore other vendors serving Gainesville, FL NatalieRodriguezphotog Tabitha Baldwin Photography LLC Taste Of The Robersons LLC Adriana Montoya Photo Stellar Films & Photography, LLC Evermore Photography Inc Jules' Weddings & Events Hall's Photography Milkweed Moments CreventCo Pinnacle Pictures Written in Film Complete your dream team Gainesville Photographers Gainesville Beauty Professionals Gainesville Bands & DJs Gainesville Florists Gainesville Caterers Gainesville Planners Gainesville Cakes & Desserts Gainesville Videographers Gainesville Bar Services & Beverages Gainesville Officiants Gainesville Event Extras Other venues in Gainesville Andalusian Oaks Grass Campers Event Venue The Barn at Lakeside Ranch Destiny Ranch Events Whispering Oaks Winery The Abbey at Blackadder Wildwood Vineyard and Events Ever After Farms Vineyard White Rock Canyon The Brownwood Hotel & Spa Elegant Barns Venue Silver Springs State Park Other wedding services nearby Ocala, FL Wedding Photographers Plan your wedding Venues and vendors Guest list Wedding websites Registry Invites and paper Budget Boutique Albums Seating chart Mobile app About Our story Become a Zola vendor Reviews Zola Baby Careers Press Advice and support Expert advice FAQs Track order Start a return Return policy Contact us Team Z advisors Plan your wedding Venues and vendors Guest list Wedding websites Registry Invites and paper Budget Boutique Albums Seating chart Mobile app About Our story Become a Zola vendor Reviews Zola Baby Careers Press Advice and support Expert advice FAQs Track order Start a return Return policy Contact us Team Z advisors For all the days along the way Log in Find a couple Find a baby registry Get started Privacy Terms Do Not Sell / Share My Personal Information Web accessibility © 2025 Zola, Inc. All rights reserved."
    },
    {
      "url": "https://sweetwaterinn.com/sweetwater-catering-co/",
      "text": "Sweetwater Catering Co - Sweetwater Inn Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 352.373.6760 | Gift Certificates 2 Tesla Superchargers Available Convenient Free Parking Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 2 Tesla Superchargers Available 352.373.6760 | Gift Certificates Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us Gainesville Florida Sweetwater Catering Co. Inquire Home E Sweetwater Catering Co Sweetwater’s cater menu We bring catering to you Sweetwater Catering Company offers fine, expertly prepared cuisine in the true tradition of Southern hospitality. Our highly regarded chef freshly prepares some of the most original cuisine found in the Gainesville area to delight your culinary senses. Sweetwater Catering Company compliments any occasion, such as weddings, business luncheons, dinners, or other special events and private parties. From light fare to buffets to full-service, sit-down dining, you’ll find menus to suit a variety of tastes and budgets. Sweetwater Catering also offers boxed lunches, drop-offs, full service, and more! Quick Catering Menu Full Catering menu Get in touch Request a Proposal Notice: JavaScript is required for this content. Gainesville, Florida Professional Catering Our catering staff is friendly, professional and highly trained. Our goal is to assure that each and every client is afforded exemplary courtesy and service, so that their event is a unique, relaxing, and memorable experience. At Sweetwater Catering Co. we aim to create, through exemplary service, tremendous flavors and gracious attitude, an overall memorable and extraordinary experience for each of our clients that corresponds with the overall effort of love and compassion that has gone into the making of each event. Explore our Specialty Event Menu Sweetwater Catering Co offers a huge assortment of snacks, appetizers, entrees, desserts, and beverages to meet any need. Please browse some of our sample menus below. Click any of the sample menus below to expand Sweetwater Favorites Light Lunch Hot Buffet Lunch Hors D’Oeuvres Reception Dinner Buffet Plated Dinner The Sweetwater inn Grounds Our Beautiful Property Sweetwater Branch Inn invites you to our beautiful property located in downtown Gainesville, just minutes from the University of Florida, Shands Hospital, the Cade Museum, and Depot Park along with fine dining, entertainment, and nightlife. Even if you never leave the property, the Sweetwater Branch Inn has plenty of great features for you to enjoy and relax with! NEW Two Tesla chargers for guest use in the Sweetwater parking lot. Learn More Follow us on Instagram Follow @sweetwater.branch.inn Book Your Stay  (352) 373-6760  Gift Certificates 625 E. University Avenue Gainesville, Florida 32601 (352) 373-6760 [email protected] 2 Tesla Superchargers Available Useful Links Accommodations The Grounds Map Specials & Packages Events Catering Things to Do Blog Our Story Policies Employment Contact Us Join Our Newsletter Subscribe to our newsletter to learn more about upcoming events and specials in the area. Subscribe Today Earn Rewards Join Stash Hotel Rewards for free and earn free nights and a welcome bonus! Join Now Get Social With Us Follow Follow Follow Follow Follow Local Weather 2025 © Sweetwater Inn | A Vibrant Management Property 2025 © Sweetwater Inn A Vibrant Management Property Privacy Policy | Website Accessibility Policy"
    },
    {
      "url": "https://www.sweetwaterspa.com/",
      "text": "Sweetwater Inn and Spa - Rejuvenate Yourself on the Mendocino Coast Contact Location About Us Mendocino Coast Events Dining Activities (800) 300-4140 Book Now Accommodations Private Tubs In Our Victorian Pet Friendly Private Cottage Water Tower Sweetwater Eco Spa Hot Tub & Sauna Massage & Body Work Our Properties Sweetwater Vacation Home Rentals Select Page Sweetwater Inn & Spa Relax on the beautiful Mendocino Coast Book Your Stay Sweetwater Eco Spa Enjoy a soothing massage, relax in our outdoor redwood hot tubs, and emerge refreshed from our infrared and traditional cedarwood saunas. More Info Two nights of pure bliss. We never imagined our time here would be quite so perfect. The people and the atmosphere are unforgettable, and we only wish that every day could be spent at Sweetwater Gardens. From the Guestbook Well, Sweetwater, we’ve grown older together, young lovers and old lovers, and it only gets better -- Thank God! From the Guestbook Charmingly Mendocino, not to mention quaint, cozy and romantic. Lisa Maui - Hawaii Sweetwater staff are attentive and helpful. The hot tub/sauna and massage facilities are cozy, clean and relaxing. The rooms are located in the middle of the village and within easy walking distance to all our favorite shops and dining venues. . . Mrs Dr Nuckols What beauty of creation. A good feeling of life here, a few hours of respite from the harsh, demanding world. Give thanks for the precious moments. From the Guestbook This was the best weekend getaway ever! I loved our cottage... I especially loved how environmentally friendly and dog-friendly the inn was. They even had goodies for my doggie. Julianna I. SweetWater Inn Explore the Breathtaking Mendocino Coast! Come to Mendocino for a calm and blissful vacation, a fun and friendly local experience, or for a breathtaking journey to one of the world’s most scenic and beautiful places on the California north coast! We are ready to welcome you at Sweetwater Inn and Spa! Situated in the heart of the village of Mendocino, the Sweetwater Inn offers a variety of affordable lodging, including family-friendly, dog-friendly, and romantic options. Start your day with a fresh cup of hot coffee or tea from your room to embrace your day with new adventures! Accommodations to choose from include dog-friendly cottages with gas fireplaces, hot tubs, kitchens or kitchenettes; historic water tower suites; cozy Victorian rooms; and other unique comfortable rooms or vacation rentals. We are confident that your selection will be relaxing, and you will surely enjoy our friendly atmosphere (not to mention a complimentary access to our private redwood hot tubs and saunas as well as discounted rates on massages at the Sweetwater Eco Spa!). SEE OUR ROOMS Book Now Sweetwater Eco Spa Rejuvenate Yourself With its rustic charm, soothing atmosphere, and comfortable facilities, Sweetwater Eco Spa is the perfect place to let stress fade away so that you can emerge refreshed and rejuvenated. Choose from our outdoor redwood hot tubs (private), infrared and traditional saunas, and a variety of massage traditions, courtesy of our outstanding team of professionals. Our Inn guests enjoy complimentary access to our private  redwood hot tubs and saunas from 11:00 am to 10:00 pm (9:00 pm Winter) every day. BROWSE OUR SPA SERVICES Sweetwater Properties Check out our other properties for your stay with great locations and the option of bed and breakfast or a vacation rental for your group. Sweetwater Vacation Home Rentals Sweetwater Vacation Home Rentals offers a variety of exclusive vacation rental properties along the Mendocino coast. Our portfolio of vacation rentals includes a variety of desirable properties ranging from a spacious and unobstructed ocean-front home in south Caspar to a clear-heart Redwood Cottage in a quiet location near the town of Mendocino. Additionally, we have king suites overlooking the village of Mendocino, and a bungalow with a view of the enchanted Pacific Ocean in nearby Little River. Lose yourself in the romantic natural setting of our Mendocino coastline made up of rock cliffs, ocean waves, beaches, sea lions, seagulls, and the redwoods to experience a memorable vacation of a lifetime. Make your memories today! See More Upcoming Events In Mendocino No events are found. Locations Sweetwater Inn 44840 Main St, Mendocino, CA 95460 Sweetwater Inn is the bright yellow Victorian at 44840 Main St, a block and a half into town from the south entrance to Mendocino. Innkeeper Hours: 10:00 AM to 6:00 PM Sweetwater Eco Spa 955 Ukiah St, Mendocino, CA 95460 Our main spa facility is located in the redwood building next to Luna Trattoria at 955 Ukiah St. Spa Hours: 11:00 AM to 10:00 PM (9:00 PM Winter) Sweetwater Inn 44840 Main St Mendocino, CA 95460 Sweetwater Spa 955 Ukiah St, Mendocino, CA 95460 What are you waiting for? Book Your Stay Now Facebook Designed by Elegant Themes | Powered by WordPress  MAIL lodging@sweetwaterspa.com  CALL Toll-Free: 800-300-4140 Inn Keeper: 707-937-4076 Spa Desk: 707-937-4140  FIND US Inn 44840 Main Street, Mendocino, CA 95460 Spa 955 Ukiah Street Mendocino, CA 95460 } OPENING HOURS Inn 10:00 AM to 6:00 PM Spa 11:00 AM to 10:00 PM (9:00 PM Winter) We love it here, and we know you will, too! We’re here to help, so if you have any questions or concerns, please feel free to contact us at any time. Accommodations Reservations Eco Spa Pet-Friendly Lodging Contact About Us Mendocino Coast Find Us Guest Policy Pet Policy Privacy Policy COVID-19 Safety Accessibility Follow Follow Follow © 2024 Sweetwater Inn & Spa | All rights reserved"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/hotels/reviews/sweetwater-branch-inn-lodging-events-182315",
      "text": "Sweetwater Branch Inn Lodging & Events Review - Gainesville | Fodor’s Travel Go Destinations Hotels Travel News Cruises Forums Trip Ideas More Forums Trip Ideas Subscribe Login Subscribe Login USA Europe Africa & The Middle\n                        East Asia Australia & The\n                        Pacific Canada Caribbean Mexico &\n                        Central America South America Cruise Overview Cruise News Cruising 101 Line & Ship Directory Guidebooks Africa & the Middle East Asia Australia & the Pacific Canada Caribbean Europe Mexico & Central America South America United States Air Travel Cruises Travel Tips & Trip Ideas Forums Help View All Forums National Parks Best Road Trips in America Ultimate Guides for the ultimate trip Love to travel? Get FREE email communications from Fodor's Travel, covering must-see travel destinations, expert\n                        trip planning advice, and travel inspiration to fuel your passion. By signing up for the newsletter, I agree to the Privacy Policy. You must check the box to subscribe Home Destinations USA Europe Africa & The Middle East Asia Australia & The Pacific Canada Caribbean Mexico & Central America South America View All Destinations Hotels Travel News Cruises Cruise Overview Cruise News Cruising 101 Cruise Directory Forums Africa & the Middle East Asia Australia & the Pacific Canada Caribbean Europe Mexico & Central America South America United States Air Travel Cruises Travel Tips & Trip Ideas Forums Help View All Forums Trip Ideas National Parks Best Road Trips in America Ultimate Guides Login Subscribe Northeast Coast Overview Hotels Restaurants Sights Top Places Shopping Nightlife Performing Arts Gallery More Northeast Coast Hotels Northeast Coast Travel Guide Overview Hotels Restaurants See Top Places Shopping Nightlife Arts Gallery Fodor's Expert Review Sweetwater Branch Inn Lodging & Events 625 E. University Ave., Gainesville, Florida, 32601, USA Inside two grand Victorian homes—surrounded by gardens in historic downtown and within walking distance of restaurants and entertainment venues—nicely appointed guest rooms have gleaming hardwood floors, antique furnishings, and modern conveniences like free Wi-Fi. There's also plenty of Southern hospitality, as well as amenities such as an eco-friendly salt pool, business services, and detached cottages with full kitchens. PROS Southern-style breakfast Whirlpool suites Walking distance to town CONS Occasional noise issues Frequent on-site weddings Strict cancellation policy B&B/Inn $ Pet Friendly QUICK FACTS Type B&B/Inn Best For Pet Friendly Price $ HOTEL INFO Phones:\n                                                                352-373–6760 | 800-595–7760 Website: sweetwaterinn.com HOTEL DETAILS 19 rooms Rate Includes: Free Breakfast What’s Nearby Hotels USA Florida Northeast Coast Gainesville Hotels Sweetwater Branch Inn Lodging & Events About Us Contact Us Our Team Press Room FAQs Award Licensing Advertising Content Licensing Site Map About Us Contact Us Our Team Press Room FAQs Award Licensing Site Map Advertising Content Licensing Follow Us Fodor’s Travel Use of this site indicates your consent to the Terms of Use. Copyright © 2025 by MH\n                Sub I, LLC dba Internet Brands. Fodor’s is a registered trademark of MH Sub I, LLC dba Internet Brands. All rights reserved. Terms of Use | Privacy Policy | Cookie Policy | Manage Preferences | Your Privacy Choices Subscribe to Newsletter Sign up for Travel Tips & News Please Enter a Valid Email Address Subscribe I want emails from Fodor's Travel with travel information and promotions. I can unsubscribe\n            any time using the unsubscribe link at the end of all emails. Thank you for your interest! Look out for our newsletters with travel tips and special offers. Sign up for Travel Tips & News By signing up for the\n                newsletter, I agree to the Privacy Policy . You must check the box to subscribe Thank you for your interest! Look out for our newsletters with travel tips and special offers."
    },
    {
      "url": "https://sweetwaterinn.com/privacy-policy/",
      "text": "Privacy Policy - Sweetwater Inn Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 352.373.6760 | Gift Certificates 2 Tesla Superchargers Available Convenient Free Parking Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 2 Tesla Superchargers Available 352.373.6760 | Gift Certificates Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us Sweetwater Branch Inn Privacy Policies Book Your Stay Home E Privacy Policy Last Updated: June 4, 2018 Welcome to Sweetwater Branch Inn ! We are located at 625 E. University Avenue, Gainesville, Florida 32601 . Sweetwater Branch Inn (“ Company ”, “ we ”, “ us ”, or “ our ”) has prepared this Privacy Policy to describe to you our practices regarding the Personal Information (as defined below) that we collect from users of our website, located at sweetwaterinn.com (the “ Website ”) and through the use of certain third party booking engines (the “ Web Application ”), the Website and Web Application together are collectively referred to as the “ Services .” This Privacy Policy applies to your use of the Services but does not apply to any website, offering, product or service of any third party company, even if such third party website links to our Services. We do not control any such third party websites, offerings, products or services so please always review those applicable privacy policies before deciding to provide any information. If you do not consent to any of the terms included in this Privacy Policy, please do not use, or if you are already using, immediately discontinue your use of the Services. PLEASE NOTE THAT THIS PRIVACY POLICY ONLY APPLIES TO USERS WHO ARE 13 YEARS OF AGE AND OVER. IF YOU ARE A USER UNDER THE AGE OF 13, PLEASE DO NOT VISIT OR USE THE SERVICES. Website and Web Application. As a part of the Services, you may access and login into the Web Application. The Web Application allows you to access certain features of the Services, including but not limited to, those features specific to booking and the vacation guides made available by Company from time to time. You may also share ideas, feedback and other content and materials through your use of the Services, as further described herein. The Website provides users with the chance to learn more about Company, and the ability to post their thoughts and comments to the Website blog. Through the Website, users may view the various services offered by Company, learn more about the Web Application and post comments and thoughts on the Website blog. How the Services Work . Our Services provide vacation-planning information, in addition to access to third party reservation engines made available via the Web Application. So we are clear about the terminology we are using, when we use the phrase “ Personal Information ” in this Privacy Policy, we mean information that allows someone to identify or contact you, including, for example, your name, address, telephone number, e-mail address, as well as any other non-public information about you that is associated with or linked to any of the foregoing information. When we use the phrase “ Anonymous Information ” in this Privacy Policy, we mean information that is not associated with or linked to your Personal Information. Anonymous Information does not enable identification of or contact with individual persons. Children. Protecting the privacy of children is very important to us. We do not collect or maintain Personal Information from people we actually know are under 13 years of age. If you are under 13 years of age, please do not use the Services. California Privacy Rights. Subject to certain limits under California Civil Code § 1798.83, California residents may request certain information regarding our disclosure of information to third parties or their direct marketing purposes. To make such a request, please contact us as specified below in this Privacy Policy. A Note to Users Outside of the United States. Company is based in the U.S. If you are a non-U.S. user of the Services, by visiting the Website and/or using the Web Application, you acknowledge and agree that your Personal Information may be processed for the purposes identified in the Privacy Policy. In addition, your Personal Information may be processed in the country in which it was collected and in other countries, including the United States, where laws regarding processing of Personal Information may be less stringent than and less protective of Personal Information than the laws in your country. By providing your information and agreeing to the terms of this Privacy Policy, you consent to such transfer. Information We Collect Personal Information In general, the Personal Information we gather enables us to provide the Services to you and helps us learn more about the use of the Services. Specifically, we collect the following types of Personal Information: Voluntary Information . We also collect other types of Personal Information that you provide to us voluntarily, such as information that you provide directly to us in order to enable us to provide you with the Services. We may also receive requested information if you contact us via e-mail regarding support for the Website. Bookings Made Online . When you make an online booking with us through the Services, your information is transmitted securely into our property management software. The property management software stores this information on our behalf for purposes of facilitating your reservation with us. Usage/Account Information . We collect Personal Information that you submit to us voluntarily at registration and in the course of your use of the Website. To use our Services, we may require you to create an “ Account ” and we will collect your name, mailing/billing address, email address, phone number and location information, where applicable. Indexing/Third Parties . We may obtain information about you from third parties or through our indexing and analytics tools. Communications . When you communicate with us by sending us an email, we will collect and store any information that is contained in your communications with us. Information You Provide to Facebook and other Social Networking Sites . The Services may allow users to access Facebook to interact with friends and to share on Facebook through Wall and friends’ News Feeds.  If you are already logged into the Services and Facebook or another SNS, when you click on “Connect with Facebook,” or a similar connection on another SNS, you will be prompted to merge your profiles. If you are already logged into the Services but not logged into Facebook or another SNS that we support, when you click on “Connect with Facebook,” or a similar connection on another SNS, you will be prompted to enter your SNS credentials or to “Sign Up” for the SNS.  By proceeding, you are allowing the Services to access your information and you are agreeing to the Facebook or other SNS’ Terms of Use in your use of the Services. Conversely, if you are not currently registered as a user of the Services, and you click on “Sign in” using Facebook or another SNS that we support, you will first be asked to enter your Facebook or SNS credentials and then be given the option to register for the Services. In this case, we may receive information from Facebook or another SNS to make it easier for you to create an Account on the Site and show our relevant content from your Facebook or SNS friends.  Once you register on the Site and connect with Facebook or another SNS, you will be able to automatically post recent activity back to Facebook or the other SNS. Any information that we collect from your Facebook or other SNS account may depend on the privacy settings you have with that SNS, so please consult the SNS’ privacy and data practices. You have the option to disable Facebook Connect at any time by logging into your Account through the Site and going to settings, “About Me,” “Linked Accounts,” and then unselecting “Facebook.” Further, you can edit privacy settings for the reviews that appear on Facebook or disconnect your Services activity stream by visiting the Facebook Applications Settings page. Location Information . If you have enabled location services on your phone, we collect your location information to make a map available to the recipients of your messages showing your location.  If you do not want this information collected by us, you can disable location services on your phone. Email Subscribe Forms . To help keep you informed about our latest news, area information, specials and promotions, we may offer the opportunity to subscribe to our email list via various subscription forms throughout the Services. By subscribing you are requesting follow-up information from us and you agree that we will use your provided contact information for marketing purposes. You may unsubscribe to these emails at any time by following the unsubscribe link in the footer of all such communications. Other : We may also collect Personal Information at other points through our Services that state that Personal Information is being collected. Anonymous Information We collect the following types of Anonymous Information : Information Collected by Our Servers . To make our Website a more useful to you, our servers (which may be hosted by a third party service provider) collect information from you, including your browser type, operating system, Internet Protocol ( “IP” ) address (a number that is automatically assigned to your computer when you use the Internet, which may vary from session to session), domain name, and/or a date/time stamp for your visit. Log Files. As is true of most websites, we gather certain information automatically and store it in log files. This information includes IP addresses, browser type, Internet service provider (“ ISP ”), referring/exit pages, operating system, date/time stamp, and clickstream data. We use this information to analyze trends, administer the Website, track users’ movements around the Website, gather demographic information about our user base as a whole, and better tailor our Website to our users’ needs. For example, some of the information may be collected so that when you visit the Website again, it will recognize you and the information could then be used to serve advertisements and other information appropriate to your interests. Cookies . Like many online services, we use cookies to collect information. “ Cookies ” are small pieces of information that a website sends to your computer’s hard drive while you are viewing the website. We may use both session Cookies (which expire once you close your web browser) and persistent Cookies (which stay on your computer until you delete them) to provide you with a more personal and interactive experience on our Website. This type of information is collected to make the Website more useful to you and to tailor the experience with us to meet your special interests and needs. Pixel Tags . In addition, we use “ Pixel Tags ” (also referred to as clear Gifs, Web beacons, or Web bugs). Pixel Tags are tiny graphic images with a unique identifier, similar in function to Cookies, which are used to track online movements of Web users. In contrast to Cookies, which are stored on a user’s computer hard drive, Pixel Tags are embedded invisibly in Web pages. Pixel Tags also allow us to send e-mail messages in a format users can read, and they tell us whether e-mails have been opened to ensure that we are sending only messages that are of interest to our users. We may use this information to reduce or eliminate messages sent to a user. We do not tie the information gathered by Pixel Tags to our users’ Personal Information. Collection of Data by Advertisers .  We may also use third parties to serve ads on the Services.  Certain third parties may automatically collect information about your visits to this and other websites, your IP address, your ISP, the browser you use to visit our Site (but not your name, address, e-mail address or telephone number).  They do this by using Cookies, Pixel Tags, or other technologies. Information collected may be used, among other things, to deliver advertising targeted to your interests and to better understand the usage and visitation of our Site and the other sites tracked by these third parties.  This policy does not apply to, and we are not responsible for, Cookies or Pixel Tags in third party ads, and we encourage you to check the privacy policies of advertisers and/or ad services to learn about their use of Cookies and other technologies. You may opt out of receiving interest-based advertising from some of our partners by visiting sweetwaterinn.com .  If you would like more information about this practice and to know your choices about not having this information used by these companies, click here: http://www.aboutads.info/choices or http://www.networkadvertising.org . Disclosure – Analytics We may use third party analytics services (including, but not limited to, Google Analytics) to help analyze how users use the Services. Analytics services use Cookies to collect information such as how often users open the page(s) of the Website and what features they use in the Services. We use this information to improve the Services. The analytics services’ ability to use and share information collected by them is restricted by their terms of use and privacy policy, which you should refer to for more information about how these entities use this information, and how you can opt-out of their use of such information. Information Collected from You About Others If you decide to invite a third party to create an Account, we will collect your and the third party’s names and e-mail addresses in order to send an e-mail and follow up with the third party.  We rely upon you to obtain whatever consents from the third party that may be required by law to allow us to access and upload the third party’s names and e-mail addresses as required above. You or the third party may contact us at Local: 352.373.6760 Toll-Free: 1.800.595.7760 Fax: 352.371.3771 Email: [email protected] to request the removal of this information from our database. As part of your use of the Services, we provide you the opportunity to connect automatically with your friends. We employ various techniques in order to facilitate friends finding each other on our service, including offering contact importer tools to facilitate adding to your contacts (including Facebook Friends and contacts in your address book) so that you can more readily ask your contacts to join the Services.  With your permission, we will access your address book, call log and SMS log, and import your contacts’ names, e-mail addresses, phone numbers, image, geographic location and Facebook IDs to facilitate automatic connection with your friends. We do this only for contact matching to help your friends and you find each other. Also, when you invite friends to the Services, we will access your Address Book and we will import your contacts names and phone numbers in order to facilitate the invitation. The e-mail that is sent to your friends will come from your e-mail address so that your friends know that you want to invite them to visit the Site.  We do not store any passwords you provide as part of the contact import process. We also collect some settings that help us to interpret your data, such as the language and keyboard settings that you have established, and the phone’s carrier, mobile network code and mobile country code. How We Use Information Personal Information We will use your Personal Information to: Identify you as a user in our system; To provide you with the online booking system made available via our property management system; Facilitate the creation of and administration of your Account; Allow you to communicate with other users of the Services; Provide you with the Services and complete your transactions; Provide you with customer support; Help understand your needs and tailor the features and content of the Services to you; Respond to and, as applicable, fulfill your requests, resolve disputes and/or troubleshoot problems; Verify your compliance with your obligations in our Terms of Service; Send you administrative e-mail notifications, such as security, or support and maintenance advisories; Send newsletters, surveys, offers, and other promotional materials related to our Services and for other marketing purposes; Improve the quality and functionality of the Services; Share with our third party software and services providers in order to facilitate our communications; and Communicate with you about the Services. We may also use your Personal Information to create Anonymous Information records by excluding information that makes the information personally identifiable to you. Anonymous Information We use the Anonymous Information we collect to analyze trends, administer and improve the Services, gather demographic information about our user base as a whole, and better tailor the Services to our users’ needs. However, we reserve the right to use Anonymous Information for any purpose, and to disclose Anonymous Information publicly without restriction. We provide analytics based upon our customer’s use of the Services to prospective partners, other customers, advertisers and other third parties. We may also disclose, on an anonymous basis, actual statements, verbatim, as made by our customers. How We Disclose Information Personal Information We may also disclose certain Personal Information : Third Parties Designated by You . When you use the Services, the Personal Information you provide will be shared with the third parties that you authorize to receive such information (e.g., other individuals that you wish to connect with via the Services). Third Party Partners & Property Management Software . We will share the information you provide with us through your use of the Services to make an online booking with the third party that provides our property management software. This information, including your contact information, stay dates and any other information that you share with us via the property management system, may be used for future marketing purposes and as necessary to facilitate current and future bookings through our property management software. Third Party Service Providers . We may share your Personal Information with our third party service providers who provide services such as data analytics, website hosting, payment processing (e.g., Stripe), information technology, customer service, email delivery, auditing, and other services. Social Networking Sites . Some of our Services may enable you to post content to SNS (e.g., Facebook or Twitter).  If you choose to do this, we will provide information to such SNS’ in accordance with your elections.  You acknowledge and agree that you are solely responsible for your use of those websites and that it is your responsibility to review the terms of use and privacy policy of the third party provider of such SNS’.  We will not be responsible or liable for: (i) the availability or accuracy of such SNS’; (ii) the content, products or services on or availability of such SNS’; or (iii) your use of any such SNS’ Public Profile . Certain portions of the information you provide to us may also be displayed in your Profile.  As an essential element of the Services, most of the Personal Information you explicitly provide to us when you register or update your Profile is displayed on your Profile.  In order for your Profile to be made public, you must go to your profile settings and then to profile visibility. By default, your Profile is not for public viewing. Your photos, posts, friends, and other content you post through the Services are also meant for public consumption.  We may display this content through the Services and further distribute it to a wider audience through third party sites and services. Once displayed on publicly viewable web pages, that information can be collected and used by others. We cannot control who reads your postings or what other users may do with the information that you voluntarily post, so it is very important that you do not put Personal Information in your posts.  Once you have posted information publicly, while you will still be able to edit and delete it on the Site, you will not be able to edit or delete such information cached, collected, and stored elsewhere by others (e.g., search engines). Affiliates . We may share some or all of your Personal Information with our parent company, subsidiaries, joint ventures, or other companies under a common control (“ Affiliates ”), if we have such Affiliates in the future, in which case we will require our Affiliates to honor this Privacy Policy. Corporate Restructuring . We may share some or all of your Personal Information in connection with or during negotiation of any merger, financing, acquisition or dissolution, transaction or proceeding involving sale, transfer, divestiture, or disclosure of all or a portion of our business or assets. In the event of an insolvency, bankruptcy, or receivership, Personal Information may also be transferred as a business asset. If another company acquires our company, business, or assets, that company will possess the Personal Information collected by us and will assume the rights and obligations regarding your Personal Information as described in this Privacy Policy. Other Disclosures . Regardless of any choices you make regarding your Personal Information (as described below), we may disclose Personal Information if it believes in good faith that such disclosure is necessary to (a) resolve disputes, investigate problems, or enforce our Terms and Conditions; (b) comply with relevant laws or to respond to requests from law enforcement or other government officials relating to investigations or alleged illegal activity, in which case we can (and you authorize us to) disclose Personal Information without subpoenas or warrants served on us; or (c) protect and defend our rights or property or the rights and property of you or third parties; and/or (d) investigate or assist in preventing any violation or potential violation of the law, this Privacy Policy, or our Terms and Conditions. Your Choices Regarding Your Information Email Communications . We will communicate with you primarily in the form of emails. You can manage the frequency and/or opt out of receiving these communications by changing your settings in your Account and/or clicking the “Unsubscribe” link at the bottom of each email. Please note that even if you unsubscribe or opt-out, we may still send you Website-related communications (e.g., emails related to your Account). Cookies . If you decide at any time that you no longer wish to accept cookies from our Services for any of the purposes described above, then you can instruct your browser, by changing its settings, to stop accepting cookies or to prompt you before accepting a cookie from the websites you visit. Consult your browser’s technical information. If you do not accept cookies, however, you may not be able to use all portions of the Services or all functionality of the Services. De-Linking SNS . If you decide at any time that you no longer wish to have your SNS account (e.g., Facebook) linked to your Account, then you may de-link the SNS account in the “preferences” section in your account settings.  You may also manage the sharing of certain Personal Data with us when you connect with us through an SNS, such as through Facebook Connect. Please refer to the privacy settings of the SNS to determine how you may adjust our permissions and manage the interactivity between the Services and your social media account or mobile device. Changing or Deleting Your Personal Information . You may review, change, update, correct or delete the Personal Information in your Account by logging into your Account or by contacting us at: Local: 352.373.6760 Toll-Free: 1.800.595.7760 Fax: 352.371.3771 Email: [email protected] You authorize us to use and disclose any new or modified information that you provide in accordance with this Privacy Policy, and you agree that we are under no obligation to delete or modify information that you have previously chosen to provide us. If you completely delete all of your Personal Information, then your account may become deactivated, although your profile and any content associated therewith will remain on the Services unless you have deleted them. We may also retain an archived copy of your records as required by law or for legitimate business purposes. Please remember, however, if we have already disclosed some of your Personal Information to third parties, we cannot access that Personal Information any longer and cannot force the deletion or modification of any such information by the parties to whom we have made those disclosures. Certain information is necessary in order for us to make the Services available; therefore, if you delete such necessary information you may not be able to use the Services. Please note that even though you may request the deletion of your Personal Information by us, we may be required (by law or otherwise, such as to prevent fraud, resolve disputes, troubleshoot problems, or enforce our Terms of Service) to keep this information and not delete it (or to keep this information for a certain time) in which case we will comply with your deletion request only after we have fulfilled such requirements. When we delete Personal Information, it will be deleted from the active database, but may remain in our archives. Applications. You can stop all collection of information by the Web Application by no longer using or accessing the Web Application.  You may use the standard uninstall processes as may be available as part of your mobile device or via the mobile application marketplace or network. You may at any time opt-out from further allowing us to have access to your location data. Feedback If you provide feedback to us, we may use and disclose such feedback in accordance with the terms in our Terms of Service, provided we do not associate such feedback with your Personal Information. We may publish user feedback from time to time, provided that we will obtain your consent prior to posting any feedback that is associated with your Personal Information. We will collect any information contained in such feedback and will treat the Personal Information in it in accordance with this Privacy Policy, provided that we may contact you in regards to such feedback. Information Disclosed to Third Parties This Privacy Policy addresses only our use and disclosure of information we collect from and/or about you on the Website. If you disclose information to others, including any users that you meet through the Services and decide to continue interacting with separate from or outside of your use of the Services, or authorize us to do the same under this Privacy Policy, the use and disclosure restrictions contained in this Privacy Policy will not apply to any third party. We do not control the privacy policies of third parties, and you are subject to the privacy policies of those third parties where applicable. The Services may contain content or links to other websites that are not owned or controlled by us. We have no control over, do not review and are not responsible for the privacy policies of or content displayed on such other websites. When you click on such a link, you will leave our Website and go to another site. During this process, another entity may collect Personal Information or Anonymous Information from you. Please review the privacy policy of any new site you visit. Web Application & Services, Specifically. We may also collect non-personal information from your mobile device if you access our Services from your mobile device.  This information is generally used to help us deliver the most relevant information to you. Examples of information that may be collected and used include your geographic location, how you use the Services and information about the type of device you use.   In addition, in the event the Services crash on your mobile device, we will receive information about your mobile device model software version and device carrier, which allows us to identify and fix bugs and otherwise improve the performance of our Services.  This information is sent to us as aggregated information and is not traceable to any individual and cannot be used to identify an individual. How We Respond to Do Not Track Signals We do not currently respond to “do not track” signals or other mechanisms that might enable consumers to opt out of tracking on the Website. INTERNATIONAL DATA TRANSFERS Data Protection Officer. To communicate with our Data Protection Officer, please email [email protected] . Identifying the Data Controller and Processor. Data protection law in certain jurisdictions differentiates between the “controller” and “processor” of information. In general, you are the controller of all data and information submitted through the Services, including all Personal Information. In general, Company is the processor of all such data and information, including Personal Information, and the controller of all other information made available through the Services. Company may provide the Services in different parts of the world but is established in the United States of America and operates out of the United States of America. Your Rights. Users located in certain countries, including the European Economic Area, have certain statutory rights in relation to their personal data. Subject to any exemption provided by law, you may have the right to request access to information, as well as to seek to update, delete or correct any such information.  If you are unable to locate or use the applicable settings, please contact us for additional assistance at: Local: 352.373.6760 Toll Free: 1.800.595.7760 Fax: 352.371.3771 Email: [email protected] Company may also process any other information that constitutes your Personal Information for direct marketing purposes and you have a right to object to Company’s use of such Personal Information for this purpose at any time. Information Choices and Changes; Data Protection Authority. You can prevent the further collection or use of your personal information by terminating your use of the Services. Opting Out of Marketing Emails . Our marketing emails explain how to “opt-out.” If you opt out, we may still send you non-marketing emails.  Non-marketing emails include emails about your accounts and our business dealings with you. You may send requests about your personal information to our Contact Information below such as to change contact choices, opt-out of our sharing of your personal information with others, and review, update, correct or delete your personal information.  We will use commercially reasonable efforts to honor your request, provided, however, that videos can only be removed per the procedures outlined above. We may retain an archived copy of your records as required by law or for legitimate business purposes. You can typically remove and reject cookies from our Site with your browser settings. Many browsers are set to accept cookies until you change your settings.  If you remove or reject our cookies, it could affect how our Site works for you. Changes to this Privacy Policy This Privacy Policy may be updated from time to time for any reason. We will notify you of any changes to our Privacy Policy by posting the new Privacy Policy here sweetwaterinn.com/privacy-policy/ and we will change the “Last Updated” date above. We will also send an email with a link to the updated Privacy Policy to the email address that we have on file for you. You should consult this Privacy Policy regularly for any changes. Contacting Company We are here to help answer any questions you have about the Services and how we use your Personal Information. If you have any questions or concerns or complaints about our Privacy Policy or our data collection or processing practices, or if you want to report any security violations to us, please contact us at: Cornelia Holbrook Local: 352.373.6760 Toll Free: 1.800.595.7760 Fax: 352.371.3771 Email: [email protected] Book Your Stay  (352) 373-6760  Gift Certificates 625 E. University Avenue Gainesville, Florida 32601 (352) 373-6760 [email protected] 2 Tesla Superchargers Available Useful Links Accommodations The Grounds Map Specials & Packages Events Catering Things to Do Blog Our Story Policies Employment Contact Us Join Our Newsletter Subscribe to our newsletter to learn more about upcoming events and specials in the area. Subscribe Today Earn Rewards Join Stash Hotel Rewards for free and earn free nights and a welcome bonus! Join Now Get Social With Us Follow Follow Follow Follow Follow Local Weather 2025 © Sweetwater Inn | A Vibrant Management Property 2025 © Sweetwater Inn A Vibrant Management Property Privacy Policy | Website Accessibility Policy"
    },
    {
      "url": "https://sweetwaterinn.com/employment/",
      "text": "Employment - Sweetwater Inn Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 352.373.6760 | Gift Certificates 2 Tesla Superchargers Available Convenient Free Parking Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 2 Tesla Superchargers Available 352.373.6760 | Gift Certificates Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us Sweetwater Branch Inn Employment Opportunities Contact Us Home E Employment Apply for a job Join our team From exquisite grounds to lovely coworkers, working at Sweetwater Branch Inn Lodging & Events is incredibly rewarding. Sweetwater is a local, woman-owned business , committed to equitable hiring and treatment of employees. The small, tight-knit staff handle the ups and downs of customer service by leaning on each other. We are seeking team-players who have an eye for detail, appreciate preservation and sustainability, and want to be a part of the Sweetwater mission to preserve history and create a memorable guest experience. If the position you are looking for is not currently available, you can still contact us with your resume, and we’ll be happy to keep you in mind. Available Positions Banquet Staff/Server Part-time Experience not required Assist Director and Banquet Manager on event days with pre-event setup, execution of event, and post-event breakdown. Events primarily take place onsite at Sweetwater Branch Inn, with some offsite events. Responsibilities include but are not limited to: Setup of dining table place settings Buffet/Food Station setup and service Dinner service and cleanup Assist with packing catering supplies for offsite events Light cleaning (countertops, sweeping, etc.) after events Work with a supportive team to create dream events. Looking for team players, willing to listen and follow instructions, who can stay focused and kind in high-stress situations. Requires standing, bending, walking, and carrying up to 30 lbs. Events primarily take place on evenings and weekends, but can be midweek, and require early set up. Email [email protected] with resume or relevant experience and availability. If selected, you will be contacted for a working interview. Banquet Bartender Part-time Bartending experience required Private Events Bartending including mimosa bars, beer & wine bars, and full liquor bars. Events primarily take place onsite at Sweetwater Branch Inn, with some offsite events. Responsibilities include but are not limited to: Setup of banquet bar Bartending throughout event Inventory management of non-alcoholic beverages Cleanup/Breakdown of banquet bar Organization of non-alcoholic beverages after events Assist with packing bartending supplies for offsite events Light cleaning (bar trash removal, etc.) after events Work with a supportive team to create dream events. Looking for team players, willing to listen and follow instructions, who can stay focused and kind in high-stress situations. Requires standing, bending, walking, and carrying up to 30 lbs. Events primarily take place on evenings and weekends, but can be midweek, and require early set up. Part-time. Email [email protected] with resume or relevant experience and availability. If selected, you will be contacted for a working interview. Banquet Dishwasher Part-time Experience preferred but not required Dishwashing for private events. Events primarily take place onsite at Sweetwater Branch Inn, with some offsite events. Work with a supportive team. Ideal as a second job, for someone who takes satisfaction from cleaning and organizing. Responsibilities include but are not limited to: Clean, dry, and put away dishes for events Maintain dishwashing machine Organize dish storage and clean Sweep, mop, wipe down surfaces, clean dishwasher and take out trash at end of night Work with a supportive team to create dream events. Looking for team players, willing to listen and follow instructions. Requires standing long hours, walking, bending, going up stairs, and lifting up to 30 lbs. Will also need reliable transportation for late night shifts. Events primarily take place on evenings and weekends, but can be midweek, so some weekend and evening availability will be necessary. Part-time. Email [email protected] with resume or relevant experience and availability. If selected, you will be contacted for a working interview. Housekeeping Part-time and full-time Experience preferred but not required Looking for team players with an eye for detail, who want to be an essential part of creating a magical guest experience. Full or part time work available, with shifts 10am-4pm, 7 days a week. Checkout is 11am and check-in is 3pm, so you must be available during this time. More shifts will be available on weekends. Requires walking, bending, and going up and down stairs. Responsibilities include but are not limited to: Sweeping, moping, scrubbing, and dusting Changing sheets and towels Washing and folding laundry Email [email protected] with resume and availability. If selected, you will be contacted to schedule an interview and/or a working interview. Book Your Stay  (352) 373-6760  Gift Certificates 625 E. University Avenue Gainesville, Florida 32601 (352) 373-6760 [email protected] 2 Tesla Superchargers Available Useful Links Accommodations The Grounds Map Specials & Packages Events Catering Things to Do Blog Our Story Policies Employment Contact Us Join Our Newsletter Subscribe to our newsletter to learn more about upcoming events and specials in the area. Subscribe Today Earn Rewards Join Stash Hotel Rewards for free and earn free nights and a welcome bonus! Join Now Get Social With Us Follow Follow Follow Follow Follow Local Weather 2025 © Sweetwater Inn | A Vibrant Management Property 2025 © Sweetwater Inn A Vibrant Management Property Privacy Policy | Website Accessibility Policy"
    },
    {
      "url": "https://sweetwaterinn.com/frequently-asked-questions-events/",
      "text": "Frequently Asked Questions Events - Sweetwater Inn Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 352.373.6760 | Gift Certificates 2 Tesla Superchargers Available Convenient Free Parking Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 2 Tesla Superchargers Available 352.373.6760 | Gift Certificates Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us Gainesville Wedding Frequently Asked Questions Inquire about your wedding Home E Frequently Asked Questions Events We know you want your day to be perfect, and that means asking some questions! We have answers to our most commonly asked questions below. I picked my date! How do I book? What is the deposit? Please fill out the inquiry form or contact us to see if your date is available. We can set up a meeting in person or over video chat to discuss your details. The deposit amount varies depending on the day of week and other details. How far in advance should I book my venue? If you want a popular time of the year or a Saturday wedding, we recommend booking at least 12 months in advance. For off season and flexible dates, at least 9 months is recommended. If you have missed the recommended time, we’re still happy to accommodate you as long as we have availability. I'm on a budget. Can I still have a wedding at Sweetwater? Absolutely! We are able to accommodate most budgets. We have many options available, including buffet stations, discounted Friday and Sunday weddings, and a smaller venue for weddings of up to 65 guests. What happens in the case of inclement weather? Our beautiful McKenzie Hall becomes the ceremony location with the McKenzie Gardens as the backdrop. Your guests then enjoy drinks and hors d’oeuvres on our covered patio while the room is reset. For McKenzie House weddings, your ceremony will be hosted in the gazebo area of the wraparound porch. Where do event guests park? Event guests park for free at the Alachua County Public Schools District Office across University Avenue. There are also two accessible spaces in the private lot across from the gardens. Can my guests book rooms at Sweetwater Branch Inn? Absolutely! One of the many benefits of a Sweetwater wedding and reception is the guest rooms, suites, and cottages available on-site. Accommodations are first come first serve, except for the Honeymoon Cottage, which we hold to give couples priority. For more information on booking rooms please contact [email protected] . What does Sweetwater provide? Sweetwater provides all venue and catering services, including serving staff, and a limited selection of linens, tables, and chairs. Select decorative items are available for rental including vintage furniture and garden games. You will need to provide your own wedding coordinator, officiant, florist, designer, photographer, videographer, wedding cake, alcohol, and DJ or band. Can I bring my own decorations? Yes, each wedding reception we host is unique to your preferences. We recommend working with a decorator to create your vision. McKenzie Hall is surrounded by lush gardens with string lights, and boasts a high ceiling with trusses for a neutral yet intricate backdrop. Can we bring our own alcohol? Yes! We require all alcoholic beverages to be brought in. Sweetwater can provide bar service, ice, basic mixers, and non-alcoholic beverages. Can we bring our own catering? Sweetwater is famous for great food! We provide all catering services, and require these services for events. We can also accommodate most dietary needs, including kosher and halal. You can be confident your food will be delicious and these details will be taken care of for you on your big day! Does Sweetwater provide tables, chairs, and linens? Sweetwater provides all of your tables, basic linens and white garden chairs for the ceremony and reception. Sweetwater owns many different table sizes including: 48” round, 60” round, 4’ banquet, 6’ banquet, 8’ banquet, bar height and serpentine shapes. Your event director will help you create the perfect floor plan. If you choose, you may rent additional linens, chairs, and other accessories to match your theme from another vendor. However, the tables, chairs, and linens for a successful and beautiful event are included. Will there be a Sweetwater coordinator on-site the day of my wedding? Your event director will be on-site the day of the wedding to facilitate your reception details and ensure our venue and catering services are exactly the way you imagined. Sweetwater does not coordinate ceremonies and suggests hiring a wedding coordinator for this. Your event director is focused on your reception food and bar details during the ceremony. Still looking for answers? Give us a call at 352.373.6760 Wedding Inquiry Stunning Venue Photos “a memory that will last a lifetime” View Wedding Galleries Follow us on Instagram Follow @sweetwater.branch.inn Book Your Stay  (352) 373-6760  Gift Certificates 625 E. University Avenue Gainesville, Florida 32601 (352) 373-6760 [email protected] 2 Tesla Superchargers Available Useful Links Accommodations The Grounds Map Specials & Packages Events Catering Things to Do Blog Our Story Policies Employment Contact Us Join Our Newsletter Subscribe to our newsletter to learn more about upcoming events and specials in the area. Subscribe Today Earn Rewards Join Stash Hotel Rewards for free and earn free nights and a welcome bonus! Join Now Get Social With Us Follow Follow Follow Follow Follow Local Weather 2025 © Sweetwater Inn | A Vibrant Management Property 2025 © Sweetwater Inn A Vibrant Management Property Privacy Policy | Website Accessibility Policy"
    },
    {
      "url": "https://sweetwaterinn.com/contact-us/",
      "text": "Contact Us - Sweetwater Inn Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 352.373.6760 | Gift Certificates 2 Tesla Superchargers Available Convenient Free Parking Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us 2 Tesla Superchargers Available 352.373.6760 | Gift Certificates Check Availability Accommodations All Accommodations McKenzie House Cushman-Colson House Cottages Pet Friendly Lodging Accessible Lodging Amenities Specials & Packages Weddings Wedding Venues Sweetwater Wedding Brochure Weekend Wedding Packages Frequently Asked Questions Photo Galleries Retreats & Events Business & Corporate Events Wellness Retreats Special Events Events Hosted by Sweetwater Sweetwater Catering Things to Do Gainesville Activities Dining Read Our Blog Join Stash Rewards About Us Our Story The Grounds Sustainability Guest Policies Frequently Asked Questions Contact Us Sweetwater Branch Inn Contact Us Book Your Stay Home E Contact Us  Phone Local: 352.373.6760 Toll-Free: 1.833.595.7760 Fax: 352.371.3771  Email Office Manager: [email protected] Reservations: [email protected] Catering & Events: [email protected]  Address Sweetwater Branch Inn 625 E. University Avenue Gainesville, Florida 32601 Get in touch We would love to hear from you! At Sweetwater Branch Inn our staff is friendly, professional, and highly trained. Our goal is to ensure that every guest is afforded exemplary courtesy and service so that their Sweetwater visit is a unique, relaxing, and memorable experience. At Sweetwater Branch Inn we aim to create, through exemplary service, beauty, and gracious attitude, an overall memorable and extraordinary experience for each of our guests that correspond with the overall effort of love and compassion that has gone into the making of the Sweetwater Branch Inn property. Do you want to book a room or reserve space for a banquet? We would love to hear from you! You can contact us in one of the following ways below. If you would like to receive event pricing before coming for a tour appointment, please contact us with your event information so we may send you a custom wedding price package. Call 352-373-6760 or email Events to request a free tour or catering consult. Book Your Stay  (352) 373-6760  Gift Certificates 625 E. University Avenue Gainesville, Florida 32601 (352) 373-6760 [email protected] 2 Tesla Superchargers Available Useful Links Accommodations The Grounds Map Specials & Packages Events Catering Things to Do Blog Our Story Policies Employment Contact Us Join Our Newsletter Subscribe to our newsletter to learn more about upcoming events and specials in the area. Subscribe Today Earn Rewards Join Stash Hotel Rewards for free and earn free nights and a welcome bonus! Join Now Get Social With Us Follow Follow Follow Follow Follow Local Weather 2025 © Sweetwater Inn | A Vibrant Management Property 2025 © Sweetwater Inn A Vibrant Management Property Privacy Policy | Website Accessibility Policy"
    }
  ]
}