{
  "fuentes": [
    {
      "url": "https://crumlincreek.com/contact/",
      "email": "info@crumlincreek.com"
    },
    {
      "url": "https://www.golfcedarcreek.com/contactus/",
      "email": "golfpro@twp.berkeley.nj.us"
    },
    {
      "url": "https://crosscreekcc.com/about-us/",
      "email": "info@crosscreekcc.com"
    },
    {
      "url": "https://crosscreekcdd.org/about-us/",
      "email": "recordrequest@pfm.com"
    },
    {
      "url": "https://crosscreekcdd.org/about-us/",
      "email": "ripollv@pfm.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.wolfcreekgc.com/contact/",
      "email": "info@wolfcreekgc.com"
    },
    {
      "url": "http://crosscreekatlanta.org/amenities/golf/",
      "email": "smartin@hoadv.com"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "email": "brian.legg@galleagolfproperties.com"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "email": "chris.gallea@galleagolfproperties.com"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "email": "leslie.gallea@galleagolfproperties.com"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "email": "vincent.cringoli@galleagolfproperties.com"
    },
    {
      "url": "https://www.crosscreekgolfclub.com/contact/contact-us",
      "email": "gm@crosscreekgolfclub.com"
    },
    {
      "url": "https://reviews.birdeye.com/cross-creek-golf-club-156065076667372",
      "email": "profiles@birdeye.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/cross-creek-golf-club-dr-rg/",
      "email": "comments@crosscreekgolfandrange.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/cross-creek-golf-club-dr-rg/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/cross-creek-golf-club-dr-rg/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://www.tacm.tv/staff.asp",
      "email": "cmc@liaa.org"
    },
    {
      "url": "https://www.tacm.tv/staff.asp",
      "email": "jtorrence@liaa.org"
    },
    {
      "url": "https://www.tacm.tv/staff.asp",
      "email": "mkern@liaa.org"
    },
    {
      "url": "https://www.tacm.tv/staff.asp",
      "email": "muratzki@liaa.org"
    },
    {
      "url": "https://www.tacm.tv/staff.asp",
      "email": "rastor@liaa.org"
    },
    {
      "url": "https://crosscreekcc.com/contact-us/",
      "email": "info@crosscreekcc.com"
    },
    {
      "url": "https://crosscreekcc.com/contact-us/",
      "email": "josh@crosscreekcc.com"
    },
    {
      "url": "https://crosscreekcc.com/contact-us/",
      "email": "kent@crosscreekcc.com"
    },
    {
      "url": "https://crosscreekcc.com/contact-us/",
      "email": "magen@crosscreekcc.com"
    },
    {
      "url": "https://crosscreekcc.com/contact-us/",
      "email": "shannon@crosscreekcc.com"
    },
    {
      "url": "https://crosscreekcc.com/contact-us/",
      "email": "tj@crosscreekcc.com"
    }
  ],
  "mails": [
    "brian.legg@galleagolfproperties.com",
    "chris.gallea@galleagolfproperties.com",
    "cmc@liaa.org",
    "comments@crosscreekgolfandrange.com",
    "gm@crosscreekgolfclub.com",
    "golf-club-detail@2x.png",
    "golfpro@twp.berkeley.nj.us",
    "info@belfairsgolfclub.co.uk",
    "info@crosscreekcc.com",
    "info@crumlincreek.com",
    "info@wolfcreekgc.com",
    "josh@crosscreekcc.com",
    "jtorrence@liaa.org",
    "kent@crosscreekcc.com",
    "leslie.gallea@galleagolfproperties.com",
    "magen@crosscreekcc.com",
    "mkern@liaa.org",
    "muratzki@liaa.org",
    "profiles@birdeye.com",
    "rastor@liaa.org",
    "recordrequest@pfm.com",
    "ripollv@pfm.com",
    "shannon@crosscreekcc.com",
    "smartin@hoadv.com",
    "tj@crosscreekcc.com",
    "travel@albrecht.de",
    "vincent.cringoli@galleagolfproperties.com"
  ],
  "nombre_sitio": "tacm.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://crumlincreek.com/contact/",
      "text": "Contact - Crumlin Creek Golf Club Home Golf Golf Rates Scorecard Women’s League Group Events Dining Social Events Lessons Kids Camps Golf Lessons Online Store Simulator About Contact Home Golf Golf Rates Scorecard Women’s League Group Events Dining Social Events Lessons Kids Camps Golf Lessons Online Store Simulator About Contact Book A Tee Time Contact Us 1720 Crumlin Sideroad, London ON N5V 1S2 (519) 659-7070 info@crumlincreek.com Location Reach Out to Us We love to listen and we are eagerly waiting to talk to you. Get in touch with us if you have any queries and we will get back to you as soon as possible. Name Email Subject Message Send Join our Newsletter Sign up and receive exclusive golf offers at our club and stay up-to-date with everything happening at our club. First Name (Required) Email (Required) Comments This field is for validation purposes and should be left unchanged. Quick Links Home About Golf Rates Women’s League Golf Lessons Kids Camps Contact Home About Golf Rates Women’s League Golf Lessons Kids Camps Contact Contact Us 1720 Crumlin Side Road London, Ontario N5V 1S2 Book A Tee Time Email: info@crumlincreek.com Phone: (519) 659-7070 Facebook Instagram © Copyright Crumlin Creek Golf Club | Ontario Canada"
    },
    {
      "url": "https://www.golfcedarcreek.com/contactus/",
      "text": "Contact Us - Cedar Creek Golf Course Skip to primary navigation Skip to main content Phone TEE TIMES BIRDIES BAR & GRILL Cedar Creek Golf Course Home Tee Times Rates About About Us Scorecard Annual Passes Driving Range Course Photos Golf Clinics Events Outings Upcoming Events Contact Contact Us Location Veterans Park Bill Zimmermann, Jr. Way Contacts Harry Leonard General Manager Phone: (732) 269-4460 Email: HLeonard140@gmail.com Page Footer Contact Info Address : Cedar Creek Golf Course 489 Forest Hills Parkway Bayville NJ, 08721 Email : golfpro@twp.berkeley.nj.us Phone : (732) 269-4460 Cedar Creek Golf Course | Cedar Creek Golf Course 489 Forest Hills Parkway Bayville NJ, 08721  | (732) 269-4460 Copyright © 2025 Cedar Creek Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://crosscreekcc.com/about-us/",
      "text": "About Us | Cross Creek Country Club Tee Times: 336-789-5131 | Office: 336-789-5193 info@crosscreekcc.com Facebook Instagram TikTok YouTube Facebook Instagram TikTok YouTube Golf Course Course Info Dress Code Rates Club Calendar Golf Instruction Golf 101 Ladies’ Golf Association (LGA) Men’s Golf Association (MGA) Surry County Jr. Championship Membership Membership Request Membership Types Member Login Amenities Dining Tennis Swimming Summer Camp Social Activities Events Special Events Weddings & Receptions Golf Outings Grand Ballroom Banquet Information Event Request Club News Contact Us About Us Directions Privacy Policy Covid-19 Awareness Select Page Our History Cross Creek Country Club is celebrating more than fifty years of providing fine dining and recreation to its members. Situated at the foot of the majestic Blue Ridge Mountains, the club has been in operation since 1973. “The landscape here is truly breath taking, and it provides our members with a quiet atmosphere for enjoying their time spent with friends and family,” said Shannon Waters, General Manager of Cross Creek. “We offer a semi-private 18-hole golf course which accommodates members and their guests as well as daily fee golfers. Cross Creek is also known for fine cuisine, social activities, charity events, and a variety of athletic facilities, including swimming and tennis.” The Cross Creek property was originally a working farm owned by H.O. Woltz, Sr. The farm produced tobacco and corn and raised beef cattle. At one time it also included a commercial flower growing operation which supplied gladiola, jonquil, and tulips to wholesalers throughout the east coast. Later, after acquiring additional acreage adjacent to the farm, Mr. Woltz envisioned that the site would provide a beautiful setting for a first-class country club and golf course. Woltz believed such a club would have a positive economic impact on Mt. Airy, while enhancing quality of life for residents. Woltz, along with fellow investors Richard Vaughn, Zack Blackmon, Sr., Lindsay Holcomb, Jr., Smith Holcomb, Kilbourn Henry, Ed Crossingham, and Don Porter contracted with Joseph Lee, a well known and highly respected golf course architect to help them design and develop the new country club. The consulting firm of Martini and Associates was also brought in to assist with design of the club and surrounding residential developments. Cross Creek Country Club officially opened in 1973 featuring a 6,800-yard golf course designed by Joe Lee. The clubhouse was completely renovated in 2001 to include a well-appointed interior and Grand Ballroom which has become the centerpiece of the region’s social scene. Improvements were made to the golf course in 2005 under the guidance of Greensboro-based architect Kris Spence, and a three-season pavilion was added in 2007 which has since become a popular venue for dining, dancing, parties, and musical entertainment. The improvements were noted by North Carolina Business magazine who named Cross Creek one of the top 100 golf courses in the State. In October of 2020, Skip and Cathy Eckenrod, former owners of Interlam Inc., a manufacturer of architectural wall panels and design elements, purchased Cross Creek Country Club. Skip and Cathy are making ongoing significant investments for capital improvements, renovations and upgrades, including a new roof for the clubhouse and pool. The club’s in-house restaurant has also been renovated and renamed ‘The Sunset Grille’.” The Club’s GM brought in PGA Head Golf Professional, Kent Shumate, as well as Chef Josh Greenberg. Kent Shumate joined the club from Olde Beau Resort & Golf Club. Previously, he served twenty-four years at Mount Airy Country Club as the PGA Head Golf Professional. Chef Greenberg most recently worked in South Florida where he also received formal training at Le Cordon Bleu in Miami and specialized in fresh seafood dishes. And while there have been many changes and improvements, the Eckenrods and their team have continued the traditions of fine dining and recreational excellence that Cross Creek Country Club has been known for. Skip and Cathy have also kept alive the dream of H.O. Woltz who envisioned a first-class Country Club that enhances the community, supports economic growth, and brings enjoyment to the residents of Mount Airy, Surry County, and surrounding areas. Today Cross Creek Country Club has over 300 members, and provides a venue for unique Member Events, high school proms, reunions, community banquets, corporate retreats and meetings, charity events, weddings, and receptions. Cross Creek Country Club is located at 1129 Greenhill Road in Mount Airy, North Carolina. For more information, call (336) 789-5193. About Us Cross Creek Country Club is nestled at the base of the Blue Ridge Mountains, in Mount Airy, NC. This semi-private golf club offers an amazing 18-hole golf course and a variety of sports, social, and dining activities for both members and daily fee golfers . Enjoy southern hospitality at its best! Location 1129 Greenhill Road Mount Airy, NC 27030 TEL : (336) 789-5193 Powered by foreUP"
    },
    {
      "url": "https://crosscreekcdd.org/about-us/",
      "text": "About Us – Cross Creek CDD Skip to content Information Calendar Documents Links Contact Information Calendar Documents Links Contact About Us The University Park Recreation District was formed by Manatee County on August 2, 2018 to purchase, operate and maintain the University Park Country Club and its related facilities along with +/- 100 acres of conservation and open space land in the District. Establishment Manatee County formed the University Park Recreation District via Ordinance 18-29 pursuant to Chapter 418, F.S. based on a petition signed by over 80% of District residents requesting the formation of the District. Ordinance 18-29, amended by Ordinance 23-95 PDF | RTF Legal Description PDF | RTF District Boundaries Map PDF | RTF Mission, Vision, Values Our Mission: Deliver to members and guests ever evolving lifestyle experiences that are engaging and inclusive by providing exemplary service, facilities and amenities. Our Vision: To be the preeminent gathering place for members and guests to meet, socialize and enjoy lifestyle  opportunities that exceed their expectations in a modern club environment, that also enhances our residential community. Our Core Values: Values that are truly important direct the decision we make, define our character, and preserve what is special about our Club. They are: Integrity, Trust & Mutual Respect – Acting ethically in the best interests of our members, staff and community. Quality – Striving to be the best that can be in all that we do. Fiscal Responsibility and Transparency – Openly communicating our financial position and ensuring that operating budgets and reserves are sufficient to meet the current and future needs of the Club. Environmental stewardship – Commitment to preserving our natural landscape and considering the environmental impact of our decisions. Contact Information District Manager & Registered Agent Venessa Ripoll 3501 Quadrangle Blvd., Suite 270 Orlando FL 32817 ripollv@pfm.com Phone: (407) 723-5900 District Records Custodian 3501 Quadrangle Blvd., Suite 270 Orlando FL 32817 recordrequest@pfm.com Phone: (407) 723-5900 Community Resources Clerk of Court County Government Property Appraiser School Board Supervisor of Elections Tax Collector Explore Cross Creek CDD Information Calendar Documents Links Contact Privacy Policy* Under Florida law, e-mail addresses provided to local governments, including the Cross Creek CDD , are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing at https://www.crosscreekcdd.org"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.wolfcreekgc.com/contact/",
      "text": "Contact Wolf Creek Golf Club | 800 491 3093 404-344-1334 ATLANTA WEATHER X Home (current) Golf Course Course Information Scorecard Course Layout Driving Range Facilities Gallery Tournaments Book Now Contact Wolf Creek Contact Contact Please use the form below to contact us. We will get back to you as soon as possible! First Name Last Name Please enter a valid name. Phone Number Please enter a valid name. Email Please enter a valid name. Subject Please enter a valid name. Message Please enter a valid name. I agree to receive email news, updates, and promotions from Wolf Creek Golf Club. Submit Wolf Creek Golf Course Show Map Hide Map 3000 Union Rd SW Atlanta, GA 30331, United States 123movies embedded maps google For Inquiry contact: info@wolfcreekgc.com 404-344-1334 CONTACT Hours Monday 7AM - 7PM Tuesday 7AM - 7PM Wednesday 7AM - 7PM Thursday 7AM - 7PM Friday 7AM - 7PM Saturday 7AM - 7PM Sunday 7AM - 7PM Address 3000 Union Rd SW Atlanta, GA 30331 info@wolfcreekgc.com 404-344-1334 Home (current) Course Information Scorecard Course Layout Driving Range Facilities Gallery Tournaments Book Now Contact © , Wolf Creek Golf Club, all rights reserved."
    },
    {
      "url": "http://crosscreekatlanta.org/amenities/golf/",
      "text": "Golf Course – Cross Creek Atlanta AMENITIES Cafe Fitness Center Golf Course Pools Tennis Courts ASSOCIATION Board History Management BUYERS Buyers Info Insurance Leasing Moving In RESIDENT LIFE Events HOA Committees Maintenance Parking Pets Reporting Issues Safety Privacy Policy Terms & Conditions Trash PORTAL LOG IN Golf Course Located at the very pulse  of Atlanta’s prestigious northside, Cross Creek Golf Club has something to offer for golfers of all ages. The combination of gently rolling land, ponds , grass mounds and woods makes this a challenging 2,000 yard par 54 course, enjoyable for players of all ability levels. With the short game compromising as much as 65% of a golfer’s round, why not sharpen those areas on a golf course designed for that very purpose? Seniors, ladies and juniors all find our course to be a fun place to enjoy the game. We are family friendly and the pace of play is quick so it doesn’t take 5 hours to play a round!  Cross Creek is the perfect place to relax and enjoy a recreational round or for hosting a business or charity event. Come enjoy some laid back,  good ole southern hospitality in a beautiful setting with a little golf to boot. Memberships are available. Residents enjoy a discounted rate for greens fees and memberships.  Contact the pro-shop at 404-352-5612 or email smartin@hoadv.com for more information. AMENITIES Cross Creek Cafe Fitness Center Golf Course Pools Tennis Courts Privacy Policy Terms & Conditions Cross Creek Condominiums 1221 Cross Creek Parkway Atlanta, Georgia 30327 404-351-7600"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "text": "Contact Information - Mill Creek Golf Club Skip to primary navigation Skip to main content Mill Creek Golf Club Welcome to Mill Creek Golf Club! Home Tee Times Tee Times Member Tee Times Memberships About About Us Rates Course Tour Golf Shop Instruction Course Photos Mill Creek Golf Club Welcome to Mill Creek Golf Club! Online Store Shop Cart Checkout Events Outings & Tournaments Wedding Packages Weddings Gallery Banquets & Events Events Calendar The Tavern Contact Contact Us Join our E-Club Join the Team Employment Apply Now Contact Information Mill Creek Golf Club 128 Cedars Avenue Rochester, NY 14428 Tel : (585) 889-4110 Name Position Chris Gallea General Manager Vinny Cringoli Head Golf Professional Brian Legg Head Superintendent Chris Gallea Sales & Events Map & Directions Award Winning Golf We work hard to offer the best course, conditions & value in Rochester. Thanks for your support! Click Here for the Video as we receive the Award! What People Are Saying: Mill Creek is one of my favorite courses in Rochester to play. It's very well kept and the level of professionalism always remains. If anyone is looking for a good course for business competitive, or leisure play - they should definitely give Mill Creek a shot! Kevin R - Webster, NY Weddings & Banquets Click Here Golf Outings & Events Click Here Tavern Restaurant Click Here Page Footer Contact Us Address : 128 Cedars Ave Churchville, NY 14428 Email: chris.gallea@galleagolfproperties.com Phone : (585) 889-4110 Follow Us Facebook Instagram Twitter Mill Creek Golf Club | 128 Cedars Ave | Churchville, NY 14428 | (585) 889-4110 Copyright © 2025 Mill Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.crosscreekgolfclub.com/contact/contact-us",
      "text": "Contact Us Join Our E-Club Reservations: 951.506.3402 Book A Tee Time Purchase a Gift Card Course Course Layout Scorecard Golf Shop Photo Gallery Video Gallery Practice Facilities Memberships JC Players Card Lessons Gift Cards Tee Times Tournaments De Luz Grill Calendar Weddings & Events STAY Kentina Contact Contact Us Job Opportunities Contact Us Cross Creek Golf Club 43860 Glen Meadows Road Temecula, CA 92590 Phone: 951.506.3402 Get Directions Hours of Operation Golf Course Daily : 6 am – Sunset De Luz Grill Mon - Thurs: 9 A.M. – 6:00 P.M. | Last call for grill is 4:45 pm Fri – Sun: 9 A.M. – 7 P.M. | Last call for grill is 5:45 pm Send Us a Message Please complete all required fields! Full Name (*) Please let us know your name. Email Address (*) Please let us know your email address. Phone Number (*) Invalid Input Specific Info or Remarks (*) Please let us know your message. Submit Location 43860 Glen Meadows Road Temecula, CA 92590 Get Directions Hours of Operation Golf Course Daily : 6 am – Sunset De Luz Grill Mon - Thurs: 9 A.M. – 6:00 P.M. | Last call for grill is 4:45 pm Fri – Sun: 9 A.M. – 7 P.M. | Last call for grill is 5:45 pm Call Us 951.506.3402 Email Us gm@crosscreekgolfclub.com Follow Join Our E-Club Join our mailing list and​ be the first to receive golf updates and tee time deals. Join Our Email List © 2023 Cross Creek Golf Club | Contact Us | Site Map | Purchase a Gift Card | Careers Powered by foreUP Close Home Tee Times Online Store Contact Course Course Layout Scorecard Golf Shop Photo Gallery Video Gallery Practice Facilities Memberships JC Players Card Lessons Gift Cards Tee Times Tournaments De Luz Grill Calendar Weddings & Events STAY Kentina Contact Contact Us Job Opportunities"
    },
    {
      "url": "https://reviews.birdeye.com/cross-creek-golf-club-156065076667372",
      "text": "Cross Creek Golf Club - 27 Reviews - Golf Cart Dealers in Tallahassee, FL - Birdeye Write a review For businesses Tallahassee, FL Automotive Golf Cart Dealers Cross Creek Golf Club Claim this profile This profile has not been claimed by the business owner or representative. Claim this business to update business information, get appointment requests, engage visitors with web chat, and more! Cross Creek Golf Club Share business profile 3.5 27 reviews Golf Cart Dealers Tallahassee, FL Write a review Request appointment Send a message About this business Automotive Golf Cart Dealers Location details Suggest edits 6701 Mahan Dr, Tallahassee, FL, 32308, United States Get directions Weekday Schedule Status Mon 8:00 a.m. to 6:00 p.m. Tue 8:00 a.m. to 6:00 p.m. Wed 8:00 a.m. to 6:00 p.m. Thu 8:00 a.m. to 6:00 p.m. Fri 8:00 a.m. to 6:00 p.m. Sat 8:00 a.m. to 6:00 p.m. Sun 8:00 a.m. to 6:00 p.m. 3.5 27 reviews Write a review Select a rating Insider Pages (4) Google (23) Birdeye (0) Kathy on Insider Pages 2 years ago GREAT DEALS!\nCompared to the other course prices in town this is very reasonable. They do specials on most week nights with drinks and food that can't be beat. The course is small but it is well maintained and excellent for the price. PROS: Great deal nights CONS: small range Anonymous on Insider Pages 2 years ago xxxxxxxxxxxxxxxxx\nxxxxx xxxxxxxx x xxxxxxxxxxx xxxxxxx xxx xxxx xxxxxxxxxx xxxxxxxxxx xxxxxxxxxx xxxxxxxxx xxxxxxxxxxx xxxxxxxxx x x x x xxxxxxxxxxxxx x x x Anonymous P. on Insider Pages 14 years ago xxxxxxxxxxxxxxxxx\nxxxxx xxxxxxxx x xxxxxxxxxxx xxxxxxx xxx xxxx xxxxxxxxxx xxxxxxxxxx xxxxxxxxxx xxxxxxxxx xxxxxxxxxxx xxxxxxxxx x x x x xxxxxxxxxxxxx x x x Kathy S. on Insider Pages 19 years ago GREAT DEALS!\nCompared to the other course prices in town this is very reasonable. They do specials on most week nights with drinks and food that can't be beat. The course is small but it is well maintained and excellent for the price. Frequently asked questions about Cross Creek Golf Club How is Cross Creek Golf Club rated? Cross Creek Golf Club has a 3.5 star rating with 27 reviews. When is Cross Creek Golf Club open? Cross Creek Golf Club is closed now. It will open tomorrow at 8:00 a.m. Browse nearby Healthcare Automotive Real estate Wellness Home services Consumer services Dental Legal Finance Contractors Retail Need help? Contact us. Speak with a specialist to learn how you can grow with Birdeye. We are reachable at profiles@birdeye.com Is this your business? Update business information, get appointment requests, engage visitors with web chat, and more! Claim this profile Business information Suggest edits 6701 Mahan Dr, Tallahassee, FL, 32308, United States Request appointment Call us Send a message https://tacm.com/ Google Popular Automotive resources Blog Reputation management for automotive businesses Reputation management for automotive businesses spans various verticals, and this blog post gives you a comprehensive overview of what business owners must do. 15 min read Blog 13 automotive marketing strategies to rev up your success Unlock success with 13 proven automotive marketing strategies to drive growth and elevate your automotive business 15 min read Guide How auto dealerships can get more reviews Simplify auto dealership success. Our guide shows how customer reviews drive growth—no marketing stress, just keys to thriving business. Let's get started! Download now Popular in Tallahassee, FL Automotive Auto Repair Car Dealers Used Car Dealers Auto Parts & Supplies Tires Body Shops Car Wash Motorcycle Dealers Oil Change Stations More to explore Auto Parts & Supplies in Tallahassee, FL Golf Equipment in Tallahassee, FL Birdeye for businesses Attract Listings Reviews Referrals Pages Google Seller Ratings Convert Webchat Social Appointments Mass Texting Payments Delight Messaging Surveys Insights Benchmarking Ticketing Platform BirdAI Analytics Integrations Google Partnership Birdeye Mobile App Solutions Small Business Enterprise Objectives Google for local business Review Management Review Generation Online Reputation Management Customer Messaging Referral Marketing Website Chat Google Reviews Google My Business Facebook Reviews Business Listings Management Customer Experience Social Media Management Industries Automotive Dental Financial Services Healthcare Home Services Legal Property Management Public Storage Real Estate Retail Wellness Learn more Company About Us Leadership Team Watch Demo Book a time Resources Blog Press Product Updates Careers Success Stories Birdeye Reviews Birdeye Results Legal Resources Contact Us Services Managed Services Professional Services Support and Tools Google Reviews Calculator AI Review Response Generator Google Review Link Generator Scan Your Business Find a Business For Developers Birdeye Support Refer a Business Customer Advocacy Program CONTACT SUPPORT Terms & Conditions Privacy Policy Security GDPR HIPAA CCPA Generative AI Policy © 2025 Birdeye Inc"
    },
    {
      "url": "https://www.1golf.eu/en/club/cross-creek-golf-club-dr-rg/",
      "text": "Cross Creek Golf Club & Dr Rg, Tallahassee, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Cross Creek Golf Club & Dr Rg 9 Hole Public Overview Course Visitors Prices Amenities Club Reviews No image available Cross Creek Golf Club & Dr Rg 6701 Mahan Dr, Tallahassee, FL 32308-1413, USA Phone: +1 850-656-4653 , Fax: +1 850-671-4653 comments@crosscreekgolfandrange.com www.crosscreekgolfandrange.com Map Save Share The Course 9-Hole Par 3 Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round Green fees $17 (15 €) / 18 Holes The Course 9-Hole Par 3 Course Opened in 1996. Design: Devoe Moore . Terrain: Water hazards Scorecard Tee Par CR Slope Length White (Men) 27 - - 1121 yards Red (Women) 27 - - 873 yards Practice Facilities Driving Range Putting Green Chipping Green Visitors 9-Hole Par 3 Course Visitors are welcome every day. Green Fees 9-Hole Par 3 Course Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes $17 (15 €) $17 (15 €) Amenities Club Amenities Clubhouse Club accepts credit cards Pro Shop Bar Snack Bar Rentals Clubs for hire Trolley for hire Electro-cart for hire The Club Personnel Title Name Manager John Hosford Enlarge / get directions Nearby Courses Killearn Country Club Tallahassee (6.7 km) 5.0 of 5 stars (1) 27 Hole Hilaman Golf Course Tallahassee (10 km) 18 Hole 28-32 € / 18 Holes Southwood GC Tallahassee (11 km) 18 Hole 47-64 € / 18 Holes See all User Reviews There are no user reviews yet. Been to Cross Creek Golf Club & Dr Rg ? Share your experiences! Write a Review Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://www.tacm.tv/staff.asp",
      "text": "Traverse Area Community Media Staff - Traverse Area Community Media Search Submit Search About Partner Jurisdictions Cable TV Viewing Area Staff Contact Us Policies and Procedures Annual Report CommunityTV About CommunityTV Watch It! Program Schedule Series Shows Search for Shows GovernmentTV About GovernmentTV Watch It! Browse Meetings City of Traverse City East Bay Charter Township Elmwood Charter Township Charter Township of Garfield Grand Traverse County GT Metro Find Meetings Program Schedule Participate How to Participate Production Team Podcasting Trainings Pay Fees Submit a Program Non-Profit Registration Community Calendar View the Calendar Add Your Event Traverse Area Community Media Staff Home / About / Staff Partner Jurisdictions Cable TV Viewing Area Staff Contact Us Policies and Procedures Annual Report Matthew Kern, Station Manager Email Matt Matt is responsible for the day-to-day operations of Traverse Area Community Media. He grew up in the Grand Traverse area, and has a deep love for the region's lakes, rivers, forests, and all of the creatures in them. Matt has a B.F.A. in Film and Television from the Savannah College of Art and Design. Joe Torrence, Media Specialist Email Joe Joe is responsible for day-to-day operations and management of digital media at Traverse Area Community Media and provides assistance for volunteer productions. Joe holds a degree in Television and Digital Media Production from Ferris State University. Rob Astor, Technology Director Email Rob Rob is a computer programmer responsible for database design and management, system integration, and the development of new user interfaces. Rob provides technology support for Traverse Area Community Media. He earned a B.S. in Mechanical Engineering from Michigan State University and is a returned Peace Corps volunteer. Jim Muratzki, Support Specialist Email Jim Jim provides support and development for LIAA's web applications. He once earned two B.S. degrees from Michigan State University, one in geography and one in anthropology. Traverse Area Community Media 3291 Racquet Club Dr, Unit A Traverse City, MI 49684 ( Driving Directions ) 231-929-4188 cmc@liaa.org Find us on: Facebook YouTube TACM Editors Powered By LIAA"
    },
    {
      "url": "https://crosscreekcc.com/contact-us/",
      "text": "Contact Us | Cross Creek Country Club Tee Times: 336-789-5131 | Office: 336-789-5193 info@crosscreekcc.com Facebook Instagram TikTok YouTube Facebook Instagram TikTok YouTube Golf Course Course Info Dress Code Rates Club Calendar Golf Instruction Golf 101 Ladies’ Golf Association (LGA) Men’s Golf Association (MGA) Surry County Jr. Championship Membership Membership Request Membership Types Member Login Amenities Dining Tennis Swimming Summer Camp Social Activities Events Special Events Weddings & Receptions Golf Outings Grand Ballroom Banquet Information Event Request Club News Contact Us About Us Directions Privacy Policy Covid-19 Awareness Select Page Contact Us  Cross Creek Country Club 1129 Greenhill Road Mount Airy, NC 27030  Phone Numbers Golf Shop Phone : 336-789-5131 Main Office Phone : 336-789-5193 Tennis & Pool Phone : 336-789-5600 Grounds Maintenance Phone : 336-789-9842  Email Address info@crosscreekcc.com Shannon Waters General Manager shannon@crosscreekcc.com Kent Shumate PGA Head Golf Professional kent@crosscreekcc.com Josh Greenberg Executive Chef josh@crosscreekcc.com TJ Waters Golf Course Superintendent tj@crosscreekcc.com Magen Atkinson Membership Director magen@crosscreekcc.com Hours Of Operation Pro Shop: Open Seven Days, Daylight Hours Dining: Monday CLOSED Tuesday 11am – 9pm* Wednesday 11am – 9pm* Thursday 11am – 9pm* Friday 11am – 10pm* Saturday 11am – 10pm* Sunday 11am – 5pm* Office: Monday – Friday, 9:00 A.M. – 5:00 P.M. *Please note that closing time may be adjusted due to weather conditions or guest volume. Dinner Reservations are strongly recommended. Call the clubhouse to book your reservation (336.789.5193) Cross Creek Country Club – Social Media Accounts  Cross Creek C.C. Facebook  Cross Creek C.C. Instagram  Cross Creek C.C. TikTok  Cross Creek C.C. YouTube About Us Cross Creek Country Club is nestled at the base of the Blue Ridge Mountains, in Mount Airy, NC. This semi-private golf club offers an amazing 18-hole golf course and a variety of sports, social, and dining activities for both members and daily fee golfers . Enjoy southern hospitality at its best! Location 1129 Greenhill Road Mount Airy, NC 27030 TEL : (336) 789-5193 Powered by foreUP"
    }
  ]
}