{
  "fuentes": [
    {
      "url": "https://www.bloomberg.com/news/articles/2019-06-12/lacroix-maker-s-plunge-erases-2-7-billion-of-founder-s-fortune",
      "email": "inquiry1@bloomberg.net"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.tamarac.org/1035/Contact-Information",
      "email": "lsrbuilding@tamarac.org"
    },
    {
      "url": "https://www.tamarac.org/1035/Contact-Information",
      "email": "lsrhousing@tamarac.org"
    },
    {
      "url": "https://www.tamarac.org/1035/Contact-Information",
      "email": "lsrmiscar@tamarac.org"
    },
    {
      "url": "https://www.tamarac.org/1035/Contact-Information",
      "email": "lsrsmbl@tamarac.org"
    },
    {
      "url": "https://www.tamarac.org/1035/Contact-Information",
      "email": "lsrsmcode@tamarac.org"
    },
    {
      "url": "https://www.tamarac.org/1035/Contact-Information",
      "email": "lsrsmfire@tamarac.org"
    },
    {
      "url": "https://www.tamarac.org/1035/Contact-Information",
      "email": "lsrutilitybilling@tamarac.org"
    },
    {
      "url": "https://www.tamarac.org/specialevents",
      "email": "adler.marchand@tamarac.org"
    },
    {
      "url": "https://www.tamarac.org/specialevents",
      "email": "justin.bowens@tamarac.org"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.tamarac.gov/231/Special-Events",
      "email": "adler.marchand@tamarac.org"
    },
    {
      "url": "https://www.tamarac.gov/231/Special-Events",
      "email": "justin.bowens@tamarac.org"
    },
    {
      "url": "https://pattersonpark.com/contactus",
      "email": "friends@pattersonpark.com"
    },
    {
      "url": "https://www.forbes.com/profile/nick-caporella/",
      "email": "feedback@forbes.com"
    },
    {
      "url": "https://caporellaaquaticcenter.com/contact/",
      "email": "info@caporellaaquaticcenter.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "asset-1@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "cservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "tkramer@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "you@domain.com"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "customerservice@encorepack.com"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "sales@encorepack.com"
    }
  ],
  "mails": [
    "adler.marchand@tamarac.org",
    "anirudh.shetye@skanem.com",
    "app-promo-phones@2x.png",
    "asset-1@2x.png",
    "beatrice.malle@skanem.com",
    "cservice@thisistheplace.org",
    "customerservice@encorepack.com",
    "customerservice@thisistheplace.org",
    "feedback@forbes.com",
    "friends@pattersonpark.com",
    "info.nairobi@skanem.com",
    "info@caporellaaquaticcenter.com",
    "info@reception-plus.de",
    "inquiry1@bloomberg.net",
    "jane@skanem.ke",
    "justin.bowens@tamarac.org",
    "lsrbuilding@tamarac.org",
    "lsrhousing@tamarac.org",
    "lsrmiscar@tamarac.org",
    "lsrsmbl@tamarac.org",
    "lsrsmcode@tamarac.org",
    "lsrsmfire@tamarac.org",
    "lsrutilitybilling@tamarac.org",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sales@encorepack.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "tkramer@thisistheplace.org",
    "you@domain.com"
  ],
  "nombre_sitio": "tamarac.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bloomberg.com/news/articles/2019-06-12/lacroix-maker-s-plunge-erases-2-7-billion-of-founder-s-fortune",
      "text": "LaCroix (FIZZ) Stock Drop Erases $2.7 Billion From Nick Caporella - Bloomberg Skip to content Bloomberg the Company & Its Products The Company & its Products Bloomberg Terminal Demo Request Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Customer Support Customer Support Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Products and Account Information Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Contracts and Orders Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Sign In Subscribe Search Live TV Markets Chevron Down Economics Industries Tech Politics Businessweek Opinion More Chevron Down US Edition Chevron Down Menu Subscribe Business LaCroix Maker's Drop Erases $2.7 Billion of Founder's Wealth Parent company is grappling with slumping sales, competition Nick Caporella owns almost 75% of National Beverage shares Facebook X LinkedIn Email Link Gift Expand Photographer: Patrick T. Fallon/Bloomberg Facebook X LinkedIn Email Link Gift Gift this article Contact us: Provide news feedback or report an error Confidential tip? Send a tip to our reporters Site feedback: Take our Survey New Window Facebook X LinkedIn Email Link Gift By Devon Pendleton and Sophie Alexander June 12, 2019 at 1:18 PM UTC Updated on June 12, 2019 at 8:36 PM UTC Bookmark Save Lock This article is for subscribers only . Once the toast of millennials, the LaCroix brand of carbonated water is losing some sparkle for its billionaire owner. Nick Caporella , the octogenarian chairman and founder of LaCroix parent National Beverage Corp., has lost $2.7 billion -- more than half of his net worth -- in the past nine months. The stock tumbled 62% through Tuesday amid slumping sales, increased competition and a whistle-blower lawsuit alleging its cans contain toxic chemicals. Home BTV+ Market Data Opinion Audio Originals Magazine Events News Markets Economics Technology Politics Green Crypto AI Work & Life Wealth Pursuits Businessweek CityLab Sports Equality Management & Work Market Data Stocks Commodities Rates & Bonds Currencies Futures Sectors Economic Calendar Explore Newsletters Explainers Pointed News Quiz The Big Take Graphics Submit a Tip About Us Terms of Service Do Not Sell or Share My Personal Information Trademarks Privacy Policy Careers Made in NYC Advertise Ad Choices Help © 2025 Bloomberg L.P. All Rights Reserved."
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * name E-Mail Surname Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.tamarac.org/1035/Contact-Information",
      "text": "Contact Information | Tamarac, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Services Businesses How Do I 360° Tour Search Privacy Policy Refund Policy Contact Information Card Security Code Lien Settlement Request Abatement Application Lien Search Request Contact Information Contact Information Contact information has been provided below for the City Departments and Divisions responsible for certain aspects of Lien Search Requests.  Please contact the specific City Department or Division based upon the area of concern.  For any further questions or comments, please visit the City's ' How Can We Help ' to submit a request. Find the right contact for your needs. Select a category to get started! View All Utility Billing Building Permits Magistrate Cases Housing Liens Accounts Receivable Utility Billing Financial Services Department: Customer Services Division Tel: (954) 597-3590 Fax: (954) 597-3595 Email: LSRUtilityBilling@tamarac.org Building Permits Building Department Tel: (954) 597-3420 Fax: (954) 597-3450 Email: LSRBuilding@tamarac.org Special Magistrate Cases Building Department Tel: (954) 597-3420 Fax: (954) 597-3450 Email: LSRBuilding@tamarac.org Community Development Department: Business Revenue Division (Business Licenses) Tel: (954) 597-3530 Fax: (954) 597-3540 Email: LSRSMBL@tamarac.org Community Development Department: Code Enforcement Division Tel: (954) 597-3425 Fax: (954) 597-3490 Email: LSRSMCode@tamarac.org Fire Rescue Department: Fire Prevention Division Tel: (954) 597-3800 Fax: (954) 597-3810 Email: LSRSMFire@tamarac.org HOUSING LIENS Community Development Department: Housing Division Tel: (954) 597-3549 Fax: (954) 597-3544 Email: LSRHousing@tamarac.org Miscellaneous Accounts Receivable (A/R) Financial Services Department: Customer Services Division Tel: (954) 597-3590 Fax: (954) 597-3595 Email: LSRMiscAR@tamarac.org Online Services Open Government Emergency Notifications Stay Connected Meetings Careers Contact Us 7525 NW 88 th Avenue Tamarac, FL 33321 Phone: (954) 597-3500 Quick Links Publications Parks & Facilities Employee Self-Service Water Quality Report Flood Protection Information FAQS /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx SHARE AND CONNECT Contact Us Permits Pay Water Bill Public records Tamarac TV Terms of Use Privacy Policy /QuickLinks.aspx Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tamarac.org/specialevents",
      "text": "Special Events | Tamarac, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Services Businesses How Do I 360° Tour Search Event Cancellations and Postponements Home Departments Parks & Recreation News and Special Events Special Events Special Events The City of Tamarac is committed to building community through enriching experiences. These events are designed with the entire family in mind and offered throughout the year. For more information about upcoming events, please contact (954) 597-3620 . Click HERE Version Options Special Events Headline to view event cancellations and postponements, or visit Stay Connected to sign-up for email and text message notifications. Upcoming Special Events Hispanic Heritage Month Join the City of Tamarac for an unforgettable celebration of Hispanic Heritage Month on Friday, September 19, at the Tamarac Village Amphitheatre, 9090 NW 57th St . The FREE outdoor concert begins at 6:30 P.M. and features four-time Grammy-winning artist Tomasito Cruz, whose performance is sure to leave you mesmerized. The open-air celebration includes on-site food trucks and live music featuring flamenco, salsa and Latin jazz. Don’t miss this beautiful evening of culture, music and community! When: Friday, September 19, 6:30 P.M.- 9:30 PM. Where: Tamarac Village Amphitheater, 9090 NW 57th St . Price: Free Admission. Limited on-site parking. Please use the continuous shuttle transportation from Tamarac Community Center, 8601 W. Commercial Blvd ., and Caporella Aquatic Center, 9300 NW 58th St. , from 6:30 P.M. - 9:30 PM. __________ Únase a la Ciudad de Tamarac en una inolvidable celebración del Mes de la Herencia Hispana el viernes 19 de septiembre en el Anfiteatro de Tamarac Village, 9090 NW 57th St. El concierto gratuito al aire libre comienza a las 18:00 hrs. y presenta al artista Tomasito Cruz, ganador de cuatro premios Grammy, cuya actuación seguramente lo dejará fascinado. La celebración al aire libre incluye camiones de comida y música en vivo destacando flamenco, salsa y jazz latino. ¡No se pierda esta hermosa noche de cultura, música y comunidad! Cuándo: Viernes 19 de septiembre, de 18:30 a 21:30 hrs. Dónde : Anfiteatro Tamarac Village, 9090 NW 57th St. Precio: Entrada gratuita. Estacionamiento limitado. Por favor, utilice el servicio de transporte continuo desde T amarac Community Center, 8601 W. Commercial Blvd. , y el Caporella Aquatic Center, 9300 NW 58th St. , de 18:30 a 21:30 hrs. Garage Sale Need to clear your closet or clean your garage? Come out to Tamarac Park, 7501 N. University Drive. , on Saturday, October 4th, from 7:30 A.M. - 12:30 P.M. to shop and browse the City's largest garage sale. Interested in being a vendor? Stop by the T amarac Recreation Center, 7501 N. University Drive. , or register on line at www.Tamarac.me/Webtrac today. Early Registration: July 1st - August 17th Fee: $30 per Vendor space Late Registration: August 18th - October 3rd Fee: $45 per vendor space A separate $30 clean up deposit per vendor is required for registration. When: Saturday, October 4th, 7:30am-12:30pm Where: Tamarac Park, 7501 N. University Drive . Vendor setup: 5:30 P.M. - 7:00 A.M. Halloween Hoopla Enjoy this FREE event for all ages which will include music, arts & crafts, bounce houses, face painting, carnival games, prizes, candy, and much more. First 500 kids will receive a free bag of treats. When: Friday, October 24, 6:00 P.M. – 8:30 P.M. Where: Tamarac Park, 7501 N. University Drive THE GREAT PUMPKIN SLASH Join us for some spooky water fun in our floating pumpkin patch. Enjoy pumpkin picking and decorating, a magic show, balloon art and fun for the whole family! When: Saturday, October 25, 10:00 A.M.- 1:00 P.M. Where: Caporella Aquatic Complex, 9300 NW 58 th Street Fee: $5 per guest, pre-registration is required at Tamarac.me/Events Walking Club Come out and meet with other active members in and around the community to engage in a free walking club! No pre-registration required. Bring water and a towel. When: First Wednesday of each month, 6:00 P.M. - 7:00 P.M. Where : Mainlands Park, 4500 Monterey Drive . Food Truck Fridays Bring your family and appetites to the Tamarac Village Amphitheater, 9090 NW. 57 St, on the 2nd and 4th Friday of the month to enjoy food, games and music at Food Truck Fridays! When: Every 2nd and 4th Friday of the Month, 5:00 P.M. - 9:00 P.M. Where: Tamarac Village Amphitheater , 9090 NW. 57 St. Tamarac Community Farmers Market The market is a great place to shop for fresh produce, tea, honey, sauces, baked goods, hummus, pickles, and other artisanal goodies. Come meet the producers and sample their locally prepared, all natural products. When: Every Sunday, 9:00 A.M. - 2:00 P.M. Where: Veterans' Memorial Park, 7825 Southgate Boulevard . Become a Sponsor! Sponsoring a special event is a great marketing approach to reach your desired audience. By partnering with the City of Tamarac, we will provide you with an avenue to promote your business and assist in increasing visibility in the community. Contact the Tamarac Parks and Recreation Department at (954) 597-3678 or email for more information. Concert in the Park Band Inquiries To submit your bands information for upcoming Concert in the Park events, please email and include your band's name, music genre, and links to your website, YouTube channel, etc. Submission does not guarantee a spot in the concert line-up. Food Truck and Food Vendor Inquiries Submit your information by email to be put on our food vendor list. Online Services Open Government Emergency Notifications Stay Connected Meetings Careers Contact Us 7525 NW 88 th Avenue Tamarac, FL 33321 Phone: (954) 597-3500 Quick Links Publications Parks & Facilities Employee Self-Service Water Quality Report Flood Protection Information FAQS /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx SHARE AND CONNECT Contact Us Permits Pay Water Bill Public records Tamarac TV Terms of Use Privacy Policy /QuickLinks.aspx Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.tamarac.gov/231/Special-Events",
      "text": "Special Events | Tamarac, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Services Businesses How Do I 360° Tour Search Event Cancellations and Postponements Home Departments Parks & Recreation News and Special Events Special Events Special Events The City of Tamarac is committed to building community through enriching experiences. These events are designed with the entire family in mind and offered throughout the year. For more information about upcoming events, please contact (954) 597-3620 . Click HERE Version Options Special Events Headline to view event cancellations and postponements, or visit Stay Connected to sign-up for email and text message notifications. Upcoming Special Events Hispanic Heritage Month Join the City of Tamarac for an unforgettable celebration of Hispanic Heritage Month on Friday, September 19, at the Tamarac Village Amphitheatre, 9090 NW 57th St . The FREE outdoor concert begins at 6:30 P.M. and features four-time Grammy-winning artist Tomasito Cruz, whose performance is sure to leave you mesmerized. The open-air celebration includes on-site food trucks and live music featuring flamenco, salsa and Latin jazz. Don’t miss this beautiful evening of culture, music and community! When: Friday, September 19, 6:30 P.M.- 9:30 PM. Where: Tamarac Village Amphitheater, 9090 NW 57th St . Price: Free Admission. Limited on-site parking. Please use the continuous shuttle transportation from Tamarac Community Center, 8601 W. Commercial Blvd ., and Caporella Aquatic Center, 9300 NW 58th St. , from 6:30 P.M. - 9:30 PM. __________ Únase a la Ciudad de Tamarac en una inolvidable celebración del Mes de la Herencia Hispana el viernes 19 de septiembre en el Anfiteatro de Tamarac Village, 9090 NW 57th St. El concierto gratuito al aire libre comienza a las 18:00 hrs. y presenta al artista Tomasito Cruz, ganador de cuatro premios Grammy, cuya actuación seguramente lo dejará fascinado. La celebración al aire libre incluye camiones de comida y música en vivo destacando flamenco, salsa y jazz latino. ¡No se pierda esta hermosa noche de cultura, música y comunidad! Cuándo: Viernes 19 de septiembre, de 18:30 a 21:30 hrs. Dónde : Anfiteatro Tamarac Village, 9090 NW 57th St. Precio: Entrada gratuita. Estacionamiento limitado. Por favor, utilice el servicio de transporte continuo desde T amarac Community Center, 8601 W. Commercial Blvd. , y el Caporella Aquatic Center, 9300 NW 58th St. , de 18:30 a 21:30 hrs. Garage Sale Need to clear your closet or clean your garage? Come out to Tamarac Park, 7501 N. University Drive. , on Saturday, October 4th, from 7:30 A.M. - 12:30 P.M. to shop and browse the City's largest garage sale. Interested in being a vendor? Stop by the T amarac Recreation Center, 7501 N. University Drive. , or register on line at www.Tamarac.me/Webtrac today. Early Registration: July 1st - August 17th Fee: $30 per Vendor space Late Registration: August 18th - October 3rd Fee: $45 per vendor space A separate $30 clean up deposit per vendor is required for registration. When: Saturday, October 4th, 7:30am-12:30pm Where: Tamarac Park, 7501 N. University Drive . Vendor setup: 5:30 P.M. - 7:00 A.M. Halloween Hoopla Enjoy this FREE event for all ages which will include music, arts & crafts, bounce houses, face painting, carnival games, prizes, candy, and much more. First 500 kids will receive a free bag of treats. When: Friday, October 24, 6:00 P.M. – 8:30 P.M. Where: Tamarac Park, 7501 N. University Drive THE GREAT PUMPKIN SLASH Join us for some spooky water fun in our floating pumpkin patch. Enjoy pumpkin picking and decorating, a magic show, balloon art and fun for the whole family! When: Saturday, October 25, 10:00 A.M.- 1:00 P.M. Where: Caporella Aquatic Complex, 9300 NW 58 th Street Fee: $5 per guest, pre-registration is required at Tamarac.me/Events Walking Club Come out and meet with other active members in and around the community to engage in a free walking club! No pre-registration required. Bring water and a towel. When: First Wednesday of each month, 6:00 P.M. - 7:00 P.M. Where : Mainlands Park, 4500 Monterey Drive . Food Truck Fridays Bring your family and appetites to the Tamarac Village Amphitheater, 9090 NW. 57 St, on the 2nd and 4th Friday of the month to enjoy food, games and music at Food Truck Fridays! When: Every 2nd and 4th Friday of the Month, 5:00 P.M. - 9:00 P.M. Where: Tamarac Village Amphitheater , 9090 NW. 57 St. Tamarac Community Farmers Market The market is a great place to shop for fresh produce, tea, honey, sauces, baked goods, hummus, pickles, and other artisanal goodies. Come meet the producers and sample their locally prepared, all natural products. When: Every Sunday, 9:00 A.M. - 2:00 P.M. Where: Veterans' Memorial Park, 7825 Southgate Boulevard . Become a Sponsor! Sponsoring a special event is a great marketing approach to reach your desired audience. By partnering with the City of Tamarac, we will provide you with an avenue to promote your business and assist in increasing visibility in the community. Contact the Tamarac Parks and Recreation Department at (954) 597-3678 or email for more information. Concert in the Park Band Inquiries To submit your bands information for upcoming Concert in the Park events, please email and include your band's name, music genre, and links to your website, YouTube channel, etc. Submission does not guarantee a spot in the concert line-up. Food Truck and Food Vendor Inquiries Submit your information by email to be put on our food vendor list. Online Services Open Government Emergency Notifications Stay Connected Meetings Careers Contact Us 7525 NW 88 th Avenue Tamarac, FL 33321 Phone: (954) 597-3500 Quick Links Publications Parks & Facilities Employee Self-Service Water Quality Report Flood Protection Information FAQS /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx SHARE AND CONNECT Contact Us Permits Pay Water Bill Public records Tamarac TV Terms of Use Privacy Policy /QuickLinks.aspx Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://pattersonpark.com/contactus",
      "text": "Contact Us — Friends of Patterson Park About Us Our Mission Friends' Staff Board of Directors Job Opportunities Cedar House Vendor Interest Form Privacy Policy Get Involved Donate Volunteer Capital Campaign Commemorative Tree Program Park Patrons Corporate Friends Vehicle Donations Gifts of Stock & Planned Gifts E-Newsletter Contact Us Observatory Docent Page News & Events Park Calendar Park News Programming Concert Series Mueveton + BabyFest Patterson Park BrewFest Winter Lights Día del Niño Wine at Sunset Ongoing Events About Patterson Park Park Landmarks Park FAQ History & Nature Tree Walk Donate Store About Us Our Mission Friends' Staff Board of Directors Job Opportunities Cedar House Vendor Interest Form Privacy Policy Get Involved Donate Volunteer Capital Campaign Commemorative Tree Program Park Patrons Corporate Friends Vehicle Donations Gifts of Stock & Planned Gifts E-Newsletter Contact Us Observatory Docent Page News & Events Park Calendar Park News Programming Concert Series Mueveton + BabyFest Patterson Park BrewFest Winter Lights Día del Niño Wine at Sunset Ongoing Events About Patterson Park Park Landmarks Park FAQ History & Nature Tree Walk Donate Store Contact Us Our Office 27 South Patterson Park Ave Baltimore, MD 21231 410-276-3676 Contact Us Interested in getting involved, or just learning more about park or what the Friends do? We'd love to hear from you! Name * First Name Last Name Email Address * Subject * Message * Thanks for your email! Top ABOUT US GET INVOLVED PARK NEWS LEARN MORE Our Mission Park Landmarks The Friends Donate Ongoing Events Contact Us Newsletter Park Calendar Park Journal Park FAQs History & Nature"
    },
    {
      "url": "https://www.forbes.com/profile/nick-caporella/",
      "text": "Nick Caporella Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Get in Touch Get In Touch With Nick Caporella Get In Touch PROFILE Nick Caporella $3.9B Real Time Net Worth as of 9/11/25 Reflects change since 5 pm ET of prior trading day. #1015 in the world today From the Editor Nick Caporella is the chairman and CEO of National Beverage, which he founded in 1985; it's best known for its LaCroix brand of sparkling water. The Pennsylvania native started out as a contractor and worked as the CEO of telecom firm Burnup & Sims before founding his soft drinks business. He kickstarted National Beverage by buying soda brand Shasta, then later added LaCroix to the portfolio in 1996. The Fort Lauderdale, Florida-based company, which trades under the ticker FIZZ, has faced increased competition from rivals like PepsiCo and other brands selling flavored fizzy water. Wealth History HOVER TO REVEAL NET WORTH BY YEAR Forbes Lists #362 Forbes 400 (2025) #948 Billionaires (2025) Personal Stats Age 89 Source of Wealth Beverages, Self Made Self-Made Score 9 Philanthropy Score 1 Residence Plantation, Florida Citizenship United States Marital Status Married Children 4 Did you know Caporella got his first taste of success in construction, where he reportedly scraped together $250 for a down payment on a used dragline excavator in 1957. Burnup & Sims acquired Caporella's contracting business in 1972, and he was tapped to become the CEO just four years later. Related People & Companies Nobutada Saji & family Related by origin of wealth: Beverages View Profile Osathanugrah family Related by origin of wealth: Beverages View Profile Lin Muqin & family Related by origin of wealth: Beverages View Profile Tan Passakornnatee Related by origin of wealth: Beverages View Profile Anan Ruckariyapong & family Related by origin of wealth: Beverages View Profile More on Forbes 3 hours ago 49ers Brock Purdy Likely To Miss Week 2 With Toe And Shoulder Injuries San Francisco 49ers head coach Kyle Shanahan called the chances of Brock Purdy playing at quarterback against the New Orleans Saints in NFL Week 2 “a long shot.” By Bruce Y. Lee Senior Contributor 4 hours ago Unrivaled Hits $340M Valuation, Adds Two Clubs After Series B Round Unrivaled, the 3-on-3 women’s basketball league, reaches $340M in Series B funding led by Bessemer and expands with two new teams for its second season By Roberta F. Rodrigues Contributor 4 hours ago ‘John Wick’ Spinoff ‘Ballerina’ Gets STARZ Streaming Premiere Date Ana de Armas’ action thriller “From the World of John Wick: Ballerina,” featuring Keanu Reeves, is coming soon to streaming video on demand on STARZ. Find out when you can stream it on the app. By Tim Lammers Contributor 4 hours ago ‘Subject’ In Charlie Kirk Shooting Released After Interrogation, FBI Says (Live Updates) FBI Director Kash Patel said the \"investigation continues\" in the search for the shooter. By Zachary Folk Forbes Staff 5 hours ago The Ryder Cup’s Most Memorable Moments The Ryder Cup is full of exciting finishes but three different years proved to be best. By Tim Corlett Contributor 5 hours ago California Bullet Train Will Get $20 Billion In State Funding Amid Trump Fight Legislators are extending the Cap-and-Trade program, paid for by its biggest industrial polluters, that will provide $1 billion a year in new funding through 2045. By Alan Ohnsman Forbes Staff 5 hours ago Chargers-Raiders Week Has More Spice With Jim Harbaugh And Pete Carroll The players are always the most important components of games, but don't take your eyes off the teams' coaches as they renew their salty rivalry. By Jay Paris Contributor Oct 2, 2019 Here Are The 27 Billionaires Who Dropped Off The Forbes 400 Twenty-two billionaires lost their spot on the list of richest people in America as their fortunes fell, while five, including David Koch, Paul Allen and Ross Perot, died in the past year. By Will Yakowicz Forbes Staff Jun 11, 2019 Fired Executive Sues LaCroix And Its Billionaire Owner’s Son After Tussle Over BPA-Free Cans Shares of LaCroix parent National Beverage fell 5% on Tuesday, following an 8-month decline that has erased more than half the market capitalization of the company. By Jennifer Wang Former Staff Mar 8, 2019 National Beverage Stock's Lack Of Fizz Is Yet Another Indication That Corporate Governance Matters So, La Croix sales are falling due to litigation, but that litigation will not have a material adverse effect the company's operations.  That is the most self-contradictory messaging I have read in 26 years of reading quarterly SEC filings. It makes no sense. By Jim Collins Former Contributor Mar 8, 2019 LaCroix Owner Loses $500 Million In Hours, Blames ‘Injustice’ For Fizzling Sales When the people stop buying flavored water, one can only shake an angry fist at the sky. By Noah Kirsch Former Staff Oct 19, 2017 These Billionaires Made It Into The Forbes 400 Without Stepping On A College Campus These few high school grads and dropouts — from immigrants and farmers to heiresses and hustlers — managed to grow up and grow into $2 billion (at least) fortunes to become one of America’s richest. By Angel Au-Yeung Former Staff Oct 8, 2016 Gray Hair Helps When Trying To Reach The Ranks Of The Super Rich More than half of Forbes 400 members are in their 60s and 70s. By Luisa Kroll Forbes Staff Oct 4, 2016 Meet The 22 Newcomers To The 2016 Forbes 400 More than two-thirds of the newcomers to The Forbes 400 in 2016 inherited at least some of their wealth. By Katia Savchuk Forbes Staff Oct 4, 2016 Forbes 400: The Full List Of The Richest People In America 2016 See the full list of every billionaire on The Forbes 400 list of America's wealthiest people. By Chase Peterson-Withorn Forbes Staff Sep 29, 2016 LaCroix Billionaire Loses $200 Million After Short Seller Publishes Scathing Allegations Glaucus Research Group released a report that questioned National Beverage’s accounting methods and ownership structure, and accused CEO and founder Nick Caporella of manipulating earnings results. By Jennifer Wang Former Staff Apr 8, 2016 Huge Success Of LaCroix Sparkling Water Has Turned Beverage Firm Founder Into A New Billionaire Soft drinks company National Beverage doesn’t have nearly the name recognition enjoyed by Coca Cola or Pepsi, but a 80% surge in share price over the past year has catapulted its founder into billionairehood. By Jennifer Wang Former Staff More Articles also on forbes 49ers Brock Purdy Likely To Miss Week 2 With Toe And Shoulder Injuries Unrivaled Hits $340M Valuation, Adds Two Clubs After Series B Round ‘John Wick’ Spinoff ‘Ballerina’ Gets STARZ Streaming Premiere Date © 2025 Forbes Media LLC. All Rights Reserved. AdChoices AdChoices Privacy Statement Do Not Sell or Share My Personal Information Limit the Use of My Sensitive Personal Information Cookie Preferences Terms of Service Digital Terms of Sale Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Forbes Accolades Forbes Press Room Advertise"
    },
    {
      "url": "https://caporellaaquaticcenter.com/contact/",
      "text": "Contact Us - Caporella Aquatic Center Skip to content Our Park Activities Blog Contact Us Our Park Activities Blog Contact Us Follow Us on Facebook-f Instagram Youtube (954) 597-3660 9300 NW 58 Street, Tamarac, FL 33321 Our Park Activities Blog Contact Us Our Park Activities Blog Contact Us Contact Us Get your swim gear ready! Get Contact Details Come and see for yourself or give us a call! Caporella Aquatic Center Location 9300 NW 58th St, Tamarac, FL 33321 Phone (954) 597-3660 Email Address [email protected] Drop us a line Name Phone Email Subject Message Send My Message Caporella Aquatic and Fitness Center prides itself on providing a welcoming and inclusive environment for all members, which makes it an excellent choice for those who are looking to make a difference in people’s lives. Useful Links About Us Contact Privacy Policy Follow Us on Facebook-f Instagram Youtube Reach Us Caporella Aquatic Center (954) 597-3660 [email protected] 9300 NW 58 Street, Tamarac, FL 33321 Our City Copyright © 2023 City of Tamarac , All rights reserved You cannot copy content of this page"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "text": "Contact Us | This Is The Place Heritage Park Annual Pass Menu Annual Pass Menu Connect With Us Contact us via the form below and our team will respond within 48 hours. Support Form (#8) Updates First Name Last Name Email Department - Select Department - Weddings Events Corporate Groups Dining General Admission Media / Press Phone/Mobile Subject Description Submit Form Contact Info customerservice@thisistheplace.org 801-582-1847 Address 2601 E. Sunnyside Avenue Salt Lake City, Utah 84108 THIS IS THE PLACE VISIT TODAY! 2601 EAST SUNNYSIDE AVENUE, SALT LAKE CITY, UT, 84108 801-582-1847 cservice@thisistheplace.org Press Inquiries: Tresha Kramer- tkramer@thisistheplace.org Footer Subscription Form Newsletter Subscribe Follow Us About Hours & Admission Contact Us Terms & Conditions Blog Home Today’s Fun Summer Season Winter Season Plan Your Visit Activities Bonus Events Utah Trail Rides Childrens Parties Pioneer Trades Shopping Gift Shop Food Brigham’s Donuts Huntsman Grill General Info Hours & Admission Annual Pass Contact Us About Directions Partners & Sponsors Support The Park Heritage Village The Village The Pioneer Center Monuments Pioneers of 1847 Monument Statuary Walk The Mormon Battalion National Pony Express Walk of Pioneer Faiths Pioneer Children’s Memorial Building Rentals Weddings & Receptions Corporate Events Family Reunions Pricing Catering Bartenders Buildings The Garden Place Rental Pine Valley Chapel Rental Atkin Home Rental Brigham Young Farmhouse Kimball Home Rental Pioneer Center Rental Pack Home Rental Plaza Rental Ottinger Hall Rental Pioneer Pavilion Rental Emigration Room at the Pioneer Center Miller Pavilion Rental Education School Field Trips Blog"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "text": "Encore Packaging LLC -Contact Us! Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal/Privacy Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Thank you for sending us a message! We will get back to you shortly Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Do you consent to our Privacy Policy / Terms of Use and Standard Terms and Conditions of Sale ? Yes Logout Please check in later. This feature coming soon! (847) 735-8105 Call Us | Email Us | Log-In Products News Special Offers Events About Us Strapping Stretch Strapping and Accessories Kits Battery Tools and Accessories Tensioners Pneumatic Tools Sealers Accessories Sealless Tools Cutters Strapping Trucks Strap Dispensers Edge Protectors Strapping Coils Buckles Pre-Cuts Seals Combination Tools Material Dispensers & Holders Storage Solutions Peanut Dispensers Kraft Paper Dispensers Bubble, Foam, Poly and Corrugated Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stretch Film Dispensers Honeycomb Paper Dispensers Slide Cutters Utility Knives & Cutters Replacement Blades Retractable T-Style Hook Style Sliding Accessories Specialty Tape Dispensers Table-Top Rubber Bands Standard Moving Pallet Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Strapping Stretch Strapping and Accessories Eco-Friendly Kits For Woven Polyester For Polypropylene For Polyester For Steel For Woven Cord Battery Tools and Accessories For Polypropylene For Polyester For Cord Strapping Tensioners For Polypropylene For Polyester For Cord For Steel For Stainless Steel Pneumatic Tools For Cord For Steel Sealers For Polypropylene For Polyester For Steel Accessories Sealless Tools For Steel Cutters For Steel and Poly For Steel Strapping Trucks Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Steel or Poly Strap Dispensers For Steel For Cord For Poly For Steel or Poly For Poly and Steel Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Poly Edge Protectors Standard Duty Heavy Duty Strapping Coils Buckles For Cord For Poly For Stainless Steel Pre-Cuts Seals For Poly For Steel Combination Tools For Steel For Stainless Steel Material Dispensers & Holders Storage Solutions Trays Mobile Hooks Carton Stands Peanut Dispensers Kraft Paper Dispensers Wall Mountable Table/Wall Mountable Floor Unit Accessory Table Mountable Bench Mountable Table/Bench Mountable Mobile Units Battery Powered Bubble, Foam, Poly and Corrugated Dispensers Wall/Table Mount Mobile Dispensers Battery Powered Horizontal Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stationary Mobile Stretch Film Dispensers Honeycomb Paper Dispensers Table/Wall Mountable Slide Cutters Wall/Table Mount Mobile Dispensers Battery Powered Utility Knives & Cutters Replacement Blades Retractable Light Duty Standard Duty Heavy Duty T-Style Light Duty Standard Duty Hook Style Standard Duty Heavy Duty Sliding Standard Duty Accessories Specialty Standard Duty Heavy Duty Tape Dispensers Replacement Blades & Wiper Plates Hand-Held Table-Top Rubber Bands Standard Large Moving Pallet Phone: 847-735-8105 Fax: 847-735-8297 Email: customerservice [at] encorepack sales [at] encorepack Headquarters: Encore Packaging LLC 201 Park Ave Lake Villa, IL 60046 Remit Payment to: P.O. Box 595 Winnetka, IL 60093 Ask An Agent Our Customer Service Agents are ready to help! (847) 735-8105 Email Home Contact Site Map Catalog Legal encorepack.mx"
    }
  ]
}