{
  "fuentes": [
    {
      "url": "https://www.bso.org/support/volunteer",
      "email": "bsav@bso.org"
    },
    {
      "url": "https://www.bso.org/support/volunteer",
      "email": "customerservice@bso.org"
    },
    {
      "url": "https://tanglewoodnaturecenter.wildapricot.org/board",
      "email": "tanglewooddirector@outlook.com"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "br.caremanager@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "claire.stainton@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "ellie.wibberley@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "gemma.woodcock@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "info@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "jill.packwood@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "julie.esprit@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "karen.scaife@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "katie.more@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "kelly.davies@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "rachel.french@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "rebecca.yeomans@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "sally.tebbett@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "sherin.kandi@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "steven.clements@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "email": "tracey.klue@twhealthcare.co.uk"
    },
    {
      "url": "https://www.apartmentsearch.com/apartments/rhode-island/coventry/tanglewood-village",
      "email": "info@apartmentsearch.com"
    },
    {
      "url": "https://www.tanglewoodnaturecenter.com/staff",
      "email": "tanglewooddirector@outlook.com"
    },
    {
      "url": "https://www.tanglewoodnaturecenter.com/staff",
      "email": "tanglewoodoffmgr@outlook.com"
    },
    {
      "url": "https://thedyrt.com/camping/florida/tanglewood-village-vero",
      "email": "fordovallogo@2x.png"
    },
    {
      "url": "https://thedyrt.com/camping/florida/tanglewood-village-vero",
      "email": "fordovallogo@3x.png"
    },
    {
      "url": "https://www.allstays.com/Campgrounds-details/17903.htm",
      "email": "icongrouped@2x.png"
    },
    {
      "url": "https://www.tanglewoodgroup.co.uk/contact",
      "email": "info@tanglewoodgroup.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "blue@2x.png"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "br.caremanager@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "claire.stainton@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "dark-orange@2x.png"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "ellie.wibberley@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "gemma.woodcock@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "info@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "jill.packwood@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "julie.esprit@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "karen.scaife@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "katie.more@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "kelly.davies@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "rachel.french@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "rebecca.yeomans@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "sally.tebbett@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "sherin.kandi@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "steven.clements@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "email": "tracey.klue@twhealthcare.co.uk"
    },
    {
      "url": "https://www.tanglewoodhomes.org/board-staff",
      "email": "margieprather@tanglewoodhomes.org"
    },
    {
      "url": "https://www.tanglewoodhomes.org/board-staff",
      "email": "stevenboyd@tanglewoodhomes.org"
    }
  ],
  "mails": [
    "blue@2x.png",
    "br.caremanager@twhealthcare.co.uk",
    "bsav@bso.org",
    "claire.stainton@twhealthcare.co.uk",
    "customerservice@bso.org",
    "dark-orange@2x.png",
    "ellie.wibberley@twhealthcare.co.uk",
    "fordovallogo@2x.png",
    "fordovallogo@3x.png",
    "gemma.woodcock@twhealthcare.co.uk",
    "icongrouped@2x.png",
    "info@apartmentsearch.com",
    "info@tanglewoodgroup.co.uk",
    "info@twhealthcare.co.uk",
    "jill.packwood@twhealthcare.co.uk",
    "julie.esprit@twhealthcare.co.uk",
    "karen.scaife@twhealthcare.co.uk",
    "katie.more@twhealthcare.co.uk",
    "kelly.davies@twhealthcare.co.uk",
    "margieprather@tanglewoodhomes.org",
    "rachel.french@twhealthcare.co.uk",
    "rebecca.yeomans@twhealthcare.co.uk",
    "sally.tebbett@twhealthcare.co.uk",
    "sherin.kandi@twhealthcare.co.uk",
    "steven.clements@twhealthcare.co.uk",
    "stevenboyd@tanglewoodhomes.org",
    "tanglewooddirector@outlook.com",
    "tanglewoodoffmgr@outlook.com",
    "tracey.klue@twhealthcare.co.uk"
  ],
  "nombre_sitio": "tanglewoodvero.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bso.org/support/volunteer",
      "text": "BSO | Volunteer Skip to content We use cookies to enhance your experience. By continuing to browse, you agree to saving BSO and third-party cookies on your device. See our privacy policy . Dismiss Menu BSO Our world-class orchestra, founded in 1881 Concerts Andris Nelsons Visit About Learn Community Support the Boston Symphony Orchestra Tanglewood The summer home of the Boston Symphony Orchestra, nestled in the woods of Lenox, Massachusetts Concerts Visit Tanglewood About Tanglewood Learning Institute Tanglewood Music Center Book an Event Support Tanglewood Boston Pops Everything from jazz to pop, rock to big band, film music to the great American songbook, and Broadway to classical Concerts Holiday Pops Keith Lockhart Fireworks Spectacular Support the Boston Pops Symphony Hall Our historic concert hall in Boston, Massachusetts, world-renowned for its lively acoustics Concerts Visit Symphony Hall The History of Symphony Hall Support the Boston Symphony Orchestra, Inc. Venue Rentals Tickets Donate Log In BSO Tanglewood Pops Symphony Hall Account Log in or Signup Orders Settings Get our newsletter Cart Home Visit Getting to Symphony Hall When You're Here Symphony Hall Tours Policies & Information Dining at Symphony Hall Explore dining options for your visit to Symphony Hall. About Andris Nelsons Musicians Staff & Leadership History Archives Mission Press Annual Reports Jobs and Opportunities Learn Children & Families Students & Educators Adults Symphony Hall Online Exhibits Community Performances Partners Collaborations Support BSO Friends and Society Membership Ways to Give Planned Giving Galas & Flagship Events Donor Events Special Gifts Sponsors, Business Partners, and Advertising Volunteer Shop CDs and Digital Media Gift Certificates Donate Tickets & Events Tickets 2025-26 Season Subscriptions Special Ticket Opportunities Group Sales Gift Certificates Search Volunteer Join the Boston Symphony Orchestra Association of Volunteers (BSAV) and share in the pride of supporting one of the world's great orchestras. Your contribution of time and skills will help keep the music alive for generations to come. Volunteer Log In The BSO has relied on the assistance of volunteers for decades, but in 1984, a group of loyal and dedicated supporters of the BSO and Tanglewood first joined forces to ensure that all aspects of the BSO's many educational, service, and fundraising initiatives were top-notch. The Boston Symphony Association of Volunteers (BSAV) currently offers a broad spectrum of programs and activities that members may participate in depending on their areas of interest. Volunteers may choose to lead tours of historic Symphony Hall or the Tanglewood grounds, participate in special fundraising events, help patrons in the Symphony Shop or Tanglewood Gift Shops, or assist children as they discover the wonders of classical music at Youth Concerts and the ever-popular Instrument Playground. To become a volunteer, email bsav@bso.org with your contact information, and if you are interested in volunteering in Boston, at Tanglewood, or both. You will be emailed information, including an application to fill out and return. Interviews for Boston volunteers are in the late fall, and interviews for Tanglewood are in early June. Volunteers are required to serve 20 hours annually, and also to be a Friend of the Boston Symphony, Pops, or Tanglewood. If you wish to volunteer but find the $150 donation a financial hardship, please contact the Volunteer Office to request assistance. Volunteers are asked to join at least one volunteer project. Full project listings are available at the following links for Boston and Tanglewood . (Not all projects currently have openings.) In appreciation of your service as a volunteer, you will receive a wide array of benefits. We believe that music belongs to everyone, and we are committed to ensuring that each person is treated with dignity and respect. All are welcome to apply to the BSAV, and part of your responsibility as a volunteer will be to help create a welcoming and inclusive environment for all. Volunteer Opportunities Boston Volunteer Projects Archives - Provide support to BSO archivists in research and organization of historical materials. Café Flowers - Arrange/assist with flower arrangements for Symphony Café and various function spaces throughout the hall. Training is provided. Community Chamber Concerts - Greet and provide information to patrons during Friday afternoon Community Chamber Concerts and/or Sunday afternoon Community Chamber Concerts. Flowers/Hall Decorating - Assist with flowers and hall decorating for the holiday season, as well as the corporate Pops fundraisers. Host - Serve as an ambassador to the BSO through greeting patrons and answering patron questions. Instrument Playground Assistants and Demonstrators - Assist with children’s activities and/or instruments for hands-on demonstrations at Youth and Family Concerts, educational events, etc. Music Library – assist our music librarians with various tasks Photography – capture images of community, donor, volunteer events for BSO use in marketing and engagement Quarter Notes - Participate in the design and production of Quarter Notes, the BSAV’s quarterly in-house newsletter. Social Engagement - assisting the BSAV in creating and executing social and educative engagement opportunities for our volunteers; Thank You Calls – assist our development team through calling donors to thank them for recent gifts Tour Guides - Lead visitors (adult and/or youth groups) on behind-the-scenes tours of Symphony Hall. Training provided. Volunteer Applications - Process and track all volunteer inquiries, applications, and interviews for Tanglewood. Volunteer Emeritus – assist BSAV staff in engaging with our retired volunteers Tanglewood Volunteer Projects Brochure Distribution - Distribute Tanglewood brochures and program information to local businesses in the areas surrounding the Berkshires. Days in the Arts (DARTS) – assist BSO education staff with their summer day-camp for Berkshire County 8th grade students Exhibit Docents – educate and assist patrons in the Tappan House about the history of Tanglewood.  Help them to engage with the exhibit, as well as provide general information and wayfinding Gift Shop - Provide sales assistance to customers and Tanglewood patrons in the gift shops. Training provided . Host - Serve as a Tanglewood ambassador through greeting and assisting patrons. Rove the lawn and assist patrons with wayfinding and questions for popular concerts. Information Table - Answer patron questions and help patrons enter to win free concert tickets prior to Shed concerts. Mobile Ticketing Assistance – assist concert-goers with accessing their mobile tickets as well as general information and wayfinding Parking Host – assist concert-goers as they arrive on the grounds with wayfinding and general information Photography – capture images of community, donor, volunteer events for BSO use in marketing and engagement Quarter Notes - Participate in the design and production of Quarter Notes, the BSAV’s quarterly in-house newsletter. Social Engagement - assisting the BSAV in creating and executing social and educative engagement opportunities for our volunteers; Tanglewood for Families – assist patrons with instrument playground activities, lawn games, crafts. and other community/family initiatives as needed Tour Guides - Lead visitors (adult and/or youth groups) on a historic walking tour of the Tanglewood grounds. Training provided. Ushers - Assist patrons in finding seats inside performance venues or on the lawn. Serve as an ambassador to the BSO by greeting and assisting patrons. Training provided. Volunteer Applications - Process and track all volunteer inquiries, applications, and interviews for Tanglewood. Volunteer Emeritus – assist BSAV staff in engaging with our retired volunteers BSAV Board Members & Staff Boston Symphony Association of Volunteers Executive Committee Members Howie Arkans, Chair Melissa Riesgo, Vice-Chair, Boston Peter Geller, Vice-Chair, Tanglewood Lisa Mafrici, Secretary Co-Chairs, Boston Carol Brown, Giovanna Franchi, Elizabeth Michalak Co-Chairs, Tanglewood Margot Lee, Susan Murawczyk, Phyllis Pollack Liaisons, Tanglewood Ushers, Norma D’Oliveira Erin Asbury, Director of Volunteer Services Contact Information Volunteer Office Symphony Hall 301 Massachusetts Avenue Boston, MA 02115 Telephone: (617) 638-9390 Email: bsav@bso.org The Volunteer Office is pleased to respond to any questions about the BSAV or becoming a BSAV member. Already a Volunteer? Visit our BSAV Online Portal! Log in Contact Boston Symphony Hall 301 Massachusetts Avenue Boston, MA 02115 Tax identification 501(c)(3): 04-2103550 Contact Us Follow us on instagram Follow us on facebook Follow us on tiktok Follow us on linkedin Follow us on youtube Main Telephone Number 617-266-1492 Ticketing and Customer Service (By Phone and Email) M-F: 10am-4pm SAT: 12:30pm-4:30pm 617-266-1200 888-266-1200 (toll-free) customerservice@bso.org Box Offices (Symphony Hall and Tanglewood) See Hours Snow Line 617-638-9495 About Visit Directions Parking Accessibility Dining & Lodging About Press Releases Staff & Leadership Jobs Archives Annual Reports Shop Concerts & Events Donate Buy Tickets BSO Subscriptions Group Sales Gift Certificates Get our newsletter E-mail address Sign Up Credits Privacy Policy Terms of Use ©2025 Sponsored by"
    },
    {
      "url": "https://tanglewoodnaturecenter.wildapricot.org/board",
      "text": "Tanglewood Nature Center & Museum - Board of Directors Home Treetop Walkway Upcoming events America/New_York Twilight at Tanglewood 20 Sep 2025 4:00 PM Tanglewood America/New_York Haunted Happenings 18 Oct 2025 11:00 AM Tanglewood Nature Center America/New_York Amazing Animals 29 Nov 2025 11:00 AM Tanglewood Menu Log in HOME Found an injured animal? Treetop Walkway About us Trail Maps Snakes and Ticks Visit Board of Directors Staff Newsletter Events Upcoming Events Twilight at Tanglewood Fundraiser Career Opportunities Volunteering and Internships Programs Program Pricing and Booking Team Building Library and Senior Center Programs Parties & Rentals Camps Membership & Support Membership Application Our Corporate Supporters Member-only Member Start-up Wish List Animal Sponsorship Donate Gift Planning Blog Posts Facility Rentals Shop Remember me Forgot password Returning Members? Click on the Icon Search Log in Remember me Forgot password HOME Found an injured animal? Treetop Walkway About us Trail Maps Snakes and Ticks Visit Board of Directors Staff Newsletter Events Upcoming Events Twilight at Tanglewood Fundraiser Career Opportunities Volunteering and Internships Programs Program Pricing and Booking Team Building Library and Senior Center Programs Parties & Rentals Camps Membership & Support Membership Application Our Corporate Supporters Member-only Member Start-up Wish List Animal Sponsorship Donate Gift Planning Blog Posts Facility Rentals Shop Board of Directors Executive Board: Scott Moore, President Dr. William Bishop, Vice President Janet Chilson, Treasurer Laurie Garner, Secretary Board of Directors Members: Irene Brookins Greg Clark Paul DiPietro Deborah Fennell Kevin Gallagher Rich Gridley Josh Latterell Tina MacRonald Richard McNeilly Kevin Orvek Angela Tufarillo Claire Warren-Ginnan Non-Board Committee Members : Gerry Caruso Cindy Hayden Donna Homuth Bob Norton Bob Recotta Amy Sarno Bonnie Schweizer Lucy Schewizer Lynn Smith Lorraine Treacy Interested in serving on our Board of Directors or on one of our Committees (see list of committees below)? Click here for BOD application and email to: tanglewooddirector@outlook.com Serving on the Board of Directors offers opportunities for expanding your network, exploring new professional skills ranging from budget management to personnel policies to investments, and ongoing professional development. Plus - it's rewarding to take a leadership role in protecting over 300 acres of land, and reaching over 35,000 people in seven counties of NY and PA! Members of our Board of Directors have the following responsibilities: attending Board Meetings, scheduled on the last Wednesday of the month at 8:00am joining and serving on at least one committee (more info below) remaining active, dues-paying members of Tanglewood, at the membership level of their choice attending the annual fundraiser, and selling tickets to their personal and professional networks advocating for the organization and being eager to talk to their friends, families, and communities about the work Tanglewood does Committees generally meet once a month for an hour, and meeting times vary depending on the schedules of the committee members.  Board members should plan for an average monthly commitment of about 2-4 hours preparing for Board meetings, reviewing minutes, and participating in committees, plus a significant annual time commitment in outreach and networking on behalf of Tanglewood - including attending and enjoying the annual fundraiser with your friends! Committees include: Fund Development, Board Development, Community Relations, Finance, Human Resources, Facilities and Trails and our Children's Trail, Twilight Fundraiser and Haunted Happenings Subcommittees. Curious about what duties a Board member has? Check out this overview from the New York State Charities Bureau : it covers questions to ask before joining, explains the legal duties of care, loyalty, and obedience, and more! 443 Coleman Ave. Elmira, NY 14903 | 9:0 0 am-4:00pm Tuesday-Friday, and Saturday 10:00am-4:00pm | (607) 732-6060 Powered by Wild Apricot Membership Software"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/about-us/",
      "text": "About Us - Tanglewood Care Services Ltd Home About Us Our Visions & Values Environmental, Social & Governance Frequently Asked Questions Our Homes Abbey Wood Lodge, Ormskirk Avocet House, Boston Beeston Rise, Beeston Bingley Park, Bingley Cedar Falls, Spalding Cloverleaf, Lincoln Holbeach Meadows, Holbeach Humberston House, Humberston Hunters Creek, Boston Lindley Park, Huddersfield Meadows Park, Louth Mount Croft, Bromsgrove Richard House, Grantham Sandpiper, Alford Sleaford Hall, Sleaford Tanglewood, Horncastle Toray Pines, Coningsby Trafford Waters, Manchester Trent Bridge, West Bridgford York Manor, York Our Care Respite Care Residential Care Dementia Care Day Care Palliative Care Nursing Care Activities Work With Us News Contact Us Team portal Contact 01205 358888 Book a viewing 01205 358888 Home About Us Our Visions & Values Environmental, Social & Governance Frequently Asked Questions Our Homes Abbey Wood Lodge, Ormskirk Avocet House, Boston Beeston Rise, Beeston Bingley Park, Bingley Cedar Falls, Spalding Cloverleaf, Lincoln Holbeach Meadows, Holbeach Humberston House, Humberston Hunters Creek, Boston Lindley Park, Huddersfield Meadows Park, Louth Mount Croft, Bromsgrove Richard House, Grantham Sandpiper, Alford Sleaford Hall, Sleaford Tanglewood, Horncastle Toray Pines, Coningsby Trafford Waters, Manchester Trent Bridge, West Bridgford York Manor, York Our Care Respite Care Residential Care Dementia Care Day Care Palliative Care Nursing Care Activities Work With Us News Contact Us About Us Tanglewood Care Homes is an award winning care home organisation. We are well established, with over 30 years of experience across Lincolnshire, Nottinghamshire, Yorkshire and beyond, and are proud of our great reputation. We offer high-quality, individualised care, with the wishes and choices of our residents at the heart of everything we do. We pride ourselves on creating friendly, homely environments where our residents can enjoy their days interacting with our caring and compassionate team members. We strive to achieve the best outcomes for our residents, and will go the extra mile to support them to continue to be as active as possible and live the most fulfilling life that they possibly can. Meet the team We aim to promote independence and choice, caring for our residents just as they wish to be cared for by building a unique care package for each and every individual. Frequently Asked Questions Our Mission Provide high quality care for our residents, in safe and comfortable surroundings, always promoting independence and choice. Give the families of our residents peace of mind, reassurance and confidence in our service. Attract and retain the best team members, giving them the skills and career pathways they deserve. Work in partnership with all external agencies, building relationships that support our visions & values. Our Vision & Values Who We Are The Tanglewood team members make our care homes into great communities. From management, to the teams in care, catering, housekeeping & laundry, maintenance, lifestyles and administration, everyone unites with the collective goal of working together to serve our residents in their home away from home. A Personal Care Plan is devised for every resident, which is individually tailored to ensure the most comfortable transition to the next chapter of their life. Environmental, Social & Governance Why Choose Us Dining Experience Catering is provided on site by our fully trained catering team members. Menus are devised with the inclusion of the residents. Alternatives are always available in addition to the daily menu. We offer snacks and drinks 24 hours a day. The dining experience is extremely important to us, and we endeavour to deliver the same high-quality, nutritional experience, irrespective of the dietary requirements for each individual. Environment We strive to maintain the highest standards of cleanliness in our homes. We have a dedicated housekeeping team who care for our environment, ensuring it is spotlessly clean and fresh, whilst ensuring we meet required infection control standards as we go. Lifestyle Our dedicated Lifestyles Coordinators create a full activity programme , including meaningful sessions created to incorporate our residents’ choices and wishes. Some may prefer group activities or events, where others may prefer some one-to-one time or a trip out. Your feedback Regular resident and relative meetings take place within the home. Your feedback is so important to us, as it enables us to maintain and enhance our standards. We listen, but most importantly, we act on the feedback we receive. © Copyright Tanglewood Care Services Ltd 2025. Website design by Vivid Imagination Privacy Policy Terms & Conditions Complaints Procedure Gender Pay Gap Report 2024 Work With Us Cookie Policy Contact Us Our Care Homes in Lincolnshire Team Portal info@twhealthcare.co.uk 01205 358888 Tanglewood Care Services Ltd, 2 Endeavour Park, Wyberton Boston PE21 7TQ Username * Password * Newsletter Sign Up Yes, I would like to have the latest news from around the Tanglewood homes delivered straight into my inbox. I agree to the privacy policy Book a viewing Name* Email* Phone* Preferred date* Preferred time* Morning Afternoon Evening Select a Care Home* Abbey Wood Lodge, Ormskirk Avocet House, Boston Beeston Rise, Beeston Bingley Park, Bradford Cedar Falls, Spalding Cloverleaf, Lincoln Holbeach Meadows, Holbeach Humberston House, Humberston Hunters Creek, Boston Meadows Park, Louth Richard House, Grantham Sandpiper, Alford Sleaford Hall Toray Pines, Coningsby Trent Bridge, West Bridgford York Manor, York Message Yes, I would like to have the latest news from around the Tanglewood homes delivered straight into my inbox. I agree to the privacy policy"
    },
    {
      "url": "https://www.apartmentsearch.com/apartments/rhode-island/coventry/tanglewood-village",
      "text": "Apartments at Tanglewood Village - Coventry Toggle navigation MENU Sign In Register Search Favorites Furnish It! Moving Resources Previous Property Tanglewood Village 47 Tanglewood Dr, Coventry, RI 02893 Claim Reward Next Property Claim Reward Tanglewood Village 47 Tanglewood Dr, Coventry, RI 02893 Results Claim Reward Need Furniture? CORT will make you Move In Ready! Select the Move In Ready package that fits your needs and get moving. Managed By: Wingate Apartment Homes Provided By: Located in the heart of West Warwick, Tanglewood Village Apartments offer the convenience of city-living while still being tucked away in a quiet, park-like setting. We are 5 minutes away from all major highways and shopping centers. Featuring recently renovated studios, one, two and three bedroom apartments* at reasonable prices. Experience apartment living on a whole new level and take a dip in the pool or break a sweat in our updated fitness center. Grab your neighbors and challenge each other to a game of tennis, pickleball, basketball or bocce ball. We have it all! Our professional on-site management team is dedicated to providing the best customer service in Rhode Island. Contact Property (401) 661-1494 tell the property you found their listing on apartmentsearch.com and get rewarded! first name last name phone number email address move date # bedrooms message I am interested in availability at Tanglewood Village i'm also interested in being contacted by cort regarding furniture rental. By checking this box, you agree to receive the information requested as well as sales and/or marketing communication related to CORT products and services that we think might interest you. You can unsubscribe from receiving communications or manage the types of communication you would like to receive by visiting our Preference Center . For further details regarding your rights and about how we process your personal information, refer to our Privacy Policy Want CORT to provide information directly to your phone? Provide consent to receive reoccurring text messages. * Create my account so I can save favorites, notes, etc. Send Message By submitting this form, you agree to CORT’s Terms and Conditions and Privacy Policy and you consent to CORT sharing your personal information with this apartment community so that you can be contacted by the apartment community and for revenue sharing purposes. CORT will not share your personal information with other apartment communities unless you request that we do so. Floorplans & Pricing Studio 1 Bed 2 Beds 3 Beds Studio Studio 1  Bath $1,297 500 sq ft 1BDHUA 1 Bed 1  Bath $1,423 600 sq ft One Bed/One Bath 1 Bed 1  Bath $1,481 600 sq ft Two Bed/One Bath 2 Beds 1  Bath Call For Pricing 960 sq ft 2BDHUA 2 Beds 1  Bath $1,584 860 sq ft Two Bed/One Bath 2 Beds 1  Bath $1,649 810 sq ft Two Bed/One Bath 2 Beds 1  Bath $1,649 860 sq ft Three Bed/Two Bath 3 Beds 2  Baths Call For Pricing 1,280 sq ft 3BDHUA 3 Beds 2  Baths $1,742 1,212 sq ft Base Rent pricing reflected only, additional fees and cost may apply. Please see Additional Fees and Policies section below. Need It Furnished? CORT can furnish this apartment and deliver your furniture in as little as 48 hours! select a lease term 12+ Months 12+ Months 6 - 11 Months 9 - 11 Months 6 - 8 Months 3 - 5 Months select a move in ready package Function $215.99 215.99 Function High in comfort and quality. Professionally curated for you to make your house feel like home. ***For Students*** 215.99 Flair This package delivers on high quality and includes a little more of what is trending, too. ***For Students*** 215.99 The Studio Our basic student package. ***For Students*** 215.99 The Urban Includes a dining table, and 2 dining chairs. ***For Students*** 215.99 The Necessities Includes a dining table, and 4 dining chairs. ***For Students*** Add Bedroom No Additional Bedrooms No Additional Bedrooms 1 Additional Bedroom 2 Additional Bedrooms 3 Additional Bedrooms 4 Additional Bedrooms 5 Additional Bedrooms 6 Additional Bedrooms select desired # of bedrooms Apartment Rent $0.00 $1,297 Studio $1,423 1 Bedroom $1,584 2 Bedrooms $1,742 3 Bedrooms Living Room Sofa Chair Cocktail Table End Table Table Lamp Bedroom Headboard Queen Mattress Set Dresser & Mirror Night Stand Table Lamp Dining Room Dining Table 4 Dining Chairs Furnished Total Per Month $0.00 Consult with a CORT Furniture Specialist ONE MOMENT PLEASE SENDING EMAIL First Name Last Name Phone Number Email Address Move Date I'm interested in room by room rental options Want CORT to provide information directly to your phone? Provide consent to receive reoccurring text messages. Preferred Contact Method Email Phone Send Message By submitting this form, you agree to receive the information requested as well as sales and/or marketing communication related to CORT products and services that we think might interest you. You can unsubscribe from receiving communications or manage the types of communication you would like to receive by visiting our Preference Center . For further details regarding your rights and about how we process your personal information, refer to our Privacy Policy 1-800-APARTMENT Furniture Without Commitment Why rent furniture? In times of transition, we all need a place to stay, a place to call home. Why hassle with buying, moving, setting up and then having to move, store, sell or discard furniture when you are done with it, when you can rent furniture from CORT? Cost-effective, convenient and hassle-free, furniture rental is the smart, flexible alternative for times of transition. Ideal Short or Long-Term Solutions Whether you’re a corporate commuter, student, stager, or serving in the military, furniture rental is an ideal solution. From several months to several years and everything in between, CORT has the lease term options you need for your stay. Convenient & Personalized Personalize your own space by choosing your furniture by the room or by the piece. With CORT's Move-In Ready packages, a trained professional will pick furniture to match your needs and budget. Seriously Hassle-Free Your prompt, professional delivery includes a complete furniture package setup down to the last pillow, lampshade, or spoon. CORT Furniture Rental provides a furnished life without compromise or commitment. Features & Description of Tanglewood Village Located in the heart of West Warwick, Tanglewood Village Apartments offer the convenience of city-living while still being tucked away in a quiet, park-like setting. We are 5 minutes away from all major highways and shopping centers. Featuring recently renovated studios, one, two and three bedroom apartments* at reasonable prices. Experience apartment living on a whole new level and take a dip in the pool or break a sweat in our updated fitness center. Grab your neighbors and challenge each other to a game of tennis, pickleball, basketball or bocce ball. We have it all! Our professional on-site management team is dedicated to providing the best customer service in Rhode Island. Terms & Fees Short Term Lease: No Pet Policy Dogs Allowed: No Restricted Breed: No Cats Allowed: No Additional Fees and Policies ApartmentSearch.com provides property listings to help you explore rental options.  Pricing as listed is provided by the property management companies and is subject to change and should be considered base rent which may not include required fees or additional costs.  These fees can include administrative, trash, pest, parking, utilities, pets, insurance, security deposits, licenses or other situational fees.  Before signing a lease, it is strongly recommend you confirm all terms, fees, policies, disclosures and conditions with the property management company to avoid surprises and make an informed decision. Neighborhood Info 22 28 More Like This Get Directions Get Directions Turn by turn directions from any starting point to Tanglewood Village ENTER STARTING ADDRESS Commute Time If you lived here, how long would it take to get to work? ENTER YOUR WORK ADDRESS My Notes You currently do not have any notes for this property New Note Save Note Notes are for personal use and will not be used by CORT or shared with apartment communities, partners, or other third parties. × View Floorplan × Contact Property ONE MOMENT PLEASE SENDING EMAIL tell the property you found their listing on apartmentsearch.com! First Name Last Name Phone Number Email Address Move Date # Bedrooms Message I found your property on ApartmentSearch.com and am interested in availability at Tanglewood Village. By submitting this form, you agree to CORT’s Terms and Conditions and Privacy Policy and you consent to CORT sharing your personal information with this apartment community so that you can be contacted by the apartment community and for revenue sharing purposes. CORT will not share your personal information with other apartment communities unless you request that we do so. Send Message i'm also interested in being contacted by cort regarding furniture rental. By checking this box, you agree to receive the information requested as well as sales and/or marketing communication related to CORT products and services that we think might interest you. You can unsubscribe from receiving communications or manage the types of communication you would like to receive by visiting our Preference Center . For further details regarding your  rights and about how we process your personal information, refer to our Privacy Policy Want CORT to provide information directly to your phone? Provide consent to receive reoccurring text messages. * Create my account so I can save favorites, notes, and Get My FREE $200 in Rewards. Contact Us Broker License Information Legal and Privacy Property Managers © 2025 CORT Business Services, Inc. All rights reserved.  Equal Housing Opportunity AUSD-AS-WEB-1 × Sign In ONE MOMENT PLEASE ATTEMPTING TO SIGN IN Email Address Password Forgot Password? Show Password Sign In Switch to Register Having Trouble? Need additional help or have questions, don't hesitate to contact us!  You can reach us at 1-800-APARTMENT or\r\n                                simply send an email to info@apartmentsearch.com and we will be glad to help. × Register ONE MOMENT PLEASE ATTEMPTING TO CREATE ACCOUNT Registration is FREE and. . . Registered Users Enjoy Many More Features First Name Last Name Email Address Password Confirm Password Register Switch to Login By registering on Apartment Search, you agree to CORT’s Terms and Conditions and Privacy Policy . Registering allows you to save favorites, notes, etc. When you like or favorite a property, you consent to CORT sharing your personal information with the apartment community you like or favorite for revenue sharing purposes. © 2025 CORT Business Services, Inc. All rights reserved. Equal Housing Opportunity Searching for your next apartment.... Psst! Don't forget to tell them ApartmentSearch.com sent you so that you! Your session has timed out, you are being signed out. OK Your Session Will Time Out In 60 Seconds. Extend Log Off"
    },
    {
      "url": "https://www.tanglewoodnaturecenter.com/staff",
      "text": "Tanglewood Nature Center & Museum - Staff Home Treetop Walkway Upcoming events America/New_York Twilight at Tanglewood 20 Sep 2025 4:00 PM Tanglewood America/New_York Haunted Happenings 18 Oct 2025 11:00 AM Tanglewood Nature Center America/New_York Amazing Animals 29 Nov 2025 11:00 AM Tanglewood Menu Log in HOME Found an injured animal? Treetop Walkway About us Trail Maps Snakes and Ticks Visit Board of Directors Staff Newsletter Events Upcoming Events Twilight at Tanglewood Fundraiser Career Opportunities Volunteering and Internships Programs Program Pricing and Booking Team Building Library and Senior Center Programs Parties & Rentals Camps Membership & Support Membership Application Our Corporate Supporters Member-only Member Start-up Wish List Animal Sponsorship Donate Gift Planning Blog Posts Facility Rentals Shop Remember me Forgot password Returning Members? Click on the Icon Search Log in Remember me Forgot password HOME Found an injured animal? Treetop Walkway About us Trail Maps Snakes and Ticks Visit Board of Directors Staff Newsletter Events Upcoming Events Twilight at Tanglewood Fundraiser Career Opportunities Volunteering and Internships Programs Program Pricing and Booking Team Building Library and Senior Center Programs Parties & Rentals Camps Membership & Support Membership Application Our Corporate Supporters Member-only Member Start-up Wish List Animal Sponsorship Donate Gift Planning Blog Posts Facility Rentals Shop Staff Elaine with Minerva (\"Mini\") the Cooper's Hawk Elaine Smith , Executive Director tanglewooddirector@outlook.com Joined us January 2003 Our Executive Director is Elaine Smith. In addition to being a bluebird expert, she is a visionary leader and has guided Tanglewood through a period of extraordinary growth. Elaine provides administrative leadership. Represents and is accountable to the Board of Directors and administers policies and procedures as set by the Board.  Leads the effort to secure financial support for programs.  Supervises Tanglewood employees and is responsible for timely completion of all reports, budgets, proposals, and other documents necessary for operation. Provides leadership in developing programs to address needs in outdoor and environmental education.  Elaine also provides leadership for Tanglewood Nature Center’s relations with government and community leaders, funding agencies, educational institutions, the media, civic and special interest groups, and the public . Deanna with Lucy, the Barred Owl Deanna O'Brian , Office Manager tanglewoodoffmgr@outlook.com Joined us February 2011 As Office Manager, Deanna oversees the daily operations and keeps us in line! She manages all financial transactions including payroll, invoicing, check and cash handling.  Maintains records of activities associated with Tanglewood, including membership, camp registrations and rentals.  She also maintains the office, gift shop and office supplies and handles routine correspondence , and is generally your best bet with any question you may have. Maggie with Zeus, the bearded dragon Maggie Groce- Volunteer Coordinator, Educator and Camp Director volunteer.tanglewood@gmail.com Joined us December 2019 Maggie came to work at Tanglewood after a position at Sea World Orlando - she traded sting rays for owls! Maggie coordinates volunteers, supervises interns, and handles the group/corporate volunteering opportunities. If you are interested in volunteering or applying for an internship, please email her! As educator, wh en she's not designing and curating STEAM and nature-based curriculum in the office, Maggie is out in the field, traveling across five counties with animal ambassadors in tow. Maggie writes curriculum in tandem with the other educators. As Camp Director, Maggie manages all aspects of our summer camps. She hires and supervises our seasonal staff and ensures that all our campers have a safe, fun, educational and nature-based summer! As educator, when she's not designing and curating STEAM and nature-based curriculum in tandem with the other educators, Maggie is out in the field, traveling across five counties with animal ambassadors in tow. Ryan, with Sophie the Great Horned Owl Ryan Donnelly- Lead Educator, Summer Camp Lead, Research Coordinator and Amphibian Curator educator.tanglewood@gmail.com Joined us August 2021 Ryan Donnelly is dedicated to fostering environmental education and research while ensuring the well-being of Tanglewood’s amphibians. As Lead Educator, Ryan develops and implements STEAM and FOSS curricula, teaching students of all ages across the Twin Tiers and Finger Lakes. He designs new educational programs, enhances existing curricula, and supports local after-school programs. Additionally, Ryan serves as a resource for environmental information and coordinates guest speakers for community events. Ryan facilitates research efforts at Tanglewood, acting as the primary contact for scientific inquiries and projects. He ensures that Tanglewood’s conservation practices align with the best strategies to support local wildlife, specializing in the study of wild plants and animals. He collaborates with the Summer Camp Director to develop engaging camp curricula and coordinate weekly activities, ensuring an enriching experience for campers. Ryan is also responsible for the care and well-being of Tanglewood’s amphibians, maintaining their habitats and overseeing their health."
    },
    {
      "url": "https://thedyrt.com/camping/florida/tanglewood-village-vero",
      "text": "Tanglewood Village Co-Op 55+ Camping | Vero Beach, Florida Find Camping Create a Dyrt Alert Unlock PRO Benefits List Your Property More Join Sign In Find Camping More Review a Campground Add a Location Gift Cards Contests Magazine Advertise About Us Press Careers Support Near Me Open in App Find Camping Create a Dyrt Alert Unlock PRO Benefits List Your Property Camping Florida Vero Beach, FL Tanglewood Village Co-Op 55+ Contact Campground Photos About Location Site Types Features Reviews Contact Get the App View Photos Roads Nature Buildings Facilities Unlock Planning Tools in App Save Add Review Share Location Established Camping Tanglewood Village Co-Op 55+ 2 Reviews Do you own or manage this property? Claim Your Listing CAMPER SUMMARY PRESENTED BY Tanglewood Village Co-Op 55+ is located near Vero Beach, Florida. The area features flat terrain with nearby beaches and coastal landscapes. Campers can explore attractions such as the McKee Botanical Garden and the Vero Beach Museum of Art, with temperatures typically ranging from 60°F in winter to 90°F in summer. Description RV sites offer full hooks ups with 30/ 50 amp electric. Sorry, self contained units only- maximum two vehicles per site-Tow vehicles limited to 6,500 lbs\r\nWe are an age restricted community, one occupant must be 55 years of age.\r\nGrand children are welcome to visit, but limited to a 2 week stay. Most pets welcome. Many of our grass sites back onto 300 acre nature preserve, you'll get to see lots of our indigenous animals from eagles to the elusive Florida panther. Walk our nature trail, take part in our seasonal activities, or simply relax in our heated pool Pad sites offer more space paved RV pad and patio. A one block walk brings you to South Vero Mall with a supermarket, bank, places to eat and a public bus stop. Catch one of Indian River County's free buses to explore from the ocean and beach to the Indian River Mall\r\nFrom the the stars to the sea there's a wealth of opportunities to enjoy winter where the tropics begin. Our Community borders on a 300 acre nature preserve, is close to the Indian River and Atlantic ocean. Eagles, egrets,herons, raccoons,armadillos, squirrels and ducks visit our lake. Bobcats and the illusive Florida panther make occasional appearances, Manatees and dolphins swim the Indian river. Want to interact with nature in a more rigorous way? Canoe, kayak rentals, fishing charters, boat ramps - are nearby. Book an airboat ride or seat on a nature tour of Indian River lagoon from Harbor Branch Oceanographic Institute, visit the Manatee Observation Center. Disney World, Sea World and Universal Studios are a little over 100 miles away. NASA's Cape Kennedy with rockets on display and a great museum  less than 90 miles. The Florida Keys are less than 200 miles away. A one block walk brings you to South Vero Mall with banks, a supermarket, places to dine and a public bus stop. Beach's, boardwalks and boat ramps are less than 5 miles away, the river less than a mile. Spend a lazy winter day walking around Vero Beach. Swim or laze in our heated pool, watch clouds waft across a tropical sky. Work on your suntan or sit in the shade of the pool deck umbrellas. Use the free WIFI or borrow a book from the library in the clubhouse. Read More Suggest an Edit Location Tanglewood Village Co-Op 55+ is located in Florida Directions Located 10 miles from Sebastian and 15 milesfrom Ft Pierce. From I-95 take the Vero Beach Exit (Exit 147) and go east to light at 82nd Ave. Turn R (S) onto 9th St/Oslo Rd and go to flashing light at end of the road. Turn L (E) and continue on to the light at US Hwy 1. Turn R (S) into the far left lane and take an immediate L turn (E) into the park. Copy Directions Address 1060 S US Hwy 1 Vero Beach , FL 32962 Copy Address Coordinates 27.58439687 N 80.3763114 W Copy Coordinates Open in Google Maps The Dyrt Alerts Get reservations at sold-out campgrounds. Learn More Presented by Detours Nearby LOCAL FAVORITES PRESENTED BY McCarthy Ranch Preserve 32 min away Bohemian Freedom Ranch 52 min away Drive Time Presented by 20 min from Sebastian 24 min from Port St. Lucie 1 hr 27 min from Sebring 1 hr 36 min from Orlando Try Drive Time in App Access Drive-In Park next to your site Connectivity Presented by T-Mobile is introducing T-Satellite to extend coverage in the outdoors Learn More T-Mobile 5G Excellent Coverage Verizon 5G Good Coverage Verified by 1 user AT&T 5G Good Coverage Site Types Tent Sites RV Sites Features For Campers Trash Picnic Table Phone Service Reservable WiFi Showers Drinking Water Electric Hookups Toilets Alcohol Pets Fires For Vehicles Sanitary Dump Sewer Hookups Water Hookups Pull-Through Sites 50 Amp Hookups Big Rig Friendly Contact General Info +17725679173 Visit Website tanglewoodvero@gmail.com 2025 Detourist Giveaway Presented by Review Campgrounds. Win Prizes. Enter to Win Enter to Win Reviews Add Review 5 Stars 4 Stars 3 Stars 2 Stars 1 Star 0% 50% 50% 0% 0% 3.5 out of 5 2 Reviews John R. Legend Reviewed Jul. 26, 2021 Good camping right in Vero It’s a nice area. The residents did not seem too keen on temporary campers. But they have some amenities available including a pool. Month of Visit July (13) View All Share Report Mike  Y. Ranger Reviewed Aug. 1, 2020 55 + Never stayed here but visited the location for my sister. Clean park is definitely geared for the over 55 crowd. Close to major hwy so road noise. Staff was friendly answered all my questions.  Did not see this as a weekend retreat as long term residents make your feel uncomfortable. Share Report Showing results 1- 2 of 2 reviews For information regarding reservations, contact this campground directly. The Dyrt Alerts Get reservations at sold-out campgrounds. Learn More Presented by Contact General Info +17725679173 Visit Website tanglewoodvero@gmail.com Detours Nearby LOCAL FAVORITES PRESENTED BY McCarthy Ranch Preserve 32 min away Bohemian Freedom Ranch 52 min away Drive Time Presented by 20 min from Sebastian 24 min from Port St. Lucie 1 hr 27 min from Sebring 1 hr 36 min from Orlando Try Drive Time in App Find popular camping nearby Road Runner Travel Resort Fort Pierce , Florida 10 Reviews 21 Photos Fort Pierce-Port St. Lucie KOA Fort Pierce , Florida 9 Reviews 16 Photos Causeway Cove Marina and RV Park Fort Pierce , Florida 5 Reviews 9 Photos Instant Book Vero Beach Equestrian Club Sebastian , Florida 1 Review 9 Photos Treasure Coast RV Park Fort Pierce , Florida 7 Reviews 21 Photos Fort Pierce West KOA Fort Pierce , Florida 2 Reviews 7 Photos Vero Beach Kamp Sebastian , Florida 15 Reviews 58 Photos Sandhill Shores Fort Pierce , Florida 1 Review 7 Photos Savannas Recreation Area Fort Pierce , Florida 9 Reviews 33 Photos Easy Livin' RV Park Fort Pierce , Florida 4 Reviews 9 Photos Frequently Asked Questions Does Tanglewood Village Co-Op 55+ have RV hookups? According to TheDyrt.com, Tanglewood Village Co-Op 55+ has 50 amp electric hookups, water hookups and sewer hookups. What is the elevation of Tanglewood Village Co-Op 55+? Tanglewood Village Co-Op 55+ is located at 8 feet. What is the max vehicle length at Tanglewood Village Co-Op 55+? Tanglewood Village Co-Op 55+ allows vehicles up to 40 feet. Are fires allowed at Tanglewood Village Co-Op 55+? Yes, according to campers on TheDyrt.com, fires are allowed at Tanglewood Village Co-Op 55+, although make sure to check current fire restrictions in the area. Does Tanglewood Village Co-Op 55+ have wifi? Yes, according to campers on TheDyrt.com, Tanglewood Village Co-Op 55+ does have wifi. Is there cell phone reception at Tanglewood Village Co-Op 55+? According to campers on TheDyrt.com, there is good coverage for AT&T, excellent coverage for T-Mobile, and good coverage for Verizon. Keep Exploring Popular camping destinations near Vero Beach, FL Port St. Lucie, FL (25 miles) Vero Beach, FL (0.0 miles) Fort Pierce, FL (15 miles) Palm Bay, FL (28 miles) Jensen Beach, FL (30 miles) Sebastian, FL (11 miles) Melbourne, FL (36 miles) Jupiter, FL (53 miles) Got the top ranked camping app? Download The Dyrt app now 4.8 129k ratings Explore Review a Campground Add a Location Gift Cards Contests Magazine Meet The Dyrt List Your Property Advertise About Us Press Careers Support The Dyrt is the only camping app that has it all: State and National Park campgrounds, RV parks, glamping, and free campsites. © 2025 The Dyrt, Inc | All rights reserved Contest Rules Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.allstays.com/Campgrounds-details/17903.htm",
      "text": "Tanglewood Village | Near Vero Beach Florida Toggle navigation ALLSTAYS Camping Rooms Drivers Apps Tips Pro Sign In Sign Up Camping > FL > Vero Beach Campgrounds Tanglewood Village Details - Map - Reviews - Nearest - Legend Campground Address: 1060 S US Hwy 1 , Vero Beach FL 32962 Campground Directions: From I-95 Exit 147 and go E to 82nd Ave. Turn S onto 9th St/Oslo Rd and go to light at end of the road. Turn L and continue on to US Hwy 1. Turn S and into the far L lane and take an immediate L turn into park Campground Details: $$$$, 28 sites, All Year, Self-Contained Units-RVs Only, Age Restricted (55+), No tent, 40 ft max RV length, 7 ft elev, Accepts Big Rigs, pull thrus, 28 full hookups, electric, 30/50 amp, 28 amp sites, tables, water, Clubs-ESC, laundry, internet, cable tv, pet friendly, pool, (C) Advertise Website 772-567-9173 View Map Reviews Photo Search* Add Review Navigation* Update Info StreetView* *Depending on the location, some of these buttons may not work properly. Campground Reviews: Nearest Campgrounds: by straight line GPS/air Road Runner Travel Resort Campground - 6.71 mi / 10.80 km KOA Journey Fort Pierce - 8.44 mi / 13.59 km Lakewood Village RV Resort - 8.91 mi / 14.34 km Causeway Cove Marina - 9.41 mi / 15.14 km Treasure Coast RV Park - 11.46 mi / 18.44 km KOA Holiday Fort Pierce West - 12.08 mi / 19.44 km Sunnier Palms Nudist - 12.10 mi / 19.47 km Add A Campground Listings are free. Map All Florida Campgrounds From there you can filter by type and amenity. Or find truck stops, store parking, RV dumps and services. Advertise More Florida List Florida campgrounds Map All Florida campgrounds Map Towns with camping nearby Map Florida Public lands Map Florida State Parks Map Florida Forest Camps Map Florida Tent Camping Map Florida KOA Campgrounds Plus: Map Florida Truck Stops Florida Walmarts Free Florida Travel Planner Free travel information from the official state tourist bureau. www.florida... Advertise Featured Apps Camp & RV The number one camping app. From resorts to hike-in spots. Amenities, maps, truck stops, rest areas, Wal-mart and casino parking, RV dealers, sporting goods stores and much more. Two modes: one uses GPS and maps that you can filter. One is an offline manual lookup mode for when you don't have service. Truck and Travel The number one trucker app. If you drive a big rig, you need this app. If you just drive on road trips in a car and prefer making your stops count, you'll love this app. Amenities, maps, truck stops, rest areas, Wal-mart, truck dealers, clean outs and much more. Two modes: one uses GPS and maps that you can filter. One is an offline manual lookup mode for when you don't have service. Advertise Rate Ranges $  1-11   = $ $12-20  = $$ $21-30  = $$$ $31-40  = $$$$ $41+up = $$$$$ more abbreviations Advertise AllStays Pro Online Sign up for more pure information, faster, no ads, privacy, full screen maps, more filters, layers for traffic, biking, transit, over half a million search combinations. Join now More Guides Finding North Without a Compass Use Your Watch As Compass How Old Are My RV Tires? Avoiding Sunburns On Hikes Tent Rocks Spectacular Views Death in Death Valley Do We Need Physical Maps Now? 4X4 RVs: Wandering Off Road Cell Phone Dangers in the Wild Dogs In National Forests Cost of Renting an RV RV Tips for Beginners Best California Beaches North RVs Without Warranty Bug and Mice Control in RV Dry Camping Basics Dangerous RV Signs RV LED Lights Gun Laws and RV Travel Guide Is Wal_Mart Overnight Parking Safe? ⇑ Top More about AllStays Home Affiliate Contact Us Support - Legend Site Map Privacy Policy Terms Cookie Settings Jobs Connect Facebook Advertising Add A Campground Add A Room Add A Truck Stop Add Other Places AllStays Classic Guides Hotels By Chain Luxury Hotels Spa Resorts Eco & Green B & Bs Haunted Hotels Extended Stays Real Suites Pet Friendly Yoga Retreats Ski Resorts Road Guides Copyright ©\n2000-2025 AllStays LLC"
    },
    {
      "url": "https://www.tanglewoodgroup.co.uk/contact",
      "text": "Contact Tanglewood Group | Reach Out to Our Team Home About Us What we do Uncrewed Systems News Contact Us Call Us Contact Tanglewood Group We value your interest in Tanglewood Group. Whether you have questions about our products, services, or manpower solutions, our team is here to assist you. Contact Tanglewood Group We value your interest in Tanglewood Group. Whether you have questions about our products, services, or manpower solutions, our team is here to assist you. Learn more Call Us +44 (0)1684 550577 Find Us Tanglewood Group Ltd, Malvern Hills Science Park, Geraldine Road, Malvern, WR14 3SZ Email Us info@tanglewoodgroup.co.uk Get in touch Please fill out the form below, and a member of our team will respond as soon as possible. Name Email Address Your Message I hereby agree that this data will be stored and processed for the purpose of establishing contact. I am aware that I can revoke my consent at any time.* Here at Tanglewood Group Ltd we take your privacy seriously and only use your personal information to administer the services you have requested from us. By providing your details above you agree to be contacted by us via phone or email. We treat your data with respect and will not share your details with any 3rd party. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Tanglewood Group Home About What We Do Uncrewed Systems News Contact Us Contact us Call Email Visit Follow our journey Privacy Policy Carbon Reduction Plan Website Designed By Design in the Shires"
    },
    {
      "url": "https://www.tanglewoodcarehomes.co.uk/contact-us/",
      "text": "Contact Us - Tanglewood Care Services Ltd Home About Us Our Visions & Values Environmental, Social & Governance Frequently Asked Questions Our Homes Abbey Wood Lodge, Ormskirk Avocet House, Boston Beeston Rise, Beeston Bingley Park, Bingley Cedar Falls, Spalding Cloverleaf, Lincoln Holbeach Meadows, Holbeach Humberston House, Humberston Hunters Creek, Boston Lindley Park, Huddersfield Meadows Park, Louth Mount Croft, Bromsgrove Richard House, Grantham Sandpiper, Alford Sleaford Hall, Sleaford Tanglewood, Horncastle Toray Pines, Coningsby Trafford Waters, Manchester Trent Bridge, West Bridgford York Manor, York Our Care Respite Care Residential Care Dementia Care Day Care Palliative Care Nursing Care Activities Work With Us News Contact Us Team portal Contact 01205 358888 Book a viewing 01205 358888 Home About Us Our Visions & Values Environmental, Social & Governance Frequently Asked Questions Our Homes Abbey Wood Lodge, Ormskirk Avocet House, Boston Beeston Rise, Beeston Bingley Park, Bingley Cedar Falls, Spalding Cloverleaf, Lincoln Holbeach Meadows, Holbeach Humberston House, Humberston Hunters Creek, Boston Lindley Park, Huddersfield Meadows Park, Louth Mount Croft, Bromsgrove Richard House, Grantham Sandpiper, Alford Sleaford Hall, Sleaford Tanglewood, Horncastle Toray Pines, Coningsby Trafford Waters, Manchester Trent Bridge, West Bridgford York Manor, York Our Care Respite Care Residential Care Dementia Care Day Care Palliative Care Nursing Care Activities Work With Us News Contact Us Get In Touch Our Homes Abbey Wood Lodge, Ormskirk 01695 767778 info@twhealthcare.co.uk Avocet House, Boston 01205 336897 info@twhealthcare.co.uk Beeston Rise, Beeston 01157 044775 info@twhealthcare.co.uk Bingley Park, Bradford 01274 056015 info@twhealthcare.co.uk Cedar Falls, Spalding 01775 713233 info@twhealthcare.co.uk Cloverleaf, Lincoln 01522 440510 info@twhealthcare.co.uk Holbeach Meadows, Holbeach 01406 431222 info@twhealthcare.co.uk Humberston House, Humberston 01472 483216 info@twhealthcare.co.uk Hunters Creek, Boston 01205 358034 info@twhealthcare.co.uk Lindley Park, Huddersfield 01484 262026 info@twhealthcare.co.uk Meadows Park, Louth 01507 304344 info@twhealthcare.co.uk Mount Croft, Bromsgrove 01527 433539 info@twhealthcare.co.uk Richard House, Grantham 01476 855705 info@twhealthcare.co.uk Sandpiper, Alford 01507 462112 info@twhealthcare.co.uk Sleaford Hall 01529 543160 info@twhealthcare.co.uk Tanglewood, Horncastle 01507 527265 info@twhealthcare.co.uk Toray Pines, Coningsby 01526 344361 info@twhealthcare.co.uk Trafford Waters, Manchester 01613 598856 info@twhealthcare.co.uk Trent Bridge, West Bridgford 01157 042125 info@twhealthcare.co.uk York Manor, York 01904 202825 info@twhealthcare.co.uk Contact Us We look forward to hearing your general enquiries and will be in touch as soon as possible! For more information about vacancies, click here . Your Name* Email* Phone* Message Yes, I would like to have the latest news from around the Tanglewood homes delivered straight into my inbox. I agree to the privacy policy Tanglewood Care Home Search Your location Search radius 10 mi 25 mi 50 mi 100 mi 200 mi 500 mi Results 25 50 75 100 Meet Our Team Daniel Rowark- Donowa CEO With 25 years in social care and positively challenging the idea of what a care home is, Daniel aims to get to know each and every resident, their families and friends, to create a home that truly embraces the ideas, thoughts, feelings and wishes of everyone who lives there. Mark McDonald Chief Operating Officer With extensive experience working in senior roles across social care, Mark embraces the opportunity to make a meaningful difference to all the team members he works alongside to create teams with a shared passion for high-quality care. Adele Gavaghan Director of Regulation With over a decade in the care sector, Adele has risen from care assistant to Home Manager, before pursuing a regulatory career with CQC. Her personal experience with dementia fuels her passion for dementia care, end-of-life care, and workforce wellbeing. She is dedicated to creating a unique resident experience and challenging care norms with her team. Claire Rudd Learning and Development Manager Claire has 30 years of experience in Health and Social Care, including roles as a Care Manager. She is passionate about learning and development, believing that a well-trained team is the key to delivering excellent care. Outside of work, Claire enjoys spending time at the coast with her two Patterdale Terriers, Luna and Eddie, and her partner. Mark Newton Regional Quality Support Manager Mark started his care career at a very early age as a young carer for multiple family members from the age of 9. Later Mark went on to work in multiple settings in different roles within the care sector. Mark's passion is person-centred care for all residents and aims to make all including residents, relatives and team members feel truly valued daily. Katie More Regional Quality Support Manager Katie joined Tanglewood in 2017 and became Cloverleaf's home manager in December 2020. With 12 years of experience in health and social care, including nine in leadership, she has completed NVQ levels 2, 3, 5, and a DipHE in Social Sciences. Katie focuses on a person-centred approach, aiming to create a warm, welcoming community for all residents. © Copyright Tanglewood Care Services Ltd 2025. Website design by Vivid Imagination Privacy Policy Terms & Conditions Complaints Procedure Gender Pay Gap Report 2024 Work With Us Cookie Policy Contact Us Our Care Homes in Lincolnshire Team Portal info@twhealthcare.co.uk 01205 358888 Tanglewood Care Services Ltd, 2 Endeavour Park, Wyberton Boston PE21 7TQ Username * Password * Newsletter Sign Up Yes, I would like to have the latest news from around the Tanglewood homes delivered straight into my inbox. I agree to the privacy policy Book a viewing Name* Email* Phone* Preferred date* Preferred time* Morning Afternoon Evening Select a Care Home* Abbey Wood Lodge, Ormskirk Avocet House, Boston Beeston Rise, Beeston Bingley Park, Bradford Cedar Falls, Spalding Cloverleaf, Lincoln Holbeach Meadows, Holbeach Humberston House, Humberston Hunters Creek, Boston Meadows Park, Louth Richard House, Grantham Sandpiper, Alford Sleaford Hall Toray Pines, Coningsby Trent Bridge, West Bridgford York Manor, York Message Yes, I would like to have the latest news from around the Tanglewood homes delivered straight into my inbox. I agree to the privacy policy"
    },
    {
      "url": "https://www.tanglewoodhomes.org/board-staff",
      "text": "Board and Staff | Tanglewood top of page Tanglewood Homes Association HOME GENERAL INFO Dues and Fees Garbage Collection Helpful Numbers Map Tanglewood Garden Club THA, Inc. vs. WMJK, Ltd THA, Inc. vs. WMJK, Ltd (2) THA, Inc. vs. WMJK, Ltd (3) WMJK, Ltd - Judgement 10/24/22 Brief of Appellant 2025 Annual Budget BOARD OF DIRECTORS Board and Staff Monthly Meetings Meeting Minutes Board Nominees Past Board Members PATROL CONSTRUCTION General Rules and Regulations Builders Deposit Agreement Tree Policy DEED RESTRICTIONS History Reservations, Restrictions and Covenants 1997 Policy Manual Policy Manual Supplements 2002 Deed Restriction Amendments 2018 Deed Restriction Amendments Generator Policy Miscellaneous Policy Provisions Miscellaneous Policy Provisions II More Use tab to navigate through the menu items. BOARD & STAFF The affairs of the Tanglewood Homes Association (\"THA\") is governed by a Board of Directors. Each Director must be a member, property owner, of Tanglewood. The Board of Directors is comprised of nine (9) members. A class of three (3) new Directors are elected to the Board each year serving a three-year (3) term. 2025 Board of Directors ​ Paige Cokinos-President Richard Anderson Linda Burdine Dion Cornett Steven Cope Laura Kelsey David Peterman George Robertson George Smith Officers Paige Cokinos President Steven Cope Vice President of Finance and Treasurer ​ Richard Anderson Vice President of Risk Management and Secretary (Legal/Insurance) Laura Kelsey Vice President of Compliance (Deed Restrictions) ​ David Peterman Vice President of Operations (Grounds/Garbage/Security) ​ ​ Finance Committee Richard Anderson Steven Cope David Peterman Staff Steven Boyd General Manager stevenboyd@tanglewoodhomes.org Margie Prather Administrative Assistant margieprather@tanglewoodhomes.org Taylor Neeb Maintenance Craig Frazzini Patrol Supervisor cbfrazzini@gmail.com ﻿﻿© 2023 Tanglewood Homes Association, Inc. bottom of page"
    }
  ]
}