{
  "fuentes": [
    {
      "url": "https://www.tavareschamber.com/about-us",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/member/newmemberapp",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "email": "22chamber@lexingtonchamber.net"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "email": "chamber@lexingtonchamber.net"
    },
    {
      "url": "https://www.renfrewshirechamber.com/about/contact/",
      "email": "info@renfrewshirechamber.com"
    },
    {
      "url": "https://tavareschamber.com/list/member/customer-driven-staffing-tavares-5379",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/info",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://news.cornell.edu/stories/2024/09/tavares-lead-cornells-office-community-relations",
      "email": "cunews@cornell.edu"
    },
    {
      "url": "https://news.cornell.edu/stories/2024/09/tavares-lead-cornells-office-community-relations",
      "email": "rv234@cornell.edu"
    },
    {
      "url": "https://news.cornell.edu/stories/2024/09/tavares-lead-cornells-office-community-relations",
      "email": "tjf85@cornell.edu"
    },
    {
      "url": "https://tompkinsweekly.com/articles/chamber-ceo-tavares-tapped-to-lead-cornells-community-relations/",
      "email": "your@address.com"
    },
    {
      "url": "https://moscowchamber.com/contact/",
      "email": "director@moscowchamber.com"
    },
    {
      "url": "https://moscowchamber.com/contact/",
      "email": "info@moscowchamber.com"
    },
    {
      "url": "https://moscowchamber.com/contact/",
      "email": "marketing@moscowchamber.com"
    },
    {
      "url": "https://moscowchamber.com/contact/",
      "email": "staff@moscowchamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/list/member/trubey-auto-repair-inc-tavares-4383",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/directory",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/list/member/customer-driven-staffing-5379",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/leadership-team",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/list/member/ernie-morris-enterprises-772",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/events/details/monthly-chamber-business-luncheon-01-22-2020-114",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/events/details/monthly-chamber-business-luncheon-01-22-2020-114",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.tavareschamber.com/contact",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "http://www.tavareschamber.com/board-of-directors",
      "email": "director@tavareschamber.com"
    },
    {
      "url": "https://www.britcham.com/committees/get-involved",
      "email": "contact@britcham.com"
    },
    {
      "url": "https://www.britcham.com/committees/get-involved",
      "email": "glueup-logo-white@2x.png"
    },
    {
      "url": "https://www.britcham.com/committees/get-involved",
      "email": "roberta@britcham.com"
    },
    {
      "url": "https://www.mountdora.com/list/member/tavares-chamber-of-commerce-452",
      "email": "admin@mountdora.com"
    }
  ],
  "mails": [
    "22chamber@lexingtonchamber.net",
    "admin@mountdora.com",
    "chamber@lexingtonchamber.net",
    "contact@britcham.com",
    "cunews@cornell.edu",
    "director@moscowchamber.com",
    "director@tavareschamber.com",
    "glueup-logo-white@2x.png",
    "info@moscowchamber.com",
    "info@renfrewshirechamber.com",
    "marketing@moscowchamber.com",
    "roberta@britcham.com",
    "rv234@cornell.edu",
    "staff@moscowchamber.com",
    "tjf85@cornell.edu",
    "your@address.com"
  ],
  "nombre_sitio": "tavareschamber.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tavareschamber.com/about-us",
      "text": "About Us - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. About  The City of Tavares The City of Tavares has served as the County's Seat for Lake County Florida, since 1888. Downtown Tavares, w hich lies on the shor es of Lake Dora, has that small town charm and feel, which is lacking in most cities. The picturesque Wooton Park sits only one block from Main Street and offer families everything from picnic pavilions to boat ramps. Tavares is also home to the Dora Canal, known as one of the most beautiful waterways in the world. Tavares has always been a central location. Geographically, the town sits midway on the Florida Peninsula and Native tribes found its highlands overlooking the lakes to be a safe location away from the storms coming from the coast. Later, the town became a transportation center, but it was travel by boat that brought in the first settlers, as the City is connected by a navigable waterway system to the Atlantic Ocean, via the Ocklawaha and the St. Johns’ River. However, it was the train that populated Lake County. Conveniently located northwest of Orlando, Tavares saw a major line entering from the south. Another line from Jacksonville entered from the north, from Eustis. A line through Mount Dora led to Sanford and a line west extended to a rail hub in Wildwood. Back in the 19th century, Major St. Clair Abrams began implementing a vision for Tavares. He not only oversaw the development of the hub of rail lines converging in Tavares, he saw the future capital of the state waiting to be realized. Had it not been for an inadvertent fire 125 years ago, the major’s vision of Tavares being the state capital may have become reality. The spark from a train ignited the adjacent lumberyard in the downtown, destroying three dozen buildings in a matter of minutes. That same year, the Florida legislature removed Tavares from consideration as a potential new center of state government. Although the times have changed, one factor remains a constant for Tavares. It is the center of government for Lake County and it is, therefore, Lake County’s Capital City.  A partnership has evolved through the years between Lake County’s Board of County Commissioners and the Tavares City Council.  The two elected bodies work together to make downtown Tavares a supportive home for the civic activities of Lake County. Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/member/newmemberapp",
      "text": "Member - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Member Application The Tavares Chamber of Commerce is an active and varied collection of businesses in the community who all want to grow and succeed together. We welcome all professionals and individuals who are interested in growing their business, circle of influence, and helping our community. We have many member benefits including three monthly networking events, an interactive website, and member to member referrals/promotions. We also do many special events throughout the year that provide quality of life, entertainment, and opportunity to promote your own business. Step 1: Member Info Step 2: Additional Info Step 3: Primary Contact Step 4: Billing Contact Step 5: Membership Options Step 1: Member Info Company Name * Please add your company name. Leave Blank Phone * Please add your company phone number. Website Email * Please add a valid email. Physical Address Address line 1 Address line 2 Country Choose... Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Bulgaria Cambodia Cameroon Canada Caribbean Chile China Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czechia Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Ghana Greece Greenland Guatemala Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Laos Latin America Latvia Liechtenstein Lithuania Luxembourg Macao SAR Macedonia, FYRO Malaysia Maldives Mali Malta Mexico Moldova Monaco Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa Spain Sri Lanka Sweden Switzerland Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Türkiye Turkmenistan Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Venezuela Vietnam World Yemen City State Choose... Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Federated States of Micronesia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Marshall Islands Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Palau Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virgin Islands Virginia Washington West Virginia Wisconsin Wyoming State Choose... Alberta British Columbia Manitoba New Brunswick Newfoundland and Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Quebec Saskatchewan Yukon State Postal Code Mailing Address Same as physical address Address line 1 * Please add your address. Address line 2 Country * Choose... Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Bulgaria Cambodia Cameroon Canada Caribbean Chile China Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czechia Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Ghana Greece Greenland Guatemala Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Laos Latin America Latvia Liechtenstein Lithuania Luxembourg Macao SAR Macedonia, FYRO Malaysia Maldives Mali Malta Mexico Moldova Monaco Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa Spain Sri Lanka Sweden Switzerland Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Türkiye Turkmenistan Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Venezuela Vietnam World Yemen Please add your country. City * Please add your City. State * Choose... Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Federated States of Micronesia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Marshall Islands Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Palau Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virgin Islands Virginia Washington West Virginia Wisconsin Wyoming Please add your State. State Choose... Alberta British Columbia Manitoba New Brunswick Newfoundland and Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Quebec Saskatchewan Yukon State * Please add your State. Postal Code * Please add your Postal Code. Step 2: Additional Info Business Description (200 char max) * Please add your company description. Business Keywords * (enter a space between words) Please add your business keywords. Directory Category * Choose... ACCOUNTING SERVICES ADVERTISING AIR CONDITIONING - HEATING ALUMINUM ANTIQUES AND ART APARTMENT AQUARIUM SALES & SERVICE ATTORNEY AUTO DEALER AUTO PARTS & REPAIR AWARDS BAIL BONDS BANK BANQUET FACILITY BED AND BREAKFAST BOATING - TOURS -MARINA BUILDER CAMPING CATERING CEMETERY CHAMBER OF COMMERCE CHIROPRACTOR CHURCH CIVIL ENGINEERING CLEANING SERVICES COLLECTION AGENCYS COMMUNICATIONS COMPUTER AND PRINTER SUPPLIES COMPUTER SERVICES COMPUTER SOFTWARE CONSULTANT &  SERVICES CONFERENCE - FACILITY SPACE CONSTRUCTION CONTRACTOR CONVENIENCE STORE COSMETIC &  PLASTIC SURGERY CREMATION SERVICES DANCE INSTRUCTION DENTIST DERMATOLOGY DEVELOPER DRAFTING EDUCATION ELDERLY SERVICES EMPLOYEE BENEFITS ENGINEERING CONSULTANT ENTERTAINMENT ENVIRONMENTAL EVALUATION EVENT PLANNER FINANCIAL SERVICES FIRE EQUIPMENT FLOOR COVERING FLORIST FOOD SERVICE SUPPLIES FUNERAL HOME GOLF & COUNTRY CLUB GOVERNMENT GRAPHIC DESIGN HAIR SALON HANDYMAN HEALTH & WELLNESS HOME DESIGN HOTELS AND LODGING IDENTITY THEFT INDEPENDENT &  ASSISTED LIVING INDIVIDUAL INDOOR AIR QUALITY INDUSTRIAL INSURANCE INTERNET & WEB DESIGN JANITORIAL SUPPLIES LAND SURVEYOR LANDSCAPE & YARD MAINTENANCE LAW ENFORCEMENT LEASING LEGAL PLANS LIFE COACHING MAGAZINE MAIL SERVICES MANUFACTURER MARKETING MEDIA MEDICAL MEDICAL EQUIPMENT MERCHANT SERVICES MINORITY OWNED MOBILE HOME &  RV PARK MORTGAGE BROKER/BANKER NEWSPAPER NON PROFIT OFFICE SUPPLIES ORGANIZATION OUTDOOR ADVERTISING PERFORMING ARTS PEST CONTROL PET SERVICES PHOTOGRAPHY PHYSICIAN PLUMBING PRINTING & COPYING SERVICES PROFESSIONAL SERVICES PROMOTIONAL PRODUCTS PROPERTY LEASING & INVESTOR PUBLISHING REAL ESTATE REHABILITATION RENTALS RESORT RESTAURANT RETAIL ROOFING SECURITY SENIOR COMMUNITY SIGNS SOCIAL SERVICE SPA SERVICES & SKIN CARE SPORTS STORAGE STREET VENDOR TAX SERVICES TECHNOLOGY TELECOMMUNICATION TOURS & TOURISM TRANSPORTATION UTILITY VETERAN OWNED VETERINARY VIDEOGRAPHY VOLUNTEER WINDOW TINTING WINE SHOP &  WINERY WOMAN OWNED Please select a directory category. Full-time Employees Part-time Employees Step 3: Primary Contact First Name * Please add your first name. Last Name * Please add your last name. Title Phone * Please add your phone number. Cell Phone Fax Email * Please add a valid email. Contact Preference Email Phone Address Same as Address in Step 1 Address line 1 * Please add your address. Address line 2 Country * Choose... Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Bulgaria Cambodia Cameroon Canada Caribbean Chile China Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czechia Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Ghana Greece Greenland Guatemala Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Laos Latin America Latvia Liechtenstein Lithuania Luxembourg Macao SAR Macedonia, FYRO Malaysia Maldives Mali Malta Mexico Moldova Monaco Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa Spain Sri Lanka Sweden Switzerland Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Türkiye Turkmenistan Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Venezuela Vietnam World Yemen Please add your country. City * Please add your City. State * Choose... Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Federated States of Micronesia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Marshall Islands Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Palau Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virgin Islands Virginia Washington West Virginia Wisconsin Wyoming Please add your State. State Choose... Alberta British Columbia Manitoba New Brunswick Newfoundland and Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Quebec Saskatchewan Yukon State * Please add your State. Postal Code * Please add your Postal Code. Social Network Addresses LinkedIn Facebook Create Account This Login is already in use Login * Please add your login username. Password * Please add your login password. Step 4: Billing Contact Same as Primary Contact First Name * Please add your first name. Last Name * Please add your last name. Title Phone * Please add your phone number. Cell Phone Fax Email * Please add a valid email. Contact Preference Email Phone Address Same as Primary Contact Address Address line 1 * Please add your address. Address line 2 Country * Choose... Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Bulgaria Cambodia Cameroon Canada Caribbean Chile China Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czechia Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Ghana Greece Greenland Guatemala Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Laos Latin America Latvia Liechtenstein Lithuania Luxembourg Macao SAR Macedonia, FYRO Malaysia Maldives Mali Malta Mexico Moldova Monaco Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa Spain Sri Lanka Sweden Switzerland Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Türkiye Turkmenistan Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Venezuela Vietnam World Yemen Please add your country. City * Please add your City. State * Choose... Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Federated States of Micronesia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Marshall Islands Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Palau Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virgin Islands Virginia Washington West Virginia Wisconsin Wyoming Please add your State. State Choose... Alberta British Columbia Manitoba New Brunswick Newfoundland and Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Quebec Saskatchewan Yukon State * Please add your State. Postal Code * Please add your Postal Code. Social Network Addresses LinkedIn Facebook Create Account This Login is already in use Login * Please add your login username. Password * Please add your login password. Step 5: Membership Package Please select a Membership Package 1-10 Employees $ 260 A company that has 10 or less full or part-time employees (including independent contractors). 11 - 20 Employees $ 310 A company that has between 11 and 20 full or part-time (including independent contractors) employees. 21 - 50 Employees $ 420 A company that has between 21 and 50 full or part-time (including independent contractors) employees. 51 or more Employees $ 500 A company that has over 51 full or part-time (including independent contractors) employees. Charitable Non-Profit under $5 Million Revenue $ 150 A locally based, charitable non for profit (501c3) organization with revenue under $5 million that wishes to be part of the Chamber. This is open to churches, civic organizations, etc. Charitable Non-Profit over $5 Million Revenue $ 250 A locally based, charitable non for profit (501c3) organization with revenue over $5 million that wishes to be part of the Chamber. This is open to churches, civic organizations, etc. Business Associate $ 150 An individual who works for/with a company that is ALREADY a member of the chamber but wants to have their own individual listing and membership. Comments/Questions Payment Option Bill Me Charge my credit or debit card Please complete the Captcha Back Next Submit Application Print Application Business Directory Events Calendar Hot Deals Job Postings Contact Us Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "text": "Contact Us - Lexington Area Chamber of Commerce Skip to content Home Member Directory Expand Member Login Chamber Directory List Virtual Membership Directory About The Chamber Expand Chamber Board of Directors Chamber Team Member Benefits Lexington Leaders Program of Work Community Resources Expand Employment Opportunities Special Deals Portraits of Davidson County Events Expand Host Your Event at The Breeden Insurance Amphitheatre Chamber Ribbon Cutting Ceremonies Join The Chamber Contact Us Search Toggle Menu Search Contact Us Your questions and concerns are important to us, and we want to answer any questions you may have. However, the high volume of messages we receive can make it difficult for us to respond to every one promptly. If you sent us a message/question and haven’t heard back within a week, please call us at 336-248-5929 . Location: 507 East Center Street., Lexington, NC 27292 Contact Information: PH: 336-248-5929 Mail: Lexington Area Chamber of Commerce P.O. Drawer C, Lexington, NC 27293 Follow Us Facebook LinkedIn Contact Us \" * \" indicates required fields Δ Today's Date * MM slash DD slash YYYY Name * First Last Email * Enter Email Confirm Email Main Contact Number * Organization * If not an organization or business, please put N/A. Address * Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Country Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Comments * Please let us know what's on your mind. Have a question for us? Ask away. About The Chamber Community Resources Member Directory Join The Chamber Contact Us Get In Touch! PH: 336-248-5929 chamber@lexingtonchamber.net 507 East Center St. Lexington, NC 27292 Facebook LinkedIn Instagram © 2025 Lexington Area Chamber of Commerce - WordPress Theme by Kadence WP Scroll to top Scroll to top Home Member Directory Toggle child menu Expand Member Login Chamber Directory List Virtual Membership Directory About The Chamber Toggle child menu Expand Chamber Board of Directors Chamber Team Member Benefits Lexington Leaders Program of Work Community Resources Toggle child menu Expand Employment Opportunities Special Deals Portraits of Davidson County Events Toggle child menu Expand Host Your Event at The Breeden Insurance Amphitheatre Chamber Ribbon Cutting Ceremonies Join The Chamber Contact Us Toggle Menu Close Search for: Search"
    },
    {
      "url": "https://www.renfrewshirechamber.com/about/contact/",
      "text": "Get in Touch - Renfrewshire Chamber of Commerce Back Membership Become a Member Members Directory Member Offers Premier Partners Services Business Mentoring Business Network Business Support Chamber HR, H&S, Legal and Tax Discounted Benefits Member Marketing Meeting Rooms Useful Links International Exports ChamberCustoms® T1 Transit Documentation Events Chamber Events Member Events Renfrewshire Connect 2025 News All News Chamber News Member News Business Matters Winter 2024 Business Matters Summer 2024 Business Matters Spring 2024 ROCCO Awards About The ROCCOs ROCCO Charity Fundraising Award Categories & Entry Forms Tickets ROCCO Sponsors ROCCOs News About Us Meet Our Team Other Chambers Charity Get in Touch Search Members Login Become a Member Membership Search Members Login Become a Member Membership Become a Member Members Directory Member Offers Premier Partners Services Business Mentoring Business Network Business Support Chamber HR, H&S, Legal and Tax Discounted Benefits Member Marketing Meeting Rooms Useful Links International Exports ChamberCustoms® T1 Transit Documentation Events Chamber Events Member Events Renfrewshire Connect 2025 News All News Chamber News Member News Business Matters Winter 2024 Business Matters Summer 2024 Business Matters Spring 2024 ROCCO Awards About The ROCCOs ROCCO Charity Fundraising Award Categories & Entry Forms Tickets ROCCO Sponsors ROCCOs News About Us Meet Our Team Other Chambers Charity Get in Touch Search Members Login Become a Member Get in touch Our staff at the Renfrewshire Chamber of Commerce are always here to support you in whatever you need. Send us a message If you have any questions or queries about your business, or want to know more about the services and support we provide please don’t hesitate to contact us using the form below. Contact Us \" * \" indicates required fields Name * Email * Subject * Message * CAPTCHA Name This field is for validation purposes and should be left unchanged. Submit Message Find us Address Bute Court St Andrews Drive Glasgow Airport Paisley PA3 2SW Directions The Renfrewshire Chamber of Commerce offices and the Glasgow Airport Business Centre are located within the admin building at Glasgow Airport. To reach our offices, simply head right within the Glasgow Airport roundabout, following the signs for the admin building. We are located directly across the road from the Holiday Inn Express. (the entrance is via Arran Court – our offices are on the 1st floor. The Business Centre rooms are all on the ground floor). Parking Parking is available within the admin building car park – press the chamber button at the barrier and say you have a meeting at the Chamber – they will let you in. Parking is free. Contact Us Tel: 0141 847 5450 Email us We are always happy to help. Get in touch. Contact us Your email address (Required) Submit Sign up to our newsletter About Us Meet the Team Exports Business Mentoring ROCCO Awards Members Directory Privacy & Complaints Policy © 2025 Renfrewshire Chamber of Commerce Site by: Cole AD Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://tavareschamber.com/list/member/customer-driven-staffing-tavares-5379",
      "text": "Customer Driven Staffing | PROFESSIONAL SERVICES - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Customer Driven Staffing Categories PROFESSIONAL SERVICES 844 S Duncan Dr. Tavares FL 32778 (352) 445-2643 (815) 346-3372 www.cdstaffing.com#http://www.cdstaffing.com# About Us Your total staffing solutions company. Rep/Contact Info Alex (Blas) Rodriguez × Close Alex (Blas) Rodriguez Territory Manager Phone: (352) 445-2643 Fax: (815) 346-3372 Send an Email 844 S Duncan Dr. Tavares FL 32778 Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/info",
      "text": "Information & Publication Request - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Information & Publication Request Areas of Interest Please specify which of the following you are interested in: Select all that apply Relocation Visitor Information Lodging Restaurants Contact Information * Required fields Name: * Organization: Mailing Address: * PO Box: City: * State: * Postal Code: * Country: * --- Select Country --- Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Bulgaria Cambodia Cameroon Canada Caribbean Chile China Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czechia Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Ghana Greece Greenland Guatemala Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Laos Latin America Latvia Liechtenstein Lithuania Luxembourg Macao SAR Macedonia, FYRO Malaysia Maldives Mali Malta Mexico Moldova Monaco Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa Spain Sri Lanka Sweden Switzerland Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Türkiye Turkmenistan Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Venezuela Vietnam World Yemen Phone: * Email: * Leave Blank: Contact Preference: --- Select Preference --- Phone Email Mail Comments / Questions: How did you find our website? --- Select Referral Method --- Search Engine Link From Another Page Email Notice Business Card Magazine Advertising Personal Referral Other The Tavares Chamber of Commerce will not sell your contact or email information. In order to serve your request, our office shares information with chamber member businesses who can provide you with additional information. Please indicate below if we may share your request for information: Yes, you may release this information. No, please do not release this information. Business Directory Events Calendar Hot Deals Job Postings Contact Us Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://news.cornell.edu/stories/2024/09/tavares-lead-cornells-office-community-relations",
      "text": "Tavares to lead Cornell’s Office of Community Relations | Cornell Chronicle Skip to main content Toggle navigation Search Cornell University Cornell.edu Media Relations Search Cornell University Cornell Chronicle Topics Architecture & Design Arts & Humanities Business, Economics & Entrepreneurship Computing & Information Sciences Energy, Environment & Sustainability Food & Agriculture Global Reach Health, Nutrition & Medicine Law, Government & Public Policy Life Sciences & Veterinary Medicine Physical Sciences & Engineering Social & Behavioral Sciences Research at Risk Campus & Community News & Events Public Engagement New York City Staff News Photos of the Week Big Red Sports Diversity In Memory Features Freedom of Expression NYS Impact Student Life University Statements Around Cornell All Stories Podcast Media Relations Cornellians Credit: Sheryl Sinkow Jennifer Tavares, president and CEO of the Tompkins County Chamber of Commerce, will start in her new role as the director of Cornell’s Office of Community Relations on Oct. 16. Tavares to lead Cornell’s Office of Community Relations By Tom Fleischman, Cornell Chronicle September 4, 2024 Jennifer Tavares, president and CEO of the Tompkins County Chamber of Commerce, has been hired as the director of Cornell’s Office of Community Relations, part of the Division of University Relations. Tavares will start in her new role on Oct. 16. Since January, the office has been led by Interim Director Susan Riley, who assumed the duties following the retirement of Gary Stewart after 21 years at Cornell. “I first want to offer my thanks to Susan Riley for her leadership, and to the entire community relations team for its hard work and dedication during this period of transition,” said Joel M. Malina, vice president for university relations. “We’re excited to welcome Jennifer to University Relations. The depth and breadth of her experience in Tompkins County and beyond, and her unique understanding of the potential for collaboration between Cornell and the surrounding community, make her the ideal person to fill this critical role.” Tavares, a certified economic developer, has been president of the Tompkins County Chamber since 2014. She also serves as a visiting lecturer in the Master of Public Administration program in the Cornell Jeb E. Brooks School of Public Policy. She has more than two decades of experience in nonprofit organization management; economic and community development; and government and public relations, among other skills. “I’m excited for the opportunity, and honored to have been selected for this role,” Tavares said. “I’ve had the pleasure of working with the Community Relations team frequently during my 10 years at the Chamber. I understand the importance of the work, value the team’s approach to community relations, and look forward to continuing to develop and enhance Cornell’s critical relationships with local community stakeholders.” Tavares sees “a lot of synergies and opportunities” between Cornell and the community. “I believe there is significant potential that that can be realized for mutual benefit,” she added. “I have long enjoyed being a connector and convener, bringing together individuals, organizations, private business, institutional partners and local government to support positive outcomes and collaborative problem solving in the community.” Prior to joining the Tompkins County Chamber of Commerce, Tavares was director of economic development for Commerce Chenango in her hometown of Norwich (2007-14) and executive director of the Potsdam Chamber of Commerce (2005-07). Tavares graduated in 1998 from State University of New York College, Potsdam, with a bachelor’s in English, speech communications and studio arts. She and her husband, Nathan Tavares, live in Lansing; their sons, ages 20 and 17, attend Drexel University and Rochester Institute of Technology, respectively. Cornell’s Office of Community Relations has been recognized numerous times for its work in the local community, including the 2015 Martin Luther King Jr. Peacemaker Award, awarded by the Community Dispute Resolution Center and the Greater Ithaca Activities Center. In 2016, the office received the Presidential Excellence Award from the International Town Gown Association, for initiatives related to race, economic development and leadership. The office’s weekly radio show, “All Things Equal,” which started in 2007, focuses on issues of diversity, equity and sustainability, aiming to provide a platform for respect and empathy. The City of Ithaca recognized the show in 2019, proclaiming April 23 as “All Things Equal Day” in honor of its 600th episode . In 2011, the office established the annual Town-Gown Awards, known as the TOGOs, which celebrate the connections between Cornell and local communities, and highlight the achievements of local leaders who have left or are leaving high-profile positions. News & Events Staff News Public Engagement Media Inquiries Media Contact Rebecca Valli rv234@cornell.edu 607-255-6035 Get Cornell news delivered right to your inbox. Subscribe You might also like Snapshot highlights university’s role in local economy Student groups earn Cornell honors for local partnerships Gallery Heading × Previous Next Links About the Chronicle Sitemap Copyright Web Accessibility Assistance University Relations Contact Cornell Chronicle 120 Maple Ave. Ithaca, NY 14850 cunews@cornell.edu SUBSCRIBE Daily and weekly newsletters Feeds - RSS & JSON Podcasts"
    },
    {
      "url": "https://tompkinsweekly.com/articles/chamber-ceo-tavares-tapped-to-lead-cornells-community-relations/",
      "text": "Chamber CEO Tavares tapped to lead Cornell’s community relations – Tompkins Weekly Subscribe Subscribe Search for: News Featured Stories Dryden Groton Ithaca Lansing Newfield Trumansburg/Ulysses Sports Community Cornell University Dryden Groton Ithaca Ithaca College Lansing Newfield Tompkins Cortland Community College (TC3) Trumansburg/Ulysses Opinion Letters to the Editor Political Views Business Education K-12 Ithaca College Cornell University Tompkins Cortland Community College (TC3) Lifestyle Art & Entertainment Food & Dining Signs of Sustainability Thinking Ahead Spotlight Hometown Heroes Events Calendar Event Submission Why Advertise in Tompkins Weekly? Newsletter Obituaries E-editions Newsletter E-editions Obituaries Advertise LLC Public Notices Subscribe News Featured Stories Dryden Groton Ithaca Lansing Newfield Trumansburg/Ulysses Sports Community Cornell University Dryden Groton Ithaca Ithaca College Lansing Newfield Tompkins Cortland Community College (TC3) Trumansburg/Ulysses Opinion Letters to the Editor Political Views Business Education K-12 Ithaca College Cornell University Tompkins Cortland Community College (TC3) Lifestyle Art & Entertainment Food & Dining Signs of Sustainability Thinking Ahead Spotlight Hometown Heroes Events Calendar Event Submission Why Advertise in Tompkins Weekly? Newsletter Obituaries E-editions Search for: Chamber CEO Tavares tapped to lead Cornell’s community relations By Jaime Cone Hughes ● Local News ● September 11, 2024 Jennifer Tavares, who has been the CEO of the Tompkins County Chamber of Commerce for the last 10 years, was recently hired by Cornell University to lead its Community Relations Department. Photo provided. Jennifer Tavares, president and CEO of the Tompkins County Chamber of Commerce, has been hired as the director of Cornell’s Office of Community Relations, which is part of the Division of University Relations, and will start in her new role on Oct. 16, the university recently announced. By Jaime Cone Hughes Managing Editor Tavares said she is honored to have been selected for the role and is currently focused on transitioning out of her 10-year-long tenure at the chamber. “I’m excited that our vice president Peggy Coleman will be taking over as interim president beginning on my last day here,” Tavares said. “We’ve had a solid partnership throughout Peggy’s tenure here, and she is very familiar with our operations and will be able to competently serve our members, partners, and our community.” “I’m thrilled that the board has the faith in me to lead the organization through this transition,” Coleman said. “This chamber is so unique and definitely different from any chamber I’ve ever worked with or have been a member of, and I’m really excited about the opportunity to lead the team.” Since January, the Office of Community Relations has been led by Interim Director Susan Riley, who assumed the duties following the retirement of Gary Stewart after 21 years at Cornell. “I first want to offer my thanks to Susan Riley for her leadership, and to the entire community relations team for its hard work and dedication during this period of transition,” said Joel M. Malina, vice president for university relations. “We’re excited to welcome Jennifer to University Relations. The depth and breadth of her experience in Tompkins County and beyond, and her unique understanding of the potential for collaboration between Cornell and the surrounding community, make her the ideal person to fill this critical role.” Tavares, a certified economic developer, has been president of the Tompkins County Chamber since 2014. “Over the last 10 years we’ve been through two strategic planning processes,” Tavares said, “and along with the Board and our team, I’ve been able to guide the organization in the direction of becoming stronger, more fiscally responsible, and better positioned within the community.” Tavares also serves as a visiting lecturer in the Master of Public Administration program in the Cornell Jeb E. Brooks School of Public Policy. She has more than two decades of experience in nonprofit organization management, economic and community development, and government and public relations, among other skills. She said she brings to the table the ability to manage an organization, a budget and communications with a mind toward marketing, as well. Tavares added that she has experience managing the expectations of a diverse array of stakeholders. “This role requires that we can hear and understand the needs of the smallest business and the largest in the county,” Tavares said. “I’ve always said the beauty of the Chamber of Commerce is how diverse it is — how it does reflect and represent the community in numerous ways.” Looking back at the decade she spent with the Chamber of Commerce, Tavares reflected on some of the endeavors of which she is most proud. “A few projects I’ve been able to help lead are the Tompkins Center for History and Culture on the Commons and the Ithaca Downtown Conference Center, as well as the creation of the Tompkins County Microenterprise Program,” she said. During the COVID-19 pandemic, Tavares said, the chamber was able to provide the leadership and support to guide hundreds of businesses. “Even to hear the constant references to the pandemic still is a little difficult, but it was such a substantial part of the last five years, being an organization like ours, and for many of our stakeholders in the community,” Tavares said. “I’m really proud of the transition we made away from our iconic building at East Shore Drive to the West End,” said Tavares. “The move both put us in a more central location to a lot of our members and partners, and we’re more easily able to reach downtown as well as more rural parts of the community and Taughannock State Park.” The chamber has done more outreach in rural communities in recent years, something that Tavares said is important to its current mission. “The area is so Ithaca-driven; the majority of employment is centered in Ithaca, and we have a lot of really unique, smaller communities throughout the county,” Tavares said. “We’ve made a concerted effort the last few years to do more diverse programming, to reach out and have community conversations and more engagement from businesses, nonprofits, and municipal partners countywide.” Tavares said that she is looking forward to helping Cornell continue and grow its positive influence on the local community. “As the largest employer and economic driver in our region, Cornell has made tremendous investments in our community,” she said. “In addition to monetary investments that you see in the news that have become rather public, there are investments of time, volunteerism and research or special projects, and providing expertise to our community and the broader region. Part of my new role is helping to identify and share these investments more broadly, and to continue finding ways that the resources Cornell has are able to result in mutually beneficial outcomes and collaborations.” Coleman said she knows Tavares “is going to do great things at Cornell.” “It has been such an honor to work for and with Jennifer these last 8 years,” Coleman said. “She is very much a supportive leader who believes in building a team of professionals, and she’s so well connected and has created a lot of bridges to a lot of different organizations and nonprofits, as well as our member businesses … Those relationships she has put in place I know will continue to grow closer, and we will continue with those collaborations moving forward.” Author Jaime Cone Hughes Jaime Cone Hughes is managing editor and reporter for Tompkins Weekly and resides in Dryden with her husband and two kids. Comments (0) There are no comments on this article. Related Articles Health alert: Fall 2025 COVID-19 vaccine updates By Newsroom ● Local News ● September 11, 2025 Tompkins County Whole Health shares Fall 2025 COVID-19 vaccine updates, eligibility changes, and where to get vaccinated locally. Danby resident leads effort for covered skate park By Jaime Cone Hughes ● Local News ● September 11, 2025 Danby resident Zachary Larkins leads effort to transform an old shelter into a covered skate park, with community input and fundraising underway. Tompkins County Partners with Red Cross for Community Blood Drive Sept. 13 By Newsroom ● Local News ● September 10, 2025 Tompkins County partners with the American Red Cross for a community blood drive on Sept. 13 at the Whole Health building from 10 a.m. to 3 p.m. Sign up for our free newsletters Email Instagram This field is for validation purposes and should be left unchanged. You can unsubscribe at any time. Have a question? Contact us or read our privacy policy for more info. Upcoming Events Sep 3 September 3 @ 7:00 pm - September 21 @ 9:00 pm Bad Books Sep 8 September 8 @ 10:00 am - December 5 @ 5:00 pm Free ESL Classes at Cornell Sep 11 3:00 pm - 5:00 pm GO ITHACA Tabling Event Sep 11 4:30 pm - 5:30 pm Baking Delicious Gluten-Free Desserts Sep 12 5:00 pm Piano Series – Nature and Landscape in the Salon Room (CU Music) View Calendar Editor's Picks Cornell wildlife hospital expands to meet growing demand Local governments, including Ulysses, launch coalition for park at former Camp Barton Awards spotlight heroism of 911 dispatchers during Lansing wildfires Ulysses landowners hope to make park dreams a reality Mike Murphy hopes to advance Main Street progress in fifth term as Dryden village mayor Latest E-edition Tompkins Weekly is your free go-to source for local news, opinions, sports, business, lifestyle, and community resources. We report on local news which includes, but is not limited to local sports, towns and Tompkins County government and politics, local economics, events, and other human interest topics. Subscribe to our Newsletter. Cancel anytime. Email Facebook This field is for validation purposes and should be left unchanged. Contact Us Event Submission Why Advertise in Tompkins Weekly? E-edition Subscribe Copyright © 2025 Tompkins Weekly . Tompkins Weekly  3100 North, Triphammer Road, Suite 100, Lansing, NY 14882  Ph: 607-533-0057 Privacy Policy Subscription Agreement Terms of Use"
    },
    {
      "url": "https://moscowchamber.com/contact/",
      "text": "Contact Us at The Moscow Chamber of Commerce Skip to content Toggle Navigation Stay + Play Getting Here Arts + Entertainment Moscow Farmers Market Golf Outdoor Recreation Local Parks Family Fun Shopping Sporting Events Staying Here Fest City Drink + Dine Breweries in Moscow Idaho Coffee Shops Restaurants Wineries Meet + Plan Community Events Calendar News Releases Business Directory Job Postings University of Idaho Contact Visitor Guide Moscow Gift Card Commerce Member Login About the Chamber Board of Directors Join The Chamber Programs Search this site Search Events Calendar Moscow Gift Card Contact Us \" * \" indicates required fields Full Name * Email * Phone Message * Contact Info Phone: (208) 882-1800 Email: info@moscowchamber.com Address: 411 S. Main Street, Moscow, ID 83843 Executive Director Samantha (Sam) Martinet Email: director@moscowchamber.com Cell: (719) 251-3913 Business Advocacy/Support, Member Benefits, Programming and Overall MCOC + VC Priorities Community Engagement Manager Noelle Borkowski Email: marketing@moscowchamber.com Events, Sponsorships, Marketing, Newsletter and General Questions Member Services Manager Anastasia Blaisdell Email: staff@moscowchamber.com Membership, Billing, MCOC+VC Gallery, Member Needs and General Questions About Us Contact Us University of Idaho Business Directory City of Moscow Join The Chamber About the Chamber News Releases Purchase the Moscow Gift Card Facebook Instagram YouTube 411 S. Main St., Moscow, ID 83843 info@moscowchamber.com Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://www.tavareschamber.com/list/member/trubey-auto-repair-inc-tavares-4383",
      "text": "Trubey Auto Repair, Inc. | AUTO PARTS & REPAIR - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Trubey Auto Repair, Inc. Categories AUTO PARTS & REPAIR 29325 C.R. 561 Tavares FL 32778 (352) 343-6510 www.trubeyauto.com#http://www.trubeyauto.com# About Us Family owned and operated auto repair business for 11 years. New owner with values of honesty, fairness and always striving to keep our customers happy! Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/",
      "text": "Home - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login 2025 Tavares Chamber 🚀 Big things are brewing in Tavares! The Tavares Chamber is gearing up for an unforgettable 2025, and we’re bringing a bold new vibe with us. From exciting announcements to fresh opportunities for our hometown heroes, there’s a lot headed your way. Stay tuned — this is just the beginning! 🌟 Welcome to the Tavares Chamber Of Commerce! 📍 Right in the heart of Tavares’ Waterfront Entertainment District, the Tavares Chamber of Commerce is your go-to source for all things happening in America’s Seaplane City ! Whether you’re looking to connect with local businesses, get plugged into the community, or take part in upcoming events — we’ve got you covered. Visit our website, give us a call, or stop by the Chamber — there’s something for everyone in the vibrant City of Tavares! 🌊✈️ The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. New Members 2019 Needs You! Click Flyer Below. Upcoming Events Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street, Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by GrowthZone - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/directory",
      "text": "Business Directory Search - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Business Directory Search All Categories... ACCOUNTING SERVICES ADVERTISING AIR CONDITIONING - HEATING ALUMINUM APARTMENT ATTORNEY AUTO DEALER AUTO PARTS & REPAIR AWARDS BAIL BONDS BANK BANQUET FACILITY BOATING - TOURS -MARINA BUILDER CATERING CHURCH CIVIL ENGINEERING COMPUTER AND PRINTER SUPPLIES COMPUTER SERVICES COMPUTER SOFTWARE CONSULTANT &  SERVICES CONSTRUCTION CONTRACTOR COSMETIC &  PLASTIC SURGERY DENTIST EDUCATION ELDERLY SERVICES ENGINEERING CONSULTANT ENTERTAINMENT ENVIRONMENTAL EVALUATION FINANCIAL SERVICES FLORIST FUNERAL HOME GOLF & COUNTRY CLUB GOVERNMENT GRAPHIC DESIGN HAIR SALON HANDYMAN HEALTH & WELLNESS HOTELS AND LODGING INDEPENDENT &  ASSISTED LIVING INDIVIDUAL INSURANCE LAND SURVEYOR LAW ENFORCEMENT LEASING MAGAZINE MAIL SERVICES MANUFACTURER MARKETING MEDIA MEDICAL MERCHANT SERVICES MOBILE HOME &  RV PARK MORTGAGE BROKER/BANKER NEWSPAPER NON PROFIT ORGANIZATION OUTDOOR ADVERTISING PERFORMING ARTS PEST CONTROL PHOTOGRAPHY PHYSICIAN PRINTING & COPYING SERVICES PROFESSIONAL SERVICES PROMOTIONAL PRODUCTS PROPERTY LEASING & INVESTOR PUBLISHING REAL ESTATE RENTALS RESORT RESTAURANT RETAIL ROOFING SENIOR COMMUNITY SIGNS SOCIAL SERVICE STORAGE STREET VENDOR TAX SERVICES UTILITY VETERINARY VOLUNTEER go 0-9 A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Advertising & Media ADVERTISING, PUBLISHING, MEDIA, SIGNS, More... Arts, Culture & Entertainment ENTERTAINMENT, PERFORMING ARTS Automotive & Marine AUTO DEALER, AUTO PARTS & REPAIR Business & Professional Services PROFESSIONAL SERVICES, ACCOUNTING SERVICES, CIVIL ENGINEERING, ENGINEERING CONSULTANT, More... Computers & Telecommunications COMPUTER AND PRINTER SUPPLIES, COMPUTER SERVICES, COMPUTER SOFTWARE CONSULTANT &  SERVICES Construction Equipment & Contractors CONSTRUCTION, CONTRACTOR, ROOFING, AIR CONDITIONING - HEATING, More... Family, Community & Civic Organizations NON PROFIT, CHURCH, INDIVIDUAL, ORGANIZATION, More... Finance & Insurance INSURANCE, BANK, FINANCIAL SERVICES, TAX SERVICES Government, Education & Individuals EDUCATION, GOVERNMENT, LAW ENFORCEMENT Health Care HEALTH & WELLNESS, MEDICAL, DENTIST, PHYSICIAN, More... Home & Garden PEST CONTROL, HANDYMAN Industrial Supplies & Services ALUMINUM, LAND SURVEYOR Legal ATTORNEY, BAIL BONDS Lodging & Travel HOTELS AND LODGING, APARTMENT, RESORT Manufacturing, Production & Wholesale MANUFACTURER Personal Services & Care SENIOR COMMUNITY, ELDERLY SERVICES, FUNERAL HOME, INDEPENDENT &  ASSISTED LIVING Pets & Veterinary VETERINARY Public Utilities & Environment UTILITY, ENVIRONMENTAL EVALUATION Real Estate, Moving & Storage REAL ESTATE, RENTALS, STORAGE, LEASING, More... Restaurants, Food & Beverages RESTAURANT, CATERING, BANQUET FACILITY Shopping & Specialty Retail RETAIL, FLORIST, STREET VENDOR Sports & Recreation BOATING - TOURS -MARINA, GOLF & COUNTRY CLUB Business Directory Events Calendar Hot Deals Job Postings Contact Us Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/list/member/customer-driven-staffing-5379",
      "text": "Customer Driven Staffing | PROFESSIONAL SERVICES - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Customer Driven Staffing Categories PROFESSIONAL SERVICES 844 S Duncan Dr. Tavares FL 32778 (352) 445-2643 (815) 346-3372 www.cdstaffing.com#http://www.cdstaffing.com# About Us Your total staffing solutions company. Rep/Contact Info Alex (Blas) Rodriguez × Close Alex (Blas) Rodriguez Territory Manager Phone: (352) 445-2643 Fax: (815) 346-3372 Send an Email 844 S Duncan Dr. Tavares FL 32778 Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/leadership-team",
      "text": "Leadership Team - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Office Staff and Volunteers Victoria Davison, Operations Director serves as the Director of Operations at the Tavares Chamber of Commerce. Building on this foundation, she contributes to the organization's mission of advocating for businesses and creating opportunities within the community. Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/list/member/ernie-morris-enterprises-772",
      "text": "Business Directory Search - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Business Directory Search All Categories... ACCOUNTING SERVICES ADVERTISING AIR CONDITIONING - HEATING ALUMINUM APARTMENT ATTORNEY AUTO DEALER AUTO PARTS & REPAIR AWARDS BAIL BONDS BANK BANQUET FACILITY BOATING - TOURS -MARINA BUILDER CATERING CHURCH CIVIL ENGINEERING COMPUTER AND PRINTER SUPPLIES COMPUTER SERVICES COMPUTER SOFTWARE CONSULTANT &  SERVICES CONSTRUCTION CONTRACTOR COSMETIC &  PLASTIC SURGERY DENTIST EDUCATION ELDERLY SERVICES ENGINEERING CONSULTANT ENTERTAINMENT ENVIRONMENTAL EVALUATION FINANCIAL SERVICES FLORIST FUNERAL HOME GOLF & COUNTRY CLUB GOVERNMENT GRAPHIC DESIGN HAIR SALON HANDYMAN HEALTH & WELLNESS HOTELS AND LODGING INDEPENDENT &  ASSISTED LIVING INDIVIDUAL INSURANCE LAND SURVEYOR LAW ENFORCEMENT LEASING MAGAZINE MAIL SERVICES MANUFACTURER MARKETING MEDIA MEDICAL MERCHANT SERVICES MOBILE HOME &  RV PARK MORTGAGE BROKER/BANKER NEWSPAPER NON PROFIT ORGANIZATION OUTDOOR ADVERTISING PERFORMING ARTS PEST CONTROL PHOTOGRAPHY PHYSICIAN PRINTING & COPYING SERVICES PROFESSIONAL SERVICES PROMOTIONAL PRODUCTS PROPERTY LEASING & INVESTOR PUBLISHING REAL ESTATE RENTALS RESORT RESTAURANT RETAIL ROOFING SENIOR COMMUNITY SIGNS SOCIAL SERVICE STORAGE STREET VENDOR TAX SERVICES UTILITY VETERINARY VOLUNTEER go 0-9 A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Advertising & Media ADVERTISING, PUBLISHING, MEDIA, SIGNS, More... Arts, Culture & Entertainment ENTERTAINMENT, PERFORMING ARTS Automotive & Marine AUTO DEALER, AUTO PARTS & REPAIR Business & Professional Services PROFESSIONAL SERVICES, ACCOUNTING SERVICES, CIVIL ENGINEERING, ENGINEERING CONSULTANT, More... Computers & Telecommunications COMPUTER AND PRINTER SUPPLIES, COMPUTER SERVICES, COMPUTER SOFTWARE CONSULTANT &  SERVICES Construction Equipment & Contractors CONSTRUCTION, CONTRACTOR, ROOFING, AIR CONDITIONING - HEATING, More... Family, Community & Civic Organizations NON PROFIT, CHURCH, INDIVIDUAL, ORGANIZATION, More... Finance & Insurance INSURANCE, BANK, FINANCIAL SERVICES, TAX SERVICES Government, Education & Individuals EDUCATION, GOVERNMENT, LAW ENFORCEMENT Health Care HEALTH & WELLNESS, MEDICAL, DENTIST, PHYSICIAN, More... Home & Garden PEST CONTROL, HANDYMAN Industrial Supplies & Services ALUMINUM, LAND SURVEYOR Legal ATTORNEY, BAIL BONDS Lodging & Travel HOTELS AND LODGING, APARTMENT, RESORT Manufacturing, Production & Wholesale MANUFACTURER Personal Services & Care SENIOR COMMUNITY, ELDERLY SERVICES, FUNERAL HOME, INDEPENDENT &  ASSISTED LIVING Pets & Veterinary VETERINARY Public Utilities & Environment UTILITY, ENVIRONMENTAL EVALUATION Real Estate, Moving & Storage REAL ESTATE, RENTALS, STORAGE, LEASING, More... Restaurants, Food & Beverages RESTAURANT, CATERING, BANQUET FACILITY Shopping & Specialty Retail RETAIL, FLORIST, STREET VENDOR Sports & Recreation BOATING - TOURS -MARINA, GOLF & COUNTRY CLUB Business Directory Events Calendar Hot Deals Job Postings Contact Us Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/events/details/monthly-chamber-business-luncheon-01-22-2020-114",
      "text": "Monthly Chamber Business Luncheon - Jan 22, 2020 - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Monthly Chamber Business Luncheon Event Sponsors \"All Trails Lead to Tavares\" Don't miss the first Monthly Business Luncheon of 2020! Sponsored by USB, with special guest speaker, City Administrator John Drury. Enjoy catering by Gourmet Today while hearing about the Lake County trails project. Images Gallery Image × Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Date and Time Wednesday Jan 22, 2020 11:30 AM - 1:00 PM EST 4th Wednesday of every month 11:30 a.m. - 1:00 p.m. Location Tavares Civic Center, 100 East Caroline Street, Tavares Fl 32778 100 East Caroline Street Tavares FL 32778 Fees/Admission $15.00 for members $20.00 for non-members Website http://www.TavaresChamber.com Contact Information J. Scott Berry, Executive Director Send Email Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Business Directory Events Calendar Hot Deals Job Postings Contact Us Share × Print Email Add to Calendar Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Select Calendar Type × Google Yahoo iCal (Outlook, Apple, or other) Close Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.tavareschamber.com/contact",
      "text": "Contact Us - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Contact Us Send us your questions or comments using the form below. We will respond promptly to your inquiry. Contact Information * Required field Name * Looks good! Please add your name. Organization Mailing Address * Looks good! Please add your mailing address. Mailing Address line 2 City * Looks good! Please add your City State * Looks good! Please add your State Postal Code * Looks good! Please add your Postal Code Country * Choose... Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Bulgaria Cambodia Cameroon Canada Caribbean Chile China Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czechia Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Ghana Greece Greenland Guatemala Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Laos Latin America Latvia Liechtenstein Lithuania Luxembourg Macao SAR Macedonia, FYRO Malaysia Maldives Mali Malta Mexico Moldova Monaco Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa Spain Sri Lanka Sweden Switzerland Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Türkiye Turkmenistan Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Venezuela Vietnam World Yemen Looks good! Please add your country. Phone * Looks good! Please add your phone number. Email * Looks good! Please add a valid email. Leave Blank Contact Preference * Choose... Phone Email Mail Looks good! Please select a contact preference. Comments/Questions Release this information The Tavares Chamber of Commerce will not sell your contact or email information. In order to serve your request, our office shares information with chamber member businesses who can provide you with additional information. Please indicate below if we may share your request for information: Yes, you may release this information. No, please do not release this information. Captcha Validation Please complete the Captcha Submit form Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 (352) 343-2531 Director@tavareschamber.com Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "http://www.tavareschamber.com/board-of-directors",
      "text": "Board of Directors - Tavares Chamber of Commerce, FL Home Contact Us Member Login Pages Members Categories Quicklinks Events Toggle navigation Home Directory Find A Member 2024 Digital Directory File Leadership Board of Directors Leadership Team About About Us Member Benefits Map Weather Contact Us Information Requests News & Events Chamber Calendar Submit New Event Resources Business & Community Job Postings Hot Deals Trustees Member Login The Tavares Chamber of Commerce is a driving force for economic growth. Our mission? To champion local businesses in Tavares and across Lake County — fueling opportunity, connection, and success for our entire community. Executive Board Join the Chamber Dining & Drinking Real Estate Accommodations City of Tavares Calendar 2020 Digital Directory Directory Map Trustees Calendar Tavares Chamber of Commerce 300 East Main Street Tavares, FL 32778 352. 343.2531 Email Us © Copyright 2025 Tavares Chamber of Commerce. All Rights Reserved. Site provided by MicroNet - powered by ChamberMaster software."
    },
    {
      "url": "https://www.britcham.com/committees/get-involved",
      "text": "Get in Touch | The British Chamber Of Commerce In Hong Kong Skip to main content Search Search Enter the terms you wish to search for. Check our social media on linkedin Register Login About About Us Mission, Vision & Values Code of Conduct Governance Our Team Contact Us Join Member Benefits Types of Memberships Member Offers Member Directory Events Events Events Calendar Events Archive Get in Touch Committees Our Committees Get in Touch Advocacy Overview Policy Council Expert Groups Policy Engagement Get in Touch News & Resources News Articles Doing Business in Hong Kong Chamber in the Community Get in Touch Check our social media on linkedin Login Register About About Us Mission, Vision & Values Code of Conduct Governance Our Team Contact Us Join Member Benefits Types of Memberships Member Offers Member Directory Events Events Events Calendar Events Archive Get in Touch Committees Our Committees Get in Touch Advocacy Overview Policy Council Expert Groups Policy Engagement Get in Touch News & Resources News Articles Doing Business in Hong Kong Chamber in the Community Get in Touch About About Us Mission, Vision & Values Code of Conduct Governance Our Team Contact Us Join Member Benefits Types of Memberships Member Offers Member Directory Events Events Events Calendar Events Archive Get in Touch Committees Our Committees Get in Touch Advocacy Overview Policy Council Expert Groups Policy Engagement Get in Touch News & Resources News Articles Doing Business in Hong Kong Chamber in the Community Get in Touch Home get involved Get in Touch Roberta Hamilton HEAD OF EVENTS, COMMITTEES & SPONSORSHIP Once you join the Chamber you have the opportunity to join a Committee which will give you an avenue to network with other professionals with shared interests and help to shape the chambers events programme and policy work. For further information about an individual Committee’s work please contact the Committee Secretary listed on the Committee page or get in touch using the form below. Your Name Your Email Message Send Subscribe to our Newsletter Please enter a valid email Sign Up Navigate About Join Events Committees Advocacy News & Resources Connect With Us Check our social media on linkedin Contact Information The British Chamber Of Commerce In Hong Kong RM1201, Emperor Group Centre, 288 Hennessy Road, WanChai HONG KONG Email: contact@britcham.com Phone: +852 2824 2211 Fax: +852 2824 1333 Privacy Policy Powered by"
    },
    {
      "url": "https://www.mountdora.com/list/member/tavares-chamber-of-commerce-452",
      "text": "Tavares Chamber of Commerce | Chambers of Commerce - publicLayout - Mount Dora Area Chamber of Commerce, FL ; Go Pages Members Categories Quicklinks Events Sales Achievement Luncheon Member Login Contact Us Join Toggle navigation Go Pages Members Categories Quicklinks Events Sales Achievement Luncheon Member Login Contact Us Join Home Business Directory Visiting Here Visitor Map - Your Virtual Guide To Downtown & Uptown Mount Dora Welcome Visitors Guide Page Hot Deals Living Here Local Resources Information Job Postings Mount Dora History Hot Deals Partner News About the Chamber Who We Are Why Join the Chamber Join Now Historic Train Depot Chamber Professional Affiliations Business Resources Partner 2 Partner Discounts Events Chamber Event Calendar Community Event Calendar Major Events & Festivals Chamber Annual Events Buy Tickets Here Tavares Chamber of Commerce Categories Chambers of Commerce 300 E Main St Tavares FL 32778 (352) 343-2531 Visit Website Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Building Business. Building Community. Mount Dora Area Chamber of Commerce 341 Alexander St., Mount Dora, FL 32757 352. 383.2165 admin@mountdora.com © Copyright 2025 Mount Dora Area Chamber of Commerce. All Rights Reserved. Site provided by GrowthZone - powered by ChamberMaster software."
    }
  ]
}