{
  "fuentes": [
    {
      "url": "https://www.tavarespavilion.com/",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/178/Visit-Tavares",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/148/Who-We-Are",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/148/Who-We-Are",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5664/tavares-pavilion-on-the-lake/",
      "email": "byob@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5664/tavares-pavilion-on-the-lake/",
      "email": "indooroutdoor@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5664/tavares-pavilion-on-the-lake/",
      "email": "upgradedrentals@2x.png"
    },
    {
      "url": "https://www.tavarespavilion.com/152",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/directory.aspx",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/tavares-pavilion-on-the-lake",
      "email": "clara-and-bradley-invitation@2x-3299068d7eaf55fe79c0.png"
    },
    {
      "url": "https://www.tavaresfl.gov/Directory/Home/DepartmentListing?DID=36",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/calendar.aspx",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/180/History",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/Calendar.aspx",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://tavarespavilion.com/directory.aspx?EID=6",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://tavarespavilion.com/Directory.aspx?did=5",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "http://www.tavarespavilion.com/156/Catering",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/QuickLinks.aspx?CID=17",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "http://www.tavarespavilion.com/172/Parking",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "http://www.tavarespavilion.com/157/Floor-Plans-Seating",
      "email": "tavarespavilion@tavares.org"
    },
    {
      "url": "https://www.tavarespavilion.com/Jobs.aspx",
      "email": "none@civicplus.com"
    },
    {
      "url": "https://www.tavarespavilion.com/Jobs.aspx",
      "email": "tavarespavilion@tavares.org"
    }
  ],
  "mails": [
    "byob@2x.png",
    "clara-and-bradley-invitation@2x-3299068d7eaf55fe79c0.png",
    "indooroutdoor@2x.png",
    "none@civicplus.com",
    "tavarespavilion@tavares.org",
    "upgradedrentals@2x.png"
  ],
  "nombre_sitio": "tavarespavilion.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tavarespavilion.com/",
      "text": "Tavares Pavilion on the Lake, FL | Official Website Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search We have amazing services Let Us Help You Rental Rates Catering Information Facility Agreement Reviews Availability Calendar Professional Accomplishments Welcome to Tavares Visitors Guide Tavares Pavilion on the Lake is located in Central Florida, convenient to the major attraction in Orlando, but offering a tranquil, waterfront real-Florida experience. Within walking distance of the Tavares Pavilion is the Tavares Seaplane Base, offering easy access to the facility by air and by sea. Tavares also offers many water-based activities, nature cruises, biking and hiking paths. The Tavares Pavilion is within walking distance to an assortment of restaurants and accommodations. Take a look at what could be Photo Gallery Yo ur special event starts with the location as your backdrop. Our gallery is meant for your inspiration to capture lasting memories. Learn More See the layout Floor Plans Two ballrooms offer flexible seating for any occasion. Every rental includes our elegant espresso-colored Chiavari chairs and an array of banquet, high-top, and round aircraft-aluminum tables that offer handcrafted artistry while providing a sophisticated and linenless presentation. Learn More Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tavarespavilion.com/178/Visit-Tavares",
      "text": "Visit Tavares | Tavares Pavilion on the Lake, FL Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Who We Are Visit Tavares Visit Tavares www.Tavares.org https://blog.visitlakefl.com/explore-tavares-florida/ https://www.visitflorida.com/places-to-go/central/tavares/ City of Tavares Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tavarespavilion.com/148/Who-We-Are",
      "text": "Who We Are | Tavares Pavilion on the Lake, FL Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Who We Are Who We Are The Tavares Pavilion on the Lake, located in downtown Wooten Park, is an 8,000-square-foot event facility that is located over the water at the end of a 40-foot-wide by 150-foot-long, brick-paved pier with ornamental railing and gas lamps lighting the way. The interior has an island retreat type of vibe and includes antique, carved sideboards and credenzas for linen and glassware storage; and wicker, rattan, and reed furniture is peppered throughout the space along with mahogany-finish, chivari chairs for dining. In keeping with a luxury, island feel, textures and natural fibers, where appropriate, is incorporated into the décor along with potted palm trees, tropical plants, and floral arrangements. Original artwork is installed throughout the facility along with a grand player piano. An ornate staircase is located at the front of the room and fit for any princess, a carved, two-tier, winding wood staircase with a gentle landing will be the feature piece on the back glass wall overlooking the lake. For Her Special Day, a beautifully appointed brides-ready room is located on the second floor with bathroom en suite and on the first floor, a comfortable grooms room serves a dual role as a meeting room with access to the outdoor deck. In walking distance, a seaplane base enables guests to readily take a casual seaplane ride or the wedded couple can be flown away to a dream honeymoon destination. Contact Us Email Tavares Pavilion Physical Address 200 S Disston Tavares , FL 32778 Phone: 352-253-4300 Brochure Frequently Asked Questions Visit Tavares History Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5664/tavares-pavilion-on-the-lake/",
      "text": "Tavares Pavilion on the Lake | Venue - Tavares, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Provided by: Tavares Pavilion on the Lake Report Tavares Pavilion on the Lake 352-253-4300 CALL VENUE FAVORITE Venue highlights Indoor and outdoor spaces BYO Upgraded rentals included Venue details Style: Event Center, Ocean/Waterfront View, Ballrooms Guest capacity: Accommodates up to 500 guests Services: Ceremony / Reception Indoor / Outdoor VIEW OPTIONS Location: 200 S Disston Avenue Tavares, FL 32778 Description: Are you envisioning a fairy tale wedding set against a picturesque backdrop? Look no further than the Tavares Pavilion on the Lake. Serenely floating over beautiful Lake Dora, this tropical-inspired waterfront oasis is furnished with natural fibers, lovingly restored antiques, and original artwork. Tavares Pavilion consists of an 8,000-square-foot two-story event center. Both floors offer indoor ballrooms that offer floor-to-ceiling windows for a covered ceremony or reception for up to 190 guests. The Ballrooms offer elegant espresso Chiavari chairs, aircraft aluminum tables, and handcrafted artistry. Our carved, two-tier, winding wood staircase with a back glass wall overlooking the lake is a beautiful space to say your “I Do’s”. In addition, the venue has a 150-foot brick-paved pier that can be used for a stunning outdoor ceremony or a reception under the stars. Your wedding day should be nothing short of magical, and Tavares Pavilion on the Lake promises just that. READ MORE Additional details Service Options Venue notes The rental fee ranges from $550 to $4,000. Amenities and Restrictions Amenities - Bride's dressing area - Groom's dressing area - Dance floor - Tables and chairs provided - Upgraded chairs - Piano - Venue set up and clean up - Full kitchen facilities - Public parking Restrictions - BYO alcohol - Venue must approve all decorations - No rice, birdseed, confetti, etc. - Choose from a list for catering - Amplified music OK indoors and outdoors - No smoking - Alcohol must be served by licensed bartender/caterer - Music must end by 11:00PM - No sparklers Amenities - Bride's dressing area - Groom's dressing area - Dance floor - Tables and chairs provided - Upgraded chairs - Piano - Venue set up and clean up - Full kitchen facilities - Public parking Restrictions - BYO alcohol - Venue must approve all decorations - No rice, birdseed, confetti, etc. - Choose from a list for catering - Amplified music OK indoors and outdoors - No smoking - Alcohol must be served by licensed bartender/caterer - Music must end by 11:00PM - No sparklers Links Tavares Pavilion on the Lake 352-253-4300 CALL VENUE FAVORITE Venue Highlights Indoor and outdoor spaces BYO Upgraded rentals included STARTING AT $5,777 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor / Outdoor available Max Indoor capacity: 190 Max Outdoor capacity: 500 Reception Indoor / Outdoor available Max Indoor capacity: 190 Max Outdoor capacity: 500 STARTING AT $5,777 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://www.tavarespavilion.com/152",
      "text": "Reviews | Tavares Pavilion on the Lake, FL Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Reviews Reviews \"The Tavares Pavilion on the Lake made every single one of our wedding dreams come true - getting married there was like a magical fairy tale!!! From the very first moment we toured the Pavilion, we knew it was something special. My husband and I were married on September 21st, and every single part of our day was perfect  thanks to the beautiful Pavilion and the amazing people who work there! Amy was our main point of contact, from our very first email inquiry to last minute emails on the morning of the wedding when I needed to request an extra chair at one our dinner tables. Throughout the entire planning process, Amy was simply incredible!!! She was very quick to respond to our emails, was super friendly and sweet, had great suggestions on how to plan out the flow of our day, and never made me feel silly for asking lots of questions. Carrie also helped me several times and was lovely. We also LOVED Michael! I didn't meet him until our rehearsal, and I wish I would've met him sooner! He was calm and reassuring and pleasant - definitely great for stressed out brides. He even greeted me on wedding day at  the end of the pier with an umbrella for shade since it was so hot and escorted me to the door. The Pavilion itself is so gorgeous - we love the ambiance and the antiques and the existing décor. We had a \"Florida\" vibe to our wedding and we used a lot of citrus and greenery and we didn't need to add a lot of extra floral or props due to the elegance of the venue itself. Our Guests were mostly from New England and the Midwest and were extremely impressed - they could not get ENOUGH of the Pavilion and are still raving to us about how beautiful it was! Friends of ours who got married at other venues in Central Florida mentioned that they wish they would have known about the Pavilion so they could have gotten married there instead! Planning our wedding here was stress free, straightforward, and easy. I wish we could rate more than 5 stars. Simply amazing.\" - The Knot, Jessica G. \"My husband and I just got married on 9.15.18 and I am still walking on cloud 9. We are so incredibly happy with how everything turned out. The staff at Pavilion on the Lake will make you feel right at home. We didn’t meet Michael until later in the game, but we wished he was at the forefront. His whole demeanor was kind and light hearted. I was greeted outside of my car with an umbrella the day of so I didn’t get hot. I felt like royalty! The whole staff assisted my family and accommodated  all of our needs. You can’t go wrong getting married here. It’s like a fairytale :)\" - The Knot,  Abby P. \"If you are looking for your dream venue, this is it! I can't even put into words how perfect our wedding was. It was actually the first and last venue I went too because when I stepped out of the car onto the pier, I knew this was it! The team at the pavilion are the most responsive, accommodating and just amazing people ever. From planning to the actual day, they made all my dreams come true. I can't thank you enough and every single one of our guests kept saying how in awe they were of our venue. From the beautiful lakeside views, to the friendly staff & breathtaking staircases.. I couldn't have picked a better venue. Thank you so much Amy, Michael, Carrie and team. I couldn't be more happier in my selection for a venue.\" -The Knot, Starleigh M. \"We just had my daughter's wedding there this weekend and... WOW! There is no better venue for a wedding. The building is gorgeous, the view is amazing, and there are not enough superlative adjectives to describe how awesome the staff is. From our million questions before we booked it, to seating and reception floor plans, and even helping with the details like a table for the sand ceremony and photo spot suggestions, they stayed involved and accessible right up to the wedding. They always acted more like helpful friends than like vendors trying to sell something. My husband even wants to have his company Christmas party there. We looked at so many other sites from resorts to country clubs and beyond, but nothing compared to this. It is beautiful and decorated on its own, but is also gorgeous as a background for your own decoration style. Tavares Pavilion on the lake was everything my daughter and son-in-law wanted, and we were all thrilled with the outcome!\" -The Knot, Shene A. \"Coordinating with the Pavilion staff was a breeze through the entire process. Quickly responded to any emails and phone calls to answer every question we had. On our wedding day, I was greeted on the pier and escorted inside with an umbrella. I truly felt like a princess! So friendly and a pleasure to work with. Not to mention the facility is beautiful!!\" - The Knot, Kelsey S. \"The Tavares Pavilion on the Lake was the most perfect venue we could've hoped to find for our wedding! The property is nothing short of stunning, and the staff was incredible during every step of the process. They offer so much for their clients and allow usage of their entire facility for the entirety of the event. We were so impressed with the courteousness and attentiveness of the staff on our wedding day, they really made it special and helped so much with getting everything in place exactly as we needed. They put so much consideration into the planning and execution of our wedding, helping along the way by asking us questions we may not have even thought of! They truly care that your event goes off without a hitch, and did an incredible job working with all our vendors too. This place is also one of the most beautiful venues I've seen and needs so little in terms of decoration. Simply the existing décor with the addition of our flower arrangements was all we needed, the venue has so much natural beauty that it doesn't take much to make everything insanely gorgeous. If you're looking for an incredible venue with even better staff, the Tavares Pavilion on the Lake will not disappoint!\" - The Knot, Ronnie S. \"We had our Wedding here on May 10, 2018 and couldn’t ask for a better venue! The view is amazing. The staff exceeded our expectations in every way. All out guests were happy and many said it was the best wedding they had ever been to! Amy was the nicest easiest person to work and plan with. Michael and Austin were part of our dream team wedding day. Thank you for makings and our special day unforgettable, perfect and beautiful! We fell in love with the Pavilion the first time we saw it. The staff were extremely helpful and friendly and went above and beyond to ensure our wedding went smoothly. We would definitely recommend it to any engaged couple looking for a venue to host their wedding.\" - The Knot, Amy M. \"Was just married here at the end of March and I could not have been happier with my venue choice. I was looking for water front but without the beach vibe. I wanted a calm beautiful view but something classy on the inside. This fit all those things. They were accommodating and wonderful people. Costs were reasonable and was so happy I found this little gem. Many of my guests were wondering why I chose Tavares, FL as my wedding location, but once seeing my venue, they completely understood! The bridal room is small but gorgeous. The building is big enough for everything I needed. I was able to not see my husband until I was walking down the aisle but never felt trapped in my room! I would say, parking had me stressed a bit, since there was no parking lot right outside, however, the hotels are literally right down the road (just a short walk away) and not one my guests complained! Everything went great and I appreciate Amy and all of the staff doing everything to make sure I had a great event. I had about 100 guests and I felt like reception and dance floor upstairs was the perfect size. I would highly recommend this venue to anyone.\" - The Knot, Caitlin H. \"We had our rehearsal and wedding here and it was amazing!! We were extremely pleased with our entire experience! The staff were super helpful and friendly and the Pavilion was beautiful. Our guests couldn't stop talking about how wonderful the venue was! I would highly recommend Tavares Pavilion on the Lake for whatever event you are planning!!\" - The Knot, Trudy A. \"This venue was my dream come to life!! It is absolutely GORGEOUS inside and out. I fell in love with it right away and booked it as soon as possible. I worked with Amy almost entirely through my year of planning and she was so on the ball about everything! Response time was amazing, she always emailed me back right away and was so accommodating. I wanted a true \"old Florida\" themed wedding and it was completely brought to life here! Your guests will be AMAZED by this venue!\" - The Knot, Caitlyn C. \"My now Husband, was actually the one to pick this place and am I glad he did! We instantly fell in love with the place! The whole staff was incredible and went above and beyond! I want to thank Amy for answering every single one of my questions & emails even the ones I thought were silly so promptly. I also want to thank Michael for every little detail mattered to him as much as it did to me and never was there a sentence where he didn't call the bride The Princess. The staff is as amazing and beautiful as the venue. I wouldn't have picked any other place or people to work with. Brides/Grooms look NO FURTHER this is YOUR venue!\" - The Knot, Keren S. \"This venue was perfect for our January wedding. The weather couldn’t have been better for our ceremony on the pier. We had a downstairs cocktail hour and upstairs reception that everyone loved. We had about 100 guests and there was still plenty of space for a dance floor. So many guests commented on how gorgeous the venue was. Amy and Carrie were very helpful throughout the planning process. I highly recommend this venue!\" - The Knot, Alex M. \"The Tavares Pavilion on the lake is an amazing venue. We fell in love with the place from the first time we visited when we were looking for a venue for our wedding. We recommend making sure you book early because the dates tend to book fast. None of our guests had ever been to this Venue which made it a surprise for all! This was such a wonderful find, guests were continually complementing on how beautiful everything was. We had a Christmas Wedding and utilized all the beautiful decorations the Pavilion uses during the holiday season. The venue has a great tropical yet elegant atmosphere throughout. Thus, no matter the season of your event the Pavilion is beautifully decorated and designed making it the perfect backdrop with little added décor needed. We could not say thank you enough to the staff. The staff we worked with; Amy, Randall and Michael were over and above wonderful! They were very helpful from day one from the planning stages of our wedding answering any and all questions. The staff was also very helpful the day of our wedding making sure that everything was taken care of. We would absolutely recommend this venue for anyone that is looking for a great atmosphere for any type of celebration.\" - The Knot, Katie J. \"Look no further, The Pavilion on the Lake is truly a gem and must when considering venues to get married. First off, the staff is top notch. Carrie and Amy welcome you with open arms and no question is a silly one. Michael and the Pavilion staff are super friendly and Michael made me feel like a princess on my special day. When first arriving on my wedding day I was walking up and had a bag in my hand and Michael spotted me. He quickly started running towards me and helping me with anything I needed. The evening went seamlessly and I can't thank them enough for making our day magical, wonderful and a day I will never forget!\" -The Knot, Amri B. \"This venue is perfect and absolutely beautiful. We were married in the evening and the lights around the venue are stunning. Our guests are still telling us how beautiful everything was and how much they loved the Pavilion. I highly recommend this location and the staff was amazing!\" - The Knot, Elizabeth B. \"Simply amazing. We held an indoor brunch wedding here for our daughter and son-in-law on January 28th. The morning was cool, skies clear and bright, water blue and shimmery, sea planes were taking off and landing – the pier was perfect for sipping morning Mimosas. Add to that the incredible staff! Michael, Amy, and Carrie have the perfect combination of knowledge, wisdom and experience to coordinate these events, yet they were very patient with us, very informative, and giving of their time during the year of planning and on the day of the event. This particular area has special meaning to our family so to know that there is an absolutely stunning venue sitting right here made this doubly special. If you are planning a wedding in Central Florida and you want true Florida, this is the place.\" -The Knot, Belinda D. \"The Pavilion is gorgeous. Perfect venue for a wedding. Staff is amazing. So attentive and thorough from beginning to end. Paid such close attention to details.\" - The Knot, Nancy W. \"Absolutely stunning! My friends and family were blown away by this hidden gem in the middle of Lake County. The staff were great and communicated with me the whole time leading up to the big day (especially with Irma). I hope that brides know you don't have to spend $20,000 to get a beautiful venue.\" - The Knot, Brittany O. \"The Pavilion was a joy to work with.. They will be as involved or uninvolved as you would like. During my wedding ceremony they were amazing and seamless in the way they set up and helped with any transition of the day... They are basically a blank canvas for your wedding day and love helping make it the most beautiful day of your life.\" -The Knot, Hannah N. \"We were so happy with Tavares Pavilion, it is such a unique and fun venue! We received a ton of compliments on the venue during and after the wedding. The building was designed to be perfect for weddings, and it is! It is such a stunning location, the photos turned out beautiful, and the staff was very helpful! We even designed our invitations around the Pavilion! Where else can you get married in the middle of a lake?\" - The Knot, Brittany B. \"My husband and I were married in this BEAUTIFUL venue on April 1st, 2017. It was everything I could have asked for and more. The staff was courteous and unless we needed them they hid themselves well. My day of coordinator worked very well with them and spoke highly of the staff. My husband and I were very concerned with noise coming for the nearby seaplane event, however even with the event happening right outside, we didn't hear ANYTHING. The venue was wonderful about letting our guests come and sire inside during the cocktail hour when it got hot. They were also wonderful with assisting our elderly guests upstairs and helped my family clean up after the event. Overall, for the amount of money we paid, we were very happy. Would definitely recommend this venue to any bride that wants to get married on a beautiful staircase and with a picturesque water backdrop.\" -The Knot, Heather P. Reviews Professional Accomplishments Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tavarespavilion.com/directory.aspx",
      "text": "Staff Directory • Tavares Pavilion on the Lake, FL • CivicEn Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Staff Directory Staff Directory Search the Directory Category: Staff Directory Tavares Pavilion on the Lake First Name: Last Name: Search Categories Telephone Tavares Pavilion on the Lake 352-253-4300 Address Holder http://www.tavarespavilion.com/directory.aspx?DID= Enter search terms to display a list of entries in the Staff Directory. JavaScript is required, and must be turned on, for a listing to appear on this Directory entry page. We apologize for any inconvenience this may cause. Live Edit Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-venues/tavares-pavilion-on-the-lake",
      "text": "Tavares Pavilion On The Lake | Wedding Venues | Cost, Reviews & Photos | Zola Web Accessibility Find gifts, vendors, couples... Log in Get started Wedding websites Wedding venues Vendors Registry Invites and paper Guest list Budget Boutique Albums Mobile app Team-Z advisors Expert Advice Inspiration Honeymoons FAQs Contact us Find a couple Zola Baby Zola Home Zola for vendors Zola Baby Zola Home Zola for vendors Plan your wedding Expert advice Find a couple Log in Get started Wedding Vendors / Wedding and reception venues / Florida venues / Tavares, FL venues / Tavares Pavilion On The Lake View all ( 47 +) 47 Tavares Pavilion On The Lake 5.0 ( 10 reviews ) Select services venue The venue will provide the space, plus a few extras. See services included Full wedding (ceremony and reception) pricing Starting at $1,750 Guest capacity Up to 190 seated guests About this venue Are you envisioning a fairy tale wedding set against a picturesque backdrop? Look no further than the Tavares Pavilion on the Lake. Serenely floating over beautiful Lake Dora, this tropical-inspired waterfront oasis is furnished with natural fibers, lovingly restored antiques, and original artwork. Tavares Pavilion consists of an 8,000-square-foot two-story event center. Both floors offer indoor ballrooms that offer floor-to-ceiling windows for a covered ceremony or reception for up to 190 guests. The Ballrooms offer elegant espresso Chiavari chairs, aircraft aluminum tables, and handcrafted artistry. Our carved, two-tier, winding wood staircase with a back glass wall overlooking the lake is a beautiful space to say your “I Do’s”. In addition, the venue has a 150-foot brick-paved pier that can be used for a stunning outdoor ceremony or a reception under the stars. Your wedding day should be nothing short of magical, and Tavares Pavilion on the Lake promises just that. Get a quote Seated guest capacity 1-190 Venue type Ballrooms, Banquet Halls Beaches, Waterfront Settings Venue setting Indoor Outdoor 200 S Disston Ave, Tavares, FL 32778 Our event spaces Versatile Ballrooms Grand Ballroom Two ballrooms offer flexible seating for any occasion. Every rental includes our elegant espresso-colored Chiavari chairs and an array of banquet, high-top, and round aircraft-aluminum tables that offer handcrafted artistry while providing a sophisticated and linen-less presentation. In the first floor ballroom, a luxury island retreat vibe can be imagines through textures and natural fibers found in the woven bac-bac matting installed in the mahogany-stained wood coffered ceilings. Guest capacity Up to 150 Seated Up to 200 Standing Bridal Suite, Conference & Ready Room Bridal Suite, Ready Room and Conference Room The Bridal Suite, located on the upper level, is furnished with comfortable seating, a vanity, and a private restroom. It is the perfect spot to apply those finishing touches. The Ready Room, located on the lower level, is a quiet gathering space with lounge chairs, a private deck, and stunning views of the lake and waterfront. The Conference Room which can also serve as a Ready Room, is located on the lower level, as well. For a nominal fee, a pool table is available to rental. Guest capacity Up to 190 Seated Up to 200 Standing The Pier The Pier Our 40' wide by 150' long, brick-paved pier has gas lamps lighting the way. Our pier is perfect for a stunning ceremony or reception under the stars. Guest capacity Up to 190 Seated Up to 190 Standing Square footage 6,000 Versatile Ballrooms Versatile Ballrooms Grand Ballroom Two ballrooms offer flexible seating for any occasion. Every rental includes our elegant espresso-colored Chiavari chairs and an array of banquet, high-top, and round aircraft-aluminum tables that offer handcrafted artistry while providing a sophisticated and linen-less presentation. In the first floor ballroom, a luxury island retreat vibe can be imagines through textures and natural fibers found in the woven bac-bac matting installed in the mahogany-stained wood coffered ceilings. Guest capacity Up to 150 Seated Up to 200 Standing Bridal Suite, Conference & Ready Room Bridal Suite, Conference & Ready Room Bridal Suite, Ready Room and Conference Room The Bridal Suite, located on the upper level, is furnished with comfortable seating, a vanity, and a private restroom. It is the perfect spot to apply those finishing touches. The Ready Room, located on the lower level, is a quiet gathering space with lounge chairs, a private deck, and stunning views of the lake and waterfront. The Conference Room which can also serve as a Ready Room, is located on the lower level, as well. For a nominal fee, a pool table is available to rental. Guest capacity Up to 190 Seated Up to 200 Standing The Pier The Pier The Pier Our 40' wide by 150' long, brick-paved pier has gas lamps lighting the way. Our pier is perfect for a stunning ceremony or reception under the stars. Guest capacity Up to 190 Seated Up to 190 Standing Square footage 6,000 Available services that can be provided by Tavares Pavilion On The Lake Services & amenities Clean up Dance floor Dressing room / Bridal Suite Event rentals Event staff Liability insurance Lighting/Sound Wheelchair accessible Wifi Transportation & access Self parking - free Wheelchair accessible Rentals Chiavari Chairs Lighting Sound / AV Reviews Write a review 5.0 out of 5 10 reviews Write a review The venue of my dreams, and a dream come true! • Verified review • Amy P. • Apr 7, 2025 This venue is absolutely stunning, with water views all around. It was important to my husband and I that we were able to bring the outside in, as we wanted to keep our wedding day fully indoors. The staircase and windows create such a gorgeous backdrop, and every part of the Pavilion is crafted with care. And beside all of that, their team is exceptional! We toured the site several times, and each time were met with the loveliest people who cared to answer all of our questions and provide ideas and concepts for our day. They were endlessly kind, attentive, and cooperative. Our day couldn't have run more smoothly, and we owe it all to the Tavares Pavilion on the Lake! Response from vendor • Apr 8, 2025 Wow—thank you so much for your beautiful review! We’re overjoyed to hear that your wedding day was everything you hoped for and more. It’s an honor to know the Pavilion played a part in bringing your dream day to life. From the scenic views to the special touches inside, we strive to make each moment magical, and it means the world to know our team made you feel supported and inspired throughout the process. Wishing you and your husband a lifetime of love, laughter, and happiness! 💖✨ Rowe wedding • Verified review • Selina R. • Nov 17, 2024 The Tavares Pavilion On The Lake was an incredible venue for our wedding. The Pavilion had fast response times and did not mind my billions of questions - they answered them all! They even had a bunch of patience awaiting my responses back to them. The venue is very spacious and worth every penny. They lit the outside of their building up as pink for me with no extra charge, which made for such a special touch. The Tavares Pavilion On The Lake truly gave us the most unforgettable day! ( 3 +) ( 2 +) ( 3 +) ( 2 +) ( 3 +) ( 2 +) ( 3 +) ( 2 +) ( 3 +) ( 2 +) ( 3 +) ( 2 +) Above and beyond • Verified review • Melissa K. • Oct 21, 2024 Tavares Pavilion On The Lake was an absolute dream venue for our wedding. From the very beginning, their communication was on point and consistent, which put our minds at ease during the planning process. When Hurricane Milton hit right before our big day, they stayed in close contact with us the entire time, doing everything in their power to ensure our wedding date remained intact. The staff went above and beyond to make our special day truly unforgettable - their kindness and attention to detail was simply breathtaking. The venue itself is stunning, and worth every penny. We could not have asked for a more perfect setting to celebrate our love. We are so grateful to the entire Tavares Pavilion team for making our wedding dreams a reality. ( 3 +) ( 2 +) ( 3 +) ( 2 +) ( 3 +) ( 2 +) ( 3 +) ( 2 +) ( 3 +) ( 2 +) ( 3 +) ( 2 +) Great Venue for a Christmas Wedding • Verified review • Alexandra C. • Jan 6, 2024 This venue is beautiful, particularly during Christmas time. We loved the elegant Christmas decor and themed our wedding around it. Everyone from the venue was very helpful throughout the process of inquiring about the venue, the tour, booking, and details as we approached our wedding date. Show all Real couples who got married at Tavares Pavilion On The Lake Show all photos Frequently asked questions 6 Answers Ask them a question Can we bring our own alcohol? Clients may provide alcohol to our selected caterers for consumption during their event provided that all alcoholic beverages, mixers, juices, etc. are delivered to the caterer off premises for inventory and transport. No guests will be permitted to enter the facility with alcohol of any kind. Do you provide catering or can we choose our own caterer? We have 5 selected catering companies which you can choose from. Our caterers went through a thorough process to ensure quality cuisine, exceptional service, and creativity. Our partners are highly qualified professionals that provide a wide variety of menus and services to accommodate diverse tastes, budgets, and occasions. Please feel free to reach out to them if you have any questions regarding cost, availability, and cuisine as they will be delighted to assist you. All food and beverage is to be provided by one of our catering partners, as no outside food and beverage is permitted. How far in advance can I book a rental The Tavares Pavilion on the Lake takes bookings up to 18 months in advance, we are on a rolling calendar. What type of deposit is required and what is the schedule of payments? An initial deposit would be half of the rental and half of the tax to secure the date. The final payment, due 60 days prior to the event date, would be the remainder of the rental fee and tax along with the security deposit. A full building rental security deposit is $1,000. Do you have on-site parking? Due to the location of the venue, we do not have onsite, up-close parking. Complimentary parking is available throughout the downtown, entertainment district and park areas. Do you have accessible facilities? Yes, all our facilities are wheelchair accessible. We also have two elevators onsite and ADA compliant restrooms on both floors. Ask them a question Want them for your wedding? Get a quote Want them for your wedding? Get a quote Book a vendor on Zola and get 65% off save the dates . Terms 108 Zola couples have booked Explore other vendors serving Tavares, FL Angelica Radway Photography Sweet Harmony Live Music: serving your local area nationwide! La Vie Studios - Photo + Video Melissa Rodriguez Photography F5 Images Bill Carroll Entertainment Sarcasm & Sunshine Designs Flower Preservation efling productions Magalie Lafleur Photography Derek Stroker - Feel Good Music Event Sound Achristine Bridal Complete your dream team Tavares Photographers Tavares Beauty Professionals Tavares Bands & DJs Tavares Florists Tavares Caterers Tavares Planners Tavares Cakes & Desserts Tavares Videographers Tavares Bar Services & Beverages Tavares Officiants Tavares Event Extras Other venues in Tavares Casani Estates The Capen House at the Albin Polasek Museum The Wedding Barn Casa Feliz Historic Home Museum The Garden Villa Chapel Valley Farm Wanderlust Okto Paradise Cove Celebration Gardens Orlando Embassy Suites Orlando Airport The Barn at Hidden Oaks Farm of Lake Mary Anastassia Ballroom & Dance Other wedding services nearby Orlando, FL Wedding Photographers Orlando, FL Wedding Planners Winter Park, FL Wedding Photographers Orlando, FL Wedding Officiants Orlando, FL Wedding Bands & DJs Orlando, FL Wedding Caterers Winter Park, FL Wedding Beauty Professionals Orlando, FL Wedding Cakes & Desserts Orlando, FL Wedding Event Extras Orlando, FL Wedding Beauty Professionals Orlando, FL Wedding Florists Orlando, FL Wedding Videographers Plan your wedding Venues and vendors Guest list Wedding websites Registry Invites and paper Budget Boutique Albums Seating chart Mobile app About Our story Become a Zola vendor Reviews Zola Baby Careers Press Advice and support Expert advice FAQs Track order Start a return Return policy Contact us Team Z advisors Plan your wedding Venues and vendors Guest list Wedding websites Registry Invites and paper Budget Boutique Albums Seating chart Mobile app About Our story Become a Zola vendor Reviews Zola Baby Careers Press Advice and support Expert advice FAQs Track order Start a return Return policy Contact us Team Z advisors For all the days along the way Log in Find a couple Find a baby registry Get started Privacy Terms Do Not Sell / Share My Personal Information Web accessibility © 2025 Zola, Inc. All rights reserved."
    },
    {
      "url": "https://www.tavaresfl.gov/Directory/Home/DepartmentListing?DID=36",
      "text": "Tavares Skip to Main Content ; Search: Go Home LIVE LIVE WORK WORK PLAY PLAY GOVERNMENT GOVERNMENT ABOUT TAVARES ABOUT TAVARES My Apps Agenda Center Alert Center Archive Center Bid Postings Blog Calendar Document Center Employment Opportunities Facilities Form Center Frequently Asked Questions News Flash Notify Me Photo Gallery Resource Directory Staff Directory View Full Website Sign In Tavares Pavilion on the Lake Tavares Pavilion on the Lake Corporate Retreats, Festivals, Weddings Physical Address: 200 S. Disston Avenue Tavares, FL 32778 Phone: 352.253.4300 TavaresPavilion@Tavares.org Link: Tavares Pavilion Website Bob Tweedie Director Carrie Petroski Pavilion Manager"
    },
    {
      "url": "https://www.tavarespavilion.com/calendar.aspx",
      "text": "Calendar • Tavares Pavilion on the Lake, FL • CivicEngage Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Calendar View All Calendars is the default. Choose Select a Calendar to view a specific calendar. List Week Month Subscribe to iCalendar Print Find a Facility Search Calendars by: Start Date End Date Enter Search Terms Show Past Events Select a Calendar Select Calendar/Calendars to filter Availability Search September January February March April May June July August September October November December 2025 2020 2021 2022 2023 2024 2025 2026 2027 2028 2029 Su M Tu W Th F Sa 31 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 1 2 3 4 Jump To Category: Availability (4) - Availability (4) Availability Reserved September 11, 2025, 8:00 AM - 12:00 PM Reserved 2025-09-11T08:00:00 Event Location 200 S. Disston Ave. Tavares FL 32778 More Details Reserved September 23, 2025, 8:00 AM - 4:30 PM Reserved 2025-09-23T08:00:00 Event Location 200 S. Disston Ave. Tavares FL 32778 More Details Reserved September 24, 2025, 2:30 PM - 4:30 PM Reserved 2025-09-24T14:30:00 Event Location 200 S. Disston Ave. Tavares FL 32778 More Details Reserved September 25, 2025, 3:00 PM - 11:00 PM Reserved 2025-09-25T15:00:00 Event Location 200 S. Disston Ave. Tavares FL 32778 More Details Facility Submit Event Print Email Event Subscription View RSS Feeds Select on Calendar Expand Collapse Previous Next Down Up Map Share Show more Agenda Live Edit Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tavarespavilion.com/180/History",
      "text": "History | Tavares Pavilion on the Lake, FL Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Who We Are History History City History The city was founded in 1880 by Alexander St. Clair-Abrams, a newspaper and railroad man from a Creole family in New Orleans. He gave it the surname of a Portuguese ancestor. In 1883 a post office was established; by the next year, a hotel, three stores, a sawmill, and eight cottages were built. St. Clair-Abrams's dream of Tavares as the state capital was not realized, but in 1887 it was designated the county seat of Lake County. St. Clair-Abrams later chartered a railroad from Tavares to Orlando . In 1919, Tavares incorporated as a town. The Tavares Seaplane Base is a city-owned, public-use seaplane base on Lake Dora in Tavares. The base is popular and gives rise to the city's nickname, \"America's Seaplane City\". Pavilion History The idea of the pavilion originated in 1908 with the Tavares Improvement Association. At first the plan was for a retaining wall along the lakefront, a dock, and a bandstand on the dock. A dock committee was appointed but little action was taken. In 1910 after much prodding, the dock committee came up with the idea of a pavilion . It than became the pavilion committee. Something over $200 was raised for the project, but when the first plans were submitted, it was discovered that the money had disappeared. At the June meeting in 1912, J.C. Orth submitted plans for a seasonal building. These were accepted but later were rejected. In December, Joe McCormic brought plans for the 40 by 40 foot two-story building with a six foot wide pier from the shore to cost $2,000. A campaign to raise the money started and the city voted to give $500. In April, piling for the building had been bought for $30 and a Mr. Saunders given a contract to drive them. In May it was discovered that eight or ten pilings were missing, probably floated away in a storm. The next month, it was reported that pilings were not set because \"Mr. Saunders\" engine is broken and he is trying to find another.\" The Pavilion was built in 1912 by legendary Tavares builder L.G. Coven. Eventually construction was completed, and the Association held its first meeting there on November 12, 1914. Situated over the waters of Lake Dora, it was Tavares' first real community center and was used by civic organizations including the Tavares Women's Club, Kiwanis Club, American Legion Post #76, and for almost all social events for nearly half a century. The Pavilion was the scene of many school functions and for a time it even served as City Hall. A 50-foot pier connected the Pavilion to the foot of St. Clair Abrams Ave. A favorite pastime of Tavareans in the early days was sitting on the sun decks overlooking the water and watching the old-time yachts and sailboats cruising past. At night, crowds jammed the Pavilion to watch plays on stage or to dance to the music of the day. It was the city's showplace. Over the years the Pavilion's use diminished to such an extent that in 1960 the city council decided it should be torn down. It was replaced by a modern community center in Ridge Park. The idea to rebuild the Tavares Pavilion on the Lake was born from several visioning sessions facilitated by former Mayor Nancy Clutts, with the participation of Tavares citizen and stakeholders. Residents made it clear they wanted us to honor Tavares' history in a very special way; therefore, it was decided to reconstruct the Tavares Pavilion on the Lake in a location close to where the original stood with a similar yet more modern look and with state-of-the-art amenities. Our city council and our city administrator John Drury embraced the idea. The Pavilion on the Lake broke ground on September 6, 2012. The first event was a wedding that was held on August 30, 2014. Brochure Frequently Asked Questions Visit Tavares History Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tavarespavilion.com/Calendar.aspx",
      "text": "Calendar • Tavares Pavilion on the Lake, FL • CivicEngage Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Calendar View All Calendars is the default. Choose Select a Calendar to view a specific calendar. List Week Month Subscribe to iCalendar Print Find a Facility Search Calendars by: Start Date End Date Enter Search Terms Show Past Events Select a Calendar Select Calendar/Calendars to filter Availability Search September January February March April May June July August September October November December 2025 2020 2021 2022 2023 2024 2025 2026 2027 2028 2029 Su M Tu W Th F Sa 31 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 1 2 3 4 Jump To Category: Availability (4) - Availability (4) Availability Reserved September 11, 2025, 8:00 AM - 12:00 PM Reserved 2025-09-11T08:00:00 Event Location 200 S. Disston Ave. Tavares FL 32778 More Details Reserved September 23, 2025, 8:00 AM - 4:30 PM Reserved 2025-09-23T08:00:00 Event Location 200 S. Disston Ave. Tavares FL 32778 More Details Reserved September 24, 2025, 2:30 PM - 4:30 PM Reserved 2025-09-24T14:30:00 Event Location 200 S. Disston Ave. Tavares FL 32778 More Details Reserved September 25, 2025, 3:00 PM - 11:00 PM Reserved 2025-09-25T15:00:00 Event Location 200 S. Disston Ave. Tavares FL 32778 More Details Facility Submit Event Print Email Event Subscription View RSS Feeds Select on Calendar Expand Collapse Previous Next Down Up Map Share Show more Agenda Live Edit Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://tavarespavilion.com/directory.aspx?EID=6",
      "text": "Staff Directory • Amy Pattee Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Staff Directory Amy Pattee Tavares Pavilion on the Lake Title: Pavilion Assistant Manager Return to Staff Directory Live Edit Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://tavarespavilion.com/Directory.aspx?did=5",
      "text": "Staff Directory • Tavares Pavilion on the Lake Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Staff Directory Tavares Pavilion on the Lake 200 S Disston Tavares FL 32778 Directions Physical Address: View Map 200 S Disston Tavares, FL 32778 Phone: 352-253-4300 Fax: 352-742-6338 Staff Name Title Email Phone Additional Phone Questions, General Tweedie, Bob Economic Development Director Petroski, Carrie Pavilion Manager Pattee, Amy Pavilion Assistant Manager Liquori, Lee Pavilion Services Associate Williams, James Pavilion Services Associate Return to Staff Directory Live Edit Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "http://www.tavarespavilion.com/156/Catering",
      "text": "Catering | Tavares Pavilion on the Lake, FL Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Events Catering Catering Selected Caterers The Tavares Pavilion is proud to call our catering partners an extension of our team. Our caterers went through a thorough process to ensure quality cuisine, exceptional service, and creativity. Our partners are highly qualified professionals that provide a wide variety of menus and services to accommodate diverse tastes, budgets, and occasions. Rest assured, your food and beverage experience will be memorable. All catering services must be provided by one of the following select caterers: Arthur's Creative Events and Catering Big City Catering C2 Catered Events John Michael Exquisite Weddings and Catering Pisces Rising Puff 'n Stuff River City Catering By clicking on a catering logos below, it will direct you to their website where you can learn more information about services, menus and pricing. Or download a printable listing of contact information (PDF) . Alcohol Alcoholic beverages are to be served directly by the caterer using only licensed, insured, and trained personnel. Alcoholic beverages shall be procured and served in accordance with the law. All alcohol needs to be delivered to the caterer off premises for inventory and transport. The client may provide a cash bar for alcoholic beverages in accordance with the law. Kegs and personal coolers are not permitted in the pavilion or on the pier. Alcohol consumption is a maximum of five continuous hours. No guests will be permitted to enter the facility with alcohol of any kind. Non-Catered Events ​ Applicable to corporate functions only Monday - Thursday 8:00 am - 4:30 pm & Friday 8:00 am - 2:00 pm The rental party may bring in and serve simple or prepared from such as coffee, beverages, donuts, pastries, or boxed lunches. No heating elements are permitted, such as Sternos®, chafing dishes, hot plates, steam trays, heat warmers, etc. Client will be responsible for set-up and clean-up of all refuse. Use of the Pavilion kitchen will not be permitted in this instance. Catering Rates Simply Married Floor Plans & Seating Parking Holiday Decorations Exterior Lighting Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tavarespavilion.com/QuickLinks.aspx?CID=17",
      "text": "Quick Links • Footer - Helpful Links Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Quick Links Footer - Helpful Links Home Site Map Contact Us Accessibility Copyright Notices Categories All Categories Footer - Helpful Links Footer - Quick Links Live Edit Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "http://www.tavarespavilion.com/172/Parking",
      "text": "Parking  | Tavares Pavilion on the Lake, FL Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Events Parking Parking The Tavares Pavilion offers ample parking options in close proximity to the facility. There is a convenient parking lot located off the roundabout. Additionally, you can find parking spaces in Wooton Park and nearby on-street parking. Just down the street, you'll also find the Lake County Parking Garage, which provides 1,555 parking spaces for easy access. Printable Map Parking Map (PDF) Catering Rates Simply Married Floor Plans & Seating Parking Holiday Decorations Exterior Lighting Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "http://www.tavarespavilion.com/157/Floor-Plans-Seating",
      "text": "Pavilion Floor Plans & Seating | Tavares Pavilion on the Lake, FL Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Events Floor Plans & Seating Pavilion Floor Plans & Seating The Tavares Pavilion on the Lake is comprised of two floors that include 2 grand ballrooms, meeting space and a 150-foot brick paved pier. The facility offers multiple configurations for events large and small. Tables and chairs are provided at no additional charge. Available Rentals & Set-Up Options Market Lighting Up lighting Wireless Microphones Projector/Screen Pool Table Ballroom Change Over Pier Seating Gobo - Customizable Projected Dance Floor Light Ballroom Dimensions Lower Level Grand Ballroom (PDF) Upper Level Grand Ballroom (PDF) Capacity Configuration Grand Ballroom Lower Level Grand Ballroom Upper Level Pier Standing Cocktail Tables 208 384 881 Theater Seating 190 249 832 Dining - 8 seats per 5-foot Round Table 88 152 360 Dining - 10 seats per 5-foot Round Tables 110 190 450 Lower Level Grand Ballroom Ceremony & Theatre Style Seating 120 Guests 150 Guests 170 Guests 190 Guests - Max Capacity Upper Level Grand Ballroom Reception Seating 98 Guests 106 Guests 132 Guests 142 Guests 162 Guests 182 Guests 190 Guests - Max Capacity Catering Rates Simply Married Floor Plans & Seating Parking Holiday Decorations Exterior Lighting Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tavarespavilion.com/Jobs.aspx",
      "text": "Jobs • Tavares Pavilion on the Lake, FL • CivicEngage Skip to Main Content Who We Are Events Gallery Reviews Contact Us Search Home Jobs Job Opportunities Use the Government Jobs tab to search through your municipality's employment opportunities. Subscribe to job posting notifications to be automatically alerted of the latest career opportunities by clicking on the Notify Me® button. RSS Steps 1. Listing Information This section is complete 2. Job Details This section is complete 3. Preview and Submit This section is complete Listing Information Category * Advertising and PR Services Aerospace and Defense Banking Business Services Computer/IT Services Construction Education Engineering Services Financial Services Government and Military Healthcare Services Insurance Internet Services Nonprofit Other/Not Classified Printing and Publishing Real Estate Restaurant/Food Services Retail Choose from Full List Display * Display Starts: Display For: 1 week - Free 1 month - Free 3 months - Free 1 year - Free Feature this listing for free What's this? Featured job listings display on the top of all job listings and are designed to stand out from the others. Continue Job Details Job Title * Job ID Description Salary Qualifications Special Requirements Miscellaneous Continue | Go Back Preview and Submit job listing from\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\tto Featured Total After completing all the steps, click Preview to open a preview of your listing in a new window or click Proceed to Checkout where you can purchase the listing for the duration you specified. Preview Proceed to Checkout Pay Later Cancel Tools Download Application Apply Online Email Resume Job Profiles Live Edit Location & Directions 200 South Disston Tavares, FL 32778 Phone: 352-253-4300 Email Us Get Directions Quick Links City of Tavares Page Pavilion Facebook Page InstaGram Pinterest /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}