{
  "fuentes": [
    {
      "url": "https://www.jewishpresstampabay.com/about-us/",
      "email": "info@jewishpresstampabay.com"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.tbjff.org/teen-reels-awards",
      "email": "jared.resnick@jewishtampa.com"
    },
    {
      "url": "https://www.jewishgulfcoast.org/calendar/tampa-bay-jewish-film-festival-2020",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://www.jewishgulfcoast.org/calendar/tampa-bay-jewish-film-festival-2020",
      "email": "info@jewishgulfcoast.org"
    },
    {
      "url": "https://www.brooklynfilmfestival.org/contact-us",
      "email": "feedbacket@wbff.org"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/Crescendo",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/the-one-and-only-jewish-miss-america",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/persian-lessons",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "boxoffice@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "guestservices@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "info@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "jewishfilm@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "jfifilmmakers@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "membership@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "nhoover@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "press@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "programming@jfi.org"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "publicity@larsenassc.com"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "email": "techops@jfi.org"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/tampa-bay-jewish-film-festival-5-2-2024/",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://local.aarp.org/place/tampa-bay-jewish-film-festival-tampa-fl.html",
      "email": "tampabay@aarp.org"
    },
    {
      "url": "https://www.jewishgulfcoast.org/calendar/federation-tampa-jccs-2024-tampa-bay-jewish-film-festival/",
      "email": "info@jewishgulfcoast.org"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/1618",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://www.tbjff.org/terms-of-use",
      "email": "info@jewishtampa.com"
    },
    {
      "url": "https://www.jewishpresstampabay.com/contact-us/",
      "email": "info@jewishpresstampabay.com"
    },
    {
      "url": "https://www.jewishpresstampabay.com/contact-us/",
      "email": "info@jewishpresstampabay.com"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/my-dearest-enemy-april-12",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/conversation-caf-led-by-sabina-goldgof-22",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://www.jewishpresstampa.com/contact-us/",
      "email": "info@jewishpresstampabay.com"
    },
    {
      "url": "https://www.jewishpresstampa.com/contact-us/",
      "email": "info@jewishpresstampabay.com"
    },
    {
      "url": "https://www.tbjff.org/",
      "email": "brandy.gold@jewishtampa.com"
    },
    {
      "url": "https://miamijewishfilmfestival.org/contact/",
      "email": "info@miamijewishfilmfestival.org"
    }
  ],
  "mails": [
    "boxoffice@jfi.org",
    "brandy.gold@jewishtampa.com",
    "feedbacket@wbff.org",
    "gabe@journeysherwood.org",
    "guestservices@jfi.org",
    "info@communityaccessnaperville.org",
    "info@jewishgulfcoast.org",
    "info@jewishpresstampabay.com",
    "info@jewishtampa.com",
    "info@jfi.org",
    "info@journeysherwood.org",
    "info@miamijewishfilmfestival.org",
    "info@theatrenantucket.org",
    "jared.resnick@jewishtampa.com",
    "jewishfilm@jfi.org",
    "jfifilmmakers@jfi.org",
    "leadershipboard@journeysherwood.org",
    "membership@jfi.org",
    "nhoover@jfi.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "press@jfi.org",
    "programming@jfi.org",
    "publicity@larsenassc.com",
    "scott@journeysherwood.org",
    "tampabay@aarp.org",
    "techops@jfi.org"
  ],
  "nombre_sitio": "tbjff.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.jewishpresstampabay.com/about-us/",
      "text": "About Us - Jewish Press Group of Tampa Bay, Inc. Search for: Search Submit Select Your Community ▼ Tampa Edition Florida’s Gulf Coast Edition Log In JP – Tampa Edition JP – Florida’s Gulf Coast Edition About Us The Jewish Press Story Advertise Deadlines Press Release Deadlines PR Info Submission Forms Home Delivery Contact Us Staff Directory Privacy Policy Login Thursday, September 11, 2025 About Us Advertise Media Kit Ad Deadlines Classifieds Mechanicals Design Service PR Info Press Release Guidelines Submit Press Release Press Release Deadlines Submission Forms Submit Anniversary Announcement Submit Bar/Bat Mitzvahs Submit Birth Announcement Submit Letters to the Editor Submit Obituary Submit Press Release Submit Wedding/Engagement Announcement Delivery Contact Us Staff Directory Archives Florida’s Gulf Coast Edition Tampa Edition Print Edition Archives Florida’s Gulf Coast Edition Tampa Edition About Us About the Tampa Bay Jewish Community The independent bi-weekly Jewish Press of Tampa Bay , Florida’s Gulf Coast edition and Tampa edition are the only Jewish community newspapers in the Tampa Bay area. The Jewish Press of Tampa Bay is a collaborative effort of the Tampa JCCs and Federation and the Jewish Federation of Florida’s Gulf Coast. The papers are, by circulation, the largest in Florida exclusive of the South Florida Gold Coast. The Gulf Coast edition of the Jewish Press is mailed to an average 7,700 households. An additional 200-300 copies are delivered to synagogues, community centers, restaurants and businesses. The average, by mail distribution of the Tampa edition is about 6,800 households. About 100-200 additional copies are delivered to synagogues, businesses and community centers in Hillsborough County. It is estimated that the combined readership of the Jewish Press/Florida’s Gulf Coast Edition and Jewish Press/Tampa Edition is more than 35,000 people. According to a national Jewish Media Network Demographics/Readership Survey (which included a sample from the Jewish Press), it is estimated that 70 percent of readers spend 1.5-3 hours reading their Jewish newspaper. The study found that Jewish newspaper readers’ average annual income is $120,100. The Jewish Press of Tampa Bay is a collaborative effort of the Tampa JCCs and Federation and the Jewish Federation of Florida’s Gulf Coast. 13009 Community Campus Drive, Tampa, Florida 33625 Info@JewishPressTampaBay.com Gulf Coast - 727.535.4400 Hillsborough - 813.871.2332 Home Tampa JP Gulf Coast JP About Us Contact Us Privacy Policy Our Hometown DMCA Notices Newspaper website content management software and services Copyright © 2025 Jewish Press Group of Tampa Bay, Inc. All Rights Reserved. By continuing to browse or by clicking \"Accept,\" you agree to our site's privacy policy. Accept Privacy policy"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    },
    {
      "url": "https://www.tbjff.org/teen-reels-awards",
      "text": "Tampa JCCs & Federation | JCC on the Cohn Campus | Bryan Glazer Family JCC \n | Tampa JCCs and Federation Tampa JCCs and Federation Give Menu E-Newsletter Log In Search E-Newsletter Log In About Us Careers Campus Info Security News & Media Beneficiary Agencies Events Campaign Kickoff Golf Tournament Community Leadership Awards President’s Dinner 2025 Women of Distinction Israel Independence Day Celebration Professional Societies FIBA Community Community Calendar Community Resources Jewish Life Scholarship Information Lilah Tov Overnight Camp Scholarship The Louise Eatroff Memorial College Scholarship Fund Hidden Yidden Jewish Community Relations Council Israel Update USF Protests Updates Solidarity About the JCRC How You Can Be An Advocate Issues the JCRC Focuses On Purpose and Goals of the JCRC Jews in the News Third Opinion Podcast Programs Hope Cohen Barnett Leadership Institute Children and Family Shanna & Bryan Glazer JCC JCC on the Cohn Campus PJ Library PJ Our Way Connecting You to Jewish Tampa Connect Calendar iVOLUNTEER Active Adults PCC Professional Community Connection Parkinson's Impact IMPACT Shabbat Dinners Other Resources Vodka Latke Arts & Culture Jewish Book Festival J Stage Theatre Jewish Film Festival Shine A Light on Antisemitism 2025 d'Ettaquette's Book Morsels Event Venue Give Donate Now Jewish Press Greetings Life and Legacy Memorial & Tribute Cards Women's Philanthropy Women of Distinction Lions of Judah LOJE: Lion of Judah Endowment Support the 2025 Annual Campaign Keep our community safe, strong and growing Donate to the Campaign Israel Resilience Campaign Help provide immediate assistance to victims of terror and their families and help re-build Israel Give Now Help us serve our Jewish communities at home and beyond Your support enables us to continue our vital initiatives, including: The Israel Emergency Campaign, our Annual Campaign, the Holocaust Survivors Campaign, Youth Scholarships and more. Learn more TAMPA JCCs AND FEDERATION 2026 CAMPAIGN KICKOFF Join us Tuesday, Sept 16, at the Shanna & Bryan Glazer JCC for our annual campaign kickoff with special guest Shabbos Kestenbaum, American Jewish activist and graduate of Harvard Divinity School. Learn More Jewish Book Festival Tampa 2025 Opening Sunday, October 12 The Jewish Book Festival will be showcasing 6 national authors and 4 Florida authors with panel discussions, luncheons, book sales and signings. Learn more PJ Library Grandparents (and Grand Friends) Tea Party Sunday, September 14 | 1:00 – 3:00 PM at the Shanna and Bryan Glazer JCC, High Tea Lunch, Flower Arranging, BEE-U-Tiful Crafts, Entertainment, and Storytime. Learn More Sue and Jeff Schoenbaum      Community Leadership Awards Oct. 23 at the JCC on the Cohn Campus.  The Sue & Jeff Schoenbaum Annual Community Leadership Awards event recognizes and honors those who have made a significant impact within our Jewish Community. Learn more The Bobbe Karpay Women of Distinction Program Thursday, Jan. 8, 2026. Tampa JCCs & Federation invites you to celebrate and honor the dedicated women of our Jewish community organizations at The Bobbe Karpay Women of Distinction Program. Learn More Join us for an unforgettable journey  to Argentina February 12-20, 2026. For 8 nights you will discover the sights and the flavors of Argentina's historic Jewish communities. Explore Buenos Aires, the Tigre River Delta and Iguazu Falls and more. Learn more ISRAEL UPDATE Read a recap of all the events happening at home and around the world concerning Israel and Jewish identity. Learn more Thank you to our most generous corporate sponsors! Local Beneficiary Agencies To obtain copies of the Non-Profit State Fund Allocations for Renumeration and Non-Profit Total Compensation Paid Using State Funds forms please contact jared.resnick@jewishtampa.com . Share Visit Our Other Sites Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC on the Cohn Campus Tampa Bay Jewish Film Festival Tampa's Premier Event Venue Third Opinion Podcast TOP Jewish Foundation Weinberg Village Assisted Living Financials Annual Report Allocations Beneficiary Agencies Honor Roll 2024 form 990 CONTACT US Tampa JCCs and Federation on the Maureen and Douglas Cohn Campus 13009 Community Campus Drive Tampa, FL 33625 813.264.9000 webmaster@jewishtampa.com CONNECT E-Newsletter Copyright © 2025 Tampa JCCs and Federation. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.jewishgulfcoast.org/calendar/tampa-bay-jewish-film-festival-2020",
      "text": "Tampa Bay Jewish Film Festival 2020\n | Jewish Federation of Florida's Gulf Coast Jewish Federation of Florida's Gulf Coast Menu Search Home About About Impact Report Programs Social Action: JCRC About the JCRC JCRC Media Guide JCRC In the News JCRC Advocacy JCRC Resources (Alphabetical) JCRC Resources (By Category) Families: PJ Library Women's Philanthropy Adults 20-40 The Tribe Hope Cohen Barnett Leadership Institute Israel: Partnership2Gether Culture: TBJFF Our Community Community Security Community Security Incident Report Community Directory Job & Volunteer Central Submit A New Position Community Journal New to Town? Start Here! Events Community Calendar View Here! Submit Events Instructions Event Submissions Tutorial Community Admin Login Mah Jongg & Mitzvot - September 28 What's Next? News Latest on Israel Maxine's Column Jewish Holiday Calendar Donate Donate or Pledge 2025 Fulfill Pledge 2024 Jewish Press Tributes & Memorials Planned Giving Women's Societies Professional Societies Mar 29 2020 to Apr 5 2020 Tampa Bay Jewish Film Festival 2020 Contact Brandy Gold 813-769-4725 brandy.gold@jewishtampa.com www.tbjff.org 0 Print Add To My Google Calendar Export iCal Cultural Event Event Recreation Open to All Share OUR MISSION Ensuring the continuity of Jewish life & culture locally, in Israel & around the world by convening collective action, identifying and helping the most vulnerable, addressing security needs in our Jewish community, and combatting antisemitism. CONTACT US Local Office Jewish Federation of Florida's Gulf Coast 13191 Starkey Road, Suite 8 Largo, FL 33773 727-530-3223 info@jewishgulfcoast.org CONNECT Subscribe Copyright © 2025 Jewish Federation of Florida's Gulf Coast. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.brooklynfilmfestival.org/contact-us",
      "text": "Contact Us @ Brooklyn Film Festival Brooklyn Film Festival Films Winners Press Sponsors Shop Search Contact Socials Staff About CONTACT THE FESTIVAL GENERAL QUESTIONS If you have any other questions about the current edition of the festival, you can get in touch with us by email at festival AT wbff.org or info AT wbff.org. By phone you can reach us at + 1 (718) 388 4306 FILM SUBMISSION INQUIRIES If you have a question that is not answered in our FILM SUBMISSION FREQUENTLY ASKED QUESTIONS Send an email to submit AT wbff.org or call us at + 1 (718) 388 4306 OFFICE & SHIPPING ADDRESS Brooklyn Film Festival 180 South 4th Street, Suite 2 S, Brooklyn, NY 11211, United States GOOGLE MAP & DIRECTIONS (note: Building entrance on South 5 Place) Phone: +1 (718) 388 4306 PRESS INQUIRIES & REGISTRATION Media representatives can register for the upcoming edition using the PRESS REGISTRATION FORM To contact the Press Office call +1 (718) 388 4306 or send an email to pr AT wbff.org SPONSORSHIP OPPORTUNITIES To learn how to join our family of sponsors, check out our current SPONSORSHIP OPPORTUNITIES or send an email to sponsor AT wbff.org VOLUNTEERING If you are interested in learning how to put a festival together while working in a creative and stimulating atmosphere, part time and full time volunteering positions are currently available. Send your resume to volunteer AT wbff.org OPEN VOLUNTEER POSITIONS FESTIVAL DIRECTORS Looking to contact one of the festival’s directors? CONTACT FESTIVAL DIRECTORS Submit a Film faq latest news press press releases coverage winners 2025 film lineup design awards & prizes festival sponsors photos about BFF 2025 staff film society film festival judges exchange archive festival themes film library films by year films by premiere films by edition films by category films by country films a to z donate contact follow BFF ABOUT CONTACT FOLLOW US NEWS sending... I agree 2025 Brooklyn Film Festival is a 501(c)(3) non-profit organization"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/Crescendo",
      "text": "Crescendo | Closing Night Feature Film\n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery Apr 25 2021 to Apr 27 2021 Crescendo | Closing Night Feature Film Contact Brandy Gold 813-769-4725 brandy.gold@jewishtampa.com $ Cost $ 12.00 Closing night celebration featuring the Award- Winning film Crescendo , is now scheduled as a Drive – In movie experience on April 25 at 8:00 pm . $12 per virtual showing. For virtual showing after unlocking once this content becomes available April 25th at 7:00 pm EST, you'll have 48 hours to start watching. Once you begin, you'll have 24 hours to finish watching. A renowned conductor assembles an orchestra of Israeli and Palestinian youth, only to be drawn into a tempest of distrust and discord. For personal reasons, maestro Eduard Sporck agrees to arrange a symbolic concert for a Middle East peace summit in Italy. But corralling the young artists—sworn enemies from the Arab-Israeli divide—is easier said than done. As auditions begin in Tel Aviv, conflict between factions flares up almost instantly. It takes all the conductor’s skills to get his musicians in harmony, building to a tense, emotional finale. An impressive cast of Israeli and Palestinian non-actors, led by veteran Peter Simonischek, lends authenticity to this powerful drama, loosely inspired by Daniel Barenboim’s West–Eastern Divan Orchestra. Register Print Add To My Google Calendar Export iCal Featured Film Share Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/the-one-and-only-jewish-miss-america",
      "text": "The One and Only Jewish Miss America \n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery Apr 3 2022 The One and Only Jewish Miss America 4:30PM - 6:30PM Bryan Glazer Family JCC 522 N Howard Ave Tampa, FL 33606 Contact Brandy Gold 813-769-4725 brandy.gold@jewishtampa.com The One and Only Jewish Miss America Bryan Glazer Family JCC Tampa Bay Jewish Film Festival April 3, 2022 4:30 PM Run Time 51 minutes / Documentary / Director David Arond / Portugal / 2020 / Language English The One and Only Jewish Miss the surprising story of Bess Myerson, the talented beauty queen from the Bronx, and how she won the world’s most famous beauty pageant 75 years ago at the tail end of World War II. The film follows Bess, the middle daughter of poor Russian immigrants, from her childhood in a one-bedroom Jewish housing project apartment through the suspense-filled pageant. Impressed by the college-educated musician, the judges chose her despite anonymous threatening phone calls and sponsor disapproval of a Jewish pageant winner. On her 1945 Miss America tour, Bess faced antisemitism and closed doors at race-restricted venues, which at that time did not allow Jews. It is also a story of courage as her disappointment turned to determination, leading Myerson to eventually start her own national tour to bring a message of tolerance to high schools and colleges around the country — a tour that launched her lifelong passion for justice. After a long career in entertainment, journalism, and working for the city of New York, Bess Myerson chose to move to South Florida, where she lived for many years and positively contributed to its Jewish community. Register 0 Print Add To My Google Calendar Export iCal TBJFF Featured Share Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/persian-lessons",
      "text": "Persian Lessons  | \n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery Apr 9 2022 Persian Lessons 7:30PM - 9:30PM AMC Sundial 12 St. Petersburg, FL Contact Brandy Gold 813-769-4725 brandy.gold@jewishtampa.com Persian Lessons AMC Sundial 12-St. Pete Tampa Bay Jewish Film Festival April 9, 2022 7:30 PM Run Time 2 hr 7 minutes / War | Drama / Director Vadim Perelman / Israel / 2020 / Language German French Italian English Persian Gilles, a young Belgian man, is arrested by the SS alongside other Jews and sent to a concentration camp in Germany. He narrowly avoids execution by swearing to the guards that he is not Jewish, but Persian. This lie temporarily saves him, but then Gilles is assigned a seemingly untenable mission: to teach Persian to Koch, the officer in charge of the camp's kitchen, who dreams of opening a restaurant in Persia (Iran) once the war is over. Gilles finds himself having to invent a language he doesn't know, word by word. As the unusual relationship between the two men begins to incite jealousy and suspicion, Gilles becomes acutely aware that one false move could expose his swindle. Register 0 Print Add To My Google Calendar Export iCal TBJFF Featured Share Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://jfi.org/festival-site-archive/sfjff-2023/staff-and-board",
      "text": "Staff & Board Become a Member Tickets & Passes Browse Films Cart Festival Schedule Film Guide Browse All Films Special Presentations Spotlights Explore More Awards Guests in Attendance Download the Program Guide Print Sources Schedule Browse Schedule by Day Films at the Castro Films at the Vogue Films at the Piedmont Download the Schedule Attend Tickets & Passes Become a Member Festival Venues How To Fest Accessibility + Code of Conduct Travel & Dining Press & Industry Jewish Film Institute Get Involved JFI Filmmaker Services Our Supporters Our Sponsors Community Partners Staff & Board Contact Us Newsletter Film Guide Browse All Films Special Presentations Spotlights Explore More Awards Guests in Attendance Download the Program Guide Print Sources Schedule Browse Schedule by Day Films at the Castro Films at the Vogue Films at the Piedmont Download the Schedule Attend Tickets & Passes Become a Member Festival Venues How To Fest Accessibility + Code of Conduct Travel & Dining Press & Industry Jewish Film Institute Get Involved JFI Filmmaker Services Our Supporters Our Sponsors Community Partners Staff & Board Contact Us Newsletter Staff & Board Contact the Festival General Inquiries info@jfi.org 415.621.0556 Press & Communications press@jfi.org 415.621.0556 x213 Larsen Associates, Publicists publicity@larsenassc.com Box Office boxoffice@jfi.org 415.621.0568 Mon–Fri, 11am–5pm Operations techops@jfi.org Programming programming@jfi.org Filmmaker Services jfifilmmakers@jfi.org Guest Services guestservices@jfi.org Member Services membership@jfi.org Jewish Film Institute Staff Lexi Leban , Executive Director Jay Rosenblatt , Program Director Marcia Jarmel , Director of Filmmaker Services Lawrence Ewing , Director of Finance and Operations Nate Gellman , Director of Development and Communications Dominique Oneil , Programmer Rebecca Pierce , Marketing and Communications Manager Emma Gobler , Development Coordinator Claudia Finkle , Administrative Coordinator Board of Directors Board of Directors Evan Abrams, Treasurer Julie Lubeck Arnheim Sandee Blechman Aviva Davis Neil Fink Ronnie Fuchs Alexander Germanacos Calvin Gibbs Ralph Guggenheim, Chair Vera Hartford Matthew Hechinger Susan Libitzky Jeanne Miller Michael Pearce Lloyd Sacks Barbara Shragge Victoria Stone Marissa Wertheimer Advisory Board Alan Berliner Bonni Cohen Rob Epstein Jeffrey Friedman Amos Gitai Elliott Gould Lee Grant Roberta Grossman Sayed Kashua Lacey Schwartz Jon Shenk Gideon Raff Festival Staff Operations Natasha Hoover, Festival Operations Manager Chris Powell, Film Traffic Manager Joey Smith, Tech & Media Manager Programming Lori Donnelly, Note Writer Nancy Fishman, Note Writer Laura Henneman, Note Writer Thaïs Miller, Note Writer Miguel Pendas, C opy Editor Janis Plotkin, Note Writer Peter L. Stein, Note Writer Marketing Caroline van Remortel, Designer Jamie Cohen, Website Manager Guest Relations Claudia Finkle, Guest Relations Manager Box Office provided by Box Cubed Mitchell Vaughn Ben Armington Publicity Larsen Associates, Publicists Karen Larsen Timothy Buckwalter Joel Shepard Zachary Thompson Special Events Leftwich Events Specialists, Inc Festival Trailer Where the Buffalo Roam Festival Screeners David Volansky Bonnie Burt Emmy Scharlatt Estie Hudes Ken Schneider Gail Evenari Lucy Lerner Lisa Zigmund Audrey Daniel Shevi Loewinger Ken Paul Rosenthal Barbara Davis Mark Valentine Ruth Gumnit Mark Lipman Helen Cohen Valerie Lapin Ken Olshansky Karen Olshansky Film Guide Browse All Films Special Presentations Spotlights Explore More Awards Guests in Attendance Download the Program Guide Print Sources Schedule Browse Schedule by Day Films at the Castro Films at the Vogue Films at the Piedmont Download the Schedule Attend Tickets & Passes Become a Member Festival Venues How To Fest Accessibility + Code of Conduct Travel & Dining Press & Industry Jewish Film Institute Get Involved JFI Filmmaker Services Our Supporters Our Sponsors Community Partners Staff & Board Contact Us Newsletter Copyright © Jewish Film Institute | Legal & Privacy Policy 145 Ninth Street Suite 200 San Francisco, CA 94103 T: 415.621.0556 / F: 415.621.0568"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/tampa-bay-jewish-film-festival-5-2-2024/",
      "text": "Tampa Bay Jewish Film Festival - Supernova: The Music Festival Massacre\n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery May 2 2024 Tampa Bay Jewish Film Festival - Supernova: The Music Festival Massacre 7:00PM - 9:00PM Shanna and Bryan Glazer JCC 522 N Howard Ave Tampa, FL 33606 Contact Brandy Gold brandy.gold@jewishtampa.com Supernova: The Music Festival Massacre Presented by the Tampa Bay Jewish Film Festival Tickets are $5, available at tbjff.org Suggested for Mature Audience 16+ About the Film The first minute-by-minute chronicle of the traumatic events of October 7, 2023, details the attack on Israel’s Supernova music fest, including real-time footage and survivor accounts. As the sun rose over unsuspecting young revelers, the unimaginable unfolded. When Hamas launched its coordinated attack, chaos reigned with hundreds killed, many more wounded, and dozens taken hostage. Through meticulously compiled videos from various sources—terrorists' GoPros, victims' phones, CCTV cameras, dashcams, and first responders' recordings—a vivid, emotionally charged immersion into the nightmarish ordeal unfolds. These stories of tragedy, resilience, and resolute human spirit form a powerful, visceral narrative, making it disturbing but vital viewing that demands history never forget. 0 Print Add To My Google Calendar Export iCal Share Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://local.aarp.org/place/tampa-bay-jewish-film-festival-tampa-fl.html",
      "text": "Tampa Bay Jewish Film Festival - Tampa, FL Join Renew Enroll: Automatic Renewal Rejoin Membership & Benefits Members Edition Rewards Star AARP Rewards %{points}% Help Register Login Login Hi, %{firstName}% My Account Account Details My Inbox Communication Preferences Newsletters Customize Your Membership Community Staying Sharp Logout Hi, %{firstName}% My Account Account Details My Inbox Communication Preferences Newsletters Customize Your Membership Community Staying Sharp Logout Content starts here CLOSE × Search {\"dropDownLabel\":\"All Topics\",\"dropDownValue\":\"everywhere\"},{\"dropDownLabel\":\"Entertainment\",\"dropDownValue\":\"entertainment\"},{\"dropDownLabel\":\"Health\",\"dropDownValue\":\"health\"},{\"dropDownLabel\":\"Money\",\"dropDownValue\":\"money\"},{\"dropDownLabel\":\"Policy & Research\",\"dropDownValue\":\"research\"},{\"dropDownLabel\":\"Travel\",\"dropDownValue\":\"travel\"},{\"dropDownLabel\":\"Work\",\"dropDownValue\":\"work\"},{\"dropDownLabel\":\"Member Benefits\",\"dropDownValue\":\"member benefits\"},{\"dropDownLabel\":\"Caregiving\",\"dropDownValue\":\"caregiving\"},{\"dropDownLabel\":\"Videos\",\"dropDownValue\":\"videos\"} Search Popular Searches Rolling Stones Presale Games Car rental AARP daily Crossword Puzzle Hotels with AARP discounts Life Insurance Suggested Links Help Show me my account info Change my Address How do I contact AARP? Where is my membership card? How do I get a digital card? AARP MEMBERSHIP Join AARP for just $15 for your first year when you sign up for automatic renewal. Gain instant access to exclusive products, hundreds of discounts and services, a free second membership, and a subscription to AARP The Magazine. Join Now Renew Now 120x30-AARP-logo-red Join Renew Enroll Rejoin right_container Health Money Work & Jobs Advocacy Social Security Medicare Caregiving Games Travel More... AARP en Español Membership & Benefits Members Edition AARP Rewards Membership & Benefits Members Edition AARP Rewards %{points}% Back Health Close Menu Healthy Living Conditions & Treatments Drugs & Supplements Health Care & Coverage Health Benefits AARP Eye Center Tips to Protect Your Eyesight AARP Hearing Center Ways To Improve Your Hearing Mental Health Resources Coping with Depression and Anxiety MEMBERS ONLY AARP Smart Guide Prepare for a Good Night's Sleep MEMBERS ONLY Back Money Close Menu Scams & Fraud Personal Finance Taxes Retirement Money Benefits Scams & Fraud View and Report Scams in Your Area Taxes Take the Charitable Giving Quiz AARP Money Map Get Your Finances Back on Track MEMBERS ONLY Budget & Savings Make Your Appliances Last Longer MEMBERS ONLY Back Work & Jobs Close Menu Job Search Careers Small Business Employers Age Discrimination Flexible Work Freelance Jobs You Can Do From Home AARP Skills Builder Online Courses to Boost Your Career Careers 31 Great Ways to Boost Your Career ON-DEMAND WEBINARS Tips to Enhance Your Job Search Back Advocacy Close Menu Drug Prices Saving You RX Dollars Social Security Fighting to Protect Social Security Medicare & Medicaid Advocating for Strong Programs Caregiving Supporting Family Caregivers Back Social Security Close Menu Webinars Get More out of Your Benefits Enrollment When to Start Taking Social Security Basics 10 Top Social Security FAQs Tools Social Security Benefits Calculator Back Medicare Close Menu Guide Start Your Medicare Journey With Our Medicare Enrollment Guide Tool Get Quick Medicare Answers With Our Medicare Q&A Tool medicare Learn How to Get Help With Common Medicare Problems Advocacy Learn How AARP is Fighting for Better Medicare Back Caregiving Close Menu Basics Care at Home Medical Financial & Legal Life Balance Local LONG-TERM CARE ​Understanding Basics of LTC Insurance​ State Guides Assistance and Services in Your Area Prepare to Care Guides How to Develop a Caregiving Plan End of Life How to Cope With Grief, Loss Back Games Close Menu All Recently Played Word & Trivia Rewards Atari® & Retro Mahjongg Members Only Staying Sharp Solitaire New Games Strategy Arcade Puzzles Card Juegos Daily Game Shows More About Games Right Again! Trivia Right Again! Trivia – Sports Atari® Video Games Throwback Thursday Crossword Back Travel Close Menu Travel Tips Vacation Ideas Destinations Travel Benefits Real ID Guide ID Goes into Effect on May 7 Affordable U.S. Destinations Stretch Your Travel Dollars Spring Travel Scenic Road Trips MEMBERS ONLY Vacation Lodging 40 Tips to Make Most of Stay MEMBERS ONLY Entertainment & Style Family & Relationships Personal Tech Home & Living Auto Staying Sharp Podcasts Videos Back Entertainment & Style Close Menu Movies TV Music Celebrities Beauty & Style Books Editors' Picks Best New Shows and Movies Celebrities Samuel L. Jackson Keeps Keeping On MEMBERS ONLY Looking Back ‘The Tonight Show’ Quiz MEMBERS ONLY Back Family & Relationships Close Menu Sex & Dating Your Questions Answered Grandparenting Everything You Need to Know MEMBERS ONLY Pets Your Guide to Health, Happy Pets MEMBERS ONLY Back Personal Tech Close Menu Home Technology Caregiver’s Guide to Smart Home Tech Get Happier Creating Social Connections Virtual Community Center Join Free Tech Help Events Back Home & Living Close Menu MEMBERS ONLY Age in Place What You Need to Know MEMBERS ONLY MEMBERS ONLY Recipes Favorites from Magnolia Bakery MEMBERS ONLY MEMBERS ONLY Declutter What to Do With Your Unwanted Stuff MEMBERS ONLY Back Auto Close Menu Car Buying Driver Safety Maintenance & Safety Trends & Technology Car Buying Is Now the Time to Buy an Electric Car? We Need To Talk Assess Your Loved One's Driving Skills Driver Safety AARP Smart Driver Course Back Staying Sharp Close Menu Assessment Challenges Articles Videos Recipes Building Resilience in Difficult Times Tips for Finding Your Calm Weight Loss After 50 Challenge Back Podcasts Close Menu Cautionary Tales of Today's Biggest Scams 7 Top Podcasts for Armchair Travelers MEMBERS ONLY Jean Chatzky: ‘Closing the Savings Gap’ MEMBERS ONLY Back Videos Close Menu Quick Digest of Today's Top News AARP Top Tips for Navigating Life Get Moving With Our Workout Series AARP Local Tampa, FL and the Tampa Bay area Sections Home Events Things to Do News Feed Volunteering State & Local Resources Movies for Grownups AARP in Action More Home & Community Local Offers Work & Jobs Community Calendar Back to Things to Do Tampa Bay Jewish Film Festival Tampa , FL 33601 Tampa Bay Jewish Film Festival By clicking the links above, you'll leave AARP and go to a website that is not operated by AARP. A different privacy policy and terms of service will apply. About Us: The TBJFF is a celebration of the finest international films that focus on Jewish themes and is one of the most inclusive and pluralistic Jewish events in the greater Tampa Bay area. The festival delivers an extraordinary collection of gripping dramas, thought-provoking documentaries, eclectic shorts and offbeat comedies depicting Jewish life from different times and places and appealing to everyone from the most discerning film critics to family audiences. Selected screenings are enhanced by providing a dynamic forum for audience dialogue with distinguished actors, producers, writers and other expert panelists. Founded in 1995, the festival has quickly grown in size and reputation, welcoming moviegoers from across the greater Tampa Bay area. The outstanding films are shown in venues in Tampa, St. Petersburg and Clearwater and attract moviegoers from every social and economic background from Hillsborough, Pasco and Pinellas counties and beyond. As attendance increases from year to year, the festival attracts not only a larger audience but also a more diverse one, reaching an increasingly multi-cultural and multi-generational (and especially younger) demographic. The TBJFF is now accepting entries for its 18th annual festival to be held from March 20 through March 31, 2014. The Tampa Bay Jewish Film Festival is produced by the Tampa Jewish Community Center and the Suncoast Jewish Community Center. We hope you will find our web site informative and interactive. See you at the movies! Report an Issue Please use \"Flag This Place\" to alert us about content that is inappropriate or needs immediate attention. Nothing you submit will be shared with other site visitors. AARP Events for Tampa Featured Event Walk with a Doc Tampa Saturday, Sep 13, 2025 at 8:30 a.m. ET Woodland Terrace Park Tampa, FL Featured Event AARP CAREversations: Caring for A Loved One Sunday, Sep 14, 2025 at 12:00 p.m. ET Hilton Garden Inn Tampa/Riverview/Brandon Riverview, FL Featured Event Enhance Your Job Search Wednesday, Sep 17, 2025 at 11:00 a.m. ET Westchase Park & Recreation Center (Activity Room) Tampa, FL View All AARP Events You’ll leave AARP and go to a website that is not operated by AARP. A different privacy policy and terms of service will apply. Only $15 your first year with Automatic Renewal Immediate access to your member benefits Discounts on travel and everyday savings Subscription to AARP The Magazine FREE second membership Join AARP Already a member? Renew or Print Card Facebook Contact AARP Florida tampabay@aarp.org AARP Florida Contact Us Return to top AARP is a nonprofit, nonpartisan organization that empowers people to choose how they live as they age. About Us Donate Volunteer Membership AARP Rewards Advertise with AARP Contact Us Careers at AARP AARP Services Inc. Policy & Research Newsletters AARP In Your City AARP En Español AARP 樂齡會 Press Center AARP Foundation Wish of a Lifetime Senior Planet | OATS AgeTech Collaborative™ Legal Counsel for the Elderly AARP Privacy Hub Terms of Service Accessibility Statement AARP Rewards Terms & Conditions Copyright Information Vulnerability Disclosure Program Ad Choices Your Privacy Choices Facebook Twitter Instagram LinkedIn Close Welcome to AARP Tampa Bay For great info on local AARP activities and things to do near you, choose a central city: Tampa, FL St. Petersburg, FL Or select your city nearby: Go or see a list of towns for Tampa Bay Cancel Choose a community Close What community do you want to visit? Find Your Community Or browse by state Cancel Elige una comunidad Close ¿Qué comunidad quieres visitar? Encuentra tu comunidad Cancelar Choose a community Close What community do you want to visit? Find Your Community Or browse by state Cancel Choose a community Close What community do you want to visit? Find Your Community Or browse by state Cancel × Close × Leaving AARP.org Website You are now leaving AARP.org and going to a website that is not operated by AARP. A different privacy policy and terms of service will apply. Continue Close"
    },
    {
      "url": "https://www.jewishgulfcoast.org/calendar/federation-tampa-jccs-2024-tampa-bay-jewish-film-festival/",
      "text": "Federation & Tampa JCCs - 2024 Tampa Bay Jewish Film Festival\n | Jewish Federation of Florida's Gulf Coast Jewish Federation of Florida's Gulf Coast Menu Search Home About About Impact Report Programs Social Action: JCRC About the JCRC JCRC Media Guide JCRC In the News JCRC Advocacy JCRC Resources (Alphabetical) JCRC Resources (By Category) Families: PJ Library Women's Philanthropy Adults 20-40 The Tribe Hope Cohen Barnett Leadership Institute Israel: Partnership2Gether Culture: TBJFF Our Community Community Security Community Security Incident Report Community Directory Job & Volunteer Central Submit A New Position Community Journal New to Town? Start Here! Events Community Calendar View Here! Submit Events Instructions Event Submissions Tutorial Community Admin Login Mah Jongg & Mitzvot - September 28 What's Next? News Latest on Israel Maxine's Column Jewish Holiday Calendar Donate Donate or Pledge 2025 Fulfill Pledge 2024 Jewish Press Tributes & Memorials Planned Giving Women's Societies Professional Societies Feb 21 2024 to Feb 25 2024 Federation & Tampa JCCs - 2024 Tampa Bay Jewish Film Festival The James Museum 150 Central Avenue St. Petersburg, FL 33701 Contact Jewish Federation of Florida's Gulf Coast 727-530-3223 info@jewishgulfcoast.org Learn more and purchase tickets at TBJFF.org . At the James Museum: 0 Print Add To My Google Calendar Export iCal Social Arts and Culture Recreation Cultural Film Share OUR MISSION Ensuring the continuity of Jewish life & culture locally, in Israel & around the world by convening collective action, identifying and helping the most vulnerable, addressing security needs in our Jewish community, and combatting antisemitism. CONTACT US Local Office Jewish Federation of Florida's Gulf Coast 13191 Starkey Road, Suite 8 Largo, FL 33773 727-530-3223 info@jewishgulfcoast.org CONNECT Subscribe Copyright © 2025 Jewish Federation of Florida's Gulf Coast. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/1618",
      "text": "1618 \n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery Apr 6 2022 1618 2:00PM - 4:00PM AMC Veteran's 24 9302 Anderson Rd Tampa, FL 33634 Contact Brandy Gold 813-769-4725 brandy.gold@jewishtampa.com 1618 AMC Veteran's 24 Tampa Bay Jewish Film Festival April 6, 2022 | 2:00 PM Run Time 1 hr 25 minutes / Drama | History / Director Luis Ismael / Portugal / 2020 / Language Portuguese with English Subtitles This historical drama is based on a true story: the visitation by the Inquisition to Porto in 1618. At the time, the entire population was exhorted to denounce heresies under pain of ex-communication. In a city where a large part of the population had Jewish ancestry, over one hundred New Christians, among others, were imprisoned, causing terror in the New Christian community, mass emigration, and the near-total destruction of the city’s economy. Register 0 Print Add To My Google Calendar Export iCal TBJFF Featured Share Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.tbjff.org/terms-of-use",
      "text": "Terms of Use\n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery Terms of Use Effective Date:  5-24-2024 This is an agreement between TAMPA JCC/FEDERATION, INC.  (TJCCF) and users of TAMPA JCC/FEDERATION, INC. ’S   sites, software, applications, content, products and services (“TAMPA JCC/FEDERATION, INC.   Services”), which may be branded as TAMPA JCC/FEDERATION, INC.  (TJCCF) or another brand owned or licensed by TAMPA JCC/FEDERATION, INC. . Throughout these Terms and Conditions of Use (“Terms”), “FEDERATION ACRONYM,” “we,” “our,” or “us” refers to TAMPA JCC/FEDERATION, INC. . “You” or “your” refers to anybody using our TAMPA JCC/FEDERATION, INC. Services. These Terms apply to any TAMPA JCC/FEDERATION, INC. site that links to these terms. These terms govern your use and our provision of TAMPA JCC/FEDERATION, INC. .  Services on which these terms are posted, as well as TAMPA JCC/FEDERATION, INC. .  Services we make available on third-party sites and platforms if these terms are disclosed to you in connection with your use of TAMPA JCC/FEDERATION, INC. Services. PLEASE READ THESE TERMS CAREFULLY BEFORE USING TAMPA JCC/FEDERATION, INC. SERVICES. BY USING TAMPA JCC/FEDERATION, INC. SERVICES YOU AGREE TO BE BOUND BY THESE TERMS. PLEASE NOTE THAT WE MAY CHANGE THESE TERMS FROM TIME TO TIME. These Terms and the Privacy Policy (https://www.jewishtampa.com/privacy-policy) collectively constitute the entire agreement with respect to your access to and use of TAMPA JCC/FEDERATION, INC. Services. If any provision of these Terms is held to be invalid or unenforceable, that provision will be stricken and will not affect the validity and enforceability of any remaining provisions. Your Agreement to These Terms By using our TAMPA JCC/FEDERATION, INC. Services, you acknowledge and agree that you, on your own behalf and on behalf of any corporation or other legal entity that you represent or for which you access TAMPA JCC/FEDERATION, INC. Services (your “Company”), have read these Terms. You agree that all disputes with us will be resolved through arbitration (as discussed below). You accept and agree to be bound by these Terms. If you do not agree to these Terms, you are not authorized to use TAMPA JCC/FEDERATION, INC. Services. Our TAMPA JCC/FEDERATION, INC. Services are for adults and not intended for people under 13. We do not knowingly collect or store any personal information about children under 13 years of age, unless provided by a parent, guardian, or other adult seeking our services on behalf of a child. Information on any TAMPA JCC/FEDERATION, INC. website is provided with the understanding that TAMPA JCC/FEDERATION, INC. is not rendering professional advice or recommendations. You should not rely on any information on these pages to replace consultations with qualified professionals to meet your individual needs. TAMPA JCC/FEDERATION, INC. also reserves the right to do any of the following, at any time, without notice: (1) modify, suspend, or terminate operation of or access to the site or any portion of the site, for any reason; (2) modify or change the site or any portion of the site; and (3) interrupt the operation of the site or any portion of the site as necessary to perform routine or non-routine maintenance, error correction, or other changes. Supplemental terms and conditions may apply to some TAMPA JCC/FEDERATION, INC. Services, such as rules for a particular competition, content, software, application, service or other activity, or terms that may accompany certain territories, content, products or software accessible through TAMPA JCC/FEDERATION, INC. Services.  If applicable, such supplemental terms and conditions will be disclosed to you in connection with such competition, content, product, software, application, service or activity and are incorporated by reference into these Terms.  Any supplemental terms and conditions are in addition to these terms and, in the event of a conflict, the supplemental terms will prevail over these Terms. If you do not agree to the supplemental terms and conditions disclosed, you must not use the applicable TAMPA JCC/FEDERATION, INC. Services. TAMPA JCC/FEDERATION, INC. ’s Services are for your personal or professional use, as indicated in any supplemental terms. Except as we specifically agree in writing, no element of TAMPA JCC/FEDERATION, INC. Services may be used or exploited in any way other than as part of TAMPA JCC/FEDERATION, INC. Services offered to you. You may own the physical media on which elements of TAMPA JCC/FEDERATION, INC. Services are delivered to you, but we retain full and complete ownership of TAMPA JCC/FEDERATION, INC. Services.  We do not transfer title, right, or interest to or license any portion of TAMPA JCC/FEDERATION, INC. Services to you. You agree to use TAMPA JCC/FEDERATION, INC. Services, including all features and functionalities associated therewith, in accordance with applicable laws, rules and regulations, or other restrictions on use of TAMPA JCC/FEDERATION, INC. Services or content therein. Changes We may change these Terms from time to time. The most recent version will replace and supersede all previous versions. We expressly reserve the right to make any changes that we deem appropriate from time to time to TAMPA JCC/FEDERATION, INC. Services or to any information, text, data, databases, graphics, images, sound recordings, audio and visual clips, logos, software, opportunities, features, services, and other materials within TAMPA JCC/FEDERATION, INC. Services. You should return to this page from time to time to review the rules applicable to using our TAMPA JCC/FEDERATION, INC. Services. By continuing to use TAMPA JCC/FEDERATION, INC. Services you will be deemed to have agreed to and accepted any amendments. If you do not agree to any change to these Terms, you are not authorized to use TAMPA JCC/FEDERATION, INC. Services. Compliance with Applicable Laws As a condition of your access to and use of our TAMPA JCC/FEDERATION, INC. Services, you agree that you will not use TAMPA JCC/FEDERATION, INC. Services for any purpose that is unlawful or prohibited by these Terms and that you will comply with all applicable laws, regulations, policies of all relevant jurisdictions, local rules regarding online conduct, and any conditions or restrictions imposed by these terms. Our TAMPA JCC/FEDERATION, INC. Services are offered for your personal and non-commercial use only, and you are prohibited from using and are expressly not granted the right to use TAMPA JCC/FEDERATION, INC. Services for any other purpose. Privacy Policy Please also review our Privacy Policy (https://www.jewishtampa.com/privacy-policy), which is incorporated in these Terms. Our Privacy Policy explains what data and/or personal information we collect about you and how we use and share your data and/or personal information. Information that you provide to us or that we collect about you and your Company through your access to and use of TAMPA JCC/FEDERATION, INC. Services is subject to our Privacy Policy. Your Data We will take commercially reasonable steps to ensure the integrity of our systems and prevent hacks. However, no system is impenetrable. You agree that we are not responsible for someone hacking your account. We may change TAMPA JCC/FEDERATION, INC. Services or suspend or cease performance of TAMPA JCC/FEDERATION, INC. Services at any time or for any reason. We also reserve the right to cancel or refuse TAMPA JCC/FEDERATION, INC. Services. We may also remove or edit content or delete accounts. Please refer to our Privacy Policy for a full disclosure on all of the ways we gather, use, disclose and manage your data. Links to Third Party Websites or Services TAMPA JCC/FEDERATION, INC. Services may integrate, be integrated into, or be provided in connection with third-party services and content. We cannot control the content on other websites or services, and we are not responsible for the content on those websites or services. By linking to such websites or services, we do not agree with or endorse the content or owners of those websites or services. You should read the terms of use agreements and privacy policies that apply to such third-party services and content. Please be aware that the content of those websites or services may also change from time to time. Even if we linked to something, we are not responsible for what is at the other end of the link. If you access a TAMPA JCC/FEDERATION, INC. Service using an Apple iOS, Android or Microsoft Windows-powered device or Microsoft Xbox One, Apple Inc., Google, Inc. or Microsoft Corporation, respectively, shall be a third-party beneficiary to this agreement.  However, these third-party beneficiaries are not a party to this contract and are not responsible for the provision or support of TAMPA JCC/FEDERATION, INC. Services.  You agree that your access to TAMPA JCC/FEDERATION, INC. Services using these devices or any similar devices also shall be subject to the usage terms set forth in the applicable third-party beneficiary’s terms of service. Communications Between Us and You If you communicate with TAMPA JCC/FEDERATION, INC. or sign up to receive our communications, you agree to receive emails and other communications, including but not limited to social media advertising, from us. You agree that electronic messages we send to you are communications “in writing” for legal purposes. We reserve the right to contact you by email for purposes of informing you of changes to TAMPA JCC/FEDERATION, INC. Services or these Terms. You agree that electronic messages we send to you are communications “in writing” for legal purposes. Your Representations You represent and warrant that no materials you submit to us or your use of TAMPA JCC/FEDERATION, INC. Services will violate, plagiarize, or infringe upon the rights of third parties or contain libelous or unlawful material. You represent that you are at least 18 years old. User Generated Content TAMPA JCC/FEDERATION, INC. may allow you to communicate, submit, upload, transmit, or otherwise make available text, images, audio, video, and other content through the sites (collectively, the “Submission(s)”), which may also be referred to as “User Content\" when posted by a user to a TAMPA JCC/FEDERATION, INC. site and which collectively are “Submission(s) including in the form of comments, feedback, submissions, or other information. By transmitting Submissions on or through the sites, you grant TAMPA JCC/FEDERATION, INC. a perpetual, irrevocable, worldwide, royalty-free, assignable, sublicensable license to use, reproduce, store, modify, display, distribute, prepare derivative works based on, and transmit such Submissions, and you waive any and all moral rights and publicity rights in such Submissions. TAMPA JCC/FEDERATION, INC. will not be required to treat any Submission as confidential and will not be liable for any ideas for its business (including without limitation, product, or promotion ideas) and will not incur any liability as a result of any similarities that may appear in future TAMPA JCC/FEDERATION, INC. business. TAMPA JCC/FEDERATION, INC. will be entitled to use the Submission for any noncommercial or other purpose whatsoever, without compensation to you or any other person sending the Submission. You acknowledge that you own whatever material you submit and use of your Submission by TAMPA JCC/FEDERATION, INC. will not infringe or violate the rights of any third party. You may not make any Submissions that (i) are or may reasonably be considered to be, harmful, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, pornographic, libelous, invasive of another's privacy, bigoted, hateful, or racially, ethnically or otherwise offensive or objectionable, (ii) violate any law, statute, ordinance, or regulation (including, but not limited to, those governing export control, intellectual property, consumer protection, unfair competition, anti-discrimination, or false advertising), (iii) are known by you to be false, inaccurate, or misleading, (iv) you have received compensation to submit to TAMPA JCC/FEDERATION, INC. A or to post to a TAMPA JCC/FEDERATION, INC. website without have disclosed that compensation to TAMPA JCC/FEDERATION, INC. and publicly in any posting if applicable, (v) result in spam to other users, or (vi) that contain any harmful or malicious software. TAMPA JCC/FEDERATION, INC. has the right, but not the obligation, to monitor, screen, block, post, remove, modify, store, and review Submissions or any other communications sent through this website, at any time and for any reason, including to ensure that Submissions conform to these terms, without prior notice to you. We are not responsible for, do not endorse or guarantee, and are not responsible for errors or omissions or the accuracy, integrity, or quality of the opinions, views, advice, or recommendations in any Submissions posted or sent by users. User Prohibited Conduct We grant you a non-exclusive, non-transferable, revocable license to access our TAMPA JCC/FEDERATION, INC. Services, as long as you agree with our Terms. You agree not to use our TAMPA JCC/FEDERATION, INC. Services to do anything illegal. You also agree that you will not do anything that violates these Terms. You agree not to knowingly or recklessly introduce a virus or other harmful component, or otherwise tamper with, impair or damage any TAMPA JCC/FEDERATION, INC. Service or connected network. You agree that you will not try to access another user’s data or do anything that prevents someone else from using our TAMPA JCC/FEDERATION, INC. Services. You agree not to remove or modify any copyright notice or trademark legend, author attribution, or other notice placed on or contained within any of the content. You may not access, use, or copy any portion of TAMPA JCC/FEDERATION, INC. Services through the use of bots, spiders, scrapers, web crawlers, indexing agents, or other automated devices or mechanisms. You may not probe, scan, or test the vulnerability of the website or any network connected to the site, nor breach the security or authentication measures on the site or any network connected to the site. You may not reverse look up, trace, or seek to trace any information on any other user of or visitor to the site, or any  TAMPA JCC/FEDERATION, INC. federation member or individual associated with TAMPA JCC/FEDERATION, INC. , including any TAMPA JCC/FEDERATION, INC. account not owned by you, to its source, or exploit the site or any service or information made available or offered by or through the site, in any way where the purpose is to reveal any information, including but not limited to personal identification or information, other than your own information, as provided for by the site. Intellectual Property The trademarks \" TAMPA JCC/FEDERATION, INC. \", \" (TJCCF)\", and logos are federal trademarks owned by TAMPA JCC/FEDERATION, INC. . TAMPA JCC/FEDERATION, INC. owns or licenses all data, content, graphics, forms, artwork, images, photographs, functional components and any software concepts and documentation and other material on, in or made available through TAMPA JCC/FEDERATION, INC. Services (“TAMPA JCC/FEDERATION, INC. Materials”), as well as the selection, coordination, arrangement, and organization and enhancement of TAMPA JCC/FEDERATION, INC. Materials. All TAMPA JCC/FEDERATION, INC. Materials are protected pursuant to copyright, trademark, patent and other applicable laws.  You agree not to remove or alter any copyright notice or any other proprietary notice on any TAMPA JCC/FEDERATION, INC. Materials. As between any user and TAMPA JCC/FEDERATION, INC. , all names, trademarks, service marks, certification marks, symbols, slogans or logos appearing on TAMPA JCC/FEDERATION, INC. Services are proprietary to TAMPA JCC/FEDERATION, INC. or its affiliates, licensors, or suppliers. Use or misuse of these trademarks is expressly prohibited and may violate federal and state trademark law. Under no circumstances will you have any rights of any kind in or to TAMPA JCC/FEDERATION, INC. Materials, other than the right to use TAMPA JCC/FEDERATION, INC. Materials in accordance with these Terms. Accounts, Passwords and Security Accounts Some TAMPA JCC/FEDERATION, INC. Services permit or require you to create an account to participate or to obtain additional benefits.  To create an account, you may be required to provide TAMPA JCC/FEDERATION, INC. with a username, password, and certain other information about yourself as set forth in our Privacy Policy.  You agree that any information you provide and maintain is accurate, current and complete, including your contact information for notices and other communications from us and your payment information.  You agree not to impersonate or misrepresent your affiliation with any person or entity, including using another person’s username, password or other account information, or another person’s name or likeness, or provide false details for a parent or guardian.  You agree that we may take steps to verify the accuracy of information you provide, including contact information for a parent or guardian. You agree to use a strong password to keep your account confidential, and to not license, sell, or transfer your account without our prior written approval. We have adopted and implemented a policy that provides for the termination, in appropriate circumstances, of the accounts of users who are repeat infringers of copyright.  In addition, we may suspend or terminate your account and your ability to use TAMPA JCC/FEDERATION, INC. Services if you engage in, encourage, or advocate for illegal conduct or if you fail to comply with these terms or any supplemental terms. Passwords and Security You agree that you will not share your account or account information with others. You are responsible for taking reasonable steps to maintain the confidentiality of your username and password, and you are responsible for all activities under your account that you can reasonably control.  You agree to promptly notify us of any unauthorized use of your username, password or other account information, or of any other breach of security that you become aware of involving your account or TAMPA JCC/FEDERATION, INC. Services. The security, integrity and confidentiality of your information are extremely important to us.  We have implemented technical, administrative and physical security measures that are designed to protect your information from unauthorized access, disclosure, use and modification. International Users If it is against the law to use our TAMPA JCC/FEDERATION, INC. Services where you are, or if it is unlawful to transfer your data to the United States, do not use our TAMPA JCC/FEDERATION, INC. Services. We make no representation that our Sites or Services are appropriate or available for use in locations other than the United States. If you choose to access our TAMPA JCC/FEDERATION, INC. Services from locations other than in the United States, you do so at your own initiative, at your own risk, and are responsible for complying with applicable local laws. Disclaimer of Warranties We may make improvements and/or changes in TAMPA JCC/FEDERATION, INC. Services at any time. We make no representations about the suitability, reliability, availability, timeliness, and accuracy of the sites, or information accessible therein. We make no representation that TAMPA JCC/FEDERATION, INC. Services and their content are free of viruses or other disabling devices or harmful components. THE SITES, TAMPA JCC/FEDERATION, INC. MATERIALS, USER CONTENT, SERVICES, PRODUCTS, INFORMATION AND OTHER MATERIALS ON, IN AND MADE AVAILABLE THROUGH THE SITES ARE MADE AVAILABLE “AS IS” AND “WITH ALL FAULTS.” USE OF THE SITES IS ENTIRELY AT YOUR OWN RISK. TAMPA JCC/FEDERATION, INC. AND ITS LICENSORS MAKE NO REPRESENTATIONS OR WARRANTIES, AND DISCLAIM ALL REPRESENTATIONS AND WARRANTIES, WITH RESPECT TO THE SITES, THE USER CONTENT, TAMPA JCC/FEDERATION, INC. MATERIALS, SERVICES, PRODUCTS, DATA AND OTHER MATERIALS ON, IN AND MADE AVAILABLE THROUGH THE SITES, EXPRESS OR IMPLIED, WRITTEN OR ORAL, ARISING FROM COURSE OF DEALING, COURSE OF PERFORMANCE, USAGE OF TRADE, OR OTHERWISE, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY, SYSTEMS INTEGRATION, NON-INTERFERENCE, QUALITY, TITLE, AND NON-INFRINGEMENT. THE ENTIRE RISK AS TO SATISFACTORY QUALITY, PERFORMANCE, ACCURACY, COMPLETENESS AND EFFORT WITH REGARD TO ANY AND ALL USER CONTENT, THE SITES, TAMPA JCC/FEDERATION, INC. MATERIALS, SERVICES, PRODUCTS, DATA AND OTHER MATERIALS ON, IN AND MADE AVAILABLE THROUGH THE SITES, IS WITH YOU. Limitation of Liability TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL TAMPA JCC/FEDERATION, INC. , ITS CONTRACTORS, SUPPLIERS, CONTENT-PROVIDERS, AND OTHER SIMILAR ENTITIES, AND THE OFFICERS, DIRECTORS, EMPLOYEES, REPRESENTATIVES, AND AGENTS OF EACH OF THE FOREGOING BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER, INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF USE, DATA OR PROFITS, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE OF TAMPA JCC/FEDERATION, INC. SERVICES, THE DELAY OR INABILITY TO USE TAMPA JCC/FEDERATION, INC. SERVICES, OR FOR ANY INFORMATION, SOFTWARE, PRODUCTS, SERVICES, OR RELATED GRAPHICS OBTAINED THROUGH TAMPA JCC/FEDERATION, INC. SERVICES, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY, OR OTHERWISE, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME STATES AND/OR JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CERTAIN DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU. Indemnification You agree to indemnify and hold harmless TAMPA JCC/FEDERATION, INC. and our affiliates and subsidiaries, and our respective officers, directors, employees, agents, and third parties for any losses, costs, liabilities and expenses (including reasonable attorney’s fees) relating to or arising out of your use of our TAMPA JCC/FEDERATION, INC. Services; breach of these Terms; any User Content provided by you; or your violation of any third-party rights. You will cooperate as fully as required by us in the defense or settlement of any claim. Arbitration In case of any disputes between us that cannot be resolved through informal discussions, you agree to submit such disputes to a neutral arbitration organization appointed by the American Arbitration Association and in accordance with the Federal Arbitration Act. The arbitrator’s decision and award is final. You and we also both agree not to disclose the contents of the arbitrator’s decisions related to the arbitration to anyone (except as required by law or for the purposes of enforcement or appeal of the arbitration award). Arbitration will cover all disputes and claims regarding these Terms, including tort claims, direct claims, or indirect claims. The arbitrator can issue rulings on any substantive or procedural issues arising in the dispute, including the scope of the dispute. This arbitration clause will continue to be valid even if these Terms are no longer valid for some reason. If you have a claim or dispute, you must contact us first, so we can try to resolve the matter. You agree to give us 60 days to try to resolve the dispute before requesting arbitration. The arbitration of any dispute or claim will follow the relevant rules of the American Arbitration Association as modified by these Terms. If you and we have to participate in arbitration of disputes between us, such arbitration shall take place in TAMPA, FLORIDA. The arbitrator may not award relief in excess of or contrary to what these Terms provide, order consolidation or arbitration on a class-wide or representative basis, award punitive or consequential damages or any other damages aside from the prevailing party’s actual damages, or order injunctive or declaratory relief, except that the arbitrator may award on individual basis damages required by statute and may order injunctive or declaratory relief pursuant to an applicable consumer protection statute. Judgment on any arbitration award may be entered in any court having proper jurisdiction. If any portion of this arbitration section is determined by a court to be inapplicable or invalid, then the remainder shall still be given full force and effect. There shall be no right or authority for any claims subject to this arbitration section to be arbitrated on a class action or consolidated basis or on bases involving claims brought in a purported representative capacity on behalf of the general public (including, but not limited to, as a private attorney general). You must contact us within one year of the date of the event or facts giving rise to a dispute or you will have waived the right to pursue a claim based on such event or facts. Class Action Waiver Any arbitration will be on an individual basis. By using our Site and Services, you agree that you cannot make “class action” claims. Unless both you and we agree, the arbitrator cannot group claims together. Copyright Infringement If you are a copyright owner or an agent of a copyright owner, and you believe that any content on the Site and Services, mobile apps, or other website or online services infringes such copyright(s), then you may submit a notification pursuant to the Digital Millennium Copyright Act of 1998 (the “DMCA”) by providing our Designated Copyright Agent with the following information in writing: ●      a physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed; ●      identification of the copyrighted work claimed to have been infringed; ●      identification of the material that is claimed to be infringing and information sufficient to permit us to locate the material; ●      contact information of the complainant, such as an address, telephone number, and, if available, an e-mail address; ●      a statement that the complainant has a good faith belief that use of the material is not authorized; and ●      a statement that the information in the notification is accurate, and under penalty of perjury, that the complainant is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed. The above information must be included in the Notice and submitted to our Designated Copyright Agent by mail and e-mail to the following address: TAMPA JCC/FEDERATION, INC. 13009 COMMUNITY CAMPUS DRIVE, TAMPA, FL 33625 (813) 264-9000 info@JewishTampa.com Termination/Access Restriction We reserve the right to prevent you from visiting our Site and Services and using TAMPA JCC/FEDERATION, INC. Services, without notice. TAMPA JCC/FEDERATION, INC. or you may cancel or terminate this agreement at any time. You may terminate this agreement by destroying all materials obtained from this site, and all related documentation. TAMPA JCC/FEDERATION, INC. may terminate this agreement immediately without notice if, in its sole judgment, you breach any term or condition of this agreement. Upon termination, you must destroy all materials. Governing Law and Enforceability This agreement and our TAMPA JCC/FEDERATION, INC. Services are governed by the laws of the State of New York. You and your Company agree that the courts of the State of New York have exclusive jurisdiction over any matters, disputes, and claims relating to the content, use of, or any other matter relating to our TAMPA JCC/FEDERATION, INC. Services. If you are in a location that does not permit any of the terms in this agreement, you agree you will not use our TAMPA JCC/FEDERATION, INC. Services. Using TAMPA JCC/FEDERATION, INC. Services does not mean that there exists a joint venture, employment, or partnership between or among us. If any part of this agreement invalid or unenforceable, the rest of the agreement will continue to be valid and enforceable. This agreement and the Privacy Policy is the entire agreement between you and us. The most recent version of the Terms is the valid version. Please review the Last Updated date at the bottom of these Terms. Contact Us If you have any questions or comments, please contact us. We welcome your questions regarding these terms: TAMPA JCC/FEDERATION, INC. 13009 COMMUNITY CAMPUS DRIVE, TAMPA, FL 33625 (813) 264-9000 info@JewishTampa.com Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.jewishpresstampabay.com/contact-us/",
      "text": "Contact Us - Jewish Press Group of Tampa Bay, Inc. Search for: Search Submit Select Your Community ▼ Tampa Edition Florida’s Gulf Coast Edition Log In JP – Tampa Edition JP – Florida’s Gulf Coast Edition About Us The Jewish Press Story Advertise Deadlines Press Release Deadlines PR Info Submission Forms Home Delivery Contact Us Staff Directory Privacy Policy Login Thursday, September 11, 2025 About Us Advertise Media Kit Ad Deadlines Classifieds Mechanicals Design Service PR Info Press Release Guidelines Submit Press Release Press Release Deadlines Submission Forms Submit Anniversary Announcement Submit Bar/Bat Mitzvahs Submit Birth Announcement Submit Letters to the Editor Submit Obituary Submit Press Release Submit Wedding/Engagement Announcement Delivery Contact Us Staff Directory Archives Florida’s Gulf Coast Edition Tampa Edition Print Edition Archives Florida’s Gulf Coast Edition Tampa Edition Contact Us Jewish Press Contact Information and Policies Jewish Press of Tampa Bay 13009 Community Campus Drive Tampa, Florida 33625 Telephones: 727.535.4400 Tampa Line: 813.871.2332 Email: info@jewishpresstampabay.com The Jewish Press of Tampa Bay is a collaborative effort of the Tampa JCCs and Federation and the Jewish Federation of Florida’s Gulf Coast. The editorial control remains solely with the paper, to assure journalistic integrity and impartiality. The Jewish Press assumes no responsibility for the opinions of columnists, letter writers nor the claims of advertisers. The Jewish Press does not guarantee the kashruth of products & services advertised or mentioned otherwise within, nor can the Jewish Press guarantee the exact date of delivery by the U.S. Postal Service. Submission and/or publication of information and photographs automatically gives the Jewish Press the right to post such on its websites. The Jewish Press of Tampa Bay is a collaborative effort of the Tampa JCCs and Federation and the Jewish Federation of Florida’s Gulf Coast. 13009 Community Campus Drive, Tampa, Florida 33625 Info@JewishPressTampaBay.com Gulf Coast - 727.535.4400 Hillsborough - 813.871.2332 Home Tampa JP Gulf Coast JP About Us Contact Us Privacy Policy Our Hometown DMCA Notices Newspaper website content management software and services Copyright © 2025 Jewish Press Group of Tampa Bay, Inc. All Rights Reserved. By continuing to browse or by clicking \"Accept,\" you agree to our site's privacy policy. Accept Privacy policy"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/my-dearest-enemy-april-12",
      "text": "Presented by Tampa Bay Jewish Film Festival : My Dearest Enemy \n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery Apr 12 2022 My Dearest Enemy | April 12 7:30PM - 9:30PM Studio Movie Grill 7718 113th St N Seminole, FL 33772 http://tbjff.org Contact Brandy Gold 813-769-4725 brandy.gold@jewishtampa.com My Dearest Enemy Studio Movie Grill Tampa Bay Jewish Film Festival April 12, 2022 7:30 PM Run Time 1 hr 40 minutes / Drama / Directors Tzipi Trope / Israel / 2019/ Language Hebrew with English Subtitles My Dearest Enemy tells the story of a friendship between two women, Alice, an Israeli Arab professor and Maya, a Jewish artist, who met at age 14 in Jerusalem. The film spans over 25 years as they struggle to keep their friendship in the midst of their communities’ ever growing toxic conflict. Register 0 Print Add To My Google Calendar Export iCal TBJFF Featured Share Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.tbjff.org/tampa-bay-jewish-film-festival-/tbjff/conversation-caf-led-by-sabina-goldgof-22",
      "text": "Conversation Café led by Sabina Goldgof\n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery Apr 4 2022 Conversation Café led by Sabina Goldgof 8:45PM - 9:30PM AMC Veteran’s 24 Contact Brandy Gold 813-769-4725 brandy.gold@jewishtampa.com Conversation Café led by Sabina Goldgof April 4  | AMC Veteran’s 24 | 8:45 PM Join us for complimentary coffee and engaging conversation directly following the film Portrayal . 0 Print Add To My Google Calendar Export iCal CC Share Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://www.jewishpresstampa.com/contact-us/",
      "text": "Contact Us - Jewish Press - Tampa Edition Search for: Search Submit Select Your Community ▼ Tampa Edition Florida’s Gulf Coast Edition Front Page World News Federation Schools Social Services Organizations Candlelighting Times Congregations Rabbinically Speaking Religious Directory Bar/Bat Mitzvahs Senior Living Obituaries Culture Jewish Press of Tampa Bay Group Homepage JP – Tampa Edition JP – Florida’s Gulf Coast Edition Archives PDF Archives Staff Login 2025-09-01 E-Edition Shana Tova The Jew Who Called out Harvard Local Teen Builds Pride and Skills on National Stage The Noach Extravaganza Congregation Beth Am Invites All to First-Ever Community Yizkor on Yom Kippur Reversing course, Philadelphia Jewish museum says it will rehang Israeli flag Turning the Page on Rosh Hashanah and the High Holy Days Protecting our Community – Emergency Operations Planning Elly Bovarnick Thursday, September 11, 2025 Latest Edition 2025-09-01 E-Edition Home About Us Advertise Media Kit Ad Deadlines Classifieds Mechanicals Design Service PR Info Press Release Guidelines Submit Press Release Press Release Deadlines Submission Forms Submit Anniversary Announcement Submit Bar/Bat Mitzvahs Submit Birth Announcement Submit Letter to the Editor Submit Obituary Submit Press Release Submit Wedding/Engagement Announcement Delivery Contact Us Staff Directory Archives Florida’s Gulf Coast Edition Tampa Edition Print Edition Archives Florida’s Gulf Coast Edition Tampa Edition News Front Page World News Community Federation Schools Social Services Organizations Columns Religious Life Candlelighting Times Congregations Rabbinically Speaking Religious Directory Lifecycle Anniversaries Bar/Bat Mitzvahs Bar-Bat Mitzvah Guide Senior Living Births Obituaries Weddings and Engagements Wedding Guide 2024 Culture Contact Us The Jewish Press Group of Tampa Bay, Inc., publisher of the Jewish Press of Tampa Bay/Tampa Edition and Jewish Press of  Tampa Bay/Pinellas Edition 6416 Central Ave. St. Petersburg, FL 33707 Telephones: 727.535.4400 Tampa Line: 813.871.2332 (rings in Pinellas office) Email: info@jewishpresstampabay.com The Jewish Press of Tampa Bay/ Tampa Edition and the Jewish Press of Tampa Bay/Pinellas Edition are published in cooperation with the Tampa JCCs & Federation and the Jewish Federation of Florida’s Gulf Coast, respectively. The editorial control remains solely with the paper, to assure journalistic integrity and impartiality. The Jewish Press assumes no responsibility for the opinions of columnists, letter writers nor the claims of advertisers. The Jewish Press does not guarantee the kashruth of products & services advertised or mentioned otherwise within, nor can the Jewish Press guarantee the exact date of delivery by the U.S. Postal Service. Submission and/or publication of information and photographs automatically gives the Jewish Press the right to post such on its websites. Latest Editions 2025-09-01 E-Edition 2025-08-18 E-Edition 2025-08-04 E-Edition The Jewish Press of Tampa Bay is a collaborative effort of the Tampa JCCs and Federation and the Jewish Federation of Florida’s Gulf Coast. 13009 Community Campus Drive, Tampa, Florida 33625 Info@JewishPressTampaBay.com Gulf Coast - 727.535.4400 Hillsborough - 813.871.2332 Home Tampa JP Gulf Coast JP About Us Contact Us Privacy Policy Our Hometown DMCA Notices Newspaper website content management software and services Copyright © 2025 Jewish Press Group of Tampa Bay, Inc. All Rights Reserved. We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://www.tbjff.org/",
      "text": "Tampa Bay Jewish Film Festival | TBJFF.ORG\n | Tampa Bay Jewish Film Festival | TBJFF.ORG Tampa Bay Jewish Film Festival | TBJFF.ORG GIVE Menu Email Us Search Email Us About Sponsors STARR Award Film Descriptions Photo Gallery Upcoming Events Thank You to all of our Sponsors, Judges, and Film Fest Fans for an outstanding 29th Year! Check-back soon for more movie experiences coming from the TBJFF and watch for our new photo page updates! Check out the photo gallery from the 2025 Film Festival Produced by: For more information contact Brandy Gold brandy.gold@jewishtampa.com or call (813) 769-4725 Share Visit Our Other Sites: Shanna & Bryan Glazer JCC Florida-Israel Business Accelerator JCC On The Cohn Campus Tampa Jewish Federation Tampa's Premier Event Venue TOP Jewish Foundation Weinberg Village Assisted Living Support Us Support Us Be a Sponsor CONTACT US Brandy Gold Tampa Bay Jewish Film Festival 13009 Community Campus Drive Tampa, FL 33625 813.769.4725 webmaster@jewishtampa.com Copyright © 2025 Tampa Bay Jewish Film Festival. All Rights Reserved. Powered by FEDWEB ® Central Privacy Policy Terms of Use"
    },
    {
      "url": "https://miamijewishfilmfestival.org/contact/",
      "text": "Miami Jewish Film Festival: Contact Us Skip to main content About Us Contact Us FAQ Festival Archive History Security Venues Volunteer Membership Donate Membership Next Wave News In the News The Latest Schedule Calendar Events Sponsors 2026 Sponsors Become a Sponsor Donate Contact Us General Inquiries Mailing Address: Miami Jewish Film Festival 4200 Biscayne Blvd Miami Fl 33137 T: +1 305 573 7304 Email: info@miamijewishfilmfestival.org Festival Team Igor Shteyrenberg , Executive Director Judith Vigil , Associate Director Douglass Gavilan , Operations Manager Mercy Deloach , Festival Manager Mark Yates , Volunteer Coordinator Debbie Brodie-Weiss , Director of Development Advisory Board Bonnie Aibel Tammy Aronson Berenice Chadowitz Raquel Di Capua Evelyn Faigenblat Barbara Black Goldfarb Gail Harris Alison Mars Elena Salomon Joan Schaeffer David Scharlin Adrienne Scheck Rose Schreiber Cynthia Soloway Tracey Stein Audrey Weiner Your Information Email * First Name * Last Name * City State Choose... Alabama Alaska Arizona Arkansas Armed Forces, the Americas Armed Forces, Europe Armed Forces, Pacific California Colorado Connecticut District of Columbia Delaware Federated States of Micronesia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Marshall Islands Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Marianas Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Virgin Islands Washington West Virginia Wisconsin Wyoming ZIP Code * Phone Your Message Subject * Message * Send Message * Required information Miami Jewish Film Festival | 4200 Biscayne Boulevard | Miami, FL | 33137 | 305-573-7304 | info@miamijewishfilmfestival.org © 2025 by Miami Jewish Film Festival | Privacy Policy | Powered by ARCOS | Design by Plus Three"
    }
  ]
}