{
  "fuentes": [
    {
      "url": "https://www.coastalrealtyfl.com/blog/guide-st-augustine-amphitheatre",
      "email": "rentals@coastalrealtyfl.com"
    },
    {
      "url": "https://historiccoastculture.com/venue/st-augustine-amphitheatre-front-porch-stage/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/venue/st-augustine-amphitheatre-front-porch-stage/",
      "email": "ampinfo@sjcfl.us"
    },
    {
      "url": "https://historiccoastculture.com/venue/st-augustine-amphitheatre-front-porch-stage/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.staugustine.com/story/news/local/2018/07/22/from-humble-beginnings-to-bright-future-how-st-augustine-amphitheatre-raised-its-profile/11190368007/",
      "email": "cjones@staugustine.com"
    },
    {
      "url": "https://www.historiccoastculture.com/event/the-amp-night-market-live-music-by-remedy-tree-and-atlantic-alibi/",
      "email": "x@2x.png"
    },
    {
      "url": "https://www.historiccoastculture.com/event/the-amp-night-market-live-music-by-remedy-tree-and-atlantic-alibi/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.historiccoastculture.com/event/the-amp-night-market-square-dance-harvest/",
      "email": "x@2x.png"
    },
    {
      "url": "https://www.historiccoastculture.com/event/the-amp-night-market-square-dance-harvest/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.theamp.com/contact-us",
      "email": "ampinfo@theamp.com"
    },
    {
      "url": "https://www.theamp.com/events/detail/st-johns-county-fight-night",
      "email": "kpadgett@sjso.org"
    }
  ],
  "mails": [
    "ampinfo@sjcfl.us",
    "ampinfo@theamp.com",
    "cjones@staugustine.com",
    "kpadgett@sjso.org",
    "rentals@coastalrealtyfl.com",
    "sjcc@historiccoastculture.com",
    "x@2x.png"
  ],
  "nombre_sitio": "theamp.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.coastalrealtyfl.com/blog/guide-st-augustine-amphitheatre",
      "text": "A Guide to the St. Augustine Amphitheater | St. Augustine Travel Blog Skip to main content 800-587-2287 Menu Vacation Rentals Rentals by Name Specials Search by Community Pet Friendly Oceanfront Oceanside Crescent Beach Premier/Luxury Book Direct Rental Policies Long Term Rentals Association Management Things To Do Activities Blog Events Best Time to Visit Winter Guide Turtle Nesting Season Vacation Rental Guide About Us Vacation Rental Management Sales Timeshares Employment Opportunities Coastal Cares Contact Us Hurricane Info You are here Home A Guide to The St. Augustine Amphitheatre While the Nation's Oldest City is known for its beautiful beaches and historic attractions that attract millions of visitors each year, St. Augustine also has numerous facilities that host community events, live music concerts, and cultural experiences. One of the most popular entertainment spots is the St. Augustine Amphitheatre. The St. Augustine Amphitheatre is a 4,100-seat covered outdoor amphitheater that began as a home for the State of Florida's annual Cross & Sword production, which dramatized the history of Pedro Menendez landing and settling in St. Augustine over 450 years ago. After the show's 32-year run ended in 1996, St. Johns County refurbished the site and a new era of entertainment was born for St. Augustine. While COVID-19 did impact 2020 concert events for the Amphitheatre, new shows are being scheduled all the time, with updated safety measures in place.  The facility undergoes enhanced cleaning, promotes social distancing by reducing capacity to events and having designated seating, and also requires all attendees to wear a face mask and get a temperature screening upon arrival.  Guests are able to remove their masks in their ticketed seat.  For more information, please visit the St. Augustine Amphitheatre . Whether you're in town to attend one of the amazing concerts \"The Amp\" hosts or just happen to drive by and see it on the way to the Historic District from your beachside condo, here's everything you can do at the St. Augustine Amphitheatre: World-Class Music Performances What better way to remember St. Augustine as a fantastic beach destination than to attend an unbelievable live concert put on by one of your favorite bands! From Robert Plant to Jack Johnson, John Legend to Sublime, The Amp has hosted hundreds of popular musicians to sold-out crowds. Enjoy a crafted cocktail made with local St. Augustine Distillery spirits as you sing your favorite songs. The venue offers free parking shuttles a few blocks away at Anastasia State Park, but if you don't feel like waiting in line, splurge on a $20 premium parking ticket when you purchase your concert tickets so you can park in the amphitheatre's premium lot. Free Concerts at the Sing Out Loud Festival Did you say FREE CONCERTS?! We sure did! The annual Sing Out Loud Festival, which takes place every September, is an amazing way to experience local, regional, and national artists without spending a dime. The Amp utilizes all three of its stages, and along with numerous other participating venues, such as Colonial Oak Music Park and Sarbez, visitors have the opportunity to discover new musicians while enjoying different areas of Historic St. Augustine. Cultural Community Events From children's arts & crafts festivals to musical presentations, guests of all ages can gain cultural awareness during one of The Amps community events, many of which are free. Not only will you enjoy an awesome day or night out with your family, but you'll also be participating in community outreach that will enhance the local St. Augustine cultural scene for many years to come. The Farmer's Market & Night Market More FREE events?! Yes indeed! The Farmer's Market is free and open to the public ever Saturday from 8:30 am to 12:30 pm. Fresh, locally grown produce, prepared foods, and arts & crafts are available for everyone to browse through and purchase. Seasonally, The Night Market takes place every second & fourth Tuesday from March through October from 6 pm to 9 pm. Besides having access to more local vendors, The Night Market adds food options for dinner, a full bar, and live music.  And again, admission and parking are free! Secure St. Augustine Vacation Rentals With Us Grab those concert tickets and reserve a dream vacation in one of our stunning beachside or oceanfront condominiums. Contact us today for more information on how to make your St. Augustine vacation filled with non-stop fun and unforgettable memories. Categories: Trip Planning Recent Blog Posts Don’t Miss These Exciting Events and Fall Festivals in St. Augustine FL Experience the Best Ghost Tours in St. Augustine St. Augustine Outdoor Activities That Are Worth Your Time St. Augustine on a Budget: 15 Free Things to Do How to Have the Best St. Augustine Vacation This Summer Blog Posts Trip Planning (24) Featured St. Augustine Vacation Rentals (6) Things to do in St. Augustine (32) General (2) Holidays (1) Annual Events (1) Outdoor Activities (1) Arrival * Departure * Adults Adults: 1 Adults: 2 Adults: 3 Adults: 4 Adults: 5 Adults: 6 Adults: 7 Adults: 8 Adults: 9 Adults: 10 Children Children: 0 Children: 1 Children: 2 Children: 3 Children: 4 Children: 5 Children: 6 Children: 7 Children: 8 Children: 9 Children: 10 Facebook Instagram Youtube Coastal Realty & Property Management 3942 A1A South St. Augustine , Florida - 32080 United States 800-587-2287 [email protected] About Coastal Realty With over 30 years in the vacation rental and property management industries, Coastal Realty has a passion for offering the best customer experience by providing personal, hands-on service.  Our offices and vacation rental properties are all located in beautiful St. Augustine, Florida. Quick Links Vacation Rental Policies Guest Login Rental Owner Login Contact Us Search rentals by name. Search by Title Anastasia 103 Anastasia 107 Anastasia 110 Anastasia 201 Anastasia 203 Anastasia 206 Anastasia 215 Anastasia 309 Anastasia 311 Anastasia 409 Anastasia 410 Anastasia 412 Anastasia 502 Anastasia 505 Anastasia 506 Anastasia 507 Anastasia 511 Anastasia 516 Anastasia 602 Anastasia 603 Anastasia 614 Anastasia 701 Anastasia 704 Anastasia 708 Barefoot 113 Barefoot Trace 103 Barefoot Trace 105 Barefoot Trace 109 Barefoot Trace 114 Barefoot Trace 115 Barefoot Trace 202 Barefoot Trace 204 Barefoot Trace 206 Barefoot Trace 207 Barefoot Trace 209 Barefoot Trace 211 Barefoot Trace 212 Barefoot Trace 213 Barefoot Trace 215 Barefoot Trace 217 Barefoot Trace 303 Barefoot Trace 310 Barefoot Trace 311 Barefoot Trace 312 Barefoot Trace 314 Barefoot Trace 316 Barefoot Trace 401 Barefoot Trace 409 Barefoot Trace 410 Barefoot Trace 414 Creston House 10A Creston House 10C Creston House 11B Creston House 11C Creston House 12B Creston House 12E Creston House 1A Creston House 1C Creston House 1D Creston House 1E Creston House 2D Creston House 3C Creston House 3E Creston House 4A Creston House 4C Creston House 5A Creston House 5B Creston House 5E Creston House 6A Creston House 6C Creston House 6D Creston House 6E Creston House 8E Creston House 9A Creston House 9B Creston House 9C Island South 02 Island South 05 Island South 12 Island South 13 Island South 20 Island South 22 Island South 25 Island South 26 Island South 33 Island South 35 Island South 36 Ocean & Racquet Club 5315 Ocean Club I Unit 32 Ocean Club II Unit 19 Ocean Sunrise 505 Ocean Sunrise 603 Ocean Village Club A17 Ocean Village Club A25 Ocean Village Club A32 Ocean Village Club B26 Ocean Village Club B31 Ocean Village Club B33 Ocean Village Club C14 Ocean Village Club C15 Ocean Village Club C17 Ocean Village Club C24 Ocean Village Club D12 Ocean Village Club D14 Ocean Village Club D16 Ocean Village Club D17 Ocean Village Club D21 Ocean Village Club D22 Ocean Village Club D25 Ocean Village Club D31 Ocean Village Club D36 Ocean Village Club E22 Ocean Village Club E31 Ocean Village Club F15 Ocean Village Club F16 Ocean Village Club F17 Ocean Village Club F21 Ocean Village Club F22 Ocean Village Club F25 Ocean Village Club F26 Ocean Village Club F33 Ocean Village Club F34 Ocean Village Club F36 Ocean Village Club G15 Ocean Village Club G16 Ocean Village Club G22 Ocean Village Club G24 Ocean Village Club G25 Ocean Village Club G32 Ocean Village Club G33 Ocean Village Club H14 Ocean Village Club H21 Ocean Village Club H26 Ocean Village Club H31 Ocean Village Club H35 Ocean Village Club I15 Ocean Village Club I21 Ocean Village Club I23 Ocean Village Club I25 Ocean Village Club J12 Ocean Village Club J15 Ocean Village Club J16 Ocean Village Club J17 Ocean Village Club J26 Ocean Village Club J31 Ocean Village Club J33 Ocean Village Club J36 Ocean Village Club K11 Ocean Village Club K14 Ocean Village Club K15 Ocean Village Club K16 Ocean Village Club K17 Ocean Village Club K22 Ocean Village Club K24 Ocean Village Club K25 Ocean Village Club K26 Ocean Village Club K32 Ocean Village Club L16 Ocean Village Club L23 Ocean Village Club L24 Ocean Village Club L26 Ocean Village Club L31 Ocean Village Club L35 Ocean Village Club M12 Ocean Village Club M21 Ocean Village Club N12 Ocean Village Club N15 Ocean Village Club N21 Ocean Village Club N22 Ocean Village Club N23 Ocean Village Club N25 Ocean Village Club N31 Ocean Village Club N34 Ocean Village Club N36 Ocean Village Club O11 Ocean Village Club O16 Ocean Village Club O18 Ocean Village Club O19 Ocean Village Club O21 Ocean Village Club O22 Ocean Village Club O23 Ocean Village Club O26 Ocean Village Club O32 Ocean Village Club O36 Ocean Village Club O38 Ocean Village Club P12 Ocean Village Club P14 Ocean Village Club P16 Ocean Village Club P17 Ocean Village Club P18 Ocean Village Club P22 Ocean Village Club P23 Ocean Village Club P25 Ocean Village Club P27 Ocean Village Club P28 Ocean Village Club P31 Ocean Village Club P36 Ocean Village Club Q16 Ocean Village Club Q17 Ocean Village Club Q19 Ocean Village Club Q22 Ocean Village Club Q23 Ocean Village Club Q24 Ocean Village Club Q26 Ocean Village Club Q28 Ocean Village Club Q31 Ocean Village Club Q33 Ocean Village Club R12 Ocean Village Club R14 Ocean Village Club R15 Ocean Village Club R18 Ocean Village Club R22 Ocean Village Club R23 Ocean Village Club R25 Ocean Village Club R28 Ocean Village Club R34 Ocean Village Club R35 Ocean Village Club R36 Point Matanzas A-2 Ponce Landing 04 Ponce Landing 13 Ponce Landing 16 Ponce Landing 40 Quail Hollow A2-1D Quail Hollow A6-3U Quail Hollow B1-2TH Sand Dollar 1-105 Sand Dollar 1-106 Sand Dollar 1-202 Sand Dollar 1-206 Sand Dollar 1-207 Sand Dollar 1-306 Sand Dollar 1-404 Sand Dollar 1-408 Sand Dollar 1-504 Sand Dollar 1-506 Sand Dollar 2-101 Sand Dollar 2-107 Sand Dollar 2-108 Sand Dollar 2-202 Sand Dollar 2-302 Sand Dollar 2-405 Sand Dollar 3-106 Sand Dollar 3-304 Sand Dollar 3-405 Sand Dollar 3-407 Sand Dollar 3-604 Sea Haven 522 Sea Place 11104 Sea Place 11110 Sea Place 11202 Sea Place 11206 Sea Place 12113 Sea Place 12119 Sea Place 12125 Sea Place 12214 Sea Place 12229 Sea Place 14152 Sea Place 14254 Sea Place 14266 Sea Place 15269 Sea Place 15271 Sea Place 15274 Sea Place 15277 Sea Place 15278 Sea Winds 16 Sea Winds 26 Seaside at Anastasia A205 Seaside at Anastasia A206 Seaside at Anastasia A301 Seaside at Anastasia A303 Seaside at Anastasia A304 Seaside at Anastasia B105 Seaside at Anastasia C101 Seaside at Anastasia C202 Seaside at Anastasia C203 Seaside at Anastasia D205 Seaside at Anastasia E102 Seaside at Anastasia E204 Seaside at Anastasia E302 Seaside at Anastasia E305 Seaside at Anastasia F101 Seaside at Anastasia F105 Seaside at Anastasia F203 Seaside at Anastasia F305 Seaside at Anastasia G302 Spanish Trace 103 Spanish Trace 106 Spanish Trace 109 Spanish Trace 117 Spanish Trace 220 Spanish Trace 223 Spanish Trace 234 Spanish Trace 237 Spanish Trace 238 Spanish Trace 247 Spanish Trace 455 St Augustine Beach & Tennis Club 113 St Augustine Beach & Tennis Club 115 St Augustine Beach & Tennis Club 120 St Augustine Beach & Tennis Club 121 St Augustine Beach & Tennis Club 124 St Augustine Beach & Tennis Club 201 St Augustine Beach & Tennis Club 202 St Augustine Beach & Tennis Club 213 St Augustine Beach & Tennis Club 214 St Augustine Beach & Tennis Club 224 St Augustine Beach & Tennis Club 303 St Augustine Beach & Tennis Club 306 St Augustine Beach & Tennis Club 308 St Augustine Beach & Tennis Club 316 St Augustine Beach & Tennis Club 401 St Augustine Beach & Tennis Club 409 St Augustine Beach & Tennis Resort 1001 St Augustine Beach & Tennis Resort 1002 St Augustine Beach & Tennis Resort 503 St Augustine Beach & Tennis Resort 507 St Augustine Beach & Tennis Resort 519 St Augustine Beach & Tennis Resort 520 St Augustine Beach & Tennis Resort 604 St Augustine Beach & Tennis Resort 611 St Augustine Beach & Tennis Resort 615 St Augustine Beach & Tennis Resort 619 St Augustine Beach & Tennis Resort 807 St Augustine Beach & Tennis Resort 808 St Augustine Beach & Tennis Resort 810 St Augustine Beach & Tennis Resort 819 St Augustine Beach & Tennis Resort 901 St Augustine Beach & Tennis Resort 903 St Augustine Beach & Tennis Resort 906 St Augustine Beach & Tennis Resort 907 Summerhouse 168 Tradewinds 161 Tradewinds 51 Tradewinds 53 Tradewinds 61 Tradewinds 63 Windjammer 109 Windjammer 114 Windjammer 116 Windjammer 201 Windjammer 209 Windjammer 210 Windjammer 212 Windjammer 213 Windjammer 216 Windjammer 302 Windjammer 307 Windjammer 312 Windjammer 404 Windjammer 407 Windjammer 408 Windjammer 410 Windjammer 415 Login | Proudly built by Bluetent |\n        © 2025"
    },
    {
      "url": "https://historiccoastculture.com/venue/st-augustine-amphitheatre-front-porch-stage/",
      "text": "St. Augustine Amphitheatre - Front Porch Stage - HistoricCoastCulture.com St. Augustine Amphitheatre - Front Porch Stage - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Venue Type Amphitheatre Amusement Park Bar/Tavern Bookstore Business/Company Campground Church College/University Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Golf Club Historic Building/Landmark Hotel/Inn Library Meeting Space Movie Theater Museum Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater Zoo State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue St. Augustine Amphitheatre - Front Porch Stage Facebook Twitter Linkedin Print St. Augustine Amphitheatre - Front Porch Stage Just like at home, The Front Porch Stage is the perfect gathering spot. This 4,800 square foot deck features an area for artists to play and the community to gather during our Farmers Market and Night Market or to just hangout before a show. The Front Porch is located at the entrance of the venue, to the right of the Box Office. Unveiled in 2017, The Front Porch was made possible through the generous support of Canan Law. Just like at home, The Front Porch Stage is the perfect gathering spot. This 4,800 square foot deck features an area for artists to play and the community to gather during our Farmers Market and Night Market or to just hangout before a show. The Front Porch is located at the entrance of the venue, to the right of the Box Office. Unveiled in 2017, The Front Porch was made possible through the generous support of Canan Law. View less MORE ABOUT THIS VENUE Venue Type: Amphitheatre ; Concert Hall LOCATION St. Augustine Amphitheatre - Front Porch Stage 1340C A1A South, St. Augustine, FL 32080 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette PAST EVENTS Pecha Kucha's Release the Kraken Presented by Pecha Kucha at St. Augustine Amphitheatre - Front Porch Stage Jan 25, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION Contact information Email / Website / Facebook / 1340C A1A South, St. Augustine, FL 32080 904-209-0367 Find A Venue Search by Keyword Venue Type Amphitheatre Amusement Park Bar/Tavern Bookstore Business/Company Campground Church College/University Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Golf Club Historic Building/Landmark Hotel/Inn Library Meeting Space Movie Theater Museum Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater Zoo State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access Featured Venues Lightner Museum With sparkling crystal chandeliers, intricate mosaic tile flooring, majestic arched windows, and carved wooden staircases, Lightner Museum is a show-stopper! The museum opened in 1948, displaying the collections of Otto C. Lightner, which include 19th-century artwork, glassware, sculpture, furniture, stained glass, and antique chandeliers throughout the three floors of exhibits. Originally built as the Hotel Alcazar in 1888 by Standard Oil co-founder Henry Flagler, this beautiful structure was created in the Spanish Renaissance Revival Style. In addition to the Lightner Museum, it also houses St. Augustine City Hall, several antique shops, and Cafe Alcazar, a restaurant that sits in the location of what was once the world’s largest indoor swimming pool. Beluthahatchee Park Beluthahatchee Park is a four-acre park located within the 70-acre tract of land purchased by Stetson Kennedy in 1948 after the 18-acre Beluthahatchee Lake was created by impounding Mill Creek in 1945. This lake meanders through a natural basin and is surrounded by high bluffs, currently owned by the Lake Dwellers Association, a non-profit Florida corporation formed by the lakefront residents. In 1949, the 70-acre tract was subdivided and platted by the owner/developer Stetson Kennedy who recorded the restrictive covenants setting aside land in perpetuity as a wildlife refuge, and stipulating that residential construction be consistent with the developer’s goal of “serving as a working demonstration that human and natural habitat need not be mutually exclusive, but can coexist in harmony.” DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.staugustine.com/story/news/local/2018/07/22/from-humble-beginnings-to-bright-future-how-st-augustine-amphitheatre-raised-its-profile/11190368007/",
      "text": "Venue joins elite company News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals LOCAL Venue joins elite company How the St. Augustine Amphitheatre came to among best in the world Colleen Jones cjones@staugustine.com When the St. Augustine Amphitheatre first opened in 1965, it played one show — just one — over and over and over, for the next 32 years. Of course, it was not just any show. Renowned playwright Paul Green was commissioned to create a dramatic rendition of how St. Augustine was founded on the occasion of the city's 400th anniversary and it became part of a historic pilgrimage of sorts for visitors. A much smaller facility at the time, the Amphitheatre, carved out of 16 acres off Route A1A South, sat only 2,000 people. \"A lot of people remember coming here as a kid and seeing it,\" said Ryan Murphy, director of the St. Johns County Cultural Events Division and Amphitheatre general manager. In 1973, \"Cross and Sword\" was designated as \"Florida's Official State Play\" by the state Legislature. The play ran until 1997, with budget constraints and the public's changing appetite for entertainment contributing to its demise. The outdoor concert space, now revamped and modernized, attracts A-list acts like Steve Miller, Jack Johnson, Kid Rock, Little Richard and Willie Nelson. It was recently ranked No. 4 of of the Top 50 Amphitheaters in the world by Pollster, based on ticket sales. Murphy said the ranking was even more significant because the Amphitheatre was compared much larger venues. With a maximum capacity of just 4,100, Murphy said, \"We have to do three to four shows to compete with their one [in ticket sales].\" Murphy, who has been with the Amphitheatre for the last nine years, gave the large-scale renovation of the performance space much of the credit for the success it is enjoying. In 2002, St. Johns County acquired the property and began managing the Amphitheatre. The first order of business was resurrecting the community asset. While the venue had served as the host to annual Shakespeare festivals from 1997 to 2003, it remained largely vacant and time and the elements had taken their toll. \"It was in pretty bad shape at that time; it hadn't been maintained,\" said Tommy Bledsoe, who formerly had Murphy's position, coming into the organization in 2002. \"The building was in bad shape and the concession stand and bathrooms were just rudimentary.\" Five years of construction and a $9 million investment later (the original structure was demolished and a new one built in its place), the St. Augustine Amphitheatre ushered in a new era in its history, reopening in 2007. Bledsoe said the County had originally earmarked about $5 million to $6 million for the renovation but, he said, \"As we got into it, we were thinking of something at a much higher level.\" The final design included semicircular, tiered rows, with lawn space for additional seating and a tinseled fiberglass canopy suspended over the main stage. With 75,000 tickets sold in just the last six months alone, the concert venue has managed to raise its profile over these years,  attracting more and more people — a great many of them from out of town, which also boosts tourism. It also continues to book top acts, which Bledsoe attributes to Murphy's skill as a promoter. Murphy said the Amphiteatre places a high value on catering to artists, shuttling them to the beach, downtown or the Alligator Farm during their stay here. Bledsoe recalled the time Harry Connick Jr. played and he came off the stage very thirsty. Connick, Jr. loved the Hyppo gourmet popsicle he was handed by staff to cool him off. \"Sometimes, it's the only place an artist like Paul Simon or Jack Johnson will choose to play in Florida,\" Murphy said. Murphy said the Ampitheatre continues to build upon its growing reputation and has added popular events such as the Front Porch free music series and the new night market on Tuesdays and Thursdays. The venue also has some several capital improvement projects in the works, such as expanding space for local food vendors and adding more restrooms. That work is supposed to begin by the end of the year. \"We're also trying to do what we can to make that experience for the audience and the artists great,\" Murphy said. Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Help Center Subscriber Guide Manage Account My Print Account Legal Notices Give Feedback Licensing & Reprints Subscribe Today Newsletters Facebook X Instagram eNewspaper Newspapers in Education Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.staugustine.com. All rights reserved."
    },
    {
      "url": "https://www.historiccoastculture.com/event/the-amp-night-market-live-music-by-remedy-tree-and-atlantic-alibi/",
      "text": "Culture Around Every Corner - HistoricCoastCulture.com Culture Around Every Corner - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Discover Public Art » Samantha Brown's Places to Love » Savor Local Flavors » Explore 450 Years of History » Search historiccoastculture.com Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Culinary Family-Friendly Festivals Free History & Heritage Literary Arts & Film Many Cultures Online/Streaming Performing Arts Visual Arts Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue Select City: City/Town combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select City/Town City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Quick Search Today Weekend Tomorrow The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Search by date range: Today Tomorrow Weekend next 7 14 30 Advanced Search SEARCH Featured Stories Family-Friendly , FREE , Press Releases , Spotlight , Visual Arts Summer in St. Johns Photo Contest By sjcadmin Culinary Arts , Things To See 10 St. Augustine Restaurants with a View By sjcadmin These bars and restaurants pair exceptional culinary experiences with stunning panoramic rooftop views and serene waterfront vistas. VIEW ALL STORIES Family-Friendly , FREE , Things To See , Visual Arts Interactive Mural in Hastings Celebrates Florida Farming By sjcadmin Culinary Arts , Family-Friendly , Things To See Best Brunch Spots in St. Augustine By sjcadmin Performing Arts , Press Releases GRAND REOPENING: Ponte Vedra Concert Hall By sjcadmin VIEW ALL STORIES FEATURED EVENTS Upcoming Events Performing Arts Visual Arts Literary Arts & Film Festivals History & Heritage Sep 13 Ancient City Poets at Sing Out Loud Presented by Ancient City Poets Spinster Abbott's, St. Augustine Sep 13 Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 14 Art and Bark In the Park Presented by City of St. Augustine Beach and The Saint Augustine Art Studio and Gallery and St. Johns Cultural Council Lakeside Park, St. Augustine Sep 14 Plein Air in the Park Presented by St. Augustine Art Association and St. Johns Cultural Council Lakeside Park, St. Augustine TICKETS / REGISTRATION Sep 14 Al Canali Project - Blues Jam 2 Presented by Romanza and St. Augustine Jazz Society Royal St. Augustine Golf & Country Clubhouse, St. Augustine TICKETS / REGISTRATION Jun 06 - Sep 14 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four Lightner Museum, St. Augustine Accessibility Info Sep 19 Comedy Smackdown Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 20 St. Augustine Book Festival Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine Sep 23 - 24 Pastel Landscape Painting Workshop (with... Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine TICKETS / REGISTRATION Sep 13 Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 19 Comedy Smackdown Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info May 09 - Sep 24 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association St. Johns County Ocean Pier, St. Augustine Beach TICKETS / REGISTRATION Sep 27 Romanza Collage presents A Swing and a Miss! Presented by Romanza The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 11 - Oct 05 Nunsense Presented by Limelight Theatre Limelight Theatre TICKETS / REGISTRATION Accessibility Info Oct 10 First Coast Opera - Fanfare! Presented by First Coast Opera St. Anastasia Catholic Church, St. Augustine TICKETS / REGISTRATION Accessibility Info Oct 11 Voctave - The Corner of Broadway and Main... Presented by EMMA Concert Association Flagler College - Lewis Auditorium, St. Augustine TICKETS / REGISTRATION Sep 06 - Oct 11 Comedy Carousel Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info VIEW MORE PERFORMING ARTS View All Performing Arts » Sep 14 Plein Air in the Park Presented by St. Augustine Art Association and St. Johns Cultural Council Lakeside Park, St. Augustine TICKETS / REGISTRATION Jun 06 - Sep 14 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four Lightner Museum, St. Augustine Accessibility Info Sep 23 - 24 Pastel Landscape Painting Workshop (with... Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine TICKETS / REGISTRATION Sep 25 Charlie Cawley | Pathways: A Career in the... Presented by St. Johns Cultural Council The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 05 - 28 Annual Fall Members Show Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine Sep 05 - 30 \"Doorway of Dreams\" Works by Nikki Rakov Presented by Butterfield Garage Art Gallery Butterfield Garage Art Gallery, St. Augustine TICKETS / REGISTRATION Accessibility Info Aug 12 - Oct 06 High Tide Gallery | Rotunda Spotlight Presented by St. Johns Cultural Council St. Johns County Administration Building, St. Augustine Oct 09 Best of Juried Artist Member (JAM) Exhibiton Presented by First Coast Cultural Center First Coast Cultural Center, Ponte Vedra Beach TICKETS / REGISTRATION Accessibility Info VIEW MORE VISUAL ARTS View All Visual Arts » Sep 13 Ancient City Poets at Sing Out Loud Presented by Ancient City Poets Spinster Abbott's, St. Augustine Sep 26 AAUW Film Festival The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 28 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council The Waterworks, St. Augustine Accessibility Info Sep 28 \"Ciao Professore\" Film Screening Presented by St. Augustine Film Society Unitarian Universalist Fellowship, St. Augustine Oct 26 The Ghost in You - Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council The Waterworks, St. Augustine Accessibility Info VIEW MORE LITERARY ARTS FILM View All Literary Arts Film » Sep 20 St. Augustine Book Festival Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine Sep 05 - 28 St. Augustine Songwriters Festival Presented by Sing Out Loud Festival Francis Field, St. Augustine TICKETS / REGISTRATION Sep 05 - 28 Sing Out Loud Festival Presented by Sing Out Loud Festival Francis Field, St. Augustine TICKETS / REGISTRATION Oct 18 Vibe-Rations Music Festival Presented by Vilano Beach Main Street, Inc. Hampton Inn & Suites, St. Augustine TICKETS / REGISTRATION Dec 06 SEA Community's 12th Annual Gullah Geechee... Presented by SEA Community Help Resource Center, Inc. Armstrong Park, Elkton Apr 25 Florida's Photo Fest - Keynote Reception Presented by Florida Photo Fest The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info VIEW MORE FESTIVALS View All Festivals » Oct 03 - 31 Mortality and Mourning: Women in Black Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine TICKETS / REGISTRATION Aug 21 - Dec 20 Historic House Tours Presented by Woman's Exchange of St. Augustine Peña-Peck House, St. Augustine Aug 20 - Dec 20 Family Scavenger Hunt at the Peña-Peck House Presented by Woman's Exchange of St. Augustine Peña-Peck House, St. Augustine Nov 15 - Jan 05 A Celebration of Art and History: The... Presented by Ximenez-Fatio House Museum and St. Augustine Art Association Ximenez-Fatio House Museum, St. Augustine TICKETS / REGISTRATION Ongoing Militia Muster at Fort Mose Presented by Fort Mose Historical Society Fort Mose Historic State Park, St. Augustine VIEW MORE HISTORY HERITAGE View All History Heritage » Most Viewed Events Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv at Third Space Improv Sep 13, 2025 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four at Lightner Museum Jun 06 - Sep 14, 2025 Comedy Smackdown Presented by Third Space Improv at Third Space Improv Sep 19, 2025 Pastel Landscape Painting Workshop (with Cynthia Pierson) Presented by St. Augustine Art Association at St. Augustine Art Association Sep 23 - Sep 24, 2025 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association at St. Johns County Ocean Pier May 09 - Sep 24, 2025 Romanza Collage presents A Swing and a Miss! Presented by Romanza at The Waterworks Sep 27, 2025 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council at The Waterworks Sep 28, 2025 Annual Fall Members Show Presented by St. Augustine Art Association at St. Augustine Art Association Sep 05 - Sep 28, 2025 Fiber Arts and Flicks Presented by Southeast Branch Library at Southeast Branch Public Library Sep 29, 2025 SUBMIT A LISTING DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.historiccoastculture.com/event/the-amp-night-market-square-dance-harvest/",
      "text": "Culture Around Every Corner - HistoricCoastCulture.com Culture Around Every Corner - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Discover Public Art » Samantha Brown's Places to Love » Savor Local Flavors » Explore 450 Years of History » Search historiccoastculture.com Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Culinary Family-Friendly Festivals Free History & Heritage Literary Arts & Film Many Cultures Online/Streaming Performing Arts Visual Arts Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue Select City: City/Town combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select City/Town City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Quick Search Today Weekend Tomorrow The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Search by date range: Today Tomorrow Weekend next 7 14 30 Advanced Search SEARCH Featured Stories Family-Friendly , FREE , Press Releases , Spotlight , Visual Arts Summer in St. Johns Photo Contest By sjcadmin Culinary Arts , Things To See 10 St. Augustine Restaurants with a View By sjcadmin These bars and restaurants pair exceptional culinary experiences with stunning panoramic rooftop views and serene waterfront vistas. VIEW ALL STORIES Family-Friendly , FREE , Things To See , Visual Arts Interactive Mural in Hastings Celebrates Florida Farming By sjcadmin Culinary Arts , Family-Friendly , Things To See Best Brunch Spots in St. Augustine By sjcadmin Performing Arts , Press Releases GRAND REOPENING: Ponte Vedra Concert Hall By sjcadmin VIEW ALL STORIES FEATURED EVENTS Upcoming Events Performing Arts Visual Arts Literary Arts & Film Festivals History & Heritage Sep 13 Ancient City Poets at Sing Out Loud Presented by Ancient City Poets Spinster Abbott's, St. Augustine Sep 13 Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 14 Art and Bark In the Park Presented by City of St. Augustine Beach and The Saint Augustine Art Studio and Gallery and St. Johns Cultural Council Lakeside Park, St. Augustine Sep 14 Plein Air in the Park Presented by St. Augustine Art Association and St. Johns Cultural Council Lakeside Park, St. Augustine TICKETS / REGISTRATION Sep 14 Al Canali Project - Blues Jam 2 Presented by Romanza and St. Augustine Jazz Society Royal St. Augustine Golf & Country Clubhouse, St. Augustine TICKETS / REGISTRATION Jun 06 - Sep 14 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four Lightner Museum, St. Augustine Accessibility Info Sep 19 Comedy Smackdown Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 20 St. Augustine Book Festival Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine Sep 23 - 24 Pastel Landscape Painting Workshop (with... Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine TICKETS / REGISTRATION Sep 13 Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 19 Comedy Smackdown Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info May 09 - Sep 24 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association St. Johns County Ocean Pier, St. Augustine Beach TICKETS / REGISTRATION Sep 27 Romanza Collage presents A Swing and a Miss! Presented by Romanza The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 11 - Oct 05 Nunsense Presented by Limelight Theatre Limelight Theatre TICKETS / REGISTRATION Accessibility Info Oct 10 First Coast Opera - Fanfare! Presented by First Coast Opera St. Anastasia Catholic Church, St. Augustine TICKETS / REGISTRATION Accessibility Info Oct 11 Voctave - The Corner of Broadway and Main... Presented by EMMA Concert Association Flagler College - Lewis Auditorium, St. Augustine TICKETS / REGISTRATION Sep 06 - Oct 11 Comedy Carousel Presented by Third Space Improv Third Space Improv, St. Augustine TICKETS / REGISTRATION Accessibility Info VIEW MORE PERFORMING ARTS View All Performing Arts » Sep 14 Plein Air in the Park Presented by St. Augustine Art Association and St. Johns Cultural Council Lakeside Park, St. Augustine TICKETS / REGISTRATION Jun 06 - Sep 14 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four Lightner Museum, St. Augustine Accessibility Info Sep 23 - 24 Pastel Landscape Painting Workshop (with... Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine TICKETS / REGISTRATION Sep 25 Charlie Cawley | Pathways: A Career in the... Presented by St. Johns Cultural Council The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 05 - 28 Annual Fall Members Show Presented by St. Augustine Art Association St. Augustine Art Association, St. Augustine Sep 05 - 30 \"Doorway of Dreams\" Works by Nikki Rakov Presented by Butterfield Garage Art Gallery Butterfield Garage Art Gallery, St. Augustine TICKETS / REGISTRATION Accessibility Info Aug 12 - Oct 06 High Tide Gallery | Rotunda Spotlight Presented by St. Johns Cultural Council St. Johns County Administration Building, St. Augustine Oct 09 Best of Juried Artist Member (JAM) Exhibiton Presented by First Coast Cultural Center First Coast Cultural Center, Ponte Vedra Beach TICKETS / REGISTRATION Accessibility Info VIEW MORE VISUAL ARTS View All Visual Arts » Sep 13 Ancient City Poets at Sing Out Loud Presented by Ancient City Poets Spinster Abbott's, St. Augustine Sep 26 AAUW Film Festival The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info Sep 28 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council The Waterworks, St. Augustine Accessibility Info Sep 28 \"Ciao Professore\" Film Screening Presented by St. Augustine Film Society Unitarian Universalist Fellowship, St. Augustine Oct 26 The Ghost in You - Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council The Waterworks, St. Augustine Accessibility Info VIEW MORE LITERARY ARTS FILM View All Literary Arts Film » Sep 20 St. Augustine Book Festival Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine Sep 05 - 28 St. Augustine Songwriters Festival Presented by Sing Out Loud Festival Francis Field, St. Augustine TICKETS / REGISTRATION Sep 05 - 28 Sing Out Loud Festival Presented by Sing Out Loud Festival Francis Field, St. Augustine TICKETS / REGISTRATION Oct 18 Vibe-Rations Music Festival Presented by Vilano Beach Main Street, Inc. Hampton Inn & Suites, St. Augustine TICKETS / REGISTRATION Dec 06 SEA Community's 12th Annual Gullah Geechee... Presented by SEA Community Help Resource Center, Inc. Armstrong Park, Elkton Apr 25 Florida's Photo Fest - Keynote Reception Presented by Florida Photo Fest The Waterworks, St. Augustine TICKETS / REGISTRATION Accessibility Info VIEW MORE FESTIVALS View All Festivals » Oct 03 - 31 Mortality and Mourning: Women in Black Presented by Ximenez-Fatio House Museum Ximenez-Fatio House Museum, St. Augustine TICKETS / REGISTRATION Aug 21 - Dec 20 Historic House Tours Presented by Woman's Exchange of St. Augustine Peña-Peck House, St. Augustine Aug 20 - Dec 20 Family Scavenger Hunt at the Peña-Peck House Presented by Woman's Exchange of St. Augustine Peña-Peck House, St. Augustine Nov 15 - Jan 05 A Celebration of Art and History: The... Presented by Ximenez-Fatio House Museum and St. Augustine Art Association Ximenez-Fatio House Museum, St. Augustine TICKETS / REGISTRATION Ongoing Militia Muster at Fort Mose Presented by Fort Mose Historical Society Fort Mose Historic State Park, St. Augustine VIEW MORE HISTORY HERITAGE View All History Heritage » Most Viewed Events Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv at Third Space Improv Sep 13, 2025 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four at Lightner Museum Jun 06 - Sep 14, 2025 Comedy Smackdown Presented by Third Space Improv at Third Space Improv Sep 19, 2025 Pastel Landscape Painting Workshop (with Cynthia Pierson) Presented by St. Augustine Art Association at St. Augustine Art Association Sep 23 - Sep 24, 2025 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association at St. Johns County Ocean Pier May 09 - Sep 24, 2025 Romanza Collage presents A Swing and a Miss! Presented by Romanza at The Waterworks Sep 27, 2025 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council at The Waterworks Sep 28, 2025 Annual Fall Members Show Presented by St. Augustine Art Association at St. Augustine Art Association Sep 05 - Sep 28, 2025 Fiber Arts and Flicks Presented by Southeast Branch Library at Southeast Branch Public Library Sep 29, 2025 SUBMIT A LISTING DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.theamp.com/contact-us",
      "text": "Contact Us | St. Augustine Amphitheatre Skip to content Accessibility Buy Tickets Search Newsletter Signup Ponte Vedra Concert Hall Menu Close Search Submit search Newsletter Signup Ponte Vedra Concert Hall Events & Tickets Upcoming Events Box Office & Ticketing Digital Tickets AmpChoice Experience Directions & Parking Security Policies Nearby Accommodations Amp Guide Accessibility Community Farmers Market & Night Market Volunteer Friends of St. Augustine Amphitheatre Venue Info Anastasia State Park Archive History Sustainability Tech Packet Connect Newsletter Signup Partners Book an Event News & Media Media Credential Requests Contact Us Careers Staff by Department Merch Amp Shop Online Search Search Submit search Home / Connect / Contact Us Contact Us General Information Email: ampinfo@theamp.com Phone: (904) 209-3746 Fax: (904) 209-3758 Mailing Address: The St. Augustine Amphitheatre 1340C A1A S. St. Augustine FL 32080 Events & Tickets Upcoming Events Box Office & Ticketing AmpChoice Experience Directions & Parking Security Policies Nearby Accommodations Amp Guide Accessibility Community Farmers Market & Night Market Volunteer Friends of St. Augustine Amphitheatre Venue Info Anastasia State Park Archive History Sustainability Tech Packet Connect Newsletter Signup Partners Book an Event News & Media Media Credential Requests Contact Us Careers Staff by Department Merch Amp Shop Online Address 1340C A1A South St. Augustine, Florida 32080"
    },
    {
      "url": "https://www.theamp.com/events/detail/st-johns-county-fight-night",
      "text": "St. Johns County Fight Night: First Responders Boxing for Charity | St. Augustine Amphitheatre Skip to content Accessibility Buy Tickets Search Newsletter Signup Ponte Vedra Concert Hall Menu Close Search Submit search Newsletter Signup Ponte Vedra Concert Hall Events & Tickets Upcoming Events Box Office & Ticketing Digital Tickets AmpChoice Experience Directions & Parking Security Policies Nearby Accommodations Amp Guide Accessibility Community Farmers Market & Night Market Volunteer Friends of St. Augustine Amphitheatre Venue Info Anastasia State Park Archive History Sustainability Tech Packet Connect Newsletter Signup Partners Book an Event News & Media Media Credential Requests Contact Us Careers Staff by Department Merch Amp Shop Online Search Search Submit search St. Johns County Fight Night: First Responders Boxing for Charity Benefitting Diamond of Dreams Field & St. Johns PAL, Presented by SJC Sheriff's Office Feb 13 , 2025 St. Johns County Fight Night: First Responders Boxing for Charity Benefitting Diamond of Dreams Field & St. Johns PAL, Presented by SJC Sheriff's Office Buy Tickets Date Feb 13 , 2025 Event Starts 6:00 PM Doors Open 5:00 PM Ticket Prices $15.00 - $20.00 On Sale On Sale Now Pit Type Seated St. Johns County Fight Night: First Responders Boxing for Charity Benefitting Diamond of Dreams Field & St. Johns PAL, Presented by SJC Sheriff's Office Event Details Important Ticketing Info: Effective January 6, 2025, at 10:00 AM, AXS is the official ticketing partner for The St. Augustine Amphitheatre and Ponte Vedra Concert Hall. Tickets must be purchased directly through TheAmp.com and PVConcertHall.com , at the venue Box Office locations, or via our ticketing partner, AXS. Please Note: Tickets purchased via Ticketmaster prior to January 6, 2025, at 10:00 AM, remain valid and will be honored at the event. No refunds or exchanges are required. Simply bring your original tickets to the gates on the day of the show. Purchasing tickets from any source other than TheAmp.com , PVConcertHall.com , the on-site venue Box Office, or via AXS after January 6, 2025, at 10:00 AM, is done at the buyer’s own risk. Tickets purchased through third-party sellers may not be valid for entry and cannot be verified. For more information, please visit our Box Office & Ticketing page . Come out to support your local Deputies and Firefighters as they leave it all in the ring, first bell rings at 6pm sharp. All event proceeds will benefit the children in our community of all abilities. Two special charities and projects will receive assistance from Fight Night.The Diamond of Dreams is a new build project providing a ball field and a playground for children with special needs. The St. Johns County Police Athletic League (PAL) is an organization that provides all youth an opportunity to play a variety of sports in St. Johns County. While supporting your local heroes, you can contribute to a much larger cause! The night will kick off with teenagers in the ring that are a part of the PAL Boxing Program. These kids are tough and have dedicated their time to the team to be awarded a legit fight in front of a real audience. The main events consist of members of SJSO, SJCFR and SAFD battling for the belt and annual title. These fighters have shown commitment and devotion to the event on their off time while still serving the community in fire trucks, patrol cars and our jail. The fights will be three rounds, one minute each, with a one-minute interval. The St. Johns County Sheriff’s Office held its first boxing event last year on a smaller scale and it was a huge success. This year will be bigger and better at The Amp! The boxing ring will be placed in the pit area, so every seat will be fantastic! There will be special guest judges, food and drinks, Fight Night merchandise and more. Fight Night Promoter, SJSO Deputy Krissie Padgett said, “I’ve fought in amateur boxing matches...it takes a lot of courage to get in that ring, especially in front of a large crowd. I’m so excited for this group of fighters to experience the exhilarating feeling of entering The Amp with their walk-out song blaring and hearing the fans cheer, there’s nothing like it! Whether you win or lose, it feels amazing to represent your agency in such a positive light to ultimately help the children of our community.” Sponsors: If you are interested in sponsoring the event or receiving more information, please contact Deputy Krissie Padgett via kpadgett@sjso.org or (904) 907-2892. Additional Ticket Information Important Ticketing Info: Effective January 6, 2025, at 10:00 AM, AXS is the official ticketing partner for The St. Augustine Amphitheatre and Ponte Vedra Concert Hall. Tickets must be purchased directly through TheAmp.com and PVConcertHall.com , at the venue Box Office locations, or via our ticketing partner, AXS. Please Note: Tickets purchased via Ticketmaster prior to January 6, 2025, at 10:00 AM, remain valid and will be honored at the event. No refunds or exchanges are required. Simply bring your original tickets to the gates on the day of the show. Purchasing tickets from any source other than TheAmp.com , PVConcertHall.com , the on-site venue Box Office, or via AXS after January 6, 2025, at 10:00 AM, is done at the buyer’s own risk. Tickets purchased through third-party sellers may not be valid for entry and cannot be verified. For more information, please visit our Box Office & Ticketing page . TIP: Avoid ticket fees by purchasing tickets in person! The St. Augustine Amphitheatre Box Office is now open Thursdays and Fridays, 10am – 5pm and Saturdays 8:30am – 12:30pm and accepts credit and debit card payments only. Related Links St. Johns County Sheriff's Office St. Johns County Fire Rescue St. Johns County PAL FB Event Page Events & Tickets Upcoming Events Box Office & Ticketing AmpChoice Experience Directions & Parking Security Policies Nearby Accommodations Amp Guide Accessibility Community Farmers Market & Night Market Volunteer Friends of St. Augustine Amphitheatre Venue Info Anastasia State Park Archive History Sustainability Tech Packet Connect Newsletter Signup Partners Book an Event News & Media Media Credential Requests Contact Us Careers Staff by Department Merch Amp Shop Online Address 1340C A1A South St. Augustine, Florida 32080"
    }
  ]
}