{
  "fuentes": [
    {
      "url": "https://www.hamiltonbeach.co.uk/contact-us",
      "email": "customerservice@hamiltonbeach.co.uk"
    },
    {
      "url": "https://www.hamiltonbeach.co.uk/contact-us",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://www.hamiltonbeach.co.uk/contact-us",
      "email": "mitali@epeinternational.com"
    },
    {
      "url": "https://hamiltonbeachcommercial.com/contactus/",
      "email": "mexico.service@hamiltonbeach.com"
    },
    {
      "url": "https://www.hamiltonliving.co.uk/contact-hamilton-living",
      "email": "sarah@hamiltonliving.co.uk"
    },
    {
      "url": "https://thealfondinn.com/meetings-events/meetings-and-event-space-information",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://thealfondinn.com/the-hotel/faqs/",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://thealfondinn.com/the-hotel/stay-in-touch",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://www.wickes.co.uk/contactus?msockid=13fa7485074167fa0b0a629c0638669b",
      "email": "complaint.info@financial-ombudsman.org.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus?msockid=13fa7485074167fa0b0a629c0638669b",
      "email": "customer.relations@wickes.co.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus?msockid=13fa7485074167fa0b0a629c0638669b",
      "email": "wickes@clarioncomms.co.uk"
    },
    {
      "url": "https://thealfondinn.com/employment/",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://thealfondinn.com/",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://thealfondinn.com/the-hotel/contact-us",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://thealfondinn.com/press-media/meeting-trends-from-the-alfond-inn-at-rollins/",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://thealfondinn.com/hotel-policy",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "email": "info@theeddyskitchen.com"
    },
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "email": "info@theeddyskitchen.com"
    },
    {
      "url": "https://kitchenrenovationshamilton.co.nz/about-us/",
      "email": "info@kitchenrenovationshamilton.co.nz"
    },
    {
      "url": "https://thealfondinn.com/press-media/refining-florida-flavors-at-hamilton-s-kitchen/",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://thealfondinn.com/the-spa",
      "email": "reservations@thealfondinn.com"
    },
    {
      "url": "https://thealfondinn.com/the-spa",
      "email": "spa@thealfondinn.com"
    },
    {
      "url": "https://www.centralfloridalifestyle.com/dining/the-magic-behind-hamiltons-kitchen/",
      "email": "contact@lifestylescfl.com"
    },
    {
      "url": "https://www.centralfloridalifestyle.com/dining/the-magic-behind-hamiltons-kitchen/",
      "email": "lyndsay@karstmediagroup.com"
    },
    {
      "url": "https://www.orlandomeeting.com/listing/hamiltons-kitchen/37733/",
      "email": "dpotter@thealfondinn.com"
    },
    {
      "url": "https://www.orlandomeeting.com/listing/hamiltons-kitchen/37733/",
      "email": "reservations@thealfondinn.com"
    }
  ],
  "mails": [
    "complaint.info@financial-ombudsman.org.uk",
    "contact@lifestylescfl.com",
    "customer.relations@wickes.co.uk",
    "customerservice@hamiltonbeach.co.uk",
    "dpotter@thealfondinn.com",
    "info@kitchenrenovationshamilton.co.nz",
    "info@stagheaddesigns.com",
    "info@theeddyskitchen.com",
    "lyndsay@karstmediagroup.com",
    "mexico.service@hamiltonbeach.com",
    "mitali@epeinternational.com",
    "reservations@thealfondinn.com",
    "sarah@hamiltonliving.co.uk",
    "spa@thealfondinn.com",
    "wickes@clarioncomms.co.uk"
  ],
  "nombre_sitio": "thealfondinn.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hamiltonbeach.co.uk/contact-us",
      "text": "Contact Us\n – Hamilton Beach UK Skip to content 20% Off All Slow Cookers & Soup Makers - Code applied automatically at checkout! 20% Off All Slow Cookers & Soup Makers - Code applied automatically at checkout! Kitchen Appliances Kitchen Appliances Shop All Juicer Mixer Grinder Kettles 1L Kettles Kettles Kettle & Toaster Sets Toasters 2 Slice Toasters 4 Slice Toasters Toaster & Kettle Sets Coffee Makers Filter Coffee Makers Kettle, Toaster, Microwave & Coffee Machine Sets Cooking Appliances Breadmakers Sandwich Toasters Soup Makers Waffle Makers Food Preparation Blenders Food Processors Mixers Air Fryers Manual Air Fryers Digital Air Fryers Dual Air Fryers Microwaves Manual Microwaves Digital Microwaves Microwave, Kettle & Toaster Sets Mini Ovens & Hobs Mini Ovens Slow & Multi Cookers Slow Cookers Digital Slow Cookers Multi Cookers Sets Kettle & Toaster Sets Kettle, Toaster & Microwave Sets Kettle, Toaster, Microwave & Coffee Machine Sets Household Appliances Household Appliances Garment Steamers Steam Irons 2200W Steam Irons 3000W Steam Irons Steam Generator Irons Pro Care Steam Generator Irons Collections Collections Diamond Collection Ella Collection Essentials Collection FlexiControl Collection Harmony Collection Miami Collection Retro Collection Rise Collection Scandi Collection Stealth Collection VisionCook Collection Spares Product Registration Get Inspired Get Inspired Recipes Air Fryer Recipes Blender Recipes Juicer Mixer Grinder Recipes Slow Cooker Recipes Waffle Maker Recipes Latest News Get Social With Us Instagram Tiktok Facebook Youtube Pinterest Hamilton Beach x Radhika Howarth Blog Sale Kitchen Appliances Shop All Juicer Mixer Grinder Kettles 1L Kettles Kettles Kettle & Toaster Sets Toasters 2 Slice Toasters 4 Slice Toasters Toaster & Kettle Sets Coffee Makers Filter Coffee Makers Kettle, Toaster, Microwave & Coffee Machine Sets Cooking Appliances Breadmakers Sandwich Toasters Soup Makers Waffle Makers Food Preparation Blenders Food Processors Mixers Air Fryers Manual Air Fryers Digital Air Fryers Dual Air Fryers Microwaves Manual Microwaves Digital Microwaves Microwave, Kettle & Toaster Sets Mini Ovens & Hobs Mini Ovens Slow & Multi Cookers Slow Cookers Digital Slow Cookers Multi Cookers Sets Kettle & Toaster Sets Kettle, Toaster & Microwave Sets Kettle, Toaster, Microwave & Coffee Machine Sets Household Appliances Garment Steamers Steam Irons 2200W Steam Irons 3000W Steam Irons Steam Generator Irons Pro Care Steam Generator Irons Collections Diamond Collection Ella Collection Essentials Collection FlexiControl Collection Harmony Collection Miami Collection Retro Collection Rise Collection Scandi Collection Stealth Collection VisionCook Collection Spares Product Registration Get Inspired Recipes Air Fryer Recipes Blender Recipes Juicer Mixer Grinder Recipes Slow Cooker Recipes Waffle Maker Recipes Latest News Get Social With Us Instagram Tiktok Facebook Youtube Pinterest Hamilton Beach x Radhika Howarth Blog Sale More Account Other sign in options Sign in Orders Profile Account Other sign in options Sign in Orders Profile Total items in cart: 0 0 Your cart is empty Have an account? Log in to check out faster. Continue shopping Kitchen Appliances Household Appliances Collections Spares Product Registration Get Inspired Hamilton Beach x Radhika Howarth Blog Sale Contact Us Customer Service Hamilton Beach Customer Service Telephone Support: 01274 752624. Please ensure you have your product with you at the time of the call. Email: customerservice@hamiltonbeach.co.uk Our Team are available during the following times: Monday – Friday between 8.30am and 4.30pm We are closed weekends & National UK Bank Holidays If your query is not answered in the FAQ’s and you need additional support, start your request online by submitting the Contact Us form below and we will endeavour to help find the right solution for you. Get In Touch Our team are on hand to help! Submit the form below. Join the club Get exclusive deals and early access to new products. Email We make your cooking experience easier. #cookwithconfidence Discover the innovative and dependable products that have made Hamilton Beach a trusted name since 1910. Hamilton Beach UK, Belfry House, Roydsdale Way, Bradford, BD4 6SU 01274 752624﻿ customerservice@hamiltonbeach.co.uk Company Information About Us Our History Hamilton Beach x Radhika Howarth PR & News Contact Us Useful Information Delivery Information Exchange & Return Policy Promotion Terms and Conditions Terms & Conditions Privacy Policy Klarna | Shop Now, Pay Later Help & Support FAQ's Instruction Manuals Register My Warranty Spares Spares Suggestion Form Customer Support © 2025 Hamilton Beach UK , Powered by Shopify Terms and Policies Refund policy Privacy policy Terms of service Shipping policy Contact information © Hamilton Beach® Brands, Inc. Trademarks by Hamilton Beach® Brands, Inc. All rights reserved. Hamilton Beach® is a registered trademark of Hamilton Beach Brands, Inc. used under license by EPE International Limited. Search Clear View all"
    },
    {
      "url": "https://hamiltonbeachcommercial.com/contactus/",
      "text": "Contact Us | Hamilton Beach Commercial Skip to content Operator Manuals Parts Diagrams Interactive Foodservice Catalog 0 items Search x Beverage Bar Blenders High-Performance Blenders Beverage Automation Numilk® Commercial Machine Drink Mixers Commercial Juicers Container Rinser Factory Recertified Parts and Accessories - Beverage Food Culinary Blenders Immersion Blenders Vacuum Packaging Vacuum Packaging Supplies Immersion Circulators Rice Cookers Roaster Ovens Slot Toasters Stand Mixers Can Openers Dishers Factory Recertified Parts and Accessories Hospitality Amenity / In Room Coffee and Tea Makers Alarm Clocks Hair Dryers Irons and Steamers Refrigerators Factory Recertified Parts and Accessories Extended Stay Blenders Coffee and Tea Makers Can Openers Toasters Breakfast Bar Toasters Coffee Urns Rice and Oatmeal Cookers Resources General Info Blog Beverage Food Hospitality Recipes News / Events About Contact Careers Privacy Policy – US Política de Privacidad – México Product Info Manuals HBC Brand Design Guide Design Files 30 Day Test Drive Program Details Certifications Agency Marks – US RoHS Certificates CE Certificates CCC Certificates UKCA Certificates Customer Service Customer Service Center Warranty Registration Express Care Warranty Global Care Warranty Returns Policy Start a Return Find a Sales Representative Authorized Seller Program Authorized Indirect Online Dealer Application Technical Service Commercial Technical Support Operator Manuals Purchase Parts and Accessories Parts Diagrams and Repair Guides Technical Service – How-To Videos Frequently Asked Questions (FAQs) Contact Us Customer Service (sales, order status, and general inquiries) USA, Canada: 1-800-572-3331 All others: 1-804-346-1430 Available 8am – 4pm ET Fax: 804-527-7126 NOW AVAILABLE!  Check your HBC order status on AutoQuotes Order Status using your PO number! Technical Service (warranty, tech questions) USA, Canada: 1-866-285-1087 or +1- 910-693-4277 (all others) Available 8am – 4pm ET Fax: 910-693-0178 Email Address: commercial.support@hamiltonbeach.com LATAM Region Commercial Technical Service (parts, warranty, tech questions): +800 71 16 100 In Brazil : + 0800 241 24 11 LATAM Region Email Address: mexico.service@hamiltonbeach.com APAC Region Commercial Technical Service (parts, warranty, tech questions): +86-400-930-2722 APAC Region Email Address: hbcapac.support@hamiltonbeach.com Consumer/Household Product Inquires Contact our Hamilton Beach Consumer Service Team here . U.S. Headquarters Mailing Address: Hamilton Beach Commercial 4421 Waterfront Drive Glen Allen, VA 23060 Parts Use our parts finder tool Looking for a Distributor or have other questions? Please submit the form below. Reliable Technology. Smart Solutions. Bringing Good Thinking® to Foodservice and Hospitality Equipment Worldwide. Follow Us See how Hamilton Beach Commercial is engineered for the Foodservice and Hospitality Industries. BEVERAGE Bar Blenders High-Performance Blenders Beverage Automation Drink Mixers Citrus Juicers Coffee Urns FOOD Culinary Blenders Rice Cookers Stand Mixers Roaster Ovens Slot Toasters Vacuum Sealers Dishers HOSPITALITY Coffee and Tea Makers Clock Radios Hair Dryers Irons Refrigerators Parts and Accessories Blenders Can Openers Toasters Air Quality CUSTOMER SERVICE Customer Support Warranty Registration Technical Support Technical Service Videos Manuals Returns Policy Start a Return 30 Day Test Drive Details – US Only Find a Sales Representative Authorized Seller Program Authorized Indirect Online Dealer Application © 2025 Hamilton Beach Commercial® All Rights Reserved. Privacy Policy – US Terms Don’t Sell or Share My Information Web Accessibility"
    },
    {
      "url": "https://www.hamiltonliving.co.uk/contact-hamilton-living",
      "text": "Get in Touch with Hamilton Living: Start Your Kitchen & Furniture Project Conversation Today — Hamilton Living: Creating Stunning Kitchens & Living Spaces with British-Made High-Quality Furniture 0 Skip to Content Hamilton Kitchens Gallery Contact Us Call 01483 387 979 Open Menu Close Menu Hamilton Kitchens Gallery Contact Us Call 01483 387 979 Open Menu Close Menu Hamilton Kitchens Gallery Contact Us Call 01483 387 979 Contact Hamilton Living 189 High Street, Guildford, Surrey GU1 3AW Whatever your kitchen or furniture plans, we would love to hear from you. For your free design consultation or to discuss your project please contact us and let’s begin the conversation. Call 01438 387979 , or fill in the form below. Name * First Name Last Name Email * Subject * Message * Thank you! Hamilton Living 189 High Street, Guildford, Surrey GU1 3AW Call us on: 01483 387 979 Opening Hours: Mon - Fri: 10:00 - 17:00 Saturday: 10:00 - 16:00 Sunday: By Appointment Copyright Hamilton Home and Living Ltd"
    },
    {
      "url": "https://thealfondinn.com/meetings-events/meetings-and-event-space-information",
      "text": "Meetings And Events | Winter Park FL | The Alfond Inn We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now Extraordinary Meeting & Event Venue From private dinners to weddings and everything in between, The Alfond Inn has a multitude of meeting and event spaces to offer. Book our Event Venue in Winter Park for your next Business Meeting or Social Event. Book Event Park Avenue Ballroom 5,000 square feet of flexible and hi-tech space makes it the perfect location for hosting a large meeting or corporate event. The Ballroom is divisible into five spaces and can accommodate a number of customized break-out and conference requirements. All spaces feature pull down screens and projectors. The Ballroom's elegant design and size is pristine for your Winter Park Wedding Venue choice. Inquire Today The Conservatory Considered the heart of The Alfond Inn, the Conservatory features a soaring glass domed ceiling, creating a light- filled space overlooking the Courtyard that is ideal for receptions and dinner. Beyond the Conservatory is 10,000 square feet of lushly landscaped green space in the garden Courtyard with built-in fire pits and an area designed for team building and al fresco events. Check Availability New England Room With just under 2,000 square feet, the New England Room is divisible by 2 for smaller break-out space and features state of the art audio visual equipment.  The New England Room has glass doors that open up to the New England Lawn, a beautiful space for meals and receptions . Book Meeting The Boardroom Florida sunshine pours into our new Boardroom, a 645 square foot meeting space with a traditional conference style table, comfortable leather chairs and is equipped with state of the art audio visual technology.  This stately boardroom can also serve as a private dining room space for small groups. Book Event Interlachen Room With just under 1,700 square feet, the Interlachen Room is divisible by 2 for smaller break-out space and features state of the art audio visual equipment. The Interlachen Room opens up to the Interlachen Lawn, a beautiful space for meals and receptions. Inquire Now Private Dining Room The Alfond Inn offers the ideal backdrop for a truly personal and intimate gathering. Our Private Dining Room, located in Hamilton's Kitchen accommodates up to 18 guests. From anniversary dinners to birthday brunches, your milestone event will be designed to your specific taste and preference. Reserve Now Event Deck Nestled on the second floor of The Alfond Inn, the Private Event Deck provides an ideal setting for a day of relaxation at The Spa. Additionally, it offers the perfect venue for evening receptions or special events that can accommodate up to 50 guests. Reserve Now The Courtyard Lawn Our 2,400 square foot Courtyard Lawn is surrounded by beautiful flowers with lush greenery and is the perfect backdrop for outdoor special events and team building activities. Book Now 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://thealfondinn.com/the-hotel/faqs/",
      "text": "The Alfond Inn  | A Boutique Hotel in Winter Park, Florida We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now The Alfond Inn An Integrated Art Hotel Experience The Alfond Collection of Contemporary Art at Rollins College is, at once, a collection with a point of view and a lesson in the art of our times, social history, civic-mindedness, international affairs, and philanthropy. A work in progress, the collection is the brainchild of Barbara and Theodore Alfond (R'68), noted art collectors and several patrons of art institutions. Most of the Alfond Collection is installed at The Alfond Inn. The collection was conceived as a visual syllabus for the liberal arts values the Alfonds learned at Rollins and which shaped not only their student years but the rest of their lives. The curatorial narrative revolves around notions of critical thinking; literacy; enlarging one’s perspective; understanding other cultures and traditions; and language. Explore the Collection Our Boutique Hotel Winter Park, Florida Enjoy the boutique hotel Florida atmosphere with amenities to rival even the most luxurious hotels. With a stunning conservatory, lush courtyard, elevated pool & fitness center, The Alfond Inn one of the best hotels in Florida and poised to satisfy the casual traveler seeking quiet relaxation, and business clientele alike at our Winter Park FL Hotel. Explore the Hotel Our Packages If you prefer to call to reserve one of our Winter Park hotel packages, you may reach us at 407.998.8090 Romance in the Park One night stay in a classic room (Double Occupancy) One chilled bottle of prosecco in the room Dinner for two in Hamilton's Kitchen, tax and gratuity not included (Dinner valued at $80) Package price excludes gratuity and tax. Subject to availability. Adventures in the Park Two night stay in a classic room Two Winter Park boat tour Tickets Two tickets to the Charles Hosmer Morse Museum of American Art on Park Avenue Package price excludes gratuity and tax. Subject to availability. A Night at the Museum Two night stay in a classic room Two art-inspired cocktails in the Lounge Winter Park museum passes (entrance to the Rollins Museum of Art, the Charles Hosmer Morse Museum of American Art and Albin Polasek Museum & Sculpture Gardens) Enjoy The Alfond Collection of Contemporary Art throughout the hotel Package price excludes gratuity and tax. Subject to availability. All Packages Event Venues At our Hotel in Winter Park, Florida Overlooking the lush courtyard, the Conservatory at The Alfond Inn is the jewel center of our Winter Park Boutique Hotel and an ideal location for ceremonies or cocktails, with an available 5,000 sq. ft. ballroom and private dining areas. Adjacent to the library and reception space, the 1,026 sq. ft. Boardroom features the latest in A/V equipment and comfortable board-style seating. The Alfond Inn is one of the best hotels in Florida for you to host any event that you may have coming up! Book an Event Space The Spa The Spa at The Alfond Inn is the premier beauty and wellness destination for Winter Park locals and hotel guests looking to escape, indulge, and refresh. Offering an ambiance of stylish serenity, artfully curated wellness services, and bespoke body and skincare treatments, The Spa is where people come to seek peaceful and restorative time for themselves. About Our Spa Gallery Explore the Alfond Inn at Rollins College, a stylish boutique hotel in beautiful Winter Park, Florida that opened in 2013 and was recognized by Condé Nast Traveler - Readers' Choice Awards: Best hotel in Florida - 2014 - 2019. Visit the best of boutique hotels Florida has to offer, close to Orlando! 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://thealfondinn.com/the-hotel/stay-in-touch",
      "text": "Get the Scoop on Alfond Inn News | The Alfond Inn We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now Get Alfond Inn News Subscribe to Our Mailing List and get Alfond Inn News by email. By signing up for our newsletter, we can keep you updated on the latest news & specials. First/ Last Name Postal Email Submit 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://www.wickes.co.uk/contactus?msockid=13fa7485074167fa0b0a629c0638669b",
      "text": "Get In Touch | Wickes.co.uk Online 0 Rapid Delivery within 3 hours* Skip to content Skip to navigation menu Sign-in / Register Track my order Project list Wickes Wickes Ideas & Advice Store Locator Basket Basket 0 Basket Basket 0 back to top Kitchens Wickes Bespoke Kitchens View all Ranges Kitchen Offers Kitchen Brochure Kitchen Finance View all Wickes Bespoke Kitchens Wickes Lifestyle Kitchens Shaker Kitchen Slab Kitchen J-pull Kitchen Kitchen Samples View More View all Wickes Lifestyle Kitchens Cabinets Kitchen Units Appliance Doors Decorative Panels Plinths & Cornices View More View all Cabinets Worktops & Upstands Laminate Worktops Solid Wood Worktops Splashbacks Upstands View all Worktops & Upstands Taps All Kitchen Taps Kitchen Mixer Taps Kitchen Monobloc Taps Boiling Water Taps View all Taps Sinks All Kitchen Sinks Ceramic Sinks Granite & Composite Sinks Stainless Steel Sinks View More View all Sinks Home Office Fitted Home Office Fitted Home Workspaces Home Office Design & Installation View all Home Office Accessories Cabinet Handles & Knobs Kitchen Lighting Kitchen Paint Kitchen Radiators View More View all Accessories Appliances Ovens Hobs Cooker Hoods Fridges & Freezers View More View all Appliances Design & Installation Kitchen Design & Installation Kitchen Ideas & Advice Tiling Ideas & Advice Flooring Ideas & Advice View all Design & Installation Bathrooms Wickes Bespoke Bathrooms View all Suites Bathroom Offers Book a Free Design Appointment Bathroom Finance View More View all Wickes Bespoke Bathrooms Bathroom Suites Cairo Scandi Miami Bathrooms Brochure View More View all Bathroom Suites Showers & Enclosures Showers Shower Accessories Shower Enclosures Shower Panels View More View all Showers & Enclosures Baths & Accessories All Baths Bath Panels Shower Baths Straight Baths View all Baths & Accessories Basins All Basins Cloakroom Basins Vanity Units Pedestal Basins View all Basins Furniture & Cabinets Cabinets & Storage Fitted Bathroom Furniture Modular Bathroom Furniture Vanity Units View all Furniture & Cabinets Toilets & Accessories All Toilets Back to Wall Toilets Toilet Seats Toilet Units View all Toilets & Accessories Taps All Bathroom Taps Bath Taps Basin Taps Tap Washers & Repairs View all Taps Accessories Bathroom Mirrors Bathroom Tiles Toilet Seats Towel Radiators View all Accessories Design & Installation Bathroom Design & Installation Bathroom Ideas & Advice Tiling Ideas & Advice Flooring Ideas & Advice View all Design & Installation Gardens & Landscaping Fencing & Gates Fence Panels Fence Posts Fencing Accessories Gates & Metal Railings View More View all Fencing & Gates Garden Maintenance Compost, Topsoil & Bark Lawn Seed & Feeds Compost Bins & Buckets Weed Membrane View More View all Garden Maintenance Garden Decor Trellis & Screening Sleepers & Raised Beds Edging & Logrolls Garden Planters View More View all Garden Decor Garden Tools Leaf Blowers Grass & Hedge Trimmers Garden Power Tools Garden Hand Tools View More View all Garden Tools Sheds Wooden Sheds Plastic Sheds Storage Boxes Greenhouses View More View all Sheds Paving & Walling Paving Slabs Block Paving Outdoor Tiles Wall Bricks View More View all Paving & Walling Decking Timber Deckboards Decking Joists & Supports Composite Decking Decking Tiles View More View all Decking Garden Watering Hose Pipes Water Butts Pressure Washers Watering Accessories View More View all Garden Watering Garden Supplies Plant Food Weedkiller Growing Accessories Weeding & Clearing View More View all Garden Supplies Garden Autumn Essentials Garden Tidy Firewood & Firelighters Patio Heaters Garden Furniture & BBQ Covers View More View all Garden Autumn Essentials Building Materials Timber Treated Sawn Planed Square Edge Treated Sawn C16 CLS Studwork View More View all Timber Sheet Materials Plywood Sheets MDF Sheets OSB Sheets Loft Boards View More View all Sheet Materials Cement & Aggregates Ballast & Sub Base Cement Sand Gravel View More View all Cement & Aggregates Plaster & Plasterboard Plasterboard Plaster Coving Plastering Adhesives View More View all Plaster & Plasterboard Insulation Loft Insulation Insulation Board Cavity Wall Insulation Insulation Foil View More View all Insulation Roofing PVC Corrugated Sheets Bitumen Sheets Roof Felt Roof Tiles View More View all Roofing Nails & Screws Screws Sealants Fixings Nails View More View all Nails & Screws Guttering & Drainage Round Line Guttering Square Line Guttering Soil Pipes & Fittings Channel Drainage View More View all Guttering & Drainage Bricks & Lintels Blocks Bricks Block Paving Concrete Lintels View More View all Bricks & Lintels Building Supplies Builders Metalwork Damp Proofing Protective Sheeting Fascias & Soffits View More View all Building Supplies Doors & Windows Internal Doors White Doors Oak Veneer Doors Pine Doors Glazed Internal Doors View More View all Internal Doors External Doors Front & Back Doors Exterior French Doors Bifold Patio Doors Garage Doors View More View all External Doors Hardware Door Handles Door Locks & Latches Door Hinges Door Knobs View More View all Hardware Windows uPVC Windows Roof Windows Velux Windows Window Security View More View all Windows Trending Internal Doors Cottage Internal Doors Black Internal Doors 1930s Internal Doors Grey Internal Doors View all Trending Internal Doors Window Accessories Window Sills Window Handles Curtain Poles Window Blinds View More View all Window Accessories Security Door Locks & Latches Door Bolts Padlocks Security Alarms View More View all Security Bedroom Furniture & Fitted Sliding Doors Sliding Wardrobe Doors Modular Wardrobes Click Fitted Furniture Bedroom Furniture View all Bedroom Furniture & Fitted Sliding Doors Fire Safety & Alarms Fire Doors Smoke Alarms Fire Door Hinges Carbon Monoxide Detectors View More View all Fire Safety & Alarms Conservatories Lean To Conservatories Edwardian Conservatories Solid roof Conservatories Victorian Conservatories View all Conservatories Flooring & Tiling Flooring by Type Laminate Flooring Luxury Vinyl Flooring Parquet & Herringbone Solid Wood Flooring View More View all Flooring by Type Laminate by Colour Grey Brown White Beige View More View all Laminate by Colour Flooring Accessories Underlay Skirting Boards Adhesives & Sealants Flooring Tools View More View all Flooring Accessories Price per m2 Flooring Offers Under £15m2 £15 to £20 per m2 £21 to £34 per m2 View all Price per m2 Flooring Samples Laminate Samples Luxury Vinyl Samples Engineered Wood Samples Solid Wood Samples View all Flooring Samples Tiles by Type Bathroom Tiles Kitchen Tiles Floor Tiles Wall Tiles View all Tiles by Type Tiles by Colour Grey White Mosaic Patterned View all Tiles by Colour Tile Accessories Tile Adhesives Tile Grout Tiling Tools Tile Trims View all Tile Accessories Tile Samples Ceramic Samples Porcelain Samples Boutique Samples View all Tile Samples Installation Services Tiling Ideas & Advice Tiling Services Flooring Ideas & Advice Flooring Services View all Installation Services Painting & Decorating Interior Paint Wall & Ceiling Paint Bathroom Paint Paint Mixing Kitchen Paint View More View all Interior Paint Brand Dulux Wickes Crown Cuprinol View More View all Brand Paint by Type Emulsion Trade Paint Metal Paint Undercoats & Primers View More View all Paint by Type Decorating Tools Paint Rollers & Trays Paint Brushes Dust Sheets Abrasive & Sanding Tools View More View all Decorating Tools Exterior Paint Masonry Paint Shed & Fence Paint Garden Furniture Paint Decking Paint View More View all Exterior Paint Wood Treatment Interior Wood Paint Varnish Wood Stain Wood Preservatives & Treatment View More View all Wood Treatment Wallpaper Bedroom & Living Room Wallpaper Decorative Wallpaper Lining Paper Wallpaper Paste & Tools View More View all Wallpaper Mouldings Wall Panelling Beading Architrave Decorative Mouldings View More View all Mouldings Shelving & Storage Storage Boxes Shelves Shelf Brackets Freestanding Shelves View More View all Shelving & Storage Samples Paint Visualiser Dulux Tester Pots Wickes Tester Pots Crown Tester Pots View More View all Samples Electrical & Lighting Interior Lights Ceiling Lights Downlights LED Tubes & Battens Spotlights View all Interior Lights Outdoor Lights Wall Lights Low Voltage Garden Lights Work Lights Security Lights View all Outdoor Lights Light Bulbs All Light Bulbs GU10 Light Bulbs Decorative Bulbs B22 Light Bulbs View all Light Bulbs Electrical Cable EV Charging Extension Leads Portable Heaters View all Electrical Switches & Sockets Dimmer Switches Indoor Sockets Indoor Switches Outdoor Switches & Sockets View all Switches & Sockets Smart Home Smart Appliances Smart Heating Smart Lighting Smart Security View all Smart Home Security & Alarms Home Security Alarms Safes & Key Safes Security Lights Safes View all Security & Alarms Portable Heating & Cooling Portable Heaters Smart Heaters Cooling Fans View all Portable Heating & Cooling Ventilation & Ducting Dehumidifiers Ducting, Vents & Airbricks Fans & Air Conditioning Extractor Fans View all Ventilation & Ducting Heating & Plumbing Plumbing Copper Pipes & Fittings Plastic Pipe & Fittings Plumbing Tools & Accessories Waste Pipes & Fittings View all Plumbing Radiators Designer Radiators Double Panel Radiators Single Panel Radiators Towel Radiators View More View all Radiators Central Heating Boilers & Boiler Packs Heating Controls Central Heating Treatment Smart Heating View all Central Heating Fires & Surrounds Coal & Logs Gas Fires Electric Fires Fire Suites View all Fires & Surrounds Portable Heating Portable Heaters Smart Heaters View all Portable Heating Tools & Workwear Power Tools Cordless Drills Power Saws Sanders Nail Guns View More View all Power Tools Hand Tools Brickworking Tools Hand Saws Plastering Tools Woodworking Tools View More View all Hand Tools Workwear & Safety Trousers & Shorts Footwear Work Gloves Dust Masks View More View all Workwear & Safety Power Tool Accessories Drill Bits Sanding Accessories Angle Grinder Discs Batteries & Chargers View More View all Power Tool Accessories Tool Storage Tool Storage Systems Tool Boxes Tool Bags Tool Chests View More View all Tool Storage Ladders & Platforms Step Ladders Extension Ladders Combination Ladders Loft Ladders View More View all Ladders & Platforms Construction & Landscaping Landscaping Tools Workbenches Wheelbarrows Cement Mixers View More View all Construction & Landscaping Cleaning Supplies Vacuum Cleaners Cleaning Tools Car & Window Cleaning Cleaning Fluids View More View all Cleaning Supplies Measuring Levelling Tools Spirit Levels Laser Measuring Tools Detectors Tape Measures View More View all Measuring Levelling Tools Equipment Motoring Hot Glue Guns Work Lights Generators View More View all Equipment Renewables & Energy Wickes Solar Why choose Wickes solar? Advantages of solar? Solar panel installation Book a free quote View all Wickes Solar Renewable Energy Products Solar Panels Air Source Heat Pumps EV Charging Stations View all Renewable Energy Products Energy Efficiency Energy Efficient Home Energy Ratings How To Improve Your Home’s EPC Rating Lighting View all Energy Efficiency Energy Saving Advice Insulation Heating Lighting Draught Proofing View all Energy Saving Advice Helpful Guides Solar PV Buying Guide Heat Pump Buying Guide How To Insulate A Loft Upcycling Furniture View all Helpful Guides Wickes Solar Solar Energy Advantages of solar View all Solar Energy Wickes Solar Why choose Wickes solar? Solar panel installation View all Wickes Solar Get a Free No Obligation Quote Solar finance Solar Panel Price Estimator View all Get a Free No Obligation Quote Help & Advice How do solar panels work? Solar energy- advantages & disadvantages Solar panel myth busting View all Help & Advice Offers The Big Event The Big Timber Event The Big Tiles Event The Big Flooring Event The Big Doors Event View all The Big Event Latest Offers The Big Kitchens Event The Big Loft Event The Big Gardens Event Building Materials Offers View More View all Latest Offers Clearance Tiles Kitchens Bathrooms Gardens View all Clearance Log In / Register Track Order Ideas & Advice Project list Home Get In Touch Get In Touch - We're Here to Help Whether you’re interested in a new Kitchen or Bathroom, want to talk about products, need help with an order or anything in between we’re here to help. Please choose which drop down option accurately describes your query and use the contact details set out within the drop down box or complete the Contact form below. Track your order Use our handy tool to see the status of your order. You can track its location whilst it is on its way to you - with or without a Wickes account. To track your Wickes kitchen, bathroom or home office order, please complete our contact form; selecting 'Kitchen & bathroom'. Scroll down, it's just below. With our handy order tracking tool you can see: The date your order will be delivered The delivery carrier Where each part of your order will be delivered from When your Click & Collect order is ready to collect from your local store We're unable to offer live order tracking just yet, but we'll send you a text the day before your delivery with further details on when you can expect your order to arrive. Contact our customer service team When getting in touch with us, we need to confirm we’re talking to the right person. We’ll ask you a few questions to confirm you’re the person that paid for the order. If you’d like someone else to speak on your behalf, please ensure they’ve all the information necessary to pass our required Data Protection checks. Any conversation about order amendments, including refund requests, must be with the person that paid for the order. We are open: Monday - Saturday: 8am - 6pm Sunday: 10am - 5pm Here's some hints to help you choose the best way to contact us for your enquiry: Complete our Contact Form, scroll down, it's just below. We aim to respond to all enquiries within 48 hours. If you've received a damaged delivery or a faulty product, we'll ask you to email us some photos Use Live Chat - click ‘Chat’ on the bottom right of this page If you're unsure about what you've ordered If you've a question about our stock If you're asking about a delivery that's due today You can also call us on 0330 123 4123 If there's a queue you'll be given the option to ask for a call back. We’ll call you back when it's your turn. Contact our designed kitchen and bathroom team Wickes kitchen, bathroom or home office enquiries For enquiries about a Wickes kitchen, bathroom or home office order, please complete our contact form; selecting 'Kitchen & bathroom' as your reason for contacting us. Scroll down, it's just below. If you’d like to talk, call us on 0344 892 2721 . If you’d prefer to use Live Chat - click ‘Chat’ on the bottom right of this page. When getting in touch with us, we need to confirm we’re talking to the right person. We’ll ask you a few questions to confirm you’re the person that paid for the order. If you’d like someone else to speak on your behalf, please ensure they’ve all the information necessary to pass our required Data Protection checks. Any conversation about order amendments, including refund requests, must be with the person that paid for the order. We’re open: Monday - Friday 8am - 6pm Saturday - 8am - 4pm To book a design appointment Whether you're looking for a new kitchen, bathroom or home office; our Design Consultants have the knowledge and expertise to help you plan your space perfectly. Complete our online form Call us on: 0800 011 3031 We’re open: Monday - Friday: 9am - 8pm Saturday & Sunday: 9am - 5:30pm Community programme and charity requests We support charities and local communities in two ways: Nationally, we’re proud to be supporting The Brain Tumour Charity as our corporate charity partner.  This means we’re unable to offer monetary support to other causes. Locally, we support  the community through our Wickes Community Programme by providing products to help local charities and not for profit community groups. To apply for a product donation just head in to your local store and speak to the manager. Terms and conditions Press and media Please contact the press office at Clarion Communications on (0)20 7479 0910 or email wickes@clarioncomms.co.uk . Please note, these contact details are for media enquiries only. Complaints Our Commitment We’re dedicated to providing a professional and valued service to our customers and partners. We strive to handle customer complaints promptly and fairly. Contacting Us If you're unhappy with something, the fastest way to reach us is through our online chat service. If you'd prefer to talk, call us at 0330 123 4123 : Choose option 1 for a Wickes kitchen, bathroom or home office complaint. Choose option 3 for all other complaints. To escalate your concern, use the contact form below. Select the relevant order type and choose \"Something went wrong and I want to raise a complaint.\" We will acknowledge your complaint within 48 hours and forward it to the appropriate team. Further information might be needed to fully investigate your complaint. Alternatively, you can write to us at our registered address: Complaints Team Wickes Building Supplies Limited Vision House 19 Colonial Way Watford WD24 4JL To help us respond to you as quickly as possible, please include: Your name and address A contact phone number and email Your order number Details of your complaint with supporting photos Actions you’d like us to consider In the event that the customer services team is unable to resolve your complaint, or if you’re unhappy with the outcome, you can escalate your complaint by emailing customer.relations@wickes.co.uk , who will acknowledge your complaint within 48 hours and send it to the appropriate team. Resolution We aim to resolve your complaint at the first point of contact. Once the investigation is complete, you will be informed of the outcome. If you remain unhappy with the outcome, you can refer the decision to The Furniture and Home Improvement Ombudsman . They will review your case and may request further information from you or from us. Their decision will be binding upon us. For more information, visit fhio.org . Complaints relating to financial agreements If your complaint relates to the lender, it will be forwarded to them within five days of receipt. We will inform you once it has been sent. If the complaint is partially about the lender's actions, that part will be sent to the lender to investigate, while we will investigate the part related to the sale of the financial product and service. We will conduct a thorough and independent investigation and agree on a suitable outcome with you. Once our investigation is complete, we will inform you of the outcome. If you’re unhappy with the outcome, you can refer your complaint to the Financial Ombudsman Service . They can be contacted at: Phone: 0800 023 4567 Email: complaint.info@financial-ombudsman.org.uk Mail: Financial Ombudsman Service, Exchange Tower, London E14 9SR Contact form Required Field Reason for contacting us Order & support enquiries How can we help? To place a new order To cancel my order and request a refund Was your order placed online or in store? Online Store Product or stock availability information Order delivery or collection To view or track the status of your order, click here . Was your order placed online or in store? Online Store Select one of the below to provide more detail about your query Enquiry about my delivery Enquiry about my click & collect order My delivery is late My delivery has failed My delivery had items missing, damaged, or an incorrect quantity Please select an option To make a product guarantee claim What is the reason for your claim? Damaged product Product fault I have an enquiry not related to a specific order Something went wrong and I want to raise a complaint Wickes installed project How can we help? Make an existing order enquiry Does your order include a premium solid surface worktop? Yes No Book or amend a delivery date Does your order include a premium solid surface worktop? Yes No Make a product guarantee claim Does your order include a premium solid surface worktop? Yes No What is the reason for your claim? Damaged product Product fault Make an Installation workmanship guarantee claim Does your order include a premium solid surface worktop? Yes No Something went wrong and I want to raise a complaint Bespoke kitchens & bathrooms How can we help? Make an existing order enquiry Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No Book or amend a delivery date Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No Make a product guarantee claim Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No What is the reason for your claim? Damaged product Product fault Something went wrong and I want to raise a complaint Personal information First Name Last Name Email Phone Number Postcode Additional information Please help us to resolve your enquiry as quickly as possible by providing us with photos of the product showing any visible damage or fault, your order number (if known) and any other relevant details in the fields available. Order Number Attachments Add image or document Enquiry max 2500 characters ( 2500 characters left ) Sorry, something has gone wrong when trying to send your form. Please try submitting your form again or contact our customer service team on 0330 123 4123. Submit Please enter a valid email address Thank you for signing up for emails Ways to Pay About Wickes Careers at Wickes Company History Community Programme Responsible Business CALM Wickes Corporate PLC Help & Support Get In Touch Store Locator Accessibility Rate & Review FAQs Share Your Feedback Sitemap Our Policies Returns & Refunds Security Online Modern Slavery Corporate Governance Privacy Policy Cookie Policy Your cookie settings Terms & Conditions Our Services Payments Track My Order Delivery Information Click & Collect TradePro Membership Free Design Appointment Copyright © 2025 Wickes.co.uk Wickes Building Supplies Limited, Vision House, 19 Colonial Way, Watford, WD24 4JL Company Registration No. 1840419 VAT No. 336725881"
    },
    {
      "url": "https://thealfondinn.com/employment/",
      "text": "The Alfond Inn  | A Boutique Hotel in Winter Park, Florida We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now The Alfond Inn An Integrated Art Hotel Experience The Alfond Collection of Contemporary Art at Rollins College is, at once, a collection with a point of view and a lesson in the art of our times, social history, civic-mindedness, international affairs, and philanthropy. A work in progress, the collection is the brainchild of Barbara and Theodore Alfond (R'68), noted art collectors and several patrons of art institutions. Most of the Alfond Collection is installed at The Alfond Inn. The collection was conceived as a visual syllabus for the liberal arts values the Alfonds learned at Rollins and which shaped not only their student years but the rest of their lives. The curatorial narrative revolves around notions of critical thinking; literacy; enlarging one’s perspective; understanding other cultures and traditions; and language. Explore the Collection Our Boutique Hotel Winter Park, Florida Enjoy the boutique hotel Florida atmosphere with amenities to rival even the most luxurious hotels. With a stunning conservatory, lush courtyard, elevated pool & fitness center, The Alfond Inn one of the best hotels in Florida and poised to satisfy the casual traveler seeking quiet relaxation, and business clientele alike at our Winter Park FL Hotel. Explore the Hotel Our Packages If you prefer to call to reserve one of our Winter Park hotel packages, you may reach us at 407.998.8090 Romance in the Park One night stay in a classic room (Double Occupancy) One chilled bottle of prosecco in the room Dinner for two in Hamilton's Kitchen, tax and gratuity not included (Dinner valued at $80) Package price excludes gratuity and tax. Subject to availability. Adventures in the Park Two night stay in a classic room Two Winter Park boat tour Tickets Two tickets to the Charles Hosmer Morse Museum of American Art on Park Avenue Package price excludes gratuity and tax. Subject to availability. A Night at the Museum Two night stay in a classic room Two art-inspired cocktails in the Lounge Winter Park museum passes (entrance to the Rollins Museum of Art, the Charles Hosmer Morse Museum of American Art and Albin Polasek Museum & Sculpture Gardens) Enjoy The Alfond Collection of Contemporary Art throughout the hotel Package price excludes gratuity and tax. Subject to availability. All Packages Event Venues At our Hotel in Winter Park, Florida Overlooking the lush courtyard, the Conservatory at The Alfond Inn is the jewel center of our Winter Park Boutique Hotel and an ideal location for ceremonies or cocktails, with an available 5,000 sq. ft. ballroom and private dining areas. Adjacent to the library and reception space, the 1,026 sq. ft. Boardroom features the latest in A/V equipment and comfortable board-style seating. The Alfond Inn is one of the best hotels in Florida for you to host any event that you may have coming up! Book an Event Space The Spa The Spa at The Alfond Inn is the premier beauty and wellness destination for Winter Park locals and hotel guests looking to escape, indulge, and refresh. Offering an ambiance of stylish serenity, artfully curated wellness services, and bespoke body and skincare treatments, The Spa is where people come to seek peaceful and restorative time for themselves. About Our Spa Gallery Explore the Alfond Inn at Rollins College, a stylish boutique hotel in beautiful Winter Park, Florida that opened in 2013 and was recognized by Condé Nast Traveler - Readers' Choice Awards: Best hotel in Florida - 2014 - 2019. Visit the best of boutique hotels Florida has to offer, close to Orlando! 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://thealfondinn.com/",
      "text": "The Alfond Inn  | A Boutique Hotel in Winter Park, Florida We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now The Alfond Inn An Integrated Art Hotel Experience The Alfond Collection of Contemporary Art at Rollins College is, at once, a collection with a point of view and a lesson in the art of our times, social history, civic-mindedness, international affairs, and philanthropy. A work in progress, the collection is the brainchild of Barbara and Theodore Alfond (R'68), noted art collectors and several patrons of art institutions. Most of the Alfond Collection is installed at The Alfond Inn. The collection was conceived as a visual syllabus for the liberal arts values the Alfonds learned at Rollins and which shaped not only their student years but the rest of their lives. The curatorial narrative revolves around notions of critical thinking; literacy; enlarging one’s perspective; understanding other cultures and traditions; and language. Explore the Collection Our Boutique Hotel Winter Park, Florida Enjoy the boutique hotel Florida atmosphere with amenities to rival even the most luxurious hotels. With a stunning conservatory, lush courtyard, elevated pool & fitness center, The Alfond Inn one of the best hotels in Florida and poised to satisfy the casual traveler seeking quiet relaxation, and business clientele alike at our Winter Park FL Hotel. Explore the Hotel Our Packages If you prefer to call to reserve one of our Winter Park hotel packages, you may reach us at 407.998.8090 Romance in the Park One night stay in a classic room (Double Occupancy) One chilled bottle of prosecco in the room Dinner for two in Hamilton's Kitchen, tax and gratuity not included (Dinner valued at $80) Package price excludes gratuity and tax. Subject to availability. Adventures in the Park Two night stay in a classic room Two Winter Park boat tour Tickets Two tickets to the Charles Hosmer Morse Museum of American Art on Park Avenue Package price excludes gratuity and tax. Subject to availability. A Night at the Museum Two night stay in a classic room Two art-inspired cocktails in the Lounge Winter Park museum passes (entrance to the Rollins Museum of Art, the Charles Hosmer Morse Museum of American Art and Albin Polasek Museum & Sculpture Gardens) Enjoy The Alfond Collection of Contemporary Art throughout the hotel Package price excludes gratuity and tax. Subject to availability. All Packages Event Venues At our Hotel in Winter Park, Florida Overlooking the lush courtyard, the Conservatory at The Alfond Inn is the jewel center of our Winter Park Boutique Hotel and an ideal location for ceremonies or cocktails, with an available 5,000 sq. ft. ballroom and private dining areas. Adjacent to the library and reception space, the 1,026 sq. ft. Boardroom features the latest in A/V equipment and comfortable board-style seating. The Alfond Inn is one of the best hotels in Florida for you to host any event that you may have coming up! Book an Event Space The Spa The Spa at The Alfond Inn is the premier beauty and wellness destination for Winter Park locals and hotel guests looking to escape, indulge, and refresh. Offering an ambiance of stylish serenity, artfully curated wellness services, and bespoke body and skincare treatments, The Spa is where people come to seek peaceful and restorative time for themselves. About Our Spa Gallery Explore the Alfond Inn at Rollins College, a stylish boutique hotel in beautiful Winter Park, Florida that opened in 2013 and was recognized by Condé Nast Traveler - Readers' Choice Awards: Best hotel in Florida - 2014 - 2019. Visit the best of boutique hotels Florida has to offer, close to Orlando! 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://thealfondinn.com/the-hotel/contact-us",
      "text": "Contact The Alfond Inn At Rollins College | The Alfond Inn We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now Contact the Alfond Inn The Alfond Inn 300 East New England Avenue Winter Park, FL 32789 Please use this form to send us a message or call us at 407.998.8090 . We'd love to hear from you! If you are inquiring about hosting a meeting/event/group with us, please complete our Event Inquiry Form found here . First Name * Last Name * Email Address * Message * By submitting this form you agree with the storage and handling of your data by this website outlined in our Privacy Policy. * Are You a Real Human? * 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://thealfondinn.com/press-media/meeting-trends-from-the-alfond-inn-at-rollins/",
      "text": "The Alfond Inn  | A Boutique Hotel in Winter Park, Florida We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now The Alfond Inn An Integrated Art Hotel Experience The Alfond Collection of Contemporary Art at Rollins College is, at once, a collection with a point of view and a lesson in the art of our times, social history, civic-mindedness, international affairs, and philanthropy. A work in progress, the collection is the brainchild of Barbara and Theodore Alfond (R'68), noted art collectors and several patrons of art institutions. Most of the Alfond Collection is installed at The Alfond Inn. The collection was conceived as a visual syllabus for the liberal arts values the Alfonds learned at Rollins and which shaped not only their student years but the rest of their lives. The curatorial narrative revolves around notions of critical thinking; literacy; enlarging one’s perspective; understanding other cultures and traditions; and language. Explore the Collection Our Boutique Hotel Winter Park, Florida Enjoy the boutique hotel Florida atmosphere with amenities to rival even the most luxurious hotels. With a stunning conservatory, lush courtyard, elevated pool & fitness center, The Alfond Inn one of the best hotels in Florida and poised to satisfy the casual traveler seeking quiet relaxation, and business clientele alike at our Winter Park FL Hotel. Explore the Hotel Our Packages If you prefer to call to reserve one of our Winter Park hotel packages, you may reach us at 407.998.8090 Romance in the Park One night stay in a classic room (Double Occupancy) One chilled bottle of prosecco in the room Dinner for two in Hamilton's Kitchen, tax and gratuity not included (Dinner valued at $80) Package price excludes gratuity and tax. Subject to availability. Adventures in the Park Two night stay in a classic room Two Winter Park boat tour Tickets Two tickets to the Charles Hosmer Morse Museum of American Art on Park Avenue Package price excludes gratuity and tax. Subject to availability. A Night at the Museum Two night stay in a classic room Two art-inspired cocktails in the Lounge Winter Park museum passes (entrance to the Rollins Museum of Art, the Charles Hosmer Morse Museum of American Art and Albin Polasek Museum & Sculpture Gardens) Enjoy The Alfond Collection of Contemporary Art throughout the hotel Package price excludes gratuity and tax. Subject to availability. All Packages Event Venues At our Hotel in Winter Park, Florida Overlooking the lush courtyard, the Conservatory at The Alfond Inn is the jewel center of our Winter Park Boutique Hotel and an ideal location for ceremonies or cocktails, with an available 5,000 sq. ft. ballroom and private dining areas. Adjacent to the library and reception space, the 1,026 sq. ft. Boardroom features the latest in A/V equipment and comfortable board-style seating. The Alfond Inn is one of the best hotels in Florida for you to host any event that you may have coming up! Book an Event Space The Spa The Spa at The Alfond Inn is the premier beauty and wellness destination for Winter Park locals and hotel guests looking to escape, indulge, and refresh. Offering an ambiance of stylish serenity, artfully curated wellness services, and bespoke body and skincare treatments, The Spa is where people come to seek peaceful and restorative time for themselves. About Our Spa Gallery Explore the Alfond Inn at Rollins College, a stylish boutique hotel in beautiful Winter Park, Florida that opened in 2013 and was recognized by Condé Nast Traveler - Readers' Choice Awards: Best hotel in Florida - 2014 - 2019. Visit the best of boutique hotels Florida has to offer, close to Orlando! 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://thealfondinn.com/hotel-policy",
      "text": "Hotel Policy | The Alfond Inn We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now Hotel Policies The following hotel policies provide important information for check-in/check-out, pets, smoking, and other topics. If your question is still unanswered after reading through our hotel policies, please feel free to contact us . Check-in Time: 4:00pm Check-out Time: 11:00am NON-SMOKING HOTEL The Alfond Inn is a smoke-free environment. There is no smoking allowed in guest rooms or inside the hotel. Designated outdoor smoking areas are available. REGISTRATION AGE Our minimum age to book reservations and check-in is 21 years old. CREDIT AND DEBIT CARD POLICY A credit or debit card is required to confirm your reservation. A credit or debit card must be presented along with a valid photo ID upon check-in. A pre-authorization amount will be placed on your card at check-in for the full length of the stay plus an additional $75 hold per day for incidentals. This is a temporary hold of a specific amount – it is not a charge to your account, but it can create a hold on those funds or against credit availability. We also may charge your card for any damage to the room or premises you or your guests cause. Once your actual incurred charges are posted at check-out, based on your bank, credit card company, or institution’s policy, it can take anywhere from 24 hours to 30 days for the original pre-authorization amount to be removed. It is your responsibility to be aware of how your bank, credit card company, or institution handles all of your transactions, including pre-authorizations. The hotel will not be responsible for any delay in releasing funds or returning availability or any fees or charges by your bank, credit card company, or institution as a result of your use of a credit or debit card. We are unable to remove pre-authorizations directly through our hotel. This policy applies to all reservations. CANCELLATION POLICY You may cancel your reservation for no charge before 11:59pm local hotel time up to 72-hours before arrival. Please note that we will assess a few 1 night rooms and tax if you must cancel after this deadline. The Cancellation Policy is subject to change based upon dates of stay, season, and method of reservation. Please contact the hotel for more information regarding your reservation. DAILY RESORT CHARGE A daily resort fee of $20 (plus tax) will be charged to your room rate per room, per night and includes: Complimentary Wi-Fi, two bottles of water daily replenished in your room, access to fitness center, access to our Pool Terrace and pool towels, access to popular news publications and 10% discount at The Spa and Hamilton’s Kitchen Restaurant. VALET PARKING We offer 24-hour valet parking. The valet parking fee is $30 per day plus applicable taxes. Overnight guests have in/out privileges. Day use parking is $17 plus applicable taxes. If you are visiting The Spa or Hamilton’s Kitchen, parking is complimentary. Self-parking is not available. DOG POLICY The Alfond Inn welcomes all well-managed dogs with no weight limit or breed restriction. Guests bringing dogs must have them leashed at all times when outside of the room. Guests will be charged a non-refundable fee of $50 per night, per dog; maximum of two dogs per room. Emotional support animals are not service animals under the ADA law. Service dogs will be exempt from this fee. Room type and location restrictions may apply, including our pools and restaurants. The dog-friendly rooms are restricted to our existing guest rooms and suites. Our new wing rooms and suites do not allow dogs. Guests will be responsible for any property damage inadvertently caused by their dogs or to any disruption of other hotel guests’ stay. Housekeeping service during your stay should be arranged either when you and your dog are not in the room, or if you are, the dog must be leashed or crated. Please read our Dog Policy for more information here . Our hotel is ADA compliant and service animals are welcome. WEAPONS POLICY Weapons are strictly prohibited on property. PHOTOGRAPHY AND VIDEO POLICY Our highest priority is the safety and privacy of our guests. Professional and/or commercial photography or videography is not permitted on the premises of The Alfond Inn without prior written authorization from the hotel management, including but not limited to filming, engagement photos, wedding photos, modeling shoots, etc. Drone photography/videography is strictly prohibited. Requests to use any area of the hotel as a location for photography or videography should be directed to the Marketing Team by calling us at 407-998-8090. If approved, shoots are subject to fees and schedule restrictions. ADDITIONAL POLICIES We reserve the right to cancel or modify reservations where it appears that a customer has engaged in fraudulent or inappropriate activity or under other circumstances where it appears that the reservations contain or resulted from a mistake or error. Rates quoted are based on check-in date and length of stay. Should you choose to depart early, the price is subject to change. Photos of guestrooms are representative of the general design and décor of the rooms. The exact layout and view in any of the guestroom photos are not guaranteed. Special Terms apply for Advance Rate Plans which are Fully Prepaid, Non-Changeable, Non-Refundable and will be noted as such in the Rate Plan Description. 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "text": "Contact | Eddy's Kitchen top of page Home Contact About us Catering Blog More Use tab to navigate through the menu items. ORDER NOW OR SCHEDULE! Contact Us Address 525 Somerset St. North Plainfield, NJ 07060 Contact 908-205-0531 Opening Hours Mon - Fri 6:30 am – 2:00 pm info@TheEddysKitchen.com Saturday 6:30 am – 2:00 pm ​Sunday Closed First Name Last Name Email Message Send Thanks for submitting! info@theeddyskitchen.com ©2023 by Eddy's Kitchen. bottom of page"
    },
    {
      "url": "https://kitchenrenovationshamilton.co.nz/about-us/",
      "text": "Learn About Us | #1 Trusted and Reliable Kitchen Experts At Kitchen Renovations Hamilton Skip to content Call Now: (07) 807-9230 (07) 807-9230 ENQUIRE NOW Home About Us Services Luxury Kitchens Contemporary Kitchens Apartment Kitchens Small Kitchen Remodelling Custom Kitchens Projects Testimonials Contact Us Menu Home About Us Services Luxury Kitchens Contemporary Kitchens Apartment Kitchens Small Kitchen Remodelling Custom Kitchens Projects Testimonials Contact Us About Us Industry Accreditations* Industry Accreditations* Industry Accreditations* History Founded in 2018 by Reagan and his now wife, Toyah, Kitchen Renovations Hamilton began with a shared vision: to create stunning, functional kitchens that turn everyday spaces into something extraordinary. Reagan brought years of hands-on construction experience as a foreman in the Waikato, while Toyah contributed her savvy business acumen. Together, they laid the foundation for what would become one of Hamilton’s most trusted kitchen renovation teams. The journey started with a single van, a leap of faith, and a passion for great design. Backed by the support of fellow tradesmen and a commitment to quality, Reagan left his 9-to-5 job, hired an apprentice, and focused on delivering bespoke kitchen makeovers that reflected both style and practicality. Word spread quickly, and soon kitchen renovation projects began to pour in—transforming the company’s focus and identity. As their reputation for craftsmanship grew, so did the team. Another apprentice joined, followed by a fully qualified carpenter, enabling Kitchen Renovations Hamilton to take on more complex and creative kitchen transformations across the region. Throughout it all, Reagan and Toyah balanced business growth with family life—raising three sons and welcoming a golden retriever into their busy household. In 2024, their hard work was formally recognized on a national scale. The company received multiple Master Builder Awards, including Gold, Top 100, and both regional and national honors, celebrating their dedication to quality, innovation, and customer satisfaction. Today, Kitchen Renovations Hamilton is proud to lead the way in custom kitchen design across the Waikato. With deep roots in craftsmanship and a passion for creating spaces that reflect the heart of the home, Reagan, Toyah, and their team continue to deliver kitchens that are built to last—and designed to inspire. CONTACT US Facts About Us at Kitchen Renovations Hamilton Local Knowledge, Trusted Results Since 2018, Kitchen Renovations Hamilton has been helping homeowners across Hamilton transform outdated spaces into beautiful, functional kitchens. With a strong focus on quality, our team brings years of experience and a passion for craftsmanship to every project. From the first initial consultation to the final installation, we take the time to understand your project vision and tailor each renovation to suit your lifestyle, needs, and budget. Whether it’s an existing kitchen or a completely new kitchen build, we bring expert insight to every stage. We don’t just aim to renovate—we aim to create a space that genuinely improves how you live and interact with your home. Our commitment to excellent service and proven results makes us one of the most trusted teams for kitchen renovations in the Waikato. Custom Solutions for Real Homes We specialise in delivering custom kitchens that enhance the way you live. Every kitchen renovation we undertake is built around thoughtful kitchen design, efficient space planning, and an extensive range of cabinetry, materials, and finishes to choose from. No two homes are the same, and your kitchen should reflect that. Our goal is to deliver a well designed kitchen that’s as practical as it is stylish. Whether your focus is on improved layout, smarter storage, or modernising a tired space, we help bring your ideas to life. Our experienced team works collaboratively with you—ensuring that the final result doesn’t just meet expectations, but exceeds them. Quality Work at Competitive Pricing At Kitchen Renovations Hamilton , we believe that a dream kitchen should be accessible without compromising on quality. That’s why we offer competitive pricing while maintaining the highest quality craftsmanship and service. We understand how important value is, which is why we focus on transparent pricing, clear communication, and dependable timelines. Our work is backed by years of positive feedback from happy customers throughout Hamilton. We don’t just renovate kitchens—we create spaces that truly feel like the heart of the house, built to last and designed to suit your life. From the moment we begin, we’re committed to delivering a renovation experience that is smooth, stress-free, and inspiring. A Team Committed to Creating More Behind every project is a team that truly cares. From our skilled designers to our expert tradespeople, we work with integrity, creativity, and a shared goal: to create kitchens that work with your budget and enrich your everyday routine. When you choose Kitchen Renovations Hamilton , you’re choosing a partner who brings your vision to life with passion and purpose. We’re here to help you get the most from your space—whether that means functionality, beauty, or both. Our mission is simple: deliver kitchens that elevate the way you live. CONTACT US Why Choose Us Transform Your Space with Lifestyle-Focused Kitchen Renovations in Hamilton At Kitchen Renovations Hamilton , we believe your kitchen should be more than just a cooking space—it should be a reflection of your lifestyle, your personality, and the heart of your home. That’s why we approach every project with purpose and care, blending thoughtful kitchen design with functionality that fits real life. Whether we’re working on a compact space or a full kitchen transformation, our goal is always the same: to create something that truly works for you. From your initial consultation to the final reveal, our team is hands-on and detail-focused. We listen, we collaborate, and we adapt—ensuring every step of your renovation is smooth and stress-free. With a reputation built on trust, transparency, and consistent results, we’re proud to be a kitchen renovations team that Hamilton homeowners can rely on, time and again. ENQUIRE NOW House Of The Year 2024 award Winners LEARN MORE House Of The Year Award Winners LEARN MORE Why Choose Us Trusted Kitchen Experts Backed by Experience Choosing Kitchen Renovations Hamilton means partnering with a team that’s qualified, experienced, and committed to delivering exceptional results. Our workmanship is guided by proven processes, attention to detail, and an unwavering focus on what matters most—your satisfaction and peace of mind. We meet high industry standards in both design and delivery. From managing timelines and budgets to sourcing quality materials and ensuring long-lasting finishes, we approach every project with full accountability and care. When you work with us, you can be confident your kitchen is in good hands—from concept through to completion. Your kitchen is a major investment. Work with a team that’s trusted, qualified, and recognised across Hamilton for consistent, high-quality results. Master Builders Association Check Our Official Listing Get Started Renovate with Hamilton’s Trusted Kitchen Experts—Creating Beautiful, Functional Kitchens That Fit Your Life Contact Information (07) 807-9230 info@kitchenrenovationshamilton.co.nz Hamilton, New Zealand Location Notice: JavaScript is required for this content. Get Started Home About Us Contact Us HTML Sitemap Careers Newsletter Editorial Guidelines Services Luxury Kitchens Contemporary Kitchens Apartment Kitchens Small kitchen Remodeling Custom kitchens Contact Information (07) 807-9230 Hamilton © Kitchen Renovations Hamilton. All rights reserved. Facebook Instagram X-twitter Linkedin Pinterest Reddit Tiktok Youtube Privacy Terms and Conditions © Kitchen Renovations Hamilton. All rights reserved. Facebook Instagram X-twitter Linkedin Pinterest Reddit Tiktok Youtube Terms and Conditions Privacy © Kitchen Renovations Hamilton. All rights reserved. Facebook Instagram X-twitter Linkedin Pinterest Reddit Tiktok Youtube Privacy Terms and Conditions Scroll to Top"
    },
    {
      "url": "https://thealfondinn.com/press-media/refining-florida-flavors-at-hamilton-s-kitchen/",
      "text": "The Alfond Inn  | A Boutique Hotel in Winter Park, Florida We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now The Alfond Inn An Integrated Art Hotel Experience The Alfond Collection of Contemporary Art at Rollins College is, at once, a collection with a point of view and a lesson in the art of our times, social history, civic-mindedness, international affairs, and philanthropy. A work in progress, the collection is the brainchild of Barbara and Theodore Alfond (R'68), noted art collectors and several patrons of art institutions. Most of the Alfond Collection is installed at The Alfond Inn. The collection was conceived as a visual syllabus for the liberal arts values the Alfonds learned at Rollins and which shaped not only their student years but the rest of their lives. The curatorial narrative revolves around notions of critical thinking; literacy; enlarging one’s perspective; understanding other cultures and traditions; and language. Explore the Collection Our Boutique Hotel Winter Park, Florida Enjoy the boutique hotel Florida atmosphere with amenities to rival even the most luxurious hotels. With a stunning conservatory, lush courtyard, elevated pool & fitness center, The Alfond Inn one of the best hotels in Florida and poised to satisfy the casual traveler seeking quiet relaxation, and business clientele alike at our Winter Park FL Hotel. Explore the Hotel Our Packages If you prefer to call to reserve one of our Winter Park hotel packages, you may reach us at 407.998.8090 Romance in the Park One night stay in a classic room (Double Occupancy) One chilled bottle of prosecco in the room Dinner for two in Hamilton's Kitchen, tax and gratuity not included (Dinner valued at $80) Package price excludes gratuity and tax. Subject to availability. Adventures in the Park Two night stay in a classic room Two Winter Park boat tour Tickets Two tickets to the Charles Hosmer Morse Museum of American Art on Park Avenue Package price excludes gratuity and tax. Subject to availability. A Night at the Museum Two night stay in a classic room Two art-inspired cocktails in the Lounge Winter Park museum passes (entrance to the Rollins Museum of Art, the Charles Hosmer Morse Museum of American Art and Albin Polasek Museum & Sculpture Gardens) Enjoy The Alfond Collection of Contemporary Art throughout the hotel Package price excludes gratuity and tax. Subject to availability. All Packages Event Venues At our Hotel in Winter Park, Florida Overlooking the lush courtyard, the Conservatory at The Alfond Inn is the jewel center of our Winter Park Boutique Hotel and an ideal location for ceremonies or cocktails, with an available 5,000 sq. ft. ballroom and private dining areas. Adjacent to the library and reception space, the 1,026 sq. ft. Boardroom features the latest in A/V equipment and comfortable board-style seating. The Alfond Inn is one of the best hotels in Florida for you to host any event that you may have coming up! Book an Event Space The Spa The Spa at The Alfond Inn is the premier beauty and wellness destination for Winter Park locals and hotel guests looking to escape, indulge, and refresh. Offering an ambiance of stylish serenity, artfully curated wellness services, and bespoke body and skincare treatments, The Spa is where people come to seek peaceful and restorative time for themselves. About Our Spa Gallery Explore the Alfond Inn at Rollins College, a stylish boutique hotel in beautiful Winter Park, Florida that opened in 2013 and was recognized by Condé Nast Traveler - Readers' Choice Awards: Best hotel in Florida - 2014 - 2019. Visit the best of boutique hotels Florida has to offer, close to Orlando! 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://thealfondinn.com/the-spa",
      "text": "The Spa | The Alfond Inn We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. View our updated Cookies & Privacy Policy to learn more. I Agree Save 12% Save 12% Our Birthday, Your Gifts Enjoy 12% off our Best Available Rate with a credit toward Breakfast for Two. Celebrate with Us The Hotel The Hotel Dining Dining Special Offers Special Offers Meetings & Events Meetings & Events The Spa The Spa Book Now The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Weddings Meetings and Event Space Information Event Inquiry Form Request RFP About The Spa Spa Treatments Book Treatment Spa Cafe The Hotel Art Hotel Rooms & Suites History Upcoming Events Contact Us Stay in Touch Gallery Dog Friendly Dining Dining Special Offers Special Offers Meetings & Events Weddings Meetings and Event Space Information Event Inquiry Form Request RFP The Spa About the Spa Spa Treatments Book Spa Treatment Spa Cafe Book Now Book Now The Spa at The Alfond Inn Enhance beauty and elevate wellness at The Spa at The Alfond Inn, Winter Park’s newest sought-after spa destination. Free yourself from the stressors of daily life, clear your headspace, or recapture your vitality in exclusive style. Elevated Elegance Indulge in the ultimate wellness experience with our multi-disciplinary team of massage therapists and aestheticians. At The Spa, we offer curated therapies and bespoke beauty treatments designed to boost your confidence and refresh your mindset. Our luxurious amenities feature separate men's and women's locker rooms equipped with showers, an experiential shower, a sauna, a steam room, and a comfortable refreshment area stocked with curated toiletries. With seven serene treatment rooms and a tranquil Sanctuary area, you can unwind before or after your therapy. Our exclusive pool, complete with an outdoor lounge area and private cabanas available for rent, invites you to extend your relaxation. Escape to The Spa, where personalized self-care awaits. Book Treatment For the Locals Florida residents, discover your tranquil retreat right in your backyard. Show your ID at The Spa at The Alfond Inn to enjoy a serene escape with 15% off our spa services, available Monday through Thursday. Embrace bespoke wellness treatments in our elegant setting to rejuvenate and refresh. Use code LOCALS15. Book Now The Spa Café Nourish your body and spirit at The Spa Café, available daily from 10 AM to 6 PM, where each dish is crafted with mindfulness to complement your wellness journey. Indulge in a menu designed to energize and rejuvenate, featuring wholesome ingredients that cater to both health and pleasure. Book Now Eminence Herbal Cellulite Treatment 50 minutes | $222 Reveal radiant, firmer skin with our Herbal Cellulite Treatment - a full-body exfoliation, detoxifying herbal wrap, and hydrating finish that smooths, tones, and deeply nourishes. Your glow starts here. Book Now Eminence Ultimate Vitality Facial 80 minutes | $333 Discover radiant skin with our Ultimate Vitality Facial - an 80-minute rejuvenating experience featuring Eminence Organics, superfood-infused treatments, and expert massage to restore glow, firmness, and hydration. Luxury, naturally. Book Now FEATURED TREATMENT Experience the Stress, Sleep & Pain Relief Ritual by Zents , a luxurious 110-minute journey designed to rejuvenate your mind, body, and spirit. Begin with a gentle exfoliation that unveils a radiant glow, followed by a soothing full-body massage enhanced with calming, botanical-infused oils to ease stress and deep muscle tension. The ritual concludes with a hydrating body wrap that cocoons you in warmth, promoting rest and recovery. This transformative experience is your invitation to surrender to bliss and achieve a harmonized, revitalized state. BOOK NOW Give the Gift of Serenity Treat someone special—or yourself—to the gift of tranquility at The Spa at The Alfond Inn. Our gift cards offer a thoughtful way to celebrate any occasion, inviting the recipient to escape, unwind, and restore in our serene Winter Park sanctuary. Whether used for a bespoke massage, a rejuvenating facial, or a signature wellness ritual, every visit is a moment of calm, care, and confidence. Buy Gift Card Frequently Asked Questions Appointments & Reservations We strongly recommend that you schedule spa appointments before you arrive at the Spa. Reservations are subject to availability and must be guaranteed with a credit card. Cancellation Policy Treatment times are reserved especially for you. We kindly request that cancellations or changes to appointments be made at least 24 hours in advance. NO show or same-day cancellation appointments will be charged in full. Groups are subject to a minimum 14-day cancellation policy as stated in their contracts. What if I have special health considerations? Please notify our spa concierge if you have high blood pressure, allergies, any physical ailments, or special needs, have had recent surgeries or medical procedures, or if you are pregnant or breastfeeding. This information may also be completed on your Personal Care Guide before arrival at The Spa. These health considerations would affect your choice of services. Arrival We kindly ask that you arrive at least 30 minutes prior to your scheduled appointment. This allows time for a relaxed check-in and an opportunity to enjoy the spa amenities. To preserve the tranquil environment, please silence your cell phone upon arrival. A valid photo ID will be required at check-in. Please note: Arriving late may result in a shortened service to avoid delaying the next guest. Late Arrival As a courtesy to our other clients, late arrivals will only receive the remaining available appointment time and will be charged the full-service fee. Food & Beverage Guests are invited to enjoy our exclusive food and beverage selections available on the Spa Pool Deck. To preserve the ambiance and uphold our service standards, we kindly ask that no outside food or beverages be brought into the area. Our curated menu has been thoughtfully designed to complement your relaxation experience with premium offerings. Please note: Any guest appearing under the influence will be respectfully denied access to The Spa to ensure the comfort, safety, and well-being of all our guests. Please be advised that all Spa Pool Deck food and beverage purchases are processed through a separate payment system. Guests must present a form of payment directly to the food and beverage attendant prior to checkout. These charges cannot be combined with spa treatment transactions. Can someone help me choose a treatment? Our Spa Concierge will help you plan the perfect spa experience to meet your specific needs. Please inform the concierge of any medical concerns, or therapist preferences during the reservation consultation. What should I wear? Disrobe to the level of your comfort. Undergarments are not necessary, but you may wear them during your treatment if you prefer. Our licensed therapists are trained to drape a sheet or towel over your body in a discrete manner, always assuring your privacy. Bathing suits are recommended in the hydrotherapy amenities and are required for the pool. Should I shave before a treatment? Shaving is not recommended before any body exfoliation treatment or hair removal services. Men should please shave 2 hours before their scheduled facial treatment. Minimum age requirement Spa services and amenities are reserved for guests 18 years and older. Teens ages 14–17 may receive select treatments when accompanied by a parent or guardian throughout the entire experience. Services must be with the same cisgender therapist (access to spa amenities, including the pool, will not be available for guests under 18). Cell Phones In consideration of our other guests, we ask that you turn off your cell phone before entering The Spa. Payment For your convenience, The Spa operates as a cashless environment. We are pleased to accept all major credit cards. Service Charge Please note that a mandatory surcharge of 25% will be added for all a la carte services and day spa packages you receive and will be dispersed to the spa staff that served you during your visit. Gratuities are optional and are left at your discretion. Gratuities are retained in full by the provider(s) performing the service(s). Prices and services are subject to change without notice. Valuables Please do not bring or leave valuables in the facility or lockers. We are not responsible for any theft or loss of personal property, including jewelry or other personal items. Locker use For the comfort and convenience of all guests, only personal-sized (18'W x 9.5H) duffle/tote bags are permitted in The Spa lockers. Group experiences and special events Elevate your next gathering with a bespoke spa experience at The Spa at The Alfond Inn. Perfect for bridal parties, wedding day preparations, corporate retreats, conference downtime, or simply a restorative day with friends, our elegant oasis in the heart of Winter Park offers a serene setting to connect, celebrate, and unwind. From curated wellness therapies to signature massages and rejuvenating facials, our expert team will tailor every detail to your group’s needs—creating moments that inspire relaxation, boost energy, and leave lasting impressions. Between treatments, your party can enjoy The Alfond Inn’s art-filled spaces, rooftop pool, and award-winning dining, just steps from downtown Winter Park. Please note: Group spa reservations are booked separately from hotel event and meeting packages. If you are hosting an on-property wedding, meeting, or event and wish to include spa services, please coordinate through your Sales Manager, who will work with our Spa Group Coordinator to arrange your experience. To arrange group spa services, please contact our Spa Group Coordinator at: spagroups@thealfondinn.com. Spa Hours Sunday - Thursday:  10:00 am - 6:00 pm Friday - Saturday:  9:00 am - 7:00 pm Holidays Hours (Thanksgiving, Christmas, and New Years): 10:00 am - 2:00 pm Fitness Center Hours Monday - Sunday: 6:00 am - 10:00 pm (Hours are subject to change based on availability) 407.645.6611 | spa@thealfondinn.com Facebook Instagram 300 East New England Avenue Winter Park, FL 32789 Book Now 407.998.8090 Connect Contact Us Stay in Touch Press & Media Upcoming Events Explore Weddings Event Spaces Hamilton's Kitchen The Hotel Our History Special Offers Rooms & Suites Careers Facebook Instagram Handcrafted by Flylight Media © Copyright 2025 The Alfond Inn | Privacy Policy Keep in Touch! Stay connected for promotions, announcements, & more! Yes, I would like to receive updates. Get Updates × ↑"
    },
    {
      "url": "https://www.centralfloridalifestyle.com/dining/the-magic-behind-hamiltons-kitchen/",
      "text": "The Magic Behind Hamilton’s Kitchen: Deep Dive With the Chefs – Central Florida Lifestyle Select a Region: - Central Florida - Altamonte Springs Brevard County College Park DeSoto County Flagler County Horizon West Hardee County Hernando County Highlands County Hillsborough County Lake County Lake Nona Metro West Manatee County Osceola Oakland Park Pasco County Polk County Pinellas County Sarasota County Sumter County Seminole County Windermere Winter Garden Winter Park Distro Locations Contribute Subscribe instagram facebook linkedin twitter youtube 2025 Cutest Pet Contest Teacher Shoutout Best of Hotels Contest Digital Edition CFL Lifestyle Lifestyle Local Beauty Education Shopping DIY Community Conversations Entertainment This or That Movies Music Sports Travel Food & Drink Foodie Recipes Health Fitness & Wellness Medical News Events About Us News Corner Search Search for: Search Select a Region: - Central Florida - Altamonte Springs Brevard County College Park DeSoto County Flagler County Horizon West Hardee County Hernando County Highlands County Hillsborough County Lake County Lake Nona Metro West Manatee County Osceola Oakland Park Pasco County Polk County Pinellas County Sarasota County Sumter County Seminole County Windermere Winter Garden Winter Park Menu Distro Locations Contribute Subscribe Follow us instagram facebook linkedin twitter youtube Search Search for: Search Latest stories Orlando Mom Collective to Host 4th Annual Women’s Wellness Event in Winter Park Central Florida Fall & Halloween Festivals 2025 Orlando to Celebrate Hispanic Heritage Month with Art Exhibit and Community Events Healthy Lunchbox Hacks from local doctors for Happier, More Focused Kids Orange County Medical Clinic to Offer Free Health Screenings During National Cholesterol Awareness Month Previous Next The Magic Behind Hamilton’s Kitchen: Deep Dive With the Chefs by Alexis George September 18, 2023, 2:55 pm Share Tweet Nestled inside the renowned Alfond Inn in Winter Park, Hamilton’s Kitchen is a haven where flavors, artistry, and passion align. At the restaurant, Executive Chef Stephen Doyle and twin Sous Chefs Neil and Matt Corbin craft meals into memorable experiences. Pulling back the curtain, we find that food is not just sustenance but a vibrant art form. Chef Stephen’s Unpredictable Journey: From Ireland’s green landscapes to mechanical engineering to Orlando’s bustling kitchens, Chef Stephen’s journey to Orlando was anything but predictable. “The funny story was when I came here, I ended up cutting my fingers, so I was like, ‘I’m never putting my fingers in the engine again,’ so I picked up a chef knife instead,” he laughed. Starting at Calico Jack’s Oyster Bar, his passion for delighting patrons propelled him up the culinary ranks. Today, as the Executive Chef of Hamilton’s Kitchen, he envisions a bustling space renowned for its five-star experiences. And what better way to reach the goal than by leading an extraordinary team that is just as passionate about food and results? The Corbin Twins: Culinary Synchrony Boston-born with Barbadian roots, Matt and Neil Corbin’s culinary love story began by watching their mother cook. While Neil’s culinary aspirations were clear early on, Matt’s shift from carpentry to cooking was a delightful twist. So, when their parents asked them to move to Orlando, they accepted the request. The rest is a match made in heaven. “Neil came to me first. If I forget something, he’s already done it, and to have somebody like that is amazing,” Chef Stephen said. “So, I said to him one day, ‘you don’t happen to have another one of you, and he goes, yeah, I do actually, my brother,’ so I got a two for one.” Matt and Neil have always shared similar interests. Sparked during the pandemic, their new love for gardening fuels their culinary creativity at home and work. “Growing our own food just makes us want to experiment with the fresh ingredients in our yard,” Neil shared, with Matt adding, “It’s best fresh. I love seeing everything grow from nothing to ready to pick and put on a plate.” Harmonizing at Hamilton’s Kitchen The twins constantly innovate, drawing inspiration from Disney Springs, cruises, YouTube and TikTok. They have different interests in food styles, but their synergy is undeniable. Matt and Neil even admit that they leave the kitchen the way the other likes. It makes for a seamless transition between the day and night shifts. “I don’t even hear them talk sometimes, but they can intertwine so well,” Chef Stephen comments. “There are never any complications, and they never have a bad word to say about each other; they’re just super cool.” Under Chef Stephen’s guidance, they’re now crafting their own menu items. The job may be challenging sometimes, but they enjoy the tough love. “[Chef Stephen] is awesome! He’s had my back since I started working here, so he always takes care of me,” Neil said. “He gave me a chance to be a sous chef,” Matt echoed. This trio’s collaboration is the cornerstone of Hamilton’s Kitchen’s success. Chef Stephen’s mentorship and the twins’ eagerness to learn and innovate create a nurturing and challenging dynamic. Together, they’re not just serving meals; they’re crafting experiences. Read Later Add to Collection Report Newsletter Want more stuff like this? Get the best local stories straight into your inbox! Enter your email to subscribe to our newsletter. Email address: Leave this field empty if you're human: Don't worry, we don't spam.Enter your email to subscribe to our newsletter. See more Previous article Getting Piggy With It: Ravenous Renovations And What’s New Next article Orange County Regional History Center: Important History to be Preserved What do you think? 385 points Upvote Downvote What's Your Reaction? Cute 0 Cute LOL 0 LOL Love 0 Love It's Ok 0 It's Ok OMG 0 OMG YES 0 YES biotech peptides 0 biotech peptides peptides 0 peptides selank 0 selank stress 0 stress skincare 0 skincare health 0 health wellness 0 wellness Medical 0 Medical Legal 0 Legal Recreational Center 0 Recreational Center Swimming 0 Swimming Pools 0 Pools Community 0 Community AI 0 AI RAG 0 RAG Using AI 0 Using AI Privacy 0 Privacy Security 0 Security Written by Alexis George You May Also Like Florida Officials Promote Road Safety as Record Number of Drivers Expected This Fourth of July Orlando Breaks Tourism Record with Over 75 Million Visitors in 2024 Delta Air Lines Expands Network with New Seasonal Routes, Emphasizing Orlando as Key Leisure Hub Best Travel Spots for Summer 2025: Orlando Ranked Third Explore Central Florida’s Finest in Homebuilding, Design, and Craftsmanship during the 72nd Annual Parade of Homes Orlando May 10–18 UCF Ranked Among Nation’s Top Five Most Innovative Public Universities More From: Dining Morimoto Asia to Celebrate 10th Anniversary at Disney Springs with Chef Masaharu Morimoto by Melissa Donovan August 29, 2025, 1:35 pm Visit Orlando’s 20th Annual Magical Dining Returns with Record-Breaking Restaurant Lineup this weekend by Staff Writer August 14, 2025, 12:41 pm White Castle to Open New Clermont Location on August 12, Adding 75 Jobs to Lake County by Melissa Donovan August 1, 2025, 1:50 pm Visit Orlando’s Magical Dining Returns for 20th Anniversary with Over 160 Participating Restaurants by Staff Writer July 20, 2025, 11:47 pm Four Finger Foods To Make This Fourth Of July by Grayson Keglovic July 2, 2025, 10:19 am Discover the Best Healthy Eats in Orlando: A Guide to Nourishing Options by Melissa Donovan July 1, 2025, 1:30 pm Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Loading… 0 Comments Don't Miss Central Florida Oktoberfest 2025: Krush Brau Park Leads the Party by Waylon Krush, CEO of ZeroTrusted.AI September 4, 2025, 2:30 pm Adventure Travel Packing List: Must-Have Gear for Wild Expeditions by Evelina Brown March 24, 2025, 10:22 am YMCA of Central Florida and DaVita to Offer Free Health Screenings in Seminole and Orange Counties by Melissa Donovan August 12, 2025, 11:45 am Finding Time for a Wellness Routine as a Parent During Back-to-School Season by Melissa Donovan August 12, 2025, 12:47 pm 6 Satisfying After-School Snacks Your Kids Will Love by Lauren Margolis August 12, 2025, 12:20 pm AdventHealth for Children Donates $1 Million to Orlando Science Center to Advance STEM Education by Melissa Donovan August 12, 2025, 12:11 pm Find us on Facebook Loading... Current Month september, 2025 CAMX (the Composites and Advanced Materials Expo) Orange County Convention Center 9400 Universal Blvd. 07 sep All Day 11 CAMX (the Composites and Advanced Materials Expo) Event Details Bringing together ideas, science, and business connections that are creating the materials and products of the future.\nJoin a diverse group of manufacturers, Original Equipment Manufacturers (OEMs), innovators, Event Details Bringing together ideas, science, and business connections that are creating the materials and products of the future. Join a diverse group of manufacturers, Original Equipment Manufacturers (OEMs), innovators, suppliers, distributors, and educators as they present the latest advancements in composites manufacturing, product design, and materials engineering. From aerospace to automotive, construction to marine, industrial manufacturing to sporting goods, CAMX is the place to replace the materials of yesterday with more cost-efficient, high-performance composites that can form a brighter future. SCHEDULE: Sunday, September 7, 2025 8:00 AM – 5:00 PM: Exhibitor Move-in 1:00 PM – 4:00 PM: Registration Open Monday, September 8, 2025 8:00 AM – 4:00 PM: Registration Open 8:00 AM – 5:00 PM: Exhibitor Move-in 9:00 AM – 4:00 PM: Pre-Conference Tutorials 5:00 PM – 7:30 PM: SAMPE Awards Ceremony & Dinner 5:30 PM – 7:30 PM: ACMA Membership Awards Ceremony & Reception Tuesday, September 8, 2025: 7:00 AM – 5:00 PM: Registration Open 7:45 AM – 8:30 AM: First Time Attendee Orientation 8:45 AM – 10:00 AM: General Session with Keynote Address 10:00 AM – 5:00 PM:  Exhibit Hall Open 12:00 PM – 1:00 PM: CAMX Award Winner Presentations 1:00 PM – 5:00 PM: Conference Programming 2:00 PM – 2:30 PM: ACE Award Winners Ceremony 5:00 PM – 6:00 PM: Welcome Reception Wednesday, September 10, 2025: 7:00 AM – 5:00 PM: Registration Open 9:00 AM – 12:00 PM: Conference Programming 9:00 AM – 5:00 PM Exhibit Hall Open 1:00 PM – 2:00 PM: Poster Awards – Meet the Authors 1:30 PM – 5:00 PM: Conference Programming 4:00 PM – 5:00 PM: Young Professionals Meet-Up Thursday, September 11, 2025: 8:00 AM – 1:00 PM: Registration Open 9:00 AM – 10:00 AM: Good Day, CAMX (CAMX Theater) 9:00 AM – 1:00 PM: Exhibit Hall Open (w/ breakfast on the Show Floor) 10:00 AM – 12:30 PM: Conference Programming (on the Show Floor) Register here! Time september 7 (Sunday) - 11 (Thursday) Location Orange County Convention Center 9400 Universal Blvd. Calendar GoogleCal Orlando Booze & Bites Festival Festival Park 2911 E Robinson St. 13 sep 1:00 pm 5:00 pm Orlando Booze & Bites Festival Event Details Battle Bros Events is hosting the Orlando Booze & Bites Festival — a 21+ all-you-can-drink festival happening on Saturday, September 13th in Orlando.\nThe event features:\n🍸 Unlimited drinks (open bar)\n🍴 All food items Event Details Battle Bros Events is hosting the Orlando Booze & Bites Festival — a 21+ all-you-can-drink festival happening on Saturday, September 13th in Orlando. The event features: 🍸 Unlimited drinks (open bar) 🍴 All food items $5 or less 🎶 Live music and entertainment 🎯 A party atmosphere with games and photo ops Your admission ticket includes access to the ULTIMATE PARTY! An Open Bar featuring unlimited alcohol, domestic beer and hard seltzers for the entirety of the event! VIP Ticket holders also get unlimited alcohol, domestic beer, local craft draft beer and liquor/cocktails + full cocktails by Caribbean Moonshine (as well as early entry!!!) Large Variety of DELICIOUS Bites from the areas BEST Restaurants and Food Trucks, with all menu items priced at $5.00 or less! Enjoy the all-inclusive GAME AREA – Mechanical Bull, Axe Throwing, Lawn games, Beer pong, Cornhole, FREE caricature paintings & so much more to be added! TICKET REQUIRED for Event Admission. Time (Saturday) 1:00 pm - 5:00 pm Location Festival Park 2911 E Robinson St. Calendar GoogleCal Paws Around the Pier Caribe Royale Orlando 8101 World Center Dr, Orlando, FL 32821 14 sep 11:00 am 3:00 pm Paws Around the Pier Event Details What’s better than romance and adorable furry friends? Caribe Royale Orlando is hosting a unique outdoor wedding market, Paws Around the Pier, designed for couples Event Details What’s better than romance and adorable furry friends? Caribe Royale Orlando is hosting a unique outdoor wedding market, Paws Around the Pier , designed for couples who want their weddings to be as unique as their love stories, incorporating their beloved fur babies. The event takes place on Sunday, Sept. 14 from 11 a.m. – 3 p.m., with savory brunch style bites and signature cocktails (with a pet hydration station of course!), wedding cake and gourmet doggie treat tastings, live music, swag bags, tours of the ceremony and reception spaces at Caribe Royale Orlando, and more. Human tickets are $10, and pet companions are free! Learn more about the event HERE Paws Around the Pier celebrates the launch of Fur-Ever Yours , a unique wedding program that offers thoughtful, personalized ways for pets to be an integral part of a couples’ wedding day; from pet stylists and custom table settings to wedding cake details and signature cocktails. Time (Sunday) 11:00 am - 3:00 pm Location Caribe Royale Orlando 8101 World Center Dr, Orlando, FL 32821 Calendar GoogleCal Sugoi Expo Hilton Orlando 6001 Destination Pkwy. 19 sep (sep 19) 9:00 am 21 (sep 21) 9:00 pm Sugoi Expo Event Details Meet the Stars of Sugoi ExpoThis year’s celebration of Japanese culture brings with it exclusive appearances by Japanese music artists Asaka and Stereo Dive Foundation, both known for anime theme Event Details Meet the Stars of Sugoi Expo This year’s celebration of Japanese culture brings with it exclusive appearances by Japanese music artists Asaka and Stereo Dive Foundation, both known for anime theme songs. Fans will enjoy live performances and meet & greets with both artists included with admission. In addition, Sugoi Expo boasts a star-studded roster of English anime voice actors, with special reunions from Sonic the Hedgehog, Pokémon, and more. Guests include Dan Green, Colleen O’Shaughnessey, Eric Stuart, Pete Capella, Lisa Ortiz and AJ Beckles. Tickets On Sale Now Tickets start at $27.99 for single-day passes to $699.99 for an all-access Super VIP experience, which includes hotel accommodations. Use promo code SUGOI20OFF for 20% off adult, non-VIP passes. Tickets available now at SugoiExpo.com. Time 19 (Friday) 9:00 am - 21 (Sunday) 9:00 pm Location Hilton Orlando 6001 Destination Pkwy. Calendar GoogleCal World Series Celebration at Uptown Vibes Cranes Roost Park 274 Cranes Roost Blvd, Altamonte Springs, FL 32701 20 sep 6:00 pm 10:00 pm World Series Celebration at Uptown Vibes Event Details The City of Altamonte Springs proudly hosts a vibrant, free, family-friendly celebration in honor of our hometown champions. The evening kicks off with an inspiring championship recognition ceremony, as City Event Details The City of Altamonte Springs proudly hosts a vibrant, free, family-friendly celebration in honor of our hometown champions. The evening kicks off with an inspiring championship recognition ceremony, as City leaders, coaches and players share memorable highlights from the team’s remarkable journey and present special awards. Fans are invited to meet the players, capture photos with the championship trophy and join in the community’s collective pride. After the ceremony, Uptown Vibes will transform Cranes Roost Park into a festive hub filled with music, food trucks and interactive games. Get ready to taste your way around the park with 15 incredible food trucks offering something for everyone, including mouthwatering BBQ, sizzling hibachi, juicy burgers, authentic arepas, savory gyros, sweet ice cream treats and much more. The party doesn’t stop there. DJ Lindsey will keep the crowd moving all night long with the hottest hits and exciting games that bring everyone together. Also, sports lovers can head to the Plaza, where interactive games and activities will let you show off your skills and cheer on your friends. This special evening not only honors the team’s extraordinary achievements but also showcases the unity and heart of Altamonte Springs. This is definitely an event you won’t want to miss! Time (Saturday) 6:00 pm - 10:00 pm Location Cranes Roost Park 274 Cranes Roost Blvd, Altamonte Springs, FL 32701 Calendar GoogleCal Rolltoberfest with Krush Brau Park Krush Brau Park - Portal Immersion Center 2198 4 Winds Boulevard Kissimmee, FL 34746 United States 27 sep All Day Rolltoberfest with Krush Brau Park Event Details Get ready to ride for a Event Details Get ready to ride for a reason! Join us for Rolltoberfest at Krush Brau Park on Saturday, September 27, 2025, as we team up with the American Cancer Society’s Making Strides Against Breast Cancer to drive hope forward! Bring your Jeep, car, bike—or just yourself—for a powerful day filled with vehicles, vendors, food, drinks, music, and a mission that matters. Proceeds go toward the fight against breast cancer. Let’s make strides—one ride at a time. Register now. Time All Day (Saturday) Location Krush Brau Park - Portal Immersion Center 2198 4 Winds Boulevard Kissimmee, FL 34746 United States Calendar GoogleCal Krush Brau Park Oktoberfest Kick-off Krush Brau Park 2198 4 Winds Boulevard Kissimmee, FL 34746 United States 27 sep All Day Krush Brau Park Oktoberfest Kick-off Event Details Get Ready for Event Details Get Ready for the Most Authentic Oktoberfest in Florida! Join us at Krush Brau Park for our Annual Oktoberfest Celebration — happening every weekend day until November 2! September 27 is the Oktoberfest Kick-off! Location: 2198 Four Winds Blvd, Kissimmee, FL Live Music, German Food, Beer, Games & More! Authentic German bands Bratwurst, pretzels, schnitzels & more Imported German beer & local craft favorites Lederhosen & dirndls welcome (and encouraged!) Family-friendly fun during the day – adults-only party at night Whether you’re looking to raise a stein with friends, dance to polka in our new Oktoberfest Tent, or enjoy a unique fall festival with your family — Krush Brau Park is the place to be this Oktoberfest season! Don’t miss our stein-holding contests, keg rolls, costume prizes, and epic Krampus sightings (he’s always early…). Mark your calendars and PROST with us this Fall! VENDORS WANTED! Time All Day (Saturday) Location Krush Brau Park 2198 4 Winds Boulevard Kissimmee, FL 34746 United States Calendar GoogleCal Red Bull Tandem Rollercoaster Cranes Roost Park 274 Cranes Roost Blvd, Altamonte Springs, FL 32701 27 sep 12:00 pm 4:00 pm Red Bull Tandem Rollercoaster Event Details The Red Bull Tandem Rollercoaster is coming to the United States for the first time. Building on the success of Red Bull Stalen Ros in Europe, where thousands of spectators Event Details The Red Bull Tandem Rollercoaster is coming to the United States for the first time. Building on the success of Red Bull Stalen Ros in Europe, where thousands of spectators watched teams of two navigate a narrow obstacle course over water on custom tandem bicycles, Red Bull Tandem Rollercoaster is bringing the thrills to the U.S. Admission is free. Food and beverages available for purchase. Time (Saturday) 12:00 pm - 4:00 pm Location Cranes Roost Park 274 Cranes Roost Blvd, Altamonte Springs, FL 32701 Calendar GoogleCal Newsletter Win A $250.00 Amazon Gift Card. Email address: Leave this field empty if you're human: Don't worry, we don't spam.Enter your email to subscribe to our newsletter. instagram facebook linkedin twitter youtube Newsletter Don’t miss out on new posts Enter your email to subscribe to our newsletter. Email address: Leave this field empty if you're human: Don't worry, we don't spam.Enter your email to subscribe to our newsletter. About Us Lifestyles CFL, LLC is a diversiﬁed multimedia company committed to delivering innovative experiences across all media platforms. At the heart of its portfolio is Central Florida Lifestyle® publications. Lifestyles CFL has served Central Florida for over 20 years. Lifestyles CFL, LLC is a Service-Disabled Veteran-Owned Small Business. Learn more about us . Contact Us Email: contact@lifestylescfl.com Phone: (407) 449-2022 Still interested in our physical magazine? Click here to let us know, yes or no. © 2025 Lifestyles CFL, LLC. All rights reserved. Home Advertise With Us Privacy Policy Back to Top Close 2025 Cutest Pet Contest Teacher Shoutout Best of Hotels Contest Digital Edition CFL Lifestyle Lifestyle Local Beauty Education Shopping DIY Community Conversations Entertainment This or That Movies Music Sports Travel Food & Drink Foodie Recipes Health Fitness & Wellness Medical News Events About Us News Corner Distro Locations Contribute Subscribe instagram facebook linkedin twitter youtube Search for: Search close Log In Sign In Username or Email Address Password Forgot password? Forgot password? Enter your account data and we will send you a link to reset your password. Username or Email Address Back to Login Your password reset link appears to be invalid or expired. Log in Privacy Policy To use social login you have to agree with the storage and handling of your data by this website. %privacy_policy% Accept Close Add to Collection Add new or search Public collection title Private collection title No Collections Here you'll find all collections you've created before. X Newsletter Want more stuff like this? Get the best local stories straight into your inbox! Enter your email to subscribe to our newsletter. Email address: Leave this field empty if you're human: Don't worry, we don't spam.Enter your email to subscribe to our newsletter. Close"
    },
    {
      "url": "https://www.orlandomeeting.com/listing/hamiltons-kitchen/37733/",
      "text": "Hamilton's Kitchen | Winter Park, FL | 37733 Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. Skip to main content Plan Why Orlando Hotel Search Venue Search Direct Flights & Walkability Things to Do for Groups Theme Parks Attractions Arts & Culture Sports & Outdoors Spas Shopping Golf Group Dining Experiences Group Drinks & Nightlife Insider Blog Convention Center Resources Planning Materials Media Gallery Meetings and Conventions Email Gallery Request Materials Meeting Services Health & Safety Transportation Meeting Offers Newsletter RFP Upload Your RFP Build Your RFP Contact Us Plan Back to Main Menu Plan Overview Plan Convention Center Resources Back to Main Menu Resources Overview Resources RFP Back to Main Menu RFP Overview RFP Contact Us Find Hotels Menu Close Search Search for Orlando activities and accomodations Plan Why Orlando Hotel Search Venue Search Direct Flights & Walkability Things to Do for Groups Theme Parks Attractions Arts & Culture Sports & Outdoors Spas Shopping Golf Group Dining Experiences Group Drinks & Nightlife Insider Blog Convention Center Resources Planning Materials Media Gallery Meetings and Conventions Email Gallery Request Materials Meeting Services Health & Safety Transportation Meeting Offers Newsletter RFP Upload Your RFP Build Your RFP Contact Us Plan Back to Main Menu Plan Overview Plan Convention Center Resources Back to Main Menu Resources Overview Resources RFP Back to Main Menu RFP Overview RFP Contact Us Leisure Media Trade Members About Find Hotels > > of 2 Off-Site Venues, Banquet & Reception Facilities Hamilton's Kitchen 300 East New England Avenue Winter Park, FL 32789 (407) 998-8089 reservations@thealfondinn.com Visit Website Share © 2025 Visit Orlando Blog Convention Center Leisure Membership Trade Media About Us Careers Accessibility Sitemap Copyright & Trademarks Privacy Policy & Terms of Use Cookies Settings Meetings Insider Get the latest news and industry developments from Orlando: Cvent’s No. 1 meeting destination. Sign Up"
    }
  ]
}