{
  "fuentes": [
    {
      "url": "https://bushbaby.travel/accommodation/the-boca-raton-beach-club/",
      "email": "info@bushbaby.travel"
    },
    {
      "url": "https://bushbaby.travel/accommodation/the-boca-raton-beach-club/",
      "email": "path-58@2x.png"
    },
    {
      "url": "https://bushbaby.travel/accommodation/the-boca-raton-beach-club/",
      "email": "screenshot-2020-05-18-at-11.36.2@2x.png"
    },
    {
      "url": "https://bushbaby.travel/accommodation/the-boca-raton-beach-club/",
      "email": "twitter_1@3x.png"
    },
    {
      "url": "https://bushbaby.travel/accommodation/the-boca-raton-beach-club/",
      "email": "info@bushbaby.travel"
    },
    {
      "url": "https://www.cntraveler.com/hotels/boca-raton/beach-club-at-the-boca-raton",
      "email": "help@newyorker.com"
    },
    {
      "url": "https://www.thebocaraton.com/privacy-policy/",
      "email": "experience@thebocaraton.com"
    },
    {
      "url": "https://www.thebocaraton.com/experiences/golf/",
      "email": "golf@thebocaraton.com"
    }
  ],
  "mails": [
    "experience@thebocaraton.com",
    "golf@thebocaraton.com",
    "help@newyorker.com",
    "info@bushbaby.travel",
    "path-58@2x.png",
    "screenshot-2020-05-18-at-11.36.2@2x.png",
    "twitter_1@3x.png"
  ],
  "nombre_sitio": "thebocaraton.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bushbaby.travel/accommodation/the-boca-raton-beach-club/",
      "text": "Stay at The Boca Raton Beach Club: Book Now with Bushbaby Skip to content Menu Info@bushbaby.travel 0845 124 4455 Destinations Inspire Me Who When What Blog Newsletter About Us Press The Team Financial Protection Our Story How to Book Sustainability Enquire Now Menu Info@bushbaby.travel 0845 124 4455 Destinations Inspire Me Who When What Blog Newsletter About Us Press The Team Financial Protection Our Story How to Book Sustainability Enquire Now Florida The Boca Raton Beach Club Home > Destinations > North America > USA > Florida > The Boca Raton Beach Club Menu Gallery Facilities & Activities Dining Rooms Family Sustainability Location Located on a private peninsula in the exclusive Boca Raton, the Boca Raton Beach Club is a luxury waterfront hotel offering the best of everything from laidback barefoot fun on the beach, to glamorous fine dining and cocktails in a resort renowned for its sleek design. In addition to two superb restaurants and a choice of three fantastic pools, you have a beautiful half-mile stretch of beach along the stunning Atlantic coast, where there are plenty of water sports and activities on offer. Thanks to its affiliation with the Waldorf Astoria’s Boca Raton Resort & Club, you also have the benefit of the decadent facilities on offer at this legendary resort scattered throughout the town, including exclusive restaurants and an elegant spa.  This is a chic, contemporary retreat where you can really savor the sun and find endless ways to enjoy the sand and sea. Gallery web-usa-hotel-sider-bocaratonpool web-usa-hotel-slider-01_DrinkDine_BeachClubLounge_Hero web-usa-hotel-slider-Oceanview-One-Bedroom-Suite-King-4-The-Boca-Raton-Beach-Club-1920x1080-1 web-usa-hotel-slider-PartialOceanView-1920x1080-1 web-usa-hotel-slider-Principessa-Ristorante-dining-room-1920x720-1 Facilities & Activities As you enter the Boca Raton Beach Club’s dramatic lobby you are welcomed by the sight of a striking infinity pool and stunning views of the ocean through the lounge – this sets the tone perfectly for the impressive personal service, excellent facilities and great atmosphere you will experience during your stay. With 3outdoor swimming pools on site there are plenty of ways to relax; set within a sprawling tropical oasis and surrounded by lounge chairs and private cabanas, you can even grab a drink and a bite-to-eat from the terrific ocean-front bar. Or you can head to the magnificent stretch of private beach where you can rent umbrellas and cabenettes, or if you’re feeling active then there are many water sports on offer in the surf school – Boca Surf  – for a charge. There are plenty of fun ways to experience the beautiful coastline from paddle boarding, jet skiing and catamarans to skim boarding. The Boca Beach Club Health Club is located on the pool deck and has wonderful views of the ocean, thanks to floor to ceiling windows. The latest workout equipment is on offer as well as expert personal training and fitness classes. As a guest of Boca Raton Beach Club you can also enjoy a spectacular range of activities available at their sister hotels within the Boca Raton Resort & Club (regular shuttles take you between the different locations within the resort). There are 4 divine swimming pools featuring personal butlers, sun terraces, lounge chairs and cabanas. You’ll also find 2 more state-of-the-art fitness centres, a renowned tennis academy and championship golf courses. There are even a variety of boutiques on site, should you wish to browse the shops. The renowned Waldorf Astoria Spa at Boca Raton Resort & Club is simply divine; inspired by Spain’s legendary Alhambra Palace, you’ll find exquisite gardens, majestic arches, opulent marble, elaborate mosaics and cypress woodwork. You can indulge in a range of exotic spa treatments and therapies here – pure decadence. If you want to venture further afield there are a wide variety of excursions available. You can visit the vibrant marina and ride a catamaran into the splendid Pacific waters, discover exotic sculpture artworks or tour the Everglades in an Airboat. The concierge team will have all the details you’ll need. Start planning your next adventure today! Contact our team of friendly award-winning specialists to design your bespoke itinerary, or sign up for the Bush Telegraph; our newsletter full of travel tips, advice and special offers. CALL US 0845 124 4455 ENQUIRE NOW BUSH TELEGRAPH Abi Founder & Director Emily Worldwide Travel Consultant Amy Africa Travel Manager Dining Exceptional cuisine is on offer at the Boca Raton Beach Club and it is all delivered with true Waldorf service. Just steps from the pool and with the ocean beyond, the Beaches Club Lounge and Bar serves light meals and refreshments – the perfect spot for a relaxed lunch in the sunshine. Or if you fancy a quick bite or coffee on-the-go, there is SNACK, which serves delicious breakfast pastries, salads and sandwiches. For casual yet sophisticated dining, there is Marisol; a delightful Greek Mezze restaurant overlooking the shimmering Atlantic Ocean.  The Ocean Bar is the perfect place for a sundowner, with lovely views from the terrace over the pools below. Serving cocktails and light fayre, this is a great spot to meet friends and soak up the delightful atmosphere. Of course, there is always the option to take the shuttle to another hotel within the Boca Raton Resort & Club where you will find a unique and extensive mix of 12 dining experiences to suite every mood. Sushi, Italian, an excellent Mezze restaurant and fantastic cocktail bars are just some of the options available. The hotel also has plans to open a Burger Bar in 2023. Rooms The guest rooms are modern and chic, oozing luxury with their ocean inspired shades of sand, pale green and aquamarine décor accented with bleached woods, and crisp bed linen on either one king size bed or 2 doubles.  All rooms feature a flat-screen LCD television, iPod clock radio, in-room coffeemaker and minibar, cordless phone and Wi-Fi.  The spacious white marble bathrooms feature a deep soaking bathtub, separate rainfall shower and sleek double-sink illuminated vanity. The Beach Club Standard Rooms feature a glass wall with floor-to-ceiling sliding window, but do not have ocean views.  The Pool View Balcony Room has a spacious balcony furnished with 2 lounge chairs and a café table and can be found on the second floor overlooking the Pool Oasis.  The Ocean Vista Room is more spacious and features a relaxing sitting area with fantastic ocean views.  Or the oversized Poolside Lanai Rooms offer a furnished patio on ground level with direct access to the Pool Oasis and the beach beyond.  The Sky Deck Rooms feature spectacular views of the Atlantic Ocean and have a furnished sun deck on the fifth floor, where you can relax and admire the panoramic views. Finally, there are One-Bedroom Ocean Suites.  Featuring combined living and dining areas, a sofa bed and half a bath; French doors lead to a separate king master bedroom.  Located on floors 3 – 7, these offer amazing ocean views and will accommodate up to 4 people. Family The Boca Beach Club caters brilliantly for families.  As well as the superb private beach that can provide endless hours of fun, there are many water sports to choose from and 3 wonderful pools. Should your little ones need more entertainment try the onsite children’s club that offers a variety of cool activities for ages 3 – 9 years including basketball, football and tennis. The Clubhouse has all the latest games consoles, a token-based arcade and a great Imagination Centre where youngsters can build Lego. Your children can be supervised here daily between 10am-5pm (for a charge), and on Friday’s between 6pm-10pm.  There is even a VIP nightclub experience for older children featuring mocktails and guest DJs.  Basketball, football, tennis and more is also available as part of Quest Club at The Boca Raton Resort and Club. Accommodation-wise guest rooms can be configured to have one king size or 2 double beds.  Most rooms share a common foyer with the same style room next door, which can be locked and serves as a private passage to both rooms – so this would work well for larger families or those with older children who would prefer some privacy. Children’s menus are available both at Boca Beach Club and the sister resort. In-room babysitting is also available on request if you fancy a night out. Sustainability Currently we have no information regarding sustainability. Location Set on its own private sandy beach, Boca Beach Club is located in Boca Raton on South Florida’s Gold Coast. Boca Beach Club is about a 30-minute drive from Fort Lauderdale-Hollywood International Airport, 35-minutes from Palm Beach Airport and just over an hour from Miami International Airport. BACK TO Florida Other accommodation you might like South Seas Island Resort - Florida Loews Portofino Bay Hotel at Universal - Florida Hawks Cay Resort - Florida Disney’s Animal Kingdom Lodge - Florida The Boca Raton Beach Club - Florida MORE USA ACCOMMODATION Destinations Africa Australasia Asia The Caribbean The Indian Ocean Latin America Europe & The Middle East North America About Contact Us Why Us Reviews Sustainability How to Book Financial Protection Blog Newsletters Inspire Me Activity Adventure Beach Culture Fly Drive Retreats Sabbatical Safari Follow Us Client Portal © Bushbaby 2025 Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.cntraveler.com/hotels/boca-raton/beach-club-at-the-boca-raton",
      "text": "Beach Club at The Boca Raton — Hotel Review | Condé Nast Traveler Skip to main content Newsletter Sign In Search Search Newsletter Inspiration Destinations Places to Stay News & Advice Curated Escapes Shopping Cruise Women Who Travel Video North America Chevron United States Chevron Florida Chevron Boca Raton Chevron Review: Beach Club at The Boca Raton: First In Just one weekend at the luxuriously revamped Beach Club will leave you sun kissed and carefree. Hot List 2025 Chevron Chevron Photos Save Story Save this story Save Story Save this story Buy Now at Expedia Rooms 210 Reviewed by Hannah Towey Why book? When you just need to get away from it all—and not lift a finger. Set the scene The Boca Raton as a whole maintains a loyal following of Northeast execs flying in with their extended families for the winter holidays. By the pool, well-to-do couples in Vilebrequin swim trunks and Farm Rio midi dresses sip piña coladas while their goggled-up offspring splash away in the shallow end. Amidst the New York accents you may also hear the chatter of “members,” a local crowd consisting of loyal snowbirds and retirees for which the resort serves as their lavish country club. Compared to Boca Raton’s “harborside” hotels—characterized by their classic Mediterranean Revival architecture and dark wood interiors—the bright and breezy Beach Club has a distinctly separate feel to it. Here, most guests are younger than 60 but older than 18, including parents and their adult children, as well as newlyweds on couples getaways. As the name implies, the Beach Club is for beach lovers prioritizing salt and sun, while those staying across the lake have more convenient access to the vast sports facilities and kid-friendly pool club. The backstory The Boca Raton is a beloved historic resort with five luxe hotels on a 200-acre property divided in two by Lake Boca Raton. In 2021, the brand ushered in a “new golden era” to the tune of a $200 million refresh by current owners MSD Partners (Michael Dell’s investment firm). The majority of the resort is located on the “harborside,” overlooking the lake. From here, guests can hop on a five minute water taxi to the “beachside,” home to the resort’s modern oceanfront hotel, the Beach Club, and its three pools, two restaurants, and half-mile private beach. The true benefit of staying at The Boca Raton is that you’re not limited to one side or the other—all the resort’s main amenities are available to guests regardless of which building they’re staying in. In January 2025, the Beach Club completed a $130 million renovation including 210 redesigned guest rooms and suites, two new restaurants, a completely refreshed lobby featuring a new bar and café, plus new fitness and event spaces. If you ask the staff what the main difference between the old and new Beach Club is, they’ll tell you it’s much “brighter” now. Even when you’re inside, the open, light-filled spaces radiate sunshine (with the added benefit of crisp AC). The rooms The newly renovated guest rooms and suites are where beach meets elegance, with natural marble, lime-wash plaster walls, and cerused woods creating a serene coastal feel (sans in-your-face tropical embellishments). The design may be minimalist, but not lacking in attention to detail, especially when it comes to the gorgeous bathrooms (with a soaking tub and walk-in shower), premium bedding, and mood lighting. If there’s a place to splurge on an ocean view, it’s here. I stayed in a seventh-floor balcony room and in the morning, we would open the floor-to-ceiling windows to watch the sunrise over the water, before momentarily falling back asleep to the ocean breeze, as if floating on a cloud. If you truly never want to leave your room—I wouldn’t blame you—book a terrace or lanai suite (available in studio, one, and two-bedroom iterations) for access to private outdoor space with personal loungers. Rooms rates start at $770 per night in low season. Food and drink Dining at the Beach Club was, perhaps unexpectedly, one of the most memorable parts of my stay—even when ordering poolside tacos and salads. The highlight was Onda, a brand-new outdoor oceanfront venue featuring a rotating seasonal menu (open for lunch and dinner, with reservations recommended for the latter). The inaugural menu of savory Caribbean cuisine was created in partnership with Executive Chef Adriano Venturini of Eden Roc Cap Cana, the Dominican Republic’s Relais & Châteaux hotel. To start, get the melt-on-your-tongue tuna crudo lightly drizzled with olive oil, and the bread service with homemade whipped coconut butter. For a splittable entree, the Pescado Boca Chica—a deep-fried whole snapper with fried plantains, pickled cubanelle and red onion slaw, avocado salsa verde, and tostones—is the standout dish. Marisol, a longtime Beach Club establishment, has been moved to a new indoor-outdoor dining room with a covered terrace and ultra chic decor. The Mediterranean menu features shellfish towers, mezze, kebabs, and fresh seafood delivered daily by local fishermen (the wait staff will even tell you the name of the fisherman who caught it). When you’ve had your fill of seafood, the Greek lamb chops were some of the best I’ve had. Marisol is also open for breakfast, brunch, and lunch; reservations are recommended for dinner. The spa Beach Club guests have access to The Boca Raton’s Spa Palmera on the harborside of the property. It is worth the boat ride tenfold—modeled after Spain’s Alhambra palace, the decadent 50,000-square-foot sanctuary is known as one of the best spas in all of Florida. The treatment options run the gamut from Moroccan hammam-inspired bath rituals and sound therapy to facials and massages. The neighborhood/area While the resort is like a neighborhood within itself—and one you never have to leave—downtown Boca only is a 10-minute bike ride away and is home to a number of great restaurants and fun shops. The hotel provides complimentary bikes and courtesy shuttle rides within a two-mile radius. The service There is travel, and then there is the lazing bliss of a true vacation—and when you check into the Beach Club, you check out of reality. This sumptuous escapism is largely thanks to the butler-like service; the toughest decision you’ll face will be whether to lounge at the pool, beach, or spa. Even the most tightly strung New Yorkers (of which there are many here) will breathe easy thanks to the extremely knowledgeable and personable staff members, from the bartenders to the tennis pros. For families The Boca Raton is designed for family activities, regardless of age. For young children and teens, the harborside pool club is the place to be, with a lazy river, water slides, Flowrider surf simulator, and even themed kids cabanas (your pick of chef, princess, mermaid, or pirate decor). For multi-gen family activities with older kids, the full-service Racquet Club has 12 newly transformed hard-surface pickleball courts, 14 tennis Hydro-Grid courts, and a new courtside bar. Then there’s the 18-hole golf course located in a scenic Audubon Cooperative Sanctuary. Did I mention the croquet and bocce courts? At the Beach Club, there are both adults-only and kid-friendly pools, an inflatable waterslide, a beach volleyball court, and reservable private cabanas perfect for big groups with something to celebrate. But the real draw here is the water sports: there’s banana boat tubing; paddle board, pedal kayak, and jet ski rentals; surf lessons; and private boat charters. A water baby’s dream. Eco effort To reduce single-use plastics, guests receive mini Swell water bottles in their rooms to refill. Filtered water faucets are located in each room and placed across the property. Accessibility The property offers select ADA rooms with fully automated doors for zero-step entry, as well as sight and hearing-accessible features and tub grab bars. ADA rooms are available in multiple room categories including Standard King, Sundeck King, Balcony King, first-floor Lanai Double Queen, and more. There are ADA chair lifts available for the pools, a wheelchair available for use on the beach, and accessible entrances and elevators in every building. Anything left to mention? One of the Beach Club’s most unique experiences now available to book is a morning cruise aboard “Sorbetto,” an adorable pink boat modeled after a Fiat 500 (complete with rearview mirrors, a windshield, and headlights) along the Intracoastal to Lake Boca Raton. We were the most popular boat on the water—if you’re lucky, Captain Bill may even treat you to some Champagne. Complimentary Sorbetto cruises are first-come-first-serve for Beach Club guests on Thursday through Monday from 2 to 5 p.m. (From 9:30 a.m. to 1 p.m., members and other resort guests can book it for an extra fee. ) All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Book Now at Expedia All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Location Map Contact 900 S Ocean Blvd, Boca Raton, Florida 33432 USA (561) 288-9944 https://www.thebocaraton.com/suites-rooms/beach-club/ Book Now at Expedia More To Discover The Boca Raton $$ | United States, Boca Raton, 501 E Camino Real Sandwiched between a half-mile of private beachfront and an Audubon Cooperative Sanctuary, this 200-acre spread is an elevated option from which to take in Florida’s famous sunshine and water activities. Book Now at The Boca Raton Powered By: The Boca Raton Kimpton Surfcomber Hotel $$ | United States, Miami, 1717 Collins Ave. A cooler, unbuttoned take on your typical South Beach Art Deco boutique Book Now at Expedia Powered By: Expedia Andaz Miami Beach by Hyatt $$$ | United States, Miami Beach, 4041 Collins Ave A refined, relaxed, and upscale spot to enjoy a less-crowded Miami Beach vacation. Book Now at Booking.com Powered By: Booking.com The Moore $$ | United States, Miami, 4040 NE 2nd Ave An Art Deco jewel rife with art installations and members-only spaces for guests. Book Now at Michelin Guide Powered By: Michelin Guide Cirque St. Armands Beachside $$ | United States, Sarasota, 233 Benjamin Franklin Dr. Rare is the hotel that’s this visually bold, hospitality-forward, and deeply rooted in local culture—and perched on one of the most beautiful beaches in the country. Book Now at Expedia Powered By: Expedia Shelborne by Proper: First In $$ | United States, Miami Beach, 1801 Collins Avenue A new, grown-up iteration of Miami Beach’s midcentury Art Deco scene Book Now at Expedia Powered By: Expedia Read More The Best New Beach Hotels in the World: 2025 Hot List The Best New Hotels in the World: 2025 Hot List The Best New Hotels in the United States: 2025 Hot List Pinterest Facebook Snapchat Instagram X As the most discerning, up-to-the-minute voice in all things travel, Condé Nast Traveler is the global citizen’s bible and muse, offering both inspiration and vital intel. We understand that time is the greatest luxury, which is why Condé Nast Traveler mines its network of experts and influencers so that you never waste a meal, a drink, or a hotel stay wherever you are in the world. About Condé Nast Traveler Subscribe Manage Account Newsletter Sign Up Readers' Choice Awards Archive Contact the Editors Careers User Agreement Privacy Policy Your California Privacy Rights RSS Feeds Condé Nast Store © 2025 Condé Nast. All rights reserved. Condé Nast Traveler may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices Select international site United States LargeChevron India Spain United Kingdom Middle East Germany"
    },
    {
      "url": "https://www.thebocaraton.com/privacy-policy/",
      "text": "Privacy Policy - The Boca Raton Resort Boca Raton Homepage Link Choose Your Dates Or enter manually Press the down arrow key to enter the datepicker and choose two dates. Navigate dates with arrow keys and skip to previous and next month with ctrl + left and ctrl + right Number of Adults 1 Adult 2 Adults 3 Adults 4 Adults Number of Children 0 Child 1 Child 2 Children 3 Children 4 Children Enter Promo Code Enter Your Dates Check-In Date: Check-Out Date: View Available Rates Skip to main content Boca Raton Homepage Link Stay Stay submenu Overview Beach Club Bungalows Tower Yacht Club Cloister Suite Collection Membership Offers Drink & Dine Beach & Pools Beach & Pools submenu Overview Harborside Pool Club Beachside Boca Raton Homepage Link Experiences Experiences submenu Overview Holidays & Events Families Golf Tennis & Pickleball Boating Water Sports Fitness Shopping Artisans of Wine & Food Membership Spa Palmera Meetings & Events Meetings & Events submenu Overview Meetings & Events Weddings Celebrations Boca By Design Holidays & Events Book Now Boca Raton Homepage Link Stay Overview Beach Club Bungalows Tower Yacht Club Cloister Suite Collection Membership Offers Drink & Dine Beach & Pools Overview Harborside Pool Club Beachside Experiences Overview Holidays & Events Families Golf Tennis & Pickleball Boating Water Sports Fitness Shopping Artisans of Wine & Food Membership Spa Palmera Meetings & Events Overview Meetings & Events Weddings Celebrations Boca By Design Holidays & Events Home Privacy Policy Privacy Policy Last Updated: April 2024 Your privacy is important to us. Our Privacy Policy was made to let you know how we collect, use, share, and process your personal information, as well as your rights in determining what we do with the information collected and stored about you when you access our website, https://www.thebocaraton.com and https://www.thebocaratonclub.com (collectively, the “Site”) or the features, content, or applications offered by The Boca Raton (collectively, the “Services”). The Site and all related Services are provided by The Boca Raton. If you have any questions or comments about this Privacy Policy or about our use of your personal information, please contact us at 501 East Camino Real, Boca Raton, Florida 33432 or by email experience@thebocaraton.com . Information Collected When you visit our Site, we collect two types of information: personal information you give us and usage information automatically collected as you browse. The following are the specific types of information we collect from you. Information You Give Us We collect information you give us on our Sites and when you register for and use our Services. Examples include the following: Registration and Profile Information: When you register to use our Services or update your profile, we collect various kinds of information about you including, your name and email address; your title, company and other profile information you provide; demographic information; information about your skills and preferences (if you are an influencer); and information you upload like photos, files, and documents. Payment Information: If you choose to use a paid account or service, our payment processing vendor collects your credit card information and billing address. Content Related Information: When uploading pictures, a name and an email address may be required. Generally, the information collected helps us to communicate with you regarding content that you have submitted. For instance, we may use your email address to notify you of the status of the content you have submitted. By completing a room reservation, you will receive emails about your reservation and stay with us. You will also be automatically subscribed to marketing and promotional emails; you may unsubscribe at any time. Information We Collect Automatically While you visit or use our Sites or Services, certain information, including personal information, is collected about your use of the Sites and Services. Examples include the following: Log and Usage Data. When you visit the Sites, our servers automatically record information that your browser sends whenever you visit a website (“Log Data”). This Log Data may include information such as your IP address, browser type or the domain from which you are visiting, the search terms you use, and any advertisements on which you click. For most users accessing the Internet from an Internet service provider the IP address will be different every time you log on. We use Log Data to monitor the use of the Site and Services, and for the Site’s technical administration. We use this information for internal system administration, to help diagnose problems with our server, and to administer the Site. Such information may also be used to gather demographic information, such as country of origin and Internet Service Provider. We may link this information with your personal information. Any or all of these activities with regard to Site usage information may be performed on The Boca Raton’s behalf by our service providers, including, for example, our analytics vendor(s) and our email management partner(s). Cookies and Similar Tracking Technologies. Like many websites, we also use “cookie” and similar tracking technology to collect additional website usage data and to improve the Sites and Services. A cookie is a small data file that we transfer to your computer’s hard disk. We do not use cookies to collect personally identifiable information, may use both session cookies and persistent cookies to better understand how you interact with the Sites and Services, to monitor aggregate usage by our users and web traffic routing on the Site, and to improve the Sites and Services. A session cookie enables certain features of the Site and our Services and is deleted from your computer when you disconnect from or leave the Site. A persistent cookie remains after you close your browser and may be used by your browser on subsequent visits to the Site. Persistent cookies can be removed by following your web browser help file directions. Most Internet browsers automatically accept cookies. You can instruct your browser, by editing its options, to stop accepting cookies or to prompt you before accepting a cookie from the websites you visit. Third parties on The Boca Raton’s Site may use cookies and similar tracking technologies to collect information and infer your interests for interest-based advertising purposes. If you would prefer to not receive personalized ads based on your browser or device usage, you may generally express your opt-out preference to no longer receive tailored advertisements. Please note that you will continue to see advertisements, but they will no longer be tailored to your interests. To opt-out of interest-based advertising by participating companies in the following consumer choice mechanisms, please visit: – Digital Advertising Alliance (DAA)’s self-regulatory opt-out page ( http://optout.aboutads.info/ ) and mobile application-based “AppChoices” download page (https://youradchoices.com/appchoices) – European Interactive Digital Advertising Alliance (EDAA)’s consumer opt-out page (http://youronlinechoices.eu) In the mobile environment, most mobile operating systems offer device-based opt-out choices that are transmitted to companies providing interest-based advertising. To set an opt-out preference for a mobile device identifier (such as Apple’s IDFA or Android’s GAID), visit the device manufacturer’s current choice instructions pages, or read more about sending signals to limit ad tracking for your operating system here http://www.networkadvertising.org/mobile-choices Please note that these settings must be performed on each device (including each web browser on each device) for which you wish to opt-out, and if you clear your cookies or if you use a different browser or device, you will need to renew your opt-out preferences. You may sign-up to receive emails or other communications from us. If you would like to discontinue receiving this content, you may update your marketing preferences by using the “Unsubscribe” link found in the emails or toggling off the “Opt-in” button located in your privacy setting page. We do not respond to Do Not Track (“DNT”) signals sent to us by your browser at this time. To learn more about how DNT works, please visit http://allaboutdnt.com/ Purpose and Legal Basis for Processing Personal Information The purposes for which we process information about you are as follows: To operate and improve our Sites and Services and to foster a positive user experience. To enable secure use of the Sites and Services. To enable secure use of the Sites and Services. To obtain feedback, to conduct market analysis, and to analyze usage of the Sites and Services in order to develop, customize and improve the Sites and Services. To publish comments that you make to our publicly accessible blogs. To enable you to communicate, collaborate, and share files with users you designate. To send you communications relating to your use of the Service, including, for example, welcoming and confirmation emails; responses to your emails, support inquiries, submissions, comments, requests or complaints, information on updates to services that better meet your needs; and notification if you win a contest. With your consent, to send you surveys or newsletters, to contact you about services, products, activities, special events or offers from or our partners and for other marketing, informational, and promotional purposes. To meet legal obligations. To protect our rights and property. For other purposes about which we notify you. The Boca Raton’s legal basis for collecting and using the personal information described in this Privacy Policy will depend on the personal information concerned and the context in which we collect it. We collect personal information from you: Where we need it to perform a contract with you; Where the processing is in our legitimate interests (including the purposes described above); Where we need it to comply with a legal obligation; If we otherwise have your consent. Sharing of Personal Information We will not share, rent or sell personal information with any person or entity, except as set forth in this Privacy Policy below: Third Party Service Providers/Vendors: We may use third party partners to help operate the Site and deliver our features and Services, and may share your information with service providers and other third parties that provide products or Services for or through this Site or for our business (such as Web site or database hosting companies, address list hosting companies, email service providers, analytics companies, distribution companies, fulfillment companies, and other similar service providers that use such information on our behalf). Business Partners: With your consent, The Boca Raton may share your information with business partners whose sites you have submitted content to, in order to allow them to provide you with offers, promotions, products, and services. Legal Compliance and Protection of Rights and Interests: In certain situations, we may be required to disclose personal information in response to lawful requests by public authorities, including to meet national security or law enforcement requirements. We may also disclose your personal information as required by law, such as to comply with a subpoena or other legal process, when we believe in good faith that disclosure is necessary to protect our rights or property, to defend against legal claims, to prevent abuse, to protect your safety or the safety of others, to investigate fraud, or to respond to a government request. Affiliates: We disclose your personal information to affiliated companies related by common ownership or control to carry out regular business activities. Corporate Transactions: If The Boca Raton is involved in a merger, acquisition, dissolution, sale of all or a portion of its assets, or other fundamental corporate transaction, we reserve the right to sell or transfer your information as part of the transaction. In such an event, you will be notified via email and/or a prominent notice on our website of any change in ownership, incompatible new uses of your personal information, and choices you may have regarding your personal information. Securing Your Information The Boca Raton is very concerned about safeguarding the confidentiality of personal information. We use commercially reasonable physical, administrative, and technical safeguards to preserve the integrity and security of your personal information. Due to the inherent nature of the Internet as an open global communications vehicle, we make no guarantee as to the security of your information or that your information, during transmission through the Internet or while stored on our system or otherwise in our care, will be absolutely safe from intrusion by others, such as hackers. Data Retention We process your personal information for the minimum period necessary for the purposes set out in this Privacy Notice, unless there is a specific legal requirement for us to keep the data for a longer retention period. We determine the appropriate retention period based on the amount, nature, and sensitivity of your personal information, and after the retention period ends, we will delete or anonymize your personal information. When we are unable to do so for technical reasons, we will ensure that appropriate measures are put in place to prevent any further such use of your personal information. Third Party Links The Boca Raton Sites or Services may contain links to third party websites. The fact that we link to a website is not an endorsement, authorization or representation of our affiliation with that third party. We do not exercise control over third party websites. These other websites may place their own cookies or other files on your computer, collect data or solicit personally identifiable information from you. Other sites follow different rules regarding the use or disclosure of the personally identifiable information you submit to them. We encourage you to read the privacy policies or statements of the other websites you visit. Your Access and Other Date Subject Rights We respect your control over your personal information. You may exercise any of the following rights by sending an email with details of your request to experience@thebocaraton.com . Please note that we may ask you to verify your identity before taking further action on your request, for security purposes. Request access to the personal information that we process about you; Request that we correct inaccurate or incomplete personal information about you; Request deletion of personal information about you; Request restrictions, temporarily or permanently, on our processing of some or all personal information about you; Request transfer of personal information to you or a third party where we process the data based on your consent or a contract with you, and where our processing is automated; and Opt-out or object to our use of personal information about you where our use is based on your consent or our legitimate interests. Depending on where you live, you may have a right to lodge a complaint with a supervisory authority or other regulatory agency if you believe that we have violated any of the rights concerning personal information. We encourage you to first reach out to us at experience@thebocaraton.com , so we have an opportunity to address your concerns directly before you do so. We respect your control over your personal information. You may exercise any of the following rights by sending an email with details of your request to experience@thebocaraton.com . Please note that we may ask you to verify your identity before taking further action on your request, for security purposes. Request access to the personal information that we process about you; Request that we correct inaccurate or incomplete personal information about you; Request deletion of personal information about you; Request restrictions, temporarily or permanently, on our processing of some or all personal information about you; Request transfer of personal information to you or a third party where we process the data based on your consent or a contract with you, and where our processing is automated; and Opt-out or object to our use of personal information about you where our use is based on your consent or our legitimate interests. Depending on where you live, you may have a right to lodge a complaint with a supervisory authority or other regulatory agency if you believe that we have violated any of the rights concerning personal information. We encourage you to first reach out to us at experience@thebocaraton.com , so we have an opportunity to address your concerns directly before you do so. Children's Privacy The Sites and Services are not directed to individuals under the age of 18. We do not knowingly collect personal information from children without parental consent. International Transfer of Information Collected Please be aware that personal information may be transferred, stored, and processed outside of your country, including in the USA. Although we take steps to provide adequate safeguards, the data protection laws in those countries might not be as comprehensive as those in your country. The Boca Raton endeavors to apply suitable safeguards to protect the privacy and security of personal information wherever it is transferred, and to use it only consistent with your relationship with us and the practices described in this Privacy Policy. Changes to Privacy Statement We may amend this Privacy Policy at any time. We will post all changes to this Privacy Policy on this page and will indicate at the top of this page the Privacy Policy’s effective date. We therefore encourage you to refer to this Privacy Policy on an ongoing basis so that you understand our current Privacy Policy terms. Third Party Use Policies Use of information received from Google APIs will adhere to Google API Services User Data Policy, including the Limited Use requirements. Contacting the Company For questions or comments regarding this Privacy Policy, please contact us at501 East Camino Real, Boca Raton, Florida 33432 or by email experience@thebocaraton.com . Content Uploader Terms of Use The Boca Raton respects the intellectual property rights of third parties and respond to allegations that copyrighted material has been shared through our site (“Platform”), without authorization from the copyright holder, in accordance with the safe harbor set forth in the Digital Millennium Copyright Act (“DMCA”). We will also, in appropriate circumstances and at our discretion, disable and/or terminate the use of the Platform by users who may infringe or repeatedly infringe the copyrights of others in accordance with the DMCA. NOTIFICATION OF ALLEGED COPYRIGHT INFRINGEMENT If you believe that your work has been copied and made available in a way that constitutes copyright infringement, you may send a written document to experience@thebocaraton.com that contains the following (a “Notice”): A description of the copyrighted work that you claim has been infringed. Identification of the URL or other specific location that contains the material that you claim infringes your copyright described in Item 1 above. You must provide us with reasonably sufficient information to locate the allegedly infringing material. An electronic or physical signature of the owner of the copyright or of the person authorized to act on behalf of the owner of the copyright. A statement by you that you have a good faith belief that the disputed use is not authorized by the copyright owner, its agent, or applicable law. A statement by you that the information contained in your Notice is accurate and that you attest under the penalty of perjury that you are the copyright owner or that you are authorized to act on the owner’s behalf. Your name, mailing address, telephone number, and email address. Please note that you may be liable for damages, including court costs and attorneys fees, if you misrepresent that content uploaded by another Platform user is infringing your copyright. Upon receiving a proper Notice, The Boca Raton will remove or disable access to the allegedly infringing material and notify the alleged infringer of your claim. We will also advise the alleged infringer of the DMCA Counter Notice Procedure described below in Section B by which the alleged infringer may respond to your claim and request that we restore this material. COUNTER NOTICE PROCEDURE If you believe your own copyrighted material has been removed from the Platform in error, you may submit a written Counter Notice to experience@thebocaraton.com that includes the following: Identification of the material that has been removed or disabled and the location at which the material appeared before it was removed or disabled. A statement that you consent to the jurisdiction of the Federal District Court in which your address is located, or if your address is outside the United States, the Northern District of California or any other judicial district in which may be found. A statement that you will accept service of process from the party that filed the Notice or the party’s agent. Your name, address and telephone number. A statement under penalty of perjury that you have a good faith belief that the material in question was removed or disabled as a result of mistake or misidentification of the material to be removed or disabled. Your physical or electronic signature. If you send a valid, written Counter Notice meeting the requirements described above, The Boca Raton will restore your removed or disabled material within 10 to 14 business days from the date we receive your Counter Notification, unless we first receive notice from the party filing the original Notice informing us that such party has filed a court action to restrain you from engaging in infringing activity related to the material in question. Please note that if you misrepresent that the disabled or removed content was removed by mistake or misidentification, you may be liable for damages, including costs and attorney’s fees. REPEAT INFRINGER POLICY In accordance with the DMCA and other applicable laws, we will, at our discretion, disable and/or terminate access to the Platform by users who may infringe or repeatedly infringe the copyrights of others. This determination will be based on the number of “strikes” against the user. A “strike” is counted against a user each time there is an adjudication by a court, arbitrator or other tribunal of competent jurisdiction that the user has engaged in copyright infringement of any kind in relation to the Platform. In accordance with the DMCA and other applicable laws, we will, at our discretion, disable and/or terminate access to the Platform by users who may infringe or repeatedly infringe the copyrights of others. This determination will be based on the number of “strikes” against the user. A “strike” is counted against a user each time there is an adjudication by a court, arbitrator or other tribunal of competent jurisdiction that the user has engaged in copyright infringement of any kind in relation to the Platform. Each adjudication counts as a separate strike. If an adjudication pertains to multiple instances of copyright infringement, it can count as multiple strikes. has adopted a “three strikes and you’re out” policy under which a user who accumulates three strikes is considered a repeat infringer and may be subject to account termination. REPRESENTATIONS AND WARRANTIES You represent and warrant that any content you upload to the Platform does not violate the rights of any third party, including, without limitation, the intellectual property, privacy or publicity rights of any third party, and constitutes an original work of authorship by you. USER CONTENT RESTRICTIONS You may not upload, post, or transmit any images, video, text, audio, or other content or materials (collectively, “User Content”) that: (a) would violate or infringe our proprietary, privacy, publicity, or intellectual property rights, or those of any third party; (b) is obscene, defamatory, threatening, harassing, abusive, libelous, hateful, or harmful to any other person or entity; (c) violates any applicable law, statute, ordinance, or regulation; (d) puts in jeopardy the security of your account, us, the Platform, or any third party; or (e) promotes or displays any of the following content: (i) pornography; (ii) violence; (iii) racial intolerance or advocacy against any individual, group, or organization; (iv) profanity; or (v) illicit drugs and drug paraphernalia. We reserve the right, but have no obligation, to pre-screen, review, flag, filter, modify, refuse, and remove any and all User Content from this site. You understand and expressly acknowledge that by using the Platform you may be exposed to content that you find offensive, indecent, or objectionable and that we will not be liable to you or any other person or entity for your consumption of any content on the Platform. DATA PROCESSING ADDENDUM This Data Processing Addendum (DPA) amends our Terms of Service (also Agreement) and sets out the terms that apply when Personal Information is processed by under the Agreement. The purpose of the DPA is to ensure such processing is conducted in accordance with applicable laws and with due respect for the rights and freedoms of individuals whose Personal Information is processed. Other capitalized terms used but not defined in this DPA have the same meanings as set out in the Agreement. DEFINITIONS For the purposes of this DPA: “EEA” means the European Economic Area, which constitutes the member states of the European Union, the United Kingdom, Norway, Iceland and Liechtenstein. “California Consumer Privacy Act of 2018” or “CCPA” means Assembly Bill 375 of the California House of Representatives, an act to add Title 1.81.5 (commencing with Section 1798.100) to Part 4 of Division 3 of the Civil Code, relating to privacy and approved by the California Governor on June 28, 2018; “EU Data Protection Legislation” means (i) prior to 25 May 2018, Directive 95/46/EC of the European Parliament and of the Council on the protection of individuals with regard to the processing of personal information and on the free movement of such data, including any applicable national implementations of it; and (ii) on and after 25 May 2018, Regulation 2016/679 of the European Parliament and of the Council on the protection of natural persons with regard to the processing of personal information and on the free movement of such data, and repealing Directive 95/46/EC (as amended, replaced or superseded) (“GDPR”); “Controller” shall mean the entity which, alone or jointly with others, determines the purposes and means of the processing of Personal Information; “Processor” shall mean an entity which processes Personal Information on behalf of the Controller; and “Personal Information” means any information relating to an identified or identifiable natural person. APPLICATIONS OF DPA Applicability. This DPA will apply only to the extent that processes Personal Information from the EEA on behalf of “You” the Customer. GDPR. This DPA inclusive of Exhibits A and B will apply only on and after 25 May 2018. Where the GDPR materially or adversely impacts our continued provision of the Services (including its costs in providing the Services) and / or Customer’s receipt of the Services, the Parties shall discuss in good faith and acting reasonably, what changes may be necessary and operationally, technically and commercially feasible to the Agreement and/or the DPA and/or the Services (including, without limitation, the fees payable by Customer to for the Services) in order to enable to continue providing the Services. No such changes shall be effective unless agreed between the Parties pursuant to this Clause. ROLES AND RESPONSIBILITIES Parties’ Roles. To the extent that The Boca Raton processes Personal Information in the course of providing the Services, it will do so only as a Processor acting on behalf of Customer (as Controller) and in accordance with the requirements of the Agreement. Purpose Limitation. The Boca Raton will process the Personal Information only for the purpose of providing the Services and in accordance with Controller’s lawful instructions. Compliance. Customer, as Controller, shall be responsible for ensuring that: It has complied, and will continue to comply, with all applicable laws relating to privacy and data protection, including EU Data Protection Legislation; and b) It has, and will continue to have, the right to transfer, or provide access to, the Personal Information to for processing in accordance with the terms of the Agreement and this DPA. The Boca Raton providing an accurate and up to date Data Security Contact name, and contact information available during both business and non-business hours. SECURITY Security. The Boca Raton will have in place and maintain throughout the term of this Agreement appropriate technical and organizational measures to protect the Personal Information against accidental or unlawful destruction or accidental loss, alteration, unauthorized disclosure or access, and against all other unlawful forms of processing (a “Security Incident”). Security Incident. In the event of a Security Incident, The Boca Raton will notify Customer via Customer’s designated Data Security Contact and provide reasonable assistance in order to remedy or mitigate the effects of the Security Incident. TERM AND TERMINATION Subprocessing. Customer authorizes The Boca Raton to subcontract processing of Personal Information under the Agreement to a third party provided that flows down Section 3.2 and Section 4.1 to any subcontractor it appoints. INTERNATIONAL TRANSFERS Adequacy. The Boca Raton will provide an adequate level of protection for Personal Information that it processes on behalf of Customer in accordance with the requirements of EU Data Protection Legislation. SERVICE DATA Notwithstanding anything in this DPA, The Boca Raton will have the right to collect, extract, compile, synthesize and analyze non‐personally identifiable data or information resulting from Customer’s use or operation of the Services (“Service Data”) including, by way of example and without limitation, information relating to volumes, frequencies, recipients, bounce rates, or any other information regarding the communications The Boca Raton Customer, its end users or recipients generate and send using the Services. To the extent any Service Data is collected or generated by us, such data will be solely owned by and may be used by for any lawful business purpose without a duty of accounting to The Boca Raton Customer or its recipients, provided that such data is used only in an aggregated form, without directly identifying any person. For the avoidance of doubt, this DPA will not apply to Service Data. MISCELLANEOUS Except as amended by this DPA, the Agreement will remain in full force and effect. If there is a conflict between the Agreement and this DPA, the terms of this DPA will control. Any claims brought under this DPA shall be subject to the terms and conditions, including but not limited to, the exclusions and limitations set forth in the Terms of Service. Exhibit A – GDPR Addendum The following terms in this Exhibit A shall apply to the Agreement and the DPA only on and after 25 May 2018. Scope. The subject‐matter of the data processing is the provision of the Services and the processing will be carried out for the duration of the Subscription Term. Exhibit B sets out the nature and purpose of the processing, the types of Personal Information processes and the categories of data subjects whose Personal Information is processed. Instructions. The Terms of Service and this DPA set out The Boca Raton Customer’s complete documented instructions in relation to the processing of the Personal Information and any processing required outside of the scope of these instructions will require prior written agreement between the parties. Purpose Limitation. If The Boca Raton is required to process the Personal Information for any other purpose by European Union or national law to which The Boca Raton is subject, shall inform the Customer of this requirement before the processing, except where otherwise required by such law. Data Protection Impact Assessments. The Boca Raton shall, to the extent required by EU Data Protection Legislation, provide Customer with reasonable assistance at Customer’s cost and expense with data protection impact assessments or prior consultations with data protection authorities that Customer is required to carry out under EU Data Protection Legislation or the CCPA. Sub‐processing. Customer agrees that The Boca Raton may engage affiliates and third party sub‐processors (collectively, “Sub‐processors”) to process the Personal Information on our behalf. The Boca Raton shall impose on such Sub‐processors data protection obligations that protect the Personal Information to the same or substantially similar standard provided for by this DPA and shall remain liable for any breach of the DPA caused by a Sub‐processor. Security The Boca Raton will ensure that any person that it authorizes to process the Personal Information (including its staff, agents and subcontractors) shall be subject to a duty of confidentiality) whether a contractual or a statutory duty). Upon becoming aware of a Security Incident, The Boca Raton shall notify Customer via Customer’s provided Data Security Contact, without undue delay and shall provide such timely information as Customer may reasonably require, including to enable Customer to fulfil any data breach reporting obligations under EU Data Protection Legislation or the CCPA. The Boca Raton shall promptly take appropriate steps to remedy or mitigate any damage arising from such a Security Incident. Audit. While it is the parties’ intention ordinarily to rely on the provision of the documentation to verify our compliance with this DPA, The Boca Raton shall permit the Customer (or its appointed third party auditors) to carry out an audit of processing of Personal Information under the Agreement following a Security Incident suffered by us, or upon the instruction of a data protection authority. Customer must give reasonable prior notice of such intention to audit, conduct its audit during normal business hours, and take all reasonable measures to prevent unnecessary disruption to our operations. Any such audit shall be subject to our security and confidentiality terms and guidelines. Data subjects’ rights. The Boca Raton shall, taking into account the nature of the processing, provide reasonable assistance to Customer insofar as this is possible and at Customer’s cost and expense, to enable Customer to respond to requests from a data subject seeking to exercise their rights under EU Data Protection Legislation. In the event that such a request is made directly to us, we shall promptly inform Customer of the same. Deletion / return of Personal Information. Upon termination or expiry of the Subscription Term, we shall, at Customer’s election, delete all relevant Personal Information (including copies) in our possession, save to the extent that is required by any applicable law to retain some or all of the Personal Information. If there is a conflict between the DPA and this Exhibit, the terms of this Exhibit will control. Exhibit B – Data Processing Appendix Data subjects The Personal Information transferred concern the following categories of data subjects (please specify): End users – individuals who interact with the Customer by way of the communication platform. Categories of data The Personal Information transferred concern the following categories of data: IP Address, Device info (Operating system, Browser), Cookie dropped anonymous ID, Email, Full Name, location data, Facebook Username, Instagram Username, Facebook Avatar, Instagram Bio, Unique social Id for Instagram/Facebook/ Twitter, and interactions with end users via the communication platform. Special categories of data (if appropriate) The Personal Information transferred concern the following special categories of data: None. Processing operations The personal information transferred will be subject to the following basic processing activities (please specify): Personal Information will be transferred from the Customer to for to provide a communication platform to facilitate interaction and engagement between the Customer and the end user. This service will consist of providing a communication platform for the Customer to use in order to on‐board and retain end users as well as analyze their use of the Customer’s product and / or services. Full details about our products and services can be found at http://www.nvhg.com/ Exhibit C – California Consumer Privacy Act of 2018 The Boca Raton is a “Service Provider” as defined in CCPA Section 1798.140(v). Customer discloses Personal Information to solely for: (i) a valid business purpose; and (ii) to perform the Services. The Boca Raton is prohibited from: (i) selling Personal Information; (ii) retaining, using, or disclosing Personal Information for a commercial purpose other than providing the Services; and (iii) retaining, using, or disclosing the Personal Information outside of the Agreement between and Customer. The Boca Raton understands the prohibitions outlined in Section 4. Boca Raton Facebook Boca Raton Youtube Boca Raton Spotify Boca Raton Instagram Boca Raton Homepage Link The Boca Raton Club Since 1926 – Blog Gallery Travel Advisors Gift Cards Sustainability Contact Getting Here Resort Map FAQ Press & Awards Accessibility Privacy Policy Terms & Conditions Leadership Team Careers User Sitemap © 2025 The Boca Raton 501 East Camino Real, Boca Raton, FL 33432 (855) 874-6551 How May I Help You? (855) 874-6551 Book Now"
    },
    {
      "url": "https://www.thebocaraton.com/experiences/golf/",
      "text": "The Boca Raton - Private Golf Club & Course Boca Raton Homepage Link Choose Your Dates Or enter manually Press the down arrow key to enter the datepicker and choose two dates. Navigate dates with arrow keys and skip to previous and next month with ctrl + left and ctrl + right Number of Adults 1 Adult 2 Adults 3 Adults 4 Adults Number of Children 0 Child 1 Child 2 Children 3 Children 4 Children Enter Promo Code Enter Your Dates Check-In Date: Check-Out Date: View Available Rates Skip to main content Boca Raton Homepage Link Stay Stay submenu Overview Beach Club Bungalows Tower Yacht Club Cloister Suite Collection Membership Offers Drink & Dine Beach & Pools Beach & Pools submenu Overview Harborside Pool Club Beachside Boca Raton Homepage Link Experiences Experiences submenu Overview Holidays & Events Families Golf Tennis & Pickleball Boating Water Sports Fitness Shopping Artisans of Wine & Food Membership Spa Palmera Meetings & Events Meetings & Events submenu Overview Meetings & Events Weddings Celebrations Boca By Design Holidays & Events Book Now Overview Holidays & Events Families Golf Tennis & Pickleball Boating Water Sports Fitness Shopping Artisans of Wine & Food Membership Boca Raton Homepage Link Stay Overview Beach Club Bungalows Tower Yacht Club Cloister Suite Collection Membership Offers Drink & Dine Beach & Pools Overview Harborside Pool Club Beachside Experiences Overview Holidays & Events Families Golf Tennis & Pickleball Boating Water Sports Fitness Shopping Artisans of Wine & Food Membership Spa Palmera Meetings & Events Overview Meetings & Events Weddings Celebrations Boca By Design Holidays & Events Home Experiences Golf Golf Club Tee up some competition and enjoy a round—or a few—on our championship-level golf course, exclusively reserved for resort guests and members. Sitting on the Audubon Cooperative Sanctuary, golf at The Boca Raton offers stunning natural views and premier play in the balmy, beachside air. Please note: The golf course and driving range will be closed for routine maintenance on Tuesday, September 2 through Monday, September 8. Green Fees LOCATION Harborside HOURS Tee Times: Daily, 7:30 am – 6:00 pm Driving Range: Daily, 7:00 am – 7:00 pm Golf Pro Shop: Daily, 7:00 am – 6:00 pm DETAILS Available year-round Hotel guests and members only All ages Please note: The golf course and driving range will be closed for routine maintenance on Tuesday, September 2 through Monday, September 8. Reservation (877) 567-3248 The Course The Boca Raton Club Course offers twelve acres of water, a signature island-green finishing hole, and an undeniable sense of history. This 18-hole, par-71 course plays across 6,253 yards of dramatic landscapes in a treasured Audubon Cooperative Sanctuary. Tee times are reserved exclusively for Club members and resort guests. Video Tour Trackman Range Technology Perfect your swing at our driving range, featuring hitting stations powered by state-of-the-art Trackman Range technology. Each hitting station is complete with a monitor that displays valuable insights into your golf ball’s speed, distance, and other important metrics. Enjoy a variety of digital gaming options, offering a fun experience for players of all levels. The driving range is open to Club members and leisure guests throughout their stay (included in the resort fee). Golf Clinics & Private Lessons Ready to be come a pro? The Boca Raton offers golf clinics and private instructions to help you perfect your swing, exclusively available to resort guests and Club members VIEW CLINICS & LESSONS World-Class Instructors Our team of experienced professionals is dedicated to assisting you in enhancing your golf skills through personalized one-on-one instruction. Meet The Pros Golf Club Events Exclusively available to resort guests and Club members, The Boca Raton offers a variety of Golf Club events. Show off your swing in a competition at the driving range or show your skills by beating our golf pros. Explore Events Pro Shop Elevate your game and explore our collection of premium golf, sport, and resort attire and accessories, as well as the most innovative golf technology on the market. Mulligans Refresh for another round with casual American bites overlooking the historic Club Course. EXPLORE Food & Beverage Cart Exclusive to those playing on the golf course, our food & beverage cart offers complimentary bites and non-alcoholic beverages. Beer, wine, and spirits are available for purchase. Note: Not applicable for large groups or tournaments. VIEW MENU Boca Raton Facebook Boca Raton Youtube Boca Raton Spotify Boca Raton Instagram Boca Raton Homepage Link The Boca Raton Club Since 1926 – Blog Gallery Travel Advisors Gift Cards Sustainability Contact Getting Here Resort Map FAQ Press & Awards Accessibility Privacy Policy Terms & Conditions Leadership Team Careers User Sitemap © 2025 The Boca Raton 501 East Camino Real, Boca Raton, FL 33432 (855) 874-6551 How May I Help You? (855) 874-6551 Book Now"
    }
  ]
}