{
  "fuentes": [
    {
      "url": "https://artistandfan.com/venues/venues/read/1663",
      "email": "joel@theblackhammock.com"
    }
  ],
  "mails": [
    "joel@theblackhammock.com"
  ],
  "nombre_sitio": "theblackhammock.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://artistandfan.com/venues/venues/read/1663",
      "text": "Venue Lazy Gator Bar at Black Hammock, Oviedo Florida USA onArtistAndFan ArtistAndFan home Home Articles Features Shows Videos Newsletter Press Releases Sponsors Advertise check_circle_outline Sign Up check_circle_outline Sign In home Home Articles Features Shows Videos Newsletter Press Releases Sponsors Advertise check_circle_outline Sign Up check_circle_outline Sign In Account search I AM SEARCH SOCIAL WIDGET Home Features Venues Lazy Gator Bar at Black Hammock Lazy Gator Bar at Black Hammock Share Become a Member check_circle_outline Sign Up Become a member and claim this Profile or create your own! Venue Contacts Promoter Photos Lazy Gator Bar at Black Hammock Venue Type Club Oviedo Florida USA Marketplace Oviedo Styles Blues, Classic Rock, Country Region Southeast Primary Contact Joel Martin Email joel@theblackhammock.com Alternate Contact Promoter Buyer External links Website https://theblackhammock.com/lazy-gator-bar/index Facebook https://facebook.com/blackhammockadventures Instagram Twitter YouTube Linkedin Mailing Address Lazy Gator Bar at Black Hammock 2356 Black Hammock Fish Camp Road Oviedo FL 32765 Phone (407) 365-1244 Promoter Buyer Capacity Seats 100+ Venues They Book Dates When To Contact Age Limit All Ages Notes About \"The Lazy Gator Bar is part of our exciting lakeside attraction located on Lake Jesup. If you’re looking for a place to relax, have an ice-cold brew and enjoy a spectacular view of the lake, then look no further than our revamped Oviedo bar!\" Blues Classic Rock Country Lazy Gator Bar at Black Hammock Staff Name Joel Martin Lazy Gator Bar at Black Hammock Promoter Name Company Joel Martin Lazy Gator Bar at Black Hammock Photos Venues Newsletter Signup × Sign up forArtistAndFan Newsletters Keep in touch with everything onArtistAndFan. Sign up for our newsletter! Sign up Close Newsletter Signup × Sign up forArtistAndFan Newsletters Keep in touch with everything onArtistAndFan. Sign up for our newsletter! Sign up Close Stats Elapsed time: 0.1015 seconds Memory useage: 3.03MB V2.geronimo ArtistAndFan News Articles Features News, Assets and Resources for Music Business Professionals About ArtistAndFan Terms of Service Privacy Policy Customer Service Contact Us Get In Touch Send a message We welcome your inquiries ©\r\n          2019-2025 ArtistAndFan All Rights Reserved."
    }
  ]
}