{
  "fuentes": [
    {
      "url": "https://www.thecrazyhorse.ca/new-page-1",
      "email": "info@thecrazyhorse.ca"
    },
    {
      "url": "https://www.thecrazyhorse.ca/new-page-1",
      "email": "info@thecrazyhorse.ca"
    },
    {
      "url": "https://durangowildhorsesaloon.com/contact/",
      "email": "gkeefe2699@aol.com"
    },
    {
      "url": "https://durangowildhorsesaloon.com/contact/",
      "email": "info@durangowildhorsesaloon.com"
    },
    {
      "url": "https://www.theunion.com/news/crazy-like-a-horse-nevada-citys-crazy-horse-saloon-grill-celebrates-60-years/article_87f6796e-c4c5-4b70-b03c-c7828f0f2a9f.html",
      "email": "efunez@theunion.com"
    },
    {
      "url": "https://www.theunion.com/news/crazy-like-a-horse-nevada-citys-crazy-horse-saloon-grill-celebrates-60-years/article_87f6796e-c4c5-4b70-b03c-c7828f0f2a9f.html",
      "email": "jnobles@theunion.com"
    },
    {
      "url": "https://high-horse.com.au/pages/contact-us",
      "email": "sales@airr.com.au"
    }
  ],
  "mails": [
    "efunez@theunion.com",
    "gkeefe2699@aol.com",
    "info@durangowildhorsesaloon.com",
    "info@thecrazyhorse.ca",
    "jnobles@theunion.com",
    "sales@airr.com.au"
  ],
  "nombre_sitio": "thecrazyhorsesaloon.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.thecrazyhorse.ca/new-page-1",
      "text": "Contact — Crazy Horse Steakhouse and Saloon Reservations Menu Entertainment Showcase Tour Contact Cart ( 0 ) Reservations Menu Entertainment Showcase Tour Contact Cart ( 0 ) 0 Contact Crazy Horse is located in the Kanata, Centrum and home to Ottawa’s only Stonegrill experience. We are locally owned and operated since 2009! Contact us today. How can we help? Name * First Name Last Name Email Address * Subject * Message * Thank you! Our ADDRESS Crazy Horse 115 Roland Michener Drive,  Kanata, ON. K2T 1G7 Canada MON: Closed TUE: 4:00-10:00 WED: 4:00-2:00 THU: 12:00-11:00 FRI: 12:00-2:00 SAT: 12:00-2:00 SUN: closed CRAZY HORSE STEAKHOUSE AND SALOON 115 Roland Michener Drive Kanata, ON K2T 1g7 PHONE: (613) 591-8884 INFO@THECRAZYHORSE.CA"
    },
    {
      "url": "https://durangowildhorsesaloon.com/contact/",
      "text": "Contact Us - Durango Wild Horse Saloon Skip to content Search for: About Us Calendar Book Our Space SHOP Contact Contact wiensconsulting 2023-01-09T15:54:48-07:00 Do you have questions or comments for us? We would love to hear from you! The best and fastest way to contact our owner and management is by sending an email to durangowildhorsesaloon@gmail.com Or you can use the form below and we will get back to you as soon as possible. Your Name* Your Email* Contact Number Your Message* × Contact Us: We’d Love to Hear from You! 601 East 2nd Ave, Durango, CO, 81301 | (970) 375-2568 | info@durangowildhorsesaloon.com | We are currently open Thursday-Saturday. We open at 6pm, bar service is until 1:30am. We close by 2am. Interested in playing at the Wildhorse? Click here to contact our band manager Looking to book our space? Click here to learn more about renting our space Any other questions or comments We would love to hear from you. Click here to email Amber for a quick response to any questions!"
    },
    {
      "url": "https://www.theunion.com/news/crazy-like-a-horse-nevada-citys-crazy-horse-saloon-grill-celebrates-60-years/article_87f6796e-c4c5-4b70-b03c-c7828f0f2a9f.html",
      "text": "Crazy like a horse: Nevada City's Crazy Horse Saloon & Grill celebrates 60 years | News | theunion.com Skip to main content × Thank you for reading! Please log in, or sign up for a new account and purchase a subscription to continue reading. Please purchase a subscription to continue reading. Your current subscription does not provide access to this content. Sign Up Log In There are no services available. Have a promo code? Find Offers × Have a promo code? Find Offers Back You have permission to edit this article. Edit Close 58° Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Best of 2024 Home Contact Us Terms of Use Privacy Policy Home Delivery Subscription Services Submission Forms Place an Ad Local Weather News Local News Business Cannabis Community Education Environment Fire Housing Politics Wildwood Independent World/Nation/State Sports Community Sports Prep Sports Outdoors Entertainment Local Events Lifestyles Family Focus Farm to Table Health Home & Garden Outdoors Pets Religion Obituaries Multimedia Photos Videos Classifieds Legal Ads Place Legal Ads Place a Classified Ad E-Edition Magazines Wildwood Independent Women in Nevada County Nevada County AG Home Holidays in Nevada County Best of 2024 Healthy You Aging Well Veterans Day Home Garden & Lifestyle Show Nevada County Visitors' Guide Facebook Twitter Instagram © Copyright 2022 The Union, Terms of Use | Privacy Policy Site search Search Subscribe Here Menu Search Open user controls Log In Using Your Account Log In Don't have an account? Sign Up Today My Account Dashboard Profile Saved items Logout 58° Home Contact Us Terms of Use Privacy Policy Home Delivery Subscription Services Submission Forms Place an Ad Local Weather News Local News Business Cannabis Community Education Environment Fire Housing Politics Wildwood Independent World/Nation/State Sports Community Sports Prep Sports Outdoors Entertainment Calendar Lifestyles Family Focus Farm to Table Health Home & Garden Outdoors Pets Religion Obituaries Multimedia Photos Videos Home Classifieds Legal Ads Place Legal Ads Place Classified Ads E-Edition Magazines Wildwood Independent Women in Nevada County Nevada County AG Home Holidays in Nevada County Home Garden & Lifestyle Show Best of 2024 Healthy You 2025 Aging Well Veterans Day Nevada County Visitors' Guide Submissions Best of 2024 Share This Facebook Twitter WhatsApp SMS Email Close Featured Crazy like a horse: Nevada City's Crazy Horse Saloon & Grill celebrates 60 years Jennifer Nobles\nStaff Writer Jun 21, 2025 Jun 21, 2025 Comments Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save It’s impressive that Crazy Horse Saloon & Grill in Nevada City is celebrating 60 years of business, but those six decades are only a mere fraction of the history of the building, said to be erected in 1862. Kate Anderson took over the popular joint in 2019, and has continued the tradition of live music, libations, and food she is proud to see come out of her kitchen. Tyler Blue has held the role of Music Director since 2013. When he began his role at the club/bar/restaurant, he took it upon himself to learn more about the rich history of the building itself. “I went to the Historical Society Museum and looked into all the records and it’s a rich history as you can imagine,” Blue said. “The building itself (reads) 1862, so we say it’s been around since then, but the records don’t go before 1885 because of fires at that time. It was initially J.J. Jackson’s General Store and then it went through many different incarnations. Then Ray Dallugge bought it and turned it into the Chief Crazy Horse Inn in 1965.” “I had only been here once before when Ray still owned it, and honestly I don’t really have any memory of it at that point,” Anderson recalls. Her best friend Terra Saxton bought the business in the 2010s, eager to reopen this space that had seen such success. For a brief period, it was known as Crazy Cow Frozen Yogurt, a venture which lasted all but nine months, Anderson said. “Terra wanted to reopen it,” Anderson explained. “This was something she always wanted to do. I started working with her and helping her reopen it and working for her for seven or eight years bartending and it was kind of just this transfer. She wanted to sell it and I think we always slightly discussed me taking it over, but it wasn’t always necessarily real until it became real when she was really ready to let it go.” Anderson said by the time she bought Crazy Horse, she knew it inside and out. It was a natural move for her to make when Saxton was ready to sell. Crazy Horse is, at least until about 9:00 p.m., family friendly, with many patrons joining for live music, trivia nights, and other events. Blue doesn’t take lightly the history of the building and what it has meant to the community over the past 60 years. “We consider ourselves stewards of a very important historical landmark,” said Blue. “We love hearing stories from our patrons about how important this place is to them, and countless stories of people who went here on their first date and they are now married, decades later. We love hearing about all the different eras from people riding motorcycles or horses into the bar, to even when there were stripper poles in here. There’s all sorts of traditions, and then new traditions. We consider it a living, breathing part of Nevada City history.” Anderson said keeping up not only a successful business but maintaining an over-100 year old building is a work in progress. “It takes a beating daily,” Anderson said. “We did the marquees and we have redone the floors three times. But really it’s just upkeep and updating, finding projects and ways we can make it better.” “Kate is a very detail-oriented owner, and she makes a point of always fine-tuning things and improving things,” Blue added. The Crazy Horse has also solidified itself—in large part to Blue’s expertise—as a music venue, though a small one. The room only has a maximum capacity of 108 individuals, so if there is an act you really want to see, you better act fast. Blue said that nationally touring acts have complimented the venue on its sound and lighting program. Without the staff, Anderson said, Crazy Horse would be nothing. “The staff and the people that put their blood, sweat, and tears into this place is huge,” she said. “We all take care of each other and you can feel it throughout. It was always really important for me to have people come in and recognize the staff or the bartenders or Tyler, and just know that we are kind of a family and we’re all still here.” Echoed Blue: “We put a lot of care into the staff and making sure we have an optimal team to run this place as much as it can be. I have been at the door greeting people for virtually every show we’ve had since March 2013. I can’t believe it, but I walk into this place every weekend and I feel better instantly.” While Crazy Horse doesn’t have any particular event to commemorate the 60th anniversary, they believe their establishment sets itself apart from any other downtown eatery or bar. What they have to offer, Blue said, is unique and captures the spirit of Nevada City. “This place wears many hats,” Blue said. “It’s a sports bar, it’s a bar, it’s a restaurant, it’s a music venue, and it’s a gathering point. There’s fun for the whole family here. There’s a good meal, including late night dining. There’s good shows every weekend. We are okay with people who want to call us a dive bar but we also consider ourselves a more sophisticated establishment and we just want people to feel comfortable here.” Anderson is clearly grateful for the support she has received from the community and her customers—many of them regulars. She is also proud to usher in the 61st year of Crazy Horse Saloon & Grill and add to its rich history. “I feel honored,” she said. “I feel like this is the period of time in the life of the Crazy Horse that I get to help run it and help it stay alive until the next person comes, and hopefully they do the same thing. Hopefully we will have a 100th anniversary one day, and we can be telling the same stories and it will still be a music venue and thriving, a place where people can come and dance with their community.” Crazy Horse Saloon & Grill is at 230 Commercial Street in Nevada City. For more information visit crazyhorsenc.com or call 530-265-4000. To conta ct Staff Writer Jennifer Nobles please email jnobles@theunion.com . Facebook Twitter WhatsApp SMS Email Print Copy article link Save Live Coverage From The Newsroom Your browser does not support iFrames. Local Events Facebook Twitter Instagram TheUnion.com 464 Sutton Way Grass Valley, CA 95945 To locate a department, visit Contact Us page. Sections News Sports Entertainment Obituaries Multimedia Announcements Online Features Services Subscription Services Submission Forms Classifieds Calendar Email Alerts Search Weather × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 The Union 464 Sutton Way, Grass Valley, CA | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital ."
    },
    {
      "url": "https://high-horse.com.au/pages/contact-us",
      "text": "Contact Us – High Horse Performance Skip to content Close - 🚚💨 FREE SHIPPING for $150+ ORDERS* (T&Cs Apply) 🚚💨 - - ⭐⭐⭐⭐⭐ TRUSTED by THOUSANDS of HAPPY CUSTOMERS - - 🦘 PROUDLY AUSTRALIAN MADE & OWNED 🦘 - Home Shop HORSE See more Close menu Ulcer Armour+ Gut Health+ Vitality+ Alpha+ | Oil Omega+ | Oil Starter Bundles RIDER See more Close menu Title Jumper Piece Tee The Crown GUT HEALTH+ - best seller for a reason - ULCER ARMOUR+ - it's a game changer - About Us Store Locator Contact Us News Log in Home Shop HORSE Ulcer Armour+ Gut Health+ Vitality+ Alpha+ | Oil Omega+ | Oil Starter Bundles RIDER Title Jumper Piece Tee The Crown GUT HEALTH+ - best seller for a reason - ULCER ARMOUR+ - it's a game changer - About Us Store Locator Contact Us News 0 Clear Navigation Search 0 Cart Close Today's offers Wellness week Buy your weekday smoothies and get your weekend ones for free. (7 for the price of 5!) WELLNESSWEEK 0 0 7 7 D 0 0 H 0 0 M 0 0 S Almond and banana 50% off for a limited time. Was $5.99 Now $3.00 0 0 7 7 D 0 0 H 0 0 M 0 0 S Cucumber and melon 33% off for a limited time. Was $5.99 Now $3.99 CONTACT US High Horse is Exclusively Distributed by AIRR PHONE: (03) 5820 8400 | EMAIL: sales@airr.com.au Outside of the AIRR Network? Have a question, or want a product recommendation? Get in touch: Phone: (03) 4239 0866 |  WhatsApp: Chat Now |  Email: hello@high-horse.com.au Name * Email * Phone number * Order number // Business name Message This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Send Quick links Store Locator Track My Order Shipping Policy Refund Policy Privacy Policy Terms of Service Become a Wholesaler Contact Us Get Social @hellohighhorse Contact us Call us on: (03) 4239 0866 Email: hello@high-horse.com.au WhatsApp: click here Sign Up for Updates: Subscribe © 2025, High Horse Performance Powered by Shopify American Express Apple Pay Google Pay Mastercard PayPal Shop Pay Union Pay Visa © 2025, High Horse Performance Powered by Shopify"
    }
  ]
}