{
  "fuentes": [
    {
      "url": "https://www.thecenteratdeltona.com/165/ADA-Website-Disclaimer",
      "email": "access@deltonafl.gov"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.mushin-dojo.com/",
      "email": "aikido101@me.com"
    },
    {
      "url": "https://brottar.com/pages/contact",
      "email": "contact@brottar.com"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/environmental-management/sustainability-and-resilience/lec/",
      "email": "clmiller@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/environmental-management/sustainability-and-resilience/lec/",
      "email": "swest@volusia.org"
    }
  ],
  "mails": [
    "access@deltonafl.gov",
    "aikido101@me.com",
    "clmiller@volusia.org",
    "contact@brottar.com",
    "info@scibpaints.com",
    "swest@volusia.org"
  ],
  "nombre_sitio": "thecenteratdeltona.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.thecenteratdeltona.com/165/ADA-Website-Disclaimer",
      "text": "ADA & Website Disclaimer | The Center at Deltona, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Availability Inquiry Venues FAQs Contact Us Home Venues About Us ADA & Website Disclaimer ADA & Website Disclaimer The Center at Deltona Web Accessibility Policy The Center is committed to making our website accessible to all users, including those with disabilities. Our goal is to provide an accessible website that conforms to Section 508 Guidelines and the World Wide Web Consortium’s Accessibility Guidelines (WCAG) 2.0 Level AA . Some existing content may not be in compliance, and some content may meet only the minimum required compliance standards. This will be resolved as departments and others update their existing websites and continue efforts to monitor and maintain acceptable compliance levels. While every effort will be made, it is understood that creating accessible formats for some documentation and graphical renderings maintained by The Center may be technologically unfeasible, impractical, or creates an undue hardship to The Center’s operations. We continue to make every effort to test the website and to remove barriers that prevent persons with disabilities from interacting with or accessing information made available on our website. If we become aware of content that does not conform to the WCAG 2.0 Level AA standards, we will make reasonable good faith efforts to make the content conform to the standards. We cannot control or correct problems with these third-party sites, but please let us know if you encounter difficulty with the sites we link to so we can pass the information along to the owners of those websites. You may also want to address your concerns directly to these third parties. While this policy does provide the standard for individuals with disabilities to access Web-based information, this policy cannot anticipate every accessibility need, due to known limitations of existing technology. There may be other circumstances, independent of technology that may limit the accessibility of The Center's websites. Adobe Acrobat is required to view and print PDF documents that appear on this website. Download the latest free version of Adobe Reader in order to improve the viewing of these files. We are currently working on our processes to ensure all PDFs are accessible. While we strive to adhere to the accepted guidelines and standards for accessibility and usability, it is not always possible to do so in all areas of the website, particularly as it relates to content by third parties. The Center and the City of Deltona are not responsible for ensuring that third-party content, software/tools, widgets, Add-ins, APIs, etc., which are not owned by The Center or the City but are otherwise located on or linked to The Center and City Websites, conform to WCAG 2.0 Level AA, and shall not be liable if they are inaccessible to individuals with disabilities. Accessibility Assistance We welcome your feedback on the accessibility of The Center's website. If you encounter any accessibility barriers, please let us know: Submit an Online Form Phone: 386-878-8100 Email Accessibility Assistance Postal address: Attn: Accessibility Coordinator 2345 Providence Boulevard Deltona, Fl 32725 Under Florida law, Email addresses are public record.  Please do not send electronic mail if you do not wish to have your Email address released in response to a public records request.  Instead, please contact us by phone or in writing. To enable us to respond in a manner that will be of most help to you, please indicate: The nature of the accessibility need Your preferred format (electronic format, large print, etc.). The web address of the requested material Your full contact information, so we can reach you if additional information is required. We will make reasonable accommodations for people with disabilities in accordance with the Americans with Disabilities Act. General Disclaimer Notice : Under Florida law, email addresses are public records. If you do not want your email address released in response to a public-records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. As a convenience to visitors to The Center or to Deltona’s website, we provide links to agencies that may supply information and provide services. The Center or the City does not endorse those agencies, nor does The Center or the City represent or warrant that the information and/or services those agencies provide will be suitable for the purposes of the user(s) or that any result will be achieved by the user(s) of the information and/or services. The Center and the City of Deltona makes every attempt to ensure the information on this site is correct. However, in the event that any information on this site is incorrect or not current, The Center and the City assume no liability for damages incurred directly or indirectly as a result of incomplete, incorrect or omissions of information. Public participation is solicited without regard to race, color, national origin, age, sex, religion, disability or family status. Persons with questions regarding nondiscrimination or Civil Rights, please contact the City of Deltona at 386-878-8100. Link Disclaimer Hyperlinks to external websites are provided as a courtesy. They should not be construed as an endorsement by The Center or the City of Deltona of any content, product, or services they may contain. ADA & Website Disclaimer Weddings Learn more Corporate Learn more Celebrations Learn more Live Performances Learn more Meetings Learn more Vendors Learn more Testimonials Secondary text goes here Contact Us 1640 Dr. Martin Luther King Blvd. Deltona, FL 32725 Phone: 386-878-8875 Quick Links Availability Inquiry Amenities Conference Room Grand Ballroom FAQs /QuickLinks.aspx Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.mushin-dojo.com/",
      "text": "Martial Arts Classes | Deltona, FL | Mushin Dojo Home About Us Services Adult Martial Arts Training Best Martial Arts School Kids Martial Arts Classes Martial Arts Classes Self-Defense Classes Gallery FAQs Contact Us CALL NOW A Journey Through Harmony and Strength Transform Yourself Through Martial Arts Classes IN DELTONA GET STARTED Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button In Memory of My Aikido Partner and Friend: October 20, 1965 – May 14, 2025. With a heavy heart, I share the passing of my longtime Aikido training partner, Troy Cunningham , who courageously battled cancer. For many years, we stood side by side on the mat—learning, growing, and supporting each other through every movement and every challenge. After years of training together, Troy and I tested for our Shodan (first degree black belt) on March 11, 2011. He was more than just a training partner—he was a true martial artist, defined by his quiet strength, deep discipline, and generous spirit. His presence in the dojo brought focus, humility, and a sense of camaraderie that lifted everyone around him. The lessons he shared extended far beyond technique. He taught me resilience, patience, and the importance of showing up—with integrity and heart. Though he is no longer physically with us, his spirit lives on in every practice, in the way we move, and in the values we carry forward. I am honored to have trained beside him, and I will carry his memory with me always. Find Balance and Strength Through Martial Arts Classes At our dojo, martial arts classes encapsulate more than just physical prowess—they embrace a transformative journey of mental clarity, discipline, and self-discovery. Rooted deeply in Aikido, our training fosters a harmonious blend of inner peace and physical activity, led by our Senior Instructor, Bill Hague. As a Godan (5th degree black belt) under Michael Moreno Shihan, a 7th Dan and member of the International Aikikai Federation, Bill brings a wealth of experience to the dojo. Bill began his Aikido journey after retiring from the United States Marine Corps in 2000 and, with a background in Judo, Kenpo, and amateur Boxing, Aikido remains his true passion. We welcome students of all ages and levels—building a community that thrives on learning and growth. Step into the world of martial arts and discover your path. Embark on this journey today! SIGN UP Button Button Sands of Time Button Button How Mushin Dojo Survived COVID-19 and Found a New Home The COVID-19 pandemic shuttered most commercial dojos across the country. It was an impossible situation—no one was allowed to train, gather, or even worship in a group setting. The martial arts community is only now beginning to slowly recover. Mushin Dojo was no exception. Without the ability to meet in person, we lost our leased space in DeLeon Springs. The dojo is now temporarily located at my home in 1146 Gage Avenue, Deltona, FL 32738, where we continue to train and rebuild our local Aikido community. What is Aikido? “Whenever I move, that is Aikido.” - O’Sensei, Morihei Ueshiba Aikido is a Japanese martial Art developed by Morihei Ueshiba, often referred to by his title, O’Sensei (Great Teacher). On a purely physical level it is an art involving some throws and joint locks that are derived from Jujitsu and some throws and other techniques derived from Kenjutsu. Aikido focuses not on punching or kicking opponents, but rather on using their own energy to gain control of them or to throw them away from you. It is not a static art, but places great emphasis on motion and the dynamics of movement. Aikido Excellence Starts Here Our dojo isn’t just a school; it's a thriving community where dedication meets transformation. Recognized as one of the area’s best martial art schools, we pride ourselves in our commitment to tradition and expert instruction. Emphasizing Aikido’s non-violent approach to self-defense, we cultivate an environment where physical fitness is paired with personal development. Join our family and experience martial arts training like never before. GET STARTED Connect With Your Child On the Mat Is your son or daughter 10 years or older? Do you both need a break from television, computers, cell phones and tablets? Discover Aikido together. Mushin Dojo offers a nurturing environment where you can train together as partners. Learn the basics of self-defense as individuals and as a coordinated team. Self-Defense skills are taught through our Aikido training; not as a separate class. I will offer private instruction to individuals who need specialized training, as in anti-bullying or an emerging personal threat response. LEARN MORE Empowerment Through Self-Defense Training Arm yourself with empowering self-defense skills in our thoughtfully designed classes. We teach Aikido's core principles, focusing on gracefully redirecting an opponent's energy and maintaining balance. Our techniques enhance not only confidence but also awareness, ensuring you respond effectively in diverse scenarios. Equip yourself with the knowledge to protect and assert yourself in real-world situations. Join us to experience these invaluable lessons firsthand. LEARN MORE Aikido Classes For Beginners at Our Dojo Beginners can dive into the martial arts world with our aikido-inspired classes. Our sessions focus entirely on Aikido, emphasizing its core principles of movement and technique. By highlighting peaceful, disciplined practices, we offer newcomers an insightful start to their martial arts journey. Whether seeking fitness or new skills, our classes provide an engaging introduction extending beyond traditional practice. Start your journey here today! CONTACT US Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button In Memory Of ﻿ I’m deeply saddened to share that my aikido training partner has passed away after bravely battling cancer. Their strength, kindness, and dedication both on and off the mat inspired everyone who had the privilege to train alongside them. They taught me more than just martial arts; they showed the true meaning of resilience and compassion. I will always carry their spirit with me in every movement and every step forward. Their legacy will live on in our hearts and in the dojo. I am grateful for the time we shared and the lessons they left behind. Explore Our Gallery: Moments Highlighted. Button Button Button Button Button Button Button Button GET STARTED See What Our Students Have to Say Get in Touch Today If you have questions, need more information, or are ready to register for classes, fill out the contact form below. A member of our staff will reach out to respond to your inquiry shortly. Contact Us Name: Email: Phone: Message: Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. Frequently Asked Questions If you don't see the information you need below, feel free to reach out to us! Why is Mushin Dojo so popular? Mushin Dojo's popularity in the Deltona area is driven by our comprehensive martial arts classes , which uniquely blend traditional Aikido principles with modern martial arts techniques. Students of all ages and skill levels are drawn to our martial arts classes because they go beyond just physical training; they focus on mental clarity, discipline, and inner harmony—a trademark of our curriculum. Our martial arts classes emphasize the non-violent defense strategies of Aikido, which appeals to individuals looking for effective self-defense techniques without aggression. The welcoming environment at Mushin Dojo encourages personal growth, whether you're interested in martial arts classes for children or adults. With expert instructors and a strong focus on community, our martial arts classes provide an enriching experience that keeps students engaged and motivated. Ready to experience our martial arts classes for yourself? Join our martial arts classes today and start your journey towards mastery and inner peace. How is Aikido different from other martial arts? Aikido is often translated as, “the way of harmonious spirit.” The founder’s goal was to create an art that practitioners could use to defend themselves while also protecting their attacker from injury. This goal, more than anything else, is what makes Aikido unique in the martial world. This requires very little physical strength, as the Aikidoka (one who practices Aikido) leads the attacker’s energy using entering and turning movements. The techniques are completed with various throws or joint locks. Aikido is found all over the world in a number of styles, with broad ranges of interpretation and emphasis. All Aikido styles share techniques learned from Morihei Ueshiba and most embody concern for the well-being of the attacker. Will Aikido Work For Me? There are many aspects of Aikido that make it both effective and enjoyable for a wide variety of practitioners. Unlike more traditional “combat” arts, Aikido does not rely on punches, kicks, knee or elbow strikes to “disable” the opponent. Instead, Aikido captures the momentum of the assailant and redirects it towards the ground or out and away. This redirection allows either control of or escape from the attacker. Since force is not opposed with force, the relative size or strength of the attacker and defender is much less of a deciding factor. This enables people of all ages, shapes and sizes to become equally proficient. Aikido techniques employ the physics of spiral acceleration to either draw the opponent in or project them away. Drawing in allows the application of joint locks. Projecting out results in throws which can be pretty spectacular in their effect. Can Aikido work for you? It will work for anyone. Only you can decide if Aikido offers what you are searching for. What makes Mushin Dojo the best martial arts school? Mushin Dojo stands out as the best martial arts school due to our dedication to traditional Aikido teachings combined with modern martial arts practices. Our expert instructors guide students through a curriculum that fosters physical fitness and personal development. The inclusive, community-driven atmosphere ensures all members feel valued and supported. Whether you're seeking improved self-defense skills or personal growth, Mushin Dojo offers a path to success. Join us for a class and experience why we're the best choice for martial arts training. How can kids benefit from martial arts classes at Mushin Dojo? Our kid's martial arts classes at Mushin Dojo are designed to inspire confidence, improve focus, and teach valuable life skills. Through Aikido, children learn discipline, respect, and coordination in a fun and supportive environment. These classes help develop physical strength and mental resilience, equipping kid's with the tools to succeed both on and off the mat. Ready to see your child's confidence soar? Enroll them in our kid's martial arts classes today. What should a beginner expect from karate classes at Mushin Dojo? Beginners joining our karate classes at Mushin Dojo can expect a welcoming environment that emphasizes foundational techniques in striking and movement. Our classes blend karate principles with Aikido’s focus on harmony and respect, ensuring a comprehensive introduction to martial arts. Beginners will develop skills that improve physical fitness and instill a sense of discipline and focus. Take the first step on your martial arts journey by signing up for a karate class today. Are self-defense classes at Mushin Dojo suitable for all skill levels? Yes, our self-defense classes are designed for individuals of all skill levels. We focus on Aikido's core principles of redirection and balance, teaching non-aggressive techniques applicable in real-world scenarios. These classes build confidence and enhance awareness, making them ideal for anyone looking to learn effective self-defense without resorting to aggression. Discover how our self-defense classes can empower you by joining us for a session and taking charge of your safety. How can I get in touch? When you're ready to get started with us, feel free to give us a call at 407-435-9924 , send an email to Aikido101@me.com , or use our online contact form . We look forward to your inquiry! Martial Arts Classes REGISTER TODAY Contact Info Phone: 407-435-9924 Email: Aikido101@me.com © 2025 All Rights Reserved | Mushin Dojo Share by:"
    },
    {
      "url": "https://brottar.com/pages/contact",
      "text": "Contact BROTTAR: Get in Touch for Premium Service & Inquiries\n – BROTTAR® OFFICIAL Skip to content Great news! Shipping is now available to Canada & the UK! 🚚✨ Shop now! Home Contact Wholesale About Us FAQs Log in Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Home Contact Wholesale About Us FAQs Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Search Log in Cart Item added to your cart View cart Check out Continue shopping Contact We’d Love to Hear From You At BROTTAR, we value every question, comment, and piece of feedback from our customers. Whether you’re curious about our products, need assistance with your order, or simply want to share your thoughts, our dedicated team is here to help. Multiple Ways to Connect Email: For prompt support, drop us a message at Contact@brottar.com . Contact Form: Fill out our online form available on this page for quick inquiries and we’ll get back to you within 24 hours. Customer Support: Our dedicated support team is available during business hours to provide personalized assistance and ensure your satisfaction. Our Commitment to You We believe in building lasting relationships with our customers through transparency, responsiveness, and exceptional service. Every inquiry is important, and we strive to ensure that your experience with BROTTAR is seamless and satisfying. Visit Our Website Explore our online catalog and discover how our premium products can elevate your living space. We’re here to assist you every step of the way—from product selection to post-purchase support. Thank you for choosing BROTTAR. We look forward to connecting with you! Contact form Name Email * Phone number Comment Send Support About Us Shipping & Delivery Return & Refund Policy Terms & Conditions Privacy Policy Wholesale FAQs Blog At BROTTAR, every detail matters. Founded by visionary entrepreneurs with a passion for design and excellence, our brand was born out of the desire to merge artistic innovation with everyday functionality. Our journey began with a single idea: to redefine the way you display your most cherished items. Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Payment methods PayPal Venmo © 2025, BROTTAR® OFFICIAL Powered by Shopify Privacy policy Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/environmental-management/sustainability-and-resilience/lec/",
      "text": "Lyonia Environmental Center Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Calendar of events Camps, Programs and Field Trips Lyonia In Depth Lyonia Preserve Rent the Amphitheater Visit the Center Volunteer opportunities Christie Miller Lyonia Environmental Center Manager clmiller@volusia.org Lyonia Environmental Center 2150 Eustace Ave. Deltona, FL 32725 Phone: 386-789-7207, ext. #21028 Samantha J. West Sustainability and Resilience Manager swest@volusia.org Lyonia Environmental Center Home | Departments and Divisions | Growth and Resource Management | Environmental Management | Sustainability and Resilience | Lyonia Environmental Center Where Learning Comes Naturally! Lyonia Environmental Center offers a unique insight into Volusia County’s fragile ecosystems. Staff will take you through the center, where you can learn about the environment through interactive hands-on displays and computer modules. TOUR the Center Learn about the endangered Florida scrub jay Meet our animal ambassadors Test your water knowledge View our 425-gallon saltwater aquarium. Learn More EXPLORE the Preserve Experience the scrub habitat. Look for Florida scrub jays, gopher tortoises and other animals that live in scrub. Have lunch in our pavilion. Learn More ATTEND a Program Programs for families, adults, scouts and homeschoolers School field trips Summer camps Annual Wildlife Festival Learn More Admission: FREE! Hours: Closed Mondays Tuesday - Saturday: 9 a.m. to 4 p.m. Sundays: 10 a.m. to 4 p.m. Location: 2150 Eustace Ave., Deltona, FL 32725 ( Location Map ) Interested in becoming a volunteer? Learn more ! How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    }
  ]
}