{
  "fuentes": [
    {
      "url": "https://www.craftybastards.com/contact",
      "email": "info@craftybastards.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.wcjb.com/2025/02/06/florida-man-visits-local-bottle-shop-beer-tasting/",
      "email": "publicfile@wcjb.com"
    },
    {
      "url": "https://www.unitedwayncfl.org/small-business-partner-crafty-bastards",
      "email": "dclayton@unitedwayncfl.org"
    },
    {
      "url": "https://www.restaurants.com/gainesville-florida/crafty-bastards-restaurant-pub-364750",
      "email": "amiller@hilcoglobal.com"
    },
    {
      "url": "https://www.groupon.com/biz/gainesville/crafty-bastards",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://randombastards.com/pages/contact-us",
      "email": "header_180x@2x.png"
    },
    {
      "url": "https://randombastards.com/pages/contact-us",
      "email": "info@randombastards.com"
    },
    {
      "url": "https://www.knoxnews.com/story/entertainment/dining/2025/01/13/crafty-bastard-brewery-closes-south-knoxville-taproom-at-baker-creek/77595797007/",
      "email": "joanna.hayes@knoxnews.com"
    }
  ],
  "mails": [
    "amiller@hilcoglobal.com",
    "dclayton@unitedwayncfl.org",
    "header_180x@2x.png",
    "info@craftybastards.com",
    "info@randombastards.com",
    "info@scibpaints.com",
    "joanna.hayes@knoxnews.com",
    "publicfile@wcjb.com",
    "verify@r.groupon.com"
  ],
  "nombre_sitio": "thecraftybastards.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.craftybastards.com/contact",
      "text": "Contact Us — Crafty Bastards Arts & Crafts Fair Cart 0 Be A Vendor Apply FAQs Past Fairs Summer 2025 Fair Back Fall 2024 2024 Summer Vendors 2024 Spring Vendors 2023 Fall Vendors 2023 Summer Vendors 2023 Spring Vendors 2022 Fall Vendors 2022 Spring Vendors 2025 Spring Vendors Back Info 2025 Summer Vendors Food & Drink Vendor Map Cart 0 Be A Vendor Apply FAQs Past Fairs Fall 2024 2024 Summer Vendors 2024 Spring Vendors 2023 Fall Vendors 2023 Summer Vendors 2023 Spring Vendors 2022 Fall Vendors 2022 Spring Vendors 2025 Spring Vendors Summer 2025 Fair Info 2025 Summer Vendors Food & Drink Vendor Map #CraftyBastards Contact Us Interested in sponsoring Crafty Bastards or learning more about being a vendor? Perhaps you want to attend or volunteer and have a question. Feel free to reach out! NOTE: Please note that we are not accepting applications or inquires for any additional vendor positions, food trucks or sponsors for our Spring 2022 Fair as our event is fully booked. If you’re interested in joining us, applications for our Fall 2022 festival will open up in mid/late April, after our spring fair has concluded. For information on how to become a vendor, make sure you have checked out our FAQ page first! Name * First Name Last Name Email * Subject * Message * Thank you! Crafty Bastards Arts & Crafts Fair info@craftybastards.com Hours Instagram Facebook Twitter Contact Us #CraftyBastards22 Powered by Squarespace"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.wcjb.com/2025/02/06/florida-man-visits-local-bottle-shop-beer-tasting/",
      "text": "Florida Man visits local bottle shop for beer tasting Skip to content Download Apps Newsletter Tell Us Something Good Be Our Guest Meet the Team Advertise with Us Submit Photos and Videos Watch Live Video News First Alert Weather Sports Features Hurricane HQ Telemundo Contact Us Community InvestigateTV Home Watch Live News Gainesville Ocala Lake City State National Crime Politics Education Health Good News Sponsored First Alert Weather Hurricane HQ 24/7 Live Weather Radar Weather Maps Forecast Graphics Tropics Graphics First Alert Explained Weather 101 Sports Florida Gators High School Scholar Athlete Russell Report TV20 Coaches Spotlight Junior College Chomp List Submit Your Sports Photos Español Contact Us News Tips Meet the Team Download Our Apps Advertise Employment Advertise Features Bright Futures One Class at a Time Hometown Heroes Paige's Kitchen Tech Tuesday FL Man Adventures Adopt A Pet Wildlife Wednesday Fitness Community Community Calendar Contests TV20 Newsletter Sign-Up Submit Photos and Videos Tell Us Something Good Programming Schedule Zeam - News Streams Gray DC Bureau NextGen TV Zeam - News Streams InvestigateTV Watching Your Wallet Be Our Guest Sky20 Drone Your Local Chamber Your Local Experts HealthCARES Watch ABC Online PowerNation Circle Country Digital Marketing Florida Man visits local bottle shop for beer tasting Crafty Bastards Restaurant and Bottle Shop have been serving up delicious craft beer for over a decade. By WCJB Staff Published : Feb. 6, 2025 at 5:52 PM EST Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn GAINESVILLE, Fla. (WCJB) - On this installment of Florida man adventures we are here in Gainesville at Crafty Bastards Bottle Shoppe where we will be tasting some free beer. Let’s check it out. Crafty Bastards Restaurant and Bottle Shop have been serving up delicious craft beer for over a decade. They pride themselves on having a massive selection with thousands of beers and wines to choose from. “We have many different varieties of beer from around the world. Imports, domestics, we sell everything individually so you can pick and choose from what we have available here, one beer at a time, build your own six pack or so,” said Jeffery Brunson, manager at Crafty’s. Once a week Crafty’s Bottle Shoppe brings in beer, that’s my favorite flavor: free! “Every Thursday from 6 to 8 p.m. we offer a free beer tasting, different breweries battling to get over here and pour beer for everybody,” said Brunson These tastings are a great way to learn about craft beer and fine tune your personal taste. Exploring different types of beer is the name of the game. “If we have a brewery showing up, what we will have is their variety of beer available from the distributor. Which will consist of different styles of beer. When we are hosting, we will pick a specific style, then pick an assortment of beers from that style for you to get a feeling of what’s going on there,” said Brunson Every week dozens of people come and study these premium suds, with their taste buds. So, in the spirit of academia, you should too. For more information on Crafty Bastards Bottle Shoppe click here , for TV20 News, I’m Adam Pittman, and this has been Florida Man Adventures. RELATED: Florida Man revs his engine at All-Tech Raceway in Lake City Click here to subscribe to our newsletter. Copyright 2025 WCJB. All rights reserved. Most Read 3 killed after semi-truck does U-turn on Florida Turnpike 9-year-old arrested for bringing loaded gun on school bus in Ocala 16-year-old girl dies after crashing into semi-truck on US Highway 19 Deputies break up fights after hundreds crowd Dixie County bar, investigation underway Columbia County firefighter, wife arrested on child porn, bestiality charges Students walk out in support of Gainesville High School teacher accused of bullying Accident on US Highway 19 claims life of 16-year-old Dixie County student Class action lawsuit against UF will now proceed after the University withdrew its request for an appeal Latest News Archaeologists dig up more human remains at Cedar Key home Man found guilty of attempted murder of law enforcement set to serve three life sentences Man found guilty of attempted murder of law enforcement set to serve three life sentences Marion County School Board members hire search firm to help find next superintendent Marion County school board members hire search firm to help find next superintendent Community comes together to mourn Savannah Langford, reads one of her poems Archaeologists dig up more human remains at Cedar Key home Reddick-Collier VPK scores highest in the state News First Alert Weather Sports Livestream Contests Contact Us WCJB E-News WCJB 6220 NW 43rd Street Gainesville, FL 32653 (352) 377-2020 Public Inspection File publicfile@wcjb.com -  (352) 416-0610 Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Closed Captioning/Audio Description Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "https://www.unitedwayncfl.org/small-business-partner-crafty-bastards",
      "text": "Small Business Partner - Crafty Bastards | United Way of North Central Florida Skip to main content Main Menu About Our Work Financial Security ALICE VITA Healthy Community SingleCare Youth Opportunity Grade Level Reading ReadingPals Community Resiliency 211: Get Connected. Get Help. Disaster Resources Emergency Food & Shelter Tri-County Disaster Recovery Community Investments Get Involved Give Back Donate Planned Giving Partner Small Business United Volunteer News Events Tuxedo T-shirt Gala Holiday Luncheon Light Up Tioga Search Search Header Buttons Donate Volunteer Main Menu About Our Work Financial Security ALICE VITA Healthy Community SingleCare Youth Opportunity Grade Level Reading ReadingPals Community Resiliency 211: Get Connected. Get Help. Disaster Resources Emergency Food & Shelter Tri-County Disaster Recovery Community Investments Get Involved Give Back Donate Planned Giving Partner Small Business United Volunteer News Events Tuxedo T-shirt Gala Holiday Luncheon Light Up Tioga Small Business Partner - Crafty Bastards Betty Brunson, Owner of Crafty Bastards 1. Tell us about your business and your business philosophy: It started with a very crafty idea.  “Open a pub!” they said. “It will be fun!” they said. That was an understatement! When we opened our pub, The Crafty Bastards, in 2015, people often asked us, “What made you retire to do this?”  Our answer was simple: It’s what we’ve always wanted to do! We felt the northwest area of Gainesville needed a local, convenient, quality craft beer pub that included a small selection of fresh, made to order, food to complement the beverages.  Three years later, The Crafty Bastards is known as a full-service restaurant and pub that provides a family-friendly and fun environment. And, we even added a craft beer bottle shop right next door last year! Our business philosophy is to achieve excellence in all we do, customer service, food preparation, cleanliness, etc. And we know to accomplish that, we need to support our team in becoming the best they can be both professionally and personally. We are also committed to supporting other local businesses, local breweries, local produce etc.  We partner with Gainesville Harley-Davidson’s Chili Cook-off. We pay the winner of the cook-off $500 to use their chili recipe for one year in the restaurant. 2. Why are you passionate about your commitment to United Way’s Community Investment Fund? I started my career at Publix and had the opportunity to learn about United Way and donate through payroll deduction. As a small business owner, I am committed to supporting the community, but lack the time to volunteer. By donating to United Way, I know I am assisting local initiatives that work to help make our community stronger. 3. What is something interesting or surprising that most people don’t know about you? I own and ride a Harley Davidson motorcycle. 4. What would your older self tell your younger self? So many things, but then again, I wouldn’t be who I am today without the challenges and blessing I have received in the past.  I am very grateful for the journey my life has given me. 5. Favorite quote: “Don’t lower your standards because others won’t raise theirs.” Small businesses play a critical role in maintaining a thriving local economy. They are no less important to the success of United Way, as we endeavor to improve lives through our work in education, health and financial stability. Our Small Business Partners are an important, growing family of donors, who are vital to helping us meet the needs of our community. To learn more about how you and your business can support United Way, contact Dana Clayton at dclayton@unitedwayncfl.org or (352) 333-0846 . Click here for more Small Business Spotlights. Click here for our Small Business Spotlight directory. Improving lives by mobilizing the caring power of communities. Donate Connect 6031 NW 1st Place Gainesville, FL 32607 352-331-2800 About Our Mission and Values Our Board of Directors Our Staff Careers Public Reporting Login Our Work Impact Areas Volunteer Contact Us © United Way of North Central Florida . All Rights Reserved. Website by: OneEach Technologies"
    },
    {
      "url": "https://www.restaurants.com/gainesville-florida/crafty-bastards-restaurant-pub-364750",
      "text": "Crafty Bastards Restaurant & Pub in Gainesville, Florida: information, coupons, menu and ratings Restaurants.com by location by category about us Find the best restaurants near you We are entertaining serious, bonafide offers for the Restaurants.com domain name. \n            Please contact Andrew Miller for more information. Crafty Bastards Restaurant & Pub Address 4860 NW 39th Ave, Gainesville, Florida, 32606 Closed Sunday 11:00 12:00 Monday 11:00 12:00 Tuesday 11:00 12:00 Wednesday 11:00 12:00 Thursday 11:00 12:00 Friday 11:00 12:00 Saturday 11:00 12:00 Good For Party Features Reservations Alcohol Parking Wheelchair Credit Cards Wifi Takeout Cuisines Organic About Crafty Bastards Restaurant & Pub Our Craft Beer Restaurant/Pub is enjoyable for everyone. From our unique kids menu and games to our 23 large TV's showing nearly all your favorite sports. Live Entertainment Thursday, Friday and Saturday 7p-10p featuring many of your favorite entertainers! TRIVIA Tuesday's 7p with Chris Bryant KARAOKE Wednesday's 7p with Mr. October Bring your friends and family, and have a fantastic evening out! Related restaurants in: Florida , Gainesville Curia On The Drag 2029 North West 6th Street Domino's Pizza 2106 SW 13th St Croutons 686 Museum Rd +1 352-872-5970 Visit Website by category by location About us Privacy policy Copyright © 2017. All Rights Reserved. All deals are provided by a third party service. Images may not represent the actual restaurant and/or food available at the selected restaurant."
    },
    {
      "url": "https://www.groupon.com/biz/gainesville/crafty-bastards",
      "text": "The Crafty Bastards Restaurant & Pub, 4860 Northwest 39th Avenue, Gainesville, FL - Groupon Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home The Crafty Bastards Restaurant & Pub, Gainesville The Crafty Bastards Restaurant & Pub, Gainesville 4860 Northwest 39th Avenue, Gainesville, FL 32606 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? How to reach us © MapTiler © OpenStreetMap contributors The Crafty Bastards Restaurant & Pub 891.4 mi 4860 Northwest 39th Avenue, Gainesville, FL 32606 Closed Opening at 11:00 AM Closed Opening at 11:00 AM Call Directions Visit website +13528725970 http://thecraftybastards.com About The Crafty Bastards Restaurant & Pub Hungry? Get ready to lick your plate clean at Crafty Bastards in Gainesville. Not to be overlooked is Crafty Bastards' no-charge wifi. Prepare to face the crowds if you visit on the weekend ? Friday and Saturday are Crafty Bastards' busiest days. You can call it in, then carry it out. At Crafty Bastards, diners can score a guaranteed parking spot close to the restaurant. Crafty Bastards makes bikers feel at ease with the multiple storage racks outside. Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    },
    {
      "url": "https://randombastards.com/pages/contact-us",
      "text": "Contact\n    \n    \n    \n      – Random Bastards Skip to content Submit Close search Home Shop expand collapse Shop ALL PRODUCTS NEW VINYLS HOODIES TEES SWEATS HATS PANTS RANDOM SKATE RUGS Music Looks Events About Contact Home Shop ALL PRODUCTS NEW VINYLS HOODIES TEES SWEATS HATS PANTS RANDOM SKATE RUGS Music Looks Events About Contact Submit Search Log in Cart Cart expand/collapse Contact Want to get in touch? For questions, booking inquiries, feedback, ideas or other reasons, please contact us at info@randombastards.com or through the form below. Our ambition is to answer you within 24 hours on weekdays. Name Email Message Search All products Contact Music About RB Refund policy Terms of Service Join our mailing list Subscribe Facebook Twitter Instagram YouTube © 2025, Random Bastards Powered by Shopify"
    },
    {
      "url": "https://www.knoxnews.com/story/entertainment/dining/2025/01/13/crafty-bastard-brewery-closes-south-knoxville-taproom-at-baker-creek/77595797007/",
      "text": "Crafty Bastard Brewery closes South Knoxville taproom at Baker Creek News Sports Business Go Knoxville Shopper News Advertise Obituaries eNewspaper Legals DINING Under a new structure, Crafty Bastard Brewery closes South Knoxville taproom. What's next? Joanna Hayes Knoxville News Sentinel Correction: A previous version of this report misstated Crafty Bastard Brewery founder Aaron McClain's role under restructured ownership. Majority owner Scott Sherrill will take over operations in a public-facing role for the business. McClain will remain as a minority owner. Crafty Bastard Brewery has closed its taproom at Baker Creek Bottoms, one of three taprooms for one of Knoxville's original craft breweries, whose flagship Emory Place location has been serving customers since 2015. It was fall 2023 when Crafty Bastard opened this third location inside a former South Knoxville church, which has been undergoing redevelopment since 2017 to create a mixed-use community of shops and restaurants tied to adjacent Baker Creek Preserve bike trails. Crafty Bastard founder Aaron McClain told Knox News just before opening that branching out with multiple locations was never part of his original plans. \"I thought we were starting just a small little grungy warehouse where we were going to make some cool beers and make enough money to pay my bills, hopefully,\" he said in 2023. But the brewery has experienced major changes since then, namely that McClain is no longer ownership's face of the brewery. Majority owner Scott Sherrill has taken over operations, which included shutting down the South Knoxville branch. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. \"Aaron has always been a non-majority owner, for as long as I have been involved. Aaron is no longer involved in any Crafty operations or decision,\" Sherrill told Knox News via text. \"There's no doubt as to Aaron's creative talents - if there is a way to one day harness those talents in a limited capacity, we both remain open to that. However, we have no plans to that effect at the moment.\" Sherrill did not disclose what exactly led to the closure − only that the decision allows Crafty Bastard to focus \"on what has made our customers happiest: providing our fans and community with the best beer in Knoxville,\" he said, noting the decision was made at the end of 2024. The taproom had church pews inside for seating. While no beer was made on site, Crafty Bastard maintained 14 rotating taps and offered to-go beer. It also had food made exclusively for the brewery by neighboring 71 South, the restaurant anchor of the church property. \"The thing I do want to say is just how much this space has been rehabilitated. This was not a church. The church is the people,\" McClain previously told Knox News. \"This building has been left to rot for 30 years and was this close to being unrecoverable.\" With space to seat 70 people inside the taproom, along with overflow seating and outdoor spaces that could accommodate 65 more, McClain saw the space becoming a gathering place for South Knoxville residents. These 4 local breweries are 2025 World Beer Cup winners. See which brews came out on top First big event set for Smokies stadium brings loads of beer to the ballpark: Cheers, Xul! Local 'Steel Arm' lager at Smokies stadium to honor Negro-League Giants of 1920s Knoxville More PB&J Mixtape? What Xul Beer Company's deal with Fanatic means for local fans What's that being built next to Xul's downtown Knoxville brewery? Beer fans: It's for you! Full Stocking: A new Alliance beer is part of a century-old Knoxville holiday tradition Tip your server and enjoy a Smokies stadium tip to save money on the best drinks we tried Crafty Bastard's flagship location at 6 Emory Place and its West Knoxville location at 9937 Kingston Pike remain open. \"In 2025, we will be continuing to release new, unique beers and reinvesting in our customer experience at our existing locations downtown and West,\" Sherrill said. Joanna Hayes is the restaurant and retail reporter. Email: joanna.hayes@knoxnews.com . Support strong local journalism by subscribing at subscribe.knoxnews.com. Staff Directory Careers Accessibility Support Sitemap Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds 10BEST Shopping LocaliQ Digital Marketing Solutions © 2025 www.knoxnews.com. All rights reserved."
    }
  ]
}