{
  "fuentes": [
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "gmercier@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "jdecker@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "jkeller@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "jzimbelman@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "kwelton@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "mbrown@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "mjohnson@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "mmota@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "mschawartz@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "nvanhook@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "rhall@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "sfreese@hillcrestcountryclub.com"
    },
    {
      "url": "https://www.ocala.com/news/20180410/refresh-for-country-club-of-ocala",
      "email": "jim.ross@starbanner.com"
    },
    {
      "url": "https://ccomc.org/who-we-are/",
      "email": "info@ccocala.org"
    },
    {
      "url": "https://www.ocalamarion.com/directory/country-club-of-ocala/",
      "email": "exploreocalamarion@marionfl.org"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "andrea.schaefer@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "brooke.tyler@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "david.sizelove@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "jason.lippy@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "jesse.regalado@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "menno.ozinga@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "mitchell.putnam@clubcorp.commitchell"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "mitchell.putnam@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "robin.kremen@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "annemarie.mckay@invitedclubs.com"
    },
    {
      "url": "https://www.ocala.com/story/business/2017/01/04/country-club-of-ocala-new-owner-new-approach/22812077007/",
      "email": "fred.hiers@ocala.com"
    },
    {
      "url": "https://www.ocala.com/story/business/2017/01/04/country-club-of-ocala-new-owner-new-approach/22812077007/",
      "email": "fred.hiers@starbanner.com"
    }
  ],
  "mails": [
    "andrea.schaefer@invitedclubs.com",
    "annemarie.mckay@invitedclubs.com",
    "brooke.tyler@invitedclubs.com",
    "david.sizelove@invitedclubs.com",
    "exploreocalamarion@marionfl.org",
    "fred.hiers@ocala.com",
    "fred.hiers@starbanner.com",
    "gmercier@hillcrestcountryclub.com",
    "info@ccocala.org",
    "jason.lippy@invitedclubs.com",
    "jdecker@hillcrestcountryclub.com",
    "jesse.regalado@invitedclubs.com",
    "jim.ross@starbanner.com",
    "jkeller@hillcrestcountryclub.com",
    "jzimbelman@hillcrestcountryclub.com",
    "kwelton@hillcrestcountryclub.com",
    "mbrown@hillcrestcountryclub.com",
    "menno.ozinga@invitedclubs.com",
    "mitchell.putnam@clubcorp.commitchell",
    "mitchell.putnam@invitedclubs.com",
    "mjohnson@hillcrestcountryclub.com",
    "mmota@hillcrestcountryclub.com",
    "mschawartz@hillcrestcountryclub.com",
    "nvanhook@hillcrestcountryclub.com",
    "rhall@hillcrestcountryclub.com",
    "robin.kremen@invitedclubs.com",
    "sfreese@hillcrestcountryclub.com"
  ],
  "nombre_sitio": "thecountryclubofocala.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "text": "Our Staff - Hillcrest Country Club Member Login Golf Aquatics Tennis Clubhouse Membership Weddings Our Staff Menu Golf Aquatics Tennis Clubhouse Membership Weddings Our Staff Member Login Meet Our Staff Clubhouse Manager Joey Decker | 531-500-5460 jdecker@hillcrestcountryclub.com Golf Operations Mike Brown | 531-500-2781 mbrown@hillcrestcountryclub.com Golf Operations Sonya Freese | 402-489-7164 sfreese@hillcrestcountryclub.com Office Manager/Membership Director Jessica Zimbelman | 531-500-5730 jzimbelman@hillcrestcountryclub.com Aquatics Director Jeanette Keller | 402-489-1846 jkeller@hillcrestcountryclub.com Racquet & Fitness Director Maria Mota mmota@hillcrestcountryclub.com Member Relations Director Nicole Van Hook | 402-489-7113 nvanhook@hillcrestcountryclub.com Executive Chef Marcus Johnson | 402-489-7111 mjohnson@hillcrestcountryclub.com Assistant Golf Professional Kelley Welton | 402-489-8181 kwelton@hillcrestcountryclub.com Superintendent Robert Hall | 531-230-1009 rhall@hillcrestcountryclub.com Assistant Superintendent Kal Knorr Events Director Gabby Mercier | 531-500-3134 gmercier@hillcrestcountryclub.com 9401 O Street Lincoln, NE 68520 main: (402) 489-7111 • fax: (402) 489-7123 © Copyrighted by Hillcrest Country Club Powered by Northstar Technologies Inc"
    },
    {
      "url": "https://www.ocala.com/news/20180410/refresh-for-country-club-of-ocala",
      "text": "Refreshed News Sports Entertainment Lifestyle Advertise Obituaries eNewspaper Legals LOCAL Refreshed Jim Ross jim.ross@starbanner.com Almost a year and a half has passed since the Country Club of Ocala was sold and the new owners promised significant upgrades to the golf course, clubhouse and other facilities. While the revamp remains a work in progress, the reports so far are positive. “I just think they’ve done an amazing job,” said Patrick Piper, a four-year club member. “The improvements, especially to the greens, have been night and day,” said Byron Hobson, also a member. Both men serve on an advisory board that meets monthly with Peter Tschernitz, the general manager tasked with overseeing the club and building its new culture, which puts a premium on customer service. Jacksonville-based CCO Hospitality, LLC, bought the 23-year-old club in December 2016. Its corporate sibling, Hampton Golf Clubs, also based in Jacksonville, was announced as the club’s new operator. In December 2017, CCO Hospitality was reformed to provide a 20 percent ownership stake to Hampton Golf, Inc., and an 80 percent stake to RF Ventures V LLC, headed by Randy Frankel, a financier who is part owner of the Tampa Bay Rays. Phase One of the Country Club of Ocala refurbishing project focused on the clubhouse, tennis courts and pool area. The banquet hall also was spruced up. “Everything needed a refresh,” said Dan Peters, a five-year club member who also sits on the advisory board. Next up was the golf course, which was closed roughly between May and October 2017. Tee boxes, sand traps and all greens were redone. All palm trees were removed (they soak up an undue amount of water and actually aren’t trees, strictly speaking, management notes.) More than 100 other trees that were diseased, dying, or impeding play also got the ax. Hurricane Irma had a hand in taking out many other trees. The new-look course is more playable, which helps pace of play. Some bunkers were removed, which makes scoring a bit easier for the average golfer. But the greens are bigger, more contoured and eventually will be faster — all factors that will challenge more skilled players. “The course looks phenomenal,” Piper said. “It’s still the best layout in Marion County,” Peters added — and this in a town that also is home to Golden Ocala and Adena. The 18-hole track will be put to the test on May 31, when the country club hosts sectional qualifying for the 39th U.S. Senior Open Championship. The current point of emphasis is upgrading food and beverage service. A new manager of that department started this week. Tschernitz, who has been on the job just three months, is eager to make a mark in this area. “We are in the service industry,” he said during an interview last week. It’s important to listen to members, fulfill their expectations, and thus infuse new energy into a membership that had been concerned about the club’s look and feel. “Our members see the improvement…they appreciate that,” said Tschernitz, who is a veteran in the golf management industry and most recently worked in Southwest Florida. There is special attention paid to families and a real effort to provide something of interest for all ages. “Word of mouth is the strongest marketing tool,” Tschernitz said. Also helpful is allowing people to have a test run. To that end, the club is offering summer and other trial membership packages. In addition to serving on the club advisory board, Hobson and Piper also serve on the property owners association board. They appreciate what Tschernitz and the new ownership have accomplished so far and admire their dedication to continued improvement. “They’ve been very responsive,” Hobson said. Peters notes that the club’s original ownership team deserves credit. “They did a wonderful thing for this community,” he said. “It’s a wonderful place.” The ownership and management resets took some getting used to, and it’s easy to understand why. Before, all decisions were made locally; then, for a time, none were made locally, as the once stand-alone club became part of a bigger, Jacksonville-based corporate family. But now Tschernitz is on site, the major structural improvements have been made, and the new culture is taking hold. Tschernitz’s message to the club's 350 members: “You need to go out there and spread the word.” Contact Jim Ross at 671-6412 or jim.ross@starbanner.com. Follow him on Twitter @jimrossOSB Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.ocala.com. All rights reserved."
    },
    {
      "url": "https://ccomc.org/who-we-are/",
      "text": "Who We Are - Christ's Church of Ocala Who We Are Beliefs Core Values Our Story What to Expect Give Watch Plan Your Visit More Calendar Ministries Who We Are Learn About the Faith, Values, and Mission That Unites Us At Christ’s Church Ocala, we are more than just a gathering of believers; we are a family united by a common purpose and a deep commitment to our faith. Our church is a place where people of all backgrounds come together to worship, grow, and serve. We are passionate about helping others find and follow Jesus, and we invite you to learn more about what makes us who we are. Our Beliefs God We believe in one supernatural Being – God – who expresses Himself in three personalities known as Father, Son, and Holy Spirit.  These three are co-equal and each possesses all the attributes of Gods. Genesis 1:1, 26-27; Psalm 90:2; Matthew 28:19; 2 Corinthians 13:14 Jesus Jesus of Nazareth was and is the Son of God.  He is one with God the Father and the Holy Spirit.  He was that Agent of Creation,  the Messiah, Savior, Redeemer, Lord of lords and King of kings.  He was born of a virgin, lived a sinless life, was crucified on a cross and was raised from the dead to verify His identity as God’s Son and demonstrate His victory over sin and death.  He ascended to heaven and will return in power and glory at God’s appointed time. Matthew 1:22-23; John 1:1-5; Hebrews 4:14-15; Acts 1:9-11; 1 Corinthians 15:3-4; Colossians 2:9-10; 1 Timothy 6:14-15; Revelation 19:16 Holy Spirit The Holy Spirit dwells within each person who embraces Jesus as Savior and Lord.  He is our comforter, our guide, and the very presence of God alive in all who are God’s children. Acts 1:8; John 14:16-17; Galatians 5:25; 1 Corinthians 2:12, 3:16; Ephesians 1:13; 2 Corinthians 13:14; 1 Peter 1:2 The Bible We believe the Bible is God’s revelation of Himself to humankind.  It does not tell us everything about God, but it tells us what we need to know in order to have a personal relationship with Him.  We believe the Bible is inspired (God-breathed), without error in its original composition, and our ultimate authority in all Christian beliefs and practices. 2 Timothy 3:16; 2 Peter 1:20-21; Psalm 12:6, 119:105 Humanity All people are created in the image of God.  Adam and Eve rebelled against God and were disobedient to His instructions, opening the doors of sin and death for all humanity.  All of us have sinned and are, thus, in need of a Savior. Genesis 1:27; Isaiah 53:6, 59:1-2; Romans 3:23; Colossians 2:13-15 Eternity God created people to live forever.  Every person’s soul will exist forever in heaven with God by the grace provided by Christ, or  will exist forever separated from God in hell due to their rejection of His grace and refusal to follow Jesus. John 14:2-3; John 14:6; 1 Thessalonians 4:13-18; 2 Thessalonians 1:6-10; Revelation 20:11-15 Salvation A person’s salvation cannot be earned or purchased.  It is the free gift of God which was provided by the substitutionary death of His Son Jesus on the cross. There Jesus expressed God’s love for us by bearing the burden and penalty of sin for every person who would acknowledge Him as God’s Son and their Savior and Lord.  We appropriate the work of Christ unto ourselves by responding to what Jesus has done in the manner prescribed in the New Testament.  We come to faith – believing that Jesus was and is the Son of God – and we publicly acknowledge Him as such.  We repent of our sin – expressing sorrow for our rebellion against God and committing to follow Jesus’ example in living to obey and glorify God.  We are baptized (immersed in water), submitting to the burial of the old person of sin, being raised to walk in a new way of life because the Holy Spirit has been given as God’s abiding presence within us. John 3:16; Matthew 10:32-33; Acts 2:36-38; 4:12; Romans 5:10, 6:1-5, 23; 10:10; Ephesians 2:8-10 The Church We believe in the church as described in the New Testament – founded on the Day of Pentecost, consisting of all followers of Jesus, existing in local assemblies called congregations.  We believe the church is to meet together regularly to worship, fellowship, learn, pray, and observe the Lord’s Supper (also known as communion).  We are to encourage one another, bear one another’s burdens, and serve the Kingdom of God by exercising the spiritual gifts God has given us.  We are to pursue holiness through our study of God’s Word.  We are to work together to fulfill the Great Commission (Matthew 28:19-20). Matthew 16:13-19; Acts 2:42-47; 1 Timothy 3:14-15; Romans 12:4-5; Colossians 1:17-20; Ephesians 2:19-22; 1 Peter 2:4-5; 1 Corinthians 12:12-26, 14:26; Hebrews 10:24-25; Revelation 21:2-3 Our Core Values Our core values reflect the principles that guide us in our mission to help people find and follow Jesus. These values shape our community and direct our efforts as we seek to live out our faith. We Value Our Relationship With God The congregation of Christ’s Church Ocala takes our relationship with God very seriously. We cannot and must not forget what made our salvation possible.  We were “bought with a price” (1 Corinthians 6:19-20 and 7:23).  We observe the Lord’s Supper weekly as a sober reminder that we have not paid the price of our sin – Jesus has paid that price!  Christianity is not a “casual” religion.  It is intense and sometimes difficult.  We believe our relationship with God is more important than any human relationship and must be continually cultivated as we seek to be His witnesses in a world that is turning more and more secular. We Value Our Brothers and Sisters in Christ Our congregation is a family!  We truly care about one another and seek to minister to one another. We honor every person who worships with us.  We cherish our friendships and our fellowship.  We value our brothers and sisters in Christ in other congregations.  We seek to collaborate with them and encourage them as we work together to share the good news of the Gospel.  We also recognize that we have brothers and sisters whom we have never met and probably will not meet until we get to heaven.  We value them and seek to bless them through our support of missionaries who serve in various places around the world. We Value Those Who Are Lost in Sin We value those who are lost in sin and do not yet know that in Christ they can find forgiveness of sins and eternal salvation. We do not want a single person in our various spheres of influence to be ignorant of the love of God and the love of God’s people.  Jesus said He had come to seek and save the lost (Luke 19:10). If Jesus so loved the lost, it is incumbent on those who are His church to love them, share the Gospel with them, and minister to them in His name.  This is expressed succinctly in Christ’s Church’s simple mission statement: Christ’s Church Ocala exists to help people find and follow Jesus. Our Story Christ’s Church Ocala (also known as Christ’s Church of Marion County) is part of a brotherhood of churches known as the Restoration Movement. This movement began more than two centuries ago in western Europe and on the western frontier of the United States.  The movement began with an appeal to unite on the basis of biblical truth, eschewing manmade creeds and rules.  The desire was to follow the pattern for the church that was established in the New Testament book of Acts.  The movement sought to unify by rejecting denominational structures and using the Bible alone as the foundation for faith and practice.  Still holding to those principles, Restoration Movement churches do not have a denominational structure or authority.  Each congregation is independent, selecting their own leaders.  Congregations are elder-led and congregationally governed.  Congregations are free to voluntarily cooperate with other congregations in endeavors such as sending missionaries, establishing educational institutions, and supporting benevolent ministries. Christ’s Church Ocala began in 2007 with a small group of faithful Christians who wanted to see another vibrant congregation established in the fast-growing southwest part of Marion County.  The congregation’s first minister was Jim Thompson.  Jim served from 2007 to 2009.  In 2009-10 a couple of interim ministers (David Graham and Ryan Loucks) served until David Bellows became the congregation’s second full-time minister in April of 2010.  During the next few years the congregation experienced great success in reaching out to the surrounding communities which were being built as Marion County experienced remarkable growth.  The congregation also worked diligently to pay off a mortgage that exceeded one million dollars.  By God’s grace and the generosity of God’s people, that mortgage was paid in full in 2022.  David’s labors continued through the Spring of 2022 when he retired and became the congregation’s Minister Emeritus.  In 2021 the church had been surveyed about how we would proceed after David’s retirement.  Specifically, did we want to remain a largely senior citizen congregation, or did we want to make very specific efforts to bring in younger families with children and teens? The congregation overwhelmingly voted to make concerted efforts to attract younger families with kids and teens.  Our first step was to hire a new lead minister.  We hired Ray Burhart (with wife Jessica and four children) to take that position in the Spring of 2022.  Since then we have added numerous staff members to lead in ministries to children, students, and seniors.  We have also added personnel to lead worship and to serve as office administrator.   We are very blessed to have such a talented and dedicated staff to lead us in our continuing efforts to proclaim the good news of Jesus in southwest Marion County. As we have opened new doors of ministry and God has blessed us with success in incorporating new people and families into the congregation, we have experienced the growing pains that we anticipated.  Changes to accommodate greater numbers of attendees on Sunday mornings have included offering two worship services, which are identical in format, and differing hours for Sunday School classes.  We look forward to the blessings that are in store as we continue to grow and expand our ministries to our community. Helping People Find and Follow Jesus. Learn Who We Are What to Expect More Connect Plan Your Visit Give Watch Calendar Ministries Plan a Visit Service Times Sunday at 9am and 10:30am 6768 SW 80th St Ocala, FL 34476 (352) 861-6182 info@ccocala.org © 2025 Christ's Church of Ocala . All Rights Reserved. Made awesome by Graphicten"
    },
    {
      "url": "https://www.ocalamarion.com/directory/country-club-of-ocala/",
      "text": "Country Club of Ocala | Ocala / Marion County Florida Skip to content 0 Saved Plan Your Trip Get Our App Equestrian Content Navigation Things to Do Equestrian Outdoor Adventures Indoor Adventures Shopping Arts & Culture Golf Agritourism Spas & Wellness Day Trips & Scenic Drives Events Annual Events Horse Shows & Events Submit Your Event Community Calendar Where to Stay Hotels & Motels Campgrounds & RV Parks Vacation Rentals Bed & Breakfasts Food & Drink Wineries, Breweries & Distilleries Plan Your Visit Transportation Weather & Avg Temperatures FAQs Area Vacation Guide OcalaMarion Travel Guide App E-Newsletter Signup Tropical Weather Updates Plan Your Trip Get Our App Equestrian Content Meetings & Events Blog Sports Events Weddings About Us Partners Download Vacation Guide Email Newsletter Signup Get Exclusive Deals Home Website Country Club of Ocala 6823 SE 12th Circle Ocala, Florida 34480 United States Details Open in Google Maps Map Country Club of Ocala 6823 SE 12th Circle Ocala, Florida 34480 (352) 237-6644 Share Virtual Tour Overview This course, designed by Steve Nugent, features deceptively generous fairways with numerous dog legs. CCO has hosted some of the most prestigious amateur events on the circuit, including the FSGA Championships, USGA Qualifiers, the annual Men’s SR/JR Invitational and others. Located seven miles south of downtown Ocala. Facility Features • Par 72 — 6,920 yards • Slope rating: 140 • Practice facilities double-tee driving range, putting green, chipping/pitching area • 5 sets of tees • Sloped fairways and undulating greens • Semi-private Start Planning Your Stay In Ocala Vacation Guide Email Newsletter Visitor Center 109 West Silver Springs Boulevard | Ocala, FL 34475 Phone (352) 438-2800 | 1-888-FL-OCALA About Us Blog Media Contact Us Tour Operators Terms of Use Partners Privacy Policy Accessibility ©2025 Ocala/Marion County Visitors and Convention Bureau This site uses cookies to provide you with an optimized experience. Privacy Policy Accept Quick Search Search Location Map"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "text": "Meet Our Dedicated Team | The Woodlands Country Club, TX × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Calendar Opens in new tab Member Login Find A Club Opens in new tab Careers The Woodlands Country Club Main Site Navigation Our Story Golf Amenities Membership Host An Event Join Now Host Event Contact Us Contact Us Login - Opens in new tab Menu Our Story Our Team Calendar Directions & Hours Golf The Refinery Insperity Invitational Lessons & Programs Tournament Course Player Course North Course West Course Palmer Course King General Deacon Amenities Racquet Sports Dining Blu Pool Fitness Membership Host An Event Tournaments & Outings Weddings Events Meetings & Corporate Event Rooms Contact Us Calendar Opens in new tab Member Login Find A Club Opens in new tab Careers Login - Opens in new tab Home Our Story Our Team Our Story Calendar Directions & Hours Meet Our Amazing Team David Sizelove Regional Manager Contact Me David.Sizelove Contact Me + Close David Sizelove information modal David Sizelove Regional Manager Serving since 2023 David.Sizelove David.Sizelove Contact Me Contact Me Menno Ozinga General Manager | Palmer Contact Me Menno.Ozinga Contact Me + Close Menno Ozinga information modal Menno Ozinga General Manager | Palmer Serving since 2023 Menno.Ozinga Menno.Ozinga Contact Me Contact Me Robin Kremen General Manager | The Trails Contact Me Robin.Kremen Contact Me About Robin + Close Robin Kremen information modal Robin Kremen General Manager | The Trails Serving since 2015 Robin.Kremen Robin.Kremen Contact Me About Robin Born in New Jersey. Moved to Houston in October 80Graduated Culinary Institute of America. Worked at Cellar in Sky World Trade Center, Sheraton Corporation, Junior League of Houston, Bon Appetite, Lakeside Country Club and Bay Oaks Country Club.Over Thirty years in Food Service13years as a Invited Employee.Team member Texas Chefs Association George W Bush Presidential inauguration reception, Economic Summit Rice University.Culinary Institute of America – Culinary Team Member25 years as a member Houston Livestock Show & Rodeo, Chairman 2 timeWife Tracy, son Gregory, Daughter ElizabethStarted at the Woodlands CC in February Contact Me Jesse Regalado Club Manager | Tournament Contact Me Jesse.Regalado Contact Me + Close Jesse Regalado information modal Jesse Regalado Club Manager | Tournament Serving since 2022 Jesse.Regalado Jesse.Regalado Contact Me Contact Me Amber Sickafoose Membership Director Contact Me 281-845-4886 Amber.Sickafoose Contact Me About Amber + Close Amber Sickafoose information modal Amber Sickafoose Membership Director Serving since 2010 281-845-4886 Amber.Sickafoose 281-845-4886 Amber.Sickafoose Contact Me About Amber Amber holds a BS degree in Marketing from Bellevue University. She started her career as a Director of Marketing for a financial company but quickly decided that sales was her real passion. Her golf career began in 2009 for The Woodlands Country Club as a membership director for both The Oaks and Panther Trail courses as well as The Woodlands Country Club courses. She is a very active member in the community and a graduate of Leadership Montgomery County class of 2013. Contact Me Jason Lippy Membership Director Contact Me 832-810-5876 Jason.Lippy Contact Me About Jason + Close Jason Lippy information modal Jason Lippy Membership Director Serving since 2015 832-810-5876 Jason.Lippy 832-810-5876 Jason.Lippy Contact Me About Jason Jason comes to Indian Wells Country Club by way of Desert Falls Country Club in Palm Desert, where he spent the four years as General Manager / Membership Director. Before moving to California in 2015, Jason spent the previous 12 years working as General Manager / Membership Director for Glen Oaks Country Club, a Invited Affiliate Club in Louisville, Kentucky. \n\nJason has worked in the golf business his entire career, starting in the Golf Shop at The Polo Fields Country Club when he was only 16.  He then moved to Glenmary Country Club to join the Membership Sales Department. Eventually becoming Club Manager at Glenmary Country Club.  Jason is a graduate of Western Kentucky University’s Broadcasting Department and has also worked covering college basketball and football for ESPN.  Jason’s interests include playing golf, spending time with his wife and eight year old daughter exploring the Coachella Valley. Contact Me Mitchell Putnam Membership Director Contact Me 832-810-5872 Mitchell.Putnam Contact Me About Mitchell + Close Mitchell Putnam information modal Mitchell Putnam Membership Director Serving since 2014 832-810-5872 Mitchell.Putnam 832-810-5872 Mitchell.Putnam Contact Me About Mitchell Email:  Mitchell.Putnam@clubcorp.comMitchell holds a BS degree in Criminal Justice from Sam Houston State University. He was born and raised in Houston Texas. He joined the Invited family as Service Captain at Willow Creek Golf Club in 2014, eventually becoming the Membership Director in 2017. He joined The Golf Trails of The Woodlands team in 2018 as the Membership Director. He enjoys playing golf, fishing, and watching Houston sports teams play. Contact Me Annemarie McKay Event Sales Director Contact Me 281-801-4103 Annemarie.Mckay Contact Me About Annemarie + Close Annemarie McKay information modal Annemarie McKay Event Sales Director Serving since 2015 281-801-4103 Annemarie.McKay 281-801-4103 Annemarie.McKay Contact Me About Annemarie Annemarie is originally from Allen, Tx. She holds a Bachelor’s degree in Hospitality Administration from Stephen F. Austin State University, located in the small town of Nacogdoches, Texas. Annemarie started her career with Invited as a college intern at Stonebriar Country Club in Frisco, Tx. After she graduated, she was hired on fulltime as their Private Event Coordinator assisting with corporate and social events. Annemarie then moved forward in here career and stepped into the role of Private Event Manager at the Las Colinas Country Club in Irving, Tx. There she continued to build her range of events and added Golf Tournaments to her portfolio. She had the privilege of working on events such as George W. Bush Presidential Center’s Warrior Open and the 2015 Volunteers of America North Texas LPGA Shootout. Annemarie recently moved to Houston to further pursue her passion for private events and is proud to call the Woodlands Country Club home, as their Private Event Director. Contact Me Brooke Tyler Event Sales Director Contact Me 281-339-8085 Brooke.Tyler Contact Me About Brooke + Close Brooke Tyler information modal Brooke Tyler Event Sales Director Serving since 2009 281-339-8085 Brooke.Tyler 281-339-8085 Brooke.Tyler Contact Me About Brooke Brooke Tyler is a graduate of The University of Texas at Arlington with a degree in Public Relations. She moved to the Houston Area in 2004 where she started her career in the hospitality industry. She worked for Marriott International for five years as an Event Manager planning various events ranging from corporate, social, to weddings. She began her career at The Woodlands Country Club in 2009 as an Event Manager where she planned Member Events, Member Association Events and Golf Tournaments. In 2012, she took over the Private Event Manager role where she focused on selling and executing all private events for The Woodlands Country Club. She has had the pleasure of working with many members, clients and brides to successfully implement their event. Some of her most favorite memories have been made at The Country Club. She has made some of her closest friendships while working here, as well as meeting her husband, Wes. Contact Me Andrea Schaefer Event Sales Coordinator Contact Me Andrea.Schaefer Contact Me + Close Andrea Schaefer information modal Andrea Schaefer Event Sales Coordinator Serving since 2024 Andrea.Schaefer Andrea.Schaefer Contact Me Contact Me Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Our Story Golf Amenities Membership Host An Event Contact Us THE WOODLANDS COUNTRY CLUB Opens in new window 100 Grand Fairway The Woodlands, TX \r\n                                77381 1 281-863-1400 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://www.ocala.com/story/business/2017/01/04/country-club-of-ocala-new-owner-new-approach/22812077007/",
      "text": "New owner, new approach News Sports Entertainment Lifestyle Advertise Obituaries eNewspaper Legals BUSINESS New owner, new approach Jacksonville-based operator plans more services for a wider demographic Fred Hiers fred.hiers@ocala.com The Country Club of Ocala is getting a $2 million infusion for repairs and upgrades under its new, Jacksonville-based ownership. CCO Hospitality, LLC has bought the 22-year-old club, according to Marion County Clerk of the Circuit Court records. Hampton Golf Clubs, also based in Jacksonville, will operate the club. Travis Norman is vice president of Hampton Golf Clubs and oversees the company’s golf course management and renovation projects. The company manages 26 courses in eight states, including Southern Hills Plantation in Brooksville. Norman said the plan is to have the Country Club of Ocala offer more services to a wider demographic. The old business plan of opening a golf course to an elite few is over, he said. Families have a wider variety of entertainment selections available to them and live more hectic lives. They want convenience and services that accommodate more members of their family. To that end, Norman said, Hampton is overseeing several projects to attract a wider clientele and catch up on some deferred maintenance. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. “We have a really strong lifestyle program, and we’re in an aggressive mode to attract new members,” Norman said. There are about 300 homes surrounding the course. The club currently has 280 members. You do not have to live at the country club in order to be a member. Hampton has a two-phase program to attract more members, get more of them to stay longer at the facility, and get them to make the club a greater part of their social lives. The first phase includes renovating the clubhouse, tennis courts and pool area, and upgrading the banquet hall. Some of that work is being done now and likely will be completed in the next 90 days. The second phase will begin in May and will focus on the golf course itself. The management company will change all greens to TifEagle grass, Norman said. The plan includes making the greens 15 percent to 20 percent larger and renovating the drainage systems for the bunkers. The course staff also will move about one-third of the bunkers. Moving the bunkers and trimming trees will make the course more enjoyable. “This is really a fantastic designed course, but the playability is (most important),” Norman said. While elite players can do well on the current layout, most amateurs have a difficult time with it. The goal is to make it enjoyable for all skill levels. “The challenge is still there, and when we get done with this, you can really have an enjoyable day of golf with friends and family,” he said. Norman said some of the company’s other clubs also offer the service of caring for members’ young children while the parents play golf or use the club’s other services. Hampton will look into offering that service here. The prices will remain the same, Norman said. The club charges $525 per month per family, which gives members full access to all amenities. A second option is $250 per month for access to the club’s fitness center, pool, tennis and dining facilities. The club will offer special prices to attract youth groups or other desired members and for special events, and will aggressively rent out the banquet hall, Norman said. The plan is to offer existing members the best services the company can, Norman said, “but we really want to bring in the younger generation, too.” Hampton is successful at managing golf clubs because it makes its clubs a social destination point and diversifies its membership, he said. He likened the company’s golf courses to a cruise ship. “We will have something for everybody,” he said. The club’s operations budget will be increased to ensure the club is properly maintained. Country Club of Ocala, Inc. sold the club in mid-December. The initial owners had made a significant investment, and the club was a very involved financial undertaking. In time, the owners \"decided it was time to change management,\" said George Kirkland, a member of the Country Club of Ocala, Inc.'s executive committee and one of the owners. Gary DeArmond, director of client resources at the National Golf Foundation, said what Norman is doing in Ocala is what many golf courses need to do to survive. “Golf could be doing a lot better job of selling itself,” he said. Whether intentional or not, golf has often been seen as a sport for the wealthy or elite, he said. If golf can be compared to the Disney World castle, DeArmond said, “a lot of young people have been afraid to enter the castle.” The same way Disney World has crafted its business model to make guests feel welcome and at ease, golf and golf clubs need to make people new to the sport feel appreciated and welcomed, he said. Unlike decades ago, when there were fewer places to go for entertainment, DeArmond said, “golf isn’t the only game in town” anymore. “The bottom line is that golf has to realize it's a business like anything else. That means we have to be better at (broadening the demographics of players),” he said. New players “have to be greeted like they’re really appreciated. Their hands are held until (they feel comfortable with the sport and the club),” DeArmond said. Smart course management understands they have to cater to potential members, which sometimes means offering services that other clubs don’t, and that often results in those members coming to your course, he indicated. “It’s not like there’s potential members just floating around,” DeArmond said. In 2015, 24.1 million Americans played golf. That was down from 24.7 million the two previous years, according to a National Golf Foundation study. About 75 percent of players are men. But while the trend of overall players is down, millennials — those born between the early 1980s and early 2000s — make up about 25 percent of players. That suggests there is a young batch of players ready to replace older players. But incorporating new services and focusing on attracting new players, like the Ocala club's new owners and management want to do, will take time for the sport as a whole, DeArmond said. “This isn’t going to happen overnight,” he said. Reach Fred Hiers at fred.hiers@starbanner.com and 352-397-5914. Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.ocala.com. All rights reserved."
    }
  ]
}