{
  "fuentes": [
    {
      "url": "https://www.thecolonialoakmusicpark.com/",
      "email": "bookings@colonialquarter.com"
    },
    {
      "url": "https://www.thecolonialoakmusicpark.com/contact-us/",
      "email": "bookings@colonialquarter.com"
    },
    {
      "url": "https://historiccoastculture.com/venue/the-colonial-oak-music-park/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/venue/the-colonial-oak-music-park/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "administrativedirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "communications@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "culturalengagement@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "innovationliaison@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "managingdirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "programcoordinator@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "sponsorship@communityartsmentorship.com"
    },
    {
      "url": "https://www.thecolonialoakmusicpark.com/faq-page/",
      "email": "bookings@colonialquarter.com"
    },
    {
      "url": "https://www.thecolonialoakmusicpark.com/faq-page/",
      "email": "jason@colonialquarter.com"
    },
    {
      "url": "https://www.thecolonialoakmusicpark.com/faq-page/",
      "email": "kevin@colonialquarter.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://www.thecolonialoakmusicpark.com/private-events/",
      "email": "autumn@colonialquarter.com"
    },
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/colonial-quarter-venue",
      "email": "autumn@colonialquarter.com"
    },
    {
      "url": "http://www.publickmusick.org/performers-1",
      "email": "info@publickmusick.org"
    },
    {
      "url": "https://www.ticketmaster.com/colonial-oak-music-park-tickets-st-augustine/venue/279611",
      "email": "claimsinquiry@allianzassistance.com"
    }
  ],
  "mails": [
    "administrativedirector@communityartsmentorship.com",
    "autumn@colonialquarter.com",
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "bookings@colonialquarter.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "claimsinquiry@allianzassistance.com",
    "communications@communityartsmentorship.com",
    "culturalengagement@communityartsmentorship.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "info@publickmusick.org",
    "innovationliaison@communityartsmentorship.com",
    "jason@colonialquarter.com",
    "jmartin@diamondheadtheatre.com",
    "kevin@colonialquarter.com",
    "kmatsuno@diamondheadtheatre.com",
    "managingdirector@communityartsmentorship.com",
    "productions@diamondheadtheatre.com",
    "programcoordinator@communityartsmentorship.com",
    "rtandal@diamondheadtheatre.com",
    "sjcc@historiccoastculture.com",
    "sponsorship@communityartsmentorship.com",
    "vgreen@diamondheadtheatre.com",
    "x@2x.png"
  ],
  "nombre_sitio": "thecolonialoakmusicpark.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.thecolonialoakmusicpark.com/",
      "text": "The Colonial Oak Music Park – The Colonial Oak Music Park 27 St. George St, St. Augustine, FL 32084 904-342-2857 Follow us: Facebook Instagram Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us View Events Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us See You At the Oak Enter Enjoy the Experience Music, Events & More Though positioned on the busiest street in the Nation’s Oldest City, Colonial Oak Music Park is a hidden gem that’s just enough off the beaten path. A multi-faceted attraction and destination, the park is part music venue, part private event space and a unique reprieve for individuals, couples and families looking to experience a piece of Old Florida. On weekends and many other nights of the week, live music takes the stage at the music park. With seating for more than 250 visitors, it’s easy to see why the venue has become a mainstay on the local festival circuit, including the Sing Out Loud Music Festival. Everyone from local favorites like Bad Dog Mama and One Good Ring to nationally touring acts such as Rising Appalachia and The New Mastersounds have taken center stage. The Colonial Oak is also the ideal space for hosting private events. We offer family style table seating for up to 175 guests, a full bar, and catering options. We enjoy tailoring custom events to meet your needs! What sets the Colonial Oak Music Park apart is its intimate outdoor setting nestled in the splendor of nature in the heart of downtown. It truly can’t be beat. View more Highlighting Upcoming Events Dewey Via Band – September 11 Thursday means one thing at the Oak — Country Night with Pendleton Whisky! Stop by and enjoy live music with us and the Dewey Via Band!  7-10 PM FREE Fun for all ages Friendly pups welcome Multiple bars stocked with […] Read more Sing Out Loud Local Showcase: September 12 – 14 The Local Artist Showcases are a cornerstone of the Sing Out Loud Festival experience, offering music fans an opportunity to explore Northeast Florida’s diverse and vibrant music scene. From indie rock and bluegrass to hip hop, country, spoken word and […] Read more Sing Out Loud Local Showcase: September 18-21 The Local Artist Showcases are a cornerstone of the Sing Out Loud Festival experience, offering music fans an opportunity to explore Northeast Florida’s diverse and vibrant music scene. From indie rock and bluegrass to hip hop, country, spoken word and […] Read more Country Night w/ Josh Tennessee Worthy Ensemble – September 25 Thursday means one thing at the Oak — Country Night with Pendleton Whisky! Stop by and enjoy live music with us and the Josh Tennessee Worthy Ensemble 7-10 PM FREE Fun for all ages Friendly pups welcome Multiple bars stocked […] Read more KISS Alive The Tribute (Ticketed) – November 2 Almost 16 years ago, what began as 4 fans wanting to cover KIϟϟ tunes for Florida fans has evolved into one of the country’s premier KIϟϟ tribute acts. Comprised of 4 seasoned musicians, KIϟϟ ALIVE the tribute, has had the […] Read more Surfer Girl (NIGHT 2) – November 17 Night 2 of Surfer Girl at the Oak!!! SURFER GIRL Surfer Girl – led by the dynamic Carter Reeves, former frontman of the acclaimed hip-hop/pop group Aer – continues to evolve and captivate audiences with their distinct blend of indie-pop, […] Read more Book our Venue Private Events The Colonial Oak Music Park is a most enchanting St. Augustine setting for weddings, corporate events and other private parties. A regular host to community and private gatherings — The Oak features an amphitheater under St. Augustine’s second oldest sweeping live oak tree with enough family-style table seating for up to 175 guests. Our Oak space also features a full bar, and many different catered menu options from our on-site chef to please any crowd – we enjoy tailoring custom events to your needs! View more Caravel Concert Series Even when the Colonial Oak Music Park is booked for a private event, the music doesn’t stop! Join us just steps away at the Colonial Quarter’s Maritime Stage for our Caravel Concert Series. Brought to you in partnership with The St. Augustine Distillery, this exciting series brings your favorite musicians right next door – ensuring uninterrupted live entertainment. Free Admission All ages Friendly dogs welcome Multiple bars on site featuring St. Augustine Distillery Spirits How to find us? Find us across from the Castillo de San Marcos Fort at 14 S Castillo Drive (next to No Name Bar) or enter directly on St. George Street next to the Bull and Crown Pub at 53 St. George Street. View Caravel Concert Series Events Exclusive Ticketed Events Take part in our special concerts and other events that are ticketed. You can view each event to see the price and other details. View Ticketed Events Our Sponsors Local Partners As a community music park, we love partnering with other local businesses and organizations to help provide some of the highest quality entertainment in our area. Great venue with live music. We come here just about every weekend! Beth Handline Visitor We got engaged at this beautiful park this year. Had a nice dinner and enjoyed some live music in the park. Anastasia Baker Visitor One of my favorite outdoor venues in downtown St. Augustine! Beautiful venue! Renee Unsworth Visitor Get in touch Contact 27 ST. GEORGE STREET, ST AUGUSTINE, FL 32084 bookings@colonialquarter.com Your Name (required) Your Email (required) Subject Your Message Send Event Calendar FAQs Saint Augustine Seafood Co. 33 St. George St, St. Augustine, FL 32084 Thur-Sat – 6pm – 10pm Sun – 12pm – 7pm Copyright © The Colonial Oak Music Park OPENING HOURS Open Daily 11am - 9pm ADMISSIONS All events are free and open to the public Unless otherwise noted FIND US 21 St George St, St. Augustine, FL 32084 (904) 342-2857"
    },
    {
      "url": "https://www.thecolonialoakmusicpark.com/contact-us/",
      "text": "Contact us – The Colonial Oak Music Park Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Contact us our location get to us 33 St. George Street, St. Augustine, FL 32084 Get in touch Contact To get in touch email bookings@colonialquarter.com Want to inquire about a private event ? Weddings & Events Bands Apply Here Apply to Play at Our Venue Name * Email * Band Name Website or Social Link Music Link * Genre of Music * Phone This field is for validation purposes and should be left unchanged. Discover more St. Augustine Seafood Company The St. Augustine Seafood Company is a fast casual seafood restaurant with a full service bar located on our property. It’s the perfect place to order food to enjoy while listening to music under the Oak! www.saseafoodco.com Event Calendar FAQs Saint Augustine Seafood Co. 33 St. George St, St. Augustine, FL 32084 Thur-Sat – 6pm – 10pm Sun – 12pm – 7pm Copyright © The Colonial Oak Music Park OPENING HOURS Open Daily 11am - 9pm ADMISSIONS All events are free and open to the public Unless otherwise noted FIND US 21 St George St, St. Augustine, FL 32084 (904) 342-2857"
    },
    {
      "url": "https://historiccoastculture.com/venue/the-colonial-oak-music-park/",
      "text": "Colonial Oak Music Park - HistoricCoastCulture.com Colonial Oak Music Park - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Venue Type Amphitheatre Amusement Park Bar/Tavern Bookstore Business/Company Campground Church College/University Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Golf Club Historic Building/Landmark Hotel/Inn Library Meeting Space Movie Theater Museum Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater Zoo State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue Colonial Oak Music Park Facebook Twitter Linkedin Print Colonial Oak Music Park The Colonial Oak Music Park is a unique downtown venue for live music and shows. A beautiful old live oak spreads its branches over the seating area, keeping guests cool and enveloping them in a nostalgic old Florida atmosphere. The intimate stage and setting feature family-style table seating for more than 250 visitors. The park is adjacent to the Colonial Quarter, which offers two restaurants and easily accessible restroom facilities. The Colonial Oak Music Park is a unique downtown venue for live music and shows. A beautiful old live oak spreads its branches over the seating area, keeping guests cool and enveloping them in a nostalgic old Florida atmosphere. The intimate stage and setting feature family-style table seating for more than 250 visitors. The park is adjacent to the Colonial Quarter, which offers two restaurants and easily accessible restroom facilities. View less MORE ABOUT THIS VENUE Venue Type: Amphitheatre ; Concert Hall ; Park/Garden ; Performing Arts Center LOCATION Colonial Oak Music Park 33 St George Street, St. Augustine, FL 32084 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette UPCOMING EVENTS PAST EVENTS Coyote Island Presented by Deuterman Productions at Colonial Oak Music Park Dec 10, 2025 Facebook Twitter Linkedin TICKETS / REGISTRATION OakFest at Colonial Oak Music Park Presented by The Colonial Oak Music Park at Colonial Oak Music Park Jul 3 - Jul 7, 2024 Facebook Twitter Linkedin PHOTOS Contact information Website / Facebook / Instagram / 33 St George Street, St. Augustine, FL 32084 (904) 342-2857 Find A Venue Search by Keyword Venue Type Amphitheatre Amusement Park Bar/Tavern Bookstore Business/Company Campground Church College/University Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Golf Club Historic Building/Landmark Hotel/Inn Library Meeting Space Movie Theater Museum Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater Zoo State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access Featured Venues Lightner Museum With sparkling crystal chandeliers, intricate mosaic tile flooring, majestic arched windows, and carved wooden staircases, Lightner Museum is a show-stopper! The museum opened in 1948, displaying the collections of Otto C. Lightner, which include 19th-century artwork, glassware, sculpture, furniture, stained glass, and antique chandeliers throughout the three floors of exhibits. Originally built as the Hotel Alcazar in 1888 by Standard Oil co-founder Henry Flagler, this beautiful structure was created in the Spanish Renaissance Revival Style. In addition to the Lightner Museum, it also houses St. Augustine City Hall, several antique shops, and Cafe Alcazar, a restaurant that sits in the location of what was once the world’s largest indoor swimming pool. Beluthahatchee Park Beluthahatchee Park is a four-acre park located within the 70-acre tract of land purchased by Stetson Kennedy in 1948 after the 18-acre Beluthahatchee Lake was created by impounding Mill Creek in 1945. This lake meanders through a natural basin and is surrounded by high bluffs, currently owned by the Lake Dwellers Association, a non-profit Florida corporation formed by the lakefront residents. In 1949, the 70-acre tract was subdivided and platted by the owner/developer Stetson Kennedy who recorded the restrictive covenants setting aside land in perpetuity as a wildlife refuge, and stipulating that residential construction be consistent with the developer’s goal of “serving as a working demonstration that human and natural habitat need not be mutually exclusive, but can coexist in harmony.” DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "text": "OUR TEAM | CAMP top of page Home ABOUT OUR TEAM JOIN THE TEAM PROGRAMS TACT URBAN ARTS NORTHERN LIGHTS BLUEGRASS MUSIC CAMP GIRLS ROCK THE NORTH YOUTH MUSIC CAMPS RESIDENCIES CULTURAL FOUNDATIONS MUSIC IN SCHOOLS ARTS EXPLORATION TOUR SOA FIDDLE MENTORSHIP CURRICULUM DEVELOPMENT HIP HOP COLLABORATION MUSIC TEACHER MENTORSHIP CONTACT NEWS DOYLEFEST LINEUP AND TICKETS ABOUT GET INVOLVED GALLERY CONTACT PAST PERFORMERS DONATE Our Team. Rooted in the arts. Experts in various fields, working together to share their talents in communities across Saskatchewan. Eliza Doyle managingdirector@communityartsmentorship.com Co - Founder / Managing Director Eliza is a professional musician, songwriter and recording artist, teacher, community advocate, leader and is the co-founder behind Saskatchewan’s arts organization, C.A.M.P; Community Arts Mentorship Program. Her focus on fostering the arts while supporting local community capacity to deliver arts programming has been welcomed throughout communities in Saskatchewan. Offering services to remote and under-served communities presents new challenges, and all of CAMP programming serves to mitigate these obstacles. Familiar with the arts and music industry in Saskatchewan, she also aims to provide the opportunity and mentorship available to people with challenges in access due to location and lack of resources. Holly Rae Yuzicapi culturalengagement@communityartsmentorship.com Co - Founder / Cultural Consultant The co-founder of CAMP and a proud Dakota/Lakota from the Standing Buffalo Dakota Nation in Treaty 4 Territory, Saskatchewan.  Holly grew up in the beautiful Qu'Appelle valley.  Coming from a large family, Holly has been able to observe and learn from many generations of the Goodwill and Yuzicapi families.  The strength of her sense of identity was nurtured and shaped by her family and community.  Without realizing it at the time, Holly started doing cultural arts sharing from a young age which really is rooted in participating in powwow dancing and attending other cultural events on a regular basis.  She has evolved into an independent natural materials artist that loves to facilitate cultural arts engagement opportunities to all audiences.  Holly is proud of how she was raised and is very thankful for all that her family has taught her.  Respectfully representing the spirit and potential of those teachings is why Holly does the work that she does.  It is how she chooses to honour her family. LJ Tyson Kimbley innovationliaison@communityartsmentorship.com Innovation Liaison LJ Tyson is a singer-songwriter from Prince Albert, Saskatchewan. The has used his identity as inspiration for creating lyrics and melodies. LJ has had music played across Canada and beyond. His latest release Home On A Rainbow was critically acclaimed and awarded a prize from SOCAN TD Indigenous Songwriter Awards. LJ currently works as Innovation Liaison for Community Arts mentorship program, bringing music to remote and underserved communities. Steph Cameron administrativedirector@communityartsmentorship.com Administrative Director Saskatchewan-based artist Steph Cameron has gained recognition for her unique take on contemporary Americana music, lively instrumentation, and captivating lyrics. From her early days of busking, she has become an internationally touring professional recording artist. Her critically acclaimed debut album, Sad-Eyed Lonesome Lady, released on Pheromone Recordings in 2014, was nominated for the Polaris Music Prize and praised as the #1 Canadian album of that year by PopMatters, while No Depression called it \"a stunning debut.\" This success led her to join the Paquin Artist Agency and embark on national tours. Her expertise in performing is the real world experience CAMP participants benefit the most from . Zoe Slusar programcoordinator@communityartsmentorship.com Program Coordinator Zoe Slusar was the voice actress for Kid Goku in the English dubs of the Dragon Ball and Dragon Ball GT anime, done by Blue Water Studios. She also provided the voice of Sai Saici in Kidou Butouden G Gundam, as well as the video game Gundam: Battle Assault 2.\n\nZoe also voiced the character Jungo in the Flemish created series.\n\nZoe, also known by her stage name ZHE the Free, released her first rap EP album titled The Love EP in September 2020. This album charted #1 on 90.9 CJSW in Calgary, Alberta in November 2020. Mitchell Dureault programcoordinator@communityartsmentorship.com Program Coordinator Mitch Dureault is a seasoned professional music instructor and traditional musician, who comes from the Treaty 4 Territory of the southern Saskatchewan prairies. Currently sitting as a board member, and working instructor for C.A.M.P., Mitch is an advocate for the arts and has a strong focus on decolonizing his own music & teaching practices. He regularly draws from his B.A. in International Studies while working with and aiding organisations, communities, and schools in the development and implementation of equitable and continual art programming throughout the province. Mitch is also very passionate about the promotion and preservation of the local culture of Saskatchewan fiddling and has been making efforts to visit and interview as many fiddlers as possible from across the province for his Saskatchewan Fiddle History Project, a multi-year project in which he collects stories, tunes, and histories from these individuals in an attempt to preserve and document the ever evolving diverse intricacies of the provinces fiddling culture. Jille Shotton communications@communityartsmentorship.com sponsorship@communityartsmentorship.com​ Marketing and Communications Director\\ Sponsorship Jille Shotton joined the Community Arts Mentorship Program in 2024 as the Marketing and Communications Director, bringing a decade of experience in festival marketing, promotions, and community building within Saskatchewan's arts and culture sector. Her background includes managing marketing, communications, sponsorship, and onsite operations for events such as the Northern Lights Bluegrass & Old Time Music Festival, Winterruption, Ness Creek Music Festival, Fiddlyness, Shivering Strings and the Children's Festival of Saskatchewan. Jille is passionate about strengthening communities through the arts, having organized open jams, Bluegrass Brunch, radio shows, and various events and festivals. Her work focuses on creating inclusive, vibrant spaces where the community can connect and thrive. Lillanohna Naytowhowcon President LILI, an Indigenous singer, songwriter, and recording artist hailing from Sturgeon Lake First Nation in Saskatchewan, blends her passion for music and independent songwriting. She is actively engaged in community projects that celebrate and honour Indigenous culture through a fusion of traditional Cree songs, indie rock, folk, hip-hop, and dance music. In 2024, expect the release of her music under the esteemed blessed-street record label, marking a significant chapter in her musical journey. The album includes collaboration with recording artist Lancelot Knight in Six Underwater, showcasing her versatility. Proudly identifying as a nehiyaw iskwew, she seamlessly weaves her creative pursuits into a traditional lifestyle, contributing to a First Nation Healing Lodge under the guidance of elders and knowledge keepers. The past year has been a transformative period characterized by healing and growth, with her music echoing the spirit of loss, hope, and perseverance. Her vocal style is both distinctive and heartfelt, drawing inspiration from grassroots music festivals, independent artists, and the eclectic vibes of the city. A nomadic spirit with a touch of witchy charm, LILI invites all to partake in the enchantment of her melodies. Travis Beatty Board Member Travis Beatty is from Timber Bay, Saskatchewan and is instrumentalist. He has a studio in Saskatoon, Saskatchewan called Rez Rat Recording, and is passionate about helping community and youth in Saskatchewan. He joined the CAMP Sask Arts Board of Directors in October 2023, and we are very lucky to have him! JOIN THE MAILING LIST SIGN UP NOW Thanks to our supporting organizations Email: managingdirector@communityartsmentorship.com Tel: 306-774-5888 bottom of page"
    },
    {
      "url": "https://www.thecolonialoakmusicpark.com/faq-page/",
      "text": "FAQ Page – The Colonial Oak Music Park Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us FAQ Page Where is the Colonial Oak Music Park located? The Music Park is located in Historic Downtown St. Augustine and is part of The Colonial Quarter Properties on St. George Street. What time does my show start or end? Typically shows start at 7pm and are over by or before 10pm, however showtimes may vary. Is the Colonial Oak Music Park an all-ages venue? Yes! Is there parking onsite? No. The weather outside is frightening. Is my show canceled? This is handled on a case by case basis. For day of show updates call (904) 342-2857. I lost my cell phone / credit card / wallet / jacket / etc. at the Oak? What do I do? Email us here or come by in person. I want to leave and go to my car during the event, do you allow re-entry? Yes. What types of items are prohibited at the Oak? Our license prohibits anyone bringing their own alcohol.  Any weapons.  Smoking of any kind. My favorite band is playing and I want to meet them, is that possible? Contact us here to see if it can be arranged. Do you have an ATM at the Oak? No. I am a local band and would like to play on an upcoming show, how can I get on? Email bookings@Colonialquarter.com Event Calendar FAQs Saint Augustine Seafood Co. 33 St. George St, St. Augustine, FL 32084 Thur-Sat – 6pm – 10pm Sun – 12pm – 7pm Copyright © The Colonial Oak Music Park OPENING HOURS Open Daily 11am - 9pm ADMISSIONS All events are free and open to the public Unless otherwise noted FIND US 21 St George St, St. Augustine, FL 32084 (904) 342-2857"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://www.thecolonialoakmusicpark.com/private-events/",
      "text": "Private Events – The Colonial Oak Music Park Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Home About Us Private Events FAQs Oak Calendar Halfway to SweetWater Contact Us Private Events Reserve our Venue Weddings and Special Occasions Located in Historic Downtown Saint Augustine, the Colonial Oak is available for your events, including weddings, corporate events and other private parties. The Colonial Oak Music Park offers a truly magical and versatile setting in Historic St. Augustine, perfect for weddings, corporate events, and private gatherings. Nestled under the city’s second-oldest live oak tree, this one-of-a-kind venue features an amphitheater and family-style table seating for up to 175 guests, making it ideal for both intimate celebrations and larger parties. With its open-air charm and natural beauty, the space serves as a blank canvas, ready to be transformed into any bride’s dream vision—from rustic elegance to modern sophistication. The venue also includes a full-service bar and customizable catering options prepared by our on-site chef, ensuring every detail reflects your personal style and taste. For a truly unforgettable experience, guests can enjoy entertainment from pirates or colonial-era reenactors, courtesy of the adjacent St. Augustine Pirate & Treasure Museum, available for a small additional fee. Whether you’re envisioning a classic celebration or a themed event, the Colonial Oak Music Park is the perfect backdrop for your special day. Please contact our Event Coordinator for further information autumn@colonialquarter.com 904-315-9728 Instagram Follow us on @thecolonialoakevents Learn More Inquire Great venue with live music. We come here just about every weekend! Beth Handline Visitor We got engaged at this beautiful park this year. Had a nice dinner and enjoyed some live music in the park. Anastasia Baker Visitor One of my favorite outdoor venues in downtown St. Augustine! Beautiful venue! Renee Unsworth Visitor Get the Party Started Contact Us 33 St. George St., St. Augustine, FL 32084 904-315-9728 Ready to Celebrate? Book Now To book your event online, click on the button below and we will get back to you as quickly as we can! Book an Event thecolonialoakevents As if our 300 year old Oak wasn’t enchanting eno ✨ Mr. & Mrs. Ayres est. 5.11.24 ✨ 💗 Meet Emma & AJ! This sweet couple were destin 😍 We’re still swooning over these photos from 🌟 Oak Wedding Must do! Gather all of your guest Tambourines, Glow sticks, or Shark Bubble Blasters 💡This couple dressed up the Oak stage with beau 😋 Surprising your guests with a sweet treat is ✨ Finishing Touches! @danirayne @theantibride 🪩 Transitioning from ceremony to reception! Not 🥰 Dreaming of a St. Augustine, wedding? \n\n✨ T 🥗 Weddings and private events at the Oak are en 👑 You’ll love these place settings if jewel t 🧡 Emma and AJ saying their “I do’s” under Follow on Instagram Event Calendar FAQs Saint Augustine Seafood Co. 33 St. George St, St. Augustine, FL 32084 Thur-Sat – 6pm – 10pm Sun – 12pm – 7pm Copyright © The Colonial Oak Music Park OPENING HOURS Open Daily 11am - 9pm ADMISSIONS All events are free and open to the public Unless otherwise noted FIND US 21 St George St, St. Augustine, FL 32084 (904) 342-2857"
    },
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/colonial-quarter-venue",
      "text": "Colonial Oak Music Park & Venue | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search Previous Next Colonial Oak Music Park & Venue This outdoor event space on St. George Street can seat up to 175. View Website (904) 315-9728 Colonial Oak Music Park & Venue (904) 315-9728 At the north end of St. George Street. 53 St. George Street St. Augustine, FL 32084 View Google Map Share This Show all The Colonial Oak Music Park hosts events at their enchanting downtown location — an outdoor amphitheater under the sweeping branches of one of St. Augustine's oldest live oak trees. The venue hosts weddings, corporate events, and private parties and has family-style table seating for 175 guests. The Colonial Oak Music Park is a regular event space for community and private events. With a large stage, full bar, and fairy lights strung along the oak branches, it's a magical space for any event. Their on-site chef has crafted a catering menu with many options, and the team delights in designing custom-tailored events. Colonial Oak Music Park is next to the St. Augustine Pirate and Treasure Museum, so the event planner can book pirates or reenactors from the colonial period to mingle and entertain guests for a small additional fee. To learn more, call or email the Event Coordinator at (904) 315-9728 or [email protected] . Capacity: Up to 175 guests, seated or standing. Upcoming Events Event Date Time Colonial Night Watch Saturday, December 6th, 2025 10:00 am - 8:00 pm Colonial Oak Music Park & Venue (904) 315-9728 At the north end of St. George Street. 53 St. George Street St. Augustine, FL 32084 Share This Profile Keywords Weddings Wedding Venues Event Venues Historic Downtown Have a Question? Your Name Your Email Address Your Message Restaurants nearby Bull and Crown Publick House within 1 block MiMi's Famous Crepes within 1 block Ben's Soft Pretzels within 1 block Whips Waffle Company within 1 block Places to Stay nearby Agustin Inn within 1 block 44 Spanish Street B & B 0.1 miles Carriage Way Bed & Breakfast 0.1 miles Inn on Charlotte 0.1 miles Related categories Attractions Tour Services Shopping Live Music Nightlife Recreation Weddings Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    },
    {
      "url": "http://www.publickmusick.org/performers-1",
      "text": "performers — Publick Musick Home about about us performers history events Our next concert 2025-26 Season Past concerts listen video Pasquini Donate Contact Gallery Menu 276 Mount Vernon Avenue Rochester, NY 14620 (585) 244-5835 Your Custom Text Here Home about about us performers history events Our next concert 2025-26 Season Past concerts listen video Pasquini Donate Contact Gallery Boel Gidholm, violin and viola A native of Sweden, violinist Boel Gidholm has devoted herself to historical performance practice for over 20 years, performing throughout Europe and the US as a baroque violinist and violist with early music ensembles such as Ensemble Aperto (Germany), Fiori Musicali-Barockorchester Bremen, Pegasus Early Music, NYS Baroque, Publick Musick, ARTEK, Ars Lyrica Houston, La Follia Austin Baroque and Texas Early Music Project. Chamber music performances have taken her to Italy, France, Latvia, the Canary Islands, Canada, Sweden and Denmark. She lives in Rochester, NY, with her husband, Christopher Haritatos, with whom she co-directs Publick Musick, performing and presenting period-instrument concerts in the greater Rochester area. Holding degrees from the University of Gothenburg, Sweden, and the Akademie für Alte Musik in Bremen, Germany, she is on the faculty of the Eastman Community Music School where she teaches baroque violin and leads a period-instrument ensemble. Christopher Haritatos, cello Cellist Christopher Haritatos has gained a reputation as a passionate and intelligent performer on both the baroque and modern forms of his instrument. As a baroque cellist he has had an extensive and varied freelance career with ensembles such as the Handel and Haydn Society (Boston), Ars Lyrica (Houston), Tafelmusik (Toronto), Concert Royal (New York), La Follia (Austin), and Apollo’s Fire (Cleveland). He has performed chamber music with artists such as Marc Destrubé, Kristian Bezuidenhout, Elizabeth Wallfisch, and Sergiu Luca. Previously, while living in Europe, he worked with ensembles such as as Fiori Musicali-Barockorchester Bremen, The Harp Consort, Ensemble Aperto, and Confetti Musicali, often as continuo cellist, taking part in numerous recordings and tours. Currently he is based in Rochester, NY, where he is Co-Director of the period-instrument ensemble Publick Musick and performs with other organizations such as Pegasus Early Music and NYS Baroque. Equally accomplished as a modern cellist, Chris is a core member of the Rochester Philharmonic Orchestra and has also been a member of the Austin Symphony and the Austin Lyric Opera Orchestra (including as Interim Principal and Acting Principal Cello). He is regularly invited to the Victoria (TX) Bach Festival as both a modern and baroque cellist, and has been principal cellist of the VBF Orchestra. Since 2024 he has led the VBF baroque ensemble. Also sought after as a pedagogue, he currently teaches at the Eastman Community Music School, has been on the faculty of Texas State University-San Marcos and the Rochester Institute of Technology, and has given numerous workshops and master classes at colleges and universities including the University of North Texas, the University of Virginia, Luther College, and SUNY-Fredonia. A native of the San Francisco Bay Area, he holds a B.A. from the University of Chicago, an M.M. from the Cleveland Institute of Music, and a D.M.A. from the Eastman School of Music. His major teachers have included Alan Harris, Marc Johnson, Catharina Meints, Pieter Wispelwey, Steven Doane, and Jaap ter Linden, with whom he studied as a Fulbright Scholar at the Akademie für Alte Musik Bremen. Hailed as ”luminous” and ”ethereal” (Washington Classical Review), Mexican-American soprano Andréa Walker specializes in historical performance practice and vocal chamber music. She is a core singer with GRAMMY® Award-winning Baroque orchestra Apollo’s Fire and makes appearances with groups like the Atlanta Baroque Orchestra, The Thirteen, Pegasus Early Music, NYS Baroque, and Seraphic Fire. Other recent solo performance highlights include a recital with Duo CPE at the Early Music Seattle Beyond Baroque festival, her Lincoln Center debut in Telemann's Der Tag des Gerichts with Masaaki Suzuki and Juilliard415, and a German tour in Haydn's Schöpfungsmesse with Yale Schola Cantorum. Andréa received a Doctorate of Musical Arts in historical performance practice from Case Western Reserve University. Prior to her time in Cleveland, she graduated with a Master’s in vocal performance from the Yale Institute of Sacred Music where she specialized in early music, oratorio, and art song. Andréa Walker, soprano Praised by the Boston Music Intelligencer for his “commanding stage presence” and “projecting bass voice,” Peter Schoellkopff is a dynamic and versatile singer with a broad range of musical expertise. His diverse performances span from choral ensembles to the operatic stage, showcasing a repertoire that bridges both historical and contemporary works. Recently, Peter captivated audiences as Betto di Signa in Puccini’s Gianni Schicchi with Finger Lakes Opera. His talents were further highlighted during his tenure as a Young Artist at the Boston Early Music Festival, where he took on the role of Borée in Élisabeth Jacquet de La Guerre’s Cephale et Procris . Peter holds both undergraduate and graduate degrees in performance from the Eastman School of Music, where he excelled in various operatic roles and was an active member of the Collegium Musicum, specializing in baroque music. He was also honored as a Voces8 US Scholar for the 2022-2023 season. Peter Schoellkopff, bass Originally from Toronto, Canada, Michael Unger is a multiple award-winning performer who appears as a soloist, orchestral and chamber musician in North America, Europe, Japan, and South Korea. Since 2013, he is Associate Professor of Organ and Harpsichord at the University of Cincinnati College-Conservatory of Music. He is a First Prize and Audience Prize winner of the National Young Artists’ Competition of the American Guild of Organists, a First Prize winner of the International Organ Competition Musashino-Tokyo, and a Second Prize and Audience Award winner of the International Schnitger Organ Competition on the historic organs of Alkmaar, the Netherlands. Recent organ and harpsichord collaborations include Cincinnati Symphony Orchestra, Cincinnati Opera, Indianapolis Baroque Orchestra, The Vivaldi Project, Incantare and Catacoustic Consort. He received favorable international reviews for his debut solo recordings under the Naxos and Pro Organo labels, and his performances have been broadcast on North American and European radio. He holds a Doctorate of Musical Arts with Performers’ Certificate from the Eastman School of Music, where he was a student and teaching assistant of David Higgs and William Porter, and recipient of the school’s Jerald C. Graue Musicology Fellowship. He is also a Gold Medal graduate of the University of Western Ontario, and his post-graduate teachers include Roberta Gary in Cincinnati and Jean-Baptiste Robin in Versailles, France. Formerly the Director of Music at the Lutheran Church of the Incarnate Word in Rochester, New York, he currently serves as organist of Cincinnati’s historic Isaac M. Wise – Plum Street Temple. Michael Unger, organ Since his student days in Sydney, Australia, Geoffrey Burgess has had a passion for all things to do with the oboe. Discovering the Baroque oboe led him to work with leading early music ensembles in Australia, Europe, and the U.S. For twenty years he was associated with the Paris-based company Les Arts Florissants, and he has appeared with most major early music ensembles in the U.S. and Canada. His contributions to the history, repertoire, construction, performance, and culture of the oboe can be found in numerous reference works, such as the New Grove Dictionary, MGG, and Lexikon der Holzblasinstrumente. The Oboe, co-authored with Bruce Haynes, has become a standard reference work, and a French translation will be released in 2026. Geoffrey’s recent publications include a revisionist performance-practice manual entitled The Pathetick Musician: Moving an Audience in the Age of Eloquence, and The Thorn of the Honey Locust a historical novel based on the life of Bach’s oboist (available through Amazon). Holding a PhD in musicology from Cornell University, Geoffrey has taught music history at Duke and Columbia Universities. He currently lives in Philadelphia and as well as teaching at the Eastman School of Music, he regularly gives masterclasses across the U.S. and Europe. Geoffrey Burgess, oboe Mary Riccardi ’s musical tastes were forged in her native city, Detroit, and refined in the concert halls of Europe where she spent the better part of two decades studying and performing. During that time, she played and recorded with such renowned groups as La Capella Neapolitana, Il Complesso Barocco, Modo Antiquo and Barockorchester Bremen. Upon returning with her family to North America, she co-founded the ensemble l’Invenzione which draws on the incredibly rich musical repertoire of 18th Century Naples. As concertmaster of the Michigan Baroque Consortium, Mary has helped bring historically informed performances to Michigan. She is a regular member of New York’s Publick Musick, has appeared with Apollo’s Fire, Bourbon Baroque, Four Nations and Pegasus and has recorded with the BEMF orchestra. In addition to her performance activities on baroque violin, Mary enjoys coaching young string players and cultivates her varied musical interests through continuing projects with Detroit-based experimental composers. Mary Riccardi, violin Patricia Ahern was educated at Northwestern University, Indiana University, and the Schola Cantorum in Basel, Switzerland. She taught baroque violin at the Freiburg Conservatory in Germany and Oberlin’s Baroque Performance Institute, and has given masterclasses at McGill, York University, Wilfrid Laurier, University of Windsor, Western University, University of Toronto, University of Wisconsin, Penn State University, Grand Valley State University, California State University Long Beach, Sookmyung Women’s University (Seoul), and the Sydney Conservatorium (Australia). She has concertized throughout Canada, the US, Europe, Asia, Australia, and South America, and has performed with Milwaukee Baroque, Ars Antigua, Chicago Opera Theater, Toronto Consort, Aradia, I Furiosi, Newberry Consort, Musica Pacifica, and the Carmel Bach Festival. Patricia is a frequent soloist and core member of Tafelmusik Baroque Orchestra, and has recently joined the Eybler String Quartet and the faculty of the Banff Evolution Chamber program. Patricia Ahern, violin French-American violinist Lydia Becker unites historical performance practices with creativity and curiosity, engaging diverse audiences through explorative music-making. Lydia currently serves as concertmaster for La Forza delle Stelle, and has held concertmaster positions for Juilliard415, the Boston Early Music Festival Young Artists program, and the Eastman Collegium Musicum. As a core member of Juilliard415, Lydia toured the Netherlands and Germany, and has performed with Rachel Podger, Reggie Mobley, William Christie, and Lionel Meunier, among others. She has appeared as a soloist with Juilliard415 (under the direction of Masaaki Suzuki), Publick Musick, and the Eastman Collegium Musicum (with Christel Thielmann and Paul O’Dette). She is a founding member of the Berwick Fiddle Consort, an ensemble that explores historical fiddling traditions of the British Isles. Equally at home on modern violin, Lydia regularly teaches and performs at Rencontres Musicales Internationales des Graves (France), where she has premiered new works by composers such as François Rossé and collaborated with Maxim Vengerov. Lydia is a Benzaquen Career Advancement Grant recipient and a Mercury-Juilliard Fellow. She is also a former Presser Scholar, Morse Teaching Artist fellow, and a member of Pi Kappa Lambda. Lydia holds degrees from the Juilliard School, the Eastman School of Music, and the Conservatoire de Bordeaux. Lydia Becker, violin Grammy nominated baroque violinist Marika Holmqvist (M.M., Baroque Violin Performance and M.M., Baroque Violin Pedagogy/The Hague Royal Conservatory, The Netherlands) has appeared as a concertmaster for orchestras and opera companies on three continents, directed ensembles on both sides of the Atlantic, and served as artistic co-director for groups in the USA such as Sinfonia New York and the Boston-based ensemble, Cambridge Concentus. Currently her leadership positions include Washington Bach Consort (DC), Kollective 366 (NYC), Fort Wayne Bach Collegium and Reykjavik International Baroque Orchestra (Iceland), among others. Marika is also a dedicated and passionate educator. She has served as coach and guest leader for baroque operas at Cornell, Harvard and Rutgers Universities, and given master-classes and lectures at institutions across Europe. She is a big fan of Rochester and although she’s Philadelphia based, she wakes up every morning with coffee from Joe Bean Roasters! Marika Holmqvist, violin Fueled by a dedication to community building through music, Serbian-American violinist Ela Kodžas enjoys a dynamic career as a soloist and collaborator.  Recent features include performances with Theotokos, Nuova Pratica, Clarion Music Society, American Bach Soloists, and the Smithsonian Haydn Academy.  As a founding member of period ensemble Quartet Novalis, she has performed at the Boston Early Music Festival Fringe Series and the Baroque and Classical Academy at the Carmel Bach Festival. A native of Rochester, NY, Ela holds degrees from the Eastman School of Music, UCLA and the Juilliard School. She is a Mercury-Juilliard Fellow and a member of the inaugural Insula Camerata (FR). This fall, she will continue her studies at the Royal Academy of Music in London under the tutelage of Rachel Podger. In her free time, she can be found avidly dog watching or searching for hidden treasures at flea markets Ela Kodzas, violin James Marshall joined the viola section of the Rochester Philharmonic Orchestra in January 2023, and is currently pursuing a Doctor of Musical Arts degree in Performance and Literature at the Eastman School of Music, with a Certificate of Advanced Achievement in Early Music. Although primarily a violist, James is also an avid performer on Baroque violin and viola d’amore, and was the leader of Eastman’s Collegium Musicum ensemble for three years. James has received primary early music studies from Eastman Professors Paul O’Dette, Christel Thielmann, and Roger Freitas, as well as additional studies with Cynthia Roberts and Julie Andrijeski. He has performed in Rochester with Publick Musick and Pegasus Early Music, and at recent festivals including the American Bach Soloists Academy, Boston Early Music Festival Fringe, Berwick Academy (Oregon Bach Festival), and Baroque Performance Institute (Oberlin). James Marshall, violin and viola Joshua Newburger is the newly appointed Principal violist of the Rochester Philharmonic. Formerly the Assistant Principal violist of the Pacific Symphony, Josh has performed as a guest principal with the Fresno Philharmonic and the Santa Barbara Symphony, and subbed in the sections of the LA Philharmonic, San Diego Symphony, Colorado Symphony, and Buffalo Philharmonic. During his time in the Los Angeles area Josh recorded for numerous feature films and television productions, working with renowned film composers including John Williams, James Newton Howard, and Ludwig Göransson. Among other credits, he can be heard on the soundtracks for movies from the Star Wars, Lego Movie, Creed, Charlie’s Angels, and IT franchises, and TV series including The Mandalorian, The Orville, and American Dad. Josh has toured extensively throughout the United States, Europe, and Asia as a member of the Verbier Festival Chamber Orchestra, and a guest musician with Ivan Fischer’s Budapest Festival Orchestra. He was twice selected as the Assistant Principal violist of the New York String Orchestra and studied as a fellow at the Music Academy of the West and the Verbier Festival. As a graduate student at the Yale School of Music, Josh regularly performed on baroque viola with the Schola Cantorum. His other early music encounters have included festival performances with Nicholas McGegan and Reinhard Goebel. Josh Newburger, viola “Who is Beiliang Zhu ?” A question often asked by the person herself. She is a cellist, who plays a lot of baroque cello and sometimes the viola da gamba. From time to time she disguises as an ethnomusicologist exploring the connection between performers and the music they choose to play and the ways in which they choose to play that music. Beiliang has earned degrees including a Doctor of Musical Arts in Performance and a Master of Arts in Ethnomusicology, but what that really means is that “Dr. Zhu” is quite interested in learning, hardly ever the most diligent student but always curious. She has won competitions and awards such as the First Prize and the Audience Award at the XVIII International Bach Competition in Leipzig, but what that really means is that Beiliang is quite in love with Bach’s music and baroque music in general. While technical perfection is always an intention, nothing is as important to her as letting the spirit of the music flow through her and reach the listeners. View fullsize Beiliang Zhu, cello and viola da gamba Michelle (Michi) Cole Wenderlich (violone) grew up in the Finger Lakes but has worked and toured with many of the top early music orchestras and conductors in Europe, such as Akademie für Alte Musik Berlin, Leipziger Barockorchester, Elbipolis or Die Kölner Akademie, along with innovative crossover groups like Solistenensemble Kaleidoskop and Pera Ensemble. After studying with Joe Carver at Stony Brook University they moved to Europe for early music studies with Dane Roberts at the Frankfurt University of Music and Performing Arts, and they also have performance degrees from the Orchestra of the Enlightenment and the Formation Supérieure of the Abbaye aux Dames de Saintes, in cooperation with l’Orchestre de Champs-Elysées, specializing in period classical and romantic orchestra and chamber music. They have been featured as a soloist, especially for Viennese bass repertoire, at the Limberger Musiktage and Baroque Nights in the Frankfurt area, and have toured in Europe, the US, Australia and South Korea. In addition to 16’ instruments they also play G Violone - a versatile continuo instrument of the Renaissance and early Baroque in the gamba family. They moved to Rochester from Minnesota in 2022, where they performed with such groups as Bach Society of Minnesota, La Grande Bande, Flying Forms, Consortium Carissimi, and Sospiri. In Rochester they are also a political organizer with Metro Justice’s campaign to replace RG&E with a public utility. Michelle Wenderlich, violone Naomi Gregory performs widely as an organist and harpsichordist, working with period ensembles including Incantare, Pegasus Early Music, Publick Musick, and, as guest director, the Schola Antiqua of Chicago. She is Lecturer in Music in the Arthur Satz Department of Music at the University of Rochester and Director of Music for the First Baptist Church in Penfield, NY. Naomi holds a PhD degree in musicology and a DMA degree in organ performance and literature from Eastman School of Music, and MA and MPhil degrees in music and musicology from the University of Cambridge, UK. Her PhD dissertation explores the five and six-voice motet at the royal French court in the early sixteenth century and its role in the performance and practices of royal piety. She has presented her research at the annual meetings of the American Musicological Society, the Renaissance Society of America, and the Medieval and Renaissance Music Conference. Her DMA lecture recital presented a reconstruction of Vespers from mid-seventeenth century Rome, featuring the Italian Baroque Organ at the Memorial Art Gallery, Rochester, NY. From 2013-2019, Naomi curated a monthly concert series showcasing this instrument. She has also served as a graduate instructor of early music and continuo assistant for Eastman’s Collegium Musicum. Naomi Gregory, organ and harpsichord Deborah Fox is the Artistic Director and founder, in 2005, of Pegasus Early Music, an early music concert series in Rochester, NY. She is a lutenist with a span of repertoire ranging from medieval to baroque music, as a soloist, chamber music player, and baroque opera continuo specialist. She has performed with the major early music ensembles and festivals in North America, including the Carmel Bach Festival, Glimmerglass Opera, Les Violons du Roy (Montreal), Spoleto Festival, Opera Atelier (Toronto), Aradia (Toronto), Tafelmusik, Concert Royal, Brandywine Baroque, Music of the Baroque and Callipygian Players (Chicago), NYS Baroque (Ithaca), and others. She has made frequent trips to Australia to work with Pinchgut Opera in Sydney. She received the Certificate of Advanced Studies in Early Music at London's Guildhall School of Music, specializing in the improvised accompaniment practices of the seventeenth century. Her teachers have included Paul O'Dette and Nigel North. She performs as a regular member of the baroque chamber music ensemble Fioritura. She has made recordings for Naxos, Sonabilis, the Australian Broadcasting Corporation (ABC), and Centaur. She has been a Teaching Artist for the Aesthetic Education Institute. Deborah Fox, theorbo Steven Zohn performs on historical flutes with ensembles across the eastern United States, and is co-director of the Philadelphia ensemble Night Music, having previously served as founding co-director of The Publick Musick in Rochester. Among his recordings on the Acis, Avie, Centaur, Chandos, and Newport Classic labels are premieres of duets, trios, and cantatas by Telemann. He has taught for The Juilliard School’s graduate program in historical performance and for Amherst Early Music, and his contributions to the study and performance of early music were recognized by the American Musicological Society’s Noah Greenberg Award. Also a musicologist, he was the first American recipient of the prestigious Georg Philipp Telemann Prize from the city of Magdeburg (the composer’s birthplace). His writings include the books Music for a Mixed Taste: Style, Genre, and Meaning in Telemann’s Instrumental Works (Oxford, 2008), The Telemann Compendium (Boydell, 2020), and Telemann Studies (Cambridge, 2022). He is is Laura H. Carnell Professor of Music Studies at Temple University. Steven Zohn, flute Alissa Smith , violist, holds music degrees from the Australian National University and the Juilliard School, where she was a Teaching Fellow. Her five-year tenure as violist of the Canberra String Quartet included recitals at Carnegie Hall; performances at the Park City, Aspen, Bravo! Colorado, and Steamboat Springs music festivals; and a residency with the Emerson String Quartet. A versatile performer on modern and baroque violas, Alissa has appeared with The Knights at the Tanglewood, Caramoor and Ravinia Festivals, and toured Australia and North America with The Australian Chamber Orchestra. She has performed with NOVUS, New York City Ballet, Orchestra of St. Luke’s, American Composers Orchestra, Klangforum Wien and the Houston Symphony Orchestra. International festival appearances include the Sydney Festival alongside Lou Reed and at the Istanbul International Jazz Festival. As a baroque violist Alissa currently performs with Clarion, NYBI, The Sebastians and Trinity Baroque Orchestra, and recently appeared with Apollo’s Fire, Opera Lafayette, NY Collegium and at the Staunton, Teatro Nuovo and Carmel Bach Festivals. Alissa can be heard on recordings of numerous movie soundtracks including “Casanova,” “Julie and Julia,” “True Grit” and “Keeping Up with the Joneses”; period instrument recordings of Bach Motets with The Trinity Choir and Mozart Symphonies with Apollo’s Fire; and on the multi Grammy award winning album “Winter Morning Walks” with the Australian Chamber Orchestra. Alissa Smith, viola Gesa Kordes performs with numerous chamber ensembles and Baroque Orchestras on both sides of the Atlantic, most recently with the Tallahassee Bach Parley, Opera Lafayette, Bama Baroque, Ensemble Tra i Tempi, Harmonie Universelle, and the Churpfälzische Hofcapelle Mainz. She has toured as soloist and chamber musician in the U.S., Central America, Europe, and Israel and has recorded for NPR, harmonia mundi, FONO, Centaur, Dorian, and Naxos. Since 1998, Ms. Kordes has been increasingly in demand as performer at international music festivals including the Victoria Bach Festival in Victoria, TX, Troisdorf Barock in Troisdorf, Germany, and the Staunton Music Festival in Staunton, VA. With master's degrees in violin and musicology from Indiana University, Ms. Kordes has taught at Indiana University’s Early Music Institute and the University of North Carolina at Greensboro before joining the faculty of the University of Alabama in 2009, where she directs the early chamber ensembles and teaches Baroque strings, music history, and performance practice. Gesa Kordes, violin Molly Werts McDonald, a native of Fairway, Kansas, has been a violinist in the Rochester Philharmonic Orchestra since 2013. With a Bachelor of Music degree and a Certificate in World Music, Molly was one of RPO Concertmaster Juliana Athayde’s first students at Eastman. She then continued on to complete a Master of Music degree at the Cleveland Institute of Music with William Preucil. Molly’s first exposure to baroque violin came through the Eastman Collegium, led by Paul O’Dette and Christel Thielmann, and she was fortunate to play in master classes with artists such as Elizabeth Wallfisch and Kristian Bezuidenhout. She went on to work with Julie Andrijeski in the Case Western Reserve Baroque Orchestra and has since enjoyed opportunities to perform with Publick Musick, Pegasus Early Music, Christ Church Schola Cantorum, Third Thursdays at the Memorial Art Gallery, and New York State Baroque. In 2016, Molly spent a summer at the Tafelmusik Institute in Toronto, studying with Jeanne Lamon, Julia Wedman, and other members of the Tafelmusik ensemble. In addition to the RPO and Baroque violin, Molly is passionate about teaching, and has her own private studio as well as coaching and coordinating chamber music for the Hochstein music school.  She is a founding member of the Salaff String Quartet along with three other members of the RPO. Molly Werts McDonald, violin Violinist Kurt Munstedt has been a member of the Rochester Philharmonic Orchestra since 2023. He was previously Assistant Principal second violin of the Louisiana Philharmonic Orchestra, and Principal second violin of the Boston Festival Orchestra. While in New Orleans, Kurt taught violin at the University of New Orleans, and founded its quartet-in-residence, The Lott String Quartet. He founded the period-performance collective Rogue Baroque and the crossover quartet Radio Bird. Originally from Needham, Massachusetts, he holds Bachelor of Music degrees in violin and audio recording from the Cleveland Institute of Music, and a Masters degree from Carnegie Mellon University. His principal teachers include Joel Smirnoff and Andres Cardenes. Additionally, he has performed with the Schleswig Holstein Festival Orchestra, Pacific Music Festival, Tafelmusik Summer Institute, The Sebastians, and Manhattan Chamber Players. Kurt Munstedt, violin Christel Thielmann is assistant professor of Conducting and Ensembles at the Eastman School of Music, where she has directed and coached the Eastman Collegium Musicum, the Eastman Collegium Baroque Orchestra, the Eastman Collegium Viol Consort, and numerous other ensembles since 1978. As viola da gambist, flutist, and recorder player, she has toured extensively as a member of The Musicians of Swanne Alley and has appeared with Fretwork, The Parley of Instruments, The Harp Consort, Tafelmusik, and the Boston Early Music Festival Orchestra. She has performed at many of the leading early music festivals including those in Boston, Vancouver, Barcelona, Edinburgh, Aldeburgh, Bath, and Regensburg, as well as numerous appearances on the English and Dutch Early Music Networks. She has recorded for the BBC, Westdeutscher Rundfunk, NPR, Virgin Classics, harmonia mundi, Hyperion, CBC, Focus, and Pantheon Records. Christel Thielmann, viola da gamba Cynthia Roberts is one of America's leading baroque violinists and has appeared as soloist, leader, and recitalist throughout North America, Europe, and Asia. She has served as concertmaster of the New York Collegium, Apollo's Fire, Concert Royal, and Les Arts Florissants. She performs regularly with Trinity Baroque Orchestra, Tafelmusik, and the American Bach Soloists and is a principal player with the Carmel Bach Festival. She has appeared with the London Classical Players, Taverner Players, Clarion Music Society, American Bach Soloists and Smithsonian Chamber Players. Her playing was featured on the soundtrack of the film Casanova and she has performed live on the Late Show with David Letterman. She has toured South America as concertmaster of the Los Angeles ensemble Musica Angelica with actor John Malkovich in The Infernal Comedy: Confessions of a Serial Killer and appeared as guest soloist and concertmaster with the New World Symphony conducted by Michael Tilson Thomas . Ms. Roberts teaches at the Juilliard School, the University of North Texas, and the Oberlin Baroque Performance Institute. She has given master classes at Eastman, Indiana University, the Cleveland Institute, Cornell, Rutgers, the Minsk Conservatory in Belarus, the Leopold Mozart Zentrum in Augsburg, the Utrecht Early Music Festival, The Middle School of the Shanghai Conservatory, and for the Jeune Orchestre Atlantique in Santes, France. Her recording credits include Sony, Analekta, BMG/Deutsche Harmonia Mundi, and Eclectra. View fullsize Cynthia Roberts, violin Violinist Anthony Marini specialises in Baroque music and is often featured as a concertmaster or soloist with ensembles such as the Finnish Baroque Orchestra, Espoo Baroque, the King’s Road Musicians, Ensemble Floridante, the Corelli Consort, and Barokkanerne. He also plays regularly in the Helsinki Baroque Orchestra, Ensemble Nylandia and Fioretto Ensemble. Anthony also actively performs chamber music with groups such as the Rosetta Ensemble, the Eloisa Consort, Avanti!, Ensemble Stravaganza, and other chamber ensembles. He has played with a wide variety of ensembles including Opus X, the Jaye Consort, the King’s Consort, Le Poème Harmonique, Les Ambassadeurs, Ensemble Zaïs, and the Folger Consort. Anthony’s playing can be heard on recordings published by FiBO Records, BIS, Sony, Paraty, Ondine, and Erato. Anthony teaches at summer courses such as Käläviä goes Baroque and the Helsinki Early Music Association’s summer course in Orivesi, and teaches Baroque violin at the Sibelius Academy. He is also the co-artistic director of the Finnish Baroque Orchestra with Marianna Henriksson. Anthony began his music studies in the United States of America, where he studied modern violin with Jody Gatwood at the Catholic University of America and baroque violin extracurricularly with Risa Browder. In 2010 he moved to Europe, where he continued his studies at the Sibelius Academy and the Conservatoire de Paris (CNSMDP), under the tutelage of Minna Kangas, Sirkka-Liisa Kaakinen-Pilch, and François Fernandez. Anthony enjoys both classical and folk music and can be seen playing the violin, viola da gamba, nyckelharpa, or viola d’amore. Anthony plays on a Baroque violin made by Jason Viseltear, made possible by the support of the Finnish Cultural Foundation. Anthony Marini, violin Dongsok Shin was born in Boston, started modern piano lessons at the age of four with his mother, Chonghyo Shin, and continued studying with Nadia Reisenberg at the Mannes College of Music. Post college, he converted exclusively to early keyboard instruments – fortepiano, harpsichord, and organ – in the early 1980s. Mr. Shin has been a member of the internationally acclaimed baroque ensemble REBEL since 1997. He has appeared with the American Classical Orchestra, the American Symphony Orchestra, ARTEK, Bach Sinfonia (Washington), Concert Royal, Dryden Ensemble, Early Music New York, New York Philharmonic, NYS Baroque, Orchestra of Saint Luke’s, Orpheus Chamber Orchestra, Parthenia, Pro Musica Rara, Tempesta di Mare (Philadelphia), and the Washington Bach Consort, among others. He has accompanied Renée Fleming, Rufus Müller, Jed Wentz, Marion Verbruggen, and Barthold Kuijken in recital. He received international recognition as music director of baroque opera productions with the Mannes Camerata. He has toured throughout the Americas and Europe and has been heard on numerous radio broadcasts. Mr. Shin is well known as a performer, recording engineer, producer, and editor of early music recordings for Acis Productions, ATMA Classique, Bridge, Dorian Sono Luminus, Ex Cathedra, Helicon, Hollywood Records, Lyrichord, Naxos, and Newport Classic. He tunes and maintains early keyboard instruments for the Flint Collection in Delaware, and in New York City for the Metropolitan Opera, and the Metropolitan Museum. His YouTube videos produced by the Met Museum, demonstrating their earliest known Bartolomeo Cristofori fortepiano, have garnered almost a half-million views. He and his wife, the early keyboard player, Gwendolyn Toth, have three grown children, two cats, and 17 early keyboards at last count. Dongsok Shin, harpsichord Rochester-born tenor Jeffrey Thompson completed his studies at the College-Conservatory of Music, University of Cincinnati with William McGraw. In 2001, he was awarded First Prize in the Concours International de Chant Baroque de Chimay , Belgium under the jurisdiction of William Christie and selected to participate in the first edition of Jardin Des Voix with the French baroque ensemble Les Arts Florissants in a concert tour of Europe’s prestigious theaters. This resulted in a series of performances with Les Arts Florissants including Hercules and Acis & Galatea (Handel), Charpentier’s Messe des morts and Te Deum (recorded for Virgin Classics) and as the tenor soloist in the DVD recording of In Convertendo (Rameau). Other highlights of his career included the role of Zotico in Cavalli’s Eliogabalo under the direction of René Jacobs, Atys in Rameau’s Les Paladins in Basel, Aldobrandin in Gretry’s Le Magnifique (recorded for Naxos), Lurwel in Montsigny’s Le Roi et Le Fermier (recorded for Naxos), Monsieur Riss in Philidor’s Les Femmes Vengées (recorded for Naxos), Rameau’s Les Fêtes de l’Hymen et de l’Amour (DVD recorded for Naxos) all under the direction of Ryan Brown (Opera Lafayette) in New York, Washington and Versailles, the title role in Rameau’s Hippolyte et Aricie in Budapest, Acamas in Royer’s Pyrrhus (recorded for the label Versailles Spectacles), the title roles in Rameau’s Castor et Pollux in Sydney (recorded with Pinchgut Opera) and Monteverdi’s Il Ritorno d’Ulisse in Patria in the production of William Kentridge and Philippe Pierlot (Ricercar Consort) in New York, Korea, Versailles, Berlin, Luxembourg and Palermo. An avid recitalist and recording artist, he can be heard on CDs including Charpentier’s and Lully’s Te Deum and “Son of England,” both with Vincent Dumestre ( Le Poème Hamonique ), Buxtehude’s Membra Jesu Nostri with Philippe Pierlot, music of De Negri and Zamponi with Marco Horvat, a CD dedicated to the songs of Henry Lawes, motets of Sebastian de Brossard and sacred anthems for three male voices by Henry Purcell with ensemble La Rêveuse , and a solo CD with gambist Philippe Pierlot and theorbist Daniel Zapico entitled “An Englishman’s Ballad.” Future projects for 2023 include Monteverdi’s Vespers and Bach’s Saint John’s Passion in Canada with L’Harmonie Des Saisons, a North American tour/recording of the music of Henry Purcell with the Canadian viol Consort, Les Voix Humaines, concerts in Western New York with the Rochester based early music ensembles Pegasus and Publick Musick, Dowland lute songs with Les Voix Humaines and lutenist, Nigel North, the world premier of Thomas Arne’s opera The Guardian Out-witted with Brandywine Baroque, concerts of tenor duets by Claudio Monteverdi and newly discovered duets by his contemporaries with the tenor, Aaron Sheehan as well as a recording of newly discovered arias and cantatas for tenor by the forgotten genius, Christoph Graupner, in Montreal. After spending twenty years living in Paris, France, Mr. Thompson decided to relocate back to Rochester, New York but continues to perform and record in Europe. Jeffrey Thompson, tenor Praised for her “sparkle and humor, radiance and magnetism” and hailed for “a voice equally velvety up and down the registers”, Laura Heimes is widely regarded as an artist of great versatility, with repertoire ranging from the Renaissance to the 21st century. She has collaborated with many of the leading figures in early music, including Andrew Lawrence-King, Julianne Baird, Tempeste di Mare, The King’s Noyse, Paul O’Dette, Chatham Baroque, Apollo’s Fire, The New York Collegium, Voices of Music, Brandywine Baroque, Trinity Consort, and Piffaro – The Renaissance Band. She has been heard at the Boston, Connecticut, Berkeley and Indianapolis Early Music Festivals, at the Oregon and Philadelphia Bach Festivals under the baton of Helmuth Rilling, at the Carmel Bach Festival under Bruno Weil, and in Rio de Janeiro and Sao Paulo, Brazil in concerts of Bach and Handel. With the Philadelphia Orchestra she appeared as Mrs. Nordstrom in Stephen Sondheim’s A Little Night Music. December 2003 marked her Carnegie Hall debut in Handel’s Messiah with the Masterwork Chorus and in December 2011 she appeared in the acclaimed staged production of the same work with the Pittsburgh Symphony under Maestro Honeck. A native of Rochester NY, she holds her Bachelor’s degree from SUNY Geneseo and Master of Music degrees in Choral Conducting and Voice Performance from Temple University. View fullsize Laura Heimes, soprano Characterized by The Dallas Morning News as a “countertenor full and fluent, glowing on top, dispensed with the loveliest legato,” Nicholas Garza has been hailed for intimate, engaging performances across the United States, Mexico, and Canada. An early music specialist, Garza has performed with ensembles including the Chicago Arts Orchestra, ensemble viii, Spire Ensemble, Austin Baroque Orchestra, Tactus, and Mountainside Baroque, among others. In the 2021–2022 season, he made his Ars Lyrica debut as the Sorceress in Purcell’s Dido and Aeneas. He’s excited to return to Rochester to join Publick Musick for this program of Bach and Graupner. Working with noted singer and conductor Simon Carrington, Garza was twice a singing fellow at the Norfolk Chamber Music Festival of Yale University; additional festival credits include the International Cervantino, Victoria Bach, Big Moose Bach, and Hawaii Performing Arts Festivals. A frequent performer with the American Baroque Opera Company, Garza has sung roles including the Sorceress in Purcell’s Dido and Aeneas, Ruggiero in Handel’s Alcina, Cortez in Vivaldi’s Montezuma, and Rinaldo in Handel’s Rinaldo. He also appears regularly with the Dallas Bach Society, Orpheus Chamber Singers, Orchestra of New Spain, and Incarnatus. Nicholas Garza, countertenor Caroline Giassi , a native New Yorker, began her musical studies on a Cracker Jack box violin at the age of three. She soon switched to the oboe and later found her musical home in the world of performance practice and historical oboes. She has performed with some of the top early music ensembles such as The Sebastians, Handel & Haydn Society, Opera Lafayette, Boston Early Music Festival, Pegasus Early Music, and is an American Fellow of the English Concert. In addition to performing, Caroline is a dedicated educator and has worked with students ranging from second graders in New York City public schools to undergraduate and graduate students at the University of Michigan where she is a continuing guest artist teaching baroque oboe and coaching performance practice. Caroline Giassi, oboe Aika Ito , a native of Tokyo, Japan, joined the first violin section of the Rochester Philharmonic Orchestra in September 2014. Previously she was a member of the Canton Symphony Orchestra and the Akron Symphony Orchestra. She has participated in several summer festivals including the Pacific Music Festival, Schleswig Holstein Music Festival, and the Tanglewood Music Festival. She plays in the Blossom Festival Orchestra and Rochester Chamber Orchestra, and subs in The Cleveland Orchestra. She is a violist of the Salaff String Quartet with RPO members Thomas Rodgers, Molly McDonald, and Benjamin Krug. As a baroque violinist, she is a member of the Christ Church Consort and Schola Cantorum. Ito began studying the violin at the age of four. She holds a Bachelor of Music degree from the Toho School of Music in Tokyo, where she studied with Tsugio Tokunaga, former concertmaster of the NHK Symphony Orchestra. She earned an artist diploma at the Cleveland Institute of Music with Stephen Rose, principal 2nd violinist of the Cleveland Orchestra. During her education, she also studied with Mayumi Ohira, Kumi Iguchi, Akihiro Miura and Asako Urushihara. Aika Ito, violin and viola Historical clarinetist Dominic Giardino enjoys a varied professional life exploring the intersections of history and performance. Dominic was first introduced to historically informed performance through the lens of 19th-century band music with Newberry’s Victorian Cornet Band in 2013, and since then has performed with a variety of ensembles specializing in HIP in the U.S. and Europe, including the Arcadia Players (USA), Grand Harmonie (USA), Three Notch'd Road: The Virginia Baroque Ensemble (USA), Raleigh Camerata (USA), Capricornus Consort Basel (CH), and The Kingsbury Ensemble (USA). In addition to freelancing, Dominic has worked as a historical interpreter and musician with The Colonial Williamsburg Foundation, where his research focussed on military bands during the American War of Independence. During that time, he also served as the operations manager of Three Notch’d Road: The Virginia Baroque Ensemble. He is currently the executive director of the Tucson-based concert series, Arizona Early Music. Dominic earned his B.M. in clarinet performance at the Eastman School of Music where he studied with Ken Grant and Jon Manasse, and his M.M. in early music as a U.S. Fulbright Scholar in The Hague, studying with Eric Hoeprich. Dominic Giardino, clarinet Julie Andrijeski is celebrated as a performer, scholar, and teacher of early music and dance. She has been recognized for her “invigorating verve and imagination” (Washington Post), “fiery and poetic depth” (Cleveland Plain Dealer), and “velvety, consistently attractive sound”(New York Times). Julie is Artistic Director of the Atlanta Baroque Orchestra, founding member of Apollo’s Fire, Creator and Director of the Wonder Chamber Project, and a frequent guest with various ensembles nationwide. Julie joined the Music faculty at Case Western Reserve University in 2007, where she teaches historical performance and directs the baroque music and dance ensembles. Julie is frequently invited to present workshops in historical dance and music throughout the U.S. She won EMA’s Thomas Binkley Award for outstanding achievement in performance and scholarship in 2015, was named a 2016 Creative Workforce Fellow by Cuyahoga Arts & Culture, and was awarded a Grammy for “Songs of Orpheus “with Apollo’s Fire in 2018. Julie Andrijeski, violin and viola Kiri Tollaksen enjoys a varied career as a performer and teacher. Equally skilled on trumpet and cornetto (a wind instrument used primarily in 17th century Western Europe), Kiri has been praised for her \"stunning technique, and extreme musicality,\" (Journal of the International Trumpet Guild). She has performed extensively throughout North America and Europe with numerous groups such as Apollo's Fire, Concerto Palatino, La Fenice, Folger Consort, Tenet, Green Mountain Project, Piffaro, Philharmonia Baroque Orchestra, New York Collegium, Huelgas Ensemble, Catacoustic Consort and Pacific Music Works. She has performed both at the Boston Early Music Festival, and at the Bloomington Early Music Festival, and she is a founding member of the ensemble Dark Horse Consort (http://darkhorseconsort.org/welcome/) As a professional trumpet player, Kiri has performed with the River Raisin Ragtime Revue in Tecumseh, Michigan, and freelances throughout Michigan. From 1996-2005, she played the Eb soprano saxhorn with the Dodworth Saxhorn Band (a re-creation of a 19th century community brass band, based in Ann Arbor. Kiri is featured on Dodworth's CD, \"Home Sweet Home.\") From 1995-2004, Kiri was a member of the Greater Lansing Symphony Orchestra under the direction of Maestro Gustav Meier. Kiri maintains a teaching studio in Ann Arbor, has taught cornetto at the Amherst and Madison Early Music Festivals and was on faculty at the Early Music Institute at Indiana Univeristy from 2006-2010. Kiri holds performing degrees in trumpet from Eastman, Yale, and a Doctorate in Musical Arts from the University of Michigan. Her discography includes recordings with the Huelgas Ensemble, La Fenice, Apollo's Fire, Piffaro, The New York Collegium, La Gente d'Orfeo, the River Raisin Ragtime Revue and the Dodworth Saxhorn Band. For upcoming concerts, please visit http://www.KiriTollaksen.com. Kiri Tollaksen, cornetto Active throughout New York State and beyond, trombonist and educator Ben David Aronson is based in Rochester, New York. A founding member of Incantare, his engagements as a historical trombonist include collaborations with Piffaro, New York Baroque Incorporated, Dark Horse Consort, Trinity Wall Street, Mercury! The Orchestra Redefined, the Washington National Cathedral Choir & Baroque Orchestra, and the Schola Cantorum of Christ Church in Rochester, NY. As a modern trombonist, Ben David has performed extensively with Symphoria, and has worked with the Rochester Philharmonic Orchestra, Buffalo Philharmonic and Erie Philharmonic orchestras, the Plymouth Brass Quintet, Symphoria Brass Quintet and as a founding member of the Hohenfels Trombone Quartet. Ben David holds the DMA from the Eastman School of Music, and serves on the faculties of the Eastman Community Music School, the Hochstein School of Music and Dance, Hobart & William Smith Colleges, and SUNY Geneseo. Ben David Aronson, sackbut New Orleans area native Melanie Russell made her NYC debut in August 2008 with Opera Omnia’s premiere production, The Coronation of Poppea, for which ClassicsToday.com stated: “[Her] creamy soprano and engaging stage presence impressed in the roles of Virtue and Damigella.” The Wall Street Journal also took note of her “steely sparkle” and “almost impossibly fast, clean runs” in Handel’s Messiah at Trinity Wall Street. In addition to freelancing in the NYC area and around the US, she toured internationally for three years with Philip Glass and Robert Wilson’s Einstein on the Beach (now available on Blu-ray disc). She made her solo debut at Carnegie Hall in April 2010 (Fauré’s Requiem) and covered the roles of 2nd Lady & 2nd Witch in the Mark Morris Dance Group’s production of Dido and Aeneas in Moscow and New York. Other notable solo appearances include Handel’s Messiah in New York, California, and Kansas City, Bach’s Jauchzet Gott in allen Landen (BWV 51) at St. Paul’s Chapel in NYC, Handel’s Dixit Dominus and Israel in Egypt (Musica Omnia), Mozart’s Exsultate, Jubilate and Requiem, Haydn’s Lord Nelson Mass, Mendelssohn’s Hör mein Bitten, Stravinsky’s Les Noces, and Magnificat settings by Bach and Mendelssohn (Naxos). In addition to her solo work, Melanie’s many years of choral and chamber music experience have culminated in performances with Bach Collegium San Diego, Antioch, TENET, Clarion Music Society, Oregon Bach Festival Choir, Santa Fe Desert Chorale, Yale Schola Cantorum, Yale Voxtet, Etherea, Seraphic Fire, Conspirare, and the Choir of Trinity Wall Street. Opera roles include Phoebe (The Cunning Man), Adele (Die Fledermaus), The Queen of the Night/ Pamina (The Magic Flute), Mme. Goldentrill (The Impresario), and Aline (The Sorcerer). Theater credits include The Music Man (Marian Paroo), The King and I (Tuptim), and Buddy! The Buddy Holly Story (Maria Elena Holly). Melanie holds the Artist Diploma in Voice from Yale University/ Institute of Sacred Music, as well as performance degrees from Loyola University New Orleans and Centenary College of Louisiana with a minor in French. Melanie Russell, soprano Currently pursuing a master’s degree at the Eastman School of Music, baritone Jason Rober enjoys a great variety of musical opportunity in the Western New York area. In opera, he has performed roles that span the history of the art form, from Giove in Cavalli’s ‘La Calisto,’ to Mortimer in Anothony Davis’s ‘Lear on the Second Floor.’ He has also had the pleasure of being a soloist in several cantatas of Bach, as well as in the B Minor Mass with the Rochester-based choral ensemble VOICES. Other highlights in oratorio include the baritone solos in Fauré’s Requiem with the Western New York Chamber Orchestra, and in Mozart’s Great Mass in C Minor with the Eastman School Symphony Orchestra. In addition to his studies in voice at Eastman under Jan Opalach, Jason obtained his B.M. in Music Education at SUNY Fredonia, where he studied with Dr. Kimberly Upcraft. Jason Rober, baritone Theresa Salomon, violin and viola A native of Germany, Theresa Salomon came to New York in 1993. The Frankfurter Allgemeine Zeitung has described her interpretations as “of the highest standard” and praised her “crystal-clear intonation” and “rhythmic precision.” She has performed in numerous international festivals, such as Festival Presence, Paris; Gulbenkian Festival, Lisbon; Prague Spring Festival; Ostfriesland Festival, Germany; Connecticut Early Music Festival; Staunton Chamber Music Festival, Virginia; and Ostrava Days for New Music, Czech Republic, where she was a soloist with the Janáček Philharmonic. Ms. Salomon performs on both baroque and modern violin in New York with ensembles such as the Orchestra of St. Luke’s, REBEL Baroque Orchestra, New York Collegium, SEM Ensemble, American Classical Orchestra, Trinity Wall Street Baroque Orchestra, and others. She also directs a new chamber music series at Music Under Construction and plays frequently for the dance wing of the organization, Dance Under Construction. Her teachers include Ulf Hoelscher, Philipp Hirshhorn, Wolfram Koenig, and Todd Philipps. She has recorded for the labels Vandenburg and Tzadik. Theresa is on the adjunct faculty of Montclair State University’s John J. Cali School of Music, teaching historic performance practice and baroque violin. Bassist Dara Bloom has performed with many luminaries of historical performance practice, recently playing with groups including Ruckus, House of Time, New Vintage Baroque, Phoenix Ensemble, Jerusalem Baroque Orchestra, Cantata Profana, Sonnambula, Bourbon Baroque, and Pegasus Early Music, as well as several summers as a fellow at Berwick Academy and professionally at the Oregon Bach Festival. Recent highlights of contemporary/modern collaborations include William Parker (album improvising string quartet and performance at Sons d’Hiver Festival in Paris), Parlando (principal/solo bass, chamber orchestra), solo performance of Sofia Bass’s Alaap in Raag in Des (BPBC), and forthcoming albums by Tyondai Braxton and Slingbaum. Larger bass section/ensemble playing includes Orchestra Lumos and Eve Beglarian's “A Murmur in the Trees” led by Robert Black. Dara regularly records and collaborates in theater, film, and dance. Dara studied at the Jerusalem Academy (Dr. Michael Klinghoffer), New England Conservatory (Don Palma), and the Juilliard School’s Historical Performance department. Introduced to the viol family by Dr. Myrna Herzog, Dara also studied cello with Marcel Bergman (Principal, IPO) and Professor Hillel Zori (Tel Aviv University), and is a recipient of the America Israel Cultural Foundation Scholarship for Outstanding Performers. Dara Bloom, violone Malcolm Matthews, harpsichord Malcolm Matthews holds both a Doctoral Degree in Organ Performance and the Artist’s Certificate from the Eastman School of Music. Currently he is the Associate Organist and Choirmaster of Christ Church Cathedral, Nashville, TN and Instructor of Organ and Harpsichord at Vanderbilt’s Blair School of Music. In addition to his organ-related studies with David Higgs, he completed a Master’s Degree in harpsichord performance in the studio of William Porter and a minor field in Collaborative Piano under Jean Barr. He particularly enjoys collaborative work and frequently answers calls to accompany both ensembles and soloists on a wide range of repertoire. He has appeared as a soloist with the Oak Ridge Symphony Orchestra, Knoxville Symphony Orchestra, and Rochester’s Philharmonic Orchestra. Matthews was a featured artist at the 2018 convention of the Organ Historical Society and his accomplishments include: First Place, 2013 Westfield International Organ Competition and Second Place, 2012 National Young Artist’s Competition in Organ Performance; Semi-finalist, 2016 International Bach Competition; Second Place, 2016 OSM Manulife Competition; First place, 2005 South-Eastern Region IV Young Organists Competition; and Semi-finalist, 2009 Concours international d’orgue de Lyon. Sue Yelanjian is the Principal Bassist for Apollo's Fire, The Cleveland Baroque Orchestra. She also performs with Tafelmusik, the Handel and Haydn Society, North Carolina Baroque Orchestra and Chatham Baroque. She attended Oberlin Conservatory and received degrees from the Cleveland Institute of Music and Boston University. She appears on numerous recordings on the Koch, Analekta, Electra and CBC labels. Sue Yelanjian, violone Austin-based soprano Shari Alise Wilson is among the new generation of singers specializing in early and modern music, demonstrating great versatility and stylistic sensitivity. Recent highlights include Bach’s St. Matthew Passion with Conspirare at the Victoria Bach Festival, Buxtehude’s Membra Jesu Nostri with Pegasus Early Music and New York State Baroque, a world premiere performance and recording of music by Gavin Bryars with The Crossing choir and the PRISM Quartet, the world premiere performance of John Luther Adams' \"Sila: The Breath of the World\" at Lincoln Center, David Lang’s Little Match Girl Passion with skybetter and associates and the Ear Heart Music Ensemble, and performances with The Crossing choir at Lincoln Center's Mostly Mozart Festival. Ms. Wilson is an active ensemble singer, performing with the Grammy award-winning ensemble Conspirare (Austin), The Crossing (Philadelphia), the Santa Fe Desert Chorale, Texas Early Music Project (Austin), Spire Chamber Ensemble (Kansas City), and Boston’s Blue Heron. She can be heard on the newly-released Blue Heron discs of Nicholas Ludford’s “Missa Regnum mundi” and “Missa Inclina cor meum,” Conspirare’s Grammy-award winning “Sacred Spirit of Russia,” and Kile Smith’s “Vespers” with The Crossing and Piffaro. Shari Alise Wilson, soprano Tracy Cowart (mezzo-soprano) enjoys a wide range of interests, from twelfth-century polyphony to contemporary art music. She has sung with period ensembles including Apollo’s Fire, La Donna Musicale, Musica Pacifica, Musica Sacra, the Newberry Consort, Opera Lafayette, Seven Times Salt, the Shenandoah Bach Festival, Three Notch’d Road, and the Washington Bach Consort. As co-director of the 17th-century ensemble Labyrinth Baroque with Richard Kolb, she stages 17th-centuty pastiches that juxtapose florid virtuosity and ribald comedy. Tracy is also a co-director of the medieval ensemble Alkemie, with whom she ponders the perspectives and sounds of centuries past, especially as they resonate with (and challenge) our modern-day perceptions. With Alkemie she has performed at the Amherst Early Music Festival, Arizona Early Music Series, Cambridge Society for Early Music, Capitol Early Music Series, Five Boroughs Music Festival, Indianapolis Early Music Festival, and Music Before 1800 Series. She currently co-directs the Collegium at Fordham University and serves as staff/faculty with the Amherst Early Music Festival. Tracy received her M.M. in Early Music from the Longy School of Music and her D.M.A. in Historical Performance Practice from Case Western Reserve University. She is also a member of the Mycological Society of New York and enjoys foraging. Tracy Cowart, mezzo-soprano Wei En Chan is a Singaporean countertenor whose singing is lauded for its “time-stopping” beauty and technical finesse. He leads an active career in Asia and North America performing the major works of Bach and Handel. Wei En has appeared in leading roles with numerous organizations including the Singapore International Festival of Art (SIFA), The Opera People (TOP, Singapore), Bachfest Malaysia, Red Dot Baroque (RDB), First Lutheran Church of Boston, Boston Opera Collaborative, the NEC Philharmonia and Concert Choir, the American Bach Soloists, Cayuga Chamber Orchestra, and others. Highlights include the title role in Handel’s Oreste with SIFA, conducted by Tian Hui Ng, Bach’s St. Matthew Passion with Bachfest Malaysia, conducted by Dr. David Chin, and Ruggiero in Handel’s Alcina with TOP & RDB. Wei En has had the privilege of performing a wide variety of music beyond his work with the standard repertoire. He has premiered many contemporary works and gave the Boston premieres of Stephan Weisman’s The Scarlet Ibis as Doodle, Ligeti’s virtuosic Nouvelle Aventures, conducted by Efstratios Minakakis, and workshopped Pulitzer Prize winner, Cerise Jacob’s videogame opera, Permadeath. Wei En has garnered awards at numerous international competitions and was nominated for the “Best Solo Performer – Vocal” at the 17th BOH Cameronian Arts Awards. Wei En’s musical journey also runs parallel to his work as an arts leader. Apart from being a founding member & Marketing Director of Carduus, Wei En is an active council member of Early Music America’s “Emerging Professional Leadership Council”, working with EMA staff and Board of Directors to encourage the development of programming and resources for emerging artists and professionals in the field of early music. Wei En draws on his many years as an administrator in various industries and largely from his time working with NEC’s Entrepreneurial Musicianship department and experiences organizing numerous grant-funded concerts and arts events in Boston and Singapore. Wei En earned his Master’s degree in Voice Performance from the New England Conservatory, where he studied with Dr. Ian Howell, and his Bachelor’s degree in Voice Performance from Ithaca College, where he studied with Professor Carol McAmis. Wei En Chan, countertenor Described by the Atlanta Journal-Constitution as a dignified and beautiful singer, Paul Max Tipton , bass-baritone, performs to acclaim in repertoire ranging from Schütz and Monteverdi to Britten and Bolcom. He solos under such notable figures as Masaaki Suzuki, Matthias Pintscher, Nicholas McGegan, Leonard Slatkin, Ton Koopman, Craig Hella Johnson, Helmuth Rilling and Martin Katz, and has performed with the Bach Collegium Japan, New York Philharmonic, Apollo's Fire, Seraphic Fire, and the Orchestra of St. Luke’s. Recent engagements include Britten’s War Requiem, Rameau’s La Lyre Enchantée, and a recording of Brahms’ Ein Deutsches Requiem, Op. 45 which earned a 2012 Grammy nomination. His singing of the Bach Passions are noted in particular for their strength and sensitivity, and in February, 2022 a recording of solo cantatas by Nicolaus Bruhns under the direction of Masaaki Suzuki will be released on the BIS label. He studied at the University of Michigan at Ann Arbor with George Shirley and at Yale University with James Taylor. Paul Max Tipton, bass-baritone Joëlla Becker is a cellist based in Rochester, NY, actively performing works in engaging andinteractive ways. Her inventive spirit sparked her passion for historical performance, and shecurrently studies with Paul O’Dette and Christel Thielmann, performing as the principal cellist of the Eastman Collegium Musicum. Joëlla earned a Diplôme d’Etudes Musicales from the Conservatoire of Bordeaux as well as from the Conservatoire of Saint Maur des Fossés and is currently pursuing her Bachelor’s Degree in cello performance at the Eastman School of Music. In addition to historical performance, Joëlla is passionate about new music, premiering works of emerging young composers and collaborating with ensembles such as OSSIA New Music and Musica Nova. In her free time, Joëlla loves spending time with family and friends and listening to 60s pop music. Joella Becker, cello Elizabeth Sommers, violin Elizabeth Sommers began playing classical violin at the age of eight and discovered her love for early music while singing in the choir of Christ Church, Rochester. In her junior year of high school she began lessons on the baroque violin with Boel Gidholm; the following year she joined the Schola Cantorum of the Eastman School of Music, with which she performed Gregorian chant and Renaissance and baroque motets for the weekly Office of Compline. She spent one academic year at the Jacobs School of Music in Bloomington, Indiana, during which time she performed regularly with the Bloomington Bach Cantata Project and with Tonos del Sur, an ensemble dedicated to the performance of the earliest music published in Latin America. Elizabeth is now entering the second year of her bachelor’s degree at the Schola Cantorum Basiliensis in Basel, Switzerland, studying medieval vielle with Baptiste Romain and baroque violin with Leila Schayegh. She has played in masterclasses for Ingrid Matthews, Enrico Gatti, and Odile Eduoard. Her musical interests are wide-ranging; she is an enthusiastic player of traditional music, performs often for Contra and English Country dances, and enjoys writing original tunes in various folk styles. Soprano Madeline Apple Healey is known for her “gorgeous singing\" (Washington Post) and “fetching combination of vocal radiance and dramatic awareness” (Cleveland Plain Dealer). This season brings debuts with Pegasus Early Music and Portland's Oratorio Chorale, a remounting of Ellen Reid’s Pulitzer Prize-winning  p r i s m at the Kennedy Center, as well as appearances with The American Classical Orchestra, L’Académie du Roi Soleil, Academy of Sacred Drama, Amor Artis, Apollo’s Fire, Baldwin Wallace Bach Festival, The Clarion Music Society, Novus NY, and New York Baroque, Inc. Recent engagements have included appearances at Festival Oude Muziek Utrecht, Aldeburgh Festival/Snape Proms, the Kennedy Center, LA Opera, National Opera House in Wexford, Ireland, premieres at National Sawdust, Lincoln Center’s White Light Festival, Spoleto Festival USA, Ad Astra Festival, and PROTOTYPE Festival, as well as collaborations with Urban Playground Chamber Orchestra, Variant 6, and les soûls d'amour. Specializing primarily in early and contemporary repertoire, Madeline is passionate about polyphony and loves working on music that challenges the construct of beautiful sound. She is equally at home in standard repertoire, and operatic credits include Olympia (Les Contes d’Hoffmann) a role in which she was praised for her “crystal clear coloratura” (Princeton Town Topics), La Musica/Ninfa (L'Orfeo), Hébé (Les Indes galantes), Papagena (Die Zauberflöte), Despina (Cosi fan tutte), Susanna (Le nozze di Figaro), and Cunegonde (Candide). Madeline is a member of the GRAMMY-nominated Choir of Trinity Wall Street and cofounder of AMPERSAND, a vocal chamber ensemble that prioritizes the work of female artists. She appears internationally as a soloist and ensemble singer. Madeline holds degrees in voice from Westminster Choir College and Baldwin Wallace University. A native of Cleveland, OH, she now resides in Brooklyn, NY where, when she's not making music, she can be found cooking, rock climbing, eating french fries, and spending time with her husband Teddy and their many houseplants. <madelineapplehealey.com> Madeline Healey, soprano View fullsize Mischa Bouvier, baritone Baritone Mischa Bouvier has been praised for his “extraordinary and varied background” and “rare vocal and interpretive gifts” (San Francisco Classical Voice), \"beautiful tone\" ([Q]onStage], and “rich timbre” and “fine sense of line” (New York Times). He continues to impact audiences with his keen musicality and remarkable communicative ability. Mischa’s recent performances have included the New York premiere of Jocelyn Hagen’s amass with Musica Sacra at Lincoln Center; Arvo Pärt’s Passio (Evangelisti) for the “collected stories” series at Zankel Hall, curated by David Lang and conducted by Julian Wachner; Apollo in Handel’s Apollo e Dafne and Polyphemus in Handel’s Acis and Galatea with the American Bach Soloists; the role of Dr. P in Michael Lyman’s opera The Man Who Mistook his Wife for a Hat with the Orchestra of St. Luke’s and New York Live Arts; Fauré’s Requiem and Vaughan Williams’s Five Mystical Songs with the Princeton Glee Club; Bach’s St. Matthew Passion with Iván Fischer and the Orchestra of St. Luke’s at Stern Auditorium, and with Helmuth Rilling and the Orquesta Sinfónica de Puerto Rico at the Festival Casals; and recitals throughout the United States, and in Europe and Asia. Other highlights include Handel’s Messiah with the American Bach Soloists at Grace Cathedral and the Mondavi Center; the premiere of Bryan Page's song cycle The Edith Poems at Strathmore; Bach’s St. John Passion (Pilate and arias) with the Saint Thomas Choir of Men and Boys under the direction of the late John Scott; the role of Lucifer in Handel’s La Resurrezione with the Helicon Ensemble at the Morgan Library and Yale University; the role of Malatesta in Don Pasquale with Opera in the Heights and Bronx Opera; the premiere of songs by several living Swedish composers with the Mirror Visions Ensemble in Paris; the role of Alwan in Mohammed Fairouz’s opera Sumeida’s Song at Zankel Hall; performances with the Alabama Symphony (Messiah), the Columbus Symphony Orchestra (Brahms’s Requiem), the Colorado Symphony (Messiah) and the Stamford Symphony (Mozart’s Requiem); and a Boston Symphony Hall debut singing the role of Jigger Craigin in a semi-staged performance of Rodgers & Hammerstein's Carousel with Keith Lockhart and the Boston Pops. Yetzabel Arias Fernández, soprano Yetzabel Arias Fernández was born in Havana, Cuba, where she started her musical studies in cello and piano. She graduated in choral conducting at the Amadeo Roldán Conservatory and in singing at the Instituto Superior de Arte in Havana. She continued her postgraduate studies in Italy, under the direction of Vincenzo Manno in Milan. She has also taken courses in 17th-century Italian music interpretation with Roberto Gini at the Accademia Internazionale della Musica di Milano. Currently she is a student at the Manny Perez Vocal Studio in Miami, Florida. Ms. Arias won First Prize in the International Competition of Baroque Singing in Chimay, Belgium, as well as First Prize and Audience Prize at the Printemps des Arts de Nantes Festival. She has also won prizes in the Concorso Internazionale di Canto Barocco F. Provenzale in Naples, as well as in the Concorso Internazionale di Musica Sacra in Rome. During her years in Europe she worked with the most distinguished Italian ensembles and orchestras performing in important venues and halls such as the Santa Cecilia concerts season in Rome, Orchestra of the Teatro dell'Opera di Roma, Ochestra RAI di Turin, Théâtre Graslin de Nantes, Societa del Quartetto in Milan, Auditorium G. Verdi in Milan, Konzerthaus in Berlin, Concertgebouw of Amsterdam, Auditorio Nacional of Madrid, as well as at Festivals in Bruges, Cologne, Stuttgart, Melk, Dortmund, Graz, Vienna, Ambronay, Santiago de Compostela, Barcelona, Utrecht, Florence, etc. In 2013 she began an important collaboration with Maestro Ton Koopman, who has conducted her in Mozart Requiem and Exultate Jubilate with The Hague’s Philharmonic Orchestra, Bach B Minor Mass at Leipzig BachFest and Zürich Tonhalle, Beethoven’s 9th Symphony with Arena di Verona Orchestra, Bach’s Christmas Oratorio in a European tour with Amsterdam Baroque Orchestra and Choir, Mozart’s C Minor Mass with Lyon National Orchestra, Bach's St. Matthew Passion with Symphony Orchestra of La Coruña, Spain, and Bach Cantatas with Filarmonica Arturo Toscanini of Parma, Italy. Some of her past opera and oratorio engagements include Mozart's Don Giovanni at the Miami Summer Festival; Handel’s Alessandro in Karlsruhe, Germany; Pergolesi’s Olimpiade at the Opera Rara Festival in Krakow (Polish premiere) and in Jesi, Italy; and Handel's Il Trionfo del Tempo e del Disinganno with La Risonanza. She has performed Bach's St. Matthew Passion with Diego Fasolis in Lugano, and the B Minor Mass with Jordi Savall at the Fontfroide and Graz Festivals (recorded on DVD). In 2012, Ms. Arias Fernández made her American debut at the Library of Congress in Washington DC with the Italian ensemble La Risonanza, receiving excellent reviews from the press and audience. Ms. Arias has recorded several CDs and DVDs, among them Handel’s cantata “Tirsi, Clori e Fileno” which won the important Stanley Prize 2010 in London as the Best Handel recording of the year. In 2013 she took part as soloist in Cecilia Bartoli's new CD “Stabat Mater” on EMI. In 2014, two solo CDs featuring Yetzabel Arias Fernandez were released: songs from the Guerra Manuscript (17th-century Spain) with the ensemble Ars Atlántica on the Naxos label, and soprano cantatas by Neapolitan composer Niccolò Jommelli with the ensemble Stile Galante on the Glossa label. For more information, reviews, and media samples, please visit YetzabelArias.com Eloy Cortinez, recorder Eloy Cortinez came to the recorder at an early age and began his studies at the Castella Conservatory in San Jose, Costa Rica. He holds a degree “suma cum laude” in recorder performance from the Catholic University of his native Chile. Following graduation, he was awarded a scholarship to perfect his skills at the Civica Scuola di Musica in Milan, Italy, where he studied recorder with Pedro Memelsdorff. Eloy lived in Italy for over a decade, absorbing the history and culture there and collaborating with leading Italian and European musicians, before moving to the U.S. He has performed extensively in Europe and North, Central and South America and was honored by an invitation to perform for the 100th anniversary of the National Theater of Costa Rica. He is a founding member of l’Invenzione Baroque Ensemble, introducing audiences to the wonders of Neapolitan baroque instrumental music. He has appeared with the Michigan Opera Theater and on such concert series as the Academy of Early Music in Ann Arbor, MI, as well as the Detroit Institute of Arts. Eloy is fond of reaching new audiences and has thrilled listeners with his playing in a variety of venues that have included medieval castles, a huge courtyard covered with renowned industrial murals and even a yurt! One of his latest solo projects was a series of lectures and performances of the 12 Telemann fantasies for recorder. Eloy transmits his enthusiasm for his beloved instrument through teaching and has given numerous recorder workshops and lectures at the University of Costa Rica and masterclasses for the recorder class of the Catholic University of Chile. Joëlle Morton is a widely sought performer and teacher in North America, Europe, Australia and Brazil, specializing in a variety of period instruments, including Renaissance and Baroque violas da gamba, violone and double bass. She is artistic director for the Scaramella concert series in Toronto, where in addition to numerous other freelance performing affiliations, she teaches viola da gamba and historical bass at the University of Toronto, and is the official Viol Consultant for the Hart House viols collection. Joëlle is also much in demand as a musicologist and clinician, presenting lecture/demos on the history and development of string instruments. She is the author of a number of scholarly articles and urtext performing editions of music. Her website (www.greatbassviol.com) serves as an important international resource to those interested in researching large bowed bass instruments. Joëlle Morton, violone Priscilla Herreid, oboe Priscilla Herreid plays period oboes, recorders, and a multitude of renaissance wind instruments with some of the finest ensembles in the US and abroad. She appears regularly with Piffaro, The Handel + Haydn Society, Trinity Baroque Orchestra, Tempesta di Mare, The Sebastians, Boston Baroque, and Hesperus, and can often be seen with Portland Baroque, Tenet, Venice Baroque, Philharmonia Baroque, Ex Umbris, The Waverly Consort, New York Baroque Inc., and The City Musick. Priscilla was part of the onstage band for the Shakespeare on Broadway productions of Twelfth Night and Richard III, starring Mark Rylance. She is former director of the Early Music Ensemble at Temple University, and is on the faculty of the Madison (WI) Early Music Festival, where she directs recorder and alta capella ensembles. For several years, Priscilla was the soprano at various New York City parishes that celebrate the Latin mass, and still sings occasionally for the mass around NY and CT. She was recently featured as guest recorder soloist in Vivaldi's C Major concerto (RV 443) with the Portland Baroque Orchestra. Priscilla's playing has been called “downright amazing” by the Philadelphia Inquirer, “particularly fine” by the Washington Post, and the New York Times has praised her “soaring recorder, gorgeously played...” She is a graduate of Temple University and The Juilliard School. www.priscillaherreid.com Originally trained as a linguist, oboist Fiona Last aims to explore as many musical languages as possible. From playing 16th-century polyphony on the shawm to performing Stravinsky with John Adams, she is always seeking out new instruments to play and new musical idioms through which to express herself. Her interest in early instruments stems from the belief that we all seek to mine the most potential possible from the music that we play, and that understanding a musical style through the instrument for which it was written and vice-versa can bring a special kind of life to music-making. She has performed with The Handel + Haydn Society, Tempesta di Mare, the Carmel Bach Festival, Piffaro, Sonnambula, and the Bach Festivals of Philadelphia and Charleston, and is currently a fellow with the Orchestra of the Age of Enlightenment. Fiona holds a Master’s degree in Historical Performance from The Juilliard School; she also received MM and BM degrees in oboe performance from the Yale School of Music and Temple University respectively, and a BA in Arabic and Ethnomusicology from The School of Oriental and African Studies in London. Fiona Last, oboe View fullsize Daniel Elyar, viola Daniel Elyar is an active performer and recording artist and has specialized in baroque performance practice in Europe and North America for over twenty years. Mr. Elyar has performed and recorded with ensembles in North America and Europe such as Tafelmusik, the Utrecht Baroque Consort, Concerto d’Amsterdam, Teatro Lirico, Concerto Palatino, the Boston Early Music Festival Orchestra, the New York Collegium, Ensemble REBEL (NYC), NYSEMA, Tempesta di Mare and Clarion Players and Choir (NYC) and the Trinity Baroque Orchestra on Wall street. Mr Elyar is the former director of the renaissance collegium at Temple University. Mr. Elyar has taught over twelve years at the Settlement Music School in Philadelphia and is full-time faculty there. Mr. Elyar holds a Bachelor of Music from the Cleveland Institute of Music, and Artist’s Diploma from the Sweelinck Conservatory (Amsterdam) and a Masters of Music from the Royal Conservatory (the Hague). Some of Mr. Elyar’s teachers are Heidi Castleman, Sigiwald Kuijken, Lucy van Dael and Monica Huggett. Mr. Elyar has performed under the baton of directors as Andrew Parrott, Gustav Leonhardt, Ton Koopman & William Christie. Mr Elyar has recorded for Chandos, Naxos, ELECTRA, ATMA, Musica Omnia and Hungarton labels. Brian Shaw,  trumpet “Brian Shaw epitomizes the versatile twenty-first century trumpeter.” – Elisa Koehler, Fanfares and Finesse Brian Shaw is Julian & Sidney Carruth Associate Professor of Trumpet/Jazz Studies at Louisiana State University in Baton Rouge. He is also Principal Trumpet of the Baton Rouge Symphony, Co-Principal Trumpet of the Dallas Winds, and enjoys an international performing career as a modern and historical trumpet artist. This season, Shaw has performed as a soloist in Houston, Denver, and continues as Visiting Professor of Baroque Trumpet Studies at the Eastman School of Music. He also continues his research as co-author (with Nick Smart of the Royal Academy of Music, London) of a biography titled Song For Someone: The Musical Life of Kenny Wheeler for Equinox Books, UK. Over the past year, Shaw has performed in concert alongside saxophonist Branford Marsalis. as guest principal trumpet of the Kansas City Symphony, made his debut on keyed trumpet (performing Haydn's Concerto in E-flat with Austin's La Follia Baroque), and was the featured trumpet soloist with the Dallas Wind Symphony on John Williams' \"With Malice Toward None\" from the Spielberg film Lincoln. He has recently toured Europe with the Boston Early Music Festival Orchestra, was the only American Baroque trumpet soloist featured in the final concert of the 2014 International Trumpet Guild Conference, and performed as a soloist with the Hong Kong Wind Philharmonia. Shaw's most recent solo CD, redshift (accompanied by the Dallas Wind Symphony), was issued in 2014 on Klavier Records. Shaw has won prizes in several international trumpet competitions and is the dedicatee of numerous new works, including Brett William Dietz’s redshift and Joseph Turrin’s Two Images. He can also be heard as principal trumpet on recordings with the University of Texas Wind Ensemble (Naxos Records) the Eastman Wind Ensemble (Danzante, on Summit Records), the Dallas Wind Symphony (Reference Recordings), and the professional choral ensemble Conspirare (Harmonia Mundi). Active as a Baroque trumpet player, Shaw has performed throughout North America and Europe. His 2008 recording Virtuoso Concertos for Clarino includes some of the most difficult pieces ever written for the instrument and was accompanied by an orchestra comprising New York’s finest period musicians. Early Music America observed: “Shaw’s tone is beautiful, and his playing unfailingly musical… His is a voice that will make a major mark on Baroque trumpet playing.” As a jazz musician, Shaw performs regularly on the popular LSU concert series “Hot Summer Nights and Cool Jazz” alongside his colleagues pianist Willis Delony and bassist Bill Grimes. He also directs the LSU Jazz Ensemble, which has hosted such luminaries as Bobby Shew, Wayne Bergeron, Wycliffe Gordon, Denis DiBlasio, and Rufus Reid during his leadership. His books and transcriptions are published by Advance Music, Presser, Schott, and Universal Edition. Shaw holds degrees from Eastern Illinois University (B.Mus), the Eastman School (M.Mus) and the University of Texas at Austin (D.M.A.). Brian Shaw is proud to be a Yamaha Performing Artist . James E. Bobb, harpsichord James E. Bobb joined the faculty of St. Olaf College in Northfield, Minnesota in September of 2012 with more than 20 years’ experience directing church music in Lutheran and United Church of Christ congregations. As Cantor to the Student Congregation, Bobb succeeds the retired John Ferguson in three main spheres of activity at St. Olaf. As Cantor to the Student Congregation, Bobb plays organ and/or oversees the preparation of music for the six live-streamed chapel services each week (http://www.stolaf.edu/multimedia/), including Sunday morning Eucharists, for which the five large choral ensembles of St. Olaf rotate liturgical leadership. As Assistant Professor of Organ and Church Music, Bobb is one of two professors of organ and teaches church music classes in one of the few undergraduate-only programs leading to a Bachelor of Music degree in Church Music.  As director of the 100-voice St Olaf Cantorei, Bobb leads the upper-class ensemble in concerts, worship services, and the annual St. Olaf Christmas Festival. Following in the Lutheran cantorial tradition, Bobb regularly composes or improvises music for weekly worship. He recently composed a new congregational setting of the Holy Communion liturgy which was introduced to the St. Olaf College Congregation in September of 2013. Bobb holds performer’s certificates and M.M. degrees and in organ and harpsichord performance and literature from the Eastman School of Music where his teachers included Russell Saunders and David Craighead in organ and Arthur Haas in harpsichord. His undergraduate work was at Capital University where his teachers were Janet Linker in organ and Frank Hussey in piano. As the Minister of Music at First Congregational Church, Columbus, Ohio from 2009-2012, Bobb presided over a three-manual 1972 Rudolph von Becherath organ of 73 ranks, a four-manual 1931 W. W. Kimball organ of 66 ranks, four parish ensembles and two concert series. He also taught organ and organ literature at Capital University in Columbus. For fifteen years prior to that, Bobb served the Lutheran Church of the Incarnate Word in Rochester New York.  There he led parish ensembles of all ages, conducted the St. John Passion and other works by Bach, Buxtehude, Schütz, Gabrieli, Purcell, and Telemann, and led the choir on a tour of Sweden. Also in Rochester, he was director of the Rochester Bach Festival, an instructor in Sacred Music at the Eastman School of Music, Adjunct Professor of organ at Nazareth College, and a chapter dean of the American Guild of Organists. At the harpsichord, Bobb has performed Bach’s Goldberg Variations in Manhattan, Boston, Rochester, and Baltimore. He has appeared as organ and harpsichord soloist, conductor, and continuo player with The Publick Musick and the Rochester Bach Festival. With The Publick Musick, he had appeared in New York, Indiana, Maine, and Germany, and has recorded music of Telemann and Vivaldi. Bobb has also enjoyed leading hymn festivals in Ohio, New York, Georgia, and Oklahoma. Edoardo Bellotti, organ Edoardo Bellotti , associate Professor of Organ, Harpsichord and Improvisation at the Eastman School of Music, has extensive teaching experience, having been Professor of Organ, Harpsichord and Improvisation in several musical institutions and universities including the Conservatory ofTrossingen and the University of Bremen in Germany, the University of Udine and the Conservatory of Trento in Italy. A virtuoso organist and renowned improviser, Bellotti performs at leading festivals and concert venues throughout the world. He is currently collaborating in a project of new organ music and visual art in Milan, in conjunction with the art installation of the American minimalist Dan Flavin. He has performed the complete works of Cesar Franck, and has worked with orchestras in Italy and abroad, performing a wide spectrum of repertoire, including the Italian premiere ofSatyagraha by Philip Glass. He is also considered a leading expert in the performance of renaissance and baroque keyboard music. He combines his international performing career with musicological research and teaching, publishing articles as well as new critical editions of music of the 17th and 18th centuries. He is a frequent guest lecturer at international conferences. He has made several critically acclaimed recordings on historical instruments, including Promenade (Loft Recordings), a recording of organ repertoire and original improvisations on the Eastman School of Music’s Italian baroque organ at the Memorial Art Gallery in Rochester. Ekaterina Gorlova, soprano Ekaterina Gorlova , a native of Russia, completed her Bachelor of Music from the Eastman School of Music in 2017. Her private instructors included Karol Bennett-Brandt, Rita Shane, Constance Haas and Anthony Dean Griffey. She has held the position as soprano section leader at Lake Avenue Baptist Church since 2013, and has performed regularly with the Christ Church Schola Cantorum, Eastman Collegium Musicum, Eastman Voices and other concert series at the Memorial Art Gallery. She has studied historical performance practice with Grammy award winner Paul O’Dette and Ellen Hargis, and has attended the Baroque Vocal Programme of the Vancouver Early Music Festival and the American Bach Soloists Academy in San Francisco. Ekaterina performed the role of Krysia in Jake Heggie’s “Out of Darkness” and covered the title role in Massenet’s “Cendrillon” with Eastman Opera Theatre. This summer, she participated in the Boston Early Music Festival Young Artists Training Program and performed in Purcell's \"Dido and Aeneas\" with Pegasus Early Music. Clifton Massey, countertenor Clifton Massey , countertenor, is known for stylish interpretations of wide-ranging musical styles. Praised by San Francisco Classical Voice for his \"gloriously rounded tone,\" his solo and ensemble singing has taken him to many festivals and venues including Tanglewood, the Concertgebouw of Amsterdam, the Metropolitan Museum of NY, Tokyo Opera City, and the Early Music Festivals of Berkeley, Oregon, Bloomington and Boston. As a specialist in early music, Clifton performs frequently with the American Bach Soloists, Philharmonia Baroque Orchestra, the Bach Collegium San Diego, the American Classical Orchestra, and has been featured on the Bach Vespers series at Holy Trinity Lutheran and at Trinity Church Wall Street in New York City. He is an alumnus of the Grammy-winning group Chanticleer, with whom he performed over 200 concerts in a variety of the world's finest concert halls. Recent performance highlights include a disc of the music of Samuel Capricornus with ACRONYM and Holy Trinity Lutheran, Bernstein's Chichester Psalms in San Francisco, and a surprise performance at the 2018 Met Gala with iconic pop star Madonna. Clifton currently lives in Brooklyn and is a member of the Grammy-nominated professional ensemble at Trinity Church Wall Street, with whom he is proud to have been a part of the premieres of two Pulitzer Prize winning compositions: Julia Wolfe’s Anthracite Fields, and Angel’s Bone , a new opera composed by Du Yun. Publick Musick concerts are made possible by our generous donors; the Rochester Area Community Foundation; the Ralph C. Wilson, Jr. Foundation; the Lennox Foundation; Monroe County; and by the New York State Council on the Arts with the support of Governor Kathy Hochul and the New York State Legislature."
    },
    {
      "url": "https://www.ticketmaster.com/colonial-oak-music-park-tickets-st-augustine/venue/279611",
      "text": "Colonial Oak Music Park - St Augustine, FL | Tickets, 2025-2026 Event Schedule, Seating Chart Your browser is not supported. For the best experience, use any of these supported browsers: Chrome , Firefox , Safari , Edge . Skip to main content US United States selected, change country Hotels Sell Gift Cards Help VIP Ticketmaster Home page Concerts Sports Arts, Theater & Comedy Family Cities More Toggle search bar Search Search Sign In/Register Home Jacksonville, FL Colonial Oak Music Park Tickets Colonial Oak Music Park Tickets 33 St George St, St Augustine, FL 32084, US Get Directions (Opens in new tab) Events Venue Details Discover More All Events 0 Results All Events 0 Results Filter by category All Categories Dates All Dates Dates. Change date range: All Dates No Upcoming Events We're sorry, but we couldn't find any upcoming events at Colonial Oak Music Park. Please check back soon. Advertisement Venue Details Colonial Oak Music Park , 33 St George St, St Augustine, FL 32084, US Get Directions (Opens in new tab) What are the box office phone numbers? 904-209-0367 When is the box office open? In Advance: 10am-6pm Day of Event: 10 am - 6pm What payment types are accepted? Visa, Mastercard, Discover, American Express What are the will call rules? Will Call is at the front door. What are the parking options at Colonial Oak Music Park? Locations: Various Downtown Lots available Pricing: Varies per lot What are the general rules of Colonial Oak Music Park? Items NOT Allowed: - NO Illegal or Un-Prescribed Drugs - NO Personal Property that is a potential hazard to others. (ex. Chains, Wallet Chains, or Spiked Jewelry) - No Electronic Equipment Including Laptops, Computers, IPads, Audio Recorders, and Tripods. - NO Strollers - NO Weapons of Any Kind (ex. Guns, Knives, Sticks, Fireworks, Mace, and/or Pepper Spray) - NO Skateboards, Skates, or Rollerblades - NO Umbrellas - NO Chairs - NO Backpacks (Purse backpacks, Diaper bag backpacks and diaper bags are permitted) - No Animals (except service animals to aid guests with disabilities) - No Coolers of Any Kind (Including Small Soft pack Coolers) - NO Gifts for the Band - NO Musical Instruments - No Cameras with Built-In Lenses longer than a couple of inches and/or detachable lenses/flash. - NO Outside Alcoholic beverages * Camera Policy: IT IS AT THE SOLE DISCRETION OF THE ARTIST IF SMALL HANDHELD CAMERAS WITH NO DETACHABLE LENSES ARE ALLOWED INSIDE VENUE. PLEASE CONTACT VENUE FOR MORE INFORMATION. Are children allowed? Children 2 and under are free. Discover More in St Augustine Concerts Theater Sports Family Comedy Rock Pop Hip-Hop/Rap Country R&B Latin Baseball Ticketmaster Logo Let's connect (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) Download Our Apps (Opens in new tab) (Opens in new tab) By continuing past this page, you agree to our terms of use Helpful Links Help/FAQ Sell My Account Contact Us Gift Cards Do Not Sell or Share My Personal Information Get Started on Ticketmaster Our Network Live Nation House of Blues Front Gate Tickets TicketWeb universe NFL NBA NHL About Us Ticketmaster Blog Ticketing Truths Ad Choices Careers Ticket Your Event Innovation Friends & Partners PayPal Allianz AWS Our Policies Privacy Policy Cookie Policy Manage my cookies and ad choices © 1999-2025 Ticketmaster. All rights reserved."
    }
  ]
}