{
  "fuentes": [
    {
      "url": "https://vymaps.com/US/Dixie-Roadhouse-2800998/",
      "email": "jepes@liputra.com"
    },
    {
      "url": "https://mail.thedixie.com/test/find-us.php",
      "email": "party@thedixie.com"
    },
    {
      "url": "https://dixietech.edu/contact/",
      "email": "info@dixietech.edu"
    },
    {
      "url": "https://www.capecoralbreeze.com/news/business/2025/03/12/dixie-roadhouse-for-sale/",
      "email": "cjhaddad@breezenewspapers.com"
    },
    {
      "url": "https://www.dixie.k12.fl.us/",
      "email": "monicaanguish@dixie.k12.fl.us"
    },
    {
      "url": "https://logansroadhouse.com/contact-us/",
      "email": "catering@spbhospitality.com"
    },
    {
      "url": "https://logansroadhouse.com/contact-us/",
      "email": "guestexperience@spbhospitality.com"
    },
    {
      "url": "https://logansroadhouse.com/contact-us/",
      "email": "media@spbhospitality.com"
    },
    {
      "url": "https://mail.thedixie.com/old_t/",
      "email": "party@thedixie.com"
    },
    {
      "url": "https://mail.thedixie.com/m/",
      "email": "party@thedixie.com"
    },
    {
      "url": "https://www.fox4now.com/cape-coral/dixie-roadhouse-in-cape-coral-is-up-for-sale-so-whats-next-for-the-nightclub",
      "email": "bella.line@fox4now.com"
    },
    {
      "url": "https://www.fox4now.com/cape-coral/dixie-roadhouse-in-cape-coral-is-up-for-sale-so-whats-next-for-the-nightclub",
      "email": "closedcaptioning@fox4now.com"
    },
    {
      "url": "https://www.fox4now.com/cape-coral/dixie-roadhouse-in-cape-coral-is-up-for-sale-so-whats-next-for-the-nightclub",
      "email": "shahbeila.brown@scripps.com"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    }
  ],
  "mails": [
    "bella.line@fox4now.com",
    "catering@spbhospitality.com",
    "cjhaddad@breezenewspapers.com",
    "closedcaptioning@fox4now.com",
    "guestexperience@spbhospitality.com",
    "info@dixietech.edu",
    "jepes@liputra.com",
    "media@spbhospitality.com",
    "monicaanguish@dixie.k12.fl.us",
    "party@thedixie.com",
    "shahbeila.brown@scripps.com",
    "tstuder@astrosecuritymonitoring.com"
  ],
  "nombre_sitio": "thedixie.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://vymaps.com/US/Dixie-Roadhouse-2800998/",
      "text": "Dixie Roadhouse, Bar at 1023 SE 47th Terrace, Cape Coral Home Countries Articles About Add Listing Delete Edit Bar Night Club Dixie Roadhouse 1023 SE 47th Terrace, Cape Coral, FL 33904, USA United States Florida About Dixie Roadhouse is a bar, located at 1023 SE 47th Terrace, Cape Coral, FL 33904, USA. They can be contacted via phone at +1 239-541-7900 , visit their website www.thedixie.com for more detailed information. Tags : #PointOfInterest, #Establishment Location : 1023 SE 47th Terrace, Cape Coral, FL 33904, USA Contacts : +1 239-541-7900 www.thedixie.com Added by Jopie , at 23 January 2017 Summary Dixie Roadhouse, located at 1023 SE 47th Terrace in Cape Coral, Florida, is a vibrant nightlife destination known for its lively atmosphere and country-themed entertainment. This venue stands out as a popular spot for both locals and visitors looking to enjoy a fun night out. With its spacious dance floor and energetic vibe, it’s a go-to place for those who love to dance, especially to country music and line dancing. The décor reflects a classic Southern charm, creating a welcoming environment that encourages guests to let loose and have a good time. The bar at Dixie Roadhouse offers a variety of drinks, including signature cocktails, beers, and a selection of wines. Patrons often rave about the friendly bartenders who are quick to serve and always ready to recommend a drink. The drink specials are a highlight, making it an affordable option for those looking to enjoy a night out without breaking the bank. The venue also features a menu with tasty bar bites, perfect for fueling up before hitting the dance floor. Live music and DJ performances are a staple at Dixie Roadhouse, drawing in crowds eager to enjoy the entertainment. The venue frequently hosts themed nights, which can include everything from line dancing lessons to live bands playing popular country hits. This variety keeps the experience fresh and exciting, ensuring that there’s always something new to enjoy. Many guests appreciate the opportunity to learn some dance moves, making it a great place for both seasoned dancers and beginners. Reviews from visitors often highlight the friendly and welcoming atmosphere. Many people mention how the staff goes above and beyond to ensure everyone has a great time. The crowd tends to be diverse, with a mix of ages and backgrounds, which adds to the overall fun. Guests frequently comment on the sense of community that Dixie Roadhouse fosters, making it a place where friendships can be formed over shared experiences on the dance floor. The venue also offers ample space for private events, making it a popular choice for parties and celebrations. Whether it’s a birthday bash or a corporate gathering, Dixie Roadhouse provides a unique setting that can accommodate various group sizes. The combination of great music, delicious food, and a lively atmosphere makes it an appealing option for those looking to host an event that stands out. Overall, Dixie Roadhouse is more than just a bar; it’s a lively hub of entertainment in Cape Coral. With its engaging atmosphere, friendly staff, and a variety of activities, it’s a place where you can unwind, dance, and enjoy a night out with friends. Whether you’re a local or just passing through, this venue promises a memorable experience that captures the spirit of Southern hospitality. Opening Hours Monday Closed Tuesday 7:00 PM – 2:00 AM Wednesday 7:00 PM – 2:00 AM Thursday Closed Friday 7:00 PM – 2:00 AM Saturday 7:00 PM – 2:00 AM Sunday Closed Gallery Add missing information Add email Add business description Add Social Media Add Products and Services 13 Reviews Anonym 19 December 2017 One of the most happening places in this beautiful part of the world. My aunt lives in Cape Coral and I visited her last summer. Liked this particular joint report/reply this review Anonym 14 December 2017 Great place. Only knock against it that Florida bars allow smoking otherwise great fun dancing. report/reply this review Anonym 05 December 2017 One of the better places in town. If you're looking to go dance and have reasonable priced drinks and just an all-out fun time. This is one of the better places in the cape. report/reply this review Anonym 14 November 2017 Too much smoking going on inside there.  Went to enjoy a show, wife and I left before the show started.  It is overwhelming in there with smoke.  Ended up throwing out the hat I was wearing, couldn't get the smell out of it. If you go there be prepared for this. report/reply this review Anonym 18 October 2017 Best drink for the price always fun but you got to watch for barmaids taking their tip in the price they charge you . Know your drink price .  I have seen them take a dollar tip without telling you.  Buyer be aware report/reply this review Anonym 04 October 2017 Coolest bar I've been to in Florida!!!! Lots of fun. They have a hugeeeee group of people square dancing to all kinds of songs. There's like two bar with different themes within it. Good prices on drinks. It is loud and crowded but a good time for sure!!! report/reply this review Anonym 27 September 2017 I love this place.. coming down from Boston where there aren't too many country bars, I'm so excited to have a place this close. Now I just need to learn the line dances report/reply this review Anonym 19 September 2017 It's hit or miss on a good time. That's why it only gets a 3 star rating. report/reply this review Anonym 30 July 2017 Great dancing! Great music! Good drink selections. Just too Smokey. Other than that, I love going to Dixie often! report/reply this review Anonym 22 April 2017 Staff is always kind here , personally I love country itself not line dancing  so I don't go often report/reply this review Anonym 16 April 2017 It was my third time that I ever have went to a country bar but I really enjoyed myself. Great music believe it or not not only country their drinks are simply not mix with water so if you order straight up whiskey hundred percent you'll get straight up black whiskey report/reply this review Anonym 01 April 2017 Lots of fun with excellent music that splices upbeat country with funky dance music!! The only country bar where I actually liked the music. And I'm not even a fan of country. report/reply this review Anonym 30 January 2017 Very lively place with line dancing. You could dance however you like around the dance floor but the majority of people are there for the line dances. Very busy on Saturday night report/reply this review Rate & Write Reviews Review Star : Submit your review Mailing List Sign Up Enter your email to get updates and special deals from Dixie Roadhouse Bar in Florida Salty Sam's Marina Bar - Florida Parrot Key Caribbean Grill Bar - Florida Sale e Pepe Bar - Florida Cote D'Azur Bar - Florida Snook Inn Bar - Florida Lighthouse Restaurant & Bar Bar - Florida Angelina's Ristorante: Fine Italian Dining Bar - Florida USS Nemo Restaurant Bar - Florida Lamoraga Restaurant Bar - Florida All Locations Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Other Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas United States Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming All Categories Accounting Airport Amusement Park Apartment Aquarium Art Gallery Atm Bakery Bank Bar Beauty Salon Bicycle Store Book Store Bowling Alley Bus Station Cafe Campground Car Dealer Car Rental Car Repair Car Wash Casino Cemetery Chiropractic Service Church City Hall Clothing Store Community Company Consultant Contractor Convenience Store Courthouse Dentist Department Store Dermatologist Digital Marketing Dispensary Doctor Drugstore Education Electrician Electronics Store Embassy Finance Fire Station Florist Food Freight Forwarding Service Funeral Home Furniture Store Gas Station Groceries Gym Hair Care Hardware Store Health Hindu Temple Home Goods Store Home Service Hospital IT Services Insurance Agency Jewelry Store Laundry Lawyer Library Light Rail Station Liquor Store Local Business Local Government Office Locksmith Lodging Massage Therapist Meal Delivery Meal Takeaway Mosque Movie Rental Movie Theater Moving Company Museum Nail Salon Night Club Nonprofit Painter Park Parking Pet Store Pharmacy Physiotherapist Plumber Point Of Interest Police Post Office Premise Primary School Real Estate Agency Recreation Restaurant Roofing Contractor Rv Park School Secondary School Shoe Store Shopping Mall Skin Care Software Service Spa Sports Stadium Storage Store Subway Station Supermarket Synagogue Taxi Stand Tourist Attraction Train Station Transit Station Travel Agency Uncategorized University Veterans Service Organization Veterinary Care Zoo Search About | Privacy Policy © 2025 VYMaps.com - All rights reserved"
    },
    {
      "url": "https://mail.thedixie.com/test/find-us.php",
      "text": "Dixie Roadhouse - Find Us Dixie Roadhouse 1023 SE 47th Terrace Cape Coral, FL 33904 Mobile | Desktop Tel: (239)-541-7900 © 2025 Dixie Roadhouse E-Mail us @ party@thedixie.com 1023 SE 47th Terrace Cape Coral, FL 33904"
    },
    {
      "url": "https://dixietech.edu/contact/",
      "text": "Contact Us | Dixie Technical College (435) 674-8400 info@dixietech.edu Facebook X Instagram Facebook X Instagram Programs Students All Student Resources Calendar Canvas Login Forgot Password Student Portal Testing Center Wellness Center Graduation Transcript Request Housing Job Board Admissions Apply Continue Application Programs Schedule Tour Meet with an Advisor Financial Aid Accuplacer High School Scholarships Articulation Veterans Community Short-Term Training American Heart Custom Fit Donations Industry Partners Post a Job Staff Branding Guide Calendar Employee Resources About Us Accreditation Board of Trustees College News Contact Us Map & Parking President’s Message APPLY Select Page Contact Us Contact information for Dixie Tech Contact Dixie Tech We welcome any and all questions, feedback or other comments. Please use the form below or any of the other contact information to get in touch with us and we will respond within a business day. View Campus Maps  Phone 435-674-8400  Email info@dixietech.edu  Address 610 S Tech Ridge Dr, St. George, UT 84770 Email Send a Note Reach out with questions, feedback, suggestions, and whatever else you might have on your mind. CONTACT Generic contact form for website \" * \" indicates required fields Name * First Last Email * Phone * Message * By submitting this form, I am providing my digital signature agreeing that Dixie Technical College may email me regarding educational services utilizing automated technology at the email provided above. Messaging frequency may vary. I understand this consent is not a condition to attend Dixie Technical College or to purchase any other goods or services. You can unsubscribe/opt-out at any time. See Privacy Policy and SMS Terms. * By checking this box I agree to receive marketing, and Higher Education related sms messages from Dixie Technical College. Message frequency may vary. Standard Message and Data Rates may apply. Reply STOP to opt out. Reply Help for help or visit our website at dixietech.edu. Privacy Policy and SMS Terms . By submitting this form, I am providing my digital signature agreeing that Dixie Technical College may email me regarding educational services utilizing automated technology at the email provided above. Messaging frequency may vary. I understand this consent is not a condition to attend Dixie Technical College or to purchase any other goods or services. You can unsubscribe/opt-out at any time. See Privacy Policy and SMS Terms . Email This field is for validation purposes and should be left unchanged. Quick Links Employee Resources Calendar Blog Financial Aid Employment Opportunities Community Job Board Schedule Tour Testing Center Transcript Requests Campus & Community Career Enhancement Campus Map & Parking Donate FAQ High School Students Mission Media Staff Directory Supporting Partner Legal Disclosures Policies and Plans Consumer Information Title IX Nondiscrimination Privacy Policy Dixie Technical College 610 S Tech Ridge Dr St. George, UT 84770 (435) 674-8400 info@dixietech.edu Hours: M–F, 8am–5pm Facebook X Instagram Copyright © 2025 by Dixie Technical College. All rights reserved."
    },
    {
      "url": "https://www.capecoralbreeze.com/news/business/2025/03/12/dixie-roadhouse-for-sale/",
      "text": "Dixie Roadhouse for sale - Cape Coral Breeze E-Edition Submit News Subscribe News Business Viewpoints Obituaries Sports and Fishing Community Jobs Place Notice close News Cape News Breaking News Business Your Community Florida News National News Sports and Fishing Local Sports Sports Columns SWFL Fishing SWFL Boating Florida Sports National Sports Obituaries Viewpoints Letters To The Editor Editorials Local Columns Life Local Lifestyles Clubs & Organizations Engagements Cape History Cape Coral’s 50th Anniversary Cape Coral’s 40th Anniversary Cape Coral’s 45th Anniversary Hurricane Guide Contact Contact Us Submit News Single Copy Locations Statement of Values Terms of Service Store Classifieds Public Notices Browse notices Place a notice E-Editions Yellow Pages /Breaking News Dixie Roadhouse for sale Longtime owners of the popular Cape nightspot looking to retire Mar 12, 2025 By CJ HADDAD 3 min read The co-owners of a long-standing nightlife spot in Cape Coral are looking to sell. After nearly 15 years of owning and operating Dixie Roadhouse, David Townsend and Lynn Pippenger are ready to retire and say goodbye to the South Cape hotspot known for line dancing, celebrations, and party atmosphere. “We know that the building has a lot of potential,” said Townsend, 70. “Twenty years ago I’d be doing it, I don’t have that in me anymore. We want to leave it with someone who can make things better for the South Cape and Cape Coral overall.” The couple is selling the business, not the building itself. The business package includes a 30-year lease, liquor license, inventory, lease deposit, furniture, fixtures, equipment, intellectual property, and cash flow/market value (calculated from 2023-2024 net income times 2.5 years). The total price tag? $2.675 million. Collectively, Townsend and Pippenger have more than 80 years of nightclub experience in 130-plus nightclubs nationwide. They have served in roles across the spectrum — from nightclub employees, to managers, to corporate owners, to nightclub consultants, to partners, to individual owners of nightclubs, to a director at the largest nightclub company in the world, and an original founding Board Member of the Nightclub & Bar magazine and trade shows. ​​​​​​​In 2011, the couple decided to focus their experience and knowledge into one place, which resulted in the Dixie Roadhouse. “We just wanted everyone to know that we couldn’t have done all of this without the help, expertise, and knowledge of literally thousands of people that we have collaborated with in the nightclub business over the past few decades,” the couple stated. The Dixie has been a staple for events surrounding New Year’s Eve, Bike Nights, and countless occasions and parties. Dixie housed many talented performers during its infancy, such as Blake Shelton, Eli Young Band, and the Misfits. Townsend said they’d like to pass the 10,000-square-foot venue on to someone with expertise in the industry who could take full advantage of the space, and untapped potential. That untapped potential includes a possible rooftop bar expansion, outdoor patio with an island bar, hosting live concerts as they had in the past, and more. “With everything going on down in the South Cape… it’s really developing fast. This building has potential to be part of that,” Townsend said. “We’re still good business. We don’t plan on closing Dixie. It’s still going to be open. It’s not going to really affect the employees or customers. It would depend on what the new owners wanted to do with it, but at least for a while, it’ll be business as usual.” At the moment, Townsend and Pippenger are attempting to locate a purchaser on their own, but would welcome a broker that could bring them a buyer. The duo that know how to throw a party have cherished their time operating Dixie Roadhouse. “Loved it,” Townsend said. “We just know the building and the business have so much more potential. “We’re very proud of the legacy.” When asked if they’ll miss it, Townsend said, “Oh yeah. That’s all I’ve ever done. It’s going to be weird.” Townsend said it’s time to enjoy retirement, his grandchildren, and getting to travel, which he said he loves doing. Those interested in purchasing Dixie Roadhouse can find more information by visiting www.legendarynightclubforsale.com. Dixie Roadhouse is at 1023 S.E. 47th Terrace. To reach CJ HADDAD, please email cjhaddad@breezenewspapers.com ARTICLE Tags Breaking News www.capecoralbreeze.com | 2510 Del Prado Blvd. , Cape Coral, FL 33904 Copyright © Cape Coral Breeze | Contact | Terms of Use | Privacy Policy"
    },
    {
      "url": "https://www.dixie.k12.fl.us/",
      "text": "Dixie District Schools | Education for grades K-12 Home School Board Schools Ruth Rains Upper Elementary Old Town Elementary Dixie County Middle-High Dixie County Adult Welding District Virtual School Sports DCMHS Volleyball DCMHS JV Football DCHS Varsity Football Departments Curriculum & Instruction Federal Programs Finance & Business Services Food Service Health Human Resources Pre Kindergarten School Choice Student Services ESE Support Services Technology Services Transportation Resources Family Resources Employee Resources Volunteer Resources Administrator Resources Calendars Contact Us Contact Us Main Number (352)541-6250 Superintendent’s Office (352)541-6231 Transportation (352)541-6233 Home School Board Schools Ruth Rains Upper Elementary Old Town Elementary Dixie County Middle-High Dixie County Adult Welding District Virtual School Sports DCMHS Volleyball DCMHS JV Football DCHS Varsity Football Departments Curriculum & Instruction Federal Programs Finance & Business Services Food Service Health Human Resources Pre Kindergarten School Choice Student Services ESE Support Services Technology Services Transportation Resources Family Resources Employee Resources Volunteer Resources Administrator Resources Calendars Contact Us Dixie District Schools Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Mission Statement Our schools will provide a quality learning environment by providing opportunities through educational planning and community partnerships that ensure student success. ﻿ Employment Opportunities FortifyFL Lunch Menus Skyward Student & Family Access WeatherSTEM Mental Health Resources News & Announcements Special School Board Meeting - September 9, 2025 5:30 p.m. -  Special School Board Meeting Agenda Location:  Dixie County Middle-High School Media Center, 17924 SE Highway 19, Cross City, FL Final Public Hearing for 2025-2026 Budget - September 9, 2025 5:45 p.m. -  Final Public Hearing for Budget Agenda Location:  Dixie County Middle-High School Media Center, 17924 SE Highway 19, Cross City, FL School Board Meeting - September 9, 2025 6:00 p.m. -  School Board Meeting Agenda Location:  Dixie County Middle-High School Media Center, 17924 SE Highway 19, Cross City, FL Instructional Materials Adoption District Instructional Materials Review Committee Meeting Dates District Review Team Textbook Recommendations Review MDVS Enrollment Information 2025-2026 Preschool Programs 2025-2026 Preschool Programs Resources Hotline 352-541-6230 In case of emergency, dial 911. Report fraud, waste, abuse, or any suspicious activity on school property (drug-related, criminal, or bullying) either anonymously or by using your name. Dixie District Schools is not responsible for lost or stolen personal items. Important Links Public Records Request Online Payment Center Child Abuse/ Sexual Abuse Prevention Paul Bennett, District Coordinator Link to Plan Family Empowerment Scholarship Scholarship Link Contact:  Monica Anguish monicaanguish@dixie.k12.fl.us Substitutes Employment Application Link Substitute New Hire Packet Online Training Link Steps for online training: 1.  Click on the link provided and scroll to the bottom of the page. 2.  Click \"Substitute Training for NEFEC Districts\" 3.  Under \"Need an account?\", click \"Sign up here\" 4.  Under \"Participants\", click \"Enroll me\" 5.  Bookmark the page for easy access - there are five (5) modules to complete 6.  Upload the Certificate of Completion to your employment application Title IX Information Kristen McCaskill, District Coordinator Link to Training September 2025 Sun Mon Tue Wed Thu Fri Sat 31 1 Labor Day (No School) 2 4:30pm MS Volleyball at Home (vs. Williston) 5:30pm JV Volleyball at Home (vs. Williston) 6:30pm Varsity Volleyball at Home (vs. Williston) Show all 3 3:45pm Union Negotiations 4 3:15pm DCMHS High-Q Tryouts 4:30pm MS Volleyball at Mayo 5:30pm JV Volleyball at Mayo 6:30pm Varsity Volleyball at Mayo 7pm JV Football at Bell Show all 5 7:30pm Varsity Football at Taylor County 6 7 8 9 5:30pm JV Volleyball at Home (vs. Union County) 5:30pm Special School Board Meeting 5:45pm Final Public Hearing for Budget 6pm School Board Meeting 6:30pm Varsity Volleyball at Home (vs. Union County) Show all 10 Progress Reports 11 4:30pm MS Volleyball at Home (vs. Branford) - Veterans Night 5:30pm JV Volleyball at Home (vs. Branford) - Veterans Night 6:30pm Varsity Volleyball at Home (vs. Branford) - Veterans Night Show all 12 7:30pm Varsity Football at Belleview 13 14 15 Professional Development Day - All Staff (No School) 3:15pm DCMHS School Advisory Committee Meeting 16 6pm JV Volleyball at Home (vs. Suwannee) 7pm Varsity Volleyball at Home (vs. Suwannee) 17 18 4:30pm MS Volleyball at Trenton 5:30pm JV Volleyball at Trenton 6:30pm Varsity Volleyball at Trenton 7pm JV Football at Dixie County (vs. Branford) Show all 19 7:30pm Varsity Football at Dixie County (vs. Keystone Heights) 20 21 22 23 5:30pm JV Volleyball at Eastside 6:30pm Varsity Volleyball at Eastside 24 25 4:30pm MS Volleyball at Home (vs. Bell) - Dig Pink 5:30pm JV Volleyball at Home (vs. Bell) - Dig Pink 6:30pm Varsity Volleyball at Home (vs. Bell) - Dig Pink Show all 26 7:30pm Varsity Football at Dixie County (vs. Bell) - Senior Night 27 28 29 30 4pm MS Volleyball at Home (vs. Mayo) 5pm JV Volleyball at Home (vs. Mayo) 6pm Varsity Volleyball at Home (vs. Mayo) Show all 1 2 4:30pm MS Volleyball at Branford 5:30pm JV Volleyball at Branford 6pm JV Football at Dixie County (vs. Chiefland) 6:30pm Varsity Volleyball at Branford Show all 3 7:30pm Varsity Football at Chiefland 4 Notice Under Florida Law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. Disclaimer The Dixie County School District shall not be held liable for any actions taken or omissions made from reliance on any information contained on the web site. The site was developed to provide interested individuals with the latest information about the school system. Great care is taken to ensure that correct and up-to-date information is posted within the site; however, the timeliness and accuracy of the information cannot be guaranteed. The Dixie County School District shall not be held liable for any actions taken or omissions made from reliance on any information contained in the outside links included on the web site. These links to outside sites are provided as a convenience, but are not a part of the district's web site and are, therefore, not under the control of the school district. Although these sites are reviewed to ensure they contain appropriate content, the Dixie County School District is not responsible for the content or information contained within those sites. Located in Cross City, Florida Contact Main Number (352)541-6250 Superintendent’s Office (352)541-6231 Transportation (352)541-6233 Notice of Non-Discrimination (School Board Policy 2.16) Section 504/ ADA Policy Statement Family Educational Rights and Privacy Act (FERPA) Digitally Designed by BramJam, LLC Share by:"
    },
    {
      "url": "https://logansroadhouse.com/contact-us/",
      "text": "Get In Touch - Contact Logan's Roadhouse Skip to main content Logan's Roadhouse Toggle Navigation Find a Location Home Order Pickup Order Delivery Order Catering Order Online Order By Phone Order By Email Toggle Menu options All Menus Carolinas Menu California Menu Rewards Gift Cards Events Careers Hourly Management Order Pickup Order Delivery Order Catering Order Online Order By Phone: 346-308-2494 Order By Email About Us Careers Privacy Terms Contact Us News 346-440-0772 Let us know what you think We want every guest to have a great experience every time they visit Logan’s. If you have any concerns or compliments, we would love to hear them. Please complete the contact form below. Contact Us Select A Topic * General Comments Restaurant Experience Gift Cards Logan's Rewards Menu Feedback Event Inquiry Catering Inquiry Restaurant Location * Select Your Location AL -  Athens ( 16132 Athens Limestone Blvd.) AL -  Bessemer ( 5000 Bond Blvd.) AL -  Birmingham ( 5083 Pinnacle Sq.) AL -  Cullman ( 6092 Alabama Hwy. 157 North) AL -  Decatur ( 2315 Beltline Rd. S.W.) AL -  Florence ( 2890 Florence Blvd.) AL -  Fultondale ( 3387 Lowery Pkwy.) AL -  Huntsville ( 4249 Balmoral Dr.) AL -  Huntsville ( 6226 University Dr. N.W.) AL -  Leeds ( 1999 Village Drive) AL -  Mobile ( 3250 Airport Rd.) AL -  Prattville ( 2775 Legends Pkwy.) AL -  Spanish Fort ( 30275 Eastern Shore Ct.) AL -  Tuscaloosa ( 1511 Skyland Blvd. E.) AR -  Bryant ( 23115 I-30 South) AR -  Conway ( 410 Elsinger Blvd) AR -  Fayetteville ( 3611 N. Shiloh Dr.) FL - Fort Myers (5043 S. Cleveland Ave.) FL -  Kissimmee ( 5925 W. Irlo Bronson Hwy.) GA -  Dalton ( 811 Walnut Square Blvd.) GA -  Ft. Oglethorpe ( 2584 Battlefield Pkwy.) GA -  McDonough ( 20 Mill Rd.) GA -  Pooler ( 220 Pooler Pkwy) GA -  Tifton ( 910 West 7th Street) IL -  East Peoria ( 240 Conference Center Dr.) IL -  Marion ( 1305 Halfway Rd) IL -  Normal ( 313 S. Veterans Pkwy.) IN -  Evansville ( 5645 Pearl Dr.) IN -  Ft. Wayne ( 1210 Illinois Rd. S.) IN -  Ft. Wayne ( 6617 Lima Rd.) IN -  Mishawaka ( 4225 N. Main) IN -  Noblesville ( 17065 Mercantile Rd.) IN -  Plainfield ( 351 S. Perry Rd.) KY -  Hopkinsville ( 4320 Ft. Campbell Blvd.) KY -  Lexington ( 1908 Pavillon Way) KY -  Louisville ( 1540 Alliant Avenue) KY -  Paducah ( 5137 Hinkleville) KY -  Richmond ( 2146 Lantern Ridge Dr.) LA -  Shreveport ( 7591 Youree Dr.) LA -  West Monroe ( 201 Constitution Dr.) MI -  Caledonia ( 1651 Marketplace Dr. S.E.) MI -  Grandville ( 4425 Canal Ave. S.W.) MI -  Holland ( 3299 W. Shore Dr.) MI -  Lansing ( 5800 W. Saginaw Hwy.) MI -  Midland ( 7135 Eastman) MI -  Roseville ( 30751 Gratiot Ave.) MI -  Southgate ( 13305 Eureka Rd.) MI -  Walker ( 3153 Alpine Ave.) MO -  Cape Girardeau ( 3012 William St.) MO -  Joplin ( 209 N. Range Line) MS -  Flowood ( 277 Dogwood Blvd.) MS -  Gulfport ( 15189 Crossroads Pkwy.) MS -  Hattiesburg ( 6147 U.S. Hwy. 98) MS -  Meridian ( 108 Hwy. 11 & 80) MS -  Pearl ( 431 Riverwind Drive) OH -  Cincinnati ( 3720 Stone Creek Blvd.) OH - Grove City (1657 Stringtown Road) OH -  Ontario ( 2170 W. 4th St.) OK -  Midwest City ( 7221 S.E. 29th St.) OK -  Owasso ( 9531 N Owasso Expressway) OK -  Yukon ( 630 Shedeck Parkway) PA -  Hamburg ( 65 Wilderness Trail) TN -  Chattanooga ( 504A Northgate Mall) TN -  Chattanooga ( 3592 Cummings Hwy) TN -  Clarksville ( 3072 Wilma Rudolph Blvd.) TN -  Cleveland ( 3940 Keith St.) TN -  Cookeville ( 1395 Interstate Dr.) TN -  Dickson ( 130 Chandler Dr.) TN -  Gallatin ( 1007 Village Green Crossing) TN -  Jackson ( 604 Carriage House Dr.) TN -  Johnson City ( 3112 Browns Mill Rd.) TN -  Lebanon ( 1006 Cumberland Center Blvd.) TN -  Manchester ( 205 Relco Drive) TN -  Nashville ( 727 Thompson Lane) TN -  Nashville ( 2506 Music Valley Drive) TN -  Spring Hill ( 2008 Crossings Cir.) TX -  Abilene ( 3126 S Clack St ) TX -  Buda ( 419 Old San Antonio Road) TX -  Burleson ( 1125 N. Burleson Blvd.) TX -  Dickinson ( 3160 Gulf Freeway South) TX -  El Paso ( 11865 Gateway W. Blvd.) TX -  Harlingen ( 2809 W. Expwy. 83) TX -  Houston ( 12950 N.W. Freeway) TX -  Hurst ( 948 N. E. Loop 820) TX -  Laredo ( 5300 San Dario Ave.) TX -  Lufkin ( 4201 S. Medford Dr.) TX -  McAllen ( 2224 S. 10th St.) TX -  N. McAllen ( 7612 N. 10th St.) TX -  Waco ( 2806 W. Loop 340) TX -  Waxahachie ( 1150 W. Highway 287 Bypass) VA -  Bristol ( 3174 Linden Dr.) VA -  Fredericksburg ( 3106 Spotslyvania Mall Dr. ) VA -  Lynchburg ( 4046 Wards Rd.) VA -  Manassas ( 7731 Donegan Dr.) WV -  Barboursville ( 850 Mall Rd.) WV -  Charleston ( 201 RHL Blvd.) WV -  Martinsburg ( 115 Retail Commons Pkwy) WV -  Vienna ( 100 9th St.) GA - Augusta (269 Robert C.Daniel Parkway) NC - Fayetteville (1490 Skibo Road) NC - Garner (1000 Timber Drive East) NC - Gastonia (2840 E. Franklin Boulevard) NC - Goldsboro (1011 Sunburst Drive) NC - Greensboro (1300 Bridford Parkway) NC - Greenville (603 SE Greenville Boulevard) NC - Jacksonville (1177 Western Boulevard) NC - Kannapolis (2431 Wonder Drive) NC - Monroe (2336 W. Roosevelt Boulevard) NC - Statesville (1071 Glenway Drive) SC - Anderson (3402 Clemson Boulevard) SC - Greenville (53 Beacon Drive) SC - Myrtle Beach (1136 Oak Forrest Drive) SC - North Myrtle Beach (4511 Highway 17 South) SC - Summerville (211 Azalea Square Boulevard) SC - Sumter (2531 Broad Street) CA - Redding (1955 Hilltop Drive) CA - Chico (1900 East 20th Street) Check Number * First Name * Last Name * Email * Phone * Would you like us to contact you? * No Yes Comments reCAPTCHA Appointment Submit Looking For a Job? Check out Careers Media Contact Email: media@spbhospitality.com Donations and Fundraisers Check out how we support our communities Use our Contact Us form above but for any additional inquiries, please reach out to us at GuestExperience@SPBHospitality.com Follow Logans Roadhouse on Facebook Follow Logans Roadhouse on Twitter Follow Logans Roadhouse on Instagram About Us Careers Privacy Terms Contact Us News Franchising Gift Cards Find Your Logan’s Menu Nutrition & Allergen Fundraising"
    },
    {
      "url": "https://mail.thedixie.com/old_t/",
      "text": "Dixie Roadhouse - Nightly Specials Country Themed Party Bar The Most Fun You Can Have Tonight! Home About Dixie Dixie Nights See Dixie Party More About Dixie Roadhouse Nightly Specials- Hours Upcoming Events Find Dixie Roadhouse See Inside Dixie Roadhouse Book a Party Like Us on Facebook Photo Gallery Testimonials Click to Call Mobile | Desktop Tel: (239)-541-7900 © 2025 Dixie Roadhouse E-Mail us @ party@thedixie.com 1023 SE 47th Terrace Cape Coral, FL 33904"
    },
    {
      "url": "https://mail.thedixie.com/m/",
      "text": "Dixie Roadhouse Country Themed Party Bar The Most Fun You Can Have Tonight! 1023 SE 47th Terrace. Cape Coral, Fl 33904 - Click for map See Dixie Roadhouse's Facebook page for latest news. Click image below for Dixie Facebook. Concerts, Events, and Promotions About Dixie Roadhouse Nightly Specials- Hours Find Dixie Roadhouse See Inside Dixie Roadhouse Book a Party Like Us on Facebook Photo Gallery Testimonials . Please leave a comment below. Click to Call Mobile | Desktop Tel: (239)-541-7900 Terms & Conditions -- Privacy E-Mail us @ party@thedixie.com 1023 SE 47th Terrace Cape Coral, FL 33904 © 2025 Dixie Roadhouse"
    },
    {
      "url": "https://www.fox4now.com/cape-coral/dixie-roadhouse-in-cape-coral-is-up-for-sale-so-whats-next-for-the-nightclub",
      "text": "Dixie Roadhouse in Cape Coral is up for sale, so what's next for the nightclub? Watch Now Menu Local National Weather Sports Traffic Watch Now Watch Now Close × Live Watch Alerts Search site Go In Your Community Hurricane Center Off Script It's Your Money Sunshine Crimes SWFL Back to School Video FC Naples Florida Panthers Immigration Action State News 4 Things To Do Contests TV Listings Local Experts More + Quick Links + In Your Community Hurricane Center Off Script It's Your Money Sunshine Crimes SWFL Back to School Video FC Naples Florida Panthers Immigration Action State News 4 Things To Do Contests TV Listings Local Experts Fox4FortMyers Fox4Now 1 WX Alerts 1 Closings/Delays Cape Coral Naples Downtown Fort Myers Fort Myers Beach Fort Myers Metro South Fort Myers Shores North Fort Myers North Naples Port Charlotte Sanibel San Carlos Park Punta Gorda Pine Island / Matlacha Pelican Bay North Port/Englewood Marco Island Lehigh Acres Labelle Immokalee Golden Gate Gateway Estero Clewiston Captiva Buckingham Arcadia Alva More + Quick Links + Cape Coral Naples Downtown Fort Myers Fort Myers Beach Fort Myers Metro South Fort Myers Shores North Fort Myers North Naples Port Charlotte Sanibel San Carlos Park Punta Gorda Pine Island / Matlacha Pelican Bay North Port/Englewood Marco Island Lehigh Acres Labelle Immokalee Golden Gate Gateway Estero Clewiston Captiva Buckingham Arcadia Alva News Local News In Your Community Cape Coral Actions Facebook Tweet Email Dixie Roadhouse in Cape Coral is up for sale, so what's next for the nightclub? Prev Next WFTX Dixie Roadhouse Hits the Market: Iconic Cape Coral nightclub up for sale after nearly 15 years By: Bella Line Posted and last updated Bella Line I'm your Community Correspondent for Cape Coral, Pine Island and Matlacha. I also live in the Cape, so if you see me walking my dog Winnie at Rotary Park, say hello! CAPE CORAL, Fla. — The iconic Dixie Roadhouse in Cape Coral is up for sale! Cape Coral's Community Correspondent Bella Line spoke with a partner, David Townsend, who says that after nearly 15 years, the award-winning nightclub will be under new partnership. Townsend tells Fox 4 he has decided to retire from the nightclub business. A statement on the listing website says: \"We just wanted everyone to know that we couldn't have done all of this without the help, expertise, and knowledge of literally thousands of people that we have collaborated with in the nightclub business over the past few decades.\" Townsend also told Line they are looking for someone who will take the business to the next level and expand it. A statement on the listing website says: \"The buyer of this business will be getting the benefit of all of that expertise, in addition to a profitable - and legendary - nightclub business.\" The website has ideas for future investors to expand the nightclub. Some ideas include a rooftop bar, an outdoor patio with an island bar, live music, and VIP memberships. The price tag is currently at $2.7 million. For more information on the listing, click here . Copyright 2025 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Sign up for the Headlines Newsletter and receive up to date information. now signed up to receive the Headlines Newsletter. Click here to manage all Newsletters Connect with your Community Correspondent Bella Line Weather Traffic News Money Entertainment Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact Fox4FortMyers Fox4Now © 2025 Scripps Media, Inc Give Light and the People Will Find Their Own Way"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    }
  ]
}