{
  "fuentes": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "email": "enquiries@displaysuk.co.uk"
    },
    {
      "url": "https://www.daytonabeach.com/listings/froggys-saloon/706/",
      "email": "info@froggysdaytona.com"
    },
    {
      "url": "https://www.audacy.com/froggy101/contact-us",
      "email": "tori.thomas@audacy.com"
    },
    {
      "url": "https://www.thefroggyssaloon.com/product-page/froggy-s-saloon-2-perm",
      "email": "info@thefroggyssaloon.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://www.thefroggyssaloon.com/contact",
      "email": "info@thefroggyssaloon.com"
    },
    {
      "url": "https://spokanevalleyscoop.wordpress.com/2013/02/19/ryan-heaton-of-senor-froggies-has-been-shining-at-dining-for-for-44-years/",
      "email": "rcfryguy@aol.com"
    },
    {
      "url": "https://www.thefroggyssaloon.com/",
      "email": "info@thefroggyssaloon.com"
    },
    {
      "url": "https://www.squishandcharlie.com/contact-us/",
      "email": "squish@squishandcharlie.com"
    },
    {
      "url": "https://www.thestitchsaloon.com/pages/contact-us",
      "email": "thestitchsaloon@outlook.com"
    },
    {
      "url": "https://froggy981.com/contact-us/",
      "email": "gary@froggy981.com"
    },
    {
      "url": "https://froggy981.com/contact-us/",
      "email": "amig@broadcasthouse.com"
    },
    {
      "url": "https://froggy981.com/contact-us/",
      "email": "cory@froggy981.com"
    },
    {
      "url": "https://froggy981.com/contact-us/",
      "email": "jperkins@nrgmedia.com"
    },
    {
      "url": "https://froggy981.com/contact-us/",
      "email": "sking@broadcasthouse.com"
    }
  ],
  "mails": [
    "amig@broadcasthouse.com",
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "cory@froggy981.com",
    "enquiries@displaysuk.co.uk",
    "gary@froggy981.com",
    "info.nairobi@skanem.com",
    "info@froggysdaytona.com",
    "info@thefroggyssaloon.com",
    "jane@skanem.ke",
    "jperkins@nrgmedia.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "rcfryguy@aol.com",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "sking@broadcasthouse.com",
    "squish@squishandcharlie.com",
    "thestitchsaloon@outlook.com",
    "tori.thomas@audacy.com"
  ],
  "nombre_sitio": "thefroggyssaloon.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "text": "Staff Photo Boards For Schools & Business This site is best viewed with javascript enabled. For help enabling javascript please click here . search close Search Quote ( 0 ) Checkout 0 item s £ 0.00 Home Products Exhibition Stands Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays See all Outdoor Displays Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers See all Display Cases Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases See all Exhibition & Display Boards for Hire or Rent Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire See all Leaflet, Brochure, Menu & Card Holders Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders See all Banner Stands Pull Up Roller Banners Double Sided Pull Up Banner Stands Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays See all Counters & Plinths Portable Counters & Workstations Promotion / Demonstration Counters Lectern Test Category Pedestals See all Noticeboards & Whiteboards Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards See all Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Lightboxes Dibond Signs See all Display Boards Folding Display Boards Folding Screen Room Dividers Panel and Pole Display Boards Display Board Accessories See all Specialist Displays Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture See all Perspex Cut To Size Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size See all About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Quote ( 0 ) 50,000+ products in stock 1,000 stock product lines with over 50,000 products in stock Custom made displays Rapid delivery on custom made Perspex acrylic displays Next day delivery Next day delivery on many products if ordered by mid day UK Manufacturer Many of our products are made in our own UK factory Cutting edge technology Experts in printed acrylic panels - any size, any shape menu close Products Exhibition Stands Back All Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays Extra Wide & Linked Banner Stands Outdoor Displays Back All Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers Outdoor Display Counters Outdoor Custom Printed Chairs Display Cases Back All Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Glass Display Cases Bespoke Acrylic Display Cases Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases Exhibition & Display Boards for Hire or Rent Back All Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire Exhibition Counters for Hire Banner Stands for Hire Leaflet, Brochure, Menu & Card Holders Back All Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders Rotating Brochure Holders Greeting Card Displays Business Card Holders Banner Stands Back All Pull Up Roller Banners Double Sided Pull Up Banner Stands Replaceable Cassette Roller Banners Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays Banner Stand Accessories Tension Banner Stands Counters & Plinths Back All Portable Counters & Workstations Promotion / Demonstration Counters Lectern Media Cabinets Test Test category for acrylic pedestals Test Category Pedestals Noticeboards & Whiteboards Back All Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards Freestanding / Mobile Noticeboards Whiteboards Glass Noticeboards Flipcharts & Easles Outdoor Noticeboards Acrylic Noticeboards Pinnable Noticeboards Write On Glassboards Signage & Perspex Frames Back All Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Staff Photo Boards Lightboxes Dibond Signs Printed Foamex Signs Site Safety Signs Snap Frames Sign Fittings & Accessories Hoarding Panels Acrylic Awards and Trophies Acrylic Noticeboards Printed Correx Signs Retail & Point Of Sale Printed Plywood and Wood Display Boards Back All Folding Display Boards Folding Screen Room Dividers Aluminium & Graphic Folding Display Boards Panel and Pole Display Boards Office Screens Display Board Accessories Specialist Displays Back All Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture Educational Furniture & Displays Social Distancing Screens Printed Outdoor Garden Art Garden Mirrors, Outdoor Mirrors & Illusion Mirrors Acrylic Photo Prints Shed, Playhouse, Greenhouse Windows Eco Lawn Edging From Recycled Plastic Decorative Garden Wall Panels Garden Structures, Gazebos, Arbours & Swings Garden Ornaments & Planters Acrylic Photo Prints Perspex Acrylic Splashbacks Perspex Cut To Size Back All Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size Perspex Acrylic Grey 9981 Cut To Size Perspex Acrylic Yellow 260 Cut To Size Perspex Acrylic Red 4415 Cut To Size Perspex Acrylic Orange 363 Cut To Size Perspex Acrylic Red 431 Cut To Size Perspex Acrylic Red 433 Cut To Size Perspex Acrylic Violet 886 Cut To Size Perspex Acrylic Green 6T81 Cut To Size Perspex Acrylic Green 650 Cut To Size Perspex Acrylic Blue 727 Cut To Size Perspex Acrylic Blue 750 Cut To Size Perspex Acrylic Blue 744 Cut To Size Perspex Acrylic Clear Frost S2 000 Perspex Acrylic Glass Look 6T21 Cut To Size Perspex Acrylic Silver Mirror Perspex Acrylic Blue Mirror 2069 Perspex Acrylic Purple Mirror 102 About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Home Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Staff Photo Boards For Schools & Business Staff Photo Boards For Schools & Business £ 36.30 ex. VAT £ inc.VAT Options Colour: Black Back Panel White Back Panel Clear Back Panel Clear Frost Back Panel Coloured Back Panel 2: 2: Qty Add to basket Get a quote Staff Photo Notice Boards - Perspex Acrylic Staff photo notice boards, or \"Meet The Team\" boards are a perfect way of letting people know who's who in a school, NHS Wards, general office and commercial workplace, recreation centres, reception areas, etc. Each clear pocket allows a small photo of a relevent member of staff. Options available include: choice of back acrylic colour, the number of photo pockets. We also offer a secure, tamper proof version, please click here for further details. NEW! We can now offer staff boards with your name and logo printed directlty to the top of the display - call for details. Features and Benefits: Please double click on the above images of our acrylic staff photo boards to zoom into a more detailed view Staff photo boards provide a professioal looking wall mounted display panel for quick reference of staff / team members Choice of black, white, clear or clear frost 5mm thick acrylic back panel with polished edges. Corners are rounded with no sharp edges Clear acrylic photo pockets allow staff photos to be changed quickly and easily Supplied with 4 polished sign fittings to give that floating effect off a wall Each photo pocket size is 75mm high x 50mm wide Header panel pocket is 260mm wide x 50mm high Please see the table below for our standard sized staff photo boards. We also manufacture custom sized boards if you require different sized pockets or different quantities of pockets - please call us on 01202 480104 for further details. Staff photo board prices are detailed in the drop down menu at the top of the page. Manufactured to order in our factory in Christchurch, Dorset, UK. Please allow 5 working days for delivery Please see our stand off fittings instructions by clicking here Looking for a a more secure staff photo board which can't be tampered with? Check out our Secure Staff Photo Boards ! Looking for a staff photo board with a different coloured back panel? We have a range of colours available other than our standard colours listed! Please contact us for a quote. Looking for a staff photo board with bespoke printing and branding to suit your business? With state of the art printers, we are able to fully print or brand these staff boards with your logos and messages! If this is something you are interested in, contact us for a quote! Code Photo Pockets Frame Size Width x Height (mm) SB10 10 430mm x 325mm SB20 20 430mm x 515mm SB30 30 500mm x 610mm SB40 40 640mm x 610mm SB50 50 780mm x 610mm SB60 60 780mm x 705mm SB65 65 800mm x 740mm SB70 70 780mm x 800mm SB80 80 780mm x 895mm SB100 100 780mm x 1085mm SB120 120 920mm x 1085mm SB140 140 1060mm x 1085mm SB160 160 1200mm x 1090mm Displays UK provide daily deliveries to most towns and cities in the UK including: Christchurch, Poole, Bournemouth, Swanage, Dorchester, Ferndown, Shaftesbury Sherborne Sturminster Newton Swanage Weymouth Ringwood New Forest Fordingbridge Salisbury Thank you for visiting our website Product Code: 64674569876345 Specification Code 64674569876345 Style Staff Photo Board Location Wall Mounted Weight 10.000 Kg Secured by sagePay Pay with PayPal Pay with Mastercard Pay with Visa × Items Quick basket Newsletter Signup Submit Exhibition Stands Outdoor Displays Display Cases Exhibition & Display Boards for Hire or Rent Leaflet, Brochure, Menu & Card Holders Banner Stands Counters & Plinths Noticeboards & Whiteboards Signage & Perspex Frames Display Boards Specialist Displays Perspex Cut To Size Displays (UK) Limited Displays UK are located in Christchurch, on the Hampshire / Dorset border. We are a proper 'bricks and mortar' manufacturing business not just another internet retailer. Read more… Head Office Units 16-18, 12 Airfield Road, Off Airfield Way, Christchurch, Dorset, BH23 3TG Tel: 01202 480104 Email: [email protected] Connect with us DISQ Display Innovation Service Quality Displays (UK) Limited registered in England and Wales with company number 8896740 and registered address Bank Court, Manor Road, Verwood, Dorset, BH31 6DY. VAT number GB980855382 © Displays (UK) Limited 2025 / Website by Adido / Terms & Conditions / Privacy / Sitemap"
    },
    {
      "url": "https://www.daytonabeach.com/listings/froggys-saloon/706/",
      "text": "Froggy's Saloon | Daytona Beach, FL 32118 Virtual Tour Meetings Travel Trade Request FIT Rates Meet the Team Itineraries Districts & Neighborhoods Getting Here Media Gallery Virtual Brochures Sports Submit RFP Meet the Team Convention Center Sports Facilities Specialized Services Getting Here Event Funding Virtual Brochure Media Releases Gallery Media Visits Media Coverage Speakers Bureau Blog Virtual Tour Meetings Travel Trade Request FIT Rates Meet the Team Itineraries Districts & Neighborhoods Getting Here Media Gallery Virtual Brochures Sports Submit RFP Meet the Team Convention Center Sports Facilities Specialized Services Getting Here Event Funding Virtual Brochure Media Releases Gallery Media Visits Media Coverage Speakers Bureau Blog Events All Events Featured Events Arts & Culture Racing Motorcycle Rallies Festivals & Music Sports Events Submit An Event Places to Stay Hotels Hotel Deals Vacation Rentals Condo Rentals Campgrounds & RV Parks Motels Bed & Breakfasts Pet-Friendly All Properties Things To Do Top 10 Reasons to Visit Attractions Racing Trails With Kids Outdoors Golf Beaches Water Activities Fishing Arts & Culture Shopping Free Things to See and Do Food + Drink Waterfront Dining Outdoor Dining Seafood Fine Dining Ale Trail Nightlife Plan About the Area Web Cam Weather Accessibility Travel Resources Blog Deals and Giveaways Social Gatherings Sustainable Travel Contact Us Events All Events Featured Events Arts & Culture Racing Motorcycle Rallies Festivals & Music Sports Events Submit An Event Places to Stay Hotels Hotel Deals Vacation Rentals Condo Rentals Campgrounds & RV Parks Motels Bed & Breakfasts Pet-Friendly All Properties Things To Do Top 10 Reasons to Visit Attractions Racing Trails With Kids Outdoors Golf Beaches Water Activities Fishing Arts & Culture Shopping Free Things to See and Do Food + Drink Waterfront Dining Outdoor Dining Seafood Fine Dining Ale Trail Nightlife Plan About the Area Web Cam Weather Accessibility Travel Resources Blog Deals and Giveaways Social Gatherings Sustainable Travel Contact Us SEARCH SEARCH About Our Organization Halifax Area Advertising Authority Committees Market and Investor Research Newsletters Tourism Partner Resources Tourism Events Funding Filming in Daytona Beach Contact Sitemap Privacy Policy Accessibility Things to Do Beach Accessibility Dining Entertainment Venues Transportation Services Statement of Accessibility ADA Accessibility Feedback Form Partner Gateway Partner Resources Back View More 1 / 1 Share Froggy's Saloon Address: 800 Main Street, Daytona Beach, FL 32118 Phone: (386) 254-8808 Visit Website Email Share About Veteran and biker-oriented establishment featuring a large outdoor area with a festival atmosphere. Family-owned and operated on Main Street for over 30 years. Offering daily specials, happy-hour pricing, and a mini-food menu. The souvenir stand in the main bar area offers classic Froggy's designed t-shirts, event patch and other branded merchandise. For more information go to www.froggysdaytona.com Map Events Map It Biketoberfest® Bingo Presented By: Froggy's Saloon Location: Froggy's Saloon October 16, 2025 Map It Map It Biketoberfest® Bulleit & Bacon Presented By: Froggy's Saloon Location: Froggy's Saloon October 16, 2025 Map It View Our Destination Guide SIGN UP FOR OUR eNewsletter About Our Organization Halifax Area Advertising Authority Committees Market and Investor Research Newsletters Tourism Partner Resources Tourism Events Funding Filming in Daytona Beach Contact Sitemap Privacy Policy Accessibility Things to Do Beach Accessibility Dining Entertainment Venues Transportation Services Statement of Accessibility ADA Accessibility Feedback Form Partner Gateway Partner Resources © 2025 Daytona Beach Area CVB © 2025 Daytona Beach Area CVB"
    },
    {
      "url": "https://www.audacy.com/froggy101/contact-us",
      "text": "Contact Us | Froggy 101 Audacy Logo Listen Live STATIONS All Music Stations All News & Talk Stations All Sports Stations Stations by City All Stations Partners Fox News CBS News NBC News music Music All Music Stations Music News Pop Alternative Latino Country Rock Classic Rock Hip-Hop and R&B EVENTS LIVE Performances news NEWS All News Stations Latino News NBC News Fox News CBS News sports Sports All Sports Stations Sports News NFL MLB NBA NHL NCAA Football Sports Betting Originals Baseball Isn’t Boring Reception Perception Kickoff with Boomer BetQL Network Listen Live Watch Live BetMGM The Daily Tip BetQL Daily BetMGM Tonight podcasts All Podcasts The Sunshine Place Gone South Fly on the Wall We Can Do Hard Things Impolitic with John Heile Otherworld The Moth Office Ladies Gets Interesting History That Doesn’t Suck High Strange Search Engine Start Here Jill on Money Baseball Isn’t Boring Tony Kornheiser Show Fantasy Football Today Fantasy Baseball Today Cash The Ticket You Better You Bet Go Birds Battleground America On Deadline more Where to Listen About Audacy Get the Audacy App More Ways to Listen CUSTOMER SUPPORT FAQ Find Us on X Contact Customer Support STAY IN TOUCH Follow Us on Social Advertise With Us More from Audacy #ImListening 1Thing Contests Contest Rules Listen Live All Music Stations All News & Talk Stations All Sports Stations Stations by City All Stations Fox News CBS News NBC News music All Music Stations Music News Pop Alternative Latino Country Rock Classic Rock Hip-Hop and R&B LIVE Performances news All News Stations Latino News NBC News Fox News CBS News sports All Sports Stations Sports News NFL MLB NBA NHL NCAA Football Sports Betting Baseball Isn’t Boring Reception Perception Kickoff with Boomer Listen Live Watch Live BetMGM The Daily Tip BetQL Daily BetMGM Tonight podcasts The Sunshine Place Gone South Fly on the Wall We Can Do Hard Things Impolitic with John Heile Otherworld The Moth Office Ladies Gets Interesting History That Doesn’t Suck High Strange Search Engine Start Here Jill on Money Baseball Isn’t Boring Tony Kornheiser Show Fantasy Football Today Fantasy Baseball Today Cash The Ticket You Better You Bet Go Birds Battleground America On Deadline more About Audacy Get the Audacy App More Ways to Listen FAQ Find Us on X Contact Customer Support Follow Us on Social Advertise With Us #ImListening 1Thing Contests Contest Rules On Air The Doc Show Crockett Mo and StyckMan Katie & Company All Shows Schedule Playlist Podcasts The Doc Show Crockett Katie & Company Rob + Holly Video+ Videos Galleries Contests & Events Contests Contest Rules Events Latest Latest from Froggy Entertainment & News Storm Closings Connect Contact Us Join the Country Club Facebook Instagram X I'm Listening 1Thing Advertise With Us listen now playing I Wish Grandpas Never Died Riley Green on-air Katie & Company 2:00 PM - 7:00 PM audio from Froggy 101 Live Podcasts Ask your smart speaker to play Froggy 1 oh 1 On Air The Doc Show Crockett Mo and StyckMan Katie & Company All Shows Schedule Playlist Podcasts The Doc Show Crockett Katie & Company Rob + Holly Video+ Videos Galleries Contests & Events Contests Contest Rules Events Latest Latest from Froggy Entertainment & News Storm Closings Connect Contact Us Join the Country Club Facebook Instagram X I'm Listening 1Thing Advertise With Us Contact Us Phone number: 1-800-570-1013 Text number: 800-570-1013 Studio Phone: 1-800-570-1013 Contest/Prize Fulfillment Questions: Tori 570-602-2580 Business Office: 570-883-9800 Traffic Jam Line: 570-883-7269 Address: Audacy Pennsylvania, LLC | WGGY-FM 305 HWY 315 Pittston Pa, 18640 Office Hours: Monday through Friday (except Holidays) 9am - 2:30pm ----------------------------------- Frequently Asked Questions How can I win a prize? For call-to-win contests, online contests, and text contests, all of the details can be found on the Contests page on this website. If a contest has ended within the last 30 days, you can find that information on the Contest Rules page on this website. How do I get my prize? You must be a verified winner and complete all necessary paperwork online before you will get your prize. Emails will be coming from our prize platform SPARC - check your spam folder.  If you don't get the email immediately after winning a prize from us, contact us right away. Once you have completed all of the paperwork, how you get your prize depends on what you have won. In every case listed below, this will be communicated to you as we walk you through the paperwork process. Tickets: Digital Tickets to concerts will be received within 48 hours of the event. In some cases, it may be within 24 hours of the event. Some shows may require will call fulfillment. If this is the case, the original winner’s name will be sent to the box office at the venue for ticket pick-up after 5p the day-of the show. Tickets for these shows cannot be transferred and must be picked up by the original winner with a valid for form of identification. Some gift cards, gift certificates, vouchers, etc: Whenever possible, we will mail the prize to you via USPS first class mail to the address you provided to us when you completed the paperwork. Physical prizing: If a prize is too bulky, too valuable, or not replaceable, you will be instructed to pick up the prize at our offices during normal business hours (listed above). In some cases you may be able to send someone on your behalf, but only if you have completed all required paperwork online and only if you let us know that person's name beforehand. Photo ID will be required. I received a message or comment on Facebook saying I won a prize. Did I actually win? This station DOES NOT execute any social media contests. We may promote a contest on social, but we will never ask you to comment, like, or share a post in order to enter or win a contest. We will also NEVER ask you for any personal information like your phone number, date of birth, social security number, or banking information through social media. Be careful of scammers. For further questions, contact Tori Thomas - tori.thomas@audacy.com or call 570-602-2580. What are mobile tickets and how do I claim them? Mobile tickets are a gift from COVID-19 that allows us to easily transfer you tickets via the free Ticketmaster/Live Nation/AXS and other mobile ticketing apps. Once we transfer the tickets, you will receive an email from Ticketmaster/Live Nation/AXS, etc. asking you to claim your tickets. Make sure you have the proper app downloaded and have an account created before clicking “Claim Tickets” in the email. Once you claim the tickets, you will receive another email from Ticketmaster/Live Nation/AXS to “View and Save Your Tickets”. You can use this link to view your tickets or, if you have the app downloaded, the tickets should appear in the “My Tickets” or “My Events” part of the app. Claiming Mobile Tickets: You will receive an email from Ticketmaster/Live Nation/AXS, etc. with the subject, “The station just sent you ticket(s) for a concert…” Please open the email and accept the ticket transfer by: 1.      On your smartphone, open your email, and tap the Accept Tickets button in the email. 2.     Sign in to the Ticketmaster/Live Nation/AXS account to accept your tickets. o   If you don’t have an account, create a new account with the email you are currently using on this thread. It’s the day-of the show and I have not received my tickets. What should I do? First of all, do not wait until the day of the show to ask about the status of your tickets. Secondly, do not panic. Email Tori Thomas - tori.thomas@audacy.com or call 570-602-2580. --------------------------------------- Still have Questions? Contact us by filling out the form below Who would you like to Contact? * Entercom Communications Corp.  | Froggy 101 Radio 305 Highway 315 18640 , Pittston, PA , 570-883-9850 $ × Froggy 101  | Today's Best Country! Listen to Froggy 101 Contact Us EEO Public Inspection File Contest Rules FCC Applications Advertise with Us ©\n            2025 Audacy, Inc. ALL RIGHTS RESERVED. PART OF AUDACY MUSIC. Cookie Settings listen Listen Live Mobile App connect FAQ 1Thing Get My PERKS #ImListening Contact Us Sitemap Advertise with Us Audacy Corporate Site legal Careers Privacy Policy Terms of Use Copyright Notice Music Submission Policy Do Not Sell or Share My Personal Info Public File Help © 2025 Audacy, Inc. All rights reserved. Part of Audacy. !"
    },
    {
      "url": "https://www.thefroggyssaloon.com/product-page/froggy-s-saloon-2-perm",
      "text": "\"Froggy's Saloon\" 2\", perm | Froggy's Saloon top of page Events Froggy's Merch Specials Employment Rally Event Application Perminant Staff Application Vendors About Contact Us 2\" die-cut, permanent sticker. Custom designs by Mel at Sticky Bomb Designs in Jax Beach. \"Froggy's Saloon\" 2\", perm SKU: M18-FrgSln-2P $2.00 Price Sales Tax Included Quantity * Add to Cart >> Employment << Contact Froggy's Saloon 1 (386) 253-0330 info@thefroggyssaloon.com Privacy Hours Mon - Sun:  7am - 2am 800 Main St. Daytona Beach FL, 32118 © 2025 by Froggy's Saloon. FOLLOW THE FUN ON SOCIAL MEDIA! bottom of page"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://www.thefroggyssaloon.com/contact",
      "text": "Contact Us | Froggy's Saloon top of page Events Froggy's Merch Specials Employment Rally Event Application Perminant Staff Application Vendors About Contact Us Contact Us Contact Name Email (Required) Phone (Required) How can we help you? (Required) Submit >> Employment << Contact Froggy's Saloon 1 (386) 253-0330 info@thefroggyssaloon.com Privacy Hours Mon - Sun:  7am - 2am 800 Main St. Daytona Beach FL, 32118 © 2025 by Froggy's Saloon. FOLLOW THE FUN ON SOCIAL MEDIA! bottom of page"
    },
    {
      "url": "https://spokanevalleyscoop.wordpress.com/2013/02/19/ryan-heaton-of-senor-froggies-has-been-shining-at-dining-for-for-44-years/",
      "text": "Ryan Heaton of Senor Froggy’s has been shining at dining for 37 years | Spokane Valley Scoop Spokane Valley People The Scoop on The Scoop Spokane Valley Scoop Blog by The Spokane Valley Scoop, the newsletter of DeerHart Design Homes and Spokane Home Design Stay updated via RSS Follow Blog via Email Enter your email address to follow this blog and receive notifications of new posts by email. Email Address: Sign me up! Some Savory Scoop Stuff MONEY SAVING TIPS (Link) Our newsletter also includes tips on ways to save money in the Spokane Valley. Here is a long list of proven ideas. VALLEY SCOOP PROFILES (Link)…… For nearly five years I wrote a newsletter featuring profiles on interesting Spokane Valley individuals and businesses. If you have lived in the Valley for any lenghth of time, you will be familiar with many if not most of the subjects. Like us on facebook Like us on facebook Other Stuff we do DeerHart Design Homes Visit  a gallery of homes we have built in the Spokane Valley. http://www.spokanehomedesign.com/ Visit  our plan drafting website. Categories advice on owning a bar (11) Best Places to eat in Spokane Valley (14) Breakfast in Spokane Valley (11) Closing Business in Spokane Valley (9) entertainment (7) Home building in the Valley (2) Lessons on Loving (3) lunch specials in spokane valley (1) Meandering Valley Thoughts (10) Northwest Travel (3) Opening Business in Spokane Valley (36) Reviews and comments (8) Scott Creach (3) Spokane Valley Bars (19) Spokane Valley Coffee Houses (1) Spokane Valley Dining (16) Spokane Valley Folks (4) Spokane valley lunch specials (3) Spokane Valley Seafood (4) Uncategorized (17) from the past October 2015 (1) September 2015 (1) August 2015 (1) June 2015 (1) March 2015 (2) November 2014 (1) September 2014 (1) May 2014 (3) February 2014 (1) December 2013 (2) October 2013 (1) September 2013 (1) August 2013 (2) July 2013 (3) June 2013 (2) May 2013 (2) April 2013 (1) February 2013 (2) January 2013 (1) December 2012 (1) November 2012 (2) September 2012 (1) August 2012 (1) July 2012 (2) June 2012 (1) May 2012 (2) April 2012 (1) March 2012 (2) February 2012 (4) January 2012 (1) December 2011 (2) November 2011 (4) October 2011 (1) September 2011 (3) August 2011 (3) July 2011 (3) May 2011 (2) April 2011 (3) March 2011 (2) February 2011 (3) January 2011 (2) December 2010 (3) November 2010 (3) October 2010 (1) September 2010 (3) August 2010 (3) July 2010 (6) June 2010 (9) May 2010 (8) April 2010 (3) Topics advice on owning a bar Best Places to eat in Spokane Valley Breakfast in Spokane Valley Closing Business in Spokane Valley entertainment Home building in the Valley Lessons on Loving lunch specials in spokane valley Meandering Valley Thoughts Northwest Travel Opening Business in Spokane Valley Reviews and comments Scott Creach Spokane Valley Bars Spokane Valley Coffee Houses Spokane Valley Dining Spokane Valley Folks Spokane valley lunch specials Spokane Valley Seafood Uncategorized Ryan Heaton of Senor Froggy’s has been shining at dining for 37 years Posted: February 19, 2013 in Best Places to eat in Spokane Valley Tags: ryan heaton , senor froggies spokane valley 2 I have known Ryan Heaton, owner of the Valley Senior Froggys since about 1973 when he and I played trumpet  at Bowdish Junior High. I was a consistent third or fourth chair below Renny Smith and Teresa Tsalaky while Ryan, who was a year younger, normally sat far below. Everyone hated those surprise tryouts that publicly and painfully exposed our lack of musical talent and lazy practicing habits. Anything could happen. More than once I sat at the bottom after a humiliating attempt, only to look up the line to see Ryan beaming back down at me from my old chair after he had pulled off an unusually good performance. Even on his best trumpet days, I would not have put him on my most-likely-to-succeed list. It was not  until high school when he began bussing tables at the Valley Red Lion that it became apparent that he possessed first-chair talent in the hospitality field . One year out of high school at age 19, he was managing The 1881 Room at the Sheraton Hotel downtown.  Back then Patsy Clark’s was their main competition, today it would be Churchill’s or Spencer’s, which is at the 1881 Room’s former location. After problems developed with a new general manager, Ryan thought he could do better and so applied for the manager position when it came open at the neighboring Casablanca restaurant, owned by the Omni Corporation. They liked the looks of the kid but not the idea of him running a place where he was not old enough to go into the bar, especially when its nightclub was downtown’s hottest. They lured him away by offering him a better salary and a manager position at their Taco Time on Division. At one time, Omni had a big operation in Spokane. They owned Casablanca, all the Taco Times, Fuddrucker’s and The Rocking Horse Saloon. Ryan became a key team player they moved  around to run other local Taco Times for a few years. Then they sent him to  California to open a new Fuddrucker’s before coming back to open and manage their new Spokane Fudruckers, a gourmet hamburger franchise . By the time he was 25, they put him at the helm of their starship, The Casablanca where he was in charge of four assistant managers and 95 employees. After meeting Dave Hooke at a golf tournament, Ryan decided it would be better to raise is two young boys on fast food. The plan was that he would be allowed to buy into Dave’s  local franchise, Senor Froggys, a move designed to help fund Dave’s retirement and secure one for himself. That was 23 years ago and things have progressed nicely, with Ryan owning the Valley and Indiana Froggy’s. The nice progress has come through a battle of wits and hard work against difficulties like  relentless national competition, an abysmal economy and a traffic shift that did not work in his favor. Ryan has kept his Froggys hopping by using two key strategies. One of the strategies was cutting edge when he became a Bruchi’s franchisee and co-branded it together with his two Senior Froggy’s  11 years ago. He was the first in Spokane to implement this nationwide trend, offering two original Spokane franchises in one location. Beyond menus that complimented each other, Ryan and Bruce Greene, founder and owner of Bruchi’s worked well together, having known each other from the Casablanca days when Bruce was an assistant manager under Ryan. Currently, they are partners in the new Cheney Bruchi’s and up until January, Ryan ran the North Town and Valley Mall Bruchi’s. Knowing a year in advance that he would be loosing his lease at the malls, Ryan  took the co-branding concept to the next level, coco-branding, and brought in Itallalian Express, another local franchise that had been started by Dave Hooke with recipes provided by  Luigi’s owner, Marty Hoberg , who had been one of Ryan’s busboy at the 1881 Room. The second strategy Ryan has implemented is himself. He will tell you he believes he has been  at the same location for 23 years because they deliver a consistent, quality product for a good price. While that may be true, Ryan is the one who has ensured those standards day in, day out. He is hands-on and works everyday, 40 hours a week. When you combine that work ethic with a 1st-chair talent for playing to a room full of diners, The Froggie is going to make it even in the rough waters of the Spokane Valley fast food pond. When I took Mom to lunch there the other day, he took our order at the counter and delivered the meal. It occurred to me how unusual it is at a fast food place for anyone, let alone the owner, to bring the food out even though it seems like a pretty simple but accommodating service to provide. I guess that it is something that only an owner who enjoyed working with his crew and serving his customers would be happy to do. I would imagine most owners would not enjoy either. I could tell Ryan, however, is the oddball and is happy to be doing what he was doing and to be where he is at. As I sat looking up at him from my chair as he cheerfully cleared our table, I recognized that  look of contentment on his face from forty years before and I knew it was genuine. I have no problem vouching for their raviolli. They also offer it with alfredo. Mom will have to vouch for their chimichanga. It must be good because she has been eating this at Senor Froggies for years. All I know is that it looks mighty tempting. The only thing happier than that frog on the outside is the big bullfrog on the inside. Rate this: Share this: Share Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print Click to share on LinkedIn (Opens in new window) LinkedIn Click to share on Reddit (Opens in new window) Reddit Like Loading... Related Comments rcfryguy@aol.com says: February 20, 2013 at 6:36 pm Thanks for the compliments Craig,  Renny Smith and Teresa Tsalaky boy did that bring back memories of Mr. Shook and the Bowdish days. I still fondly think of the Percussion Naut days probably the best summer of my teenage life!   Mel Clayton actually ate at the restaurant a few months back and I run into Renny quite frequently ( he is in a business partnership with a close friend). Glad you enjoyed your meal the other day, hopefully you will be back to enjoy more of my fare in the months to come. See you soon! Reply rcfryguy@aol.com says: February 21, 2013 at 5:15 pm Craig,  Some spelling info.  Senor Froggy’s.  Fuddruckers. Dave Hooke and Bruce Greene. I don’t think that we can say that the Italian Express was a concept started by Dave Hooke AND Marty Hoberg as the concept was only started by Dave Hooke with some input on Recipes and menu development from Marty Hoberg that gave him the right initially to call it Luigi’s Italian express, However the Luigis was taken off the sign and was just renamed Italian express after Marty and Dave had a dis-agreement on some issues.. FYI Other than that everything else is pretty much in line with my small life story with the exception of a small stent in Seattle…but you know that… Ryan Reply Leave a comment Cancel reply Δ Go to a Lovers’ Pearl Apart for Valentine’s Day An Amazing Young Woman Blog at WordPress.com. Comment Reblog Subscribe Subscribed Spokane Valley Scoop Join 70 other subscribers Sign me up Already have a WordPress.com account? Log in now. Spokane Valley Scoop Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email Name Website %d"
    },
    {
      "url": "https://www.thefroggyssaloon.com/",
      "text": "Froggy's Saloon | Iconic Biker bar in Daytona Beach | 800 Main St, Daytona Beach, FL, USA top of page Events Froggy's Merch Specials Employment Rally Event Application Perminant Staff Application Vendors About Contact Us 1/3 Upcoming Events Specials Froggy's Merch To play, press and hold the enter key. To stop, release the enter key. The Socials #DrinkLocal >> Employment << Contact Froggy's Saloon 1 (386) 253-0330 info@thefroggyssaloon.com Privacy Hours Mon - Sun:  7am - 2am 800 Main St. Daytona Beach FL, 32118 © 2025 by Froggy's Saloon. FOLLOW THE FUN ON SOCIAL MEDIA! bottom of page"
    },
    {
      "url": "https://www.squishandcharlie.com/contact-us/",
      "text": "Contact Us | Squish and Charlie's Doggy Daycare Skip to content squish@squishandcharlie.com 403-471-1563 Squish and Charlie's Doggy Daycare Toggle menu visibility. Home Services Doggy Daycare Dog Walking Dog Grooming Register Now Contact Us Find all our Socials, including the intake form here: Squish and Charlie’s Linktree #squishandcharlie #yyc #yycdoggydaycare #yycdogs #dogsofcalgary #calgarydogs #doglife #calgarypets #yycpets Get in Touch We are here to answer any questions you may have. Reach out to us and we’ll respond as soon as we can. Email squish@squishandcharlie.com Phone 403-471-1563 Address 3644 Manchester Road SE, Calgary AB Squish and Charlie’s is: Squish and Charlie's Doggy Daycare Toggle menu visibility. facebook instagram TikTok Useful Links Toggle menu visibility. Dog Walking Price List Contact Us Contact Us 403-471-1563 squish@squishandcharlie.com 3644 Manchester Road SE, Calgary AB"
    },
    {
      "url": "https://www.thestitchsaloon.com/pages/contact-us",
      "text": "Contact Us\n – The Stitch Saloon Skip to content US Shipping is currently suspended. We hope to have shipping back up and running as soon as possible. Thank you for your ongoing patience and support of our little shop! US Shipping is currently suspended. We hope to have shipping back up and running as soon as possible. Thank you for your ongoing patience and support of our little shop! 567 Magill Road, Magill SA 5072     - Wed, Fri & Sat 10-3 Free domestic shipping on orders over $150 AUD Shop Shop Fabric Fabric Fabric from the Bolt Fabric Bundles Patchwork Quilt Kits Wholecloth Quilt Kits Precuts Small Sewing Projects Solid Fabrics Haberdashery Haberdashery Batting Bias & Quilt Binding Clips Cute Things Cutting Tools & Scissors English Paper Piecing (EPP) Essentials Needles Pins Pressing Tools Quilting Tools Rulers Sewing Labels Tailor's Clappers Thread - Embroidery Thread - Hand Quilting Thread - Machine Shop All Patterns Patterns Quilt Patterns Small Sewing Patterns Embroidery Patterns Embroidery Embroidery Stitchery Kits Stitchery Patterns Embroidery Tools & Hoops Embroidery Threads Stick & Stitch Heirloom Items Heirloom Items Quilts Christmas Stockings Sale & Last Chance Sale & Last Chance Remnants Clearance Fabrics One Bolt Wonders Gift Cards Gift Cards Gift Cards Gift Shop Gift Shop Shop by Budget Shop by Budget Gifts under $25 Gifts under $50 Gifts under $100 Gifts over $100 Shop by Technique Shop by Technique Gifts for All Quilters Gifts for Machine Sewers Gifts for Hand Piecers Gifts for Non-Quilters Gifts for Embroiderers Gifts for Young Sewers Gifts for Stash Busting Shop by Kit Shop by Kit Quilt Kits Sewing Kits Embroidery Kits Gift Cards Quilting Services Quilting Services Quilting Services Binding Services Workshops Community Community Blog & Tutorials Information Information Our Story Shipping & Returns FAQs Visit Us Pattern Corrections Contact Us Log in Facebook Pinterest Instagram Search our site Clear Shop Fabric Fabric from the Bolt Fabric Bundles Patchwork Quilt Kits Wholecloth Quilt Kits Precuts Small Sewing Projects Solid Fabrics Haberdashery Batting Bias & Quilt Binding Clips Cute Things Cutting Tools & Scissors English Paper Piecing (EPP) Essentials Needles Pins Pressing Tools Quilting Tools Rulers Sewing Labels Tailor's Clappers Thread - Embroidery Thread - Hand Quilting Thread - Machine Shop All Patterns Quilt Patterns Small Sewing Patterns Embroidery Patterns Embroidery Stitchery Kits Stitchery Patterns Embroidery Tools & Hoops Embroidery Threads Stick & Stitch Heirloom Items Quilts Christmas Stockings Sale & Last Chance Remnants Clearance Fabrics One Bolt Wonders Gift Cards Gift Cards Gift Shop Shop by Budget Gifts under $25 Gifts under $50 Gifts under $100 Gifts over $100 Shop by Technique Gifts for All Quilters Gifts for Machine Sewers Gifts for Hand Piecers Gifts for Non-Quilters Gifts for Embroiderers Gifts for Young Sewers Gifts for Stash Busting Shop by Kit Quilt Kits Sewing Kits Embroidery Kits Gift Cards Quilting Services Quilting Services Binding Services Workshops Community Blog & Tutorials Information Our Story Shipping & Returns FAQs Visit Us Pattern Corrections Contact Us Search our site Clear Log in Cart Cart Contact Us If you are looking for a custom fabric bundle, a custom quilt or anything else, I would love to hear from you! Please get in touch using the form below and I'll get back to you for a chat! Alternatively, we are available via email or social media. Email: thestitchsaloon@outlook.com IG: @thestitchsaloon We'd love to help you! Name Email * Phone number Comment Send message This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Email thestitchsaloon@outlook.com Business Hours Wed, Fri and Sat 10-3 Phone 0431 183 473 (we are generally only able to answer during our shop hours - please email us otherwise!) Follow us Facebook Pinterest Instagram Shop Home Maker Shop Home Shop Custom Quilts About Us Shipping FAQs Contact Us Policies Pattern Corrections Shipping & Return Policy Privacy Policy Terms of Service GPSR & Safety Regulations Acknowledgement of Country We acknowledge and pay our respects to the Kaurna people, the traditional custodians whose ancestral lands we live and work on. Join our mailing list Enter email here Pop your email above to sign up to our newsletter where we keep you updated every so often on new products, promotions and helpful tips and tricks. Facebook Pinterest Instagram Follow us on social media! © 2025, The Stitch Saloon . All rights reserved. Powered by Shopify Country/region AFN ؋ EUR € ALL L DZD د.ج EUR € AUD $ XCD $ XCD $ AUD $ AMD դր. AWG ƒ SHP £ AUD $ EUR € AZN ₼ BSD $ AUD $ BDT ৳ BBD $ AUD $ EUR € BZD $ XOF Fr USD $ AUD $ BOB Bs. BAM КМ BWP P AUD $ USD $ USD $ BND $ BGN лв. XOF Fr BIF Fr KHR ៛ XAF CFA CAD $ CVE $ USD $ KYD $ XAF CFA XAF CFA AUD $ CNY ¥ AUD $ AUD $ AUD $ KMF Fr XAF CFA CDF Fr NZD $ CRC ₡ XOF Fr EUR € ANG ƒ EUR € CZK Kč DKK kr. DJF Fdj XCD $ DOP $ USD $ EGP ج.م USD $ XAF CFA AUD $ EUR € AUD $ ETB Br FKP £ DKK kr. FJD $ EUR € EUR € EUR € XPF Fr EUR € XOF Fr GMD D AUD $ EUR € AUD $ GBP £ EUR € DKK kr. XCD $ EUR € GTQ Q GBP £ GNF Fr XOF Fr GYD $ AUD $ HNL L HKD $ HUF Ft ISK kr INR ₹ IDR Rp AUD $ EUR € GBP £ ILS ₪ EUR € JMD $ JPY ¥ AUD $ AUD $ KZT ₸ KES KSh AUD $ EUR € AUD $ KGS som LAK ₭ EUR € LBP ل.ل AUD $ AUD $ AUD $ CHF CHF EUR € EUR € MOP P AUD $ MWK MK MYR RM MVR MVR XOF Fr EUR € EUR € AUD $ MUR ₨ EUR € AUD $ MDL L EUR € MNT ₮ EUR € XCD $ MAD د.م. AUD $ MMK K AUD $ AUD $ NPR Rs. EUR € XPF Fr NZD $ NIO C$ XOF Fr NGN ₦ NZD $ AUD $ MKD ден AUD $ AUD $ PKR ₨ ILS ₪ USD $ PGK K PYG ₲ PEN S/ PHP ₱ NZD $ PLN zł EUR € QAR ر.ق EUR € RON Lei AUD $ RWF FRw WST T EUR € STD Db SAR ر.س XOF Fr RSD РСД AUD $ SLL Le SGD $ ANG ƒ EUR € EUR € SBD $ AUD $ AUD $ GBP £ KRW ₩ AUD $ EUR € LKR ₨ EUR € SHP £ XCD $ XCD $ EUR € EUR € XCD $ AUD $ AUD $ AUD $ SEK kr CHF CHF TWD $ TJS ЅМ TZS Sh THB ฿ USD $ XOF Fr NZD $ TOP T$ TTD $ GBP £ AUD $ AUD $ AUD $ USD $ AUD $ USD $ UGX USh UAH ₴ AED د.إ GBP £ USD $ UYU $U UZS so'm VUV Vt EUR € USD $ VND ₫ XPF Fr MAD د.م. YER ﷼ AUD $ USD $ Update country/region Country/region Australia (AUD $) Australia (AUD $) Afghanistan (AFN ؋) Åland Islands (EUR €) Albania (ALL L) Algeria (DZD د.ج) Andorra (EUR €) Angola (AUD $) Anguilla (XCD $) Antigua & Barbuda (XCD $) Argentina (AUD $) Armenia (AMD դր.) Aruba (AWG ƒ) Ascension Island (SHP £) Austria (EUR €) Azerbaijan (AZN ₼) Bahamas (BSD $) Bahrain (AUD $) Bangladesh (BDT ৳) Barbados (BBD $) Belarus (AUD $) Belgium (EUR €) Belize (BZD $) Benin (XOF Fr) Bermuda (USD $) Bhutan (AUD $) Bolivia (BOB Bs.) Bosnia & Herzegovina (BAM КМ) Botswana (BWP P) Brazil (AUD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (BND $) Bulgaria (BGN лв.) Burkina Faso (XOF Fr) Burundi (BIF Fr) Cambodia (KHR ៛) Cameroon (XAF CFA) Canada (CAD $) Cape Verde (CVE $) Caribbean Netherlands (USD $) Cayman Islands (KYD $) Central African Republic (XAF CFA) Chad (XAF CFA) Chile (AUD $) China (CNY ¥) Christmas Island (AUD $) Cocos (Keeling) Islands (AUD $) Colombia (AUD $) Comoros (KMF Fr) Congo - Brazzaville (XAF CFA) Congo - Kinshasa (CDF Fr) Cook Islands (NZD $) Costa Rica (CRC ₡) Côte d’Ivoire (XOF Fr) Croatia (EUR €) Curaçao (ANG ƒ) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Djibouti (DJF Fdj) Dominica (XCD $) Dominican Republic (DOP $) Ecuador (USD $) Egypt (EGP ج.م) El Salvador (USD $) Equatorial Guinea (XAF CFA) Eritrea (AUD $) Estonia (EUR €) Eswatini (AUD $) Ethiopia (ETB Br) Falkland Islands (FKP £) Faroe Islands (DKK kr.) Fiji (FJD $) Finland (EUR €) France (EUR €) French Guiana (EUR €) French Polynesia (XPF Fr) French Southern Territories (EUR €) Gabon (XOF Fr) Gambia (GMD D) Georgia (AUD $) Germany (EUR €) Ghana (AUD $) Gibraltar (GBP £) Greece (EUR €) Greenland (DKK kr.) Grenada (XCD $) Guadeloupe (EUR €) Guatemala (GTQ Q) Guernsey (GBP £) Guinea (GNF Fr) Guinea-Bissau (XOF Fr) Guyana (GYD $) Haiti (AUD $) Honduras (HNL L) Hong Kong SAR (HKD $) Hungary (HUF Ft) Iceland (ISK kr) India (INR ₹) Indonesia (IDR Rp) Iraq (AUD $) Ireland (EUR €) Isle of Man (GBP £) Israel (ILS ₪) Italy (EUR €) Jamaica (JMD $) Japan (JPY ¥) Jersey (AUD $) Jordan (AUD $) Kazakhstan (KZT ₸) Kenya (KES KSh) Kiribati (AUD $) Kosovo (EUR €) Kuwait (AUD $) Kyrgyzstan (KGS som) Laos (LAK ₭) Latvia (EUR €) Lebanon (LBP ل.ل) Lesotho (AUD $) Liberia (AUD $) Libya (AUD $) Liechtenstein (CHF CHF) Lithuania (EUR €) Luxembourg (EUR €) Macao SAR (MOP P) Madagascar (AUD $) Malawi (MWK MK) Malaysia (MYR RM) Maldives (MVR MVR) Mali (XOF Fr) Malta (EUR €) Martinique (EUR €) Mauritania (AUD $) Mauritius (MUR ₨) Mayotte (EUR €) Mexico (AUD $) Moldova (MDL L) Monaco (EUR €) Mongolia (MNT ₮) Montenegro (EUR €) Montserrat (XCD $) Morocco (MAD د.م.) Mozambique (AUD $) Myanmar (Burma) (MMK K) Namibia (AUD $) Nauru (AUD $) Nepal (NPR Rs.) Netherlands (EUR €) New Caledonia (XPF Fr) New Zealand (NZD $) Nicaragua (NIO C$) Niger (XOF Fr) Nigeria (NGN ₦) Niue (NZD $) Norfolk Island (AUD $) North Macedonia (MKD ден) Norway (AUD $) Oman (AUD $) Pakistan (PKR ₨) Palestinian Territories (ILS ₪) Panama (USD $) Papua New Guinea (PGK K) Paraguay (PYG ₲) Peru (PEN S/) Philippines (PHP ₱) Pitcairn Islands (NZD $) Poland (PLN zł) Portugal (EUR €) Qatar (QAR ر.ق) Réunion (EUR €) Romania (RON Lei) Russia (AUD $) Rwanda (RWF FRw) Samoa (WST T) San Marino (EUR €) São Tomé & Príncipe (STD Db) Saudi Arabia (SAR ر.س) Senegal (XOF Fr) Serbia (RSD РСД) Seychelles (AUD $) Sierra Leone (SLL Le) Singapore (SGD $) Sint Maarten (ANG ƒ) Slovakia (EUR €) Slovenia (EUR €) Solomon Islands (SBD $) Somalia (AUD $) South Africa (AUD $) South Georgia & South Sandwich Islands (GBP £) South Korea (KRW ₩) South Sudan (AUD $) Spain (EUR €) Sri Lanka (LKR ₨) St. Barthélemy (EUR €) St. Helena (SHP £) St. Kitts & Nevis (XCD $) St. Lucia (XCD $) St. Martin (EUR €) St. Pierre & Miquelon (EUR €) St. Vincent & Grenadines (XCD $) Sudan (AUD $) Suriname (AUD $) Svalbard & Jan Mayen (AUD $) Sweden (SEK kr) Switzerland (CHF CHF) Taiwan (TWD $) Tajikistan (TJS ЅМ) Tanzania (TZS Sh) Thailand (THB ฿) Timor-Leste (USD $) Togo (XOF Fr) Tokelau (NZD $) Tonga (TOP T$) Trinidad & Tobago (TTD $) Tristan da Cunha (GBP £) Tunisia (AUD $) Türkiye (AUD $) Turkmenistan (AUD $) Turks & Caicos Islands (USD $) Tuvalu (AUD $) U.S. Outlying Islands (USD $) Uganda (UGX USh) Ukraine (UAH ₴) United Arab Emirates (AED د.إ) United Kingdom (GBP £) United States (USD $) Uruguay (UYU $U) Uzbekistan (UZS so'm) Vanuatu (VUV Vt) Vatican City (EUR €) Venezuela (USD $) Vietnam (VND ₫) Wallis & Futuna (XPF Fr) Western Sahara (MAD د.م.) Yemen (YER ﷼) Zambia (AUD $) Zimbabwe (USD $) Payment methods American Express Apple Pay Bancontact Google Pay iDEAL Mastercard PayPal Shop Pay Union Pay Visa Home Menu Search Shop Cart Account Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://froggy981.com/contact-us/",
      "text": "Contact Us | Froggy 98 - Today's Best Country! Menu Listen Live On Air Playlist Program Schedule Gary and Johanna | 6-10a Cory Edmondson | 10a-3p Brooke Summers | 3-7p Robyn Burnison | Weekends Concerts Contests Bargains Connect Get the App Alexa Station Events Community Events Husker Football Closings About Careers Contest Rules Advertise Contact Us × Search On Air Playlist Program Schedule Gary and Johanna | 6-10a Cory Edmondson | 10a-3p Brooke Summers | 3-7p Robyn Burnison | Weekends Concerts Contests Bargains Connect Get the App Alexa Station Events Community Events Husker Football Closings About Careers Contest Rules Advertise Contact Us Now Playing Froggy 98 - Today's Best Country! Contact Us We’re always ready and willing to listen! If you need to get in touch with us here, feel free!  You can also use the form below for general questions and comments about Froggy 98 – KFGE. Mailing Address: 4343 O Street Lincoln, NE 68510 Phone Numbers: Studio Phone Number: (402) 474-FROG (3764) Business Phone Number: (402) 475-4567 Traffic Phone Number: (402) 479-1414 Business FAX – (402) 479-1411 Gary Greenwood – Morning Show | Gary@Froggy981.com Johanna – Morning Show | jperkins@nrgmedia.com Primary Contacts: Ami Graham – General Manager | amig@broadcasthouse.com Steve King – Operations Manager | sking@broadcasthouse.com Cory Edmondson – Program Director | cory@froggy981.com Froggy 98 offices are open Monday – Thursday, 8:00a – 5:00p.   Friday 8:00am – 4:30pm.  Our offices are closed on all major holidays and may close early the day before holidays. Please call 402-475-4567 for inquiries about our office hours. Contact Form Your Name: * Your Email Address: * Your Phone Number (Optional): Who would you like to contact? Management Sales Programming Other Help us route your request to the right person by selecting the appropriate department. If you're not sure, just select OTHER and we will make sure your request gets to the right person. How can we help you? * 0 / 1500 This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Message Advertise EEO FCC Applications Public Files Privacy Policy Terms Of Service Copyright © 2025. All Rights Reserved. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. We use cookies for various purposes including analytics and marketing.  By continuing to use this service, you agree to use cookies by us and our third-party service providers as described in the Privacy Policy. Learn More I Accept"
    }
  ]
}