{
  "fuentes": [
    {
      "url": "https://www.appspace.com/the-marlin-company/",
      "email": "billing@themarlincompany.com"
    },
    {
      "url": "https://business.indianriverchamber.com/list/member/green-marlin-restaurant-4945",
      "email": "chamber@indianriverchamber.com"
    },
    {
      "url": "https://www.marlinmag.com/contact-us/",
      "email": "dave.morel@marlinmag.com"
    },
    {
      "url": "https://www.marlintech.com/contact/",
      "email": "chris@marlintech.eu"
    },
    {
      "url": "https://www.marlintech.com/contact/",
      "email": "info@ssterlingco.com"
    },
    {
      "url": "https://www.marlintech.com/contact/",
      "email": "info@williamfmiller.com"
    },
    {
      "url": "https://www.marlintech.com/contact/",
      "email": "sales@marlintech.com"
    },
    {
      "url": "https://www.marlintech.com/contact/",
      "email": "sales@shankpower.com"
    },
    {
      "url": "https://bigmarlin.group/contact/",
      "email": "info@bigmarlingroup.com"
    },
    {
      "url": "https://www.greenshoe.org/contact",
      "email": "ainfo@greenshoe.org"
    },
    {
      "url": "https://www.greenshoe.org/contact",
      "email": "info@greenshoe.org"
    },
    {
      "url": "https://themarlinalliance.com/about-us/",
      "email": "contactus@themarlinalliance.com"
    },
    {
      "url": "https://themarlinalliance.com/about-us/",
      "email": "contactus@themarlinalliance.com"
    },
    {
      "url": "https://bluemarpartners.com/our-team/",
      "email": "info@bluemarpartners.com"
    },
    {
      "url": "https://marlinmfg.com/staging/old-site/contactus.html",
      "email": "accutecsales@comcast.net"
    },
    {
      "url": "https://marlinmfg.com/staging/old-site/contactus.html",
      "email": "gcarlin@techequipsales.com"
    },
    {
      "url": "https://marlinmfg.com/staging/old-site/contactus.html",
      "email": "jnye@techequipsales.com"
    },
    {
      "url": "https://marlinmfg.com/staging/old-site/contactus.html",
      "email": "johns@marlinmfg.com"
    },
    {
      "url": "https://marlinmfg.com/staging/old-site/contactus.html",
      "email": "mcrowe@techequipsales.com"
    },
    {
      "url": "https://marlinmfg.com/staging/old-site/contactus.html",
      "email": "mike@traskinst.com"
    },
    {
      "url": "https://marlinmfg.com/staging/old-site/contactus.html",
      "email": "sales@marlinmfg.com"
    },
    {
      "url": "https://www.potomacmarlins.com/page/team-information/coaching-staff",
      "email": "analthouse@icloud.com"
    }
  ],
  "mails": [
    "accutecsales@comcast.net",
    "ainfo@greenshoe.org",
    "analthouse@icloud.com",
    "billing@themarlincompany.com",
    "chamber@indianriverchamber.com",
    "chris@marlintech.eu",
    "contactus@themarlinalliance.com",
    "dave.morel@marlinmag.com",
    "gcarlin@techequipsales.com",
    "info@bigmarlingroup.com",
    "info@bluemarpartners.com",
    "info@greenshoe.org",
    "info@ssterlingco.com",
    "info@williamfmiller.com",
    "jnye@techequipsales.com",
    "johns@marlinmfg.com",
    "mcrowe@techequipsales.com",
    "mike@traskinst.com",
    "sales@marlinmfg.com",
    "sales@marlintech.com",
    "sales@shankpower.com"
  ],
  "nombre_sitio": "thegreenmarlin.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.appspace.com/the-marlin-company/",
      "text": "The Marlin Company: Enhancing Workplace Comms Skip to content | The ultimate workplace experience conference The ultimate workplace experience conference Learn more Learn more Get in the know: An Appspace reveal event Save your spot Platform Employee Comms Employee intranet Employee mobile app Digital Signage Video walls Kiosks Space Reservation Room booking Desk reservation Visitor Management Wayfinding Platform overview Appspace AI Content creation & publishing Integrations Reporting & analytics Security Solutions By need Frontline workers Hybrid workplace Smart workplace Culture & engagement Asynchronous communications By team Communications teams Workplace teams Facilities teams IT teams By industry Financial services Healthcare Industrial & manufacturing Retail Education Resources WX Hub Customer stories Blog Guides & more Events & webinars In the news CUSTOMER RESOURCES Marketplace Community Services Knowledge Center Support Partners Our Partners Hardware & software partners Resellers & alliance partners Appspace for Microsoft Appspace for Google Partner portal Become a partner X Workplace Communications Workplace Management Intranet Employee Communications Digital Signage Software Content & Publishing Space Reservation Visitor Management Wayfinding Solutions For Communication Teams For Workplace Teams For Frontline Workers For Hybrid Teams IT Recession-Proof Better Office Experience Appspace for Microsoft Appspace for Google Appspace AI Customer Knowledge Center Support Product Roadmap Pricing Resources WX Hub Blog Guides & More Events & Webinars Customer Stories About Us Press Partners Knowledge Center Try For Free Sign in Contact Us X Pricing Sign in Try for free Contact sales Welcome to Appspace! The Marlin Company has been acquired by Appspace. Marlin (The Marlin Company) is pleased to announce that we are now part of the Appspace team! Appspace is excited to extend world-class employee communication and space management solutions to Marlin customers. The Appspace workplace experience platform offers innovative digital signage solutions, exceptional customer care, and award-winning content to customers all over the world. Improving Workspace Digital Signage Solutions for the Marlin Company With Appspace you will continue to enjoy the best of Marlin but now have access to innovative workplace communication tools to enhance your facility. Appspace allows you to use the power of visual communications coupled with space management for the modern and hybrid workplace. The Appspace platform unifies teams with clearer communication and workplace tools that keep everyone connected and working together whether they’re on the factory floor, warehouse, office, on-the-go, or at home. Enhance your workplace communication with Appspace today! Press Release Learn more about how Marlin and Appspace are joining forces to help deliver even more workplace solutions to Marlin customers. Read the press releases › Learn more about the Appspace Platform Employee communications Digital signage has been a great way for you to communicate with your workers. Appspace also does just that. Keep your workers safe, aligned, and engaged throughout their workday with visual communications that are eye-catching and informative just as you’ve always expected. Learn more about Digital Signage › Easy to use, device agnostic platform Reach all of your employees Personalize and brand your messaging Target individual displays or groups Appspace content Marlin content has always been an important part of the solution. Appspace now offers the same great content Marlin has provided with even more enhancements. Whether it’s reinforcing critical industry-specific issues or creating a safe workplace experience, Appspace offers the content and strategies needed to connect your employees. Learn more about Content › Stakeholder content Industry topical feeds Built-in strategy with the whole person in mind Branded templates Workspace management Whether it is your factory, loading dock, or office space, manage your facility and keep your workforce and visitors safe. Learn more about Space Management › Room & desk reservation Maps & wayfinding Empoyees & guests Are you a Marlin customer looking for more information? Check out our FAQs What does this mean for my business? Marlin customers will continue to receive the same high-level of support as they do today. Additionally,  Appspace extends the Marlin team with an additional 125 dedicated professionals that will enable us to  deliver more, faster than ever before. Appspace brings to the table extensive insight and experience, as well as an expanded solution set that will  help Marlin customers realize their communication and productivity initiatives across the workplace. Can I continue to use my Marlin solution(s)? Yes. You will be able to continue to use your Marlin solutions. With more than 3,000 customers leveraging  Marlin solutions, there are no imminent plans to restrict usage or discontinue support for these products. Where should I go for product support? You can continue to use the same methods to contact support that you do today. To contact Marlin support call 866-877-7895, Monday - Friday 8:30am - 8pm EST. or email TechSupport@themarlincompany.com Can I still purchase new hardware? Yes, you can. Contact your Marlin account executive. If you don’t know your account executive, fill out this contact form at appspace.com/contact-sales and we’ll follow up with you. Where should I submit payments? There are no changes to the payment process. You can continue to remit payment as usual. Contact Billing@themarlincompany.com if you have any questions. How would my company add Appspace to our existing network/deployment? If you would like to move to the Appspace platform, your account executive can help  you work with an Appspace representative to find the right plan and get you started. If you don’t know your account executive, you can reach us here appspace.com/contact-sales/ . Will I still be able to contact my Marlin account executive? Yes. Your Marlin account executive will continue to serve you as your point of contact, however their email address will change to Appspace. Emails sent to Marlin addresses will be forwarded to the correct Appspace address and we encourage you to make note and begin using Appspace addresses moving forward. . Will the Connecticut office remain open? Yes. Marlin’s Connecticut office will remain open. Appspace’s primary US office is its headquarters located in  Dallas, Texas with additional offices in London, Dubai, and Kuala Lumpur. Will my Marlin solutions continue to be supported? Yes. With 3,000+ customers leveraging Marlin’s solutions, there are no plans to discontinue support in the  foreseeable future. Appspace will continue to support Marlin solutions as long as it makes sense for our  customers. How is the Appspace product different from Marlin? Traditionally Marlin has been the source for digital signage solutions for industries such as manufacturing, warehouse, healthcare, sanitation, utilities, and a provider of award winning content. While the Appspace platform was born in digital signage it goes beyond passive displays to offer space management solutions, interactive capabilities, and content needed to manage the entire workplace from corporate offices to the warehouse. Who can I contact to learn more about Appspace's capabilities? Your Marlin account executive will be able to connect you with the right resources for a demo and  exploratory conversations about the Appspace suite of products.  If you don’t know your account executive, you can reach us here appspace.com/contact-sales/ . If you have any additional questions that were not answered by this FAQ, or would like to set up a meeting with members of the Marlin and Appspace team, please contact your account executive who will work to arrange a date and time that is most convenient for you. If you don’t know your account executive, you can reach us here appspace.com/contact . Need a simple tool to drive workplace engagement and productivity? Try for free PLATFORM Employee Communications Digital Signage Space Reservation Visitor Management Intranet Content & Publishing Wayfinding COMPANY About Leadership Services Partners Careers Press GET THE APP HELPFUL LINKS Get Support Manage an Account Cloud Status Legal Privacy Policy Contact Linkedin Facebook Youtube Get email alerts © 2025 Appspace Inc. Appspace is a registered trademark of Appspace Inc. All rights reserved. Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Manage consent"
    },
    {
      "url": "https://business.indianriverchamber.com/list/member/green-marlin-restaurant-4945",
      "text": "Green Marlin Restaurant | Restaurant - Bar Skip to content Visit Indian River | Economic Development Join Today Member Login Contact Us Facebook Instagram LinkedIn Menu Our Community Community Calendar Chamber Talk with Bob Soos 105.7FM Community Links Meeting Space – Conference Room Rental In the News/Press Releases Job Postings Restaurant Guide Member Directory About the Chamber About Us Business Directory and Community Guide Magazine Strategic Plan 2023-2025 2025 Legislative Priorities Ambassadors Board of Directors Join Us Contact Us Our Staff Alma Lee Loy 2025 New Chamber Members Events & Programs Signature Events 5K on the Runway Chamber Golf Classic State of the County Luncheon 2025 Legislative Luncheon Tourism Luncheon Industry Appreciation Awards Breakfast Annual Awards Meeting Tree Lighting Festival YPN Young Professionals Network Leadership Education Leadership Indian River Member Center Member Login IRC Chamber App Member Calendar Ribbon Cuttings Member Deals Green Marlin Restaurant Categories Restaurant - Bar 1475 US Highway 1 Vero Beach FL 32960 (772) 999-5248 Send Email Visit Website Hours: Sunday Monday Tuesday Wednesday 11:00 AM - 10:00 PM Thursday Friday Saturday 11:00 AM - 11:00 PM About Us Green Marlin Restaurant & Raw Bar opened in August 2017 by owner & operator, Lou Kolbauer.  Our goal was to provide a relaxing atmosphere for Vero Beach residents to be able to enjoy the freshest seafood.  We felt Vero Beach was missing a casual sit-down restaurant that offered fresh oysters & top notch seafood at an affordable price.  We want the Green Marlin to be your first choice in Vero for seafood. We order fresh seafood every day but only enough for one day. Highlights Seafood Soups & Salads Raw Bar Full Bar Open for Lunch and Dinner Images Gallery Image Green%20Marlin%20Pic%201.JPG × Gallery Image Green%20Marlin%20Pic%202.JPG × Gallery Image Green%20Marlin%20Pic%203.JPG × Gallery Image Green%20Marlin%20Pic%204.JPG × Gallery Image Green%20Marlin%20Pic%205.JPG × Gallery Image Green%20Marlin%20Pic%206.JPG × Gallery Image Green%20Marlin%20Pic%207.JPG × Gallery Image Green%20Marlin%20Pic%208.JPG × Gallery Image Green%20Marlin%20Pic%209.JPG × Gallery Image Green%20Marlin%20Pic%2011.JPG × Gallery Image Green%20Marlin%20Pic%2012.JPG × Rep/Contact Info Patti Clements × Close Patti Clements Director of Operations Phone: (772) 999-5248 Send an Email 1475 US Highway 1 Vero Beach FL 32960 Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel © 2025 Indian River County Chamber of Commerce | Site by GrowthZone Building Business. Building Community. Indian River County Chamber of Commerce 1216 21st Street Vero Beach, FL 32960 (772) 567-3491 chamber@indianriverchamber.com Hours Monday: 9:00 AM - 4:00 PM Tuesday: 9:00 AM - 4:00 PM Wednesday: 9:00 AM - 4:00 PM Thursday: 9:00 AM - 4:00 PM Friday: 10:00 AM - 3:00 PM"
    },
    {
      "url": "https://www.marlinmag.com/contact-us/",
      "text": "Contact Us | Marlin Skip to content Media Advocacy Boats Gear How To Travel Tournaments Bermuda Triple Crown Los Cabos Billfish Tournament Offshore World Championship Scrub Island Billfish Series Marlin Global Challenge Hawaii Marlin Tournament Series Expeditions Los Sueños Costa Rica Guatemala – Ladies Only Guatemala Dominican Republic Nova Scotia Galápagos Islands Kona, Hawaii Services The Marlin Group Media Kit Press Releases Digital Edition Newsletters People Contact Us Media Advocacy Boats Gear How To Travel Tournaments Bermuda Triple Crown Los Cabos Billfish Tournament Offshore World Championship Scrub Island Billfish Series Marlin Global Challenge Hawaii Marlin Tournament Series Expeditions Los Sueños Costa Rica Guatemala – Ladies Only Guatemala Dominican Republic Nova Scotia Galápagos Islands Kona, Hawaii Services The Marlin Group Media Kit Press Releases Digital Edition Newsletters People Contact Us Subscribe Search Contact Us Marlin Magazine PO Box 8500 Winter Park, FL 32790-8500 Subscription Customer Service New Subscribers To subscribe to Marlin magazine, use our online order form . Current Subscribers For customer service and subscription questions, such as renewals, address changes, email preferences, billing and account status, go to marlinmag.com/cs . You can also email [email protected] or call toll free in the U.S. 800-879-0483. Outside the U.S. call (515) 237-3697 or write to: Marlin, PO Box 6364, Harlan, IA 51593 Editorial Editor-in-Chief Jack Vitek [email protected] (786) 863-3321 Advertising Publisher Dave Morel [email protected] (508) 523-1851 Publisher Emeritus Natasha Lloyd natasha.lloyd@ marlinmag.com (954) 830-4460 Cookie Settings SUBSCRIPTIONS Subscribe Renew Digital Edition Customer Service ABOUT US Advertise Press Releases Privacy Policy Terms of Use Abuse Contact Us Careers FOLLOW US Email Newsletters Facebook Instagram YouTube Pinterest THE MARLIN GROUP Media Tournaments Expeditions Advocacy Many products featured on this site were editorially chosen. Marlin may receive financial compensation for products purchased through this site. Copyright © 2025 Marlin. A Bonnier LLC Company . All rights reserved. Reproduction in whole or in part without permission is prohibited. Free Email Newsletters Sign up for free Marlin Group emails to receive expert big-game content along with key tournament updates and to get advanced notice of new expeditions as they’re introduced. Close Thank you for subscribing! Email This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Submit Subscribe to Marlin Subscribe now to get seven keepsake print editions of Marlin per year, along with instant access to a digital archive of past issues, all for only $29 per year. SUBSCRIBE X Facebook-f Twitter Instagram Youtube Search Media Media Media Advocacy Boats Gear How To Travel Tournaments Tournaments Bermuda Triple Crown Los Cabos Billfish Tournament Offshore World Championship Scrub Island Billfish Series Marlin Global Challenge Hawaii Marlin Tournament Series Expeditions Marlin Expeditions Los Sueños Costa Rica Guatemala – Ladies Only Guatemala Kona, Hawaii Nova Scotia Dominican Republic Galápagos Islands Why Us Expert Instruction Corporate Retreats Our Sponsors FAQs Contact Us Advocacy Advocacy Services The Marlin Group Media Kit Press Releases Digital Edition Magazine Newsletters People Contact Us"
    },
    {
      "url": "https://www.marlintech.com/contact/",
      "text": "Contact Marlin Technologies | Marlin Technologies About Blog Design Resources Contact Markets > Agriculture Construction Marine Refuse Turf Care Other Products > All products Controllers Keypads Displays Bridges & More The Marlin Approach > Request a Quote > Home Contact Contact Reach Out to Our Team headquarters 101 Industrial Drive PO Box 123 Horicon, WI 53032-1803 Phone: (920) 485-4463 Request A Quote Design Resources Full Name (Required) First name Last name Company Name (Required) Email Address (Required) Phone Number Address (Required) Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Comments / Questions (Required) Email This field is for validation purposes and should be left unchanged. Marlin Innovation Center W127 N8690 Westbrook Crossing Menomonee Falls, WI 53051 (920) 485-4463 • Email Marlin E.U. Sales & Engineering / Technology Team Servicing All of Europe Amsterdamsestraatweg 63 1411 AX Naarden Netherlands +31 65 37 08 656 • Email S. Sterling Co. Sales Reps Covering: AL, DE, FL, GA, IN, KY, MD, MI, MS, NJ, NY, OH, NC, PA, SC, TN, WV 102 International Dr., Peachtree City, GA 30269 (770) 362-8755 • Email William F. Miller & Associates Marine Industry Sales Reps Covering: AL, AR, FL, GA, IL (Southern) , KS, KY, LA, MS, MO, NC, OK, SC, TN, TX, VA (Southern) 2616 Grissom Dr., Nashville, TN 37204 (800) 854-4448 • Email • Website Shank Power Products Sales Reps Covering Regions: MI (Upper) , WI, IL (Northern) , IA, MN, KS, NE, SD, ND, Manitoba, Kansas City, and St. Joseph metro areas of MO. 1540 Humboldt Ave., Ste. 102 West St. Paul, MN 55118 (651) 455-1241 • Email • Website Company Headquarters 101 Industrial Drive PO Box 123 Horicon, WI 53032-1803 Phone Number (920) 485-4463 Design Resources > The Marlin Approach > Products > Request a Quote > About > Careers > Blog > Contact > Policies Terms and Conditions © 2025 Marlin Technologies Inc. All rights reserved. Markets Products The Marlin Approach About Blog Design Resources Careers Contact us Request a Quote"
    },
    {
      "url": "https://bigmarlin.group/contact/",
      "text": "Contact Us | Big Marlin Group | Gilbert, Arizona Big Marlin Group Solutions Strategy & Brand Creative Insight & Tracking Web Services Content Creation & Management Advertising Media Services Email Marketing Marketing Strategy Paid Social Pay-Per-Click (PPC) Search Engine Optimization (SEO) Who We Serve About Case Studies Meet the Team Careers Our Work Learn Website Evaluation Contact Us Website Evaluation Contact Us Contact Us We love collaborating with extraordinary brands and the people behind them. Give us a call at (480) 381-1154 ! Get in touch with the marketing experts of Big Marlin Group and let’s start something great together! We can’t wait to start working with you! Contact Us 425 W. Guadalupe Rd., Suite 101 Gilbert, AZ 85233 (480) 381-1154 Come See Us We’re ready to dive in when you are. Fill out the form below and we will be in touch. Δ First Name * Last Name * Email Address * Phone Number Company Name * What's on your mind? * Captcha Company This field is for validation purposes and should be left unchanged. Marketing Experience Solve your business & marketing challenges. 0 + Years of Combined Experience Our team’s footprint and work experience stretch across the United States touching 38 states Making Waves We pride ourselves on transparency. 0 + Clients Being Serviced We apply brilliant and proven marketing strategies to help you achieve measurable results for your business. Creative Influence Working hard to create success. 0 's of Creative Pieces a Year We believe in strong branding, impactful call to actions, and storytelling when it comes to design. Join The Team Think BIG Our Work Transforming User Experience Back To Top Contact Us Careers About Case Studies Blog Meet the Team Careers Industries Home Services Nonprofit YMCA Franchise Marketing Channels Paid Digital Advertising Social Media Marketing Website Email Marketing Print Ads, Collateral, & Direct Mail Guerrilla Marketing Community Involvement Loyalty & Referral Programs Services PPC (Pay Per Click) Paid Search Advertising Display Advertising Paid Social Advertising SEO Technical SEO Local SEO UX/UI Reporting & Analytics Strategy Branding Messaging CRO (Conversion Rate Optimization) Video Organic Social Media Email Marketing info@bigmarlingroup.com 425 W. Guadalupe Rd., Suite 101, Gilbert, AZ 85233 (480) 381-1154 ©2025 Big Marlin Group • All rights reserved • Privacy Policy Site Map • Privacy Policy © 2024 Big Marlin Group • All rights reserved Big Marlin Group Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.greenshoe.org/contact",
      "text": "Contact  — Green Shoe Foundation 0 Skip to Content Welcome Retreat Retreat Focus Register Blog Our Team Connect Contact Gallery Community Resources Library FAQs Careers Donate Client Portal Open Menu Close Menu Welcome Retreat Retreat Focus Register Blog Our Team Connect Contact Gallery Community Resources Library FAQs Careers Donate Client Portal Open Menu Close Menu Welcome Folder: Retreat Back Retreat Focus Register Blog Our Team Folder: Connect Back Contact Gallery Community Resources Library FAQs Careers Donate Client Portal Sometimes, reaching out can be the beginning of a beautiful healing journey. We believe seeking help when feeling stressed, overwhelmed, or lost in life is a sign of inner strength.  We welcome you to reach out and contact us if you have any general questions about our 5-day outpatient retreat, the Green Shoe Foundation, or if you just need to start the conversation about mental health - We're here for guidance, inspiration, and resources to encourage you to start overcoming challenges in your life. ​ By Phone Our team is in office Monday - Friday from 8am to 5pm. When you call one of our therapists or support team will be happy to answer any questions you have about our retreats. Call Us General Info Form Still feel like you need more information? We get it. This is a lot to process. Easily submit your questions with our online form on our ‘Welcome’ page. Due to an overwhelming response to our retreats, our clinical and support team will be connecting with you within the next business week. General Info Form Email We understand when venturing into a new season of healing you may have questions that you may feel more comfortable discussing via email.  Due to an overwhelming response to our retreats, our clinical and support team will be connecting with you within the next business week. Email Us The Green Shoe Foundation 9601 South Portland Avenue Guthrie, Oklahoma 73044 405.697.2109 About Careers Privacy Policy Retreat Green Shoe Retreat Register FAQs"
    },
    {
      "url": "https://themarlinalliance.com/about-us/",
      "text": "About Us - Marlin About Us Digital Transformation Services Careers Industries Served About Us Digital Transformation Services Careers Industries Served Contact Who We Are Business and Digital Transformation Solution Providers The Marlin Alliance, Inc. The Marlin Alliance, Inc. is a Business and Digital Transformation company that has a proven track record of success for providing innovative technical solutions and outstanding professional support to its clients. Our blend of highly experienced, passionate, and diverse employees swiftly devise robust solutions to a varied array of business challenges. We foster collaboration within our teams as well as between our teams and our clients. Affectionately nicknamed “Marlin” by those who know us, we are proud to base our exceptional reputation on our ability to execute quickly and deliver quality, successful solutions. From its inception in 2002, Marlin has embodied the tag line, “Creating Desired Business Results Together”, and stood by its original and enduring goal of sustaining constructive alliances with its clients and business partners. The “ALL IN” motto that we share with our employees reinforces that when Marlin is part of a team as a trusted business partner, Marlin is ALL IN to ensure that our clients and partners achieve their missions. The foundation of Marlin’s success stems from employee dedication always demonstrating that “together, as your business partner, we are all in !” Core Competencies Process Improvement & Automation Strategic Planning and Execution Data & Analytics Software & Technology Solutions Cybersecurity Program Management & Administrative Services Learn More Mission The Marlin Alliance provides a diverse portfolio of integrated services to help our clients overcome challenges on their journey to effective digitization, automation, and utilization of data and processes. Simply stated, our mission is to ensure that our clients compete and win in tomorrow’s digital world. Learn More Core Values Marlin’s core values provide the foundation for a culture of excellence that is embodied in our everyday work and passions. Client Focus: We forge strategic relationships with our clients, embracing an agile, solution-oriented mindset to create and deliver desired business results together. Innovation: We are solution providers combining best practices with cutting edge, creative, and cross-disciplinary solutions. Performance Excellence: We foster dedicated, highly skilled, teamwork-driven employees that are capable, flexible, and motivated. Alliance Driven: We build solution-oriented partnerships to provide the best teams to support best results for customers. Employee Pride: We provide a family culture with our extraordinary employees while maintaining professionalism and unparalleled performance. Learn More Contract Vehicles The Marlin Alliance holds prime contracts and subcontracts spanning U.S. Military Services. As a Woman Owned Small Business, additional contract options are available for customers to access our services. We have established partnerships with other large and small businesses with complementary capabilities to offer our clients a highly experienced team across the spectrum of technical solutions. Our Contracts: SeaPort-NxG, N00178-19-D-8075 SeaPort-Enhanced, N00178-14-D-7824 Information Technology Enterprise Services -3 Services (ITES-3S) Women-Owned Small Business (WOSB) Program Sole Source Awards Our Prime Task Orders NAVWAR Corporate Operations Support, N00039-18-F-3000 NAVWAR Database Applications Hardware and Software Engineering Support, N00178-14-D-7824 NS01 NAVWAR Corporate Operations Support, N00178-05-D-4621 NS02 NAVWAR Office of the Engineer, Capability Maturity Model Integration – Maturity Level 3 Support, N00178-05-D-4621 NS01 NAVWAR Fleet Readiness Directorate (FRD) Cyber Baseline and Readiness Dashboard Support, N00039-20-C-0006 NAVWAR Corporate Operations Support, N00039-17-C-0016 NRSW, Human resource Management Skills Training Support, SWRMWR-16-C-0019 For information about our contracts or how to obtain our services, please contact the Marlin Business Development team at contactus@themarlinalliance.com or 619-450-1717. Partners Success Stories Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus, luctus nec ullamcorper mattis, pulvinar dapibus leo. Joe Bag o' Donuts Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus, luctus nec ullamcorper mattis, pulvinar dapibus leo. Joe Bag o' Donuts Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus, luctus nec ullamcorper mattis, pulvinar dapibus leo. Joe Bag o' Donuts Contracts SeaPort-e Contract Vehicle The Marlin Alliance, Inc. is proud to have been awarded a SeaPort Enhanced (SeaPort-e)\nMultiple Award Contract (MAC). Learn More About SeaPort-e The Marlin Alliance, Inc. provides business process reengineering, process optimization,\nchange management, performance Learn More Task Orders The Marlin Alliance, Inc. has been awarded the following SeaPort-e Task Orders. (Click on the task order number to view the current conformed copy): Learn More Quality The Marlin Alliance is committed to ensuring the integrity and highest quality of our services\nand products. The purposes of our proven Learn More Contact Us We would love to hear about your project. Let’s talk. Name Email Company Name Your Role/Title Message Submit Contact The Marlin Alliance, Inc. Address 3131 Camino Del Rio N Suite 810 San Diego, CA 92108 Email Us contactus@themarlinalliance.com Business Hours Monday – Friday 8:00am – 5:00pm Call Us (619) 450-1717 Quick Links About Us Digital Transformation Services Careers Industries Served About Us Digital Transformation Services Careers Industries Served"
    },
    {
      "url": "https://bluemarpartners.com/our-team/",
      "text": "Our Team - Blue Marlin Partners Skip to content Home Strategy About Us Portfolio Media Contact Home Strategy About Us Portfolio Media Contact Partner Portal Home Strategy About Us Portfolio Media Contact Home Strategy About Us Portfolio Media Contact OUR TEAM We Build Businesses Our Team Peter Kirsch Becca Shane Duncan Bowden Chris Swarbrick Sidney Wanko Christian Delzell Peter Thompson Kyle Kirsch Derek Zajac Omar Ibrahim Keeley Glasper Dan Moore Jeff Frient Joe Barbour Ron Mayers Trent Humphries Return To About Us Contact Us Today If you believe your company is a good fit for Blue Marlin’s investment model, please be in touch. Contact Us Location 7920 Norfolk Avenue Suite 200 Bethesda, MD 20814 Info@bluemarpartners.com Linkedin-in Icon-email Partner Portal Location 7920 Norfolk Avenue Suite 200 Bethesda, MD 20814 Info@bluemarpartners.com Linkedin-in Icon-email Blue Marlin Partners, Copyright © 2024. All rights reserved. Designed by: Big Red Jelly Privacy Policy || Terms of Use We are using cookies to give you the best experience on our website. Accept Reject Peter Kirsch Founder & Chief Executive Officer Linkedin Prior to founding Blue Marlin Partners, Peter oversaw and directed investments for the family office of the founder of America Online for ten years, where he was responsible for all financial management and direct investments. In this position he also served as the liaison and trusted advisor for other family offices and high net worth individuals seeking to co-invest. Peter also served as Investment Committee Chairman, Longstreet Partners, Advisor, The Edgewater Funds and numerous boards of directors. Subsequently, Peter was CEO of Platformix and, CEO the American Society of Landscape Architects. Peter received his B.S. in Communications from Marquette University. Becca Shane Chief Financial Officer Linkedin Becca is a licensed CPA and also a CGMA (Chartered Global Management Accountant). Previously, she held the position of Controller for Capitol Hill Group, a private investment firm focusing on real estate, technology, healthcare, biotech, art, entertainment and asset management. There, she led the preparation of accounting records for several portfolio companies including: developing annual budgets and tracking performance, overseeing the monthly close, projecting and managing cash flows, tax compliance and developing ad hoc reporting as necessary. Her previous experiences include, Fund Accounting Manager at The Carlyle Group and Fund Controller at Perseus LLC. She holds a BSBA in Accounting and Finance from the University of Pittsburgh. She is a graduate of the AICPA Leadership Academy and volunteers on the AICPA International Qualifications Appraisal Board and the GWSCPA Women’s Leadership Committee. Duncan Bowden Principal Linkedin Prior to joining Blue Marlin Partners, Duncan was an Investment Associate at Liberty Hall Capital Partners, a lower middle market buyout firm in South Carolina. Duncan was involved in all aspects of the investment process and spent time on various strategic initiatives across the firm’s portfolio companies. Prior to joining Liberty Hall, Duncan worked in the Leveraged Finance group at Bank of America Merrill Lynch. Duncan received his B.S. in Finance from Wake Forest University. Chris Swarbrick Principal Linkedin Prior to Blue Marlin, Chris was an Investment Associate at Blackstreet Capital, a lower middle market distressed buyout firm in Maryland. Chris led investment processes from diligence to close and was heavily involved in post-merger integrations, valuations, investor relations, and other portfolio responsibilities. Prior to Blackstreet, Chris was a Corporate Finance and Restructuring Consultant in Chicago. Chris received his B.B.A. in Finance from the University of Notre Dame and his M.B.A. with Honors from the University of Chicago Booth School of Business with concentrations in Finance, Accounting, Entrepreneurship, and Strategic Management. At Booth, Chris was a Co-Chair of the Private Equity Group and the 2022 recipient of the Madison Dearborn Partners Private Equity Award and the Dean’s Prize for Building the Booth Brand. Chris is a member of the Beta Gamma Sigma honors society. Sidney Wanko Executive Assistant Linkedin A recent graduate from the University of Virginia, Sidney holds a B.A. in Statistics with a concentration in biostatistics. Before joining Blue Marlin, she gained valuable experience as an events coordinator and research assistant at UVA’s Contemplative Sciences Center. In addition, Sidney was an engaged member of various student-run organizations and agencies. In 2022, she applied her analytical skills and human-centered approach to make meaningful contributions to the research and development of a growing startup company. Christian Delzell Principal Linkedin Prior to joining Blue Marlin Partners, Christian spent 19 years in the financial services industry working for and with RIAs doing manager due diligence, asset class allocation, and performance analysis for high net worth individuals/families and institutional investors. Most recently, Christian spent 4 years managing a team of analysts at a global bank performing financial reporting on general partners for institutional private equity investors spanning all sectors and geographies. He received his B.S. in Economics with Finance Applications and M.B.A from Southern Methodist University. Peter Thompson Managing Director Linkedin Prior to Blue Marlin, Peter was Chairman of Lazard Frères & Co. Midwest Advisory, where he advised public and private companies and financial sponsors on a range of strategic issues. As one of the world’s preeminent financial advisory firms, Lazard operates from 43 cities across 27 countries in North America, Europe, Asia, Australia, Central and South America. Peter continues to serve as a Senior Advisor at strategic consulting firm, Teneo. From 2009-2015 Peter served as Chairman & Chief Executive Officer of Perkins Investment Management, a $22 billion manager of public equities renowned for its defensive approach to investing. In 2013, Perkins became a wholly-owned subsidiary of Janus Capital Group, now Janus Henderson Investors (NYSE: JHG). From 1994-2007, Peter was Executive Vice President and member of the Board of Directors of Chicago-based Ariel Investments. Peter earned an MBA from The University of Chicago’s Booth School of Business and a BA from Providence College. Kyle Kirsch Vice President Linkedin Prior to joining Blue Marlin, Kyle spent eight years with a tech-based, data, and analytics start up in the CPG & Retail space, most recently serving as their Director of Data Solutions. As one of the first employees he had the opportunity to help build a business at all operational and business development levels and was a key contributor to their exit in early 2022. Derek Zajac Vice President Linkedin Prior to joining Blue Marlin Partners, Derek was an Associate at Orkila Capital, a growth equity firm in New York City. At Orkila, Derek executed multiple platform and add-on acquisitions within the Consumer, Entertainment, and TMT industries. He also collaborated directly with portfolio company executives to optimize financial and KPI reporting, explore new business opportunities, enhance operational excellence, and develop long-term strategic plans. Previously, Derek was a Senior Analyst at Raymond James & Associates within their Consumer & Retail Group in Chicago, where he advised on numerous M&A and capital raise transactions. Derek began his career at Aon Securities, the investment banking division of Aon plc. Derek received his B.A. in Economics from Northwestern University and his M.B.A. from Northwestern University’s Kellogg School of Management. Omar Ibrahim Associate Linkedin Prior to joining Blue Marlin, Omar was an Investment Banking Analyst at Deloitte Corporate Finance specializing in sell-side M&A. He was responsible for conducting extensive financial analysis, market research, and due diligence to provide valuable insights and recommendations to family-founder businesses seeking to execute strategic mergers and acquisitions within the industrials sector. Omar received his B.S. in Finance from Boston University. Keeley Glasper Operations Linkedin Keeley received her B.S. in Communications from Cal Poly Pomona with a concentration in Public Relations and a minor in Hospitality Management. Keeley started her career as a Wedding Coordinator and later became a Private Event Manager at Clyde’s Willow Creek Farm, specializing in social and corporate events of all sizes. There, she successfully managed teams of vendors and staff, ensuring flawless event execution. Her skills in communication, organization, attention to detail, and her ability to handle complex projects with a client-centric approach translate well into the fast-paced environment of private equity. Dan Moore Senior Advisor Linkedin Dan has been a longtime advisor to Blue Marlin Partners and has over 35 years’ experience in managing companies, arranging financing transactions and negotiating business arrangements. Longstreet Partners, founded by Dan in 2001, was a private equity and investment banking firm focused on small to mid-sized enterprises. Over 15 years, Longstreet invested in or worked with over 30 different companies in many capacities. Dan has served as chairman and CEO of two publicly traded companies. Dan, a certified public accountant, began his career at Arthur Andersen & Co. in Washington D.C. in 1976 after receiving his Master’s in Business Administration from the University of Pittsburgh. Dan received his Bachelor’s degree from Lafayette College. Dan serves on the Board of Leadership Mission International, an educational organization for young women in Honduras. Jeff Frient Senior Advisor Linkedin Jeff has a long history in middle market investing, having been a private equity investor with the Edgewater Funds and an investment banker with William Blair & Company, for nearly 25 years. He has worked actively with family offices, high net worth investors, institutions, endowments and funds, as well as co-investors. Jeff has served on 15 company Boards of Directors, and has been Chairman of 4. Prior to graduate school, Jeff served worldwide in the U.S. Air Force as an F-16 pilot. Jeff received his B.S. in Computer Science from the United States Air Force Academy, graduating as a Distinguished Graduate, and his M.B.A. from Harvard Business School. He currently serves on the Board of the Air Force Academy Foundation. Joe Barbour Linkedin Prior to joining Blue Marlin, Joe was an investment banker (Managing Director) with the Bank of Montreal (BMO) and ABN AMRO. While at BMO he provided strategic advice to corporate clients and private equity firms in the food and agribusiness sectors on acquisitions, divestitures and raising debt and equity capital in both the public and private markets. At ABN AMRO, Joe led ~ $1.5 billion in M&A transactions for middle market clients and private equity firms in the business services, consumer products, energy and a variety of manufacturing sectors. Joe received his B.S. in Economics with Financial Applications and M.B.A. from Southern Methodist University. Ron Mayers Linkedin Initially a securities lawyer in New York City, Ron segued to the world of finance in Montreal where he gained recognition as an authority in alternative investments and founded one of Canada’s first hedge funds.  As President of National Bank Financials’ international subsidiary and later as Vice Chairman of Desjardins Securities Inc., North America’s largest financial cooperative, Ron developed their US investment banking activities while developing robust alternative investment platforms. Coalescing this experience, Ron entered the family office world in 2015. In 2023, Ron founded Sigma2 a cohort of wealth creators characterized by their hands-on, collaborative approach to the allocation process. Ron holds a Juris Doctor with Honors from SMU’s Dedman School of Law and a Bachelors of Economic History from Vanderbilt University. Trent Humphries Linkedin Trent spent twenty-six years as a Manufacturer’s Representative in the semiconductor business representing Hughes Aircraft’s Semiconductor Equipment Group and other multi-national companies in the Southwest territory.  After building Benchmark Sales for over 20 of those years, he sold the company to the employees and carried his expertise into the Business Development Consulting and in 2009 entered the Private Equity world with Catapult Partners.  Trent is also a Blue Marlin GP. Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Enable All Save Settings"
    },
    {
      "url": "https://marlinmfg.com/staging/old-site/contactus.html",
      "text": "ï»¿ Marlin Manufacturing - Contact Us Home Company Profile News Products Metrology Quality Overview Contact Us Papers & Links Request a Quote Temperature Instrumentation for Research and Industry Contact Us Please select your region below for sales representative information: Northern Ohio Pennsylvania Washington, Oregon, Idaho Main Office Cleveland, OH John Schenk Ph. 216-676-1375 Fax 216-676-1344 johns@marlinmfg.com Lon Bess Ph. 412-861-3059 ACCU-TEC SALES COMPANY 30107 77th Ave, South Roy, WA 98580-0160 Phil Dennis Ph. 253-843-9143 Ph. 253-843-2976 accutecsales@comcast.net New Jersey, Maryland, Eastern Pennsylvania, Delaware Michigan, Florida, Alabama Wisconsin, Illinois, Northern Indiana Lon Bess Ph. 412-861-3059 JESS INSTRUMENT COMPANY 10186 Newfound Gap Brighton, MI 48114 Ron Jess Ph. 517-404-1333 Fax 810-220-0400 ronjess@hotmail.com Main Office Cleveland, OH John Schenk Ph. 216-676-1375 Fax 216-676-1344 johns@marlinmfg.com New York Arizona, New Mexico Colorado, Utah Main Office Cleveland, OH John Schenk Ph. 216-676-1375 Fax 216-676-1344 johns@marlinmfg.com TECHNICAL EQUIPMENT SALES 13442 N. Mountainside Dr., Unit B Fountain Hills, AZ 85268 Jim Nye Ph. 480-816-1514 Cell 480-745-5268 jnye@techequipsales.com TECHNICAL EQUIPMENT SALES 2004 Trail Ridge Severance, CO 80546 Mike Crowe Ph. 970-674-1799 Fax 970-674-1801 Cell 303-809-5556 mcrowe@techequipsales.com Georgia, North Carolina, South Carolina Connecticut, Massachusetts, Maine, New Hampshire, Rhode Island Southern Ohio, Southern Indiana, Kentucky TRASK INSTRUMENTATION 414 West Pointsett St Greer, SC 29650 Mike Trask Ph. 864-848-3993 Fax 864-848-9569 Cell 864-270-3426 mike@traskinst.com W GRAHAM ASSOCIATES 3 Iron Works Rd Concord, NH 03301 Bill Graham Ph. 603-225-2763 nhsp439@gmail.com Main Office Cleveland, OH John Schenk Ph. 216-676-1375 Fax 216-676-1344 johns@marlinmfg.com Marlin Manufacturing Corporation | 12800 Corporate Drive | Cleveland, OH 44130 Phone: 1-216-676-1340 or 1-800-321-6648 | Fax: 1-216-676-1344 Email: sales@marlinmfg.com"
    },
    {
      "url": "https://www.potomacmarlins.com/page/team-information/coaching-staff",
      "text": "Potomac Marlins - COACHING STAFF Sign in Facebook Twitter Instagram Home 25-26 Team Registration Registration Help 25-26 Audrey Moore Registration 25-26 Chinquapin Registration 25-26 Colgan High School Registration 25-26 Cub Run Registration 25-26 Franconia Registration 25-26 George Washington Registration 25-26 Manassas Park Registration 25-26 Mt. Vernon Registration 25-26 South Run Homeschool Registration - FALL Session TEAM INFO 25-26 Brochure SUMMER 2025 PRACTICE SCHEDULE 2025-2026 PRACTICE SCHEDULE 2025-2026 TEAM FEES PAYMENT POLICIES REGISTRATION  INFO PLACEMENT EVALUATIONS COACHING STAFF Team Outfitting Annual Awards Practice Records 2024-2025 BROCHURE MISSION/VISION TESTIMONIALS MARLINS AROUND THE WORLD LINKS SAFE SPORT 2025 SUMMER Registrations RECORDS & REPORTS SHORT COURSE RECORDS LONG COURSE RECORDS 2024-25 SC SWIMMERS IN THE PVS TOP 16 2024 LONG COURSE TOP TIMES REPORT 2024 LC SWIMMERS IN THE TOP 16 IN PVS 2024 2024-25 IMX REPORT SCORES 2024-25 VCC REPORT 2024-2025 TOP TIMES MASTERS TEAM 2025 - 26  MASTERS PRACTICE SCHEDULE 2025 Masters - FALL registration FEES CODE OF CONDUCT MASTERS LINKS CONTACT MASTERS CONTACT US POTOMAC MARLINS 2024-25 COACHING STAFF AUDREY MOORE Rec. Center Bill Marlin [email protected] Senior Gold, Senior Silver, Sen-Prep Gold a.m. coach Zach Smith [email protected] Sen-Prep Gold, Sen Silver, AGAD p.m. coach Angeline Palmer [email protected] AGSD coach Samantha Batko [email protected] Mighty Marlins/ AGSD coach CHINQUAPIN Rec. Center Barry Marlin [email protected] Senior Gold, Senior Silver, Sen Prep Gold, T & TH AGAD, Masters a.m. coach Alicia St. Jean [email protected] M - W  AGAD, AGSD coach Emma Powless [email protected] T - TH  AGAD, AGSD coach Harrison Sniady [email protected] SC60, AGSD coach Abby Jones [email protected] Mighty Marlins coach COLGAN HIGH SCHOOL Christine Haslem [email protected] Senior Gold, Senior Silver, Sen Prep Gold & AGAD a.m. coach CUB RUN Rec. Center Reid Owen [email protected] AGAD, AGSD, SC60 p.m. & AGAD a.m. coach Rick Stakel [email protected] Senior Prep Gold p.m. coach Dan Earle [email protected] Senior Silver a.m. coach James Zenyuh [email protected] AGSD coach Will Steinhilber [email protected] AGSD, Mighty Marlins coach Max Morris [email protected] AGSD, AGAD, SC60 coach Katie Sanfield [email protected] AGSD coach GEORGE WASHINGTON Rec. Center Emily Cabral [email protected] Senior Gold, Senior Silver, AGAD, Masters a.m. coach AGSD, AGAD p.m. coach Anna Althouse [email protected] Mighty Marlins coach FRANCONIA Rec. Center Barry Marlin [email protected] Senior Gold, Sen Prep Gold, Senior Silver, AGAD a.m. coach Ryan Krogel [email protected] Sen Prep Gold, Senior Silver, AGAD a.m. coach AGAD, AGSD, SC60, SC90 p.m. coach MANASSAS PARK COMM. Christine Haslem [email protected] Senior Gold, Senior Silver, Sen Prep Gold p.m. coach Will Steinhilber [email protected] AGAD & AGSD p.m. coach Mighty Marlins p.m. coach ©2025 SportsEngine, Inc. Powered by SportsEngine and owned by Potomac Marlins NBCUniversal Privacy Policy / CA Notice / SportsEngine Terms & Conditions"
    }
  ]
}