{
  "fuentes": [
    {
      "url": "https://clonesfrc.com/staff-members/",
      "email": "coordinator@clonesfrc.ie"
    },
    {
      "url": "https://gnarlybeer.com/faq",
      "email": "info@gnarlybeer.com"
    },
    {
      "url": "https://gnarlybeer.com/contact",
      "email": "info@gnarlybeer.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "email": "contact@guttercleaningsouthlondon.co.uk"
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "email": "quote@guttercleaningsouthlondon.co.uk"
    },
    {
      "url": "https://cmbtc.com/about/contact-us/",
      "email": "cmbtc@cmbtc.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://usabeerratings.com/en/blog/insights-1/crafting-excellence-the-gnarly-barley-brewery-story-193.htm",
      "email": "info@usabeerratings.com"
    },
    {
      "url": "https://gnarlybeer.com/contact.html",
      "email": "info@gnarlybeer.com"
    }
  ],
  "mails": [
    "cmbtc@cmbtc.com",
    "contact@guttercleaningsouthlondon.co.uk",
    "coordinator@clonesfrc.ie",
    "info@gnarlybeer.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "info@usabeerratings.com",
    "quote@guttercleaningsouthlondon.co.uk"
  ],
  "nombre_sitio": "thegnarlybarley.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://clonesfrc.com/staff-members/",
      "text": "Staff Members – Clones Family Resource Centre Skip to content Clones Family Resource Centre Clones Family Resource Centre aims to empower the people of Clones to have an improved quality of life and sense of wellbeing through encouraging equality, participation , community ownership and a recognition of the diversity of families. Menu Home About Contact us … News Community Newsletter Events IFI Decade of Commemoration Talks and tours The Open Mic Upskilling Women Supports Family Supports Family Mediation Services Services Summer Camp Counselling Charity Shop Groups Clones Parenting Group Men’s Shed The Circle of Friends Group Parent and Toddler Group Hen’s Shed Knitting Group Links Staff Members Project Coordinator / Manager Angela Graham is responsible for managing the day to day running of Clones Family Resource Centre and reporting on a regular basis to the voluntary Board of Management.  Her role includes family support, supervision and support of other FRC staff, managing the staff team in the charity shop Second Time ‘Round, attending networking meetings and making grant applications. Development Worker Colm Laighneach is employed by Clones FRC as a Development Worker on a part-time basis and is mainly engaged in supporting families and individuals in the local community with welfare rights, advocacy etc.  Other key areas of Colm’s work is supporting Clones Men’s Shed and local resident’s groups.  Colm is trained in providing parenting supports and works in partnership with other local agencies to deliver programmes in and around Clones. Networking Officer Dara MacGabann is employed by Clones FRC as a Networking Officer under the International Fund for Ireland’s Peace of Mind project.  Dara’s main focus in on providing a programme of activities and training for the core groups associated with Clones FRC such as Clones Toddler Group, Clones Parenting Group, Clones Men’s Shed, Second Time ‘Round Charity Shop and the Circle of Friends Women’s Group.  Dara works on a cross border basis linking with the Oak Healthy Living Centre, Lisnaskea, Co. Fermanagh. Administrator Annmarie Fryers is employed by Clones FRC as Administrator.  She ensures that all financial matters relating to  the FRC are carried out to a high standard and in an efficient and timely manner.  Annmarie currently divides her time between the core administrative work of the FRC and the financial requirements of new IFI funded project, Peace of Mind. Like Loading... Search Search for: More About Voluntary Board of Management Contact Information Clones Family Resource Centre, Clones, Co. Monaghan H23 AE75 Telephone: +353 47 52919 Mobile: +353 86 1785710 Email: coordinator@clonesfrc.ie Create a website or blog at WordPress.com Subscribe Subscribed Clones Family Resource Centre Sign me up Already have a WordPress.com account? Log in now. Clones Family Resource Centre Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://gnarlybeer.com/faq",
      "text": "Frequently Asked Questions | Gnarly Barley Brewing Co. When Were You Born? Welcome to Gnarly Barley. Are you 21 Years or older? Please, verify your age to enter. Enter No items found. About Us Who We Are Awards FAQ Careers Our Brews Beers What's On Tap Beer Calendar Enjoy Here Best Practices Events Calendar Rent Space Taproom Dine Gnar Shop Contact Informative Frequently Asked Questions Find answers to common questions about Gnarly Barley and our craft beers. If you can't find the information you're looking for, feel free to reach out to our team. Filter Questions General Beer Clear Filters Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. What are your tasting room hours? General Please check out our visit page for current tasting room hours. You can also check for updates or closings on our social media ( Facebook , Twitter (X) , Instagram ) What are your gift shop hours? General Our gift shop hours are the same as our taproom hours and available on our visit page . Our giftshop is open daily for merchandise and purchases of beers to-go. Feel free to stop by the bar and an available staff member will assist you with your purchase. Do you offer brewery tours? General Group tours are available FREE to the public every Saturday at 1PM and 2PM. No reservations necessary. We suggest you check our social media and event calendar for tour updates or cancellations. Can I schedule a private tour? General If you would like to book a tour Tuesday-Friday, please email your request to info@gnarlybeer.com . Is there parking available? General Yes. Our parking lot is located directly across the street from the brewery. Do you ship your merchandise outside of the United States? General At this time we are unable to ship outside of the United States. For more information about our beer see Where can I find your beer? and How can I get your beer in my area? â Do you offer gift cards? General We offer gift cards for purchase at our tasting room gift shop . â Can I return or exchange my purchase? General You can find more information on our merchandise return policy here. For more help with returns please feel free to contact us at info@gnarlybeer.com or give us a call at 985-318-0723 . Are dogs allowed at the brewery? General We do allow dogs! For everyoneâs safety, please only bring sociable dogs with up to date vaccinations. Dogs must be on leash at all times. We have water available for the dogs and a grassy spot in the back for them to do their business. Please be considerate and pick up after your dog. The brewery is not a good environment for dogs that are stressed from loud noises, crowded spaces, overheat easily or are wary of children, strangers or other dogs. â Does the brewery allow children? General Yes, we are kid friendly. Children must be supervised by an adult at all times at the brewery. Some special events do have age limits. â Is food available at the brewery? General Our restaurant, Dine Gnar , is open to the public Thursday-Sunday. Check out the full menu here. Do you have vegetarian or vegan food options on site? General Please see the DineGnar menu for current food options. You may contact the DineGnar at (985) 969-4925. â Are you hiring? General Visit our Careers page on our website for available positions. You can also email us your resume at info@gnarlybeer.com. Can I rent out the brewery for a private event? General Please email info@gnarlybeer.com or give us a call at 985-318-0723 for inquiries and information on private events at the brewery. â Do you host live entertainment? General We often have events with live entertainment. Please check our event calendar and Facebook events page for updates. â How can I request a donation for my charitable cause? General Please check out our online donation form to review our requirements for a donation request. â Can I order your beer and have it shipped to me? Beer Sorry, we are unable to ship beer due to state and federal laws. Please visit us in Louisiana, there is always something fun to do! â Where can I find your beer? Beer Our beer is distributed in Louisiana. Check out our Enjoy Here page for a list of areas our beer is distributed in. You can also see where others are drinking our beer by visiting untappd.com or beermenus.com. â How can I get your beer in my area? Beer Our beer is distributed in Louisiana. We are taking the growth of our brewery slowly, and remain focused on quality, but strive to get our beers into the hands of our fans. We suggest reaching out to local bars, restaurants, package stores, bottle shops, grocery stores and gas stations to inquire about our beerâs availability. We thank you, we love you! â Do you sell or rent kegs? Beer Visit our taproom to purchase kegs. To rent kegs, please send your request to info@gnarlybeer.com . â Why do you no longer list IBUs for your beers? Beer Our innovative process of hop additions contributes many flavors and aromas that are not measured with a traditional IBU (international bitterness units) scale. Initially, the IBU scale was an indicator of perceived bitterness in beer. It was thought that dry hopping did not affect the measurement, but it wasnât until recently that some breweries started using hops in a non-traditional method & quantity. We feel that an IBU measurement can be misleading because it does not describe the beer as a whole, possibly leading consumers to draw the wrong conclusion. â I found some sediment in my beer, is it still safe to drink? Beer It is not uncommon to find sediment in Gnarly Barley beers because we do not filter, nor do we pasteurize our brews. Historically, most all traditional beer included natural sediment. The sediment is natural ingredients and collects due to time and gravity. Yeast and protein particles fall out of suspension and create a layer on the bottom of the container. The older the beer, the more sediment it will have. Pouring beer into a glass agitates the sediment and can begin to break free from the bottom. Yeast is full of B vitamins, so it will not harm you. In addition, our hop forward beers such as Jucifer, Radical Rye, and Brightside IPA also contain hop particles due to the dry-hopping process in which we add many pounds of dried hops directly into the beer. For our IPAâs this is the last step before packaging, therefore, it is common to have a mixture of yeast sediment, proteins and hop particles collect at the bottom of the container. It is best to slowly pour a beer into a glass which is held at an 45-degree angle and avoid inverting the can completely. This process is also common with German Hefeweizens and bottle conditioned Belgian ales. In summary, sediment is a collection of all the extra goodness that we put in to richen the flavor. As always, it is best to store beer cold and drink fresh. â What is the shelf life of your beer, and how can I find the date it was packaged on? Beer Gnarly Barley Brewing lists a date code on all of our products, kegs, cans, and bottles. The date which is listed in MM/DD/YY format is the day that that brew was packaged (aka âpackaged onâ date) With proper cold storage, including transport, the shelf-life for our products are as listed below: Jucifer IPA: shelf-life 90 days from packaged on date Radical Rye P.A.: shelf-life 90 days from packaged on date Brightside IPA: shelf-life 90 days from packaged on date Gnarvana Double IPA: shelf-life 90 days from packaged on date Catahoula Common: shelf-life 120 days from packaged on date Korova Milk Porter: shelf-life 120 days from packaged on date Peanut Butter Korova: shelf-life 120 days from packaged on date Imperial Korova: shelf-life 365 days from packaged on date Porter Rican: shelf-life 90 days from packaged on date You can check out a list of current packaged beers by viewing our tasting room menu. â What are crowlers? Beer A 32oz Can that can be filled with almost any brew on tap and can be purchased to-go at our tasting room. We provide the can, fill it with beer, and then seal the can. Looks like a âtall-boyâ. â Can I bring in my growler or purchase a growler to be filled? Beer Yes, 64oz growlers can be filled with almost any brew on tap. You can bring in your own growler if you would like, but please make sure to properly clean and sanitize your growler. We also have glass growlers for sale at the Tasting Room Gift Shop. Check out our tasting room menu for current brews available. â How are beers brewed? Our beers are brewed using traditional methods and high-quality ingredients. We take pride in our craftsmanship and strive to create unique and flavorful brews. What beers do you offer? We offer a wide range of beers, including IPAs, stouts, lagers, and seasonal brews. Our beer selection is constantly evolving to provide our customers with new and exciting options. Do you have a taproom? Yes, we have a taproom in Hammond where you can enjoy our beers on draft. It's the perfect place to relax, socialize, and try out different brews. Where can I buy your beers? Our beers are available for purchase in several parishes and stores. You can also visit our taproom in Hammond to buy our beers directly from us. What is your distribution area? We distribute our beers to various locations within Louisiana. Please check our website or contact us for more information on specific areas. How are beers brewed? Our beers are brewed using traditional methods and high-quality ingredients. We take pride in our craftsmanship and strive to create unique and flavorful brews. What beers do you offer? We offer a wide range of beers, including IPAs, stouts, lagers, and seasonal brews. Our beer selection is constantly evolving to provide our customers with new and exciting options. Do you have a taproom? Yes, we have a taproom in Hammond where you can enjoy our beers on draft. It's the perfect place to relax, socialize, and try out different brews. Where can I buy your beers? Our beers are available for purchase in several parishes and stores. You can also visit our taproom in Hammond to buy our beers directly from us. What is your distribution area? We distribute our beers to various locations within Louisiana. Please check our website or contact us for more information on specific areas. Still have questions? Feel free to reach out to us. contact Keep Your Beer Fresh & Flavorful At Gnarly Barley Brewing Co., we believe in delivering the best possible beer experience. Our detailed Best Practices guide ensures you enjoy our brews at their peak freshness and flavor. Keep Cold, Drink Fresh Ideal Storage Temps: 33-40â (kegs), 33-50â (packaged) Shelf Life: IPA & Sour Ale: 90 days, Lager & Stout: 120 days Discover Our Best Practices Get The Drip Want First Dibs? Sign Up For Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong. Please try again. Come See Us 1709 Corbin Rd, Hammond, LA 70403 Taproom Hours: Mon-Tues: 2 PM - 9 PM WED-Sat: 11 AM - 10 PM Sun: 12 PM - 7 PM Links & Things AboutÂ Us Our Brews Events Dine Gnar Taproom Shop Contact FAQs Careers Press & Awards Donation Requests Media Kit Get in Touch info@gnarlybeer.com 985-318-0723 Privacy Policy Â© 2024 Gnarly Barley Brewing Company. All rights reserved. Website by Anntoine Marketing + Design"
    },
    {
      "url": "https://gnarlybeer.com/contact",
      "text": "Contact Us | Gnarly Barley Brewing Co. | Hammond, LA When Were You Born? Welcome to Gnarly Barley. Are you 21 Years or older? Please, verify your age to enter. Enter No items found. About Us Who We Are Awards FAQ Careers Our Brews Beers What's On Tap Beer Calendar Enjoy Here Best Practices Events Calendar Rent Space Taproom Dine Gnar Shop Contact Connect with Gnarly Barley For questions, bookings, or just to say hello, reach out to us. Find our beer, book an event, or request donationsâall from one place. See Contact Details Message Us See FAQs rENT Event Spaces Request Donations Find Us Here Visit us at our Taproom , give us a call, or drop us an email. Check out our hours below and use the map to find your way. Weâd love to hear from you! Address 1709 Corbin Rd, Hammond, LA 70403 get directions Taproom Hours Mon-Wed : 2 PM - 9 PM â Thu-Sat : 12 PM - 9 PM â Sun : 12 PM - 7 PM Contact info@gnarlybarley.com 985-318-0RAD (0723) Message Us Find Where to Enjoy Our Brews Looking to stock up on Gnarly Barley? Use our distributor locator to find a nearby supplier and get your favorite brews on tap or in stores. Start your search today! Find a Distributor Host Your Next Event at Gnarly Ready to plan your next gathering? Whether it's a private party in our taproom, a cozy get-together at Dine Gnar, or an outdoor celebration on our green space, we've got you covered. From table rentals to catering options, weâll help you create an unforgettable experience. See Rental Details Get In Touch Got questions, comments or want more information? Let us know below. Name Email Phone (optional) Message Thank you! We have received your submission. Oops! Something went wrong. Please try again. Request Donations We believe in giving back and being an active part of our community. If your organization is seeking a donation, please fill out the form to provide us with the necessary details for consideration. We'd love to help! Apply for a Donation Get The Drip Want First Dibs? Sign Up For Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong. Please try again. Come See Us 1709 Corbin Rd, Hammond, LA 70403 Taproom Hours: Mon-Tues: 2 PM - 9 PM WED-Sat: 11 AM - 10 PM Sun: 12 PM - 7 PM Links & Things AboutÂ Us Our Brews Events Dine Gnar Taproom Shop Contact FAQs Careers Press & Awards Donation Requests Media Kit Get in Touch info@gnarlybeer.com 985-318-0723 Privacy Policy Â© 2024 Gnarly Barley Brewing Company. All rights reserved. Website by Anntoine Marketing + Design"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Datenschutz name E-Mail Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "text": "Contact Skip to content Home Services About Blog Contact Get a Quote Get a Quote Main Menu Home Services About Blog Contact Get in touch Connect with Gutter Cleaners South London Contact Us Let’s Discuss Your Gutter Cleaning Needs Reach out to our team for professional gutter cleaning services. Phone 020 8150 7886 Email quote@guttercleaningsouthlondon.co.uk Address South London Follow Us Contact Form First Name Email Message Submit The form has been submitted successfully! There has been some error while submitting the form. Please verify all form fields again. Reliable Gutter Care Swift Solutions for Gutter Maintenance Choose us for quick, efficient gutter cleaning and maintenance services. 020 8150 7886 About Us Gutter Cleaners South London specialises in top-notch gutter cleaning services, preserving your property's integrity and appeal. Menu Home Services About Blog Contact Contact Info A: South London P: 020 8150 7886 E: contact@guttercleaningsouthlondon.co.uk Copyright © 2025 Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny Preferences Save preferences Preferences {title} {title} {title} Manage consent Scroll to Top"
    },
    {
      "url": "https://cmbtc.com/about/contact-us/",
      "text": "Contact Us | Canadian Malting Barley Technical Centre Become a Member About Growing High-Quality Barley Facility & Services Malt Academy Communications Members Area About Your Profile Log In Log Out Register Lost Password Reset Password Growing High-Quality Barley Facility & Services Malt Academy Communications Members Area Contact Us Mission Staff Membership Industry Technical Support Market Development Research Events New Crop Tour Contact Us Home About Contact Us Get in Touch: Connect with Us Today! Have a question, comment, or inquiry? We’re here to help! Reach out to us using the contact information below or simply fill out the form, and our team will get back to you promptly. Name * First Last Phone Email * Subject * Message * CAPTCHA Phone This field is for validation purposes and should be left unchanged. Visit Us: Canadian Malting Barley Technical Centre Canadian Grain Commission Building 1365-303 Main Street Winnipeg, Manitoba, Canada R3C 3G7 Contact Us: General Office Line: 204-984-4399 E-mail: cmbtc@cmbtc.com Canadian Malting Barley Technical Centre 1365 - 303 Main Street Winnipeg, MB R3C 3G7 T: 204 984.4399 F: 204 984.5843 E: cmbtc@cmbtc.com Privacy Policy © Canadian Malting Barley Technical Centre 2025 We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://usabeerratings.com/en/blog/insights-1/crafting-excellence-the-gnarly-barley-brewery-story-193.htm",
      "text": "Crafting Excellence: The Gnarly Barley Brewery Story USA Beer Ratings USA Spirits Ratings USA Wine Ratings USA Beer Ratings by BEVERAGE TRADE NETWORK Warehouse Closed July 10, 2025 Judging Date July 28, 2025 Winners Announced August 12, 2025 Beers Companies Beers The Ratings About UBR About BTN Judging Process Awards Participating Events Promote Sponsorships Media Partners FAQ Entry Info Why Enter Winning Impact How To Enter Key Deadlines and Pricing Shipping Instructions Terms and Conditions Judges Winners 2025 Winners 2024 Winners 2023 Winners 2022 Winners 2021 Winners 2020 Winners 2019 Winners 2018 Winners Promote Your Win Medal Artwork Press Template Order Stickers Blog My Account Your Email Your Password If you have not registered for USABR yet, please click here and register first. Need to recover your password? click here Share Share on Facebook Share on Twitter Share on Reddit Share on LinkedIn Share on Pinterest Send by Email Copy URL Category Navigation Beer Reviews Insights News Travel Podcasts Producer Profiles Videos Crafting Excellence: The Gnarly Barley Brewery Story 31/10/2023 From Garage Experiments to Louisiana\\'s Beloved Craft Beer Icon In the heart of Louisiana, where Southern hospitality and creativity blend, the Gnarly Barley Brewery emerged from humble beginnings in the home of Zac and Cari Caramonta. The journey commenced in a cramped garage, with two plump cats and a halfpipe, symbolizing their unique blend of passion for brewing and zest for life. Zac's fascination with the art of brewing sprouted from an encounter with exceptional craft beers. Inspired, he embarked on a mission to craft brews that would rival the very ones that had ignited his passion. The Korova Milk Porter and the Hoppopotamus IPA, two of Gnarly Barley's original homebrews, made their grand debut at the 2011 New Orleans on Tap Beer Festival, receiving accolades and sparking the dream of a craft brewery. Their vision took root in 2014 when a 14,000 square foot facility in Hammond, Louisiana, became the home of Gnarly Barley Brewery. Since then, their journey has been nothing short of remarkable. Image Source: Gnarly Barley Brewery Facebook Gnarly Barley proudly earned the 2017 Louisiana Lantern Award for manufacturing excellence and outstanding community service. Furthermore, they were celebrated by the Brewers Association, ranking among the top 50 fastest-growing craft breweries in both 2017 and 2018. Today, Gnarly Barley's reach extends across South Louisiana, gracing areas like the Northshore, Greater New Orleans, Baton Rouge, Lafayette, Houma, Lake Charles, and Alexandria. Their captivating story was further embellished when they were honored as the 2023 Louey Award winner for Louisiana Attraction of the Year, solidifying their status as a true Louisiana gem. Meet the Visionaries: Zac and Cari Caramonta At the core of this remarkable journey are two individuals whose passion for crafting exceptional beer and community-driven innovation shines through: Image Credit: Zac Caramonta Image Source: Gnarly Barley Brewery Facebook Co-founder/President - Zac Caramonta: An ardent skateboarder and a craftsman at heart, Zac's boundless ambition drove him to self-teach the art of brewing. His journey wasn't just about bringing his passions closer to home; it was about sharing them with friends and family. When his garage could no longer contain his aspirations, he took the leap, left his day job, and co-founded Gnarly Barley Brewing with his wife, Cari. Zac is also a member of the Mystic Krew of Brew homebrewers club in Covington, LA, and a founding member of the YOURS foundation, an organization dedicated to bringing skateparks to local communities. Image Credit: Cari Caramonta Image Source: Gnarly Barley Brewery Facebook Co-founder/Vice-President - Cari Caramonta: A true craft enthusiast in every sense, Cari's creative spirit has taken many forms, from customizing her wardrobe to crafting furniture and visual displays as a fashion merchandiser. When she discovered brewing, it was another avenue for her DIY mindset. Cari is a member of the Mystic Krew of Brew homebrewers club in Covington and a Cicerone Certified Beer Server. She collaborates with Zac on crafting recipes, brewing, marketing, and, of course, savoring the fruits of their labor. The story of Gnarly Barley Brewery is a testament to the power of passion, perseverance, and the unbreakable bond of a couple dedicated to their craft. It's a story that celebrates not only exceptional craft beer but the vibrant spirit of Louisiana and the communities it touches. Gnarly Barley Brewing ’s Korova Milk Porter secured 88 points at the 2023 USA Beer Ratings achieving Silver Medal. Quality tasting porter. Just yummy. Get rated by Quality, Value, and Packaging by the top retail buyers in the USA. Here is how to enter . More from our Blog News 2023 USA Beer Ratings Winners Announced 17/08/2023 Kilted Harley Scottish Ale from the United States wins the top score at the 2023 USA Beer Ratings making it Beer of the Year 2023. Insights Sampling the Best Craft Beers in Omaha 20/04/2023 Taste your way through Nebraska through its local breweries and taprooms. Insights The Power of Packaging - How it Can Impact Your Brands' Success 18/04/2023 Elevate your brand's success in the competitive wine, beer, and spirits Industry Insights Exploring the Best Breweries in Boston: A Guide to the City's Hazy IPA Scene 14/04/2023 Whether you're looking for a hoppy pale ale or a double IPA, there's sure to be a brewery in Boston that will satisfy your craving. Blog archive Fill in your email to receive news and updates from USA Beer Ratings Thank you for subscribing. info@usabeerratings.com | +1 855-481-1112 © 2025 USA Beer Ratings. All Rights Reserved. Subscribe Here About Terms & Conditions Judges Order Stickers Categories Beer Reviews Insights News Travel Podcasts Producer Profiles Videos"
    },
    {
      "url": "https://gnarlybeer.com/contact.html",
      "text": "Contact Us | Gnarly Barley Brewing Co. | Hammond, LA When Were You Born? Welcome to Gnarly Barley. Are you 21 Years or older? Please, verify your age to enter. Enter No items found. About Us Who We Are Awards FAQ Careers Our Brews Beers What's On Tap Beer Calendar Enjoy Here Best Practices Events Calendar Rent Space Taproom Dine Gnar Shop Contact Connect with Gnarly Barley For questions, bookings, or just to say hello, reach out to us. Find our beer, book an event, or request donationsâall from one place. See Contact Details Message Us See FAQs rENT Event Spaces Request Donations Find Us Here Visit us at our Taproom , give us a call, or drop us an email. Check out our hours below and use the map to find your way. Weâd love to hear from you! Address 1709 Corbin Rd, Hammond, LA 70403 get directions Taproom Hours Mon-Wed : 2 PM - 9 PM â Thu-Sat : 12 PM - 9 PM â Sun : 12 PM - 7 PM Contact info@gnarlybarley.com 985-318-0RAD (0723) Message Us Find Where to Enjoy Our Brews Looking to stock up on Gnarly Barley? Use our distributor locator to find a nearby supplier and get your favorite brews on tap or in stores. Start your search today! Find a Distributor Host Your Next Event at Gnarly Ready to plan your next gathering? Whether it's a private party in our taproom, a cozy get-together at Dine Gnar, or an outdoor celebration on our green space, we've got you covered. From table rentals to catering options, weâll help you create an unforgettable experience. See Rental Details Get In Touch Got questions, comments or want more information? Let us know below. Name Email Phone (optional) Message Thank you! We have received your submission. Oops! Something went wrong. Please try again. Request Donations We believe in giving back and being an active part of our community. If your organization is seeking a donation, please fill out the form to provide us with the necessary details for consideration. We'd love to help! Apply for a Donation Get The Drip Want First Dibs? Sign Up For Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong. Please try again. Come See Us 1709 Corbin Rd, Hammond, LA 70403 Taproom Hours: Mon-Tues: 2 PM - 9 PM WED-Sat: 11 AM - 10 PM Sun: 12 PM - 7 PM Links & Things AboutÂ Us Our Brews Events Dine Gnar Taproom Shop Contact FAQs Careers Press & Awards Donation Requests Media Kit Get in Touch info@gnarlybeer.com 985-318-0723 Privacy Policy Â© 2024 Gnarly Barley Brewing Company. All rights reserved. Website by Anntoine Marketing + Design"
    }
  ]
}