{
  "fuentes": [
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://hangar.flights/about",
      "email": "hf-logo-textmiddel-7@2x.png"
    },
    {
      "url": "https://hangar.flights/about",
      "email": "info@hangar.flights"
    },
    {
      "url": "https://www.thehangar38.com/birthday-parties-special-events/",
      "email": "miriaha@thehangar38.com"
    },
    {
      "url": "https://www.thehangar38.com/birthday-parties-special-events/",
      "email": "events@thehangar38.com"
    },
    {
      "url": "https://www.thehangar38.com/birthday-parties-special-events/",
      "email": "miriaha@thehangar38.com"
    },
    {
      "url": "https://thehangar.be/contact/",
      "email": "chloe@thehangar.be"
    },
    {
      "url": "https://thehangar.be/contact/",
      "email": "info@thehangar.be"
    },
    {
      "url": "https://thehangar.be/contact/",
      "email": "lucas@thehangar.be"
    },
    {
      "url": "https://thehangar.be/contact/",
      "email": "press@thehangar.be"
    },
    {
      "url": "https://thehangar.be/contact/",
      "email": "rod@thehangar.be"
    },
    {
      "url": "https://thehangar.be/contact/",
      "email": "thibaut@thehangar.be"
    },
    {
      "url": "https://hangar51customs.com/contact-us/",
      "email": "blake@hangar51customs.com"
    },
    {
      "url": "https://hangar51customs.com/contact-us/",
      "email": "info@mydomain.com"
    },
    {
      "url": "http://cca.dothan.com/WebForms/the-hangar-38-__1_465_5124226_memberprofile.aspx",
      "email": "info@dothan.com"
    },
    {
      "url": "http://cca.dothan.com/WebForms/the-hangar-38-__1_465_5124226_memberprofile.aspx",
      "email": "info@thehangar38.com"
    }
  ],
  "mails": [
    "blake@hangar51customs.com",
    "chloe@thehangar.be",
    "events@thehangar38.com",
    "hf-logo-textmiddel-7@2x.png",
    "info@dothan.com",
    "info@hangar.flights",
    "info@mydomain.com",
    "info@reception-plus.de",
    "info@thehangar.be",
    "info@thehangar38.com",
    "lucas@thehangar.be",
    "miriaha@thehangar38.com",
    "press@thehangar.be",
    "rod@thehangar.be",
    "thibaut@thehangar.be"
  ],
  "nombre_sitio": "thehangar38.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name E-Mail name First Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://hangar.flights/about",
      "text": "About us - Hangar.Flights Pilot Gear Flight Simulator Flight Training Aircraft Inspiration More The 100 Best Aviation Quotes of All Times 24 of the Best Aviation Movies of All Time 10 Great Aviation Documentaries Worth Watching 5 Inspirational Aviation Books for Those Wanting to Learn How to Fly Find aviation inspiration Read aviation stories Read about flying experiences Aviation news All inspiration articles 18 Different Types of Airplanes and What Makes Them Unique 10 Popular Ultralight Aircraft for The Purest Flying Experience The 10 Fastest Single Engine Airplanes Flying Around Today The Types of Military Helicopters and What Makes Them Unique Everything about helicopters Everything about airplanes Everything about ultralights Everything about military aviation Everything about gliding Everything about paragliding All articles about airplanes 85+ Black Friday 2024 Deals for Pilots The 17 Best Flight Bags to Organize Your Pilot Gear in 2025 The Best Gifts for Pilots – 2025 Aviation Gift Guide The Best Aviation Headsets for Pilots in 2025 Best aviation headsets Best flight bags Best pilot watches Best handheld aviation radios Pilot gear reviews Deals on Pilot Gear 🎁  Aviation gift guides All pilot gear articles The Best Online Ground Schools and How to Choose in 2025 12 Great Online Aviation Courses for Private Pilots in 2025 10 Tips to Help You Save Over 30% on Your Private Pilot Flight Training 10 Reasons Why Getting a Private Pilot’s License is Worth It Private Pilot License cost Rod Machado ground school review Best tools and gear for student pilots How to Become a Glider Pilot All pilot gear guides Books for student pilots A career in aviation All flight training articles How to Build a Home Flight Simulator in 2025: A Step-by-Step Guide 4 Great Flight Simulator Setup Examples and Their Cost The Best Flight Simulator Software and Hardware in 2025 The 6 Best Flight Simulator Headphones for Virtual Flying in 2025 How flight simulator can make you a better pilot Best flight simulator software & hardware Flight simulator yokes Flight simulator rudder pedals Flight simulator throttle quadrans Garmin GPS simulators All flight simulator articles Home Pilot Gear Flight Simulator Flight Training Inspiration Gift Guides Airplanes Helicopters More Hangar.Flights About us Inspiring and educating (new) pilots since 2016 Hi there! I’m Senne, the proud founder of Hangar.Flights. What began as a personal passion project has now flourished into a globally recognized aviation media company. We are now a go-to source for over 25,000 monthly visitors from across the globe. Our content ranges from captivating flying stories to practical guides for student pilots, and comprehensive reviews of pilot gear. We are committed to enriching your aviation journey. Whether you’re a student pilot navigating the skies of flight training, an experienced aviator seeking advanced insights, or an enthusiast absorbed in aviation lore, we are here to support and inspire you. Hangar.Flights transcends the traditional boundaries of a website. We are a vibrant community, a repository of knowledge, and a source of inspiration. Our platform is a testament to our dedication to the aviation field, offering a unique blend of expert content, community engagement, and educational resources. I hope those who use this website will find value in the content we publish. I hope we can inspire people to chase that aviation dream, and I sincerely hope you will become a better and safer pilot after reading some of our articles and other content. Fly safe, Senne Vandenputte – Founder @sennevdp Contact us Whether you have a question, want to have a chat or meet me over a few beers, just send us an email on info@hangar.flights and we will get back to you as soon as we can! We are, of course, always open to suggestions to improve the website and grow our community. We would love to hear what you think about Hangar.Flights and get your remarks, questions and suggestions. Categories Pilot Gear Flight Simulator Flight Training Reviews Inspiration Airplanes Helicopters Gliding Ultralights Paragliding Model Aircraft Military Career Airports Airplane Spotting Airlines Experiences Buying & Selling Lounge Gift Guides News Other Recent posts Top 5 Airplane Movies Based on True Stories Maintaining Your Aviation Headset: A Pilot’s Guide Is Airplane Paint the Same as Car Paint? Exploring the Differences What Was the Life Expectancy of a WWI Pilot? How Long Can a Paraglider Stay in the Air? The Best Seasons and Times to go Paragliding FREE ebook : 37 Tips to Help You Save Over 30% on Your Private Pilot Flight Training 5000+ words of actionable tips and tricks. From learning about flight schools and courses, to finding ways to save money before, during and after your flying lessons, we’ve got you covered. Get Your FREE ebook Hangar.Flights is owned by Fly Media bv . Philipssite 5/1 3001 Leuven Belgium BE0773416731 All articles Pilot Gear Flight Training Flight Simulator Inspiration Story Series About us Privacy Policy Terms & Conditions Subscribe to our Newsletter Disclaimer: We are a participant in the affiliate programs of Amazon (Amazon Associates), Faro Aviation, Rod Machado, Pilot Institute, and others. Some of the links on this website are affiliate links, which means that if you choose to make a purchase, we will earn a small commission, at no additional cost to you. Hangar.Flights © 2025. All rights reserved."
    },
    {
      "url": "https://www.thehangar38.com/birthday-parties-special-events/",
      "text": "Hangar 38 - Birthday Parties & Special Events Tallahassee: 850-999-2606 Facebook-f Instagram Twitter Dothan: 334-791-4656 Facebook-f Instagram Bowling Gaming Birthday Parties/Special Events Events Food, Drink, & Catering Dinner Menu Contact Us Bowling Gaming Birthday Parties/Special Events Events Food, Drink, & Catering Dinner Menu Contact Us Birthday parties / special events Let's Get\nThis\nParty\nStarted! Let’s Get This Party Started at Hangar 38! From birthdays to corporate outings, we have all your get-together needs taken care of, all in one place. We have several spaces for small and large private parties. Contact us Tallahassee p. 850-545-4669 e. events@thehangar38.com Dothan p. 334-791-4656 e. miriaha@thehangar38.com Birthday Party Package Monday – Thursday starting at $17 per person (6 minimum) Friday – Sunday starting at $24 per person (6 minimum) One time $25 lane charge if over 8 Includes: 30 minutes bowling (shoes included) $15 play card per person or 1 hour play card per person 1 virtual rabbids ride (vr) per person Cheese or pepperoni pizza’s with soda’s Add Ons: Add $10 additional play on each play card for $5 (must be done at the beginning) — $5.00 Additional Runway Pie — $12.00 Beer Pitchers (2 Pitchers of Draft Beer… 21 and up) — $20.00 1 Bottle of House Wine (White or Red…21 and up) — $22.00 Special Events We offer all kinds of special events. From Team-Building Events, Office Parties, Child and Adult Birthday Parties and more; Hangar 38 is a great place to celebrate any occasion! Contact us at 850-545-4669 for Tallahassee or 334-791-4656 for Dothan. You can also email us at events@thehangar38.com for Tallahassee and miriaha@thehangar38.com for Dothan and ask for our event planner to book your event. Unlimited bowling Sundays 11 Am - 3 PM Karaoke Bar every Thursday night at 8 PM Retro ladies night every second Friday Tallahassee, Florida 6668 Thomasville Rd. Tallahassee Florida 32312 850-999-2606 Happy Hour Mon – Sat  2pm-7pm Sunday All Day Facebook-f Twitter Instagram Dothan, Alabama 3120 Ross Clark Circle Dothan, Alabama 36303 334-791-4656 Happy Hour Mon – Sat  2pm-7pm Sunday  11am-9pm Facebook-f Instagram Hours of operation Sunday – Thursday 11am-10pm Friday & Saturday 11am-12am © 2025 Hangar 38. All Rights Reserved. Powered by 223_Agency ."
    },
    {
      "url": "https://thehangar.be/contact/",
      "text": "Contact — Hangar Menu Close Instagram Upcoming Events Practical Merch News & Deals hangartable Contact Buy Tickets Instagram Upcoming Events Practical Merch News & Deals hangartable Contact Buy Tickets Instagram Upcoming Events Practical Merch News & Deals hangartable Contact Buy Tickets Ask Us A Question Get in touch with our team if you have any questions. Please enable JavaScript in your browser to complete this form. Subject: * Please select a subject... Ticket Issues Artists (Bookings) Complaints Food Trucks Jobs - Internships - Volunteers Marketing & Media Merchandising Press Refunds Sponsoring General Enquiries / Other Name * Email * Message This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Submit Back Home Back to the Top Get Your Tickets Now Buy Tickets Newsletter To stay updated on all things Hangar, please subscribe to our newsletter. Hangar Jobs Terms & Conditions Contact info@thehangar.be Whatsapp: +32 477 27 73 32 Chau. d'Alsemberg 1021, 1420 Braine-l'Alleud BE0691771039 Merch Store Terms & Conditions Refund & Returns © 2025 Hangar, All Rights Reserved. Follow Us:"
    },
    {
      "url": "https://hangar51customs.com/contact-us/",
      "text": "Contact Hangar 51 Customs | Manhattan IL Shop Home Show Room Wheels & Tires PPF Vinyl Wraps Window Tinting Lifts/Suspension Services About Us Contact Us Blog view inventory 7082613435 Contact Us Address 100 Elwood Rd Manhattan IL 60442 US Contact 7082613435 blake@hangar51customs.com Business Hours Mon - Fri\n7:00 AM - 5:00 PM Schedule An Online Appointment Send Thank you! We have received your submission. Error Bad respond Copyright Â© All rights reserved. Quick Links Services Showroom Contact Us About Us Contact 708-261-3435\n\n100 Elwood Rd Manhattan IL 60442 US\n\nMon - Fri: 7:00 AM - 5:00 PM Having Trouble F inding Us? Get Directions We use cookies to enable essential functionality on our website, and analyze website traffic. By clicking Accept you consent to our use of cookies. Read about how we use cookies. Cookie settings Reject Accept Your Cookie Settings We use cookies to enable essential functionality on our website, and analyze website traffic. Read about how we use cookies . Cookie Categories Essential On These cookies are strictly necessary to provide you with services available through our websites. You cannot refuse these cookies without impacting how our websites function. You can block or delete them by changing your browser settings, as described under the heading \"Managing cookies\" in the Privacy and Cookies Policy . Analytics On These cookies collect information that is used in aggregate form to help us understand how our websites are being used or how effective our marketing campaigns are. Save settings"
    },
    {
      "url": "http://cca.dothan.com/WebForms/the-hangar-38-__1_465_5124226_memberprofile.aspx",
      "text": "The Hangar 38 334-792-5138 info@dothan.com Facebook LinkedIn Twitter YouTube Instagram Podcast Facebook LinkedIn Twitter YouTube Instagram Podcast Chamber Mission Statement Chairman’s Message History Board of Directors Meet Our Team Business Hall of Fame Publications Contact Members Business Directory Membership Benefits Member Events & Services Member-to-Member Discounts Latest News Join Today Member Login Programs & Events Ambassadors & Diplomats Dothan Area Young Professionals IMPACT Leadership Dothan Youth Leadership Calendar of Events Community Dothan Highlights Attractions Living in Dothan Find Your Home Regional Airport Education Health Care Housing Important Numbers Religion Senior Programs Taxes Transportation Welcome Guide Start A Business Select Page Login Join Business Directory Return to Listing The Hangar 38 www.thehangar38.com 3120 Ross Clark Circle Dothan, AL 36303 334-791-4656 Email: info@thehangar38.com RESTAURANTS ENTERTAINMENT Members | Calendar of Events | Member Account | Community Calendar of Events | Jobs | Member Promotions | News | Request Info Thu 11 DAYP - PDL - Wallace College - Savannah Granberry Sep 11th @ 11:30 AM Mon 22 Welcome Reception - Dr. Askew Sep 22nd @ 4:00 PM Wed 1 25-26 WPS- State of Innovation Oct 1st @ 7:30 AM Wed 8 Marketing Masterclass Oct 8th @ 8:00 AM Thu 9 25 Eggs and Issues Washington DC Oct 9th @ 8:00 AM Tue 21 25 Annual Meeting 2025 Oct 21st @ 11:30 AM Wed 5 25-26 WPS- State of Education Nov 5th @ 7:30 AM Thu 13 25 ConnectHER Leadership Conference Nov 13th @ 8:00 AM Wed 10 25-26 WPS- State of HealthCare Dec 10th @ 7:30 AM Wed 14 25-26 WPS- State of City/County Jan 14th @ 7:30 AM + Add Your Event 334-792-5138 102 Jamestown Blvd. Dothan, AL 36301 © Dothan Area Chamber of Commerce. All Rights Reserved. Website by CC-Assist"
    }
  ]
}