{
  "fuentes": [
    {
      "url": "https://naplesgolfguy.com/golf-communities/hideaway-country-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/hideaway-country-club/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://hideawaygolfclub.squarespace.com/golf-courses",
      "email": "info@hideawaygolfclub.com"
    },
    {
      "url": "https://www.hideawaybeachmaldives.com/contact/",
      "email": "reservations@hideawaybeachmaldives.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "andrea.schaefer@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "brooke.tyler@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "david.sizelove@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "jason.lippy@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "jesse.regalado@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "menno.ozinga@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "mitchell.putnam@clubcorp.commitchell"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "mitchell.putnam@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "robin.kremen@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "annemarie.mckay@invitedclubs.com"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/hideaway/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/hideaway/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://hideawaygolf.com/",
      "email": "hideaway@ptd.net"
    },
    {
      "url": "https://mycountryhideaway.com/contact/",
      "email": "admin@mycountryhideaway.com"
    },
    {
      "url": "https://www.bestofluxuryrealty.com/Fort-Myers/The-Hideaway-Country-Club-Condos-For-Sale",
      "email": "info@bestofluxuryrealty.com"
    }
  ],
  "mails": [
    "admin@mycountryhideaway.com",
    "andrea.schaefer@invitedclubs.com",
    "annemarie.mckay@invitedclubs.com",
    "brooke.tyler@invitedclubs.com",
    "contact@clubcarwash.com",
    "david.sizelove@invitedclubs.com",
    "hideaway@ptd.net",
    "info@bestofluxuryrealty.com",
    "info@hideawaygolfclub.com",
    "info@naplesgolfguy.com",
    "jason.lippy@invitedclubs.com",
    "jesse.regalado@invitedclubs.com",
    "matt@naplesgolfguy.com",
    "menno.ozinga@invitedclubs.com",
    "mitchell.putnam@clubcorp.commitchell",
    "mitchell.putnam@invitedclubs.com",
    "reservations@hideawaybeachmaldives.com",
    "robin.kremen@invitedclubs.com"
  ],
  "nombre_sitio": "thehideawaygolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://naplesgolfguy.com/golf-communities/hideaway-country-club/",
      "text": "Hideaway Country Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Fort Myers Golf Communities Hideaway Country Club Hideaway Country Club is a gated private bundled golf community in Ft. Myers. The 18-hole executive golf course is known as one of the friendliest courses in Florida. Set among rolling hills with tall pine trees, this course gives you an old Florida-style feel. Moreover, this golf course provides golfers of all skill levels with a challenging yet enjoyable golf experience. Also, members can access a short course designed to improve your short game. Additionally, community residents can access Har-Tru clay tennis courts and a wide array of daily play and league options year-round. Finally, this private golf community consists of five Villages including Augusta, Baltusrol, Greenbriar, Merion and Oakmont. There are 496 condos spread throughout the villages which provides a wide array of housing options for residents. Bottom Line The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities, contact us today for more information. Location: Fort Myers, Florida Club Type: Private Membership Type: Bundled Real Estate Home Price Ranges Single Family: Not Applicable None in this Community Condos: $215,000 – $300,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Hideaway Country Club. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Memberships 350 Golf Memberships Is Membership Required? No Non-Resident Memberships Available? No Membership Fees Golf Membership Initiation Fee: $4,525 Annual Golf Dues: $2,500 Social Membership Initiation Fee: Bundled Annual Social Membership Dues: N/A Please be aware, that other membership options may be available. Additional fees such as capital assessments, transfer fees, a food and beverage minimum or taxes may apply. Please feel free to contact me for additional information. Golf Course Information Number of Courses 1 (18 Holes) Caddies Available No Practice Range No Own your own cart Yes Course Ratings / Scorecards Opened 1984 Architect Ron Garl Par: 67 Holes: 18 Yards Rating Slope Blue 5146 66.1 120 White 4741 64.5 115 Gold 4294 63.2 115 Ladies Tees: Gold 4294 66.2 117 Red 3910 64.5 110 Red/Aqua 3878 64.4 108 Amenities Gated Golf Community One Golf Course Clubhouse Community Pool Fitness Center Tennis Courts Where is Hideaway Country Club Located Hideaway Country Club 5670 Trailwinds Drive Fort Myers, FL 33907 239.275.6232 Visit Club Website Back to Fort Myers Golf Communities Note: We make every effort to make sure our information for this Golf Club: Hideaway Country Club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://hideawaygolfclub.squarespace.com/golf-courses",
      "text": "Golf Courses — Hideaway Golf Club | La Quinta, CA About Experiences Residences Listings Membership Contact About Experiences Residences Listings Membership Contact Scroll Perfect your Golf Game The Hideaway's golf memberships are private-equity memberships providing an exclusive golf environment of no more than 225 members per 18 holes. The club features two distinct and dramatic, par 72 18-hole courses, one designed by famed British architect Clive Clark and the other by the legendary Pete Dye. The Pete Dye Course Designed by Pete Dye, this links-inspired course was the first at the Hideaway, completed in 2001. Each hole presents a journey down a rolling fairway bordered by native grasses that gives way to wide strips of sand or to strategically placed streams and ponds. Sand and water begin or end each hole, lining the edges of the greens or expanding in front of elevated tees. Pete Dye is one of the most influential and creative golf course designers in the history of the game. His courses challenge the most accomplished golfers, yet they are accessible and enjoyable for players of all skill levels. Pete Dye's designs are also noted as environmentally safe and protective of the local surroundings, features that characterize his work at the Hideaway. The Clive Clark Course Designed by Clive Clark, this 18-hole course was inspired by the Southern California landscape yet it’s also reminiscent of the courses Clark designed in the British Isles. Each hole has a distinct personality, characterized by cascading waterfalls, for example, or vivid desert wildflowers. Gently rolling fairways play to broad greens, offering an immensely playable yet challenging round of golf. A British golfing great, Clive Clark spent 12 years on the professional golf circuit in England, winning five European titles and earning two top-10 finishes in the British Open. He was also a member of the Walker and Ryder Cup teams. Since 1987 Mr. Clark has designed more than 20 golf courses in the United Kingdom, South Africa, Europe, and the U.S. Hideaway Golf Performance Center Golf like a pro at the Hideaway. Nurture your skillset off the green by scheduling a private lesson (or two) with our TrackMan Launch monitor, a state-of-the-art radar system that precisely captures every little detail from launch to landing to help you fine-tune your game. Our helpful team can also fit you for your next set of clubs - schedule a time at Hideaway’s Golf Performance Center to make your next round your best one yet. Exclusive Membership Benefits Learn More Golf 1 Golf 2 Pete Dye Course Clive Clark Course Hideaway Golf Performance Center Golf 5 The Hideaway 80440 Hideaway Club Drive, La Quinta, CA, 92253, United States 760-422-5041 info@hideawaygolfclub.com Hours Careers | Members Login | Membership | Press | Email Signup Hideaway Golf Club 80-440 Hideaway Club Ct La Quinta, California 92253 ( Google Map) 760.777.7400 Phone 760.777.7460 Fax info@hideawaygolfclub.com © 2021 Hideaway Golf Club. All Rights Reserved Website Design Studio"
    },
    {
      "url": "https://www.hideawaybeachmaldives.com/contact/",
      "text": "Contact Hideaway Beach Maldives & Newsletter Sign-up ☰ Untouched Maldives Villas Beach Villas Water Villas Signature Residences Experiences Spa & Wellness Dining Sports & Fitness About Offers Blog Contact Us What’s On FAQ Gallery Getting Here Factsheets Facilities Awards Wellness Dining Experiences hide hide Villas Offers Contact Book Now Menu Menu Contact Us Book your Hideaway Escape to your little hidden corner of the world, at Hideaway Beach Resort. Experience luxury, serenity, and adventure in the heart of the Maldives. Get In Touch With Us Please fill out the form below to contact us and we will do our best to get back to you as soon as possible. Your Name * E-Mail * Telephone Your Message * 2 + 5 = ? Please prove that you are human by solving the equation * If you are an influencer and would like to get in touch with the team please use the form here. Contact us now to start planning your unforgettable getaway. Hideaway Beach Resort & Spa Haa Alifu Atoll, Dhonakulhi Island Maldives +960 6501515 reservations@hideawaybeachmaldives.com +960 7244544 Request a Call Back We Are Social Why not follow us on Facebook, Twitter, Instagram and other social media platforms and be the first to know about what’s going on in your favorite paradise Hideaway. Subscribe to Our Newsletter Subscribe to our monthly newsletter and receive updates about happenings and special offers right into your mailbox. Getting to Hideaway Our friendly and dedicated team will greet you at Velana International Airport and assist you in your onward transfer by either a domestic flight or seaplane. Domestic flights are with Maldivian Airlines to Hanimadhoo International Airport and takes just 55 minutes; from there, it’s a 15-20 minute scenic speedboat ride to Hideaway Beach Resort & Spa in the Maldives. Guests opting for a seaplane transfer will embark on a direct 75-minute picturesque journey to the Untouched Maldives which will be a ride to remember – make sure cameras are ready on these scenic rides and get the best view of the Maldives! Know More > Where comfort meets seclusion – Hideaway offers the ultimate escape Book Now Offers Gallery Talk to us reservations@hideawaybeachmaldives.com +960 650-1515 Factsheet FAQ Sustainability Getting Here Gallery Gifts “Leading Honeymoon Resort in the Maldives” – World Travel Awards “Best Family Resort (Indian Ocean)” – Haute Grandeur Award Contact Privacy Careers Sitemap Download App Book Now Scroll to top"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "text": "Meet Our Dedicated Team | The Woodlands Country Club, TX × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Calendar Opens in new tab Member Login Find A Club Opens in new tab Careers The Woodlands Country Club Main Site Navigation Our Story Golf Amenities Membership Host An Event Join Now Host Event Contact Us Contact Us Login - Opens in new tab Menu Our Story Our Team Calendar Directions & Hours Golf The Refinery Insperity Invitational Lessons & Programs Tournament Course Player Course North Course West Course Palmer Course King General Deacon Amenities Racquet Sports Dining Blu Pool Fitness Membership Host An Event Tournaments & Outings Weddings Events Meetings & Corporate Event Rooms Contact Us Calendar Opens in new tab Member Login Find A Club Opens in new tab Careers Login - Opens in new tab Home Our Story Our Team Our Story Calendar Directions & Hours Meet Our Amazing Team David Sizelove Regional Manager Contact Me David.Sizelove Contact Me + Close David Sizelove information modal David Sizelove Regional Manager Serving since 2023 David.Sizelove David.Sizelove Contact Me Contact Me Menno Ozinga General Manager | Palmer Contact Me Menno.Ozinga Contact Me + Close Menno Ozinga information modal Menno Ozinga General Manager | Palmer Serving since 2023 Menno.Ozinga Menno.Ozinga Contact Me Contact Me Robin Kremen General Manager | The Trails Contact Me Robin.Kremen Contact Me About Robin + Close Robin Kremen information modal Robin Kremen General Manager | The Trails Serving since 2015 Robin.Kremen Robin.Kremen Contact Me About Robin Born in New Jersey. Moved to Houston in October 80Graduated Culinary Institute of America. Worked at Cellar in Sky World Trade Center, Sheraton Corporation, Junior League of Houston, Bon Appetite, Lakeside Country Club and Bay Oaks Country Club.Over Thirty years in Food Service13years as a Invited Employee.Team member Texas Chefs Association George W Bush Presidential inauguration reception, Economic Summit Rice University.Culinary Institute of America – Culinary Team Member25 years as a member Houston Livestock Show & Rodeo, Chairman 2 timeWife Tracy, son Gregory, Daughter ElizabethStarted at the Woodlands CC in February Contact Me Jesse Regalado Club Manager | Tournament Contact Me Jesse.Regalado Contact Me + Close Jesse Regalado information modal Jesse Regalado Club Manager | Tournament Serving since 2022 Jesse.Regalado Jesse.Regalado Contact Me Contact Me Amber Sickafoose Membership Director Contact Me 281-845-4886 Amber.Sickafoose Contact Me About Amber + Close Amber Sickafoose information modal Amber Sickafoose Membership Director Serving since 2010 281-845-4886 Amber.Sickafoose 281-845-4886 Amber.Sickafoose Contact Me About Amber Amber holds a BS degree in Marketing from Bellevue University. She started her career as a Director of Marketing for a financial company but quickly decided that sales was her real passion. Her golf career began in 2009 for The Woodlands Country Club as a membership director for both The Oaks and Panther Trail courses as well as The Woodlands Country Club courses. She is a very active member in the community and a graduate of Leadership Montgomery County class of 2013. Contact Me Jason Lippy Membership Director Contact Me 832-810-5876 Jason.Lippy Contact Me About Jason + Close Jason Lippy information modal Jason Lippy Membership Director Serving since 2015 832-810-5876 Jason.Lippy 832-810-5876 Jason.Lippy Contact Me About Jason Jason comes to Indian Wells Country Club by way of Desert Falls Country Club in Palm Desert, where he spent the four years as General Manager / Membership Director. Before moving to California in 2015, Jason spent the previous 12 years working as General Manager / Membership Director for Glen Oaks Country Club, a Invited Affiliate Club in Louisville, Kentucky. \n\nJason has worked in the golf business his entire career, starting in the Golf Shop at The Polo Fields Country Club when he was only 16.  He then moved to Glenmary Country Club to join the Membership Sales Department. Eventually becoming Club Manager at Glenmary Country Club.  Jason is a graduate of Western Kentucky University’s Broadcasting Department and has also worked covering college basketball and football for ESPN.  Jason’s interests include playing golf, spending time with his wife and eight year old daughter exploring the Coachella Valley. Contact Me Mitchell Putnam Membership Director Contact Me 832-810-5872 Mitchell.Putnam Contact Me About Mitchell + Close Mitchell Putnam information modal Mitchell Putnam Membership Director Serving since 2014 832-810-5872 Mitchell.Putnam 832-810-5872 Mitchell.Putnam Contact Me About Mitchell Email:  Mitchell.Putnam@clubcorp.comMitchell holds a BS degree in Criminal Justice from Sam Houston State University. He was born and raised in Houston Texas. He joined the Invited family as Service Captain at Willow Creek Golf Club in 2014, eventually becoming the Membership Director in 2017. He joined The Golf Trails of The Woodlands team in 2018 as the Membership Director. He enjoys playing golf, fishing, and watching Houston sports teams play. Contact Me Annemarie McKay Event Sales Director Contact Me 281-801-4103 Annemarie.Mckay Contact Me About Annemarie + Close Annemarie McKay information modal Annemarie McKay Event Sales Director Serving since 2015 281-801-4103 Annemarie.McKay 281-801-4103 Annemarie.McKay Contact Me About Annemarie Annemarie is originally from Allen, Tx. She holds a Bachelor’s degree in Hospitality Administration from Stephen F. Austin State University, located in the small town of Nacogdoches, Texas. Annemarie started her career with Invited as a college intern at Stonebriar Country Club in Frisco, Tx. After she graduated, she was hired on fulltime as their Private Event Coordinator assisting with corporate and social events. Annemarie then moved forward in here career and stepped into the role of Private Event Manager at the Las Colinas Country Club in Irving, Tx. There she continued to build her range of events and added Golf Tournaments to her portfolio. She had the privilege of working on events such as George W. Bush Presidential Center’s Warrior Open and the 2015 Volunteers of America North Texas LPGA Shootout. Annemarie recently moved to Houston to further pursue her passion for private events and is proud to call the Woodlands Country Club home, as their Private Event Director. Contact Me Brooke Tyler Event Sales Director Contact Me 281-339-8085 Brooke.Tyler Contact Me About Brooke + Close Brooke Tyler information modal Brooke Tyler Event Sales Director Serving since 2009 281-339-8085 Brooke.Tyler 281-339-8085 Brooke.Tyler Contact Me About Brooke Brooke Tyler is a graduate of The University of Texas at Arlington with a degree in Public Relations. She moved to the Houston Area in 2004 where she started her career in the hospitality industry. She worked for Marriott International for five years as an Event Manager planning various events ranging from corporate, social, to weddings. She began her career at The Woodlands Country Club in 2009 as an Event Manager where she planned Member Events, Member Association Events and Golf Tournaments. In 2012, she took over the Private Event Manager role where she focused on selling and executing all private events for The Woodlands Country Club. She has had the pleasure of working with many members, clients and brides to successfully implement their event. Some of her most favorite memories have been made at The Country Club. She has made some of her closest friendships while working here, as well as meeting her husband, Wes. Contact Me Andrea Schaefer Event Sales Coordinator Contact Me Andrea.Schaefer Contact Me + Close Andrea Schaefer information modal Andrea Schaefer Event Sales Coordinator Serving since 2024 Andrea.Schaefer Andrea.Schaefer Contact Me Contact Me Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Our Story Golf Amenities Membership Host An Event Contact Us THE WOODLANDS COUNTRY CLUB Opens in new window 100 Grand Fairway The Woodlands, TX \r\n                                77381 1 281-863-1400 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://www.naplesgolfguy.com/hideaway/",
      "text": "Hideaway Country Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Fort Myers Golf Communities Hideaway Country Club Hideaway Country Club is a gated private bundled golf community in Ft. Myers. The 18-hole executive golf course is known as one of the friendliest courses in Florida. Set among rolling hills with tall pine trees, this course gives you an old Florida-style feel. Moreover, this golf course provides golfers of all skill levels with a challenging yet enjoyable golf experience. Also, members can access a short course designed to improve your short game. Additionally, community residents can access Har-Tru clay tennis courts and a wide array of daily play and league options year-round. Finally, this private golf community consists of five Villages including Augusta, Baltusrol, Greenbriar, Merion and Oakmont. There are 496 condos spread throughout the villages which provides a wide array of housing options for residents. Bottom Line The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities, contact us today for more information. Location: Fort Myers, Florida Club Type: Private Membership Type: Bundled Real Estate Home Price Ranges Single Family: Not Applicable None in this Community Condos: $215,000 – $300,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Hideaway Country Club. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Memberships 350 Golf Memberships Is Membership Required? No Non-Resident Memberships Available? No Membership Fees Golf Membership Initiation Fee: $4,525 Annual Golf Dues: $2,500 Social Membership Initiation Fee: Bundled Annual Social Membership Dues: N/A Please be aware, that other membership options may be available. Additional fees such as capital assessments, transfer fees, a food and beverage minimum or taxes may apply. Please feel free to contact me for additional information. Golf Course Information Number of Courses 1 (18 Holes) Caddies Available No Practice Range No Own your own cart Yes Course Ratings / Scorecards Opened 1984 Architect Ron Garl Par: 67 Holes: 18 Yards Rating Slope Blue 5146 66.1 120 White 4741 64.5 115 Gold 4294 63.2 115 Ladies Tees: Gold 4294 66.2 117 Red 3910 64.5 110 Red/Aqua 3878 64.4 108 Amenities Gated Golf Community One Golf Course Clubhouse Community Pool Fitness Center Tennis Courts Where is Hideaway Country Club Located Hideaway Country Club 5670 Trailwinds Drive Fort Myers, FL 33907 239.275.6232 Visit Club Website Back to Fort Myers Golf Communities Note: We make every effort to make sure our information for this Golf Club: Hideaway Country Club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://hideawaygolf.com/",
      "text": "Pocono Golf Course | Golf Course In The Poconos | Hideaway Hills Tournament Request Group Size: 1 2 3 4 5 6 7 8 Please prove you are human by selecting the key . Download Our Scorecard Facebook Instagram Twitter Mail REQUEST A TEE TIME Home PLAY & STAY Events Pocono Weddings Directions Rates Virtual Tour Gallery Contact Us Blog HIDEAWAY HILLS: YOUR POCONO GOLF COURSE OF CHOICE REQUEST A TEE TIME DOWNLOAD YOUR SCORECARD PICTURE-PERFECT POCONOS GOLF COURSE TAKE A TRIP TO HIDEAWAY HILLS Searching for a “golf course near me” on Google? You have undoubtedly come across our lush greens. Hideaway Hills is a premier 18 hole, par 72, 6933-yard golf course in the heart of the Poconos where you can enjoy a relaxing and scenic golfing experience. Whether you are here for a day or a whole weekend of golf, we hope you take advantage of everything our golf courses have to offer. From our four lakes, spectacular elevation changes, over 60 sand traps, and signature Island Green, we guarantee it will be a golf outing to remember. If you are looking for a place to unwind from the city chaos and work on your swing at the same time, then Hideaway Hills Golf is the perfect choice in the Pocono Mountains. True golf lovers will find our course in sterling condition thanks to our tee to green automated irrigation system. Plus, there’s always room for a challenge around our putting green, 2-tiered turf driving range and chipping green. It's Golf With A View: ENJOY OUR SPECTACULAR LANDSCAPE GOLF RATES MEMBERSHIPS GOLF RATES GOLF RATES ALL RATES INCLUDE CART Give the Pro Shop a call 610-681-6000 to book your Tee Time! Off season Season Open to May 1st Oct 27 to close May 2nd to Oct 26 Weekday $39 $52 Weekend $49 $64 Twilight WE/WD $32 $42/$38 Replay* WE/WD\n\n*Cannot be reserved in advance $30 $40/$30 Senior (Over 60)\nMon.\nTues. Wed. Thurs. $34 $42 Golf Card\nMon-Fri $32 $42 *We accept the Tee Time Golf Pass & the Victory Golf Pass. MEMBERSHIPS BECOME A HIDEAWAY HILLS REGULAR: GET A YEARLY MEMBERSHIP We’d love to see you around here more often. That’s why we offer exclusive benefits to our yearly members. Complimentary Green Fees Discounts on Midweek Cart Rental 3 Week Advance Tee Times for Weekdays and Weekends GIFT CERTIFICATES GIVE SOMEONE THE GIFT OF GOLF What better gift for a golf lover than a visit to the Hideaway Hills Golf Course? Gift Certificates can be purchased for particular rounds of golf or for any dollar amount you would like to spend. Get a Golf Gift Certificate and surprise someone today! HIDEAWAY HILLS GOLF COURSE AT A GLANCE 18 HOLES PAR 72 6933 YARD GOLF COURSE CHALLENGING Elevations YEARLY Memberships AVAILABLE FULL SERVICE Pro Shop The Hideaway Hills Golf Course’s Signature Holes 7th Hole Our 7th hole is a Par 3 that measures 217 yards from the Blue Tee.  It has an elevation of 135 feet and is guarded by a stream in the front and 3 green side sand bunkers. 10th Hole Our 10th hole is a Par 5 that measures 538 yards from the Blue Tee.  It has an overall elevation of 222 feet from tee to green.  Our longest hole with 3 fairways and a large green. 12th Hole Our 12th hole is another Par 3 that measures 231 yards from the Blue Tee.  It has an elevation of 102 feet and is guarded by 2 deep sand bunkers on the left and a ravine in the front. 15th Hole Our 15th hole is a Par 4 that measures 417 yards and features an island green.  Besides surrounded by the water, the green has 2 green side sand bunkers in the back. WHAT MAKES THE POCONOS A GOOD GOLF DESTINATION? Known for its superior country club of the Poconos, golf enthusiasts will be enamored with its natural surroundings, great views, and peaceful environment. From a quiet getaway to an adventure-filled itinerary, it’s the perfect place for locals and tourists to have a great time with some golf near me. And of course, Pocono scenic golf courses are a highlight! Beyond locals, we often get visitors from all around Pennsylvania, New Jersey, and New York to take a break from hectic city routines. Hideaway Hills is only 30 minutes away from the Stroudsburg town center, which makes it easy to access from all major cities nearby. HIDEAWAY HILLS IS ONE OF THE MOST CHALLENGING POCONO GOLF COURSES When visiting Hideaway Hills, you’ll be happy to find a challenging golf course in neat condition! Beginner and advanced players will enjoy our four lakes, remarkable elevation changes and over 60 sand traps. Our high-end tee to green automated irrigation system helps the bentgrass tees, greens, fairways, and our signature Island Green look their best all year long. Hideaway Hills is a par 72, 6933-yard course where you can master your golf skills and enjoy a relaxing day surrounded by nature. Located in the heart of the Poconos, you’ll get your golf fix and relish in a jaw-dropping landscape every step of the way. Come on! Put your skills to the test! Here are some of the reasons that make Hideaway Hills one of the most popular Pocono Golf Courses! Scenic Beauty: Our golf course has stunning natural surroundings, which makes it the perfect setting for a scenic golf round. Plus, we work hard to provide lush green fairways, carefully maintained landscaping, and top-notch water features to enhance your overall golfing experience. Course Design and Layout: A well-designed course with a variety of hole lengths, strategic bunkering, water hazards, and interesting fairway contours can challenge golfers of different skill levels while providing an enjoyable playing experience. Playability and Challenge: At Hideaway Hills, you will find a balance between a playable course for golfers of any skill level and challenging sections to keep more experienced players engaged. Course Management and Flow: We encourage our players to keep up with the proper routing and pace of play to ensure everyone gets a positive experience. Signature Holes: Memorable and unique holes that leave a lasting impression can add to the allure of a golf course. These holes often incorporate interesting features, challenging shot selections, or breathtaking views. Clubhouse and Amenities: Stop by our clubhouse to relax and socialize after a round, enjoy a great meal, stock up on golf merch at our pro shop, enjoy your day at Hideaway Hills! Accessibility and Location: We’re conveniently located at 159 Golf Course Road, Kunkletown PA 18058. Merely a 30-minute drive from the Stroudsburg town center. Customer Service: Our attentive staff is always ready to cover our golfers’ needs and contribute to a positive experience. Stock Up on Golf Equipment & Merch VISIT THE HIDEAWAY HILLS GOLF PRO SHOP We carry top-quality golf clothing and equipment at our Pro Shop. Apparel, shoes, hats, balls, towels, everything you need to play your best. Stop by to say hi to our staff and grab some Hideaway Hills merch as souvenirs to remember your visit. Extend The Experience ASK FOR OUR GOLF PLAY & STAY PACKAGES Did you know you can stay in one of our cabins? It’s the perfect way to turn your golf experience into a Pocono getaway! Imagine stepping out of your door and enjoying our jaw-dropping golf course views. That’s what you get when staying at Hideaway Hills! Get one of our Play & Stay\nGolf Packages for: A golf weekend trip A golf couples retreat A golf business getaway A golf solo trip A golf wedding party And any other occasion a golf escape is great for! Learn About Our Play & Stay Packages HOLD GOLF TOURNAMENTS & EVENTS AT HIDEAWAY HILLS Hideaway Golf hosts many private and corporate functions from golf outings, stay and play groups, to private parties in our banquet facility. If you are interested in scheduling an event at our course, please contact the Pro Shop or submit your request below. Event Request Looking for the best Pocono golf course? Come to Hideaway Hills! Hideaway Hills Golf Club is located at 159 Golf Course Road Kunkletown, PA 18058 30-minute drive from the Stroudsburg town center 30-minute drive from Camelback Mountain 1.5-hour drive from Philadelphia 2-hour drive from New York DID YOU KNOW YOU CAN HOLD YOUR WEDDING AT HIDEAWAY HILLS? Yes, you read that right! We are thrilled to offer the perfect wedding ceremony and reception venue for couples to celebrate their new beginnings. We also offer all-inclusive wedding packages, dedicated wedding planners and the most elegant bridal suites in the Pocono Mountains. BOOK YOUR DREAM WEDDING WITH US THIS IS WHAT GOLFERS ARE SAYING ABOUT HIDEAWAY HILLS GOLF CLUB Golf FAQ What Are The Health Benefits Of Golf? You love to get together with friends or business associates and play a game of golf, but did you know that it has many beneficial health benefits as well. All sports provide many physical fitness opportunities, but golf is a low impact sport which makes it ideal for players of all ages. Because it causes little stress or damage to the joints and muscles, you can play golf into your senior years. When you play a round of golf, you are walking which offers many heart health benefits by improving cholesterol levels, blood pressure, and maintaining a healthy weight. Did you know golf is 90% mental exercise? Besides the physical benefits, golf provides a great opportunity to exercise your brain. It is also a very social sport which is especially important as we age. By making new friends on the golf course, it also helps to ease stress and anxiety and combat depression. Hideaway Golf is the best place to take advantage of all this in the fresh Pennsylvania air. How Can I Improve My Game? Whether you are a novice or seasoned golfer, there is always room for improvement. If you have watched your fair share of golf tournaments, you know that even professional golfers get better as they perfect their skills. At our Poconos golf course, we suggest playing at least once a week to strengthen your overall golf game. Many of our golfers want to know how to improve their swing. There are countless tips on this common theme. First and foremost, take your time between the transition from backswing to forward swing. Relax your grip because when your grasp is too tight, you lose power. You should also have a target in sight as this will help you achieve the goal at hand. This may sound obvious, but keep your eye on the club as it hits the ball. When you are putting, be completely still because it is all about control and being precise. Remember to fully finish your swing from backswing to downswing. Most importantly, get out there with your friends and enjoy this globally loved game. What Are The Must Have Clubs For Beginners? It’s our opinion that there is no better sport than golf, but we may be a bit biased. We understand that starting out can feel intimidating. First, we always tell beginners there is no need to go out and buy expensive gear. Purchase golf gear that is affordable and will allow you to practice and learn the basics. Buying second hand clubs is also a great option if you are still uncertain about your commitment to the game. Also, you do not need a full bag of clubs. We suggest simply buying a driver, a putter and a sand wedge to start. You can build on those with a 6-iron, 8-iron, pitching wedge and fairway. Generally, it is good to look for golf clubs geared towards beginners. We carry a large selection of golf gear suitable for all levels of play in our pro shop. We are happy to help you get started. What Are The Top Golf Accessories I Need? If you have never played golf before, you are probably wondering what accessories are essential to the game before you head out to your local golf shop. You may have purchased your clubs near me, but there are so many other items you need. Let’s start with a great pair of gloves whether you like to wear them always or just when you get caught in the rain to maintain a good grip. In order to keep the golf scorecard accurate, we strongly recommend purchasing a golf rangefinder. Repair pitch marks on the green before you putt with a divot repair tool. As we said earlier, Poconos golf means you will be doing a lot of walking. When you are browsing for items in golf stores, make sure to try on as many shoes as possible to select the one that will give you the most support and comfort. Don’t forget a good pair of insoles for much needed relief after hours on the course. Carrying your own golf bag? We can not stress enough how important it is to purchase a good double strap that will distribute the weight on your back evenly. Lastly, always remember to wear your golf hat, a pair of sunglasses, a golf towel, and a large water bottle to stay hydrated. OUR TREAT TO NEW POCONO GOLFERS: WHAT DO ALL THESE GOLF TERMS MEAN? Like learning a new language, the sport of golf has its own lexicon. Before your first game, brush up on some of the terminology you will be hearing on the golf course. We can not possibly go over all of them here, but we will do our best to share the most widely used words and their meanings. Must know golf terminology for beginning golfers: Birdie – Completing the hole in one less stroke than the par. Bogey – Completing the hole in one more stroke than the par. Double Bogey – Completing the hole in two more strokes than the par. Fore – Sort of like yelling “heads up” in gym class, this word alerts other golfers a badly hit ball is heading their way. Hole-in-One – When it only takes you one shot to get the golf ball in the hole. In other words, a golfer’s dream. Mulligan – A golfer’s lucky chance to hit the ball again. Lie – No, we are not talking about you telling tales of your golf game. This word is used on the course to describe where the ball has rested. A “good lie” on the short grass or a “bad lie” on the deep grass. Three-Putt – This is said when it takes you three putts to get your golf ball in the hole. We could keep going on, but let’s leave it at that for now as not to overwhelm you. In any case, have fun using these popular golfing terms next time you are on the green. HIDEAWAY HILLS GOLF CLUB Home PLAY & STAY Events Sitemap Pocono Weddings Directions Course Tour Contact Us Facebook Instagram [email protected] (610) 681-6000 159 Golf Course Road, Kunkletown PA 18058 Directions Designed by CreativeWorks , Pocono Social Media ,  Web Design and Online Advertising Agency REQUEST A TEE TIME X Hi! Call our Pro Shop at (610) 681-6000 to request your Tee Time. We’ll be happy to hear from you! Thanks"
    },
    {
      "url": "https://mycountryhideaway.com/contact/",
      "text": "Contact - My Country Hideaway Home About Contact Guides & Tips Hobby Lifestyle Misc. Travel World Select Page Hello! Don't be shy. Get in touch. Name Email Address Message Send Message Don't Miss a Beat! Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam. Success! Email Subscribe Follow Follow Follow Follow Contact Name Email Address Message Submit Address 1841 W 6th St Los Angeles, CA 90057 Email admin@mycountryhideaway.com Follow Follow Follow Follow Follow Follow Quick Links About Contact Privacy Policy NAV Lifestyle Travel Hobby Subscribe Success! Email Subscribe © 2025 - My Country Hideaway We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://www.bestofluxuryrealty.com/Fort-Myers/The-Hideaway-Country-Club-Condos-For-Sale",
      "text": "The Hideaway Country Club Condos For Sale | 20+ The Hideaway Country Club Fort Myers, FL Condos For Sale Skip to main content Sign In Register/Login with: Sign in to save favorites, get new property alerts, advanced site tools and more. * * Forgot Password? Sign Up Create An Account Instantly register with: Username * Spaces are allowed; punctuation is not allowed except for periods, hyphens, apostrophes, and underscores. E-mail address * A valid e-mail address. All e-mails from the system will be sent to this address. The e-mail address is not made public and will only be used if you wish to receive a new password or wish to receive certain news or notifications by e-mail. Lead Type - None - Registered User Southeast Florida Southeast Florida Miami-Dade County Broward County Palm Beach County Treasure Coast County Gulf Coast Florida Collier County Lee County South Florida Real Estate Search Last update 9 hours 43 mins ago https://www.bestofluxuryrealty.com Properties Nearby (For Sale, For Rent, Sold/Rented and More!) Search by City: E.g.: Aventura , Bal Harbour , Doral , South Beach , Williams Island , Ives Estates Search by Community Name/Development: E.g.: Aventura Lakes , Admirals Port , Coral Gables , Artech , Bellini on Williams Island Search by ZIP: E.g.: 33180 , 33139 , 33133 , 33160 Search by MLS#: E.g.: A10445107 , A10394383 , F10077935 , RX-10335802 Filters BUY/RENT SELL Sign In Join MAIN ABOUT About Us Join Us ADVERTISE Media Kit BUYERS Buyer Etiquette SELLERS Why List With Us? JOIN US! Current Openings Our Ideal Candidate MORE... Office Locations ACCOUNT ACTIONS Sign In Join CALL US! (888) 972-9282 Fort Myers Homes Acreage Alabama Grove Terrace Allen Court Allen Park Alpha Altamont Park Amberley Court Arborwood Preserve Argyle Subdivision Arlington Avalon Preserve Banyan Bay Banyan Cove Banyan Tree Of Ft Myers Condo Bay Harbour Estates Beachwalk Isles Bealls Subd Becklers Riverside Add Bell Tower Park Bellaire Bellaire Estates Belle Meade Belle Vue Park Bellevue Addition Bend Of Whiskey Creek Biscayne Estates Blackhawk Blvd Hts Shopping Center Botanica Lakes Boulevard Manor Bowling Green Braman Court Breezewood Brentwood Briarcliff Briarcrest Briarwood Shores Broadview Manor Brookhill Brookshire Brynwood Buckingham Buckingham Air Park East Buckingham Park Burtwood Cajuput Cove Caloosa Creek Caloosa Pointe Caloosa Trace Caloosa View Caloosa Vista Rev Plat Calusa Palms Camden Square Camelot Campbell Acres Candlewood Lake Estates Capistrano Carillon Woods Carleton Estates Carlton Grove Carriage Village Carver Gardens Casa Del Lago Casa Del Rio Catalina Isles Catalpa Cove Catalpa Pointe Cedarbend Chula Vista Chula Vista Manor 1st Addn Cinnamon Cove City View Park Coastal Estates Coastal Key Cobblestone On The Lake Coco Bay Coconut Cove Coconut Creek Coconut Grove College Park Colonial Country Club Colonial Farms Colonial Manor Colonial Pointe Colonial Shores Colonial Terrace Colonnade At Forum Colony Lakes Colony Trace Compass Pointe Coral Park Coronado Coronado Moors Cottage Point Subd Cottage Point Unrec Country Club Country Club Homes Country Estates Country Oaks Coves Of Estero Bay Cox J B Resub Cranfords Subdivision Cross Creek Estates Crown Colony Crumrine Crystal Acres Unrecorded Subdivision Crystal Lakes Cushman Manor Cypress Garden View Cypress Gardens Cypress Lake Tracts Cypress Landing Cypress Preserve Cypress Terrace Cypress Village Cypress Walk Cypress Woods Rv Resort Danforth Lakes Daniels Park Daniels Place Daniels Villas Davis Woods Condominium Dean Park Deep Lagoon Estates Del Portal Deleon Terrace Devonwood Donoghue J C Subd Donoghues 2nd Subd Eagle Lake Estates Eagle Lake Estates Replat Eagle Ridge East Stadler Farms Eastgate At San Carlos Edgemere Park Edgewood Subd Edison Park Emerald Pines Emerson Square Estero Preserve Estero Verde European Townhouse Evans Addition Fairdale Fairview Fernwalk Fiddlesticks Country Club Fiesta Village Florimond Manor Foleys Highland Park Forest Villas Forsyth Riverview Park Fort Myers Fort Myers Shores Franklin Park Ft Myers Villas Gateway Gateway Hidden Links Georgetown Gladiolus Preserve Glenboro Groves Governors Island Condo Gracious Homes Subd Granada Terrace Green Acres Greenwood Villas Grove City Park Grove Heights Grove Shores Gulf Harbour Yacht And Country Club Gulf Hideaway Habitat Village Hamlet Hampton Lakes Hanbys J D Subd Hansons Subd Happy Bull Farms Harbor Club Harborage Harbour Castle Harbour Isle Estates Harbour Palms Harlem Heights Harold Ave Subd Harts Truck Farms Harvey Heights Unit 1 Hendry Creek Hendry Estates Heritage Cove Heritage Farms Heritage Farms Lake Addn Heritage Palms Golf And Country Club Heritage Woods Hickory Run Hidden Harbor Highland Pines Estates Hill Subdivision Holiday Condo Inc Horse Creek Houghs Elmer Subd Intracoastal Harbour Iona Gardens Iona Shores Island Park Island Park Woodlands Island Park Woods Jeffcotts John F Jenkins Unrec Johnsons Harry Poe Subd Jonathan Harbour Kapok Village Subd Kings Bay Estates Kingsbridge Kingston Manor La Chelle Manor Laguna Lakes Lake Lawn Condo Lakes At Three Oaks Lakewood Village Las Palmas Laurel Oaks Lazy Days Mobile Village Lee Plantation Legends Golf And Country Club Lehigh Acres Leisure Acres Leisure Estates Linda Loma Lindsford Lovejoy Park Lucaya Lynns Add Mackaboy Farms Magnolia Lakes Magnolia Landing Maravilla Circle Marina Bay Mccormicks Casa Del Rio Mcgregor Estates Mcgregor Gardens Mcgregor Gardens Est Mcgregor Groves Mcgregor Heights Mcgregor Isles Mcgregor Mobile Manor Mcgregor Pines Mcgregor Reserve Mcgregor Vista Mcgregor Woods Mead Villas Meade Estates Meadow Manors Meadow Vista Metes And Bounds Mirada Mirror Lakes Mission Monterey Mobilehaven Estates Unrec Morningside Morningside Addition Morse Shores Natoma Park Northside Center Not Applicable Orange Harbor Mobile Home Park Orange River Hills Orange River Ranchettes Palm Acres Palm City Park Palm Gardens Palm Terrace Palmetto Palms R V Palmetto Park Palmetto Point Palmlee Park Palms Of Mcgregor Paradise Shores Parker Lakes Parkridge Parkwoods Parkwoods Townhouse Community Paseo Pate Crest Villas 1 Pelican Preserve Peppertree Pointe Philips Creek Phillips 4th Division Pine Lakes Country Club Pine Manor Pinebrook Woods Pinehurst Addition Pinehurst Estates Pinelake Subdivision Plantation Pines Subd Plantation Preserve Plantation South Unrecorded Subdivision Poinciana Park Port San Carlos Portico Principia Province Park Rails End Rainbow Farms Rainbow Groves Reflection Isles Reflection Lakes Remington Oaks Renaissance Reserve At Buckingham Ridgeway Rindfleisch Subd Rio Vista Rio Vista Unrecorded Subdivision River By River Forest River Forest Island River Garden Condominium River Grove Estates River Oak Park River Place Condo Riverbend Riverdale Ranches Riverdale Shores Riverside Riverside Avenue Villas Rivervue Park Riviera Rookery Royal East Unit 1 Royal Palm Park Royal Woods Russel Park Sabal Palm Gardens Sail Harbour San Carlos Acres San Carlos Grove San Carlos Park San Carlos Park Golf Course Addition San Carlos Park North Addition San Carlos Park Southwest Addition San Mateo Sandalwood Estates Savona Bay Seminole Seminole Estates Seminole Park Shadow Wood Preserve Shady River Park Subd Shallows Shenandoah Shriver Somerset Townhomes South Gate South Point Subd South Pointe South Pointe South South Pointe Villas Condo Southwind Subdivision Stadlers Central Heights Stonebridge North Stonebridge South Stoneybrook Stuart Subdivision Suburban Ranchettes Unrec Suburbia Summerlin Place Summerwood Sunnycrest Sunset Cove Sunset Vista Swan Lake South Tahitian Shores Tamiami Terrace Tanglewood Ten Mile Anchorage Terra Palma Terra Palma Oaks The Colony The Forest The Forum The Landings The Plantation The River The Villas At Causeway Key The Vines Three Oaks Thunderbird Mobile Homes Tidewater Island Timber Lake Timber Ridge Timber Run Subd Timbers Town And River Townhomes Of San Simeon Trailwinds Travers And Hendrys Subd Trevi Tropical Cove Twin Palm Estates Underwood Subd Unity Heights Valencia Court Valencia Terrace Venetian Pointe Venetian Village Verandah Veridian Victoria Cove Condo Villa Pines Villa South Waldens Riviera Estates Watermark Waterway Bay Waterway Shores Wellington Westbrook Westwood Acres Westwood Place Whiskey Creek Whiskey Creek Subdivision Whiskey Creek Terrace Whisperwood Townhouse Wildcat Farms Wildwood Addition Will Way Willow Brook Farms Willows Winkler Estates Wonderling Park Woodbridge Preserve Woodford Park Woodgate Estates York Manor Zehner Villas Fort Myers Condos Alta Mar Ascot Condo Beachwalk Beau Rivage Bella Casa Bellasol Caloosa Bayview Club At Crystal Lake Condominium College Pointe Compass Point Condo Creekside Preserve Cross Creek Country Club Cypress Keep Condo Cypress Lake Country Club Cypress Lake Estates Cypress Lake Gardens Condo Cypress Lakes Manor South Eagle Ridge Lakes Enclave Forest Lake Townhomes Gardens At Beachwalk Golfside Greengate Heritage Pointe Hidden Gardens Hidden Harbour One Condo High Point Place Island Park Village Jonathans Bay Kelly Greens Golf And Country Club Lakeridge Lakeside Vista Lexington Country Club Lockwood Terrace Condo Majestic Palms Mandolin Bay Marbella On Cypress Mastique Matera Mcgregor Village Condo Musa At Daniels Myerlee Myerlee Circle Condo Myerlee Esquire Courts Condo Myerlee Gardens Condo New Approach Newport Glen Oasis Osprey Cove Palm Beach Landings Palmetto Cove Pine Grove Townhouses Pine Ridge Of Fort Myers Village Pinebrook Lakes Condo Pointe Royale Portofino Prentiss Pointe Provincetown Punta Rassa Reflection Key Regency Condo Renaissance Village Riva Del Lago Riverside Club Riverwalk Cove Sand Trap Villas Condo Sanibel Harbour Tower Condo Sanibel View Condo Seven Lakes Stratford Place Condo Summerlin Trace Condo Summerlin Village Condo Summerlin Woods Terraces At Riverwalk Terraverde Country Club The Cove At Six Mile The Oaks At Whiskey Creek The Park At Lakewood The Residence The Village The Villas At Venezia Timberwalk Timberwood Village Tortuga Tuscany Gardens Venetian Palms Villa Medici Village Of Stoneybrook Whispering Palms Whispering Pines - Select a City - Aventura (1,276) ↳ Williams Island (107) Bal Harbour (157) Bay Harbor Islands (169) Biscayne Gardens (0) Biscayne Park (31) Coconut Grove (56) Coral Gables (383) Cutler Bay (271) Doral (556) El Portal (25) Fisher Island (4) Golden Beach (28) Hialeah (776) Hialeah Gardens (0) Homestead (1,464) Indian Creek Village (0) Ives Estates (27) Kendall (6) Key Biscayne (172) Medley (2) Miami (6,378) ↳ Brickell (945) ↳ Brickell Key (117) ↳ Design District (36) ↳ Downtown (2) ↳ Edgewater (470) ↳ Midtown (118) ↳ Upper Eastside (73) ↳ Wynwood (27) Miami Beach (1,775) ↳ Mid-Beach (156) ↳ North Beach - NoBe (107) ↳ South Beach (237) ↳ South Beach - SoFi (85) Miami Gardens (385) Miami Lakes (114) Miami Shores (91) Miami Springs (0) North Bay Village (177) North Miami (405) North Miami Beach (358) ↳ Eastern Shores (46) Ojus (111) Palmetto Bay (183) Pinecrest (163) South Miami (67) Sunny Isles Beach (1,244) Surfside (144) Virginia Gardens (0) West Miami (0) Coconut Creek (596) Cooper City (158) Coral Springs (879) Dania Beach (277) Davie (596) Deerfield Beach (1,189) Fort Lauderdale (2,669) ↳ Beach Area (560) ↳ Downtown (111) ↳ North Fort Lauderdale (0) ↳ South Fort Lauderdale (2) Hallandale Beach (1,195) ↳ Hallandale (988) Hillsboro Beach (116) Hollywood (2,060) Lauderdale By The Sea (155) Lauderdale Lakes (418) Lauderhill (716) Lighthouse Point (249) Margate (539) Miramar (572) North Lauderdale (198) Oakland Park (481) Parkland (249) Pembroke Park (11) Pembroke Pines (1,140) Plantation (613) Pompano Beach (1,748) Sea Ranch Lakes (5) Southwest Ranches (103) Sunrise (865) Tamarac (864) West Park (62) Weston (422) Wilton Manors (212) Atlantis (61) Boca Raton (4,332) Boynton Beach (3,207) Delray Beach (3,447) Greenacres (694) Gulf Stream (13) Haverhill (26) Highland Beach (306) Hypoluxo (122) Juno Beach (228) Jupiter (1,631) Jupiter Inlet Colony (18) Lake Park (120) Lake Worth (1,824) Lantana (183) Loxahatchee (372) Manalapan (27) North Palm Beach (506) Ocean Ridge (84) Palm Beach (544) Palm Beach Gardens (1,766) Palm Springs (260) Riviera Beach (403) Royal Palm Beach (517) Singer Island (300) South Palm Beach (146) Tequesta (250) Village of Golf (0) Wellington (1,076) West Palm Beach (3,928) Alva (150) Boca Grande (0) Bokeelia (102) Bonita Springs (1,132) Cape Coral (3,230) Captiva (92) Estero (735) Fort Myers (3,576) Fort Myers Beach (550) Lehigh Acres (1,900) Matlacha (36) North Fort Myers (701) Sanibel (349) St. James City (155) Ave Maria (223) Goodland (0) Immokalee (9) Marco Island (613) Naples (5,768) Fort Pierce (1,704) Hobe Sound (315) Hutchinson Island (242) Jensen Beach (406) Jupiter Island (0) Ocean Breeze (0) Palm City (561) Port Saint Lucie (1,779) Port Salerno (0) Sewall's Point (0) Stuart (1,265) Vero Beach (1,215) SOUTHEAST: Miami-Dade Aventura Williams Island Bal Harbour Bay Harbor Islands Biscayne Gardens Biscayne Park Coconut Grove Coral Gables Cutler Bay Doral El Portal Fisher Island Golden Beach Hialeah Hialeah Gardens Homestead Indian Creek Village Ives Estates Kendall Key Biscayne Medley Miami Brickell Brickell Key Design District Downtown Edgewater Midtown Upper Eastside Wynwood Miami Beach Mid-Beach North Beach - NoBe South Beach South Beach - SoFi Miami Gardens Miami Lakes Miami Shores Miami Springs North Bay Village North Miami North Miami Beach Eastern Shores Ojus Palmetto Bay Pinecrest South Miami Sunny Isles Beach Surfside Virginia Gardens West Miami Broward Coconut Creek Cooper City Coral Springs Dania Beach Davie Deerfield Beach Fort Lauderdale Beach Area Downtown North Fort Lauderdale South Fort Lauderdale Hallandale Beach Hallandale Hillsboro Beach Hollywood Lauderdale By The Sea Lauderdale Lakes Lauderhill Lighthouse Point Margate Miramar North Lauderdale Oakland Park Parkland Pembroke Park Pembroke Pines Plantation Pompano Beach Sea Ranch Lakes Southwest Ranches Sunrise Tamarac West Park Weston Wilton Manors Palm Beach Atlantis Boca Raton Boynton Beach Delray Beach Greenacres Gulf Stream Haverhill Highland Beach Hypoluxo Juno Beach Jupiter Jupiter Inlet Colony Lake Park Lake Worth Lantana Loxahatchee Manalapan North Palm Beach Ocean Ridge Palm Beach Palm Beach Gardens Palm Springs Riviera Beach Royal Palm Beach Singer Island South Palm Beach Tequesta Village of Golf Wellington West Palm Beach Treasure Coast Fort Pierce Hobe Sound Hutchinson Island Jensen Beach Jupiter Island Ocean Breeze Palm City Port Saint Lucie Port Salerno Sewall's Point Stuart Vero Beach GULF COAST: Collier Ave Maria Goodland Immokalee Marco Island Naples Lee Alva Boca Grande Bokeelia Bonita Springs Cape Coral Captiva Estero Fort Myers Fort Myers Beach Lehigh Acres Matlacha North Fort Myers Sanibel St. James City Home > Fort Myers > The Hideaway Country Club Condos For Sale | 20+ The Hideaway Country Club Fort Myers, FL Condos For Sale The Hideaway Country Club Condos For Sale | 20+ The Hideaway Country Club Fort Myers, FL Condos For Sale The Hideaway Country Club Condos For Sale | 20+ The Hideaway Country Club Fort Myers, FL Condos For Sale 5950 Trailwinds,          Fort Myers, Florida, 33907 Stats Overview Street View For Sale Price Range $194,900 - $269,000 Median Active For Sale $232,334 / $0 PPSF Median Sold $210,744 / $0 PPSF For Rent Price Range $1,800 - $3,400 Median Active For Rent $2,617 / $0 PPSF Median Rented $0 / $0 PPSF Maintenance per Sq.Ft. $13.97/Sq.Ft. Floor Plans 813 - 1,436 Total Floors In Building N/A Market Snapshot for The Hideaway Country Club, Condo/Villa/Townhouses, residential community in Fort Myers, Florida. The Hideaway Country Club Condo/Villa/Townhouses is located at 5950 Trailwinds, Fort Myers, Florida, 33907. This residential community was built in year (N/A) and currently offering (20) Condo/Villa/Townhouses for sale in The Hideaway Country Club, with price ranges from $194,900 to $269,000. Whether you are looking for most up-to-date The Hideaway Country Club, Condo/Villa/Townhouses, residential community or another luxury development in Fort Myers, Florida to Buy or to Sell, our website will provide you with the most up-to-date luxury homes and condos for sale in the city of Fort Myers. Price, High to Low Price, Low to High Price, High to Low New Listings First Selling? Share Facebook Twitter Pinterest Telegram Alerts THINKING ABOUT SELLING? With Video & 3D Tours, properties sell up to 31% faster and at a higher price. Contact our real estate advisor today to list your property! For Sale For Rent 0 Sold, Rented & Pending Land & Boat Docks Other All ( ... ) Homes ( ... ) Villas ( ... ) Condos ( ... ) Townhouses ( ... ) By Bedroom Size (All) Studio (0) 1 Bed (0) 2 Bed (11) 3+ Bed (9) \"With 3D Tours, properties sell up to 31% faster and at a higher price\" Thinking about selling? Contact Best of Luxury Realty Advisor today for a FREE, No-Obligation Comparative Market Analysis (CMA) and information regarding Video -or- 3D Virtual Tour presentation of your property. * We are offering our Buyer Clients real-time virtual property video tours and showings by Zoom , WhatsApp , Facetime , Skype , and via FB Messenger ! A virtual office for electronic signatures, paperwork and closings. Contact our advisors for further details. 37 $269,000 Oakmont Village 5825 Trailwinds Unit 425, Fort Myers, Florida 33907 MLS#: 225045580 3 Beds 2 Baths 1,436 Sq.Ft. 0 0 Parking 1993 Built Schedule Tour Remarks: 3-bedroom 2 bathroom condo located in a premier golf course community. perfect for both relaxation and entertainment. open-concept... 32 Reduced $285,000 $259,000 Baltusrol Village 5565 Trailwinds Unit 216, Fort Myers, Florida 33907 MLS#: 225006574 2 Beds 2 Baths 1,132 Sq.Ft. 9.1% Decrease (-$26,000) 0 Parking 1985 Built Schedule Tour Remarks: Pristine one level renovated condo located with beautiful  views of 12th & 13th holes.  gorgeous kitchen with custom cabinetry & g... 40 Reduced $330,000 $258,000 Baltusrol Village 5625 Trailwinds Unit 412, Fort Myers, Florida 33907 MLS#: 224039150 3 Beds 2 Baths 1,331 Sq.Ft. 21.8% Decrease (-$72,000) 0 Parking 1984 Built Schedule Tour Remarks: Nestled within the prestigious hideaway country club, this immaculate first-floor condo offers an unrivaled blend of luxury and co... Adbutler placeholder 24 $249,900 Baltusrol Village 5585 Trailwinds Unit 314, Fort Myers, Florida 33907 MLS#: 225069137 3 Beds 2 Baths 1,187 Sq.Ft. 0 0 Parking 1985 Built Schedule Tour Remarks: Welcome to this stunning condo located in hideaway country club. this property offers 1187 sqft of living space and features 3 bed... 38 Reduced $259,000 $244,900 Greenbriar Village 5890 Trailwinds Unit 522, Fort Myers, Florida 33907 MLS#: 225021697 2 Beds 2 Baths 1,056 Sq.Ft. 5.4% Decrease (-$14,100) 0 Parking 1988 Built Schedule Tour Remarks: The pictures say it all! nicely updated 2br/2ba condo in the pet-friendly greenbriar village of hideaway golf club. hurricane glas... 23 Reduced $249,900 $240,000 Merion Village 5530 Trailwinds Unit 726, Fort Myers, Florida 33907 MLS#: 225040387 2 Beds 2 Baths 1,050 Sq.Ft. 4.0% Decrease (-$9,900) 0 Parking 1984 Built Schedule Tour Remarks: Price reduced!!! welcome to the hideaway country club. the community offers resort-style amenities, including a vibrant clubhouse,... 34 $239,990 Baltusrol Village 5665 Trailwinds Unit 615, Fort Myers, Florida 33907 MLS#: 2025003640 3 Beds 2 Baths 1,187 Sq.Ft. 0 0 Parking 1985 Built Schedule Tour Remarks: A hidden gem at the hideaway country club!if golf is a must, look no further—this is your dream home! welcome to the hideaway co... 7 Reduced $279,900 $239,900 Oakmont Village 5885 Trailwinds Unit 712, Fort Myers, Florida 33907 MLS#: 224070205 3 Beds 2 Baths 1,169 Sq.Ft. 14.3% Decrease (-$40,000) 0 Parking 1990 Built Schedule Tour Remarks: This is a very desirable first floor unit in one of ft myers most uniquely located gated golf course community. we have it all her... 39 Reduced $269,000 $239,000 Oakmont Village 5925 Trailwinds Unit 912, Fort Myers, Florida 33907 MLS#: 224073308 3 Beds 2 Baths 1,169 Sq.Ft. 11.2% Decrease (-$30,000) 0 Parking 1989 Built Schedule Tour Remarks: **charming condo in the heart of fort myers - golf cart included!**\r\n\r\nwelcome to the hideaway country club, where comfort meets e... 30 $230,000 Oakmont Village 5845 Trailwinds Unit 531, Fort Myers, Florida 33907 MLS#: 2025009145 3 Beds 2 Baths 1,436 Sq.Ft. 0 0 Parking 1992 Built Schedule Tour Remarks: This turnkey, move-in ready third-floor condo in the hideaway country club is a rare find. the building features an elevator—uni... 46 Reduced $244,000 $229,000 Oakmont Village 5805 Trailwinds Unit 326, Fort Myers, Florida 33907 MLS#: 225032555 2 Beds 2 Baths 1,250 Sq.Ft. 6.1% Decrease (-$15,000) 0 Parking 1994 Built Schedule Tour Remarks: Move-in ready and boasting breathtaking golf course and water views, this stunning condo at hideaway country club is the perfect b... 30 Reduced $235,900 $225,000 Greenbriar Village 5970 Trailwinds Unit 111, Fort Myers, Florida 33907 MLS#: 225024984 2 Beds 2 Baths 1,370 Sq.Ft. 4.6% Decrease (-$10,900) 0 Parking 1988 Built Schedule Tour Remarks: Welcome to this great condo with lots of privacy.  it is an end unit so lots of extra light makes this home very cheery. it is loc... 23 $224,995 Merion Village 5530 Trailwinds Unit 712, Fort Myers, Florida 33907 MLS#: 225066231 2 Beds 2 Baths 836 Sq.Ft. 0 0 Parking 1984 Built Schedule Tour Remarks: Flood zone \"x\"!!  no damage or flooding from any hurricanes!!  nestled in the heart of fort myers’ prestigious hideaway country ... 27 $219,900 Greenbriar Village 5870 Trailwinds Unit 614, Fort Myers, Florida 33907 MLS#: 225057749 2 Beds 2 Baths 813 Sq.Ft. 0 0 Parking 1988 Built Schedule Tour Remarks: Hidden gem !!!! hideaway country club. gorgeous views overlooking 8th fairway, 9th tee and lake. lots of natural light in this bea... 33 $219,900 Merion Village 5650 Trailwinds Unit 111, Fort Myers, Florida 33907 MLS#: 2025008809 2 Beds 2 Baths 1,056 Sq.Ft. 0 0 Parking 1984 Built Schedule Tour Remarks: Discover this stunning 2-bedroom, 2-bath 1st-floor corner end unit with breathtaking lake and golf course views—just steps from ... 51 Reduced $254,900 $219,900 Merion Village 5650 Trailwinds Unit 111, Fort Myers, Florida 33907 MLS#: 225010331 2 Beds 2 Baths 1,056 Sq.Ft. 13.7% Decrease (-$35,000) 0 Parking 1984 Built Schedule Tour Remarks: Discover this stunning 2-bedroom, 2-bath 1st-floor corner end unit with breathtaking lake and golf course views—just steps from ... 24 Reduced $239,000 $219,000 Baltusrol Village 5585 Trailwinds Unit 326, Fort Myers, Florida 33907 MLS#: 225016162 2 Beds 2 Baths 1,373 Sq.Ft. 8.4% Decrease (-$20,000) 0 Parking 1985 Built Schedule Tour Remarks: This beautiful 2nd floor condo is being sold turnkey. it is an end unit with lots of light with a gret golf and lake view. there i... 35 Reduced $239,900 $214,900 Oakmont Village 5765 Trailwinds Unit 115, Fort Myers, Florida 33907 MLS#: 225033939 3 Beds 2 Baths 1,436 Sq.Ft. 10.4% Decrease (-$25,000) 0 Parking 1994 Built Schedule Tour Remarks: ***new price***beautiful well sought after {d} unit...3 bedroom. 2 bath condo...oakmont/ground floor... updated kitchen... newer a... 35 Reduced $225,000 $209,500 Augusta Village 5770 Trailwinds Unit 213, Fort Myers, Florida 33907 MLS#: 225025001 2 Beds 2 Baths 1,132 Sq.Ft. 6.9% Decrease (-$15,500) 0 Parking 1986 Built Schedule Tour Remarks: Enjoy golf course views and resort-style living in this 2-bedroom, 2-bathroom first-floor condo. this active gated community offer... 35 $194,900 Oakmont Village 5905 Trailwinds Unit 816, Fort Myers, Florida 33907 MLS#: 2025005046 3 Beds 2 Baths 1,330 Sq.Ft. 0 0 Parking 1990 Built Schedule Tour Remarks: Welcome to 5905 trailwinds dr. #816 — a rare first-floor end unit in oakmont village, offering unbeatable value and breathtaking... COMMUNITY VIDEO PHOTO GALLERY FLOOR PLANS The Hideaway Country Club Subdivisions in Fort Myers, FL Augusta Village Homes (1) Baltusrol Village Homes (5) Greenbriar Village Homes (3) Merion Village Homes (4) Oakmont Subdivision Homes (0) Oakmont Village Condos (7) Other Luxury Condos in Fort Myers, FL Alta Mar (15) Ascot Condo (4) Beachwalk (6) Beau Rivage (8) Bella Casa (6) Bellasol (14) Caloosa Bayview (8) Club At Crystal Lake Condominium (13) College Pointe (11) Compass Point Condo (1) Creekside Preserve (9) Cross Creek Country Club (30) Cypress Keep Condo (5) Cypress Lake Country Club (12) Cypress Lake Estates (14) Cypress Lake Gardens Condo (7) Cypress Lakes Manor South (4) Eagle Ridge Lakes (3) Enclave (0) Forest Lake Townhomes (9) Gardens At Beachwalk (11) Golfside (1) Greengate (3) Heritage Pointe (11) Hidden Gardens (7) Hidden Harbour One Condo (4) High Point Place (17) Island Park Village (12) Jonathans Bay (6) Kelly Greens Golf And Country Club (82) Lakeridge (1) Lakeside Vista (0) Lexington Country Club (72) Lockwood Terrace Condo (0) Majestic Palms (25) Mandolin Bay (3) Marbella On Cypress (13) Mastique (11) Matera (5) Mcgregor Village Condo (3) Musa At Daniels (10) Myerlee (23) Myerlee Circle Condo (7) Myerlee Esquire Courts Condo (0) Myerlee Gardens Condo (7) New Approach (0) Newport Glen (14) Oasis (21) Osprey Cove (0) Palm Beach Landings (2) Palmetto Cove (9) Pine Grove Townhouses (4) Pine Ridge Of Fort Myers Village (20) Pinebrook Lakes Condo (4) Pointe Royale (10) Portofino (5) Prentiss Pointe (7) Provincetown (16) Punta Rassa (5) Reflection Key (3) Regency Condo (1) Renaissance Village (2) Riva Del Lago (9) Riverside Club (8) Riverwalk Cove (3) Sand Trap Villas Condo (0) Sanibel Harbour Tower Condo (8) Sanibel View Condo (7) Seven Lakes (57) Stratford Place Condo (4) Summerlin Trace Condo (6) Summerlin Village Condo (0) Summerlin Woods (16) Terraces At Riverwalk (9) Terraverde Country Club (10) The Cove At Six Mile (13) The Hideaway Country Club (20) The Oaks At Whiskey Creek (1) The Park At Lakewood (6) The Residence (21) The Village (2) The Villas At Venezia (2) Timberwalk (13) Timberwood Village (1) Tortuga (11) Tuscany Gardens (8) Venetian Palms (6) Villa Medici (7) Village Of Stoneybrook (12) Whispering Palms (1) Whispering Pines (0) View All Fort Myers Condos ( 897 ) COMMUNITY INFO The Hideaway Country Club Address: 5950 Trailwinds, Fort Myers, Florida , 33907 Total Units: 20 Price Range: $194,900 - $269,000 Rental Price Range: $1,800 - $3,400 Min price per Square Foot: $4 Max price per Square Foot: $1,350 BY THE NUMBERS Average Listing Price $231,950 Average Rental Price $2,600 Average Sold Price $220,000 Average Price per Square Foot $677 Copyright © 2005-2022 Best of Luxury Realty. Made with ❤ in Miami, Florida. All Rights Reserved. Each listing is part of Broker Reciprocity of Miami Dade, Broward, Palm Beach, Collier and Lee Counties. Not all listings found on this site are necessarily listed through Best of Luxury Realty, Corp. Privacy & Site Terms of Use DMCA Notice Website Accessibility Sitemap Subdivisions Hyperlocal Advisor We use cookies to ensure that we give you the best experience on our website. Got it!"
    }
  ]
}