{
  "fuentes": [
    {
      "url": "https://ashoreresortoceancity.com/about-us/contact-us/",
      "email": "logo-new-dark@2x.png"
    },
    {
      "url": "https://www.tidesbeachclubmaine.com/contact-us",
      "email": "dining@krcmaine.com"
    },
    {
      "url": "https://www.tidesbeachclubmaine.com/contact-us",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.tidesbeachclubmaine.com/contact-us",
      "email": "marketing@krcmaine.com"
    },
    {
      "url": "https://www.tidesbeachclubmaine.com/contact-us",
      "email": "stay@tidesbeachclubmaine.com"
    },
    {
      "url": "https://www.drtrippandassociates.com/contact",
      "email": "contact@drtrippandassociates.com"
    },
    {
      "url": "https://www.tidesbeachclubmaine.com/dining",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.tidesbeachclubmaine.com/dining",
      "email": "stay@tidesbeachclubmaine.com"
    }
  ],
  "mails": [
    "contact@drtrippandassociates.com",
    "dining@krcmaine.com",
    "forms@tambourine.com",
    "logo-new-dark@2x.png",
    "marketing@krcmaine.com",
    "stay@tidesbeachclubmaine.com"
  ],
  "nombre_sitio": "theislandfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://ashoreresortoceancity.com/about-us/contact-us/",
      "text": "Contact Us | Top Resorts near Ocean City, MD | Ashore Resort Skip to menu Skip to content Skip to footer ACCOMMODATIONS ROOMS & SUITES AMENITIES PACKAGES DINING TIDE ROOM THE TAPROOM WAHOO BEACH BAR SHORE DECK ASHORE THINGS WEDDINGS SERVICES WEDDING MENUS GALLERY REQUEST FOR PROPOSAL MEETINGS 2026 EVENT SPACE RENOVATION CONFERENCE CENTER MEETINGS SOCIAL EVENTS EVENT MENUS MEETING GALLERY FLOORPLANS & SERVICES REQUEST FOR PROPOSAL HAPPENINGS HAPPENINGS LIVE MUSIC ASHORE BEACH ABOUT US CONTACT US GALLERY BLOG EXPLORE LOCAL ATTRACTIONS GOLF COURSES BOOK NOW Main Navigation HOME ACCOMMODATIONS ROOMS & SUITES AMENITIES PACKAGES DINING DINING & NIGHTLIFE OVERVIEW SHORE DECK THE TAPROOM ASHORE THINGS TIDE ROOM WAHOO BEACH BAR WEDDINGS WEDDINGS OVERVIEW SERVICES WEDDING MENUS GALLERY REQUEST FOR PROPOSAL MEETINGS 2026 EVENT SPACE RENOVATION MEETINGS & EVENTS OVERVIEW CONFERENCE CENTER MEETINGS SOCIAL EVENTS EVENT MENUS MEETING GALLERY FLOORPLANS & SERVICES REQUEST FOR PROPOSAL EXPLORE EXPLORE OVERVIEW POOL EXPERIENCE LOCAL ATTRACTIONS LIVE MUSIC GOLF COURSES HAPPENINGS HAPPENINGS OVERVIEW HAPPENINGS LIVE MUSIC ABOUT US ABOUT US OVERVIEW CONTACT US GALLERY BLOG BOOK NOW BOOK NOW CONTACT US Get in Touch Questions about your reservation or upcoming trip to Ocean City, Maryland? Please get in touch via our contact form or other contact methods, listed below. Name (Required) First Last Phone (Required) Email (Required) Address (Required) Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Please briefly tell us how we can assist you below & someone from our team will be in touch soon! (Required) 10100 Coastal Highway Ocean City, MD 21842 410-524-3535 Facebook Instagram ACCOMMODATIONS DINING & NIGHTLIFE WEDDINGS MEETINGS & EVENTS EXPLORE ABOUT US VIEW OR CHANGE RESERVATION Stay In Touch Enter your email to get updates and the latest deals Email (Required) PRIVACY POLICY | ACCESSIBILITY ADVICE | SITEMAP This website uses cookies to improve your experience. By continuing to use this site, you agree to our use of cookies. View Privacy Policy Resort Website by O'Rourke 410-524-3535 Book Now X MAKE A RESERVATION Rooms 1 2 3 4 5 Adults 1 2 3 4 5 Children 1 2 3 4"
    },
    {
      "url": "https://www.tidesbeachclubmaine.com/contact-us",
      "text": "Contact Us | Tides Beach Club Skip to Content Tides Beach Club Accommodations The Hotel Dining TBC Restaurant Our Menus Dining Events Offers All Offers Enhancements Explore Overview Weddings Gallery Book Now Contact Us Contact Us Let’s Chat We’re here to help you plan a memorable Kennebunkport vacation! If there’s anything we can help with prior to your arrival, please let us know. The Tides Beach Club 930 Kings Highway Kennebunkport, ME 04046 800-572-8696 Ask Us Anything Get in touch with our team using the form below. Thank you for reaching out! A staff member will be with you shortly. First Name * Last Name * Email Address * Phone Number Reason for Inquiry Hotel Restaurant Message Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit KEEP IN TOUCH Thank you for your interest. Hidden Field First Name Last Name Email Address ZIP Code Privacy Policy agreement I have read and agree to the Privacy Policy . By submitting your information, you are opting in to receive information on promotions, events and dining specials from The Tides Beach Club and the Kennebunkport Resort Collection. Submit Tides Beach Club Tides Beach Club 930 Kings Highway Kennebunkport, Maine                        04046 800-572-8696 stay@tidesbeachclubmaine.com facebook instagram tripadvisor pinterest Contact Us Press & Accolades Careers Gift Cards Ocean Ave Magazine Live Webcam FAQ Blog Tides Beach Club 2025. All Rights Reserved Privacy Policy Accessibility Hotel Policies Guest Safety Sitemap Consent Preferences Hotel Web Design by close"
    },
    {
      "url": "https://www.drtrippandassociates.com/contact",
      "text": "Contact Us | Dr. Tripp & Associates - Licensed Therapists Near You If you or a loved one is experiencing a crisis please call 911 or 988 for local crisis intervention. More Resources About How it works Therapy Resources Find My Provider Client Portal Therapist Jobs Get Matched Close Get Matched en en es ht Reach Out for Support, Ideas, or Press Inquiries Contact Dr. Tripp & Associates You can also visit FAQ Please select type of contact I am a client and I need support I am a therapist interested in joining or a current applicant I have a question about the service I have a billing related question I have a press-related question I have a business-related inquiry First Name Last Name Email Your message By clicking \"Submit\" you agree to the processing of your persoanl information for the purpose of responding to this inquiry. For information about how we use and retain your information, please see Privacy Policy and Terms of Use. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Dr. Tripp and Associates Locations Port Saint Lucie 540 NW University Blvd Suite 204 Port St. Lucie, FL 34986 West Palm Beach 2054 Vista Parkway Suite 400 | Office #433 West Palm Beach, FL33411 Fort Lauderdale 7901 SW 6 th Ct Office 350 | Suite 312 Plantation, FL 33324 contact@drtrippandassociates.com Subscribe Join a our mission to improve mental health for all communities. Keep up to date with tips, insights, and news. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Company About How it works Therapy Room Reviews Contact FAQ Therapy Couples Therapy Stress and anxiety Depression Teen Therapy Finding Purpose Contacts Port St Lucie: 540 NW University Dr. Suite 204, Port Saint Lucie, FL 34986 West Palm Beach: 2054 Vista Parkway, Suite 400, Office #433, West Palm Beach, FL 33411 â â Fort Lauderdale: 7901 SW 6th Ct. Office 350, Suite 312, Plantation, FL 33324 (772) 494-7770 Privacy Policy Â©2025 Dr. Tripp and Associates. Site by Telemaque Group"
    },
    {
      "url": "https://www.tidesbeachclubmaine.com/dining",
      "text": "The Tides Beach Club Restaurant | Tides Beach Club Skip to Content Tides Beach Club Accommodations The Hotel Dining TBC Restaurant Our Menus Dining Events Offers All Offers Enhancements Explore Overview Weddings Gallery Book Now Dining Overview Dining Events Menus The Tides Beach Club Restaurant Wine & Dine With Us Savor fresh Maine seafood and a vibrant dining atmosphere at The Tides Beach Club Restaurant, offering delicious local flavors to satisfy every taste. Open seven days a week during the summer, this charming restaurant includes a beautiful beachside porch with awe-inspiring views of the water. Our Menu Our Restaurant The Cuisine The Tides Beach Club features a menu of classic seaside fare, including fresh fish paired with lemon risotto, Maine lobster chowder, clam fritters, and refreshing tomato and burrata salad. Our Restaurant Happy Hour There’s nothing like an ice-cold cocktail in the New England summer sun. Whether it’s fried artichokes or a chilled glass of white wine, join us from 3 pm to 5 pm for the best value on sips and small bites during Happy Hour. 0 1 Our Hours Dinner: Daily , 11:30AM-9PM Lunch: Saturdays + Sundays, 11:30AM-3PM Happy Hour: Daily, 3-5PM Live Entertainment: Sundays, 3-5PM *Please note: Parking at The Tides Beach Club is for hotel guests only. Guests dining at the restaurant will need to pay for Goose Rocks Beach Parking Dining Reservations Our KRC hotel guests receive exclusive access to dining reservations at our Kennebunkport Resort Collection restaurants . Contact us at stay@tidesbeachclubmaine.com for assistance in securing advance reservations at most of our unique restaurants. Please note: The Boathouse Restaurant and The Dory do not take reservations. Recent Awards Open Table Diners’ Choice Award 2024 Winner Flavors of Kennebunkport Resort Collection Fresh Flavors 0 1 2 3 4 5 6 KEEP IN TOUCH Thank you for your interest. Hidden Field First Name Last Name Email Address ZIP Code Privacy Policy agreement I have read and agree to the Privacy Policy . By submitting your information, you are opting in to receive information on promotions, events and dining specials from The Tides Beach Club and the Kennebunkport Resort Collection. Submit Tides Beach Club Tides Beach Club 930 Kings Highway Kennebunkport, Maine                        04046 800-572-8696 stay@tidesbeachclubmaine.com facebook instagram tripadvisor pinterest Contact Us Press & Accolades Careers Gift Cards Ocean Ave Magazine Live Webcam FAQ Blog Tides Beach Club 2025. All Rights Reserved Privacy Policy Accessibility Hotel Policies Guest Safety Sitemap Consent Preferences Hotel Web Design by close"
    }
  ]
}