{
  "fuentes": [
    {
      "url": "https://www.thelodgevegas.com/",
      "email": "corporate@thelodgevegas.com"
    },
    {
      "url": "https://oasisbiobloom.com/",
      "email": "care@oasisbiobloom.com"
    },
    {
      "url": "https://antimonopoly.ca/about-us/",
      "email": "gillian@forwardcreative.ca"
    },
    {
      "url": "https://www.bittingsrx.com/",
      "email": "info@bittingsrx.com"
    },
    {
      "url": "https://monopolydreams.com.au/contactus/",
      "email": "contact@monopolydreams.com.au"
    },
    {
      "url": "https://monopolydreams.com.au/contactus/",
      "email": "parties@monopolydreams.com.au"
    },
    {
      "url": "https://monopolydreams.com.au/contactus/",
      "email": "simon.hall@monopolydreams.com.au"
    },
    {
      "url": "https://naples.floridaweekly.com/articles/sip-undercover/",
      "email": "carlie.admire@floridaweekly.com"
    },
    {
      "url": "https://naples.floridaweekly.com/articles/sip-undercover/",
      "email": "jdickerson@floridaweekly.com"
    },
    {
      "url": "https://bonitasprings.floridaweekly.com/articles/sip-undercover/",
      "email": "carlie.admire@floridaweekly.com"
    },
    {
      "url": "https://bonitasprings.floridaweekly.com/articles/sip-undercover/",
      "email": "jdickerson@floridaweekly.com"
    }
  ],
  "mails": [
    "care@oasisbiobloom.com",
    "carlie.admire@floridaweekly.com",
    "contact@monopolydreams.com.au",
    "corporate@thelodgevegas.com",
    "gillian@forwardcreative.ca",
    "info@bittingsrx.com",
    "jdickerson@floridaweekly.com",
    "parties@monopolydreams.com.au",
    "simon.hall@monopolydreams.com.au"
  ],
  "nombre_sitio": "thelodgeocala.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.thelodgevegas.com/",
      "text": "The Lodge | Tavern top of page Home Menu Events Locations Contact Us Job Opportunities More Use tab to navigate through the menu items. 1/8 About About Us Your Neighborhood Bar & Grill At The Lodge, we're passionate about bringing people together for great food, drinks, and gaming. Our menu features classic bar and grill favorites, as well as classic dishes and craft cocktails. Whether you're stopping by for happy hour with coworkers, or watching the big game with friends, we've got you covered. Our friendly staff and welcoming atmosphere makes The Lodge your go-to spot in Las Vegas. What's On Best Gaming In Town Happy Hour ​​ Any Specialty Cocktail ...$8 (no substitution or modification during Happy Hour) Pint of Domestic Beer ...$5.75 House Wine ...$5.50 $5 Daily Beer Special (Limited Time Only) Available Monday through Thursday 3 p.m. to 6 p.m. & 12 a.m. to 2 a.m. Every Day Special Half off All Pizza​​ (available at Blue Diamond, Decatur, St. Rose and Stephanie locations only) $10 Free Be a Lodge Rewards Member and Claim Your $10 in Free Plays! Ask Your Bartender For Details Management Reserves All Rights The Lodge Game Day Menu Specials Available during NFL and Vegas Golden Knights games only. ​ Private Events Book Your Next Event With Us! You Bring the Party and We Do the Rest! Please inquire at Corporate@thelodgevegas.com Come Visit Us Locations On Map Contact ​ Corporate@thelodgevegas.com P: 702-360-3777 F: 702-360-2742 3399 S Durango Dr Ste 105 Las Vegas, NV, 89117 Join the Club & Get Updates on Special Events Email Subscribe Thanks for subscribing! Opening Hours Mon - Fri: 24hrs ​​Sat - Sun: 24hrs ​ Designed by Digital Minds LV bottom of page"
    },
    {
      "url": "https://oasisbiobloom.com/",
      "text": "Top PCD Pharma Company in India | Oasis Bio Bloom Close Home All Products Form Tablets Capsules Syrup Suspension Injection Cream Ointment Gel Drops Theraputic NSAID'S ANTIBIOTICS ALKALIZER ANTI HELMINTIC ANTI HELMINTIC LAXATIVES ANTI-MALARIA ANTIALLERGIC ANTIFUNGAL ANTI-INFECTIVE Packaging Alu Alu Blister Alu Strip Franchise Latest News About Us Career FAQs Contact Us Search for: Request Call Close Home All Poducts Franchise Our Networks Pharma Franchise in Andhra Pradesh Pharma Franchise in Bihar Pharma Franchise in Karnataka Pharma Franchise in Gujarat Pharma Franchise in Maharashtra Pharma Franchise in Chandigarh Pharma Franchise in Tamil Nadu Pharma Franchise in Uttar Pradesh Pharma Franchise in Panchkula Pharma Franchise in Bangalore Pharma Franchise in Uttarakhand Pharma Franchise in Haryana Pharma Franchise in Mumbai Latest News About Us Career FAQs Contact Us Search for: Request Call Top PCD Pharma Company in India Join forces with India’s most reliable PCD Company in India (Pharma Franchise) Contribute towards strengthening the pharma sector in India by teaming up with Oasis Bio Bloom, the best PCD Pharma Company in India. With a wide spectrum of products under different divisions, we help to kickstart your work as a pharma franchise holder at a nominal investment. Get in touch today to understand the process! Send Enquiry Download Price List 30+ Years Experience   ★    500+ Products   ★    Multi Division Farma Company   ★    Pan India Coverage    ★    WHO Certified Welcome to Oasis Bio Bloom One of the Best PCD Franchise Companies in India Opening Growth Opportunities For Pharma Enthusiasts With a long-stretch experience of 30 years, Oasis Bio Bloom has earned a reputation for being the best PCD company in India, providing PCD pharma franchises that offer high-quality, affordable medicines along with exceptional marketing support and exclusive territorial rights to its partners. As a PCD company (Propaganda cum Distribution) we connect with adept individuals and distributors and provide them with marketing and distribution rights to sell a range of pharmaceuticals we deal in. As a trusted PCD franchise company in India, we ensure that our gamut of products is manufactured adhering to the strictest quality standards and fulfill industry benchmarks in formulation, composition, and packaging. Not to mention, we have a team of quality inspectors who keep a consistent check on the quality of pharma products and ensure that the efficacy of these products remains preserved throughout the logistical course. Get in touch today to become our franchise partner. Why Choose Oasis Bio Bloom We have 500+ Pharma products and the best franchises supported by marketing tools to back our customers. Learn more Unrivaled Quality & Compliance Extensive Product Range Innovative Digital Solutions Competitive Pricing & Comprehensive Support Become a part of our Multi-Divisional Pharma Franchise With Oasis Bio Bloom, get your hands on the range of products across multiple divisions that include general medicine, skincare, nutraceuticals, and more. What’s more, you ask? You get comprehensive marketing support, sales advice, and the freedom to run your business your way. Get in touch today to let your pharma dreams score higher! View All We can beat any competition with best pharma products and quality services. Product Glossary Download Product List Explore Our Products LACTLOM Packing : 100ml Category : General MRP : ₹129.15 Get a Quote LEVOFIZ-M Packing : 60ml Category : Pediatric MRP : ₹90.00 Get a Quote LIVBOM Packing : 200ml Category : General MRP : ₹175.00 Get a Quote LYCOASIS Packing : 200ml Category : General MRP : ₹175.00 Get a Quote MULTILOM Packing : 200ml Category : General MRP : ₹155.00 Get a Quote SISZYM Packing : 10*10 Category : General MRP : ₹650.00 Get a Quote Our Success Stories One of the best PCD pharma franchise in India . On time delivery and affordable price.Thank You Oasis Bio Bloom for your best services always. Manpreet Kaur - Delhi Oasis Bio Bloom is an excellent PCD pharma company. Orders are handled promptly and at great prices. I highly recommend them for anyone in need of reliable pharmaceutical solutions! Tarun Singla - Patna I placed an order for some antibiotics and the package which I received was of very good quality. They have a wide range of medicines and nice packaging. I admire their services! Aᴄʜᴜ_ 10 - Thiruvananthapuram We  joined Oasis Bio Bloom Group of compnay in 2024, We are very satisfied with our company and we must say Oasis Bio Bloom is one of the finest companies in India. Rasam Marya - Bikaner How to get started? Joining the best PCD Pharma Company is no sweat. Becoming the franchise partner with the best PCD pharma company in India, Oasis Bio Bloom, is as easy as 1.2.3. Here’s what you need to do! Choose your products: Select from our product range depending on your region’s most demanded pharmaceutical products. Sign the agreement: Secure your PCD pharma franchise by completing a simple franchise agreement. Start selling: Begin selling and promoting your chosen products. Get marketing assistance and territorial rights from our company. View All Why choose us as your PCD Pharma Franchise Company in India? As you stand on the threshold of embarking in the pharma industry, know that you’re not alone. Among the PCD pharma franchise companies in India, Oasis Bio Bloom emerges as a top choice. Want to know what makes us the top-most choice for PCD Pharma Companies in India? Here’s how: Extensive Range of Products We have over 500+ products in our inventory letting our franchise partners experiment and sell what’s high in demand. Impressive Profit Margins As a PCD pharma franchise company in India, we value the time and efforts of our franchise partners and ensure they get great returns and profit margins. One business to another! All-inclusive Support Whether you’re new to the realm of PCD pharma franchise or are a seasoned professional, expect to have expert advice, support, and motivation to excel. Less Investment, More Profits Do you know what makes us one of the top pharma PCD companies in India? Our low-cost franchise model, coupled with high-quality products and robust marketing support, ensures maximum returns on minimal investment. View All Get a Monopoly Based Franchise From India’s Leading Pharmaceutical Company We at Oasis Bio Bloom are committed to upsurging access to superior quality healthcare products by producing, marketing, and promoting cost-effective pharmaceutical products in India. We have a well-designed program to offer a Pharma franchise to our customer base. Read more Commence Your Own Business Today With Complete Pharma Distributorship! At Oasis Bio Bloom, our dedicated teams are focused on delivering high-quality and reasonably priced products to customers. We back all these by offering pharma franchises and distributorship to our franchise partners, along with professional customer services. So, if you are thinking of a pharma franchise or distributorship, you should think about Oasis Bio Bloom. We are exceptionally positioned to serve as the pharma industry’s ideal strategic partner Frequently asked questions if any of the questions or queries are still left How does your PCD pharma company work? At Oasis Bio Bloom, we have a big network with pharmaceutical giants that gives us the ease of sourcing high-quality pharma products at good margins. When someone signs our franchise agreement, we give them the rights to distribute and sell products in their area, ensuring full control over the market. What are the prerequisites for becoming a franchise partner? Prior experience in handling or selling pharmaceutical products may be good, but not mandatory. Other than this, you should have a suitable storage capacity to store products. Last but not least, you must have initial investment and working capital to begin. Do you ask the franchise partners to meet targets? No, we do not ask franchise partners to meet specific targets. We believe in supporting our partners and allowing them to run the business at their own pace. See more Oasis Bio Bloom is one of the leading Pharmaceutical Franchise Companies in Chandigarh, India providing cost-effective Pharma Franchises across entire India. Why are Pharma Franchise Companies More Successful Compared to other Independent businesses? Do you want to know the success reasons of Pharma Franchise in India? The following blog consists of all the… Read more Top 11 PCD Pharma Franchise Companies in Haryana Haryana is a state in the northern part of India that boasts a successful pharmaceutical industry. It is the best… Read more How to start a PCD Pharma Franchise in Chandigarh? With Chandigarh emerging as a pharmaceutical hub, you might be wondering how to start a PCD Pharma Franchise in Chandigarh.… Read more Partner with Oasis Bio Bloom Today Ready to grow with Oasis Bio Bloom? Start your journey now. Your success in the healthcare industry starts here. partner with us Profession Distributor Doctor Chemist Drugist Wholesaler Submit Explore Franchise opportunities Request a call back and take a step toward multitude of opportunities. Request Call Looking into the future of healthcare Quick Contact Home About Us Products FAQs Career Franchise Blogs Contact Us Our Networks Pharma Franchise in Andhra Pradesh Pharma Franchise in Bihar Pharma Franchise in Karnataka Pharma Franchise in Gujarat Pharma Franchise in Maharashtra Pharma Franchise in Chandigarh Pharma Franchise in Tamil Nadu Pharma Franchise in Uttar Pradesh Pharma Franchise in Panchkula Pharma Franchise in Baddi Pharma Franchise in Kolkata Pharma Franchise in Kerala Pharma Franchise in Rajasthan Pharma Franchise in Himachal Pradesh Pharma Franchise in Jammu & Kashmir Pharma Franchise in Telangana Pharma Franchise in Hyderabad Contact us Plot no 62, Industrial Area, Phase 2, Panchkula, Haryana 134113 India Cabin - 1, Second Floor, M. Market, SCF 265, Sector 13, Chandigarh,160101 Phone : +91-9855662220 Phone : +91-9780184233 Email : care@oasisbiobloom.com Business Hours: Mon-Sat: 9AM to 6PM Privacy Policy Terms & Conditions Return & Refund Policy Copyright ©2025 Oasis Biobloom All rights reserved. Download Price list Thanks for your interest in our services. Let us know when we should reach you out. Name * Phone Number * Do you have Drug Licence? * Select... Yes No City * Profession Submit Request a call back Thanks for your interest in our services. Let us know when we should reach you out. Name* Phone No * Availablity* Do you have Drug Licence ? * Select... Yes No Message * Submit What to join our team? Currently we are not hiring but Thanks you for interest please submit your resume we will surely track and keep you posted. Full Name * Email * Phone No * Upload Resume Upload a file or drag and drop. jpg, jpeg, jpe, pdf\nup to 2MB Submit })"
    },
    {
      "url": "https://antimonopoly.ca/about-us/",
      "text": "About Us - Canadian Anti-Monopoly Project Skip to content Facebook Twitter Linkedin Instagram Envelope Generic selectors Exact matches only Search in title Search in content Post Type Selectors Home About Us About CAMP Contact Careers Events Programs Publications In the News Print Audio Visual Newsletters Home About Us About CAMP Contact Careers Events Programs Publications In the News Print Audio Visual Newsletters DONATE About Us The Canadian Anti-Monopoly Project (CAMP) is a think tank dedicated to addressing the issues caused by monopoly power in Canada. CAMP produces research and advocates for policy to make Canada’s economy more fair, free, and democratic. Team Keldon Bester Keldon is the Executive Director of CAMP, and a Fellow at the Centre for International Governance Innovation (CIGI). Keldon has worked as a Special Advisor at the Competition Bureau, and as a Fellow at the Open Markets Institute. Curtis mccord Curtis is a Policy Analyst at CAMP. Curtis is a researcher and analyst with a doctorate from the University of Toronto. His work explores the intersection of technology and democracy, investigating how digital systems can consolidate power and limit freedoms, while uncovering the ways civic tech can foster community power and democratic engagement. Fellows Kareem kudus Kareem Kudus a Director at Generation Squeeze and a PhD candidate at the University of Toronto where he studies the applications of AI in the medical field. Kareem previously worked in finance, where he spent time at a startup and multiple trading floors across North America. Emily osborne Emily Osborne is a Researcher at the Centre for International Governance Innovation (CIGI), where her work focuses on benefit-sharing mechanisms for advanced AI systems. Emily holds a Master of Public Policy and a Bachelor of Arts and Science from McMaster University. Her commentary has appeared in The Globe and Mail and Tech Policy Press. Andrew paulley Andrew is a PhD student in economics at the University of Toronto and holds degrees in economics and computer science from the University of Western Ontario, as well as a master’s of philosophy in economics at the University of Oxford. Andrew’s research focuses on the profitability and concentration of Canadian industries, including the auto insurance industry. sebastian tansil Sebastian is an economist, journalist, and housing advocate with the Kensington Market Community Land Trust. He began his career in the public service before moving to economic consulting, where he worked in the Brattle Group’s  competition and antitrust practice. Sebastian views research as community organizing and is committed to advancing systemic change through stronger local engagement. rachel wasserman Rachel is a corporate and commercial lawyer, with experience at two of Canada’s most prestigious law firms. Rachel began her career in marketing for global consumer goods companies and has spent time working in investment banking. Rachel is an advocate for small and medium-sized businesses and creating a more sustainable and robust economy that works for all. Board of Directors Andrew Cameron Andrew Cameron is a co-founder of CAMP, founder of the Center for Small Town Success, and host of the podcast Monopolies Killed My Hometown. Andrew is the Vice President of Northumberland Properties, a business he founded with his father in 2010. Robin Shaban Robin Shaban is a co-founder of CAMP, a Partner at 2R Strategy , and a fellow at both the Public Policy Forum and Social Capital Partners. They were named a winner of the Globe and Mail’s Report on Business 2021 Changemakers award and are a former officer of the Competition Bureau. alia lachana Alia Lachana is a strategic partnerships and innovation executive focused on building resilient communities through equitable access to technology and economic opportunity. Alia is committed to developing solutions that decentralize control and strengthen local capacity. jon Shell Jon Shell is Chair of Social Capital Partners (SCP), an independently funded non-profit building a more resilient economy through broad-based ownership and quality employment. Jon is also a co-founder of the Canadian Employee Ownership Coalition and the Save Small Business campaign. sarah stuewe Sarah Stuewe is Associate Director, Philanthropy and Investor Relations at Windmill Microlending, a nonprofit organization that empowers skilled newcomers to Canada through affordable lending. With over 15 years of experience in fundraising and relationship management, Sarah has raised millions for charities across the globe. Advisory Board Vass bednar Vass Bednar is the Executive Director of McMaster University’s MPP in Digital Society program (on leave), Senior Fellow at the Centre for International Governance Innovation, and a Fellow at the Public Policy Forum. Her work focuses on the intersection(s) between public policy and technology, and writes frequently in her popular newsletter “regs to riches,” as well as the Financial Post and Globe and Mail. barry lynn Barry C. Lynn is the executive director of the Open Markets Institute. Over the past two decades, he pioneered understanding of how the monopolies of the 21st century threaten our democracy, individual liberties, security, and prosperity. Lynn’s efforts to update anti-monopoly law and thinking for the digital era have been fully embraced by the Biden administration and have shaped the thinking of policymakers and scholars around the world. michelle meagher Michelle Meagher is a competition lawyer, Senior Fellow at SOMO and co-founder of the Balanced Economy Project, an international anti-monopoly alliance.  She is author of Competition is Killing Us: How Big Business is Harming Our Society and Planet – and What to Do About It (Penguin, 2020), a Financial Times Best Book of the Year.  She is a Senior Policy Fellow at the University College London Centre for Law, Economics and Society Tim Wu Tim Wu is the Julius Silver Professor of Law, Science and Technology at Columbia Law School. Tim served as Special Assistant to the President for Technology and Competition Policy in the Biden White House and is the author of a number of books on competition and monopoly including The Curse of Bigness (2018), The Attention Merchants (2016) and The Master Switch (2010). Our Supporters Independence As a non-profit think tank, CAMP relies on donations, grants, and gifts from individuals and organizations aligned with our vision to support our work. CAMP’s work will always be driven by the fight against monopoly and for a more fair, free, and democratic economy, and any funding received will only go to further that vision. Transparency in Funding CAMP will make public all supporters who contribute $5,000 or more per year. Any funding directed towards specific reports, research, or events will be made explicit, allowing the audience to make their own judgements on its impact on our work. CAMP will accept anonymous donations for general support only if it is clear that safeguards are in place to ensure the use of that donation is fully within CAMP’s independent control. CAMP is deeply grateful for the pro bono support provided by many behind the scenes, including the talented volunteers who make our work possible. Current Funders Halsall Family Foundation Hamilton Community Foundation Open Society Foundations Reset.Tech Yelp CONTACT Canadian Anti-Monopoly Project © 2025. All Rights Reserved Privacy Policy Charitable Number: 731654901RR0001"
    },
    {
      "url": "https://www.bittingsrx.com/",
      "text": "Welcome - Bittings Pharmacy & Medical Equipme - Your Local Ocala Pharmacy Pharmacy Services ▾ Auto Refill Drive Thru Home Delivery Medicare Open Enrollment Medication Therapy Management Unit Dose Packaging Compounding Durable Medical Equipment Diabetes Specialized Care Center Our Pharmacy Mobile Wellness Classes ▾ Diabetes Quit Smoking Weight Loss High Blood Pressure High Cholesterol Asthma Resources ▾ Health News Med Info Contact Refill Transfer a Prescription New Patients Please Call 352-310-3692 Bittings Pharmacy would like to welcome patients from 17th Street Discount Pharmacy. All files will be at Bittings as of Monday, April the 8th. We look forward to welcoming you! Welcome to Bittings Pharmacy & Medical Equipment Serving the communities of Ocala since 1920. Compounding Meds made with you in mind. Diabetes Care Let us help you understand and manage your diabetes. Durable Medical Equipment Available for purchase and rental. Drive-Thru Pick up your prescriptions at our drive-thru. Home Delivery Let us come to you. Auto Refill Automatic refills - we will notify you when your items are ready. Medication Therapy Management We can help you manage your medications and health conditions. Refill a Prescription We fill new and existing prescriptions in-store, by phone, online , and with our mobile app . Refill Now Transfer a Prescription Transfer your prescriptions to our pharmacy using our simple and secure online transfer form . Transfer Now Contact Us Visit us in store or get in touch with a member of our pharmacy staff. We're always happy to assist you. Get in Touch Bitting's Christmas Pizza Party Why not give your loved ones a stylish and practical gift? Stop by today to view our selection of DME equipment including our designer walkers! Give the gift of comfort and convenience this holiday season! Our Services Your One-Stop Shop Unit Dose Packaging We offer a convenient solution to simplify your daily medication routine through our specialized unit dose packaging service. Durable Medical Equipment We offer durable medical equipment as well as  assemble the equipment for you in store and assist with fittings Personalized Service & Care We offer quality service for over eighty years. We are a family owned, full service Ocala compounding pharmacy. Drive Thru Pick up your prescriptions at our drive-thru. Accepts Tricare Accepts all Medicaid Plans. Download Our Free App. Your health information in one place. ✓ Refill 24/7 » ✓ Set Reminders » ✓ Save on Medications » Your Pharmacy Experts Trust Us With Your Health Bitting's Pharmacy has been providing Ocala with quality service for over eighty years. We are a family owned, full service Ocala compounding pharmacy. Our qualified staff at our Ocala independent pharmacy knows customers by name. We fill your prescriptions as quickly as possible. We are dedicated to meeting your needs with professional and courteous service. Specialized Services: Compounding For Humans and Pets Durable Medical Equipment - Fitting Specialists Special Orders Welcome Download Our Free App Refill 24/7 » Set reminders » Save on medications » Read Our Patient Reviews Barbara B. \" The representative of Bitting's was very knowledgeable and a great help. \" Bill B. \" If you can't find medical supplies you need at big brand pharmacies you WILL find them here. Not just a pharmacy, but also has medical supplies & mobility equipment. They have wound care, specialized support wraps, and everything to care for post-op needs. Friendly helpful people too. \" Jan S. \" Bitting's Pharmacy is by far the best pharmacy there ever was. If I could give 100 stars, I would. The ladies that work there have always treated me with respect and kindness, and I am so grateful for that. Special thank you to everyone at Bitting's. I really appreciate all that you do. Thank you! Learn About Us » Bittings Pharmacy & Medical Equipment combines high quality products with personalized care. Our staff will be happy to help you with any questions you may have. Our Services » We offer a wide variety of services including conventional prescription filling, compounding, medical equipment, unit dose packaging, medicare open enrollment and much more. Explore Our Health News » Check out our weekly health news blog and receive updates on health articles, promotions, specials and much more. We'd Love to Hear From You At Bittings Pharmacy & Medical Equipment, we’re committed to helping you live a healthier life. Our pharmacy staff would be happy to help you with any questions you may have. Send an Email New Patients: 352-310-3692 Current Patients: 352-732-3666 Fax: 352-732-1107 New Patients Current Patients Refill Map"
    },
    {
      "url": "https://monopolydreams.com.au/contactus/",
      "text": "Contact Us - Monopoly Dreams Sessions available today Book Now The Experience The Experience What’s Included Monopoly Heroes Retail Store Cafe High Tea Plan Your Visit Plan Your Visit Group bookings Gift Cards FAQ Schools and Parties Birthday Parties Corporate Events School Excursions Online Store The Experience The Experience What’s Included Monopoly Heroes Retail Store Cafe High Tea Plan Your Visit Plan Your Visit Group bookings Gift Cards FAQ Schools and Parties Birthday Parties Corporate Events School Excursions Online Store CONTACT US Contact Us Have a question? Drop us a line! Phone: 03 8617 0250 Email: contact@monopolydreams.com.au Or fill in our enquiry form below: Enquiry form Event and birthday queries Interested in hosting an event or birthday party at MONOPOLY DREAMS? Talk to our friendly events team! Phone: 03 8617 0250 Email: parties@monopolydreams.com.au Or fill in our event enquiry form below: Event enquiry Media and Influencer queries If you’re media or influencers and interested in collaborating with MONOPOLY DREAMS Melbourne, please contact our Marketing team. Email: simon.hall@monopolydreams.com.au Location We are located on the Lower Ground floor of Melbourne Central. The nearest entry is on 290 Lonsdale Street – take the escalator down to Monopoly Dreams! Get Directions Stay up to date Notice: JavaScript is required for this content. Contact Us Entry Terms & Conditions Ticket Terms & Conditions Privacy Policy Agent Portal Lower Ground Floor Melbourne Central Lonsdale St, Melbourne VIC, 3000, Australia P) 03 8617 0250 Gathering together, we are inspired by the strength and resilience of the First Peoples, the Wurundjeri Woi Wurrung. As we walk, play and laugh through this place, we acknowledge their continuous connection to Country and Culture. We are committed to listening, learning and sharing with respect. © 2025 Hasbro. All rights reserved"
    },
    {
      "url": "https://naples.floridaweekly.com/articles/sip-undercover/",
      "text": "Sip Undercover - Naples Florida Weekly Search for: Search Submit ▼ Log In Gift Subscriptions Naples Florida Weekly Naples Home News Top News Opinion Healthy Living News of the Weird Pet Tales Outdoors Business & Real Estate Business News Real Estate News The Motley Fool Networking Business Briefs On the Move A&E A&E News Cuisine What to Do, Where to Go Society Events Add Event Special Sections Marketplace Print Editions Business Directory Archives Choose Your Community Bonita Springs Charlotte County Fort Myers Key West Naples Palm Beach Florida Weekly Home About Us Advertising Solutions Newsstand Locations Subscribe Frequently Asked Questions Careers Contact Us Report Website Accessibility Problems Pay Your Advertising Invoice Public Notices Place View Obituaries Place An Obituary Log In Privacy Policy Florida Weekly Home Fort Myers Bonita Springs Charlotte County Key West Naples Palm Beach Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Select search type Places Events Search for Near Search Search Advanced Filters Sort by Distance Select Option Nearest Within 5 miles Within 10 miles Within 15 miles Within 20 miles Within 25 miles Within 30 miles Within 35 miles Within 40 miles Within 45 miles Within 50 miles More Search Search {\"hide_search_input\":\"\",\"hide_near_input\":\"\",\"show\":\"\",\"filters_pos\":\"\",\"input_size\":\"\",\"bar_flex_wrap\":\"\",\"bar_flex_wrap_md\":\"\",\"bar_flex_wrap_lg\":\"\",\"input_border\":\"\",\"input_border_opacity\":\"\",\"input_rounded_size\":\"\",\"btn_bg\":\"\",\"btn_rounded_size\":\"\",\"btn_rounded_size_md\":\"\",\"btn_rounded_size_lg\":\"\",\"bg\":\"\",\"mt\":\"\",\"mr\":\"\",\"mb\":3,\"ml\":\"\",\"pt\":\"\",\"pr\":\"\",\"pb\":\"\",\"pl\":\"\",\"border\":\"\",\"rounded\":\"\",\"rounded_size\":\"\",\"rounded_size_md\":\"\",\"rounded_size_lg\":\"\",\"shadow\":\"\",\"css_class\":\"\"} Tuesday, September 9, 2025 Search Newsletter Events Photos Classifieds Subscribe Marketplace Home News Top News Opinion Healthy Living Pet Tales Home & Garden Business & Real Estate Business News Real Estate News The Motley Fool Networking Business Briefs On the Move A&E Arts and Entertainment News What to Do, Where to Go Outdoors Society Cuisine Events Add Event Special Sections Arts Preview – Act I Arts Preview – Act II Best Of 2025 Businesses of Distinction CBIA Parade of Homes 2025 Destination Guide Health Trends How-To Guide Hurricane Guide Newcomers Guide Key West Getaways Staycations & Getaways Tasting Notes Public Notices Place View Obituaries Place An Obituary Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Latest Places New Real Estate Favorite Royal Palm Coast Realtors Association New Shopping Favorite Caloosahatchee Cannabis Company New Professional Directory Favorite Stilwell Enterprises & Restaurant Group New Professional Directory Favorite Florida Trust Wealth Management New Professional Directory Favorite Collaboratory View all Sip Undercover Florida’s speakeasies are where secrets flow as smoothly as the spirits Staycations & Getaways By Carlie Admire on June 12, 2025 BY CARLIE ADMIRE carlie.admire@floridaweekly.com Signature cocktails at The Armory pay homage to American heritage in both name and spirit. Word on the street, some serious “whiskey” business and “pour” decisions happen nightly. Just knock twice (or follow the faint hum of jazz behind the local taco joint’s freezer). Inside, you will find password-protected cocktails in stealthy coupe-stemmed chalices. “Our speakeasy is open only on Wednesday nights, which keeps it extra special,” said Vincent Toscano, owner and creative director of 215 Speakeasy in West Palm Beach. “You do need to find the door. We keep the spirit of secrecy alive with an unmarked entrance that adds a sense of mystery and discovery. It’s part of the fun.” “We are currently operating on a walk-in basis…if they can find us,” teased Christopher Lee, owner of Staff Only in Naples. Speakeasies are the state’s best-kept mysteries. The tucked-away vibes are strong, and the spirits are even stronger, with guests vowing to keep things on the down low. They may not appear on maps, but they always serve top-shelf secrets over ice. Naples’ speakeasy, “Staff Only,” is tucked away behind a local sushi restaurant. COURTESY PHOTO “It is not your run-of-the-mill bar,” said Rachael Sanchez, co-owner of Ocala’s speakeasy, Anti-Monopoly Drug Store. “Guests can expect a mysterious, cozy and immersive experience. The lighting is soft, the energy is intimate and everything is designed to help people feel like they’ve stepped into a different world, one that encourages slowing down and savoring every detail,” said Toscano. “215 Speakeasy is about trust and transformation. It’s not a bar with a drink list. It’s a place for conversation, curiosity and curated cocktails. If you are looking for something off the beaten path, with no script and no pretense, we’re here for you.” Disguised behind undercover names like Dirty Laundry, spotted in St. Petersburg — complete with washing machine decoys — these hidden gems stir whispers of the past with dim-light libations in a moody atmosphere. But the discreet dens are starting to slip. Find the door, earn the pour. It is happy hour in hiding. “To gain access to the Anti-Monopoly Drug Store speakeasy, you must have the weekly password that is published on Facebook and Instagram. Entry is obtained through a false door, disguised as a bookshelf on the first floor in The Lodge (another restaurant and bar),” said Sanchez. The Anti-Monopoly Drug Store opened its doors in 2020, but it wasn’t until 2024 that Sanchez and her husband, Johnny Sanchez, took the reins of the intimate venue. With room for just 20 bootleggers, the sultry spot is steeped in history. Sanchez explained, “The original Anti-Monopoly Drug Store was a pharmacy in downtown Ocala in the late 1800s. All along the walls, you will see historic pictures of Ocala throughout the years. The building that houses the speakeasy was the first financial institution in Ocala, the Bank of Ocala, in 1882.” The Anti-Monopoly Drug Store is located at 36 South Magnolia Avenue in Ocala, while The Armory Speakeasy at The Post lies further south, just off the Overseas Highway at Mile Marker 102. “You’ll need to find our hidden bunker tunnel first. Inside, a walk-talkie (channel 4) awaits, where you’ll radio the guard and provide the daily password. To get the password, you can enlist via our website or follow our Instagram, where we post clues and nightly codes,” said Janessa Silverstri, founder and owner of The Armory Speakeasy at The Post, found in Key Largo. “It’s all part of the fun, just like the speakeasies from 100 years ago.” The Florida Keys are a world of their own, where haunted dolls share lore with Hemingway’s six-toed cats and roosters roam the alleys like locals. Concealed among the island charm of the Keys are speakeasies that echo the past. From the vintage vibes of the Speakeasy Inn & Rum Bar to the eclectic elegance of Berlin’s Cocktail Bar & Lounge, the scene is rich with character. A standout among them, The Armory Speakeasy, opened its doors in November 2024, sparked from a heartfelt conversation with Purple Heart veteran John Donnelly of the Bronx. “He (Donnelly) spoke not only with pride about his service but with a deep love for what it meant to be American – open, inclusive and united across all backgrounds. His words stayed with me. That night, I envisioned a space that would reflect that same spirit. It is a timeless hideaway where patriotism meets elegance, and everyone is welcome. The Armory isn’t just a bar. It’s a tribute,” said Silverstri. Dark and mysterious pop-ups are stirring across Florida, most notably with the traveling Edgar Allan Poe Bar. This shadowy event haunts Florida’s hidden speakeasies, where four of Poe’s most iconic tales are dramatically retold and reimagined by in-house Poe historians. Each chilling chapter is paired with a handcrafted cocktail in a four-part macabre mixology experience. Signature sips include The Nevermore and Red Death, blending vodka, cherry, citrus juices and bitters for a hauntingly delicious twist. In Fort Myers, sounds of the Prohibition era linger among the historic brick buildings downtown. The 86 Room embodies the spirit with roaring jazz and classic silent films featuring Charlie Chaplin, offering an escape into an open speakeasy. For those seeking a stylish nightcap, the Escondido Lounge awaits, an inconspicuous spot tucked behind Taco Worx. This glowing red cabaret blends rich history with a modern twist, serving ageless cocktails like the Dirty Martini, French 75 and Whiskey Sour. Signature drinks such as the RQ Richards Old Fashioned and tributes to local icons, like Thomas Edison and Henry Ford, make it a perfect stop for a late-night sip with a story. Slip into the hidden charm of Escondido Lounge at 1617 Hendry Street, Unit 102 — rumor has it a second location may soon surface in Cape Coral. Or follow the sounds from The 86 Room circulating through Patio De Leon. “Staff Only has set an elegant ambiance that transports you back in time. With early 1900s artifacts, jazz playing in the background and a tin ceiling with dimly-lit lighting, you feel like you are not in Naples,” said Lee. “My favorite part of Staff Only is the feeling I get when I walk in. It really is a transporting experience to where I feel like I am back in New York City.” Lee added, “Staff Only is located inside the District Sushi Restaurant and Cocktail Bar. Guests need to work their way to the back left side of the restaurant and search for a tiny sign on a door that says: ‘Staff Only.’” Opened in 2023 and hidden behind the walls of a fine dining hub, Staff Only nods to the secretive allure of classic speakeasies. The intimate hideaway welcomes just 20 guests at a time, offering a seductive setting perfect for connection and private conversation. On lively nights, the buzz and low laughter often lures a curious crowd to the door, proving that the best-kept secrets are the hardest to keep. Beyond softly spoken door keys, Sarasota’s Pangea Alchemy Lab and Holmes Beach’s Doctor’s Office serve more than cocktails; they pour time travel by the glass. Whether you are seeking a “prescription” for a long day or chasing the cure for the ordinary, these speakeasies are just what the doctor ordered. Step through the tunnel into a world where vintage vibes meet modern mixology, draped in glam and stirred with a dash of patriotic flair. Every detail is intentional, every drink a remedy and every visit a secret worth sipping on. “Some of The Anti-Monopoly Drug Store’s most popular drinks include the Smoked Old-Fashioned, S’mores martini and Crème Brulé Martini,” said Sanchez. “We offer a wide variety of top-shelf liquors, and all of our cocktails are handcrafted using made-from-scratch syrups and infusions. We also have seasonal and holiday drinks that rotate on the menu routinely.” Silvestri shared the passion behind The Armory Speakeasy’s cocktail craft: “We take great pride in our handcrafted cocktails. Our General’s Old-Fashioned, made with Horse Soldier Bourbon (a veteran-owned brand), is bold, classic and full of character. For something decadent and local, we offer The Ultimate Key Lime Pie Martini, our tribute to the Florida Keys. It is tart, creamy and unforgettable. For a touch of romance, The Lost Lover Letter is our most emotional cocktail, layered with bittersweet flavors and served with a handwritten message. It honors both those who serve and those who wait at home, never giving up on love or return.” Whether you crave a classic prohibition punch or a modern twist, the Naples’ Staff Only Speakeasy promises a cocktail experience like no other. Lee explained that the menu is divided into two categories: authentic Prohibition-style cocktails and creations from the 2000s that put a contemporary spin on traditional recipes. “A few elixirs not to be missed are the Get Naked and Have Fun, made with fresh strawberries, bourbon, Averna and egg whites, as well as The Flapper, crafted with vanilla vodka, passion fruit liqueur, mango and Moët champagne.” A speakeasy is about the vibe, and the cocktails follow the flow. At 215 Speakeasy, every drink is crafted at the moment, inspired by the conversation and the ambiance. It’s where storytelling meets mixology, and every sip sparks a new chapter. “I wanted to create a space where I could truly express myself through craft cocktails and build a sense of intimacy with each guest. The goal was to break away from the traditional bar structure and connect on a more personal, artistic level, one cocktail at a time,” said Toscano. “We don’t have a set cocktail menu. Every drink is handcrafted based on a conversation I start with every guest: ‘What are you in the mood for?’ It’s an omakase-style experience where I tailor each cocktail to their mood, taste and curiosity. That could mean smoky cocktails, floral infusions or something completely unexpected.” 215 Speakeasy has been pouring the essence of classic speakeasies since 2017, spotted on second-story windows of 335 Clematis Street in West Palm Beach. Owner Toscano shared, “There isn’t just one ‘hidden gem,’ the entire space of 215 Speakeasy is designed to feel like one. From the lighting and textures to the room’s energy, the whole experience is meant to feel special and unexpected.” The 215 Speakeasy is open to the public on Wednesday nights from 5 to 11 p.m., while the rest of the week is reserved for private parties and cocktail classes. Toscano said, “We teach guests how to shake, stir and savor great cocktails. It’s our way of spreading the love of mixology, one class, one story, one drink at a time.” The speakeasy scene hits all the right notes, offering a mix of live performances and curated soundscapes that set the tone for unforgettable evenings. Jewel in Orlando brings dueling pianos to the premier speakeasy and The Anti Monopoly Drug Store features live music on Friday and Saturday nights and during special events to keep the energy alive. Meanwhile, The Armory hosts jazz performers every Friday from 8 to 10 p.m., and both Staff Only and 215 Speakeasy carefully shape playlists that perfectly tune into the atmosphere. “We don’t have scheduled live music at 215 Speakeasy,” explained Toscano. “Instead, the soundtrack flows with the night, ranging from ambient jazz to dreamy electronica. The vibe evolves naturally to match the crowd and energy in the room.” The Armory’s ambiance starts off smooth, classic and nostalgic. “After 10 p.m., the mood shifts to something bouncier, with sing-alongs and upbeat tunes that invite guests to relax and dance the night away,” said Silvestri. Florida’s coastlines are dotted with treasure trove of unique speakeasies, each with its own secret twist. Soak up island vibes at Trader Sam’s Grog Grotto, a tiki-style escape or slip through a Davie wine shop to find the hidden Sidecar Speakeasy. In Fort Lauderdale, Apothecary 330 serves up over 300 whiskeys from a secret corner of a pizzeria and The Red Phonebooth in Miami answers your call with codes dialed in. Embrace the eerie at Cocktails & Screams, where horror-themed drinks haunt the menu and for a vintage vibe, The Volstead in Jacksonville jazzes up Sundays with swing tunes and twirling. Buried behind unmarked doors, Florida’s speakeasies offer the thrill of discovery. The Armory Speakeasy honors Veterans of Foreign Wars by blending military respect, community and upscale hospitality into a unique experience. The Armory Speakeasy houses the Wall of Honor, displaying photos from local families of those who have served, while the Missing Man’s Table is a solemn tribute that often moves guests deeply. Silvestri shared, “These aren’t just decorations— they’re reminders of sacrifice and legacy. From the moment guests enter, they’re immersed in history, heart and hidden luxury. It’s 1920s glamour with a modern, patriotic twist—every detail is designed to make you feel like you’ve uncovered a secret worth keeping. Whether for a night out, a unique experience or to pay tribute, you’ll leave with more than a memory. Our mission to give back to veterans and community is just beginning.” Florida’s speakeasies take you on a cocktail-fueled time warp to the roaring flapper culture, each bursting with unique charm and playful personality. Mixing vintage glam with a cheeky edge, they are the perfect relic where you can sip and dance into a night full of jazz, merriment and unforgettable memories. “I love how our Anti-Monopoly Drug Store speakeasy emulates speakeasies from a forgotten time but is still modern enough to offer current drink trends. It is intimate enough for a first date but still fun for a night out with friends,” said Sanchez. Chasing the clink of a perfectly mixed cocktail or the smooth harmony of an upright bass, Florida’s speakeasies unlock the door to nights packed with secret vibes and remarkable experiences. With a wink to the past and a twist of the unexpected, they prove the best drinks are off the grid. Cheers to the secret side of Florida, hidden in plain sight. ¦ Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Current ye@r * Leave this field empty Δ Loading Contact Us! Click Here for Our Offices Home News Business Real Estate A&E Events Business Directory Past Print Editions Subscribe Newsletter Newsstands Website Accessibility Our Hometown DMCA Notices Newspaper website content management software and services If you have any problems, questions, or comments regarding www.FloridaWeekly.com , please contact our Webmaster .\nFor all other comments, please see our contact section . For more information on this site please read our Terms and Conditions , Privacy Policy , and Ad Choices . Copyright © 2007 - 2025  Florida Media Group LLC Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://bonitasprings.floridaweekly.com/articles/sip-undercover/",
      "text": "Sip Undercover - Bonita Springs Florida Weekly Search for: Search Submit ▼ Log In Gift Subscriptions Bonita Springs Florida Weekly Bonita Springs Home News Business A&E Real Estate Special Sections Obituaries Place An Obituary Marketplace Print Editions Business Directory Archives Choose Your Community Bonita Springs Charlotte County Fort Myers Key West Naples Palm Beach Florida Weekly Home About Us Advertising Solutions Newsstand Locations Subscribe Frequently Asked Questions Careers Contact Us Report Website Accessibility Problems Pay Your Advertising Invoice Log In Privacy Policy Florida Weekly Home Fort Myers Bonita Springs Charlotte County Key West Naples Palm Beach Tuesday, September 9, 2025 Search Newsletter Events Photos Classifieds Subscribe Marketplace Home News Top News Healthy Living Opinion Community Home & Garden Pet Tales Business Business News Business Briefs Networking On The Move The Motley Fool A&E Arts and Entertainment News Society What To Do, Where To Go Cuisine Events Add Event Real Estate Special Sections Arts Preview – Act I Arts Preview – Act II Best Of 2025 Businesses of Distinction Destination Guide Health Trends How-To Guide Hurricane Guide Key West Getaways Newcomers Guide Staycations & Getaways Tasting Notes 2024 Breast Cancer 2024 Veterans 2025 Pet Obituaries Place An Obituary Sip Undercover Florida’s speakeasies are where secrets flow as smoothly as the spirits By Carlie Admire on June 12, 2025 BY CARLIE ADMIRE carlie.admire@floridaweekly.com Signature cocktails at The Armory pay homage to American heritage in both name and spirit. Word on the street, some serious “whiskey” business and “pour” decisions happen nightly. Just knock twice (or follow the faint hum of jazz behind the local taco joint’s freezer). Inside, you will find password-protected cocktails in stealthy coupe-stemmed chalices. “Our speakeasy is open only on Wednesday nights, which keeps it extra special,” said Vincent Toscano, owner and creative director of 215 Speakeasy in West Palm Beach. “You do need to find the door. We keep the spirit of secrecy alive with an unmarked entrance that adds a sense of mystery and discovery. It’s part of the fun.” “We are currently operating on a walk-in basis…if they can find us,” teased Christopher Lee, owner of Staff Only in Naples. Speakeasies are the state’s best-kept mysteries. The tucked-away vibes are strong, and the spirits are even stronger, with guests vowing to keep things on the down low. They may not appear on maps, but they always serve top-shelf secrets over ice. Naples’ speakeasy, “Staff Only,” is tucked away behind a local sushi restaurant. COURTESY PHOTO “It is not your run-of-the-mill bar,” said Rachael Sanchez, co-owner of Ocala’s speakeasy, Anti-Monopoly Drug Store. “Guests can expect a mysterious, cozy and immersive experience. The lighting is soft, the energy is intimate and everything is designed to help people feel like they’ve stepped into a different world, one that encourages slowing down and savoring every detail,” said Toscano. “215 Speakeasy is about trust and transformation. It’s not a bar with a drink list. It’s a place for conversation, curiosity and curated cocktails. If you are looking for something off the beaten path, with no script and no pretense, we’re here for you.” Disguised behind undercover names like Dirty Laundry, spotted in St. Petersburg — complete with washing machine decoys — these hidden gems stir whispers of the past with dim-light libations in a moody atmosphere. But the discreet dens are starting to slip. Find the door, earn the pour. It is happy hour in hiding. Hidden behind a secret bookcase, The Anti-Monopoly Drug Store requires a secret code for entry. “To gain access to the Anti-Monopoly Drug Store speakeasy, you must have the weekly password that is published on Facebook and Instagram. Entry is obtained through a false door, disguised as a bookshelf on the first floor in The Lodge (another restaurant and bar),” said Sanchez. The Anti-Monopoly Drug Store opened its doors in 2020, but it wasn’t until 2024 that Sanchez and her husband, Johnny Sanchez, took the reins of the intimate venue. With room for just 20 bootleggers, the sultry spot is steeped in history. Sanchez explained, “The original Anti-Monopoly Drug Store was a pharmacy in downtown Ocala in the late 1800s. All along the walls, you will see historic pictures of Ocala throughout the years. The building that houses the speakeasy was the first financial institution in Ocala, the Bank of Ocala, in 1882.” The Anti-Monopoly Drug Store is located at 36 South Magnolia Avenue in Ocala, while The Armory Speakeasy at The Post lies further south, just off the Overseas Highway at Mile Marker 102. 215 Speakeasy opened in West Palm Beach in August 2017. COURTESY PHOTO “You’ll need to find our hidden bunker tunnel first. Inside, a walk-talkie (channel 4) awaits, where you’ll radio the guard and provide the daily password. To get the password, you can enlist via our website or follow our Instagram, where we post clues and nightly codes,” said Janessa Silverstri, founder and owner of The Armory Speakeasy at The Post, found in Key Largo. “It’s all part of the fun, just like the speakeasies from 100 years ago.” The Florida Keys are a world of their own, where haunted dolls share lore with Hemingway’s six-toed cats and roosters roam the alleys like locals. Concealed among the island charm of the Keys are speakeasies that echo the past. From the vintage vibes of the Speakeasy Inn & Rum Bar to the eclectic elegance of Berlin’s Cocktail Bar & Lounge, the scene is rich with character. A standout among them, The Armory Speakeasy, opened its doors in November 2024, sparked from a heartfelt conversation with Purple Heart veteran John Donnelly of the Bronx. “He (Donnelly) spoke not only with pride about his service but with a deep love for what it meant to be American – open, inclusive and united across all backgrounds. His words stayed with me. That night, I envisioned a space that would reflect that same spirit. It is a timeless hideaway where patriotism meets elegance, and everyone is welcome. The Armory isn’t just a bar. It’s a tribute,” said Silverstri. Dark and mysterious pop-ups are stirring across Florida, most notably with the traveling Edgar Allan Poe Bar. This shadowy event haunts Florida’s hidden speakeasies, where four of Poe’s most iconic tales are dramatically retold and reimagined by in-house Poe historians. Each chilling chapter is paired with a handcrafted cocktail in a four-part macabre mixology experience. Signature sips include The Nevermore and Red Death, blending vodka, cherry, citrus juices and bitters for a hauntingly delicious twist. In Fort Myers, sounds of the Prohibition era linger among the historic brick buildings downtown. The 86 Room embodies the spirit with roaring jazz and classic silent films featuring Charlie Chaplin, offering an escape into an open speakeasy. For those seeking a stylish nightcap, the Escondido Lounge awaits, an inconspicuous spot tucked behind Taco Worx. This glowing red cabaret blends rich history with a modern twist, serving ageless cocktails like the Dirty Martini, French 75 and Whiskey Sour. Signature drinks such as the RQ Richards Old Fashioned and tributes to local icons, like Thomas Edison and Henry Ford, make it a perfect stop for a late-night sip with a story. Slip into the hidden charm of Escondido Lounge at 1617 Hendry Street, Unit 102 — rumor has it a second location may soon surface in Cape Coral. Or follow the sounds from The 86 Room circulating through Patio De Leon. “Staff Only has set an elegant ambiance that transports you back in time. With early 1900s artifacts, jazz playing in the background and a tin ceiling with dimly-lit lighting, you feel like you are not in Naples,” said Lee. “My favorite part of Staff Only is the feeling I get when I walk in. It really is a transporting experience to where I feel like I am back in New York City.” Lee added, “Staff Only is located inside the District Sushi Restaurant and Cocktail Bar. Guests need to work their way to the back left side of the restaurant and search for a tiny sign on a door that says: ‘Staff Only.’” Opened in 2023 and hidden behind the walls of a fine dining hub, Staff Only nods to the secretive allure of classic speakeasies. The intimate hideaway welcomes just 20 guests at a time, offering a seductive setting perfect for connection and private conversation. On lively nights, the buzz and low laughter often lures a curious crowd to the door, proving that the best-kept secrets are the hardest to keep. Beyond softly spoken door keys, Sarasota’s Pangea Alchemy Lab and Holmes Beach’s Doctor’s Office serve more than cocktails; they pour time travel by the glass. Whether you are seeking a “prescription” for a long day or chasing the cure for the ordinary, these speakeasies are just what the doctor ordered. Step through the tunnel into a world where vintage vibes meet modern mixology, draped in glam and stirred with a dash of patriotic flair. Every detail is intentional, every drink a remedy and every visit a secret worth sipping on. “Some of The Anti-Monopoly Drug Store’s most popular drinks include the Smoked Old-Fashioned, S’mores martini and Crème Brulé Martini,” said Sanchez. “We offer a wide variety of top-shelf liquors, and all of our cocktails are handcrafted using made-from-scratch syrups and infusions. We also have seasonal and holiday drinks that rotate on the menu routinely.” Silvestri shared the passion behind The Armory Speakeasy’s cocktail craft: “We take great pride in our handcrafted cocktails. Our General’s Old-Fashioned, made with Horse Soldier Bourbon (a veteran-owned brand), is bold, classic and full of character. For something decadent and local, we offer The Ultimate Key Lime Pie Martini, our tribute to the Florida Keys. It is tart, creamy and unforgettable. For a touch of romance, The Lost Lover Letter is our most emotional cocktail, layered with bittersweet flavors and served with a handwritten message. It honors both those who serve and those who wait at home, never giving up on love or return.” Whether you crave a classic prohibition punch or a modern twist, the Naples’ Staff Only Speakeasy promises a cocktail experience like no other. Lee explained that the menu is divided into two categories: authentic Prohibition-style cocktails and creations from the 2000s that put a contemporary spin on traditional recipes. “A few elixirs not to be missed are the Get Naked and Have Fun, made with fresh strawberries, bourbon, Averna and egg whites, as well as The Flapper, crafted with vanilla vodka, passion fruit liqueur, mango and Moët champagne.” A speakeasy is about the vibe, and the cocktails follow the flow. At 215 Speakeasy, every drink is crafted at the moment, inspired by the conversation and the ambiance. It’s where storytelling meets mixology, and every sip sparks a new chapter. “I wanted to create a space where I could truly express myself through craft cocktails and build a sense of intimacy with each guest. The goal was to break away from the traditional bar structure and connect on a more personal, artistic level, one cocktail at a time,” said Toscano. “We don’t have a set cocktail menu. Every drink is handcrafted based on a conversation I start with every guest: ‘What are you in the mood for?’ It’s an omakase-style experience where I tailor each cocktail to their mood, taste and curiosity. That could mean smoky cocktails, floral infusions or something completely unexpected.” 215 Speakeasy has been pouring the essence of classic speakeasies since 2017, spotted on second-story windows of 335 Clematis Street in West Palm Beach. Owner Toscano shared, “There isn’t just one ‘hidden gem,’ the entire space of 215 Speakeasy is designed to feel like one. From the lighting and textures to the room’s energy, the whole experience is meant to feel special and unexpected.” The 215 Speakeasy is open to the public on Wednesday nights from 5 to 11 p.m., while the rest of the week is reserved for private parties and cocktail classes. Toscano said, “We teach guests how to shake, stir and savor great cocktails. It’s our way of spreading the love of mixology, one class, one story, one drink at a time.” The speakeasy scene hits all the right notes, offering a mix of live performances and curated soundscapes that set the tone for unforgettable evenings. Jewel in Orlando brings dueling pianos to the premier speakeasy and The Anti Monopoly Drug Store features live music on Friday and Saturday nights and during special events to keep the energy alive. Meanwhile, The Armory hosts jazz performers every Friday from 8 to 10 p.m., and both Staff Only and 215 Speakeasy carefully shape playlists that perfectly tune into the atmosphere. “We don’t have scheduled live music at 215 Speakeasy,” explained Toscano. “Instead, the soundtrack flows with the night, ranging from ambient jazz to dreamy electronica. The vibe evolves naturally to match the crowd and energy in the room.” The Armory’s ambiance starts off smooth, classic and nostalgic. “After 10 p.m., the mood shifts to something bouncier, with sing-alongs and upbeat tunes that invite guests to relax and dance the night away,” said Silvestri. Florida’s coastlines are dotted with treasure trove of unique speakeasies, each with its own secret twist. Soak up island vibes at Trader Sam’s Grog Grotto, a tiki-style escape or slip through a Davie wine shop to find the hidden Sidecar Speakeasy. In Fort Lauderdale, Apothecary 330 serves up over 300 whiskeys from a secret corner of a pizzeria and The Red Phonebooth in Miami answers your call with codes dialed in. Embrace the eerie at Cocktails & Screams, where horror-themed drinks haunt the menu and for a vintage vibe, The Volstead in Jacksonville jazzes up Sundays with swing tunes and twirling. Buried behind unmarked doors, Florida’s speakeasies offer the thrill of discovery. The Armory Speakeasy honors Veterans of Foreign Wars by blending military respect, community and upscale hospitality into a unique experience. The Armory Speakeasy houses the Wall of Honor, displaying photos from local families of those who have served, while the Missing Man’s Table is a solemn tribute that often moves guests deeply. Silvestri shared, “These aren’t just decorations— they’re reminders of sacrifice and legacy. From the moment guests enter, they’re immersed in history, heart and hidden luxury. It’s 1920s glamour with a modern, patriotic twist—every detail is designed to make you feel like you’ve uncovered a secret worth keeping. Whether for a night out, a unique experience or to pay tribute, you’ll leave with more than a memory. Our mission to give back to veterans and community is just beginning.” Florida’s speakeasies take you on a cocktail-fueled time warp to the roaring flapper culture, each bursting with unique charm and playful personality. Mixing vintage glam with a cheeky edge, they are the perfect relic where you can sip and dance into a night full of jazz, merriment and unforgettable memories. “I love how our Anti-Monopoly Drug Store speakeasy emulates speakeasies from a forgotten time but is still modern enough to offer current drink trends. It is intimate enough for a first date but still fun for a night out with friends,” said Sanchez. Chasing the clink of a perfectly mixed cocktail or the smooth harmony of an upright bass, Florida’s speakeasies unlock the door to nights packed with secret vibes and remarkable experiences. With a wink to the past and a twist of the unexpected, they prove the best drinks are off the grid. Cheers to the secret side of Florida, hidden in plain sight. ¦ More From Arts and Entertainment News Go To The Arts and Entertainment News Section New Exhibits, Big Impact “Breakfast with Nora” “Unlikely Murder” Loading Comments Loading Home News Business A&E Real Estate News Business Directory Past Print Editions Subscribe Newsletter Newsstands Website Accessibility Our Hometown DMCA Notices Newspaper website content management software and services If you have any problems, questions, or comments regarding www.FloridaWeekly.com , please contact our Webmaster .\nFor all other comments, please see our contact section . For more information on this site please read our Terms and Conditions , Privacy Policy , and Ad Choices . Copyright © 2007 - 2025  Florida Media Group LLC"
    }
  ]
}