{
  "fuentes": [
    {
      "url": "https://www.ocalamarion.com/directory/the-market-of-marion/",
      "email": "exploreocalamarion@marionfl.org"
    },
    {
      "url": "https://www.marion-square.com/who-we-are",
      "email": "info@marion-square.com"
    },
    {
      "url": "https://antiquemallofmarietta.com/contact/",
      "email": "sherryosburn62@yahoo.com"
    },
    {
      "url": "https://www.marionskitchen.com/contact-us/",
      "email": "partnerships@cookdinehost.com"
    },
    {
      "url": "https://www.marionskitchen.com/contact-us/",
      "email": "partnerships@marionskitchen.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "agoldberg@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "cweggler@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "iharmon@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "inagle@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "jellis@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "jplace@oakviewgroup.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "khorrigan@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "kmccarthy@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "laudet@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "mkeeley@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "nchretien@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "psullivan@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "sfrenyea@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "sinead_scott@comcastspectacor.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "smurray@comcastspectacor.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "smurray@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "sscott@mainemariners.com"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "email": "tcase@mainemariners.com"
    }
  ],
  "mails": [
    "agoldberg@mainemariners.com",
    "cweggler@mainemariners.com",
    "exploreocalamarion@marionfl.org",
    "iharmon@mainemariners.com",
    "inagle@mainemariners.com",
    "info@marion-square.com",
    "jellis@mainemariners.com",
    "jplace@oakviewgroup.com",
    "khorrigan@mainemariners.com",
    "kmccarthy@mainemariners.com",
    "laudet@mainemariners.com",
    "mkeeley@mainemariners.com",
    "nchretien@mainemariners.com",
    "partnerships@cookdinehost.com",
    "partnerships@marionskitchen.com",
    "psullivan@mainemariners.com",
    "sfrenyea@mainemariners.com",
    "sherryosburn62@yahoo.com",
    "sinead_scott@comcastspectacor.com",
    "smurray@comcastspectacor.com",
    "smurray@mainemariners.com",
    "sscott@mainemariners.com",
    "tcase@mainemariners.com"
  ],
  "nombre_sitio": "themarketofmarion.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ocalamarion.com/directory/the-market-of-marion/",
      "text": "The Market of Marion | Ocala / Marion County Florida Skip to content 0 Saved Plan Your Trip Get Our App Equestrian Content Navigation Things to Do Equestrian Outdoor Adventures Indoor Adventures Shopping Arts & Culture Golf Agritourism Spas & Wellness Day Trips & Scenic Drives Events Annual Events Horse Shows & Events Submit Your Event Community Calendar Where to Stay Hotels & Motels Campgrounds & RV Parks Vacation Rentals Bed & Breakfasts Food & Drink Wineries, Breweries & Distilleries Plan Your Visit Transportation Weather & Avg Temperatures FAQs Area Vacation Guide OcalaMarion Travel Guide App E-Newsletter Signup Tropical Weather Updates Plan Your Trip Get Our App Equestrian Content Meetings & Events Blog Sports Events Weddings About Us Partners Download Vacation Guide Email Newsletter Signup Get Exclusive Deals Home Website The Market of Marion 12888 SE US Hwy 441 Belleview, Florida 34491 United States Details Open in Google Maps Map The Market of Marion 12888 SE US Hwy 441 Belleview, Florida 34491 (352) 245-6766 Share Overview Come Shop with us! Shopping at the Market of Marion is like taking a step back in time. Itâs the old towne square, the trading post and the local mercantile all rolled into one. Get to know the shop owner before you buy. Itâs a friendly community environment unique to a flea market. We have over 1,100 booths with more than 400 dealers. Youâll find just about anything and everything here. We invite you to come spend an afternoon, a day, or a weekend with us. Once youâve tried us youâll want to come back again and again. Thatâs a promise. Fax (352) 245-8353 Amenities Amenities Accessible Family Friendly Parking Available Pet Friendly Start Planning Your Stay In Ocala Vacation Guide Email Newsletter Visitor Center 109 West Silver Springs Boulevard | Ocala, FL 34475 Phone (352) 438-2800 | 1-888-FL-OCALA About Us Blog Media Contact Us Tour Operators Terms of Use Partners Privacy Policy Accessibility Â©2025 Ocala/Marion County Visitors and Convention Bureau This site uses cookies to provide you with an optimized experience. Privacy Policy Accept Quick Search Search Location Map"
    },
    {
      "url": "https://www.marion-square.com/who-we-are",
      "text": "Who We Are — Marion Square 0 Skip to Content Technologies Emerging Technology Post Quantum Encryption Artificial Intelligence Cybersecurity About Us Who We Are Leadership Services Federal Market Assessment Federal Launch Program Federal Value Alignment Program Federal Sales Acceleration Program Partnerships Carahsoft Emagine IT Magnetude Consulting Federal Value Alignment Program Customer Success Studies Upcoming Events Resources Contact Us Talk Now Open Menu Close Menu Technologies Emerging Technology Post Quantum Encryption Artificial Intelligence Cybersecurity About Us Who We Are Leadership Services Federal Market Assessment Federal Launch Program Federal Value Alignment Program Federal Sales Acceleration Program Partnerships Carahsoft Emagine IT Magnetude Consulting Federal Value Alignment Program Customer Success Studies Upcoming Events Resources Contact Us Talk Now Open Menu Close Menu Folder: Technologies Back Emerging Technology Post Quantum Encryption Artificial Intelligence Cybersecurity Folder: About Us Back Who We Are Leadership Folder: Services Back Federal Market Assessment Federal Launch Program Federal Value Alignment Program Federal Sales Acceleration Program Folder: Partnerships Back Carahsoft Emagine IT Magnetude Consulting Federal Value Alignment Program Customer Success Studies Upcoming Events Resources Contact Us Talk Now Build your Government business with Marion Square Partners, where strategy & execution intersect. Our Mission Enable our clients to build successful Government businesses, through in-depth market research, actionable key insights and detailed data and funding analysis coupled with the highly effective sales execution services. The best approach to pursuing Government work is to have a well-defined sales plan based on actual market data, providing proper insights and intelligence to guide decisions and actions . \"Marion Square was able to understand our solution offering, its value to customers, and quickly generate a targeted campaign resulting in highly qualified customer meetings and immediate sales.\" — SAFR (Facial Recognition Company) What makes our engagement successful? The genesis of our very name is built around the history of the square as a gathering place that brought people together. Let’s get in touch. The only way to find out if we can add muscle to your efforts and make sure we are a great fit – is to talk to us. Please connect directly with by filling in the form. We are located in: Washington D.C. Palo Alto CA info@marion-square.com Name * First Name Last Name Email * Message * Thank you!  We’ll be in touch within 24 hours. Market Assessment Opportunity Identification Reseller onboarding Target agency identification Potential System Integrator partnership identification Strategy Sales planning Partner mapping Defining execution plan Execution Sales support Proposal writing SBIR support Dedicated research analyst Messaging and outreach Sign up for our Monthly Newsletter First Name Last Name Email Address Sign Up Thank you!"
    },
    {
      "url": "https://antiquemallofmarietta.com/contact/",
      "text": "Contact – ANTIQUE MALL OF MARIETTA Skip to content ANTIQUE MALL OF MARIETTA Retail Antique Store Menu + × expanded collapsed Contact Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch 135 2ND STREET MARIETTA , OH 45750 USA sherryosburn62@yahoo.com (740)-376-0038 Instagram Facebook Twitter WordPress Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning Message (required) Warning Warning. Submit Δ Like Loading... ANTIQUE MALL OF MARIETTA , Blog at WordPress.com. Subscribe Subscribed ANTIQUE MALL OF MARIETTA Sign me up Already have a WordPress.com account? Log in now. ANTIQUE MALL OF MARIETTA Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://www.marionskitchen.com/contact-us/",
      "text": "Contact Marions Kitchen: how to get in touch | Marion's Kitchen SALE Our Stainless Steel and Non-Stick Range Hot Wok Offer Search ... Results See all results MARION x SBS FOOD RECIPES ARTICLES FOOD PRODUCTS SHOP BLOGS Cookbooks The Essential Wok Companion Mama Noi Always Delicious Just As Delicious Marion: The Hungry Cook All Cookbooks SHOP ALL Cookware MAKO Black Steel 14 Wok Kit MAKO Black Steel Steak Pan All Black Steel Cookware 5-Ply Stainless Steel 5-Ply Plasma Non-Stick Aero Non-Stick Roasters Cookware Sets All Cookware Kitchenware MAKO Japanese Steel Knives MAKO Wooden Chopping Boards Recycled Plastic Chopping Boards All Kitchenware Homewares All Dinnerware Serveware All Homewares SHOP BEST-SELLING COOKWARE & HOMEWARES SALE Our Stainless Steel and Non-Stick Range Hot Wok Offer Search ... Results See all results RECIPES ARTICLES FOOD PRODUCTS SHOP MARION x SBS FOOD SHOP BEST-SELLING COOKWARE & HOMEWARES Contact us We love feedback. Good or bad! Send us your reviews, ask a question about Marion’s Kitchen Food products, cookbooks or recipes; or get in touch B2B to partner with us. Choose you request below, fill in the form and we’ll be in touch. Review our Marion’s Kitchen Food Dishes Ask us a question about Marion’s Kitchen Food Products Have a question about your Marion’s Kitchen order? Want to talk to us about partnership opportunities? Review our Marion’s Kitchen Food Dishes Ask us a question about Marion’s Kitchen Food Products Fill out my Wufoo form! Have a question about your Marion’s Kitchen order? Fill out my Wufoo form! Want to talk to us about partnership opportunities? Fill out my Wufoo form! FOOD PRODUCTS Meal Kits​ Curry Paste​ Condiments Dressings Marinades Where to Buy EXPLORE Recipes​ Articles About Us Shop Marinades Blogs WORK WITH US​ Media Partnerships Publishing Partnerships Corporate & Bulk sales GET HELP​ FAQ Contact Us Shipping and Delivery Returns and Exchanges Terms and Conditions Privacy Policy | Terms of Service | © 2025 Marion's Kitchen Facebook Instagram Youtube Twitter Pinterest Tiktok Stay in touch with my latest recipes and updates! Privacy Policy | Terms of Service | Copyright © 2025 Marion's Kitchen. We use cookies on our website to enhance your browsing experience and to analyze our website traffic. By clicking “Accept”, you consent to the use of ALL cookies. Cookie Settings Accept Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT Powered by"
    },
    {
      "url": "https://www.marinersofmaine.com/team/staff",
      "text": "Maine Mariners | Front Office Staff Maine Mariners Tickets Single Game Tickets Season Tickets Hospitality Pack Group Tickets Flex Plans Family Four Pack Premium Seating Birthday Parties Business Packages Fundraising Fan Experiences Team 2025-2026 Schedule Roster Hockey Operations Staff Front Office Staff Stats Standings Team History Contact Us Employment Opportunities Game Day 2025-2026 Schedule Upcoming Games Promotional Schedule Where to Stay EGCU Three Stars of the Game Contact Us Media News Watch Live (FloHockey) Listen Live (Mixlr) YouTube Channel Coach's Show Archives Media Credential Request Creator Network 2024-25 Official Media Guide Community Read with ME Appearance Request Donation Request Verizon Breakaway Player Visits Community Spotlight Table Captain Joel Barnes Award Casella Chuck-A-Puck Goals For Food Hannaford To Go Kids Corner NEWS CENTER Maine STORM CENTER Box Fan Zone Team Store Beacon's Kids Club Birthday Parties Jordan's Furniture Shoot to Win Portland Vet Pet of the Game Maine Hockey History About Our Logo Beacon's Nest Hockey 101 Newsletter Sign Up Sign up for Text Alerts Partners Our Partners Partnership Opportunities Partner Benefits for STHs VIP Rivalry Cup Business Enter to Win Shop Schedule Get Tickets Ticket Categories Season Tickets Flex Plans Hospitality Pack Group Tickets Premium Seating Birthday Parties Single Game Tickets Fundraising Business Packages Fan Experiences Ticket Donation Program Family Four Pack Toggle Menu Schedule Tickets Single Game Tickets Season Tickets Hospitality Pack Group Tickets Flex Plans Family Four Pack Premium Seating Birthday Parties Business Packages Fundraising Fan Experiences Team 2025-2026 Schedule Roster Hockey Operations Staff Front Office Staff Stats Standings Team History Contact Us Employment Opportunities Game Day 2025-2026 Schedule Upcoming Games Promotional Schedule Where to Stay EGCU Three Stars of the Game Contact Us Media News Watch Live (FloHockey) Listen Live (Mixlr) YouTube Channel Coach's Show Archives Media Credential Request Creator Network 2024-25 Official Media Guide Community Read with ME Appearance Request Donation Request Verizon Breakaway Player Visits Community Spotlight Table Captain Joel Barnes Award Casella Chuck-A-Puck Goals For Food Hannaford To Go Kids Corner NEWS CENTER Maine STORM CENTER Box Fan Zone Team Store Beacon's Kids Club Birthday Parties Jordan's Furniture Shoot to Win Portland Vet Pet of the Game Maine Hockey History About Our Logo Beacon's Nest Hockey 101 Newsletter Sign Up Sign up for Text Alerts Partners Our Partners Partnership Opportunities Partner Benefits for STHs VIP Rivalry Cup Business Enter to Win Shop Home Front Office Staff Dexter Paine Owner/Governor Dexter Paine is a lifelong athlete, an accomplished businessman, and a global sport leader. Paine purchased the Mariners from Comcast Spectacor in 2024. A business executive with over three decades of private equity experience, Dexter is Chairman of Paine Schwartz Partners, a leading global private equity firm focused on investing in sustainable food & agribusiness. He co-founded the firm in 1997 and has been at the forefront of his industry, investing in the global food and agricultural industry and serving as a respected speaker on the business sector. During his career, Dexter has chaired many private and public companies, is involved in numerous not-for-profit organizations, and is the Chairman Emeritus of Holderness School. A lifelong sports enthusiast and NCAA ski racer while on the Williams College Ski Team, he served as chairman of the Olympic governing body U.S. Ski and Snowboard for 13 years. During his tenure, the organization saw its greatest success in history, earning 56 Olympic medals, establishing a strong business model, and providing athletes with a platform for Olympic success. For four years prior to his term as chairman of the Olympic governing body, he also served as president of the organization’s Foundation. Dexter also serves on the Board of US Biathlon and, US Olympic & Paralympic Committee. He extended his sport leadership to a global platform, serving since 2014 as an elected member of the International Ski Federation’s Council. Paine has also served on the executive committee for the 2015 FIS World Alpine Ski Championships in Vail/Beaver Creek and the 2019 World Freeski, Freestyle, and Snowboard Championships in Utah. He was the 2020 recipient of the Julius Blegen Award, the highest honor bestowed for service by U.S. Ski & Snowboard. Adam Goldberg Chief Executive Officer/Alternate Governor 📞: 207-761-4366 📧: agoldberg@mainemariners.com Adam Goldberg joined the Mariners in June 2017 as the Vice President of Business Operations, eventually being promoted to CEO in 2024. Goldberg worked with Comcast Spectacor since 2006 when he was with the Philadelphia Phantoms of the AHL. He then moved to Memphis to work with the Memphis Redbirds, the Triple-A baseball affiliate of the St. Louis Cardinals. Most recently, Adam worked with the Hartford Wolf Pack, the AHL affiliate of the New York Rangers. Born and raised in New Jersey before moving west and attending Arizona State University for a marketing degree. Adam is passionate about food and art and lives in Scarborough with his wife and three children. Sam Murray Vice President of Sales & Strategy 📞: 207-761-4363 📧: smurray@mainemariners.com Sam Murray began as an Account Executive in the summer of 2021 and was promoted to Director of Sales in the spring of 2023. He was then promoted to VP of Sales & Strategy in the winter of 2024. Sam is originally from Rochester, NY where he grew up playing hockey and baseball. His family had a summer home in Biddeford which led to Sam falling in love with Maine. Sam attended the University of New England and graduated in 2020 with a degree in Sport Management and a minor in Business Administration. While at the University of New England, Sam had numerous internships including the Cape Cod Baseball League and the Maine Celtics. After graduating, Sam spent time as a sales associate for the New Hampshire Fisher Cats baseball team. Sam currently resides in downtown Portland and enjoys playing pond hockey and trying new restaurants. Layne Audet Coordinator, Ticket Operations and Business Analytics 📞: 207-761-6726 📧: laudet@mainemariners.com Layne joined the Mariners in October 2023 as a Sales Associate. She was promoted to Coordinator, Ticket Operations and Business Analytics in the beginning of January 2024. Layne is a recent graduate of University of Maine at Orono with a degree in Marketing and Management. It was there, volunteering at UMaine hockey games, that she found her passion working in sports. In her free time, Layne likes to go to concerts, travel, and spend time with friends. She also looks forward to seeing family at her camp up north during the warmer months. Pat Sullivan Senior Manager of Ticket Sales 📞: 207-761-6725 📧: psullivan@mainemariners.com Pat Sullivan started working with the Mariners sales team in June 2021 as an Account Executive. He was promoted to Senior Account Executive in July 2023, then to Group Sales Manager in August 2024, and most recently became Senior Manager of Ticket Sales in April 2025. Pat is originally from South Portland and graduated from Lasell University in 2020 with a degree in sport management and a minor in sport communication. He went on to earn a Master of Science in management from Lasell in 2021. During college, he interned with IMG Learfield at Boston College and worked as a Game Day Associate with the Portland Sea Dogs. Outside of work, Pat enjoys traveling and exploring new cities with his girlfriend, camping with his family, and golfing in the summer. Cavan Weggler Group Sales Manager 📞: 207-761-9584 📧: cweggler@mainemariners.com Cavan Weggler is the Group Sales Manager for the Mariners, having been promoted to the role in April 2025. He originally joined the organization as an Account Executive in June 2022 and was elevated to Senior Account Executive in August 2024. A graduate of the University of Southern Maine, Cavan holds a B.S. in both Sport Management and Finance. During his time in school, he interned with the Maine Celtics, contributing to the sales department and assisting in box office operations on game nights. He also worked as a gameday sales associate with the Portland Sea Dogs during the 2021 season. Raised in Somerset County, Cavan now lives in East Deering. In his free time, he enjoys attending sporting events, traveling, and spending quality time with friends and family at his camp on the Mid Coast. Tyler Case Business Development Manager 📞: 207-761-4367 📧: tcase@mainemariners.com Tyler Case joined the Maine Mariners in June 2023 as an Account Executive, and was promoted to Business Development Manager in April of 2025. Tyler is originally from New York City. Prior to joining the Mariners, Tyler worked with Champions for Philanthropy, a New York-based consulting firm which works with professional athletes on their philanthropic pursuits. Tyler received his undergraduate degree from the University of San Francisco. He then earned his Masters in Sports Business from New York University. Tyler currently resides in downtown Portland. Outside of the office, Tyler is an avid sports fan and an avid outdoorsman, spending as much time on the water as he can. Ian Harmon Senior Account Executive 📞: 207-761-4364 📧: iharmon@mainemariners.com Ian Harmon joined the Mariners front office staff in 2022 and became an Account Executive in the spring of 2023. Ian is a graduate of Xavier University in Cincinnati, Ohio with a B.S. in Sport Management and a minor in Business. After graduating Ian was the program director for the North Conway Community Center and later worked in sales and golf services for TopGolf in Richmond, VA. In his free time Ian likes to cook, try new restaurants, attend live events around Portland and is always up for 9 or 18 holes. Sinead Scott Senior Account Executive 📞: 207-761-4361 📧: sscott@mainemariners.com Sinead Scott joined the Mariners in October 2023 as an Account Executive. She graduated from the University of New England with a degree in English and a focus in sales. After graduating she worked for the past two years as an Account Manager for BHG Financial. Sinead is a Portland native and finally returned home after spending her post college years traveling, living in Scottsdale, Boston, Syracuse and on Grand Manan Island off the coast of Canada. She enjoys walking her dog, skiing, and surfing. She grew up playing Soccer and hockey and is thrilled to be back in the sports community. Jack Ellis Account Executive 📞: 207-671-7075 📧: jellis@mainemariners.com Jack Ellis joined the Mariners as an Account Executive in May 2025. He earned his Bachelor of Science in Business Administration with a concentration in Sport Management from Nichols College, where he is also currently pursuing his MBA. While at Nichols, Jack competed in the National Collegiate Sports Sales Championship in Atlanta, Georgia, finishing in the top 32 nationally and helping his team secure a top 5 overall placement. Originally from Hampton, New Hampshire, Jack enjoys golfing, surfing, and fishing in his free time. As a former college lacrosse player, he’s excited to return to the New England hockey community and bring his passion for sports into his professional career. Noah Chretien Account Executive 📞: 207-749-6087 📧: nchretien@mainemariners.com Noah Chretien joined the Maine Mariners in May of 2025 as an account executive. Noah is a recent graduate of the University of Maine with a degree in Management, Marketing, and Sport Management. While President of the Sport Management Club and working for the athletic events staff at the university, Noah found his passion for sports, especially hockey. Noah also participated in a gameday associates internship with the Portland Sea Dogs during the 2024 season. Noah, being raised in Southern Maine, is very familiar with the Portland landscape. In his free time, he likes to golf with friends, attend sporting events, and travel wherever possible. Ian Nagle Director of Finance 📧: inagle@mainemariners.com Ian Nagle joined the Mariners in October 2024 as the Director of Finance. Nagle has worked for Village Builders, a custom home company in Gorham as well as working for Stone Coast Fund Services in Portland. Born and raised in Bangor, Maine, Ian then attending the University of Southern Maine for Business and colligate basketball. Ian is passionate about volleyball and soccer leagues and lives in Scarborough. Kathryn Horrigan Director of Marketing 📞: 207-749-6087 📧: khorrigan@mainemariners.com Kathryn Horrigan joined the Mariners in August of 2024 as the Director of Marketing. Previously she worked with the Boston Red Sox and was a part of their 2018 World Series winning game day staff. In addition to her experience with the Boston Red Sox, she worked as the Marketing Manager for the Salem, Massachusetts Tourism Board, who saw a total of 1.2 million visitors in their 2023 Haunted Happenings Festival. Kathryn grew up on the North Shore and graduated from Johnson & Wales University with a Bachelor of Science in Hospitality Management, and a Master of Science in Sustainable Economic Development. In her free time Kathryn enjoys spending time outdoors, attending concerts, traveling, and getting together with her loved ones. Michael Keeley Director of Media Relations & Broadcasting 📞: 207-761-0589 📧: mkeeley@mainemariners.com Michael Keeley joined the Mariners as Media Relations and Broadcast Manager in July 2018, just before the inaugural season began. He was promoted to Director of Media Relations & Broadcasting in July 2023. Keeley has been broadcasting hockey for almost 15 years, at many different levels. Prior to coming to Maine, he spent four seasons in the North American Hockey League – three with the Austin Bruins (Austin, MN) between 2015-2018. Keeley has also called baseball, most notably with the Northwoods League’s Rochester Honkers (Rochester, MN) from 2016-2018. He was named Northwoods League “Announcer of the Year” in 2017. He is a 2013 graduate of the State University of New York at Oswego with a B.A. in Broadcasting and Mass Communication. Keeley is originally from Rochester, NY and now lives in Brunswick, ME. Jordan Place Director of Partnerships 📞: 207-761-4362 📧: jplace@oakviewgroup.com Jordan Place has been the Mariners Director of Partnerships since the team began, starting in January of 2018. Place spent two years with the previous Cross Arena tenant, Portland Pirates, from 2014-2016 as Account Executive and Assistant Director of Ticket Operations. During the year plus hiatus of minor league hockey in Portland, Jordan spent time with the Maine Red Claws as Account Executive and Manager of Business Development. He graduated from the University of New England in 2010 and obtained his Master’s Degree in Sport Management from Texas Tech University in 2012. Place is a native of Portland, ME and currently resides in Scarborough, ME with his wife, Rebecca and two children, Jaxon and Reese. Kelly McCarthy Merchandise and E-Commerce Coordinator 📞: 207-761-9741 📧: kmccarthy@mainemariners.com Kelly McCarthy joined the Mariners in May 2025 as the Merchandise and E-Commerce Coordinator. A graduate of the University of New England, she earned her degree in Business Administration with a minor in Applied Mathematics. Kelly first connected with the Mariners through the UNE Sports Business Fellowship Program, where she supported projects focused on fan experience and business operations. A lifelong hockey player and former NCAA Division III student-athlete at UNE, Kelly brings a deep understanding of the sport and its culture to her role. She previously gained marketing and customer experience skills through internships in the financial services industry, and she now applies that knowledge to drive merchandise strategy and grow the team’s e-commerce presence. Outside the rink, Kelly enjoys staying active, painting, and spending time with friends and family. Sophia Frenyea Game Presentation & Promotions Coordinator 📞: 207-756-6846 📧: sfrenyea@mainemariners.com Sophia Frenyea joined the Mariners in July of 2025 as the Game Presentation & Promotions Coordinator. She graduated from SUNY Potsdam with majors in both Communications and Business Administration. Before this role, Sophia spent the 2024–2025 season interning with the AHL Utica Comets as a Game Presentation Associate, where she honed her skills and grew her appreciation for not only the professional sports industry, but hockey in itself. She has previously gained experience in marketing through leading Social Media Coordination efforts for local businesses in her hometown. Moving from Upstate New York to Portland, Sophia is most looking forward to exploring all that Maine has to offer, seeing a puffin in real life, and adding to the success of the Mariners organization. ECHL Network Teams ECHL Teams Adirondack Thunder Allen Americans Atlanta Gladiators Bloomington Bison Cincinnati Cyclones Florida Everblades Fort Wayne Komets Greensboro Gargoyles Greenville Swamp Rabbits Idaho Steelheads Indy Fuel Iowa Heartlanders Jacksonville Icemen Kalamazoo Wings Kansas City Mavericks Maine Mariners Norfolk Admirals Orlando Solar Bears Rapid City Rush Reading Royals Savannah Ghost Pirates South Carolina Stingrays Tahoe Knight Monsters Toledo Walleye Trois-Rivières Lions Tulsa Oilers Utah Grizzlies Wheeling Nailers Wichita Thunder Worcester Railers ECHL.com ECHL.com Tickets Schedule Scores Statistics Press Releases ECHL.TV ECHL Hall of Fame ECHL All Star Classic ECHL Kelly Cup Playoffs ECHL Store ECHL Careers ECHL Partners ECHL Partners AMI Graphics Athletic Knit Baron Championship Rings BFL Canada DASH Fairly Group HotelPlanner Howies Hockey Tape Inglasco Prolific 1 SponsorCX Sutton Special Risk TeamWork Online Warrior Maine Mariners 94 Free Street Portland,\n                        ME 04101 Contact Privacy Policy Terms Your Privacy Choices Employment Opportunites © 2025 Maine Mariners"
    }
  ]
}