{
  "fuentes": [
    {
      "url": "https://nifca.gov.uk/contact/",
      "email": "nifca@nifca.gov.uk"
    },
    {
      "url": "https://www.northbondifish.com.au/contact-us",
      "email": "res.northbondifish@solotel.com.au"
    },
    {
      "url": "https://thenorthbeachfishcamp.com/private-dining/",
      "email": "laura@southerntablehospitality.com"
    },
    {
      "url": "https://thenorthbeachfishcamp.com/private-dining/",
      "email": "laura@southerntablehospitality.com"
    },
    {
      "url": "https://thenorthbeachfishcamp.com/gallery/",
      "email": "info@thenorthbeachfishcamp.com"
    },
    {
      "url": "https://www.jacksonville.com/story/entertainment/local/2012/08/17/dining-notes-north-beach-fish-camp-opens-neptune/15857315007/",
      "email": "gary.mills@jacksonville.com"
    },
    {
      "url": "https://www.jacksonville.com/story/entertainment/local/2012/08/17/dining-notes-north-beach-fish-camp-opens-neptune/15857315007/",
      "email": "gary.mills@jacksonville.com"
    }
  ],
  "mails": [
    "gary.mills@jacksonville.com",
    "info@thenorthbeachfishcamp.com",
    "laura@southerntablehospitality.com",
    "nifca@nifca.gov.uk",
    "res.northbondifish@solotel.com.au"
  ],
  "nombre_sitio": "thenorthbeachfishcamp.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://nifca.gov.uk/contact/",
      "text": "Contact - NIFCA Skip to content About us About NIFCA News Publications Membership Consultations NIFCA Officers and Staff Vessels and Equipment Commercial Fisher Forums Apply for a Permit Permit Returns Fisheries Management Plans (FMPs) Recreational Guidance Codes of Conduct Apply for a Permit Sea Angling Fisheries Management Plans (FMPs) Conservation & Research Crab & Lobster Other Fisheries Research Marine Protected Areas Marine Licensing & Planning Species Byelaws Contact Contact Home > Contact Contact Please get in touch using the contact details provided or alternatively, fill in the form below. Address NIFCA 8 Ennerdale Road Blyth Northumberland NE24 4RT Telephone 01670 797676 E-mail nifca@nifca.gov.uk \" * \" indicates required fields Name * Company E-mail Address * Message * X/Twitter This field is for validation purposes and should be left unchanged. Other pages in this section Complaints Reporting Lost + found tags Reporting suspicious behaviour Quick Links Publications FAQs Careers Members Area Prosecutions News Follow Us Newsletter Sign-up Name (Required) Email (Required) © NIFCA 2025 Terms\n                    and Conditions Privacy\n                    Policy Web Design Newcastle by Urban River Go Home About us About NIFCA News Publications Membership Consultations NIFCA Officers and Staff Vessels and Equipment Commercial Fisher Forums Apply for a Permit Permit Returns Fisheries Management Plans (FMPs) Recreational Guidance Codes of Conduct Apply for a Permit Sea Angling Fisheries Management Plans (FMPs) Conservation & Research Crab & Lobster Other Fisheries Research Marine Protected Areas Marine Licensing & Planning Species Byelaws Contact This site uses cookies We use cookies to give you the best browsing experience.\n                                We require your consent to store cookies for certain categories of functionality. Required Analytics Marketing Third Party Accept and\n                                Close More\n                                Info"
    },
    {
      "url": "https://www.northbondifish.com.au/contact-us",
      "text": "Contact North Bondi Fish - Get in Touch Skip to main content Book Now MENU MENU FOOD DRINKS KIDS GROUPS TAKEAWAY ORDER TAKEAWAY WHAT'S ON WHAT'S ON ROLL OF FORTUNE MELBOURNE CUP DJs AT NBF TAKEAWAY NBF APERIDISCO PLAN AN EVENT PLAN AN EVENT EVENT ENQUIRY ABOUT ABOUT ABOUT NBF MATT MORAN FAQS SUSTAINABILITY GIFT CARDS SIGN UP GIFT CARDS CONTACT US JOIN OUR TEAM Book Now Back MENU MENU FOOD DRINKS KIDS GROUPS TAKEAWAY ORDER TAKEAWAY WHAT'S ON WHAT'S ON ROLL OF FORTUNE MELBOURNE CUP DJs AT NBF TAKEAWAY NBF APERIDISCO PLAN AN EVENT PLAN AN EVENT EVENT ENQUIRY ABOUT ABOUT ABOUT NBF MATT MORAN FAQS SUSTAINABILITY GIFT CARDS SIGN UP GIFT CARDS CONTACT US JOIN OUR TEAM Book Now MORE OPTIONS Learn more about Solotel TRADING HOURS Opening Hours Mon | 12pm - 10pm Tues | 12pm - 10pm Weds | 12pm - 10pm Thurs | 12pm - 10pm Fri - Sat | 12pm - 11pm Sun | 12pm - 10pm Book now - All credit card transactions incur a 1% transaction fee. - A 15% surcharge is payable on Public Holidays. 10% surcharge applies on Sundays and groups of 8+. CONTACT US 120 Ramsgate Avenue, North Bondi, 2026 Australia (Under the North Bondi RSL) 02 9130 2155 res.northbondifish@solotel.com.au Our phone lines & Live Chat Agents are open: Sun-Wed: 10am - 8pm Thu - Sat: 10am - 9pm Forgot to grab the receipt? Request a copy here. Join Our Mailing List Stay up-to-date with the latest news, events and special offers. Reservations MAKE RESERVATION Opening hours Opening Hours Mon | 12pm - 10pm Tues | 12pm - 10pm Weds | 12pm - 10pm Thurs | 12pm - 10pm Fri - Sat | 12pm - 11pm Sun | 12pm - 10pm Location 120 Ramsgate Avenue, North Bondi, Australia 2026 02 9130 2155 res.northbondifish@solotel.com.au Privacy Policy & Collection Statement Seafood Restaurant Bondi, Matt Moran Restaurant, Cocktail Bars Bondi, Live DJ's Bondi. Learn more about Solotel"
    },
    {
      "url": "https://thenorthbeachfishcamp.com/private-dining/",
      "text": "Private Dining | The North Beach Fish Camp Order Online Menu About Blog Gallery Join Our Team Gift Cards Order Online Reservations Reservations Catering & Private Dining Contact Private Dining Want to throw a party? For parties of 16 more or if you wish to book a room for a special occasion, please contact Laura Hayes, Director of Events and Catering, at 904-654-9877 or email laura@ southerntablehospitality.com Please contact our Special Events Planner: Laura Hayes Director of Sales & Marketing O: (904) 654-9877 Laura@southerntablehospitality.com ONLINE RESERVATIONS Call us at (904) 249-3474 to make a reservation, or make one online by clicking the button below. Book your North Beach Fish Camp reservation on Resy SHOP Shop Gift Cards Gift Cards St. Augustine Fish Camp 142 Riberia St St. Augustine, FL 32084 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 827-7000 Follow Follow Palm Valley Fish Camp 299 Roscoe Blvd N Ponte Vedra Beach, FL 32082 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 285-3200 Follow Follow Follow Julington Creek Fish Camp 12760 San Jose Blvd Jacksonville, FL 32223 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 886-2267 Follow Follow North Beach Fish Camp 100 First St Neptune Beach, FL 32266 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 249-3474 Follow Follow DINE WITH THE SOUTHERN TABLE HOSPITALITY FAMILY Online Ordering Private Dining Careers Contact join our growing team Order Online leave us a review Follow Follow Copyright © 2025 | North Beach Fish Camp English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Accessibility  Adjustments Powered by OneTap Select your accessibility profile Vision Impaired Mode Enhances website's visuals Seizure Safe Profile Clear flashes & reduces color ADHD Friendly Mode Focused browsing, distraction-free Blindness Mode Reduces distractions, improves focus Epilepsy Safe Mode Dims colors and stops blinking Content Bigger Text Cursor Line Height Letter Spacing Readable Font Dyslexic Font Align Text Text Magnifier Highlight Links Colors Invert Colors Brightness Contrast Grayscale Saturation Orientation Reading Line Keyboard Navigation Highlight Titles Reading Mask Hide Images Highlight Al Read Page Mute Sounds Stop Animations Reset Settings Version 6.2.0"
    },
    {
      "url": "https://thenorthbeachfishcamp.com/gallery/",
      "text": "Gallery | The North Beach Fish Camp Order Online Menu About Blog Gallery Join Our Team Gift Cards Order Online Reservations Reservations Catering & Private Dining Contact Gallery As you can see, good times never end here at North Beach Fish Camp! Besides our creative menu, our scenic view and lively atmosphere make us the perfect dining spot in Neptune Beach! If you haven’t dined at the North Beach Fish Camp recently, here is where you can get a picture of who we are here and what we’re all about. Click on a photo to enlarge it, then use the arrows provided to view other photos. Have any great shots of you and your friends dining at the North Beach Fish Camp? Send them our way! info@thenorthbeachfishcamp.com ONLINE RESERVATIONS Call us at (904) 249-3474 to make a reservation, or make one online by clicking the button below. Book your North Beach Fish Camp reservation on Resy SHOP Shop Gift Cards Gift Cards St. Augustine Fish Camp 142 Riberia St St. Augustine, FL 32084 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 827-7000 Follow Follow Palm Valley Fish Camp 299 Roscoe Blvd N Ponte Vedra Beach, FL 32082 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 285-3200 Follow Follow Follow Julington Creek Fish Camp 12760 San Jose Blvd Jacksonville, FL 32223 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 886-2267 Follow Follow North Beach Fish Camp 100 First St Neptune Beach, FL 32266 Sunday - 11am - 9pm Monday - 4pm -9pm Tuesday- 11am -9pm Wednesday - 11am -9pm Thursday- 11am -9pm Friday - 11am -10pm Saturday - 11am -10pm [map] (904) 249-3474 Follow Follow DINE WITH THE SOUTHERN TABLE HOSPITALITY FAMILY Online Ordering Private Dining Careers Contact join our growing team Order Online leave us a review Follow Follow Copyright © 2025 | North Beach Fish Camp English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Accessibility  Adjustments Powered by OneTap Select your accessibility profile Vision Impaired Mode Enhances website's visuals Seizure Safe Profile Clear flashes & reduces color ADHD Friendly Mode Focused browsing, distraction-free Blindness Mode Reduces distractions, improves focus Epilepsy Safe Mode Dims colors and stops blinking Content Bigger Text Cursor Line Height Letter Spacing Readable Font Dyslexic Font Align Text Text Magnifier Highlight Links Colors Invert Colors Brightness Contrast Grayscale Saturation Orientation Reading Line Keyboard Navigation Highlight Titles Reading Mask Hide Images Highlight Al Read Page Mute Sounds Stop Animations Reset Settings Version 6.2.0"
    },
    {
      "url": "https://www.jacksonville.com/story/entertainment/local/2012/08/17/dining-notes-north-beach-fish-camp-opens-neptune/15857315007/",
      "text": "Dining Notes: North Beach Fish Camp opens in Neptune Beach News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals LOCAL Dining Notes: North Beach Fish Camp opens in Neptune Beach Gary T. Mills It's been a busy summer at the Beaches, as mentioned in this column a couple of weeks ago in our semiannual look at Jacksonville restaurant openings and closings. Today, we'll take a closer look at a couple of those. Open a month at Beaches Town Center, North Beach Fish Camp debuted its second-floor bar and dining area last weekend, offering diners first come-first served seating - and a view. Downstairs, the restaurant offers a contemporary take on beach casual, with hardwood floors, bright white booths and floor-to-ceiling windows offering views of busy First Street, thanks to an extensive remodel from the colorful, tropical flair of Caribbee Key Island Grill . North Beach Fish Camp is the latest restaurant from Lisa and Ben Groshell , the chef/owner of Beaches fine-dining mainstay Marker 32 and 3-year-old Palm Valley Fish Camp in Ponte Vedra Beach. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. North Beach and Palm Valley are sister restaurants, sharing a similar logo, atmosphere and menu. Among the selections on the menu are: Appetizers: Raw Select Oysters on the Half Shell ($7, ½ dozen; $12, dozen); New England Steamer Clams with Drawn Butter ($14); Peel & Eat May port Shrimp Cocktail ($9); Grilled Octopus & White Bean Salad ($9) Entrees: Mayport Shrimp & Creamy Grits ($18); Blue Crab Cakes with Caper Aioli & Side ($18); and Scallops & Andouille Sausage with Tomato, White Beans & Spinach ($23). There's also Low Boil Shrimp, Clams, Crawfish and Andouille for Two ($36); Buttermilk Pan Fried Chicken Breast with Grits, Collard Greens & Tasso Gravy ($14); and Top Sirloin Steak with Brandy Pepper Corn Demi served with Mixed Greens & Fries ($16). Fried Dinner Platters: Clam Strips ($14), Shrimp ($16), Fish Filet ($14), Oysters ($16), Scallops ($17), Deviled Crab (2 for $12). Located in Neptune Beach at 100 First St., North Beach Fish Camp is open 4 to 10 p.m. on Mondays and Tuesdays; and 11 a.m. to 10 p.m. Wednesday through Sunday. Urban Flats open in Jacksonville Beach In Jacksonville Beach, Urban Flats Flatbread & Wine Co. opened in mid-July after a lengthy stop-and-start build-out. The restaurant, at 131 First St. N. next to Campeche Bay , is the third Northeast Florida location and fifth for the Central Florida-based chain, according to the company's website. A large oval bar, with seating for 30, is the restaurant's focal point among the mix of booths and tables. But it's the large, outdoor covered patio that is sure to be a fan favorite. Separated from the bar by two large glass garage doors, the patio offers plenty of lounge seating cooled by overhead fans, an ideal setting for sipping wine and catching up with friends as the sun sets. A sample of the offerings from Urban Flats' menu: Gourmet flatbreads range from the Classic (basil pesto, roma tomatoes and mozzarella; $8.50) to Fig and Prosciutto ($9) to Chicken Caesar ($11), Turkey, Pear and Brie ($9.75) among the 18 varieties offered. Starters include Lobster Mac and Cheese ($9.25), Jumbo Lump Crab Cakes ($11.25), Loaded Potato Dip ($8.75) and others. Among the main courses are Chipotle Rubbed Bistro Steak ($12.75), Cedar-Planked Salmon ($12.75), Baja Fish Tacos ($10.75), Seasonal Ravioli ($12), Santa Fe Baby Back Ribs ($14). For lighter fare, look for a half-dozen salads ($7.50 to $9.75) and sandwiches, including Housemade Meatball ($10.25), Urban Chicken Salad ($8.25) and Artichoke, Wild Mushroom and Goat Cheese Flatwich ($9.25). More than 75 wines are featured on the well-organized menu, allowing novice drinkers and wine aficionados to quickly narrow their seach. Cocktails and beer are also offered. Urban Flats is open daily at 11 a.m. Underbelly adds lunch to downtown options Underbelly is one of downtown Jacksonville's newest lunch spots. The bar and live music venue that opened in early June at 113 E. Bay St. added a limited lunch menu this month, featuring: 18-Hour Pulled Pork Sliders: Two sliders served with chips ($6), baked beans ($7) or side salad ($8). Wood-Fired Flatbreads: Cheese ($5), Tomato/Basil/Goat Cheese ($7), Prosciutto/Garlic/Goat Cheese ($7), Pulled Pork ($8) or vegan-friendly Tomato/Basil /Garlic/Tempeh ($6) Owners Emily Moody and Cameron Beard have transformed the former Ivy Bar into a rustic, relaxed space for lunch and a popular live entertainment spot at night, hosting bands, comedians, jam sessions and more. Grab lunch at one of a handful of tables or at the bar, which features 32 beers on tap, including a selection from Jacksonville's Intuition Ale Works . Underbelly opens at 11 a.m. weekdays for lunch. More in the works With building permits issued in the last week, work has begun on a couple of noteworthy projects previously reported in this column, including: The Salty Fig: After launching their Salty Fig food truck earlier this summer , brothers Jeff and John Stanford are making progress on their southern gastropub at 901 King St., across from Kickbacks Gastrobup in the busy King Street District. The Loop Pizza Grill : A month after announcing its plans to build and open a new prototype restaurant , 31-year-old Jacksonville-based The Loop has begun work on the project at the St. Johns Town Center, next to Total Wine & More, at 4413 Town Center Parkway. Firehouse Subs: The Jacksonville-based sub sandwich chain will open a restaurant at 13470 Beach Blvd., near the recently opened First Watch . And the Shiny Spoon goes to ... After a summer-long drought, the \"Shiny Spoon\" award is back, thanks to a couple of food vendors at the Jacksonville Zoo and Gardens. Each week, the Florida Department of Business and Professional Regulation's Division of Hotels and Restaurants releases a list of restaurants, caterers and mobile food vendors that have received zero safety or sanitation violations during inspections within the last 12 months. Following inspections last week, the following have achieved that honor and are awarded a Shiny Spoon: Main Camp Café (non-seating), 370 Zoo Parkway. (three inspections, dating to Nov. 15, 2011) Sno Biz International (mobile food vendor), 370 Zoo Parkway. (three inspections, dating to June 6, 2011) Congratulations. gary.mills@jacksonville.com (904) 359-4422 twitter.com/garytmills facebook.com/jaxdiningnews Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Legal Notices Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper NIE Jobs Real Estate Classifieds Pay Your Ad Bill Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.jacksonville.com. All rights reserved."
    }
  ]
}