{
  "fuentes": [
    {
      "url": "https://www.thsca.com/",
      "email": "info@thsca.com"
    },
    {
      "url": "https://www.theoaxacaclub.com/menus",
      "email": "info@theoaxacaclub.com"
    },
    {
      "url": "https://surgetechak.com/contact/",
      "email": "sgoodwin@surgetechak.com"
    },
    {
      "url": "https://www.theoaxacaclub.com/",
      "email": "info@theoaxacaclub.com"
    },
    {
      "url": "https://www.theoaxacaclub.com/event-venues/oaxaca-lounge",
      "email": "info@theoaxacaclub.com"
    },
    {
      "url": "https://www.theoaxacaclub.com/reserve-table",
      "email": "info@theoaxacaclub.com"
    },
    {
      "url": "https://www.theoaxacaclub.com/cocktailmenu",
      "email": "info@theoaxacaclub.com"
    },
    {
      "url": "https://www.mciny.org/dinner-oaxaca",
      "email": "icumexny@sre.gob.mx"
    },
    {
      "url": "https://www.mciny.org/dinner-oaxaca",
      "email": "programs@mciny.org"
    },
    {
      "url": "https://discover-oaxaca.com/contact/",
      "email": "guide@discover-oaxaca.com"
    }
  ],
  "mails": [
    "guide@discover-oaxaca.com",
    "icumexny@sre.gob.mx",
    "info@theoaxacaclub.com",
    "info@thsca.com",
    "programs@mciny.org",
    "sgoodwin@surgetechak.com"
  ],
  "nombre_sitio": "theoaxacaclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.thsca.com/",
      "text": "Texas High School Coaches Association (THSCA) | Helping Coaches Help Kids Our Pillars  Representation We are committed to every coach in every sport in every region of the country. THSCA Board of Directors Meet our Coaches Serving THSCA Regions 1-8 THSCEF Board of Directors Meet our Education Foundation Board Advisory Committees Contact Your Regional Representative Collaboration and Communication Committee Meet our Committee Members Urban/Rural ISD Advisory Committee Advising THSCA on Challenges Specific to Urban and Rural School Districts State and National Association Partners Partnerships for Personal and Professional Growth Regional Meetings Dates and Locations for our Eight THSCA Regions POI Meetings Dates and Locations for our Eight THSCA Regions ACC Tour Traveling the State to Visit our THSCA Coaches Advocacy Our network of support and advocacy was designed to put coaches in the best position to succeed no matter the circumstances. State Legislature Important Dates and Info on THSCA Lobbying Efforts UIL Legislative Council Council Information and Meeting Results Memorial Benefit Aid in the event of Death during U.I.L. Participation Permanent Injury Benefit Aid for those Permanently Injured during U.I.L. Participation Benevolence Fund Find out how to donate to help Coaches and Athletes in Need Our Day to Shine Download the Toolkit to host a Scrimmage Educate. Excel. Play. Protecting Education Based Athletics in Texas Straight Line Recruiting (SLR) FAQ and Recruiting Resources Professional Liability Insurance Policy Coverage Information Iron Sharpens Iron See Past Recipients and Program Information My Coaching Tree Job Board Member’s Only Access to Online Postings Tradeshow/Exhibits Upcoming Tradeshows & Exhibitor Info Future Coaches of Texas Info on Starting a Chapter at Your School THSCA Game of the Week Friday Night Lights FREE on Victory+ App Personal & Professional Development We provide personal and professional development through an array of online and in-person education and training across all sports. Coaching School Annual Convention Details UIL CCP Certification FAQ about Certification and Credit for Course Completion ROCK Mentoring Program Program Details and How to Get Involved Networking Opportunities See Upcoming Events The Coaches Call Podcast Listen and Share Episodes THSADA Texas High School Athletic Directors Association Info and Events The Texas Way Free Curriculum Resources for Sportsmanship Texas Coaches Leadership Tour Event Details and Registration Clinics Find Upcoming Clinics Across Texas High School Coaches Day Toolkit Downloadable Resource to Celebrate our Coaches 4 L's Curriculum Event Details and Speaker Line-up TASO Officials START Program Students Today are Referees Tomorrow – Program Info Health, Safety, and Wellness Resources, Documents, Articles and More – Provided by Dell Children’s Seat at the Table Event Information and How to Host THSCA CoachTube Library Lecture Videos from Past Events NIL Curriculum Information Resource for Coaches and Student-Athletes Texas Coach Magazine Free Access to Digital Issues Online Jason’s Foundation Suicide Prevention Training Suicide Prevention Guide for Coaches Awards & Recognition We are committed to celebrating​ the passion and commitment Texas high school in all sports have for developing our student-athletes through recognition and awards programs. Officials Appreciation Toolkit Downloadable Resources to Celebrate your Officials Teacher Appreciation Toolkit Downloadable Resources to Celebrate your Teachers Academic All-State See Honorees and Deadlines to Nominate for Each Sport Hall of Honor Banquet Information and Current Hall of Honor Members Coach of the Year See Honorees and Deadlines to Nominate for Each Sport Super Elite Teams See Honorees and Deadlines to Nominate for Each Sport Coach of the Week Meet the Recipients and Find out How to Nominate NFF Team Academic Award Nomination Criteria and Deadlines Trainer of the Year See Past Recipients Distinguished Service Award See Past Recipients Curly Hay's Official Award See Past Recipients Tom Landry Award See Past Recipients Jody Conradt Award See Past Recipients Coaching Beyond the Game Award See Past Recipients Putt Powell Sportswriter of the Year See Past Recipients THSCA Scholarships Criteria and Application Deadline Awards Deadline Download a Chart for All THSCA Competitions About Us  Staff Meet our Executive Staff Membership How to Become a Member Calendar Upcoming Deadlines and Events THSCA Board of Directors Meet our Coaches Serving THSCA Regions 1 - 8 Press Releases/Media THSCA Press Releases and THSCA In the News Sponsors Meet our THSCA Sponsors or Find out How to Become a Sponsor FAQ Contact Us Helpful Links THSCA Apparel Store Buy THSCA Branded Merchandise Convention  Registration Forms for Download and Online Options Hotels & Parking Book a Discounted Hotel Room Schedule & Speakers See our Tentative Agenda Exhibitors Reserve Your Booth for the Tradeshow Recommend a Speaker Media Press Conference Schedule and Media Credential Requests Education Foundation Membership Login a M Our Pillars  Representation We are committed to every coach in every sport in every region of the country. THSCA Board of Directors Meet our Coaches Serving THSCA Regions 1-8 THSCEF Board of Directors Meet our Education Foundation Board Advisory Committees Contact Your Regional Representative Collaboration and Communication Committee Meet our Committee Members Urban/Rural ISD Advisory Committee Advising THSCA on Challenges Specific to Urban and Rural School Districts State and National Association Partners Partnerships for Personal and Professional Growth Regional Meetings Dates and Locations for our Eight THSCA Regions POI Meetings Dates and Locations for our Eight THSCA Regions ACC Tour Traveling the State to Visit our THSCA Coaches Advocacy Our network of support and advocacy was designed to put coaches in the best position to succeed no matter the circumstances. State Legislature Important Dates and Info on THSCA Lobbying Efforts UIL Legislative Council Council Information and Meeting Results Memorial Benefit Aid in the event of Death during U.I.L. Participation Permanent Injury Benefit Aid for those Permanently Injured during U.I.L. Participation Benevolence Fund Find out how to donate to help Coaches and Athletes in Need Our Day to Shine Download the Toolkit to host a Scrimmage Educate. Excel. Play. Protecting Education Based Athletics in Texas Straight Line Recruiting (SLR) FAQ and Recruiting Resources Professional Liability Insurance Policy Coverage Information Iron Sharpens Iron See Past Recipients and Program Information My Coaching Tree Job Board Member’s Only Access to Online Postings Tradeshow/Exhibits Upcoming Tradeshows & Exhibitor Info Future Coaches of Texas Info on Starting a Chapter at Your School THSCA Game of the Week Friday Night Lights FREE on Victory+ App Personal & Professional Development We provide personal and professional development through an array of online and in-person education and training across all sports. Coaching School Annual Convention Details UIL CCP Certification FAQ about Certification and Credit for Course Completion ROCK Mentoring Program Program Details and How to Get Involved Networking Opportunities See Upcoming Events The Coaches Call Podcast Listen and Share Episodes THSADA Texas High School Athletic Directors Association Info and Events The Texas Way Free Curriculum Resources for Sportsmanship Texas Coaches Leadership Tour Event Details and Registration Clinics Find Upcoming Clinics Across Texas High School Coaches Day Toolkit Downloadable Resource to Celebrate our Coaches 4 L's Curriculum Event Details and Speaker Line-up TASO Officials START Program Students Today are Referees Tomorrow – Program Info Health, Safety, and Wellness Resources, Documents, Articles and More – Provided by Dell Children’s Seat at the Table Event Information and How to Host THSCA CoachTube Library Lecture Videos from Past Events NIL Curriculum Information Resource for Coaches and Student-Athletes Texas Coach Magazine Free Access to Digital Issues Online Jason’s Foundation Suicide Prevention Training Suicide Prevention Guide for Coaches Awards & Recognition We are committed to celebrating​ the passion and commitment Texas high school in all sports have for developing our student-athletes through recognition and awards programs. Officials Appreciation Toolkit Downloadable Resources to Celebrate your Officials Teacher Appreciation Toolkit Downloadable Resources to Celebrate your Teachers Academic All-State See Honorees and Deadlines to Nominate for Each Sport Hall of Honor Banquet Information and Current Hall of Honor Members Coach of the Year See Honorees and Deadlines to Nominate for Each Sport Super Elite Teams See Honorees and Deadlines to Nominate for Each Sport Coach of the Week Meet the Recipients and Find out How to Nominate NFF Team Academic Award Nomination Criteria and Deadlines Trainer of the Year See Past Recipients Distinguished Service Award See Past Recipients Curly Hay's Official Award See Past Recipients Tom Landry Award See Past Recipients Jody Conradt Award See Past Recipients Coaching Beyond the Game Award See Past Recipients Putt Powell Sportswriter of the Year See Past Recipients THSCA Scholarships Criteria and Application Deadline Awards Deadline Download a Chart for All THSCA Competitions About Us  Staff Meet our Executive Staff Membership How to Become a Member Calendar Upcoming Deadlines and Events THSCA Board of Directors Meet our Coaches Serving THSCA Regions 1 - 8 Press Releases/Media THSCA Press Releases and THSCA In the News Sponsors Meet our THSCA Sponsors or Find out How to Become a Sponsor FAQ Contact Us Helpful Links THSCA Apparel Store Buy THSCA Branded Merchandise Convention  Registration Forms for Download and Online Options Hotels & Parking Book a Discounted Hotel Room Schedule & Speakers See our Tentative Agenda Exhibitors Reserve Your Booth for the Tradeshow Recommend a Speaker Media Press Conference Schedule and Media Credential Requests Education Foundation Membership Login Serving Over 27,000 Members Helping Coaches Help Kids Largest Coaches Association in America, Serving Over 27,000 Members. THSCA Core Pillars Representation We are committed to representing every coach from every sport in every region of the state. Learn More Advocacy Our network of support and advocacy was designed to put coaches in the best position to succeed no matter the circumstance. Learn More Personal & Professional Development We provide personal and professional development through an array of online and in-person education and training across all sports. Learn More Awards & Recognition We are committed to celebrate the passion and commitment Texas high school coaches in all sports have for developing our student-athletes through recognition and awards programs. Learn More THSCA headline news Deadlines & Events 2025 OCTOBER 2025 Oct 5-6: THSADA Fall Forum Oct 13: Columbus Day Holiday Oct 19-20: UIL Legislative Council Meeting Oct 15: Deadline to turn in Hall of Honor Nominations for the Class of 2026 Oct 16: THSCA Membership Pricing Increases to Standard Rate of $90 Oct 22-23: Team Tennis State Championships- San Antonio Oct 24-25: Water Polo State Championships – Austin Our Sponsors and Partners CHAMPION CORNERSTONE TITLE PLATINUM GOLD SILVER BRONZE SUPPORTING Abilene Christian University Advanced Exercise/Hammer Strength Dynamic Fitness & Strength GRID Rubber Flooring Systems Sideline Power Spec Seats Sports Attack Team Express TeamFunded Alert Services Defiant Strength JUGS Sports Korney Board Aids M-F Athletic Modern Football Technology Pioneer Athletics SanMar Sports Victory Rings Wildcat Mfg. Mark Your Calendars November 7, 2025 Texas High School Coaches Day January 2026 – Various Dates Winter Power of Influence Meetings February 7, 2026 THSCA Regional Meetings January – April 2026 – Various Dates Texas Leadership Tour More THSCA? Watch Listen Read Become a THSCA Member! Learn More Keep Up With Us On ; THSCA @THSCAcoaches · 1 Jan 1874256143490465847 🌟THANK YOU to our 24-25 THSCA Supporting Sponsors!🌟 #THSCAStrong 🔗: http://thsca.com/sponsors Reply on Twitter 1874256143490465847 Retweet on Twitter 1874256143490465847 1 Like on Twitter 1874256143490465847 3 X 1874256143490465847 ; THSCA @THSCAcoaches · 31 Dec 1874183796183924955 👏Let's hear it for our 24-25 THSCA Title Sponsors!👏 Thank you for supporting our Texas coaches! #THSCAStrong @CoachComm @gamebreakerhg @GameOne_USA @UnderArmour @SportsImportsVB @HoustonTexans @TexasBowl @PCnowisthetime @Sorinex @SRChampRings 🔗: http://thsca.com/sponsors Reply on Twitter 1874183796183924955 Retweet on Twitter 1874183796183924955 3 Like on Twitter 1874183796183924955 11 X 1874183796183924955 ; THSCA @THSCAcoaches · 30 Dec 1873813847888285756 Something exciting is coming to THSCA👀 Stay tuned – the big reveal drops soon! #THSCANewLook Reply on Twitter 1873813847888285756 Retweet on Twitter 1873813847888285756 18 Like on Twitter 1873813847888285756 64 X 1873813847888285756 Retweet on Twitter THSCA Retweeted ; Ray Zepeda @ray_zepeda1 · 30 Dec 1873735955653546034 And away we go.......The @uiltexas soccer regular season begins today. Time to take those first steps to make dreams a reality. Best of luck to all athletes, coaches and officials on a great season. @tascosoccer @THSCAcoaches @AustinTGCA Reply on Twitter 1873735955653546034 Retweet on Twitter 1873735955653546034 16 Like on Twitter 1873735955653546034 91 X 1873735955653546034 Keep Up With Us On Who`s fired up for this week`s THSCA Game of the Week?🔥 We`ve got a great matchup in store for you as Longview HS and South Oak Cliff HS face off this Friday at 7:30 PM. Catch all the action for FREE on @victoryplus! 13 0 Open 🫵Are you in need of pregame or postgame meals for your team? How about community fundraisers or sponsorship opportunities? Raising Cane`s has got you covered!✅ Click the link in our bio to get connected with your local @raisingcanes! 6 0 Open Have you renewed your THSCA Membership for 25-26? Don`t miss out the chance to nominate your coaches & athletes for THSCA recognitions!📣 Renewal is available at the discounted $70 rate through Oct. 15! (Standard rate of $90 begins 10/16) 4 0 Open 📢CALLING ALL COACHES: THSCA is asking ALL sports to use their first home district game to celebrate our Texas Officials! Download the game toolkit by clicking the link in our bio and let`s recognize their efforts and the vital role they play in Texas high school competition!💫 7 0 Open PROTECTING EDUCATION-BASED ATHLETICS IN TEXAS⭐ Together, these associations represent coaches from every corner of the state in a historic and unified stand to protect education-based athletics—marking a first-of-its-kind collaboration that reinforces and strengthens this proud tradition of success. 47 0 Open Happy Birthday to THSCA Assistant Executive Director, Glen West! 🎉 Thank you for all that you do for us. We hope you have an amazing day!! 27 0 Open 𝗧𝗛𝗔𝗡𝗞 𝗬𝗢𝗨 to all of the school that participated in an Our Day to Shine scrimmage to benefit coaches and athletes in need around the state!💫 You make us #THSCAStrong💪 2 0 Open Want to nominate a coach for the THSCA Hall of Honor? Nominations must be submitted by October 15th for consideration for the Class of 2026. For selection criteria, rules for nomination and a list of current nominees➡️ thsca.com/hoh #THSCAHallofHonor 4 0 Open What Coaches Are Saying THSCA really is the greatest association on the planet. It is consistently evolving to keep coaches equipped to meet the ever-changing needs of this profession. There are personal benefits like the Professional Liability Insurance at a very low price. There are benefits to those in our care through the Benevolence Fund, and then of course the professional networking opportunities provided are second to none. Lee Wiginton Allen HS I have coached high school football in 2 other states. There is no comparison around the country to what the THSCA does for student-athletes, coaches and the state of Texas. I am an awe of what the THSCA represents. It separates Texas from every other state. James Williams Fort Bend Marshall HS This profession we’re in is undoubtedly challenging, but it’s also incredibly rewarding. Even on your toughest days, remember the impact you are making. The future of THSCA is incredibly bright, and witnessing it’s growth and how they work to represent all coaches, students and sports in this state has been an immense source of joy and inspiration for my coaching journey. Amanda Wolf-Schramm Smithson Valley HS Helping Coaches Help Kids Search for: Follow Follow Follow Mailing Address: P.O. Drawer 1138 San Marcos, Texas 78667 Email us: info@thsca.com Call us: 512-392-3741 www.thsca.com"
    },
    {
      "url": "https://www.theoaxacaclub.com/menus",
      "text": "Oaxaca Club | Menus | Dining & Cocktail top of page MENUS Dinner Menu Lunch Menu Brunch Menu Cocktail Menu Happy Hour Menu Dulce Menu RESERVE A TABLE ABOUT CONTACT CAREERS ORDER ONLINE GIFT CARDS Catering Event Venues Catering Inquiry Lunch menu menú de almuerzo DINNER MENU menú de cena BRUNCH MENU menú de brunch COCKTAIL MENU menú de cócteles HAPPY HOUR MENU menú de bebidas & comida DULCE MENU menú de postres LOCATION 131 1st Ave N #102, Jacksonville Beach, FL 32250 904-372-0537 RESERVE A TABLE KEEP IN TOUCH! info@theoaxacaclub.com CURRENT HOURS Sunday - Thursday 11 A.M. to 10 P.M. ​ Friday - Saturday ​ 11 A.M. to 11 P.M. JOIN OUR TEAM! Subscribe Thanks for submitting! Pronounced: WAH-HAH-KAH CLUB © 2023 OAXACA CLUB. All Rights Reserved. Website Design by Ashby Social. bottom of page"
    },
    {
      "url": "https://surgetechak.com/contact/",
      "text": "Get in Touch with Surge Tech - Contact Us Today Skip to content HOME MANAGED SERVICES NETWORK SUPPORT AND MONITORING Monitored Security Disaster Recovery HIPAA Compliance IT SERVICES Chief Information Officer Cloud Services VoIP Phone Services Training and Consulting CONTACT Contact Us Contact SurgeTechAK 2023-08-24T10:13:42-08:00 Get In Touch! Complete the form below and a representative from Surge Technologies will be in touch to discuss your organizational needs. Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Let's talk Phone 907-947-2744 Get In Touch Email sgoodwin@surgetechak.com Get In Touch Contact Info Anchorage Mobile: 907-947-2744 Email: mailto: sgoodwin@surgetechak.com Managed Services Network Support and Monitoring Monitored Security Disaster Recovery HIPAA Compliance IT Services CIO (Chief Information Officer) Cloud Services VoIP Phone Services Training and Consulting © Copyright | Surge Technologies of Alaska | All Rights Reserved | Anchorage Alaska Web Design by Bianca Frank Design Page load link Go to Top"
    },
    {
      "url": "https://www.theoaxacaclub.com/",
      "text": "Best Mexican Restaurant | Oaxaca Club |Jax Beach Dining top of page MENUS Dinner Menu Lunch Menu Brunch Menu Cocktail Menu Happy Hour Menu Dulce Menu RESERVE A TABLE ABOUT CONTACT CAREERS ORDER ONLINE GIFT CARDS Catering Event Venues Catering Inquiry 1/6 PRONOUNCED: WAH -HAH-KAH Connecting food & Culture Welcome to The Oaxaca Club - A Jax Beach Dining Destination Step into a world of vibrant flavors at The Oaxaca Club, where authentic Oaxacan cuisine meets the relaxed beach charm. Our Jacksonville Beach restaurant offers an unforgettable dining experience, perfect for a cozy lunch, a romantic dinner, or an inviting happy hour. With our artfully prepared moles, fresh herbs, and exquisite quesillo paired with an agave-centric cocktail bar, we are proud to be recognized as one of the best Mexican Restaurant in Jax Beach. Reserve your table today at our Oaxaca restaurant near you and enjoy fine dining in a welcoming, local atmosphere. RESERVE A TABLE Explore Our Menu – Discover Authentic Mexican Flavors Discover the rich taste of genuine Oaxacan traditions in every dish. Our menu features a diverse array of offerings—from tantalizing tacos and creative brunch options to sophisticated dinner fare and refreshing margaritas. Whether you are searching for top-rated Jax Beach restaurants, the best Mexican food restaurants in Jacksonville Beach or looking for a standout spot for brunch, dinner, special event, or happy hour near the ocean,  explore our menu and let your taste buds embark on a culinary adventure you won't forget. VIEW MENUS ​ ​ Follow us on Instagram @theoaxacaclub Load More LOCATION 131 1st Ave N #102, Jacksonville Beach, FL 32250 904-372-0537 RESERVE A TABLE KEEP IN TOUCH! info@theoaxacaclub.com CURRENT HOURS Sunday - Thursday 11 A.M. to 10 P.M. ​ Friday - Saturday ​ 11 A.M. to 11 P.M. JOIN OUR TEAM! Subscribe Thanks for submitting! Pronounced: WAH-HAH-KAH CLUB © 2023 OAXACA CLUB. All Rights Reserved. Website Design by Ashby Social. bottom of page"
    },
    {
      "url": "https://www.theoaxacaclub.com/event-venues/oaxaca-lounge",
      "text": "Oaxaca Lounge | Oaxaca Club top of page MENUS Dinner Menu Lunch Menu Brunch Menu Cocktail Menu Happy Hour Menu Dulce Menu RESERVE A TABLE ABOUT CONTACT CAREERS ORDER ONLINE GIFT CARDS Catering Event Venues Catering Inquiry < Back Oaxaca Lounge 131 1st Avenue North, Unit 102, Jacksonville Beach, Florida, USA Property Description Spacious Indoor Event Space for Large Gatherings Host an unforgettable private event at Oaxaca Club’s Lounge, a spacious indoor event venue in Jacksonville Beach designed to accommodate large parties of 60-90 guests. Whether you’re planning a wedding reception, corporate event, birthday party, or private dinner, this modern and stylish event space provides the perfect setting. With a warm ambiance, flexible seating arrangements, and access to premium catering and craft cocktails, the Lounge is ideal for those looking for a private event space near Jacksonville Beach, Neptune Beach, Atlantic Beach, Ponte Vedra, and St. Augustine. Key Features: ✔ Large indoor event space with stylish décor ✔ Customizable layouts for cocktail receptions, seated dinners, or networking events ✔ Full-service catering & bar packages available ✔ Prime location in Jacksonville Beach – easy access for guests from Ponte Vedra, Neptune Beach, and surrounding areas Secure your large private event space in Jacksonville Beach today and create a memorable experience at Oaxaca Club! Plan Your Event Inquire Now Property Details Property Type Oaxaca Club Capacity 60 Seated     90 Standing Property Location 131 1st Avenue North, Unit 102, Jacksonville Beach, Florida, USA LOCATION 131 1st Ave N #102, Jacksonville Beach, FL 32250 904-372-0537 RESERVE A TABLE KEEP IN TOUCH! info@theoaxacaclub.com CURRENT HOURS Sunday - Thursday 11 A.M. to 10 P.M. ​ Friday - Saturday ​ 11 A.M. to 11 P.M. JOIN OUR TEAM! Subscribe Thanks for submitting! Pronounced: WAH-HAH-KAH CLUB © 2023 OAXACA CLUB. All Rights Reserved. Website Design by Ashby Social. bottom of page"
    },
    {
      "url": "https://www.theoaxacaclub.com/reserve-table",
      "text": "Reserve a Table | Best Mexican Restaurant Jax Beach top of page MENUS Dinner Menu Lunch Menu Brunch Menu Cocktail Menu Happy Hour Menu Dulce Menu RESERVE A TABLE ABOUT CONTACT CAREERS ORDER ONLINE GIFT CARDS Catering Event Venues Catering Inquiry elevated mexican dining experience Don’t miss out on a top-rated dining experience at one of the best Mexican restaurants. Book your lunch or dinner reservations now and savor the flavors of Mexico at Oaxaca Club. Experience the vibrant flavors of Oaxaca City, the culinary capital of Mexico, right here in Northeast Florida. Whether you are craving authentic Mexican tacos, savoring fresh Mexican seafood or steak, or indulging in handcrafted margaritas, Oaxaca Club offers an unforgettable dining experience. Our menu blends traditional Oaxacan recipes with bold, modern flavors. Discover street tacos, tamales, enchiladas, huevos ranchero and the best Mexican food in a lively, inviting atmosphere. ​ From casual lunch or happy hour gatherings to romantic date night, Oaxaca Club is your destination for the best dinner in North Florida (Jacksonville, Jacksonville Beach, Neptune Beach, Atlantic Beach, Ponte Vedra Beach and St. Augustine). ​ ​ Searching for happy hour near me? Join us for Happy Hour with the best margaritas and Taco Tuesday deals featuring chef-curated taco specials. Enjoy handcrafted cocktails and the finest tequilas and mezcal from our bar. ​ ​ ​ ​ What our Guests are saying Discover why Oaxaca Club is a top-rated Mexican restaurant in Northeast Florida! Read Our Reviews on OpenTable ​ LOCATION 131 1st Ave N #102, Jacksonville Beach, FL 32250 904-372-0537 RESERVE A TABLE KEEP IN TOUCH! info@theoaxacaclub.com CURRENT HOURS Sunday - Thursday 11 A.M. to 10 P.M. ​ Friday - Saturday ​ 11 A.M. to 11 P.M. JOIN OUR TEAM! Subscribe Thanks for submitting! Pronounced: WAH-HAH-KAH CLUB © 2023 OAXACA CLUB. All Rights Reserved. Website Design by Ashby Social. bottom of page"
    },
    {
      "url": "https://www.theoaxacaclub.com/cocktailmenu",
      "text": "Oaxaca Club Cocktails | Margaritas & More top of page MENUS Dinner Menu Lunch Menu Brunch Menu Cocktail Menu Happy Hour Menu Dulce Menu RESERVE A TABLE ABOUT CONTACT CAREERS ORDER ONLINE GIFT CARDS Catering Event Venues Catering Inquiry BAR MENU Creative cocktails, handcrafted drinks & signature margaritas. Our expert mixologists craft every cocktail from scratch. Enjoy bold margaritas, refreshing palomas and inventive twists like the Oaxaca Old Fashioned. Perfect for anyone searching for “margaritas near me.” CóCTELES Hit Chamoy Up $15 Oaxaca Club Mezcal | lemon | hIbiscus | apricot | Ancho Reyes Soleado Spritz $16 gin or vodka | elderflower | guava | prosecco | lemon | Topo Chico San Vicente Sour $16 reposado tequila | honey | lemon | simple syrup | tempranillo Apertiki $14 Charanda Uruapan | Aperol | coconut | pinapple | Velvet Falernum | lemon ​ Mango Mezcalero $18 Banhez Destilado de mango | Dolin Blanc Vermouth | dry curacao | honey | orange bitters | chili oil Añejo Old Fashioned $18 Siete Leguas Añejo | Ilegal Añejo Mezcal | Sol Tarasco Añejo Charanda | agave | bitters ​ margaritas O.C. Margarita $12 tequila | lime | agave | make it spicy +1 ​ Guava Margarita $14 tequila | lime | guava ​ Hibiscus Margarita $14 tequila | lime | hibiscus | orange liqueur Mexicali Margarita $16 tequila | cilantro |  jalapeño | avocado | coconut | honey | lime | agave | pineapple Watermelon Mint Margarita $16 tequila | watermelon | lime | mint | agave​ Sweet Heat $16 Oaxaca Club Mezcal |  jalapeño + habanero infused tequila | gochujang | lemon ​ Cadillac $18 Siete Leguas Reposado | Grand Marnier | lime | agave Classics Sangria $14 Tempranillo | pomegranate | Lustau East India Sherry |  simple syrup | lemon | prosecco Paloma $13 tequila | grapefruit | lime | agave Oaxaca Old Fashion $15 reposado tequila | Oaxaca Club Mezcal | agave | bitters ​ Espresso Martini $14 vodka | espresso | Copa de Oro coffee liqueur ​ Last Word $16 gin or mezcal | green chartreuse  | maraschino liqueur | lime ​ flights Served with TajÍn + Fruit THE PARTY STARTER $24 G4 High Proof Blanco Tequila | Oaxaca Club EspadÍn Mezcal | Don Fulano Añejo Tequila THE KING OF MEZCAL $24 Fósforo Ensamble | Fósforo Tobalá | Fósforo Tobalá Penca ​ The Good Stuff $19 Lalo Blanco | La Gritona Reposado | Siete Leguas Añejo ​ The Top Shelf $34 Cierto Blanco | Cierto Reposado | Cierto Añejo ​ The Lost Explorer $28 Lost Explorer Espadín | Lost Explorer Tobalá | Lost Explorer Salmiana ​ ​ ​ SPIRITS Mezcal Espadín Oaxaca Club Mezcal $9 Banhez $12 Del Maguey Vida de Muertos $12 Del Maguey Las Milpas $18 Del Maguey Puebla $12 Del Maguey Single Village EspadÍn Especial $28 Ilegal Blanco $12 Ilegal Caribbean Cask Reposado $16 Ilegal Reposado $14 Ilegal Añejo $22 Ilegal 7-Year Extra Añejo $30 Lost Explorer Espadín $20 San Cosme Espadín $12 Rey Campero Espadín $16 Pechuga Banhez Pechuga $22 Del Maguey Iberico $40 El Jolgorio Pechuga $28 Rey Campero Pechuga $21 Tepeztate Banhez Tepeztate $23 Del Maguey Wild Tepextate $30 El Jolgorio Tepeztate $25 Rey Campero Tepextate $25 Jabalí Banhez Jabalí $27 Del Maguey Jabalí $25 Lost Explorer Jabalí $31 Noble Coyote Jabalí $24 Rey Campero Jabalí $20 Tobalá Del Maguey Tobalá $31 El Jolgorio Tobalá $40 Fósforo Ensamble $15 Fósforo Tobalá $20 Fósforo Tobalá Penca $28 Lost Explorer Tobalá $29 Noble Coyote Tobalá $24 Rey Campero Tobalá $26 ​ The Other Guys Banhez Mexicano $23 Banhez Destilado de Piña $14 Banhez Destilado De Mango $14 Chawar Blanco $10 Chawar Añejo Rosado $16 Del Maguey Arroqueño $19 La Venenosa Raicilla Sur $20 La Venenosa Raicilla Sierra $18 Lost Explorer Salmiana $36 Rey Campero Mexicano $23 Rey Campero Azul $23 ​ Tequila Blancos Casco Viejo Blanco (well)* $9 ArteNOM 1123 Blanco* $19 Casamigos Blanco $16 Cazcanes NO. 10 Still Strength Blanco* $25 Cazcanes NO. 7 Blanco* $20 Cierto Blanco* $26 Don Fulano Blanco* $15 Don Fulano Fuerte Blanco* $18 El Tesoro Blanco* $16 Fortaleza Blanco* $16 Fuenteseca 2018 Blanco* $32 G4 Blanco 108 proof* $16 G4 Blanco* $14 Lalo Blanco* $14 Lost Explorer Blanco* $15 Mijenta Blanco* $14 Siete Leguas Blanco* $13 Tapatío Blanco 110 Proof* $18 Tapatío Blanco* $12 Tepozán Blanco* $14 Tequila Ocho Blanco* $15 Volans Blanco* $16 Volans Still Strength Blanco* $20 Wild Common Blanco* $18 Wild Common Still Strength Blanco* $20 Reposados Arette Reposado* $13 Arette Artesanal Reposado* $17 Artenom 1414 Reposado* $20 Casamigos Reposado $18 Cazcannes Reposado* $24 Cierto Reposado* $34 Clase Azul Reposado $40 Don Fulano Reposado* $16 El Tesoro Basil Hayden Barrel Reposado* $30 El Tesoro Reposado* $20 El Tesoro Single Barrel Reposado* $16 G4 Reposado* $18 La Gritona Reposado* $14 Mijenta Reposado* $18 Siete Leguas Reposado* $14 Tapatío Reposado* $14 Tepozán Reposado* $16 Tequila Ocho Reposado* $17 Volans Reposado*$18 Wild Common Reposado* $20 ​ Añejos Arette Artesanal Añejo* $22 Artenom 1146 Añejo* $24 Cazcanes NO. 7 Añejo* $30 Cierto Añejo* $46 Don Julio 1942 $40 Don Fulano Añejo* $22 Don Fulano 20th Anniversary Edition Añejo* $36 El Tesoro Laphroaig Barrel Añejo* $30 El Tesoro Añejo* $24 Mijenta Añejo* $38 Siete Leguas Añejo* $16 Tapatío Añejo* $16 Tepozán Añejo* $18 Tequila Ocho Añejo* $19 Extra Añejos Arette Artesanal Gran Clase Extra Añejo* $24 Aged 4 years in single-barrel American oak bourbon barrels. ​ Tepozan Extra Añejo* $30 Aged at least 3 years in oak barrels. ​ Volans Extra Añejo* $34 Aged for over three and a half years in American white-oak barrels. The color is lighter than normal extra añejos due to the age of the barrels (20+ years). ​ El Tesoro Extra Añejo* $34 Aged 4-5 years in American oak bourbon barrels. ​ Don Fulano Imperial Extra Añejo $41 Aged for a minimum of 5 years in dark European oak and olorosso sherry casks. ​ El Tesoro Paradiso Extra Añejo* $44 Created by Don Felipe Camarena in collaboration with Alain Royer of A. de Fussigny Cognac, this extra añejo is aged for 5 years in French oak cognac barrels. ​ Tequila Ocho Extra Añejo* $44 Estate-grown agave. Aged in American whiskey barrels for at least 3 years. ​ Tequila Ocho La Ladera Extra Añejo $48 aged in American whiskey barrels for a minimum of 3 years. ​ Siete Leguas Extra Añejo* $50 Aged 5 years in American oak, this extra añejo leads with a spicy oak profile followed quickly by cooked agave and earthy notes. Great for scotch drinkers. ​ Tears of Llorona Extra Añejo* $64 Aged 5 years in scotch, sherry and brandy oak barrels. ​ Fuenteseca 7-Year Extra Añejo* $64 Aged 7 years in California red wine American white oak and dark French oak barrels. ​ Fuenteseca 11-Year Extra Añejo* $75 Aged 11 years in California red wine American white oak and dark French oak barrels. ​ Fuenteseca 18-Year Extra Añejo* $160 Aged 18 years in California red wine European dark oak and Canadian white oak barrels. VODKA New Amsterdam (well) $10 Grey Goose $15 Manifest $12 Titos $13 ​ GIN New Amsterdam (well) $9 Hendricks $14 Manifest Florida Botanical $10 Tanqueray $10 Rum Bounty White (well) $9 Diplomático White Rum $12 Diplomático Reserva Dark Rum $14 Macchu Pisco $12 WHISK(E)Y Old Forester 86 Bourbon (well) $9 Abasolo Mexican Corn Whiskey $12 Blanton's $25 Angel’s Envy $15 Buffalo Trace Bourbon $12 Eagle Rare $15 Highwest Double Rye $14 Jameson $12 Maker’s Mark $10 Michter's Small Batch Kentucky Straight Bourbon $15 Whistlepig 10-Year Small Batch Rye $22 Whistlepig Piggyback 6-Year Bourbon $15 Whistlepig Piggyback 6-Year Rye $15 Woodford Reserve $12 CHARANDA Uruapan Charanda Añejo $13 Uruapan Charanda Blanco $10 Uruapan Charanda Caña Mexicana Blanco $13 Uruapan Charanda Caña Cristalina Blanco $13 Uruapan Charanda Caña Criolla Blanco $13 Uruapan Charanda Single Agricola $13 Uruapan Charanda Sol Tarasco Añejo Hongos $14 WHITE WINE WINE Pinot Grigio Terre di rai, Delle Venezie, Italy  $11/$44 Chardonnay Sonoma Cutrer, Sonoma, California  $16/$64 Tempranillo Blanco Finca Penamayor, Rioja, Spain  $13/$52 Prosecco Santa Elvira, Treviso, Italy  $11/$44 Sauvignon Blanc Casa Jipi, Valle de Guadalupe, Mexico  $17/$68 Rosé Chateau Saint-Nabor, Rhone Valley, France  $13/$52 RED WINE Tempranillo FYA 8, Rioja, Spain  $11/$44 Gamay Laurent Perrachon, Beaujolais, France  $12/$52 Garnacha Bodegas Breca, Calatayud, Spain. $13/$52 Syrah Caligiore, Mendoza, Argentina   $14/$56 Pinot Noir Et-Cetera, California   $14/$56 Cabernet Sauvingnon Sister’s Run, Coonawarra, Australia  $15/$60 BEER Dos Equis Amber (Draft) $6 Miller Lite (Draft) $6 Modelo (Draft) $6 Corona Extra $6 Modelo Negra $8 Tecate $6 Intuition Party Wave IPA $8 Ruby Beach American Garage IPA $8 Ruby Beach Scallywag Sour $8 Coors Banquet $6 Mich Ultra $6 Heineken (N.A.) $6 Non-alcoholic cocktails Endless Summer $9 passion fruit | coconut | honey | Topo Chico Mango Tango $9 mango | pineapple | lime | tajín | Topo Chico Beverages Bottled Sodas $3.50 Topo Chico | Jarritos | Aqua Panna | Coke products ​ Colombia El Credo Single Origin Coffee Espresso $4 Cappuccino $6 Latte $6 choice of whole milk or oat milk Affogato $8 espresso over scoop of dulce de leche ice cream LOCATION 131 1st Ave N #102, Jacksonville Beach, FL 32250 904-372-0537 RESERVE A TABLE KEEP IN TOUCH! info@theoaxacaclub.com CURRENT HOURS Sunday - Thursday 11 A.M. to 10 P.M. ​ Friday - Saturday ​ 11 A.M. to 11 P.M. JOIN OUR TEAM! Subscribe Thanks for submitting! Pronounced: WAH-HAH-KAH CLUB © 2023 OAXACA CLUB. All Rights Reserved. Website Design by Ashby Social. bottom of page"
    },
    {
      "url": "https://www.mciny.org/dinner-oaxaca",
      "text": "Las Mujeres Oaxaqueñas: Women that Cure — MCINY Cart 0 Donate! About Mexico in New York Octavio Paz Gallery Back Who we are & what we do History 20th Anniversay Video Cultural Diplomacy Staff and Contacts Board of Directors Other Mexican Cultural Institutes Back Activities OPEN DOORS Annual Reports Back The Gallery Current Exhibition Previous Exhibitions Cart 0 Donate! About Who we are & what we do History 20th Anniversay Video Cultural Diplomacy Staff and Contacts Board of Directors Other Mexican Cultural Institutes Mexico in New York Activities OPEN DOORS Annual Reports Octavio Paz Gallery The Gallery Current Exhibition Previous Exhibitions LAS MUJERES OAXAQUEÑAS: LA TIERRA Y LA LUZ Dinner and conversation June 28, 7 PM // DeMaria photo: Andrea Gentl Join us for a conversation with chef Aurora Toledo and mezcalera Graciela Ángeles Carreño of Real Minero on the traditional and changing roles of women in food and mezcal in Oaxaca. Preceded by welcome cocktails, followed by four-course meal created in collaboration between Aurora Toledo and chef Adriana Urbina of DeMaria, paired with mezcal Real Minero. In partnership with Pocoapoco and with the generous support of Interjet and the Mexico Tourism Board. Menu: - Garnachas istmeñas : traditional appetizers from the Isthmus of Tehuantepec made from corn masa, topped with beef and pickled vegetables. - Molotes de plátano : fried plantain filled with queso fresco. - Mole negro : one of the most iconic dishes of Oaxaca. Rich sauce prepared with three different types of smoked chiles , spices, nuts, plantain, and chocolate, among other ingredients. Served with fish. - Camote y piña : chefs Aurora and Adriana will collaborate on a fresh sweet potato and pineapple dessert, ideal for the summer. $150.00 Add to cart About the Participants: Pocoapoco is a multi-disciplinary, research-based residency program in Oaxaca, Mexico offering time for retreat, a platform for creative exploration and space for a collective intelligence. The residency hosts artists and non-artists in a wide variety of fields to support research, conversation and community surrounding creative work, process and purpose. Graciela Ángeles Carreño is the mezcalera and general manager of Real Minero Mezcal, an internationally recognized brand from the small town of Santa Catarina Minas. As part of the fourth generation of mezcal producers, she is committed to her role as a modern women coexisting in an industry dominated by men, acting as an evangelist of mezcal and representing a new generation of mezcaleras. Aurora Toledo is the chef and founder of the highly respected restaurant Zandunga in the center of Oaxaca. Growing up in the Isthmus region of Oaxaca, she is also a lifelong teacher and educator, as well as mother, grandmother and community leader. She is currently training as a traditional healer. Where : DeMaria 19 Kenmare St, NY When : June 28, 7 PM 27 East 39th Street, New York, NY, 10016, Estados Unidos (212) 217-6400 programs@mciny.org Hours Mon 09:00 - 18:00 Tue 09:00 - 18:00 Wed 09:00 - 18:00 Thu 09:00 - 18:00 Fri 09:00 - 18:00 Sat CERRADO Sun CERRADO"
    },
    {
      "url": "https://discover-oaxaca.com/contact/",
      "text": "Contact – Discover Oaxaca Tours Skip to content Our Tours About Us Contact Search for: Menu Close Our Tours About Us Contact Contact Home > Contact Send Us an Email You can reach us by email at guide@discover-oaxaca.com , or fill out the form below. Discover Oaxaca Tours Facebook Twitter Instagram Tripadvisor Unique cultural and natural encounters in Oaxaca, Mexico"
    }
  ]
}