{
  "fuentes": [
    {
      "url": "https://struleartscentre.co.uk/about-us/get-in-touch/",
      "email": "strulearts@fermanaghomagh.com"
    },
    {
      "url": "https://sarasotaarts.org/venue/the-players-centre-for-performing-arts/",
      "email": "info@sarasotaarts.org"
    },
    {
      "url": "https://theplayers.org/support-us/donate/annual-donor/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://mustseesarasota.com/the-players-theatre/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://mustseesarasota.com/the-players-theatre/",
      "email": "magnifier@2x.png"
    },
    {
      "url": "https://theplayers.org/support-us/donate/sponsor-a-series/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/careers/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/board-of-trustees/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/studio/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://www.theplayers.org/an-update-from-the-players-centre/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://business.longboatkeychamber.com/thingstodo/Details/players-centre-for-performing-arts-inc-the-3746436",
      "email": "info@lbkchamber.com"
    },
    {
      "url": "https://theplayers.org/about-us/we-are-the-sarasota-players/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/the-players-new-play-festival/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/the-players-new-play-festival/",
      "email": "jefferyk@theplayers.org"
    },
    {
      "url": "https://theplayers.org/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/the-players-studio-announces-homeschool-classes/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/join-us/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "amandah@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "amyg@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "brianf@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "cheyenneh@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "jasone@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "jillc@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "loganj@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "scotts@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "thayerg@theplayers.org"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "email": "william.skaggs@theplayers.org"
    },
    {
      "url": "https://theplayers.org/support-us/donate/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/support-us/donate/",
      "email": "amyg@theplayers.org"
    },
    {
      "url": "https://www.aberdeenartscentre.com/contact",
      "email": "creativelearning@aberdeenartscentre.com"
    },
    {
      "url": "https://www.aberdeenartscentre.com/contact",
      "email": "eoin@aberdeenartscentre.com"
    },
    {
      "url": "https://www.aberdeenartscentre.com/contact",
      "email": "info@aberdeenartscentre.com"
    },
    {
      "url": "https://www.aberdeenartscentre.com/contact",
      "email": "julia@aberdeenartscentre.com"
    },
    {
      "url": "https://augustaarts.com/calls-for-artists/creative-careers-the-players-centre-for-performing-arts-seeking-ceo-of-performing-arts-florida/",
      "email": "info@augustaarts.com"
    },
    {
      "url": "https://theplayers.org/health-safety-procedures/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://theplayers.org/our-vision/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://nyperformingartsacademy.org/contact-us/",
      "email": "join@thenypaa.org"
    },
    {
      "url": "https://theplayers.org/about-us/",
      "email": "boxoffice@theplayers.org"
    },
    {
      "url": "https://taylorcentre.ca/ContactUs/index.htm",
      "email": "mrevents@mtroyal.ca"
    },
    {
      "url": "https://taylorcentre.ca/ContactUs/index.htm",
      "email": "mrtickets@mtroyal.ca"
    }
  ],
  "mails": [
    "amandah@theplayers.org",
    "amyg@theplayers.org",
    "boxoffice@theplayers.org",
    "brianf@theplayers.org",
    "cheyenneh@theplayers.org",
    "creativelearning@aberdeenartscentre.com",
    "eoin@aberdeenartscentre.com",
    "info@aberdeenartscentre.com",
    "info@augustaarts.com",
    "info@lbkchamber.com",
    "info@sarasotaarts.org",
    "jasone@theplayers.org",
    "jefferyk@theplayers.org",
    "jillc@theplayers.org",
    "join@thenypaa.org",
    "julia@aberdeenartscentre.com",
    "loganj@theplayers.org",
    "magnifier@2x.png",
    "mrevents@mtroyal.ca",
    "mrtickets@mtroyal.ca",
    "scotts@theplayers.org",
    "strulearts@fermanaghomagh.com",
    "thayerg@theplayers.org",
    "william.skaggs@theplayers.org"
  ],
  "nombre_sitio": "theplayers.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://struleartscentre.co.uk/about-us/get-in-touch/",
      "text": "Get in Touch - Strule Arts Centre Skip to main content https://struleartscentre.co.uk/about-us/get-in-touch/ Book Now: 028 8224 7831 Account Cart Search Shows Workshops Exhibitions Venue Hire The Recording Studio The Auditorium Make an Enquiry About Us Your Visit Food and Drink Accessibility Rooftop Museum Gift Vouchers Get in Touch Search Website Search Close Search Bar Overlay Get in Touch Home About Us Talk to Us If you have any thoughts, opinions, enquiries or questions for the team at Strule Arts Centre, you can contact us by email, phone, or by using the form below. Box Office and Visitor Service Information 028 8224 7831 Email strulearts@fermanaghomagh.com Send us your thoughts Name * Email * Message * Related Services Strule Arts Centre is one of a number of venues within the Arts and Heritage Service of Fermanagh & Omagh District Council, other venues include Ardhowen Theatre, Enniskillen www.ardhowen.com Enniskillen Castle Museum www.enniskillencastle.co.uk Marble Arch Caves and Geopark, www.marblearchcavesgeopark.com Strule Arts Centre is owned and operated by Fermanagh & Omagh District Council. For more information on Council services see www.fermanaghomagh.com or telephone 0300 303 1777 About Us General Information General Information regarding the Strule Arts Centre Accessibility Accessibility information for visiting Strule Arts Theatre in Omagh Gift Vouchers Gift Vouchers for the Strule Arts Centre make the perfect present for Christmas or birthdays. Newsletter Signup Signup to the Strule Arts Centre Newsletter Strule Arts Centre Townhall Square Omagh Co. Tyrone BT78 1BL Email 028 8224 7831 Shows Workshops Exhibitions Current Programme Venue Hire Gift Vouchers Your Visit About Us Members Newsletter Signup Refunds Policy Terms and Conditions Venue Privacy Statement Sitemap Instagram Facebook Tripadvisor Your browser does not support iframes, please use a browser that does."
    },
    {
      "url": "https://sarasotaarts.org/venue/the-players-centre-for-performing-arts/",
      "text": "The Players Centre for Performing Arts - sarasotaarts.org MEMBER LOGIN LOGIN REGISTER LOGOUT MY ACCOUNT English Arabic Chinese (Simplified) Chinese (Traditional) English French German Japanese Korean Kurdish (Kurmanji) Spanish Vietnamese There are no recent bookmarks. Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT MENU Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Venue Type Art Center Business/Company Comedy Club Concert Hall Gallery Meeting Space Museum Park/Garden/Open Space Performing Arts Center Restaurant/Cafe School Studio Theater State / Province FL City/Town Englewood Laurel Longboat Key Nokomis North Port Osprey Sarasota Venice Zip/Postal Code 34223 34224 34228 34229 34230 34231 34232 34233 34234 34235 34236 34237 34238 34239 34240 34241 34242 34243 34260 34272 34274 34275 34276 34277 34278 34284 34285 34286 34287 34288 34289 34292 34293 34295 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue The Players Centre for Performing Arts Facebook Twitter Linkedin Print The Players Centre for Performing Arts LOCATION The Players Centre for Performing Arts 3501 S Tamiami Trail, Suite 1130, Sarasota, FL 34239 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette PAST EVENTS “Visiting Mr. Green” by Jeff Baron Presented by Sarasota Jewish Theatre at The Players Centre for Performing Arts Jan 29 - Feb 9, 2025 Facebook Twitter Linkedin Buy Tickets The Catskills — The Rise and Fall of the Borscht Belt Presented by Sarasota Jewish Theatre at The Players Centre for Performing Arts Feb 3, 2025 Facebook Twitter Linkedin Buy Tickets Heroes and Hostages: A Journey of Courage and Sacrifice Presented by Sarasota Jewish Theatre at The Players Centre for Performing Arts Sep 29, 2024 Facebook Twitter Linkedin Buy Tickets Newish Jewish Play Reading: “We Are the Levinsons” by Wendy Kout Presented by Sarasota Jewish Theatre at The Players Centre for Performing Arts Jul 29, 2024 Facebook Twitter Linkedin Buy Tickets Newish Jewish Play Reading: “Original Tenants” by Carole Braverman Presented by Sarasota Jewish Theatre at The Players Centre for Performing Arts Jul 22, 2024 Facebook Twitter Linkedin Buy Tickets SHOW MORE Contact information Website / 3501 S Tamiami Trail, Suite 1130, Sarasota, FL 34239 (941) 365-2494 Find A Venue Search by Keyword Venue Type Art Center Business/Company Comedy Club Concert Hall Gallery Meeting Space Museum Park/Garden/Open Space Performing Arts Center Restaurant/Cafe School Studio Theater State / Province FL City/Town Englewood Laurel Longboat Key Nokomis North Port Osprey Sarasota Venice Zip/Postal Code 34223 34224 34228 34229 34230 34231 34232 34233 34234 34235 34236 34237 34238 34239 34240 34241 34242 34243 34260 34272 34274 34275 34276 34277 34278 34284 34285 34286 34287 34288 34289 34292 34293 34295 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access DIRECTORIES Artists Organizations Venues SUBMIT A LISTING Event Artist Organization ABOUT Sarasota Arts Contact Us Privacy Policy ABOUT The Arts and Cultural Alliance of Sarasota County is a member-powered organization that serves as an advocate for arts and culture in Sarasota County. CONTACT US HOURS : 9 a.m. – 5 p.m. Monday – Friday SARASOTA ARTS | 1226 N. Tamiami Trail, Suite 300 Sarasota FL 34236 941-365-5118 | info@sarasotaarts.org © 2025 - Arts and Cultural Alliance of Sarasota County. All Rights Reserved. { Powered by ARTSOPOLIS }"
    },
    {
      "url": "https://theplayers.org/support-us/donate/annual-donor/",
      "text": "Annual Donor - The Sarasota Players for Performing Arts, Sarasota, FL Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Become an Annual Donor We wouldn’t be able to continue making theatre magic without the help of our donors! Support us in our mission and the joy we bring to the community! donate now Hero $ 10,000 All benefits from Champion level, plus... Behind the scenes glimpse with Managing Artistic Director Donate Champion $ 5,000 All OVATION CIRCLE benefits, plus… Invitation to a preshow Talk Back with the director 2 complimentary tickets to The Players Studio shows Special guided tour of The Players Studio Donate Ovation Circle $ 1,000 All “Contributor” benefits, plus… Invitation for two to all Opening Night Receptions Invitation to Exclusive Donor-only events Exclusive access to the Costume Shop for personal use (restrictions may apply) Donate Contributor $ 500 All “Affiliate” benefits, plus… Special backstage tour Playbill recognition Invitation for two to a VIP Opening Night Reception of your choice Donate Affiliate $ 35 Playbill recognition Donate If you have any questions or want more information please contact Aadvancement Director, Morgan Gerhart at 941.365.2494 or morgang@theplayers.org. The Players, Inc. is a non-profit, charitable corporation under section 501©3 of the IRS Code, Florida Department of Agriculture & Consumer Services # CH8025. All donations are tax-deductible to the full extent of the law. A copy of the Official Registration and Financial Information may be obtained from the Division of Consumer Services by calling toll-free (800-435-7352) within the state. Registration does not imply endorsement, approval or recommendation by the state. Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://mustseesarasota.com/the-players-theatre/",
      "text": "Sarasota Theater - The Players Theatre Categories Artists Attractions Authors Autos Barbers Beaches Beauty and Health Spas Classes/Activities Diet and Weight Loss Electronics Entertainment Events Farms Financial Services Fitness/Sport Framing Galleries Home Improvement Horses Interior Design Marketing Agencies Motorcycles Nightlife Parks Photography and Videography Psychic/Metaphysics Real Estate Salons Shipping and Moving Signs and Graphic Design Tailoring Yachts and Boats Shops Antiques Appliances and Repair Bath and Body Books Boutiques Bridal/Wedding CBD Stores Children Cigars and Tobacco Coins Consignment Custom Clothiers Day Spas Florists Furniture Gardening Gifts Gun Ranges and Guns Home Decor Jewelry Shops Lighting Mattresses and Bedding Pets Printing Rugs Quilts Specialty Food Stores Sweets, Pastries and Ice Cream T-shirts and Apparel Vape Shops Wines and Liquors Restaurants Cafes Catering Ethnic Food Meal Prep and Delivery Pastries and Coffee Pizzerias Restaurants Smoothie and Juice Bar Sports Bars Medical Acupuncture Aesthetics and Medical Spas Alternative Medicine Chiropractors Home Health Care IV Therapy Massage Therapists Medical Supply Stores Opticians/Eyewear Pharmacies Physical Therapy Transformational Therapy Weight Loss and Anti-Aging Clinic Hospitality Locations Bird Key Sarasota Burns Court Sarasota Bayfront Sarasota Downtown Sarasota Gulf Gate Sarasota Historic Downtown Village Palm Avenue Rosemary District Sarasota East Sarasota Lakewood Ranch Lido Key Longboat Key North Sarasota Siesta Key South Sarasota Southside Village Shopping District St. Armand’s Circle Towles Court Osprey Venice Bradenton Anna Maria Island Palmetto Clearwater St. Petersburg Tampa Orlando Contact Us Photography About Must See Sarasota The places you don't want to miss The Players Theatre Sarasota Entertainment The Players The Players The Players The Players The Players The Players players6 Sarasota Theatre - The Players The oldest Sarasota theater - The Players. The Players CIMG8294 Sarasota Theater-The Players Building of Sarasota Theater - the Players is oldest theatre in Sarasota The Players Centre for Performing Arts is Sarasota’s community theatre, dedicated to delivering quality productions and keeping the community engaged with the arts. The Players seeks to provide an artistic outlet for locals and visitors alike to experience live theatre and live theatre training. The Players is a non-professional community theatre, located on the “Cultural Coast.” This location gives us an incredible talent pool to work with. From our Artistic Director to our stagehands, half of the volunteers working on a production have at one time been professionally paid performers. Many professional performers retire and are drawn to the area thanks to all of Sarasota’s arts offerings. These professionals bring their experience, training, families and often their extensive resumes with them to our stage. When we scatter professionals in amongst the nonprofessional actors and students, everyone wins! The productions are stronger, the newer actors receive excellent training, and everyone learns from the examples set by these talented and trained volunteers. The Players also hires many professionally trained Directors, Choreographers, and Musical Directors as well. History: When the idea of Community Theatre began, Sarasota was a small town with a population of 8,000 which grew by 5,000 visitors in the winter months. Fanneal Harrison and Catherine Gavin, owners of the Out-Of-Door School, were looking for activities which would interest its faculty. Finding that theatre was at the top of the list, they gathered a group of friends to discuss the possibility of starting one. In 1929 the new theatre became a reality and The Players moved into a real theatre of its own at the corner of north Tamiami Trail and 9th Street.  Built of pecky cypress, it had 246 seats, a lobby with a welcoming fireplace, a large, deep stage and complete lighting system. They began with 256 members who contributed just $2 each for subscriptions. In the early 70’s the current building went up in its place, with a seating capacity of almost 500. In 2000 the building got new stage and auditorium lighting, updated air-conditioning, sound and acoustical upgrades, new curtains, flooring, new roof, exterior doors, a refurbished rail system, exterior and interior painting, and new landscaping. The Players Theatre is the first and oldest performing arts center in Sarasota. It is a community theatre that provides Broadway series, concerts, Something New at Players (SNAP) series and Summer Sizzler series.  The full scale musicals are accompanied with live orchestra. The Players Theatre is proud to be 2011 Frank G. Berlin, Sr. Cultural Organization of the Year presented by Greater Sarasota Chamber of Commerce. Not only they provide an incredible entertainment, but also they provide community with dance, acting, voice classes and workshops. Come and experience amazing performances at the Players Theatre. Address: Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941-365-2494 Website: The Players Theatre Players Centre Facebook Page The photos are taken from The Players Facebook page. Tags: \"sarasota florida\" Must See Sarasota Sarasota entertainment Sarasota music The Players Theatre of Sarasota things to do in sarasota florida what to do in Sarasota what to see in Sarasota Recently Added McCarver & Moser Jewelers Ana Molinari Salon Spa Boutique Binjara Traders Crab & Fin Restaurant Inspiring Sarasota Homes – Robert Hanna Group Categories Artists Attractions Autos Beaches Electronics Entertainment Events Fitness Galleries Health Home Improvement Horses Interior Design Motorcycles Nightlife Parks Photographers Psychic Real Estate Salons Signs Sport Yachts Shop Antiques Appliances and Repair Boutiques Bridal Children Consignment Custom Clothiers Fashion Design Florists Furniture Gardening Gifts Gun Ranges and Guns Home Decor Jewelry Shops Pets Pharmacies Printing Quilts Specialty Food Stores Sport T-shirts and Apparel Tailoring Wines and Liquors Locations Anna Maria Island Bird Key Bradenton Casey Key Downtown Sarasota East Sarasota Lakewood Ranch Lido Key Longboat Key North Sarasota Orlando Osprey Palm Avenue Palmetto Sarasota Bayfront Central Sarasota Siesta Key South Sarasota St. Armand’s Circle St. Petersburg Tampa Venice Restaurants Cafes Restaurants Sports Bars Photography Contact Us Categories Artists Attractions Authors Autos Barbers Beaches Beauty and Health Spas Classes/Activities Diet and Weight Loss Electronics Entertainment Events Farms Financial Services Fitness/Sport Framing Galleries Home Improvement Horses Interior Design Marketing Agencies Motorcycles Nightlife Parks Photography and Videography Psychic/Metaphysics Real Estate Salons Shipping and Moving Signs and Graphic Design Tailoring Yachts and Boats Shops Antiques Appliances and Repair Bath and Body Books Boutiques Bridal/Wedding CBD Stores Children Cigars and Tobacco Coins Consignment Custom Clothiers Day Spas Florists Furniture Gardening Gifts Gun Ranges and Guns Home Decor Jewelry Shops Lighting Mattresses and Bedding Pets Printing Rugs Quilts Specialty Food Stores Sweets, Pastries and Ice Cream T-shirts and Apparel Vape Shops Wines and Liquors Restaurants Cafes Catering Ethnic Food Meal Prep and Delivery Pastries and Coffee Pizzerias Restaurants Smoothie and Juice Bar Sports Bars Medical Acupuncture Aesthetics and Medical Spas Alternative Medicine Chiropractors Home Health Care IV Therapy Massage Therapists Medical Supply Stores Opticians/Eyewear Pharmacies Physical Therapy Transformational Therapy Weight Loss and Anti-Aging Clinic Hospitality Locations Bird Key Sarasota Burns Court Sarasota Bayfront Sarasota Downtown Sarasota Gulf Gate Sarasota Historic Downtown Village Palm Avenue Rosemary District Sarasota East Sarasota Lakewood Ranch Lido Key Longboat Key North Sarasota Siesta Key South Sarasota Southside Village Shopping District St. Armand’s Circle Towles Court Osprey Venice Bradenton Anna Maria Island Palmetto Clearwater St. Petersburg Tampa Orlando Contact Us Photography About © COPYRIGHT 2016 MUST SEE SARASOTA."
    },
    {
      "url": "https://theplayers.org/support-us/donate/sponsor-a-series/",
      "text": "Sponsor a Series - The Sarasota Players for Performing Arts, Sarasota, FL Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Sponsor a Series Help us produce one of our many series! The Broadway Series , our mainstage offerings featuring mostly musicals, and classic shows through area-premiers. Summer Sizzler Series , smaller shows performed on the mainstage, sure to delight our summer audiences in June, July and August. Backstage at The Players , is a series full of cutting-edge, classic and contemporary plays presented in an intimate black-box setting. The Players Studio , includes our Holiday Revue, End-of-Year showcase and any performance group shows (Players Kids, Players Teens, Flash Tappers and Players Follies)! donate now Broadway Series Executive Producer $ 15,000 “Producer” benefits plus… A full-page ad or sponsor bio in the season playbill A total of 20 complimentary performance tickets Acknowledgement in season advertising, mailings, and literature Reserved parking spot at productions Donate Broadway Series Producer $ 10,000 “Associate Producer” benefits plus A half-page or sponsor bio in the season playbill A total of 18 complimentary performance tickets Recognition on US 41 marquee during performances Donate Broadway Series Associate Producer $ 5,000 “Director” benefits plus.. A quarter page ad or sponsor bio in the season playbill A total of 16 complimentary performance tickets Donate Broadway Series Director $ 3,500 An eighth page ad or sponsor bio in the season playbill Lobby recognition all season Curtain speech recognition before each show Recognition on The Players website with a link to your website 12 complimentary performance tickets Recognition on pre-show media screen Donate Summer Sizzler, Backstage at The Players, Players Studio $ 1,500 Playbill recognition in all series shows Curtain speech recognition for all series shows 2 tickets to each show in series Sign posters from cast of each series show Donate If you have any questions or want more information please contact Aadvancement Director, Morgan Gerhart at 941.365.2494 or morgang@theplayers.org. The Players, Inc. is a non-profit, charitable corporation under section 501©3 of the IRS Code, Florida Department of Agriculture & Consumer Services # CH8025. All donations are tax-deductible to the full extent of the law. A copy of the Official Registration and Financial Information may be obtained from the Division of Consumer Services by calling toll-free (800-435-7352) within the state. Registration does not imply endorsement, approval or recommendation by the state. Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/about-us/careers/",
      "text": "Careers - The Sarasota Players for Performing Arts, Sarasota FL Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours careers The Sarasota Players offers exciting career opportunities for individuals in the community who have a drive to work hard and a heart that belongs to the theatre! Check out what positions are currently available! Keywords Location Remote positions only Freelance Full Time Internship Part Time Temporary Your browser does not support JavaScript, or it is disabled. JavaScript must be enabled in order to view listings. Load more listings auditions volunteers Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/about-us/board-of-trustees/",
      "text": "Board of Trustees - The Sarasota Players Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours board of trustees Officers Chair Bill Porter Vice Chair Bill Rusling Treasurer David Sanders Trustees Joey Scheerle Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/studio/",
      "text": "Studio - The Players Centre Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Enroll now! Fall Class Enrollment The Players Studio is open for Fall enrollment! From first-timers to future stars— The Players Studio has something for everyone 6 & up! With classes, camps, workshops & performance groups , our pros make it fun, welcoming, and unforgettable. Learn more about what classes we offer HERE! Learn more about our Performance Groups HERE! Learn more about our Camps H ERE! Learn more about Junior Theatre Festival HERE! The Players Studio is where creativity takes center stage for students of all ages! From dynamic theatre and dance classes to exciting performance groups, we offer a fun, supportive space where young artists can grow in confidence, skill, and imagination. Parents can feel great knowing their kids are learning from experienced professionals in a safe, welcoming environment that nurtures individuality and teamwork. And for adults—whether you’re stepping into the spotlight for the first time or rediscovering a long-lost passion—it’s never too late to join the fun. There’s a place for everyone at The Players Studio! If you have any questions please contact our Director of Education, Thayer Greenberg at thayerg@theplayers.org. Upcoming Performance Groups and Auditions! Junior Theater Festival Team Into The Woods is part of our Junior Theater Festival Team. Please visit our Broadway Competition team page for more info! Broadway Competition Team Elementary Spring Musical Ages 6-11 (elementary school) Rehearsals/Auditions begin Sat September 6 Performance Dates March 12-15, 2026 Enroll HEre! Homeschool Play Ages 11-18 Rehearsals/Auditions Wednesday’s starting September 10th Performance dates April 10-12, 2026 Enroll Here! High school Fall Play Ages 14-19 Auditions  September 9, 2025 Callbacks September 10, 2025 Performance Dates Nov 13-16 Sign up for an audition! Established in 1995, TPS has been dedicated to providing theatre arts education to the Sarasota, Florida and surrounding communities for over 20 years. \n\nWhether you are bright and beginning, or a seasoned artist looking to cultivate your skills, you have a home here. We pride ourselves in offering not only exceptional arts education, but a space to freely explore, create, and develop skills to succeed onstage and in life. Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://www.theplayers.org/an-update-from-the-players-centre/",
      "text": "An Update from The Players Centre - The Sarasota Players Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours News An Update from The Players Centre Dear Patrons, Volunteers, Donors and Friends, The Players Centre for Performing Arts is deeply saddened by the current condition of the world and the virus affecting so many across the globe. In order to prevent the spread of this virus and to ensure the safety of our patrons, volunteers and staff, The Players has cancelled events through April 18 . Further adjustments are forthcoming. The current guidelines by the CDC tell us to limit gatherings to no more than 10 individuals . This is difficult for us in the live performance industry. Sitting in a dark theatre surrounded by others is part of the thrill of attending a show. The Players Centre is a 501(c)(3) nonprofit that puts on plays and musicals by your community for your community . For 90 years we’ve given locals the chance to live out their dreams on stage. Our classes have educated students in the performing arts for almost 25 years. Many volunteers put in hours of work on shows that were cut short or were never performed. We are wholeheartedly thankful to these individuals and we hope to offer them the chance to show the world their work as soon as we can. Along with the emotional stress, The Players will lose approximately $550,000 due to the cancellation of numerous shows. This is a huge blow and without an idea of what to expect in the future, we aren’t sure what the total will be. If you have tickets to any of our cancelled/postponed events, we hope that you will consider donating those tickets back to the theatre. The Players hopes to continue giving this community the opportunity to entertain, educate and engage with the arts in the future and we hope you’ll help us continue with that mission in the wake of these events. We can also turn your tickets into vouchers (called flex passes) to be used later to any of our future shows. This option will impact our income for next year as well. The safety and health of our patrons, volunteers and staff is our top priority and we hope the community bands together during this time. Our theater is YOUR theater, and the staff and board of trustees will work tirelessly to reopen, re-imagine and remount these pieces that are postponed. We pray this temporary inconvenience brings out the best in all of us, and we look forward to greeting you in our lobby in the near future. With love and hope, Jeffery Kin and the staff of The Players Centre The Players, Inc. is a non-profit, charitable corporation under section 501©3 of the IRS Code, Florida Department of Agriculture & Consumer Services # CH8025. All donations are tax-deductible to the full extent of the law. A copy of the Official Registration and Financial Information may be obtained from the Division of Consumer Services by calling toll-free (800-435-7352) within the state. Registration does not imply endorsement, approval or recommendation by the state. Amanda Heisey Leave a Replay Upcoming Shows September 2025 Sep 24 2025 The Wedding Singer Studio 1130 Sep 25 2025 The Wedding Singer Studio 1130 Sep 26 2025 The Wedding Singer Studio 1130 Sep 27 2025 The Wedding Singer Studio 1130 No event found! Load More Recent Posts Join the Creative Force BehindThe Sarasota Players! Read More » Into the Woods Playbill Read More » THE SARASOTA PLAYERS EXPANDS THEIR PLAYERS STUDIO EDUCATION PROGRAM Read More » Follow Us Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://business.longboatkeychamber.com/thingstodo/Details/players-centre-for-performing-arts-inc-the-3746436",
      "text": "Sarasota Players Directory   - Longboat Key Chamber of Commerce Skip to content Menu Stay Accommodations Real Estate Dining Play Attractions Arts and Culture Beaches Recreation Shopping Explore Longboat Key Lido Key St. Armands Key Events Calendar Weddings Directory Membership Member Login Join Your Guide to Membership & Sponsorship Member Events Advertising Opportunities Interactive Visitor Guide Business Directory Contact Visitors Guide Facebook Instagram Phone (941) 383-2466 Menu Stay Accommodations Real Estate Dining Play Attractions Arts and Culture Beaches Recreation Shopping Explore Longboat Key Lido Key St. Armands Key Events Calendar Weddings Directory Membership Member Login Join Your Guide to Membership & Sponsorship Member Events Advertising Opportunities Interactive Visitor Guide Business Directory Contact Sarasota Players Back to Search Sarasota Players Categories Theatre Non-Profit Performance Venue & Box Office, 3501 South Tamiami Trail, Suite 1130 , Sarasota , FL , 34239 1400 Blvd of the Arts, Ste. 200 , Sarasota , FL , 34236 (941) 365-2494 Send Email http://www.theplayers.org Membership Type Non-Profit Share × Print Email Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Longboat Key Chamber of Commerce | Site by GrowthZone Get In Touch! (941) 383-2466 Address 5390 Gulf of Mexico Drive Suite 102, Longboat Key, FL 34228 Contact Us info@lbkchamber.com Stay Connected! Facebook Instagram Sign Up Here for Updates! © 2025 Longboat Key Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://theplayers.org/about-us/we-are-the-sarasota-players/",
      "text": "We are The Sarasota Players - The Sarasota Players For Performing Arts Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Allie Allie is an actress here. Her most recent performance in our 94th Season production of Ruthless! delighted audiences. “Community theatre is really special to me because it’s local theatre… it’s close to home, whereas other theatres are further away and harder to get involved with.” Outside the theatre Allie is a student, but here, she’s a leading lady. Sharon & Steve Sharon and Steve began volunteering as ushers here when a friend said we needed people. They answered the call and since 2004, they’ve helped bring people together through live theatre. Barbara Barbara is a long-time volunteer, starring in her first play here in 1949 and later, retiring as a trustee in 2008. “Live theatre is everything. For anyone who would not only want to act but take part in a meaningful experience, I think having community theatre is the most wonderful opportunity.” Decades later, she is still a part of our family. Bill Along with vice chair of the board of trustees duties, Bill builds sets for our productions. “It’s a great opportunity to meet people. It’s a great opportunity to become involved in a community theatre and get involved in the community itself.” Over the last decade, he has not only built sets but built up our team and community here. Charlie In 2021, Charlie was recovering from cancer when he came to us. “I was coming out of treatment from chemotherapy. It had been a tough road… Auditioning for Rabbit Hole was the first time I actually got out of the house and got engaged and… I won’t lie, it changed my life.” He found a community and energy here that helped jumpstart his life again. donna Donna crafts costumes here that bring characters to life. “If you need to get involved again with other people and need to get out in the community… If you’re a shy person, you might not think that you have any way to speak for yourself. You can come into this… and it helps you grow as a person.” Since 2016, her stitches have made up the fabric of our team and productions. Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/the-players-new-play-festival/",
      "text": "The Players New Play Festival - The Sarasota Players Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours News The Players New Play Festival The Players Centre for Performing Arts is proud to announce the acceptance of new plays for its 19 th annual Players New Play Festival from now until April 24, 2020. A committee of judges will select five plays to be presented in a “Reader’s Theater” style format during the week of June 29-July 3, 2020 at The Players Centre Backstage Theatre. One of the winning plays will be selected as “Best of Series” and might have the chance to be work-shopped and produced depending on the availability of space as the theater is moving after April 30 th , 2021. Sandra Musicante and Jeffery Kin will once again be the coordinators of the event. Guidelines: Entrant must be a resident of the Gulf Coast area (defined for this contest as extending from Tampa/Clearwater to Fort Myers) and over the age of 18. Full-length plays are preferred but one-acts will be considered. Maximum number of performers needed to produce the play is 8. Playwrights are asked to delineate if there are multiple roles that can be doubled. Manuscripts must be typed in 12-point font and bound, with playwrights’ biographies included. Scripts will not be returned. No evaluations will be rendered with any rejected entries. Author (and collaborator, if any) may submit only one script at no cost. Each additional script is $10.00 (the enclosed check made payable to: The Players). Play must not have had a prior production, although those work-shopped before non-paying audiences are acceptable. Published plays are not eligible. Entries that have been previously submitted to The Players ARE eligible, but only if the work has been substantially re-written . Musicals are not accepted. Submit one hard copy to: “The Players New Play Festival,” The Players, 838 N. Tamiami Trail, Sarasota, FL 34236. A second electronically transmitted copy needs to be emailed to jefferyk@theplayers.org . The Players Centre is not responsible for lost or misplaced plays. Deadline is April 24, 2020. No submissions will be accepted past that date. Winning Selections At least 5 entries will be presented in rehearsed readings at The Players Centre from June 29-July 3, 2020.  The 5 finalists will be announced via The Players website by May 15, 2020. Playwright must be available to attend rehearsals as well as attend the reading. Winning entries will have a director assigned and will organize at least two rehearsals. Playwrights are responsible for supplying updated and corrected copies of their script to their director and cast. Plays not following the guidelines listed above will be disqualified. Auditions TBA Amanda Heisey Leave a Replay Upcoming Shows September 2025 Sep 24 2025 The Wedding Singer Studio 1130 Sep 25 2025 The Wedding Singer Studio 1130 Sep 26 2025 The Wedding Singer Studio 1130 Sep 27 2025 The Wedding Singer Studio 1130 No event found! Load More Recent Posts Join the Creative Force BehindThe Sarasota Players! Read More » Into the Woods Playbill Read More » THE SARASOTA PLAYERS EXPANDS THEIR PLAYERS STUDIO EDUCATION PROGRAM Read More » Follow Us Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/",
      "text": "The Sarasota Players Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Auditions Join The Players on stage! Learn more Volunteer With Us Click Here Upcoming Shows OUR VISION The Sarasota Players is community theatre, dedicated to delivering quality productions and keeping the community engaged with the arts. The Sarasota Players seeks to provide an artistic outlet for locals and visitors alike to experience live theatre and live theatre training. The Sarasota Players is a non-professional community theatre, located on the “Cultural Coast.” This location gives us an incredible talent pool to work with. For nearly a century, The Sarasota Players has been where our community comes to laugh, cry, and be inspired. Auditions are open to the entire community, classes are offered for all ages, and diverse productions grace the stage to appeal to various community members. Experience the magic of live theatre—right here at home To learn more about what our volunteers and performers are saying about The Sarasota Players, click here . Entertain. educate. engage. shows studio donate Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/the-players-studio-announces-homeschool-classes/",
      "text": "The Players Studio announces homeschool classes! - The Sarasota Players Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours News The Players Studio announces homeschool classes! The Players Studio, the education department of The Players Centre for Performing Arts is excited to announce upcoming weekly homeschool classes, set to take place between August 17, 2021 and May 28, 2022. Students aged 6-16 will have the opportunity to select from choices that focus on differing performance aspects. Taught by esteemed local professionals on The Players Studio staff including Brian Finnerty, Teresa O’Connell, Logan Junkins and Amanda Heisey, students will have the opportunity to hone their respective craft in an inclusive and intuitive setting that accepts all experience and ability levels. Each participant will have the chance to show off their skills in a live performance in our Holiday Revue (December 13 and 20, 2021) or End-of-Year Showcase (May 27 and 28, 2022) at our newly opened Studio 1130 performance venue at The Crossings at Siesta Key. Masks are required until further notice and will be held at The Players Studio at 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236. To register, please call 941.552.8879 or visit theplayers.org/studio. The classes are listed below: Home School Musical Theatre I (ages 6-10)                   Tuesday 10:30-11:30 Instructor: Logan Junkins                                                   Monthly Fee: $55 This class, specifically designed for the home school student, teaches acting, singing, and musical theatre dance. Home School Tap I (ages 6-10)                                        Tuesday 11:30-12:30 Instructor: Brian Finnerty                                                    Monthly Fee: $55 Enjoy this fun high energy class designed for the home school student teaching all the basics of tap. Home School Jazz I (ages 6-10)                                       Tuesday 1:00-2:00 Instructor: Logan Junkins                                                   Monthly Fee: $55 Enjoy this upbeat class specifically designed for the home school student teaching all the basics of jazz. Home School Singing I (ages 6-10)                                  Thursday 10:30-11:30 Instructor: Teresa O’Connell                                          Monthly Fee: $55 Home school students will focus on songs for the stage while strengthening their voices. Home School Acting I (ages 6-10)                                    Thursday 11:30-12:30 Instructor: Logan Junkins                                                   Monthly Fee: $55 A class to help home school students develop characters with improvisation and games. Home School Tap II (ages 11-16)                                     Tuesday 10:30-11:30 Instructor: Brian Finnerty                                                    Monthly Fee: $55 Enjoy this fun high energy class designed for the home school student teaching all the basics of tap. Home School Jazz II (ages 11-16)                                    Tuesday 11:30-12:30 Instructor: Logan Junkins                                                   Monthly Fee: $55 Enjoy this upbeat class specifically designed for the home school student teaching all the basics of jazz. Home School Musical Theatre II (ages 11-16)               Tuesday 1:00-2:00 Instructor: Brian Finnerty                                                    Monthly Fee: $55 This class, specifically designed for the home school student, teaches acting, singing, and musical theatre dance. Home School Stage Craft (ages 11-16)                           Thursday 10:30-11:30 Instructor: Logan Junkins                                                   Monthly Fee: $55 Learn elements of scenic design, lighting design, costume design, make-up and more. Home School Singing II (ages 11-16)                              Thursday 11:30-12:30 Instructor: Teresa O’Connell                                          Monthly Fee: $55 Home school students will focus on songs for the stage while strengthening their voices. Home School Acting II (ages 11-16)                                 Thursday 1:00-2:00 Instructor: Amanda Heisey                                                 Monthly Fee: $55 A class to help home school students develop characters with improvisation and games. Registration: Students can register online at theplayers.org/studio or by mailing their completed registration form with registration fee and first month’s tuition to The Players Studio (TPS), 1400 Boulevard of the Arts Suite 200, Sarasota FL 34236. Class Withdrawal: A one-month notice from the 1 st of the month is required to withdraw from a class. A parent must fill out and submit a withdrawal form to the studio. Communication: Email is our main form of communication and families must have a valid email address on file. Newsletters are sent every month keeping you informed as to what is going on around TPS, upcoming events and performances, and any specialty days. Costumes: Costumes are ordered twice a year for our Holiday Revue in December and our year-end Showcase in May. Costumes are usually only ordered for dance classes, however, acting and singing classes may be required to purchase a costume or accessory. Costume payments will be posted to accounts on November 15 th and April 15 th . Once costumes are ordered they cannot be canceled or returned, and it is the parents’ responsibility to make payment. Amanda Heisey Leave a Replay Upcoming Shows September 2025 Sep 24 2025 The Wedding Singer Studio 1130 Sep 25 2025 The Wedding Singer Studio 1130 Sep 26 2025 The Wedding Singer Studio 1130 Sep 27 2025 The Wedding Singer Studio 1130 No event found! Load More Recent Posts Join the Creative Force BehindThe Sarasota Players! Read More » Into the Woods Playbill Read More » THE SARASOTA PLAYERS EXPANDS THEIR PLAYERS STUDIO EDUCATION PROGRAM Read More » Follow Us Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/about-us/join-us/",
      "text": "Our History - The Sarasota Players for Performing Arts, Sarasota, FL Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours our history the first Sarasota players theatre, designed by ralph twitchell, built in 1936. Take a look When the idea of Community Theatre began, Sarasota was a small town with a population of 8,000 which grew by 5,000 visitors in the winter months. Fanneal Harrison and Catherine Gavin, owners of the Out-Of-Door School, were looking for activities which would interest its faculty. Finding that theatre was at the top of the list, they gathered a group of friends to discuss the possibility of starting one. In 1929 the new theatre became a reality and The Sarasota Players moved into a real theatre of its own at the corner of north Tamiami Trail and 9th Street.  Built of pecky cypress, it had 246 seats, a lobby with a welcoming fireplace, a large, deep stage and complete lighting system. They began with 256 members who contributed just $2 each for subscriptions. In the early 70’s the current building went up in its place, with a seating capacity of almost 500. In 2000 the building got new stage and auditorium lighting, updated air-conditioning, sound and acoustical upgrades, new curtains, flooring, new roof, exterior doors, a refurbished rail system, exterior and interior painting, and new landscaping. brushes with fame Montgomery Clift made his acting debut on The Sarasota Players stage during the 1932-1933 season.  Teenager Jayne Meadows performed on The Sarasota Players stage and went on to stardom. These were two of many who began their careers at The Sarasota Players Theatre and went on to starring roles in movies and television. In the 1935-1936 season The Players Theatre presented an operetta written expressly for The Players by Arthur Davison Ficke, one of America’s foremost modern poets. Verman Kimbrough, cast as the lead in “ The Man Who Came To Dinner ,” had a distinguished international operatic career. He became president of the Ringling School in 1933 and Mayor of Sarasota in 1938-1939. Excitement reigned when Bette Davis attended the opening night performance of “ Grand Hotel .”  Ms. Davis was introduced to the cast by then managing director Clayton McMichael. In March 1950, MacKinley Kantor was present while a carefully chosen cast read his play, “ Wake Up Jacob .”  After the reading, the author joined in a discussion of his work. Peter Strader, a native Sarasotan, was named Producing Director in 1955. He had earlier held the position of Designer-Technical Director.  Mr. Strader studied stage design in New York and Europe. In January, 1957, The Players presented “ A Room Full of Roses ” which starred Ellen Marshall, daughter of the late Will Geer. Ellen went on to become a well-known New York actress and star in the television series “ Dallas .” Charlton Heston, in town for the filming of “The Greatest Show on Earth,” participated in a play reading of “ Candida ,” taking the place of an ill actor. Polly Holliday performed in two shows at The Sarasota Players Theatre before moving on to be a television star playing Flo in the sitcom “ Alice .”  She was nominated for a 1990 Tony award for her performance as Big Mama in “Cat on a Hot Tin Roof.” Sara Inbar, who performed at The Sarasota Players, earned a part in “Mamma Mia ” on Broadway. Sasha Hanna, a talented dancer who appeared in many of The Players musicals, joined the cast of “Cats” on Broadway. Ashley Rose Orr attended The Sarasota Players Performing  Arts School and went on to Broadway as Gretl in “The Sound of Music.” Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/about-us/meet-the-team/",
      "text": "Meet The Team - The Sarasota Players For Performing Arts, Sarasota, FL Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours meet the team William Skaggs CEO William Skaggs joined The Sarasota Players as CEO in September 2020 bringing extensive experience in philanthropy, operations, and financial services in higher education and performing arts contexts. Originally from Hazard, KY, William is a two-time graduate of Western Kentucky University (BA in Music and MBA). William embraces a broad view of the value of the arts to a community via entertainment, education, and economic impacts. William previously served as Chief Development Officer at Southern Kentucky Performing Arts Center (SKyPAC) in Bowling Green, KY. SKyPAC serves 300,000 people in Southcentral Kentucky via a 1,700-seat mainstage theatre and 200 seat studio theatre with Broadway tours, concerts, and educational programming. SKyPAC experienced record totals of top-level donors and new sponsor commitments during each year of William’s tenure. Before his time at SKyPAC, William was a Financial Advisor with Mass Mutual serving individuals and families in planning, protection, and investing. Beginning with no book of business, William achieved Rising Leaders in his first six months and the Mass Mutual Leaders Conference at the conclusion of his first ten months. Willliam spent twelve years in philanthropy and alumni relations roles at WKU during portions of two comprehensive campaigns totaling more than $300 million. Among those roles was responsibility in campaign, planning, and construction for the Martens Alumni Center, the anchor in a mixed-use development that included hotel, parking, residential, and restaurant projects. William completed his time at WKU with concurrent appointments as Director of Annual Giving and Director of Alumni Resources, overseeing Alumni Association budgets and operations while planning and implementing the university’s centralized and comprehensive annual giving program. William enjoys his family, traveling, Broadway musicals, and college football. He resides in Sarasota with his beautiful wife Jenny, three amazing children, and two spoiled dogs. email Amy Gorman Director of Development Amy joined The Sarasota Players as the Director of Development after nineteen years in philanthropy in the education arena. Originally from New York, Amy graduated with a BA in English from the State University of NY at Stony Brook and a JD from the State University of NY at Buffalo School of Law. Before her career in educational advancement, Amy was a financial underwriter for CNA Insurance Companies in NY, serving large financial institutions. Amy served as Assistant Director of the Annual Fund and Director of the Parents’ Fund at The Taft School in Watertown CT. Upon relocating to the Sarasota area, Amy joined the SCF Foundation as the Corporate Relations Associate responsible for the solicitation of major gifts, donor stewardship, and special event planning. Subsequently, Amy was the Director of Development at Cardinal Mooney Catholic High School. Amy serves on the board of Sisterhood for Good, a local nonprofit philanthropic organization. She enjoys spending time with her family, friends, and her dog, Maeve, a sweet Airedale Terrier. email Amanda Heisey Marketing & PR Director Originally from Kansas City, Amanda attended the University of Missouri-Columbia where she earned a Bachelors of Journalism degree. After moving to Sarasota to work as the web editor for The Business Observer, she then went on to become the Communications Manager for the Arts and Cultural Alliance of Sarasota County which began her steps back into the world of her first love, the arts. As the Marketing Director for The Sarasota Players, she is responsible for social media, website maintenance, press releases, print and digital advertising, playbills, graphic design, and brand management. She is also a local director and performer for various theatres in the area and produces burlesque for Hard Heart Burlesque under the persona Karma Kandlewick. Amanda teaches the Adult Burlesque class at The Players Studio and has private acting students as well as burlesque students. email Brian Finnerty Production manager Brian has worked in the theatre and educational arts for 15 years as a production manager, director, choreographer, instructor, stage manager, costume & scenic designer, and performer. He’s won numerous awards for his direction, choreography, costume design, and performing including Herald Tribune Handy Awards and Broadway World’s Best Costume Design and Choreography. Brian has trained under performing arts icons such as the choreographer for Broadway’s Moulin Rouge , Sonya Tayeh and So You Think You Can Dance’s Anthony Morigerato. He’s the Co-Artistic Director for Dingbat Theatre Project and has worked artistically on many original works such as Big Red Nose Burlesque and Plump Sisters Productions. His role is to manage and facilitate all productions to result in clean and creative theatrical experiences. A native to Florida, Brian’s educational background includes Booker High School’s Visual and Performing Arts Program and Point Park University Conservatory of Performing Arts. email Jill CAstle Costume Shop Manager Jill has been designing, sewing and performing on stage since a very young age, originally from the Adirondacks in upstate New York she has a BFA from Syracuse University in Fiber Arts. Her artwork and performances have been displayed in many university publications and galleries. While living in the Midwest her designs were published in the KC Star as well as through various fashion shows sponsored by vintage shops, quilt shops and nightclubs. She started performing belly dance and costuming in the mid 2000’s while forming an uplifting women’s dance group which raised funds for the local cancer center in upstate New York. While in New Hampshire she taught at Raq-On Dance Studio and performed throughout Vermont and Massachusetts. Here in Florida she has worked with Hip Expressions Belly Dance Studio in St Petersburg since 2013 and found her chosen family in performance artists. Within the theatre world she has sewn for Norwegian Cruise Lines in Riverview FL, Kansas City Costume Company MO, Capital Rep/Proctors in Albany NY and as the Costume Shop Manager and Designer for American Stage Theatre Company in St Pete from 2016 to 2021. Notable awards are for Best Costume Design for Skeleton Crew by Theater Tampa Bay, and voted Costume Design of the Decade for American Stage’s Mamma Mia! by BroadwayWorld.com. When not sitting in front of a sewing machine Jill spends her time as a belly dancer and instructor and as a variety entertainer through her company Miss Bean Entertainment. email Thayer Greenberg Director of Education Thayer Greenberg is a lifelong educator with a commitment to educational excellence. She holds a bachelor’s degree in educational arts administration from UMASS Amherst and is currently persuing a master’s in organizational leadership at the University of Colorado Boulder. With a background of over 15 years in the field of education, she has honed her expertise through immersive experiences in vibrant cultural hubs like Chicago and New York City.  In her role as the Director of Education at The Players Studio, Thayer oversees the daily operations of the Education Department, creating and implementing new programs and curriculum with her team and ensuring the studio is a safe inviting place for students to come and explore the art of performance.  Beyond her professional endeavors, Thayer finds joy in singing, and cooking! With a passion for both nurturing young minds and fostering creativity, Thayer is excited to continue cultivating the Players Studio! email Jason Ellis Assistant Director of Operations With over a decade of experience in operations leadership, Jason Ellis brings a sharp focus on strategy, structure, and customer excellence to every organization he supports. His career includes leadership roles such as District Manager in Florida’s medical cannabis industry and management positions with The Ritz-Carlton, where he developed a deep understanding of premium service and team development. A Bradenton, Florida native, Jason is equally passionate about the arts. For more than 15 years, he has been an active figure in the local theatre scene. He studied Theatre and Business Management at the State College of Florida, building a dual path as both a professional and volunteer performer. His stage credits span regional musical theatre, immersive cabaret, and variety entertainment. He also performs as his alter ego, Swanky Valli , frequently emceeing for local burlesque troupes including Hard Heart Burlesque and Big Red Nose Burlesque. The Sarasota Players was the first community theatre where Jason found both a stage and a sense of belonging. Returning now in a leadership capacity, he’s honored to blend his professional expertise with his artistic passion in support of an institution that helped shape his journey. For him, this role is more than a job—it’s a meaningful homecoming and a chance to give back to the theatre that gave him his start. email SCOTT SCHUSTER Technical Director Scott ’s love for community theater began in New Mexico, where he explored acting, singing, and dancing with both the Albuquerque Civic Light Opera Association and the Albuquerque Little Theatre. Throughout his career, Scott has been fortunate to work professionally in vibrant theater, film, and television communities across the country including a national tour with The Boston Chamber Theater, portraying Ichabod Crane in The Legend of Sleepy Hollow . In addition to his performance work, Scott has received numerous accolades for his technical contributions. He was awarded Best Technical Direction for The Full Monty and has been recognized for his set designs in productions such as To Kill a Mockingbird (Iowa) and Gruesome Playground Injuries (Colorado). Scott is thrilled to continue his theatrical journey with The Sarasota Players. He credits his success to the unwavering love and support of his family—his parents, siblings, mother-in-law—and especially his partner, Shad, whose encouragement has been invaluable. email Logan Junkins Assistant Technical Director email Cheyenne Holcomb Box Office Manager email email Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/support-us/donate/",
      "text": "Become a sponsor - The Sarasota Players for Performing Arts, Sarasota, FL Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours 96th Season Sponsorships Sponsor all five 96th Season Main Stage productions and play a leading role in bringing unforgettable theatre to our community and visitors along the Cultural Coast! Get involved with the first performing arts organization in Sarasota and make a lasting impact on your community. You can make your sponsorship gift by contacting Amy Gorman at amyg@theplayers.org or by calling 941.365.2494. ext. 105. Sponsor today! Season Sponsorship Sponsor all five 96th Season Main Stage productions and play a leading role in bringing unforgettable theatre to our community and visitors along the Cultural Coast! Executive Producer ( $10,000) Playbill recognition with full-page color ad in premium spot (inside cover, inside back cover, back page) Curtain speech recognition as Star Sponsor for all five mainstage shows Curtain Recognition at all studio productions and off-site productions. Speech recognition at ground breaking ceremony at Payne Park Auditorium and Donor Appreciation event (10-16-25) Lobby recognition all season with star billing Logo recognition on The Sarasota Players website theplayers.org Eight (8) tickets to each 96th Season show (40 total tickets) Four (4) drink tickets to each 96th Season show (20 total tickets) Invitation to opening night celebration for all five shows. Four (4) tickets to 96th Season Celebration Event: Plated! to be held on 2/7/26 Producer ($5,000) Playbill recognition with full-page color ad Curtain speech recognition as Producer Sponsor for all five mainstage shows Speech recognition at ground breaking ceremony at Payne Park Auditorium and Donor Appreciation event on 10/16/25 Lobby recognition all season Logo recognition on The Sarasota Players website theplayers.org Four (4) tickets to each 96th Season show (20 total tickets) Two (2) drink tickets to each 96th Season show (10 total tickets) Invitation to opening night celebration for all five shows. Two (2) tickets to 96th Season Celebration Event, Plated ! to be held on 2/7/26 Associate Producer ($3,500) Playbill recognition with half-page ad Lobby recognition all season Two (2) tickets to each 96th Season show (10 total tickets) Invitation to opening night celebration for each show Show Sponsorship Sponsor one (or more) of our 96th Season Main Stage productions and help us bring show-stopping performances, unforgettable stories, and the magic of live theatre to our community and visitors along the Cultural Coast! Director ($1,000) Curtain speech recognition during sponsored show Lobby recognition during sponsored show Playbill recognition with logo Invitation to opening night celebration of sponsored show(s) Four (4) tickets to sponsored show Assistant Director ($500) Lobby recognition during sponsored show Playbill recognition with logo Invitation to opening night celebration of sponsored show(s) Two (2) tickets to sponsored show OVATION CIRCLE Take center stage by donating $1,000 or more during the year and join an engaged and dedicated group of patrons who support our mission. Invitation to opening night celebration for all five shows. Sponsor today! Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://www.aberdeenartscentre.com/contact",
      "text": "Contact Us | Aberdeen Arts Centre +44 (0)1224 635 208 info@aberdeenartscentre.com About Us Latest News Room Hire Volunteering Donate Newsletter Save Aberdeen Arts Centre What's On Visit Us Creative Learning Artist Development Local Performing Community Contact Us Main Menu Save Aberdeen Arts Centre What's On Visit Us Creative Learning Artist Development Local Performing Community Contact Us About Us Latest News Room Hire Volunteering Donate Newsletter 33 King Street, Aberdeen, AB24 5AA info@aberdeenartscentre.com +44 (0)1224 635 208 Get In Touch Enquiry Form Your Name Email Phone Number Message We will only use this information to answer your enquiry. Please tick the box to consent to your data being stored in line with the guidelines in our privacy policy (linked below). Submit 33 King Street, Aberdeen, AB24 5AA info@aberdeenartscentre.com +44 (0)1224 635 208 Explore Aberdeen Arts Centre What's On Visit Us Creative Learning News Venue & Room Hire Support Us Volunteering About Us Our History Save Aberdeen Arts Centre What's On Room Hire About Us Visit Us Creative Learning Artist Development Local Performing Community Follow Us On Social info@aberdeenartscentre.com +44 (0)1224 635 208 33 King Street, Aberdeen, AB24 5AA General Enquiries & Box Office: info@aberdeenartscentre.com Technical Enquiries: Barry Sherriffs, Technical Manager barry@aberdeenartscentre.com Fundraising: Julia Smith, Fundraiser julia@aberdeenartscentre.com Press Enquiries: Eoin Smith, Marketing & Communications Manager eoin@aberdeenartscentre.com Programming & Theatre Bookings: Eve Nicol, Programming and Creative Director info@aberdeenartscentre.com Creative Learning: creativelearning@aberdeenartscentre.com Aberdeen Arts Centre is a trading name for Castlegate Arts Limited registered in Scotland Number 192819. Castlegate Arts Limited is a company limited by guarantee with charitable status. Scottish Charity no. SC028552. Privacy Policy Terms and Conditions Cookies Design & Build FortyTwo Studio"
    },
    {
      "url": "https://augustaarts.com/calls-for-artists/creative-careers-the-players-centre-for-performing-arts-seeking-ceo-of-performing-arts-florida/",
      "text": "Creative Careers: The Players Centre for Performing Arts seeking CEO of Performing Arts (Florida) - Greater Augusta Arts Council Follow us Arts Calendar Donate Press Room Artist Directory Promenade and Paint Sculpture Trail Home About Resources Art in Augusta Public Art Tours Events News Support Our Grants Home About Resources Art in Augusta Public Art Tours Events News Support Our Grants Creative Careers: The Players Centre for Performing Arts seeking CEO of Performing Arts (Florida) 15 Jun Creative Careers: The Players Centre for Performing Arts seeking CEO of Performing Arts (Florida) Posted at 11:08h in Calls for Artists , Creative Careers by MaChere Minter Share VIA The Players Centre for Performing Arts: The Players Centre for Performing Arts, Sarasota’s first performing arts organization seeks a CEO / Executive Director to lead the organization as it moves into its next phase. The Players Centre, beginning in 1929, paved the way for what has become Florida’s Culture Coast. This year, The Players Centre is celebrating its 90th birthday and is in the midst of a Capital Campaign and a move to a new location. The Players Centre has partnered with Schroeder -Manatee Ranch, the developers of Lakewood Ranch Communities-the #1 multi-generational community in the country. The Players are actively working with selected architects and builders to design and build a 500 seat Main Stage Theater, Cabaret, Black Box and Studio. THE POSITION Create and implement strategies to meet both the long and short-term goals of the organization, with a specific focus on strategic planning and fund-raising functions. Ensure the fiscal sustainability of The Players with a professional development plan, excellent management skills and revenue generation. Collaborate with the staff member(s) responsible for performance and education programming in the development and operation of a high-quality, sustainable, and mission-centered programming. Empower the staff, engage diverse volunteers, collaborate with the Board, and connect with the greater community through public speaking, social media and strong marketing and external relations. Provide a positive and professional environment to enhance the experience of the entire community our volunteers, staff and patrons. RESPONSIBILITIES In accordance with the mission and goals of the organization, the CEO provides complete over site on: Full operational and financial oversight of the center. Ensuring an ongoing and organization-wide focus on the mission statement. Ultimately responsible for all day-to-day management responsibilities and long-range strategic planning. Maximize overall revenue in order to generate sufficient funds to operate and maintain the facility. Lead the organization with a positive spirit of collaboration and transparency, maintain on-going dialogues with the Centre’s staff, resident companies, funders, external clients, audience members, the media, government agencies and other stakeholders. Fund Development The CEO will develop, implement and collaborate with Advancement Staff in a development plan to meet the short and long-term needs of the organization, which will specifically include the following duties: In collaboration with the Board, implement a measurable development plan, including donor identification and cultivation, direct solicitation, board-directed fundraising campaigns, and fundraising events. Engage prospective contributors throughout the development lifecycle. Adhere to ethical standards of the Association of Fundraising Professionals in the solicitation and utilization of contributions. Oversee internal systems and processes to track, report, and acknowledge contributions. Research, apply for, and administer grant funding opportunities. Staff Leadership The CEO will supervise assigned employees and oversee all human resource activities of The Players including hiring and training retention of staff.   The CEO will also oversee training, performance appraisals as well as payroll and benefits. Fiscal Management The CEO will ensure financial integrity through strong budgeting, planning, policies and procedures, which will specifically include the following duties: Collaborate with Finance Committee to develop an annual budget to protect the long-term financial health of the organization by sound budgeting. Administer and analyze the budget and report on all financial matters to the Board. Work with staff to monitor fiscal operations and make necessary adjustments and alert the Finance Committee on significant variances. Work with the Finance Committee, board and staff on necessary adjustments whenever the financial picture is not up to the plan. Administer Generally Accepted Accounting Principles (GAAP) to maintain sound financial policies and procedures, and internal controls. EDUCATION: Bachelor’s degree required; an advanced degree in arts management, nonprofit management, or related field preferred. COMPENSATION: Compensation and benefits will be competitive and commensurate with experience. [cherry_button text=”Apply Online HERE!” url=”https://www.linkedin.com/jobs/view/1884335243/” size=”extra-large” centered=”yes” fluid=”yes” icon=”icon: fa fa-paint-brush” bg_color=”#666666″ color=”#ffffff” target=”_self”]Register now at https://www.ghia.org/classes/business-being-artist[/cherry_button] Tags: CEO , Chief Executive Officer , Executive Director , Managing Director , Performing Arts , President , Theater , Theatre Join Our Newsletter Name First Last Email CAPTCHA Name This field is for validation purposes and should be left unchanged. Δ Latest News Arts in the Heart of Augusta Festival Street Closings Posted in Community News , What's Hot by Zoe Beard-Ortiz Meet  Tiphiknee De Herrera | September’s featured Artist Posted in Uncategorized , What's Hot by Zoe Beard-Ortiz Meet Arts in the Heart Intern Hannah! Posted in What's Hot by Zoe Beard-Ortiz talk artsy to me with Denise Tucker Posted in Blog , What's Hot by Zoe Beard-Ortiz Arts in the Heart of Augusta Festival Rocks at the River This Year! Posted in Community News , What's Hot by Zoe Beard-Ortiz Contact Us +1-706-826-4702 info@augustaarts.com 1301 Greene Street Augusta, GA 30904 www.augustaarts.com www.artsintheheart.com www.augustasculpturetrail.com Main Nav HOME ABOUT RESOURCES ART IN AUGUSTA PUBLIC ART TOURS EVENTS NEWS SUPPORT OUR GRANTS ARTS CALENDAR DONATE PRESS ROOM Our Mission The mission of the Greater Augusta Arts Council is to enrich the quality of life for citizens and visitors in Augusta River Region by advancing vibrant cultural arts. © Copyright Greater Augusta Arts Council Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://theplayers.org/health-safety-procedures/",
      "text": "Health and Safety Procedures - The Sarasota Players Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours News Health and Safety Procedures Health Procedures: All guests will have their temperatures taken with a no-touch thermometer. Shows are limited to a capacity that allows distancing between all parties. No tickets will be issued at this time to eliminate touch-points. Hand sanitizer will be available around the event. Face coverings will be required at all event unless you are eating or drinking. Cover your mouth and nose with a cloth face cover when around others and while attending event. Practice social distancing. If you are around other people, keep 6 feet between you when possible. You will be seated with your party during the show and distanced from others watching. Avoid handshakes, hugs, and close contact. Do NOT attend if: You are experiencing any symptom of illness (including but not limited to cough, shortness of breath, difficulty breathing, fever, chills, repeated shaking, muscle pain, headache, sore throat, or new loss of taste or smell). You have been diagnosed with Coronavirus/COVID-19 and are not yet cleared as non-contagious by State of Florida officials. You have been exposed to any individual with a suspected or confirmed case of the Coronavirus/COVID-19. You have traveled internationally or to an area in the United States of America that is known to be a high-risk location with respect to the Coronavirus/COVID-19 within the last 14 days. Learn more about The Players and upcoming events by visiting us at www.theplayers.org or by calling 941.365.2494. Amanda Heisey Leave a Replay Upcoming Shows September 2025 Sep 24 2025 The Wedding Singer Studio 1130 Sep 25 2025 The Wedding Singer Studio 1130 Sep 26 2025 The Wedding Singer Studio 1130 Sep 27 2025 The Wedding Singer Studio 1130 No event found! Load More Recent Posts Join the Creative Force BehindThe Sarasota Players! Read More » Into the Woods Playbill Read More » THE SARASOTA PLAYERS EXPANDS THEIR PLAYERS STUDIO EDUCATION PROGRAM Read More » Follow Us Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://theplayers.org/our-vision/",
      "text": "Our Vision - The Sarasota Players for Performing Arts Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours DONATE our vision The Players Centre for Performing Arts is a 92-year institution looking forward to the future in the middle of a fast-growing area filled with possibilities. By the summer of 2023, we’ll break ground at our permanent home on four-and-a-half acres of land at Lakewood Ranch’s Waterside Place development through the support of our generous donors to the Center Stage Capital Campaign. We aim to raise $26.5 million for this project. The Community Foundation of Sarasota County’s Muriel O’Neil Fund for the Performing Arts donated a lead gift of $1 million for the campaign. Our performing arts campus will feature a main stage auditorium, a black box theatre and an extension of The Players Studio. The Players Centre will be the sole performing arts organization in the area east of I-75. Location plays a large role in the move to Lakewood Ranch; according to a study, more than 45% of ticket sales were from attendees located in Whitfield, central and east Sarasota while 28.5% stemmed from the I-75 corridor lining Lakewood Ranch to south Sarasota. Waterside Place is a central location just minutes from those demographics and we can’t wait to bring the power of live theatre to this new community. Volunteer donate now Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://nyperformingartsacademy.org/contact-us/",
      "text": "Contact Us | The NYPAA | New York Performing Arts Academy GIVE THE GIFT OF ARTISTIC GROWTH WITH A NYPAA GIFT CARD SPRING REGISTRATION HAS BEGUN—UNLOCK YOUR ARTISTIC POTENTIAL AT THE NYPAA! SUPPORT THE ARTIST IN YOUR LIFE WITH A NYPAA GIFT CARD ENROLL NOW FOR SPRING & STEP INTO THE SPOTLIGHT AT THE NYPAA! STUDENT PORTAL REQUEST INFO Menu Explore The NYPAA About The NYPAA About Us The NYPAA Locations Academy Calendar Advisory Board Members Get Involved & Contact Academy Ambassador Program Donate Contact Us Student Resources ASPIRE Student Portal Attendance Policy Career Support Events Broadway Tickets Text Alerts Sign-Up Connect With Us Follow Us On Instagram Follow Us On Facebook Follow Us On LinkedIn The NYPAA Store Classes & Programs Year-Long Programs The NYPAA Foundation Acting (1-Year Track) Musical Theatre (1-Year Track) Dance (1-Year Track) The Conservatory @ The NYPAA FALL 26 Acting Conservatory: Stage, Film & TV FALL 26 Musical Theatre Conservatory Fall 26 Dance Conservatory Fall 26 Acting Classes 4-Week: Acting for Stage, Film & TV 8-Week: Acting for Stage, Film & TV 12-Week: Acting for Stage, Film & TV Musical Theatre Classes 4-Week: Broadway Debut 8-Week: Broadway Debut 12-Week: Broadway Debut Dance Classes 1-Day: Ballet & Contemporary 1-Day: Hip-Hop Monthly: Ballet & Contemporary 1-Month Hip-Hop Dance Classes Foundation Classes 4-Week: The NYPAA Foundation 8-Week: The NYPAA Foundation 12-Week: The NYPAA Foundation Summer ’26 Admissions Admissions Admissions Overview New Students Returning Students Apply Now Registration Application Scholarship Application Financial Information Tuition & Fees Financial Assistance Financing Options Resources & Support Academy Calendar Student Housing NYPAA Merch Schools & Groups The NYPAA Gift Card Login Cart 0 Search Menu Cart 0 Offices (Classes are NOT held at our OFFICES) 1441 Broadway #3085 New York, NY 10018, USA +1 212 457-4060 Studios (Classes are held at our STUDIOS) 244 West 54th St. 11th Fl., Room 1102 New York, NY 10018, USA +1 212 457-4060 Contact The NYPAA Get in Touch with Us Please fill out the contact form below for any inquiries, and we’ll get back to you as soon as possible. Name (Required) First Last Email (Required) Comments (Required) Please let us know how we can help. CAPTCHA Explore The NYPAA Explore Programs How to Apply Academy Ambassador Program About Us Contact Us Student Tools & Policies ASPIRE Student Portal Attendance Policy Resources Monologues, Scenes, and Scripts The NYPAA Laptop Program Shop NYPAA Swag Student Support New Students Returning Students Privacy Policy Terms & Conditions ©2025 The New York Performing Arts Academy Cart 0 Updating… No products in the cart. Continue Shopping Login Cart 0 Search for: Search Explore The NYPAA About The NYPAA About Us The NYPAA Locations Academy Calendar Advisory Board Members Get Involved & Contact Academy Ambassador Program Donate Contact Us Student Resources ASPIRE Student Portal Attendance Policy Career Support Events Broadway Tickets Text Alerts Sign-Up Connect With Us Follow Us On Instagram Follow Us On Facebook Follow Us On LinkedIn The NYPAA Store Classes & Programs Year-Long Programs The NYPAA Foundation Acting (1-Year Track) Musical Theatre (1-Year Track) Dance (1-Year Track) The Conservatory @ The NYPAA FALL 26 Acting Conservatory: Stage, Film & TV FALL 26 Musical Theatre Conservatory Fall 26 Dance Conservatory Fall 26 Acting Classes 4-Week: Acting for Stage, Film & TV 8-Week: Acting for Stage, Film & TV 12-Week: Acting for Stage, Film & TV Musical Theatre Classes 4-Week: Broadway Debut 8-Week: Broadway Debut 12-Week: Broadway Debut Dance Classes 1-Day: Ballet & Contemporary 1-Day: Hip-Hop Monthly: Ballet & Contemporary 1-Month Hip-Hop Dance Classes Foundation Classes 4-Week: The NYPAA Foundation 8-Week: The NYPAA Foundation 12-Week: The NYPAA Foundation Summer ’26 Admissions Admissions Admissions Overview New Students Returning Students Apply Now Registration Application Scholarship Application Financial Information Tuition & Fees Financial Assistance Financing Options Resources & Support Academy Calendar Student Housing NYPAA Merch Schools & Groups The NYPAA Gift Card Login Cart 0 Login Cart 0 Explore The NYPAA About The NYPAA About Us The NYPAA Locations Academy Calendar Advisory Board Members Get Involved & Contact Academy Ambassador Program Donate Contact Us Student Resources ASPIRE Student Portal Attendance Policy Career Support Events Broadway Tickets Text Alerts Sign-Up Connect With Us Follow Us On Instagram Follow Us On Facebook Follow Us On LinkedIn The NYPAA Store Classes & Programs Year-Long Programs The NYPAA Foundation Acting (1-Year Track) Musical Theatre (1-Year Track) Dance (1-Year Track) The Conservatory @ The NYPAA FALL 26 Acting Conservatory: Stage, Film & TV FALL 26 Musical Theatre Conservatory Fall 26 Dance Conservatory Fall 26 Acting Classes 4-Week: Acting for Stage, Film & TV 8-Week: Acting for Stage, Film & TV 12-Week: Acting for Stage, Film & TV Musical Theatre Classes 4-Week: Broadway Debut 8-Week: Broadway Debut 12-Week: Broadway Debut Dance Classes 1-Day: Ballet & Contemporary 1-Day: Hip-Hop Monthly: Ballet & Contemporary 1-Month Hip-Hop Dance Classes Foundation Classes 4-Week: The NYPAA Foundation 8-Week: The NYPAA Foundation 12-Week: The NYPAA Foundation Summer ’26 Admissions Admissions Admissions Overview New Students Returning Students Apply Now Registration Application Scholarship Application Financial Information Tuition & Fees Financial Assistance Financing Options Resources & Support Academy Calendar Student Housing NYPAA Merch Schools & Groups The NYPAA Gift Card Login Username or email address * Required Password * Required Remember me Lost your password? Log in Search Search for: Search"
    },
    {
      "url": "https://theplayers.org/about-us/",
      "text": "About Us - The Players Centre Skip to content Icons-facebook Icons-instagram Box Office: 941.365.2494 Tickets Donate Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours Shows Events Calendar Subscriptions 2025-26 – 96th Season Players New Play Festival Submit a play! Festivals & Productions Auditions Seating Chart Directions & Hours Education Classes Performance Groups The Sarasota Players Follies Camps Broadway Competition Team Studio Faculty Register Support Us Become a sponsor Volunteers Our Sponsors Fundraisers Join Us Auditions Careers Volunteers Fundraisers About Us We are The Sarasota Players News / Blog Our History Meet The Team Board of Trustees Careers Directions & Hours about us The Sarasota Players is Sarasota’s community theatre, dedicated to delivering quality productions and keeping the community engaged with the arts. The Sarasota Players seeks to provide an artistic outlet for locals and visitors alike to experience live theatre and live theatre training. The Sarasota Players is a non-professional theatre, located on the “Cultural Coast.” This location gives us an incredible talent pool to work with. Founded in 1929, The Players is celebrating 94 years of bringing the community to the stage. Being the second oldest arts organization in Sarasota and the oldest performing arts organization, The Players is proud to have fostered the budding performing arts scene that has grown into a thriving, theatre-loving community. In the last nine decades, The Players has become a staple for community members to learn, grow and experience live theatre. The Players Studio teaches all ages and abilities, with no student turned away for their inability to pay thanks to our Building Better Grownups Scholarship Fund. Students can take classes in acting, singing, dance, sewing, directing, as well as specialized workshops and camps. The performing arts help students develop crucial life skills and increases self-esteem and confidence, as well as problem solving and critical thinking. Over 300 students come through The Players Studio each year. No other venue in town allows patrons to potentially see their friends, relatives, and neighbors fulfill their dream of performing on stage. We are truly local performances, by local performers. We give people a second family, a place to learn about themselves, to hone their skills, to meet new friends and to express themselves creatively. Our Mission Statement Entertain, educate, and engage the community through high quality live theatre. Values statement Artistic Excellence Knowledge Inclusivity Integrity Passion Authenticity Studio & Mailing 1400 Blvd. of the Arts, Suite 200 Sarasota, FL 34236 941.552.8879 Performance Venue & Box Office The Crossings at Siesta Key 3501 South Tamiami Trail, Suite 1130 Sarasota, FL 34239 BoxOffice@ThePlayers.org Box Office Telephone: 941.365.2494 Icons-facebook Icons-instagram Shows Calendar All Shows Subscriptions Seating Chart Support Us Donate Our Sponsors Fundraisers Studio Education Classes and Workshops Register for Classes Performance Groups About Us Directions & Hours News / Blog Meet Our Staff Studio Faculty Board of Trustees Our History Join Us Auditions Careers Volunteer With Us THE SARASOTA PLAYERS MEETS ALL REQUIREMENTS SPECIFIED BY THE FLORIDA SOLICITATION OF CONTRIBUTIONS ACT.  A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) 850-410-3800 WHEN CALLING FROM OUTSIDE OF FLORIDA OR AT THE DIVISION’S WEBSITE WWW.FDACS.GOV.  REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL OR RECOMMENDATION BY THE STATE. REGISTRATION NO. CH8025. Terms & Conditions Privacy Copyright © 2019-2025 The Sarasota Players"
    },
    {
      "url": "https://taylorcentre.ca/ContactUs/index.htm",
      "text": ""
    }
  ]
}