{
  "fuentes": [
    {
      "url": "https://www.news-press.com/story/life/food/2023/08/12/rum-bucket-tbrings-is-making-a-splash-the-hut-restaurant-has-new-name-new-menu-and-old-florida-charm/70529609007/",
      "email": "rhgeorge@gannett.com"
    },
    {
      "url": "https://www.fox4now.com/news/local-news/lee-county/southwest-florida-restaurants-continuing-to-struggle-to-hire-after-ian",
      "email": "closedcaptioning@fox4now.com"
    },
    {
      "url": "https://www.fox4now.com/news/local-news/lee-county/southwest-florida-restaurants-continuing-to-struggle-to-hire-after-ian",
      "email": "kaitlin.knapp@fox4now.com"
    },
    {
      "url": "https://www.fox4now.com/news/local-news/lee-county/southwest-florida-restaurants-continuing-to-struggle-to-hire-after-ian",
      "email": "shahbeila.brown@scripps.com"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://www.goerie.com/story/news/local/2015/01/11/owner-erie-s-rum-runners/24718828007/",
      "email": "epalattella@timesnews.com"
    }
  ],
  "mails": [
    "closedcaptioning@fox4now.com",
    "epalattella@timesnews.com",
    "info@communityaccessnaperville.org",
    "info@rivervillegrill.com",
    "kaitlin.knapp@fox4now.com",
    "rhgeorge@gannett.com",
    "shahbeila.brown@scripps.com"
  ],
  "nombre_sitio": "therumbucket.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.news-press.com/story/life/food/2023/08/12/rum-bucket-tbrings-is-making-a-splash-the-hut-restaurant-has-new-name-new-menu-and-old-florida-charm/70529609007/",
      "text": "Rum Bucket Bar & Grill breathes new life into former home of The Hut 9/11 remembrances, ceremonies across Southwest Florida: Photos News Cape Coral Sports Opinion Restaurants Advertise Obituaries eNewspaper Legals FOOD Iconic Buckingham restaurant The Hut is back with new owners, new name, same Florida charm Robyn George Fort Myers News-Press If you’ve lived in Lee County long enough, you’re probably familiar with The Hut. The history of the iconic Buckingham restaurant dates back 100-plus years, to Thomas Edison ’s time when Edwin Peace built the home. The story goes that Peace, a German mariner, collected and imported rare plants, creating lush tropical gardens on the then 20-plus acre property for his Tahitian bride. Edison visited the property and purchased and exchanged plants with Peace. It became a restaurant in 1973. The Hut thrived for decades, becoming a favorite wedding and special event destination. By the time Tommy Lee Cook, who owns the Buckingham Bar down the road, bought it in late 2011, the 8,100-square-foot building and its now four acres of historic gardens had become dilapidated under a series of owners. Cook resurrected it, building new boardwalks and decks and refurbishing the pond and waterfalls and renovating it into a fine-dining restaurant. Roughly four years later, after chefs came and went, Cook put it up for sale for $2.3 million. He took it off the market in 2017, reopening in November with a simpler, American-style menu. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. It closed again in early 2020 and remained vacant for a couple of years. New life for an old Florida restaurant This is where Shauna and Jesse Shows come in. They purchased the property Aug. 30, 2022, just before Hurricane Ian hit. It’s their second restaurant, the first being the Nav-A-Gator Bar & Grill ― an old Florida-style restaurant in Arcadia. “It might just be our niche, breathing new life into iconic Florida spots,” said Shauna. “When we saw The Hut, it was like the writing was on the wall. We thought this is us for sure.” When they opened the restaurant on Jan. 1 this year, they didn’t bring back The Hut name. Instead, Rum Bucket Bar & Grill was born. “After we bought the property, we wanted to think of something fun, something old Florida,” said Shows. “We read about the history of rum barrels coming into Florida. We thought that was fun and fitting for the area.” Seafood, steaks and plenty of rum on the menu Along with the new name comes a new menu. “It’s American food that’s homemade,” Shows said. “It’s comfort items with something for everyone. And it’s priced for the average family so they can come more than once a month. We’re not a special occasion place. I think we found our sweet spot with it.” It’s already known for its seafood and signature steaks. “We have a hand-cut rib-eye with rum sauce that’s a favorite,” Shows said. “Everyone asks for more sides of that rum sauce.” Burgers are also a big hit. “Our beef is excellent,” Shows said. “My husband orders burgers everywhere we go and he’s very picky with our beef.” He also takes the fish fry very seriously, according to Shows. When it comes to Thursday’s all-you-can-eat special, “he wanted a clean, quality, consistent fish,” so they went with Icelandic cod. It’s AYCE all day, open to close, for $18.95. On Wednesdays, shrimp – boiled and fried – is AYCE for $21.95. Appetizers (from gator bites to a firecracker meat and cheese board), salads, sandwiches and wraps fill out the menu. On the cocktail side, more than a dozen rums are offered in a variety of tropical drinks. Now open: Beloved Fort Myers Beach breakfast, lunch joint washed away by Ian makes heavenly return “Pain Reliever is a really good tropical tiki drink everybody loves here,” Shows said. “And of course, the rum buckets.” Buckets with three or four rums (strawberry, coconut, mango, pineapple and passion fruit) or Tanteo margarita are available. “The rum buckets are two cocktails in one,” Shows said. “And you can keep the souvenir bucket. It brings getaway vibes. We want it to feel like you’re on a vacation here.” Highlights of the past live in the present Cook did major renovations when he was the owner, most of which can still be seen. The massive mural, which took local artist Erma Jean more than 700 hours to create in 2012, still adorns the dining room walls. The decks, boardwalks and ponds of the past remain. Koi swim in the pond. A “Welcome to The Hut” sign hangs in the entryway and an impressive tiki statue guards a side yard. But plenty of work remains for the Shows. “We’re replacing the decking in sections,” Shows said. “Every Monday when we’re closed, we are working on sections of the deck. It’s constant upkeep.” The grounds are still impressive even though “Hurricane Ian did major tree trimming.” Customers stroll around the property, taking in all the natural beauty. Some bring chairs or blankets and sit on the lawn, listening to live music on the weekends. Shades of old Florida and The Hut are alive and well at the Rum Bucket. Rum Bucket, 5150 Buckingham Road, Fort Myers; open 11 a.m. to 9 p.m. Tuesday to Saturday and 11 a.m. to 8 p.m. Sunday, closed Monday; indoor and outdoor seating options are available; (239) 288-6975; therumbucket.com ; follow on Facebook and Instagram Robyn George is a food and dining writer for The Fort Myers News-Press. Send news to rhgeorge@gannett.com . Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote Your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-press.com. All rights reserved."
    },
    {
      "url": "https://www.fox4now.com/news/local-news/lee-county/southwest-florida-restaurants-continuing-to-struggle-to-hire-after-ian",
      "text": "Southwest Florida restaurants continuing to struggle to hire after Ian Watch Now Menu Local National Weather Sports Traffic Watch Now Watch Now Close × Live Watch Alerts Search site Go News Local News Affordable Housing Covering Florida Investigates As Seen on 4 Viewer Submission National News World News Lifestyle Sports Entertainment Weather Hourly Forecast Daily Forecast Hurricane Center Severe Weather Alerts Weather Radar Live Cameras Video Immigration Action About Us Station History FOX 4 News Team Streaming Apps Programming Guide Contact Us Advertise with Us WFTX Contests Support Traffic Local Experts Health Experts Home Experts Trusted Advisors Fox 4 Plus 4 Things To Do This Weekend Florida Panthers FC Naples Florida Lottery Winning Numbers Social Media Fox4 Facebook Fox4 Twitter Fox4 YouTube Fox4 Instagram WFTX Contests Sign In Newsletters Sign Out Manage Emails Apps Careers Search Fox4FortMyers Fox4Now 1 WX Alerts 1 Closings/Delays Lee Collier Charlotte In Your Community Local News Videos More + Quick Links + Lee Collier Charlotte In Your Community Local News Videos News Local News Lee County Actions Facebook Tweet Email Southwest Florida restaurants continuing to struggle to hire after Ian Prev Next Some southwest Florida businesses say they are still having a hard time finding workers. One restaurant was forced to close on Monday in order to give their current employees a break.  Rum Bucket Bar and Grill in Buckingham has close to 40 employees, and the owner says they need more to fully open. By: Kaitlin Knapp Posted and last updated BUCKINGHAM, Fla. — Some southwest Florida businesses say they are still having a hard time finding workers. One restaurant was forced to close on Monday in order to give their current employees a break. Rum Bucket Bar and Grill in Buckingham has close to 40 employees, and the owner says they need more to fully open. \"I have a feeling we turned away a lot of business today,\" said Shauna Shows, owner of the Rum Bucket. \"It's heartbreaking.\" She believes the hiring issues has been a constant for about two years, well before Hurricane Ian hit. \"Our highest demand and priority right now is the kitchen, the back of the house,\" Shows said. \"More staff would be great. We could easily employ 10 to 12 more.\" The worker shortage is a challenge for restaurants across southwest Florida, like Blue Dog in Matlacha. Who also reopened, and said they can easily hire 10 to 15 more people. Shows thinks the issues comes back to the housing crisis and childcare for families. \"I do think a lot of people have been displaced, and there's less and less rentals available,\" she explained. Brian Hamman, CEO of the Greater Fort Myers Chamber of Commerce, believes it comes back to who isn't looking for work. According to the U.S. Chamber of Commerce, three million people are not participating in the workforce. \"When you have that few people looking for work and you have that many jobs opening, it really creates a hard time for the employers looking for employees,\" he said. Besides job fairs and social media, Hamman says workers who lost their jobs because of Ian could need help. In total, the latest federal numbers from November, show Lee County has about 13,000 people who are unemployed. \"There are more jobs open than there are employees to fill them,\" Hamman said. Despite the worker shortage, Hamman says businesses are reporting strong visitor spending this year, fueling our economy after Ian. However, more employees is what's going to help restaurants like Rum Bucket. To fill the gap, Shows brought over her employees from the Arcadia location. Which sustained damage from Ian, meaning employees cannot work there. Some employees are driving 30 to 45 minutes to work in Buckingham. \"The more we get, the more we can grow,\" Shows said. \"If we don't get more people we'll continue to adapt and be successful in just other ways.\" Shows says people are applying, but when it comes down to the interview most applicants are not showing up. If you would like to apply, Shows says to simply visit their location and ask for a manager. Copyright 2023 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Sign up for the Headlines Newsletter and receive up to date information. now signed up to receive the Headlines Newsletter. Click here to manage all Newsletters About Us Local Coverage on Your Phone or Streaming TV. Watch Live and Free 24/7. Weather Traffic News Money Entertainment Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact Fox4FortMyers Fox4Now © 2025 Scripps Media, Inc Give Light and the People Will Find Their Own Way"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://www.goerie.com/story/news/local/2015/01/11/owner-erie-s-rum-runners/24718828007/",
      "text": "Owner of Erie's Rum Runners buys bayfront land News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals LOCAL Owner of Erie's Rum Runners buys bayfront land Ed Palattella epalattella@timesnews.com A mainstay of Erie's bayfront has expanded his reach. A partnership that includes Tim Sedney, who owns Rum Runners Bar and Grill, has purchased the restaurant property as well as two adjacent parcels on East Dobbins Landing -- a storage lot and a bait-shop building that once housed the now-defunct Lund Boat Works. Lake Front Realty, made up of Sedney and his business partner, Gary Liebel, bought the three properties in December for a total of $750,000 from Lund Boat Works Inc. Sedney had been leasing the Rum Runners property from Lund Boat Works, which led to rumors over the years that the lease would soon be up and the bar -- popular among boaters, who can pull up next to it -- would close. With his purchase of the parcel, \"Rum Runners will continue on,\" Sedney said. \"Finally, now that I have control of the property, it is a whole different story. We aren't going anywhere.\" Sedney, 50, also owns Rum Runners Cove, a restaurant in the Sheraton complex on West Dobbins Landing; and co-owns the Lady Kate tour boat, the Scallywags pirate-themed pleasure boat and the O Danny O fishing charter boat. He and Liebel formerly owned the Victorian Princess paddle-wheeler. Sedney said he is considering nonresidential projects for the two other newly purchased parcels, but he declined to detail his ideas because they are not final. \"I do have plans,\" he said. Sedney also had been leasing the other two properties from Lund Boat Works. He had been subletting them to tenants that include Leclair Point, a bait and tackle shop that remains in business in the former Lund Boat Works building. Sedney and his family have a long history with the 1,271-square-foot Rum Runners Bar and Grill and its 0.6-acre lot. His mother, Carol, who died at 73 in 2013, opened Rum Runners there with his father, Jerry Sedney, in 1988. Jerry Sedney died at 51 in 1990, and financial issues caused Carol Sedney to sell the property to Lund Boat Works for $430,000 in 1991, according to county property records. Lund Boat Works and its owner, J. Douglas James, an Erie businessman, immediately leased the property to the Sedney family, who continued to operate Rum Runners. Tim Sedney said he was ready to buy whenever the property went up for sale. \"I am absolutely thrilled,\" he said of the purchase. \"It is something I always wanted to do -- get that property back. I am glad it came full circle.\" He said the purchase includes boat slips behind all the parcels and a boat maintenance and repair building behind Rum Runners. Sedney has been subletting that building to Maritime Marine, which also remains in business there. Lund Boat Works bought the 0.3-acre storage lot for $150,000 from another Erie family in December 1991, and in 1994 bought the 9,000-square-foot former Lund Boat Works building, on 0.3 acres, from the Erie County Industrial Development Authority. The sale price for that building, erected in 1932, was not available in property records. Sedney said he had been leasing that building and the storage lot from Lund Boat Works since shortly after James died in Florida at age 92 in 2011. James' family, no longer in Erie, retained ownership of the properties, and in 2013 decided to offer them to Sedney to buy \"and develop as he sees fit,\" said the lawyer for the James family, Robert Dwyer, of Erie. He said Lund Boat Works stopped operating after James died. The company's founder was celebrated Erie boat builder Herman Lund, who died at 91 in 1981. James, a sailing enthusiast and chief executive of the Erie-based High Pressure Equipment Co., once had ambitious plans for the property on East Dobbins Landing. In 2003, he proposed building a high-rise condominium in conjunction with a proposed commercial and residential development of property the Erie-Western Pennsylvania Port Authority owns on East Dobbins Landing, west of the former Lund Boat Works. The Port Authority project, called McAllister Place, has never proceeded, and neither did James' high-rise, largely because of city ordinances, said the Port Authority's executive director, Brenda Sandberg, who was the city's zoning officer when James proposed his plan. Sandberg said she does not believe the Port Authority had an offer to buy the former Lund Boat Works property. She said she welcomes Sedney's commitment to that area. \"It is certainly good,\" she said. \"It is certainly time to see increased development on that property.\" Sedney said the purchases fit with his family's vision of an expanding waterfront. \"I am heavily invested in Erie's bayfront,\" he said. \"We've been around a long time. We've seen a lot of things happen here.\" ED PALATTELLA can be reached at 870-1813 or by e-mail. Follow him on Twitter at twitter.com/ETNpalattella. Careers Staff Directory Accessibility Sitemap Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.goerie.com. All rights reserved."
    }
  ]
}