{
  "fuentes": [
    {
      "url": "https://www.strategy.com/investor-relations/executive-team/michael-saylor",
      "email": "ir@microstrategy.com"
    },
    {
      "url": "https://thesailorsreturn.com/contacts/",
      "email": "ttmeyers@thesailorsreturn.com"
    },
    {
      "url": "https://www.tcpalm.com/story/news/local/martin-county/2024/11/03/sailors-return-is-a-waterfront-steak-and-seafood-restaurant-in-stuart/75071863007/",
      "email": "melissa.holsman@tcpalm.com"
    },
    {
      "url": "https://www.sailor-sailor.com/pages/contact-us",
      "email": "info@sailor-sailor.com"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "94105editor@sailors.orgseattle"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "dispatcherdispatcher@sailors.org"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "dispatcher@sailors.org"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "editor@sailors.org"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "honolulu@sailors.org"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "matt@sailors.org"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "roy@sailors.org"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "sam@sailors.org"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "seattle@sailors.org"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "email": "wilmington@sailors.org"
    },
    {
      "url": "https://www.sailor-sailor.com/pages/shipping-and-returns",
      "email": "info@sailor-sailor.com"
    },
    {
      "url": "https://www.rmg.co.uk/collections/objects/rmgc-object-12568",
      "email": "images@rmg.co.uk"
    },
    {
      "url": "https://www.tenshon.com/blogs/news/the-sailors-return",
      "email": "info@tenshon.com"
    }
  ],
  "mails": [
    "94105editor@sailors.orgseattle",
    "dispatcher@sailors.org",
    "dispatcherdispatcher@sailors.org",
    "editor@sailors.org",
    "honolulu@sailors.org",
    "images@rmg.co.uk",
    "info@sailor-sailor.com",
    "info@tenshon.com",
    "ir@microstrategy.com",
    "matt@sailors.org",
    "melissa.holsman@tcpalm.com",
    "roy@sailors.org",
    "sam@sailors.org",
    "seattle@sailors.org",
    "ttmeyers@thesailorsreturn.com",
    "wilmington@sailors.org"
  ],
  "nombre_sitio": "thesailorsreturn.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.strategy.com/investor-relations/executive-team/michael-saylor",
      "text": "Michael J. Saylor Network About Merch Software Michael J. Saylor Executive Chairman Investor Relations Executive Team Michael J. Saylor Mr. Saylor has served as Executive Chairman since August 2022. He is the co-founder of Strategy and previously served as Chief Executive Officer from 1989 to 2022. He is also the chairman of the board of directors of Strategy, a position he has held since co-founding the company. Michael Saylor is an American entrepreneur, executive, inventor, author, and philanthropist. He was born to a military family in Lincoln, Nebraska, in 1965 and spent his childhood living on various U.S. Air Force bases around the world. By his teenage years, his family had settled at Wright-Patterson Air Force Base near Dayton, Ohio—the birthplace of aviation and home of the Wright brothers. He graduated from high school first in his class, served as both class marshal and valedictorian, and was voted most likely to succeed by his peers. Mr. Saylor attended the Massachusetts Institute of Technology (MIT) on a full Air Force Reserve Officer Training Corps scholarship. While at MIT, he was a member of the Theta Delta Chi fraternity, and obtained dual degrees in aeronautics and astronautics as well as science, technology and society. In his free time, he played guitar in a rock band and learned to fly gliders. Mr. Saylor became fascinated by the application of computer simulation technology to public policy and business strategy, eventually writing his thesis \"A Mathematical Model of a Renaissance Italian City State\" while studying system dynamics at the MIT Sloan School of Management. In 1987, Mr. Saylor graduated with highest honors from MIT. Having already successfully completed flight officer training at Lackland Air Force Base in San Antonio, Texas, where he learned to fly, he was commissioned as a Second Lieutenant in the United States Air Force. He joined the Air Force Reserve and began a career in consulting, with a focus on constructing computer simulations to support strategic decision-making at companies such as DuPont, Dow, and Exxon. In 1989 at the age of 24, Mr. Saylor combined his passions for technology, business, and the use of computer simulations to launch Strategy. The company was founded on his vision of helping enterprises deliver intelligence everywhere. By harnessing the power of graphical operating systems and client server computing, and pioneering a new approach to business intelligence called relational online analytical processing (ROLAP), the company grew steadily, going public in 1998 (NASDAQ: MSTR). Under his leadership, Strategy has emerged as a global leader in enterprise analytics and mobility software, serving thousands of organizations around the world. Mr. Saylor is a named inventor on more than 48+ patents. In addition to being credited as the inventor of relational analytics, he led Strategy into the fields of web analytics, distributed analytics, mobile analytics, cloud computing, mobile identity, and IoT. He was also the creator and founder of Alarm.com (NASDAQ: ALRM), one of the first home automation and security companies, and Angel.com (sold to Genesys Telecommunications Laboratories for $110 million in 2013), one of the first cloud-based interactive voice response service providers. Mr. Saylor is the author of the book The Mobile Wave: How Mobile Intelligence Will Change Everything , published by Perseus Books in 2012. The book anticipated the impact of mobile, cloud, and social networks on worldwide political and economic development, along with the rise of Apple, Amazon, Facebook, and Google as transnational technology leaders that would destabilize the status quo across most industrial and political domains. The Mobile Wave appeared on both The New York Times and The Wall Street Journal Best Seller lists. In 1999, Mr. Saylor established The Saylor Foundation, which has donated millions to philanthropic causes including children's health, refugee relief, education, environmental conservation, and support for the arts. The foundation runs the Saylor Academy ( Saylor.org ), which offers free college education and continuing professional development courses to students worldwide. To date, it has provided free educational services to more than 2 million students. © 2025 Strategy. All Rights Reserved. Contact Us Media Kit Legal Terms of use Privacy policy"
    },
    {
      "url": "https://thesailorsreturn.com/contacts/",
      "text": "The Sailor’s Return Restaurant in Stuart Florida (772) 872-7250 (772) 872-7250 625 SW Anchorage Way Stuart, FL 34994 ABOUT REVIEWS GALLERY SERVICE CHARGE DISCLOSURE Book Online Happy Hour MENUS LUNCH EARLY DINNER DINNER SUMMER MENU HAPPY HOUR BANQUET MENUS Drink Menu LIVE MUSIC Gift Cards Rewards CONTACT Employment Contact Sailor’s Return LOCATION 625 SW Anchorage Way Stuart, FL 34994 TABLE BOOKING (772) 872-7250 BOOK ONLINE GET DIRECTIONS Open Google Maps or visit our Page HOURS Sunday – Thursday: 11:30 am – 9:00 pm Friday & Saturday: 11:30 am – 10:00 pm MENU HOURS Lunch Served Daily: 11:30 am – 2:30 pm Dinner Sunday – Thursday: 5:00 pm – 9:00 pm Dinner Friday & Saturday: 5:00 pm – 10:00 pm EARLY DINNER MENU HOURS Served Daily: 2:30 pm – 5:00 pm MESSAGE SAILOR’S If you need to make a reservation, please contact us by phone at (772) 872-7250. For band bookings, please email Tracy Thomas-Meyers TTMeyers@thesailorsreturn.com Your Name* Your Email* Your Phone Your Message ©\n2025\t\t                        \nSailor's Return Restaurant | (772) 872-7250\nWebsite Creatively Created By Creative Insites Call Now Button"
    },
    {
      "url": "https://www.tcpalm.com/story/news/local/martin-county/2024/11/03/sailors-return-is-a-waterfront-steak-and-seafood-restaurant-in-stuart/75071863007/",
      "text": "Sailor’s Return is a waterfront steak and seafood restaurant in Stuart News Indian River Martin St. Lucie Sports Advertise Obits eNewspaper Legals MARTIN COUNTY Staff pick: Legal affairs reporter Melissa E. Holsman recommends Sailor’s Return in Stuart Melissa E. Holsman Treasure Coast Newspapers STUART — TCPalm legal affairs Reporter Melissa E. Holsman enjoys Sailor's Return , in downtown Stuart for great seafood, live music and a stunning sunset view of the St. Lucie River. Sailor’s Return, a picturesque, waterfront eatery opened in 2009 at the 128-slip Sunset Bay Marina and Anchorage, in downtown Stuart. The restaurant, with 220-seat capacity, was built by Bob and Tracy Davis, the husband-and-wife team who owned and operated the Jolly Sailor Pub in downtown Stuart from 1992 to 2003, now the site of Duffy's Sports Grill. Q: Why do you recommend this restaurant? A: Not only is it a great place to catch a meal at a beautiful marina, Sailor’s Return holds special memories for me because when my two brothers Gale and Scott Holsman visit from our native Kansas City, it’s their top go-to favorite place to enjoy outdoor dining, gorgeous sunsets and strolling the marina afterwards. I also was a longtime lunch customer at the Davis’s popular Jolly Sailor, an English-style pub in downtown Stuart. It was always a fun place to hang out, so it was great to see Sailor’s Return open in 2009. Q: What is the restaurant like? A: Sailor’s Return has a fun tropical vibe with nautically themed indoor and outdoor bars, a 220-seat capacity and is accessible by boat with 930 feet of complimentary dockage space. And if you’re dining on a budget, try Sailor’s Return for lunch – same great fare but lighter on the wallet. Q: What is your favorite dish there? A: Known for great seafood and steak entrees, over the years I’ve tried the pan seared blackened snapper, Pork Chop Milanese and Chicken Cordon Blue Kiev. My personal favorite is the pan seared jumbo crab cakes, served with garlic mashed potatoes, vegetables and a yummy remoulade. And jumbo is no exaggeration - these cakes are stuffed with fresh crab meat! Q: Is there something unique on the menu you recommend trying? A: I may be considered an amateur baker, but I could never match the to-die-for delicious Sailor's Return's Sunset Bay orange cake. It’s a super luscious layered cake with a yummy orange-buttercream frosting, topped with brown sugar, walnuts, graham cracker pieces, orange slices and whipped cream. Sailor’s Return Cuisine : Seafood and steak Address : 625 S.W. Anchorage Way, Stuart Phone : 772-872-7250 Hours : 11:30 a.m. to 10 p.m. Sunday through Thursday; 11:30 a.m. to midnight Friday and Saturday Alcohol : Full Bar Online : www.thesailorsreturn.com Living history: Bid underway to place Downtown Stuart on National Register of Historic Places Music therapy program: Music Therapist Moreen Burkart adapts her music to the needs of each client Melissa E. Holsman is the legal affairs reporter for TCPalm and Treasure Coast Newspapers and is writer and co-host of \" Uncertain Terms ,\" a true-crime podcast. Reach her at melissa.holsman@tcpalm.com . If you are a subscriber, thank you. If not, become a subscriber to get the latest local news on the Treasure Coast. Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Promote your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Advertise Your Business Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.tcpalm.com. All rights reserved."
    },
    {
      "url": "https://www.sailor-sailor.com/pages/contact-us",
      "text": "Contact Us\n  \n  \n   – sailor-sailor Clothing Skip to content Close Just In See More Autumn 2025 Endless Summer Summer Cotton ALL CLOTHING See More Dresses Tops Bottoms Skorts DRESSES See More Prints 3/4 Sleeve Short Sleeve Sleeveless Long Sleeve Solid Colors Shop All Dresses SPORT See More Shop All Skorts Sport Tops Sport Dresses OUR PRINTS See More New Prints See More New Prints New Prints See More New Prints SALE SS Outlet Log in Create account Search Open navigation menu Open search bar Search for products on our site Open cart Just In Autumn 2025 Endless Summer Summer Cotton Autumn 2025 Endless Summer Exclusive web specials ALL CLOTHING Dresses Tops Bottoms Skorts Dresses Tops Pants Skorts DRESSES Prints 3/4 Sleeve Short Sleeve Sleeveless Long Sleeve Solid Colors Shop All Dresses Shop All Dresses 3/4 Sleeve Short Sleeves Sleeveless SPORT Shop All Skorts Sport Tops Sport Dresses Shop All Sport Skorts Sport Tops Sport Dresses OUR PRINTS New Prints New Prints New Prints New Prints SALE SS Outlet Open search bar Search for products on our site My Account Open cart Open search bar Search for products on our site Open cart This site has limited support for your browser. We recommend switching to Edge, Chrome, Safari, or Firefox. Spend $150 or more for FREE shipping. FREE shipping will be applied at checkout Contact sailor-sailor How to Get A Hold of Us... Thank you for your interest! Making our customers happy is our #1 priority at sailor-sailor. We welcome ALL comments and questions. Please allow us one to two full business days to respond to email and telephone queries. Postal correspondence will be attended to as quickly as possible. sailor-sailor 742A Kings Highway West Southport, CT. 06890 203.803.0488 info@sailor-sailor.com Kim Haney/Kimberly Hoag Email Us Name Email Please select one ORDER INQUIRY SIZING & FIT WHOLESALE OTHER QUESTION Order Number What's on your mind? We'd love to help. Send Free Shipping on all order over $150 Made in the USA and designed by us in CT Sun Protective SPF 50+ to keep you cool Customer Care Contact Us Shipping and Returns About Us Gift Card Wholesale FAQ Care and Use STORE Locations Join our crew! Stay up to date with new collections, products and sales. Subscribe to Our Newsletter Email is invalid or already taken. © 2025, sailor-sailor Clothing . Powered by Shopify . American Express Apple Pay Discover Google Pay Mastercard PayPal Shop Pay Visa Close Close {\"themeColor\":\"#4044c6\",\"iconColor\":\"#4044c6\",\"showLogo\":false,\"topBottomPosition\":10,\"rightLeftPosition\":10,\"iconSize\":\"extra-small\",\"iconCustomSize\":50,\"position\":\"bottom-left\"}"
    },
    {
      "url": "https://www.sailors.org/contact-us",
      "text": "Contact us | Sailor's Union Skip to main content Search Search Secondary Menu Home Benefits Contact Us Search About Us Shipping Documentation Go to Sea with the SUP U.S. Merchant Marine Constitution History Political Cargo Preference Elections Jones Act Maritime Security Program West Coast Sailors Training SUP Welfare Plan Employee Assistance Program, Sexual Abuse/Harassment and Substance Abuse Retirement Resources SUP Welfare Plan Communications Delegate Resources Contact us Home Contact us Important Addresses / Phone Numbers SUP Headquarters 450 Harrison St. San Francisco CA 94105 (415) 777-3400 (415) 777-5088 fax (415) 777-3616 Dispatcher dispatcher@sailors.org West Coast Sailors 450 Harrison St. San Francisco CA 94105 editor@sailors.org Seattle Office SUP/MFU 4005 20th Ave. West, Ste 115 Seattle, WA 98199 (206) 467-7944 (206) 467-8119 fax seattle@sailors.org Wilmington Office 533 N. Marine Ave. Wilmington CA 90744 (310) 835-6617 (310) 835-9367 fax wilmington@sailors.org Honolulu Office 707 Alakea St. Honolulu HI 96813 (808) 533-2777 (808)533-2778 fax honolulu@sailors.org SUP Welfare Plan 730 Harrison St. San Francisco CA 94107 (415) 778-5490 / (800) 796-8003 Main Fax: (415) 778-5495 SIU-PD Pension Plan 730 Harrison St. San Francisco CA 94107 (415) 764-4987 Pension (415) 764-4991 Supplemental Benefits Plan Andrew Furuseth School of Seamanship 450 Harrison St. San Francisco CA 94105 Sidebar Display No Sea Here Now Hiring Top Wages Excellent Benefits Sign Up with the Sailors' Union of the Pacific Use the QR code for quick contact Opportunities for qualified merchant mariners (MMC, TWIC, Passport), and especially Able Seafarers with offshore STCW credentials such as Basic Safety Training, Able Seafarer/Deck and Vessel Personnel with Designated Security Duties (VPDSD) have never been better. How to Get a Job with the SUP Check out the \"Go to Sea with the SUP\" page on this site. Or to get started fill out the application at the link below and send it in to matt@sailors.org or roy@sailors.org or sam@sailors.org or dispatcher@sailors.org . Include copies of your documents and certificates and an SUP dispatcher will contact you soon. Also, check out our Go To Sea with the SUP page and learn about the required documentation, credentials and certification. There is also broader guidance and discussion on our Shipping Documents page. See also expedited Passport application information for mariners here . Here's the link to our application: Join Sailors' Union Today! The Lookout of the Labor Movement The origins of the Sailors' Union of the Pacific go back to March 6, 1885, when the Coast Seamen's Union was organized on the San Francisco waterfront by a group of three hundred sailors dissatisfied by the wages and conditions aboard ship that existed at that time. In 1886, the Steamship Sailors' Union was organized and in 1891 merged with the Coast Seamen's Union to form the Sailors' Union of the Pacific. The Sailors' Union of the Pacific has been in continuous operation, through good times and bad, for over 129 years an achievement unequaled by any maritime union in the world. Find out more about the purpose, structure, and people of the SUP... Find out more about how to join the SUP... Members: Update your mailing address click here Social Media 2024 All rights reserved. Terms & Conditions Privacy Policy © 2025 Sailor's Union, All rights reserved."
    },
    {
      "url": "https://www.sailor-sailor.com/pages/shipping-and-returns",
      "text": "Shipping and Returns\n  \n  \n   – sailor-sailor Clothing Skip to content Close Just In See More Autumn 2025 Endless Summer Summer Cotton ALL CLOTHING See More Dresses Tops Bottoms Skorts DRESSES See More Prints 3/4 Sleeve Short Sleeve Sleeveless Long Sleeve Solid Colors Shop All Dresses SPORT See More Shop All Skorts Sport Tops Sport Dresses OUR PRINTS See More New Prints See More New Prints New Prints See More New Prints SALE SS Outlet Log in Create account Search Open navigation menu Open search bar Search for products on our site Open cart Just In Autumn 2025 Endless Summer Summer Cotton Autumn 2025 Endless Summer Exclusive web specials ALL CLOTHING Dresses Tops Bottoms Skorts Dresses Tops Pants Skorts DRESSES Prints 3/4 Sleeve Short Sleeve Sleeveless Long Sleeve Solid Colors Shop All Dresses Shop All Dresses 3/4 Sleeve Short Sleeves Sleeveless SPORT Shop All Skorts Sport Tops Sport Dresses Shop All Sport Skorts Sport Tops Sport Dresses OUR PRINTS New Prints New Prints New Prints New Prints SALE SS Outlet Open search bar Search for products on our site My Account Open cart Open search bar Search for products on our site Open cart This site has limited support for your browser. We recommend switching to Edge, Chrome, Safari, or Firefox. Spend $150 or more for FREE shipping. FREE shipping will be applied at checkout sailor-sailor Shipping and Returns Shipping, Returns and Refunds Orders ship within 1-3 business days except during periods of high volume such as promotional sales and holidays. We will honor price adjustments for your order should it go on sale 14 days after shipping to you* * . Please email or call us at 203-803-0488 for adjustments. If for any reason you are not satisfied with your purchase, we will accept returns of unworn, unwashed, undamaged, or defective merchandise that has the original tags attached for a full refund or exchange within 30 days of the delivery date. We value your business and time. As always, sailor-sailor will continue to provide expert customer service throughout the entire process of your order. Returns Returns accepted for 30 days $8.95 flat rate return shipping No restocking fee No Final Sale items If you receive a refund, the cost of return shipping will be deducted from your refund. How to start an online return : Log into your sailor-sailor account using this link : Log into my sailor-sailor account Click on the ORDERS tab. Find the order you want to return, follow the requests. Refunds Once your return is received and inspected, we will send you an email to notify you that we have received your returned item. We will also notify you of the approval or rejection of your refund. If you are approved, then your refund will be processed, and a credit will automatically be applied to your credit card or original method of payment. Late or missing refunds If you haven’t received a refund yet, first check your bank account again. Then contact your credit card company, it may take some time before your refund is officially posted. Next contact your bank. There is often some processing time before a refund is posted. If you’ve done all of this and you still have not received your refund yet, please contact us at info@sailor-sailor.com or 203-803-0488. Final Sale items We do not allow REFUNDS on FINAL SALE items. However items can be returned for a store credit or if available, an exchange. Exchanges We only replace items if they are defective or damaged. If you need to exchange an item for equal value or size,  complete the following form Click here for exchange/return form and send your item to: Two Kimberlys LLC/sailor-sailor 742A Kings Highway West Southport, CT 06890 Gifts If the item was marked as a gift when purchased and shipped directly to you, you’ll receive a gift credit for the value of your return. Once the returned item is received, a gift certificate will be emailed to you. If the item wasn’t marked as a gift when purchased, or the gift giver had the order shipped to themselves to give to you later, we will send a refund to the gift giver and they will find out about your return. Shipping at return back via mail To return your product, you should complete the following form Click here for return form and mail product to: sailor-sailor 742A Kings Hwy W Southport, CT. 06890 203.803.0488 If you are shipping an item over $75, you should consider using a trackable shipping service or purchasing shipping insurance. We don’t guarantee that we will receive your returned item. Free Shipping on all orders over $150 Made in the USA and designed by us in CT Sun Protective SPF 50+ to keep you cool Customer Care Contact Us Shipping and Returns About Us Gift Card Wholesale FAQ Care and Use STORE Locations Join our crew! Stay up to date with new collections, products and sales. Subscribe to Our Newsletter Email is invalid or already taken. © 2025, sailor-sailor Clothing . Powered by Shopify . American Express Apple Pay Discover Google Pay Mastercard PayPal Shop Pay Visa Close Close {\"themeColor\":\"#4044c6\",\"iconColor\":\"#4044c6\",\"showLogo\":false,\"topBottomPosition\":10,\"rightLeftPosition\":10,\"iconSize\":\"extra-small\",\"iconCustomSize\":50,\"position\":\"bottom-left\"}"
    },
    {
      "url": "https://www.rmg.co.uk/collections/objects/rmgc-object-12568",
      "text": "The Sailor's Return | Royal Museums Greenwich Skip to main content Become a member Donate Shop Venue hire Search Royal Museums Greenwich Main navigation Menu Royal Museums Greenwich Search Close Plan your visit Back Plan your visit Tickets and prices Getting here Accessibility Family visits Group visits School visits Cutty Sark Cutty Sark Open daily 10am-5pm Last entry 4.15pm Adult: £22 | Child: £11 Members go free Free National Maritime Museum National Maritime Museum Open daily 10am-5pm Last entry 4.15pm Free entry Booking recommended Free Queen's House Queen's House Open daily 10am-5pm Last entry 4.15pm Free entry Booking recommended Royal Observatory Royal Observatory Open daily 10am-6pm Last entry 5.15pm Adult: £24 | Child: £12 Members go free What's on Back What's on Exhibitions For families Member events Talks and tours Cutty Sark Events and festivals RNLI day at Cutty Sark Join us on board Cutty Sark for an exciting day of lifesaving demonstrations, activities and talks in collaboration with the RNLI Online Events and festivals ZWO Astronomy Photographer of the Year 2025 awards ceremony Who will be crowned ZWO Astronomy Photographer of the Year? Join us online at 7pm on Thursday 11 September to find out! National Maritime Museum Exhibitions Pirates Explore the myth, discover the truth: Pirates at the National Maritime Museum is now open Stories Back Stories Maritime history Space and astronomy Art and culture The ocean Time Royal history ZWO Astronomy Photographer of the Year 2025 winners The winning images in the world's biggest space photography competition have been revealed Cutty Sark’s new binnacle: charting a course for heritage crafts A navigational case shines a light on traditional skills – and prompts intriguing questions into the tea clipper’s history HMS Captain: Britain's forgotten maritime disaster The historian leading the search for HMS Captain questions why the sinking of 'one of the finest ships in the world' is not better known today. Collections Back Collections Conservation Research Donating items to our collection Collections Online Search our online database and explore our objects, paintings, archives and library collections from home The Prince Philip Maritime Collections Centre Come behind the scenes at our state-of-the-art conservation studio Caird Library Visit the world's largest maritime library and archive collection at the National Maritime Museum Learn Back Learn School trips and workshops Self-guided school visits Online resources and activities Booking an on-site schools session Booking a digital schools session Young people and youth groups Support us Back Support us Become a member Donate Corporate partnerships Become a patron Leave a legacy Commemoration and celebration Our sites Cutty Sark National Maritime Museum Queen's House Royal Observatory Become a member Donate Shop Venue hire Search Beta Back to Search Results + - The Sailor's Return An interior of a small cottage. The truckle bed, simple furnishing, flaking plaster and exposed red brickwork suggest rural simplicity and poverty. A basket hangs on a nail from a beam above the bed, with a rag dangling down. A young man has entered through the half-open door and faces towards the left. He wears the characteristic dress of a sailor; a blue jacket with brass buttons, a white shirt, red neckerchief and loose short-legged trousers which expose stockings and buckled shoes below. In his right hand he holds a tarpaulin hat full of coins, together with a stout stick or cudgel. His left hand is raised with the palm open towards a girl. seated on a low chair by a bed holding a sick older figure, though whether male or female is not clear. The girl wears a red skirt, white blouse, a mob cap with a blue ribbon and has a blue and white check shawl round her shoulders. A white drape hangs over the chair. With her right hand she holds the hand of the bed-ridden patient. The narrative implies it may be a parent, head bound, lying under the patterned blanket. The artist has used the body language of pose and gesture to convey a narrative. The sailor holds out his hatful of money towards the girl, the implication probably being that he went to sea to earn enough money for them to marry. He has now returned to show her that he has means to provide for her but, in a movement mimicking his, the girl's left arm is stretched out towards him with her palm held flat as a gesture of rejection. Despite her earlier promise, she is no longer free because of her duty to her sick parent. The painting also shows the emotional intensity of the moment in the exchange of glances between the three figures. The far end of the room is cast in shadow but a shaft of golden light through the window, falls on the girl and lightens the face of the boy. This underpins the moral message: even among the poor a sense of virtuous duty can outweigh desire. The artist was a tailor's son, who first trained at William Shipley's academy in London. Aged 15, he began winning drawing prizes from the Society of Artists and in 1763 probably travelled in Holland, Belgium, and France. He enrolled at the new Royal Academy schools in 1769 and by 1770 was elected a Fellow of the Society of Artists, becoming its Director in 1774. Wheatley's early work consisted mainly of interior decorative projects and of small-scale, full-length portraits and conversation pieces. Although he also produced some landscapes he concentrated more on effect than topographical accuracy. He fled to Dublin in 1779 to escape creditors and on his return to London in 1783, painted genre pictures, portraits, landscapes, and some history paintings. He also began working for the print publisher John Boydell. Many of the themes in engravings made after Wheatley are both sentimental and moralizing, such as the 'Cries of London' series which illustrates itinerant (usually female) street-vendors selling their wares. It was published between 1793 and 1797. Wheatley was elected RA in 1791 but his last years were plagued by gout and debts. In this painting, Wheatley is concerned with the psychological relationship between the subjects as well as domestic detail and costume. The work marks a shift from a Hogarthian concentration of genre in the cause of harsh moral social satire towards a gentler, sweeter style. Wheatley implies that a society which was uncomfortably aware of the sufferings of the rural poor, brought about by the agricultural revolution, sought compensating reassurance in depictions of an idealized pastoral life. At the end of the century genre painting of this sort became increasingly moralizing and didactic. It reflected the standards of a middle-class audience, which considereded that the lower classes should practise thrift and hard work and be concerned with duty, as this girl demonstrates. The picture is signed and dated 'F Wheatley 1786' along the bottom strut of the chair. Back to Search Results Buy a print License an image Share: Link copied to your clipboard! For more information about using images from our Collection, please contact RMG Images . Object Details ID: BHC1076 Collection: Fine art Type: Painting Display location: Not on display Creator: Wheatley, Francis Date made: 1786 Credit: National Maritime Museum, Greenwich, London, Caird Collection Measurements: Painting: 470 mm x 381 mm; Frame: 654 x 565 x 105 mm Loading filters Royal Museums Greenwich Close Search Want to search our collection? Search here. Our sites Cutty Sark National Maritime Museum Queen's House Royal Observatory About us What we do Contact us Jobs & volunteering Press office Sustainability Commercial services Brand licensing Image licensing Filming & photography Publishing Venue hire Legal Terms & Conditions Privacy Notice Accessibility Cookie Policy Follow us on Facebook Follow us on X Follow us on Instagram Follow us on Youtube Follow us on Weibo Sign up to our newsletter Back To Top"
    },
    {
      "url": "https://www.tenshon.com/blogs/news/the-sailors-return",
      "text": "The Sailor's Return - Tenshon Menu 0 Shop Our Shade Products Hexapavillion Structures Hip Shade Structures Umbrellas Replacement Tops Custom Shade Products Hardware Shade Sails Shade Panels Roman Shades Install Tools Learn General Info Planning Installation Tips & Tricks Blog Photos & Videos Photo Gallery Featured Project Videos Installation Time-lapse Videos Before & After Photos About Featured Projects Testimonials Fabric Design Engineering Manufacturing Become a Reseller Resources Contact Sign in Your Cart is Empty Sign in 0 0 Shop Our Shade Products Hexapavillion Structures Hip Shade Structures Umbrellas Replacement Tops Custom Shade Products Hardware Shade Sails Shade Panels Roman Shades Install Tools Learn General Info Planning Installation Tips & Tricks Blog Photos & Videos Photo Gallery Featured Project Videos Installation Time-lapse Videos Before & After Photos About Featured Projects Testimonials Fabric Design Engineering Manufacturing Become a Reseller Resources Contact Home Tenshon's Shade Industry Blog The Sailor's Return The Sailor's Return November 09, 2016 The Sailor’s Return restaurant in Stuart, Florida is a marriage of delicious cuisine and incredible ambience with a fantastic background story. Owner Bob Davis began working on cruise ships as a teenager and, over the course of more than two decades, made his way into restaurant management. When he retired from the cruise scene, he settled in Florida, where he met his wife, Tracy. Together, they opened the Jolly Sailor Pub & Restaurant that offered a British-style experience as a reflection of Davis’s hometown of Southampton. After 12 highly successful years, those doors closed and the Davises retired, but that didn’t last long. In 2007, entrepreneur Wayne Huizenga came to the Davises with the idea that he would build the Sunset Bay Marina & Anchorage, and they could own and run a restaurant thereon. The location was amazing and Bob was itching to do a little more than drive the town’s coach, so they jumped on the opportunity. For the second time, this English sailor returned to the hospitality business after short retirement. The appropriately named Sailor’s Return was built and opened right off of St. Lucie River, and offers marvelous views of the water and sunsets every night. Chef David van Stolk ensures consistently great food that ranges from American classics, a bit of British cuisine, and of course seafood. The unique ambience of Sailor’s Return provides a waterfront experience that doesn’t disappoint. The indoor seating is elegant and spacious, while the mild weather and romantic sunsets in the evening encourage diners to enjoy the fresh air of the abundant outdoor seating. An artistic canopy of shade sails provides shade during the day, and fits the nautical theme of the restaurant flawlessly. The blue poles and white shade sails match the sails of the boats docked in the marina, while fans and misters keep the area cool. In the evenings, lights on the center “mast”, shine on the sails for a modern look. Live music is performed on a raised portion of the deck under a single larger shade sail, Wednesday through Sunday. For the residents of Stuart, Florida, one sailor’s return has meant many great meals and nights of lively entertainment. The Davis’s restaurant has become a local favorite and surely a great place for any returning sailors to dine after a day on the water. For a closer look at the restaurant, take a virtual tour , both inside and out. To learn more about shade sails, check out our inventory of standard sails , or contact us for information about how you can work with one of our project managers in designing custom shade. Your restaurant or business can have a modern look that will make it stand out just as much as the maritime-themed and much loved Sailor’s Return. Sources: The Sailor's Return Stuart Magazine Share: Leave a comment Comments will be approved before showing up. Name * Email * Comment * Also in Tenshon's Shade Industry Blog Turning Scraps into Strength: Tenshon's Upcycled Bags Supporting Kenyan Communities August 19, 2025 Read More Designing with Custom Shade Sails: A Guide for Architects and Contractors July 09, 2025 Read More Shade Panels and Metal Dinosaurs at Desert Horizon Nursery May 03, 2017 Read More Follow Us Terms & Conditions Privacy Policy CONTACT US Tenshon 8743 E Pecos Rd, Ste 122 Mesa, Arizona 85212 (480) 663-3166 (480) 663-3237 fax info@tenshon.com © 2025 Tenshon ."
    }
  ]
}