{
  "fuentes": [
    {
      "url": "https://thestudioatmiznerpark.com/behind-the-scenes/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/tag/theatre/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/theater-layout/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/calendar/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/faqs/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://www.studiomyr.com/contact",
      "email": "info@studiomyr.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/events/ben-bankas/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/events/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://www.miznerpark.com/en/contact-us.html",
      "email": "mizneradmin@brookfieldproperties.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/contact-us/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://thestudioatmiznerpark.com/program/artnest-x-the-studio-springbreak-camps/",
      "email": "info@thestudioatmiznerpark.com"
    },
    {
      "url": "https://www.miznerpark.com/en/contact-us/",
      "email": "mizneradmin@brookfieldproperties.com"
    },
    {
      "url": "https://www.miznerpark.com/en/contact-us/",
      "email": "press@brookfieldproperties.com"
    }
  ],
  "mails": [
    "info@studiomyr.com",
    "info@thestudioatmiznerpark.com",
    "mizneradmin@brookfieldproperties.com",
    "press@brookfieldproperties.com"
  ],
  "nombre_sitio": "thestudioatmiznerpark.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://thestudioatmiznerpark.com/behind-the-scenes/",
      "text": "Behind The Scenes – The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets Behind The Scenes Peg Anderson, President of the Cultural Arts Association and Chairman of the Board This long awaited and much anticipated theater and event destination is poised to usher in a new\nera for Downtown Boca. The Studio at Mizner Park will bring a year ‘round calendar of fresh\nand diverse programming to the area.\n“We have come full circle, embracing the history of the venue as we look forward to an exciting,\ninviting future.” Andrea Kline Board Member Andrea is an artist by nature and a graduate of the prestigious Parsons School of Design.\n\nShe is a connoisseur, creator, and collector of contemporary art, jewelry, and post-modern furniture. Additionally, she is a lifelong patron of the performing arts and artists from the symphony to opera and ballet to Beyonce.  Andrea’s commitment to the community includes past service as a board member and officer of the Boca Raton Museum of Art. She currently serves on the Board of Directors of the Tri-County Animal Rescue. kenny greenblatt, Board Member tommy zeichman, Board Member Tommy Zeichman is a partner at Beighley, Myrick, Udell & Lynne, P.A. where his law practice focuses on commercial insolvency matters including related litigation and transactions. Tommy is a Palm Beach County native, resides in Boca Raton, and is the proud father of two daughters. As an active member of the community, Tommy serves as Chair for the FAU Alumni Board and previously served on Boca Raton’s Planning and Zoning Board. Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://thestudioatmiznerpark.com/tag/theatre/",
      "text": "theatre – The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets Tag: theatre Boca Raton Championship Wrestling! Come and see what the buzz is all about! Boca Raton Championship Wrestling is back! Featuring NWA World Heavyweight Champion, as featuered on Fox News hit show Gutfield, TYRUS. WWE Hall of Famer Brutus The “Barber Beefcake”. WWE Legend, The Vampire Warrior Gangrel. 7 foot giant Jack Talos. BRCW Champion LAKAY and many more of […] Boca Raton Championship Wrestling Come and see what the buzz is all about! Featuring NWA World Heavyweight Champion, as featuered on Fox News hit show Gutfield, TYRUS. WWE Hall of Famer Brutus The “Barber Beefcake”. WWE Legend, The Vampire Warrior Gangrel. 7 foot giant Jack Talos. BRCW Champion LAKAY and many more of your favorite wrestling stars seen on […] Disenchanted The Musical! Poisoned apples. Glass slippers. Who needs ’em?! Not Snow White and her posse of disenchanted princesses in the hilarious hit musical that’s anything but Grimm. The original storybook heroines are none-too-happy with the way they’ve been portrayed in today’s pop culture so they’ve tossed their tiaras and have come to life to set the record […] Sarge The Comedian! LAUGH UNTIL YOU CRY WITH SARGE ON HIS BIRTHDAY! NO GIFTS NECESSARY, JUST BRING A FRIEND THAT’S NEVER SEEN SARGE AND WATCH THEM PLOTZ ! He delights audiences with humor that resonates with audiences of all ages. And he is much more than a comedian – – Sarge is a self-taught piano savant, an author […] The Rock and Roll Playhouse Plays Music of Greatful Dead feat. Crazy Fingers! Founded in 2014 by independent concert promoter Peter Shapiro and educator Amy Striem, The Rock and Roll Playhouse is the largest national kid-friendly live concert series having performed to hundreds of thousands of kids and their families. It has hosted over 1,000 shows in more than 35 leading live music venues across the United States, […] The Very Hungry Caterpillar Show -The #1 Children’s Show in the U.S! The Very Hungry Caterpillar Show is created and produced by Rockefeller Productions – a subdivision of Rockefeller Studios, founded by Jonathan Rockefeller. Founded in 2015 with the U.S. launch of The Very Hungry Caterpillar Show(Drama Desk nominee, New York Times Critics’ Pick), Rockefeller Studios began to proudly partner with the most recognizable and beloved brands […] Gary Puckett and the Union Gap Band Gary Puckett & The Union Gap (initially credited as The Union Gap featuring Gary Puckett) was an American pop rock group active in the late 1960s. The group, formed by Gary Puckett, Gary “Mutha” Withem, Dwight Bement, Kerry Chater and Paul Wheatbread, who eventually named it The Union Gap, had its biggest hits with “Woman, […] Comedian and Impressionist Matt Friend! On Sale Now! Friday and Saturday September 8-9, 2023 Tickets $32.50++ Matthew Friend is an old soul living inside a 24-year-old comedian/actor/impressionist’s body. Matthew graduated from NYU’s Gallatin School in 2020, but his love of comedy and entertainment was sparked when he was four years old. He had watched Austin Powers (yes, as a four-year-old) and started mimicking the […] The Rock and Roll Playhouse Plays Music of Ed Sheeran Feat. Jesse Young Band Founded in 2014 by independent concert promoter Peter Shapiro and educator Amy Striem, The Rock and Roll Playhouse is the largest national kid-friendly live concert series having performed to hundreds of thousands of kids and their families. It has hosted over 1,000 shows in more than 35 leading live music venues across the United States, […] Sarge The Comedian! LAUGH UNTIL YOU CRY WITH SARGE ON HIS BIRTHDAY! NO GIFTS NECESSARY, JUST BRING A FRIEND THAT’S NEVER SEEN SARGE AND WATCH THEM PLOTZ ! He delights audiences with humor that resonates with audiences of all ages. And he is much more than a comedian – – Sarge is a self-taught piano savant, an author […] Next → Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://thestudioatmiznerpark.com/theater-layout/",
      "text": "Theater Layout – The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets Theater Layout Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://thestudioatmiznerpark.com/calendar/",
      "text": "Calendar – The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets Calendar August September 2025 October SU MO TU WE TH FR SA 31 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 1 2 3 4 Events August 31, 2025 Boca Raton Championship Wrestling The Studio, Mizner Park Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://thestudioatmiznerpark.com/",
      "text": "The Studio Theatre at Mizner Park – Music. Comedy. Entertainment. Downtown Boca's Premiere Live Entertainment Venue! Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets AWARD-WINNING entertainment IN Boca Raton Boca Raton’s premier entertainment destination is at the South End of Mizner Park. The Studio brings award-winning live theater, musicals, concerts, programming and expansive event space to Downtown. A 335-seat black box theater, 4,500 square foot event space and a gallery with full bar and entertainment, the possibilities are endless. What's Going On Oct 18, 2025 Comedian — Andy Huggins — One-Night-Only! The Studio, Mizner Park Boca Raton, Florida BUY TICKETS Jan 13 - 17, 2026 BIJOUX! Contemporary Jewelry Exhibition & Sale The Studio, Mizner Park Boca Raton, Florida BUY TICKETS Mar 20 - 21, 2026 The Bronx Wanderers 2026 The Studio, Mizner Park Boca Raton, Florida BUY TICKETS VIEW CALENDAR Our story There’s no place like this in Boca Raton. Rich in local history, The Studio brings together local and nationally recognized artists, performers, comedians, musicians and shows. The Studio is also a perfect place for you. With three different rooms to entertain and imagine, live shows, weddings, corporate parties, soirées, business meetings and more are possible. Take a look at what The Studio has to offer and who’s running the show behind the scenes. The Studio operates under the Mizner Park Cultural Arts Association, a 501(c)(3) nonprofit organization dedicated to enriching the community through the arts. Behind The curtain About Us Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://thestudioatmiznerpark.com/faqs/",
      "text": "FAQs – The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets FAQs If you cannot find an answer you need below, please email us: info@thestudioatmiznerpark.com General Information What is The Studio at Mizner Park? The Studio at Mizner Park is an intimate live performance venue located in the heart of Downtown Boca Raton, Florida, hosting a variety of events, including concerts, comedy shows, and private gatherings. Where is The Studio at Mizner Park located? We are located in Downtown Boca — Mizner Park (above Eddie V’s) Address: 201 Plaza Real, Boca Raton, FL 33432 [ Map ] What are the Box Office Hours? Monday – Friday — 10am – 2pm Box Office also opens 2 hours before show time. What is our Phone Number? (954) 910-5826 (please leave a voicemail or email info@thestudioatmiznerpark.com ) What are the Age Restrictions? For an all-ages show, guests of all ages are welcome with an admission ticket. Children age 12 and under must be accompanied by an adult. Age restricted shows will be notated when purchasing tickets. Please review or inquire about any age restrictions prior to purchasing tickets. Parking & Transportation Where can I park for events at The Studio? There is parking available in the Mizner Park parking garages, located within walking distance of the venue. The closest parking garage is in the IPIC Theaters building, Garage B [ Map ] Is valet parking available? Yes, valet parking is available at Mizner Park for $20 per vehicle. What is the closest Brightline Train Station? Please use the Boca Raton Station . We are an 8 minute walk from the station. Are there rideshare or drop-off points? Rideshare (Uber/Lyft/Taxi) and drop-off points are conveniently located near the main entrance of Mizner Park. Dining & Pre-Event Options Where can I eat before or after the show? Mizner Park features several dining options, including fine dining, casual restaurants, and quick bites. Please visit the Mizner Park Directory for dining options — https://www.miznerpark.com/en/directory/ Can I bring food or drinks into the venue? Outside food and beverages are not allowed inside The Studio. However, concessions are available during most events. Does The Studio have bar? Yes, our full liquor bar opens at door time and remains open throughout the show. Accessibility Is The Studio wheelchair accessible? The Studio is fully accessible, with ADA seating and restrooms available. How do I request accessible seating? Accessible seating can be requested at the time of ticket purchase or by contacting the venue directly. If you need assistance, please call (561) 203-3742 or email info@thestudioatmiznerpark.com Tickets & Entry How can I purchase tickets for events? Tickets can be purchased online through our website , at Ticketmaster.com , at the box office, or by calling our box office at (561) 203-3742. For Group Sales, please email info@thestudioatmiznerpark.com Please note: We cannot guarantee that tickets purchased on third party ticket sites such as Stubhub, VividSeats, EventTickets.com, etc. are legitimate. What time do doors open for events? Doors typically open one hour before the show starts. Please check your event details for specific times. Can I transfer or refund my tickets? Tickets are generally non-refundable, but can be transferred. For more information, check the refund policy for your specific event. To transfer your tickets to a friend, please visit your Ticketmaster account and select “Transfer Tickets.” Venue Policies What items are prohibited inside The Studio? Prohibited items include weapons, large bags, outside food and drink, professional cameras, and recording devices. Is there a dress code? While there is no formal dress code, guests are encouraged to dress appropriately for the event. Additional Information Can I host a private event at The Studio? Yes! The Studio is available for private rentals. Contact us for more details and availability. How do I stay informed about upcoming events? Join our email list or follow us on social media ( Facebook / Instagram ) for the latest announcements and updates. Is The Studio at nonprofit organization? Yes, The Studio at Mizner Park is a 501(c)(3) nonprofit corporation, is governed by a board of directors . What is the theater capacity? Our black box theater has a capacity of 300 seats. We also have a 4,500 square foot event space and a gallery with full service bar where the possibilities are endless Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://www.studiomyr.com/contact",
      "text": "CONTACT | Connect with Us — Studio Myr Skip to Content Open Menu Close Menu SHOP ABOUT CONTACT 0 0 Open Menu Close Menu SHOP ABOUT CONTACT 0 0 SHOP ABOUT CONTACT Contact STUDIO MYR Boutique Holstraat 15 6017AC Thorn Opening hours: Tuesday - Sunday 11.00 - 17.00 hour or by appointment Closed on Monday E info@studiomyr.com M +31(0)6 21 25 62 93 Name * First Name Last Name Email * Subject * Message * Thank you so much for contacting us. We will come back to you in a short while. In the meantime, have a wonderful day! Kindest greetings, Miriam Lenarts - director/designer Studio Myr ABOUT About Exposure Blog Sustainability Pricing Reviews to the webshop SERVICE Contact International Size Card FAQ Payment Return and Refund Policy Shipping Privacy Statement Terms and Conditions Opening Hours Boutique Subscribe to our newsletter Be the first to hear about new collections and events Email Address Sign Up We respect your privacy Thank you! ©2023 Studio Myr | Sustainable Luxury Knitwear | Designed by Miriam Lenarts - Studio Myr | Ethically made in The Netherlands"
    },
    {
      "url": "https://thestudioatmiznerpark.com/events/ben-bankas/",
      "text": "Ben Bankas — One Night Only! – The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets Ben Bankas — One Night Only! BEN BANKAS LIVE 📍 Show Date: Saturday, August 9th, 2025 ⏰ Doors: 6:30pm | Show: 7:30pm 🎟 Tickets On Sale Now! 🎤 About Ben Bankas — Ben Bankas is one of the most fearless, unapologetic comedians on the scene today, known for his edgy humor, razor-sharp wit, and viral comedy takes. His ability to push boundaries while making audiences burst into laughter has gained him a dedicated following across social media, podcasts, and live stand-up shows nationwide. With a unique perspective on life, culture, and current events, Ben’s stand-up is raw, unfiltered, and absolutely hilarious. Whether you’ve seen his viral clips or heard his no-holds-barred takes online, now’s your chance to witness Ben Bankas LIVE for one night only in Boca Raton! Buckle up, Boca! This is one show you don’t want to miss! Special Notes: This show contains mature content and is recommended for audiences 18+. Tickets are on sale now—grab yours before they’re gone! The event is finished. Tags: Ben Bankas Boca Raton , Ben Bankas Tickets , Ben Bankas Tickets South Florida Date Aug 09 2025 Expired! More Info BUY TICKETS Location The Studio, Mizner Park Boca Raton, Florida Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://thestudioatmiznerpark.com/events/",
      "text": "Events - The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets Events Select Month January February March April May June July August September October November December Select Year 2025 2026 Yearly Monthly Weekly Daily List October 2025 Comedian — Andy Huggins — One-Night-Only! COMEDIAN ANDY HUGGINS LIVE IN BOCA! ANDY HUGGINS — 👑 KING OF ONE-LINERS IN BOCA FOR ONE-NIGHT-ONLY! Boca, are you ready to laugh? Comedy legend Andy Huggins (America’s Got Talent, TikTok, Texas Outlaw Comics) is coming to The Studio at Mizner Park for one night only — Saturday, October 18 at 7:30pm. This intimate show […] 18 Oct The Studio, Mizner Park Boca Raton, Florida BUY TICKETS January 2026 BIJOUX! Contemporary Jewelry Exhibition & Sale The Studio at Mizner Park presents BIJOUX! Contemporary Jewelry Exhibition and Sale taking place Tuesday, January 13 through Saturday, January 17, 2026. Artists from around the world, including Israel, Italy, the Netherlands, and Argentina, will present jewelry for visitors to explore, try on, and purchase. BIJOUX! is not just about jewelry – it’s about culture, […] 13 - 17 Jan 9:00 am - 6:00 pm The Studio, Mizner Park Boca Raton, Florida BUY TICKETS March 2026 The Bronx Wanderers 2026 🎶 The Bronx Wanderers – Back in Boca! 🎶 They’ve played sold-out shows across the country, from Las Vegas to Broadway, and now The Bronx Wanderers return to Boca Raton for three unforgettable performances! Get ready for a night of timeless hits, high-energy rock n’ roll, and that signature Bronx charm. From Frankie Valli and […] 20 - 21 Mar The Studio, Mizner Park Boca Raton, Florida BUY TICKETS No event found! Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://www.miznerpark.com/en/contact-us.html",
      "text": "Mizner Park - Shopping Mall in Boca Raton, FL Skip to main content Age Restriction Element/Icons/20px/Arrow Up Stores Map News & Events Movies Opens in new window Hours & Info Stores Map News & Events Hours & Info Stores & Restaurants See All Stores & Restaurants About Mizner Park Opens in new window Lease space with us Mizner Park has available spaces for lease. Join our esteemed group of retailers and take advantage of our prime location to showcase your brand to a diverse and engaged audience. Discover our featured leasing opportunities in Boca Raton. Learn more Opens in new window Shopping in Boca Raton Discover a luxury landmark at Mizner Park, located in beautiful Boca Raton. No trip to this picturesque place is complete without a visit to this retail property, which offers unparalleled retail stores set in a perfectly landscaped, park-like environment. Come for the shopping, stay for dinner and a movie at the onsite cinema. Plan your visit FAQs Get the answers to frequently asked questions. Find out more Hours and property info Looking for our address or hours? Searching for answers to commonly asked questions? Learn more View map and directory See all the stores and restaurants Mizner Park has to offer. Explore Now Hours and property info Looking for our address or hours? Searching for answers to commonly asked questions? en Facebook page Facebook page 327 Plaza Real Suite 315, Boca Raton, FL 33432 (561) 362-0606 Contact us Jobs Feedback LPR FAQ Code of conduct Terms Opens in new window Privacy Policy Opens in new window Your Privacy Choices Opens in new window Cookie Settings Accessibility Opens in new window Leasing Opens in new window Advertising Opens in new window About us Opens in new window ©2018-2025 BROOKFIELD PROPERTIES RETAIL INC. ALL RIGHTS RESERVED"
    },
    {
      "url": "https://thestudioatmiznerpark.com/contact-us/",
      "text": "Contact Us – The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets Email Us Name (Required) First Last Email (Required) Subject (Required) Message (Required) Contact Us Need help or have questions? Please get in touch below. Address: 201 Plaza Real, Boca Raton, FL, 33432 Email: info@thestudioatmiznerpark.com Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://thestudioatmiznerpark.com/program/artnest-x-the-studio-springbreak-camps/",
      "text": "ArtNEST x The Studio: Summer Camp! – The Studio Theatre at Mizner Park Skip to content About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets About Event Calendar CLASSES AND CAMPS ArtNEST x The Studio: Summer Camp! Venue Information FAQs Buy Tickets ArtNEST x The Studio: Summer Camp! Come Get Messy in Mizner! June to August 2025 9am to 1pm Summer Art Camp at The Studio at Mizner Park! June through August 9-1pm Snacks Included, Parents Pack a Nut-Free Lunch Join us for an unforgettable camp of artistic exploration at The Studio! This unique art camp is designed to let kids creativity run wild! Get ready to embrace vibrant colors, painting, creative crafts and more. We provide the materials and the kids provide the creative process! No refund, exchanges or credits Location: The Studio at Mizner Park: 201 W Plaza Real, 2nd FL, Boca Raton Dates and Booking Links: june 2-6: https://artnestdelray.as.me/?appointmentType=76452729 june 9-13: https://artnestdelray.as.me/?appointmentType=76452876 june 30 – july 3: https://artnestdelray.as.me/?appointmentType=79788338 july 14-18: https://artnestdelray.as.me/?appointmentType=76452954 July 21-25: https://artnestdelray.as.me/?appointmentType=76453034 july 28-aug 1: https://artnestdelray.as.me/?appointmentType=76453093 aug 4-8: https://artnestdelray.as.me/?appointmentType=76453148 Summer Camps! Be the first to know about special events and shows. Subscribe to our mailing list. The Theater Download Theater Layout Calendar Of Events Contact Us Get In Touch 201 Plaza Real, Boca Raton, FL, 33432 info@thestudioatmiznerpark.com 954-910-5826 VIEW MAP Follow Us Facebook Instagram ©2025 The Studio at Mizner Park, All Rights Reserved. Be the first to know about special events and shows. Subscribe to our mailing list."
    },
    {
      "url": "https://www.miznerpark.com/en/contact-us/",
      "text": "Mizner Park Skip to main content Age Restriction Element/Icons/20px/Arrow Up Stores Map News & Events Movies Opens in new window Hours & Info Stores Map News & Events Hours & Info Contact Us Let us know how we can help We’re here to ensure that you have the best shopping experience possible. Please contact us if we can help you in any way - simply call or complete the form below and we’ll get back with you as soon as possible. Advertising Explore our various advertising opportunities. Call for information We’re only a quick dial away. Give us a call and we’ll do our best to answer any question that you may have. (561) 362-0606 Lease with us Mizner Park has available spaces for lease. Join our esteemed group of retailers and take advantage of our prime location to showcase your brand to a diverse and engaged audience. Discover our featured leasing and advertising opportunities and become part of Brookfield Properties group of retailers in Boca Raton, FL. Media inquiries If you are a member of the media, you can contact our public relations relation team at PRESS@BROOKFIELDPROPERTIES.COM . A response will be provided as quickly as possible. Please understand that media information is listed for the sole purpose of providing assistance to members of the press. How can we help? Retail Mall Contact Us Form First name * Last name * Email address * Comment * Facebook page Facebook page 327 Plaza Real Suite 315, Boca Raton, FL 33432 (561) 362-0606 Contact us Jobs Feedback LPR FAQ Code of conduct Terms Opens in new window Privacy Policy Opens in new window Your Privacy Choices Opens in new window Cookie Settings Accessibility Opens in new window Leasing Opens in new window Advertising Opens in new window About us Opens in new window ©2018-2025 BROOKFIELD PROPERTIES RETAIL INC. ALL RIGHTS RESERVED"
    }
  ]
}